{"id": 262821, "slug": "dino-train-match-up-game", "name": "Dino Train Match Up Game", "name_original": "Dino Train Match Up Game", "description": "Toot!  Roar!  Do you have a little train lover that also digs dinosaurs?  Then chug-a-chug-a-choo-choo back into a jurassic world for some rootin' tootin’ dino fun in the dinosaur train games matchup race! Your little conductor will have a dino-rrific time playing with dinosaurs aboard trains in this cute and cool timed matching game.<br/><br/>The dino train games free is a timed three round matching game, featuring 12 different dinosaurs in trains and a dinosaur egg too. The first round is 120 seconds and each after that is 10 seconds less, so your little one can improve and get faster each round. <br/> <br/>Another fantastic feature to the Dino Train Game that makes it even more fun then just matching- your little conductor must find the icons that link for their match choices!  And when they do make a linked match the dino train kids game shows them the link. This important element, and the matching itself, provides a real educational bonus and playing also promotes:<br/>- Fine motor skills.<br/>- Memory and recognition skills.<br/>- Hand eye coordination.<br/>- Early math concepts.<br/>- Color recognition<br/><br/>More features:<br/>- 2 player versus mode<br/>- 4 different type of match board table with 48 items (gems, fruits, dinos and animals)<br/>- Race mode with train timer<br/>- Relax mode<br/><br/>And to add even more fun to the train kid games … a real train sound!  When your little one starts the game they will hear a train engine sound AND a train horn toot!  Then happy dappy music will play throughout the train game free for toddlers to keep them hoppin and boppin’.<br/>Click matching icons to clear them from the board before time's up. You must pick matching pairs that are the same.  When you find a match pairs will disappear.<br/>Hop on board the fun train and go back in time to have a blast playing with dinosaurs in the dinosaur train games Match up race!", "metacritic": null, "released": "2015-11-30", "tba": false, "updated": "2019-10-22T14:01:13", "background_image": "https://media.rawg.io/media/screenshots/4a1/4a1d9ff0022dffe476aa242751fdb00b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Istvan Bodai"], "genres": ["Family", "Puzzle"], "publishers": ["Istvan Bodai"], "esrb_rating": "Everyone 10+"}