{"id": 262863, "slug": "heart-crush", "name": "Heart Crush", "name_original": "Heart Crush", "description": "The best therapy APP! Enjoy the invigorating feeling of breaking hearts!<br/>Move your fingers to crush the glass hearts!<br/>Let your mood scatter with the broken pieces to a melodious and comfortable place!<br/>Let your boredom disappear into the endless shattered dust clouds!<br/><br/>【How to play】<br/>1. Select a glass heart on the screen and slide left or right to swap with an adjacent heart.<br/>2.After swapping, if there are three or more hearts of the same color side by side in the same column or row, the hearts will break.<br/>3. After the heartbreak more random colored glass hearts will fall from above filling up the screen.<br/><br/>【Breaking the Links】<br/>4. When the glass hearts fall, if three or more hearts of the same color fall in a row or column it will form a chain.<br/>5. When five or more hearts of the same color are broken while connected, all other hearts of the same color will break as well.<br/>6. If you don't reach your goal before the chain stops, you can play again at the end of the game.<br/><br/>【Achieve your goal to keep playing!】<br/>7. When the glass hearts break, according to the speed and the number of hearts broken, golden waves will rise up in the background.<br/>8. When the gold waves reach the top of the screen, it means you've achieved your goal and can continue sliding the glass hearts a second time.<br/>9. If you can achieve your goal a second time, you can play a third time and so on, until you can't play anymore.<br/>10. At the end of the game, your score will be automatically uploaded to the rankings so other players from around the world can see who can break the most glass hearts.", "metacritic": null, "released": "2014-04-14", "tba": false, "updated": "2019-10-22T13:52:27", "background_image": "https://media.rawg.io/media/screenshots/9a4/9a40b5f509cf696685535b6314d7efe7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nieo Tech Co"], "genres": ["Family"], "publishers": ["Nieo Tech Co"], "esrb_rating": "Everyone 10+"}