{"id": 262966, "slug": "epic-seven", "name": "Epic Seven", "name_original": "Epic Seven", "description": "------------------------------------------------------<br/><br/>Characters You Can't Stop Thinking About<br/>With personality and charm you can only find in 2D, meet the characters of Epic Seven that are so lovable you'll even be thinking about them in your sleep!<br/><br/>Become Captivated by the Story<br/>Be captivated until the very end by Epic Seven's engaging and immersive storyline and original animated scenes that will keep your eyes glued to the screen.<br/><br/>A Refreshing Mobile Experience<br/>With a sense of adventure that's been lost in most recent mobile games, dive into a journey through an unknown world! No more endless mind-numbing RPG battles!<br/><br/>The Highest Quality but Still Easy to Play<br/>Play through Epic Seven with practically no loading times in the highest quality, and with an interface that keeps things simple and allows you pick up or put down the game at any time.<br/><br/>Exhilarating Graphics<br/>An engrossing and strategic world filled with endless possibilities. Spectacular eye candy that will keep your brain stimulated. All wrapped in one package to bring you the best experience a mobile game can offer.<br/><br/><br/>※ Supported on Android 6.0 and above. Not supported on Galaxy S4 and under.<br/>※ Epic Seven is available in English, Korean, and Chinese (Traditional).<br/><br/><br/>▒▒ Official Community Websites ▒▒<br/><br/>STOVE<br/>http://page.onstove.com/epicseven/global<br/><br/>Facebook<br/>https://www.facebook.com/EpicSevenGlobal<br/><br/>YouTube<br/>https://www.youtube.com/channel/UCa1C3tWzsn4FFRR7t3LqU5w<br/><br/>Instagram<br/>https://www.instagram.com/epicseven_global<br/><br/>------------------------------------------------------<br/>[Configuring Permissions]<br/><br/>- Photos, Media, and Files: In order to save game data, you must allow access to device storage.<br/><br/>* Epic Seven has been developed to run on Android 6.0 and above with selective app permissions. If you're using a device with an Android version under 6.0, contact your device's customer support to see if they offer upgrades to your operating system. After upgrading you may want to manage the selective app permissions, which you can do from your device's settings menu.<br/><br/>[Manage and Revoke Permissions]<br/><br/>- Android 6.0 and above: Device Settings &gt; Apps &gt; Choose App &gt; App Settings &gt; Permissions<br/>- Android 6.0 and under: Revoke permissions by deleting the app", "metacritic": null, "released": "2018-11-03", "tba": false, "updated": "2023-04-29T14:28:21", "background_image": "https://media.rawg.io/media/screenshots/a01/a01abf974a8ec39a8bfda9d4c510159b.jpeg", "website": "https://epic7.smilegatemegaport.com/world", "rating": 3.33, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 2, "toplay": 1, "dropped": 8, "playing": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 9, "platforms": ["Android", "iOS"], "developers": ["Smilegate Entertainment"], "genres": ["RPG"], "publishers": ["Smilegate Megaport"], "esrb_rating": null}