{"id": 262962, "slug": "operation-pig", "name": "Operation Pig", "name_original": "Operation Pig", "description": "<p>\n      You are Special Agent Wood and you have worked in the most dangerous \n      missions. You have saved your country hundreds of times. You have been \n      decorated for your courage on several occasions, and over the years, you \n      have become the most feared agent. But now you must be ready for what \n      will be the most dangerous mission that you have faced. The president \n      needs you for a last job that has been called: OPERATION PIG.\n    </p><p>\n      Your mission is to safeguard the integrity of Ramón, the president's \n      pig, but it will not be easy. Ramón is a pig that likes to travel in \n      search of rich acorns and mud where to reborez. You are the most \n      qualified and experienced agent, but it will not be an easy task. The \n      evil enemies of the president have learned of Ramón's existence, and \n      will do everything possible to seek and destroy him. Now, put on your \n      sunglasses, grease the arsenal and get ready for a crazy adventure with \n      the pinkest and fattest pig in the world.\n    </p><p>\n      Operation Pig is a pure Arcade where you will have to test your skills \n      to prevent Ramon pig from being destroyed by the enemy hordes. Travel a \n      total of 40 frantic levels full of dangers and prevent the pig succumbs \n      to enemy attacks. Collect all kinds of weapons and upgrades to defend \n      yourself and get through levels full of dangers and traps.\n    </p><p>\n      Get ready for a game that you can not stop playing until you finish it. \n      If you are a lover of the eighties challenges and have spent hours \n      playing in the Arcades of your neighborhood, Operation Pig will make you \n      relive those years. What are you waiting for? Are you ready to show your \n      friends that you are a true special agent?\n    </p>", "metacritic": null, "released": "2018-11-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": [], "genres": [], "publishers": ["Vikalb"], "esrb_rating": null}