{"id": 263, "slug": "last-planets", "name": "Last Planets", "name_original": "Last Planets", "description": "Enter a vast universe of endless possibilities! In Last Planets you have your very own planet to protect, and a huge universe to explore. Make new Friends, find Allies and Join other players in realtime to complete events!<br/>Download Now and join the Last Planets Universe!<br/><br/>FEATURES<br/>• Develop your very own planet<br/>• Make new friends and explore a persistent, vast, living universe that has all players in one unified world<br/>• Join dynamic co-operative events all over the universe<br/>• Engage in Real Time Strategy combat<br/>• Build and develop a powerful Alliance, filled with stations to offer you boosts<br/>• Raid together with up to 50 Alliance members in real time<br/>• Help your Alliance defenses against enemy raiders by healing them in real time to stop the attackers at their tracks<br/>• Take 6 Unique troop types into battle<br/>• Search the universe for Unique Collectible Relics<br/><br/>Last Planets supports iPad 3 or iPhone 5 and newer devices.<br/><br/>Support<br/>If you are having trouble, you can reach our support at:<br/>http://vulpinegames.com/support.html<br/><br/>PLEASE NOTE! Last Planets is free to download and play, however, some game items can also be purchased for real money. If you don&amp;#39;t want to use this feature, please disable in-app purchases in your device&amp;#39;s settings.", "metacritic": null, "released": "2017-02-23", "tba": false, "updated": "2019-10-22T14:27:26", "background_image": "https://media.rawg.io/media/screenshots/bba/bbad6cce72a59f7a258168b858c2fe13.jpeg", "website": "http://www.lastplanets.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Vulpine Games"], "genres": ["Action", "Strategy"], "publishers": ["Vulpine Games Oy"], "esrb_rating": "Teen"}