{"id": 263055, "slug": "maxolotls-big-adventure", "name": "Maxolotl's Big Adventure!", "name_original": "Maxolotl's Big Adventure!", "description": "<p>Join Maxolotl as he embarks on his first adventure outside of the tank!</p>\n<p><strong>STORY</strong><br/></p>\n<p>Maxolotl was just a simple Axolotl living a simple life in the simplest world he knew - his tank.  One day his owner accidentally knocked a can over, spilling some U Energy into Maxolotl's tank! Overnight, Maxolotl experienced some extreme changes - all of a sudden he was able to think some pretty profound thoughts, and his body had changed - allowing him to walk on 2 legs and swing his arms around! After escaping the tank that he now realized had kept him prisoner for so long he decided to take advantage of his strange surroundings, going on a big adventure to some unknown places!</p>\n<p><strong>FEATURES</strong><br/></p>\n<ul><li>A 3D platformer, taking inspiration from the originals</li><li>2 levels and a boss fight</li><li>A training level to hone your skills!</li><li>Fun mechanics offering different ways of solving puzzles</li><li>Controller support! (It's best played on one!)</li><li>Easy to run - A simplistic art style offers an experience even the lowest spec PC's can enjoy</li></ul>\n\n\n<p>-PLEASE NOTE: We are putting this out slightly early, in order to get some analytics for a research paper that is involved with the project this is made for. Some small, quality of life updates will be made over the next couple of days/weeks. PLEASE please please leave some comments about the game in order to help us with the paper. </p>\n<p>- This game was made in 4 weeks as a project for a college class, leaving feedback is hugely appreciated and helpful for us! </p>", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/498/49836c9203ca2dbd6fc0dcfa679da655.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kiarac", "Ripster", "Mashuun"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}