{"id": 263070, "slug": "u3172461-kayla-sweet-prototypes", "name": "u3172461- Kayla Sweet Prototypes", "name_original": "u3172461- Kayla Sweet Prototypes", "description": "<p><strong>Experimental Game Design 2018</strong></p><p><em><strong>Challenge 1 Changing Season</strong></em>: Changing Season is a visual sensation created in processing. Using the left mouse button, you can click though the growth of a tree. Install the Processing software, download my file. To play left click in the scene to grow the tree.</p><p><strong><em>Challenge 2 Space</em></strong>: Space Clicker is a recreate of Flappy birds in a space themed environment and the additional complexity of hazards. This game is created for an Android device.</p><p><strong><em>Challenge 3 Revenge Racer</em></strong>: Cat vs Dog is a multiplayer PC game. Where the players have to race against the time to collect as many stars as they can and destroy the other player. </p><p><em>Challenge 4 Embodied interaction tangible media</em>: Embodied visual interaction is an artistic approach to the challenge. Creating a user embodied interaction in Touchdesigner and using a webcam to capture the scene then projecting the out put onto a wall. This Challenge was focused on creating an integration that could be used at Crea8. The user would walk past the webcam and see the effects on the wall, which would encourage them to stop and interact with the visual effects that would play out in front of them.<br/></p>\n<p>To run this Challenge, you will need to download Derivative Touchdesginer then download my file and run the output to a projection or just set up a webcam and see it on your computer screen. \r\n</p>", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c45/c45470124df0b1859ba4741f16c237d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Experimental Game Design"], "genres": [], "publishers": [], "esrb_rating": null}