{"id": 26301, "slug": "lovely-lisa-friends", "name": "Lovely Lisa & Friends", "name_original": "Lovely Lisa & Friends", "description": "<p>\n      Lovely Lisa helps younger girls learn the importance of having fun and \n      working hard while earning your way to your own fashion style! Earn \n      Lisa-points by perfecting your beauty skills and techniques, helping out \n      around the house and even learning what it takes to become a successful \n      career girl! Providing a well-rounded approach to beauty and fashion, \n      Lovely Lisa rewards girls with gorgeous accessories, original clothes \n      and fabulous hairstyles and make-up! Prove you’ve got what it takes in \n      the Heart Hills pageant-with-a-difference! Only the girl with the best \n      skills in all categories can win – because after all, beauty is only \n      skin deep!\n    </p><p>\n      Features\n    </p><p>\n      • Fashion Sense: Polish nails and add your own touch with sparkly \n      accessories, apply make-up and coordinate with the perfect hair style!<br/>• \n      Design and customize! Use the Nintendo DSi Camera to snap shots and \n      customize Lisa’s outfits!<br/>• Mini-games: Dance your socks off in \n      the idol game or learn to play the piano<br/>• Family values: Help mom \n      with shopping and cooking or even help dad to put furniture together!<br/>• \n      Learn valuable career skills: From babysitting and cake decorating to \n      nursing or even practicing to be a flight attendant!\n    </p>", "metacritic": null, "released": "2010-02-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bee/beed54b8ae864c25058c7d10261605e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Tomy"], "esrb_rating": null}