{"id": 26324, "slug": "infinite-space", "name": "Infinite Space", "name_original": "Infinite Space", "description": "<p>Created exclusively for the Nintendo DS, this elaborate sci-fi RPG<br />\nimmerses you in a dynamic, colorful universe on the verge of war. Play<br />\nas young Yuri and command a fleet of spaceships and battle against<br />\ntyrannical dictators and deadly space pirates while searching for a<br />\nmystical epitaph known to have the power to change the world.<br />\nThe<br />\ntalented creators at PlatinumGames and Nude Maker have collaborated once<br />\nagain, this time on Infinite Space, an elaborate sci-fi RPG with an<br />\nengaging battle system requiring both speed and strategy. This latest<br />\nspace adventure promises high quality and intricate depth in over 70<br />\nhours of gameplay. Created exclusively for the Nintendo DS, the saga<br />\nimmerses you in a dynamic, colorful universe on the verge of war. Play<br />\nas young Yuri and command a fleet of spaceships and battle against<br />\ntyrannical dictators and deadly space pirates while searching for a<br />\nmystical epitaph known to have the power to change the world. As the<br />\nstory unfolds, Yuri grows into a man powerful enough to prevent another<br />\nwar and possibly, universal annihilation.</p>\n<p>Features</p>\n<p>• Extensive customization: Players create and customize a<br />\nfleet of up to five spaceships with over 100 spaceship blueprints and<br />\nover 200 modules to choose from. Changing the crew and spaceship<br />\nattributes directly affects the impact of the fleet.<br />\n•<br />\nUnique tactical battle system: Decisions must be made quickly in the<br />\ndramatic, action-filled battles, or enemies will get the upper hand.<br />\n•<br />\nTwo gameplay modes: Players compete wirelessly in 2-player versus mode<br />\nor travel through the expansive universe on a solo quest.<br />\n•<br />\nVast storyline: In this epic journey that spans Yuri’s lifetime from<br />\nchild to adult, players encounter over 100 unique characters in over 70<br />\nhours of gameplay.<br />\n• Retro graphics: In a nod to classic<br />\nJapanese sci-fi anime, the game features spaceships and Japanese anime<br />\ncharacters with a 1980s vibe</p>", "metacritic": null, "released": "2010-03-16", "tba": false, "updated": "2019-09-12T06:37:03", "background_image": "https://media.rawg.io/media/screenshots/523/52395b91f9fca467f4efd378c49d8dd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 5, "beaten": 3, "toplay": 4, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 3, "platforms": ["Nintendo DS"], "developers": ["Platinum Games", "Nude Maker Co", "Inbound Games"], "genres": ["RPG", "Simulation"], "publishers": ["SEGA"], "esrb_rating": "Teen"}