{"id": 263282, "slug": "avenge-me", "name": "Avenge Me!", "name_original": "Avenge Me!", "description": "<p>Avenge me is an isometric methodical hack 'n' slash where many heroes are sent to deal with monsters out in the far reaches of the kingdom.<br/><br/>NOTE. This build is a prototype. Feedback is appreciated. <br/><br/><strong>Gameplay:</strong><br/><br/>You're pitted against an angry fire elemental with a wide variety of abilities at its disposal. You'll spawn as a random class. With your kit you need to defeat the boss without getting hit. You in most instances will be one shot by anything. If you die, you'll re spawn as a random class and continue to do battle with this fiery monstrosity.<br/><br/>You have infinite lives however each death will add to your score (kinda like golf but with more fiery death). Can you do a flawless run with each class?<br/><br/>Each class has a special, powerful ability that unlocks after the charge bar reaches its peak. You'll need to survive long enough to utilize this.<br/><br/><strong>Classes:</strong><br/><br/><strong>Fighter:</strong><br/><br/>The Fighter is a front line warrior equipped with a shield and melee weapon.<br/>You can block with your shield to prevent damage from projectile based abilities however this will not save you from a direct blow. If you are not intentionally blocking and a projectile hits your shield, you will drop it. You may pick it up again after a time.<br/><br/>Special ability: Frenzied blows. Once your charge bar is full, you can unleash your inner rage! For 4 seconds you are invulnerable and your attack speed and range is increased considerably.<br/><br/><strong>Ranger:</strong><br/><br/>The Ranger is a back line sniper equipped with a bow and arrows.  Aim with the mouse and hold down the left mouse button to draw back your arrow, then fire! The ranger can jump higher then the Fighter or Mage and can also move very quickly.<br/><br/>Special ability: Focus fire. Once your charge bar is full, you can unleash a volley of full strength arrows in quick succession by holding down the left mouse button. <br/><br/><strong>Mage:</strong><br/><br/>The Mage is a mid ranged caster utilizing ice magics through their staff. With your staff you can attack in controlled bursts with an ice spray at medium range. The Mage is equipped with a dash spell allowing them to teleport a short distance to avoid fatal attacks or obstacles. This ability has a 2 second cooldown.<br/><br/>Special ability: Unlimited power. Once your charge bar is full, you can briefly channel the full unbridled power of the nether, temporarily removing the cooldown on both dash and the Mage's primary attack, ice spray. <br/><br/><br/></p>", "metacritic": null, "released": "2018-11-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/48a/48a04b863643e04620171126bc3b7d9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["tartankiwi"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}