{"id": 263253, "slug": "space-overlords-itch", "name": "Space Overlords (itch)", "name_original": "Space Overlords (itch)", "description": "<p>PLAY ▶</p>\n<p>▒▒▒ You have just been enslaved by the SPACE OVERLORDS ▒▒▒</p>\n<p>▗ The SPACE OVERLORDS are on a quest to clean former planets that are now ecological wastelands.</p>\n<p>▚ Be part of their enslaved cleaning workforce, work to reach your designated quota, and discover new things about the planet you are cleaning and the SPACE OVERLORDS species.</p>\n<p>▟ Features two exciting work modes to spend your captivity days:<br/>  ▁ PROCESS an endless amount of trash, mutants and remnants of a long lost species<br/>  ▁ REFINE special materials to extract resources cycle after cycle</p>\n<p>▖ Enjoy your lonely labor on a variety derelict environments, with mad hi-tech beats by our secret slave composer, or just the mechanical soundtrack of heavy machinery.</p>\n<p>▞ Work hard! Rumor has it that slaves that reach their production quota get a special reward!</p>\n<p>▛ Our kind OVERLORDS promise no ads, wait times, or other evil artifacts that may interrupt your work.</p>\n<p>STOP ▉</p>\n<p>SPACE OVERLORDS is a dark love letter to the arcade puzzle genre.</p>\n<p>Slavery and any kind of forced labor is an awful crime that should never have been committed, and should never happen again. So is extreme pollution and ecological unawareness. This is a rebellion against such things.</p>\n<p>Made with 💛 in the Badladns</p>\n\n<p>You can find more information about the project here: http://the.badladns.com/projects/spaceoverlords</p>\n<p>It was made with much care.<br/>Enjoy it!</p>", "metacritic": null, "released": "2018-11-06", "tba": false, "updated": "2019-08-28T23:19:39", "background_image": "https://media.rawg.io/media/screenshots/3a7/3a729ac76c7d9c923b00803750418266.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["thegraffo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}