{"id": 26321, "slug": "gti-club-supermini-festa", "name": "GTI Club Supermini Festa!", "name_original": "GTI Club Supermini Festa!", "description": "<p>\n      GTI Club Supermini Festa! shifts its way onto Wii! Staying true to the \n      original racing frenzy of the award-winning arcade game, players will \n      race through the cityscapes of France, the UK, Italy, USA and Japan. \n      Speed through tight bends and back roads of the urban sprawl, up steep \n      mountainous roads and caves. Tackle a wide variety of driving conditions \n      in the ultimate race to the finish!\n    </p><p>\n      Features\n    </p><p>\n      • Journey through 5 stages and 15+ courses: Race through open cities, \n      tackle oncoming traffic and pedestrians, and journey through high \n      mountainous roads (locations include France, UK, Italy, USA, Japan) to \n      uncover new routes and secret courses<br/>• Choose from a wide variety of \n      Superminis: Drive 16 fully customizable cars based on the old classic \n      arcade version plus all-new additions<br/>• Utilize the Wii Wheel for \n      easy handling: Use pick up and play controls utilizing instinctive \n      manipulation with the Wii Wheel or Wii Remote (Nunchuk optional)<br/>• \n      Drive with exceptional handling: Take to the streets in a Supermini to \n      take on big jumps, tight turns, and secret shortcuts<br/>• Variety of \n      customizations: Enter the garage, design your car from the ground up or \n      tune your engine’s performance\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2010-03-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/72f/72f3d3e7311d6f23c6eed5c31ab80756.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Konami"], "esrb_rating": null}