{"id": 263374, "slug": "missileman-10th-anniversary-package", "name": "Missileman 10th Anniversary Package", "name_original": "Missileman 10th Anniversary Package", "description": "<p>Missileman is a character I've created in 2008, before 6th grade ever began. <br/></p>\n<p>I had a paper and pencil in my lap in a corner in the summer camp's gym because I wasn't in the mood to partake in sports. In fact, I wanted to make my own character who I would base a series around. Without a thought to spare, I came up with this goofy looking robot hero guy. Then I made games and cartoons around him.</p>\n<p>All of them were pretty much the kind of spectacularly awful you could only expect from an 11-year old at the time.</p>\n<p>Prior to 2012, I spent no longer than perhaps a week on a \"Missleman\" game or toon. I churned them out as quickly as possible, as my imagination was running that wild at the time. I also had a nasty habit of reusing existing assets from the Internet for various aspects of just about every game. </p>\n<p>Missleman Spy Strike 2, released in 2012, was the transition point for my game development. As I was entering high school at the time, I felt I needed to start focusing on making the game as good as I could make it. So instead of mere days, the game took approximately 6 months. Its actual quality is debatable among players, but it was a first for a lot of factors in the way I approached making games from that point onward.</p>\n<p>That game also would have been my final Missleman game. I initially wanted Dynamite Alex to replace the series as my go-to platform shooter series to work on. But in mid-to-late 2015, I asked myself \"What if I made a Missileman game today?\"</p>\n<p>Two years later, that became Missileman Origins, a game I was confident enough in to sell on Steam. </p>\n<p>Although Missileman Origins is a continuity reboot whose characteristics are meant to be distanced as far away from the previous Missileman eras as possible, I figure the most appropriate way to celebrate the 10th Anniversary of the character would be to compile everything together. That way, players can see how Missileman gradually transformed from being a middle schooler's guinea pig to a representation of a much more developed mindset.</p>\n<p>Not every single piece of Missileman media has survived over the years (I removed tons of my crappy MS Paint cartoons from YouTube several years ago, for example), but with nearly every single game preserved, you can experience these wonderfully stupid applications for yourself and watch my game dev mentality slowly but surely expand over the years.</p>\n<p>Special Thanks to the following: Michael Hilliger, Zachary Wiebe, \"IndieAnjelo\", Alexander Lyons, and everybody else that has gotten to play a part in shaping Missileman's history, no matter how big or small that role may have been.</p>\n\n<p>-Ryan Silberman</p>", "metacritic": null, "released": "2018-11-06", "tba": false, "updated": "2019-08-28T23:19:39", "background_image": "https://media.rawg.io/media/screenshots/632/63272d8f1fe378fa1d36412dcb9538df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jack-of-All Games"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}