{"id": 263439, "slug": "killer-clowns", "name": "Killer Clowns", "name_original": "Killer Clowns", "description": "<strong>Overview</strong><br/>Killer Clowns is an electrifying combination of the arcade classic: Berzerk, and the cult classic film: Killer Klowns From Outer Space. With touches of elements from some of our favorite games like Dead Space and Super Smash TV, Killer Clowns is a tough-as-nails arcade experience from outta this world.<br/>Set in the distant future, Earth struggles for survival due to a shortage of resources. The Planetary Resource Importation Corporation sets to the stars in search of a future for mankind. What they found instead, was an intergalactic circus from hell.<br/><br/>Trapped in a spaceship with electric walls and vengeful alien clowns, the goal is simple: Get back to your cruiser at the docking bay and escape. But these gruesome bozos have some nasty tricks hidden up their sleeves, and seem to know your every move.  You must outwit and slay any clown that stands in your way, but you must make haste! For as you linger, you attract the attention of the ever hungry Jugularnaut...<br/><br/>Lock and load, blast some clowns, and run for your life!<br/><br/><strong>Key Features</strong><br/>-7 difficulties<br/>-4 player local coop/cutup<br/>-2 game modes (Escape mode, Survival/Cut-up mode)<br/>-6 bosses<br/>-50+ levels <br/>-Hardcore mode<br/>-Freeplay mode<br/>-Darkness adjustment<br/>-E-Z-Walls (for those who find electric walls too hard or frustrating).<br/>-Heart throbbing music by Dance With The Dead", "metacritic": null, "released": "2018-11-04", "tba": false, "updated": "2019-08-28T23:19:38", "background_image": "https://media.rawg.io/media/screenshots/ba1/ba1442738a070dba3e4915c386f38687.jpg", "website": "https://ettinsoft.com/killer-clowns/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ettinsoft"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Ettinsoft"], "esrb_rating": null}