{"id": 263400, "slug": "escape-itch-riow21", "name": "Escape! (itch) (RioW21)", "name_original": "Escape! (itch) (RioW21)", "description": "<p>Escape! is a platformer game in  which you control a man who is imprisoned in a special prison facility. You were put in prison because of a mistake. Would you risk your life to escape prison and expose the truth?</p>\r\nSTORY SUMMARY\r\n<p>Escape! lets you control a man who is imprisoned in a special prison facility. He was imprisoned not because of his own mistake or crime but because of his friend's mistake. The man was so devastated when he was thrown into prison. He spent countless days hoping that the police would know that he is not the person they are looking for. Days past and still he was imprisoned. He felt sick because of this and he make a promise that he will escape prison to get his freedom back and to expose the truth about the person who is guilty.<br/></p>\r\nGAMEPLAY\r\n<p>In Escape!, you control the main character as you try to escape prison LA GERA, a heavily guarded special prison facility. Escape! has a unique gameplay because in Escape!, you can't attack your enemies, you can't jump on it too. The only way to defeat an enemy is by using power up such as the thunder power up which will zap your enemies and that's all. There are also some puzzle placed inside the level design to make Escape! more unique.</p>\r\nART STYLE\r\n<p>At the start of the project, we wanted to make Escape!'s art style a 2D sketch-like art. But, as the project progress, we decided to change our art style into a combination of 2D sketch-like art for the background and for the other assets, their art style are digital marker-drawn as you can see on the screenshot of the main character. </p>\r\nCREATOR\r\n<p>The creator of this game is DRAWN STUDIO, which consists of 3 members (Rio Wibawa, Felix Kurniawan, Kenn Cornelius). We are college students from Bina Nusantara University or widely known as Binus University. We create Escape! as a game project to fulfill our third semester 2D Game Programming task which is making a unique platformer game. In Escape!, Rio Wibawa is the artist, game designer, and music &amp; sound effect composer, Felix Kurniawan is the lead programmer, and designer, Kenn Cornelius is the assistant programmer and designer.</p>", "metacritic": null, "released": "2018-11-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/488/48837a6538f4ca25b466afbf6fb94831.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RioW21"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}