{"id": 263434, "slug": "super-x-chess-itch", "name": "Super X Chess (itch)", "name_original": "Super X Chess (itch)", "description": "<p><strong>Key Advantages of Super X Chess</strong></p>\n<ul><li> 9 new chess pieces help generate more creative and exiting chess.\r\n</li><li> Reduced draw percentage.\r\n</li><li> Chess is more about the ability to play and not home preparation.</li></ul>\n<p><strong>Design</strong></p>\n<p>If you decide to combine your pieces, then you get a stronger piece but at the same time you lose time from developing your position. If your opponent can constantly threat your more powerful pieces, then your providing free tempo for the opponent. Having less pieces can prove to be also a drawback when fighting over a critical square as then you can't pile up as many attacks to it. This all makes Super X Chess a well-balanced game.</p>\n<p><strong>Key Features</strong></p>\n<ul><li>Game Modes: Super X Chess, Super960 Chess and Normal Chess.\r\n</li><li>Online multiplayer &amp; local multiplayer. </li><li>Single player mode against customizable AI opponent.  There's AI difficulty levels ranging from estimated Elo of 900 to 1900 on traditional chess. Although I've seen the AI beat ~2600 Elo chess grandmaster in Super X Chess, as there are a lot of new ideas hidden inside.\r\n</li><li>Ability to create handicaps for extra challenge or casual play.\r\n</li><li>Includes tutorial for both Normal Chess and Super X Chess.\r\n</li><li>Go through your previously played games to remember your epic wins and to analyze your losses.</li></ul>\n<p><strong>Rules</strong></p>\n<ul><li>Move your own piece to the same square as your other piece to create a combined piece. The combined piece has the ability to move as both pieces that got combined.\r\n</li><li>When 2 pieces are merged, the piece can't be unmerged or merge again. This is to make decisions count and have enough drawbacks for game balance purposes.\r\n</li><li>Royal pieces (Queen and King) don't merge.\r\n</li><li>Pawns promote on last rank only if they are not merged or the pawn is merged with another pawn.\r\n</li><li>Slightly modified pawn promotion rules: Pawn+Pawn pieces promote to more powerful pieces, but regular Pawns now only promote to either Rook, Bishop or Knight.\r\n</li><li>Piece movement logics that are non-trivial are well thought out and include piece combinations of Knight+Knight, Rook+Rook and Pawn+Pawn.\r\n</li><li>Otherwise all normal rules of chess apply, including en passant, pawn's double move and castling.</li></ul>", "metacritic": null, "released": "2018-11-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c31/c3172f855a23f40f13f172b4b0363285.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Mlyst"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}