{"id": 263413, "slug": "tiny-combat-arcade", "name": "Tiny Combat Arcade", "name_original": "Tiny Combat Arcade", "description": "Demo Day 23 Build\r\n<p>Tiny Combat Arcade is the third game in the Tiny Combat series of games, built from the ground up. Again. After being implicitly called out by the ACTUALLY FINISH A FUCKIN GAME jam, I accepted the challenge.</p>\n<p>Unlike previous iterations, TCA was built with the purpose of being <strong>a game</strong>. I set some rules on myself for how this was going to go.</p>\n<ol><li>The core gameplay must be as basic as possible, ensuring most of the time is spent on <strong>making a game </strong>rather than endlessly adding cool features into a contextless proof of concept.</li><li>It must have a full loop that includes main menu &gt; beating a series of missions &gt; finishing the game.</li><li>Anything else is just extra.</li></ol>\n<p>While TCA is very barebones, I feel like it actually it accomplishes this. Unlike my previous projects, and everything you will find on my itch page, I feel like there's a game for me to build upon here. I'm not stuck in prototyping purgatory because there actually a game I would be adding on to with levels, missions, and gameplay.</p>\r\nDemo Gameplay\r\n<p>From the main menu there are two modes of play, Arcade and Free Flight.</p>\r\nArcade\r\n<p>Arcade mode is a series of timed, fast paced missions. The series in the demo function roughly as a tutorial on how to play. Your mission is to secure an island achipelago for future operations. You'll start out by assaulting offshore platforms, intercept enemy long range bombers, and finally destroy a stronghold.</p>\r\nFree Flight\r\n<p>This mode places you on a massive island populated by enemies. This map is four times larger than anything you'll see in Arcade. On the island are various groups of enemies of different types scattered throughout the island. The airfield is the most heavily defended. </p>\n<p>There is no time limit, but you still have limited ammunition. How much of the island can you clear?</p>\r\nFeatures\r\n<ul><li>Fly an F-4 Phantom in simple to fly, fast paced, arcade action</li><li>Shoot down enemy aircraft of varying difficulty</li><li>Earn points for your kills to get a high score (WIP!)</li><li>Two modes of play: Arcade and Free Flight</li><li>Lock on with missiles, or gun down your opponents with a cannon</li></ul>\r\nControls\r\n<p>The game is currently optimized around an Xbox One controller. If you have it, it's highly recommended you use it. In the future I'd like to have much more robust options for input. I can't guarantee it'll work well with other gamepads. Mouse and keyboard controls have been added, but they are <em>very </em>rough. </p>\r\nXbone Controller (Recommended)\r\n<ul><li>Pitch: Left Thumbstick Y</li><li>Roll: Left Thumbstick X</li><li>Rudder: Left/Right Triggers</li><li>Afterburner: Right Bumper</li><li>Airbrake: Left Bumper</li><li>Target: Y</li><li>Gun: A</li><li>Missiles: B</li></ul>\r\nMouse and Keyboard\r\n<ul><li>Pitch: Mouse Y</li><li>Roll: Mouse X</li><li>Rudder: A / D </li><li>Afterburner: W</li><li>Airbrake: S</li><li>Target: R / Middle Mouse</li><li>Gun: Left Mouse Button / L.Ctrl</li><li>Missiles: Right Mouse Button / Space</li></ul>\r\nKnown issues\r\n<ul><li>Campaign is unfinished and ends at mission 3, the bomber intercept. </li><li>High scores do not save.</li><li>No options menu.</li><li>Player clips through ground on death.</li><li>Poor feedback when campaign is completed.</li><li>No loading screen to soften loading transitions between maps.</li><li>Mouse controls are very poor with no sensitivity adjustment.</li><li>It is very difficult to maintain situational awareness right now. I have several ideas for this, but simply ran out of time.</li></ul>\r\nChangelog\r\n<p><strong>0.1.1 Hotfix</strong></p>\n<ul><li>Added invert pitch option accessed from pause menu</li><li>Keyboard yaw more responsive</li><li>Fixed the pause menu not closing correctly</li><li>Fixed the pause menu appearing during briefing</li><li>Fixed mouse not disappearing during flight</li></ul>\n<p><strong>0.1</strong></p>\n<ul><li>Release</li></ul>", "metacritic": null, "released": "2018-11-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a3e/a3edf20cef15b1813c6858e6b2727c0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Why485"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}