{"id": 263598, "slug": "fenimore-fillmore-3-skulls-of-the-toltecs", "name": "Fenimore Fillmore: 3 Skulls of the Toltecs", "name_original": "Fenimore Fillmore: 3 Skulls of the Toltecs", "description": "A Cult Classic:Among the classics of the golden age of graphic adventures, 3 Skulls of the Toltecs is a cult title that has received the highest praise from both the press and the great fans of the genre both for its witty history and its delirious dialogues. Protagonist of the funny adventures in the wild west, of which this is in the first installment, Fenimore Fillmore is a nice and naive gunman who has to face the most hilarious situations to solve the most crazy puzzles with his innate insight.Arizona 1866:The action takes place in a very specific place at a particularly chaotic time in the history of the far and wild west: on the border with Mexico, where, in 1866, the Juaristas fought against the French troops of the Emperor Maximilian, while the Apaches and the American soldiers, just finished the American Civil War, faced what would be the conquest of the West. In fact, Fenimore Fillmore is a veteran of that war, who roams the region and finds himself, by chance, with a violent scene in which he ntervenes saving an old peddler who reveals an incredible secret about a fabulous treasure.The Treasure of the Toltecs:Mexican revolutionaries, French soldiers, a band of outlaws, a tribe of Apache Indians, the U.S. cavalry, an American senator, a cunning priest, an ambitious colonel and many other characters will test the ingenuity of Fenimore Fillmore in the mad pursuit of a fabulous pre-Columbian treasure, that of the Toltecs, whose key are three valuable gold skulls. Living numerous adventures in a typical border town, in a classic fort of cavalry, in an Indian village and in other bucolic scenarios, Fenimore Fillmore, in his effort to reunite the three skulls, will have, among many other things, to rob a bank, sign a treaty with the Indians, enlist in the army, distill whiskey, build a hot air balloon and join the Mexican revolutionaries.Features:<ul><li>Classic point &amp; click adventure game.<br/></li><li>Half a dozen wide locations to explore..<br/></li><li>More than 30 crazy characters to interact with.<br/></li><li>More than 75 items to use.<br/></li><li>An infinity of puzzles to solve.</li></ul>", "metacritic": null, "released": "2019-02-01", "tba": false, "updated": "2019-08-28T21:51:13", "background_image": "https://media.rawg.io/media/screenshots/a7d/a7d6f48b1bb628c3408069b3b8e8f403.jpg", "website": "http://www.fenimorefillmore.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 23, "beaten": 1}, "playtime": 11, "achievements_count": 16, "ratings_count": 1, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Casual Brothers"], "genres": ["Adventure"], "publishers": ["Casual Brothers"], "esrb_rating": null}