{"id": 263587, "slug": "legend-of-keepers", "name": "Legend of Keepers: Career of a Dungeon Master", "name_original": "Legend of Keepers: Career of a Dungeon Master", "description": "In this original mix of a Dungeon Defender and a Roguelite designed by Goblinz Studio (author of  Dungeon Rushers), you will manage your career as a Dungeon Master!Features<br/><ul><li> Join the Dungeons Company and try to climb the ladder<br/></li><li> Try to stop heroes and protect the treasures of the company<br/></li><li> Hire monsters, manage your employees and your stock of traps<br/></li><li> Deal with employees strikes and other fun events</li></ul>RogueDefender<br/>Each run will be different but players will keep some bonuses for their master between runs. Our game is a mix between a Roguelite and a Dungeon Defender. How did we achieve that? We've run many tests to find the perfect mix between a management and a dungeon phase!<br/><br/>Dungeon Phase<br/>First, you will have to plan your defense against a group of adventurers. Check their stats and resistances, then place the best traps and monsters to defeat them! When you think your dungeon is ready, let the crawl begin!<br/><br/>You will then be able to watch those heroes die! It's a reversed dungeon crawler, heroes will move through your dungeon and will trigger the traps you've placed. When a group of adventurers meets a group of monsters you've positioned in your dungeon, a turn-based fight will happen!Masters Classes<br/>Put yourself in the shoes of a Dungeon Master! You will be able to choose between our 3 original classes!<br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2019-01-08", "tba": false, "updated": "2023-12-27T09:13:12", "background_image": "https://media.rawg.io/media/screenshots/b8e/b8ee8e55442eed567b04e7b2687ab31f.jpg", "website": "", "rating": 3.52, "rating_top": 4, "added_by_status": {"yet": 23, "owned": 709, "beaten": 7, "toplay": 14, "dropped": 15, "playing": 5}, "playtime": 5, "achievements_count": 21, "ratings_count": 22, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 23, "platforms": ["macOS", "Linux", "PC"], "developers": ["Goblinz Studio"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Goblinz Studio"], "esrb_rating": null}