{"id": 263595, "slug": "balsa-model-flight-simulator", "name": "BALSA Model Flight Simulator", "name_original": "BALSA Model Flight Simulator", "description": "A Virtual Flight Experience Like No OtherBalsa is a unique Model Flight Simulator where you can design, build, fly, and battle with model aircraft.<br/><br/> <br/>Created by Felipe \"HarvesteR\" Falanghe, Creator and former Lead Developer of Kerbal Space Program, Balsa takes the next step in player-built flight simulation games, delivering an entirely new, multi-genre experience for virtual pilots of all skill levels.<br/> <br/>Balsa is an Early Access Game, so it is actively being developed. This means you can expect regular updates in the future that add new content, features, and of course, fixes. It also means you get a chance to actively participate in the development of the game by joining our community. We are always listening to feedback from our players!Current Features Include<br/><ul><li>The in-game Vehicle Editor, that allows you to build anything you can imagine using parts that snap together in a hands-on, intuitive way. <br/></li><li>A physics-based flight model, ensures your designs behave realistically as they fly (and crash). <br/></li><li>Paintball Combat! Design and build the ultimate aerial combat machine and take it up against other players in model-scale paintball dogfights.<br/></li><li>Multiplayer is fully supported, for up to 16 virtual pilots. <br/></li><li>Moddable to Extremes. Balsa was designed from the start to support mods.<br/></li><li>Full Oculus VR Support: Designed from the ground up for VR, Balsa lets you experience the thrill of model aviation in a way no other simulator does. Use your Touch controllers to grab, hand launch, and fly your vehicles in fully explorable sceneries.<br/></li><li>Non-VR Support: Don't have a VR headset? No problem! Balsa can also be played in glorious 2D!</li></ul>Features planned for the future include<br/><ul><li>Helicopters, Rockets, and all sorts of model vehicles<br/></li><li>Races and Challenges<br/></li><li>many More Sceneries<br/></li><li>And many more things we will come up together as a community! </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:13", "background_image": "https://media.rawg.io/media/screenshots/002/00272eebc5eb250d1b8acbb8ca6b54b3.jpg", "website": "http://balsamodelsim.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Floating Origin Studios"], "genres": ["Simulation"], "publishers": ["Floating Origin Studios"], "esrb_rating": null}