{"id": 263653, "slug": "toy-collapse-match-cubes", "name": "Toy Collapse: Match Cubes", "name_original": "Toy Collapse: Match Cubes", "description": "Help Laura collect the toys and complete her story.<br/><br/>Toy Collapse is a simple yet challenging free block game. You don’t have to pay a dime to finish the game. Match cubes of the same color and crash the boxes to clear a level. There is no time limit. You are just limited by the number of moves. Go ahead, crash toon blocks!<br/><br/>Although it is not a match 3 game Toy Collapse is similar with these match 3 games in a way. This is just another kind of matching game.<br/><br/>All you can do is popping matching cubes to make new ones fall from above. No need to match 3 cubes, it is perfectly possible to match 2 cubes from the same color at least.<br/><br/>Very easy to learn. The gameplay is very intuitive.<br/><br/>This game is the best time killer / time waster game for everyone! But be careful when you blast these cubes, because it is also highly addictive.<br/><br/>The main features in Toy Collapse are:<br/><br/>- Brilliant, colorful screen, wonderful sound effects, challenging and funny gameplay<br/>- 650 levels, finish all of them and reach the peak of the game (for now!)<br/>- Stunning graphics and beautiful visual effects<br/>- Powerful boosters<br/>- Spin wheel mini game: Win boosters and coins by spinning the lucky wheel<br/>- You will receive surprise boxes when you reach certain levels<br/>- Connect to Facebook and see your place among your friends<br/>- Explore the map and unlock 13 different worlds<br/><br/>Toy Collapse will improve your problem-solving skills. Have fun while sharpening your brain. This puzzle game will be your next brain teaser. You can play it anywhere you want and pause anytime. You can play it in subway, bus or even while walking. Play it at your home, school or office and just pause whenever you want.<br/><br/>You can make the game ad-free if you buy remove ads.<br/><br/>Laura, a sweet toon character, will always be with you during the adventure. She’s cute as a panda. Help her collect her toys and make her happy. She likes the sound it makes when she crushes candy in her mouth. She also adores jelly, soda and all other junk foods that contain sugar like many children at her age.<br/><br/>Smash toon blocks and crush toon blocks! Try it it’s really fun!<br/><br/>AUTO RENEWABLE SUBSCRIPTION TERMS<br/><br/>*** Subscription options ***<br/>We have the following subscription option in our game:<br/>Weekly Diamond Membership offers a weekly subscription for £5.99 after a 3-day free trial. It removes all ads for the subscription period. The subscription also provides 200 coins and 4 boosters each day.<br/><br/>*** End of trial and subscription renewal ***<br/>This price is for United Kingdom customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>*** Canceling trial or subscription ***<br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at info@oak.technology<br/><br/>Terms of use: https://oak.technology/terms-of-use-mobile/<br/>Privacy policy: https://oak.technology/privacy-policy-mobile/", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:01:21", "background_image": "https://media.rawg.io/media/screenshots/67d/67da74e1b8a28fd9d0606c323d641cf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pine Applications"], "genres": ["Board Games", "Puzzle"], "publishers": ["Pine Applications"], "esrb_rating": "Everyone 10+"}