{"id": 263679, "slug": "goodme-mindfulness-relax", "name": "Goodme: mindfulness & relax", "name_original": "Goodme: mindfulness & relax", "description": "This coloring 100% brings your well-being<br/>Complete levels and boost self-confidence<br/>Hundreds of levels for your motivation<br/><br/>Join the millions experiencing lower stress, less anxiety, and more restful sleep with daily mingfull coloring with relaxing music. <br/>Recommended by top psychologists, therapists, and mental health experts.<br/><br/>Discover new type of meditation with coloring &amp; open eyes.<br/>Goodme is the unique mindfulness app for beginners, but also includes hundreds of levels for intermediate and advanced users.<br/>Color cool pictures<br/>Complete 100% and make coloring page alive <br/>Discover daily quote for your mind transformation<br/><br/>Using daily will help you to relieve your stress, low inner fear and anxiety, become more optimistic and motivated, improve focus.<br/><br/>What programs our programs cover:<br/>Calm  &amp; Relax<br/>Love &amp; Relationship<br/>Happiness<br/>Motivation<br/>Boost self-confidence<br/>For kids<br/><br/>Features:<br/>- Easy to color: choose your color palette and tap to color.<br/>- Select from different brush types for advanced effects.<br/>- Easily share your drawings with quotes in your favorite social network<br/>- Optimized for the newest iPhones<br/><br/>Goodme Premium subscription pricing and terms:<br/><br/>Goodme offers an auto-renewing 6 months subscription at 47.99$ to provide you with unlimited access to the Goodme Collection while you maintain an active subscription. <br/><br/>Payment will be charged to the credit card connected to your iTunes Account when you confirm the initial subscription purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current subscription period. Your account will be charged for renewal within 24-hours prior to the end of the current period, and the cost of the renewal will be identified. You may manage your subscription and auto-renewal may be turned off by going to your Account Settings after the purchase. Any unused portion of a free trial period, if offered, will be forfeited when you purchase a subscription, where applicable.<br/><br/>Read more about our terms and conditions here:<br/><br/>Terms of service: http://nikaent.com/en/terms-of-service/<br/>Privacy policy: http://nikaent.com/en/privacy-policy/", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-10-22T14:01:24", "background_image": "https://media.rawg.io/media/screenshots/038/0388b0a801038f1d9d42220c5bc3c659_X8vXdj2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nika Entertainment"], "genres": ["Simulation", "Family"], "publishers": ["NIKA ENTERTAINMENT"], "esrb_rating": "Everyone 10+"}