{"id": 263646, "slug": "double-win-vegas-casino", "name": "Double Win Vegas Casino", "name_original": "Double Win Vegas Casino", "description": "Spin the reels of the best free slot machine games and let your winnings unfold!! Hit the BIG WIN and JACKPOTS in this Las Vegas inspired game. Unlock more machines as you gain level!<br/><br/>Socialize with your friends and help your club become Legendary!<br/><br/>We bring you the classic casino games and an awesome selection of unique slot games. Double Win Vegas is a FREE online multiplayer casino game where you play with people from all over the world. You will never need another slot game after playing DOUBLE WIN VEGAS.<br/><br/>Spin the reels of Las Vegas style slots that you won’t find ANYWHERE else:<br/><br/>• Win the TOURNAMENTS with the Reels of Speed! <br/>• ENJOY the CLUB EVENTS in Golden Nights<br/>• Get more FREE SPINS with Princess of Fortune!<br/>• BIG WINS with LONG WILDS in Cleopatra!<br/>• GET LUCKY with the Golden Dragon!<br/><br/>A free slots online experience like you’ve never had before:<br/><br/>• Collectibles bonus items that will be exchange for FREE COINS<br/>• LOGIN everyday to get FREEBIES!<br/>• Daily MULTIPLIER with every friends you have! The more friends, the more FREE COINS you will get!<br/>• Daily coin gifts and bonuses, including 1 MILLION FREE COINS just for downloading.<br/>• GIve your club mates or your friends FREE SPINS or FREE COINS everyday!!<br/><br/>PLAY NOW and Enjoy hours of fun while spinning a variety of slots while collecting HUGE wins!<br/><br/>SUPPORT<br/>=======<br/><br/>Let us know if you're having problems with the game, or if you have suggestions! Email us at: support@anino.co <br/>Collection and use of personal data are subject to Anino's Privacy Policy found at http://www.anino.co/privacy.<br/><br/>LIKE &amp; FOLLOW Anino - Double Win Vegas<br/>===============================<br/><br/>Already a fan of Double Win Vegas? Like us on Facebook and Follow us on Twitter and Instagram for the latest adventure updates:<br/><br/>► Facebook Page: https://www.facebook.com/DoubleWinVegas<br/>► Facebook Community Group: https://www.facebook.com/groups/DoubleWinVegas<br/>► Twitter: https://twitter.com/DoubleWinVegas<br/>► Instagram: https://www.instagram.com/doublewinvegas<br/><br/>Double Win Vegas Slots is completely FREE to play with in-game purchases!<br/><br/>► This game is intended for adult audiences.<br/>► This game does not offer \"real money gambling\" or an opportunity to win real money.<br/>► Practice or success at social casino gaming like Double Win Vegas Slots does not imply future success at \"real money gambling.\"", "metacritic": null, "released": "2016-10-01", "tba": false, "updated": "2019-10-22T14:01:21", "background_image": "https://media.rawg.io/media/screenshots/96b/96bf382af7c71ec94cdb8b2fd0a92a71_yGr1tDU.jpg", "website": "https://www.anino.co/games/double-win-vegas/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Anino Pte"], "genres": ["Card"], "publishers": ["Anino Pte"], "esrb_rating": "Teen"}