{"id": 263649, "slug": "squares2", "name": "Squares²", "name_original": "Squares²", "description": "Paint squares and make matches! A simple new puzzle game that will make your brain happy!<br/><br/>■  HOW TO PLAY  ■ <br/>To play, paint colorful tiles on the board by dragging. Connect any three or more squares of the same color and make a match. It's simple in premise, but as you pull the thread, it becomes something entirely unexpected. In some levels, tiles move like clockwork requiring precision and planning, while others feature tiles twice as big, which can turn a dire situation into your biggest match.<br/><br/>And with the new wild tile, you can make exceptional combos never before possible in the original.<br/><br/>■  FEATURES  ■<br/>Since the original Squares, we've completely redesigned the experience from the ground up:<br/><br/>■  Simple brain busting gameplay <br/>■  Complete 50 levels designed to take your brain to the limit<br/>■  Compete in the classic endless mode from the original<br/>■  Colorblind mode so every eyeball can enjoy<br/>■  Awe-inspiring design. There's never been a puzzle game that looked this slick.<br/><br/>■  ABOUT SQUARES  ■<br/>We set out to create a simple puzzle game that would be new, modern, fun, and inspiring.<br/><br/>Squares² is the culmination of that goal. We started with the innovative gameplay we released in 2016's Squares and we crafted a unique and exciting experience centered around that simple idea.<br/><br/><br/><br/>From the four sided brains at Simple Machine. Creators of Pop the Lock, Calculator: The Game, and of course, the original Squares.", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-07-30T04:14:07", "background_image": "https://media.rawg.io/media/screenshots/377/3773317ef13d7ff1d87e64754b3e9929.jpg", "website": "http://simplemachine.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Simple Machine"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Simple Machine"], "esrb_rating": null}