{"id": 263662, "slug": "shadow-fight-battle", "name": "Shadow Fight Battle", "name_original": "Shadow Fight Battle", "description": "A thousand years of war between the Light and Dark, it must end now.<br/>Play as a young stickman warrior fighting his way through his enemies in the war. <br/>Which way will you choose? The Good or the Evil? Fight your enemies, eliminate bosses with stunning combos during your journey to prove your powess and collect ancient relics. Equip yourself with countless lethal weapon, unique armor sets and many awesome skills to learn. <br/>Game is simple: Tap Left Right to attack enemies, once rage power is enough, you can unleash to perform ultimate skills.<br/>Features: <br/>•\tImpressive visual effects <br/>•\tA lot of skills to upgrade <br/>•\tThousands of enemies <br/>•\tEpic and various boss fights <br/>•\tHardcore gameplay<br/><br/>Subscription Terms:<br/>VIP Package offers a weekly subscription, you will have a 3-days FREE trial period, after this period you will be charged $5.99. After buying this subscription, you will unlock following features:  Body Armor, Damage buff, Double Coins earned and NO ADS. This is an Auto-Renewable subscription. Your subscription will be charged to your iTunes account. At the end of the term, unless auto-renewables subscriptions are disabled, your subscription will automatically renew in your iTunes account. You will be charged for the regular price of your subscription within 24 hours prior to the end of the current term. You can turn off automatic renewal in your iTunes Account Settings at any time, but you must do so at least 24 hours before the end of the current term. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. For more information, check the links below:<br/>Term of use: http://aceplaymedia.com/terms-of-service/<br/>Privacy Policy: http://aceplaymedia.com/privacy-policy/<br/>If you have any questions, feel free to contact us at: http://aceplaymedia.com/contact/", "metacritic": null, "released": "2018-11-09", "tba": false, "updated": "2019-10-22T14:01:22", "background_image": "https://media.rawg.io/media/screenshots/5ac/5ac4aeb8fc9c4c5130261bebc1326130_5cavpRO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tuyen Nguyen Minh"], "genres": ["Action", "RPG"], "publishers": ["Tuyen Nguyen Minh"], "esrb_rating": null}