{"id": 263790, "slug": "just-seven-words-free-word-association-game-and-fu", "name": "Just Seven Words - Free Word Association Game and Fun Addictive Word Game with Little Words", "name_original": "Just Seven Words - Free Word Association Game and Fun Addictive Word Game with Little Words", "description": "Just Seven Words is a cool new word game with a twist. This fantastic game gives you seven hints. You will need to come up with the answer to each of the seven hints. Don't worry! It's Just Seven Words! Here's what we will do for you...We will provide you with random blocks of letters. Each block will have two to three letters in it. You must use these letter blocks to construct the answers to each of the seven hints. Earn coins as you complete each of the levels.  <br/><br/>This amazing word game has six different categories to choose from. Each category has 30 mind bending levels. Here's the thing...It starts out easy and continues to get progressively harder. Guess the answers in any order. Check if your answer is correct by tapping the green check button. Tap the \"shuffle\" button to rearrange the letter boxes. Still stumped? Don't lose any sleep over it! Just Seven Words has a \"Get a Hint\" button. <br/><br/>Out of \"hints\"? Hop over to its awesome game store and trade some coins for a hint. Simply tell your friends about Just Seven Words via Face Book and Twitter and you can earn coins.  <br/><br/>Start playing Just Seven Words today!", "metacritic": null, "released": "2014-01-14", "tba": false, "updated": "2019-10-22T14:01:34", "background_image": "https://media.rawg.io/media/screenshots/283/2834769102cf68d5001fc858b5dede03_dTcLPKB.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Williams"], "genres": ["Puzzle"], "publishers": ["Daniel Williams"], "esrb_rating": "Everyone 10+"}