{"id": 263831, "slug": "just-three-words-2-a-word-association-game-for-all", "name": "Just Three Words 2 - A Word Association Game for All Ages", "name_original": "Just Three Words 2 - A Word Association Game for All Ages", "description": "Just Three Words is back, and with more puzzles! Just Three Words 2 gives you over 400 challenging puzzles to keep you guessing!<br/><br/>In Just Three Words 2, you get three words and need to connect them to one word that will group all three together.<br/><br/>This fun word puzzle game will keep you busy on down time, while waiting somewhere, or just when you want to exercise your brain. Play against friends to see who has the better puzzle skills! The best part about Just Three Words 2, is that you can connect your Twitter and Facebook accounts and ask your social network for help if you get stuck!<br/><br/>Examples of puzzles found in the game:<br/>Sweet, Glucose, Candy = Sugar<br/>Funnel, Storm, Wind = Tornado<br/>Pollinate, Honey, Nest = Bumble Bee<br/><br/>You get coins every time you correctly guess the word. Save up those coins and you can use them towards hints. Each hint will place a correct letter on the board. Use them wisely, though! You also get coins every day, just for playing!<br/><br/>This word guessing game is a great game to play when you have nothing to do. Simply open the game, and start playing! Even when you’re not “online”. This is a perfect game to kill time on a flight. Play with your kids to see if they can tell you the word that links that three together. This game is fun, addicting and will keep you guessing!<br/><br/>Parents, feel free to hand off to your kids and help them work on words, exercise their brain after school, on weekends or during school breaks!<br/><br/>So, are you ready to take on Just Three Words? Can you handle the challenge that’s been given? Download now and start playing today!", "metacritic": null, "released": "2014-10-08", "tba": false, "updated": "2019-10-22T14:01:36", "background_image": "https://media.rawg.io/media/screenshots/c05/c055f6624d063f111f9f07cff28fb356.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Williams"], "genres": [], "publishers": ["Daniel Williams"], "esrb_rating": "Everyone 10+"}