{"id": 263869, "slug": "the-looter-express-a-fun-endless-track-racing-game", "name": "The Looter Express - A Fun Endless Track Racing Game of Cops and Robbers", "name_original": "The Looter Express - A Fun Endless Track Racing Game of Cops and Robbers", "description": "So you rob a bank… then what do you do? You run from the cops!<br/><br/>Imagine this, you go to a bank and hand the teller a letter that says to give you all the money in the drawer. Naturally, the teller does, but while doing this she hits the silent alarm button. So by time you get out of the bank, the cops are just around the corner! So what do you do?<br/><br/>Naturally, of course, you’d run from the cops for as long as you can. What you don’t expect is to be stuck on a circular race track trying to avoid a collision! Imagine how the robber feels, he’ll never get away no matter how hard he tries. <br/><br/>In this classic arcade style game, you are Spence Parkerson: world's greatest thief.  You've just committed the crime of the century and looted Ft Knox!   Gloating, you are making your escape with the police hot on your trail.  You've managed to evade them so far but a wrong turn sends you into an abandoned raceway.  Never the quitter, you must keep going, avoiding the police lap after lap.  <br/><br/>How long can you prove you're the best and avoid capture? The game starts with multiple cops following you on an enclosed race track. You and the cops are going opposite directions. Simply tap the screen if they get into your lane to avoid them. The longer you avoid, the higher the score! Challenge your friends to see who can get the highest best score. <br/><br/>This game can entertain you, or any kid you want to keep out of your hair, for hours. This arcade style game is simple, yet addicting. Test the limits of your concentration, take a break from work, or just take a break from everything. The perfect “no brainer” game.<br/><br/>This game can easily be played with one hand. Your car is the black one, and you are running from the three cop cars that are chasing you. You’ll never know when the cops will change lanes, so pay attention! If you crash, all three cop cars and your getaway car catch fire and your laps are re-set. <br/><br/>Try to get around as many lap as you can.", "metacritic": null, "released": "2014-08-18", "tba": false, "updated": "2019-10-22T14:01:39", "background_image": "https://media.rawg.io/media/screenshots/2e5/2e5e5bd743f84e161bc047a96f879460_DvF0CD5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Williams"], "genres": ["Racing", "Arcade"], "publishers": ["Daniel Williams"], "esrb_rating": "Everyone 10+"}