{"id": 263875, "slug": "mix-two-photos-a-word-photo-puzzle-game-for-your-b", "name": "Mix Two Photos - A Word Photo Puzzle Game for your Brain", "name_original": "Mix Two Photos - A Word Photo Puzzle Game for your Brain", "description": "Who doesn't love playing picture and word games and who doesn't like a good challenge? Everyone loves brainteasers. You've heard that a picture is worth a thousand words. Well, how about two pictures? In this tantalizing game, Mix Two Photos presents you with two pictures and all you have to do is come up with a word to connect the two together.  For instance, suppose you have a picture of a pacifier and a picture of a stroller. What connects the two photos?<br/><br/>Crossword puzzles can get monotonous after awhile. And while other games are as much a matter of luck as skill, this game will make you think and stimulate your brain. It starts out easy and gets more difficult with each set of pictures. The trick is to see how far you can get. Earn rewards. Earn trophies. Can't figure them out? You can use earned coins to buy hints. Use the Show Letter option to see one letter of the word, or use the Hint feature to have the names of the pictures appear. If that doesn't help, you can use the option to \"ask your Facebook or Twitter friends.\" Earn free coins or go to the Store and buy or swap coins. Trophies will earn you 10 coins each. See how many levels you can whip through and increase them each time. This game is sure to sharpen your brain and increase your \"outside the box\" thinking. <br/><br/>Download this game to tease your brain and your friends' brains as well. But watch out - winning is addictive and you might get hooked!", "metacritic": null, "released": "2014-04-08", "tba": false, "updated": "2019-10-22T14:01:39", "background_image": "https://media.rawg.io/media/screenshots/d1a/d1a4210755f3d09209565dda571ded91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Williams"], "genres": ["Puzzle"], "publishers": ["Daniel Williams"], "esrb_rating": "Everyone 10+"}