{"id": 263938, "slug": "make-a-city-idle-tycoon", "name": "Make a City Idle Tycoon", "name_original": "Make a City Idle Tycoon", "description": "Tap to build a city and develop it! Grow your very own tiny family town into a bustling highrise virtual city!<br/><br/>Build family houses, earn money, upgrade structures, hire more construction workers to help, and even create ANOTHER city in this combination clicker and city building game! Earn achievements and rewards as you create a blooming business; build the tallest highrise, boost your economy and MORE! <br/><br/>Become a civil City Builder, build buildings and upgrades them with our awesome upgrades! Accumulate money and construct houses even when you are away offline! Log in often to watch your city’s development and guide it the right direction! <br/><br/>As the civil construction planner and head engineer, you can build as many houses, offices, and mansions as you like. As you create a bigger city, you can even build a castle! <br/><br/>Do you like idle games? What about city builder games? Are you ready to make an urban paradise? <br/><br/>FEATURES:<br/>• Click and tap tap to build a house and become a Make a City Master!<br/>• Make it grow into an impressive city!<br/>• Hire more construction workers and civil engineers!<br/>• Unlock new family houses and city buildings and and grow!<br/>• Maintain the town! Watch the balance of different structure types!<br/>• Use science and upgrade to increase structure efficiency! Do away with inefficacies!<br/>• Attract construction specialists from different fields!<br/>• Get stars for each level you complete. Spend stars on upgrades and to unlock new houses!<br/>• Build a town and make a home away from home!<br/>• You are the urban city builder in this city building game!<br/>• Fun and addictive urban highrise idle clicker tap tap app!<br/>• Become the #1 construction clicker development tycoon!<br/>• Beware CLICKER GAMES are very addictive!<br/>• Combination create a City Building and Idle game!<br/>• Hire workers to manage the office and highrise!<br/>• Master the game and increase construction worker efficiency!<br/>• Create and grow another town if you want! Get new stars for moving into another town!<br/>• This idle and tap tap clicker game has everything you want!<br/><br/>Download the best clicker game, Make a City Idle Tap. Play right now. If you like City building and enjoy being a city builder, working in construction, and planning with civil engineers, download now!<br/><br/>Future updates will include instruments for workers, researchers, new upgrades and maybe the entire addition modules.<br/><br/>--- Best Idle Tap Tap Game  iOS ---<br/>--- Best Clicker Game iOS---<br/>--- Best Tap tap Town Game iOS ---<br/>--- Best Free Make a City Game iOS ---<br/>--- Best Tycoon Game  iOS---<br/>--- Best Town City Building Games iOS---<br/>--- Best City Builder Game iOS ---", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2019-10-22T14:01:42", "background_image": "https://media.rawg.io/media/screenshots/fbc/fbcda7d40cb87ec581588dbbc625d11e_3OT2bKI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FGL Indie Showcase"], "genres": ["Strategy", "Simulation"], "publishers": ["Lucrative Gaming"], "esrb_rating": null}