{"id": 263943, "slug": "knight-joust-idle-tycoon", "name": "Knight Joust Idle Tycoon", "name_original": "Knight Joust Idle Tycoon", "description": "Joust your way to victory and brag about your idle tycoon reign to the entire medieval kingdom!<br/><br/>In Knight Joust Idle Tycoon, upgrade your tools and train your warriors to prepare them for the ultimate battle of the medieval ages. Actively grow and manage your jousting team to prepare them for battle. Plan your strategy to defeat your opponent in one on one jousting battles. This free joust idle tycoon game features tons of upgrades, special crystals, battle options, and more!<br/><br/>Are you a fan of our other idle tycoon games? This is the perfect new free game for you!<br/><br/>----- KNIGHT JOUST IDLE TYCOON SPECIAL FEATURES ----- <br/>Train your Knights in shining armor! <br/>Manage your Knight’s characteristics: Attack, Health, Accuracy, and Dodge. <br/>Upgrade your equipment!<br/>Choose your battle gear from spears, armor, and horses. <br/>Plan your battle strategy!<br/>Keep track of your dual statistics to improve your fight!<br/>Earn corns to buy upgrades and boost your training!<br/>Use special crystals to accelerate faster! <br/>Unlock achievements!<br/>Gain rank on the community leaderboards!<br/>Defeat your rivals to claim victory!<br/><br/>Free jousting games celebrate the strategy of medieval jousting battles! If you’re not willing to risk your life in traditional jousting, this game is a great way to live out your fantasy. Never stop planning your battles, upgrading your gear, and defeating the enemy warrior!<br/><br/>Do you love the game play of Knight Joust Idle Tycoon? Follow the entire FGL Idle Tycoon Series! The Idle Tycoon series features free idle games where you can plan a strategy to get the fastest upgrades and build the ultimate mine, city, garden, and more!<br/><br/>Clicker Mine Idle Tycoon<br/>Make a City Idle Tycoon<br/>Island Oasis Idle Tycoon <br/><br/>Like us on Facebook: https://www.facebook.com/clickeridletycoon/", "metacritic": null, "released": "2018-01-25", "tba": false, "updated": "2019-10-22T14:01:43", "background_image": "https://media.rawg.io/media/screenshots/6b7/6b7278d0b47f563d357c30bb3cc69917_t6mfGbR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FGL Indie Showcase"], "genres": ["Adventure", "Strategy"], "publishers": ["Lucrative Gaming"], "esrb_rating": null}