{"id": 263951, "slug": "tap-a-paca-help-alpaca-jump", "name": "Tap-a-Paca - Help Alpaca Jump!", "name_original": "Tap-a-Paca - Help Alpaca Jump!", "description": "Tap the screen to make your favorite alpaca jump from cloud to cloud! Time your taps perfectly so the alpaca lands on the clouds as the float across the screen. Collect magical stars in the night sky as you leap among the cotton candy clouds.Use the golden stars to unlock every adorable alpaca! Can you unlock every furry friend? <br/><br/>Play for high streaks!! Tap a Paca has addicting game play. Play over and over again to see if you can get the longest streak of anyone. Check the leaderboard to see your rank!<br/><br/> Cotton candy clouds, and fun music complete the jumpin’ Alpaca world dreamland! <br/><br/>This farm animal game is a true test of patience and timing skill - are you up for the challenge? <br/><br/><br/>TAPA PACA ALPACA WORLD SPECIAL FEATURES<br/>Tap to jump!<br/>Move from cloud to cloud!<br/>Carefully time each leap!<br/>How many stars can you collect?<br/>Unlock every fluffy Alpaca!<br/>Relaxing music!<br/>How many stars can you collect?<br/>Drift away on the pink cotton candy clouds!<br/>Fun Pixel Art! <br/><br/>Fun Facts!<br/>Alpacas may look like Llamas in these fun pixelated graphics, but did you know they have evolved separately over 6000 years?  Alpacas are a more soft, gentle and friendly breed, whereas llamas have been breed to be pack animals. The Llama is actually double the size of the Alpaca! Alpaca fur is a coveted luxury item that is used to make the finest warm fabrics. They are beloved farm animals who like to live in packs. The more Alpacas you unlock, the happier they will be together!<br/><br/>Will you have the winningest streak of them all?! We can't wait to see your name in the #1 spot!<br/><br/>LIKE US ON FACEBOOK: https://www.facebook.com/fglindieshowcase/<br/><br/>We love your feedback, please take the time to leave a review!", "metacritic": null, "released": "2018-07-07", "tba": false, "updated": "2019-10-22T14:01:43", "background_image": "https://media.rawg.io/media/screenshots/cb8/cb8718a092f4af5e5561b4704389b8ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FGL Indie Showcase"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Lucrative Gaming"], "esrb_rating": null}