{"id": 264090, "slug": "royal-clash-of-diamonds-and-gems-puzzle", "name": "Royal Clash of Diamonds and Gems - Puzzle", "name_original": "Royal Clash of Diamonds and Gems - Puzzle", "description": "Royal Clash of Diamonds &amp; Gems is a cascade adventure game and a very addictive diamond puzzle game. Travel through magical lands, visiting wondrous places and different set of valleys. Switch and match your way through hundreds of fun levels in this interesting puzzle adventure. Royal Clash of Diamonds and Gems just keeps getting more and more interesting after each level…!!!! Swap gems and charms in a line and solve the puzzle. Become the legend of magic crush every diamond and gem…!!!!<br/><br/>- Different and Beautiful Magical Gem Valleys<br/>- Arcade and Classical Game Play Mode<br/>- 250+ Challenges to Blast in this Royal Clash of Diamonds &amp; Gems in Arcade Mode<br/>- Multiple Special Gems<br/>- Addictive Gameplay<br/>- Amazing Animations and Blast Effects<br/>- Beautiful game graphics<br/><br/>You are in a magical valley of the gems and magicians are trying to steal the diamonds and gems by creating the walls behind the gems to increase their spells powers to control the innocent and harmless creatures. Can you match the three or more and break the walls to save the gems from the magicians??? <br/><br/>Match three in line and blast through the walls. Match more than three to create the super-powers gems and blast them to get special effects.<br/><br/>Increase and sharpen your skills by playing the infinity classical mode by making the highest scores to beat the magicians easily in the arcade mode of the game.<br/><br/>Are you ready for this Royal Clash of Diamonds &amp; Gems puzzle adventure? Use boosters to increase your score to complete all the levels with 3 stars. Pick charms and stars to win pearl's treasures in Royal Clash of Diamonds and Gems game.", "metacritic": null, "released": "2016-10-09", "tba": false, "updated": "2019-10-22T13:52:30", "background_image": "https://media.rawg.io/media/screenshots/bb3/bb398ec49ec4ff11eab07922c4c58dbb_m6Lckdy.jpg", "website": "http://www.hawksgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kifayat Ullah Khan"], "genres": ["Arcade", "Puzzle"], "publishers": ["Kifayat Ullah Khan"], "esrb_rating": "Everyone 10+"}