{"id": 264088, "slug": "daddy-moto-racing-use-powerful-missile-to-become-a", "name": "Daddy Moto Racing - Use powerful missile to become a motorcycle racing winner", "name_original": "Daddy Moto Racing - Use powerful missile to become a motorcycle racing winner", "description": "Dare to drive through the traffic in Daddy Racing Moto<br/><br/>Drive the fast motorbikes between the traffic, collect coins, obtain the highest speed with the nitro and make the highest scores in the exciting Daddy Moto Racing game. Become the best biker of the Daddy Moto Racing by scoring the highest points among different players in the game from all over the world using your driving and bike handling skills in the game. Multiple beautiful changing environments in the game give the user exciting gaming experience while overtaking the randomly changing dynamic traffic on the roads.<br/><br/>Collect coins and unlock multiple bikes with different features, break your own scores record to get on the top of the leaderboard. Unlock the bikes equipped with the more missiles capacity and fast speed to destroy the hurdles, clearing the path through the traffic letting you obtain the highest scores in the game. Share your scores on the social media with your friends &amp; family and prove your driving skills to them in the exciting 3D Daddy Moto Racing game.<br/><br/>With the beautiful game graphics and enjoyable music, drive fast and use the boost during the game to make the highest score in the game, passing the crazy traffic on the roads, and clearing the traffic with the missiles equipped on the bikes.<br/><br/>GAME FEATURES:<br/><br/>\t•\tSmooth Game Controls<br/>\t•\tMultiple motorbikes<br/>\t•\tMultiple game environments <br/>\t•\tBeautiful game graphics<br/>\t•\tReal time dynamic traffic<br/>\t•\tSocial media sharing<br/>\t•\tLeaderboard<br/><br/>Rate the game and give your valuable feedback for further improvements in the game.<br/><br/>FOLLOW US:<br/><br/>* http://facebook.com/HawksGames<br/>* https://twitter.com/HawksGames<br/>* https://plus.google.com/101154368805853624095", "metacritic": null, "released": "2015-07-31", "tba": false, "updated": "2019-10-22T14:01:58", "background_image": "https://media.rawg.io/media/screenshots/944/944ccae5ab73b8287acd01473881150d_QmR0urm.jpg", "website": "http://www.hawksgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kifayat Ullah Khan"], "genres": ["Sports", "Racing"], "publishers": ["Kifayat Ullah Khan"], "esrb_rating": "Everyone 10+"}