{"id": 264063, "slug": "knights-and-ogres", "name": "Knights and Ogres", "name_original": "Knights and Ogres", "description": "Knights and Ogres is a fun two-player or 1-player game where you have to destroy each-others castles using weapons such as Crossbows and Catapults to plunge the enemy to doom. It’s a Turn-based game. <br/><br/>Supreme leader, our world is in great danger which we’ve never faced! The mean and ruthless Ogres are trying to destroy us! Build your defence and stop them now!<br/>Mighty Warriors:<br/>You can get your warriors and deploy them to the battlefield. With advanced equipment, they can stop or kill enemies on their own.<br/><br/>Fantastic In Game Props:<br/>There are some fantastic props for you. They can be good in destroying all enemies or just healing yourself.<br/><br/>Majestic Towers:<br/>There are different battle towers which can be developed into bigger ones.<br/><br/>Historically Epic Graphics:<br/>Made with lot of effort by our design team, cartoon style and perfect for high definition screen. With numerous effects, we are going to present you so many fierce war fields and a superior gameplay<br/><br/>Game Modes:<br/>Many challenging levels, different ways of playing, gathering, protecting, attacking, strategy and more!<br/><br/>Tournament Mode: (Coming soon)<br/>Compete with millions of players over the world. Now have amazing fun together <br/><br/>Features:<br/>.Unique warriors <br/>.4 gorgeous props which help you turning defeat into victory<br/>.12 powerful towers<br/>.15 epic battlefields<br/>.Many monsters<br/>.Unlock Achievements<br/>.100+ challenging levels<br/>. Fantastic game surround sound<br/>.And more…<br/><br/>Arcade Mode <br/>This is the single player mode in which you compete against the computer, destroy those towers with your mighty weapons to advance to the next stages in the game.<br/><br/>VERSUS Mode<br/>This is the game mode in which you can fight against any of your friends and play on the same phone together and have a lot of fun destroying each other’s armies.<br/><br/>Build your defensive line with a powerful tower and defend your kingdom. The destiny of your kingdom lies in your own hands.<br/><br/>Play one of the best tower defence, arcade games available for iOS <br/><br/>If you liked the game, please take a moment to rate it 5 stars on the play store and leave your wonderful comments.<br/>If you have any feedback, or spot a bug or even if you have a feature request to make the game interesting, reach out to us through the e-mail mentioned in the play store. We read all e-mails and take user feedback very seriously to make this game one of the best game out there.", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:01:56", "background_image": "https://media.rawg.io/media/screenshots/400/4003c74e447c089f3421bace8b230813.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tippy Entertainment"], "genres": ["Action", "Family"], "publishers": ["Tippy Entertainment"], "esrb_rating": "Everyone 10+"}