{"id": 264089, "slug": "car-racing-3d-real-3d-speed-car-racing-game", "name": "Car Racing 3D - Real 3D Speed Car Racing Game", "name_original": "Car Racing 3D - Real 3D Speed Car Racing Game", "description": "Prove your Racing Skills by Defeating all Opponents in All Race<br/><br/>Want to be speed racer? Its time to show your driving skills by defeating every one in different races in the game and show your skills and prove your value to every one. Play the simple Car Racing game and win all the races with 1st position by taking all the 5 stars in the game and unlock the other location to play multiple races of that location. <br/><br/>The game provide the 2 very exciting locations for the racing to the users and each location have different race categories, either drive alone on the race track on the location and BEAT the BEST TIME for that location, or play the LAP MISSION and defeat all your opponents and take 1st position in the race with all 5 stars.<br/><br/>Handle and control racing your racing car using sensors by moving the device. Drive carefully and avoid hurdles to win the race. Use the BOOST to speed up the car and use BRAKES to either slow down the car or to reverse the car.<br/><br/>**** HOW TO PLAY **** <br/><br/>- Tilt your device to turn the car during the race<br/>- Use the boost button to speed up the car<br/>- Use the brake button to slow down the car or to reverse the car<br/><br/>**** GAME FEATURES **** <br/><br/>- Simple and beautiful graphics<br/>- Simple gameplay<br/>- Smooth and easy car controls<br/>- Multiple racing locations<br/>- Multiple type of race in each location (Time, Lap)<br/>- and much more…<br/><br/>With beautiful graphics and interface and simple racing game idea, play the game and share your valuable thoughts with us.", "metacritic": null, "released": "2015-10-07", "tba": false, "updated": "2019-10-22T13:52:30", "background_image": "https://media.rawg.io/media/screenshots/cc7/cc727f199fd3bf2823065c6bba23c201_MVPnLQT.jpg", "website": "http://hawksgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kifayat Ullah Khan"], "genres": ["Sports", "Racing"], "publishers": ["Kifayat Ullah Khan"], "esrb_rating": "Everyone 10+"}