{"id": 264098, "slug": "skateable-the-game-of-skate-skateboard-lines", "name": "Skateable - The Game of Skate & Skateboard lines", "name_original": "Skateable - The Game of Skate & Skateboard lines", "description": "Skateable is an innovative skateboarding game. Carefully rotate your device with your fingers (don't toss) and the app will recognize what skateboard trick it is. There’s over 100 different tricks that the app recognizes. Try yourself in a freeride, learn skateboard tricks. Try to do a skateboard line and win pro skaters achievements. Challenge your friends in the multiplayer S.K.A.T.E Game.<br/><br/>WARNING<br/><br/>You shouldn't toss your phone, rotate it with your fingers to successfully recognise a skateboard trick.<br/><br/>Make sure you protect your device from falling down by using both of your hands.<br/><br/><br/>NEW!! You can win colorful bolts for your skateboard by doing tricks in the freeride mode. Green, bronze, silver and gold bolt achievements! Good luck!<br/><br/>S.K.A.T.E Rules<br/><br/>The rules are basic. One player sets a trick by doing a particular skateboarding trick of their choice. If the trick is not landed, another player attempts to set a trick. Once a trick has been set, the other player(s) must respond by doing the same trick in their first try. Last letter has 2 tries!<br/><br/>Features<br/>- Knows most of the skateboard flat tricks<br/>- Freeride mode<br/>- Multiplayer S.K.A.T.E game<br/>- Goofy and Regular support<br/>- Achievements<br/>- Progress on becoming a pro skater<br/>fe0859425e", "metacritic": null, "released": "2014-01-22", "tba": false, "updated": "2019-10-22T14:01:58", "background_image": "https://media.rawg.io/media/screenshots/f34/f340b14654fbebe36eeb6f4b03d3a374_4avkaWN.jpg", "website": "http://skateableapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wojciech Mandrysz"], "genres": ["Simulation", "Sports"], "publishers": ["Wojciech Mandrysz"], "esrb_rating": null}