{"id": 264039, "slug": "toast-shooter", "name": "Toast Shooter", "name_original": "Toast Shooter", "description": "Toast Shooter is a fast action packed arcade style tap-the-right-item game!<br/><br/>Get your  Jelly Cannon ready for all those tasty butter toasts jumping out of the  toasters. But be careful - do not hit the dark toasts! Catch Rocket  Toasts, Collect Bonuses- and Power Stars, repair defect toasters, get  tap-combos and play bonus rounds to beat the high score!<br/><br/>Let your fingers fly ... FAST!<br/><br/>A fun game for all ages!<br/><br/>The iPad version is available in the app store too. Toast Shooter HD reached the TOP 10 in some stores and categories! <br/><br/>You can choose between two game modes<br/>===============================<br/><br/>Time Trial<br/>------------<br/>Make the most out of two minutes. The duration of a game is max. two minutes. Taping a dark Toast costs 5 seconds. The game will end if you run out of Jelly Power.<br/><br/>Long Run<br/>------------<br/>The game ends if you run out of Jelly Power.<br/><br/>Jelly Power<br/>=========<br/>Don't run out of Jelly Power. Increase it by taping Rocket Toasts or Power Starts.<br/><br/>Toast<br/>=====<br/>Taping a toast scores 1 point. If you miss a toast or let it escape your Jelly Power is decreased.<br/><br/>Dark Toast<br/>=========<br/>Taping a Dark Toast decreases your Jelly Power. In Time Trial mode it decreases the time by 5 seconds.<br/><br/>Rocket Toast<br/>==========<br/>Tap a Rocket Toast - it scores 5 points, increases your Jelly Power and releases a Power Star.<br/><br/>Egg Toast<br/>========<br/>Sometimes an Egg Toast sneaks in. Tapping it scores 10 points and the next 15 Toasts released will appear in 'giant size' for easy tapping.<br/><br/>Power Star<br/>=========<br/>Tap a Power Star to increase your Jelly Power. Collect 4 to enter the bonus round.<br/><br/>Bonus Round<br/>==========<br/>All toasters release Bonus Starts for 15 seconds. Collecting a Bonus Star scores 5 points. Misses don't decrease Jelly Power.<br/><br/>Defect Toaster<br/>===========<br/>Tap a defect toaster to repair it ( scores 10 points ). Each tap releases a Bonus Star.<br/><br/>Tap Combo<br/>=========<br/>Tapping 3 or more items really fast scores a combo bonus of 10 points.<br/><br/>Timer<br/>=====<br/>The game gets more and more difficult each time the timer runs out or a new Toaster enters the screen. You earn extra Jelly-Power with each new level. Your Jelly Power 'value' is added to your score if you reach a new level ( e.a. if your Jelly Power is at 75% you earn 75 points... ).<br/><br/>GameCenter<br/>==========<br/>Toast Shooter is GameCenter enabled. Compete with other players world wide.", "metacritic": null, "released": "2010-04-25", "tba": false, "updated": "2019-10-22T14:01:52", "background_image": "https://media.rawg.io/media/screenshots/24e/24e6a696b8e2b1100519a3d0469dc2a7.jpg", "website": "http://miscstuff.de/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stefan Preuss"], "genres": ["Arcade", "Family"], "publishers": ["Stefan Preuss"], "esrb_rating": "Everyone 10+"}