{"id": 264086, "slug": "monster-truck-snowfall", "name": "Monster Truck Snowfall", "name_original": "Monster Truck Snowfall", "description": "Master the driving of the monster truck in the Snow Valley<br/><br/>Drive the monster truck in the valley of snow during the snow fall to control and master the driving skills of the monster truck. With most exciting features of the game is to drive the truck in the uneven terrain while keep in mind to collect the coins to complete the mission. <br/><br/>GAME ENVIRONMENT:<br/>Drive the truck in the realistic snow valley environment designed by keeping in mind the real environment of the snow valley during the snow fall make the user feel like driving in the real snow fall  environment.<br/><br/>USER CONTROLS:<br/>Drive and control the truck with the most efficient and smooth controls used in the games making the user to turn at the steep or on the uneven terrain with speed.<br/><br/>MISSIONS:<br/>The game contains multiple missions which further consists of the sub-mission starting from the certain points and end at the specific position taking the user from the specific path in the environment.<br/><br/>COINS AND FUEL:<br/>The real excitement in the game is to collect the specific number of coins by driving on the designated path of the environment keep in view the time of the mission and to make the game more realistic fuel is added which keep decreasing as the user progress with the truck. Collect the fuel tank on the way to keep the truck running.<br/><br/>MORE FEATURES:<br/>The game contains several more features for the user excitement and attraction especially the graphics of the game.<br/><br/>Like the game share with other, let us know your thoughts and valuable feedback. Provide us with your suggestions to make improvement in the game.", "metacritic": null, "released": "2015-07-23", "tba": false, "updated": "2019-10-22T14:01:58", "background_image": "https://media.rawg.io/media/screenshots/26c/26c00e322289a0b99a529ae817252e11.jpg", "website": "http://hawksgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kifayat Ullah Khan"], "genres": ["Simulation", "Sports"], "publishers": ["Kifayat Ullah Khan"], "esrb_rating": "Everyone 10+"}