{"id": 264171, "slug": "real-quail-sounds-and-quail-hunting-calls", "name": "REAL Quail Sounds and Quail Hunting Calls", "name_original": "REAL Quail Sounds and Quail Hunting Calls", "description": "Quail calls with quail sounds perfect for quail hunting.  Bluetooth compatible! The Quail calls app provides you REAL quail calls at your fingertips.  These quail sounds calls are clear, crisp and recorded from REAL quail.  8 unique quail sounds included.  This is the best quail calls app you will find.  Connect the app to your speaker and amplifier system to play the quail calls loud and use the quail calls to bring in quail (where legal).<br/><br/>FEATURES: <br/>-  8 quail hunting quail sounds<br/>-  Effective, realistic and clear quail calls<br/>-  Bluetooth compatible to sync to a Bluetooth speaker to play the quail calls<br/>-  The soundtracks allow you to set the quail calls and focus on quail hunting  <br/>-  Connect to your speaker system with audio cables or Bluetooth (cables not included)  <br/>-  No more forgetting to grab your MP3 player or memory cards, you always have your phone with you  <br/>-  E-Calling audio for quail calls at a fraction of the cost of purchasing multiple quail hunting sounds and memory cards separately<br/><br/>Soundtracks included in \"QuailPro\" <br/>- Wood Quail<br/>- Mountain Quail<br/>- Scaled Quail<br/>- Gambles Quail<br/>- California Quail<br/>- Bobwhite Quail<br/>- Montezuma Quail<br/>- Japanese Quail<br/><br/>Download Quail Calls and start having quail hunting success today!", "metacritic": null, "released": "2016-11-02", "tba": false, "updated": "2019-10-22T14:02:05", "background_image": "https://media.rawg.io/media/screenshots/6eb/6ebab8fb9e4a22589bd4c9637f9a60bc_Pj5ktMe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Adventure", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Everyone 10+"}