{"id": 264169, "slug": "real-wild-hog-calls-wild-boar-calls-for-hunting-bl", "name": "REAL Wild Hog Calls + Wild Boar Calls for Hunting BLUETOOTH COMPATIBLE", "name_original": "REAL Wild Hog Calls + Wild Boar Calls for Hunting BLUETOOTH COMPATIBLE", "description": "Want an affordable wild hog E-Caller?  The HogPro hog electronic caller app provides you hog hunting soundtracks at your fingertips.  These soundtracks are clear, crisp and recorded from REAL hogs.   7 unique soundtracks included.  Connect the app to your speaker and amplifier system to pull in hogs.<br/><br/>FEATURES: <br/>-  7 hog hunting soundtracks <br/>-  Effective, realistic and clear audio to bring in wary hogs<br/>-  Bluetooth compatible to sync to a Bluetooth speaker in the field  <br/>-  Sounds can play in the background of your phone allowing you to text, take pictures and surf the internet without disrupting the hog calling sounds<br/>-  The soundtracks allow you to set the call and focus on hog hunting  <br/>-  Connect to your speaker system with audio cables or Bluetooth (cables not included)  <br/>-  No more forgetting to grab your MP3 player or memory cards, you always have your phone with you  <br/>-  E-Calling audio for hogs at a fraction of the cost of purchasing multiple soundtracks and memory cards separately<br/><br/>Soundtracks included in \"HogPro\" <br/>-  Wild Hog Distress<br/>-  Hog Grunts 1<br/>-  Hog Grunts 2<br/>-  Begging Hogs<br/>-  Young Hog Distress<br/>-  Hog Feeding Frenzy<br/>-  Hog Fight<br/><br/>Download HogPro and start having hog hunting success today!", "metacritic": null, "released": "2016-07-24", "tba": false, "updated": "2019-10-22T14:02:05", "background_image": "https://media.rawg.io/media/screenshots/341/341203df496d3ce90c3d894805cd104e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Adventure", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Everyone 10+"}