{"id": 264111, "slug": "bow-hunting-simulator-pro-the-outdoor-archery-hunt", "name": "Bow Hunting Simulator PRO the Outdoor Archery Hunting Simulator", "name_original": "Bow Hunting Simulator PRO the Outdoor Archery Hunting Simulator", "description": "Are you a archery hunter who loves to hunt for Whitetail Deer, Elk, Moose, Turkey, Bear, Mountain Lions, Bobcats and Wild Boars?  This archery hunting simulator app allows you to plan your archery hunts on your favorite hunting spots.  This is the perfect app for planning an effective archery hunting trip. The archery hunt planner app allows you to build, create and experiment with bow hunting strategies in advance of your bow hunting trip. This app also pairs well with our big game hunting calls and big game calls app.  Check out the link within this app to download the big game hunting calls app or search “big game calls” in the app store.<br/><br/>Plan exactly where you will sit or stand, place trees and water and then place the decoys on the image in any layout you want.<br/><br/>FEATURES: <br/>-   Plan your bow hunting strategy with your magpie hunting buddies in advance of your hunting trip <br/><br/>-   Use multiple images such as standing hunter, trees, ponds and decoy images to plan your perfect archery hunting strategy<br/><br/>-   Save the archery hunting plans you create to your camera roll to try on your next Whitetail Deer, Elk, Moose, Turkey, Bear, Mountain Lions, Bobcats or Wild Boar hunt<br/><br/>-   Recreate your most effective bow hunting setup to remember what worked for your next hunt, perfect for any archery hunter<br/><br/>-   If you own land or properties that are good for archery hunting grab this app to prepare for your next hunt<br/><br/>Download the Bow Hunting Simulator App and start planning for your next bow hunting trip today!", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-07-30T15:08:05", "background_image": "https://media.rawg.io/media/screenshots/a9d/a9d5eedb2b8840723703057720e1a77e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Simulation", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": null}