{"id": 264131, "slug": "turkey-calls-turkey-sounds-turkey-caller-app", "name": "Turkey Calls - Turkey Sounds - Turkey Caller App", "name_original": "Turkey Calls - Turkey Sounds - Turkey Caller App", "description": "Want affordable and realistic turkey calling sounds?  The TurkeyPro turkey calls app provides you turkey soundtracks at your fingertips.  These soundtracks are clear, crisp, lifelike and effective for learning.   Five 60 minute soundtracks included.  Connect the app to your speaker and amplifier system to listen to these real turkey calls louder as you practice or use your phones speakers alone.<br/><br/>FEATURES: <br/>-  5 snow turkey calling soundtracks, 60 minutes each  <br/>-  Effective, realistic and clear audio recorded from real turkeys<br/>-  Bluetooth compatible to sync to a Bluetooth receiver to play even louder as you practice  <br/>-  Sounds can play in the background of your phone allowing you to text, take pictures and surf the internet without interrupting the turkey sounds<br/>-  60 minute soundtracks allow you to set the call and focus on practicing to match the sounds <br/>-  Connect to your speaker system with audio cables (cables not included)  <br/>-  No more buying multiplet MP3s or memory cards, use the phone you already have  <br/>-  Real turk audio soundtracks at a fraction of the cost of purchasing multiple soundtracks and memory cards separately<br/><br/>Soundtracks included in \"TurkeyPro\" <br/>-  Turkey Gobble (15 Minutes)  <br/>-  Turkeys Communicating (15 Minutes)  <br/>-  Aggressive Turkey (15 Minutes)  <br/>-  Yelp (15 Minutes)  <br/>-  Mixed Bag (15 Minutes) <br/>- Purr (15 Minutes) <br/><br/>Download TurkeyPro and learn how to call turkeys by listening to these realistic sounds recorded from actual turkeys today!", "metacritic": null, "released": "2016-03-21", "tba": false, "updated": "2019-10-22T14:02:03", "background_image": "https://media.rawg.io/media/screenshots/bf6/bf659eb761fd405a86d7112afc6ce164.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Adventure", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Mature"}