{"id": 264155, "slug": "rabbit-calls-rabbit-hunting-calls-rabbit-sounds", "name": "Rabbit Calls - Rabbit Hunting Calls -Rabbit Sounds", "name_original": "Rabbit Calls - Rabbit Hunting Calls -Rabbit Sounds", "description": "Want affordable rabbit hunting calls?  The RabbitPro electronic rabbit calls caller app provides you REAL rabbit hunting calls at your fingertips.  These rabbit calls are clear, crisp and recorded from REAL rabbits.   7 unique rabbit hunting soundtracks included.  Connect the app to your speaker and amplifier system to play the rabbit hunting calls loud.<br/><br/>FEATURES: <br/>-  7 rabbit hunting calls<br/>-  Effective, realistic and clear rabbit calls<br/>-  Bluetooth compatible to sync to a Bluetooth speaker<br/>-  Rabbit hunting can play in the background of your phone allowing you to text, take pictures and surf the internet without disrupting the rabbit calling sounds<br/>-  The soundtracks allow you to set the rabbit calls and focus on rabbit hunting  <br/>-  Connect to your speaker system with audio cables or Bluetooth (cables not included)  <br/>-  No more forgetting to grab your MP3 player or memory cards, you always have your phone with you  <br/>-  E-Calling audio for calling rabbits at a fraction of the cost of purchasing multiple soundtracks and memory cards separately<br/><br/>Soundtracks included in \"RabbitPro\" <br/>-  Rabbit Squeaker 1<br/>-  Rabbit Squeaker 2<br/>-  Rabbit Squeaker 3<br/>-  Rabbit Squeaker 4<br/>-  Jackrabbit Distress<br/>-  Rabbit Distress <br/>-  Rabbit Distress 2<br/><br/><br/>Download RabbitPro and start having rabbit hunting success today!", "metacritic": null, "released": "2016-05-17", "tba": false, "updated": "2019-10-22T14:02:04", "background_image": "https://media.rawg.io/media/screenshots/989/9896443066cc52338f2e84aa0d84b1ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Adventure", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Everyone 10+"}