{"id": 264127, "slug": "real-dove-calls-and-dove-sounds-for-bird-hunting", "name": "REAL Dove Calls and Dove Sounds for Bird Hunting!", "name_original": "REAL Dove Calls and Dove Sounds for Bird Hunting!", "description": "BLUETOOTH COMPATIBLE real dove calls app provides you dove calls for hunting at your fingertips.  These dove sounds are clear, crisp, lifelike and recorded from REAL doves. 3 dove call soundtracks included. Simply connect the app to any Bluetooth speaker and you have an instant dove electronic caller system (where legal).<br/><br/>FEATURES: <br/>-  3 dove hunting calls<br/>-  Effective, realistic and clear audio to bring in doves<br/>-  Bluetooth compatible to sync to a Bluetooth speaker in the field  <br/>-  Sounds can play in the background of your phone allowing you to text, take pictures and surf the internet without disrupting the dove calling sounds<br/>-  Long soundtracks allow you to set the call and focus on dove hunting <br/>-  Connect to your speaker system with audio cables or Bluetooth (cables not included)  <br/>-  No more forgetting to grab your MP3 player or memory cards, you always have your phone with you  <br/>-  E-Calling audio for dove at a fraction of the cost of purchasing multiple soundtracks and memory cards separately<br/><br/>Soundtracks included in “REAL Dove Hunting Calls\" <br/>-  Mourning Dove<br/>-  Dove Clucks<br/>-  Dove Coos<br/><br/>Download “REAL Dove Hunting Calls” and start having dove hunting success today!", "metacritic": null, "released": "2016-07-28", "tba": false, "updated": "2019-10-22T14:02:02", "background_image": "https://media.rawg.io/media/screenshots/538/5383caf326490579a2bb64c6c9aaaaca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Adventure", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Everyone 10+"}