{"id": 26422, "slug": "art-style-rotozoa", "name": "Art Style: Rotozoa", "name_original": "Art Style: Rotozoa", "description": "<p>\n      Control a circular creature-like organism known as a rotozoan and nimbly \n      make your way through level after level of primordial ooze. Comprised of \n      only three distinct parts (colored sides, tentacles, and life force), \n      the focus of your rotozoan life is simple: grow your tentacles.\n    </p><p>\n      After playing a few levels and learning the basics of your microscopic \n      world, you begin to unlock additional modes of play and the ability to \n      choose the number of tentacles on your rotozoan. Each mode has its own \n      specific purpose: either reaching a particular length with your \n      tentacles or growing them to the greatest length possible. Regardless of \n      mode though, growing your tentacles means absorbing enemies, known as \n      goobugs, by touching them. Just one catch: successfully absorbing a \n      goobug depends on its color matching the color of your tentacle. Adding \n      to the challenge, longer tentacles can more easily touch incorrectly \n      colored goobugs (causing damage to the tentacle and decreasing your life \n      force) and the goobugs themselves multiply and begin adapting to your \n      movement. Luckily, objects such as the life force-restoring heart item \n      and special attack-enabling cyclone item can be found floating in the \n      ooze to help your rotozoan survive.\n    </p><p>\n      With atmospheres ranging from peaceful calm to intensely challenging, \n      Art Style: Rotozoa offers a wide variety of levels. Victory can only be \n      achieved through quick, but precise, movement and the ability to remain \n      calm under pressure. Are you ready to take on the goobugs?\n    </p><p>\n      Games in the Art Style series feature elegant design, polished graphics, \n      and pick-up-and-play controls, creating an experience focused purely on \n      fun and engaging game play.\n    </p><p>\n</p><p>\n      Check out more Art Style games! <br/>For WiiWare: <br/>Art \n      Style: CUBELLO <br/>Art \n      Style: light trax<br/>Art \n      Style: ORBIENT<br/>Art \n      Style: ROTOHEX\n    </p><p>\n      For DSiWare:<br/>Art \n      Style: AQUIA<br/>Art \n      Style: BOXLIFE<br/>Art \n      Style: DIGIDRIVE<br/>Art \n      Style: BASE 10<br/>Art \n      Style: precipice<br/>Art \n      Style: Zengage<br/>Art \n      Style: PiCTOBiTS<br/><br/><br/><br/><br/><br/><br/><br/>\n</p>", "metacritic": null, "released": "2010-06-21", "tba": false, "updated": "2019-09-12T06:38:22", "background_image": "https://media.rawg.io/media/screenshots/28f/28fcb9e480fc4ca49bea954d5f4f5d0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 11, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}