{"id": 264481, "slug": "apocalypse-wow", "name": "Apocalypse Wow", "name_original": "Apocalypse Wow", "description": "<p>The idea of the game is that the players are zombies that all wish to throw the world’s best after afterlife party. To do this they must recruit guests and friends to help them gather supplies before heading to the Party House occupied by the cowardly party poopers (humans) in the centre of the map.</p>\n<p>The player is able to win over and recruit other zombies that spawn after which they join the player’s “horde”. These zombies can then be used to attack the enemy player, defend against the murderous human or collect a collectible. The more zombies that are allocated to a specific task, the more likely that task is to<br/>be completed and completed quickly. Once the player has collected all of the items, they and their horde enter an empowered state and are able to attack the Party House.</p>\n<p>The game is a mixture of a First Person Shooter (FPS) and a Multiplayer Online Battle Arena (MOBA), in a game mode similar to a mixture of Capture-the-Flag (CTF) and King-Of-The-Hill (KOTH). There are five specific items that each team must collect from various positions on the map before attempting to breach (rent in<br/>the view of the zombies) the Party House. The game also contains the strategy elements of MOBAs since the player needs to effectively manage the number of friendly zombies they have recruited and how many to delegate to certain tasks. Some example strategies could be to bombard the enemy player with zombies while sending small groups of zombies to collect the party supplies, or to send large groups of zombies to one area and quickly capture it before moving on to the next. The gameplay mechanics are intentionally kept  simple in order to maximise the emergence of player formed strategies.</p>\n<p>A match between two or more players consists of an odd number of rounds (usually three or five) and the victor is decided by whoever has won the most rounds. A round ends when a player and their party enters the Party House, however this requires getting past all of the defences and humans.</p>", "metacritic": null, "released": "2018-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/101/101247ab9a498504259ee26f652452ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sinead Urisohn"], "genres": [], "publishers": [], "esrb_rating": null}