{"id": 264489, "slug": "triforce", "name": "Triforce", "name_original": "Triforce", "description": "<p><strong><em>Triforce</em> is a short puzzle game by Patrick LeMieux (alt254) and Stephanie Boluk (<strong>chouxsalad</strong>) inspired by paradoxical places from the original <em>Legend of Zelda.</em></strong></p>\n<p>In <em>The Legend of Zelda,</em> there are several strange spaces hidden around Hyrule that defy the logic of the Cartesian grid: the Lost Woods, the Lost Hills, and the Lost Roads. When navigating these 2D mazes, Link finds himself endlessly looping, temporarily arrested by a classic gaming trope. But when visualized in 3D, these labyrinths start to look different. <em>Triforce</em> features a non-Euclidean Hyrule full of donuts, Möbius strips, and Klein bottles as well as other secrets folded within the topologies of Zelda. Can you navigate three new dungeons in three dimensions to discover the three pieces of the triforce?</p>\n<p><em>Triforce</em> is a free game, designed for educational purposes and originally published in 2017 as part of <em>Metagaming,</em> a book by Stephanie Boluk and Patrick LeMieux available open access at manifold.umn.edu/projects/metagaming. Graphics, music, sound and text from The Legend of Zelda are property of Nintendo.</p>\n<p><strong>Reviews</strong><br/>\"One of my favorite games of the past decade is a wonderful little collection called <em>NES Remix</em>. . . . [T]his trio of games took classic NES titles and reimagined how people played them. It was a great success, but after watching the trailer . . . for <em>Triforce,</em> I realize there are so many more interesting ways to reimagine classic games than just replacing Mario with Link.\" —CJ Andriessen, Destructoid<br/></p><p><em>\"The Topologies of Zelda: Triforce</em> is a head melting non-euclidean puzzle adventure in which you attempt to collect three Triforce pieces while traversing a <em>The Legend of Zelda</em>’s inspired 2D world that’s mapped onto rotatable 3D structures.\" —Free Game Planet</p>\n<p><strong><br/>Updates</strong><em><br/>Updated 11/10/18 11:45PM PST to edit dialog and adjust the main menu position.</em></p>", "metacritic": null, "released": "2018-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/92f/92fdf0bf2bd4b218ce940d817f6518a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Patrick LeMieux and Stephanie Boluk"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}