{"id": 264684, "slug": "crusade-in-europe", "name": "Crusade in Europe", "name_original": "Crusade in Europe", "description": "Normandy, June 1944.  An invasion force of more than 150,000 British, Canadian and American forces needs to be managed, and then their actions on the ground need to be coordinated in response to real-time events on the battlefield. The beginning of a true military crusade.<br/>\n<br/>\r\nCrusade in Europe is a classic real-time simulation game from the 80s designed by Sid Meier and Ed Bever.  The first title in the \"Command Series\" of tactical wargames from Microprose, the game features real-time battles that test your skills as a commander.<br/>\n<br/>\r\nFive different scenarios, from D-Day to the Battle of the Bulge, recreate the tactical decisions faced by commanders in the European Campaign. Each has multiple variables, so you can create “what-if” scenarios, and different levels of difficulty.<br/>\n<br/>\r\nAccelerated real-time simulation<br/>\r\nHistorically accurate scenarios<br/>\r\nDifferent skill levels<br/>\r\nSingle player campaign<br/>\r\nTwo-play head-to-head<br/>\r\nChoose to lead either side<br/>\r\nIn-depth historical backgrounds and hints<br/>\n<br/>\r\nThe idea for the Command Series came from observation of actual tabletop military scenario exercises.  The games challenge you to manage assets, strategically place and move them around the battlefield map, and try to out maneuver the enemy. Victory requires careful strategic thinking and fast responses to rapidly changing battlefield conditions. <br/>\n<br/>\r\nSid Meier, one of the most well-known and prolific strategy game designer-producers, collaborated with historian Ed Bever to make the games incredibly historically accurate.<br/>\n<br/>\r\nThe Command Series, including Decision in the Desert, Crusade in Europe, and Conflict in Vietnam, has been brought back by Atari and the titles are now available on Steam.", "metacritic": null, "released": "1985-06-05", "tba": false, "updated": "2023-11-04T10:26:24", "background_image": "https://media.rawg.io/media/screenshots/408/40824669a8a7dc57a0540f9a39a82ed8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "beaten": 3, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["MicroProse Software"], "genres": ["Strategy", "Simulation"], "publishers": ["Atari"], "esrb_rating": null}