{"id": 264744, "slug": "druidstone-the-secret-of-the-menhir-forest", "name": "Druidstone: The Secret of the Menhir Forest", "name_original": "Druidstone: The Secret of the Menhir Forest", "description": "<p>The druids of the Menhir Forest are troubled. Not only has the Archdruid disappeared, a darkness in the form of purple cysts has fallen upon the forest. It is up to Aava, the daughter of the Archdruid and her new-found companions Leonhard, a mysterious man with no past, and Oiko the mage, a dropout from the guild of Red Priests, to rescue the Archdruid and find out the truth behind the sinister events. As if this wasn&#39;t enough, a murderous maniac impersonating Leonhard is at loose in the forest....<br />\nDruidstone: The Secret of the Menhir Forest is a labor of love from the makers of the critically acclaimed Legend of Grimrock series. Druidstone is a tactical, single-player, turn-based roleplaying game, which combines the best qualities of modern RPGs with the elegance of tactical boardgames. Every action, every turn counts as you control your party of heroes through handcrafted, challenging missions with varying objectives.<br />\nDruidstone is set in a unique fantasy world, Elo Sphaera, filled with ancient, lush forests, standing stones, snow-topped mountains, deadly creatures and puzzle-ridden ruins. The epic story about love and death is centered around the main characters Leonhard, Aava and Oiko, who will along the way meet up with unexpected companions and villains, each with their unique personalities and abilities.<br />\nGet ready to venture forth and uncover the secrets of the Menhir Forest!Key Features<br />\nA tactical turn- and tile-based battle system where every action, every turn counts.<br />\nUpgrade the abilities of your heroes as you see fit using power gems obtained by completing missions and discovering hidden treasures.<br />\nChallenging, hand-crafted missions with playtimes ranging from 15 minutes to 45 minutes.<br />\nSolve devious non-combat puzzle levels to obtain rare equipment.<br />\nA gripping, fantastic story of love and death centered around the main characters Leonhard, Aava and Oiko.<br />\nA unique fantasy setting combining elements from western RPGs, JRPGs and tactical boardgames in unexpected ways.<br />\nPlay custom missions created by others or make your own campaigns with the upcoming Druidstone Level Editor available as a post release update.</p>", "metacritic": null, "released": "2019-05-14", "tba": false, "updated": "2023-09-15T17:34:00", "background_image": "https://media.rawg.io/media/screenshots/a5f/a5feb03fffd55b85dda949ff4db8a500.jpg", "website": "http://druidstone-game.com/", "rating": 3.68, "rating_top": 4, "added_by_status": {"yet": 21, "owned": 177, "beaten": 14, "toplay": 23, "dropped": 7, "playing": 1}, "playtime": 2, "achievements_count": 20, "ratings_count": 22, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 22, "platforms": ["PC"], "developers": ["Ctrl Alt Ninja"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Ctrl Alt Ninja"], "esrb_rating": null}