{"id": 26478, "slug": "ivy-the-kiwi", "name": "Ivy the Kiwi?", "name_original": "Ivy the Kiwi?", "description": "<p>Pillowed on a pile of leaves in the middle of a dark forest, a baby bird<br />\nis breaking out of a curious egg. Her bright orange head and beak poke<br />\nout the top of a polka dot shell and she cries for her mother. The<br />\nforest animals watch her curiously, but apart from them there is no one<br />\nto claim her. Still trapped in the shell except for her head and feet,<br />\nIvy begins walking through the forest calling out for her mother. She<br />\nmeets many other kinds of birds but none are like her and she wanders<br />\nsearchingly for traces of her kind until she finds a glowing orange<br />\nfeather. With a clue now in beak Ivy sets out to follow the trail that<br />\nwill lead her to her mother.</p>\n<p>Features</p>\n<p>• Newest Platformer From the Creator of Sonic the Hedgehog - Yuji Naka,<br />\nbest known as the creator of Sonic, introduces a new loveable character,<br />\nIvy, to the world.<br />\n• Unique Children’s Storybook-Style Presentation -<br />\nHand-drawn artwork that appears as if it has been lifted directly out of<br />\na children’s storybook bring a unique and beautiful presentation to the<br />\ntitle.<br />\n• Gameplay Perfectly Suited for Nintendo DS and Wii - Players<br />\neasily guide Ivy by drawing, swinging, and pulling on vines with the use<br />\nof the Nintendo DS stylus or Wii Remote, across over 100 unique stages.<br />\n•<br />\nMultiplayer Madness - Four Players can compete against each other via<br />\nlocal networking on Nintendo DS or split-screen on Wii.</p>", "metacritic": null, "released": "2010-04-22", "tba": false, "updated": "2022-08-27T09:04:31", "background_image": "https://media.rawg.io/media/screenshots/9e8/9e8db0eec6ba42bc1d300e0bc462919b.jpg", "website": "http://ivythekiwi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "Nintendo DS", "Wii"], "developers": [], "genres": ["Platformer"], "publishers": ["XSEED Games"], "esrb_rating": null}