{"id": 264778, "slug": "travel-mosaics-6-christmas-around-the-world", "name": "Travel Mosaics 6: Christmas Around the World", "name_original": "Travel Mosaics 6: Christmas Around the World", "description": "Do you know how they call Santa Claus in Finland? What is the main dish on the Czech Christmas table? Where is located the world’s largest floating Christmas tree? What animal transports Santa Claus in Australia? You will find out all this and much more in “Travel Mosaics 6: Christmas Around the World”!Join the Walker animal family during their Christmas tour around the globe. Play and learn a lot of curious facts while answering tricky quiz questions and collecting gold coins and souvenirs.“Travel Mosaics 6: Christmas Around the World” is an amazing brain-jogging for everybody who wants enter the spirit of Christmas, learn something new about Christmas traditions worldwide, or just spend a nice time!<ul><li> Festive images, animation and music for entering the spirit of Christmas<br/></li><li> A gorgeous virtual tour around the globe, showing how they celebrate Christmas in different towns and countries<br/></li><li> 3 difficulty modes from single color relaxed playing to real challenges with color switching (up to 6 colors)<br/></li><li> 140 color-coded nonograms, 20 bonus nonograms + 20 additional puzzles<br/></li><li> Fun and challenging quiz questions about traditions of celebrating Christmas in different countries <br/></li><li> Enigmatic semi-abstract festive images to be disclosed on each level<br/></li><li> A heap of fun and a good deal of edutainment information</li></ul>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-08-28T21:51:09", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e0bbc79d7f5ad81d4fd9b07c1768f47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jetdogs Studios"], "genres": ["Casual"], "publishers": ["Jetdogs Studios"], "esrb_rating": null}