{"id": 264887, "slug": "wordhunters", "name": "Wordhunters", "name_original": "Wordhunters", "description": "Dive into a whole new world of competitive word games with your guide, Amy the Aviator. Fly around the globe to different cities, win rounds and claim letters from each location while blocking your opponents.<br/><br/>Use the free Wordhunters™ smart device App as a game controller to compete in 15 party-play word games suitable for the whole family. Test both your skills and your brain power in fun challenges like “Word Sushi”, “Alphabetty Forgetty”, and “Disemvowelled”, with endless replayability!<br/><br/>- 15 party word games suitable for the whole family!<br/>- Visit 20 global destinations from London to Tokyo and beyond!<br/>- Play in front of famous landmarks including the Eiffel Tower, Sydney Opera House, and Empire State building!<br/>- Drop-in/drop-out multiplayer for 2-6 Wordhunters!<br/>- Easily change language within the game and practice your foreign vocabulary!<br/><br/>The game can be played in American English, British English, French, Italian, German, Castilian Spanish, Latin American Spanish only.<br/><br/>1-6 players<br/>8GB minimum save size<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>Wordhunters and the Wordhunters logo are trademarks or registered trademarks of thumbfood Limited. All rights reserved. All other trademarks are the property of their respective owners. © 2018 thumbfood Ltd.All players must play Wordhunters™ in the same room – the fun takes place around one PS4™. Everyone should download and install the free Wordhunters™ app to their tablet/smartphone from their device’s app store – and then connect their device to the same Wi-Fi network as the PS4™ console.\r\n\r\nFor best performance, iOS 9+ or Android 4.4+ is recommended. Not all devices are compatible, see playstation.com/playlinkforps4. DUALSHOCK®4 is required for setup and PlayStation®4 system functions.", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-08-02T16:20:05", "background_image": "https://media.rawg.io/media/screenshots/915/91596549fec0534b2cdf2fc7e751125b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 0, "achievements_count": 39, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["thumbfood"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}