{"id": 264870, "slug": "a-horde-too-many", "name": "A Horde Too Many", "name_original": "A Horde Too Many", "description": "<strong>In a post-apocalyptic world</strong>, a group of survivors try to build a safe haven to call home. They must gather supplies, develop their base and carefully choose who to trust while surviving through never-ending hordes of zombies...<br/>Before one of those hordes becomes <strong>A Horde Too Many</strong>!<br/><br/><strong>•GAMEPLAY•</strong><br/>Collect unique survivors and strategically pick your team of apocalypse-hardened characters to fight through the outstanding amount of living dead that are trying to get your brains for a snack. Keep your base camp safe and develop your defenses while growing a community of bad-asses that you can command into the constant fight for survival. Explore the wastelands in search of supplies and face the unexpected dangers of the post-apocalyptic world of A Horde Too Many in a combination of Tower Defense and Survival RPG elements.<br/><br/><strong>•UPCOMING FEATURES•</strong><br/>- COLLECT dozens of characters with unique weapons, skills and fighting styles<br/>- DEFEND your base against never-ending hordes of undead and living threats<br/>- EXPLORE the vast wastelands through several deadly environments<br/>- UPGRADE your defenses and expand your camp by finding and spending supplies<br/>- MANAGE your resources and decide who gets to live another day<br/>- TEAM UP and face dangerous missions controlling up to four survivors at once<br/>- SURVIVE through the daily challenges of a post-apocalyptic world<br/>- CHALLENGE yourself in a time-trial competitive action survival mode<br/><br/>", "metacritic": null, "released": "2016-11-19", "tba": false, "updated": "2020-03-20T13:53:51", "background_image": "https://media.rawg.io/media/screenshots/06a/06a910f3c4b6695d780d3c54e3a91629.jpg", "website": "http://ahordetoomany.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21}, "playtime": 1, "achievements_count": 27, "ratings_count": 0, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AHordeTooMany", "Digitality Studios", "93Bits Studio"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Digitality Studios"], "esrb_rating": null}