{"id": 264828, "slug": "blazing-chrome", "name": "Blazing Chrome", "name_original": "Blazing Chrome", "description": "<p>In Blazing Chrome, machines rule the world and the few humans left are on the edge of total extermination, lacking power, prestige or status among their metal and circuits overlords. Bring your best pal and kick some metal butts to free the humankind while enjoying a classic run’n’gun, fully loaded with action and exciting fights!<br />\nHumans are expendable after an AI controlled robot army take over the world. They survive in hiding while their hunters rule the surface. When a small rebel group gets an intel about a big AI&#39;s power plant, the machines strike their camp before they can organize an attack. A small group of rebels escape and go in a suicide mission to destroy this power plant. Choose to play as Mavra, a super badass human resistance soldier, or Doyle, the equally groovy and deadly insurgent robot. This suicide mission will result in heavy casualties and a ton of lock-and-load fast-paced action where scraping robots and blazing chrome with your powerful weapons is the only thing standing between you and your freedom.<br />\nDash through 5 apocalyptic environments with hundred of robots-enemies to blow to pieces. Blast your way through the enemy lines and and try to defeat a bunch of mechanical bosses with using hoverbikes, huge armors and a whole arsenal of kick-ass weapons.<br />\nBlazing Chrome offers a lot of features in the legacy of classic run’n’gun games:<br />\n● Local Co-op Gameplay<br />\n● 16-bits post-apocalyptic environments<br />\n● Classic fast-paced run-and-gun experience<br />\n● Epic boss battles and crazy lot minibosses fights<br />\n● Genuine arcade feel<br />\n● Motorcycle and jetpack action<br />\n● Rad pixel art</p>", "metacritic": null, "released": "2019-07-11", "tba": false, "updated": "2023-11-28T01:22:24", "background_image": "https://media.rawg.io/media/games/650/650a77b1ea5632a4b99194ac7f082191.jpg", "website": "http://joymasher.com/blazing-chrome/", "rating": 3.77, "rating_top": 4, "added_by_status": {"yet": 45, "owned": 618, "beaten": 45, "toplay": 50, "dropped": 45, "playing": 14}, "playtime": 1, "achievements_count": 134, "ratings_count": 110, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 112, "platforms": ["PC", "Xbox One", "PlayStation 4", "Nintendo Switch"], "developers": ["JoyMasher", "The Arcade Crew"], "genres": ["Action", "Indie"], "publishers": ["The Arcade Crew"], "esrb_rating": "Teen"}