{"id": 264859, "slug": "nanotale-typing-chronicles", "name": "Nanotale - Typing Chronicles", "name_original": "Nanotale - Typing Chronicles", "description": "<p>Since time immemorial the Archivists have studied and cataloged the mysteries of the planet, observing its changes and holding to our vow of neutrality. Yet from the Ancestral Forest to the Blue Desert, the world is suffering. The Tree of Life sings the Final Song and we can feel it in our flesh: the world is dying. We bear witness, but we cannot interfere. We contemplate in silence.<br />\nNanotale - Typing Chronicles is an atmospheric typing adventure RPG set in a colorful vibrant world. Follow Rosalind, a novice Archivist, as she journeys out into a valley to collect plant and rock samples for further analysis. The valley is peaceful. War is a thing of the distant past. Nothing can go wrong with such a casual task... can it?FeaturesExplore a vibrant 3D fantasy world: play as the Archivist Rosalind on her journey to the very edges of the planet.<br />\nMore than just typing: Talk to other characters, solve mysterious puzzles, unleash magic powers and defeat enemies in epic magical fights<br />\nEverything with keyboard: from movements, combats to even menus, control everything with a keyboard<br />\nPlay in your own language: game texts are localized in English, French, German, Spanish, Portuguese (Brazil), Russian, Polish with voice-overs in English.<br />\nThe game supports several keyboard layouts (QWERTY, QWERTZ, AZERTY, BÉPO, Dvorak, Workman and Colemak)<br />\nMore features to be announced</p>", "metacritic": 68, "released": "2021-03-31", "tba": false, "updated": "2023-11-01T10:01:20", "background_image": "https://media.rawg.io/media/screenshots/ab8/ab8376ce80525ff745fa68b67fad3d53.jpg", "website": "http://www.nanotalegame.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 26, "owned": 119, "beaten": 3, "toplay": 14, "dropped": 7}, "playtime": 3, "achievements_count": 14, "ratings_count": 11, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["Fishing Cactus"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Plug In Digital", "Fishing Cactus"], "esrb_rating": null}