{"id": 26482, "slug": "flips-twisted-world", "name": "Flip's Twisted World", "name_original": "Flip's Twisted World", "description": "<p>\n      It started as an ordinary boring day for Master Fulcrum’s apprentice, \n      Flip, until he messed with a forbidden magic book and got sucked into \n      the crazy universe inside. Now, with the help of his cube companion, \n      Flip must puzzle his way through six topsy-turvy worlds, collect six \n      magical Chapter Stones and battle against a ghost of his master’s past \n      before he can return home.\n    </p><p>\n      Flip’s Twisted World is a 3D puzzle-platformer that follows the \n      adventures of Flip who is accidentally trapped inside a world where up \n      and down are just a matter of perspective. By turning a magic cube, he \n      is able to flip the world on its side, opening up new paths and \n      possibilities. Players must think “outside of the box” as they navigate \n      the world that is literally in the palms of their hands.\n    </p><p>\n      Features\n    </p><p>\n      • Use the Wii Remote to flip your world around 90° at will. Switch \n      perspectives to advance through topsy-turvy levels. A flick of the wrist \n      and an obstructing wall is now a path, a pit is now a corridor.<br/>• \n      Puzzle your way through six unique worlds: a celestial backwater, a \n      fractured castle, a dense jungle full of booby-trapped temples, a frozen \n      arctic wasteland, a network of subterranean lava caves and an intricate \n      clock tower in the sky<br/>• Collect five magic tools to aid you in your \n      quest<br/>• Meet unique characters along the way – some quirky and \n      helpful, others strange and dangerous<br/>• Unlock goodies and learn more \n      about the story by finding pieces of The Master’s journal<br/>• \n      Unlock alternate costumes to customize your character throughout the game<br/>• \n      Supports Wii Remote and Nunchuk, Classic Controller, or GameCube \n      controller<br/>• Original music score by Tommy Tallarico<br/>• \n      Includes the voice talent of Anthony Stewart Head\n    </p>", "metacritic": null, "released": "2010-09-07", "tba": false, "updated": "2019-09-12T06:38:17", "background_image": "https://media.rawg.io/media/screenshots/e09/e09824a0d218508aded22f90face29ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": ["Frozen North Productions"], "genres": [], "publishers": ["Majesco Entertainment"], "esrb_rating": null}