{"id": 264916, "slug": "rail-nation", "name": "Rail Nation", "name_original": "Rail Nation", "description": "Hop aboard the fascinating world of RAILROADS and become a transport tycoon in Rail Nation!<br/>Experience the globally popular STRATEGY GAME, play together with more than 3.5m other players for prestige and the top of the ranking!<br/><br/>Play Rail Nation now and expand your RAILWAY EMPIRE step by step in this simulation game, research advanced engines and build new transport routes. Keep improving your best strategy to make even more profit and prestige. Live through RAILWAY HISTORY in six thrilling eras and become the greatest railway magnate in the world. Team up with other players in powerful ASSOCIATIONS, dominate the game world and lead your city to VICTORY!<br/><br/>Secure victory with clever TACTICS, your trains and your association. Expand your RAILWAY NETWORK to bring new goods to your city and reap even greater profits and PRESTIGE. Keep upgrading your station buildings through 6 exciting eras and research lots of new, ORIGINAL ENGINES AND TRAINS.<br/>In the race to become the most successful city and association, your determination to win, the best STRATEGY throughout all eras and real TEAM WORK in your association are what count in Rail Nation. Install the train strategy game hit from Travian Games on your iPhone or iPad now and become a logistics tycoon.<br/><br/>• Experience and discover 6 eras of railroad history<br/>• Find the most lucrative routes for your goods<br/>• Expand your train station with 11 buildings and more than 269 upgrade levels<br/>• Team up with other players in mighty associations<br/>• Grab countless bonuses from competitions and historical workers<br/>• Join more than 3.5 million other players<br/>• Play two gripping scenarios - Classic and Steam over Europe!<br/><br/>Also fully playable on the same account using a web browser on your Mac!<br/>Full cross-platform functionality!<br/><br/>Issues &amp; questions: http://help.rail-nation.com<br/>Forum &amp; community: http://forum.rail-nation.com/<br/>Facebook: https://www.facebook.com/RailNation<br/>GTCs: http://agb.traviangames.com/terms-en.pdf<br/><br/>Rail Nation can be downloaded and installed for free. However, some in-game features can also be purchased with real money. If you don't wish to use this feature, please deactivate in-app purchases in your device settings. A network connection is required.", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-10-22T14:02:14", "background_image": "https://media.rawg.io/media/screenshots/449/4498d9c3a700d5915fb53d85baa266ac_rkwWd6R.jpg", "website": "http://www.rail-nation.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Travian Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Travian Games"], "esrb_rating": "Everyone 10+"}