{"id": 264931, "slug": "helix-waltz-dress-up-drama", "name": "Helix Waltz - Dress Up Drama", "name_original": "Helix Waltz - Dress Up Drama", "description": "When you first time dance in the rhythm of the Waltz, can you catch the eye of all the nobles?<br/>Those who only see my beauty are destined to lose. <br/><br/>*Brand new dress up game for wise and elegant girls.<br/>*A thrilling ballroom drama set in Baroque style dress.<br/>*Collect thousands of exquisite outfits hand-drawn by top artists.<br/>*Flaunt your social skills and be the fashion queen in Helix Waltz.<br/><br/>Background story:<br/>When you step onto the ballroom floor in the rhythm of the Waltz,<br/>Will you accept the invitation of some high officials?<br/>Keep your composure as a Lady to rival the social butterflies?<br/>Or investigate each conversation to gather valuable information?<br/>As a rising star, you might not even notice the obvious,<br/>YOU—are already the center of attention on this dance floor.<br/><br/>Let the hostile eyes glare, and the skeptics whisper,<br/>It only offers fresh stimulation for your growth.<br/>As you dance your way with dazzling grace,<br/>And mingle with the high society of Finsel,<br/>Let your charm win over their hearts,<br/>You burden is not only to restore your family name,<br/>But also to uncover secrets not yet revealed.<br/><br/>Game Features:<br/>[An enchanting tale of more than 800,000 words!]<br/>As a girl of a family fallen from grace, you now have a second chance to make your mark on high society. Through ballroom dancing and clever romancing, gather the information you need to restore your family’s name. <br/><br/>[Thousands of Vintage Hand-drawn Outfits]<br/>Dazzle the nobles with your vintage noble outfits from Baroque gowns to cute dresses. Tailor your outfit to fit your own style of noble fashion and take it to the beauty pageant. A keen eye for fashion and confidence will be your best weapon.<br/><br/>[Customize your looks with your own style]<br/>How to be noble without unique customizations to flaunt your style? Collect exotic designs to add your own flare to what’s in vogue. Through tailoring, dyeing, and enchanting clothes, you can wow the audience with your own special taste.<br/><br/>[50+ characters available for interaction]<br/>From nobles to celebrities, the ballroom is where it all acquaintances begin, and even some conspiracies. Who you interact with will define your relationship with them and each character has their own story, and secrets, to tell. Charm your favorites onto your side and unlock their side stories! <br/><br/>[Unlimited free balls for you to attend]<br/>There’s no limit on the number of balls you attend or restrictions on the clothes you can wear. You decide which balls to attend and whether you will use that chance to seek the truth or spread rumors, it’s all up to you!<br/><br/>Got any ideas? Suggestions? Need technical support? <br/>Feel free to contact us on Facebook: https://www.facebook.com/HelixWaltz<br/>Instagram: https://www.instagram.com/helixwaltz/", "metacritic": null, "released": "2018-11-12", "tba": false, "updated": "2019-07-29T18:40:52", "background_image": "https://media.rawg.io/media/screenshots/56a/56accb4e6df12fe327395ae9b68edcab_2G0jPFF.jpg", "website": "http://www.facebook.com/HelixWaltz", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BAITIAN TECHNOLOGY"], "genres": ["RPG", "Simulation"], "publishers": ["BAITIAN TECHNOLOGY"], "esrb_rating": "Teen"}