{"id": 265151, "slug": "ww1-era-army-force-shooting", "name": "WW1 Era Army Force Shooting", "name_original": "WW1 Era Army Force Shooting", "description": "Welcome to the thrilling atmosphere of the WW1! Today you're going to be a soldier, who is ready to help his comrades at the first call, so prepare your shooting skills and use them at a maximum level! War is war; grab your gun and be ready to cover your friends and protect them from the enemy's fire! Play WW1 Era Army Force Shooting and just enjoy it!<br/><br/>Ah, history... It's time to recall all the miseries and revenge the rivals of your ancestors! Always remember about your duty: you must win with minimum losses! Save as many army units alive as possible and you'll be generously rewarded with some points and, of course, fame! Help your comrades to defeat the opponent's army troops!<br/><br/>Defeat your rivals one by one or all at once and earn some useful points to upgrade your soldier and make it really universal! Ammo, reload, damage, accuracy, dodge, hits... everything is important when your rival is trying to defeat your comrades! Check this amazing WW1 Era Army Force Shooting and dip into the real atmosphere of those cruel days!<br/><br/>Use powerful weapons to get rid of your rival's army troops! Hide behind some natural shelters and obstacles - the action is taking place in the real taiga forest! Be quiet, accurate and fast - you won't be disappointed with your skills! Unleash your fury and win this fantastic war!<br/><br/>WW1 Era Army Force Shooting features:<br/>•\tStunning atmosphere of a real WW1<br/>•\tChance to choose your shooting weapon<br/>•\tArmy teamwork as the main profit<br/>•\tExciting taiga forest atmosphere made in 3D<br/><br/>Enjoy this awesome WW1 Era Army Force Shooting game, grab your gun and be ready to defeat all your rivals - win the war!", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-10-22T14:02:50", "background_image": "https://media.rawg.io/media/screenshots/06f/06f65834b5e3ee7eace5001605c4dbc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Action"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}