{"id": 265159, "slug": "life-of-house-pig-simulator", "name": "Life of House Pig Simulator", "name_original": "Life of House Pig Simulator", "description": "Start your farm life right here and right now being the best farm animal ever – a piggy boar! Fight with the other animals from this farm, build your own lair, search for the love of your life and watch your family growing – do everything possible to have fun! Play Life of House Pig Simulator game and just enjoy!<br/><br/>Explore this fantastic farm world full of different interesting animals, which are not so happy to see you! They may harm you, so be really careful and attentive to prevent some deadly meetings – you should continue your genus! So don’t search for troubles; search for your mate instead – you won’t be disappointed!<br/><br/>Earn points for different successfully done missions and power your super boar up making it more dexterous, powerful and endurable! Choose such fantastic skins as Forest, Black, Fire, Battle boar or even Albino and rush into this fantastic Life of House Pig Simulator – game for all ages and professions!<br/>Find your piggy mate, lead it to your super lair and here’s your family now – these little piggies are your children, so protect and feed them in time! Don’t forget to check your own indicators of health, hunger and energy and remember: if some of them drops, your family may be left without any breadwinner!<br/><br/>Life of House Pig Simulator features:<br/>•\tColorful and realistic simulator of piggy’s farm life<br/>•\tInteresting gameplay with lots of missions<br/>•\tWonderful enemies with special skills<br/>•\tBeautiful surroundings made in 3D<br/><br/>If you ever dreamed to live your life on a farm – it’s your chance! Become a domestic boar – best farm animal ever! Farm life is so interesting and beautiful, there’re so many different domestic animals! Learn how it is to become a little boar on farm! Play our new Life of House Pig Simulator game and you won’t be disappointed!", "metacritic": null, "released": "2017-11-29", "tba": false, "updated": "2019-10-22T14:02:52", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbe1f43c060257d202ed7ec7c9b64005_jqPbtm7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}