{"id": 265174, "slug": "king-crab-survival-simulator", "name": "King Crab Survival Simulator", "name_original": "King Crab Survival Simulator", "description": "Do you love animal simulators? Feel like a red king crab with our new animal simulator! Pave your way through the coast of the tropical island, run forward and enjoy the micro world in King Crab Survival Simulator!<br/><br/>This ultimate giant enemy crab simulator would give you an opportunity to live the whole life of single crab – from the small weak and helpless larvae through mature stallion to the ghost of the old crab! Make a family with females, build your own nest and raise little spawn to continue your crab clan! Collect enough dead fish to feed your little family! Be careful and protect each egg to give birth to your progeny!<br/><br/>This wild tropical island is full of danger! But don’t be afraid too much, ‘cause you are the most horrible arthropod ever! Keep an eye on your crab health, energy, water, and food indicators – if one of them drops, your chances to survive and breed will drop too!<br/>Earn points to customize your crab and power up its skills! Maltese freshwater crab, Shanghai hairy crab, horsehair crab, boxer crab, rainbow crab and even marsh crab – which one would you choose? Unlock them all!<br/><br/>Seek for prey, find a mate, make a family, fight scorpions and spider and have fun with King Crab Survival Simulator!<br/><br/>King Crab Survival Simulator features:<br/>• Realistic giant land crab simulator<br/>• Opportunity to mate and raise up little heirs<br/>• Wide range of dangerous predators and insects<br/>• Amazing 3D graphics", "metacritic": null, "released": "2017-10-23", "tba": false, "updated": "2019-10-22T14:02:55", "background_image": "https://media.rawg.io/media/screenshots/ea6/ea62c8ac201ec86935fa4732f6d4a402_B5jIVfl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}