{"id": 265143, "slug": "sticky-man-survival-nights", "name": "Sticky Man - Survival Nights", "name_original": "Sticky Man - Survival Nights", "description": "Are you afraid of the dark? The nightmare begins! Work as a night guard, watch your security camera, open or close door and be ready to face your darkest fear with Sticky Man - Survival Nights!<br/><br/>Spend five nights at the Mad House! Sit on the chair, watch on the monitors, open or close doors and be very careful – strange hideous horrific creatures are dwelling inside! These empty halls filled with ghost and shades of the previous majesty. Scarlet velvet curtains, broken dolls, and mannequins, dusty bed with large canopy, moldy refrigerator – all here looks broken, forgotten and abandoned. But after night fall something wicked starts going on!<br/><br/>The ancient evil awakened, and now demons (or fiends) materializes inside this empty house of slaughter! You don’t actually know what are they – maybe materialized ghosts, broken robot animatronic animals or possessed stick men – but they are very, VERY scary and dangerous! Open or close doors on their ways to avoid meetings with this legion of Hell!<br/><br/>Watch their movement with cameras and try to survive! When you run out of power for the night - all cameras and light are off and beasts of darkness are able to move! Mind your energy bar – if it ends, your life would end too! Use earned points at the in-game store to restore your energy!<br/>Finish your work as a night guard safe and sound after five scary and horrible nights with Sticky Man - Survival Nights!<br/><br/>Sticky Man - Survival Nights features:<br/>Ultimate horror game<br/>Haunted mansion of despair filled with monsters and devils<br/>Different monster creature for each night!<br/>Thrilling and addictive gameplay!<br/><br/>Keep the door battery power charged up and be ready to the scariest week in your life with Sticky Man - Survival Nights!", "metacritic": null, "released": "2017-09-20", "tba": false, "updated": "2019-10-22T14:02:49", "background_image": "https://media.rawg.io/media/screenshots/fd7/fd7d6f3649b2e9207a5fb9c956232b0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Puzzle"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}