{"id": 265170, "slug": "future-robot-transform-train", "name": "Future Robot Transform Train", "name_original": "Future Robot Transform Train", "description": "Enjoy fantastic combination of train driving simulator and robot fighting contest! We prepared something absolutely amazing for you - Future Robot Transform Train game! Enjoy your transformations from ordinary train to a large robotic creature, explore this futuristic city filled with interesting enemies and just have fun!<br/><br/>It’s high time to start your city adventure! Watch the mini map carefully to prevent sudden attacks from your crafty opponents, ‘cause it’s really dangerous! Enjoy this fantastic life of large cruel machine, roam about the city, fight with different machines and robots and just enjoy! Rush into this huge modern city filled with different vehicles, robots, police cars and army machine!<br/><br/>Feel the power of your own engine and remember: they all want to exterminate you, so keep your weapons alert; otherwise you may become dead in a really inappropriate moment! Try our new Future Robot Transform Train game for all train simulators and robot fighting lovers!<br/><br/>Earn points for each successfully done mission and unlock new skins for your train! Power your super transforming train up and become faster, stronger and more maneuverable! Buy new weapons like super machine gun and be ready to destroy every robot and leave nothing but ruins from this city!<br/><br/>Future Robot Transform Train features:<br/>•\tJust try this ultimate combination of train driving and robot fighting simulators<br/>•\tDon’t lose your chance to power your train transformer up and customize it<br/>•\tEnjoy colorful 3D graphics full of interesting objects<br/>•\tDon’t miss any challenging mission to become really powerful and great<br/><br/>Ever dreamed to become a train driver? Or may be to control huge robot terrorizing the city? We have really good news for you then! Download our new Future Robot Transform Train game, which has this ultimate combination of train robot fighting and racing simulator!", "metacritic": null, "released": "2017-09-20", "tba": false, "updated": "2019-10-22T14:02:54", "background_image": "https://media.rawg.io/media/screenshots/966/966daf1fa4c9c7057f740bf32e21de58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}