{"id": 265167, "slug": "dino-park-sky-tram-simulator", "name": "Dino Park Sky Tram Simulator", "name_original": "Dino Park Sky Tram Simulator", "description": "Watch the prehistoric past and the flaming future together in one game trying to control sky tram riding on special wires through the Jurassic Park! The scientists reconstructed the dinosaurs’ era and create the fantastic park opened for visitors, so become a part of this program with our new Dino Park Sky Tram Simulator game!<br/><br/>Wanted to see different prehistoric creatures with your own eyes? Here’s your unique chance! Become a driver of beautiful sky tram and prove your passengers that you’re the best in this profession! Maintain high speed, but avoid accidents – try to not crash into the other trams! Face challenges, don't miss any station and deliver passengers right to their destination point!<br/><br/>Show your passengers such long-extinct beasts like Spinosaurus, Allosaurus, Stegosaurus, Ankylosaurus, Triceratops, Velociraptor, and, maybe, even T-REX himself! Earn points to unlock new types of trams or power your current one up and become the most skillful Jurassic train driver ever! Your passengers are always in hurry – they want to feed Baryonyx, watch the flight of Pterodactyl flocks and swim with Pliosaurus (famous ‘Predator X’)! So deliver them to their destination points high above the zoo, earn money and have fun playing Dino Park Sky Tram Simulator!<br/><br/>Drive a sky tram going by suspended cables of Jurassic Zoo! Ride fast, watch beautiful dinosaurs from above and enjoy our unusual sky tram simulation game!<br/><br/>Dino Park Sky Tram Simulator features:<br/>• Watch the future and the past right in one game<br/>• Gain this ultimate experience of sky tram driving<br/>• Power your tram up and become the best driver ever<br/>• Deliver passengers to the different parts of park<br/>• Enjoy nice 3D graphics<br/><br/>Ever dreamed to see the dinosaurs with your own eyes? Now you have this wonderful opportunity! What’s more - become the mega sky tram driver, transport different tourists and employees through the wonderful Jurassic Zoo and have fun with Dino Park Sky Tram Simulator game!", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-10-22T14:02:53", "background_image": "https://media.rawg.io/media/screenshots/f48/f48722a980210549d27b31f9eef29ddd_InKH48s.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}