{"id": 265165, "slug": "dragon-war-fantasy-town", "name": "Dragon War - Fantasy Town", "name_original": "Dragon War - Fantasy Town", "description": "Be a dragon returned from the dark ages, fight for your against human military forces and have fun with Dragon War - Fantasy Town!<br/><br/>Magic portal was broken, as you understand now, and instead of your hometown, you were teleported somewhere else. Now it’s high time to show mankind who’s the true lord of these lands! Scare citizens, crash their tanks and helicopters, avoid attacks of cops and SWAT and have fun!<br/><br/>Feel like an ancient beast wreaking chaos and mayhem in the big modern city! Flap your webbed wings, fly over the skyscrapers, and breath fire! Hunt humans, chase cars and feel like a real monster from horror movies!<br/><br/>Unleash your anger on the modern city full of cars, skyscrapers and hurrying humans! Be a real ancient terror awakened in flesh and power - burn, crush and destroy of this nest of stupid skin monkeys!<br/><br/>Earn points to upgrade your fighting and surviving skills, unlock new breath weapon attacks or skins for your dragon! Cyborg dragon, armored riding beast, swamp wyvern and others – check it all and choose the best!<br/><br/>Turn citizens into a panic, destroy their homes and enjoy Dragon War - Fantasy Town!<br/><br/>Dragon War - Fantasy Town features:<br/><br/>Ultimate dragon survival simulator<br/>Big modern city as your playground<br/>Hunt citizens, attack skyscrapers, and cars, struggle against helicopters, tanks and howitzers!<br/>Fell like a powerful ancient beast without fear or mercy!", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-10-22T14:02:53", "background_image": "https://media.rawg.io/media/screenshots/502/5029725a2a39aef5f2e400b7c10c5038.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}