{"id": 265176, "slug": "extreme-car-driving-school", "name": "Extreme Car Driving School", "name_original": "Extreme Car Driving School", "description": "Ever dreamed to drive a car but had no chance to do it? So check our new ultimate Extreme Car Driving School game and become the most experienced driver ever! Rush into the city streets in your modern colorful car, perform different stunts, try not to crash your car in the first several minutes and just have fun!<br/><br/>Check this ultimate game for all the racing games’ lovers and you absolutely won’t be disappointed! Fit into every difficult turn, follow road markings, stop accurately and become the best driver ever! Control your auto really accurate and careful to follow all the traffic rules, because they’re really strict! Train hard and you’ll achieve a great success in this interesting driving course!<br/><br/>Wanted to learn how to drive a car, but have no time to attend special courses? Now you have a chance to practice your skills right at your home with our new Extreme Car Driving School game!<br/>Practice your skills to earn points for successfully completed missions and buy new car or upgrade such characteristics as brakes, speed and mobility of your current vehicle! Color it up with new shades or buy new powerful auto to finish your training well and don’t forget to mind that every mistake will cost you some points!<br/><br/>Extreme Car Driving School features:<br/>• Unusual driving school simulator<br/>• Interesting and difficult missions for experienced drivers<br/>• Great variety of colorful cars<br/>• Amazing 3D surroundings<br/><br/>Become a driving school student, level your skills up to perfection and have fun playing Extreme Car Driving School! Complete every difficult mission and learn various driving tricks and stunts! Master your skills and become the best driver ever!", "metacritic": null, "released": "2017-10-06", "tba": false, "updated": "2019-10-22T14:02:55", "background_image": "https://media.rawg.io/media/screenshots/698/6988034ebe115b448a6b7a00b388314c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}