{"id": 265199, "slug": "pirate-prison-break-mission", "name": "Pirate Prison Break Mission", "name_original": "Pirate Prison Break Mission", "description": "Become a strong and dexterous filibuster hero trying to escape from his enemy’s territory! Fight with different powerful rivals with your mighty weapon, find interesting secrets of this place, improve your saber fighting skills and just survive as long as you can with Pirate Island Prison Break Mission game!<br/>You are incredible pirate, who is faster than wind, more invisible than the air and stronger than anybody else! Do your best and improve your fighting skills cutting your way through the endless waves of aggressive sailors, soldiers, conquistadors and the other pirates! Merge with shadows, steal through this picturesque island place and strike your deadly blows exactly in time!<br/><br/>Earn points for each successfully killed enemy and power your pirate warrior up to become healthier and faster! Unlock new powerful weapons like saber, cutlass, dagger, razor sharp knife and many other! Use the appropriate weapon to defeat super enemies, finish your attacks with the unbelievable power and just have fun playing Pirate Island Prison Break Mission!<br/><br/>Improve all your fighting skills being super dexterous ninja! Mind your energy and health indicators and remember: if one of them drops, you may suddenly find your dexterous pirate in a really difficult situation! Gather health potion to have your stats in balance, find interesting chests with the new weapons and escape successfully!<br/><br/>Pirate Island Prison Break Mission features:<br/>• Ultimate filibuster prison escape simulator<br/>• Wide range of different powerful rivals<br/>• Interesting types of weapons like dagger or cutlass<br/>• Awesome 3D graphics<br/><br/>Yo ho ho, ladies and gentlemen! Learn the path of the real ninja with Pirate Island Prison Break Mission game! Dip into the atmosphere of eternal pirate scrambles and just try to survive and escape!", "metacritic": null, "released": "2017-10-02", "tba": false, "updated": "2019-10-22T14:02:56", "background_image": "https://media.rawg.io/media/screenshots/8ac/8ac75ec4a80ea4d9ee0b57bad030b0cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}