{"id": 265161, "slug": "evolve-alien-hybrid-monster", "name": "Evolve Alien Hybrid Monster", "name_original": "Evolve Alien Hybrid Monster", "description": "Emerge into the strange and horrific world being a mutating alien beast! Watch the evolution by yourself and have fun playing Evolve Alien Hybrid Monster!<br/><br/>These dangerous beasts are everywhere! They're crawling over the walls and caves – and you’re one of them! Make your own unusual alien beast, hunt other unspeakable creatures from another side of reality, evolve – do your best to win! Do your best to survive and evolve into the perfect shape – absolute instrument of destruction and fear!<br/><br/>Evolution is a solution if you really gonna win! So, chase and hunt other beasts for their DNA to change your own creature! Gain the real power using different biological weapons, attack them first and evolve successfully!<br/><br/>Earn points for successfully killed rivals and visit the armory to power-up your super alien with sharp jaws, speed wings or something else! Claws, fangs, spikes, armored hide, acidic saliva, corrosive blood, poison sting on the tail – use different upgrades to win!<br/><br/>Your chitinous armor is hard as steel, and your claws are as sharp as razor! Be the scary deadly creature from the outer space and horror movies and have fun with Evolve Alien Hybrid Monster!<br/><br/>Evolve Alien Hybrid Monster features:<br/>• Ultimate evolving Xeno monster simulator<br/>• Wide range of different biological weapons - including bio plasma guns!<br/>• Interesting types of evolution<br/>• Addictive gameplay with simple and intuitive controls", "metacritic": null, "released": "2018-01-02", "tba": false, "updated": "2019-10-22T14:02:52", "background_image": "https://media.rawg.io/media/screenshots/a93/a9377f4a6228e90c3e93df4ba30b9970_aQfXOF4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Action"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}