{"id": 265173, "slug": "fairy-mahjong-magic-quest", "name": "Fairy Mahjong Magic Quest", "name_original": "Fairy Mahjong Magic Quest", "description": "Enjoy this magic version of famous Shanghai solitaire game! Solve all puzzles, complete all missions and have fun with Fairy Mahjong Magic Quest!<br/><br/>Explore the fantasy world filled with magical, mythical and legendary creatures, face different opponents and use all your skills to break through the magic barriers! These creatures use special runes that look like a Mahjong tiles! So, solve all alignments of tiles to move forward and reach your destiny!<br/><br/>Check two game mode – campaign mode, where you should fight against knights, Titans, fairies, dragon, witches, and others to find your way to the Source of Magic; and free game, where you can just play majong at the unlocked rooms!<br/>The Source of Magic is waiting for you! Rush on and don’t be scared! Enjoy the infinite gameplay of the famous Shanghai solitaire game! Play the specific variation of the game of ancient Chinese Mandarin and Emperors, test your logic skills and have fun with Fairy Mahjong Magic Quest!<br/><br/>N.B.: This free mah jong solitaire game has only one simple yet addictive rule: match and clear all the identical tiles. Each tile has a picture on it, there are 43 different pictures in total. Flowers, dots, dragons, winds, seasons – all tiles must be selected and matched with other tiles of the same picture. Whenever you match two tiles, they both disappear, and when all tiles have disappeared the game is over.<br/><br/>Fairy Mahjong Magic Quest features:<br/>Unusual Mahjong Solitaire simulator<br/>Interesting campaign mode<br/>Difficult missions and quests<br/>Simple but addictive gameplay<br/><br/>Enjoy this magic version of famous Shanghai solitaire game! Solve all puzzles, complete all missions and have fun with Fairy Mahjong Magic Quest!", "metacritic": null, "released": "2017-09-22", "tba": false, "updated": "2019-10-22T14:02:54", "background_image": "https://media.rawg.io/media/screenshots/8ce/8ce888c2999a62e1a5c938a13b2a015b_uSy0Si3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Puzzle"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}