{"id": 265145, "slug": "barbershop-beard-shaving-salon", "name": "Barbershop Beard Shaving Salon", "name_original": "Barbershop Beard Shaving Salon", "description": "Ever wanted to become a hairdresser, but your relatives was against this choice? Just try our new trendy Barbershop Beard Shaving Salon game and learn more about this interesting profession! Every client has its own preferences and desires, so do your best and make their hair and beards look really perfect!<br/><br/>Try on the image of a modern barber trimming hipster beards and hair and just have fun! Try different difficulty levels for the most experienced barbers and power your salon up! Customize your working space with such trendy and interesting things as fidget spinner and vape and your clients won’t be disappointed!<br/><br/>Earn points for different successfully completed haircuts and beard shavings and become one of the most successful barbers in this game! Be cool with Beard Shaving Salon Simulator: Barber Shop 3D game and just have fun!<br/><br/>Power your skills up to become a real pro barber and make outstandingly modern hipster cuts! Prove that your barbershop is worth to become the most famous in the neighborhood! Power your skills up to become a real pro barber and make outstandingly modern hipster cuts! Prove that your barbershop is worth to become the most famous in the neighborhood!<br/><br/>Barbershop Beard Shaving Salon features:<br/>•\tFantastic chance to try yourself in this interesting profession<br/>•\tInteresting haircuts and beard shapes for each client<br/>•\tColorful surroundings and modern outfit<br/>•\tGreat way to check your shaving and cutting skills<br/><br/>Open your own small barbershop – be edgy! If you ever dreamed to make great haircuts, then this fantastic game is made exactly for you! Play our new Barbershop Beard Shaving Salon and have fun!", "metacritic": null, "released": "2017-11-18", "tba": false, "updated": "2019-10-22T14:02:49", "background_image": "https://media.rawg.io/media/screenshots/675/67584224a81ed98ce8fc469389ca52e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}