{"id": 265146, "slug": "wolf-family-quest-online", "name": "Wolf Family Quest Online", "name_original": "Wolf Family Quest Online", "description": "Explore the fantastic surroundings, hunt different animals to feed your wolf family and carry them to your lair! Return the power over this magical world to the wolves with Wolf Family Quest Online!<br/>Live a life of the fantastic wolf pack! Roam about the beautiful forests and green plains and become the real terror for the other players! Join the battle of predators – tigers, wolves, and foxes - for these plains and forest! Destroy other carnivores’ lairs, fight with other wolves or make friends with them and eat unlucky herbivores (rabbits and boars) to survive!<br/><br/>Become the most dangerous and terrifying beast in this forest! Use your sharp fangs and claws to tear your prey apart and don’t forget that there are a lot of horrible creatures willing to kill everybody like you! Fight against the Tigers’ invasion, control own wolf pack and have fun!<br/>Make your own pack of wolves! Raise your little descendants, protect them from the monsters and let all your wolf dreams come true! Don’t forget to mind your energy, health and hunger stats – if they drop your chances to live long and prosper as the terrifying monster will drop too!<br/><br/>These beauty lands always were under the rule of the Wolf Pack! Your kind was the true owner of these forests and plains! Rabbits and boars were your cattle and food, sneaky foxes were your servants and lackeys, birds sang airily and all was nice, but then came tigers! They are mighty, strong, aggressive, and they’re trying to exterminate wolves and conquer the Throne of these lands! Complete various exploring and battling missions to magnify your power and level up in Wild Wolf Quest Online!<br/>Earn points for various exciting contests and upgrade your wolf skills! Choose the name of your wolf and customize it as you wish! Explore the magic inside your blood, tame the power of the volcano and unlock new bright skins with unique abilities!<br/><br/>Multiplayer mode would be added soon for your pleasure! Fight with other players to become the real king of these places or cooperate with them to create the huge pack and battle with other wolves! Choose your wolf and enjoy this colorful world in Wolf Family Quest Online!<br/><br/>Wolf Family Quest Online features:<br/>• Fantastical wolf survival simulator<br/>• Different missions with cruel enemies<br/>• Various colorful wolves<br/>• Exciting chance to live a life of a whole wolf pack<br/><br/>Being a wolf and controlling the whole pack is not a fantasy anymore – it’s reality! Choose your wolf and enjoy this colorful world in Wild Wolf Quest Online!", "metacritic": null, "released": "2017-09-28", "tba": false, "updated": "2019-10-22T14:02:49", "background_image": "https://media.rawg.io/media/screenshots/34c/34c543c8ab288f177789973268f310b6_VGn5YsJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["Simulation"], "publishers": ["Sergey Zanin"], "esrb_rating": "Teen"}