{"id": 26516, "slug": "final-fantasy-the-4-heroes-of-light", "name": "Final Fantasy: The 4 Heroes of Light", "name_original": "Final Fantasy: The 4 Heroes of Light", "description": "<p>\n      FINAL FANTASY: THE 4 HEROES OF LIGHT is a beautifully rendered, original \n      adventure brought to you by the acclaimed creators of FINAL FANTASY on \n      Nintendo DS. Master all-new combat and game systems and immerse yourself \n      in a charming storybook setting as you take on the roles of Brandt, \n      Jusqua, Yunita and Aire. Though at first they don’t always see eye to \n      eye, these four Heroes of Light will embark on a journey full of joyous \n      meetings and sad partings that will build bonds of trust and affection \n      so strong that, in the end, they may even save the world…\n    </p><p>\n      Features\n    </p><p>\n      • The first original FINAL FANTASY title for Nintendo DS brought to life \n      by the development teams behind the Nintendo DS remakes of FINAL FANTASY \n      III and FINAL FANTASY IV.<br/>• Charming storybook visuals crafted under \n      the guidance of art director and character designer Akihiko Yoshida \n      (FINAL FANTASY III for DS, FINAL FANTASY XII).<br/>• Combat is fun and \n      intuitive with a battle system that operates on Action Points. Requiring \n      nothing more than a simple selection of commands, players can dive right \n      into a classic turn-based RPG battle experience.<br/>• The Crown Job \n      System offers a selection of over two dozen jobs to choose from. Players \n      can freely customize a character’s abilities and magic skills no matter \n      which crown they have equipped. The possibilities are endless!<br/>• Help \n      friends advance in their adventure, or join forces to conquer tough \n      dungeons. The multiplayer mode enables cooperative play for up to four \n      players.\n    </p>", "metacritic": null, "released": "2010-10-05", "tba": false, "updated": "2019-09-12T06:37:01", "background_image": "https://media.rawg.io/media/screenshots/f2f/f2fb8ac13628a46ecf6fd1fbfa45e7c5.jpg", "website": "http://www.ff4heroes.com/", "rating": 3.67, "rating_top": 5, "added_by_status": {"yet": 7, "owned": 8, "beaten": 5, "toplay": 9, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 6, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Square Enix"], "esrb_rating": null}