{"id": 265147, "slug": "high-school-cafeteria-cashier", "name": "High School Cafeteria Cashier", "name_original": "High School Cafeteria Cashier", "description": "Feel like a real school dining room chef and become one of the best! Your young customers are so hungry, they really don’t want to wait for their meals for too long, so hurry up! Roll up your sleeves - the time to cook amazingly delicious school lunches has come! Check our High School Cafeteria Cashier game and have fun!<br/><br/>Memorize all the cooking steps, use only fresh ingredients and win the hearts of the most detrimental teen schoolers! Do your best to remember all the cooking steps in the right order, make really delicious burgers and sandwiches, make the lemonade or juice (or even oxygen and protein cocktail), put some apples - and your school lunch is ready now!<br/><br/>Try different types of recipes and find the best one to charm your teen customers once and for all! They can go mad and the rating of your wonderful school lunch cafe will fall! Do your best and prevent this growing discontent making them the most wonderful pixel lunch boxes! Mind that every right cooked lunch can lead you to the unbelievable success!<br/><br/>Earn points for different cooking missions, learn new difficult recipes, upgrade your kitchen space as you wish and just enjoy the process of cooking! Become the best school lunch chef in this colorful pixel town! Gain the best reputation in this small but wonderful city, learn as many school lunch recipes as possible and become the real pro with High School Cafeteria Cashier!<br/><br/>High School Cafeteria Cashier features:<br/>• Nice opportunity to upgrade your cooking skills with various difficult recipes<br/>• Enjoy interesting and colorful pixel surroundings<br/>• Explore various types of amazing cooking missions<br/>• Addictive gameplay with simple and intuitive controls", "metacritic": null, "released": "2017-09-15", "tba": false, "updated": "2019-10-22T14:02:49", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e5f91e45a1400873ea9e9d58ba11ea9_t7YznzO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["RPG"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}