{"id": 265144, "slug": "sim-block-house-craft-n-design", "name": "Sim Block House Craft n Design", "name_original": "Sim Block House Craft n Design", "description": "If you ever wanted to become a famous architect or house designer, this amazing crafting simulator is made exactly for you! Try different resources and furniture combinations, build your own house with as many rooms as possible, decorate it with your own style and just enjoy Sim Block House Craft &amp; Design game!<br/><br/>Enjoy the opportunity to build your own world filled with wonderfully decorated buildings! Do what you really want right in your smartphone and without living your room exploring this huge open world filled with different resources and decorations! Become the best home designer ever with our amazing crafting system! Collect different resources to furnish your large residence and prove your designer’s skills!<br/><br/>Explore this fantastically colorful world full of different interesting resources for your amazing craft! Gather woods, stones, leaves and other vital things to create the most wonderful house and furnish it with colorful sofas, armchairs, tables and many other things! Unlock different animals to make your living place more comfortable, positive and cozy! Collect resources and buy different skins for your character to customize it as you wish playing Sim Block House Craft &amp; Design!<br/><br/>Check your skills in design crafting different things and just do what you want in this outstanding game for all ages! Just gather resources and use your tools to craft the most amazing house you’ve ever seen before!<br/><br/>Sim Block House Craft &amp; Design features:<br/>- Colorful home craft design simulator<br/>- Huge and bright open world full of different resources<br/>- Really nice craft system for more fun<br/>- Addictive gameplay with simple and intuitive controls<br/>- Outstanding 3D graphics<br/><br/>Create your own house, decorate it with different stuff, furnish it with fantastically colorful things and just enjoy the life in this simple and creative world with your own rules playing Sim Block House Craft &amp; Design!", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-10-22T14:02:49", "background_image": "https://media.rawg.io/media/screenshots/dfd/dfde4d78afdd0f8aca98e57b6fadc221.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Zanin"], "genres": ["RPG"], "publishers": ["Sergey Zanin"], "esrb_rating": "Everyone 10+"}