{"id": 26520, "slug": "super-scribblenauts", "name": "Super Scribblenauts", "name_original": "Super Scribblenauts", "description": "<p>\n      Super Scribblenauts for Nintendo DS expands the innovative elements from \n      the award-winning first title with inventive new features, including an \n      adjectives system and upgraded controls to create an incredibly fresh \n      and entertaining gameplay experience. Created and developed by 5TH Cell, \n      players use the stylus and touch screen along with their imagination to \n      help Maxwell, the game’s hero, solve robust puzzles and challenges in \n      redesigned levels to acquire the “Starite.”\n    </p><p>\n      In Super Scribblenauts, players now have the ability to write any object \n      that comes to mind and modify it in any way they desire, using \n      adjectives to reach the goal in each level. Adjectives can change the \n      color, size, elements, behaviors and many other aspects of the object \n      they are describing. Multiple adjectives can be combined together to \n      produce incredibly creative objects, allowing the player’s imagination \n      to run wild for a truly unique and individualistic experience.\n    </p><p>\n      Features\n    </p><p>\n      • Brand New Levels: Experience 120 brand new, in-depth \n      levels that include task such as finding a cure for the plague, \n      populating an office or identifying animals with shells.<br/>• All-New \n      Adjectives System: Create a shy green polar bear or an angry zombie \n      pear! 10,000+ adjectives reflect real life behaviors, personalities and \n      characteristics when applied to objects.<br/>• Multi Layered Hints: \n      Just can’t figure that puzzle out? Purchase more explicit hints at a \n      decreasing Ollar cost over time.<br/>• Universal Feedback System: Visualize \n      progress throughout each level! Relevant objects summoned get a thumb \n      up, while irrelevant objects get a thumb down.<br/>• Updated \n      Dictionary: Summon more than 800 all-new, customizable objects to \n      solve puzzles and earn Starites.<br/>• New Control Schemes: Control \n      Maxwell with the D-pad or with updated and more precise new Stylus \n      controls! Weight, buoyancy, friction have all been reworked to make \n      objects interact better to the player’s input and reflect any adjective \n      that is applied to an object.<br/>• New Level Editor: Create \n      both puzzle and action levels to build your very own custom playground. \n      The unique new template system allows players to create all kinds of \n      objectives for their levels with ease.\n    </p><p>\n      • Innovative UI: An exciting new UI gives players more \n      control over gameplay, with more detail on how to navigate through new \n      levels in the game.\n    </p>", "metacritic": null, "released": "2010-10-12", "tba": false, "updated": "2023-06-21T02:48:44", "background_image": "https://media.rawg.io/media/screenshots/37c/37c227a63e497594abc221b98d9b970c.jpg", "website": "", "rating": 4.05, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 12, "beaten": 17, "toplay": 2, "dropped": 11, "playing": 2}, "playtime": 4, "achievements_count": 0, "ratings_count": 19, "suggestions_count": 83, "game_series_count": 5, "reviews_count": 19, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Warner Bros. Interactive"], "esrb_rating": null}