{"id": 265561, "slug": "knights-of-extozia", "name": "Knights of Extozia", "name_original": "Knights of Extozia", "description": "<p>Welcome to Extozia! A world consisting a big forest and a huge mountain separating the world in two. Explore the idyllic forest filled with flowers, rivers and boats or the deep tunnels of the mountain, where monsters, dragons and chests can be found and either fought or collected.<br/></p>\n<p>Grab your friend and fight to find out who is the greatest knight of Extozia or work together to complete different challenges.</p>\n\n<p><strong>Browser support (Important!):</strong><br/></p>\n<p>The game works best in Chrome on Windows or Safari on Mac.</p>\n<p>Should you encounter any problems, please try switching to the recommended browser for your system.</p>\n\n<p><strong>Controller support:</strong><br/></p>\n<p>The game support up to two controllers. Both Xbox and PS3/4 controllers are supported. Simply connect your controller to your computer via USB or Bluetooth. Connect you controller to the game in the Play Menu. If your controller doesn't show up, please try pressing any button on it, and make sure it shows up here. If you still can't get it working, please comment down below or contact me at felix.paulsen@gmail.com.</p>\n\n<p><strong>Feedback and bugs:</strong><br/></p>\n<p>I would love to hear your feedback and ideas concerning the game. The game is still in development and updates will be published. Comment down below or email me.</p>\n<p>Should you encounter a bug while playing please comment below or contact me at felix.paulsen@gmail.com.</p>\n\n<p><strong>Credits:</strong><br/></p>\n<p>Game design, programming and graphics by Felix Paulsen.</p>\n<p>Music by Sofus Lindberg.</p>\n<p>Sounds found at freesound.org and are all under CC0 1.0.</p>", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/92c/92cb184fa06d2af183fd449ef4c2c1ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Felix Paulsen"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}