{"id": 265541, "slug": "chaos-dream-retribution", "name": "Chaos Dream: Retribution", "name_original": "Chaos Dream: Retribution", "description": "Your village is in ruins, and your father has passed away. It's up to you to right these wrongs, and return your homeland to the prosperity it once enjoyed.<br/><br/>Join Grigori, a young boy tasked with restoring his family's honor in his journey of adventure and discovery as he seeks out an evil force to extinguish it once and for all.  <br/><br/>Venture through deserts, swamps, and dense forests in search of the truth -- and it may not be what it seems.<br/><br/><ul><li>Beautiful, 720p widescreen detailed maps draw you into the world.<br/></li><li>Professional voice acting and orchestral music give the world depth and life.<br/></li><li>Full suite of customizable control options with keyboard/mouse/gamepad.<br/></li><li>Over a dozen different quests, many designed to interlock to create the storyline.<br/></li><li>Full animated sideview battles with over 20 different skills to try out, and two distinctly different companions you can choose.<br/></li><li>Fullscreen mode from the options, and FPS Sync for monitors.<br/></li><li>Over 150 weapons, armor and items in the game, some randomized with prefixes for strong replayability. Loot is also randomized every game.<br/></li><li>Both on map and some random encounters for maximum replayability.<br/></li><li>Strong narrative and twists and turns give the game weight.</li></ul>", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-10-29T10:04:34", "background_image": "https://media.rawg.io/media/screenshots/5bd/5bd6573889177945417e4af8e9029fc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SimProse Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["SimProse Studios"], "esrb_rating": null}