{"id": 265633, "slug": "subway-run-quad-bike-racing-free", "name": "Subway Run: Quad Bike Racing FREE", "name_original": "Subway Run: Quad Bike Racing FREE", "description": "<p>You might have played many bike riding games. Get ready for an ultimate subway run as 3D Brain Games brings you an amazing action packed 3D Subway Run: Quad Bike Racing FREE in an endless racing game. Enjoy the exciting subway racing bike mania in which you can choose from different characters to play as the best ATV quad bike rider. Swipe to turn, jump and slide to avoid hitting obstacles, barrier and subway trains to be the subway rider. This offroad quad bike 3D simulator game of 2018 will take you across the river, mountains and difficult downhill roads being the best free bike racing game. <br/><br/>Have an exciting subway run on your 4x4 ATV quad bike, collect coins and buy power up. Unlock new quad bikes and characters &amp; see how far your endless bike racing game takes you. So choose your best ATV quad bike subway rider in the beautiful city subway scenes &amp; show the world that you are the best quad bike rider in this endless running game.<br/><br/>You have to perform best of the best to snappy these clumps &amp; put your name in the list of atv quad bike champions. Subway Run: Quad Bike Racing FREE is a free endless running game for bike racing fans. Rush, run on unknown subway tracks, and explore the exit to escape from incoming subways train, tram train and euro trains. Get subway runner upgrades to improve your power ups (including magnets and nitro boost) as magnets can help you collect more coins. This subway rush game offers beautiful graphics, smooth bike rider controls, because all you have to do is drag left &amp; right to avoid to rush far.<br/><br/>As a bonus Unlock “Offroad ATV Quad Bike Racing Mode”:<br/><br/>Which offers offroad atv quad bike racing with 100s of race challenges, so get behind the wheel and buckle up for the most addictive &amp; fun physics dirt bike based PVP driving game. Subway Rush Quad Bike Rider has the craziest atv quad bikes and the roughest terrain tracks like City, Tropical, Canyon, and the Arctic for you to prove yourself as the ultimate hot wheeled quad bike driver. With ultra-realistic physics, fun crash scenarios and challenging off-road gameplay, you won’t be able to stop playing Off-road ATV Quad Bike Racing mode.<br/><br/>Race to the finish line over a multitude of quad bike racing tracks with hazards, hill climbs, jumps, loops, bridges, and ramps. Go turbo with awesome 4x4 atv quad bike upgrades and try to climb to the top of the leaderboard in this crazy offroad quad bike racing game that will test your driving skills to the limit. So what are you waiting for? Be ready to experience Extreme Off-Road Drive in this amazing simulator of off-road bike driving.<br/><br/>So! What are you waiting for start your ATV Quad Bike engine and begin your quad bike journey to become the champion of motocross bike racing games.<br/><br/>Features of Subway Run: Quad Bike Racing FREE: <br/><br/>Ø Various characters to choose from &amp; Surf the City.<br/><br/>Ø Unlock 6 ATV Quad bikes with different specifications.<br/><br/>Ø Amazing power-ups: Coin Magnet, Super Jumps &amp; Scores Multiplier.<br/><br/>Ø Diverse scenarios to run in; City, Subway, Forest and Desert.<br/><br/>Ø Lots of obstacle-dodging fun.<br/><br/>Amusing Sounds &amp; effects.<br/></p>", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e6f/e6f91ff98067f1ae3750b7feecd6382f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gameseller76"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}