{"id": 265603, "slug": "tig-and-the-crystal-realm", "name": "Tig and the Crystal Realm", "name_original": "Tig and the Crystal Realm", "description": "<p><strong>NOTE</strong>: Gamepad is supported for gameplay, but not menu navigation. You can press \"Start\" or \"A\" on a gamepad to start the game from level 1 from the main menu splash screen, or use the mouse to choose any of the interaction menus.</p>\n<p>Team: SOSA</p>\n<p><em>Tig was just an ordinary rabbit who loved to laugh and play. One day on his way home from school, he came across a mysterious cave that he didn't remember seeing before. His curiosity got the better of him and he crawled into the dark space ahead. When he finally reached an opening, he was faced with a tall grey stone pillar with a glowing purple crystal carefully balanced on top. He climbed and climbed until he could reach it and stuck out his hand. Just as he grabbed the crystal it broke into pieces and everything around him went white.</em></p>\n<p><em>When he opened his eyes, he was confused to realize he was no longer in the cave, but in an unfamiliar place far from home. Still clutching a piece of the crystal, Tig started walking and was shocked when he took a step forward and fell right through the ground beneath him! Confused and disoriented, he looked around. He could see the ground, but when he tried to touch it all he felt was air. He peered into the crystal shard and was puzzled to see that the world looked different through the shard. He noticed that the ground he had tried to step on was nowhere to be seen in this alternate dimension. Tig, being most interested now, attempted to step on other areas that didn't match in these two worlds and found that what he thought to be reality was often inaccurate. What a strange discovery!</em></p>\n<p><em>After spending some time playing with standing on thin air, Tig noticed that the crystal's glow seemed to be fading. Frantic and afraid, Tig realized there was no time to waste. He must find the broken shards and restore the crystal right away</em></p>", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b6a/b6ab5c440f0cef6b3560ebe5ec9aecde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OKomili"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}