{"id": 265706, "slug": "desert-bus-road-rage", "name": "Desert Bus: Road Rage", "name_original": "Desert Bus: Road Rage", "description": "<p>Thanks for coming to check out our new Desert Bus rage game! Following this year's theme of the driver's chair, we really wanted to give you the authentic first-person Desert Bus experience you deserve. You take control of the Desert Bus, one interaction at a time, to drive your way to Las Vegas, Nevada. Watch out for enemies and exploding cacti, and good luck keeping your sanity! Remember, we believe in you! The only way to truly lose is to give up. So hang in there!</p>\n<p>A couple of tips: Look around the cockpit of the Desert Bus using WASD, and interact with things by pressing or holding down the space bar. Sometimes, the weight of the Desert Bus will get your tires stuck in the sand. If that happens, don't panic! Just gently wiggle the steering wheel while applying the gas pedal, and you'll be on your way again in no time. One last thing, using your horn will help (temporarily) scare off any critters you might run into.</p>\n<p><strong>For an in-depth description of the controls, please check out the in-game How-To menu</strong><strong>!</strong> Being a Desert Bus driver can be hard, so I promise you won't regret it! </p>\n<p>=====</p>\n<p>We've already gotten some feedback from playtesters, and the reviews are overwhelmingly positive! Here's what some fans are saying about Desert Bus: Road Rage.</p>\n<p>\"People should have to play this game in driving school, because people would be much better drivers if they had to practice under this much stress.\"<br/></p>\n<p>\"I want to scream. You piece of s***.\"</p>\n<p>\"I f***ing hate your game. I hate you. I hate your game. I hate your game. I hate your game so much.\"</p>\n<p>Please add your love and adoration for the game in the comments below! We're excited to hear what people have to say about it, and we would be even more excited to see it - feel free to post your best times for beating the game and share any video recording of the game as you like.</p>\n<p>=====</p>\n<p>Credits:</p>\n<p>Caxt Nova  (Emperor Zoltar's most loyal subject)</p>\n<p>Penandum (He's just brown nosing Emperor Zoltar, why can't His Majesty see that)</p>", "metacritic": null, "released": "2018-11-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8f8/8f8c8f042057854b646380a0d781b376.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["caxtnova"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}