{"id": 265716, "slug": "stagger", "name": "Stagger", "name_original": "Stagger", "description": "<p><strong>Stagger</strong><br/><br/>Single player classic first-person shooter, based on the (work in progress, pre-alpha unreleased) <em>Classic Single-Player First Person Shooter Game Framework</em> for Unreal Engine 4.  In addition to being an entry for the UE4 Epic MegaJam 2018, this game is a proof of concept for the game framework (when finished, will be sold on the UE4 <br/>Marketplace).  It also let me see some things that need to be fixed in the framework!</p>\n<p>Four level prototype game.<br/></p>\n\n<p><strong>Playing Instructions<br/></strong></p>\n<p>WASD + mouse to control your player.  LMB to fire.</p>\n<p>Other keys:</p>\n<p><strong>Jump</strong>: Space bar (double jump allowed!)<br/></p>\n<p>Toggle between first-person and third-person view: F7</p>\n<p><strong>Crouch</strong>: C</p>\n<p><strong>Dodge</strong>: V (jump away from object/surface you are touching with influence from your current motion; test it to get a feel for how it works)<br/></p>\n<p><strong>Stash weapon </strong>(for melee or to throw things): 0  (all numbers are top-row of keyboard)</p>\n<p><strong>Select hitscan</strong> (rifle) weapon: 1</p>\n<p><strong>Select projectile</strong> (grenade launcher) weapon: 2</p>\n<p><strong>Select beam</strong> (laser) weapon: 3</p>\n<p><strong>Select next</strong> weapon: mouse wheel up or ]</p>\n<p><strong>Select previous </strong>weapon: mouse wheel down or [</p>\n<p><strong>Select best available</strong> weapon that still has ammo: b (1 is considered best, then 2, then 3)</p>\n<p><strong>Save</strong> game: Ctrl F6</p>\n<p><strong>Load </strong>game Ctrl F3  (must be in the same level you saved from)</p>\n<p><strong>Operate </strong>switch/pick up and carry object/drop carried object: E or F (can only pick up objects less than 200Kg.  If too heavy, E or F only pushes the object)<br/></p>\n<p>LMB fires weapon, but if you have no weapon, melee attack; if you are carrying an object and have no weapon, LMB throws the object, and is an effective attack.</p>\n<p><strong>Quit </strong>game: Alt-F4</p>\n<p>On title screen, end of level view, player death view, hit a key or click mouse button to continue.  On player death, the level will be restarted with default health and no weapon.  On end of level, you carry weapons, ammo, health, and drunk level to next level.</p>\n<p>Features: <br/></p>\n<p>Health: when 0 or less, you be dead!<br/></p>\n<p>Drunk Level: The more alcohol you have in you, the more resistant you are to enemy attacks.  The down side is your vision and movement are somewhat impaired.  If you kill a drunk enemy, you can take its bottle and add to your drunk-shielding.</p>\n<p>Keys: You may have to shoot the holder of a key to make it drop the key so you can continue to the next level.  </p>\n<p>Pickups: bottles, keys, weapons, first-aid kits, etc., just walk over them to pick up.  </p>\n<p>Warning: don't let other characters walk over pickups first!  They'll steal them! <br/></p>", "metacritic": null, "released": "2018-11-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/827/827ff0b89a476f7c694cb678383c807e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Todd D. Vance"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}