{"id": 265850, "slug": "run-mailboy-run", "name": "Run Mailboy, Run", "name_original": "Run Mailboy, Run", "description": "<p>This is a game jam game my team, Maxen McCoy and Ian Walton,  and I created using Unity and C#. <br/></p>\n<p>I programmed the health systems,  player movement, and UI. I also created some of the assets and designed parts of the level.<br/></p>\n<p>We created this game in a weekend for the 2018 Global Game Jam with a theme of transmission. We decided to do a mail delivery game for the theme of transmitting letters.</p>\n<p>This project is a prototype we may create more levels at some point and further refine the game, but this version is what was accomplished after one weekend of work.</p>\n<p>Here are the instructions included in the read me file:</p>\n<p>Instructions<br/>You find yourself in the past with a war impending.<br/>Your objective is to deliver various letters to <br/>locations to facilitate communication.</p>\n<p>There are 10 minutes on the clock until war occurs.<br/>Be careful not to trip over objects or you will fall <br/>and lose health.</p>\n<p>If you sprint too long you will become exhausted and <br/>lose health.</p>\n<p>Once you collect a letter check your inventory to read <br/>the letter and determine the location of delivery.</p>\n<p>If all the letters are delivered before the clock runs out<br/>you win the game!</p>\n<p>Keys<br/>I -inventory<br/>ESC- options<br/>W - Move Forward<br/>A - Left<br/>S - Move Backward<br/>D - Right<br/>Shift - Sprint<br/>Space - Jump</p>", "metacritic": null, "released": "2018-11-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/208/20899d5b039d92a286f46fc58aa3d9c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Megan Truesdale"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}