{"id": 266078, "slug": "murphys-heroes-the-hurtgen-forest", "name": "Murphy's Heroes: The Hurtgen Forest", "name_original": "Murphy's Heroes: The Hurtgen Forest", "description": "<p><strong>WWII OCTOBER 1944: THE WESTERN FRONT</strong></p>\n<p>The U.S. Army regards the Hurtgen Forest as one of the most desperate battles it has ever fought. Along the Belgian Border, flanking the key German city of Aachen, Hürtgenwald's dark dense woods, shrouded in fog and laced with German mines and fortifications, was one of the most formidable defensive areas along the West Wall. <strong>Many who entered the Hurtgen Forest would never leave...</strong><br/><br/><strong>MURPHY's HEROES: THE HURTGEN FOREST </strong>is a unique turn-based skirmish level combat game that puts you in command of a band of Sgt. Murphy's 'Combat Happy Dogfaces' of the 1st Infantry's Easy Company at the early stages of the Battle of the Hurtgen Forest.</p>\n<p><strong>ENTER THE FOREST FROM HELL...</strong></p>\n<p>Striking fully Animated 3D Graphics, Immersive Sound and Special Effects, all combine in a Skirmish Level game that's as personal as it gets, to bring a sense of immediacy and danger to every mission. <br/><br/>Dense woods, limited sighting and enemy detection, mines, grenades, smoke, and fiercely defended fighting positions await!<br/><br/>At least you've got 'The Sarge'... and a Medic!</p>\n<p><strong>NOTHING's EASY IN EASY COMPANY</strong><br/><br/>With any given action, enemy reaction can seem immediate or concurrent.<br/><br/>While staying true to turn-based mechanics (no twitch game here), the game's random command activation system will at times make it feel as though you're playing more of a real time strategy game.<br/><br/>Skirmish level WWII action with a turn-based system that keeps you involved instead of putting you to sleep.<br/><br/><strong>FEATURES:</strong><br/><br/>- Eight Scenario based Missions with randomly generated encounters with an integrated Campaign System that tracks your progress.<br/><br/>-Squad level AI Assisted Movement, Ranged Fire, Rallying, and Reloading. Command your squad with just a few clicks of the mouse.<br/><br/>- Multiple Weapon Systems, Unit Types, and Mission Classifications.<br/><br/>- Individual health levels and fighting positions, plus grenades, mines, defensive smoke... and even a Squad Medic.<br/></p>\n<p><strong>MURPHY's HEROES: THE HURTGEN FOREST</strong><br/><br/></p>\n<p>Available For Windows (DX9+) and Mac OSX Desktops <br/></p>", "metacritic": null, "released": "2018-11-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a58/a58bbdcb09fcddf1bd917f7dead9fe06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["digitalGameworks"], "genres": [], "publishers": [], "esrb_rating": null}