{"id": 266283, "slug": "block-puzzle-jewel-star", "name": "Block Puzzle: Jewel Star", "name_original": "Block Puzzle: Jewel Star", "description": "Block Puzzle: Star Gem<br/><br/>Place the Gem blocks into the grid &amp; get the greatest bonuses!<br/>Block Puzzle: Star Gem is a simple, yet challenging to master puzzle game!  <br/> Add even more excitement to the puzzle game by enabling block rotation with stars!<br/><br/>Tease your brain with the sparkling Gems<br/><br/>HOW TO PLAY<br/>1. Simply drag the given blocks and put them into the grid<br/>2. Remove the blocks by making full horizontal or vertical lines!<br/>3. You can rotate the blocks by charging the booster gauge!<br/>4. Try to remove multiple lines at a time to get higher score :D<br/><br/>FEATURES<br/>* NO WIFI? NO PROBLEM! Enjoy Gem puzzle anytime, anywhere!<br/>* Free TO PLAY &amp; Suitable for all ages.<br/>* NO penalties &amp; time limits; You can enjoy Block Puzzle at your own pace!<br/><br/>NOTES<br/>* Block Puzzle: Star Gem supports mobile phones &amp; tablet PCs.<br/>* Block Puzzle: Star Gem contains ads varying from banners, interstitials, videos to house ads.<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/>* Block Puzzle: Star Gem offers Star Membership, which removes ads and gives free Continue function and 3 built-in rotates per play. <br/><br/>We offer the following subscription options:<br/>1. Star Membership (1 Month) offers a monthly subscription for $4.99 after a 3-day free trial.<br/>2. Star Membership (3 Months) offers a subscription for 3 months for $10.99.<br/>3. Star Membership (6 Months)  offers a half-year subscription for $19.99.<br/><br/>* All prices are based on US dollars. Pricing in other countries may vary and actual charges may be converted to local currency depending on the country of residence.<br/>* Payment will be charged to iTunes Account at confirmation of purchase.<br/>* Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>* The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>* Subscriptions may be managed by the user and auto-renewal may be turned off by going to Account Settings after purchase.<br/>* Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/>* You can turn off the auto-renew for the subscription whenever you want to through iTunes account. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option. <br/><br/>Terms of Use: http://www.bitmango.com/terms-of-service/<br/>Privacy Policy: http://www.bitmango.com/privacy-policy/<br/><br/>Need Help? Have Questions?<br/>We value your feedback! Please contact us at help@bitmango.com<br/><br/>Visit Bitmango for more information<br/>www.bitmango.com/", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-06-17T02:09:33", "background_image": "https://media.rawg.io/media/screenshots/f5a/f5ac43d56b945c07cd65966ba827fc57_YIUBBjO.jpg", "website": "https://www.facebook.com/bitmangogames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BitMango"], "genres": ["Board Games", "Puzzle"], "publishers": ["BitMango"], "esrb_rating": null}