{"id": 266270, "slug": "cutie-cubies", "name": "Cutie Cubies", "name_original": "Cutie Cubies", "description": "Do you like construction sets? Then you'll love this interactive adventure! It's an incredible space for creativity!<br/><br/>Feel the excitement of experimentation and discovery: combine different elements and get new items and unusual characters!<br/><br/>When you connect one cube to another, new items are created: plants, buildings, and much more. Find all kinds of objects, conduct experiments, and observe what happens! Fill the planet with seas, mountains, plants, and residents all made of cubes, and explore every corner of this rectilinear world.<br/><br/>Join the cube team and help your favorite characters settle the new planet by building a fascinating world there!<br/><br/>This journey will excite not only children, but will fascinate adults as well.<br/><br/>Furthermore, you will have the opportunity to immerse yourself in augmented reality and find new friends!<br/><br/>IN-GAME PURCHASES<br/>Most features in the free version of Cutie Cubies do not require additional in-game purchases.<br/><br/>In-game purchases in Cutie Cubies expand the gameplay and unlock additional content. You can set restrictions in your phone’s settings to avoid accidental purchases.<br/>In-game purchases are made with real money that is debited via the payment method linked to the user account.<br/><br/>Monthly subscription gives access to all cube characters and the game universe.<br/>Monthly subscription fee: $2.99.<br/><br/>Payment for subscription is charged to the card linked to the user account. Please note that by purchasing a subscription you accept its automatic renewal.<br/><br/>Your subscription is automatically renewed if the auto-renewal feature is not disabled at least 24 hours before expiry of the current subscription.<br/>Automatic renewal of your subscription will incur the same charge as for the initial purchase.<br/>You can disable the auto-renewal feature in the Settings menu of your device.<br/>Subscription payment is made through Google Play.<br/><br/>The current version of the User Agreement is available at: http://i-moolt.com/agreement/en<br/>Privacy policy: http://i-moolt.com/privacy/en<br/><br/>If you have any questions or suggestions, please write to us at support@i-mult.ru, and you will definitely get a response!", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-10-22T14:03:14", "background_image": "https://media.rawg.io/media/screenshots/3bd/3bd25cc2127ddcdc97b8d70901b26242.jpg", "website": "http://bit.ly/2JP3D7j", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Интерактивный Мульт"], "genres": ["Adventure", "Puzzle"], "publishers": ["Interactive Studio, OOO"], "esrb_rating": "Everyone 10+"}