{"id": 266260, "slug": "be-be-bears-in-space", "name": "Be-be-bears in space", "name_original": "Be-be-bears in space", "description": "The inseparable be-be-bears have long wanted to go to the outer space—to take a rocket for a ride, to see the stars and experience zero-gravity. They chose you to be the captain of the interplanetary spaceship! Go on an exciting adventure to explore new planets, meet their inhabitants, make incredible discoveries, unravel all mysteries and find new friends!<br/> <br/> MANY AMAZING THINGS ARE WAITING FOR YOU IN THE GAME:<br/> • A spaceship, extraordinary planets and other mysterious objects that you will need to explore together with the inseparable friends Bucky and Bjorn<br/> • Real heroes need the most beautiful costumes! Dress the animals the way you like — the wardrobe has something for everyone.<br/> • Start a series of adventures traveling across the vastness of seas! Find all the treasures and meet the sea inhabitants of the Pirate Planet!<br/> • Put together a dream machine and have a mind-dizzying competition with the bears on the Race Planet!<br/> • New characters! Meet Val the Mole, an intelligent robot and an alien!<br/> • Did you want to meet Bucky, Bjorn, Franny or Chick in real life? Welcome to augmented reality! Turn on the AR mode and all your favorite heroes and their new friends will come alive right in front of you. Meet the fantastic alien bears, dinosaurs and even intelligent robots!<br/> <br/>NOTE! The app is not supported by iPhone 4s, iPad Mini or other earlier-generation gadgets.<br/> <br/>Follow our updates in social networks:<br/> https://www.facebook.com/imoolt/<br/> <br/>The current edition of User Agreement is available online at http://i-mult.tlum.ru/agreement-overall<br/>The Privacy Policy: http://i-mult.tlum.ru/privacy<br/> <br/>If you have any questions or suggestions, e-mail us to support@i-mult.ru, and we'll make sure to give you a reply!", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-10-22T14:03:13", "background_image": "https://media.rawg.io/media/screenshots/995/995f3f3d7887f1403c9aaa4493a45bb7_fC4ogO9.jpg", "website": "http://i-mult.tlum.ru/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Интерактивный Мульт"], "genres": ["Family", "Puzzle"], "publishers": ["Interactive Studio, OOO"], "esrb_rating": "Everyone 10+"}