{"id": 266291, "slug": "word-snap-brain-pic-games", "name": "Word Snap - Brain Pic Games", "name_original": "Word Snap - Brain Pic Games", "description": "Who wants the Latest Craze of FREE Word Puzzle Games? This picture word puzzle game is fun for kids and adults! Get Word Snap and challenge yourself with addicting pic puzzles! <br/><br/>WordSnap is a must have Brain Game! Get your brain power ready with a Warm Up of pics that combine to create a word. Zoom in on Pics! No Time Limits! <br/><br/>Move onto Combo Words, where two pics make one word puzzle or phrase. For example, see pics of DOG and HOUSE: combine the photos to solve for DOGHOUSE. 2 Pics, 1 Word!<br/><br/>If you can handle the challenge, Same Sound will test your brain skills where you “read” one pic that is said or spelled the same way as another word, but the puzzle word you solve has a different meaning. Example- see photo of a FLOWER: solve the puzzle by spelling FLOUR. <br/><br/>Word Snap have you scratching your head? 1 Pic, 1 Word! Same Sound is addictive for girls and boys of all ages! FREE Hints! <br/>\u2028Fun word challenges for trivia puzzle fans! <br/><br/>WORD SNAP features:<br/>Word Guessing Games for All Ages<br/>Mind Puzzles with Challenging Levels<br/>Warm Up your Puzzle Skills with 2 Pics, 1 Word<br/>Combine Word Photos to form a Word Puzzle<br/>Addicting and Intense with Same Sound being the Most Challenging Puzzle Level<br/>Same Sound with 1 Pic, but a Different Word Meaning<br/>Earn Coins and Bonus Coins<br/>Tons of Picture Guessing Puzzles\u2028Unscramble Letters to Form Words<br/>Word Puzzles Updated All the Time with More Addicting Brain Teasers<br/>No Time Limits, Zoom Feature, Skip Puzzle<br/>Hints, Remove Letter, Reveal Word", "metacritic": null, "released": "2018-11-13", "tba": false, "updated": "2019-10-22T14:32:54", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a9d429c7e221662a648004ca0326ea8_h0v75Wc.jpg", "website": "http://www.purplejamlabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Purple Jam Labs"], "genres": ["Board Games"], "publishers": ["Purple Jam Labs"], "esrb_rating": null}