{"id": 266275, "slug": "one-line-curve-drawing", "name": "One Line - Curve Drawing", "name_original": "One Line - Curve Drawing", "description": "One Line - Curve Drawing<br/>One Line - Curve Drawing<br/>How skillful are you at connecting dots in one go without lifting your finger off your screen?<br/>This FREE-TO-PLAY drawing game is a simple brain-training puzzle that's extremely hard to put down!<br/>Find the best pathway to complete a shape, one stroke at a time!<br/><br/>How to Play<br/>►One simple rule: mentally draw in &amp; connect all the nails with one single rope.<br/>►The line drawing puzzle starts off quite easily, but don't get carried away. Each level can get very tricky!<br/><br/>How is One Line - Curve Drawing Different?<br/>-It is the only curved game in the world.<br/>-Over 300 of LEVELS to dive right in &amp; much more to come!<br/>-Completely RESTART a level if you're stumped or use HINTS to help you along!<br/>-Select rope types of your choice to double the fun!<br/>-Most simple &amp; effective way to test your analytical ability! See how clever you are at puzzling through each level with just one touch!<br/>-Feel that satisfaction once you find the optimal way to completely pass through a shape!<br/><br/><br/>Need help? Have Any Questions?<br/>Please contact us at help@bitmango.com <br/><br/>Visit Our Bitmango Games Website:<br/>https://www.bitmango.com/ <br/><br/>Please Note<br/>-One Line - Curve Drawing can be enjoyed on mobile phones &amp; tablet PCs.<br/>-One Line - Curve Drawing contains ad-like banners, interstitials, videos and/or house ads. <br/>-One Line - Curve Drawing is free to play, however, you may purchase in-app items, such as Ad-Free &amp; hints.", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-07-29T15:22:14", "background_image": "https://media.rawg.io/media/screenshots/db0/db099fb2ff8ee53ae80352ac06df0767.jpg", "website": "https://www.facebook.com/BitMangoGames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BitMango"], "genres": ["Board Games", "Puzzle"], "publishers": ["BitMango"], "esrb_rating": "Everyone 10+"}