{"id": 266391, "slug": "sega-heroes", "name": "SEGA Heroes", "name_original": "SEGA Heroes", "description": "<p>SEGA presents the BEST new RPG of 2018! Download the ultimate SEGA battle today!<br />\nCollect legendary heroes from your favorite SEGA games.  Build an all-star team in this mash-up of epic proportions. Upgrade your heroes and match gems to unleash their signature attacks in action-packed battles!<br />\nThe mysterious and powerful Dremagen has discovered the SEGA universe and hatched an evil plot to bring it into her dominion. With the help of Dr. Eggman Robotnik, Dremagen traps Sonic the Hedgehog and SEGA’s mightiest heroes from GOLDEN AXE, SHINOBI, STREETS OF RAGE and more in her negative dimension. Now YOU must help the SEGA Heroes face off against  Dremagen and her evil army of clones and do battle with the likes of Dr. Eggman Robotnik, Mr. X, and Death Adder.<br />\nUPGRADE &amp; EXPLORE<br />\n● Play live events, go on new adventures and earn special rewards<br />\n● Battle other players for supremacy in the arena<br />\n● Join a guild and play with friends<br />\n● Upgrade your heroes to unlock powerful special abilities</p>\n<p>COLLECT THEM ALL<br />\n● Sonic The Hedgehog<br />\n● Streets of Rage<br />\n● Golden Axe<br />\n● Shinobi<br />\n● Super Monkey Ball<br />\n● Jet Set Radio<br />\n● Phantasy Star<br />\n● New SEGA Heroes released every month!<br />\nCOMPETE IN EPIC ADVENTURES<br />\n● Battle classic SEGA bosses and minions in tactical Match-3 combat<br />\n● Go on an epic adventure through SEGA history, as you build an all-star team<br />\n● Battle famous bosses including Dr. Eggman and Mr. X<br />\n● Enter Survival mode to see how far you can go<br />\n● Complete puzzles and progress through tons of levels<br />\nYour ultimate SEGA squad is waiting. Join the adventure now!</p>\n<hr />\n<p>Privacy Policy: http://www.sega.com/mprivacy/<br />\nTerms of Use: http://www.sega.com/Mobile_EULA<br />\nSEGA, the SEGA logo and SEGA HEROES are either registered trademarks or trademarks of SEGA Holdings Co., Ltd. or its affiliates. All rights reserved.</p>", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2023-02-09T02:31:55", "background_image": "https://media.rawg.io/media/screenshots/591/5915caebb311e80b878a0b0b318326c6_ye3kiDN.jpg", "website": "http://www.sega.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["SEGA"], "genres": ["RPG", "Strategy"], "publishers": ["SEGA"], "esrb_rating": "Everyone 10+"}