{"id": 266308, "slug": "a-blackjack-kings-of-final-table-take-hits-until-c", "name": "' A Blackjack King’s Of Final Table – Take Hits Until Card's Score 21 Live Casino", "name_original": "' A Blackjack King’s Of Final Table – Take Hits Until Card's Score 21 Live Casino", "description": "' A Blackjack King’s Of Final Table – Take Hits Until Card's Score 21 Live Casino<br/>----------------------------------------------------------------------------------------------------------------------<br/>Money won is money earned in Blackjack! Also known as 21, the card game found in casinos all over the world can now be experienced on your iPhone, iPod Touch, iPad, or iPad Mini. <br/><br/>The money used in this game is fictitious, but the strategies you will learn are priceless. Need a bit of extra help?<br/><br/>Think you are ready to play with the High Rollers? If so, try your skills in the new high stakes tables! Start with Beginner’s Luck and work your way to the top! Show the world you are ready by working your way to the top of the Leaderboards; win big hands to reach the top. For a more personal challenge, try out the all new Game Center achievements that test your luck and skills!<br/><br/>Free Blackjack is a fully-featured, ad-supported version of Blackjack. If you like Free Blackjack, but prefer playing without ads, Try remove ad inapp<br/><br/>Thank you for supporting us! Help us improve Blackjack by leaving feedback", "metacritic": null, "released": "2015-07-31", "tba": false, "updated": "2019-10-22T14:03:18", "background_image": "https://media.rawg.io/media/screenshots/a74/a740eee4cce09b7d27110db6ddf468d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appimize"], "genres": ["Card"], "publishers": ["Appimize Studio AS"], "esrb_rating": "Teen"}