{"id": 266330, "slug": "imath-fun-math-problem-solver-for-kids", "name": "iMath Fun - Math Problem Solver for Kids", "name_original": "iMath Fun - Math Problem Solver for Kids", "description": "\"My kids love playing this game and with more practice they have become experts in solving simple Maths equations. The game has not only helped in improving their Maths capabilities but has also  made them more alert and more responsive.\"<br/> <br/> <br/>\"This app has gained awesome response in my family for both young and old. Brain is just like a muscle and it needs to be exercised regularly with such brain fitness activities and games. Nice work! \"<br/><br/><br/>\"This game has definitely improved my cognitive abilities like quicker thinking and concentration. It's a must try for all!\"<br/> <br/>\"iMath Fun Learning Game is an easy Math game that encourages you to use your brain and answer simple math equations before you run out of time\"<br/><br/>iMath is a fun game that challenges you to use your brain and solve simple Math equations before the time is finished. The game is beautifully designed to enhance specific cognitive abilities which include attention, processing speed, and problem solving skills among players. <br/><br/>If you're looking to exercise that big 'ol brain of yours – iMath Learning for kids is just the right option. It offers basic and expert levels for kids – depending on the age group. With full emphasis on Math equations from simple to advanced stage, the game present players with a grid of numbers ranging from 1-9 highlighted in different colors. The game is timed so that you can track your performance easily.<br/>Measurable results: Following its development and testing, we have concluded that iMath can:<br/>·         *Improve memory and recall<br/>* Increase Concentration Power<br/>* Give quicker thinking capability<br/>* Enhance strong problem solving skills<br/>* Bring positive mood changes\u2028<br/><br/>Target Group: The game is highly suitable for young tots to oldies. So whenever you want to challenge your brain, go for iMath Fun Learning Games for Kids!", "metacritic": null, "released": "2016-12-02", "tba": false, "updated": "2019-10-22T14:03:22", "background_image": "https://media.rawg.io/media/screenshots/782/7820cd87484435ca9b5945e570cd1299_tosnPBN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appimize"], "genres": [], "publishers": ["Appimize Studio AS"], "esrb_rating": "Everyone 10+"}