{"id": 266390, "slug": "sandbox-pixel-art-coloring", "name": "Sandbox Pixel Art Coloring", "name_original": "Sandbox Pixel Art Coloring", "description": "Sandbox Pixel Art Coloring by number pages are a great way for basic number recognition, how to use a legend and it will give them the opportunity to work on their fine skills. Enjoy the coloring book with your creative ideas.<br/><br/>How To Play:<br/>- To colorize,your brain needs only a finger.<br/>- Choose a fashion number image from the fashion models drawings available.<br/>- Then select the colors and put them in the particular boxes you want to color in the images<br/>- Color drop in the same numbers blocks.<br/>- Just follow the numbers in pictures.<br/>- Picture levels can be locked with coins which the player must spend to unlock. Players can earn coins by completing levels or by purchasing coins from the IAP store.<br/>- Comes with Bomb power up and Magic Wand power up. <br/><br/>Features:<br/>- Sandbox number coloring<br/>- Comes with over 100 pictures ready to play. <br/>- Beauty, portraits, girls themed adult colouring book.<br/>- Easy to choose colors and draw.<br/>- Beautiful exotic designs to decorate with color.<br/>- Many different patterns and color combinations.<br/>- Great way to reduce stress, relax, and colorfy your world.<br/>- New coloring pixel art therapy,to reduce stress.<br/>- Well designed anti-stress pixel pictures<br/>- Paint easily and watch how you draw the image in the end<br/>- Pixel coloring<br/>- Rich collection of unique makeup face coloring pictures.<br/>- Gives innovative filling in a way that you feel all your stress released away <br/>- Unlimited beautiful color palettes: Choose one that fits your mood.<br/>- Easily color any image and wait for the surprise in the end!<br/>- Device camera can take real life pictures which are automatically pixelated and can be played right away. <br/>- Automatically saves game state and loads it when app restarts. <br/><br/>Sandbox Pixel Art Coloring by number is now offering you amazing opportunity to unleash creativity, reduce stress and balance your life! <br/><br/>Our delicate fashion color by number pages include not only cute fashion girl, mandalas coloring, but also stress-relieving and doodle arts for you to relax and lift spirits.", "metacritic": null, "released": "2018-11-17", "tba": false, "updated": "2019-10-22T14:33:03", "background_image": "https://media.rawg.io/media/screenshots/da1/da153bcc3b1753c4ebfad43c3b1a413f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vacharachai Nuiklom"], "genres": ["RPG", "Puzzle"], "publishers": ["Vacharachai Nuiklom"], "esrb_rating": "Everyone 10+"}