{"id": 266300, "slug": "empire-clash", "name": "Empire Clash", "name_original": "Empire Clash", "description": "Empire Clash 2.0 has been released!! Update and Enjoy Tremendous Changes!!<br/><br/>In Empire Clash you can build your own empire and experience all of history from the ancient age to space age. Explore new technologies and build Wonder of the World. Establish your empire with sophisticated strategic battles and cutting edge science in Empire Clash. Create your own world: Empire Clash!<br/><br/>1. 20 Actual Nations<br/>Choose your base nation to be developed to the great empire from 20 actual nations all around the world. Just like our real world each nation has its own benefits and the Golden age.<br/><br/>2. History from ancient to space<br/>Experience the most important sites and scenes of the human history from the beginning of civilizations, scientific discoveries and historical figures. Who will be the pioneers beyond the age of Space?<br/> <br/>3. Wonder of the World for you and your Guild!<br/>What are your Wonders of the World? Each Wonder of the World is power of the Empire. From Pyramid to the Grade Wall build and upgrade them in your Empire.<br/><br/>4. Boss Battle / Team Battle<br/>In Empire Clash you are not alone any more. You will defeat boss all together and battle with others as a team. Get together and achieve great rewards.<br/><br/>5. Battle &amp; Trophy<br/>Collect and control your trophy count. Ranking, matchmaking, and rewards based on Trophy  makes Empire Clash more strategically exciting game.<br/><br/>6. Guilds <br/>Make a guild and recruit guild members. Grow your guild up sufficiently and Contribute to Guild's Victory!", "metacritic": null, "released": "2014-10-17", "tba": false, "updated": "2019-10-22T14:03:17", "background_image": "https://media.rawg.io/media/screenshots/a81/a816e202c7d29c36299e030638aa9dad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayZen"], "genres": ["RPG", "Strategy"], "publishers": ["PlayZen"], "esrb_rating": "Everyone 10+"}