{"id": 266427, "slug": "crazy-limousine-city-driver-3d-urban-simulator", "name": "Crazy Limousine City Driver 3D – Urban Simulator", "name_original": "Crazy Limousine City Driver 3D – Urban Simulator", "description": "Crazy Limousine City Driver 3D – Urban Simulator is a new insane, crazy and classic limousine car driving 3d game in big city environment. Being a good driver, you have to follow the road while drift driving and check your driving skills. Drive with care as you will feel yourself to be a car driver simulator while doing 3d driving in the 3d city. Instead of a small city or little city, this precision driving is in the environment of a big city. This 3D simulation game will check how much professional chauffeur you are. Do the stormy driving in this new model limo simulation driving game. Please drive in lane and don’t show insanity in the city driving while playing our 3d simulation driving game Crazy Limousine City Driver 3D – Urban Simulator.<br/><br/>While playing taxi driving 3d games, thrill, drift and racing is very important. Being a good driver, show skills of parking as well besides driving your SUV luxury limo vehicle. Avoiding any untoward incident such as road accident, drifting and daring to go through adventure, all are duties of a good river and you must show driving skills to avoid all these while driving Crazy Limousine City Driver 3D – Urban Simulator.<br/><br/>We provide family games with responsibility that extreme care is taken to maintain quality of the family games according to safety and security laws. We always welcome feedback and comments from our valued free simulation game players. So you are requested to please comment so that we can make our games better for our valuable players.<br/>Please remain intact for updates. You can expect more interesting free simulation games from us.", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2019-10-22T14:03:38", "background_image": "https://media.rawg.io/media/screenshots/b8b/b8ba04fff7a20e86e1dab39e4d400535.jpg", "website": "https://www.facebook.com/kaizentechstudio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammad ramzan"], "genres": ["Simulation", "Racing"], "publishers": ["muhammad ramzan"], "esrb_rating": "Everyone 10+"}