{"id": 266413, "slug": "multi-storey-car-parking-3d-driving-simulator", "name": "Multi Storey Car Parking 3D - Driving Simulator", "name_original": "Multi Storey Car Parking 3D - Driving Simulator", "description": "A car driver needs precision driving while drifting, drafting, smashing or racing. But from garage to car parking simulator place, a driver or a trucker can polish his driving skills and parking skills by playing this Multi Storey Car Parking 3D - Driving Simulator. This is a classic cars parking game. You have to find parking lot to park your crazy jeep in 3d parking simulator game. Multi Storey Car Parking 3D - Driving Simulator is outstanding simulation game among free parking games or free car parking games, where you can speed up, drive carefully and use your handbrakes of your car, crazy jeep or taxi for a right delivery and parking. It is a luxury limo parking and driving game where you have to reach to free parking spot.<br/><br/>Take your parking tickets while parking your SUV monster jeep into 3d auto parking place. But don’t try to show your car stunts as multiple cameras are fixed alongside. Multi Storey Car Parking 3D - Driving Simulator will prove itself to be one among best 2017 games. This parking adventure will amuse you a lot. In this parking simulator 2017, extreme car driving skills are difficult to show as you have to be very careful while driving.<br/><br/>Multi Storey Car Parking 3D - Driving Simulator Features:<br/>-\tMultiple Selection of Offroad Jeeps and cars<br/>-\tGameplay is realistic and smooth<br/>-\tOffroad parking to be treated as a challenging task<br/>-\tEasy controls of multiple types<br/>-\tPleasant music and visuals<br/>-\tExciting Car stunts and parking missions are part of the game<br/>-\tSimple and multiple game controls like tilt, steer or buttons<br/>-\t100% Free-to-play Missions<br/><br/>We provide family games with responsibility that extreme care is taken to maintain quality of the family games according to safety and security laws. We always welcome feedback and comments from our valued free simulation game players. So you are requested to please comment so that we can make our games better for our valuable players.<br/>Please remain intact for updates. You can expect more interesting free simulation games from us.", "metacritic": null, "released": "2017-02-02", "tba": false, "updated": "2019-10-22T14:03:35", "background_image": "https://media.rawg.io/media/screenshots/fa6/fa6223ade6a04b44f3be9a452c3283d8_Bqqmbgq.jpg", "website": "https://www.facebook.com/kaizentechstudio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammad ramzan"], "genres": ["Simulation", "Racing"], "publishers": ["muhammad ramzan"], "esrb_rating": "Everyone 10+"}