{"id": 266408, "slug": "offroad-sierra-desert-drive-3d-4x4-luxury-sim", "name": "Offroad Sierra Desert Drive 3D - 4x4 Luxury Sim", "name_original": "Offroad Sierra Desert Drive 3D - 4x4 Luxury Sim", "description": "Do you want to drift, draft, crash or smash? Then get ready to do racing in vast desert by playing this amazing Offroad Sierra Desert Drive 3D - 4x4 Luxury Sim, a car driving and racing simulation game. Racing in tough steps of this simulation 4x4 driving game will make your Christmas holidays wonderful. Speed up like a 6x6 monster truck or turbo, just to experience vast Gobi Desert. Drive realistic SUV cruiser cars with different engines, vehicles, and sound effects. Drive and drift your Offroad Sierra Desert Drive 3D - 4x4 Luxury Sim on hard terrains of Gobi desert. In the desert you have to show your racing expertise and show your car driving skills also. Do the offroading to show driving stunts by racing and passing hurdles on the rugged terrain. Use the power of engines of the 4x4 SUV and offroad monster 4wd jeep simulation vehicles to run the vehicle and drift. All these driving enjoyments are the part of this offroad simulation game, the Offroad Sierra Desert Drive 3D - 4x4 Luxury Sim.<br/><br/>So play this free simulation game and show your driving stunts by driving 4x4 and 6x6 luxury 4wd vehicles. Physics of the vehicle is extremely wonderful in the offroad simulation game Offroad Sierra Desert Drive 3D - 4x4 Luxury Sim. Don’t be afraid of any challenge or fine by the city traffic police as you will drive in a free mode in the desert. No fear of crash of the vehicle in offroad mode. Use extreme 4x4 jeeps and luxury Prado power of extremely powerful engine in this simulation game. Speed up just like a monster truck as fast as you can but don’t forget to bypass road hurdles, otherwise you my stuck and crush or crash your game level. <br/><br/>We provide family games with responsibility that extreme care is taken to maintain quality of the family games according to safety and security laws. We always welcome feedback and comments from our valued free simulation game players. So you are requested to please comment so that we can make our games better for our valuable players.<br/>Please remain intact for updates. You can expect more interesting free simulation games from us.", "metacritic": null, "released": "2017-01-13", "tba": false, "updated": "2019-10-22T14:03:34", "background_image": "https://media.rawg.io/media/screenshots/ce0/ce0b803ab1b32548d2b603557970b991_lLvVzmg.jpg", "website": "https://www.facebook.com/kaizentechstudio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammad ramzan"], "genres": ["Simulation", "Racing"], "publishers": ["muhammad ramzan"], "esrb_rating": "Everyone 10+"}