{"id": 266428, "slug": "offroad-tourist-snow-bus-drive-hill-climb", "name": "Offroad Tourist Snow Bus Drive - Hill Climb", "name_original": "Offroad Tourist Snow Bus Drive - Hill Climb", "description": "This winter holidays and snow fall environment, Game Sim Studios presents you a wonderful tourist bus simulation game to have a tour on extremely curvy roads on slide bus. Mountains and hilly areas provide extreme offroading joy for a driving tour in offroad environment on snow and ice on dangerous snow hill offroad area. So Offroad Tourist Snow Bus Drive - Hill Climb is the craziest mountain climbing and bus parking simulator game. As a real bus driver, you have to pick and drop offroad tourists and perform transport duty for them. Many buses are at your discretion, so do offroading on dangerous slide paths with realistic physics of off-road bus. It is a hill climb free game with snow and ice on steep paths. Offroad Tourist Snow Bus Drive - Hill Climb is best among bus 3d games.<br/><br/>Transport passengers from one bus terminal to the other. Stop the bus at bus stop on proper parking place. It is like a bus parking simulator, where your parking skills will also be tested along with driving skills. Give them proper time to get onboard and offload properly. Drive the slide bus carefully to ensure safety and security of the passengers. Announcement will be made well before time so that passengers could offload properly.  As an offroad real bus driver 3d, drive the coach bus with care.<br/><br/>We provide family games with responsibility that extreme care is taken to maintain quality of the family games according to safety and security laws. We always welcome feedback and comments from our valued free simulation game players. So you are requested to please comment so that we can make our games better for our valuable players.<br/>Please remain intact for updates. You can expect more interesting free simulation games from us.", "metacritic": null, "released": "2017-01-14", "tba": false, "updated": "2019-10-22T14:03:38", "background_image": "https://media.rawg.io/media/screenshots/efa/efa41ed07189f0c7ba7e6041cf2fb605_IXoOdui.jpg", "website": "https://www.facebook.com/kaizentechstudio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammad ramzan"], "genres": ["Simulation", "Racing"], "publishers": ["muhammad ramzan"], "esrb_rating": "Everyone 10+"}