{"id": 266508, "slug": "dames-international-10x10", "name": "Dames International 10x10", "name_original": "Dames International 10x10", "description": "Discover one of the greatest classic puzzle games. Play the International Drafts 10x10 on your iPhone or iPod!<br/><br/>This checkers game has a formidable I.A. which is among the best on the AppStore.<br/><br/>--------------------------------------------<br/>Following the comments on the difficulty of the AI ​​being too strong, the new update now allows beginners to win.<br/>In addition, progression will be smooth with difficulty modes: Easy, Medium, Hard, Expert, and Time.<br/>For the good ladies players I gave the possibility to set the reflection time from 0.25sec to 30sec.<br/>--------------------------------------------<br/><br/>Presentation of the Checkers<br/>The game of Dames would have been born between 2000 and 1500 BC and the greatest civilizations played there relentlessly.<br/>The Checkers is an easier approach than chess. It is accessible for all ages, while combining tactics, reflection and fun!<br/>However, the game of Checkers is far from being a simple childish game. One of the great riches of this game lies in the many combinations it allows.<br/>It is up to the player to imagine these often spectacular combinations ... In this sense, the Checkers is a difficult game and it is also what makes it exciting.<br/><br/>An unpublished version on Iphone and Ipod. This version is perfectly adapted for the iPhone or the iPod Touch in 3.0.<br/>It offers an artificial intelligence suitable for recreational parties up to an advanced level (unpublished on iphone / ipod)!<br/>The difficulty is configurable and you can play against the machine, but also against another person. The game can be paused and resumed whenever you want.<br/><br/>Play according to the official rules<br/>You will discover the official rules, where taking is mandatory and majority.<br/>The rule \"blow is not play\" was abolished in 1911. When you can take, you must take, whatever the consequences.<br/>If there are several ways to make one or more shots, the quantity rule must be applied: you must make the maximum number of shots possible.<br/><br/>-------------<br/>DESCRIPTION:<br/>-------------<br/>* International Drafts 10x10 according to the real rules of the game!<br/>* Mode: Player vs. iPhone, iPhone vs. Player, Player vs. Player, iPhone vs. iPhone<br/>* Level of difficulty: between 0.25 seconds and 30 seconds of reflection for the iPhone.<br/>* Saving the current game automatically<br/>* Return to one or more move (s) back.<br/>* Help during the game: the iPhone will offer you what it would play for you.", "metacritic": null, "released": "2009-09-22", "tba": false, "updated": "2019-07-30T05:54:03", "background_image": "https://media.rawg.io/media/screenshots/6c2/6c25e74634d60f15ed8a1d13f67edb78.jpg", "website": "http://grou007.free.fr/dames/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cedric Hammiche"], "genres": ["Board Games", "Puzzle"], "publishers": ["cedric hammiche"], "esrb_rating": null}