{"id": 266509, "slug": "international-draughts-10x10", "name": "International Draughts 10x10", "name_original": "International Draughts 10x10", "description": "Discover one of the greatest classics of games. Play the Game of Checkers International 10x10 HD on your iPad<br/>Presentation Draughts<br/>The Checkers was born between 2000 and 1500 BC and the greatest civilizations have played relentlessly.<br/>The Draughts is an easier approach than failures. It is accessible for everyone and all ages, while combining tactical thinking and fun!<br/>However, the game of Checkers is far from being a simple children's game. One of the great assets of this game lies in the many combinations it allows.<br/>It is the player to imagine these combinations often spectacular ... In this sense, the Checkers is a difficult game and that is what makes it exciting.<br/><br/>A new version of iPad. It offers an artificial intelligence tailored to the parties to a level of leisure master<br/>The difficulty is customizable and you can play against the machine, but also against another person. The game can be paused and resumed whenever you want.<br/><br/>Play by the rules official<br/>You'll find the official rules, where decision is mandatory and the majority.<br/>The rule \"does not play blow\" was abolished in 1911. When you can take, you take whatever the consequences.<br/>If there are several ways to perform one or more doses, the rule of quantity must be applied: it must make the maximum possible catch.<br/><br/>-------------<br/>DESCRIPTION:<br/>-------------<br/>* International Draughts 10x10 by real rules of the game!<br/>* Mode: Player cons iPhone, iPhone cons player, player against player, iPhone, iPhone cons<br/>* Level of difficulty: between 0.25 seconds and 10 seconds of reflection for the iPhone.<br/>* Registration of the current game automatiqueement<br/>* Go to one or more hit (s) back.<br/>* Support for the party: the iPhone will offer what he would play for you.<br/>* Mode \"editor\" in order to pose and solve problems or cheating:)<br/><br/>---------------------------------<br/>YOU MAY ALSO OUR OTHER GAMES:<br/>---------------------------------<br/>- \"Ladybird\", the new puzzle game that will give success to hard time for hours:)<br/>- \"The Hangman\" for fans of word games, the game that everyone knows!<br/>- \"Mixed words\" for fans of word games, you'll find the words hidden in an unlimited number of gates?<br/>- \"IMemory\" to develop memory while playing and having a good time.<br/>- \"Crossword solver\", a handy tool for solving word games.<br/>- \"Irimi\", compose sentences worthy of great poets.", "metacritic": null, "released": "2010-09-21", "tba": false, "updated": "2019-07-30T06:04:15", "background_image": "https://media.rawg.io/media/screenshots/520/520c30c69baf2c66ad6fd0db2a1c1e13.jpg", "website": "http://www.hammiche.fr/mes-applications-iphone-ipod", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cedric Hammiche"], "genres": ["Strategy", "Board Games"], "publishers": ["cedric hammiche"], "esrb_rating": null}