{"id": 266571, "slug": "got-a-minute", "name": "Got a Minute?", "name_original": "Got a Minute?", "description": "This is an unpretentious little casual game, that nevertheless requires your full attention and concentration! I know it looks... alright, I'll say it; it looks boring! Not much happening in the screenshots. And they're basically all the same. But don't be fooled, because sometimes pictures can say a thousand words and sometimes... they don't tell the whole story. <br/><br/>And in this case the whole story is that this game - although it may not look it! - is challenging and engaging. You have to stay focused and keep your eye on the colors, the player and the deadly tadpoles. All at the same time!<br/><br/>So what's the deal here? It's very simple; the little round fella is your player, your \"hero\", and he likes COLORS! But only colors that are identical to his own color. So tap a COLOR to make him go in that direction. For every RIGHT color he catches, you get a point. If he accidentally hits a wrong color, you lose half your points and if he gets in the way of one of the annoying little tadpoles, you lose the game! Also, he keeps changing his color, so keep an eye on that, too!<br/><br/>There are NOT hundreds of levels to go through, but the game does change (a little) from game to game. And it does get increasingly difficult during a game. But that's it. It IS a little game. But, hey, it's got music : ) Yay!<br/><br/>And what else... oh yeah, if you can keep the game going for more than a minute you're good. If you can keep it going for SEVERAL minutes, you're REALLY GOOD!<br/><br/>I hope you enjoy my little game.", "metacritic": null, "released": "2014-05-03", "tba": false, "updated": "2019-10-22T14:04:04", "background_image": "https://media.rawg.io/media/screenshots/9e2/9e27685de5eef3659ba7bde2d8d5139f_vUVjE5G.jpg", "website": "http://www.martinecarlsen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martine Carlsen"], "genres": ["Arcade", "Puzzle"], "publishers": ["Martine Carlsen"], "esrb_rating": "Everyone 10+"}