{"id": 266567, "slug": "cat-stacking", "name": "Cat Stacking", "name_original": "Cat Stacking", "description": "CAT STACKING is a cat game. Not a game FOR cats but WITH cats. Though I have to say that MY two cats really enjoy playing it. But when I say \"playing\" I mean \"watching the screen and tapping everything that moves\"! Which is not the best approach if you want to WIN the game! Not that they are stupid (How dare you?!), no, it's just that they don't care for rules. Of any kind. At all!!!<br/><br/>Anyway, for those HUMANS who want to play the game; it's about stacking cats. Catching and stacking a bunch of fat cats. And here's where the rules come in! <br/><br/>Each cat has to have at least two characteristics that match those of the previous cat in the stack (color, coat pattern and/or fur (long or short)). Does that sound easy? Well, it's not : ) But if you practice hard and get really, really good at it, you just might be able to build the PERFECT STACK! And what that is all about, you'll have to read in the instructions!<br/><br/>Also, each cat characteristic has a musical instrument/track associated with it, which you will hear play, when this particular  characteristic is present in the cat at the top of the stack. <br/><br/>- color CREAM: piano<br/>- color RED: xylophone<br/>- color YELLOW: harmonica<br/><br/>- pattern COLORPOINT: rythm guitar<br/>- pattern SPOTS: bass<br/>- pattern STRIPES: strings<br/><br/>- fur LONG: human beat box<br/>- fur SHORT: percussion &amp; bongos<br/><br/>When the stack is empty or if the BLUE CAT is on top, you'll hear only drums!<br/><br/>A word of advice; SEE THE CAT, BE THE CAT!", "metacritic": null, "released": "2011-09-02", "tba": false, "updated": "2019-10-22T14:04:03", "background_image": "https://media.rawg.io/media/screenshots/92a/92aaeeb8b6d98bf18a3d290c1410b77e.jpg", "website": "http://www.martinecarlsen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martine Carlsen"], "genres": ["Family"], "publishers": ["Martine Carlsen"], "esrb_rating": "Everyone 10+"}