{"id": 266638, "slug": "golden-trails-2", "name": "Golden Trails 2", "name_original": "Golden Trails 2", "description": "Search around the world to reveal the secrets of the pirate's treasures in this intriguing Hidden Object game! <br/><br/>Travel back to the 18th century and join Henry's gripping adventures whose granddad is accused of being a pirate and condemned to death. Take the advantage of your Mac display, scour perfectly designed locations, solve mind-bending puzzles and practice your accuracy in the unique shooting gallery. Look for the clues in passionate Spain, exotic Maghreb, and the legendary islands of the Caribbean. Don't let the bandits get away and save the innocent. There is much more behind the story! <br/><br/>GOLDEN TRAILS 2 FEATURES <br/>- 40 Fantastic hidden object locations and over 2 000 items to find <br/>- Three game modes, including Secret Mission and Unlimited mode <br/>- Travel 4 continents in the search for the truth <br/>- Solve puzzles in and between the episodes <br/>- Enjoy the unique Shooting Gallery <br/>- Get 45 marvelous in-game trophies <br/>- Try before buy! Start your adventure for free and unlock the whole game without leaving the app! <br/><br/>MORE AWEM GAMES <br/>● Cradle of Persia – Match your way through 100 levels to reveal the secrets of ancient Persepolis!<br/>● Cradle of Rome – Highly addictive 100 levels of matching madness!<br/>● Cradle of Rome 2 – Journey through 5 epochs of matching fun and exhilarating process of building the city!<br/>● Cradle of Egypt – Build your own Egypt in the lastest game of the award-winning Cradle series!<br/>● Golden Trails: The New Western Rush - Intriguing detective and romantic storylines and your chance to have the greatest adventure! <br/>● Golden Trails 3: The Guardian's Creed - Track the treasure and solve the riddles of the past in this hidden object game with the Templar setting! <br/>● Letters from Nowhere – Follow the letters from a spirit in more than 30 stunning locations and collect powerful artfacts to unlock the mystery! <br/>● Letters from Nowhere 2 – Challenge your searching skills and find missing Patrick in this cryptic hidden object game! <br/>● Romance Of Rome – Love and treachery, adventure and jeopardy await you in this amazing HO game! <br/>● Star Defender 3 – A wide array of alien spacecrafts in more than 100 breathtaking levels! <br/>● Star Defender 4 – Eight huge missions to save the humanity and become the hero! <br/>● Check iPad App Store for more AWEM games! <br/><br/>STAY TUNED <br/>Have more fun: http://www.awem.com/ <br/>Find us on: https://www.facebook.com/awemgames <br/>Follow us on: http://twitter.com/#!/awem <br/>Watch us on: http://www.youtube.com/user/awemgames <br/>Enjoy our art on: http://pinterest.com/awemgames/", "metacritic": null, "released": "2013-06-21", "tba": false, "updated": "2019-10-22T14:04:15", "background_image": "https://media.rawg.io/media/screenshots/261/26163833ef42bcee7c152f6d68d17281.jpg", "website": "http://www.awem.com/golden-trails-2-the-lost-legacy-collectors-edition.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["VADZIM KAMKOU"], "genres": ["Adventure", "Puzzle"], "publishers": ["VADZIM KAMKOU"], "esrb_rating": "Everyone 10+"}