{"id": 266674, "slug": "brine-lacrosse-shootout-2", "name": "Brine Lacrosse Shootout 2", "name_original": "Brine Lacrosse Shootout 2", "description": "The original flick lacrosse game is back. And this time it’s packing some serious heat.<br/><br/>...<br/><br/>You cut your teeth on Brine Shootout. Now, get ready for a whole new lacrosse challenge—because we’re cranking everything to 11. Shootout 2 is new from the ground up, and we didn’t hold anything back.<br/><br/><br/>Features:<br/><br/>- All-new 3D graphics: Say goodbye to flat defenders. Now, they’re fully 3D, with realistic movement and reactions. Shoot too close to their stick, and they’ll move it to block you. (Sorry.)<br/><br/>- Realistic collision detection: No more phantom stops from the goalie and defenders. Or shots that hit the bar and never go in. Now, the only thing keeping you from lacrosse greatness is your own skill. Or lack thereof.<br/><br/>- Seven new levels: Warm up in the Backyard, then get ready for High School, College, Pro, and a truly diabolical All-Star level. Plus, there are two bonus levels (Street and Space) that take lacrosse to places it’s never been. <br/><br/>- All-new music: As if the gameplay wasn’t enough to get your adrenaline pumping, now there are unique music tracks for each of the levels. Get in the groove—and light up the scoreboard.<br/><br/>- Six new Power-Ups: We wouldn’t throw you in here without a little help. So get ready to:<br/><br/>- Power through defenders with Cannon.<br/>- Cut opponents down to size with Shrink.<br/>- Stop them in their tracks with Freeze.<br/>- Step around them with Pivot.<br/>- Go guided missile on them with Homing.<br/>- Make them run home to mommy with Intimidate.<br/><br/>The only catch? You’ll have to unlock them.<br/><br/><br/>- New unlockable Brine lacrosse gear—including the Clutch III head and King Magnum 170 handle. <br/><br/>- Sharable replays: Don’t just tell your friends about your greatness, show them. Shootout 2 records your games and lets you post the video for all to see—you can even record your face while you’re playing. (Don’t want to share video? You can still post just your score on Facebook and Twitter.)<br/><br/>- A worldwide leaderboard lets you see exactly how you measure up with the lacrosse greats. Spoiler alert: they’re probably better than you.<br/><br/>- Made, tested and played by the brand that’s been a leader in lacrosse since 1922.<br/><br/><br/><br/>How To Play:<br/><br/>- Once the whistle blows, simply flick up to shoot. Flick direction, speed and distance all have an impact on the placement of your shot.<br/><br/>- To keep the clock going, keep scoring. Once you’ve scored three goals in a row, every goal adds :01 to your time; once you’ve hit 10 in a row, that bonus doubles to :02. Until you miss—then you’re back to square one. Want more time bonuses? Unlock better lacrosse gear.<br/><br/>- At the top of the screen is your power meter. Every goal you score helps fill this up. When it’s completely full, you can activate your Power-Up.<br/><br/>- To activate your Power-Up, simply swipe down. Power-Ups last for either 3 shots or 6 seconds, depending on the  Power-Up you’ve selected.<br/><br/>- Power-Up icons are on either side of the screen. As you unlock more Power-Ups, you’ll see more icons. Tap an icon any time to change your Power-Up.<br/><br/>- On the Space level, watch out for black holes. They tilt the game’s gravity (meaning shots are drawn to them), so adjust your aim accordingly.<br/><br/>- Like the game? Do us a solid and rate it on the App Store. And maybe even write a review while you’re at it. (Don’t worry, we’ll never bug you to do this in the game itself.)", "metacritic": null, "released": "2014-08-13", "tba": false, "updated": "2019-10-22T14:04:26", "background_image": "https://media.rawg.io/media/screenshots/ce9/ce93a675d408618bbf6d7fedbeca36d6.jpg", "website": "http://shootout.brine.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Young & Laramore"], "genres": ["Action", "Sports"], "publishers": ["Young & Laramore"], "esrb_rating": "Everyone 10+"}