{"id": 266624, "slug": "cradle-of-rome-hd", "name": "Cradle of Rome (HD)", "name_original": "Cradle of Rome (HD)", "description": "Welcome to the legendary Cradle Of Rome – a unique mix of match-3 and city-builder! Do you hear the sound of the trumpets celebrating your becoming the Emperor? <br/><br/>One of the most powerful capitals that have ever existed is calling for you to become its Ruler! Conquer 100 gripping levels by swapping tiles and matching three or more in a row. Collect supplies and use them to master 5 historical epochs. Play and watch your city grow into a vast and magnificent center of life, the heart of the antiquity! You'll be able to reconstruct masterpieces of Roman architecture, build the Coliseum to train gladiators, and even rebuild the Pantheon, the Temple of all the Roman Gods to bring you even greater luck! <br/><br/>GAME FEATURES <br/>- Over 100 levels of matching fun! <br/>- 5 Historical epochs to master! <br/>- More than 20 masterpieces of the Ancient Roman architecture to build! <br/>- Challenging ranking system that lets you become the Emperor of the great Rome! <br/>- 8 Original bonuses, including lightning, shield, star, mixer, bomb and others! <br/>- Build and conquer your way to the legendary Mount Olympus! <br/>- Try before buy! Start your adventure for free and unlock the whole game without leaving the app!<br/><br/>PRESS QUOTES <br/>“Just love this game. Once you start you'll not want to stop.” iTunes <br/>“A genuinely nice game for any age.” iTunes <br/>“Charming graphics and catchy music. Resource-based matching. Addictive play. ” Gamezebo <br/>“This was my first favourite game and now I can play it on my iPad I am so happy!!!!!!!” iTunes <br/>“Brilliant graphics, very enjoyable and addictive with different goals to achieve. So much more than the common or garden tile matching game.” iTunes <br/>“Can't put it down - superb!” iTunes <br/><br/>MORE AWEM GAMES <br/>● Cradle of Empires – The most adventuorus match-3 puzzle you have ever seen!<br/>● Cradle of Rome 2 – Journey through 5 epochs of matching fun and exhilarating process of building the city!<br/>● Cradle of Egypt – Combination of puzzles, mini-games and city building!<br/>● Golden Trails: The New Western Rush - Intriguing detective and romantic storylines and your chance to have the greatest adventure!  <br/>● Golden Trails 2: The Lost Legacy – Find over 2 000 hidden objects all around the world to reveal the secrets of the pirate's treasure! <br/>● Star Defender 3 - a wide array of alien spacecrafts in more than 100 breathtaking levels!  <br/>● Star Defender 4 - 8 huge missions to save the humanity and become the hero!  <br/>● Check Mac App Store for more AWEM games!  <br/><br/>STAY TUNED <br/>Have more fun: http://www.awem.com/ <br/>Find us on: https://www.facebook.com/awemgames <br/>Follow us on: http://twitter.com/#!/awem <br/>Watch us on: http://www.youtube.com/user/awemgames <br/>Enjoy our art on: http://pinterest.com/awemgames/", "metacritic": null, "released": "2012-04-04", "tba": false, "updated": "2019-10-22T14:04:13", "background_image": "https://media.rawg.io/media/screenshots/52f/52f8d1c07206ffae7a8bfc3ee6acf894.jpg", "website": "http://awem.com/cradle-of-rome-for-ipad.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VADZIM KAMKOU"], "genres": ["Adventure", "Puzzle"], "publishers": ["VADZIM KAMKOU"], "esrb_rating": "Everyone 10+"}