{"id": 26678, "slug": "ubongo", "name": "Ubongo", "name_original": "Ubongo", "description": "Fast-paced, addictive, and easy to learn – Ubongo brings excitement and fun to your Nintendo Switch.\nIn this fast-paced game, you'll need to use your wits to solve a puzzle of various shapes as quickly as possible. Download the ultimate puzzle fun and see how quickly you can turn these puzzles around.\nDiscover four exotic worlds in the Solo campaign. Take on hundreds of gripping levels in the Baobab Savanna, on the wild Fang River, in the Whispering Jungle, and in the sandy Canyon of Bones. Join a zebra, a crocodile, a gorilla, and a rattlesnake on a journey through their puzzle worlds, challenging you with increasingly tricky puzzles.\nTrain your spatial thinking and speed on countless other levels in Free Play for endless fun. \nCompete against up to three other players in local multiplayer, or start Party mode and collect all kinds of crazy boosters. Hinder your opponents by mixing up their tiles with the tornado, or use the clone booster to copy your moves across all playing spaces. Get a hint from the magic eye, or protect yourself against your opponents' boosters with the shield. The difficulty level can be adjusted separately for each player.\nUbongo at a glance:\n \n• Easy to learn\n• Solo mode with hundreds of levels and increasing difficulty\n• Free Play mode with countless random levels\n• Local multiplayer mode for two to four players, with four levels of difficulty\n• Party mode with crazy boosters for ingenious gaming fun\n• The digital version of the multiple award-winning, bestselling board game, with more than 3 million copies sold\n• With all the original tiles from the board game as well as additional ones\n• Ages 8 and up", "metacritic": null, "released": "2011-04-22", "tba": false, "updated": "2020-12-16T14:56:06", "background_image": "https://media.rawg.io/media/screenshots/b0c/b0ccd0bb5afd0b962e16abfc0f81c4bb.jpg", "website": "http://www.ubongothevideogame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Wii", "Nintendo DS", "Nintendo Switch"], "developers": ["Nementic Games", "Korner Entertainment"], "genres": ["Board Games"], "publishers": ["USM", "Korner Entertainment"], "esrb_rating": "Everyone"}