{"id": 266826, "slug": "las-aventuras-de-adam", "name": "Las aventuras de Adam", "name_original": "Las aventuras de Adam", "description": "<p>Este juego se ha desarrollado por Patricia González González y Pedro Medinilla Bohórquez.</p>\n<p>Adam ha perdido sus libros de sus autores favoritos como Federico García Lorca y Valle-Inclán de Dominio Público. ¿Podrás ayudarle a encontrar todos sus libros?</p>\n\n<p>Movimiento: WASD</p>\n<p>Salto: Space</p>\n<p>Ataque: Right Click</p>\n\n<p>También podrás usar un mando Xbox para jugar.</p>\n\n\n<p>Para participar en la gam jam cuyo tema era la cultura abierta hemos desarrollado un juego de plataformas con comunicación con Twitch con el objetivo de responder las preguntas tipo trivial que se encuentran en el juego y hacerlo totalmente impirateable. <br/><br/>https://twitch.tv/iamadamadventure<br/><br/>Durante la partida el usuario puede ver que el juego se compone de 5 escenarios formados por un número de plataformas: tutorial, ciudad, jungla, ciudad del miedo y volcán.</p>\n<p>Para desarrollar el juego se ha utilizado la plataforma de Unity, utilizando la versión gratuita. En ella se han creado varias escenas, que corresponden a los escenarios o plataformas del y en cada escena se han implementado distintos mapas, utilizando Tiled y Tiled for Unity para exportarlos, y distintos assets para hacer los personajes y los enemigos.<br/></p>\n\n<p>Se ha realizado un estudio psicológico aplicado a técnicas de diseño para hacer que el jugador se sienta más agusto, como por ejemplo los fundidos a negro en cada escena.</p>", "metacritic": null, "released": "2018-11-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f36/f3607705fc1a311a5fcc5a91bd0c8dba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hibyrux"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}