{"id": 267039, "slug": "maze-monkey", "name": "Maze Monkey", "name_original": "Maze Monkey", "description": "<p>\"A maze a day...\"</p>\n<p>This is a fun Indy maze game created with Unity.  Each maze is randomly generated so you will never see the same maze twice.  The mazes start with a height of one and upon completion of each level, the height climbs higher and higher.  The mazes are truly 3-D,, where you move up, down, left, right, forward, and backwards.  Connection points are either blue or red.  Your goal in each level is to visit all of the red connectors, turning them blue.  After all connectors are blue your mission is complete and you continue to the next randomly generated maze that is higher then the last one.</p>\n<p>On Android there are three basic types of modes to play: DEMO - this is where the app starts and it is just the computer playing the computer; PLAYER 1 - you vs. the computer; PLAYER 2 - you vs. a friend (need 2 Xbox 360 controllers for this); and FREE PLAY - leisurely traverse the different mazes collecting the red balls at your own pace.</p>\n<p>To get to the menu click on the circle-bar icon in the top left (or click the start button on the controller).  This is inactive when displaying bonus points.</p>\n<p>To navigate the maze with keyboard:<br/>Up Arrow - to move up<br/>Down Arrow - to move down<br/>Left Arrow - to move left<br/>Right Arrow - to move right<br/>'X' key - to move toward the back<br/>'Z' key - to move toward the front</p>\n<p>To navigate the maze with an Xbox 360 controller:</p>\n<p>Right Joystick Up  - to move up<br/>Right Joystick Down - to move down<br/>Right Joystick Left - to move left<br/>Right Joystick Right - to move right<br/>Left Joystick Up - to move toward the back<br/>Left Joystick Down - to move toward the front</p>\n<p>\"A maze a day...\"<br/>When playing the Free Play mode for instance, after climbing to a height of about 10, doing a maze a day is a good way to unwind and blow off some steam, at the same time keeping your mind sharp.</p>\n<p>If you are playing against the computer on Player 1 mode or just relaxing on Free Play mode, I hope you will find this game fun and engaging.  A lot of thought and effort was put into making this game.  The best part is it is totally free.  There are no advertisements and no in-app purchases.  I hope you get as much enjoyment playing this game as I had making it.</p>\n<p>How a maze is often described:<br/>complex, intricate, bewildering, bureaucratic, radial, simple, tangled, endless, complicated, mighty, elevated, dark, arm, perfect, confusing, plus, veritable, vast, temporal, inextricable, labyrinthine, circular, underground, hopeless, impenetrable, legal, tortuous, shaped, perplexing, difficult, elaborate, unit, mental, spatial, strange, huge, dimensional, mystic, wild, dense, maddening, choice, giddy, regulatory, green, confused, famous, double, multiple, linear, mirthful, narrow, thorny, subterranean, giant, virtual, dangerous, fantastic, extra, administrative, mysterious, baffling, interminable, guided, chaotic, blind, incredible, twisted, verbal, trackless, topiary, incomprehensible.</p>\n<p>Things a maze often describes:<br/>learning, task, test, performance, procedure, experiment, dullness, experiments, behavior, situation, ing, alternation, running, problem, training, apparatus, cues, paradigm, globe, model, discrimination, habit, environment, acquisition, trials, delay, pattern, activity, sencier, dull, exploration, solving, stimuli, behaviour, filter, escape, study, bright, retention, choice, example, retrieval, arms, response, testing, tasks, dances, avoidance, filters, pond, silencers, solvers, searching, cue, gawa, gane, rats, orientation, stimulation, learners, transfer, trail, glass, brightness, technique, runner, reversal.</p>", "metacritic": null, "released": "2018-11-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/48b/48bfe9a70b2c41773ffe4857caa544db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["matthewcoleman"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}