{"id": 2670, "slug": "mad-skills-motocross", "name": "Mad Skills Motocross", "name_original": "Mad Skills Motocross", "description": "- “If you're in the market for a fast-paced arcade-style racing game it doesn't get much better than Mad Skills Motocross.” TouchArcade.com<br/>- “Mad Skills Motocross is maybe the best game in the genre.” AppCraver.com<br/>- “Mad Skills MX is a should buy that will have your finger glued to the green gas pedal for hours.” AppAdvice.com<br/>- “Mad Skills is loads of fun and a great app in every aspect.” AppSafari.com<br/>- “Mad Skills Motocross is a must-have iPhone game for any racing game fan.” Download.cnet.com<br/>- “It’s a huge amount of fun for the price and you’ll find yourself easily spending hours trying to shave off a few precious milliseconds from your previous best time.” 148apps.com<br/>- “This simply is a must-buy for all stunt-racing fans.” AppModo.com<br/><br/>Now includes Amateur and Pro modes, for both casual and high-level gamers!<br/><br/>Description: Turning a fan-favorite genre on its head, the hyper-addictive Mad Skills Motocross plays and feels like no other side-scrolling racing game. The unparalleled physics engine and unexpected power-ups give you a level of control that you have to play to believe. Launch off an enormous jump, land on your rear wheel, hit the throttle, and leave your opponent in a spray of dirt—then brag about it on Facebook and Twitter! Mad Skills Motocross is fun for novices but deep enough for nearly endless competitive high-level play. You’ll need to master wheelies, stoppies, nitro, rocket boots, backflips, front flips, and much more to truly be the best.<br/><br/>See what players of the desktop version of Mad Skills Motocross have known since 2009: it’s the best side-scrolling motocross game ever made.<br/><br/>Get it today!<br/><br/>Features:<br/>* NEW: Tournament - Play against other's replays for real prizes<br/>* Change the appearance of your bike and rider<br/>* Compete on 52 tracks, from easy to very technical<br/>* 30 more awesome tracks available as in-app purchases<br/>* Compete in Career or Time Attack modes<br/>* Compete in either Amateur or Pro modes for varying levels of difficulty<br/>* Ten additional free tracks for everyone<br/>* Two bonus tracks for our social media friends<br/>* Use five different power-ups to find faster ways through tracks<br/>* Race your own \"ghost\"<br/>* Watch replays of your best races<br/>* Rub in victories over friends on Facebook and Twitter<br/><br/>See the official trailer here: http://www.youtube.com/watch?v=9X--W1x4nbA<br/><br/>Gift this app! Just click the arrow beside the Buy App icon.", "metacritic": null, "released": "2009-08-25", "tba": false, "updated": "2019-07-29T19:04:36", "background_image": "https://media.rawg.io/media/screenshots/819/819aef78f7c6f70165a2710a45db189d_nYVKtke.jpeg", "website": "http://www.madskillsmx.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android", "iOS"], "developers": ["Miniclip.com", "Turborilla"], "genres": ["Sports", "Racing", "Arcade"], "publishers": ["Turborilla"], "esrb_rating": null}