{"id": 267196, "slug": "week12_findanagrams", "name": "Week#12_FindAnagrams", "name_original": "Week#12_FindAnagrams", "description": "<p>Controls: use mouse (hold LBM) to select words like you would unlock your phone by drawing a pattern</p>\n<p>Simple anagram unscramble game - try finding all the words that can be made with given letters ( I know some words are not accepted when they should be ) . </p>\n<p>Week12: 7.11.2018-16.11.2018 </p>\n<p>Constraints:  Simple word game using a given data set of anagrams</p>\n<p>Core Dynamic: puzzle using words</p>\n<p>Summary:Some time ago I was asked if I can do one of those games and I thought I can and now I know I can :D I thought how hard can a simple word puzzle game be? Well it wasn't exactly roses and rainbows . I have really struggled when making the input by swiping - reproducing the phone pattern unlock input system. When I have figured it out it somehow it stills sometimes doesn't mark the letter but takes it for the answer test.  Anyways at the end it was nice feedback about how much do I still have to learn.</p>\n<p>What went bad: Time! It took very much time when I thought it would be 3 day project. Unfortunately I am bad at planning with a day job and life challenges its hard to get \"rough\" as Dwayne Johnson says and do the work right now when you are considering I can work and sleep for less than 6h or just do this tomorrow.  Also I would want to go back to starting on Monday and finishing Sunday and right now I am starting at Thursday-Friday. I need quick and dirty 3 day project.</p>\n<p>What went good: I had fun. I have valuable feedback about what I need to work on to become better programmer and I am more and more confident about my current abilities. </p>", "metacritic": null, "released": "2018-11-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c08/c08b203e0e04d46d85b49588a055866c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sunny Valley Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}