{"id": 267289, "slug": "babysitter-makeup-baby-care", "name": "Babysitter Makeup Baby Care", "name_original": "Babysitter Makeup Baby Care", "description": "Babysitters have the toughest job of them all. Taking care of kids is hard, especially when there's a baby involved! Help these girls have a little play time with Babysitter Makeup - Girls Dress &amp; Baby Care a fun dress up game for kids!<br/><br/>Four different babysitters are hard at work taking care of their baby. Make their play time a little easier by dressing them in cute outfits. Choose from shirts, dresses, skirts, shoes, jewelery and other accessories, all designed to make the girls look as cute as can be. Create and change outfits until they look perfect!<br/><br/>Along with playing dress up, you also need to give makeovers to these girls! Add makeup and cute hairstyles to complete their playful yet responsible look. Once their outfit is complete, it's time to take care of those babies. Dress them up, too, then head into the play room for a little fun time!<br/><br/>Features:<br/>- Dress up each girl in your very own spa.<br/>- Take care of and play with adorable babies!<br/>- Fix each girl's hair and makeup so they look cute.<br/>- Four different babysitters to choose from.<br/>- Four different babies to take care of.<br/><br/>How to Play:<br/>- Use the touch screen to select outfits for each girl.<br/>- Apply makeup, hairstyles and jewelry by tapping on the screen.<br/><br/>Join our Facebook Page: https://www.facebook.com/pages/Pocket-Princess-Inc/625430640898596<br/>Follow us on Twitter: https://twitter.com/PocketPrincessI<br/>Know more about Pocket Princess at our official website: http://www.pocketprincessinc.com/", "metacritic": null, "released": "2014-12-16", "tba": false, "updated": "2019-10-22T14:04:39", "background_image": "https://media.rawg.io/media/screenshots/7d2/7d2e3e182d52f6be24f065fa0a7b307a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Princess"], "genres": ["Family"], "publishers": ["Pocket Princess"], "esrb_rating": "Everyone 10+"}