{"id": 267264, "slug": "criminal-minds-the-mobile-game", "name": "Criminal Minds The Mobile Game", "name_original": "Criminal Minds The Mobile Game", "description": "Join the elite team of FBI criminal profilers - the Behavioral Analysis Unit - and enter the world of the long-running CBS TV series, Criminal Minds in the official mobile game. Criminal Minds: The Mobile Game puts you at the center of an intense and dramatic story that will keep you on the edge of your seat. <br/><br/>Navigate intense cases involving the world’s most brutal serial killers, that only the BAU team, featuring Rossi, Prentiss, Reid, J.J., Garcia, Lewis, Alvez, and Simmons, can piece together and solve before it’s too late. <br/><br/>Time  is of the essence as players must work to profile suspects, analyze crime scenes, and manage the BAU team to keep the public safe and prevent the UnSub from striking again, in this. Criminal Minds: The Mobile Game is a compelling overarching storyline that will satisfy even the most hard-core crime drama fans.<br/><br/>As with TV show episodes, individual cases will consist of unique objectives and tasks. When completed, clues will help players profile, track down, and capture the UnSub.<br/><br/>●\tMore than just your average FBI detective, realize the ultimate fantasy of working alongside the BAU’s brightest criminal profilers in intense mysteries<br/>●\tImmerse yourself into the universe of Criminal Minds to solve gruesome crimes - more than 60 levels across six cases!<br/>●\tManage your time wisely and investigate complex crime scenes to enter the mind of the UnSub and find their next target<br/>●\tRace against yourself by replaying levels to beat your high score, complete tasks more efficiently, and utilize different character’s strengths for a different play-through experience<br/>●\tSelect and match characters based on their unique profiling specialties to build a crime scene dream team<br/>●\tBeat the clock and make critical decisions to reach the next level", "metacritic": null, "released": "2018-11-20", "tba": false, "updated": "2019-07-29T13:29:08", "background_image": "https://media.rawg.io/media/screenshots/285/2851a924038e8c10f08c84d2b31cc6d4_0pYL2er.jpg", "website": "http://www.ftxgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FTX Games"], "genres": ["Action", "Puzzle"], "publishers": ["FTX Games"], "esrb_rating": null}