{"id": 267368, "slug": "girls-hair-cutting-game-3d", "name": "Girls Hair Cutting Game 3D", "name_original": "Girls Hair Cutting Game 3D", "description": "Do you want to have hair styles from best hair salon of town? Spice up your hair style with this hair salon! So have you ever dreamed of becoming a hairdresser in famous hair salon of New York City? Hair salon for girls is for those who dreamed to make stylish hair do and hair cutting styles! Get ready for your exciting day at work with hair cut in hair salon! Make a good impression so customers will keep coming back for more! Run own hair salon and help young girls look perfect after makeover from your hair salon! <br/><br/>Girls want their haircut from top salon of city. So, take customers into your salon and create brand new look for them. Cut, color and style hair using your creativity as a famous hairdresser! Try on the image of a barbarian and perform haircut, hair style and have fun! Work as pro hairdresser with tools and steady hand! Cut hair into fun cuts like asymmetrical bobs, undercuts or pinup bangs! We have brought to you with variety of Women hair styles so, learn to make better look with beautiful hairstyles. World’s most famous hair dresser is waiting for you to give crazy hair cut!<br/><br/>Features:<br/>•\tChallenging haircut game level!<br/>•\tVarious hair tools like scissor, comb, hairdryer &amp; much more!<br/>•\tChance to become a hairdresser or hairstylist &amp; show your creativity!<br/>•\tProfessional inspired products and hair dresser in hair cutting game! <br/>•\tAttractive gameplay and sound effects!<br/><br/>Download barber shop hair cutting girls game and give us your feedback, so we can make more barber shop, hair salon and hair cutting games for you.", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-10-22T14:04:43", "background_image": "https://media.rawg.io/media/screenshots/954/954fd36d4ed8861610c08695bcfb9b5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abdullah Sattar"], "genres": ["RPG", "Simulation"], "publishers": ["Abdullah Sattar"], "esrb_rating": "Everyone 10+"}