{"id": 267364, "slug": "flying-super-hero-fight-real-city-criminals", "name": "Flying Super Hero Fight Real City Criminals", "name_original": "Flying Super Hero Fight Real City Criminals", "description": "Fulfill your dream of becoming superhero robot as darkness has fallen in city due to the attack of mafia terrorists. Be the super hero city people need. Be the savior and rescue grand city, take down villain that stands on your way. Superhero robot man earth realm aiming to be the avenger of this fallen crime city and restore its peace. The terrorists has invaded the vice town and turned it into a crime city. The casualties and catastrophes caused by these mafia terrorists are increasing and the lives of innocent people is at stake. The city officials have launched several attack but have failed miserably. Fight against some brutal mafia gangster earth realm and wage a future battle against them. <br/><br/>Unleash the best of your superhero robot fighting skills in this exciting and challenging super hero future battle game. Protect and rescue president of your country and prove your skills as a real super hero. Rescue hostages from brutal mafia criminals. Live life of a super robot man from one building to another at supersonic speed, rescue civilians and fighting crime. <br/><br/><br/><br/>Features: <br/>• Epic 3D physics and sound effects<br/>• Exciting battles with mafia criminals <br/>• Amazing laser fire<br/>• Destroy enemies.<br/><br/>Download this game and give us your feedback, so we can make more game for you.", "metacritic": null, "released": "2017-07-06", "tba": false, "updated": "2019-10-22T13:52:35", "background_image": "https://media.rawg.io/media/screenshots/d9f/d9f38c6cd1a679a1bd74db11d296b75e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abdullah Sattar"], "genres": ["Action", "Simulation"], "publishers": ["Abdullah Sattar"], "esrb_rating": "Teen"}