{"id": 267372, "slug": "ninja-assassin-fighter-throw-shuriken-arcade", "name": "Ninja Assassin Fighter: Throw Shuriken Arcade", "name_original": "Ninja Assassin Fighter: Throw Shuriken Arcade", "description": "It’s high time for vengeance!! Restore your super ninja warrior dignity, kill black castle enemies who ruined your town and killed all your people. Utilize your ninja fighting skills to kill all foes using your classic samurai sword blade playing fighting adventure game. Be the ninja warrior assassin and eliminate your enemy ninjas playing this ninja slash survival game. Black castle enemies are unaware of stealth mode capabilities you possess as a ninja warrior assassin. You possess great martial arts survival and legend survival fighting skills and can be a threat to the royal throne of black castle. <br/><br/><br/>As a real warrior ninja superhero of dark shadow dungeon &amp; ninja slash games showcase your ninja fighting skills. Jump kick, attack to master the shinobi missions on the epic battle ground become a melee warrior slash and crush your enemies. Make good use of your shadow fight warrior slash lethal weapons in ninja survival game. In ninja assassination fights to win the deadly survival fight with black castle demon bosses and crush your enemies including armor knights, ninjas, archers &amp; slash sword fighters. Fight every strange evil enemy on your way and try to avoid every deadly attack and do not stop swapping and tapping the mobile screen for maximum kills in this fighting adventure game.<br/><br/><br/>Features:<br/><br/>10 epic action game levels  <br/>Amazing dynamic fighting controls of katana.<br/>Epic fighting game with dangerous enemies<br/>Lethal Weapons like Shuriken, Bow &amp; slash Sword<br/>Beautiful Castle Environment to Explore<br/>Superb 3D Graphics and Sound Effects<br/>Super hero swapping &amp; tapping on screen<br/><br/><br/>Download this game and give us your feedback, so we can make more new games for you.", "metacritic": null, "released": "2017-08-09", "tba": false, "updated": "2019-10-22T14:04:43", "background_image": "https://media.rawg.io/media/screenshots/0b5/0b56a6583f5aa1ee513e386f5e3286e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abdullah Sattar"], "genres": ["Action", "Simulation"], "publishers": ["Abdullah Sattar"], "esrb_rating": "Teen"}