{"id": 267354, "slug": "the-life-simulator", "name": "The Life Simulator", "name_original": "The Life Simulator", "description": "Life Simulator is a realistic life simulation game that is both fun and educational! Choose a starting life scenario and see if you can go from rags to riches! Start as an uneducated bum living on a park bench and end as a yacht driving CEO living in a mansion.<br/><br/>The game contains subtle lessons about financial investment, relationship, career, time management, and life philosophies. Life is a balancing act between health, happiness, mental sanity, and wealth constrained by our limited lifespan, you get to decide how you want to live your life. There are many ways to win!<br/><br/>Features includes:<br/><br/>- 15+ starting life scenarios (high school dropout, indebted college student, etc)<br/>- 10+ unlockable perks<br/>- Travel to 5 different countries<br/>- Multiple achievable life goals<br/>- Lease, buy and rent out 6 types of properties<br/>- Buy a sports car, a private jet, a yacht and more<br/>- Take a break, go camping, go to a concert, or go on an international vacation<br/>- Meet, date, propose and marry partners with different personalities<br/>- Have children and watch them grow to adulthood<br/>- Earn degrees and learn life skills<br/>- Spend time with family<br/>- Get a job and climb your way to the top, or buy a car and drive for Uber<br/>- Start a company, choose between a factory, software company, or a restaurant chain<br/>- Produce YouTube videos, make apps, or release tracks as a DJ<br/>- Choose the life of crime and work your way to a crime syndicate<br/>- Treat your own illnesses or go see a doctor<br/>- Eat unhealthy fast food or learn to cook and make healthier meals<br/>- Save money, earn interest, or get bank loan<br/>- Become a professional athlete and play basketball, football and baseball<br/>- Invest your money and play the stock market<br/>- Buy lottery tickets and pray for the jackpot<br/>- Buy pets and feed them treats<br/>- Check your weekly cash flow for a view of your finances<br/>- More than 120 random events to make things interesting", "metacritic": null, "released": "2018-11-20", "tba": false, "updated": "2019-07-29T23:31:43", "background_image": "https://media.rawg.io/media/screenshots/96e/96e20c99841c23d36ea12dd1667e886a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mind Vacation"], "genres": ["Strategy", "Simulation"], "publishers": ["Mind Vacation"], "esrb_rating": null}