{"id": 267458, "slug": "hot-dog-party", "name": "Hot Dog Party", "name_original": "Hot Dog Party", "description": "THE GAME THAT THE BIG BURGER INDUSTRY DOESN'T WANT YOU TO SEE!! Banned in over 300 countries, give or take a few hundred, Hot Dog Party is sparking a new worldwide revolution. Do you have the guts to join? You know what does have guts? HOT DOGS HAVE GUTS! Pig guts to be exact, and other fine processed meats not yet recognized by the FDA (damn hippies). So ask yourself, do you want to be a winner...scratch that...a WIENER and make a difference in this dog forsaken existence? Or do you want to live your life in subservience to the tyranny of ground beef? Choose your legacy. Choose to fight for the freedom of all mankind. We're counting on you!<br/><br/>Hot Dog Party is the first game ever to be conceived and produced by hot dog game developers! Thanks to scientific advances in hot dog research, we were able to put our team of uncooked franks through rigorous training exercises, resulting in an elite team of highly skilled designers and programmers. Unconfirmed studies have shown that hot dogs are 99% more efficient than their human counterparts at developing games. That is hard science. Want more hard science? Certified experts agree, Hot Dog Party is the greatest game ever made. \"It's so real I almost swallowed my phone\" - Ben Timbernackle, Professional Hot Dog Eating Contest Champion.    <br/><br/>No hot dogs were harmed in the making of this game.<br/><br/>Oh, and the game is about stacking hot dogs. You stack hot dogs on top of each other.", "metacritic": null, "released": "2016-03-16", "tba": false, "updated": "2019-10-22T14:04:46", "background_image": "https://media.rawg.io/media/screenshots/771/771bf3f2d37684d6c430aa02649ab3d4.jpg", "website": "http://www.brunkt.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BRUNKT"], "genres": ["Arcade", "Family"], "publishers": ["BRUNKT"], "esrb_rating": "Everyone 10+"}