{"id": 2674, "slug": "ea-sports-ufc-2", "name": "EA SPORTS UFC 2", "name_original": "EA SPORTS UFC 2", "description": "<p>EA Sports UFC 2 is a fighting game developed by EA Canada. It is the official game of the Ultimate Fighting Championship.</p>\n<h3>Plot</h3>\n<p>There is no plot present in the game, as all the fights heavily resemble the real UFC fights.</p>\n<h3>Gameplay</h3>\n<p>The main objective of the player is to knock their opponent out. The matches may end via Submission, Knockout, Technical Knockout, or by Judges&#39; Decision in case none of the fighters gets knocked out. These matches take place in an octagonal cage, which the fighters cannot leave during the match. EA Sports UFC 2 is trying to resemble the real UFC matches as accurately as possible. The rule sets, venues, and the moves present in the game are carefully recreated in-game.</p>\n<p>Several game modes are present in the game. The players are free to play an instant UFC match, choosing the fighter and other fight aspects, such as the venue the match is held in, who to play against, and customizing the rule set.</p>\n<p>In a Knockout mode, the players can only win a fight by knocking their opponent out. This mode focuses mostly on strikes, rather than on grapples. There is no stamina bar present in the Knockout mode.</p>\n<p>The Ultimate Team game mode is also present in the game. The players build up a stack of cards which resemble different fighters to play against other players&#39; stacks. Upon winning, the players are given coins, that can be used to upgrade their fighters or purchase new ones. The players can also engage in multiplayer fights against each other.</p>", "metacritic": 78, "released": "2016-03-15", "tba": false, "updated": "2024-04-08T19:03:20", "background_image": "https://media.rawg.io/media/games/187/18712fa218a19396d209393a8958ae00.jpg", "website": "https://www.ea.com/games/ufc/ufc-mobile", "rating": 3.44, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 1024, "beaten": 62, "toplay": 7, "dropped": 104, "playing": 10}, "playtime": 27, "achievements_count": 112, "ratings_count": 236, "suggestions_count": 397, "game_series_count": 3, "reviews_count": 236, "platforms": ["iOS", "Xbox One", "Android", "PlayStation 4"], "developers": ["Electronic Arts"], "genres": ["Sports", "Fighting"], "publishers": ["Electronic Arts", "EA Swiss"], "esrb_rating": "Teen"}