{"id": 267594, "slug": "2017-gymnastics-swim-diving-3d", "name": "2017 Gymnastics Swim Diving 3D", "name_original": "2017 Gymnastics Swim Diving 3D", "description": "One of the best swimming pool racing game is now available in Itunes store <br/>Are you ready to enjoy the swimming in the cold water of the swimming pool? It’s hot outside so now take off your clothes and wear a suitable gear for swimming and jump in the cold water for swimming pool and experience the thrills of real life swimming in your mobile <br/>This game is also for those who are dreaming for their bright career in the field of swimming. First thing you have to do is to select a best swimmer and start practice with him and be prepared for the tournament that happens every year. <br/>This year tournament will going to be very much difficult because many talented swimmers are going to take part in the tournament so in order to beat all of them you need to be ready for all the difficult challenges<br/>This game first allows you two option, free roam for practice and championship battles for earning money and increase your reputation in the crowd by winning these battles you can earn money which allow you to buy new and strong swimmers, new swimmers can swim fast and can beat other swimmers easily. <br/>Win the tournament and bring the trophy home <br/><br/><br/>GOOD LUCK!<br/><br/><br/>MAIN OBJECTIVE<br/>Practice your swimming skills and win the champion ship<br/><br/><br/>MAIN FEATURES<br/>-High quality 3D graphics<br/>-High quality sound Effects<br/>-Addictive gameplay <br/>-Increase your swimming skills<br/>-Interesting and adventurous missions", "metacritic": null, "released": "2017-07-12", "tba": false, "updated": "2019-10-22T14:04:53", "background_image": "https://media.rawg.io/media/screenshots/a07/a07a612996ea4062588a64d22f3959f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shoaib Sheikh", "Hammad Tahir"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Shoaib Sheikh", "Hammad Tahir"], "esrb_rating": null}