{"id": 2675, "slug": "pixel-quest-rpg", "name": "Pixel Quest RPG", "name_original": "Pixel Quest RPG", "description": "Welcome to the first mobile RPG with no forced ads and no pay-to-win. As an ode to our pixelated past, Pixel Quest offers a puristic retro experience with beautiful pixel art and turn-based gameplay.<br/><br/>Step into a lengthy and varied gameplay experience featuring solo dungeons, co-op PVE dungeons, and ranked PVP! Choose your starting hero from a nostalgic cast - Warrior, Mage, or Rogue - and then forge your strategy as you progress through a deep, fully customizable skill tree and seek out powerful new items.<br/>With a constant stream of new content to explore and a dedicated indie development team, players can rest assured that Pixel Quest will always offer a refreshing, hardcore RPG experience crafted with love. And once you have sought out the most powerful items, captured the rarest monsters, and tailored your character to spec, you can step into the Dragons Arena to test your skills against other ranked players!<br/><br/>Key features:<br/>- An entirely free indie game with optional cosmetic upgrades (No pay-to-win)<br/>- Turn-based solo, PVP, and PVE battles<br/>- 100 dungeon levels full of new challenges to explore<br/>- Monster capturing, user-created dungeons, and a real-time tradable market with other players<br/>- Fantasy pixel art style and nostalgic 8-bit soundtrack<br/>- Active and responsive development team with an active Discord community full of RPG enthusiasts to team up with<br/> <br/>The game is only available in English, and a network connection is required to play.", "metacritic": null, "released": "2013-01-24", "tba": false, "updated": "2022-10-17T08:49:01", "background_image": "https://media.rawg.io/media/screenshots/eba/eba710e3483edd2fbe30b75e3ba050c7.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["chen bo", "Nicola Ballerini"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["chen bo", "Nicola Ballerini"], "esrb_rating": null}