{"id": 267596, "slug": "blocky-pixel-taxi-car-racing-3d", "name": "Blocky Pixel Taxi Car Racing 3D", "name_original": "Blocky Pixel Taxi Car Racing 3D", "description": "It's Time TO Play Unique Blocky Pixel City Racing Game<br/><br/>Take your passengers safely through the blocky city! Dodge rivals who try to prevent your cab arrives at its destination!<br/><br/>Get ready for an unprecedented adventure in Blocky Pixel Taxi Car Racing. Your reputation as a safe and quick Blocky Taxi driver must not fall, but some cars and traffic are not going to put anything easy.<br/><br/>Choose from four models available your favorite Blocky Taxi. All are featured with a magnificent pixelated design.<br/><br/>Hit the race with your Blocky Taxi and driving at full speed on a road full of surprises!<br/><br/>The controls are very simple and you only have to move your mobile device sideways like a steering wheel. You'll feel totally at the controls of the Blocky Taxi!<br/><br/>Prevents energy bar runs out while you show that you are an as motor and you know every millimeter of the city!<br/><br/>Are you ready to save the passengers and earn money?<br/><br/>Features of this taxi racing game: <br/><br/>- Urban circuit<br/>- 3 Blocky Taxi to choose<br/>- Lovely graphics<br/>- Amazing speed<br/>- Score board<br/>- Entertaining music<br/><br/>We like to get feedback from our users and know what they think about the games that we present. We hope your opinion!<br/><br/>Live a different experience in Blocky Pixel Taxi Car Racing!", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-10-22T14:04:53", "background_image": "https://media.rawg.io/media/screenshots/a55/a5517996da66a844007e79a4043c4d14_DpY1BGQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hammad Tahir"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Hammad Tahir"], "esrb_rating": "Everyone 10+"}