{"id": 26753, "slug": "kirby-mass-attack", "name": "Kirby Mass Attack", "name_original": "Kirby Mass Attack", "description": "<p>\n      One day, an evildoer with a magic cane appears and splits Kirby™ into 10 \n      pieces. Kirby sets off on a journey to return to his original form. \n      Players use the touch screen to control a mass of Kirby characters in a \n      new and novel way. Swipe the touch screen to launch them in a mass \n      attack against enemies, then tap the enemies into submission.\n    </p><ul>\n<li>\n        Players use the stylus on the touch screen to control a swarm of up to \n        10 Kirby characters at once. They can help players defeat enemies and \n        find treasure. The number of Kirby characters under a player’s control \n        is important, as some challenges require a specific number of Kirby \n        characters in order to be solved. When the number of Kirby characters \n        is increased, players can gain the upper hand.\n      </li>\n<li>\n        Players can control each Kirby character in a variety of ways using a \n        stylus on the touch screen. For example, a Kirby character can be \n        launched into the air with a flick of the stylus, or players can make \n        a swarm of Kirby characters dash to a given point by tapping on that \n        spot on the touch screen multiple times.\n      </li>\n<li>\n        By collecting medals hidden throughout the various stages, players can \n        unlock a wide variety of additional mini-games, each with its own \n        distinctive challenges.\n      </li>\n</ul>", "metacritic": null, "released": "2011-09-19", "tba": false, "updated": "2023-08-05T12:43:55", "background_image": "https://media.rawg.io/media/screenshots/353/353631ce48d0b41e40d89d7afc49320b.jpg", "website": "http://kirby.nintendo.com/massattack/", "rating": 4.1, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 11, "beaten": 16, "toplay": 12, "dropped": 8, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 163, "game_series_count": 20, "reviews_count": 10, "platforms": ["Wii U", "Nintendo DS"], "developers": ["HAL Laboratory"], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}