{"id": 267628, "slug": "mini-crazy-taxi-driver-blocky-pixel-city-rush", "name": "Mini Crazy Taxi Driver - Blocky Pixel City Rush", "name_original": "Mini Crazy Taxi Driver - Blocky Pixel City Rush", "description": "Get ready to enhance your driving skills. Now the first thing you have to do is to fast in your seat belts and drive a fast taxi. An extreme crazy driving simulator concept with furious taxi cab driving in passenger pick &amp; drop game. Now your task is to drive a taxi in town try not to follow the rules. But few things to keep in mind drive carefully and don’t hit the civilians other wise your civilian will get panic and in result to have to play the game again and one more thing to keep in mind is that don’t fall in the river otherwise the mission will going to failed. In every level all you have to do is to Pick a civilian on the drive way and drop it on the destination and earn bonus, Destination of all the passengers will be displayed on the map. <br/>Are you a fan of high speeds? Does the thought of driving give you a major rush? Then fasten your seat belt and experience the craziest driving adventure yet! This game is all about racing and drive as fast as you can around town to complete challenging missions pick up the passengers and drop them on their desired destinations. Are you ready for a wild ride and feel the thrill of riding through the vast open road? <br/>If yes then make up your mind and go for it.<br/><br/>Speed up your taxi car, drive through the big city traffic, pick up the passengers and drop them off at their destinations. Get crazy with your taxi drive, speed and drift. Your taxi stand contains a lot of taxis you can also drive 2 door cab or a saloon cab, both have different advantages. <br/>Enhance your driving skills by pushing the breaks and accelerator in the right time.<br/>You would love to be a cab driver once you would play this super amazing and superb city cab driving game. You will definitely drive this city cab for hours &amp; hours as this city cab has highly real cab controls. <br/>This game runs smoothly and contains high quality 3D graphics, so now its your responsibility to download this game and enjoy your free time be one of the lucky users to play this game.<br/><br/><br/><br/>MAIN OBJECTIVES<br/>Grab the coolest taxi and pick up the passengers and drop all of them on their destination<br/><br/><br/>MAIN FEATURES<br/>- Adventurous taxi drive on the streets<br/>- Addictive gameplay <br/>- High quality 3D graphics<br/>- User friendly taxi controls <br/>- Your driving skills will get improve<br/>- Excellent and different GUI<br/>- Exciting missions to play<br/>- Highly tuned taxi cabs including buses <br/>- Taxi stand include cabs , saloons, busses<br/>- Smooth and simple tilt and drive including steering control and much more<br/><br/>Press the accelerator as hard as you can to reach destination in time. Time is your worst enemy so use accelerator and press the breaks at the right time to avoid collisions, Now the only thing left to do is to tap on the download button and enjoy the exciting missions of Mini Taxi Mobile.", "metacritic": null, "released": "2017-07-10", "tba": false, "updated": "2019-10-22T14:04:55", "background_image": "https://media.rawg.io/media/screenshots/4d5/4d5c63db59df2447bdeced2b893b20c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hammad Tahir"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Hammad Tahir"], "esrb_rating": "Everyone 10+"}