{"id": 2676, "slug": "gun-commando", "name": "Gun Commando", "name_original": "Gun Commando", "description": "Earth has been captured by alien forces and all that stands between the oblivious civilians and their grim fate is Gun Commando, Jack Bennett. Jack  is no-nonsense, war-torn mercenary – with a large arsenal of heavy weaponry! His deadliest mission yet takes him on a city-wide journey of destruction, where he must attempt to single-handedly eliminate the “Bug problem” once and for all.  His main goal is simple: kill every last one of them!<br/><br/>Gun Commando™ takes inspiration from legendary games like Doom and Wolfenstein 3D,  combining classic First Person Shooter  and Shoot-em-up gameplay – with a look and feel that gives the game a nostalgic, old-school appeal. Together, this creates an energetic and unique experience – all topped off with beautifully illustrated artwork by comic book legend, Romano Molenaar.<br/><br/>With an ingenious weapons upgrade system, 24 levels of alien carnage and seriously epic boss battles – it’s time to re-claim Earth and take out the invading army with some heavy firepower, one alien at a time!<br/><br/>“Consistent production value that perfectly encapsulates an era which almost is forgotten” 9/10 Shogun Gamer<br/><br/>“Pure run-and-gun bliss” Digitally Downloaded<br/><br/>“Gun Commando is a solid Doom clone with a number of fresh ideas” Gaming Nexus", "metacritic": null, "released": "2013-04-25", "tba": false, "updated": "2019-10-22T14:28:09", "background_image": "https://media.rawg.io/media/screenshots/1b4/1b4872850cd5f4f7303abd27e8826e87.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Action", "Arcade"], "publishers": ["Ripstone"], "esrb_rating": "Mature"}