{"id": 267647, "slug": "rescue-ambulance-driver-3d-simulator-on-duty-param", "name": "Rescue Ambulance Driver 3d simulator - On duty Paramedic Emergency Parking, City Driving Reckless Racing Adventure", "name_original": "Rescue Ambulance Driver 3d simulator - On duty Paramedic Emergency Parking, City Driving Reckless Racing Adventure", "description": "Mayday!!!!!Mayday!!!!<br/>Calling all 911 rescuers, life saviors…. Do you have the driving skills needed to save the injured citizens? Are you an expert reckless driver for driving on crowded highway, city traffic, rounding sharp turns without crashing into buildings and pedestrians?<br/>This 2016 Rescue ambulance driver 3d simulator brings you challenging city drive missions with drastic Accidents and life threatening Situations. Turn on the Sirens and push the full throttle. Rush to the accident site as fast as lightening in the city hustle and bustle. Time is critical, fast speed with extreme driving is required. After loading the patients, drive carefully as the peoples’ life depend on your driving skills. Sirens in the air, keep your eye on the road and drive back quickly to the nearest hospital. Avoid the oncoming traffic, school buses and trucks, also make sure that the patient is relaxed during the ambulance drive back to the city hospital.  <br/>911 rescue calls are increasing.  Are you the heroic on duty Driver to save lives, respond to calls, collect patients in need during the critical time? Can you handle the pressure and go beyond the call of duty? With the Innovative rewind system become the best ambulance driver of the city in this epic open world simulator game.<br/><br/>&gt;&gt;&gt;&gt;This is not an ordinary ride you are driving. Ambulance duty will teach you the sense of responsibility when other life’s depends on your driving skills. Save as many lives as possible and score high. Get ready for a very engaging time base game-play with stunning 3d graphics.&lt;&lt;&lt;&lt;", "metacritic": null, "released": "2016-04-01", "tba": false, "updated": "2019-10-22T14:04:56", "background_image": "https://media.rawg.io/media/screenshots/f54/f5436673bef34073398097dda7472b70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kamran Shahzad"], "genres": ["Simulation"], "publishers": ["Kamran Shahzad"], "esrb_rating": "Everyone 10+"}