{"id": 267609, "slug": "police-car-crime-chase-2016-reckless-mafia-pursuit", "name": "Police Car Crime Chase 2016 - Reckless Mafia Pursuit on Asphalt Racing with Real Police Driving Action with Lights and Sirens", "name_original": "Police Car Crime Chase 2016 - Reckless Mafia Pursuit on Asphalt Racing with Real Police Driving Action with Lights and Sirens", "description": "Gear up for the extreme police crime chase challenge in the new hardcore Police Chase Adventure 2016.  This cops chase racing game brings a fresh battle of Police vs thief/ Cops vs robber with armored car death race and demolition car wars.<br/><br/>Play the Crime Police chase 3D escape mission diligently. The crime city needs a real police driver for the mafia pursuit on the highway. Each cop chase racing challenge brings a hot city police pursuit and demolition car wars against the escaped prisoners, crime gangs and MW mafia criminals in the crime city. Drive the vibrant police car on the death race to crash burn the criminal car. Enjoy one of the real smashing action in the hottest police car chase on your phone.<br/><br/>Enjoy the thrilling demolition derby action as a Real Police Car driver in the high speed Cop chase racing game. Unlock Powerful Vehicles with real police lights, siren and sounds. Win this battle between police vs thief in this crime city police driver simulator. Crash Drive through the city highway and enjoy the thrill of demolition car wars in the latest City Police Car Crime Chase 2016.", "metacritic": null, "released": "2016-05-07", "tba": false, "updated": "2019-10-22T14:04:54", "background_image": "https://media.rawg.io/media/screenshots/82c/82c03c9f71c09a97a3f960ce69176df6_XnKI5ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kamran Shahzad"], "genres": ["Action", "Simulation"], "publishers": ["Kamran Shahzad"], "esrb_rating": "Teen"}