{"id": 267674, "slug": "flying-limo-city-2016-simulator-future-limousine-p", "name": "Flying Limo City 2016 Simulator – Future Limousine Parking with Air Plane Driving Controls", "name_original": "Flying Limo City 2016 Simulator – Future Limousine Parking with Air Plane Driving Controls", "description": "Combo of Futuristic Flying Car and Limo driving<br/> Flying Limo car simulator 2016 takes you on a time travel to Futuristic urban city. Enjoy driving your limousine/ limo in the air. Drive like super sports car and do some limousine/ limo stunts and drifts in the sky just like flying an airplane. A new addition to the futuristic flying car games.<br/><br/>Burn the asphalt…. Race your limousine in the urban city<br/> Flying limousine driving will take you on a new driving simulation. Enjoy your limozeen ride in the city. Convert it into a flying limo car to overcome obstacles. Collect the coins in the sky to earn bonus and unlock some stunning flying limos.<br/><br/>Catch the Flying Limo Car Driving Fever<br/>Though of driving Limo cars like airplane or quadocopter when stuck in city traffic or running late for a party? Here’s your chance to dive a flying limo or racing your flying car in the air over the blue skies. A perfect limo simulator game for you! Drive your American muscle limousine like a super sports car or fly your car like an airplane. It’s upto you.<br/><br/> Enjoy a realistic flying car simulator as a limo Chauffeur. Be the best limousine driver in the latest limo driving simulator. Feel like a professional aircraft flight pilot. Download the Flying Limo City 2016 Simulator today.", "metacritic": null, "released": "2016-05-27", "tba": false, "updated": "2019-10-22T14:04:58", "background_image": "https://media.rawg.io/media/screenshots/b51/b51d1e231c45c52ffa2bb6081659f862_LGLKXph.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kamran Shahzad"], "genres": ["Simulation", "Racing"], "publishers": ["Kamran Shahzad"], "esrb_rating": "Everyone 10+"}