{"id": 26763, "slug": "solatorobo-red-the-hunter", "name": "Solatorobo: Red the Hunter", "name_original": "Solatorobo: Red the Hunter", "description": "<p>Solatorobo: Red the Hunter is an action role-playing game taking place<br />\nin the Shepherd Republic, a nation high in the skies consisting of<br />\nnumerous floating islands. As Red, the player utilizes his personalized<br />\nrobot to pick up heavy items and enemies, catch and throw back<br />\nprojectiles, glide through the skies, and even fish for monsters.<br />\nGorgeous visuals and an amazing soundtrack bring the aerial world to<br />\nlife as players complete the more than 70 quests to gain the resources<br />\nneeded to upgrade and prepare their robot for the epic struggle to save<br />\nthe world from the evil about to be unleashed upon the land.</p>\n<p>Red Savarin, an eager and ambitious 17 year-old anthropomorphic dog,<br />\nventures through the mythical floating islands of the Shepherd Republic<br />\nwhere specialized robots are commonplace, living a carefree life<br />\ntraveling with his younger sister, Chocolat, and utilizing his<br />\npersonalized robot, Dahak, to complete various odd jobs for money. While<br />\non a routine retrieval mission, they have a chance encount...er with a<br />\nmysterious boy named Elh and find a medallion that inadvertently<br />\nentangles Red in something much more than he bargained for. Having taken<br />\nElh under his care, Red investigates the mystery surrounding the young<br />\nboy and the strange object as he takes on monsters, sky pirates and evil<br />\nrobots on his road to becoming the reluctant hero that must save the<br />\nworld from a swiftly awakening evil.</p>\n<p>Features</p>\n<p>・Gorgeous Visuals utilizing 3D, 2D and Fully Animated Cut-scenes<br />\n・Unique<br />\nRobot-Based Battle System<br />\n・Multiplayer Race through the Skies<br />\n・Tons<br />\nof Content Totaling over 20 Hours of Gameplay</p>", "metacritic": 76, "released": "2011-09-27", "tba": false, "updated": "2023-02-26T13:23:19", "background_image": "https://media.rawg.io/media/games/400/400dcdb6ddb75dc0722c7fc377e1404d.jpg", "website": "", "rating": 3.86, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 8, "beaten": 8, "toplay": 3, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 435, "game_series_count": 3, "reviews_count": 7, "platforms": ["Nintendo DS"], "developers": ["CyberConnect2 Co."], "genres": ["Action", "RPG"], "publishers": ["XSEED Games"], "esrb_rating": "Everyone 10+"}