{"id": 267869, "slug": "heavy-excavator-crane-simulator-2018", "name": "Heavy Excavator Crane Simulator 2018", "name_original": "Heavy Excavator Crane Simulator 2018", "description": "<p>In Heavy Excavator Crane Simulator 2018 game drive heavy excavator through city construction area and trucks loaded with construction material. Take experience of different construction machines driving like dump trucks, tower cranes and road rollers. This crane simulator game gives you real experience of driving construction machinery. Enjoy new city construction simulator and operate sand excavator crane with challenging and difficult construction missions. Variety of construction heavy machinery use at construction sites for construction material transport. Driving heavy excavator crane is not an easy task. Operate excavator crane to load sand, mud and heavy rocks. </p>\n<p>In this heavy excavator Crane Simulator game drive heavy duty trucks, tractors, road rollers and many more. Drive off road excavator driving challenge and park to the desired location. Construction machines and games give you real experience of bridge construction, building city and road construction. If you love to play excavator games then try this excavator simulation games experience. Use excavator and load huge truck with sand then transport sand to construction site like cargo transport. This heavy excavator 2018 game brings you to real excavator crane construction for new city construction.</p>\n<p>Heavy Excavator Crane Simulator 2018 Game Feature:<br/>* Stunning graphics and realistic construction site environment<br/>* Loading and unloading sand trucks with excavator crane<br/>* Efficient and smooth controls to drive construction excavator machine<br/>* Different challenging levels of city construction<br/>* Driving heavy machinery and construction vehicles</p>\n<p>Driving heavy duty vehicle is not very easy it needs special skills. This construction game challenge is about to load and unload sand trucks. Excavator operator has some construction working tasks to finish within given time. Use excavator digging to build new city and road construction. Also enjoy off road excavator driving like a car driving games.</p>", "metacritic": null, "released": "2018-11-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b27/b27e1cfcc5d5de6d75d625ad53a9a92a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}