{"id": 26781, "slug": "kirbys-return-to-dream-land", "name": "Kirby's Return to Dream Land", "name_original": "Kirby's Return to Dream Land", "description": "<p>Kirby™ and his friends are back in an adventure designed to satisfy<br />\nlongtime Kirby fans and beginners alike. When an alien spaceship crashes<br />\nin the otherwise peaceful realm of Planet Pop Star, its pieces are<br />\nscattered throughout the land. Players must guide Kirby as he retrieves<br />\nthe ship&#39;s parts and helps an alien return to its home planet. This<br />\ntime, however, he&#39;s not alone. At any time, up to three more players can<br />\njoin in the fun and play as Meta Knight, King Dedede, Waddle Dee or a<br />\ndifferent color Kirby.</p>\n<p>Features:</p>\n<p>Kirby’s powerful Copy Ability returns, allowing him to inhale, spit<br />\nand transform as he encounters enemies.</p>\n<p>Players can deploy classic and new abilities, including:</p>\n<ul>\n<li>\n<p>Sword: Kirby dons a green cap and wields a sword.</p>\n</li>\n<li>\n<p>Beam: Kirby wears a jester hat and can shoot energy from a magic wand.</p>\n</li>\n<li>\n<p>Whip: Kirby wears a cowboy hat and can lasso enemies.</p>\n</li>\n<li>\n<p>Leaf: Kirby is surrounded by a whirlwind of leaves.</p>\n</li>\n</ul>\n<p>The game also introduces new Super Abilities, which are activated when<br />\nKirby inhales special enemy characters. For example, the “Ultra Sword”<br />\nSuper Ability allows Kirby to swing a giant sword and wipe out an<br />\nentire screen’s worth of foes.</p>\n<p>Up to four players can enjoy the action together. (Additional<br />\ncontrollers required and sold separately.) While playing cooperatively<br />\nto progress through the game, player can join and leave the game at<br />\nany time.</p>", "metacritic": 77, "released": "2011-10-24", "tba": false, "updated": "2024-04-23T18:54:47", "background_image": "https://media.rawg.io/media/screenshots/2df/2dfe6134e8f622baac7bc169cc90eb1a.jpg", "website": "http://kirby.nintendo.com/returntodreamland/", "rating": 4.05, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 25, "beaten": 71, "toplay": 19, "dropped": 13, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 63, "suggestions_count": 387, "game_series_count": 20, "reviews_count": 66, "platforms": ["Wii"], "developers": ["HAL Laboratory"], "genres": ["Platformer"], "publishers": ["Nintendo"], "esrb_rating": "Everyone 10+"}