{"id": 267877, "slug": "virtuosi", "name": "Virtuosi!", "name_original": "Virtuosi!", "description": "Seja um virtuoso tocando músicas eruditas em seu violino!\r\n<p>Não são apenas guitarristas ou bateristas que ficam famosos no mundo dos jogos... Se você é uma pessoa que prefere mais orquestras e maestros, é hora de entrar de cara no mundo erudito e provar que você é <strong>virtuoso</strong> o suficiente para este desafio.<br/></p>\n<p><strong>Virtuosi!</strong> é um jogo musical onde você deve controlar seu violino para tocar clássicos da música erudita como Bach, Beethoven, Mozart, Tchaikovsky e Vivaldi. Inspirado por jogos como Frets on Fire e Guitar Hero, as cordas a serem tocadas descem pelo braço do instrumento e devem ser tocadas no tempo certo pelo arco. Acerte todas as notas para ganhar cinco estrelas douradas em<strong> uma apresentação Bravissima!</strong></p>\n<ul><li><strong>Toque clássicos</strong> de grandes compositores da música erudita!</li><li><strong>Ative o poder de Prestissimo</strong> e ganhe mais pontos!</li><li><strong>Acumule pontos</strong> e seja o melhor Spalla do mundo dos jogos!</li></ul>\n<p><em><strong>Virtuosi!</strong> foi feito em 2013, usando Pygame. Ele está disponível para Windows, em Português do Brasil, Inglês, Espanhol e Francês. Além disso, o código-fonte do jogo também está disponível (no GitHub).</em></p>\r\n\r\nComo jogar\r\n<ul><li>Use o <strong>mouse</strong> para selecionar quais cordas do violino estarão sendo tocadas. </li><li>Use os botões <strong>ASDF</strong> para pressionar as cordas e o <strong>botão esquerdo do mouse</strong> para tocar as cordas pressionadas.</li></ul>\n\r\n\r\nIn English\r\nBecome a virtuoso and play classical music on your violin!\r\n<p>It's not just guitarists or drummers who become famous in the gaming world... If you are a person who prefers orchestras and conductors, it's time to come face to face with the scholarly world and prove that you are <strong>virtuous</strong> enough for this challenge.<br/></p>\n<p><strong>Virtuosi!</strong> is a musical game where you play your violin to the sound of classics like Bach, Beethoven, Mozart, Tchaikovsky and Vivaldi. Inspired by games like Frets on Fire and Guitar Hero, the strings that make up the music slide down the arm of the instrument and have to be played with the bow at the right time. Hit all the notes to win five golden stars in <strong>a great presentation!</strong></p>\n<p><em><strong>Virtuosi!</strong> was made in 2013, using Pygame. It is available for Windows in Portuguese, English, Spanish and French.</em></p>\n<p><em>The source code is available on GitHub.</em></p>\r\n\r\nHow to play\r\n<ul><li>To play a song,<strong> slide the bow</strong> with the <strong>mouse</strong> to select the correct strings. </li><li>Hit the correct key on the <strong>keyboard</strong> when the note reaches the bow!</li></ul>\n<p><em> To change the language of the game from Portuguese, select a profile at the start screen (default is Helder) and use the arrow keys to move to \"Opcao\". Click on it and use the down arrow key to move to the \"Linguagem\" option. Then use the right arrow key to move through the different language options. When you've selected the desired language, click on the button \"Salvar\" and you're done!  </em><br/></p>\r\n\r\nCréditos (Credits) \r\n<ul><li><strong>Programação (Programming): </strong><ul><li>Helder Moraes</li><li>Ricardo Fuzeto</li><li>Marcelo Petrucelli</li></ul></li><li><strong>Arte (Art): </strong><ul><li>Ana Luiza Figueiro</li><li>Stefanie Fares Sabbag</li><li>Andressa B. Andrião</li><li>Juliana Crivelli</li><li>Laís Pessine do Carmo</li></ul></li></ul>", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e54/e54756506050fdd8fdbab0d630e1199d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fellowship of the Game", "gilzoide"], "genres": [], "publishers": [], "esrb_rating": null}