{"id": 267818, "slug": "new-construction-simulator-game-crane-sim-3d", "name": "New Construction Simulator Game: Crane Sim 3D", "name_original": "New Construction Simulator Game: Crane Sim 3D", "description": "<p><strong>New Construction Simulator Game: Crane Game Sim 3D</strong> is a new challenging heavy crane simulator game. Use different construction machines in this heavy construction crane simulator and become a heavy machines operator. Enjoy construction machines like real city building construction games skills to construct new city. Construction simulation games are very interesting heavy crane games for city construction. Drive different dumper trucks simulator, heavy crane operator, excavator crane simulator to complete the city building construction work. Crane game sim 3D is a drilling crane simulation game and building demolition game. This is one the best city construction games and building simulator game in all free construction games 2018.</p>\n<p><strong>Game Features </strong><br/>* New drilling and crushing equipment used in this crane game sim 3D<br/>* 10 ultimate adventurous city builder construction simulation games missions<br/>* Use mining machines to find water reservoirs beneath the earth in this heavy machine simulator<br/>* Driving and parking fun like city builder with heavy machines and truck simulator games<br/>* Realistic and stunning 3D graphics of new construction simulator game<br/>* Realistic construction site of this city construction game</p>\n<p>Use different construction machinery like heavy crane simulator, heavy excavator crane simulator and dumper trucks to do construction work for city builder simulation games. Crane games make your skills like a city builder with city construction games. Enjoy mountain drilling and building demolishing levels by heavy machines. Use heavy driller for tunnel drilling and mountain drilling with the heavy construction machines. This crane game sim 3D tests your operating heavy machinery skills like excavator driving simulator which is not an easy task. New construction simulator game is a real building city game in all city building games 2018. Rig the earth surface and find new water reservoirs with heavy drilling machines in this drill game.</p>\n<p>Construction city games are highly number of simulation games playing by construction games players. We put the realistic 3D graphics to enjoy the construction site of the city building game. Demolish the buildings in given time in this building demolition game. Operate different heavy construction machines like a truck driving simulator games 2018. Park your drill machine to the given point and crush the heavy rocks into pieces and find the minerals and water reservoirs beneath the earth. Drive dumper trucks, cement trucks and heavy trailers on off road construction site for transporting heavy machines.</p>", "metacritic": null, "released": "2018-11-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2c4/2c47b26026abc3684a75949a9d659c1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}