{"id": 267926, "slug": "katharsis-itch", "name": "Katharsis (itch)", "name_original": "Katharsis (itch)", "description": "WARNING! Katharsis Project is in Pre-Alpha phase! We count on your feedbacks to make the game better and continue its development.\r\n<p><em><strong>Catharsis (from Greek κάθαρσις katharsis meaning\"purification\" or \"cleansing\") is the purification and purgation of emotions—particularly pity and fear—through art and music or any extreme change in emotion that results in renewal and restoration. </strong></em></p>\r\nKatharsis is a sensible journey through the importance of expressing yourself and showing how music can have an important role to fill in people's lives. With characters that raise visibility to some of the most common psychological diseases and who portrays the diversity in our community, join this tender adventure that will prove you that your feelings matter and you should not be afraid to show them.\r\n\n<p>Four teenagers were living their lives normally in that morning: Yuki was playing cello in the park, as per usual. Bia was training drums with her brother's band in the garage. Tommy was playing classical music for his parents, very grudgingly. Johanna laughed, as if there was no problem in this world to put her mind into. For a matter of seconds, that morning didn't come to be like the usual ones. </p>\n<p>In a reality above of human aknowledgement, chaos flourished. Energies danced with one another, looking for a balance that was now lost - when everything repelled, with the blast of an explosion. </p>\n<p>Tiny shards of those energies solidified themselves and with the power and oddness of the impact, crossed their reality to collide with Yuki, Bia, Tommy and Johanna, allured by their moments of pure fragility. In the blink of an eye, the ambience around them was unfamiliar. Instruments in hands, these four humans with their music became the last hope of both worlds.</p>\n\r\nFeatures:\r\n<ul><li>The game counts only with the first tutorial level that takes 10-15' to complete, if you're acquainted to puzzle games! </li><li>We're presenting 2 out of our beautifully made 4 characters that represent and include some minorities:<ul><li>Johanna, a nordic girl who suffers from TDAH. </li><li>Tommy, who suffers Neurosis and OCT.</li></ul></li><li>4 simple puzzles to challenge your mind through the tutorial. </li><li>A glimpse of our story and worldbuilding specially made for Katharsis. </li><li>All original music to carry your emotions through the gameplay.</li></ul>\r\nKnown Issues:\r\n<ul><li>We have some camera issues. Hope it doesn't compromise your gameplay!</li><li>Jumping could get tricky! If you're having trouble with platforms, try taking some distance before jumping. </li><li>We don't support widescreen resolution as per now, so if your monitor is one of those, you might experience some problems with the interface. </li><li>The configurations menu is kind of incomplete, we're working on more options to make your gameplay better.</li></ul>\r\n In Development:\r\n<ul><li>Huge upgrade on our musical board at the end of the level!</li><li>Mysterious item to be found;</li><li>Final piece of the level narrative;</li><li>Better options menu;</li><li>Improvements in the Songs and UI sound effects!</li><li>Portuguese localization!</li><li>Fixes to lots of bugs;</li><li>Cutscenes to better portray our characters backgrounds;</li></ul>\n<p><em>...And coming soon:</em> all new levels and two more characters for you to unravel the story! Yuki, an asian transexual boy who is fighting depression and Bia, a brazillian black girl that suffers from anxiety.</p>\n<p>Hope you enjoy it,</p>\n<p>The Crew.</p>\n<p><em>Katharsis © is an Academic Project for PUC-SP delivered to you by Izadora Lima, Luciano del Bianco and Gabriel Barbosa. </em></p>", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/203/203e74dffec95f4a69b998fa78216161.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["The Crew"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}