{"id": 267975, "slug": "the-witch-in-training-and-the-magic-seal", "name": "The Witch-in-Training and the Magic Seal", "name_original": "The Witch-in-Training and the Magic Seal", "description": "<p>The world that witch-in-training Ena lives in hates and fears magic-users like her, but she still wants to do her best to help people and live up to the legacy of her father--a hero who helped to seal away the Monster King, humanity's ancient nightmare. She lives in seclusion with her wisecracking familiar Crow, making medicines for the nearby villages.</p>\n<p>But one day Ena's daily toil is interrupted when a book in her storeroom suddenly starts to glow. Investigating it, she and Crow are accidentally sucked into a phantasmagorical world that exists inside a magic seal, where they meet an amnesiac boy with troubling origins. The three band together in an uneasy alliance in order to escape, but just what's REALLY going on here?</p>\n<p> <br/></p>\n<p>The Witch-in-Training and the Magic Seal is an adventure puzzle game. Completing the game once will take about three hours, and getting all endings can take up to six. Utilize your party members' unique strengths to overcome action puzzles, and explore mysterious environments to solve more traditional riddles. Walkthrough files are included in the game folder in case you get stuck anywhere.</p>\n<p><strong>This game includes some violent text-based imagery as well as sexual references and pervasive elements of systemic discrimination, and is best suited for ages 15 and up.</strong><br/></p>\n<p>The Witch-in-Training and the Magic Seal development staff are:</p>\n<p><strong>Manato Mana:</strong> Story, programming<br/><strong>Yuzuri Hatsuka:</strong> Character design<br/><strong>Feral Phoenix:</strong> Illustration, English translation</p>\n<p>The Japanese-language version of this game can be found here on Freem.<br/></p>", "metacritic": null, "released": "2018-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2fc/2fc4b620ee9306edc21aba11e9a89e3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["feralphoenix"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}