{"id": 267905, "slug": "gentlemen-of-fortune-maelstrom", "name": "Gentlemen of Fortune: Maelstrom", "name_original": "Gentlemen of Fortune: Maelstrom", "description": "<p>Welcome me Hearties to Gentlemen of Fortune: Maelstrom<br/></p>\n<p>This download offers three sets of executables:  DirectX 8 - 32 bit, DirectX9 - 32 bit, DirectX9 - 64 bit.  By themselves, they provide nothing to play, but each of the versions can play the following, freely available mods and derivatives:</p>\n<p>Buccaneers of the Caribe (based on Pirates of the Caribbean)<br/>New Horizons (from Pirates Ahoy! community)<br/>Caribe Stories (based on Caribbean Tales)<br/>Caribe Stories Historical Immersion (based on Caribbean Tales)<br/>Lost Ships City (based on City of Abandoned Ships)<br/>Gentlemen of Fortune 1.2<br/>Gentlemen of Fortune 2.0<br/>Gentlemen of Fortune 2.5<br/>Historical ERAS II<br/></p>\n<p>Anyone who has played the above games, knows the frustration with the originals; rife with game-breaking bugs and frequent crashes.</p>\n<p>No more!  We have overhauled the code, eliminating the vast memory leaks and crash-inducing bugs.  In addition, we have improved the performance, and also upgraded from the original DirectX 8 (despite the claim on the COAS box, any process explorer showed the game was never actually running DirectX 9).  Also now provide a 64 bit, for systems using that architecture (though even without, all the same fixes were applied to our DX8 and 32 bit versions, so older systems can still benefit).</p>\n<p>Some other improvements are the swapping out of Windows memory allocation routines, in favor of a famous, more efficient method that increases allocation speed, improves efficiency and reduces fragmentation.  FMOD, for sound, is updated to the most current and the engine implementation of it completely rewritten for new features.  Fixed fullscreen task-switching bug that crashed game, to actually allow fullscreen and task/window switching in/out of game without a problem.  Deprecated DDRAW for video has been removed and updated with something newer.  Save-file compression routine updated (still compatible for old saves, only in GOF, COAS and ERAS 2).  Corrected multi-threading of sea calc routines.  Changed to asynch system/trace logging.  Now with built in options to control video adapter selection, VSynch, Triple Buffering, and Antialiasing.  Various features were added to support further mod capabilities, notably seen in ERAS II, and things like improved ship AI within the engine itself.  These are just a few of the long list of improvements/fixes developed over the last couple years that have been most graciously beta-tested by some forum members over at https://buccaneersreef.com.</p>\n<p>Original Base Game: AGE OF PIRATES 2 – City of Abandoned Ships; \r\nLicensing sold and owned by other third party(s). Original Source Code \r\n(freeware) which ran in DirectX 8 was given away freely eight years ago \r\nand completely rebuilt and overhauled by the Buccaneer's Reef Team. This\r\n is completely new source code which is now capable of running all the older games based on POTC (Storm 2.0) and Caribbean Tales (Storm 2.5), plus the newer based on City of Abandoned Ships (Storm 2.8), but now in DirectX 9 and 64 bit, if desired, to which all \r\nrights are reserved by the Buccaneer's Reef Team and official legal \r\nlicensing pending.</p>\n\n\n<br/>\n<p><strong>Minimum System Requirements:</strong></p>\n<ul><li>CPU SPEED: 1.75 GHz</li><li>RAM: 1 GB</li><li>OS: Windows XP</li><li>FREE DISK SPACE: 180 MB</li></ul>", "metacritic": null, "released": "2018-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9dd/9dd3e4e84e8468e399174e60ac484936.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChezJfrey"], "genres": ["Adventure", "Fighting"], "publishers": [], "esrb_rating": null}