{"id": 267949, "slug": "zarsthor-asteroid-space-shooter", "name": "Zarsthor - Asteroid Space Shooter", "name_original": "Zarsthor - Asteroid Space Shooter", "description": "<p>Space invaders are terrorizing universe, can you become hero and save it? UFO, Aliens need your help, whole galaxy need it. This free game is Retro Arcade endless fun, various gameplay levels, various bosses, enemy, over 7 spaceships to unlock, shop with upgrades and a lot more, expect it, there is original story.🔥 </p>\n<p>Imagine you got a normal life, one day you want to change it, you are going in universe adventure, why would you do it? What can happen during that travel? Over time game will bring your answers to those questions, in-game hero made decision, to change his life, but why? Checkout original story. An arcade-machine in your pocket. Tap to test your reflex.</p>\n<p>✔ Various gameplay levels (don't shoot to astronauts, collect something, protect, destroy meteor, and a lot more, 40+ levels) and various bosses to defeat .<br/>✔ Open world map (with side and main missions), you decide which one you will take.<br/>✔ Upgrade your spaceship + unlock new ships, each one look different + got other stats (Over 7 ships to unlock).<br/>✔ Hardcore gameplay, this game is hard, it's true arcade, each second can change your life and make your ship piece of parts (there is also easy mode). Imagine tons of glow asteroids, it's just a start.<br/>✔ Discover original galactica story in a strange universe. Discover Space Frontier<br/>✔ No IAP<br/>✔ And a lot more :-}</p>\n<p>Addicting Ship Game Made in 2018. Game for boys, for girls. This app is Free to download This is offline, not online game. Best time waster. Download me😛</p>\n<p>Twitter:<br/>https://twitter.com/DonislawDev</p>\n<p>Facebook:<br/>https://www.facebook.com/DonislawDev-432377923770925/</p>\n<p>Wish to help with translate game to other languages?<br/>Contact me at: donislawdev@gmail.com</p>\n<p>Special Thanks to Adam Rucki (Shephard) for making most SFX in this game<br/>Special Thanks to Marek Majewski.<br/>Special Thanks to www.gamedeveloperstudio.com</p>", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b96/b961c078fdd4a783670f52d48ad035d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DonislawDev"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}