{"id": 267936, "slug": "sector-riot", "name": "Sector Riot", "name_original": "Sector Riot", "description": "<p>When invaders set foot in the world of the mighty bird of prey, he summoned the sandstorm and began his hunt!</p>\n<p>Hostile fleets will jump in at the border of the sandstorm. Shoot them down to claim your territory. Over time, bigger fleets will appear. Keep up the fight as long as possible!</p>\n<p>Destroying enemy ships releases their accumulated hyperspace energy from which the bird of prey feeds. Collect the energy shards to amplify his powers.  But since the hunter is always hungry, the collected energy decays over time, so hunt till the end!</p>\n\n\r\nDevelopment commentary\r\n<p>This is a game prototype made in the Unity Engine. While being traditional in gameplay, it aims to deliver fast action and a feeling of speed and force.</p>\n<p>Plans and features for further development are:<br/></p>\n<ul><li>Different player weapons that can be dropped by enemies</li></ul>\n<ul><li>More types of enemy ships taking on different roles</li></ul>\n<ul><li>Bigger enemies up to battleships that must be put down piece by piece by destroying modules such as gun batteries and shield generators</li></ul>\n<ul><li>A meta level system that acts mainly as a tutorial by introducing new game mechanics to the player each level gained. It also encourages to collect as many shards as possible as they serve as experience points</li></ul>\n<ul><li>Communication and expansion of the narrative setting. The idea is to combine spiritual mythical elements with science fiction. While the bird of prey is to receive an Arabic touch, the invaders and their naming will be oriented on the Old Roman Empire and its army structures.</li></ul>\n<ul><li>Sounds! While real space is silent, the absence of ear shaking explosions is boring. Luckily, this is a video game and no real space!</li></ul>", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6af/6afb5d91801dcd545c24ddd3cde1d8b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Staros"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}