{"id": 268078, "slug": "evidence-of-life-v11", "name": "EVIDENCE OF LIFE v1.1", "name_original": "EVIDENCE OF LIFE v1.1", "description": "** Version 1.1 Available Now **\r\nA Procedural Planet Exploration, Alien Fighting, Mining, Gem Collecting, DNA Collecting Pixel Art Space Adventure.\r\nWill you be able to collect all DNA types?\r\n<p>Welcome and Thank You for Being Here!<br/>We are excited to make Evidence of Life available to play.</p>\r\nOVERVIEW:\r\n<p>You are a Space Traveler who has landed on a distant planet to search out DNA.  Find DNA by exploring a vast 2D side-scrolling planet full of Plants, Rocks, Aliens and Alien Hives.</p>\n<p>You can mine using your mining tool.  Underground you will find precious Gems that will increase your player's abilities.  You will also find hostile Mites living within some dirt and rocks.</p>\n<p>You will happen upon Alien Hives that, if close enough, will release different types of Alien life that do not like you destroying their planet.  They will attack you.  And they will kill you.  Dying makes you start at your ship again and you restart with half of your Health &amp; Power.  You also lose all collected bombs if you die.</p>\n<p>This planet has a gaseous cloud that will deplete your Power if you stay in it.  Keep a low elevation to avoid this.</p>\n<p>Once you have collected all the required DNA types you are free to leave the planet by accessing your ship's menu.  You then go to a new planet to search for more DNA.  The game is Endless.</p>\n<p>We hope you enjoy the Awesome and Dangerous world of Evidence of Life.</p>\r\nCONTROLS:\r\n<p>A=Move Left<br/>D=Move Right<br/>W/S=JetPack Up/Down<br/>Left Mouse=Shoot<br/>Right Mouse=Mine<br/>Shift=Bomb<br/>Space=Sonic Boom<br/>R=Return to Ship<br/>F=Drop Flag<br/>T=Return to Flag<br/>Q=Ship Menu<br/>E=Player Menu<br/>F9=Save Game<br/>ESC=Stats<br/>M=Music Toggle On/Off</p>\r\nHEALTH LEVEL:\r\n<p>Your Player has a Health Level.  If your Health depletes, you Die.  Simple Right?  You can find Health Containers around the world to replenish health or some plants and rocks contain Dust that will slightly raise your health.  Health does not regenerate on its own until you have unlocked the perk.</p>\r\nPOWER LEVEL:\r\n<p>Your player has a Power Level (Bottom Left Corner of Screen).  Power is decreased by several things.  Shooting your Gun has a small effect on you Power Level.  Using your JetPack lowers your Power Level quickly as well as using your Mining tool.  If your Power Level completely drops you will need to wait for your solar charger to kick in.  It takes a few moments to kick on and increase your Power Level.  Due to fantastic technology you can even recharge underground.  Don't get left in a battle with no Power.  It will mean a certain and unwanted Death! (Hint: Some plants and rocks contain Dust that will recharge some Power)</p>\r\nJETPACK: \r\n<p>(Press \"W\" or \"S\")<br/>You have a JetPack which allows you to fly around with ease.  Using your JetPack uses a significant amount of Power.  Your JetPack will not work without Power.</p>\r\nGUN:\r\n<p>(Press \"Left Mouse\")<br/>Your Gun fires automatically if you hold down the trigger (Left Mouse).  It fires at the Mouse Target.  It uses a small amount of Power to fire.  Collecting (10) Green Gems will increase your Gun's firing speed.  Collecting (10) Yellow Gems will increase your Gun's damage. Higher levels can add additional bullets.  Certain perks can be unlocked to add additional bullets.  (Hint: It is recommended to increase your Gun's level before venturing too far from your ship) </p>\r\nMINING TOOL:\r\n<p> (Press \"Right Mouse\")<br/>You have a mining tool that is used to dig down into the ground.  It uses the Mouse Target for aiming as well.  It uses a significant amount of Power.  The mining tool is also used to destroy Alien Eggs which cannot be destroyed with any other weapon.  Collect (10) Blue Gems to increase your Mining tool level.  Each level increases both the speed in which you can mine, it also increases the distance the tool can reach.  Higher levels can mine many blocks away.</p>\r\nBOMBS:\r\n<p> (Press \"Shift\")<br/>Bombs are Bombs.  You throw them.  They go Boom!  They Kill things.  You need to acquire bombs from Chests.  You can carry a maximum of (5) Bombs at a time.  They are thrown towards the Mouse Target.  Collecting (10) Red Gems will increase your Bomb Damage as well as slightly increase the time in between throwing Bombs. Bombs destroy plants, rocks and the ground.  (Hint: Throwing Bombs Underground can be very dangerous as one wrong throw and Boom! You Are Dead!)</p>\r\nSONIC BOOM:\r\n<p> (Press \"Space\")<br/>Your suit has the ability to send out a Sonic Boom and do damage to surrounding enemies.  Using this requires 35% of your Power so use it wisely.  It also causes a small amount of player damage (You Are inside a Sonic Boom).  Collecting (10) Red Gems also increases your Sonic Boom Damage.  Sonic Boom destroy plants, rocks and the ground.  (Hint: AKA the Hive Crusher!)</p>\r\nADDITIONAL INFORMATION:\r\n-- Ship:\r\n<p> Your ship will stay where it is.  If you die you will return to your ship.  If you are close to your ship you can press \"Q\" to access the ship.  Here you can see what DNA types you have collected and which types you still need to collect.  You can also change the color of your spacesuit at your ship.</p>\r\n-- Gems:\r\n<p>Collecting Gems Increases Player Levels to help with Combat and Mining.  To view you player's levels, press the \"E\" key.</p>\r\n-- Dust:\r\n<p>Dust is collected from most foliage and rocks.  Different colors of Dust increase Health and Power.</p>\r\n-- Chests:\r\n<p>Chest are found Randomly around the Planet and are a great source for Health and Batteries.  They are also the only way to Obtain Bombs.  They must be mined to open.</p>\r\n-- Batteries:\r\n<p>Batteries completely fill your Power Level.  They can be found in all Chests if your Power Level is slightly low. </p>\r\n-- Health Container:\r\n<p> Health Containers will fill up 20% of your Health Level.  They will also be dropped by Aliens when they die if your health is very low.<br/></p>\r\n-- Foliage:\r\n<p>Foliage and Rocks are everywhere on the Planet Surface.  If you destroy just the foliage, then the foliage will grow back.  Foliage and rocks drop different Dust that increase your Health and Power.</p>\r\n-- Gaseous Cloud:\r\n<p>The planets atmosphere is covered in a gaseous cloud.  This cloud will rapidly deplete your Power Level if you fly too high.</p>\r\n-- Cyber-Pup:\r\n<p>You have a side-kick little robot dog.  Cyber-Pup stays close to your ship and if you are nearby, Cyber-Pup will drop little gifts for you.</p>\r\n-- Auto-Save:\r\n<p>The game has an auto-save feature that will auto-save every 2 mins.  If you want to save manually just press the \"F9\" key.</p>\r\n-- Fast Travel:\r\n<p>You can return to your Ship at anytime by pressing the \"R\" key.  You can place a Flag on the ground by Pressing the \"F\" key.  Return to this Flag at any time by pressing the \"T\" Key.</p>\r\nALIEN INFORMATION:\r\n-- Mites:\r\n<p>Mites live in Dirt, Rock and Dense Rock.  If you break the right block you will be face to face with a Mite.  The deeper you go the harder the mites get.  Dense Rock Mites are very difficult and throw large blades at you.  Digging has a consequence, and that is Mites!</p>\r\n-- Eggs:\r\n<p>Aliens grow in eggs (Duh!).  You can find these eggs in various places and if you get close enough they will unleash aliens on you.  They are made of a tough material so they cannot be destroyed with a gun.  You must use your mining tool on eggs to destroy them.</p>\r\n-- Face-Eaters:\r\n<p>These little things will attach to your face and such the life out of you.  They are everywhere.  You might not like them soon.  You definitely won't like them soon!  They will attack you underground.</p>\r\n-- Mega Face-Eaters:\r\n<p>An adult version of the smaller face-eater.  They are harder to kill and are protectors of the Giant Aliens.</p>\r\n-- Ghouls:\r\n<p>These little Aliens walk around aimlessly and throw blades at you.  If you run into them or kill them they explode. Watch out!</p>\r\n-- Ghoul Birds:\r\n<p>Flying above your head and raining Goo-Balls down on you is what they do best.</p>\r\n-- Jumping Ghouls:\r\n<p> Bouncing on their tail these Aliens jump around and crazily throw blades at you.  Get to many of them around and you won’t last long.</p>\r\n-- The Brain:\r\n<p>This glob of Brain Material floats in the air without a care.  It will then give birth to many little Brains that will seek you out wherever you are.  The little Brains will attack you underground.</p>\r\n-- Alien Hives:\r\n<p>Alien Hives are found around the planet at the surface and they go underground to the Hive Core.  Destroy the Core. Destroy the Hive.  Sounds easy, but if close enough to the hive you will be attacked by Aliens.  The Hive Core is quite difficult to destroy, yet you are rewarded with Gems, Health and Batteries.</p>\r\n-- Giant Alien:\r\n<p>This is an Alien.  It is Giant.  You must first find it, then kill it.  It will not be easy.</p>\r\nCREDITS:\r\n<p>Art and Concept by @AlWirehead<br/>Programming, Sound and Concept by @JustWallGames</p>\n<p>Additional Testers:</p>\n<p>@HighestElite<br/>@skeletonware<br/>@projectmagisi<br/>@PixelShorts<br/>@OddSocksDev<br/>@stuv1k<br/>@NotTheToolMan</p>\n\r\nMUSIC:\r\n\r\nNOTE FROM JUSTWALL:\r\n<p>Hello and Good Day.......<br/>Here we are - once again - with a cool little game to share with the world.  This time I teamed up on my first collaborative attempt at a Pixel Art Game.  It was so fun to work with another like-minded Game Developer.  It truly was a RAD experience in which I will do again.  If you are looking to collaborate my advice is to sit in your office, create games and network.  You will find someone who you mesh with that you can create cool games with.  I just can't say enough about how much fun this project has been.  All the long hours have been worth it.  I hope you enjoy playing this game as much as we enjoyed creating it!<br/></p>\n<p>Life is Short = Be Creative</p>", "metacritic": null, "released": "2018-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f23/f2376649489ac4894fb9d3d31f03f36f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JustWall"], "genres": ["Action"], "publishers": [], "esrb_rating": null}