{"id": 268173, "slug": "the-diplomat", "name": "The Diplomat", "name_original": "The Diplomat", "description": "<p>Angristan and Vulgaria have been engaged in Cold War for the past decade. The UN has entrusted you as the negotiator to resolve the conflict within 15 days.</p>\n<p>There are 4 stats in the game that are affected with the choices you make.</p>\n<p>Basic :</p>\n<ul><li>Economy</li><li>Science</li><li>Resources</li></ul>\n<p>Special :</p>\n<ul><li>Public Morale</li></ul>\n<p>Everyday you will be presented with an issue that you have to resolve. The issues are about nations requesting or ordering for something from the UN Diplomat. You have to make a choice about what you should do based on the stats.</p>\n<p>After you resolve an issue, you get a choice to either Play Special Policies (you chose at the start of the game) or move to the next day. The special policies give you some addition powers.</p>\n<p>Every 3 days, there will be some random event which will cause the stats to change, you have to account for that.</p>\n\n<p>GOAL OF THE GAME :</p>\n<p>Whenever a BASIC stat of both the nation are in the green zone at the same time, the nations sign the treaty for it and that stat is removed from the level.</p>\n<p>To achieve peace between the nations, you have to make them sign 2 treaties.</p>\n\n<p>LOSE CONDITIONS :</p>\n<ul><li>When the days assigned to you, run out.</li><li>When the public morale of any nation goes to 0, there is a Civil War in that nation.</li><li>Whenever a nation's 2 BASIC stats are in the green zone and the other's no stat is in the green zone. The first nation becomes very powerful and attacks the 2nd nation.</li><li>Whenever a nation's 2 BASIC stats are in the red zone and the other's no stat is in the red zone. The first nation becomes very weak and then 2nd nation attacks.</li></ul>\n\n\n<p>DISCLAIMER : The game is not balanced and is buggy (Human resources exhausted in 48 hous :P)</p>\n<p>Game created for BYOG 2018 covering Politics and Armistice as themes.</p>\n\n<p>Made by,<br/></p>\n<p>Atash Qasim</p>\n<p>Vishakh Mohan</p>\n<p>Akshay Goel</p>", "metacritic": null, "released": "2018-11-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f7c/f7c956680062bbb303b354710aca7c94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["akshaygoel"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}