{"id": 268188, "slug": "agenda-itch", "name": "Agenda (itch)", "name_original": "Agenda (itch)", "description": "<p><strong>Agenda</strong> is a simple, casual fund management game, where you manage the funds available to a fictional political party to win over constituencies from opposition parties. </p>\n<p>The game draws on the suggested themes <em><strong>\"Mundane\" and \"Politics\"</strong><strong>, </strong><strong>designed around the seemingly mundane activity of managing expenses, but with a political twist that the player has to manage expenses to win over Political Constituencies represented by  grid of tiles.</strong></em><br/></p>\n\n\n\n<p>The game is meant to be simple to play,  yet offers some amount of challenge in that players need to crunch some numbers in order to win. The visuals are aimed to be  neutral and aesthetic, trying to  clearly convey the important bits of information to the Player. Every new game session is randomly generated, and no two sessions will be exactly the same. The game employs <strong>simple, intuitive point and click input</strong>, in order to be easy to pick up.  Just don't make any rash actions, think ahead and the game will be a breeze to win!<br/></p>\n\n\n<p>This game was entirely conceptualized, designed, programmed and artwork was created over the course of the allocated 48 hours by Aniruddha Hardikar, a solo developer, for the BYOG competition at IGDC 2018.  Made with Unity and Blender, the game runs on Windows for now, while versions for mobile platforms are planned.<br/> <br/></p>", "metacritic": null, "released": "2018-11-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dd2/dd24d73129d83a9113a870c8ad45d64b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aniruddhahar"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}