{"id": 268232, "slug": "flatland-vr", "name": "Flatland VR", "name_original": "Flatland VR", "description": "<p>This game is in honor of the book Flatland: A Romance of Many\r\nDimensions by Edwin A. Abbott, a classic 19th century novel that\r\nsatirizes the social hierarchy of Victorian society using\r\nanthropomorphized geometry.</p>\n<p>In the book, geometric shapes are conscious, and each angle\r\nrepresents an additional perspective they can take on things, i.e.\r\nintelligence. Pointy triangles are the lowest, serving as police or\r\nhenchmen. Circles have a near infinite number of edges and are the\r\nmost intelligent. However, they aren't more moral, and secretly\r\ndecided to hide all awareness of the 3rd dimension so they can\r\nmaintain their superiority.</p>\n<p>This game begins after you, a 2D hexagon named Hex, have\r\nexperienced the third dimension, spoke of it, and are now in prison\r\nfor heresy. The VR player, or higher dimensional life-form, has just\r\nset you free. Alarms went off and triangle henchmen are about to\r\nflood in. You can't just run away - you want to gather evidence\r\nfirst, then make it out safely. In the middle vault lies fractal\r\nevidence of the 3rd dimension. Grab it and run for your\r\nlife!</p>\n<p>This is a two-player game in which one player controls Hex and\r\nmust navigate the prison and avoid the triangular guards. Hex cannot\r\nattack or defend.</p>\n<p>The other player is in Virtual Reality, seeing the board from\r\nabove, and can move 3D objects to intersect Hex's 2D world. If the\r\nguards touch one of these other-worldly objects, they are knocked off\r\ninto the 3D realm. You'd think they would thank you – but no, they\r\ntake solid form and will attack the VR player!</p>\n<p>The VR player can attack the 3D enemies by hitting them hard from\r\nabove, flattening them back into 2D form. But beware, you may be\r\nmaking life harder on Hex by killing too fast!</p>\n<p>The two must work together to ensure that Hex finds the evidence\r\nand escapes the maze unharmed.</p>\n<p>The game requires the use of an Oculus, HTC Vive or Windows MR\r\nheadset with motion controllers.</p>\n<p>Created for the VR Austin Game Jam 2018.</p>\n<p>Contributions:</p>\n<p>Paul Gasca - Level Designer and Programmer <br/>Jason Kute - Music and SFX <br/>Alex McChesney - Lead Programmer and Shader Magician <br/>Roberto Pena - Programmer, AI Pathfinding and UI <br/>Stephanie Traska - Team Lead, Game Designer, 3D Modeling and Texturing, 2D Artist\r\nAdam Schultz (cameo) - 3D Animation and Rigging<br/>Some music, 2D tiles, and fractal rendering from outside sources.</p>", "metacritic": null, "released": "2018-11-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b4b/b4bc83e12d0de0ff021598efd837ebbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VideogameScrapbook"], "genres": [], "publishers": [], "esrb_rating": null}