{"id": 268342, "slug": "slightly-heroes", "name": "Slightly Heroes", "name_original": "Slightly Heroes", "description": "SUIT UP - Step into the role of your imaginary, half-baked superhero in this FREE MOVEMENT multiplayer VR shooter. Slightly Heroes is the newest game from the makers of Merry Snowballs.<br/><br/>BATTLE SOLO OR VERSUS FRIENDS<br/>Experience real-time battles against players from all over the world or invite your friends to join a custom match and battle them across a variety of arenas. You can also challenge AI Heroes in order to train an improve your skills.<br/><br/>POWER-UPS<br/>Discover fun power-ups and special weapons that add a creative twist to your attacks and that constantly change the rules of the battles.<br/><br/>COLLECT HEROES AND WEAPONS<br/>Unlock a variety of charming characters and weapons with different attributes and play styles.<br/><br/>BECOME THE STAR PLAYER<br/>Climb the global leaderboard to prove you’re the best imaginary Hero!<br/><br/>PLEASE NOTE! Slightly Heroes is a premium game, however the game includes DLC that can be purchased for real money.<br/><br/>Features:<br/>- Free movement multiplayer action!<br/>- Experience real-time 1v1 battles against players from all over the world.<br/>- Unlock new, powerful Heroes and weapons that fits your playstyle!<br/>- Battle solo or against friends.<br/>- Climb to the top of the leaderboard in global rankings", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:56", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1cabda826683ca2c0a6fe415906395c.jpg", "website": "http://www.slightlyheroes.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hatrabbit Entertainment"], "genres": ["Action", "Casual"], "publishers": ["Hatrabbit Entertainment"], "esrb_rating": null}