{"id": 268380, "slug": "big-dipper", "name": "Big Dipper", "name_original": "Big Dipper", "description": "<p>A miracle beyond the polar circle. They say it&#39;s hard to find a place to call your own, but what if such a place was not uniquely yours? What if both of you were not willing to give it up? Big Dipper is a kinetic visual novel, available in both English and Russian, which tells a romantic story of the unusual circumstances that brought two lovers together one fateful New Year&#39;s Eve.<br />\nCast<br />\nAndrew<br />\nFamily troubles forced Andrew to leave his childhood home and step into an an early adulthood. Cast out on his own by a cruel twist of fate, he was led far north, where he was saved from the cold by an elderly furniture maker. Andrew studied the old man’s craft, and worked hard independently for years to come. Soon enough, he was finally able to afford his own house. If there was one lesson he had learned throughout his life, it was that living without a home was not truly living at all.<br />\nJulia<br />\nJulia’s childhood was mostly spent at her grandfather&#39;s home. Her parents would go on year long business trips, during which she grew up falling asleep near the fireplace, lulled to sleep by the roaring winds and the sounds of grandpa&#39;s instruments. When she turned twelve, her family moved to a place thousands of miles away, but she always knew when the time came again, she would one day come back to her old home.<br />\nFeatures<br />\nAn estimated 2-4 hours in length<br />\nAvailable in both English &amp; Russian<br />\n10+ CGs<br />\nBeautiful, Distinct High Resolution HD Artwork<br />\nA wonderful story detailing love, fate, and the decisions that guide us through life</p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2023-03-24T13:43:55", "background_image": "https://media.rawg.io/media/screenshots/eb5/eb581e95a730807feca8b155262f4d40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 8, "beaten": 3}, "playtime": 0, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "macOS", "PC", "Nintendo Switch", "PlayStation 4", "PS Vita"], "developers": ["Team Zimno"], "genres": ["Simulation", "Indie"], "publishers": ["Top Hat Studios"], "esrb_rating": null}