{"id": 268315, "slug": "an-adventurers-tale", "name": "An Adventurer's Tale", "name_original": "An Adventurer's Tale", "description": "After leaving his home in the capital city in the Kingdom of Gronia, our hero Garth wanders along the countryside seeking fame, glory, and his next misadventure. He finds himself amid various escapades, some as mild and comedic as fleeing the City Guard after a wild night with the Lord's Daughter, and some as serious as bouts with monstrous, lurking horrors. Then, in the small, outlying region of Garasia, he finds something that finally could satisfy his thirst for adventure, recognition, and beautiful women: A Lich King! Born once a millennia, these powerful beings are feared by all things living…and dead. Their mysterious allure attracts all into their bind. Gearing up to take such a threat down, Garth realizes something darker may be lurking around the corner when he confronts the current Lich King, Grisette, a woman he had thought constantly since that fateful day many years ago…<br/><br/><br/><br/><ul><li> An estimated 10-15+ hours of gameplay, with tons of replayable content<br/></li><li> A fun and unique JRPG-style battle system, modified for quick, addicting battles<br/></li><li> A large open world, with tons of secrets to explore, quests to take, and lots of fun characters to meet<br/></li><li> Visual Novel Style Interactions, with lots of choices and branches<br/></li><li> A unique mix of interactive RPG and Visual Novel gameplay<br/></li><li> Lots of flashy effects for extra polish<br/></li><li> An infinite, procedurally generated questing mode available in New Game+<br/></li><li> All Ages &amp; 18+ Versions</li></ul><br/><br/><br/><br/><br/><br/><br/><br/><strong>....and many, many more!</strong>", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2024-02-24T11:17:15", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cff1be3afd39c981ce86df083f17ce9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "dropped": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Top Hat Studios", "Epic Works"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Top Hat Studios"], "esrb_rating": null}