{"id": 268368, "slug": "king-erik", "name": "King Erik", "name_original": "King Erik", "description": "You play as King Erik, a young man who has acquired the Scepter of Might and will use it to single-handedly destroy his Uncle Lukion Duke of Warchester.  Fight your way through tricky passages and deadly contraptions to regain your kingdom from the clutches of your Uncles Saxon armies!<br/>\n<br/>\r\nThe Realm of King Erik I<br/>\r\nSomewhere in Europe<br/>\r\nAt the age of 16, Erik inhertited the throne from his father, King Erold of Eromott.<br/>\n<br/>\r\nKing Erold's brother, Duke Lukion of Warchester, was outraged that his nephew, a boy, would become King over that of himself.<br/>\n<br/>\r\nThe Duke insisted that if he did not become King, then he shall at least become Regent until Erik came to the age of 18.  But the ad hoc regent council refused and Erik was made King of Eromott regardless of his young age.<br/>\n<br/>\r\nThe Duke, in a fury, mustered an army of 10,000 men, consiting mostly of Saxons, then set forth to take the kingdom by force.<br/>\n<br/>\r\nTwo years later, Duke Lukion had conquered most of Eromott and vanquished most of King Erik's armies.  Victory was surely in the Dukes hands.<br/>\n<br/>\r\nOne night, a mysterious old man appeared before Erik in his chambers and bestowed upon him a beautiful golden scepter crowned with the largest ruby he'd ever seen.  The man claimed that the sceptor had mystical powers as it was imbued with the souls of his ancestors... Erik's royal line.  The old man added, that the sceptor could only be used at night.<br/>\n<br/>\r\nWith this mighty weapon in hand, King Erik set forth to vanquish his uncles armies and restore peace to the kingdom once and for all.<br/>\n<br/>\r\nBy himself.", "metacritic": null, "released": "2018-09-07", "tba": false, "updated": "2020-03-20T13:53:48", "background_image": "https://media.rawg.io/media/screenshots/08f/08f45cae18c8bf72f52417aac27f89a8.jpg", "website": "http://www.battlecrafters.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web", "macOS"], "developers": ["ZerkyWerky", "Battle Crafters"], "genres": ["Action", "Adventure", "RPG", "Indie", "Platformer"], "publishers": ["Battle Crafters"], "esrb_rating": null}