{"id": 268381, "slug": "starblazer", "name": "Starblazer", "name_original": "Starblazer", "description": "Starblazer is designed to be a virtual space arena, where players can engage in strategic aerial battles. It captures the strategic advantage of virtual reality better than any competitive game before, taking advantage of real-time virtual space to manipulate and engage your fleets.<br/>\n<br/>\r\nIn Fleet Builder, a player can design their fleet, building in custom configurations and set-ups for the most strategic starting tactics. They are also able to customize the colors of their fleet, tweaking the ship paint jobs to reflect their own style and tastes. <br/>\n<br/>\r\nIn War Room, the players engage in real-time strategic battles. They are given the option to play against the challenging in-game AI opponent, or participate in matchmaking battles against other players online. War Room is the main arena where players’ skills are tested to the max all across the world. Think quickly and strategize where to send and control your fleet. In depth 3-dimensional control allows you to select ships in VR and map out any location in space, planning the perfect attack. Use your ships wisely to defend and protect your most prized ship - the Flagship. Clever players will use the combination of ships in smaller squads to complement each other. Using the Spectre, players can use invisibility to hide parts of their fleet. Using the Bruiser, players can barrel through enemy lines, pounding back defenses. Using the Medic, players can restore all ally shields. The combinations are endless and only the best commanders can craft a winning strategy. <br/>\n<br/>\r\nFinally, the Demo Room is always open to the player, allowing them to test out new ideas and strategies in the safety of a demonstrable space. Learn about each ship type, play around and discover new ways to beat your opponent.<br/>\n<br/>\r\nSpace is a large frontier, waiting for ready captains to launch into the void and conquer. Build your fleet and join the war for the stars!", "metacritic": null, "released": "2018-12-21", "tba": false, "updated": "2019-08-28T21:50:54", "background_image": "https://media.rawg.io/media/screenshots/9ee/9ee6b99a077dd09112c857cd93f738f8.jpg", "website": "https://www.pro2131.com/starblazer", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PRO2131"], "genres": ["Adventure", "Strategy", "Simulation"], "publishers": ["PRO2131 Enterprises"], "esrb_rating": null}