{"id": 2683, "slug": "eden-the-game-build-your-village", "name": "Eden: The Game - Build Your Village!", "name_original": "Eden: The Game - Build Your Village!", "description": "<p>&quot;What if we could start again?”<br />\nFind out for yourself in this, the official game of the series, Eden, where you must help your very own community grow on the same remote Scottish location.<br />\nYou&#39;re responsible for prioritizing everything they must do every day; will you have them constructing more camp buildings? Farming? Hunting? Foraging?<br />\nRemember to keep the campfire burning brightly to keep morale up - and to customize and decorate the camp to make it feel more homely.<br />\nFeatures<br />\n·        Build a shelter, then a storehouse, kitchen, workshop - and much more<br />\n·        Decorate your camp – upgrade your buildings, add paths, statues, showers, and many more items<br />\n·        Tend to the camp pigs, chickens and cows.<br />\n·        Manage the community&#39;s limited supplies of water, crops, meat, fish, wood, stone etc.<br />\n·        Farm, forage, hunt, fish, decorate &amp; cook to keep the fire burning brightly and the camp happy<br />\n·        Craft new tools and items to improve efficiency and let the camp become more and more successful<br />\n·        Help the camp survive the harsh Scottish weather through the seasons<br />\n·        Attract new members of the community to help it grow<br />\n·        Share your progress with friends<br />\nPlease note – the game is free to play, however some items can also be purchased for real money, and there is no restriction on the amount of purchases that can be made. If you don’t want to use this feature, please disable in-app purchases in your device’s settings.<br />\n<strong> This game does not support iPhone 3GS, iPad 1, iPod Touch 4th Generation or earlier devices </strong><br />\nIn order to deliver a personalised, responsive service and to improve the game, we remember and store information about how you use it. The information is completely anonymous and will never include any personal details. It is used only by Channel 4 or the trusted partners we work with. If you wish, you can switch off our analytics software within the “Options” screen of the game. The game contains promotions for Channel 4’s other products and services as well as some promotions of third party products and services. By downloading this application, you agree to our terms of use (http://www.channel4.com/programmes/all-4-games/articles/all/game-terms-and-conditions), privacy policy and cookies policy.</p>", "metacritic": null, "released": "2016-07-20", "tba": false, "updated": "2019-10-22T14:28:09", "background_image": "https://media.rawg.io/media/screenshots/789/789de15358c44cf48c0ff587eb27afa0_0u3FaHp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Channel 4"], "genres": ["RPG", "Simulation"], "publishers": ["Channel 4"], "esrb_rating": "Everyone 10+"}