{"id": 268312, "slug": "ball-out-2", "name": "Ball Out", "name_original": "Ball Out", "description": "Discover a crazy Motorcycle - Football game that combines reactivity and speed!In Ball Out, get on several vehicles and compete against your friends or other online players on various tracks with one goal in mind: score as many goals as possible! Gain experience and customize your equipment to show your opponents what you are worth.<br/><br/><br/><br/><br/><br/>Ball Out is an event that brings together top athletes in search of thrills. Tours have been set up all over the world, and still attract as many spectators as ever! Anything goes: Use your bonuses wisely and perform the right tricks to win the game. So do your best, surpass yourself, the audience is watching you, show your talent and don't disappoint them!<br/><br/>This game is inspired by retro motorcycle games, to offer an innovative gameplay combining stunts and aerial figures. The physics engine has been improved to ensure smooth and fast movements.Features :<br/><ul><li>ONLINE MODE UP TO 4 PLAYERS</li></ul>Join or create public or private sessions. Share your customizations online, gain experience and try to win the best place in the world ranking. Two players online mode available !<br/><ul><li>VARIOUS TOURS</li></ul>Each world has a different environment and circuit. You can interact with elements of the scenery, this will vary the difficulty depending on the maps.<br/><ul><li>LOCAL MODE 2 PLAYERS</li></ul>Play in local co-op on a shared screen with your friends. You can use the keyboard or a controller on the same computer. Ideal for training before competing against other players online!<br/><ul><li>CUSTOMIZE YOUR AVATAR</li></ul>Customize your equipment (vehicle, helmet, antenna) and choose an animation to taunt your opponents. These elements are unlockable as you progress through the game. <br/><ul><li>VIRTUAL REALITY IMMERSION</li></ul>This game offers the possibility to switch from a normal mode to a VR mode! This will not prevent you from playing against non-VR players. Rediscover the circuits as if you were a spectator of the tournament!<br/><ul><li>USE BONUSES</li></ul>Your team shares several traps that will make your game easier: shoot rockets, block your cages, shoot the ball at full power, to destabilize your opponents! This allows situations to be reversed.<br/> <br/>The public is getting impatient, Ball Out is only waiting for a new leader like you to win the tournaments!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:31", "background_image": "https://media.rawg.io/media/screenshots/227/227aabb690f957bd6b2377d6a231a447.jpg", "website": "http://www.forceight.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Forceight"], "genres": ["Action", "Sports", "Racing", "Indie"], "publishers": ["Forceight"], "esrb_rating": null}