{"id": 268409, "slug": "jetsnguns-2", "name": "Jets'n'Guns 2", "name_original": "Jets'n'Guns 2", "description": "<p>The universe is under a terrible threat again. Unknown powerful entity from another dimension entered our reality and started to wipe out all sentient life! The divided nations of the galaxy are unable to take action. It&#39;s up to you, the bravest and finest pilot in the galaxy to face the enemy alone and prevail against overwhelming odds!<br />\nRake in Grass proudly presents Jets&#39;n&#39;Guns 2 - a story driven space shooter with insane level of action and destruction, legions of enemies, tons of weapons and freedom of ship building like in no other game before!<br />\nWhat awaits you...EPIC ADVENTUREGo on an extraordinary quest across time and space to save the universe from destruction. Enjoy wild story of epic proportion in a game that doesn&#39;t take itself too seriously.RELENTLESS ACTIONSignature destruction from Jets&#39;n&#39;Guns is back and radically improved! Handcrafted levels are full of stuff to vandalize. Tear through space stations and whole cities on your way to victory.MASSIVE ARSENALNowhere else will you get access to arsenal of this magnitude and variety. The game will offer constant flow of new exciting weapons as you progress throughout the campaign.INNOVATIVE EQUIPMENTVariability of items will be unprecedented - many of them with bizarre effects that support nontraditional play styles. Complexity of ship builds will rival RPG games.ENDLESS GAMEPLAYWe aim to create endless gameplay and replayability with ever growing difficulty, to test the true limit of player&#39;s abilities.... AND MASU IS BACK!Hell yeah! Machinae Supremacy will provide brand new hard rockin&#39; face meltin&#39; nut crackin&#39; soundtrack for the game!<br />\nEARLY ACCESSPlease note that the game at this stage contains only 4 levels with 4 bosses and handful of items.<br />\nThe game is fully playable, but we still have a lot of work ahead of us. If you are hard core fan of Jets&#39;n&#39;Guns or shooters in general, you can support our effort by joining the Early Access. You can follow the development here in discussion group or on our social media where we post regularly. Give us your feedback and suggestions. Help us turn Jets&#39;n&#39;Guns 2 into the best possible game we can deliver!</p>", "metacritic": null, "released": "2020-07-24", "tba": false, "updated": "2024-04-09T13:26:18", "background_image": "https://media.rawg.io/media/screenshots/184/18449e986be03655cfeb10694b86beec.jpg", "website": "http://www.rakeingrass.com/game_jetsnguns2.php", "rating": 4.28, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 99, "beaten": 5, "toplay": 5, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 46, "ratings_count": 18, "suggestions_count": 466, "game_series_count": 1, "reviews_count": 18, "platforms": ["PC"], "developers": ["Rake in Grass"], "genres": ["Action", "Indie"], "publishers": ["Rake in Grass"], "esrb_rating": null}