{"id": 268454, "slug": "lingua-fleur-lily", "name": "Lingua Fleur: Lily", "name_original": "Lingua Fleur: Lily", "description": "different from an 'ordinary' girl?<br/><br/>\"Unlike destined and blessed love seen in stories...\"<br/><br/>The introvert Yuyi arrives at school every day with a secret deep in her heart.<br/>She kept this secret even from her tutor in middle school.<br/>Meeting new friends, she became determined to say goodbye to her emotions of the past...<br/>But then she suddenly received a party invitation...The Game<br/>● Focused on friendship, love, troubles, efforts, and confusions between girls.<br/>● A large step above our previous games!<br/>● A kinetic novel of over 60,000 words (no options)<br/>● Fully voiced in Chinese<br/>● A planned DLC to release for free!<br/>● 6 custom CGs and 9 original music piecesCharacters<br/><strong>Yuyi Wu</strong><br/><br/>\"I've always hoped to be someone just like her. Someone as reliable and gentle as her...\"<br/><br/>The introverted protagonist of the story, an excellent university student. She really admired the tutor she had in middle school.<br/>After four years of hard work, no matter in coursework, cooking, or temperament, she did it impeccably.<br/>Her only obvious weakness shows when she plays sports...<br/>Dreaming of meeting someone just like in her otome comics, she's gradually realized how different they are from reality.<br/><br/><strong>Yile Lin</strong><br/><br/>\"When you're in a bad mood, you have to laugh more! Come on, it'll bring you good luck! Smile! Hehe~\"<br/><br/>Yuyi's classmates with such an optimistic personality it can clear a cloudy sky.<br/>As the public relations person of the faculty, she's organized many activities and is the rising star of the volleyball team.<br/>Her direct and straightforward character can be somewhat offensive at times though.<br/>But her upbeat and innocent nature is hard to stay angry at.<br/><br/><strong>Sis Tutor</strong><br/><br/>\"I'm happy you've come to ask me. Hopefully we can chat a bit afterwards too.\"<br/><br/>Yuyi's middle school tutor, giving off a very gentle impression.<br/>The two were very close, but because of some reasons...<br/>After Yuyi graduated, they never met again. They only talk now through social media...", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:48", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb9bd5e13fdeff3f90fbc72560763d34.jpg", "website": "http://www.narrator.tw/fleur_lily/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9}, "playtime": 1, "achievements_count": 1, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Narrator", "Storia"], "genres": ["Adventure", "Indie"], "publishers": ["Undecided"], "esrb_rating": null}