{"id": 268445, "slug": "my-erotic-summer-memories", "name": "My Erotic Summer Memories", "name_original": "My Erotic Summer Memories", "description": "<p>I will never forget this Summer Vacation.<br />\nOur hero will spend the majority of his summer vacation in a rural village. He will live together with two very unique sisters during that time. He can travel around the village freely and reach out to many colorful characters. This coming-of-age 3DRPG features summer fun and sweet and sour sexual experiences!<br />\n■Game story</p>\n<hr />\n<p>While riding in your family&#39;s car, you came upon a rural village filled with greenery.<br />\nYou were dropped off to live with two Oneechans in a lovely country home.<br />\nExperience new freedoms for the first time with two excitable sisters who will give you unbelievable hospitality.<br />\nThe refreshing landscape, the sweet smell of fresh air, shades of green, and the erotic taste of the villages&#39; fruits all await you.<br />\nThis will be an unforgettable summer vacation.<br />\n■Character introduction</p>\n<hr />\n<p>・Main Character (Name Can Be Edited)<br />\nA bright boy was sent to live in a country home during the summer vacation. He loves to play freely. His interest in the opposite sex is rapidly increasing.<br />\n・Honoka<br />\nA serious and responsible younger sister.<br />\nShe is clean and gentle. She doesn&#39;t like being pushed around.<br />\nShe loves to take care of others, and wants to make sure that our hero is comfortable.<br />\nContrary to her appearance, she has a hidden curiosity in sex. But she is completely inexperienced and has been educated to view it with shame.<br />\nPerhaps the hero can become her friend and treat her to new kindnesses.<br />\n・Asami<br />\nA lazy and tricky older sister.<br />\nDecisive and comedic, she loves to push people&#39;s boundaries.<br />\nShe wants to toy with the hero - and might play some erotic pranks if she gets a little horny.<br />\nDespite her frank nature and wrestling skills, she has never had a boyfriend. Perhaps the hero should try a counterattack?<br />\n・Kenta<br />\nA younger friend who views himself as the leader of the pack in the rural village. He wants to become the hero&#39;s friend and go on little adventures. Although disgusted with girls, he seems to get excited when he runs into things that he probably shouldn&#39;t see.<br />\n・Used Bookstore Lady<br />\nA gorgeous and intelligent owner of a used bookstore in town.<br />\nShe runs the shop alone. She is quite mysterious and may have unknown abilities. She likes the hero at first glance and hopes that he finds her attractive.<br />\n・Village Cop<br />\nA policeman who has been assigned the duty of patrolling the village and running its Koban (police box). He is a passionate man who views himself as a living extension of the police headquarters. He wants the help the hero to mature through participation in the fish race.<br />\n・Traveling Salesman<br />\nA suspicious guy who has a mobile shop that usually sits on a hill. He intimidates most - but he actually has a nice personality. Get on his good side and he might give you some very interesting items.<br />\n・Friend<br />\nA strange girl who only appears at a local shrine after the sunset. She likes the hero&#39;s bright nature. She is quite shy - will you find out what she dreams about?</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-02-23T13:31:17", "background_image": "https://media.rawg.io/media/games/4d4/4d4ffe9bc1474a2fc3f88fa57a57e630.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dieselmine"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Dieselmine"], "esrb_rating": "Adults Only"}