{"id": 268446, "slug": "barotrauma", "name": "Barotrauma", "name_original": "Barotrauma", "description": "<p>Overcome crisis and the unrelenting pressure of a frozen ocean. In Barotrauma you&#39;re a submarine crew member beneath the ice of Jupiter&#39;s moon Europa. Flee or fight alien lifeforms, explore a strange new world, command your crew, and craft equipment in a tense 2d co-op experience.Key FeaturesCommand and manage your submarine and its various systems in adrenaline-filled co-operative gameplay.<br />\nPlay as the captain or any of the 4 other character classes, with up to 16 players per submarine.<br />\nSingle Player campaign, sandbox mode, and single missions also available.<br />\nProcedural levels and events ensure no two games will ever be exactly alike<br />\nEach submarine has multiple crew operated systems, from nuclear reactors to sonar, guns, engines and more<br />\nComprehensive crafting system to create tools, drugs and weapons<br />\nNavigate dangerous environments to achieve mission goals or simply explore and travel deeper into the game world<br />\nExplore alien ruins and wrecked submarines along the way to discover rare and powerful artifacts and other resources<br />\nFully integrated mod tools allow you to create and transform the game via Steam Workshop. Submarine editor, character and procedural animation editor, procedural level editor, sprite and particle editors - unleash your creativity!</p>", "metacritic": 81, "released": "2023-03-13", "tba": false, "updated": "2024-04-15T13:25:02", "background_image": "https://media.rawg.io/media/games/862/8620fd3d08ecce0e806507299333058d.jpg", "website": "http://barotraumagame.com/", "rating": 3.77, "rating_top": 4, "added_by_status": {"yet": 112, "owned": 1640, "beaten": 26, "toplay": 91, "dropped": 130, "playing": 20}, "playtime": 4, "achievements_count": 69, "ratings_count": 160, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 163, "platforms": ["Linux", "macOS", "PC"], "developers": ["Undertow Games", "FakeFish"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["FakeFish"], "esrb_rating": null}