{"id": 268418, "slug": "shieldwall-chronicles-swords-of-the-north", "name": "Shieldwall Chronicles: Swords of the North", "name_original": "Shieldwall Chronicles: Swords of the North", "description": "In Shieldwall Chronicles: Swords of the North, you lead a band of mercenaries into a thrilling adventures in the cold northlands. Your search for fortune will see you pitch blade and spellbook against a host of enemies including the undead, demons, lizardmen, goblins and many other creatures. In a battle that is part game-book and part tactical RPG, you will build a powerful band of warriors and wizards and tilt the balance of power in the northern kingdoms.<br/>\n<br/>\n<br/>\r\nThe game's combat system is turn-based and tactical. Players will have to use cover and line of sight effectively to be successful. Combat is realistic and incorporates details such as weapon range, damage effects, and counter attacks without slowing down gameplay. The game features a unique morale system where warriors will fight far better when they believe they are winning and killing an enemy will grant them a further boost to their abilities.<br/>\n<br/>\n<br/>\r\nChoose from 15 different characters classes (each with male and female variants) that range from scholarly wizards to hardened warriors.  Using each character type to their fullest is vital to securing victory. Each character can be futher customized with dozens of unique magical items, many of which grant entirely new abilities.  <br/>\n<br/>\n<br/>\r\nEngage in a lengthy campaign featuring more than 50 hours of gameplay that will see your party travel across snow-covered wilderness, venture into dark caverns and battle through the bloody streets of medieval cities. Each victory will make your band of heroes stronger and reward you with precious magical items while every defeat will leave you reforming your battle plans.", "metacritic": null, "released": "2018-12-17", "tba": false, "updated": "2019-08-28T21:50:51", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca2e661491c339a3db0f2797aa9d9288.jpg", "website": "http://www.wavelightgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 9}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 445, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wave Light Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Wave Light Games"], "esrb_rating": null}