{"id": 268415, "slug": "helheim", "name": "Helheim", "name_original": "Helheim", "description": "The Helheim was invaded by a mysterious enemy in command of an army corrupted by a powerful technology. Its queen, Hella, was defeated and imprisoned, while her reign was being ravaged. Then an unexpected help arrived and now she is ready to take her throne back.Fast paced gameplay. Easy to learn, hard to masterKill an entire army with <strong>Hack’n’Slash</strong> mechanics, where every mistake could be fatal. You will have to face an army made up of various types of enemies that will test your skills and hinder your ascent. <br/><br/>Dodge myriads of bullets and <strong>deflect</strong> them wielding your sword. The corrupted enemies of the helheim will try to stop you with powerful armaments and the only thing you have to stop them is your blade.<br/>Collect and use powerful runes to <strong>unleash</strong> the true powers of a goddess of deathThe Helheim hides ancient runes that contains the lost powers of Hella. Find them, equip them and create powerful combos to annihilate your enemies.<br/>A corrupted norse kingdom of deathYou will explore the Helheim as never seen before, where ancient structures are crumbling, giving way to a new and mysterious technology. Those who once were the inhabitants of the helheim are now a lethal army, whose only end is to kill you.<br/>", "metacritic": null, "released": "2019-02-01", "tba": false, "updated": "2019-08-28T21:50:52", "background_image": "https://media.rawg.io/media/screenshots/0ba/0ba441d99b3f28fb5811b4eb8db561b9.jpg", "website": "http://www.notanumber.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 13, "dropped": 1}, "playtime": 3, "achievements_count": 14, "ratings_count": 1, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Not a Number"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["34BigThings"], "esrb_rating": null}