{"id": 2685, "slug": "fish", "name": "Fish!", "name_original": "Fish!", "description": "From the award winning creators of Flick Fishing comes a full blown sequel!<br/><br/>Fish! is Strange Flavour&amp;#39;s brand new fishing game, created especially for the Apple TV and iOS<br/><br/>•••  Now with Apple Watch play! Use your Apple Watch as your tackle box and as a library of information on all the fish. Plus, pop up your wrist and immediately fish in a unique location just on the Apple Watch! •••<br/><br/><br/>• Fish in 8 gorgeous living 3D locations for 30 different kinds of fish and unlock them to show off in your virtual aquarium!<br/><br/>• Take it easy, kick back and just fish in each spot or see if you can win trophies in competition modes. Or take on a quest that will carry you around the island in search of rare fish and treasure!<br/><br/>• Boost your fishing skills by unlocking different gizmos, fish charms, rods and reels. Choose the right bait and see if you can catch one of the super rare and very large, named fish that hides in each spot.<br/><br/>• What about fishing with your friends? Join in a multiplayer game of Fish! playing on your Apple TV, iPhone or iPad over your local network.<br/><br/>• Vs CPU, Multiplayer network or turn based competition modes. If you play turned based competitions in network mode you can even play team vs team!<br/><br/>• MFi Controllers and iCloud game save supported.<br/><br/>•  As with all Strange Flavour&amp;#39;s Apple TV games, Fish! is Universal Purchase, so buying either the Apple TV or iOS version lets you download both.<br/><br/>*Network play with AppleTV version with Fish! Apple TV 1.1 coming soon!", "metacritic": null, "released": "2015-12-08", "tba": false, "updated": "2019-10-22T14:28:09", "background_image": "https://media.rawg.io/media/screenshots/600/600c83a3c5843f0e3a5f933b11e23e55.jpeg", "website": "http://www.strangeflavour.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Strange Flavour"], "genres": ["Adventure", "Simulation", "Sports"], "publishers": ["Strange Flavour"], "esrb_rating": "Everyone 10+"}