{"id": 268772, "slug": "vr-drift-motorbike-racing-extreme-stunt-rider-3d", "name": "VR Drift MotorBike Racing: Extreme Stunt Rider 3D", "name_original": "VR Drift MotorBike Racing: Extreme Stunt Rider 3D", "description": "Are you ready for a fast and delighted motor race by easily using the driving Technics like diagonally passing, near passing, sliding and overtaking with a feeling of a real driving in cardboard.<br/>Vr Turbo Bike Drive game brings this high adrenaline in your apple device.<br/><br/>You are going to be pleased to drive super motorbikes.<br/><br/>As you are racing against the time and challenging racetrack with traffic racing game, at the same time your agile motions save you much more points and make you satisfied.<br/><br/>On the other hand, please do not forget you are in an intense traffic and you have to restart the race when you hit the other cars in high speed.<br/><br/>Depending on your ability and the performance during the race, you will earn different types of points and you can buy new motorcycles or modify your existing motorcycles anyway you like.<br/><br/>HOW TO PLAY THIS GAME ?<br/><br/>- Accelerate your chopper by moving your head up.<br/>- You can change lanes by moving your head right and left.<br/>- You can slow down your motor by moving your head down.<br/><br/><br/>HIGHLIGHTED FEATURES<br/>- Realistic driving by high capability of motorcycle handling.<br/>- Exclusive, many types of vehicles.<br/>- Different camera options: Top camera position, Following camera<br/>- One-way and two-way direction options.<br/>- Vehicle color and styling options.<br/>- High resolution 3D graphical design in virtual reality.", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2019-10-22T14:05:19", "background_image": "https://media.rawg.io/media/screenshots/928/9289c30441b5eef7b99d46fc123b22d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["Simulation", "Racing"], "publishers": ["jolta technology"], "esrb_rating": "Everyone 10+"}