{"id": 268868, "slug": "dark-forest-horror-gamebook", "name": "Dark Forest - HORROR GameBook", "name_original": "Dark Forest - HORROR GameBook", "description": "Mystery and Horror Book with multiple endings. \"Dark Forest” Louis Versetti, a young man comes out of his mansion far from his father authority figure, he enters the \"Dark Forest \"where he will encounter supernatural and terrifying difficulties he never imagined.  Get the FREE DOWNLOAD today.<br/><br/>-Decisions<br/>-Many Endings<br/>-Music<br/>-Illustrations<br/>-Horror<br/>-Supernatural Mystery<br/><br/>Mystery and Horror Book with multiple endings. In this story, you are the main character. Make decisions and change the path and the ending. Dare to live your own story. An Interactive Book App with great images, fantastic music, decisions, and multiple endings. Choose your path wisely and discover our multiple endings.<br/><br/>Sick and tired of his father’s slurs and insults, Louis decides to leaves behind a life of wealth and comfort, he wants to know the real world, what it is out there but before he can do that he enters the Dark Forest where he meets a young woman, but things are not what it seems, choose Louis Versetti’s path wisely.<br/><br/>One of the finest vehicles of the large Versetti fleet approaches the stately gates of the family residence, a huge luxurious mansion constructed with the finest materials to be found in the whole of Scotland. The car drives through lovely gardens for over seventy meters, but when it stops at the mansion’s front entrance, nobody steps out of the vehicle, as the butler patiently waits at the ready to welcome the vehicle’s occupants. <br/><br/>The sound of someone shouting can be heard when the car door opens after a few minutes.<br/><br/>That’s the last time I’m putting up with your slurs and your insults, yelled Louis Versetti, son of the multimillionaire Paolo Versetti.<br/><br/>Very slowly and calmly, Louis’ father steps out of the car after his son; he doesn’t follow him, he just looks at him with a hard and dismissive stare. <br/><br/>You think I don’t deserve any of this.  Do you think I’m not worthy?  Okay, so that’s the way it will be then; I will not accept a penny of your fortune; I will not accept anything that is yours.  I'm leaving this house right now!  Louis exclaimed energetically in a determined tone of voice, while his father just looked on with a smirk on his face, which, if anything, just provoked him all the more, making him even angrier. <br/><br/>Louis turns around slowly, and without hesitation begins to walk through the large garden, back towards the mansion’s gate. No one makes a single sound; the only thing to be heard is the sound the shoes make as they walk down the paved driveway; those fine shoes which were manufactured in Italy, his father’s native land. His father came to this country when he was very young and single-handedly became a millionaire in just ten years by creating multiple companies.<br/><br/>Louis is about to reach the gate, and all he’s taking with him to face the world on his own is just a leather jacket and some money in his wallet.<br/><br/>I’ll show him what I can accomplish on my own, thinks the 23-year-old, who feels he is ready to forge his own path in life. <br/><br/> Before leaving the grounds, he turns a little to the right to look at the small storage shed where old things are kept, and where he knows his old motorcycle is stored. It’s been years since he last used it, so it must be very dusty and maybe even a little rusty, but Louis is almost certain that it still works. <br/><br/>Although Louis had been determined to leave on foot, he thinks it will be much better on that bike. He is about to go and pick up the motorcycle when he remembers it was a gift given to him by his father when he was 15 and stops in his tracks to think for a moment:<br/><br/>Choose his path wisely, what would you do?<br/><br/> This Interactive Book App is published by Living a Book. This isn't a gamebook or chat story, it's a Pathbook.<br/><br/>Interactive book with multiple endings. \"Living a Book\" is a new approach to interactive books where your decisions change and trigger new stories and a new ending.<br/><br/>LIVING A BOOK<br/>A reading experience", "metacritic": null, "released": "2013-09-10", "tba": false, "updated": "2019-10-22T14:05:26", "background_image": "https://media.rawg.io/media/screenshots/499/4991373204683aaa244e6c0bd28972bc.jpg", "website": "https://livingabook.com/pathbooks.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jorge Caballero"], "genres": ["RPG", "Strategy"], "publishers": ["Jorge Caballero"], "esrb_rating": "Everyone 10+"}