{"id": 268879, "slug": "monster-and-cat-interactive-story-play-book-game", "name": "Monster and Cat - Interactive story Play Book game", "name_original": "Monster and Cat - Interactive story Play Book game", "description": "SUPER FUN, This is an interactive book with multiple endings. FANTASTIC. \"Living a Book\" is a new approach of interactive books where the reader’s decisions change and trigger new situations and a different ending.<br/><br/>\"The Monster and The Cat” one of the best short stories for kids, tells the story about a monster which thrives on a diet of little girls, cats and toys, lurks on the roof of a nine year old girl’s home. <br/><br/>Our heroine in this text adventure won’t have to deal with this alone however, as she meets up with a masked, Chatterbox Cat that helps her stand up to the terrible monster. Dare to join them in this storybook online about funny and exciting adventure.<br/><br/>An Interactive Book App with images, music, decisions and multiple endings.<br/><br/>\"The Monster and the Cat\" is available today, you get to choose the course of this storybook online, become the main character, choose your path wisely and discover our multiple endings.<br/><br/>Pathbooks short stories for kids talks about nine-year-old Abi doesn’t have any brothers or sisters. She has never, ever, had a single pet, as her parents think that she’s not ready for such a big responsibility. <br/><br/>This makes her sad, as her greatest desire is to be able to play and share special moments with a playful puppy of her own, read this text adventure aloud with your kids.<br/><br/>This app is available for iPhone, iPod and iPad devices.This Interactive Book App is published by Living a Book.<br/><br/>Nine-year-old Abi doesn’t have any brothers or sisters. She has never, ever, had a single pet, as her parents think that she’s not ready for such a big responsibility. This makes her sad, as her greatest desire is to be able to play and share special moments with a playful puppy of her own. She’d love to play with a cute bouncing bunny. <br/><br/>Feeling sad and lonely, Abi is crying in her bedroom, which is painted in pretty pink and has a piano, a small toy kitchen and some teddy bears. She also has a farm with seven cows, five pigs, 14 chickens and heaps of frogs, but they don’t really count because they’re all in her iPad. What Abi really wants is a real pet. <br/><br/>Abi’s bedroom is on the second floor of the house and, as her bed is beside the window, she can see the street and some neighboring houses. After gazing outside for a few minutes, she sees a grey cat swishing its tail while slowly strolling along from one side of the street to the other as if it owns the whole street. <br/><br/>Abi smiles at the sight of the cat, because she thinks cats are beautiful and affectionate. She’s never thought of having a cat as a pet. Her mother doesn’t like cats at all. She says that if Abi swallowed one single cat hair, it could harm her. It would be as if the hair travelled all the way down to her stomach, and then kittens would grow there and they would tickle her insides. <br/><br/>Then she would be unable to stop laughing, and then they would have to operate on her belly to get them out. What a disaster! <br/><br/>After watching the cat for a little while as it is strolling down the street, Abi gets ready for bed. She brushes her teeth, puts her pajamas on, climbs into bed and closes her eyes. <br/><br/>A few minutes later, she hears a cat’s soft meow. A little scared, Abi opens her eyes and can’t believe what she sees staring back at her. The small grey cat is on her windowsill. It’s a beautiful cat, and one could even say it is a funny cat. <br/><br/>For some strange reason it’s wearing a mask, as if it is some kind of superhero.<br/><br/>What should Abi do?<br/><br/>Ordinary people, book lovers, and writers from around the world are writing our books. Be part of this adventure and become the author of your own interactive book. You just need to write the story and Living a Book will design, program and publish it as an application.<br/><br/>Have FUN reading.<br/><br/>LIVING A BOOK KIDS<br/>A reading experience.<br/>http://www.livingabook.com", "metacritic": null, "released": "2013-11-19", "tba": false, "updated": "2019-10-22T14:05:27", "background_image": "https://media.rawg.io/media/screenshots/eb2/eb2a8c26acca14add6d9dc4f6da70c3e_1cWB8oD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jorge Caballero"], "genres": ["Family"], "publishers": ["Jorge Caballero"], "esrb_rating": "Everyone 10+"}