{"id": 268858, "slug": "speed-car-drift-racing", "name": "Speed Car Drift Racing", "name_original": "Speed Car Drift Racing", "description": "Speed Car Drift Racing skips all pretensions of realism and provides an over-the-top, high-octane game with all the fixings. Players can work their way through the single player mode, and unlock new rides. The incredibly polished graphics and outstanding soundtrack make Speed Car Drift Racing an adrenaline trip you won’t forget soon of this drift racing game. The open-city map is absolutely huge, and beautifully crafted, pushing current generation smartphones to the limits.<br/><br/>Speed Car Drift Racing is a clean-cut drifting game. Players need not worry about steering, all you have to do is perfectly time your phone tilt.<br/><br/>Pull on up to the starting line, and check out this outstanding free drifting game for Android.<br/><br/>How to Play:-<br/><br/>- Speed Car Drift Racing is a challenging racing game with incredible graphics<br/>- A pumping alt-rock soundtrack and loads of tracks to unlock.<br/>- The aim of the game is to hit the bends at the right moment and at the right position, hit the hand brake and slide into a sweet drift around the corner.<br/>- Tough to master but insanely rewarding.<br/>- Takes some practice to fully master the Tilt based controls.<br/>- You control the car by accelerometer, meaning you tilt the phone, and this gives you some pretty impressive shots across the track too. The tracks and cars have a huge level of detail and look very cool indeed.<br/><br/>Game Features:<br/><br/>- Addictive vehicle-based game play.<br/>- Real-Life Impressive Physics<br/>- Hyper-realistic graphics<br/>- Ability to play in 3D.<br/>- Insanely enjoyable.<br/>- One of the best soundtracks on any game ever.<br/>- Responsive controls", "metacritic": null, "released": "2016-06-09", "tba": false, "updated": "2019-10-22T14:05:24", "background_image": "https://media.rawg.io/media/screenshots/20b/20b46213d03e69904fc74092d190fcae_nrD5Z7V.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tahir Mahmood"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Tahir Mahmood"], "esrb_rating": "Everyone 10+"}