{"id": 269093, "slug": "the-story-of-the-two-wolves", "name": "The Story of the Two Wolves", "name_original": "The Story of the Two Wolves", "description": "<p>This game was originally made during a game jam hosted by Roc Game Dev in 2018 with the theme of \"Growth.\" Janis (7 years old) did all of the art, voice acting, and game design. Ian (43 years old) did the implementation. Music and sound effects by Rowan Waring, who didn't start out as part of the team but had the bandwidth to make all the audio in addition to his other tasks on a different team. Everything was done on site in a weekend except for some of the programming.</p>\n<p>The game is about a wolf who lost her pack and must search for them, mostly through following their scent trail. Different scents are shown as different colors that get brighter the closer you are to them. Most scents start out unknown until you encounter them, at which point they're added to your scent book. Along the way you may encounter monsters (both friendly and unfriendly), natural hazards and obstacles (such as swampland, water, and an erupting volcano), and food along your pack's scent trail that makes you stronger. Improve your eyes to see farther, your legs to run and swim faster, your nose to localize scents better, or your wings to fly. (This was designed by a 7-year-old, wolves can fly in this game, just accept it.)</p>\n<p>The entire game takes about 10 to 15 minutes to play to completion on a successful run. We hope you enjoy it.</p>", "metacritic": null, "released": "2018-11-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/16b/16b041191121417f289fc5a981ae5c8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ai864"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}