{"id": 26914, "slug": "wwe-13", "name": "WWE '13", "name_original": "WWE '13", "description": "<p>\n      Last summer, one man revolutionized the sports entertainment industry. \n      In a legendary moment at the end of Monday Night Raw, CM Punk shook up \n      WWE and a hero was born. Fifteen years ago, one Stone Cold Rattlesnake \n      revolutionized entertainment and ignited a new generation of WWE fans \n      with his relentless Attitude. Now, a new revolution is upon us, and it \n      doesn’t start with someone on TV, the web, or at a live event. This \n      revolution starts with you. It’s time to Live the Revolution.\n    </p><p>\n</p><p>\n      THQ’s flagship franchise in the company’s WWE videogame portfolio \n      returns, promising to deliver the smoothest, most authentic, and most \n      immersive WWE action ever, presented with a grittier Attitude. You have \n      heard the legendary stories and witnessed the history, but now relive \n      the Attitude Era of WWE in an all-new, breakthrough, story mode. With \n      the new WWE Live™ presentation system, featuring a completely overhauled \n      audio system and Spectacular Moments, that make you feel like you’re \n      part of a WWE live event, WWE® ’13 will be the boldest, smoothest, and \n      most immersive, WWE simulation to date.\n    </p><p>\n      GAME FEATURES:\n    </p><p>\n      • WWE LIVE™ – Bring the atmosphere, spectacle, and \n      fervor of a raucous WWE Live event into your living room with \n      awe-inspiring Spectacular Moments and a new audio system that delivers \n      the most authentic and dynamic commentary, sound effects and crowd \n      participation ever in a WWE game.<br/>• RELIVE THE ATTITUDE ERA \n      – It was a time when Stone Cold Steve Austin battled for supremacy \n      against his maniacal boss, Mr. McMahon. An era where The Rock told \n      opponents to “know your role, and shut your mouth”, where the Undertaker \n      threw Mankind off the top of the Hell in a Cell, and D-Generation X \n      broke all the rules. Now, for the first time, relive this groundbreaking \n      era in an all-new storyline mode that will make you experience the \n      Monday Night Wars like never before.<br/>• WWE UNIVERSE 3.0 \n      – The fan-favorite WWE Universe mode returns, giving you more control \n      over WWE than ever before. Your choices determine your destiny as you \n      dynamically shape your schedules, television shows, and rosters, and \n      form alliances and make enemies on your way to the top.<br/>• PREDATOR \n      TECHNOLOGY 2.0 – With new animations, transitions, and modified \n      controls built on the Predator Technology™ game engine, WWE ’13 will \n      deliver strategic, fluid, and fun WWE action that plays more smoothly \n      than any prior WWE game.<br/>• CREATE YOUR WWE – WWE ‘13’s \n      industry-defining creation suite gives you the ability to create \n      Superstars, entrances, finishing moves, and more!\n    </p>", "metacritic": null, "released": "2012-10-30", "tba": false, "updated": "2023-09-08T06:36:37", "background_image": "https://media.rawg.io/media/screenshots/c04/c0490101ed41235c38f02cf39099114a.jpg", "website": "http://wwe.thq.com/", "rating": 3.68, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 238, "beaten": 40, "toplay": 1, "dropped": 25, "playing": 3}, "playtime": 0, "achievements_count": 83, "ratings_count": 66, "suggestions_count": 443, "game_series_count": 9, "reviews_count": 66, "platforms": ["PlayStation 3", "Wii", "Xbox 360"], "developers": ["Yuke's Co"], "genres": ["Arcade", "Fighting"], "publishers": ["THQ", "2K Sports"], "esrb_rating": "Teen"}