{"id": 269210, "slug": "lone-troopers", "name": "Lone Troopers", "name_original": "Lone Troopers", "description": "<p><strong><em>Lone Troopers</em></strong> is a fun top down shooter to play over your local network with an unrestricted amount of friends. Set in the WW2 era players can use weapons including the Thompson SMG, M1 Garand, and the M1903 Springfield, as well as throw grenades and use mounted guns such as the MG42.</p>\n<p>With a bleeding out mechanic, wounded players must desperately fight for cover to stem the bleeding by bandaging their wounds.</p>\n<p>Killed players drop their supplies, including their bandages, grenades and spare ammunition clips. Other players can collect these to boost their chance of survival!</p>\n<p>Buildings provide cover for players, with rooves disguising their position, however windows on buildings enable players to look inside. </p>\n<p>Players can prepare and execute surprise ambushes while being concealed in bushes, invisible to all others. Be careful, as if you move whilst in a bush, rustling will give your position away.</p>\n<p>There are two game modes in <strong><em>Lone Troopers</em></strong>, <em>Free For All</em> and <em>Team Death Match</em>. In <em>FFA</em>, although players can still select <em>Axis</em> or <em>Allies</em> this only changes their in-game sprite, and they are free to kill anyone. In <em>TDM</em> if players kill teammates then they are penalised with a kill taken off their tally. More game modes could be released in the future, and if you have one to recommend then leave a comment or head over to the discord!</p>\n<p>Currently there is one map in <strong><em>Lone Troopers</em><em> </em></strong>featuring buildings, a bunker, mounted machine guns, penetrable walls, bushes and more! In the future we hope to release a map creation tool as well as other default maps.</p>\n<p>As <strong><em>Lone Troopers</em></strong> is currently in an early stage of development there are bugs, if you find one please do not hesitate to contact us. In the event of most bugs, they are fixable by re-spawning (by default escape key).</p>\n<p>You can also save you previous settings such as your last username, gun selected and last address, as well as being able to customise your controls.</p>\n<p><strong>CONTROLS</strong> (default)<strong>:</strong></p>\n<p>W, A, S, D to move. </p>\n<p>Mouse to aim and shoot. </p>\n<p>R to reload. </p>\n<p>E to bandage (if bleeding out). </p>\n<p>Space to vault.</p>\n<p>F to interact with map (access mounted gun, open/close doors, etc.). </p>\n<p>G to throw grenade.</p>\n<p>V to melee.</p>\n<p>Q to view scoreboard. </p>\n<p>Y to use text chat.</p><p>Shift to sprint.</p>\n<p><strong>INSTRUCTI</strong><strong>ONS:</strong><br/></p>\n<p>To host a server just simply run <em>LoneTroopersServer.jar</em>, and take note of the address that appears in the window. To join a game with the client first run <em>LoneTroopersClient.jar</em>. Then type in a username and server address (ask the host for the address or click search to find all servers on your network) in their respective fields. You can select a weapon and team from the respective drop-down menus and click 'Help' for further assistance. When done click deploy to begin! If nothing happens check that you got the server address correct and that the host has the server running.</p>\n<p>To customise the controls of <strong><em>Lone Troopers</em></strong> you need to get the key codes of the keys that you are wishing to set. To do this while on the controls screen, press any key and below all the control fields you will see information about that key, including it's name and key code. This key code is what you then input into the text fields.</p>", "metacritic": null, "released": "2018-11-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/53c/53c8b3b6ce3475ad2dbaf7d429c02199.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kryptic Coding"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}