{"id": 269343, "slug": "prime-world-defenders-2", "name": "Prime World: Defenders 2", "name_original": "Prime World: Defenders 2", "description": "<p>Defenders 2, - an exciting hybrid of Tower Defense and CCG, - is now available on Steam!<br />\nNumerous challenging battles with different types of monsters and other players are waiting for you in a carefully crafted 3D fantasy world. Protect your belongings and fight for new lands by unleashing your strategic mastermind potential!<br />\nA war is raging between heroes and Touched - monsters, which resemble goblins, zombies and even aliens in some particular cases. Citizens of your Kingdom believe that only you are able to save them from all the misfortunes occurring close to the Castle. Battle cries are heard from every corner,  and the hostile creeps are continuing to occupy your lands. Don’t let your Castle walls fall - use all towers, spells and tricks you have to protect your people. Rush to the battlefields and put up an epic TD fight!<br />\nWhat is more, other heroes are also eager to challenge your defense building skills. Think of a strategy that will help you win! Build the defense no foe can pass, and become the best at our TD game.<br />\nPlay one of the most entertaining tower defense games and show what you are worth!<br />\nMake use of every unique tower you own to stop the creeps and become the best defender Praya has ever seen!</p>", "metacritic": null, "released": "2018-11-29", "tba": false, "updated": "2023-08-05T17:43:51", "background_image": "https://media.rawg.io/media/screenshots/66a/66a9c81f9e6bfa8dd160b201c7aad5c7.jpg", "website": "http://playdefenders.com", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 199, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 44, "ratings_count": 12, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 12, "platforms": ["iOS", "Android", "PC"], "developers": ["Nival Interactive"], "genres": ["Strategy", "Massively Multiplayer"], "publishers": ["Nival"], "esrb_rating": null}