{"id": 269481, "slug": "twisty-puzzle-simulator", "name": "Twisty Puzzle Simulator", "name_original": "Twisty Puzzle Simulator", "description": "Play with a virtual toy box filled with over 30 original puzzles. Take it easy and explore the puzzles at your own pace, or prepare for a challenge and attempt to solve the puzzles after a thorough scramble. Some puzzles are common and recognizable while others are downright bizarre: you have never experienced puzzles like these before.Gradually Increasing Difficulty<br/>Twisty Puzzle Simulator's fully featured campaign allows both beginners and experts alike to progress at their own pace. Even if you enter the game with no prior experience, you'll have no problem finding your footing and working your way towards puzzle master.Free Play<br/>Alternatively, all puzzles can be selected directly from the menu. 14 puzzles are available at the start while the rest are accessed with codes hidden throughout the game. Share these codes online to help others access your favorite puzzles.Virtual Reality<br/>The entire game is playable in both 2D and VR: reach out and twist the puzzles with your own virtual hands.Additional Features<br/><ul><li>Work your way to the top of a puzzle's leaderboard and make a name for yourself within the community.<br/></li><li>Fully customize puzzles with your favorite colors! Adjust colors to avoid color blindness issues.<br/></li><li>View incredibly detailed stats including graphs of your past solves.<br/></li><li>Skip the scramble and create cool patterns with the puzzles.</li></ul>", "metacritic": null, "released": "2018-11-27", "tba": false, "updated": "2019-08-28T21:50:42", "background_image": "https://media.rawg.io/media/screenshots/4ab/4abe43e92833d89ec93808ffab91dedc.jpg", "website": "https://vizioneck.com/games/twisty_puzzle_simulator", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "PC"], "developers": ["VIZIONECK"], "genres": ["Adventure", "Simulation", "Casual", "Indie", "Puzzle"], "publishers": ["VizionEck"], "esrb_rating": null}