{"id": 269551, "slug": "sugar-heroes-world-match-3", "name": "Sugar Heroes - World match 3!", "name_original": "Sugar Heroes - World match 3!", "description": "Sugar Heroes are greeting you in our new terrific match 3 puzzle!<br/><br/>Hilarious comical characters will become your best friends in no time! Match sweeties in a row, pop amazing obstacles and mix your moves to be the best! Prove your skills in multiplayer tournaments, or earn gold solving daily tasks! Play with your friends or compete with each other!<br/><br/>What are you waiting for? Download the game now and make your free time more colorful and fun!<br/><br/>Switch and match amazing diverse sweeties in this addicting matching game! Hundreds of levels with captivating mechanics and sapid characters are waiting to be solved!<br/><br/>FEATURES:<br/><br/>● COLORFUL: Exciting graphics and relaxing gameplay.<br/><br/>● CHALLENGING: Play solo or challenge your friends or players around the world.<br/><br/>● ENTERTAINING: You will not get bored with various levels and tasks.<br/><br/>● FUN: Join tournaments and championships to get the amazing experience of the many-sided game world.<br/><br/>● PLAY ANYTIME YOU WANT: Continue the game on any platform everywhere with automatically saved game progress. You can play on a desktop at home and continue to play on mobile later with same game achievements.<br/><br/>● COMPLETELY FREE: Many ways to get bonus coins: bonus games, tournament rewards, friends help and much more.<br/><br/>NOTE: Sugar Heroes is absolutely free-to-play online puzzle game with optional in-game purchases.", "metacritic": null, "released": "2018-11-01", "tba": false, "updated": "2019-10-22T14:05:37", "background_image": "https://media.rawg.io/media/screenshots/010/01029fe4920aab5182f20b9b8dc302bb_1s7Wu50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Clever Apps Pte"], "genres": ["Adventure", "Puzzle"], "publishers": ["Clever Apps Pte"], "esrb_rating": "Everyone 10+"}