{"id": 269560, "slug": "tropic-trouble-match-3-builder", "name": "Tropic Trouble Match 3 Builder", "name_original": "Tropic Trouble Match 3 Builder", "description": "Welcome to Tropic Trouble! While sailing from San Francisco to Hawaii, your family’s ship was hit by a storm and wrecked upon a mysterious, uncharted island! Now, they need your help! Help build your family a home, find food, and turn this mysterious island into your own tropical escape!<br/><br/>An uncharted island paradise is waiting for you to explore in this brand new match-3 adventure game! Beat match-3 puzzles to collect resources, then use those resources to build everything your family needs! Spruce up your island with beautiful decorations, from statues and plants to pets you can collect! Open up new areas of the island to expand your family’s new home, and help them turn a bit of misfortune into a lucky break!<br/><br/>There’s just so many fun and amazing things to see and do around the island:<br/>Addictive gameplay! Match and swap gems to decorate your island!<br/>Hundreds of new and unique match three puzzle levels just waiting for you!<br/>Explore secret areas for amazing rewards!<br/>Build your own home, farm, garden, and more!<br/>Visit your friends on their islands and exchange gifts!<br/>Follow the story of your family as they build their life!<br/><br/>In Tropic Trouble, you have full control of your island. Choose where to build your home, then upgrade it from a shack on the beach to a tropical island mansion! Go fishing with Dad! Cook with Mom! Make ice cream with the kids!<br/><br/>So why wait? <br/>Your next vacation is ready and waiting for you in this new match-3 experience!<br/>Play Tropic Trouble today!", "metacritic": null, "released": "2018-03-27", "tba": false, "updated": "2019-10-22T14:05:38", "background_image": "https://media.rawg.io/media/screenshots/a78/a78b32ea7dcbc71160e36f8fd706b8d1_GGRZSmw.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Qublix"], "genres": ["Adventure", "Puzzle"], "publishers": ["Qublix"], "esrb_rating": null}