{"id": 269641, "slug": "reversi-4", "name": "Reversi．", "name_original": "Reversi．", "description": "Reversi is a strategy board game, played on an 8×8 uncheckered board! It is famous at USA and Japan!<br/><br/>There are sixty-four identical game pieces called disks, which are light on one side and dark on the other. Players take turns placing disks on the board with their assigned color facing up. During a play, any disks of the opponent's color that are in a straight line and bounded by the disk just placed and another disk of the current player's color are turned over to the current player's color.<br/><br/>The object of the game is to have the majority of disks turned to display your color when the last playable empty square is filled.<br/><br/>Reversi offers a host of exciting features, including: <br/>- Great graphics and exciting sound effects.<br/>- Support man vs man mode.<br/>- Support man vs computer mode, Machine Learning, Outstanding AI engine with configurable difficulty level, you can challenge three different mode, easy, medium, expert.<br/>- Unlimited undo.<br/>- Highlight last step.<br/>- First go setting.<br/>- Statistic by timestamp, ai level, score, etc.<br/><br/>Reversi, take the classic strategy game with you wherever you go with Reversi. Place your pieces carefully and defeat your opponent in this back and forth battle!<br/><br/>if you’re enjoying Reversi, please take a few seconds to give us a review! azhuona@gmail.com", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-10-22T14:05:40", "background_image": "https://media.rawg.io/media/screenshots/b69/b69cfe511fa5f2ceeb0ca1b01ad7c028_GGR7Hgs.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["an zhuona"], "genres": ["Strategy", "Puzzle"], "publishers": ["an zhuona"], "esrb_rating": "Everyone 10+"}