{"id": 269786, "slug": "mini-sudoku", "name": "mini Sudoku", "name_original": "mini Sudoku", "description": "Just when you thought mini/maxi Sudoku was super-versatile enough, we've made it even better!  And Always Ads-free!<br/><br/>Puzzle through our new alphabet board offering a new and challenging twist.  Or stick with the classic Sudoku board.<br/><br/>And remember, with mini/maxi Sudoku, you never have to buy new boards — an 'infinite' number for your gaming pleasure.<br/><br/><br/>Curious about Sudoku but feel intimidated?  Then mini Maxi-Sudoku is just for you with maximum board variations!  With each game freshly crafted to optimize your playing experience!  A great Sudoku for kids, or Sudoku for beginners!<br/><br/><br/>mini Maxi-Sudoku has 6 Sudoku flavors to satisfy whims and fancies of players of all ages and skills:<br/><br/>2x2, 2x3, 3x2, 2x4, 4x2, and the usual 3x3 squares<br/><br/><br/>Additional features:<br/><br/>\"Hint\" or \"Peek\" to help improve your playing skills<br/>\"Solve\" and \"Undo\" animation sequences<br/>Auto-save so you'll never lose any unfinished game<br/>Tracking of fastest playing time and games played<br/><br/><br/>The \"Hint\" or \"Peek\" feature will assist you like an expert Sudoku master at your side.  You may find those suggestions a great learning experience to improve your playing skills.<br/><br/><br/>The \"Solve\" feature shows in animation sequence how a game can be solved, but can be stopped any time by tapping any cells or buttons so you can resume your play.  Each empty cell can also be tapped multiple times to gradually narrow down its valid choice.<br/><br/><br/>Maxi-Sudoku auto-save always picks up where you've last left off or been interrupted during your play.  For your amusement, your solving time will be tracked whenever a game is solved without the \"Solve\" feature.<br/><br/><br/>3x3 game has the same \"Easy\" level of our other popular Superdoku app.  If you enjoy mini Sudoku and feel like testing your 3x3 skills against \"Medium\" and \"Hard\" levels, please check out Superdoku, crafted with the same exacting details and care and with games to match your desired difficulty levels.<br/><br/><br/>If you enjoy playing our well-crafted Sudoku apps, please visit our popular Fishies app that lets you play with a school of fish swimming in coral reef.", "metacritic": null, "released": "2009-07-18", "tba": false, "updated": "2019-10-22T14:05:46", "background_image": "https://media.rawg.io/media/screenshots/654/6548a344f43c817f2a9360059ef344dc.jpg", "website": "http://www.3bridgesmedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["3Bridges"], "genres": ["Family"], "publishers": ["3Bridges, L.L.C."], "esrb_rating": "Everyone 10+"}