{"id": 269718, "slug": "voice-of-the-mummy", "name": "Voice of the Mummy", "name_original": "Voice of the Mummy", "description": "Want to play your old \"Voice of the Mummy\" board game, but the record player is broken? No problem! Use this app to take the place of your broken player. Game not included - just the mummy's voice!<br/><br/>Voice of the Mummy was the best board game ever created by the Milton Bradley company, and it was a ground-breaking product back in 1971. It had a three-level pyramidal board centered around a large, detailed sarcophagus that spoke to the players when a switch was flipped. Inside was a miniature record player, and each side of the record containing twenty randomized instructions for the players to follow. My family and I spent many hours listening to the spooky voice telling us to avoid the Slimy Snails of Aro, the One-Eyed Giant Mandrill, the Unholy Snakes of Amon, or the Death brought on by the Screeching Green Pestilence. <br/><br/>Unfortunately, my game is over forty years old now, and the record player hasn’t worked for many years. Rather than paying someone to fix it, I made a little iOS app to play randomized messages in its place.<br/><br/>Flip the switch on the sarcophagus to play a random message. Tap the \"i\" icon in the lower-right, or press-and-hold to bring up a menu to flip the record for the second part of the game play. Hearing-impaired folks can even play the game now by turning on closed-captioning - read the instructions on the screen as the mummy says them!<br/><br/>TO PLAY the Voice of the Mummy game with this app, you will still need the physical board game and all its pieces; this app merely replaces the functionality that a broken record player can no longer provide.", "metacritic": null, "released": "2016-09-08", "tba": false, "updated": "2019-10-22T14:05:45", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b9913686221cb53768cfc093abee8ef_TBBZNIz.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ronald Logan"], "genres": ["Board Games"], "publishers": ["Ronald Logan"], "esrb_rating": null}