{"id": 269710, "slug": "deckromancy-trading-card-maker-craft-of-the-deckro", "name": "Deckromancy Trading Card Maker - Craft of the Deckromancer with Animated GIF / APNG foil Lite", "name_original": "Deckromancy Trading Card Maker - Craft of the Deckromancer with Animated GIF / APNG foil Lite", "description": "Deckromancy® allows you to be a Deckromancer™ and create, edit, save, and share your own trading cards and trading card skins easily with smooth and intuitive controls. <br/><br/>Your cards can be printed, or shared over social, email, messaging and more. Supports Animated GIFs or APNGs (Animated PNGs) for cards that use the animated foil feature. ( Learn more at APNGs.com )<br/><br/>Save your cards to your photo gallery or save them as .CARD files to reuse the card data for editing later. Save reusable .SKIN files to quickly make similar cards using the same custom graphics and layout and even make your own entire Trading Card Game! You can share your .SKIN and .CARD files with others. Just connect to your computer and use the File Sharing feature to transfer .CARD and .SKIN files to and from your device. You can also use File Sharing to import custom .PNG, .JPG, and .GIF files to be used as custom graphics in your skins. <br/><br/>In addition to the included card and symbol graphics, you can add your own custom card blanks and in-text symbols using .JPG, .PNG, or .GIF files. Text color and size can be customized as well. Custom symbols can even be set to be recolorable like text and scale to text size. You can resize and rotate text boxes and portraits with easy graphical controls. Add as many text and portrait objects as you want. You can set portraits to layer behind the card blank to make them work with transparent .PNG or .GIF blanks that use transparent \"cut-out\" areas for the portrait art. Portraits can be stretched to fit. To preserve images from distortion, portraits can also be snapped or cropped to fit. You can tap and hold card parts and hold to bring up a menu that lets you delete and change layer order of a part. There are many advanced text styling options to add text outlines, shadows, blur, bevel and more.( http://deckromancy.com/tutorial/markup ) Using these vast features, you can skin your own fully custom Trading Card Game! <br/><br/>Not just for TCG fans! Deckromancy has some built in sports skins for sports fans, baseball, basketball, football, volleyball, soccer, hockey, and golf. <br/><br/>Artists, designers, webmasters, and enthusiasts can use the custom skin feature to develop their own unique cards and games.<br/><br/>Deckromancy is a trademark of Compukaze LLC, registered in the U.S. Deckromancer is a trademark of Compukaze LLC.", "metacritic": null, "released": "2012-07-17", "tba": false, "updated": "2019-10-22T14:05:44", "background_image": "https://media.rawg.io/media/screenshots/c88/c88707319bca235d2d58f432e754cb0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Compukaze"], "genres": ["RPG", "Card"], "publishers": ["Compukaze"], "esrb_rating": "Everyone 10+"}