{"id": 269861, "slug": "air-flighter-galaxy-attack", "name": "Air Flighter: Galaxy Attack", "name_original": "Air Flighter: Galaxy Attack", "description": "== Air Fighter: Galaxy Attack == is the most intense shoot 'em up plane simulator 2018! Start your air defense flight, fulfill your warfare duty, complete the jet air strike mission, and fight in the epic boss battles to destroy the furious enemy forces and win the dogfight!<br/><br/>Air Fighter: Galaxy Attack on mobile devices are now popular among youngsters. Pictures of the brand new cars have been designed in a unique style. Military airplanes become play and enter the intense and exciting world of military games, shooting games, fighting games and become the greatest battle boss with this best aircraft. fly game!<br/><br/>FUNCTIONS:<br/><br/>== Add new games with weekly battles to battle other players<br/>== Raise your score with the 2018 plane shooter when the game is over<br/>== endless boss battle!<br/>== the level of beautiful design and role-playing environment!<br/>== Colorful HD graphics and lively characters!<br/>== Upgrade shields, guns, missiles and bombs on your jet!<br/>== Buy power-ups to cause much damage to enemy fighters in the plane fight!<br/>== Start air strikes save mooshmooland from invading evil elves!<br/>== Follow the Rikuto-sensei guide for you to win the air battle!<br/>== Increase your metal storm jet fighters to be the best plane shooter!<br/>== The board will let you immerse yourself in the vivid image with the level of mission to complete.<br/>== Many battles of commanders with the top flight when you download the legendary game<br/>== Many risky scenarios to rescue civilians in airplane crash<br/><br/>== Air Fighter: Galaxy Attack == is one of the best flying and shooting games, so if you are looking for a final flight simulator with countless head down bombing and shooting action, This cool fighting jet fight game is all you need!<br/><br/>Download Air Fighter: Galaxy Attack &amp; Enjoy it !!!", "metacritic": null, "released": "2018-03-18", "tba": false, "updated": "2019-10-22T14:05:50", "background_image": "https://media.rawg.io/media/screenshots/23d/23d85fa88737c9c35cb99901440b481d.jpg", "website": "http://bgamesworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ONEAPP GLOBAL ONE MEMBER COMPANY"], "genres": ["Action", "Arcade"], "publishers": ["ONEAPP GLOBAL ONE MEMBER COMPANY"], "esrb_rating": "Everyone 10+"}