{"id": 269893, "slug": "game-show-ai-la-trieu-phu-2017-who-wants-to-be-a-m", "name": "Game Show Ai Là Triệu Phú 2017 - Who wants to be a Millionaire", "name_original": "Game Show Ai Là Triệu Phú 2017 - Who wants to be a Millionaire", "description": "Ai La Trieu Phu 2016… trò chơi trí tuệ free 100% đã chính thức có mặt trên Mobile. Game Ai la trieu phu là một game mô phỏng Gameshow Ai là triệu phú do VTV3- đài truyền hình Việt Nam thực hiện. Tựa game dựa trên Game Show Ai Là Triệu Phú nổi tiếng. Ai La Trieu Phu 2016 sẽ mang tới cho người chơi những trải nghiệm tuyệt vời và mới mẻ như đang ngồi trên ghế nóng.<br/>Với Ai La Trieu Phu 2016 người chơi được tiếp cận với rất nhiều kiến thức bổ ích trong mọi lĩnh vực. Nó còn giúp nâng cao sự hiểu biết về tiếng Anh-điều đó thật tuyệt vời. Lối chơi quen thuộc nhưng đầy hấp dẫn và thử thách với độ khó tăng dần.<br/><br/>***Ai La Trieu Phu 2016***<br/>- Với hàng ngàn câu hỏi để bạn vượt qua.<br/>- Trong game có giọng nói người dẫn chương trình MC Lại Văn Sâm rất quen thuộc.<br/>- Hoàn toàn miễn phí, No SMS. Cài đặt một lần và chơi mãi mãi.<br/>- 4 sự trợ giúp hữu ích cho bạn.<br/>- Đồ họa sống động, âm thanh trung thực.<br/>- Ngân hàng câu hỏi đồ sộ với hơn 90.000 câu hỏi được cập nhật liên tục và chính xác.<br/> - Hệ thống câu hỏi đa dạng, phong phú, được sắp xếp ngẫu nhiên và được phân loại từ dễ đến khó.<br/>- Giao diện hoàn toàn mới.<br/>- Hỗ trợ tất cả kích thước màn hình.<br/>- Với bảng xếp hạng Online, bạn thoải mái khoe tài cùng bạn bè và mời bạn bè cùng chơi. <br/>Hãy thử tài cùng Ai La Trieu Phu 2016 để chinh phục thử thách và nâng tầm tri thức !<br/><br/>Nếu bạn có góp ý nào thì có thể truy cập đến fanpage: http://facebook.com/StudioGameFree.<br/>Rất mong được sự đánh giá của các bạn để game tốt hơn.<br/>Chúc mọi người có những giây phút vui vẻ bên Game.", "metacritic": null, "released": "2016-07-19", "tba": false, "updated": "2019-10-22T14:05:52", "background_image": "https://media.rawg.io/media/screenshots/cb3/cb3e3b858609b268c8bbb26c1e2a634e_MU0EDVl.jpg", "website": "http://facebook.com/StudioGameFree", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ONEAPP GLOBAL ONE MEMBER COMPANY"], "genres": [], "publishers": ["ONEAPP GLOBAL ONE MEMBER COMPANY"], "esrb_rating": "Everyone 10+"}