{"id": 269818, "slug": "starcle", "name": "Starcle", "name_original": "Starcle", "description": "Starcle is a unique puzzle game never seen before. It seems to be easy on the first glance but be warned, it's one of the hardest puzzle games of all times. No jokes. Are you up to the challenge?<br/><br/>Feature overview:<br/>» Metallic machine style design, music and effects to set a real hardcore mood<br/>» 240 levels to keep you in this mood for a long-long time...<br/>» Smart handling made simple – play with one finger or touch continuously with more<br/>» Language independent – no need for text, just play<br/>» iCloud support to never loose your progress<br/><br/>Let us know your thoughts!<br/><br/><br/>~~~~ Hungarian description / Magyar leírás ~~~~<br/><br/><br/>A Starcle egy eddig soha nem látott egyedi puzzle játék. Első pillantásra egyszerűnek tűnik, de vigyázz, ez minden idők legnehezebb puzzle játékának egyike. Nem vicc. Készen állsz a kihívásra?<br/><br/>Főbb tulajdonságok:<br/>» Fémes gépszerű dizájn, zene és effektek, melyek igazi hardcore hangulatba ejtenek<br/>» 240 pálya, hogy hosszú-hosszú ideig ebben a hangulatban tartson...<br/>» Egyszerű, de nagyszerű kezelés – játssz egy ujjal, vagy folyamatos érintéssel többel<br/>» Nyelv független – nincs szükség szövegre, csak játssz<br/>» iCloud támogatás, hogy az eredményeid mindig meg legyenek őrizve<br/><br/>Oszd meg velünk a véleményed!", "metacritic": null, "released": "2015-01-05", "tba": false, "updated": "2019-10-22T14:05:48", "background_image": "https://media.rawg.io/media/screenshots/bb3/bb3425377abda9528488791719b133f9.jpg", "website": "http://www.sntapps.com/starcle", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tamas Mile"], "genres": ["Puzzle"], "publishers": ["Tamas Mile"], "esrb_rating": "Everyone 10+"}