{"id": 269808, "slug": "living-legends-bound-by-wishes-a-hidden-object-m-2", "name": "Living Legends: Bound by Wishes - A Hidden Object Mystery (Full)", "name_original": "Living Legends: Bound by Wishes - A Hidden Object Mystery (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>Your husband Jack travelled back to the town of Wishville to fulfill a long-standing debt, and assured you he wouldn’t be gone for too long. But when he doesn’t come home after a few days, you follow in his footsteps to find out what happened. Upon arriving at the town though, you discover this place isn’t the dream come true that it once was. It’s now turned into an absolute nightmare!<br/><br/>• WHO COMMANDS THESE EVIL ROSES?<br/>The city is completely overrun by choking vines, trapping everyone inside. Is this the price of this fairy-tale community, or is the Mayor up to something much more sinister?<br/><br/>• FULFILL THE WISHES OF THE RECENTLY DEPARTED<br/>Help these lingering souls through enchanted hidden object scenes.<br/> <br/>• USE THE MAGIC CASKET TO EXPLORE THE CLUES<br/>Unlock the mysteries of the past by solving strange puzzles and magical mini-games.<br/><br/>• EXPLORE JACK AND GRACE’S BACKSTORY IN THE BONUS GAME<br/>Go back to the beginning of this tale and enjoy additional Collector’s Edition exclusives including collectible Roses, morphing objects, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-09-07", "tba": false, "updated": "2019-10-22T14:05:47", "background_image": "https://media.rawg.io/media/screenshots/4dc/4dca0aac51c3a17064f2f49d8f2dbf48.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}