{"id": 269970, "slug": "our-adventure", "name": "Our Adventure", "name_original": "Our Adventure", "description": "<p>Created with RPG Maker MV for the Indie Game Maker Contest 18.<br/>This game is an joint project by zelgadis85 and Punamaagi.<br/></p>\n\n<p>You and your sister have come to the town of Alea to become adventurers -- people who search ancient ruins, discover new things and generally go on adventures. However, your entry to the adventurer's guild is denied. When talking to the innkeeper about this, she sends you off to retrieve a scroll from the cellars. Little do you know that this mundane quest begins your new life as full-fledged adventurers, and perhaps, you might play a larger role in the disturbing events that have plagued the town lately...<br/></p>\n<p>Features:<br/></p>\n<ul><li>Select from five different classes and recruit adventurers to go on a journey with you!</li><li>Level up your characters up to level 30!</li><li>Three different difficulty levels of play, allowing both beginners and veterans alike to feel right at home when playing. See table below for more information.</li></ul>\r\nCasualNormalVeteranDefeatRetry or revive in town with no costRetry or revive in town with half goldRetry or return to title screen<br/>SleepingFreeCosts 5 gold / characterCosts 5 gold / character levelHealingFull healing after battles (including conditions)Heal 10% Life and Mana after battles. Conditions not curedNo healing after battles\r\n<p>Controls:</p>\n<ul><li>Arrow keys -- Move around.</li><li>Enter -- Action / confirm.</li><li>Escape -- Menu / cancel.</li><li>Page Down -- Fast forward text.</li><li>T -- Return to town quickly from dungeons (requires an Escape Rope).</li><li>J -- Open Quest Journal (only available in dungeons).</li><li>F2 -- Switch between Framerate Counter / Web Latency / no display.</li><li>F4 -- Toggle fullscreen.</li><li>F5 -- Prompt to restart the game application.</li></ul>\n<p>You can also opt to use the WASD control scheme. Please refer to the game options menu for this.<br/></p>\n<p>System requirements:</p>\n<ul><li>OS: Windows 7 / 8 / 8.1 / 10 (32bit / 64bit)</li><li>CPU: Intel Core2 Duo or better</li><li>RAM: 2GB or more. 4GB preferred for smooth gameplay.</li><li>HDD: The game requires around 500MB of free disk space.</li><li>Graphics: DirectX 9 / OpenGL 4.1 capable GPU </li><li>Display Resolution: 1280x720 or higher. If you have trouble with the resolution, consider playing the game in fullscreen by pressing F4.</li></ul>\n<p><strong>Notice: This game is a prototype and is by no means completed.</strong> It is completely playable from beginning to end, but it doesn't have all the content we (the creators) have in mind. During the jam judging process, no visible process will be uploaded, but we will continue to fine-tune and add new content to the game. After the judging finishes, we will upload a new version. Stay tuned!</p>\n<p><strong>And while I hate to ask this, but if you enjoyed the game, consider voting for it.</strong> I'd also be delighted for any reviews, so keep 'em coming! (<strong>Bugs, should they exist, will be fixed after the judging is over)</strong></p>", "metacritic": null, "released": "2018-11-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f6b/f6befe88b9bcc81a986379b786796fcd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zelgadis85", "Punamaagi"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}