{"id": 269951, "slug": "welcome-to-hell-mei-ichikawa", "name": "Welcome to Hell, Mei Ichikawa", "name_original": "Welcome to Hell, Mei Ichikawa", "description": "<p><strong>  \"What happen after people die? Could you.. ever see  them again?</strong><br/>The story is about Mei, an ordinary teenage girl. She is living a peaceful life with her mother, but. Dark covered her fate after she and her mother had a terrible Car accident which also robbed Mei's mother from her forever.<br/><br/>Mei however, survived by some mystic miracles, she cannot bear the cruel fact and the loneliness. Mei has chosen  to suicide to escape reality life.<br/>However, that's when she discover there is another world where is always right there but she just never knew about it. A world for the deads. A world filled with Strange Things, Strange Characters, Invaluable Treasures...<br/><br/>A world where  - perhaps, Mei could have a chance to see her dear mother again, once more time...\"</p>\n\n<p><strong>A product by @Isabella Ava</strong><br/>Many thanks to Yanfly, SrdDude, Hime, Gamefall Team, MrTrivel, MogHunter, HiddenOne, Pandamaru, Avery, Triaconate, Tsukimi, Futokoro, Freepik, Galv, Whtdragon, Kadokawa &amp; many others</p>\n<p><em>Welcome to Hell, Mei Ichikawa</em><em>: is an JRPG game made in 1 month for the IGMC2018<br/>* Known issues:<br/>- inbalance<br/>- some NPC has not perform their function yet<br/>- Items does not has proper description<br/></em></p>\n<p><em>* Please comment if you have any suggestion or problem, thank you ;)</em><br/></p>", "metacritic": null, "released": "2018-11-29", "tba": false, "updated": "2019-08-28T23:19:24", "background_image": "https://media.rawg.io/media/screenshots/7a7/7a7f099f82ce576b0336b42602af4346.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Isabella Ava"], "genres": ["RPG", "Platformer"], "publishers": [], "esrb_rating": null}