{"id": 269902, "slug": "slide-my-car-2016", "name": "Slide My Car 2016", "name_original": "Slide My Car 2016", "description": "Slide My Car Tired of sliding blocks puzzles with the old and dull design? Then this is for you.<br/>Here comes Car Unblock. <br/>The goal of this game is to solve the traffic jam in the car parking by moving the red car out of the chaos.<br/>Slide My Car is a simple and addictive puzzle game. The goal is to unblock the purple car out of the board by sliding the other blocks out of the way, unblock it with the minimal moves. Slide My Car Comes With 4 Ranging from Beginner to Expert Difficulties. There are many puzzles in total, the amount of puzzles Highest you'll find in any game, worth Hundreds of hours to keep you challenged and addicted.<br/>With 2 game modes in Unblock Me, you can challenge yourself in challenge or choose to just lay back and relax while solving puzzles. In Challenge mode each puzzles has 3 stars to earn, adding replay value than you can always try to get all 3 star in every puzzle. A ranking system and Achievements to keep you added also challenged more even level. Be the King of Logic and train your brain daily.<br/>The same Unblock Me in many schools used past tense to ask for their help Improve Students with studies in classes. Unblock Me can help you train your brain and keep you fit everyday of mental. It được one of the top games for 4 years and have created the category of Unblock puzzle games where other follow. This puzzle game is for kids and adult of all ages, play by yourself or challenge buddies to compare của bạn moves. Line up and have fun with your Flickr buddy :)<br/>Features: <br/>- 3 wonderful themes.<br/>- 2650+ puzzles into 4 Levels! <br/>- Elegant themes <br/>- Moves count <br/>- Sound effects <br/>- Built-in help<br/>- In-app<br/><br/><br/>If you would like to see this app translated in your language, please email us.<br/><br/>Support and Feedback : <br/>If you have any technical problems please email us at studiogamefree2015@gmail.com <br/>Please include the app's version, device information and a screenshot if possible. <br/><br/>Like us on FACEBOOK! <br/>Http://facebook.com/StudioGameFree", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2019-10-22T14:05:52", "background_image": "https://media.rawg.io/media/screenshots/338/338d06b94529ed5007ce5b9fd76b1d46.jpg", "website": "http://facebook.com/StudioGameFree", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ONEAPP GLOBAL ONE MEMBER COMPANY"], "genres": ["Action", "Puzzle"], "publishers": ["ONEAPP GLOBAL ONE MEMBER COMPANY"], "esrb_rating": "Everyone 10+"}