{"id": 270038, "slug": "moments-in-time", "name": "Moments in Time", "name_original": "Moments in Time", "description": "<p>Moments in Time is a 2D action-platformer where you can manipulate time to your advantage. Armed with this power and your trusty weapon, you must delve deep into the maze-like ruins of Chronicle Lab and prevent time from breaking apart! From spitting ceiling monster, to a stone statue that ONLY moves when you rewind time, each and every hostile creatures in this lab presents a different challenge you've never seen before. Earn new power and upgrades to make yourself stronger, then face the bosses deep within the darkness.</p>\n\r\nKEY FEATURES:\r\n2D-PLATFORMER MEETS TIME MANIPULATION\r\n<p>Explore the disastrous Chronicles Lab! Before everything gone wrong, this facility was the main hub of every research related to time and ages, including the rumored Portable Time Machine. Now, its hallways are filled with loose experiments: prehistoric animals, mythical beasts, terror monsters... you name it. With the power of time at your fingertips, nothing can stop you from undoing this catastrophe!</p>\r\nRICH NON-LINEAR GAME WORLD\r\n<p>Entire Chronicles Lab is now a one giant level, separated only by doors and rooms. Some pathways may require you to earn new powers to pass through, while others may take you back to other area. You never know what lurks in the darkness.</p>\n\n<p>Will you be able to master time, or will time destroys you? The Chronicles Lab awaits...</p>", "metacritic": null, "released": "2018-11-29", "tba": false, "updated": "2019-08-28T23:19:23", "background_image": "https://media.rawg.io/media/screenshots/0b4/0b4d5b1d823ec004be8e43d677db3978.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FFaUniHan"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}