{"id": 270296, "slug": "ocpedia-best-online-casino-real-money-finder-by-on", "name": "OCPedia - Best Online Casino Real Money Finder by OnlineCasinoPedia", "name_original": "OCPedia - Best Online Casino Real Money Finder by OnlineCasinoPedia", "description": "<p>Online Casino Pedia (OCPedia) helps gamblers and players find the most reliable, trusted and best online casino real money sites for different countries and regions.</p>\n<p>Players can filter the casinos based on their location, their requirements, the gaming software being used at the casino website, for example, Microgaming casinos, Netent casinos etc.</p>\n<p>Apart from finding the best online casinos, players can also:</p>\n<p>* Find the best online casinos for real money according to geo-location.<br/>* Find real money online casino sites based on requirements<br/>* Filter the casinos according to location, software being used on casino and payout methods.<br/>* Compare online casinos and decide the best one.<br/>* Read public reviews and analyze casino ratings.<br/>* Get to choose the editor's choice and user's choice casinos.<br/>* Read in-depth reviews of online casinos.<br/>* Contact us with your requirements and we will get back to you with the best choice for you.<br/></p>\n<p>We try to help all the players as much as we can. There is a lot more to come, so, stay tuned with us and enjoy the best and trusted advice related to online gambling.</p>\n<p>Currently we support almost all the major regions like USA casinos, Online Casino UK, Ireland, UAE Casinos , Canada, New Zealand, Germay etc.</p>\n<p>This app is presented by Onlinecasinopedia.com</p>", "metacritic": null, "released": "2018-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2d5/2d5a4c6693fa2a12b6c27cd76fd115ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["tickingclockstudio"], "genres": [], "publishers": [], "esrb_rating": null}