{"id": 27022, "slug": "super-metroid", "name": "Super Metroid", "name_original": "Super Metroid", "description": "<p>After having defeated Mother Brain, the leader of the Space Pirates who wanted to use alien creatures known as Metroids to dominate the world, the bounty hunter Samus Aran took the fight to the Metroids&#39; homeland and eradicated them. Only a single Metroid larva remained. Samus took it to a galactic research station, and scientists assured her that the powers of the larva can be harnessed to help people. However, everything goes wrong when a dragon kills the scientists, takes away the larva, and destroys the research facility. Samus follows the dragon to the planet of Zebes, where she fought Mother Brain before. She must explore the dangerous planet, stay alive, and figure out a way to retrieve the larva.</p>\n<p>Super Metroid is a platform game and a follow-up to Metroid II. Like the previous games in the series, it is not divided into separate levels; the planet Zebes is an open world which Samus traverses back and forth. This world is divided into rooms separated with doors which must be shot to be opened. Shooting is also used to open up secret passages, some of which contain nifty bonuses, but finding most of them is required to proceed in the game.</p>\n<p>There are many items to find on the way, and each new item usually makes heretofore inaccessible areas available to Samus. The items include both weaponry (such as missiles, super missiles, or upgrades to Samus&#39;s standard laser gun), energy tanks that increase Samus&#39; max health, and other gadgets (like a grappling hook that allows Samus to stick to the ceiling).</p>\n<p>There are various enemies - alien fauna - lurking around planet Zebes. The enemies all respawn after re-entering a room, though Samus&#39; increasing capabilities mean that they become easier to defeat as the player makes progress. After killing them, the enemies typically leave behind some health or ammo.</p>", "metacritic": null, "released": "1994-03-19", "tba": false, "updated": "2024-03-06T03:04:23", "background_image": "https://media.rawg.io/media/games/fc9/fc9bb16db9714d3731823fb0bf706533.jpg", "website": "https://www.nintendo.com/games/detail/AFZxlJ-lH5fU_h4Q79V3dOpdT9k4EU1N", "rating": 4.36, "rating_top": 5, "added_by_status": {"yet": 79, "owned": 194, "beaten": 333, "toplay": 88, "dropped": 89, "playing": 29}, "playtime": 6, "achievements_count": 0, "ratings_count": 379, "suggestions_count": 384, "game_series_count": 13, "reviews_count": 387, "platforms": ["Wii U", "Nintendo 3DS", "Wii", "SNES"], "developers": ["Nintendo", "Intelligent Systems"], "genres": ["Action", "Shooter", "Adventure", "Platformer"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}