{"id": 270268, "slug": "make-him-fall", "name": "Make Him Fall", "name_original": "Make Him Fall", "description": "<p>Make Him Fall is a 1 vs 1 2D platformer game in localhost. The host will play the role of the guardian of the lighthouse and the treasure in it. He will have to activate traps to make fall the pirate in the water which floods the lighthouse. The guest will have to pay attention to traps and the rise of the water to not finish drowned ! It's a race against time to steal the treasure of the lighthouse !</p>\n<p>In this project I was the lead Programmer due to my experience in UNREAL engine. I've developped the network and gameplay of each character with the help of the other developpers.</p>\n<p>The team was composed in 5 peoples : 1 Game Designer, 1 Game Artist and 3 Gameplay Programmer (including me, the only one who knows UNREAL). This game has been realised in 2 weeks. The context was a game jam session organised by my school at the beggining of class to meet the other students and learn to quickly work in team.</p>\n\n<p>---------------------------------------------------------------------------------------------------<br/></p>\n\n<p>Make Him Fall est un jeu de plateforme 2D multijoueur en réseau local, 1 contre 1.  L'hôte de la partie incarnera le gardien du phare qui devra activer des pièges pour faire tomber le pirate, dans l'eau qui monte au fur et à mesure du temps qui s'écoule. Celui qui rejoindra la partie sera le pirate. Il devra faire attention aux pièges (il ne voit pas le gardien les activer) et à l'eau qui monte pour ne pas mourir noyé ! C'est une course contre la montre pour récupérer le trésor du phare !</p>\n<p>Dans ce projet j'avais le rôle de Lead Programmer compte tenu de mon expérience sur le moteur de jeu utilisé pour la réalisation de celui-ci : UNREAL Engine. J'ai géré la partie réseau, ainsi que le gameplay asymétrique et les différentes mécaniques du jeu où j'ai pu aider mes collègues. </p>\n<p>Nous étions une équipe de 5 composée de 3 programmeurs (dont j'étais le seul à connaître unreal), d'une graphiste et d'un game designer/level designer. Ce projet a été réalisé au cours d'une Game Jam de 2 semaines, organisée par mon école en début d'année, pour apprendre à se connaître tout en arrivant à travailler rapidement et efficacement en équipe.<br/></p>", "metacritic": null, "released": "2018-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dc7/dc7cdc49392fc42488d94a77bbd85861.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poligaming"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}