{"id": 270317, "slug": "heartland-itch-faye-valentine", "name": "Heartland (itch) (Faye Valentine)", "name_original": "Heartland (itch) (Faye Valentine)", "description": "\"(...) <em>As you enter its realm, the whispering wind tells you of unspoken, ghostly tales of the past. Though you don't notice. Welcome.</em>\" \r\nSynopsis\r\n<p>\"You walked unspeakable distances, until you found this peculiar forest. A glade immersed you in peace. As you kept walking, you found a place full of life—Heartland. Everything here gives you the peace you have been craving for. Yet you keep trying opening your eyes. You do not remember anything about yourself. If you do open them, you will get to see the truth. And sometimes, the pitch-black darkness is a better place to stay in.\"</p>\r\nThe Game\r\n<p>Heartland is a <strong>narrative-based, story-rich, psychological-esque, linear RPG with a different take on battles</strong>. The gameplay is rather straight-forward, being based solely on the completion of the story. Though to make it to the end, you'll first have to face off familiar faces from your past through one-in-one, strategical, meaningful and decisive battles.</p>\n<p>All the events of the game and your actions are <strong>narrated</strong> in a second person point of view by a narrator. Through him, you will get to know the mistery amongst Heartland—and you yourself.</p>\n<p>The game heavily focuses on atmosphere to engage the player into the narrative, relying upon a plethora of nature sounds, beautiful scenarios and excellent background music which will take you in a singular journey to the discovering of the <strong>very truth.</strong></p>\n<p>Battles have a peculiar twist, in which classic commands such as \"<em>attack</em>\", \"<em>guard</em>\" and even \"<em>items</em>\" are<strong> completely removed</strong>. Instead, you will get to choose between physical<strong> </strong>(<strong>Swordplay</strong>) and magic (<strong>Sorceries</strong>) techniques, as well as the  <strong>Remnants</strong> <strong>bequeathed </strong>from <strong>your enemies,</strong> as you <strong>defeat them</strong>. Each opponent is a <strong>boss-like fight</strong>, and you will have to find the best skill composition to a strategy in order to defeat your foes.</p>\n<p><strong>Heartland features no gameover</strong>, but the game won't advance until you win.</p>\r\nAuthor Notes\r\n<p>What a ride. After eight (8) years using this program, I finally get to finish something. <strong>That is, my very first game</strong>. I will not make this a long wall of text with gratitudes and ramblings, but I've ought to say I'm quite pleased and happy. In day seventeen (17), due to a power shortage I lost almost all (only the maps survived) of my progress of this game (data corrupted), which by those times, was radically different.   As I lost everything and felt despair, this game idea occurred to me, thanks to certain words of a friend. I surpassed many, many obstacles; starting with the language barrier, which is mostly difficult because the game relies heavily on text; and going through other shenanigans, such as, well,<strong> having only thirteen days</strong> to finish this. Right now, as I write this, energy has just came back from a three-hours blackout, when I was finally uploading the game and had everything set up. Once again, I lost it, and had to rewrite all of this, and re-upload. It seems like destiny doesn't wants me to finish something lol.</p>\n<p>Anyways, thanks for reading. As my final words, I've to say that I have to <strong>thank </strong>to <strong>every single person</strong> that takes their time to m<strong>ake resources for the community</strong>, for people such as me who can't draw for crap, or cannot compose a do-re-mi. Both who sell it and give it away for free.  Really, thanks guys.</p>\n<p>And, even if narcissistic, I've got to say I'm proud of myself because, jesus, <em>f*ck!ng</em>, christ, really? yet another power shortage just in the last second?</p>\n\n<p><strong>P.S: </strong><strong>Fullscreen </strong>(press <strong>F5</strong>!) and <strong>Headphones</strong> are recommended for a <strong>best game experience!</strong></p>", "metacritic": null, "released": "2018-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/22e/22e281bffb1e485baaf8086cce0dbaca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Faye Valentine"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}