{"id": 270303, "slug": "isekai-anthology", "name": "Isekai Anthology", "name_original": "Isekai Anthology", "description": "Welcome to Volume 1 of the Isekai Anthology!\r\n\"Seriously, there is a Catgirl Maid Cafe in the Forest!\"\r\n<p>One <strong>NEET </strong>meets one <strong>BUS</strong>, and you already know the rest! It happens over and over, but this time the poor hero, Hirito, inherited a Maid Cafe of Catgirls! What could possibly go wrong? Scratch that, what <em>couldn't</em> go wrong?</p>\n<p>Deep in the Waldorf Forest, there is a Catgirl Maid Cafe, no really there is. The Kami himself sent forth a new manager to help the cat-girls save the cafe, <strong>Nyaah? Please!</strong>, from a policy of tax foreclosure. Join Hirito as he rediscovers lost Maid Cafe recipes, harvests for ingredients, and, most importantly, finds lost cat-maids! Not to mention rumors of a demon world just on the other side of some portal. Is the Cat Maid Cafe really just a cafe, or is it something more?\r\n</p>\n<p><strong> BETA Notice!</strong> <em>Due to time constraints, holidays, and the flu this game is missing a certain amount of polish. Be prepared for a few bugs, and missing bits and bobs!</em></p>\n<p><strong>Features:</strong>\n</p>\n<ul><li>- Standard RPG Gameplay, turn based combat, plenty of dialogue, etc.\r\n</li><li>- Harvesting\r\n</li><li>- Crafting (well cooking…)\r\n</li><li>- A print style selection of cut-scenes\r\n</li><li>- Characters created with MangaMaker ComiPo\r\n</li></ul>\n<p><strong> \r\n</strong></p>\n<p><strong>The Cast:</strong>\n</p>\n<ul><li>Hirito - A “Neet” brought from another world.\r\n</li><li>Tax Collector - A gentleman that doesn’t want to foreclose at all.\r\n</li><li>Ren -The Number One Catmaid. (Self proclaimed)\r\n</li><li>Natsumi - Well, she has… Needs?\r\n</li><li>Tomomo - The singing cat-girl.\r\n</li><li>Minako - The pink haired cat-girl.\r\n</li><li>And more…\r\n</li></ul>\n\r\nThis is an entry for the IGMC 2018.\r\n\n<p>A personal note: I come down with a godawful case of the flu, and it really hampered development. Make sure you wash your hands after downloading!</p>", "metacritic": null, "released": "2018-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/259/259de8ac4baf5d8391801fe4ca48c13e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Failsauce GameWorks"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}