{"id": 270542, "slug": "my-big-brother-with-demo", "name": "My Big Brother With Demo", "name_original": "My Big Brother With Demo", "description": "<p>this is a port of a game on a website called gamejolt i wanted to add it here because i felt like it was alright. <br/></p>\n<p>story: you play as mark Edwardson who has gone to his dead brothers school to find out what went wrong and put a end to it, but something is going on at the school, you'll see soon.</p>\n<p>OK i just wanted to say that this game will be released in chapters sorta like the ink game if you know what i mean. but that is not what i wanted to say i just wanted to say if your game says unknown publisher turn off your screen security. don't worry it will not give you a virus. i swear.</p>\n<p>HOW TO USE THE GAME: use the left and right arrow keys to move your character and use the title screen. press the s button to select either the games or all parts. press the Shift Key To Make Your Character Jump. and to use your gun press the space button.</p>\n<p>fixed bugs:\r\ndie from falling Start Button\r\ngetting an crossbow\r\ndoors\r\nboss fights\r\neverything</p>\n<p>this is the final beta before the full release if you find any acounts go to one of my two channels: Green-gamer Aka Connor OR Thunder Tornado (A GAME STUDIO) heres one of the links: https://www.youtube.com/channel/UCzXFv5ZxPik38bOjWI2_ZrQ https://www.youtube.com/channel/UCLL3LFBHrSA_e8NJYIcESYA?view_as=subscriber</p>\n<p>the final alpha before the full game, on halloween if you guys see any bugs report them to me and i'll try to fix them in the final game.</p>\n<p>this game is complete, and the full game will be out on halloween this year.</p><p>Check Out the Original page: https://gamejolt.com/games/MyBigBrother/343134<br/></p>", "metacritic": null, "released": "2018-11-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f29/f2991a27e21e902e616b9490ea5d7841.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thunder Tornado Studios"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}