{"id": 270694, "slug": "exodemon", "name": "Exodemon", "name_original": "Exodemon", "description": "Exodemon is a fast paced first person shooter inspired by the 90s FPS golden age. You must make your way through of maze-like levels, destroying hordes of enemies and giant bosses with your monstrous abilities. Combining the destructive power of your symbiotic claws with a fast, sharp and fluid movement, you’ll become an indestructible alien killing machine. <br/> <br/>In Exodemon you play as a scientist in the edge of the universe who was infected by an alien entity. The symbiotic force is trying to take control, but you may find a way to control the beast on the confederation laboratories Resist the infection and blaze through various locations to reach the last escape pod before you lose what’s left of your humanity.<br/><br/>Features<br/><ul><li>Fast Paced First Person Shooter<br/>Tired of slug-like FPS protagonists? You are in the right place! Fast movement and sharp controls, no cover, no regenerating health and no reload time.<br/></li><li>Old School Feel<br/>Do you remember when games used to respect your intelligence? No hand holding in this game. If someone tries to hold your hand here, oh boy! Just tear them with your claws!<br/></li><li>Low Poly/Low Res Retro Graphics<br/>All the charm of the classic FPS is here, you can count the polygons yourself! All this combined with dynamic particles and high quality lighting.<br/></li><li>Awesome Hands From Hell<br/>This one is self explanatory, right? If you are infected by an alien entity, at least take advantage of its destructive power!<br/></li><li>Exciting Boss Battles<br/>At the end of each section of the game you must defeat a giant, full 3D, boss in order to continue your trail of destruction.<br/></li><li>Lots of exploration and secrets<br/>Here you will find carefully crafted levels with lots of paths and secrets to find. Each enemy of the game is manually placed, nothing of that procedurally generated schmuck.<br/></li><li>Full controller support<br/>Mouse and Keyboard are not your thing? (really? *sigh*) Well, you can play Exodemon with most controllers.</li></ul>", "metacritic": null, "released": "2016-04-26", "tba": false, "updated": "2021-05-14T03:49:35", "background_image": "https://media.rawg.io/media/screenshots/bfb/bfb67dd46a924857c9a343723d9ec2e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2}, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS", "Xbox One", "PlayStation 4"], "developers": ["kuupu"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Kuupu"], "esrb_rating": null}