{"id": 270657, "slug": "clatter", "name": "Clatter", "name_original": "Clatter", "description": "<p>Create and command your own customisable squads of fighting robots in this turn-based, arena tactics game.<br />\nStrategiseBuild your own squads from a variety of units, including Grabbers, Flippers, Mortars and more. Each one has its own strengths, weaknesses and synergies with other units.Take on EveryoneBuilt for multiplayer, there&#39;s an ever-changing roster of maps available across both deathmatch and control game modes. Take your squads and strategies online and pit them against other commanders in a bid to climb your way up through bronze, silver and gold leagues. Can you make it to the top?Career ModeThe single-player career mode puts you in the role of player-manager, building and battling with your team across season-long leagues. Build your team from the ground up: buy and sell units, mod their stats, and grab sponsorships as you strive to take your team from chumps to champs.Daily ChallengesA new challenge awaits you every day! Battle against the AI on random maps with pre-made squads, competing for the top score on the daily leaderboards.CustomiseChange your appearance as often as you change your tactics: make your commander and arena your own and pick from an ever-expanding collection of interactive items. With hundreds of possible combinations, you can be sure you&#39;ll stand out from the crowd.</p>", "metacritic": null, "released": "2018-12-10", "tba": false, "updated": "2019-10-31T08:09:04", "background_image": "https://media.rawg.io/media/screenshots/43f/43f86f5399868848c5563252cfc37998.jpg", "website": "https://clatter.facepunch.com/", "rating": 1.83, "rating_top": 1, "added_by_status": {"yet": 10, "owned": 321, "dropped": 1}, "playtime": 3, "achievements_count": 12, "ratings_count": 6, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Facepunch Studios"], "genres": ["Strategy", "Indie"], "publishers": ["Facepunch Studios"], "esrb_rating": null}