{"id": 270674, "slug": "lost-in-sky-violent-seed", "name": "Lost in Sky: Violent Seed", "name_original": "Lost in Sky: Violent Seed", "description": "<strong>Lost in Sky</strong> is a 2D platformer, where the player has one of the two characters with unique abilities to control. The player will seize the right moment to grab control over the relevant character and combine the heroes' abilities in the most effective way to overcome challenges, solve puzzles, and squash hordes of monsters.<br/><br/><br/><br/>Imagine an alternative future, where you are a Special Forces soldier. Shoulder to shoulder with a reliable partner you fight all kinds of enemies, mutants, robots, security devices, and, of course, bosses.<br/><br/><br/><br/>Cooperate with the partner to coordinate your actions, collect equipment, interact with the environment, and complete level-specific unique tasks! With the breathtaking story, extraordinary puzzles, and bosses that scare the dear life out of you, you will find the atmosphere of a great old-school action game surprisingly authentic.<br/><br/><br/><br/><br/><strong>Lost in Sky Features:</strong><br/><br/><ul><li>Dive into this fascinating retro-futuristic world, and it will fill you with cherished memories of the past and carry you away to the infinite and unexplored space. The original soundtrack creates the sensation of mystery and adventure.<br/><br/></li><li>Team level completion. Play together with your friends in a cooperative mode or summon an AI-controlled character.<br/><br/><br/><br/></li><li>The story told in comic book form is full of sudden twists, mysteries, and formidable enemies. <br/><br/><br/><br/></li><li>Hand-drawn and well-conceived levels in high detail. Made with love!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:39", "background_image": "https://media.rawg.io/media/screenshots/c85/c850062b5a515100753ed8b7665e6319.jpg", "website": "https://lostinsky.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 476, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Lost in Sky"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Lost in Sky"], "esrb_rating": null}