{"id": 270652, "slug": "starship-commander-arcade", "name": "Starship Commander: Arcade", "name_original": "Starship Commander: Arcade", "description": "Want to role-play as a serious and stoic commander? A brash and argumentative hard-ass? Or just troll the game every chance you get? The open dialogue system allows you to speak your mind freely, and the NPCs react accordingly.<br />\nCOMMAND YOUR STORY<br />\nWant to know more about your ship and the lore? Just ask Sergeant Sarah Pearson. Ready to blow things up? Just say &quot;Let&#39;s go.&quot; You command the story, at your pace and with your style, using a next-gen AI system developed by Microsoft and Human Interact. The future of adventure games is here, today.<br />\nACTION AWAITS<br />\nCommand the XR71, the galaxy&#39;s most advanced fighter, on a mission to infiltrate and destroy the Ecknian spy facility at all costs. Your choices and your performance determine who lives and who dies.<br />\nVISUALLY STUNNING<br />\nMade in Unreal Engine 4, and with outstanding visuals designed by AAA game industry veterans, STARSHIP COMMANDER has been meticulously crafted to have a lived-in feel. Mechanical engineers and experienced concept artists worked hand-in-hand to craft the rich universe which you will traverse.<br />\nSTARSHIP COMMANDER is a seated experience, and is comfortable for new and experienced VR players alike.<br />\nAvailable for Arcades on SpringboardVR</p>", "metacritic": null, "released": "2020-09-09", "tba": false, "updated": "2020-12-25T14:30:12", "background_image": "https://media.rawg.io/media/screenshots/482/4824c3617a95b7be0e3f348815535bd0.jpg", "website": "http://human-interact.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Human Interact"], "genres": ["Adventure", "Indie"], "publishers": ["Human Interact"], "esrb_rating": null}