{"id": 270673, "slug": "feud-new", "name": "Feud (new)", "name_original": "Feud (new)", "description": "<strong>Feud</strong> is a turn-based strategy game made by some guys you haven't heard of yet. Originally a board game designed by Dave Cordell, it's been polished and tweaked and generally mucked about with to bring it to the glowing screen you're reading this description on. Unless you printed it out? Think of the trees. Please.CONDENSED ABSTRACT STRATEGY<br/>Imagine chess, but on a four-by-four grid, where pieces are swapped rather than moved, each piece has its own special ability and--<br/><br/>OK, not so much like chess. What you can expect is a highly condensed little abstract strategy game which is easy enough to learn but quite tricky to get good at. The AI still beats us sometimes. The computers are winning. Please get good at Feud so we can beat them.FREE AND CROSS-PLATFORM<br/>Feud is free to play and has full cross-platform play between PC, Mac, Linux, iOS and Android. This means you can play Feud at your boring job, then on the bus on the way home from your boring job, then on your computer at home while you recover from your boring job.<br/><br/>Please note that we <strong>do not recommend</strong> playing Feud during your commute if you walk to work, especially if you live in a city with lots of open manhole covers which is pretty much what I imagine New York to be like. I dunno, I've never been.YOU HAVEN'T TOLD ME MUCH ABOUT THIS GAME YET, TO BE HONEST<br/>I'm not very good at this. Sorry. Anyway, look, the game's free and only a couple of hundred megabytes. You might as well, really.", "metacritic": null, "released": null, "tba": false, "updated": "2023-06-01T09:54:37", "background_image": "https://media.rawg.io/media/screenshots/ab3/ab3243bb300aa27af58636515a93070a.jpg", "website": "http://www.bearwaves.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Bearwaves"], "genres": ["Strategy"], "publishers": ["Bearwaves"], "esrb_rating": null}