{"id": 270765, "slug": "maaa", "name": "MAAA", "name_original": "MAAA", "description": "MAAA is werewolf game at South Korea. - They call it MAFIA game.<br/>MAAA is 3D TPP-multiplayer Game.<br/><br/><strong>Rule of MAAA</strong><br/><br/>During the day, all players discuss and vote for the player to execute.<br/>During the night, you can use the abilities of each job.<br/><br/><strong>Introduce Jobs in MAAA</strong><br/><br/>Maifa team<br/><br/>-Maifa : Mafia can kill other player at night. They shouldn't be seen as mafia. Mafia must be undetected and make the number of citizens less or equal to the number of Mafia teams. Good luck!<br/><br/>Citizen team<br/><br/>-Police : Police can see the location where the mafia killed the other player. Police need to go to that location and find the mafia that killed the other player. If you reveal yourself as a police, you should be careful because it could be a target for Mafia. Find Maifa and execution them all to win<br/><br/>-Doctor : Doctor can save the player that Mafia killed. Just before night, a note comes up to choose a player to save. If Mafia kills the player that the doctor chooses to save, it will come back to life in the morning. During the day, Doctor need to reason the player that Mafia is going to kill. Just like the police, if you reveal yourself as a doctor, you could be a target of mafia. During the play, find Mafia and execution them all to win<br/><br/>-Citizen : Citizens are the most important jobs in this game. Citizens must survive to the end and help the police and doctors. Citizens should not be instigated by the mafia, and they should find the mafia who is cheating and execute them all to win.<br/><br/><strong>How to win</strong><br/><br/>Mafia team : If the number of Mafia team is equal to or greater than the number of Citizen team, The mafia team wins.<br/><br/>Citizen team : If they execute all the mafia, The citizen team wins.", "metacritic": null, "released": "2018-12-17", "tba": false, "updated": "2019-08-23T12:11:20", "background_image": "https://media.rawg.io/media/screenshots/454/454e56a201342158138f6aad497a2d48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GD GameCompany"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["GD GameCompany"], "esrb_rating": null}