{"id": 270773, "slug": "paradise-city-vr", "name": "Paradise City VR", "name_original": "Paradise City VR", "description": "Welcome to Paradise City, the city that never sleeps. Prepare yourself for an amazing experience full of beautiful girls. While exploring area uncover multiple locations where you can meet and watch naughty girls. Feel like in real paradise. And one more thing - if you will enjoy some moment more then others, you can always slow down or stop animation whenever you want. So… are you ready to see all of this? <br/>\n<br/>\r\nEden Street<br/>\r\nEvery single step starts on this street. From this place, you can go whenever you want. You want to visit disco party? Not a problem. Or maybe you want to go on cruise ship and make the party there? We prepared all of this for you and... we still have a lot of more surprise. Just look around yourself and choose what you want to do next. A lot of fun is waiting for you here. Delight in all the possibilities to make your day (or night) better. <br/>\n<br/>\r\nDisco<br/>\r\nJoin the party in our big and pretty cool disco club. You probably know, that all girls love to dance. So be there and take pleasure from watching them on the dancefloor. Great music and big scene with partying girls will put you in good mood. Take a look on the dancefloor and find your favourite girl to observe.<br/>\n<br/>\r\nYour apartment<br/>\r\nSome girls are willing to meet you anytime you want in your own luxury apartment. All you have to do is choose one of this pretty girls and invite her. She will come immediately to see your spacious and elegant apartment. Spend a nice evening or even a whole night with chosen girl and have fun. If you want to meet some other girl, just invite new one to your place and have even more fun. <br/>\n<br/>\n<br/>\r\nTerrace<br/>\r\nIf you want to surprise the girl you invite to your apartment, just take her to the roof, to your own terrace where you have view of all city. This will make for sure an impression on her. Romantic atmosphere can make this date really hot... Relish this view with her, watch together sailing ships in the bay, show her stars on the night sky. Then you can take her to jacuzzi and spend really nice time watching her wet in water with bubbles… Now you have a great view.<br/>\n<br/>\r\nNightClub<br/>\n<br/>\r\nWho don’t like to watch dancing girls? Especially when the dance is made as a special show for men. All girls are nice to watch during the dance, but our girls are incredibly good at this. You will never be bored of watching their sexy dance moves… And to make you more satisfied they have few types of dances. They really like to be watched. What you can do? Just stay there and be happy to have around you so good and professional dancers.<br/>\n<br/>\r\nMusic Show<br/>\r\nIf you like hard music and party you should visit our music show. Public is going crazy! You can be with them and feel this rock atmosphere. To make this show more interesting for you, we created scene with sexy girls and great cars. Of course all of this with really cool special effects! What can be better?! You have to try this by your own.<br/>\n<br/>\r\nCruise ship<br/>\r\nRelish the slowly voyage on a blue water as you sail in marvellous bay with group of models. Taste a little bit of luxury with company of really sexy and selected girls. Just the best models, just for you, for whole cruise. Relax with them and just enjoy this journey with so stunning girls! <br/>\n<br/>\r\nFlight of airship<br/>\r\nYou want to try something totally different than you experience earlier? We have something spectacular for you. Join in our airship crew and look on impressive panorama under you. You can see a bird's-eye view and admire real existing locations of the world. You will see for example . Do not miss this opportunity!<br/>\n<br/>\n<br/>\r\nGame designed for HTC VIVE or OCULUS RIFT.", "metacritic": null, "released": "2018-12-14", "tba": false, "updated": "2019-08-28T21:50:33", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d12649eba192bb461c0d68363b12a9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlinoVR"], "genres": ["Indie"], "publishers": ["AlinoVR"], "esrb_rating": null}