{"id": 270753, "slug": "nemezis", "name": "Nemezis", "name_original": "Nemezis", "description": "Do you remember game Schizm? After many years we are comming back to Argilus planet. This time characters of the game are two tourists(Amia, Bogard) that goes on attractive planet. Seduced by promotional offer, hoping for enjoyable and relaxing rest. However beautiful and idyllic atmosphere are disturbed. In their journey they meet other tourists and unexplained, dangerous phenomena. There are rumors about machine called „Fist of Nemezis”, that is capable of bringing a peace to the planet. Save yourself and your companion by overcomming the threat that is destroying this planet. <br/><br/>Schizm 3 takes place on Argilus planet. Founded anomaly which put this world in two parallel dimensions.<br/>Each location has its own image in both dimensions. Places look alike, may vary, sometimes just in details. Some elements of locations exists in one and other dimension. Residents, with growing threat, started to build diffrent kinds of barriers that prevent from moving on the planet.<br/><br/>Gameplay is a mix of adventure and puzzles in beautiful scenes with dark elements. Playing characters alternately, can you solve all puzzles? By overcoming obstacles created by residents uncover more and more secrets of this world. As a tourist, we have been equipped with an electronic guide, whose help may turn out to be crucial in difficult situations. <br/><br/>Features:<br/><br/><ul><li>Charming adventure game with puzzles.<br/></li><li>Explore beautiful, various, a bit dark land of Argilus planet, get to know its story.<br/></li><li>Two dimensions of the planet, locations in two parallel worlds.<br/></li><li>Carry Amia and Bogard, find out if rumor about machine called “Fist of Nemezis” are either true or made up.<br/></li><li>Solve the puzzles in non-linear way, keeping action going.<br/></li><li>Electronic guide, that helps in difficult times.</li></ul><br/>Developed with Unreal Engine.<br/><br/>General desinger and creator: Roland Pantoła.<br/><br/>Precursor of video games in Poland. 30 years in branch. First games made in 1998. Founder of group and then company „Detalion”.<br/>Main desinger and creator of many games at world class level such as: AD 2044, Reah, Schizm 1, Schizm 2, Sentinel. Worked also as enviroment artist with games: Bulletstorm, Enemy Front, Sniper: Ghost Warrior 2.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:35", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 7, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lab"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Lab"], "esrb_rating": null}