{"id": 270756, "slug": "football-director-2019", "name": "Football Director 2019", "name_original": "Football Director 2019", "description": "Football Director lets you choose from over 200 teams from 20 Leagues across Europe. Compete in your domestic league all the way through to the European main stage. Customise you teams training schedual, tactics and formation to be the best in the League. Can you handle the pressure of being the best manager in Europe?Key Features<br/><ul><li>Extensive database of English and European divisions and clubs</li></ul><ul><li>Play through Domestic and European Cups</li></ul><ul><li>In Depth Transfer market, lets you search for the exact player you need to boost your squad</li></ul><ul><li>hortlist player feature lets you keep track of the super star players</li></ul><ul><li>News hub and notification system keeps you up-to-date with club and fixture information</li></ul><ul><li>Customise the teams training schedule, and tailor individual regimes for your key players</li></ul><ul><li>Select your match day formation from over 20 pre-set formations.</li></ul><ul><li>Customise your teams tactics, from aggressive man-to-man marking to offside trap and many more!</li></ul><ul><li>Real-time 2D match engine lets you watch the action unfold, make key substitutions, on the fly tactic calls</li></ul><ul><li>Extensive match commentary lets you key an eye on whats going on throughout the game</li></ul><ul><li>Real-time League tables lets you see where you are mid Game.</li></ul><ul><li>In-depth game editor lets you edit club and player stats</li></ul>", "metacritic": null, "released": "2018-12-14", "tba": false, "updated": "2019-08-28T21:50:34", "background_image": "https://media.rawg.io/media/screenshots/517/517287da9ce251531944be86d0990ec4.jpg", "website": "http://www.alternativesoftware.com/footballdirector2019/footballdirector2019.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alternative Software", "Sports Director"], "genres": ["Simulation", "Sports", "Casual", "Indie"], "publishers": ["Alternative Software"], "esrb_rating": null}