{"id": 270777, "slug": "fight-or-flight-2", "name": "Fight or Flight", "name_original": "Fight or Flight", "description": "A Large-scale multiplayer monster hunting shooter game. Featuring multiple game modes including Battle Royale modes.<br/>Also including full offline support with bot ai for practice!<br/><br/><br/>With each passing day the situation grows more and more dangerous as the virus continues to spread, infecting or killing everything in its path.<br/>You are a specially trained operative that will drop into the infected region via an air-drop and attempt to recover research on the virus and eradicate any of the infected that remain in the region.<br/><br/>The world is now sprawling with infected monsters and zombies. Be careful out there!<br/><br/><br/><br/><br/><br/><strong>Multiple Game Modes</strong><br/>The game features multiple game modes with different objectives. In each mode the player will gain experience in the form of an in-game currency. This can be obtained from completing objectives, killing and harvesting monsters, killing zombies, and killing other players. Currency can then be used to purchase in game cosmetics.<br/><br/><br/><strong>Extraction</strong>, At the start of the match extraction points are spawned at random locations on the map. Slay monsters and harvest them to obtain research on the virus. Once a monster is harvested the player will be given a temporary power up rune that aids them in combat for a short time.<br/>Players get 3 lives, and 60 minutes to gain objectives and extract. Extraction points must be powered up before extracting. If you die you will lose all current progress in the match. <br/><br/><strong>Battle Royale</strong>, with a monster hunt twist. Battle it out in a classic Battle Royale mode but with the added intensities of Monsters and Zombies. <br/><br/><strong>Drop Zone</strong>, Fast paced Battle Royale with limited respawns. Each player will drop into the level with 3 lives. At the end of the match the last hunter standing wins.<br/><br/><br/>*All game modes will feature duo modes. This feature has not been added yet, but will be the top priority when early access starts<br/>**All modes can be played with or without AI, and at any time of day. All modes also support offline play or host your own servers, however experience is only counted on official servers.<br/><br/><br/><br/><br/><br/><strong>Weapons and Attachments!</strong><br/>Fight or Flight was built with realistic weapon ballistic simulation for a tight shooter experience.<br/><br/>Your hunter can carry 1 weapon of each class (Pistol, Assault, Sniper), for a total of 3 weapons, and 1 melee weapon, which every hunter will start with.<br/><br/>Each weapon has unique damage, recoil, and bullet flight characteristics, including a penetration and ricochet system. <br/><br/>Each weapon can have a barrel attachment, such as a compensator or suppressor and a sight or scope attachment depending on the weapon. (weapon attachments will be expanded on through the course of development, with plans for more barrel attachments and magazine attachments) <br/><br/><br/><br/><br/><br/><strong>Built on amazing tech!</strong><br/>Fight or Flight is built on the latest version of Unreal Engine. Utilizing modern technologies and crafted with relentless passion for multiplayer shooters. Designed for the ultimate realistic fps experience, with realistic ballistics simulation, modern sound using binaural audio, and breathtaking graphics with features such as volumetric fog and a day cycle that changes as the match progresses. <br/><br/>Full support right off the bat for Nvidia Highlights, Capture your victory using Highlights and upload instantly!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:20", "background_image": "https://media.rawg.io/media/screenshots/1c3/1c34c3d079dcbffaf392bbf2a1feb6e8.jpg", "website": "http://fight-or-flight.webflow.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Outer Planet Studios"], "genres": ["Action"], "publishers": ["Outer Planet Studios"], "esrb_rating": null}