{"id": 270813, "slug": "dr-darkness-dark-warrior", "name": "Dr. Darkness - Dark Warrior", "name_original": "Dr. Darkness - Dark Warrior", "description": "Join the nail-biting, dazzling and captivating rpg 2d platform sidescroller, and you’ll have a new hack and slash game. In the dark evil world, the black magician had hit the ashes and whispered his magical words. With a frightening sound, the sun started to get covered with scary dusty dark clouds. The darkness and shadows started taking over the whole world. Use the powerful Dr .Darkness and showcase your heroics. It is needed to save the world from the undeniably dangerous force of the evil!<br/> <br/>THE WORLD IS CONDEMNED<br/>Before you start this 2d rpg jump and shoot adventure platform game, get to know with the story and mission. The dark and shadow sorceress had condemned the world to darkness and cursed the light. Everything is controlled by the landlord and in order to protect the darkness, he had produced creatures with special powers of his own and landed in the dark. <br/> <br/>DR DARKNESS – A DESTINED MULTI-SKILLED SUPERHERO<br/>The landlord's soldiers need to be destroyed and the landlord needs die so that the world could regain the light and see the sun. There is only one person able to do this, the brave warrior named the Dr. Darkness. In this amazing dark rpg side scroller, you play with this her. He has powers thanks to the light magic on the worm. He also has various talents to fight the monsters of the darkness and the creatures that are hidden in the shadows.<br/> <br/>NAIL-BITING 2D RPG BATTLES<br/>The superhero, known as the shadow of the darkness, is after the black magician with his beast body and special magical powers. However, he will face hundreds of different enemies and difficulty levels. Some are much more powerful than Dr. Darkness, so be sure to regularly upgrade his attacks and weapons!<br/> <br/>WHY YOU’LL LOVE IT<br/>The Shadow of the Dark will impress you with extraordinary graphics, spider dungeons and different visual and sound effects. You will not be bored at all, expect ultra-dynamic compositions and scenarios in every episode. As the divisions and creatures become stronger and stronger, you may increase the attacking and defensive power of your shadow cast of darkness. You can get special attack effects that can fight against black growth, and you can fight the shadows with life and magic potions. You’ll be amazed of some of the weapons and attacks in this shoot rpg 2d!<br/> <br/>WHAT TO EXPECT:<br/>- One of the best side scrolling games for 2017<br/>- Exciting hack and slash RPG 2d<br/>- Platform games dark and shadow themes<br/>- Dangerous and increasingly dangerous dark monsters<br/>- Ultra-powerful dark dragons<br/> <br/>DR. DARKNESS FEATURES:<br/>- More than 100 sections,<br/>- Stunning audio-visual effects<br/>- A different gaming experience in the spider dungeon,<br/>- More than 10 section maps,<br/>- Impressive HQ sounds,<br/>- Amazing HD graphics,<br/>- Importer visual animations and effects,<br/>- A great gaming experience,<br/>- RPG Scenario-based gameplay,<br/>- Daily gifts and bonuses,<br/>- World ranking<br/>---------------------------------------------------------<br/>We’ve been frequently labeled as one of the best 2d rpg games of the year!<br/>Enjoy a unique &amp; excitingly satisfying 2d rpg hack and slash experience. <br/>Help the world regain the sun light and dominate the world rankings!", "metacritic": null, "released": "2017-06-03", "tba": false, "updated": "2019-07-29T23:13:39", "background_image": "https://media.rawg.io/media/screenshots/bd9/bd9ae7d8e7364072a94c342e4453b620_ZiqHQN4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Babil Studios"], "genres": ["Action", "RPG"], "publishers": ["BROBABIL IC VE DIS TICARET LTD STI"], "esrb_rating": "Everyone 10+"}