{"id": 270991, "slug": "high-speed-bridge-jump", "name": "High speed Bridge jump", "name_original": "High speed Bridge jump", "description": "Do you love car racing games on sky high bridges? Well, you are in the right place! It’s a crazy mixture of challenging tracks on sky high bridges. You have loads customized exotic cars with the high sporty look to race. There are many unique challenges to face &amp; compete. Hey!! But be careful while getting hit by the obstacles as it will damage your car &amp; its lifespan before it completes the task.  Step in &amp; get ready to join the ultimate speedy race &amp; have fun racing with ultimate speed on sky high bridges. Racers!! There are unique advanced cars have been designed for you &amp; when you need to speed up your cars simply click on boosters &amp; win the race. Challenge your friends and compete with them to get the best score. Enjoy racing racers!!!<br/><br/>HOW TO PLAY:<br/> Grab a car &amp; racing on sky high bridge however be careful while hitting the obstacles as it will damage your car as well your lifelines. When you are at the bridge &amp; you are ready to jump you can use the boosters to complete your task.<br/><br/>==========================================<br/>HIGH SPEED BRIDGE GAME FEATURES: <br/>==========================================<br/>•\tEnjoy Racing with sporty racing cars<br/>•\tAwesome graphic &amp; game environment to race<br/>•\tUpbeat background music and sound effects. <br/>•\tFun, addictive gameplay to race <br/>•\tIncremental difficulties from one level to the next. <br/>•\tSimple game control &amp; speedy boosters<br/>•\tGet coins as rewards.<br/>•\tLog in and play daily to get daily reward. <br/>•\tAdjust your game preference on Settings<br/>•\tUse your coins to getupgrade your cars<br/>•\tRank up and share your rank to friends on Social Media!<br/><br/>Our games are designed especially for kids to play who just learn to enjoy playing. Adults can have a great time in their free time to relax and have a happy mood while playing. The colorful and fun game graphic and sounds will make our game even more enjoyable! We promise you will never get bored. <br/><br/>So, what are you waiting for? Simply try and play. We hope you have a great time racing &amp; competing with your friends.<br/>---<br/>Do you like this insane game  High Speed Bridge Jump? If you do, we want to ask you a favor. Please rate and review this game on our Appstore page. It will mean the world for us!", "metacritic": null, "released": "2018-07-28", "tba": false, "updated": "2019-10-22T14:00:03", "background_image": "https://media.rawg.io/media/screenshots/80b/80ba36986ea8f2ee40ae4794ccc849c0_KWF62Nw.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BigCode Games Pvt"], "genres": ["Simulation"], "publishers": ["BigCode Games Private"], "esrb_rating": "Everyone 10+"}