{"id": 270968, "slug": "snake-off", "name": "Snake Off", "name_original": "Snake Off", "description": "\"Snake Off - Addicting Gameplay!<br/>Snake Off is an upgrade of the classic snake game we played as kids! Brand new gameplay is waiting for you!<br/>This super fun casual game requires speed and strategy! In Snake Off, players start off with a short snake. Play well to grow the snake and achieve domination!<br/><br/>Gameplay<br/>1. Use the joystick to move your snake and grow longer by eating the colorful dots on the map.<br/>2. Be careful! When the head of your snake touches another snake, it will die and leave behind dots.<br/>3. Hold the speed-up button for better positioning to make other players run into your snake. Eat their corpses to grow longer!<br/>4. Compete for the longest snake with your friends in Endless Mode or Time Mode!<br/><br/>Game features<br/>[Advantage for Shorter Snakes Can Quickly Turn the Tides] The length of your snake gives you different possibilities! Long snakes have a positional advantage, but smaller snakes are easier to control! Turn the tides of battle in an instant!<br/>[Easy and Fun, Suitable for All Ages] Regardless of age, gender, or career, anyone can enjoy the simple controls of Snake Off!<br/>[Battle Tips from a Pro] High speed passing, sudden stops, elegant 180 degree turns, circle entrapments: all of these techniques are available! Strategy is just as important and speed, but of course it's best to have both!<br/>[Infectious and Addicting] The super cute art style will have you playing one game after another! Once you start, you just can't stop!<br/><br/>If you like Snake Off, please recommend it to your friends! Suggestions and feedback are always welcomed!\"", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-10-22T13:59:58", "background_image": "https://media.rawg.io/media/screenshots/858/8581647ff4affca6f5b902f38ca71794_AKXGQMi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sen Lee"], "genres": ["Puzzle"], "publishers": ["Sen Lee"], "esrb_rating": "Everyone 10+"}