{"id": 270964, "slug": "hollywood-stunts-racing-star", "name": "Hollywood Stunts Racing Star", "name_original": "Hollywood Stunts Racing Star", "description": "Lights!! Camera!! Action!! Are you ready to become a Star?  Want to become stardom??  Then gear up to turn your luck into reality to become a celebrity hunk. Don't underestimate yourself! Take a chance to change your destiny to become a racing star. You are a born star filled with amazing skills &amp; talent. Great!! Garb the opportunity to win the hearts of the world. Impress the director by your looks, action &amp; acting skills. There are much more amazing things you should explore and you will love it. Shoot in the different location you have ever dreamt of, you have to complete the stunts &amp; tasks to unlock the next location for your next shoot. Each car racing scenes will be directed in each new location. Explore the real life of a celebrity &amp; you are the one born to be a star. So, what are you waiting for? Simply try your luck &amp; play. We hope you have a great time racing, performing stunts, impressing the director &amp; competing with your friends. Hurray!! You can share &amp; purchase to unlock your favorite stunt cars. The colorful and fun game graphic and sounds will make our game even more enjoyable! We promise you will never get bored. This is an amazing car racing stunt game. <br/><br/>HOW TO PLAY: <br/><br/>Chose your character &amp; grab your coolest racing crazy car to get ready to race for the shoot. You have to damage maximum vehicles or cars as much as you can &amp; hit all the movable objects given in the location to unlock your next scene. Don't miss it!! Give your best shot. Your scenes will be shown in the shoot depending on the locations unlocked. So, be careful &amp; you can become the next rising star.<br/><br/>==========================================<br/>HOLLYWOOD STUNTS RACING STAR GAME FEATURES: <br/>==========================================<br/>•      It's a Free Racing Stunt Game<br/>•      Enjoy Racing with sporty racing cars<br/>•      Simple game control &amp; speedy boosters<br/>•      Get coins as rewards to unlock next levels<br/>•      Unlock &amp; Play 20+ racing cars<br/>•\tGet coins as rewards.<br/>•\tLog in and play daily to get the daily reward. <br/>•      Adjust your game preference on Settings<br/>•      Use your coins to get Hints when you hit a dead end. <br/>•     Complete the stunts &amp; unlock new levels<br/>•\tRank up &amp; share your rank to friends on Social Media!<br/><br/>The destiny has written for your name to be a Star!! This is an incredible game filled with action &amp; a real life of a celebrity on his shoot for actions movies. So get experienced to live a life of a star.<br/><br/>Do you like this crazy Hollywood Stunts Racing Star game? If you do, we want to ask you a favor. Please rate and review this game on our Appstore page. It will mean the world for us!", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-10-22T13:59:56", "background_image": "https://media.rawg.io/media/screenshots/2cc/2cc56d696987e73ba03d4def2a14fe2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BigCode Games Pvt"], "genres": ["Simulation", "Racing"], "publishers": ["BigCode Games Private"], "esrb_rating": "Teen"}