{"id": 270967, "slug": "primal-dinosaur-simulator-2018", "name": "Primal Dinosaur Simulator 2018", "name_original": "Primal Dinosaur Simulator 2018", "description": "Primal Dinosaur Simulator - Dino Carnage is one of the best simulation games for dino lovers from BigCode Free Games. It's time travel to historic period and fight against fierce monsters of the era. In this simulation gameplay, each level has a unique task given to complete within the time allotted to play. Share your score and compete with your friends. <br/><br/>CITY THEME:<br/><br/>Play as real dino and destroy the city to complete the task. Smash all the vehicles and things around in the city to collect free cash. The environment contains a lot of obstacles such as vehicles, buildings and destroys everything that comes your way. This arena has an unlimited fun in destroying all the obstacles in the city and harm humans to rule the city.<br/><br/>JUNGLE THEME:<br/><br/>In the forest, you have to hunt small dinos or other animals and make them your prey. They can feel your presence and can smell, so don't make noises when you're ready to hunt them! The sounds will drive you crazy to play and kill the wild animals of the era. An endless gameplay with targets to hunt, kill and eat to keep your energy level up. This is a unique gameplay with a thrilling experience<br/><br/>Download to play the most adventurous simulation game for dino lovers.<br/><br/>Primal Dinosaur Simulator - Dino Carnage Features:<br/><br/>* FREE simulation game to play<br/>* Amazing 3D graphics and prehistoric Dinosaurs <br/>* Wide range of exciting dinosaurs<br/>* Realistic dinosaur simulator gameplay<br/>* Awesome gameplay with attacking animations<br/>* Unique gameplay with smooth controls<br/>* Score bonus points and rewards<br/><br/>If you love Primal Dinosaur Simulator - Dino Carnage, please do leave a comment.", "metacritic": null, "released": "2018-04-28", "tba": false, "updated": "2019-10-22T13:59:58", "background_image": "https://media.rawg.io/media/screenshots/6de/6de3535bbbf091e0c313a34b869b59c2_q6M7d5g.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BigCode Games Pvt"], "genres": ["Simulation"], "publishers": ["BigCode Games Private"], "esrb_rating": "Teen"}