{"id": 270949, "slug": "maze-frontier-minesweeper", "name": "Maze Frontier - Minesweeper", "name_original": "Maze Frontier - Minesweeper", "description": "In order to meet again with the girl who has unexpectedly passed away, a lovely silent boy embarked on a fantasy journey full of unknown. <br/><br/>Sweep the minefield that containing hidden land mines without triggering any of them. Figure out the location of mines and traps. Mark traps with flags. There are various ways to solve fantastic challenging puzzles. Come to explore the wonderful world and experience the deep love with little boy. Help him achieve his wish with your ingenuity!<br/><br/>Wearing headphones during the game is recommended. <br/><br/>Game Features:<br/>- Unprecedentedly creative minesweeper gameplay with exquisite puzzles<br/>- Multiple gameplay: Minesweeper, Sokoban, Maze Escape and Klotski<br/>- Experience love-seeking journey and magical fancy world<br/> - Perfect combination of music, plot and beautiful predestined love<br/>- Clean and vivid animation<br/>- Acclaimed original music<br/><br/>How To Play:<br/>- Accurately identify squares with mines<br/>- Number on revealed squares indicates amount of mines around<br/>- Long press to flag mines &amp; walk on revealed squares to open safe area<br/>- Be cautious! If you step on a mine, you will lose a heart<br/>- Plan route smartly, push stone balls and boxes to key points<br/>- Fast escape from falling ground<br/>- Look for hidden treasure boxes and collect gold coins<br/><br/>Follow us to get news and rewards on Facebook:<br/>https://www.facebook.com/Maze-Frontier-1438670762925272/", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-07-29T17:00:35", "background_image": "https://media.rawg.io/media/screenshots/8ff/8ff9f5831222d7f6ac9e974ed80c6a56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MagicSeven"], "genres": ["Adventure", "Puzzle"], "publishers": ["MagicSeven"], "esrb_rating": null}