{"id": 271053, "slug": "airplane-pilot-flight-training", "name": "Airplane Pilot Flight Training", "name_original": "Airplane Pilot Flight Training", "description": "Turbojet Airplane simulator is ultimate flying fun game for free.<br/>Explore the thrilling airplane flying missions while playing air plane simulator 3D game. Boost your airplane flight simulation skills by Flying plane flight simulator game.<br/><br/>Buckle up yourself, boost the throttle up and forget all other creepy airplane simulation games. Airplane flight pilot simulator games provide excellent animations &amp; 3D views of the blue sky.<br/><br/>Enjoy the best airplane simulator games features which have a totally unique adventure. Army plane simulator 2017 game combines with stunning graphics and realistic environment. There are multiple airplanes and more than one thrilling missions. Choose the plane and mission, buckle up yourself and control your flight as trained pilot to keep your aircraft safe. It’s time to show your best airplane flight simulation skills to complete the mission. If you are getting bored of typical seaplane flight simulation and drone flying games then choose the best fighter plane. Perform the best take-off and landing stunts and burn the asphalt runway of city airport with the extreme nitro boost. Clear the previous mission to unlock more and get a reward. Upgrade or buy a new jet plane with cash for more precision simulation skills.<br/><br/>Key Features:<br/>• Physics-based landing and take-off experience.<br/>• Extremely High-Quality user-friendly GUI.<br/>• Smooth and easy controls.<br/>• One of best Simulator games 2018.<br/>• A wide variety of passenger planes.<br/>• Realistic flight simulation ever.<br/>• Mind-blowing sound.<br/>• Amazing and marvelous 3D graphics.<br/>• Almost real animated crafts and Boeings.<br/>• Realistic experience of pick and drop the passengers through the plane.", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2019-10-22T14:00:18", "background_image": "https://media.rawg.io/media/screenshots/6da/6daf34d4dcaba74c47a71968187603fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Imran Malik"], "genres": ["Adventure", "Simulation"], "publishers": ["Imran Malik"], "esrb_rating": "Everyone 10+"}