{"id": 271061, "slug": "mountain-adventure-off-road-bus-ride", "name": "Mountain Adventure off Road Bus Ride", "name_original": "Mountain Adventure off Road Bus Ride", "description": "Do not let the passengers waiting and start moving. You are the expert off road driver in a mountainous area. Keep the nerves together on the hilly roads full of obstacles and stones in the way. Tourists on the road trips need ride to get to places. Help the passengers in this amazing transportation simulation. Race against the ticking of clock and reach the destinations in time. This Public transporter driver game is great bus game. Best mountain bus simulator indeed. Control over steering will lead to the best bus driver experience.<br/>Multiple tasks of this simulator game includes driving, parking, passenger pick and drop and keeping the vehicle safe. <br/>Mountain Adventure off Road Bus Ride is totally free simulator among bus simulators of 2017 but to make it more convenient we have some in app products for purchase. <br/>In Apps Products: Unlock Levels.<br/>• You can buy this package to get the experience of simulator game with an ads free version, no more hassle of skipping or viewing the ads. <br/>Mountain Adventure off Road Bus Ride special features:<br/>• Big off road mountain hill environment for the driving simulation<br/>• Become the best driver to unlock the ultimate bus. <br/>• Select from a big garage of Luxury Buses<br/>• Impeccable graphics for the preferred smooth gameplay<br/>• Handle the bus on narrow roads with the Smooth controls<br/>• To power the Realistic game play<br/>• Narrow challenging roads for the travelling and longest journey", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2019-10-22T14:00:19", "background_image": "https://media.rawg.io/media/screenshots/690/690e0b89ae3de7202bea3f4e0862232f_FllOH39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Imran Malik"], "genres": ["Simulation"], "publishers": ["Imran Malik"], "esrb_rating": "Everyone 10+"}