{"id": 271067, "slug": "shoot-hunter-army-strike-fps-game", "name": "Shoot Hunter Army Strike FPS Game", "name_original": "Shoot Hunter Army Strike FPS Game", "description": "Time to take the attacked city back. Have the best military combat with the enemy army in this great fps shooting game. Salvation of the city is in commando’s hands and best shoot hunter army striker must combat with the brutal enemy army to prevail the peaceful existence of the city. Retaliate against the evil and enjoy the fps shooting. Kill the maximum soldiers to end the terrorist reign. <br/>In app Purchases:<br/>Unlock Levels: If you are stuck at a level, use the “unlock level” package to immediately unlock all the levels and play any level you want. <br/>Shoot Hunter Army Strike FPS Game features:<br/>• Hostage situations on the top of the buildings<br/>• Kill the robbers and street criminals.<br/>• Infiltration tasks against the worst terrorists. <br/>• Save the people from getting hurt of the bullets from terrorists<br/>• A group of kidnappers has kidnapped a whole family &amp; demanding for big bucks. Find them and kill them<br/>• Killers are spreading their territory and hurting people more than ever before. Get into you battle form and eliminate them all<br/>• Criminals are out of control; teach them a lesson by killing them. Give the people some relief<br/>• Streets have become the brutal battle zones. Clear and make the lives of civilians easy with amazing weapons and huge arsenal.", "metacritic": null, "released": "2017-08-17", "tba": false, "updated": "2019-10-22T14:00:22", "background_image": "https://media.rawg.io/media/screenshots/03b/03bcc1ca80768f273aec08acf4af48fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Imran Malik"], "genres": ["Action"], "publishers": ["Imran Malik"], "esrb_rating": "Mature"}