{"id": 271045, "slug": "subway-pet-run", "name": "Subway Pet Run", "name_original": "Subway Pet Run", "description": "Subway Pet Run is an exciting free endless spring running adventures game for Girls and Boys of all ages. Specifically designed for children and families who want to enjoy, play with their own the cutest Pet Dogs in Town! In this version of Subway Pet Run you can take your little puppy Dog on a fun adventure through the roads. In this Best dog app 2018, run as fast as you can! In this Dog Race just Slide, roll and jump over the obstacles in your way and enjoy this cute puppy simulation with rainbow adventure of top simulator 2018!<br/>Subway Pet Run is the best pet Animals racing app free in which the little puppy where you can meet your new best pet puppy dog friend! Take your doggy friend and pets pup runner with you! Discover new worlds, different running styles and grab boosts on the dog running. This is the best running simulator. In this Non-Stop fun game, Slide and leap your way across the road freely in the Realistic environment having astonishing HD graphics of the cool city roads! Crazy run dash and jump forward as fast as you can, dodge obstacles! Take a trip down a fun park slide to reach mega heights of the quality fun games!<br/>City run adventure of the Subway Pet Run is in the Best games 2018 which has a way to train your puppy dog is mini running going for an endless run game with him! Teach him in this subway run app to way out and help him to learn how to avoid all the obstacles that could appear in a normal day: in this Dog pursuit race you have to be extremely careful with the hurdles! It is very easy to control, run as fast as you can, rush in the endless city scene. Be careful to avoid carrier, collect more and more gold coins and buy more props. There are sweet pet puppies to choose, the cutest and kiddy running dog fun games for free.<br/>The Cute Puppy Runner 2018 is very easy to play. Just hit the start button and pet run game will start as the running puppy of crazy subway city run. Use the left and right button to avoid the obstacles and hazards which will cause a danger for your cute pet puppy of Quality games for iPad. By collecting a lot of golden coins you are moving along with the endless fun and adventure. You have also a facility to make Pause the running pet in an emergency of work and then resume your adorable pet game and enjoy 3d racing from there where you have just left this easy games for free.<br/>Have an endless fun with the baby pet games, cute puppy endless running games for iPhone free.<br/><br/>Subway Pet Run game Features;<br/>• Adventurous run with your puppy dog and train him in an exciting race full of obstacles.<br/>• When you start running adventures this super running game the time will be not be counted: You have to be super run in this cute pet spirit run game. <br/>• Incredible realistic graphics that will immerse you in this puppy dogs game.<br/>• It’s a memorable subway Santa game.<br/>• These puppies’ family game is for children, adults &amp; all ages.<br/>• This Running adventures game is the best and unique entertaining endless run game.", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-10-22T14:00:17", "background_image": "https://media.rawg.io/media/screenshots/6a0/6a04da353c849b45e88023c2dfe3338c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Imran Malik"], "genres": ["Adventure", "Arcade"], "publishers": ["Imran Malik"], "esrb_rating": "Everyone 10+"}