{"id": 2710, "slug": "shadowmatic", "name": "Shadowmatic", "name_original": "Shadowmatic", "description": "<p><strong> Apple Design Award Winner </strong><br />\n<strong> App Store Best of 2015 </strong><br />\nShadowmatic is an imagination-stirring puzzle where you rotate abstract objects in a spotlight to find recognizable silhouettes in projected shadows, relevant to the surrounding environment.<br />\n“Other Worlds” is a chapter of Shadowmatic with over 30 levels in 3 unique thematic environments: Ancient Worlds, Music and Space. The chapter is available as a separate purchase.<br />\nThe game combines stunning visuals with relaxing and captivating gameplay.<br />\nOn your journey to discover the right solution you will stumble upon many unexpected and infinitely varied silhouettes.<br />\nThe game features 12 rooms, each flavored with unique concept, atmosphere, and music.</p>\n<hr />\n<p>“Simple to the point of beauty, and beautiful to the point of becoming a work of art, this is a game you won&#39;t want to win, because you won&#39;t want the experience to end” - Pocket Gamer<br />\n“It&#39;s fun, it&#39;s unique, and it&#39;s the perfect type of game to show off to people who typically don&#39;t play video games, as it&#39;s almost like an interactive piece of art” - Touch Arcade<br />\n“It’s always awesome to see a breathtaking, unique, and thoroughly innovative puzzle game pop up on the App Store” - Macworld<br />\n“Full of whimsical puzzles and thoughtful designs, Shadowmatic is a delightful and captivating iOS game” - CNET<br />\n“&#39;Fantastically original&#39;: Shadowmatic works modern-day wonders with the ancient Chinese art of shadow puppetry” - The Guardian<br />\n“It’s like a mind-bending shadow-puppet spectacle” - TIME<br />\n“This game requires you to look at things a little differently” - Washington Post</p>\n<hr />\n<p>Hints.<br />\nThe game includes a system of hints. To enjoy the game to its fullest, however, we recommend resorting to them on rare occasions only.<br />\nMusic.<br />\nEvery room in the game features its own music arrangement, adding up to the distinctive atmosphere and feel in each. The music is best experienced with headphones, and is available separately on iTunes.<br />\n-- More than 100 levels in 12 unique environments<br />\n-- Gorgeous graphics<br />\n-- Secondary objectives<br />\n-- Nonlinear level progression<br />\n-- 3D parallax view<br />\n-- Achievements<br />\n-- Arcade Mode<br />\n-- Synchronization with Apple TV<br />\n<strong> The game is optimized for every iOS device separately (starting from iPhone 4 and newer), however it&#39;s best experienced on the latest devices.<br />\n</strong> Please note that the game is larger than 150MB and can only be downloaded using Wi-Fi.<br />\nFollow us on Twitter: @ShadowmaticGame<br />\nJoin us on Facebook: @Shadowmatic<br />\nFollow us on Instagram: @Shadowmatic<br />\nQuestions? Shoot us an email: support@triadastudiogames.com</p>\n<hr />\n<p>Triada Studio is a computer graphics and animation studio with over 20 years of industry experience. Shadowmatic is the company’s first project that bridges its vast computer graphics experience with an experimental in-house 3D engine.</p>", "metacritic": 80, "released": "2015-01-15", "tba": false, "updated": "2023-09-19T13:16:04", "background_image": "https://media.rawg.io/media/screenshots/329/329cc776ff716d91c37bb57fb6007b6a.jpeg", "website": "http://www.shadowmatic.com", "rating": 4.26, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 10, "beaten": 9, "toplay": 2, "dropped": 12, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 19, "platforms": ["Android", "iOS"], "developers": ["TRIADA Studio"], "genres": ["Family", "Puzzle"], "publishers": ["TRIADA Studio"], "esrb_rating": null}