{"id": 271185, "slug": "future-fast-car-furious-driving", "name": "Future Fast Car & Furious Driving", "name_original": "Future Fast Car & Furious Driving", "description": "Future Fast Car &amp; Furious Driving<br/><br/>Free to Play &amp; Download on GOOGLE play Store.<br/><br/>Ever wanted to drive Limo cars? Maybe fly an airplane? This game is perfect for you!<br/>Now you can drive your super sports car do stunts and drifts in dirty off-road or fly your car like an airplane.<br/>Well, it's your chance to experience the best blend of flying car games and car stunt games.<br/><br/>This amazing flying car simulator will take you towards an action packed ride in the latest flying car racing games.<br/>Get to drive the most luxury limousine you've ever driven. All city people will turn their heads once you drive by! Start to play the most amazing limo driving simulator the google play store has the offer.<br/>You are free in a world that you can do what you want. drive your limo around the town, play with physics and take off to the skies in your limo, reaching newer and higher places. Drive on top of buildings, scale ramps and structures, smash up your limo and other cars, do stunts.<br/><br/>Be Carefull ! If our flying car Crash with any other car in sky then that other car will be blast and our car will damage.<br/>If your car collide any chemise (Wall) four times then your car will be blast.<br/><br/>Key Features:- <br/><br/>=&gt; Realistic graphics in this city<br/>=&gt; This car parking 3D game is free to play<br/>=&gt; Realistic limousine Controls<br/>=&gt; awesome luxury limousine to drive in while playing these limousine driving games", "metacritic": null, "released": "2016-05-09", "tba": false, "updated": "2019-10-22T14:00:47", "background_image": "https://media.rawg.io/media/screenshots/0f5/0f5ccc86bcb52bcb1890f064a5870b09_n6DjP6N.jpg", "website": "http://smartgirlsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["megan rozi"], "genres": ["Racing", "Family"], "publishers": ["megan rozi"], "esrb_rating": "Everyone 10+"}