{"id": 271211, "slug": "party-salon-spa-makeover", "name": "Party Salon Spa & Makeover", "name_original": "Party Salon Spa & Makeover", "description": "\" Party Salon Spa &amp; Makeover \" is free game to PLAY <br/><br/>Hi! My dear, Our new game Party Salon deserves your attention!<br/>Do you dream of becoming the gorgeous Party Queen? <br/><br/>Would you like to be the Beautiful star in the shining Friday club, grand dancing ball and luxury private pool? Style your hair, pick up your high heels, put on your make-up to release your inner enthusiasm! As usual, you can get all decked out for the girls, such as doing spa, having facial makeup and dressing-up, then relax and luxuriate in the parties! Aha! <br/><br/>See, your hard work pays off, pretty boys are coming for you. Why not start a relationship with the guy you like and take photos to record the special moments.<br/><br/>Go shopping for beautiful clothes, which obviously will enrich your dull days! Come on! You couldn’t miss it.<br/><br/>Features:<br/>- A prosperous street on an unforgettable and wonderful night<br/>- Beautiful dresses, exquisite accessories and various hair dye<br/>- SPA, makeover, dressing-up, all the girl things are available<br/><br/>Megan Rozi is committed to creating innovative games for girls. We'll keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them<br/><br/>Need You Know:<br/>This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock.", "metacritic": null, "released": "2014-12-19", "tba": false, "updated": "2019-10-22T14:00:49", "background_image": "https://media.rawg.io/media/screenshots/558/558aa36925b107a9707fd9b53ed92ac9.jpg", "website": "http://smartgirlsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["megan rozi"], "genres": ["RPG", "Family"], "publishers": ["megan rozi"], "esrb_rating": "Everyone 10+"}