{"id": 271322, "slug": "retro-games-x-geometry-line-runner-arcade-game-fre", "name": "Retro Games X: Geometry Line Runner Arcade Game Free - ' Top Tap Impossible X Series ' by Cobalt Play", "name_original": "Retro Games X: Geometry Line Runner Arcade Game Free - ' Top Tap Impossible X Series ' by Cobalt Play", "description": "??? Can you score 4000 points ???<br/>!!!! The world best record so far is 7200 !!!!<br/><br/>So so easy to play. Drag your finger anywhere on the screen to move. Collect the greens and avoid the white squares. Last as long as you can.<br/><br/>################<br/>WORLDS TOP 10 PLAYERS (email us if you beat any scores here) <br/><br/>1) Halston - 189000<br/>2) Brenden Marshall - 22420<br/>3) Anderson Hammes - 5418<br/>4) Tony - 4576<br/>5) Alexi - 4574<br/>6) 전중언 - 4425<br/>7) Singletoto - 4178<br/>8) Cinto - 4117<br/>9) Xia500 - 3817<br/>10) Andrea Sanchez - 3636<br/>################<br/><br/>Similar to Geometry Wars and retro arcade games, Retro Games X - Geometry Line Runner is an addictive little gem that anyone can play. The first 10 seconds are just a warm up, once the squares start spawning faster it's time to start working that calculator brain to find the best escape. Keep traveling for as long as you can.<br/><br/>Geometry Line Runner was designed to be a training game for other retro / arcade style games such as geometry wars and infinity field. Being great at this game improves your skill and accuracy in other retro - arcade games.<br/><br/>The word is Retro Games X - Geometry Line Runner is becoming one of the best games in the market and is getting more and more downloads each day. Game players have gone crazy sitting on their butt, on the subway, on the school bus all day trying to top their best score, so be careful, it's addictive ;D<br/><br/>7200 is the worlds best record so far. If you beat this score, please send us a screenshot or video capture and we will post it here for the world to see.<br/><br/>The style is inspired by early retro video games such as defender, space invaders, and consoles such as the atari 2600 and vetrex (vector line graphics console). The Retro Games X - Geometry Line Runner style is also influenced by neo retro games such as geometry wars, and the movies tron and rez.<br/><br/>Retro Games X - Geometry Line Runner is part of the X series of pro games by Cobalt Play. These little jewels are training style games which improve your skill in other games. If you're great at one of these you'll scare your friends and school them with your amazing mobile game skills :) <br/><br/>The X series:<br/><br/>Aim X - a sword slice game similar to fruit ninja<br/>Ascend X - a ninjump style training game<br/>Tap Tap X - a tap catch - avoid game<br/>Accelerate X - an old school drive / racer avoidance game<br/>Alpha Jetpack X - a jetpack joyride training game<br/>Alpha Run - Impossible Game X - one of the hardest games in the market inspired by The Impossible Game.<br/><br/>Also search for our hits Chicks Revenge and Go Chick Go. This isn't a sexy girl chick ;) it's a cute angry chick out to kill the other farm animals and birds. These are funny, casual games, unlike the X series. Blast your way to the sky, shoot sweetcorn bullets, fire off the rocket suit, wage war and dash through the levels. Great fun for kids and adults. <br/><br/>Cobalt Play is a small business with a big plan. Please help make Retro Games X - Geometry Line Runner a top rated game by rating it. Please also recommend it your friends on Facebook and other social networks. We really appreciate all your help and would love hear what you think of our games. You can email us at games@cobaltplay.com. People can also see our new title updates on our youtube channel (cobalt red).<br/><br/>We will also travel to GDC this year and so if you are a mobile development studio, book us in your calendar and come meet us. You can email us or add us to your skype (cobaltplay).<br/><br/>If Retro Games X - Geometry Line Runner / the X series grows a strong fan base we will be adding new features with future updates. Such as HD version, puzzle online mode, defence mode, translate in to new languages, and more. Keep downloading your updates and sending your ideas!!", "metacritic": null, "released": "2012-02-28", "tba": false, "updated": "2019-10-22T14:01:48", "background_image": "https://media.rawg.io/media/screenshots/3a4/3a48c81daa52eaccdb13fa3d581a816e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martin Finch"], "genres": ["Action", "Arcade"], "publishers": ["Martin Finch"], "esrb_rating": "Everyone 10+"}