{"id": 271385, "slug": "galaxy-trek-for-ipad", "name": "Galaxy Trek for iPad", "name_original": "Galaxy Trek for iPad", "description": "The galaxy is being overrun by an invading horde of enemies know as Swarmers. The swarmers are fast and ferocious and attacks in swarms, hence their name. The swarmers have decimated the entire fleet of warships leaving the inhabited planets and remaining spaces stations defenseless.<br/><br/>Having been on an extensive intelligence mission, your ship is the last of the fleet. You have been ordered back to defend what is left and drive the swarmers back.<br/><br/>Your ship, the first of its kind, is faster and more powerful that those in the destroyed fleet and so you stand a chance of victory if you can master the swarmer's tactics. You ship is equipped with three weapons; a laser bank, torpedos and the \"Extirpator\" and a protective energy shield. Fully automated, you ship is ready for battle. It's up to you to save the galaxy.<br/><br/>To successfully complete your mission you must destroy all swarmers and protect at least two (2) space stations and two (2) planets from destruction without yourself being destroyed. Your ship is destroyed if the energy level or life support levels reach zero.<br/><br/>-----------------------------------------<br/><br/>Galaxy Trek is a turn-based strategy game, similar in concept to the old mainframe trek game. The galaxy is broken into 64 quadrants arranged in an 8x8 grid. Each quadrant is broken down into 64 sectors arranged in an 8x8 grid. You maneuver your ship across the galaxy, destroying swarmers before they can destroy inhabited planets and space stations.<br/><br/>The game is played turn-by-turn. That is, you play your turn in which you can complete a set of actions, then the swarmers have their turn in which their ships will perform a countering set of actions. This continues until one side is victorious.<br/><br/>You will be ranked on your performance throughout the mission.<br/><br/>Features:<br/>--------------------<br/>- Available as iPhone/iPod Touch and iPad versions.<br/><br/>- Three levels of difficulty.<br/><br/>- Your game is saved when you exit so you can pick up where you left off.<br/><br/>- Highest score is kept.<br/><br/>- Can turn on/off features in the Settings console.<br/><br/>- iPod music can play in the background.<br/><br/>- Complete instructions with illustrations are available in the game - no need for a wireless connection to access them. You can also view the full instructions by visiting the website links below.", "metacritic": null, "released": "2010-12-17", "tba": false, "updated": "2019-10-22T14:03:11", "background_image": "https://media.rawg.io/media/screenshots/ace/ace9ac2797197f249c25ef0ac05b03f6.jpg", "website": "http://www.timbecca.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["George Dimidik"], "genres": ["RPG", "Strategy"], "publishers": ["George Dimidik"], "esrb_rating": "Everyone 10+"}