{"id": 271320, "slug": "temple-run-training-game", "name": "Temple Run Training Game", "name_original": "Temple Run Training Game", "description": "IMPROVE YOUR TEMPLE RUN SKILLS NOW !!!<br/><br/>******************************<br/>Check out the top reviews online:<br/><br/>MacsFuture: http://www.youtube.com/watch?v=cd1_-sXYpPQ<br/>360Mobiles: http://www.youtube.com/watch?v=HmmDNbvpz4Q<br/>AppleManToday: http://www.youtube.com/watch?v=WKMFnHqNmo0<br/>JailBreaksRUS141: http://www.youtube.com/watch?v=6x0wfI3TsZU<br/>H2TechVideos: http://www.youtube.com/watch?v=DX3igFYYMnk<br/>http://www.youtube.com/watch?v=6Az6pXPIl8Y<br/>JustinsFilmz: http://www.youtube.com/watch?v=OrVK1Y8Hqw4<br/>GhostHunter427: http://www.youtube.com/watch?v=sWKnkOhKLdw<br/>BSapproved: http://www.youtube.com/watch?v=ZRCs4VdQShw<br/>Apple Vision TV: http://www.youtube.com/watch?v=T0J8X7jXcOA<br/>JD Techno: http://www.youtube.com/watch?v=KLNx5rSpPLw<br/>JuliOooO12: http://www.youtube.com/watch?v=DtW3wiQ0ov0<br/>TheJoxZ3: http://www.youtube.com/watch?v=ZuUs7vAUkpE<br/>www.theipodtouchworld.com<br/>http://www.youtube.com/user/TheIpodTouchWorld<br/>Tech Hero: http://www.youtube.com/watch?v=Z2Kvb8ijjFY<br/>iPhone Games XO: http://www.youtube.com/watch?v=VaT7b1sExuw<br/>******************************<br/><br/>??? Can you score 1400 points ???<br/>!!!! The world best record so far is 1800 !!!!<br/><br/>Temple Run Training - Retro Games X is game designed to improve your temple run skills by using the same game mechanic but cranking up the speed and difficulty. <br/><br/>So so easy to play. When the arrows go between the white bars swipe your finger in the direction of the arrow. For example, swipe your finger left when a left arrow goes between the bars. Last as long as you can. It's that simple :)<br/><br/>Similar in style to DDR and the Tap Tap Revenge series, Temple Run Training - Retro Games X is an addictive little gem that anyone can play. The first 20 seconds are just a warm up, once the arrows start spawning faster it's time to start working that calculator brain of yours.<br/><br/>The word is Temple Run Training - Retro Games X is becoming one of the best games in the market and is getting more and more downloads each day. Game players have gone crazy sitting on their butt, on the subway, on the school bus all day trying to top their best score, so be careful, it's addictive ;D<br/><br/>1800 is the worlds best record so far. If you beat this score, please send us a screenshot or video capture and we will post it here for the world to see.<br/><br/>The style is inspired by early retro video games such as defender, space invaders, and consoles such as the atari 2600 and vetrex (vector line graphics console). The Temple Run Training - Retro Games X style is also influenced by neo retro games such as geometry wars, and the movies tron and rez.<br/><br/>Temple Run Training - Retro Games X is also part of the X series of pro games by Cobalt Play. These little jewels are training style games which improve your skill in other games. If you're great at one of these you'll scare your friends and school them with your amazing mobile game skills<br/><br/>The X series includes:<br/><br/>Aim X - a sword slice game similar to fruit ninja<br/>Ascend X - a ninjump style training game<br/>Tap Tap X - a tap catch - avoid game<br/>Accelerate X - an old school drive / racer avoidance game<br/>Alpha Jetpack X - a jetpack joyride training game<br/>Alpha Run - Impossible Game X - one of the hardest games in the market inspired by The Impossible Game.<br/>Geometry Line Runner - a avoidance geometry wars style game<br/>Glow Bubble Blast - a quick tap reaction game<br/><br/>Also search for our hits Chicks Revenge and Go Chick Go. This isn't a sexy girl chick ;) it's a cute angry chick out to kill the other farm animals and birds. These are funny, casual games, unlike the X series. Blast your way to the sky, shoot sweetcorn bullets, fire off the rocket suit, wage war and dash through the levels. Great fun for kids and adults. <br/><br/>Cobalt Play is a small business with a big plan. Please help make Temple Run Training - Retro Games X a top rated game by rating it. Please also recommend it your friends on Facebook and other social networks.", "metacritic": null, "released": "2012-03-13", "tba": false, "updated": "2019-10-22T14:01:36", "background_image": "https://media.rawg.io/media/screenshots/0d0/0d05bd0991f4fc6760c7c8fca6ab8867.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martin Finch"], "genres": ["Action", "Arcade"], "publishers": ["Martin Finch"], "esrb_rating": "Everyone 10+"}