{"id": 271330, "slug": "go-chick-go-free", "name": "Go Chick Go Free", "name_original": "Go Chick Go Free", "description": "★★★★★ Fly super high<br/>★★★★★ Shoot animals with sweetcorn<br/>★★★★★ Get the rocket suit<br/>★★★★★ Unlock free items<br/>★★★★★ Top the best score and brag<br/>★★★★★ Be the best game chick you can be with Go Chick Go Free<br/><br/>#####Now includes Game Center global leader boards.######<br/><br/>Just hatched from his egg and new to the world, 'Chick' a cute blue bird with an attitude already has a dream of flying higher than any other  bird. Before he can even walk Chick leaps to the sky to fulfil his dream, but not without grabbing the attention of older, jealous animals who are determined to stop the young bird in his tracks. Chicks only defences are his speed, agility, determination… oh, and a rocket pack and corn gun.<br/><br/>In true bird game tradition (angry birds, tiny wings, bird strike) Go Chick Go is a cute, fun, easy game that will keep you entertained for hours. Simply use your finger to move Chick side to side, and tap on the bonus items to use them. Avoid the falling animals, keep your energy bar up, score as high as possible and boast to your friends.<br/><br/>Go Chick Go Free features stunning art work, catchy music, unlockable items and high score recording.<br/><br/>More updates coming soon. Be sure to download Go Chick Go Free updates for new items, features, game modes and more.<br/><br/>++++++++++++++++++++<br/>Thanks to everyone for giving us a high rating and game review, and for working with us to make the best game possible. More updates and free iphone games coming soon.<br/>++++++++++++++++++++", "metacritic": null, "released": "2011-04-13", "tba": false, "updated": "2019-10-22T14:01:55", "background_image": "https://media.rawg.io/media/screenshots/77c/77ca28fc9870f8710733dce31ac50297.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martin Finch"], "genres": ["Action", "Arcade"], "publishers": ["Martin Finch"], "esrb_rating": "Everyone 10+"}