{"id": 271471, "slug": "its-under-control", "name": "It's under control", "name_original": "It's under control", "description": "<p><strong>\"It's under control\" is a physics-based game about dealing with life (and failing)</strong></p>\n<p><strong>// INFO</strong></p>\n<p>Decide what you want to do and place it on the bar. Careful, if you get greedy and place too much you'll end up with nothing.</p>\n<p>You start the game with three options (eat, sleep and work) but you'll come across others later. Experimenting is part of the game.<br/></p>\n<p>Made for Ludum Dare 43  (Sacrifices must be made) by one person in about 24h</p>\n<p><strong>// SHORTCUTS</strong></p>\n<p>F is fullscreen, R is quickreset and M is mute.</p>\n<p>(if you start the game and can't see any text press R or reload the game, this should be a rare issue)<br/></p>\n<p><strong>// BLURB</strong></p>\n<p>I wanted to join this Ludum Dare but I wanted to take things easy, so I decided to something in about 24 hours. My take on the theme was how we can't just do everything in life, we must choose and sacrifice some options. I represented this struggle through a physics puzzle where you decide what you want to do.</p>\n<p>There is no winning or losing, you can avoid ending your game by sticking to a simple life, that's your choice. Play the game, do whatever feels right and maybe think about this struggle.</p>\n<p>Even though the concept wasn't super complex, testing ended up being way harder than I anticipated, so it's less polished than most of my games (plus I didn't have time to do some decent audio or art). Enjoy!<br/></p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8c7/8c768115d0cb8a02a80e0b870a04be08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Ludipe"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}