{"id": 271535, "slug": "sirius-galactica", "name": "Sirius Galactica", "name_original": "Sirius Galactica", "description": "<p>You find yourself in the middle of the galaxy travelling towards your home planet, Sirius. The engineers thought the invincibility module was complete. It <em>mostly </em>was, however impact with projectiles will cause the SS (Space Ship) Luft Maschine to lose oxygen. It's your goal to bring your invaluable Ship back home, if sacrifices must be made, make them.</p>\n<p>This game has 6 rounds with increasing difficulty, 3 completely unique enemies and two different allied ships all in all summing up to around 10 minutes of play-time.<br/></p>\r\nControls:\r\n<ul><li>LMB - Fire (can also hold)</li><li>WASD - Move</li><li>C - Eject Crew Member</li><li>R - Reposition allies after round (if clipping)</li><li>P - Next Round</li><li>Esc - Return to Main Menu </li></ul>\n<p>You can find out more about the game in the \"Instructions\" tab on the Home Screen</p>\r\nKnown Issues:\r\n<ul><li>The RC Projectiles (Orange ones) will not clear themselves upon reaching the bottom of the map if they didn't ricochet off a wall beforehand (workaround: all projectiles are automatically cleared after 4 seconds) </li><li>Slight spelling mistake in the \"Instructions\" tab (\"Alllies\" instead of \"Allies\")</li><li>Ally ships will sometimes clip in the after round section (Workaround: Press \"R\" and they'll find a new position)</li><li>Unity did an awful job at the audio compression and the music sounds off in some parts, this is NOT the fault of the music.</li></ul>\r\nChangelog:\r\n<p>-</p>\n<p>==============</p>\n<p>This game was made with the amazing BitPotion font by Joeb Rogers. Find it here: https://joebrogers.itch.io/bitpotion</p>\n<p>**Every and all feedback is wanted and appreciated. If you hated, despised or wanted this game to rot in the deepest, dankest depths of hell, please tell me why, so next time I can make something better. Thank You :)** </p>", "metacritic": null, "released": "2018-12-02", "tba": false, "updated": "2019-08-28T23:19:19", "background_image": "https://media.rawg.io/media/screenshots/485/485b0f1b6642182e858c2fdcecfadfbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Call_me_Nutty"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}