{"id": 27167, "slug": "crosswords-plus", "name": "Crosswords Plus", "name_original": "Crosswords Plus", "description": "<p>\n      The Crosswords Plus game offers over 1,000 professionally designed \n      crossword puzzles at multiple skill levels to challenge all types of \n      players. It is all controlled with the stylus and touch screen to input \n      your answers. Within the crossword puzzles, players will discover 4 \n      different skill levels (Easy, Medium, Hard, and Expert) and an \n      accessible Hint system. Players can work through puzzles at their own \n      pace as they improve their skills. Additionally, new crossword puzzles \n      will be available for download through the SpotPassTM feature at no \n      additional charge (wireless Internet access required). You can also \n      unlock new puzzles by connecting with others through the StreetPassTM \n      feature. And with the new giant-sized puzzles, players will feel like \n      they are working through multiple crossword puzzles at one time.\n    </p><ul>\n<li>\n        Over 1,000 professionally designed crosswords puzzles broken into four \n        difficulty levels (Easy, Medium, Hard, and Expert level)\n      </li>\n<li>\n        Intuitive controls to navigate the puzzles and write answers using \n        just the touch screen with a stylus…no more messy eraser bits!\n      </li>\n<li>\n        Accessible hint system to help players move along at their own pace by \n        using points to get an additional clue, reveal a single letter, or \n        even show the answer.\n      </li>\n<li>\n        Additional Game Modes\n      </li>\n<li>\n        - Wordsearch\n      </li>\n<li>\n        - Anagrams\n      </li>\n<li>\n        - Word of the Day\n      </li>\n<li>\n        Giant-sized crossword puzzles give players the feeling of working on \n        multiple puzzles at once.\n      </li>\n<li>\n        Go online with SpotPassTM to download additional crossword puzzles at \n        no additional charge\n      </li>\n<li>\n        Connect with other players through StreetPassTM to unlock additional \n        puzzles\n      </li>\n<li>\n        Available for purchase at retail or digitally in Nintendo eShop \n        (wireless Internet access required)\n      </li>\n</ul>", "metacritic": null, "released": "2012-10-01", "tba": false, "updated": "2019-09-12T06:37:35", "background_image": "https://media.rawg.io/media/screenshots/55e/55e884c2252e91055c4e5ffd09009f17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo 3DS"], "developers": [], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}