{"id": 271903, "slug": "bi-onic", "name": "Bi-onic", "name_original": "Bi-onic", "description": "<p>Bi-onic is a retro style pixel-art game made using the Pyxel engine (https://github.com/kitao/pyxel) in Python.<br/></p>\n<p>This game puts you in the shoes of a super hero, modified with biotic enhancements to better fight crime. Unfortunately, the human parts of your body have begun to die, and you will need to use the systems provided by your modifications to keep yourself alive, while still fulfilling your responsibilities to the world!</p>\r\nTutorial\r\n<p>I intend to add a proper tutorial, or at least something that explains the UI and controls a little better, but for now this will have to do:</p>\n<p>  \r\n</p>\n<ol>\n<li>This line represents your vital signs. Your task is to keep this stable.</li>\n<li>If the line is in this region it is too high. If the line goes off the top of this region, it will be replaced by an arrow to show you where it is.</li>\n<li>If the line is in this region, it is too low. If the line goes off the bottom of this region, you will lose!</li>\n<li>This meter shows the amount of danger you are in. It goes up as long as the line is either too high or too low. If it reaches full, you will lose!</li>\n<li>In this space, you will get updates that warn you of things that might affect the line. Pay attention to this!</li>\n<li>These are the systems at your disposal to try and control the line. One control will quickly push the line up (the \"Up control\") and the other will slowly push the line down (the \"Down control\"). Press and hold the Up arrow to fill the bar with Up control, or the Down arrow to fill the bar with Down control. Once you have decided how much control you want to use, press Enter to administer the  control. Because the Down control is slow to act, you can administer several doses at once. The amount left to act is shown in the reservoir to the left of these controls.</li>\n<li>This represents your score. Currently the game is endless, so just try for the highest score you can!</li></ol>\r\nIssues\r\n<p>I've done all the developing on Mac, and when I downloaded it on Windows to see if I could freeze it to an executable, it looked like there was an issue with how colours were displaying on the main game screen. This may just be a problem with that machine, so let me know if this appears on others too. It's not game breaking, but it's certainly not ideal either.</p>\r\nFuture Development \r\n<p>I ended up having to cut quite a lot of content due to time constraints, so this game is by no means finished. Plans for the future include:</p>\n<ul>\n<li>A tutorial / better signalling of controls.</li>\n<li>Sound and Music.</li>\n<li>A Story mode...?</li>\n<li>ART. MORE ART. </li>\n<li>A better way to install the game. I'm sorry.</li>\n</ul>", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-08-28T23:19:16", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dc4f411a3ba8787e0ba629696966e4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rjmcf"], "genres": ["Action"], "publishers": [], "esrb_rating": null}