{"id": 271953, "slug": "the-volcano-game", "name": "The Volcano Game", "name_original": "The Volcano Game", "description": "The Volcano Game\r\n<p>You are on a mission to explore the volcano.  As you leave the open skies behind, you crawl into a lava cave and descend into a series of underground tunnels.  You bring a paper and pencil with you to map out your explorations, but your compass doesn’t work down here.</p>\n<p>You soon discover that some tunnels lead back to same rooms.  You are constantly redrawing your map, linking together connected rooms in an attempt to make sense of the tunnels.</p>\n<p>The Volcano is an experimental prototype, and an attempt to portray the idea.</p>\r\nThe Game\r\n<ul><li>At its core, the Volcano Game is an adventure game in a Graph-based game world.</li><li>At its mantle, the player has 1 life, and survives through turn-based combat.</li><li>At its crust, it has a web interface that works nicely on both mobile and desktop.</li></ul>\r\nHow it was made\r\n<ul><li>The interface and game logic is written in plain HTML, CSS, and Javascript.</li><li>The graph is rendered with help from vis.js  http://visjs.org/</li><li>It began with experiments for making random graphs, written in Python.</li><li>Source code available at https://github.com/fractalbach/volcano</li></ul>\r\nFuture Development\r\n<ul><li>Infinite Levels<ul><li>The current level is already randomly generated, but has fixed seed values.</li><li>Extending it to infinite levels won’t be difficult, but will requires some balancing so that it feels like a natural progression.</li></ul></li><li>Different Types of Rooms<ul><li>Standalone puzzles</li><li>Mini-games</li><li>Treasure rooms</li><li>Items and materials</li></ul></li></ul>\n\r\nAnother Idea: Adventure through the Game Jam\r\n<p>The main feature of the volcano game is the graph-based tunneling, which is built off the fact that each room is in 1 of 3 different states from the perspective of the player:  <em>undiscovered</em>, <em>unsolved,</em> or <em>solved.</em>  The mechanism that <em>solves</em> a room could be anything.  There could be an entire game of its own in there!  In this prototype, I added combat to convey the concept of <em>solving</em> a room.</p>\n<p>One possible version of this game could have scripts for rooms.  Or be based on itch.io games.  When you <strong>discover</strong> the game for the first time, it starts.  If the game enters the state of <strong>solved</strong>,  then it unlocks links to other games!  In a way, we traverse the web like this through links.  The only difference is that we don’t need to “solve” a webpage.</p>\n<p>Imagine if each game in an itch.io Game Jam is a <strong>node</strong>.  If each game had a way of declaring its state as “solved”, then you could make a graph-based adventure game using all of the Game Jam’s games!  All you would need is a <strong>set of solvable games</strong>.  These could be labeled manually by human players, and then fed into a program that randomly generates graphs and paths through the games!</p>\n<p>If nothing else, it might create a fun way to navigate through and play tons of new itch.io games!</p>\n\n\r\nFeedback plz =) \r\n<p>I like getting any kind of feedback or criticism.  So, if you are reading this right now, please feel free to comment! </p>", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3a2/3a246c2bbe09d36d981e8a46704e2a0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["synack"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}