{"id": 27190, "slug": "warriors-orochi-3-hyper", "name": "Warriors Orochi 3 Hyper", "name_original": "Warriors Orochi 3 Hyper", "description": "<p>\n      Warriors Orochi 3 Hyper combines the much loved heroes of the Dynasty \n      Warriors and Samurai Warriors series in a story that also features \n      characters from Ninja Gaiden, Warriors: Legends of Troy, Bladestorm, \n      Trinity: Souls of Zill O’ll, Dead or Alive and a new character made \n      specifically for Warriors Orochi 3 Hyper!\n    </p><p>\n      Years after the battle against Orochi, the Serpent King, the heroes of \n      the Three Kingdoms and the Warring States struggle to seize control of \n      the new universe they were thrown into when a new threat arises. A \n      terrible and colossal monster, resembling a serpent with eight heads, \n      casts its shadow across the land and defeats most of the brave warriors.\n    </p><p>\n      The ones that survived, assisted by the mysterious Kaguya, travel back \n      through time to save fallen warriors and forge new alliances, collect \n      powerful weapons and build an army so they can have a chance to defeat \n      the terrible Hydra.\n    </p><ul>\n<li>\n        Huge cast of playable characters: More than 130 playable characters \n        from the worlds of Dynasty Warriors and Samurai Warriors. But that is \n        not all that you’ll have at your disposal this time, as the vortex \n        created by Orochi drags a few more allies to their universe. Dragon \n        Ninja Ryu Hayabusa, Achilles, Jeanne d'Arc, Nemea, and Ayane are only \n        a few of the new additions to the playable character roster!\n      </li>\n<li>\n        Unlock abilities and influence the storyline through the bond system: \n        The bonds between characters can be increased by interaction in \n        banquets, fighting together as allies, rescuing struggling allies, and \n        accepting then clearing missions in battles. These bonds can influence \n        the storyline, as well as unlock extra attacks and new stages.\n      </li>\n<li>\n        Customize scenarios and share them online for all to enjoy: Cleared \n        stages from Story Mode or Free Mode can be edited to create unique \n        battlefields, where players can change voice lines and characters, \n        acquire Musou Battlefield Elements in Story Mode and use them to add \n        even more interesting new aspects to their original battlefields. Then \n        rate scenarios created by others and see how your scenarios stack up.\n      </li>\n<li>\n        New “Duel Mode”: An all new “Duel Mode” fuses elements of player \n        versus player battles and card battles into intense combat for player \n        vs. COM battles, or online battles against your friends.\n      </li>\n<li>\n        Wii U™ GamePad compatible: Choose from two ways to play local two \n        player co-op. Play using the TV and the Wii U™ GamePad screen, or play \n        using standard split screen on your TV.\n      </li>\n</ul><p>\n      In-game content available for purchase using stored account funds.\n    </p>", "metacritic": null, "released": "2012-11-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/eb8/eb8ab8121b56ecc87a57b3d639fba369.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 645, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii U"], "developers": ["KOEI"], "genres": [], "publishers": ["Tecmo Koei America"], "esrb_rating": null}