{"id": 27209, "slug": "family-party-30-great-games-obstacle-arcade", "name": "Family Party: 30 Great Games Obstacle Arcade", "name_original": "Family Party: 30 Great Games Obstacle Arcade", "description": "<p>\n      Exclusively for the Wii U™ system from Nintendo, Obstacle Arcade lets \n      players participate in over 30 party games specifically designed for \n      multiplayer. Delivering an unmatched combination of variety and value, \n      it features dozens of hysterical obstacle courses, popular sporting \n      events, and arcade and brain challenges.\n    </p><p>\n</p><p>\n      Family Party: 30 Great Games Obstacle Arcade takes players to “Family \n      Party Land”, a magical island loaded with a combination of familiar \n      games and over-the-top challenges. Dodge barrels, ride horses, skydive, \n      shoot rockets, kick goals, and more. Rule the island by earning medals \n      and high scores, and unlocking new games.\n    </p><p>\n      Features\n    </p><p>\n      • Over 30 fun party games that highlight the all-new Wii U™ system! <br/>–Use \n      the all-new Wii U™ GamePad in special 1-on-3 multiplayer challenges<br/>–Aim \n      and shoot with the Wii U™ GamePad to kick soccer balls or to act as a \n      game master in hidden card games and obstacle course challenges.<br/>–Tilt \n      the Wii U™ GamePad to roll giant balls, to fly through space in zero \n      gravity, or to block projectiles as a shield<br/>–Track high scores and \n      game progress on the Wii U™ GamePad’s display\n    </p><p>\n      • Loaded with fun games custom made for family play, including tons \n      of extreme obstacle courses, sports, and arcade game challenges <br/>–Over \n      the top obstacles: Giant bouncing balls, alligator jumping, crazy \n      hurdles, jetpacks vs. rocket launchers, and other thrills!<br/>–Sports: \n      Everything from air hockey to eating contests to rodeo<br/>–Fun for the \n      whole family: Arcade games, card games, and more<br/>• An unmatched \n      combination of variety and value! <br/>–All games designed for \n      4-player multiplayer and all-ages family competition –Win trophies and \n      achieve high scores to unlock new games and characters<br/>–Less than $1 \n      a game for over 30 fun party games that showcase the all-new Wii U™ \n      system.\n    </p>", "metacritic": null, "released": "2012-11-30", "tba": false, "updated": "2019-09-12T06:39:11", "background_image": "https://media.rawg.io/media/screenshots/2c4/2c49913d5f0c833fafb9b02e5e86b1ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii U"], "developers": [], "genres": [], "publishers": ["D3 Publisher"], "esrb_rating": null}