{"id": 2720, "slug": "eve-of-impact", "name": "Eve of Impact", "name_original": "Eve of Impact", "description": "Blast away at an increasing barrage of asteroids to protect earth from destruction!<br/><br/>Tap your screen to fire missiles at incoming asteroids, watch the immense explosions push away or shatter their targets. Aim carefully because the more missiles explode the more panic is caused and the slower earth&amp;#39;s evacuation progresses. The moment you can no longer hold of the barrage of asteroids you witness the end of earth as it has never been shown in any mobile game.<br/><br/>Can you hold of the asteroids long enough, giving mankind a chance to survive?<br/><br/><br/>PRESS<br/><br/>&amp;quot;Eve of Impact is among the 5 best iPhone games of the week. There’s something both haunting and mesmerizing about this one.&amp;quot;<br/>Appolicious<br/><br/>&amp;quot;A beautifully crafted game exhibiting an original idea with detailed lights, explosions and missile trails. I can definitely recommend it.&amp;quot; <br/>AppAdvice 5/5<br/><br/>&amp;quot;The graphics, animations, physics, and sounds all come together to create one hell of an immersive experience, especially for an arcade tapping game.&amp;quot;<br/>The App Shack 4/5<br/><br/>&amp;quot;A simple, yet well-done mix of Asteroids and Missile Command that’s perfect for a minute or two of free time.&amp;quot;<br/>Slide to Play 4/5<br/><br/>&amp;quot;Eve of Impact does a magnificent take at saving the earth from impending destruction by asteroids, with its stunning visual effects and simplistic gameplay style.&amp;quot;<br/>What&amp;#39;s On iPhone 4/5<br/><br/><br/>HIGHLIGHTS<br/><br/>● Cinematic lifelike visuals that will pull you in.<br/>● Challenging fast and strategic gameplay.<br/>● Unique gameplay influenced score system.<br/>● Dramatic and thrilling end game animations.<br/>● Online leader boards and achievements.<br/>● Ideal for those short pick up and play sessions.<br/>● Can be enjoyed on both your iPad and iPhone.<br/><br/><br/>CREDITS<br/><br/>Soundtrack by Remy van Dun<br/><br/>Beta testing by Frank Buiting, Leon Schrijvers and Marc te Vruchte", "metacritic": null, "released": "2011-10-20", "tba": false, "updated": "2019-10-22T14:28:10", "background_image": "https://media.rawg.io/media/screenshots/d5e/d5ed38be863500246cf95da8b8b11e0e.jpeg", "website": "http://www.eveofimpact.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rik Schennink"], "genres": ["Action", "Arcade"], "publishers": ["H.J.F. Schennink"], "esrb_rating": "Everyone 10+"}