{"id": 272182, "slug": "dungeon-exploration-prototype-dep", "name": "Dungeon Exploration Prototype (DEP)", "name_original": "Dungeon Exploration Prototype (DEP)", "description": "GREAT ADVENTURE IS NOT CHEAP!\r\n\r\n<p>Proper equipment, food, information and treasure maps... all of it costs money. That's why an experienced adventurer should always aim to get enough loot from the adventure to pay the bills.</p>\n<p>But is that enough for you? Will you be satisfied with simple reasonable profit? Or do you want more?</p>\n<ul><li>Follow the leads the treasure hints are revealing.</li><li>Overcome many trials on the way.</li><li>Find four Shiny Gems and discover what's hidden behind the locked doors.</li></ul>\n\r\nEPOCHA TOWER\r\n<p>Dungeon Exploration Prototype was made in the pre-production phase of the main project, The Epocha Tower. It is a proof of concept with which we wanted to test creating a top-down game focused solely on exploration and nothing else.\r\n</p>\n<p>Even though the Epocha Tower will have enemies, RPG system, NPC's and more, the exploration will play an important role present in all the aspects of the final game. That's why we wanted to make double sure we understand it well.</p>\n<p>Whether you liked it or not, rest assured the final product is already considerably better, as this prototype served primarily as a learning experience.</p>\n\r\nTELL US EVERYTHING \r\n<p>Do you wanna share your experience with us? Are you interested to see how you did compared to others? Or do you have a suggestion about what could make the game better?</p>\r\nTwitter - Discord - Forum\r\n<p>If you want to follow us on our journey, you can also do so  by signing into our newsletter at:</p>\r\n EpochaTower.com\r\n\r\nCREDITS\r\n<p>Game made by <strong>Emil Gašparec</strong> - @pwMoti</p>\n<p>Music and Sound design by<strong> Ben McCulloch</strong> - ben@benmcculloch.com</p>\n<p>The Guide created by: <strong>Emil Gašparec</strong> (@pwMoti) and Zalost</p>\n\r\nTHE GUIDE\r\n<p>As a thank you for anyone who supported the project financially, I’ve prepared a small token of gratitude. It’s a guide for the dungeon. <br/></p>\n<p>The whole guide is written as a diary of an adventurer who visited the dungeon before the player. It contains additional lore bits and of course solutions to all of the main puzzles and secrets that are in the game. It's not a 1:1 guide, as the dungeon deteriorated significantly since the author of the diary visited it. It shows what needs to be done to get behind the final door, but leaves a lot of freedom for your own exploration. It's 9 pages long. The preview of it is in the screenshots.</p>\n<p>All the money will go into the production of the main project.</p>\n<p><strong>Thank you for your support.</strong></p>", "metacritic": null, "released": "2018-11-30", "tba": false, "updated": "2019-08-28T23:19:14", "background_image": "https://media.rawg.io/media/screenshots/6e7/6e7541e6d56730ce92e5be3dbe44fc4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Please wait"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}