{"id": 272247, "slug": "digi-card-prism-vikings", "name": "Digi Card Prism Vikings", "name_original": "Digi Card Prism Vikings", "description": "<p>Digi Card Prism Vikings is a hybrid 2d/cartoon art-style RPG Maker RPG! You know those old Sentai shows with the stock footage that you didn't care look quite right? Yea, We tried to put that in video game form! Customization is key! Choose to make your viking a power attacker by putting permanent upgrades in his strength then boost it higher with cards! Or for those who need a Pinch of HP swap one out when you feel you need the boost!</p>\n<p>Here's the story!</p>\n<p>Data Card Prism Vikings is a massively popular card battle game in Glassshade, a medium-sized suburb that has the currently only operating factory and arcade: Asgard. No one knows who the founder is, but a young lady seems to be running the counter, drawing many teens in to play her card game. It seems this young lady is actually the owner of Asgard: Frigg, and is looking for more than just some hit card sales! She is looking for 7 warriors to become the Prism Vikings described on her main series of cards!\r\n  </p>\n<p> When the Legendary Official Kode Interceptors  (L.O.K.I) finally arrived, she knew time was short! The school’s principal was the first to have his DNA Code intercepted; he was turned into a chair. At that moment, she knew she didn’t have much time…</p>\n<p>With danger looming and more people being turned into harmless objects, Frigg pulled the only group of teens into her secret base: the D.C.V.S. Base. She hands each of them a prismatic Gjallarhorn and 5 stat cards. When the gjallarhorn is blown, they will become the Prism Vikings: a superhero team that can change their abilities with their data cards at any time! One card could make them resistant to freezing… Another could beef their strength! With these cards, the combinations are endless! It’s also makes sure that L.O.K.I. can’t modify their DNA, as their code is protected by Frigg and the powers that be. \r\n</p>\n<p>As this is a prototype we thought chapter 6 in the game would be a decent place to set you. Which is based on expanding the plot of Titania Reyes who's Prism Viking is Valkyrie pink also known as Eir. Will she be able to save her mom's ballet class and the day or will L.O.K.I. turn them into something different! It's up to you to find out!</p>\n<p>Here is our Lovely Cast of Vikings.</p>\n\n<p>Son of a decent Salaryman.  He doesn't expect to do very much with his life… He enjoys Martial Arts, especially watching his heroes on the big screen.<br/></p>\n\n\n<p>Daughter of one of the teachers in the school. She just moved in and is still trying to make friends. She has loved Archery since she was a little kid, when her dad would work renaissance fares.</p>\n\n\n<p>Son of the real estate agency that sold Asgard to Frigg, and whose parents expect him to be a socialite. He has always been class rep. and expects the students to ALWAYS follow the rules.</p>\n\n\n<p>Avid golf fan and the school’s golf ace! No one seems to get how he wins matches and comes in under par in even the worst situations. The swim team hates the golf team, and he butts heads with them a lot!</p>\n<br/>\n\n<p>The swim club’s record setting torpedo! He is always practicing his dives and making sure he is in peak performance! It’s rumored that he might already be scouted for olympic gold!</p>\n\n<p>A dancer since she could walk; she’s the girliest member of the bunch. Being a 3rd generation Ballerina means she has a reputation to uphold. It also means that, with her beauty, all the guys want her.</p>\n\n<p>Son of a scientist and an astronaut; his talent is his brains. Constant honor roll mention and the No. 1 student. Often hangs with Kalmin and helps EVERYONE study.</p>\n<p>That is just the civilian forms! To See all the characters Check out who we commissioned the art from as he also posted them!</p>\n<p>The Civilians</p>\n<p>https://www.deviantart.com/pariahexilewrath/art/RPG-Civilians-commission-7734606...<br/></p>\n<p>The Neutral cast</p>\n<p>https://www.deviantart.com/pariahexilewrath/art/RPG-Neutrals-commission-77346075...<br/></p>\n<p>The Viking Cast</p>\n<p>https://www.deviantart.com/pariahexilewrath/art/RPG-Vikings-commission-773460867<br/></p>\n<p>L.O.K.I. Chapter six cast</p>\n<p>https://www.deviantart.com/pariahexilewrath/art/RPG-Villains-commission-77346095...<br/></p>", "metacritic": null, "released": "2018-11-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3e6/3e6103bfb68248a13d267a87e6725723.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LWentworth8567"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}