{"id": 27222, "slug": "witchs-cat", "name": "Witch's Cat", "name_original": "Witch's Cat", "description": "<p>\n      In the previous adventure, the Queen sent a large group of her precious \n      minions, the Cheshire Cats, to find and capture Alice and Rabi. Shortly, \n      after they were captured, one of the Queen’s minions, a Cheshire Cat \n      named Alicia, became curious of Alice and instinctually knew that Alice \n      was a good person. Alicia, unknown to Alice and Rabi, helped them both \n      escape from their imprisonment.\n    </p><p>\n</p><p>\n      Frustrated with the fact of Alicia’s inability to communicate with \n      Alice, she wished to become human in order to speak, hoping to become \n      friends with Alice. The Queen learned of Alicia’s secret desire and \n      banished her from her kingdom.\n    </p><p>\n</p><p>\n      Dubois a powerful witch with a questionable reputation and a foe of the \n      Queen discovered Alicia and helped her escape from her imprisonment. \n      Dubois is already familiar with Alicia’s desire to become human, and \n      offered her assistance to help her become human. Alicia, well aware that \n      she is no longer welcomed in Wonderland, and with her deep desire to \n      become a human, reluctantly accepted her proposal, despite Dubois’s \n      reputation.\n    </p><p>\n</p><p>\n      Together Alicia and Dubois set out on an ambitious journey to escape \n      Wonderland and travel to the human world. Alicia will learn many \n      abilities to help her on her quest. She will be able to transfer from \n      human to cat at will and with Dubois’s help she will learn various types \n      of magic. Not only will escaping Wonderland be nearly impossible, but \n      Alicia must also deal with the fact that her friends in Wonderland are \n      now her enemies and over time will realize Dubois intentions are not \n      what they seem.\n    </p><p>\n</p><p>\n      Witch’s cat is not only a puzzle game, but Alicia’s personal journey of \n      faith, courage and betrayal. Will Alicia dream become a reality and will \n      she make it to the human world to find Alice? Or will she be forever \n      lost and forgotten in the world of Wonderland.\n    </p><p>\n</p><p>\n      Use Alicia’s abilities to transform between a cat and human at will to \n      complete stages, learn and master each type of magic and pay close \n      attention to those who are truly trying to help as opposed to those who \n      have their own desires.\n    </p><p>\n      Features\n    </p><p>\n      -50 stages designed by the Queen<br/>-Transform from human to cat at will<br/>-Master \n      various types of Magic that can alter stages.<br/>-Discover the dark \n      secrets of Wonderland\n    </p>", "metacritic": null, "released": "2013-01-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e7b/e7be97d13e5c6e2d2ac7186e9209c372.jpg", "website": "http://www.agetec.com/Nintendo3DS/witchs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo 3DS"], "developers": [], "genres": [], "publishers": ["Agetec"], "esrb_rating": null}