{"id": 272304, "slug": "bingo-pinball", "name": "Bingo Pinball", "name_original": "Bingo Pinball", "description": "NOTE:\r\n\r\nThis game is in beta mode and is undergoing constant changes and such.  Any feedback,  questions, suggestions, reports of bugs to be squashed or of course pictures of puppies from any of you bold testers will be very helpful.  Thank you for checking my game out!\r\n\r\n#  Quick Game Overview:\r\n<p>You have 5 pinballs and up to 6 bingo cards. Each card, is essentially, a traditional bingo card with a 5x5 layout.  Instead of the normal range of possible values found in traditional bingo, each card will contain every number from 1-25, in a preconfigured lay out.  <strong>Your goal</strong> is to land the pinballs in the numbered holes on the playfield to create a line of 3, 4 or 5 numbers on the bingo card.  If successful, you will be paid a predetermined amount for the card, where you have \"hit\" or landed in the correct holes to make line of  3 or more numbers (the numbers must be touching each other in order to count). </p>\n\r\n#  Game Details:  \r\n\r\n<strong>Starting a game</strong>\n<p>Currently a max amount of 10 credits is required  to play a full featured game. You can play a game with only one credit, but for each additional credit you insert, you will increase your overall odds/payout for that single game.  This is further described in the list below, which explains what is unlocked per credit:</p>\n<em>Credit(s) Inserted</em><em>Unlocks</em><strong>1</strong>Inserting  <strong>Credit #1</strong> will unlock and enable the first card for play/payout.<strong>2...6</strong>Each additional <strong>Credit</strong>, up until <strong>Credit #6</strong>, will unlock the next card in sequence. It is important to understand that each card has a different number layout, as well as different payout amounts.  Card 1 has the lowest payout amounts, while Card 6 has the highest payout amounts (exact payout amounts for each card can be found at the end of this post)<strong>7...8</strong>Without <strong>Credit #7 or #8</strong>, the only diagonal lines that are possible to score on, are the diagonal lines that make up the center X shape of that card.. However with these credits, you can score any on any diagonal line (whether it be 3-in-line or 4-in-a-line) found on that card.  More specifically, <strong>Credit #7</strong> unlocks this feature for Cards 1, 2 &amp; 3, while <strong>Credit #8</strong> Unlocks this feature for Cards 4, 5 &amp; 6. This feature, when active, shows the red box in the bottom right corner of each card with the text \"Diagonal\".<strong>9...10</strong><strong>Credit #9 - #10</strong> are, as you might imagine, very important to your success and profit as pinball hero.  These credits will unlock a feature called \"Magic Number\", specifically, <strong>Credit #9</strong> will unlock this for Cards 1, 2 &amp; 3 and <strong>Credit # 10</strong> will unlock this for Cards 4, 5 &amp; 6.  The magic number feature, if active, chooses a random number from 5 possible numbers to be that games magic number. This happens prior to shooting the first ball, allowing you to change your \"best set\" of numbers to aim for.  There are only 5 possible magic numbers: 1, 7, 9, 21 or 25.  For each card that has this feature enabled, there will be a purple box to the right of that card, which is also where you will see the current magic number that has been chosen for that game.  If you land a ball in same number hole as the magic number, you will notice your final payout will be doubled! This is an essential feature for any real \"try-hards\" out there.\r\n<p>Additionally:</p>\r\n\r\nAfter Credit #10 is inserted, no more credits will be accepted, <br/><br/>After any amount of credits are inserted, you can start the game \r\nor cancel/refund \r\nNote: Cancel will return all credits you may have inserted\r\nat this time you can not remove individual credits inserted.\r\n<br/> There is also a button which provides an easy way to automatically \r\ninsert any remaining credits, until you've reached the maximum \r\nof 10 credits. This is a good way to ensure a full featured game, \r\nwithout having to manually insert  each individual credit.\r\n\r\nRandom Occurring Features:\r\n<p><em>Regardless</em> of how many credits are inserted. there are two additional features which may be activated, which is decided randomly, prior to shooting the first ball of that game. These two features may be activated fully at the game start, or they may activate a \"roll-over\" button found on the playfield, that when hit will fully activate that feature.</p>\r\n[ Notice: Currently the UI does not clearly show whether that feature is active or needs to be activated via roll-over button.  If you see that the roll over button is brightly-colored that means it is not fully activated and requires you to maneuver the pinball in a way to \"roll-over\" the corresponding button, which will then fully activate that feature]\r\n<p>If the features, which are shown on the left of each card, are not active at all during that game &amp; can not be activated, the feature will show as \"disabled\"/grayed out.  If the feature requires the roll-over button to activate, or are fully activated, they will show, in the box found to the left of the cards, in full color just as the other features are displayed. The roll over buttons are found low on the playfield, a yellow one, which is left of the #19 Hole, and a red one, which is to the right of the #22 Hole.  The corresponding feature can only be fully activated, if the button is \"lit up\" (brightly colored/saturated). While they are inactive and non interactable they show as \"unlit\" (dim/unsaturated) .</p>\n<p>The features which occur randomly are described in the table below:</p><strong>Feature</strong><strong>Effect when fully activated</strong><strong>Corners (Yellow/Orange)</strong>Allows the numbers that make up the 4 corners of a card to count as a winning hit, which pays out the amount that card is set to pay out for 5-in-a-line!<strong>Superline (Green)</strong>Upgrades any scoring line found on the superline (superline location is always the 4th row of a card, this is shown in green if fully activated).  Specifically this means, if you get 3 in a line on the superline, it will pay out the amount that card is set to pay for 4 in a line, as well as if you get 4 in a line on the superline, you will receive the 5 in a line payout.  (5 in a line on the superline will not be upgraded, and will payout the amount for 5 in a line as normal)<strong>Pinball Gameplay:</strong><p>After you have acknowledged your current game \"set\", by clicking the button labeled, continue game, you will be shown the pinball playfield.  </p><p>This part is a work in progress, as of right now, you can shoot the ball ball tapping the screen.  If you make the ball in the bottom center hole, also known as home, your ball will be returned to the shooting area to be replayed.   After each ball you will be shown the cards, with any numbers you landed in, shown as hit numbers.  At the end of the game you will be shown out the payouts received for each card,   and you can restart the game or exit.</p><strong>Card Payouts:</strong><p>The cards are displayed in the order shown in the table below, and the payout for that card is also described below:</p><strong>Card 1</strong>   [ 4 ] ; [ 20 ] ; [ 100 ]     <strong>Card 2</strong>   [ 4 ] ; [ 20 ] ; [ 100 ]<strong>Card 3</strong>   [ 4 ] ; [ 20 ] ; [ 120 ] <strong>Card 4 </strong>  [ 4 ] ; [ 24 ] ; [ 140 ]<strong>Card 5</strong>   [ 4 ] ; [ 36 ] ; [ 240 ]<strong>Card 6</strong>   [ 4 ] ; [ 44 ] ; [ 300 ]\r\n<p>The first number shown is the payout for 3 in a line, the next is 4 in a line and finally 5 in a line. </p><p>That should be all the information you need in order to play, thanks for your time and goodluck!  </p><p>This game was originally inspired by the Bally pinball machine: Dixieland.</p>\n<p>- SwK</p>", "metacritic": null, "released": "2018-11-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/658/6580de2f80d7735025c1bed98e99f55c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SwK"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}