{"id": 27237, "slug": "legend-of-the-river-king", "name": "Legend of the River King", "name_original": "Legend of the River King", "description": "<p>\r\n      Original Release Date: November 1999.\r\n    </p><p>\r\n      The Legend of the River King is a unique fishing RPG that offers two \r\n      great modes, putting your angling and survival skills to the test!\r\n    </p><p>\r\n      Select Fish mode, and follow a young boy’s quest for the elusive \r\n      Guardian Fish. Only with its magical powers can he save his sister from \r\n      a mysterious illness. Choose a fishing spot from the quiet lakes to the \r\n      raging rapids. Check the water conditions, and then select from a \r\n      variety of fishing rods and tackle. But watch out, because dangerous \r\n      animals will attack you along the shores! Stop at the local villages to \r\n      sell your catch and restock on supplies, or rest at an inn before moving \r\n      on. Catch all 40 different species of fish to reveal a new fishing spot!\r\n    </p><p>\r\n      You can also try your hand at raising a pet fish in Raise mode. Keep \r\n      your fish happy by regularly checking its status and cleaning its tank, \r\n      and watch as it evolves into a different species!\r\n    </p><p>This game is only playable in 2D.</p><p>This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.</p>", "metacritic": null, "released": "1997-09-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5e2/5e24d684120ebc980d56d72217244091.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 4, "reviews_count": 0, "platforms": ["Nintendo 3DS", "Game Boy", "Game Boy Color"], "developers": ["Victor Interactive Software"], "genres": [], "publishers": ["Natsume"], "esrb_rating": null}