{"id": 272422, "slug": "darkwinds", "name": "Darkwinds", "name_original": "Darkwinds", "description": "Darkwinds is an online trading card game that runs on top of the Ethereum network. More specifically, all Darkwinds cards are non-fungible tokens or cryptocollectibles, a new standard (ERC721) for virtual objects where players have perpetual rights to sell, trade and use their items, both within and outside of the game's ecosystem. This is possible thanks to the same technology that makes cryptocurrency possible, as Darkwinds cards exist on the same Blockchain used by all Ethereum tokens. <br/><br/>In this new groundbreaking pirate-themed game, players fight each other to become the great grand master of the seven seas. Players will uncover the legend of a powerful and cursed treasure chest that, when opened, spews an enormous anticyclone that lasts for months. The resulting upheaval annihilates a portion of mankind and spawns all types of fantastic creatures. These creatures and other game elements are represented as unique trading cards. <br/><br/><strong>Features</strong><br/><br/>    Players are free to trade and sell cards in and outside the game<br/>    All cards are stored on the Ethereum Blockchain<br/>    Players can purchase Booster packs of cards with ETH<br/>    All cards are printed by a smart contract pseudo-randomly<br/>    Design your strategy deck with creatures, spells and abilities<br/>    Competitive leaderboards based on the TrueSkill system<br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2018-12-21", "tba": false, "updated": "2019-08-23T12:11:20", "background_image": "https://media.rawg.io/media/screenshots/e84/e8418eba920429823bfd1710caef15b0.jpg", "website": "http://mego.cl", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MEGO Games"], "genres": ["Strategy"], "publishers": ["Mego Games"], "esrb_rating": null}