{"id": 272494, "slug": "tenkiame-tian-qi-yu", "name": "Tenkiame / 天気雨", "name_original": "Tenkiame / 天気雨", "description": "Due to unforeseen circumstances, one comes from the big city to the peaceful countryside...<br/>…and meets attractive girls there.<br/>An innocent little girl named \"Shiro\", and…<br/>...a quiet, yet mischievous older sister, \"Kon\".<br/>The memories of one summer together with them.GenreExciting Fox-Ears AdventureHighlights<ul><li>Featuring ears and tails that move in real time, using E-mote, to accent the attractiveness of the Fox-Girls!<br/></li><li>A heartfelt story set in the summer countryside!</li></ul>STORYA sunny summer vacation…\t<br/>I received a call that my grandfather was in bad health.\t<br/>I felt a bit troubled.<br/>But, in order to help out, as the only son of busy parents,<br/>I went to stay at my grandparent's house.<br/><br/>Fortunately, the condition of my grandfather was not serious.\t<br/>I spent a relaxing time catching up with my grandparents, after not seeing them for a long time.<br/>My grandmother said that the nature here was threatened.<br/>It seemed that massive urban development was just around the corner if I didn't take over the land.<br/>At that time, my point of view was that it was simply a sign of the times, but…\t<br/><br/>I went out on the porch after hearing the sound of wind chimes...<br/>…and it was a quiet, green, and pleasant place.<br/>Despite being a hot summer, the wind was cool and clear, and I heard the gentle sound of the leaves rustling.<br/><br/>\"The wind…so comfortable.\"<br/><br/>Then I noticed a little girl was there nearby in the sunshine.<br/>Her seductive, beautiful hair was mountain-shaped…due to her ears.<br/><br/>I was fascinated by the girl's smile in front of me and the whispers of nature...<br/><br/>An innocent and curious fox, \"Shiro\", and the modest fox taking care of everyone, \"Kon\".<br/>In this way, our little love story begins…", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:26", "background_image": "https://media.rawg.io/media/screenshots/4f0/4f0b9c026fea880141effcd10cc0623c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gumisoft"], "genres": ["Adventure"], "publishers": ["ARTLINK"], "esrb_rating": null}