{"id": 272471, "slug": "elleros-origins-season-i", "name": "Elleros Origins: Season I", "name_original": "Elleros Origins: Season I", "description": "You are the only one who can stop the cataclysm from destroying the land of Elleros. <br/><br/>Every 400 years a cataclysm wipes out nearly all life in the land of Elleros. The last cataclysm was 399 years ago. This is the year everything changes.<br/><br/> Elleros brings to life a complete open world for you to explore in any way you choose. From exploring ancient caves to battling corrupted necromancers, Elleros enables you to play the way you choose. <br/><br/>The fate of the TriImperium hangs in the balance. Battle, Explore and Command: Choices define your experience, and even one decision can change the course of history in Elleros.<br/><br/><strong>A Stunning World to Explore</strong><br/><ul><li>Travel throughout countless biomes and fully immerse yourself in a world that is on the brink of cataclysm. <br/></li><li>Season one features three towns, miles of open world and six plains of the abyssal realms. <br/></li><li>Encounter detailed lore and varied magical realms, while meeting or slaying the realms denizens. </li></ul><br/><strong>Play however you choose</strong><br/><ul><li>Tailor experience from the very beginning. There are no character classes, you can shape your play-style as you please. Play as a mystic and monk who wields a broom refuses to use weapons, a dark magician riddled with magic diseases, or a knight clad in armor favoring a shield. <br/></li><li>Schools of magic, faith miracles, dark secrets and the weapons of humility enable you to play in the way you decide. <br/></li><li>Decide how to handle complex issues like corruption and magic diseases, miracles, and upgrades like runes or faith.</li></ul><br/><strong>Detailed Character Customization</strong><br/><ul><li>Sculpt your champion in your own fantasy or image. The character creator allows you to create your a hero unique from anyone else, and change or mutate them over time. <br/></li><li>Shape your character’s reputation and morality based on consequences of actions you make throughout the game</li></ul><br/><strong>Engage in Powerful, Terrifying Combat</strong><br/><ul><li>Battle against necromancers, dark magicians hordes of the undead or bandits.<br/></li><li>Unleash spells, monastic powers, stances and 115 different magical spells and skills.</li></ul><br/><strong>True next generation</strong><br/><ul><li>Day/night cycles and dynamic weather systems affect how the towns citizens, and monsters of Elleros behave.<br/></li><li>Build from the ground up for next generation hardware to provide stunning game world realism. </li></ul>", "metacritic": null, "released": "2018-12-18", "tba": false, "updated": "2019-08-28T21:50:28", "background_image": "https://media.rawg.io/media/screenshots/7bc/7bc1b7fb9167e15e94280454289cb5fe.jpg", "website": "http://rampagegames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rampage Games"], "genres": ["RPG"], "publishers": ["Rampage Games"], "esrb_rating": null}