{"id": 272483, "slug": "whispers-of-a-machine", "name": "Whispers of a Machine", "name_original": "Whispers of a Machine", "description": "<p>Whispers of a Machine is a Sci-Fi Nordic Noir that tells the story of Vera, a cybernetically augmented special agent tasked with investigating a string of murders.</p>\n<p>Due to the wounds of our past, AI is outlawed and now nearly non-existent. However, as the threads of Vera’s case begin to unravel, she is pulled into an invisible war between two opposing forces — those who are intent on destroying AI, no matter the cost, and those who seek to awaken it again, regarding it a lost deity in a godless world.</p>\n<p>To help in her mission, Vera has been equipped with an advanced nano-substance called Blue. This rare and sought-after technology allows her to develop superhuman abilities adapted to her psychological mindset.</p>\n<p>Choose your methods and utilize these augmentations to investigate, gather information, and solve puzzles with solutions shaped by your choices.</p>\n<p>In this gripping story with existential twists and multiple endings, what Vera uncovers will have monumental consequences for humanity — will we be able find a way to peacefully coexist with AI, or will one of us inevitably destroy the other?</p>\n<p>• INVESTIGATION, AUGMENTED: Will Vera approach situations with a more empathetic, analytical, or assertive style? Your choices will impact her augmentations and subsequent puzzle solutions.</p>\n<p>• A POST-AI FUTURISTIC DYSTOPIA: Immerse yourself in a realized world of beautifully hand-drawn pixel art design and gorgeous settings influenced by the Nordics.</p>\n<p>• POINT-AND-CLICK INNOVATION: A groundbreaking entry to the point-and-click adventure game genre by the experienced developers of Kathy Rain and The Samaritan Paradox.</p>", "metacritic": 77, "released": null, "tba": true, "updated": "2024-01-11T14:44:36", "background_image": "https://media.rawg.io/media/screenshots/a1e/a1e4ac4a6250cd633e760a10de4bde19.jpg", "website": "http://www.whispersofamachine.com/", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 90, "owned": 830, "beaten": 20, "toplay": 25, "dropped": 6}, "playtime": 4, "achievements_count": 6, "ratings_count": 29, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 29, "platforms": ["PC", "macOS", "iOS"], "developers": ["Raw Fury", "Clifftop Games", "Faravid Interactive"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Raw Fury"], "esrb_rating": null}