{"id": 272489, "slug": "debris-field", "name": "Debris Field", "name_original": "Debris Field", "description": "Got a job for you<br/>A simple smash and grab, nothing too complicated. You see, during the evacuation of the now corrupted sectors, a whole lot of valuable material got left behind. Most of that material is still there, just waiting for someone crazy enough to fight their way through the endless swarm of crazed zealots that guard the place. <br/><br/>But I trust that won't be a problem for a madman like you.About<br/>Debris Field is a top down physics based space shooter with rogue-like elements, that focuses on using Newtonian movement to out maneuver swarms of enemies. <br/><br/>You will have to fight your way through a series of unforgiving arenas, learning to use Newtonian movement to give yourself an edge over your enemies. Upgrade your ship and your weapons along the way whatever you can find, but don't take too long, as the enemy will soon overwhelm you.<br/><br/>The full game contains:<br/><br/>    Physics based movement<br/>    5 unique levels with different terrain and enemies<br/>    Several starting ships, with different stats and loadouts<br/>    A dynamic system of incremental stacking upgrades<br/>    A persistent difficulty over time system to keep you on your toes<br/><br/>The Demo contains only the first level, but is otherwise unlimited.<br/><br/>Follow me on Twitter @BinaryNomadDev for news and development updatesThank You!", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2020-03-19T14:18:49", "background_image": "https://media.rawg.io/media/screenshots/e58/e581a7cb592ac616f2a71d9565228bb2.jpg", "website": "http://binarynomad.gitlab.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Binary Nomad", "Binary Nomad Games"], "genres": ["Action", "Indie"], "publishers": ["Binary Nomad Games"], "esrb_rating": null}