{"id": 272452, "slug": "island-of-virgins", "name": "Island of Virgins", "name_original": "Island of Virgins", "description": "Island of Virgins - fun game match 3, with the elements of a visual novel. You have to strip 5 hot and sweet girls. Immerse yourself in the fantastic world of Virginia, where swords, daggers, and magic reign. Use your thinking and smash the shackles of crystalline virgins.<br/><br/>Sailor, assistant captain, he is courageous, agile and slim. Sent on his first trip to the sea. A ship named Hades carries his crew through the endless kingdom of Poseidon.<br/>The sea quietly lulled the sailors heart, the low sun was fiery red, a long ridge of heavy clouds gradually covered part of the horizon. The clouds gradually hid the sun, but dim light illuminated the sea covered with waves.<br/>Suddenly a storm began, the waves disappeared behind a wall of freezing rain. It was a terrible noise: the wind roared in the mast and the sails, the rolling waves roared, the waves crashed with a splash, swaying the ship more and more. Incessantly rang and moaned rigging. The excitement grew stronger as the ship moved worse and worse.<br/>Thunder and lightning cut the sky and suddenly ... at one moment lightning, like a spear of Zeus, split the ship in half and the waves swallowed it together with the crew.<br/>After wandering on the wreckage of a wrecked ship, in the balance of death, our hero woke up on an island without memory. What does this island hide in itself, death or a chance for a new life?", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:29", "background_image": "https://media.rawg.io/media/screenshots/f88/f880e75a0c4b158e237b56d390782aec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cyber Keks"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Cyber Keks"], "esrb_rating": null}