{"id": 27240, "slug": "dillons-rolling-western-the-last-ranger", "name": "Dillon's Rolling Western: The Last Ranger", "name_original": "Dillon's Rolling Western: The Last Ranger", "description": "<p>\n      Last year, we launched Dillon’s Rolling Western for the Nintendo 3DS \n      eShop. Dillon is headed back to the eShop in a sequel called Dillon’s \n      Rolling Western: The Last Ranger. This is an action tower-defense game \n      which combines the strategy elements of Dillon defeating enemies with \n      weapon emplacements that players can deploy around the map, and the \n      action elements of Dillon directly attacking opponents with flashy \n      action moves like rolling attacks and claw slashes. New to “The Last \n      Ranger,” Dillon can recruit new allies by battling and defeating them \n      throughout the game. There’s the strong but greedy lizard gunman Gallo, \n      the foolish but powerful bear Boone and the mysterious squid assassin \n      from the East Sea, Nomad.\n    </p><p>\n</p><p>\n      In addition to keeping villages safe from harm from the waves of \n      approaching enemies, Dillon must now also protect a train that moves \n      throughout each of the game’s main stages. Players now have more \n      strategic options to consider, but can share tips on how to clear stages \n      with others via StreetPass. Dillon’s Rolling Western: The Last Ranger \n      will be available in the Nintendo eShop on April 11.\n    </p>", "metacritic": null, "released": "2013-04-11", "tba": false, "updated": "2019-09-12T06:37:35", "background_image": "https://media.rawg.io/media/screenshots/86a/86a6d8c1c04eedc44463bcc0affa8b23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 368, "game_series_count": 2, "reviews_count": 0, "platforms": ["Nintendo 3DS"], "developers": [], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}