{"id": 272475, "slug": "butterbies", "name": "Butterbies", "name_original": "Butterbies", "description": "Meet the Butterbies.. your new best friends...<br/>\n<br/>\r\nOur little baby caterpillar egg is lost and needs your help! <br/>\n<br/>\r\nCan you take care of our lost egg, clean, feed and play mini games including Dress Up with your own virtual pet and watch it grow into a beautiful butterfly?<br/>\n<br/>\r\nWho knows when it grows up it may be a Princess, Witch, Mermaid, Doctor or Fairy Butterfly.<br/>\n<br/>\r\nFUN FEATURES &amp; MINI GAMES <br/>\n<br/>\r\n*  PLAY exciting mini games, do chores and earn coins for your Pet   <br/>\r\n*  FEED, clean and take care of your virtual pet and watch it grow from a caterpillar egg into a beautiful Butterfly<br/>\r\n*  COLLECT the Princess, Fairy, Witch, Ballerina, Mermaid, Pop star, Vampire and Astronaut Butterflies pets and watch your collection grow and grow.<br/>\r\n*  STROKE and tickle your virtual pet egg and see how they respond <br/>\r\n*  DECORATE your pet’s home with wallpapers, flowers, blinds and lamps.<br/>\r\n*  DRESS UP your pet, play games and take funny photographs <br/>\r\n*  ACHIEVEMENTS to unlock and get rewards as you level up<br/>\r\n*  ADOPT new eggs from the nursery <br/>\n<br/>\n<br/>\r\nAnd much much more with over 8 different Butterbies pets to collect!<br/>\n<br/>\r\nButterbies is available in English <br/>\n<br/>\r\nA NOTE FOR THE PARENTS<br/>\n<br/>\r\nThe Butterbies is a virtual pet simulation for children.  The child can adopt and take care of a lost caterpillar egg and raise it to a beautiful butterfly. This process will teach the child what it takes to look after a pet properly.  They can earn coins by carrying out chores and looking after the pet. If neglected the pet does not die it just looks sad and uncared for.  The game includes activities with positive affirmations which will develop children’s reasoning, reflexes, co-ordination and motor skills <br/>\n<br/>\r\nWe always welcome your suggestions about how we can improve The Butterbies simulation and add new features and cool stuff. If you have any issues with the game, just contact us and we will help.", "metacritic": null, "released": "2018-12-18", "tba": false, "updated": "2019-08-28T21:50:27", "background_image": "https://media.rawg.io/media/screenshots/807/80753c378ecb02cea3a0ddf8e806a0e0.jpg", "website": "http://www.butterbies.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Niall McShane", "Raquel Perez", "Jorge Alvarez", "Oscar Crespo", "Maelle Heyrendt", "Tom Mallet"], "genres": ["Simulation", "Casual"], "publishers": ["Parakite"], "esrb_rating": null}