{"id": 272531, "slug": "atelier-rorona-the-alchemist-of-arland-dx", "name": "Atelier Rorona The Alchemist of Arland DX", "name_original": "Atelier Rorona The Alchemist of Arland DX", "description": "<p>First release in the Arland series. The main character Rorona must save her Atelier from being closed by the Kingdom. Using Synthesis, Exploration, and Battle, gain recognition for the Atelier and save it from being closed. See a variety of endings by obtaining a certain level of recognition in a set time period and by fulfilling certain conditions.<br />\n・Save the Atelier by fulfilling requests made by the Kingdom.<br />\nRorona&#39;s goal is to &#39;gain recognition from the Kingdom to save her Atelier.&#39; By clearing the quarterly requests sent to her by the Kingdom for 3 years, Rorona can gain recognition. Earn great recognition by using Synthesis, Exploration, and Battle!<br />\nEarn a certain level of recognition in a set period of time from the Kingdom and fulfill certain conditions to see a number of different endings. In addition to Kingdom recognition, popularity in town from fulfilling the requests of the townsfolk also plays an important role in determining the ending that you eventually end up with.<br />\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br />\n1 player<br />\n7MB minimum save size<br />\nDUALSHOCK®4<br />\nRemote Play<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2023-10-15T19:01:34", "background_image": "https://media.rawg.io/media/games/335/335e0fd08651854d9d35d13b497dee50.jpg", "website": "", "rating": 3.78, "rating_top": 5, "added_by_status": {"yet": 9, "owned": 46, "beaten": 11, "toplay": 4, "dropped": 4, "playing": 1}, "playtime": 36, "achievements_count": 57, "ratings_count": 9, "suggestions_count": 523, "game_series_count": 0, "reviews_count": 9, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Gust"], "genres": ["Adventure", "RPG"], "publishers": ["Koei Tecmo Games"], "esrb_rating": null}