{"id": 272514, "slug": "the-black-knight", "name": "The Black Knight", "name_original": "The Black Knight", "description": "Praxx stones have immense power, this in the wrong hands can be very dangerous. Thanks to the stones, all the kingdoms of the southern continent used to live in peace and harmony, but that is about to change. Lox, leader of the kingdom of Belvedor, has always wanted to possess this power to carry out his evil plan. He recently kidnapped Princess Amanda because she is one of the few people who knows where the stones are hidden. Now Diego will enter a very dangerous adventure, but he will have the help of his wizard Bartolo to find the 5 stones of Praxx and rescue the princess before it's too late.<br/><br/><h3>Game Features</h3><br/>- Core RPG Elements<br/>- Metroidvania-like game experience<br/>- Retro and nostalgic pixelated graphics<br/>- Many Hidden Places<br/>- Full Controller Xbox One Support (Joystick)<br/>- Epic Bosses with different Mechanics <br/>- Fluid Gameplay <br/>- Puzzles to solve<br/>- You need to find the Praxx stone and the key to open the door and defeat the boss of each level<br/>- Checkpoint in strategic places to save your progress<br/><br/><h3>Word from the developer</h3><br/>Hello how are you? First of all, thanks for your visit! My name is Diego Galvão, this is my first game and I developed it alone in 5 months. If you like this project, consider buying it and sharing it with your friends. In this way, you are encouraging me to soon form a team and develop The Black Knight 2 with many more new weapons, levels, enemies and mechanics for you.<br/>Thanks!<br/><br/>", "metacritic": null, "released": "2018-12-18", "tba": false, "updated": "2023-11-03T22:58:37", "background_image": "https://media.rawg.io/media/screenshots/fd3/fd3547971221774300511e469da25613.jpg", "website": "https://portalovergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["notreallythin", "Over Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["notreallythin", "GoGo Games Interactive"], "esrb_rating": null}