{"id": 272599, "slug": "halloween-tripeaks-solitaire", "name": "Halloween Tripeaks Solitaire", "name_original": "Halloween Tripeaks Solitaire", "description": "Bring back the haunted castle of Frankenstein and his Witch bride in this solitaire treat. This is the spooky version of our very popular tri-peaks card game, Magic Towers Solitaire, which has been played over 100 million times. This is the card game with a bit more thrill!<br/><br/>In this version of our classic solitaire game we've been inspired by all things spooky. So we've kept what made our previous game so highly rated. That includes the smooth play with responsive controls, the easy to understand rules of the game and the neverending fun of trying to beat your previous high scores. What we've added is a frightfully fun theme composed of scarily satisfying sound and ghoulishly good graphics.<br/><br/>FEATURES:<br/>- Addictive gameplay from our most popular solitaire game.<br/>- Unique, eerily beautiful visual effects and theme.<br/>- Fast, responsive and easy to use controls.<br/>- Local and global leader boards so you can compare scores with friends and family.<br/>- Ghoulishly good sound effects.<br/>- Don't worry about interruptions, your game will automatically save its place.<br/><br/>So if you've been playing plain old windows solitaire or spider solitaire and want a fun card game with a bit of atmosphere then we’re sure you’ll love Halloween Tripeaks Solitaire.<br/><br/>Facebook - Glowing Eye Games<br/>http://www.facebook.com/glowingeyegames<br/><br/>Glowing Eye Games <br/>www.glowingeyegames.com", "metacritic": null, "released": "2011-10-26", "tba": false, "updated": "2019-10-22T14:06:02", "background_image": "https://media.rawg.io/media/screenshots/78f/78fec530770761bd29a35eb90158507a_B1VFcRt.jpg", "website": "http://www.glowingeyegames.com/game/halloween-tri-peaks-solitaire/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glowing Eye Games"], "genres": ["Card", "Puzzle"], "publishers": ["Glowing Eye Games"], "esrb_rating": "Everyone 10+"}