{"id": 272650, "slug": "yatzy-with-buddies", "name": "YATZY with Buddies", "name_original": "YATZY with Buddies", "description": "In the board game of Yahtzee, all you have to do to win is roll the highest combination on the dice. What's the best thing about this app? That you can play with multiple players and whenever you want, of course! <br/><br/>Once you start playing this multiplayer version of Yahtzee, you'll quickly get the hang of it and even more quickly become hooked!<br/><br/>The first time that you play, you'll have to choose between creating a new game or joining other players in one that already exists. You'll have the option to either face off against a computer or to compete against players from all over the world. <br/><br/>Once the game starts, roll the dice and cross your fingers that your combination helps you fill in your Yahtzee chart. Possible combinations include three of a kind (three dice with the same number), four of a kind (four dice with the same number), full house (three dice with matching numbers and the other two with matching numbers), small straight (at least four dice are in numerical order), large straight (all dice are in numerical order), and — of course — Yahtzee! Tap one die to put it aside and roll the others: you've got three tries per round. If you get 63 points in the upper section of the chart, you'll automatically receive a bonus of 35 points!<br/><br/>Game features:<br/>- Play against real opponents from all parts of the world <br/>- Challenge your friends to a game<br/>- Face off against a computer opponent <br/>- Create your own game and modify it to your liking (private game or public, number of players, game name, reserved for your friends or players on the same level as you, etc.)<br/>- Randomly join a game created by other players <br/>- Find a game by name (to play against a friend, for example)<br/>- Chat with your opponents during the game <br/>- Sign up or connect to your account to register your scores and your level<br/>- Clean and stylish graphics for fun and easy-to-use gameplay <br/>- The ideal background music to play to keep your stress levels down", "metacritic": null, "released": "2016-10-07", "tba": false, "updated": "2019-07-29T23:29:33", "background_image": "https://media.rawg.io/media/screenshots/c00/c00c2d5aba3f7822dd02084b639f5eb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pinpin Team"], "genres": ["Board Games"], "publishers": ["PINPIN TEAM"], "esrb_rating": "Everyone 10+"}