{"id": 272611, "slug": "mexican-train-dominoes-classic", "name": "Mexican Train Dominoes Classic", "name_original": "Mexican Train Dominoes Classic", "description": "A family-friendly and fun game of dominoes, Mexican Train Dominoes Classic is at the station with carriagefuls of features. Play round after round alone or with friends, practice your tactics, and win!<br/><br/>Mexican Train Dominoes Classic is played over multiple rounds with the aim to keep as low a score as possible. The winner is the player with the lowest overall score at the end of the game! A step-by-step tutorial and written instructions will help you throughout, which can be accessed at any time via the menu.<br/><br/>Choose an easy ride or test yourself with our numerous difficulty settings, play 3, 6 or 10 rounds, or practice your skills with our deluxe score mode which enables you to play consecutive rounds for as long as you can. Not only can you tailor rules to your preference and choose from a variety of peaceful backgrounds, but we have one more trick up our sleeve!<br/><br/>One of our favorite features is the Pass and Play mode. Now, you and up to four friends can pass your device around so everyone can join in the fun. This is especially for those out and about and without a set of dominoes. Simply pick your favourite colour train, the rules and off you go! <br/><br/>Dominos features to tantalise and entice: <br/><br/>• Pass and Play allows you to physically pass your iPhone or iPad around to involve three other players<br/>• Choose the difficulty of the computer players. Perfect for novices or pro players.<br/>• Multiple rounds in sets of 3, 6 or 10<br/>• Several beautifully designed backgrounds to suit your style and mood<br/>• Space to play tactically <br/>• Fluid graphics and relaxing sounds<br/>• Uncluttered design with clear domino dots<br/>• Designed with both iPhone and iPad in mind<br/><br/>Play your way with Mexican Train Dominoes Classic!", "metacritic": null, "released": "2018-09-23", "tba": false, "updated": "2022-07-22T07:56:24", "background_image": "https://media.rawg.io/media/screenshots/6db/6dbdc218a9dcae1f98c208c830d5b6cc_zP5K5Wc.jpg", "website": "http://www.glowingeyegames.com/game/mexican-train-dominoes-classic/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glowing Eye Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Glowing Eye Games"], "esrb_rating": null}