{"id": 272634, "slug": "ship-merger", "name": "Ship Merger", "name_original": "Ship Merger", "description": "Do you ever want to be the greatest fleet merger in the world? Let us start ship merging in this coolest sailing game! There are over 30 fantastic ships to merge and you can explore unique 40+ islands!<br/><br/>Well, Bingo! You got it!<br/>Step 1: Merge and develop your ships to earn money<br/>Step 2: Level up ships and get diamonds to unlock more islands and discover new eras<br/>Step 3: Fight sea monsters especially hydra to collect more treasure<br/><br/>Hurry up! Come and join this awesome adventure game!<br/><br/><br/>Vip Membership offers a weekly subscription, you will have a 3-days FREE trail, after this you will be charged $2.99. If you own Vip Membership, you will unlock following features: 50TP point daily, 80 diamonds daily, 2 extra sailing slots, 30% extra online&amp;offline profits.<br/><br/>End of trial and subscription renewal：<br/>- Payment will be charged to iTunes Account at confirmation of purchases.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>-Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>-Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>-Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Term Of Use:https://shipmergerprivacypolicy.blogspot.com/2018/10/ship-merger-terms-of-use.html<br/>Private Policy:https://shipmergerprivacypolicy.blogspot.com/2018/10/ship-merger-privacy-policy.html", "metacritic": null, "released": "2018-11-10", "tba": false, "updated": "2019-10-22T14:31:19", "background_image": "https://media.rawg.io/media/screenshots/ab1/ab12340244f5495f65fb4e64a06c2b64_x17RfHH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hongkong Vega"], "genres": ["Simulation", "Sports"], "publishers": ["Hongkong Vega"], "esrb_rating": null}