{"id": 272619, "slug": "slash-of-sword", "name": "Slash of Sword", "name_original": "Slash of Sword", "description": "Fight on the arena, earn fame, get famous. Exciting, bloody gladiator fights are waiting for you! Fight fairly 1 on 1 or try to defeat 10 fighters. <br/>Rest from the battles in the village, upgrade your skills, unlock new weapons and armor. <br/><br/>Features:<br/><br/>1. Picturesque and battles<br/>Due to well-designed animations and effects, battles look very cool, even on mobile devices! <br/><br/>2. Battles with a few soldiers. <br/>Start your journey as a Gladiator against the same fighter as you. Win and get the title of the best warrior, fighting 10 enemies at a time! <br/><br/>3. Boss battles <br/>Meet 1 on 1 with the best of the best! <br/><br/>4. Stunning graphics <br/>Excellent picture, amazing light effects, change of weather and time conditions! <br/><br/>5. Smart Artificial Intelligence. <br/>The enemies will try to surround and overwhelm you. If you hurt them, they will try to retreat, and their teammates to stick up for them. <br/><br/>6. Open and living world <br/>In addition to battles you will see the area where the real life is, someone is sleeping, someone has a chat with somebody, where traders tout their shops. Buy yourself equipment and ammunition, have a peaceful rest while waiting out the night or sit by the fire and upgrade your skills.<br/><br/>Developer - Coming soon I release (PvP Fights, new locations, archers, vikings,<br/>ragdoll physics, new weapon and new animation)<br/>Thanks for playing!", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-10-22T14:06:03", "background_image": "https://media.rawg.io/media/screenshots/882/882b30ae363d11959ab42c6dfc4f5e5b_i96gcLD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VLADISLAV VASILEV"], "genres": ["Action", "Adventure"], "publishers": ["VLADISLAV VASILEV"], "esrb_rating": "Teen"}