{"id": 272632, "slug": "mine-passengers-the-air-craft-flying-game", "name": "Mine Passengers: The Air Craft Flying Game", "name_original": "Mine Passengers: The Air Craft Flying Game", "description": "◉◉ Mine Passengers ◉◉<br/><br/>◉◉ Free Blocky Air Craft Flying Engine ◉◉<br/><br/>Dive into our new cube commercial aircrafts game!<br/><br/>If you've always wanted to fly a plane and bring your passengers safely to their destination this is your game!<br/><br/>To be a true leader in Mine Passengers you must be bold, fast, agile and safe!<br/><br/>You are in danger! The flight has begun and more and more planes are appearing in your way!<br/><br/>Your mission will be to dodge them without fail to not get your passengers damaged!<br/><br/>Choose the commercial blocky airplane that best suits your tastes and begin to show who is boss in the air!<br/><br/>This is a survival game that ends when you hit against another plane, but if you accumulate achievements you will be able to continue in the air and beat your high scores!<br/><br/>The more your pilot skills and driving passengers skills grow, the more your earnings grow which allows you to unlock new cube air planes!<br/><br/>Tell your friends all about it! Compete and try to lead the leaderboard!<br/><br/>Features of this cube commercial aircraft game:<br/><br/>◉ Intuitive controls by moving the device!<br/>◉ Impressive speed!<br/>◉ Leaderboards!<br/>◉ Shocks and explosions!<br/>◉ Amazing 3D graphics!<br/>◉ Creative and addictive music!<br/>◉ Free!<br/><br/>Immerse yourself between worldwide players of this commercial aircraft game to show who is the most effective and safe pilot in the air!<br/><br/>Improve your airplane handling and skills to unlock new challenges that the blocky aircrafts propose you.<br/><br/>Do you dare going at extreme speed without blinking while dodging all obstacles?<br/><br/>Download and value ​​this App now so that we can continue to improve it and that your favorite passenger planes stay reliable in the air!<br/><br/>Follow us on Twitter: @Oscarminigames<br/>Like us on Facebook: www.facebook.com/OscarMiniGames", "metacritic": null, "released": "2015-05-04", "tba": false, "updated": "2019-10-22T14:06:04", "background_image": "https://media.rawg.io/media/screenshots/73d/73de29751d208edd9f9fae45137716d8_jBXSK7Q.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FREESTYLE GAMES"], "genres": ["Racing", "Family"], "publishers": ["FREESTYLE GAMES"], "esrb_rating": "Everyone 10+"}