{"id": 272679, "slug": "plug-discs-for-minecraft", "name": "Plug Discs for Minecraft", "name_original": "Plug Discs for Minecraft", "description": "Add your own Music to your Minecraft World and share - even works in Multiplayer!<br/><br/>Bored of the same old Music in Minecraft? Want something different... Use Plug Discs for Minecraft to create your own Music Discs with your own Music!! - Another world first by developers of the famous Plug Apps.<br/><br/>Plug Discs for Minecraft allows you to create Music Discs and Disc Packs containing your own Music from your Music Library, other Apps or the Internet (by exporting downloaded music from your browser with one tap). Plug Discs makes it super easy to import almost any Audio file including files like mp3, wav, aac and m4a<br/><br/>Once you have created a Disc Pack, one simple click exports it to Minecraft where you can add it to your world.<br/><br/>Then simply use the Jukebox item and insert one of the Discs from the pack and watch it play just like a real Jukebox!  Swap Discs whenever you want and even place multiple Jukeboxes in your world playing different Discs.<br/><br/>All your Discs are labelled with the Track Title (which you can edit), making it super easy to find the right Music Disc just when you need it!<br/><br/>• Load up Discs with your own Music from your Music Library, or import from other Music apps or browsers¹<br/><br/>• Use the Jukebox item in the World to play or swap between any one of your Discs containing your music. You can even use a repeater and command block to make a full auto switching Jukebox! (Search YouTube for a video tutorial)<br/><br/>• Multiplayer players can also hear your music!<br/><br/>• Create fun new Items: One user created Disc with a Door Bell sound and used a button to make a real Door Bell for his Minecraft house!<br/><br/>• Works with almost any audio file, .mp3, .wav, .aac, .m4a etc.<br/><br/>• Place multiple Juke boxes in your world playing different music - Eg. pick some cool music at Spawn and different spooky Music in a cave :)<br/><br/>• The Volume of the music decreases as players move further from your Jukebox, just like a real Juke Box!<br/><br/>• Place as many Jukeboxes around your world as you like - no limits.<br/><br/>• Create as many Disc Packs as you like - easily enable different Disc Packs for Different worlds.<br/><br/>• NO In App Purchases - EVER!<br/><br/>Tweet us @indevelopers with your screenshots, videos, and feedback.<br/><br/><br/><br/>¹ Note: Protected Music cannot be imported from your library. Also it is your responsibility to ensure you have the legal right to use any Music you import.<br/><br/>Not an official Minecraft product, or associated with Mojang.", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-07-30T04:19:27", "background_image": "https://media.rawg.io/media/screenshots/cfa/cfa99e3fedb07f9b5bfc82ce8a1aef48_b99kxQi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Innovative Developers"], "genres": ["Action", "Adventure"], "publishers": ["Innovative Developers"], "esrb_rating": null}