{"id": 272613, "slug": "the-golf-card-game", "name": "The Golf Card Game", "name_original": "The Golf Card Game", "description": "The Golf Card Game is one of our favorite card games and is fun for anyone who likes the games Hearts or Spades. We’re excited to bring it to you with a beautiful range of themes along with different game modes.<br/><br/>The concept of the Golf Card Game is simple and easy to learn. Three or four players take turns, aiming for a score close to zero. You can do this by swapping your high cards for low cards. You are dealt either four or six face down cards, depending on the game mode, and a round lasts until all players have turned over their cards.<br/><br/>Our charming golf theme accompanies you while you play. Of course, for traditionalists, we offer a classic green velvet as one of the backgrounds. There are other themes to choose from as well, lovingly illustrated by our art team. We want our games to relax you, so we’ve made sure that our expertly created soundscape will round out your playing experience. Our controls are easy, using a tap based system to get the cards where you need them to go. We know that sometimes you’ll just want a quick game, so naturally you can tailor the length of a full game.<br/><br/>Features:<br/>- Play three player games or four players games against the computer.<br/>- Choose three, six, or nine game rounds, tailoring the game length to what suits you.<br/>- Pick between four card games or 6 card games, for a varied challenge.<br/>- An array of beautifully illustrated backgrounds which start at the fairway and go far beyond!<br/>- An atmospheric soundscape, immersing you in our game. <br/><br/>As creators of several popular solitaire games including Tri Peaks Classic and Pyramid Solitaire Ancient Egypt, we know and love cards. We hope you'll try The Golf Card Game today and discover a new favorite game.", "metacritic": null, "released": "2017-09-09", "tba": false, "updated": "2021-07-02T04:03:57", "background_image": "https://media.rawg.io/media/screenshots/ada/ada282d2a566208ca429ba88868c56be.jpg", "website": "http://www.glowingeyegames.com/game/the-golf-card-game/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glowing Eye Games"], "genres": ["Board Games", "Card"], "publishers": ["Glowing Eye Games"], "esrb_rating": null}