{"id": 272626, "slug": "40-thieves-solitaire-classic", "name": "40 Thieves Solitaire Classic", "name_original": "40 Thieves Solitaire Classic", "description": "Forty Thieves Solitaire Classic is for those who like to relax with a challenge! It needs time, some luck, and skill to win. Our app makes other card games look easy, even the infamously hard 4 suit version Spider Solitaire. <br/><br/>To step up to this to this challenge our tutorials and intuitive controls will ease you in. If you are familiar with Freecell then you’ll quickly understand the rules. All you have to do is move the both decks of cards to the 8 foundations cells at the top. They need to be stacked in suit order starting with an Ace and finishing with a King. What makes this particularly challenging is you only get one chance to go through the full deck.<br/><br/>Of course, as with all our games, if you are on a winning streak we’ll let you keep on playing. How many rounds can you win in a row?<br/><br/>40 Thieves Features:<br/>* Easy to use controls and simple tutorial. <br/>* Multiple rounds and multiple ways to score. <br/>* Classic and sumptuous green velvet theme with a deluxe hint of casino.<br/>* Beautifully animated, accompanied by a tailor-made soundscape.<br/>* Extensive tutorial and instructions.<br/>* Smooth jazz ambience (optional!).<br/>* Infinite undo so you can try other options.<br/>* Two levels of difficulty. Hard and less hard! (If you like this see Crescent Solitaire Classic!)<br/><br/>Take the challenge and play Forty Thieves Solitaire Classic!", "metacritic": null, "released": "2017-09-06", "tba": false, "updated": "2019-10-22T14:06:04", "background_image": "https://media.rawg.io/media/screenshots/9ce/9ceb53b03c7537c66dd7f9eb9a443331.jpg", "website": "http://www.glowingeyegames.com/game/forty-thieves-solitaire-classic/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glowing Eye Games"], "genres": ["Board Games", "Card"], "publishers": ["Glowing Eye Games"], "esrb_rating": "Everyone 10+"}