{"id": 272606, "slug": "orient-express-dominoes-mexican-train", "name": "Orient Express Dominoes (Mexican Train)", "name_original": "Orient Express Dominoes (Mexican Train)", "description": "Play this intriguing variant of Train Dominoes in 1st class! Created by the makers of the popular Mexican Train Dominoes Gold, Orient Express Dominoes features the same slick, touch-screen optimised interface and is just as easy to learn and lose yourself in. Its historic European charm and exotic locations let you dream while you relax with the game.<br/><br/>To gently introduce new players to this dominoes game we've included a concise animated tutorial and helpful pop-up messages. For everyone else we've tried to this family friendly board game a pleasure to play with easy controls and exciting theme. Expert players can even test themselves against more challenging opponents. We also wanted to fit this game to the time you have available so short and long games are available, perfect while waiting for a few minutes or relaxing at home.<br/><br/>Domino game features<br/>&gt; Easy to learn rules with an animated tutorial, perfect if you are new to the game.<br/>&gt; A new twist to the rules that will give you more options than ever before, but doesn't change the game.<br/>&gt; A.I. opponents with different strengths and weaknesses.<br/>&gt; Either play a quick 'Blitz' game, a 'Short' game or go for the classic 'Full' game.<br/>&gt; Select from several different themes, like those inspired by stops on the historic train route.<br/>&gt; 3 or 4 player games.<br/><br/>Take a ride and have an adventure...<br/><br/>Facebook - Glowing Eye Games<br/>http://www.facebook.com/glowingeyegames<br/><br/>Glowing Eye Games <br/>www.glowingeyegames.com", "metacritic": null, "released": "2013-11-14", "tba": false, "updated": "2019-10-22T14:06:03", "background_image": "https://media.rawg.io/media/screenshots/43c/43cfaeac2e1a8bf568846b18622ac26d_ONcXqqm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glowing Eye Games"], "genres": ["Strategy", "Board Games"], "publishers": ["Glowing Eye Games"], "esrb_rating": "Everyone 10+"}