{"id": 272628, "slug": "my-baby-pet-dragon-the-little-run-vs-puppies", "name": "My Baby Pet Dragon: The Little Run vs Puppies", "name_original": "My Baby Pet Dragon: The Little Run vs Puppies", "description": "Dragons are not just only in fairytales! They are also nice pets!<br/>Play with our adorable baby dragons and take care of them: These baby dragons are pretty vulnerable and they need your complete attention... Especially because dog puppies are jealous of them: Both of them are always fighting each other to get your attention, they never get along well together. You always have to separate them, otherwise, they start fighting. <br/><br/>In this addictive game you will have to take care of a baby dragon and beware of the every dog puppy trying to beat him:<br/><br/>- Survive to every dog puppy attack in an infinite race in the countryside<br/>- Choose your favourite dragon baby to start this funny race. Each dragon have unique features, so choose wisely!<br/>- Cute dog puppies are your enemy. Learn how to avoid them before you get killed! This races are very intuitive to play!<br/>- Choose the difficulty level of this amazing pet races in this funny game<br/>- Different type of puppies and dragons give this games a greater realism<br/>- These dragon baby games are appropriate for children<br/><br/>Keep your baby dragon safe and improve your high score ranking in this funny game!<br/><br/>Twitter: @bravocterogames<br/>Facebook: www.facebook.com/bravocterogames", "metacritic": null, "released": "2016-11-30", "tba": false, "updated": "2019-10-22T14:06:04", "background_image": "https://media.rawg.io/media/screenshots/69f/69f21a9f1b14d11107f1c1dbbbe28218.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FREESTYLE GAMES"], "genres": ["Adventure", "Racing"], "publishers": ["FREESTYLE GAMES"], "esrb_rating": "Everyone 10+"}