{"id": 272735, "slug": "primus-chess", "name": "Primus Chess", "name_original": "Primus Chess", "description": "Primus Chess<br/><br/>A more human chess engine.<br/><br/>Primus is an entirely original, modern chess engine specifically designed for the intermediate player (up to 2000 Elo). It has been carefully tuned to play less like a machine and more like a human. At lower levels, it makes blunders of a straightforward kind that are easy to spot, but at higher levels more careful play is required to take advantage of more subtle tactical and even strategic errors. At its highest levels, Primus plays at around 2000 Elo, but even at the very highest levels, it still has occasional simulated lapses of concentration.<br/><br/>The engine was conceived out of frustration with the overwhelming tactical strength of modern chess engines. Most modern chess engines are so tactically strong that extremely careful defensive and anti-computer play is required to make any progress; in other words, it's nothing like playing a human. We wanted to create an engine that allows for a more human, strategic style of play where there's room to take advantage of the occasional blunder.<br/><br/>We've included a mate puzzle generator to create an almost infinite variety of checkmate puzzles that allow you to sharpen your chess instincts, and multiplayer modes that allow you to use your device as a virtual chessboard, or play via bluetooth or wireless with a local opponent.<br/><br/>We've also added a \"Time Control\" mode, to allow you to play using standard chess time controls, rather than a predefined difficulty level.<br/><br/>Features include:<br/><br/>- Mate puzzle generator - an almost infinite number of puzzles.<br/>- Two player mode over Bluetooth / Lan, compatible with the iOS version.<br/>- Various different boards, pieces and graphical options.<br/>- Full keyboard support.<br/>- Support for all skill levels from total novice to expert.<br/>- Focus mode, to hide the UI so you can focus on the board.<br/>- Puzzles and practice levels, so you can practice your endgames or play some interesting challenge levels.<br/>- Mini-tournament mode - a six-game mini tournament mode for the more serious player.<br/>- Elo rating estimation from your game results.", "metacritic": null, "released": "2016-01-08", "tba": false, "updated": "2019-10-22T14:34:42", "background_image": "https://media.rawg.io/media/screenshots/589/589b303861eebff5b86cae43c0d9438c_q1aI2HG.jpg", "website": "http://primuschess.com/Primus.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["DBRG"], "genres": ["Strategy", "Board Games"], "publishers": ["DBRG"], "esrb_rating": "Everyone 10+"}