{"id": 272736, "slug": "turings-machine-lite", "name": "Turing’s Machine Lite", "name_original": "Turing’s Machine Lite", "description": "Can you beat Turing’s Machine?<br/><br/>NOTE: This is the ‘lite’ version of Turing’s Machine. The full version contains many more difficulty levels, puzzles, pieces and boards.<br/><br/>In 1947, Alan Turing and David Champernowne created the world’s first chess playing computer program, which they named “TuroChamp”. The program was devised with pencil and paper, the calculations being performed manually by Turing and Champernowne themselves - each move would take them half an hour or more to calculate.<br/><br/>This app includes an implementation of the original “TuroChamp”, so you can play the original version, as conceived in 1947, without having to carry out all those tedious pencil and paper calculations. We’ve also added deeper search and a more modern version of the engine, so you can play a stronger version of Turing’s machine - up to around 2000 Elo. Finally, we’ve added puzzles, practice levels and various two-player modes, so that you can use your device as a virtual chessboard.<br/><br/>TuroChamp was the very first chess computer program and it still holds up well despite its idiosynchratic playing style - a style entirely appropriate to the incisive, determined and eccentrically humorous character of its creators. Perhaps more significantly, it represents the only A.I. left to us by the father of Artificial Intelligence.<br/><br/>Other features include:<br/><br/>- Support for all skill levels from total novice to expert (2000 Elo).<br/>- Supports all orientations, so you can make full use of your iPad Smart Case or stand.<br/>- Supports iOS multitasking, so you can follow along with videos/ebooks.<br/>- Focus mode, to hide the UI so you can focus on the board.<br/>- Two player mode over BlueTooth / Lan.<br/>- Tabletop mode so you can use your device as a virtual chessboard.<br/>- Puzzles and practice levels, so you can practice your endgames or play some interesting challenge levels.<br/>- Mini-tournament mode - a six-game mini tournament mode for the more serious player.<br/>- Various different boards, pieces and graphical options.<br/>- Elo rating estimation from your game results.", "metacritic": null, "released": "2016-05-19", "tba": false, "updated": "2019-10-22T14:06:09", "background_image": "https://media.rawg.io/media/screenshots/12d/12d6c74b8116106fe940f51845fef590.jpg", "website": "http://turingsmachine.com/TuringsMachine.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DBRG"], "genres": ["Strategy", "Board Games"], "publishers": ["DBRG"], "esrb_rating": null}