{"id": 272734, "slug": "primus-chess-lite", "name": "Primus Chess Lite", "name_original": "Primus Chess Lite", "description": "NOTE: This is the 'lite' version of Primus. The full version contains a mate puzzle generator, many more difficulty levels, puzzles, pieces and boards.<br/><br/>A more human chess engine.<br/><br/>Primus is an entirely original, modern chess engine specifically designed for the intermediate player (up to 2000 Elo). It has been carefully tuned to play less like a machine and more like a human. At lower levels, it makes blunders of a straightforward kind that are easy to spot, but at higher levels more careful play is required to take advantage of more subtle tactical and even strategic errors. At its highest levels, Primus plays at around 2000 Elo, but even at the very highest levels, it still has occasional simulated lapses of concentration.<br/><br/>The engine was conceived out of frustration with the overwhelming tactical strength of modern chess engines. Most modern chess engines are so tactically strong that extremely careful defensive and anti-computer play is required to make any progress; in other words, it's nothing like playing a human. We wanted to create an engine that allows for a more human, strategic style of play where there's room to take advantage of the occasional blunder.<br/><br/>We've included multiplayer modes that allow you to use your device as a virtual chessboard, or play via bluetooth or wireless with a local opponent.<br/><br/>Features in this \"lite\" version include:<br/><br/>- Two player mode over Bluetooth / Lan.<br/>- Tabletop mode so you can use your device as a virtual chessboard.<br/>- Five different skill levels from total novice to expert (21 in the full version)<br/>- Supports all orientations, so you can make full use of your iPad Smart Case or stand.<br/>- Supports multitasking, so you can follow along with videos/ebooks.<br/>- Focus mode, to hide the UI so you can focus on the board.<br/>- Five selected puzzles and practice levels (30 in the full version), so you can practice your endgames or play some interesting challenge levels.<br/>- Mini-tournament mode - a six-game mini tournament mode for the more serious player.<br/>- Elo rating estimation from your game results.", "metacritic": null, "released": "2016-05-19", "tba": false, "updated": "2019-10-22T14:06:09", "background_image": "https://media.rawg.io/media/screenshots/d72/d726bdeb0aa7a2a84ed22d04d69c09a4_6PXtdsp.jpg", "website": "http://primuschess.com/Primus.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DBRG"], "genres": ["Strategy", "Board Games"], "publishers": ["DBRG"], "esrb_rating": null}