{"id": 272795, "slug": "mutants-vs-the-chosen-2-traitor", "name": "Mutants vs. The Chosen 2: Traitor", "name_original": "Mutants vs. The Chosen 2: Traitor", "description": "“Mutants vs The Chosen: Traitor” is a point-and-click adventure game, where you help Riam, the main hero, defend mutants against the Chosen ones.<br/><br/>Hand-painted graphics, a strange atmosphere of the future world, puzzles in which you have to use your brain, and the story – these are the main ingredients of this adventure game.<br/><br/>Story: As you probably know from part #1, the future has brought destruction to some places on Earth. Some people are suffering from poverty, disease, and visible genetic mutations. Although the mutations are typically small, they are often used as a pretext to attack the Mutants by the Chosen. In part #1, Riam saved his sister from kidnappers, but they had to flee and find a new place to live. Now they are hiding in a ruined cellar, and Riam has to find a way how to defend them, or even how to effectively attack the militants of the Chosen ones.<br/><br/>Features:<br/>* Hand-painted graphics<br/>* Twice the number of scenes compared to part #1<br/>* Multilanguage (including English and Czech (hra česky))<br/>* Classic point-and-click adventure game optimized for tablets and smartphones<br/>* Original from GameStylus.com team<br/><br/>Created on GameStylus.com.<br/><br/>Hot tip: You can create your own adventure games at GameStylus.com! No programming necessary!", "metacritic": null, "released": "2015-12-18", "tba": false, "updated": "2019-10-22T14:06:10", "background_image": "https://media.rawg.io/media/screenshots/a6f/a6fd76074c95a6d5de2e4254167a8e78.jpg", "website": "http://gamestylus.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bispiral"], "genres": ["Adventure", "Puzzle"], "publishers": ["Bispiral"], "esrb_rating": null}