{"id": 272859, "slug": "crane-parking-pro-full-construction-truck-madness-", "name": "Crane Parking PRO - Full Construction Truck Madness Driving Simulator Version", "name_original": "Crane Parking PRO - Full Construction Truck Madness Driving Simulator Version", "description": "** FULL CONSTRUCTION DRIVING VERSION! **<br/><br/>Get ready to drive a big crane! If you are a big fan of parking games, then you will absolutely love this one. There are two objectives in this game. <br/><br/>First, is you must transport the giant cargo containers from one area to another. To do this, you need to navigate your crane to a position in front of the cargo container where you will then activate the 'crane operator mode' which enables you to control the cane and lift up the cargo. You will then need to proceed to the special drop zone.  <br/><br/>Second, once the cargo container is placed on the special drop off zone, you will then need to find the parking zone to park your crane. This all might sound easy, but it's not easy driving and operating a big crane! You'll soon find out for yourself!  Good luck!<br/><br/>FEATURES<br/><br/>- Special 'crane operator' mode.<br/>- Realistic graphics!<br/>- Multiple camera views.<br/>- Multiple steering options.<br/>- 10 levels to complete.<br/>- Map to show you where the cargo containers, drop off locations, and special parking zones.<br/>- Hours of fun!!<br/><br/>** PLEASE  NOTE: Crane Simulator is free to play, but contains items that can be purchased for real money. You can turn on/off this feature in the \"Restrictions\" menu of your device.", "metacritic": null, "released": "2015-10-26", "tba": false, "updated": "2019-10-22T14:06:14", "background_image": "https://media.rawg.io/media/screenshots/157/157416774a41b28db370377bf5a01db5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Top Free Games Factory"], "genres": ["Racing", "Arcade"], "publishers": ["Top Free Games Factory"], "esrb_rating": "Everyone 10+"}