{"id": 272924, "slug": "monkey-run-fantastic-adventure-tale", "name": "Monkey Run: Fantastic Adventure Tale", "name_original": "Monkey Run: Fantastic Adventure Tale", "description": "All you Monkey Run: Fantastic Adventure Tale player out there, get ready for the most exciting jungle ride ever! If you loved playing Monkey Run: Fantastic Adventure Tale game, you'll have a blast with ? Monkey Run: Fantastic Adventure Tale ?! Our monkey friend Bobo is on a rescue mission, and he has to run, jump and swing on vines through 5 islands to save the love of his life! Get on a never-ending run, and make our little monkey go happy! Download ?Monkey Run: Fantastic Adventure Tale? and have one hell of a running quest through the monkey jungle island!<br/>+ Dodge mad gorillas with spears<br/>+ Avoid angry baboons' boomerang attacks<br/>+ Keep the jumping monkey away from piranha plants<br/><br/>+ Fast paced swinging adventure ?<br/>+ One thumb tap and slide controls - Intuitive and responsive controls for the best game experience<br/>+ Run through astonishing jungle wild environments full of surprises, secrets and tricky obstacles<br/>+ Jump and swing on vines to avoid deadly obstacles<br/>+ Crazy jungle music and funny monkey sounds<br/>+ More powerups: Shield, Coins Magnet, and Double Coins<br/>+ Explore 5 new islands:<br/>- Monkey Island<br/>- Savanna Island<br/>- Jungle Island<br/>- Temple Island<br/>- Volcano Island<br/>+ Run and collect coins to dress up monkey kong in the craziest costumes<br/><br/>Join the jungle monkey running quest for the most insane platform gaming experience ever seen in a 2D platformer! Show you're a real adventurer, and dash through the jungle in this awesome banana mania monkey game! Battle the evil gorilla king Kong, beat all his baboon minions, and go on a banana collecting mission to be the hero of the day!<br/><br/>+ Meet Bobo McMonkey ?<br/><br/>Despicable monkey king Kong has kidnapped Bobo's girlfriend Lily and wants to make her his jungle queen! Run, jump, and smash the obstacles on your way to save the love of your life from the claws of the evil king! But, beware! His devious baboon minions are everywhere, and they are fully armed and dangerous!<br/><br/>+ Angry baboon enemies fully equipped with crazy jetpack rides!<br/>+ Dangerous spikes trying to stop you from saving your girlfriend!<br/>+ Make monkey swing from vine to vine like Tarzan, and get on banana rush!<br/><br/>Keep running like hell and get mega combos in this thrilling and fun side-scrolling adventure game for kids! Collect coins and buy cool stuff for our jungle monkey jumper!<br/><br/>+ Visit the shop and buy cool clothes and powerups<br/>+ Collect rubies, sapphires and emeralds, and smash barrels to complete missions!<br/>+ Keep your eyes wide open and collect as many bananas as you can!<br/><br/>+ The Swinging Monkey <br/><br/>Go on a banana hunt and join our crazy jungle party in this amazing monkey kick off jungle saga! Run and dash all across the monkey island to kill as many angry baboons and mad gorillas! While you dash through the jungle, swing on vines to avoid deadly obstacles and complete levels!<br/><br/>Ape escape 3! Bored by old grannies, zombies, and other monsters on their temple races Get on a super fun monkey joyride and fly like a bird through the jungle village! You will get crazy in this endless parkour jungle adventure! This monkey game for kids is fun for adults as well because of its challenging missions, and stunning game level designs!<br/><br/>If you're addicted to free running games, you'll instantly get hooked on this addictive banana adventure! Banana frenzy is raging all over the world, get this monkey jump saga and let the jungle fever get to you! Enter the jungle survival, unlock new worlds, get a cool superhero mask and beat'em up in this jump n run quest!<br/><br/>Run, monkey, run! Get on banana rush and enter the world of fast-paced 2D platform monkey racing and jumping games! Download Monkey Run: Fantastic Adventure Tale and get ready for the gorilla revenge! Mega monkey banana quest is waiting for you! Battle the flying baboons, and beat the angry gorilla king in this epic jungle monkey saga to be the baddest monkey in jungle! Get this fun run side-scroller arcade game for kids and adults, and save your girl from the monkey temple!", "metacritic": null, "released": "2016-10-15", "tba": false, "updated": "2019-10-22T14:06:17", "background_image": "https://media.rawg.io/media/screenshots/64e/64ea59f1fe3e900e84580373053b6164_z7U20Ie.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kien Bui"], "genres": ["Arcade"], "publishers": ["Kien Bui"], "esrb_rating": "Everyone 10+"}