{"id": 272958, "slug": "ashwathama", "name": "Ashwathama", "name_original": "Ashwathama", "description": "Feel the adrenaline at your fingertips. <br/>Play the most exhilarating action RPG that will keep you electrified.<br/>Full scale role playing game <br/>Breathtaking actions with the best graphics: Storyline quests<br/>Classes and skills to enhance your battle experience. Trick enemies with attacks, speed and skills. Attack enemies with destructive Kahnda. <br/>Meet the champions<br/>- Ashwathama: His sword slices through the battleground<br/>- The Moon Lord: Cool flying god. The battlefield is her playground, she controls all the demigods.<br/>- Zahhak. fights with magic and defends the hell<br/>- Flins. Behold her rage as she destroys everything in sight!<br/>- Dazbog. Quick and agile, attacks enemy with a big hammer<br/>- Avici. His eerie shadow will ensnare and annihilate enemies, looks like a ghost.<br/>- Urushi. The best fighting character among all who fights with kalaripayattu style. <br/><br/>Every level in this game brings out an interesting adventure full of action, exploration as the player moves forward. In this game, Ashwathama is seen searching for the ‘Gem’ in this Kaliyuga as per the curse of Krishna. The different background settings in this game play revolve around forests, valleys, flowers, thunder and other natural elements of the Earth. In short, in all the  levels, the player will unlock the new powers and spells by collecting the magic crystals and fighting with Demi God at the end of each level. There is no real winning for the game as the game has three different winning methods.<br/><br/>Features:<br/>Free to play Online RPG (Role Playing Game)<br/>Attack &amp; conquer the Wonder <br/>Forge diplomatic alliances to conquer enemies &amp; become the most powerful Alliance in the Kingdom<br/><br/>To prepare for the upcoming battles with monsters in the far away land not yet known,<br/>Ashwathama is focusing on with his own strength as he has lost his Jem in early battle.", "metacritic": null, "released": "2016-06-04", "tba": false, "updated": "2019-10-22T14:06:20", "background_image": "https://media.rawg.io/media/screenshots/1dc/1dc0d22430397ec6159a3fa1c09fc68e.jpg", "website": "http://www.virtualinfocom.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arijit Bhattacharyya"], "genres": ["Action", "RPG"], "publishers": ["Arijit Bhattacharyya"], "esrb_rating": null}