{"id": 272902, "slug": "hammer-cs-gunfight-in-city", "name": "Hammer CS: Gunfight In City", "name_original": "Hammer CS: Gunfight In City", "description": "This is an amazing 3rd person counter strike like shooter, Fight enemy bots in survival modes.<br/><br/>Use many different weapons which unlock as you advance in the game including a rocket launcher, shotgun, and a variety of automatic weapons. View your enemies on the map and take cover when you take too much damage.<br/><br/>The game is suits all iPhone, iPad and works perfectly on iOS 9.2, 9.3. Great controls that give you plenty of maneuvering options, great exciting maps and 30 missions, an enemy radar and plenty of fun!<br/><br/>Missions:<br/><br/>Mission1: Out For Justice: Kill 100 bad guys<br/>Mission2: Death From Above:  Destroy 10 black vans<br/>Mission3: The Only Way Is Up: Destroy 6 gun turrets<br/>Mission4: Underground: Kill 5 juggernauts<br/>Mission5: Urban Warfare: Destroy 5 tanks<br/>Mission6: Parking Garage Mayhem: Kill 150 bad guys<br/>Mission7: Path Of The Mammoth: Destroy the mammoth tank<br/>Mission8: Target Practice: Destroy 10 orange barrels<br/>Mission9: Streets On Fire: Kill 100 bad guys<br/>Mission10: Rocket Girl: Kill Katie!<br/>Mission11: Swat Filled Streets: Kill 50 swat guys<br/>Mission12: The Race: Destroy 50 crates<br/>Mission13: Driving School: Wreck 50 vehicles<br/>Mission14: Blue Streak: Destroy 15 police cars<br/>Mission15: Rooftop Rage: Destroy 2 attack helicopters<br/>Mission16: Infiltration: Destroy 15 army trucks<br/>Mission17: Roof Top Emergency: Destroy 6 emergency exits<br/>Mission18: Back Alley Killer: Kill 100 bad guys<br/>Mission19: Red Barrel Mayhem: Destroy 35 red barrels<br/>Mission20: Armored Assault: Kill the Colonel<br/>Mission21: The Hunter: Destroy 10 tanks<br/>Mission22: Travelling In Style: Destroy the limousine<br/>Mission23: Metal Swarm: Destroy 10 helicopters<br/>Mission24: Predator: Destroy 15 swat trucks<br/>Mission25: Bombs Away: Destroy 3 jet fighters<br/>Mission26: Coming Through: Destroy 10 buildings<br/>Mission27: Taxi Terror: Destroy 25 yellow cabs<br/>Mission28: Under Siege: Kill 100 soldiers<br/>Mission29: Streets On Fire 2: Destroy 15 black vans<br/>Mission30: The End: Kill the Big Boss", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-10-22T14:06:16", "background_image": "https://media.rawg.io/media/screenshots/f38/f38a12a7f5d49ef7174eed35d3731ac0_HTuVka6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kien Bui"], "genres": ["Sports"], "publishers": ["Kien Bui"], "esrb_rating": "Mature"}