{"id": 273063, "slug": "canyon-capers-itch", "name": "Canyon Capers (itch)", "name_original": "Canyon Capers (itch)", "description": "<p>Do you have fond memories of playing old style platform games, where you didn't have to learn a hundred button combos to play it successfully? </p>\n<p>Canyon Capers is a retro remaster arcade platform game for all ages, created by the authors of the 1992 original.</p>\n<p>Starring Dino-Jr and his many friends as they venture through the canyons and caverns of ancient ruins in historical locations. Reach the ultimate goal, fame and fortune and the retrieval of a rare and Golden Mollusk, source of all universal power.</p>\n<p>With a finely tuned difficulty curve, from nice and easy for the casual gamer, all the way to rock hard for the most seasoned of players, just like an old school platformer used to be. Revive your platform game skills that have been in limbo.</p>\n<p>Canyon Capers will make you rely on your wits and your memory. Hours and hours, of exciting gaming. </p>\n<p>Treat yourself to a fine slice of fine retro gaming. </p>\n\n<ul><li>Hours of exploration for the whole family</li><li>Simple to play, hard to master indie classic retro platform gaming</li><li>Full support for gamepads, controllers and remotes</li><li>ENGLISH, FRENCH, RUSSIAN, FINNISH and SWEDISH.</li><li>Race to the end, collect rare and gorgeous items and unlock the unique bomb levels</li><li>Unlock new characters, each with their own unique abilities as you complete level after level of fun platformer action</li><li>Tons of secrets and collectibles</li></ul>", "metacritic": null, "released": "2018-12-05", "tba": false, "updated": "2019-08-28T23:19:13", "background_image": "https://media.rawg.io/media/screenshots/5ff/5ffa05947224f9b3a76c18fbafa0d3f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CrazyMooGames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}