{"id": 273341, "slug": "sushi-roll-2", "name": "Sushi Roll!", "name_original": "Sushi Roll!", "description": "<p><strong>Welcome to Toshi Sushi!</strong></p>\n<p>Toshi Sushi is a family run establishment, going back many generations. People from all over the world come to have a taste of Mr. Toshi’s world class sushi.</p>\n<p>As Mr. Toshi gets older, he finds it harder to get the sushi to his customers. He enjoys making contraptions to aid his sushi delivery, however he knows he cannot let the sushi touch the ground! It’s up to Mr. Toshi to get his sushi to his eccentric customers without dropping it!</p>\n\n<p><strong>How May I Serve You Today?</strong><br/></p>\n<p>In order to get the sushi to the customers, Mr. Toshi has to utilize his cutting boards and counters as platforms for the sushi to roll on. The player has to tilt the platforms up and down to get the sushi from one platform to the next, and in the end to the customers plate. On the way to the plate, the player can guide the sushi roll into grains of rice, which increase score and the size of the sushi roll, as well as three special sushi per level that drastically increase the score. However, if the sushi falls off the platforms in a way that it cannot be recovered, the level is reset and the player has to try again.</p>\n\n<p><strong>Controls</strong></p>\n<ul><li>Tilt the platforms by moving the mouse cursor to the center dot and moving it left or right.</li><li>Press the ‘space-bar’ to make the sushi roll jump.</li><li>Press the ‘R’ key to restart the game at any time.</li></ul>\n\n<p>Sushi Roll! was made by Ludum Fabri for the Game Development Process class at Sierra College. Team members include: Mike Bodily,  Alex Chapman,  Willis Peterson, and Elin Saldivar.</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-08-28T23:19:11", "background_image": "https://media.rawg.io/media/screenshots/aad/aadf48d73e901f8d092505cd2c762d76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["scintillate"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}