{"id": 273397, "slug": "songs-of-the-eons-01", "name": "Songs of the Eons, 0.1", "name_original": "Songs of the Eons, 0.1", "description": "<p>Please support us on Patreon: https://www.patreon.com/SongsOfTheEons<br/><br/>Songs of the Eons (SotE) is a living, sandbox-style fantasy world simulator wherein the player influences the fate and evolution of a society through the eons. <br/></p>\n<ul><li>The roadmap</li><li>SotE wiki</li><li>SotE subreddit</li></ul>\n<p>The world of SotE will be teeming with life. The civilized races (humans, elves, dwarves and the like) carve their way through--- or adapt--- to the wilderness, transforming it to their own needs and vision. But beyond the pale light of civilization, monsters and barbarians alike feed, breed, and seek habitat in all the many multitudes of dark places on the map. Like the hungry beasts that they are, they nibble at the borders of civilization, forever threatening to overtake it and return the achievements of advanced societies to ruins and dust.</p>\n<p>SotE is a post 4X game. It attempts to overcome the stereotypical 4X genre by introducing realistic systems of ecology and economics as a basis for evolving societies and an evolving world. While there are the familiar vestiges of eXplore, eXpand, eXploit, and eXterminate, SotE breaks free of the frantic race against evenly matched opponents that most 4X games force their players to participate in. Most 4X games are about achieving irreversible improvements both technologically and economically, but in SotE, a remote mountain valley civilization may just as well outlast that highly advanced continental empire over yonder. In a game where decay mechanics are just as robust as growth mechanics, a society guided toward resiliency might easily outlast the society that is geared toward rapid expansion, its technologies lost, its deeds and monuments forgotten after collapsing violently beneath its own weight.</p>\n<p>In an eternal game world where the decline or catastrophic collapse of civilizations are as common as their rise to prominence, the player is rewarded for taking their own time and inventing their own objectives in a system with an infinite combination of civilization types. There is no victory conditions, only the songs - each unique - sung by your society as it rises and falls through the eons.</p>\n<p>All the mechanics of SotE will be true to life. Not only will SotE take inspiration from real ecology, economics, warfare and governance, it will seek to replicate them. Civilized societies colonize and transform the land around them, making it more suitable for themselves while the wilderness persistently weathers at it, as though threatening to wash it back to the sea. Along with an authentic economic growth system, societies participate in true and dynamic trade, taking into consideration supply, demand, and costs of transaction related to distance, terrain, and banditry. Warfare will take into account the real world limitations of supply, morale, and the oft overlooked subject of what kind of men and materials are available in a society. When you govern, you will not be some all-knowing God King micromanaging the day to day work schedule of every citizen, but instead be the ruling agency of your society with limited power, capable of influencing and directing the activities of your people but not dominating them.</p>\n<p>These are just a few of the simulated systems slated for SotE, and when combined together, they will create emergent game-play where decisions cascade through society with predictable but sometimes unexpected results. The joy in SotE will be in the player's freedom to experiment, and how that experimentation will contribute to the rise - or decline - of your civilization.</p>\n<p>Songs of the Eons is currently at version 0.1: \"Muspelheim.\"   Current features include: </p>\n<ul><li>A complex plate tectonic system which generates geologic features along plate boundaries similar to what one encounters in the real world, generates hotspots, and includes many other geologic features.</li></ul>\n<ul><li>A climate system that considers the topography of the world and influences weather patterns.</li></ul>\n<ul><li>Rainfall, surface water movement, temperature distributions, and erosion which is influenced by the topography of the world and climate.</li></ul>\n<ul><li>The ability to alter dozens of variables related to world generation including the speed and frequency of tectonic plates, volcanic activity, the frequency of historic orogeny, and more.</li></ul>\n<p>Our ultimate goal is to build numerous layers of simulation using each prior layer as a foundation.  Version 0.2 will construct ecology and carrying capacity of the land, version 0.3 will generate biomes and animal populations, version 0.4 will involve animal migration and rudimentary population, and so on.  In the end, we aspire to base our grand strategy game atop the living world of Songs of the Eons.<br/></p>\n<p>Anyone interested in accelerating the development of Songs of the Eons can support us at: https://www.patreon.com/SongsOfTheEons</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/510/510c29f37c34d963b81e7c71fb7288f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Demian", "Cyber_Monkey", "Calandiel"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}