{"id": 273453, "slug": "one-2", "name": "One-2", "name_original": "One-2", "description": "<p><strong>One-2</strong></p>\n<p>A VR Speed Reflexes game. Test your reflex speed by punching the appearing balls and getting more points the faster you react. </p>\n\n\n<p>This game is based on the fundamentals of boxing - keeping your hands up to your face and bringing them back to cover it again is the true basics of boxing and this VR arcade game is designed to teach you this habit as well as challenge you and improve your reflexes and test your speed. ( Controls are at the bottom )</p>\n<p>One-2 is an Arcade style game with highscores and a truly \"one-more-time\" syndrome gameplay. </p>\n<p>Colab with Nicola Alberts (Niix) on this three week project as the lead developer and me as developer assistant and lead on style and visuals.  </p>\n<p>This project is a learning experience and truly something that I enjoyed working on and hope to work on it  some more. For now - the game is only VR compatible, but the next step will be to add in a PC version to make it playable for all (some heavy mechanic changes will be implemented for the PC version).</p>\n<p><strong>Some things to know :</strong></p>\n<p>~Using Steam VR - Developed with VRTK</p>\n<p>~Game crashes sometimes, please comment if this happens for User feedback.</p>\n<p>~Things that will be accessible after more development : Custom Time limit (30 sec by Default) and Difficulty for more experienced players.</p>\n<p>~Things to add or improve : Backspace on the keyboard would help wonders we know :) , more movement to learn basic combos rather than just Jabs &amp; Crosses (Possible game mode), single controller mode.</p>\n<p><strong>Game Controls :</strong></p>\n<p>~Hit the floating \"Play Game\" text in front of you to start the game. </p>\n<p>~After time runs out, fill in your name by using clicking the touch pad buttons on the controllers and press \"OK\" to continue.</p>\n<p>~\"Escape\" button to quit game (Will make this a button in game soon too).</p>\n<p>Hope you enjoy :)</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2ac/2acf475cbd8b8bd5dab27d61f85c3128.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Virtual Window", "Hardy", "Niix"], "genres": ["Sports", "Fighting"], "publishers": [], "esrb_rating": null}