{"id": 273489, "slug": "get-the-stones", "name": "Get the Stones", "name_original": "Get the Stones", "description": "<p><strong>Get the Stones!</strong></p>\n<p>A very simple and old-fashioned game! Just for time pass...</p>\n<p>All you need to do is fly and get the stones.</p>\n<p>You use the touchpad at the bottom to fly.  You can fly in any direction using this on-screen touchpad (360 degree maneuver).</p>\n<p>The scroll shows the number and type of the stones you need to get, to progress to the next level.</p>\n<p>Flying burns you out; so try not to run out of energy. If you do, you will only be able to roam near the ground. But worry not; you can always get the stars to boost your energy.</p>\n<p>Then, there are those mystery baubles, that come and go! Some make you grow bigger, while some others make you shrink. There are some that speed you up, while some slow you down. Some gift you a life, while some take it away. Some boost you up, while some others wear you out. There are lot more, which you will see as you progress; be wary, for you know not what it does!</p>\n<p>Last, but most important of all, don’t get too close to the spooky bouncing stones.</p>\n<p>Let us see how far you can go... All the best!</p>\n<p>Additional features:<br/># Multiple levels, progressing from very easy to harder levels of difficulty.<br/># Numerous baubles, which when collected, changes the game play in different ways.<br/># Supports left-handed and right-handed play (position of touchpad is configurable).</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/968/968769cddf16dda541ad64cad38c45b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Whizzy Minds"], "genres": [], "publishers": [], "esrb_rating": null}