{"id": 273406, "slug": "an-fhicheall-mhor-grand-chess", "name": "An Fhicheall Mhór (Grand Chess)", "name_original": "An Fhicheall Mhór (Grand Chess)", "description": "<p>This is Grand Chess—an RPG-meets-chess that will push you to your limits. You will be journeying through a variety of levels with you King and other chess pieces you take along the way. Will you be able to make it? If you aren’t willing to sacrifice a few pieces along the way, you will have a very, very hard time winning. </p>\n<p>Controls:<br/></p>\n<p>Click a piece—select it<br/></p><p>Click on a highlighted square one a piece is selected—move to that square<br/></p><p>The places you can move will be shown in red if you can move and capture there, blue if you can move and not capture there, and green if the square is ‘on they way’ but you cannot move to it.<br/></p><p>**If you capture a piece you keep it in the next levels until it dies</p>\n<p>Goal:<br/></p><p>Get to the yellow tile at the end of the stage to advance to the next one. Pass the final level to win!</p>\n<p>Good luck!<br/>----------------------------------------------------------------------------------------------<br/>As Gaeilge:<br/></p>\n<p>Seo é An Fhicheall Mhór—cluiche fichille an-dheacair! Beidh tú ag dul trí cúpla leibhéil leis an Rí agus bail píosaí fichille eile. An féidir leat dul trí gach stáitse? Mura mbeadh tú ag íobairt cúpla píosaí atá agat, níl beidh tú in ann bua a bheith.</p>\n<p>Chun rialaigh an cluiche:<br/></p><p>Cliceáil ar píosa—roghnaigh píosa<br/></p><p>Cliceáil ar leacán curtha chun suntais--bog an píosa go dtí an leacán sin<br/></p><p>Má tá leacán curtha chun suntais dearg, is féidir leat dul nó aimsiú ann, má tá sé gorm, ach amháin dul ann, má tá sé uaine, ach amháin bog tríd.<br/></p><p>**Má gabhann tú aon píosa beidh sé agat sa leibhéil eile nuair atá sé beo</p><p>Dúshlán:<br/></p><p>Dul go dtí an leacán buí os comhair an leacán tosú. Déan gach leibhéal chun an deireadh!</p>\n<p>Go n-éirí an t-ádh leat!</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7b6/7b68fa16781b2b7d8badcbefdb024c7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeffrey Sardina"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}