{"id": 2735, "slug": "dungeon-scroll", "name": "Dungeon Scroll", "name_original": "Dungeon Scroll", "description": "\"BUY THIS GAME.\" - Eli Hodapp, admin of touchArcade<br/><br/>\"If you don’t like word games, this one may actually convert you\" - Big Albie<br/><br/>“Depending on how you look at it, Dungeon Scroll either takes adventuring/RPG games or Puzzle games where they haven't been before ... Puzzle game of the year” – Game Tunnel (PC version)<br/><br/>“With a great combination of real-time play, fantasy motif, and excellent mechanics (and a competent dictionary, I might add), Dungeon Scroll becomes my new favorite word game… Two thumbs up, way up!” – The Underdogs (PC version)<br/><br/>\"Dungeon Scroll is an amazingly fun little game that really puts your vocabulary and quick-thinking skills through the wringer\" - Gamespot (PC version)<br/><br/>The award winning game Dungeon Scroll is now fully optimized for play on your iPhone!<br/><br/>If a word game and a dungeon crawler had a baby, this would be it.  Arrange tiles to create magic words and blast rats, spiders and skeletons.  But beware, a great evil looms beneath the depths.<br/><br/>Grab your wand and sharpen your intellect for you’re about to embark on a dangerous journey through twenty-five of the most vile dungeons in the realm!  <br/><br/>Features:<br/><br/>• Internet Global Highscore feature including world flags and the most comprehensive game details ever in a word-game!<br/>• Automatic save/resume on exit<br/>• Secrets and ‘magic words’ for you to find<br/>• Kid Mode, Normal, and Wizard game modes<br/>• High quality orchestral stereo soundtrack<br/>• Created by award winning game designer Seth A. Robinson (Legend Of The Red Dragon, Dink Smallwood, Growtopia)", "metacritic": null, "released": "2003-06-25", "tba": false, "updated": "2019-10-22T14:28:10", "background_image": "https://media.rawg.io/media/screenshots/106/106b3d50c04b5c7f3a3cb6541a67c5af_MtUAFgb.jpeg", "website": "http://www.rtsoft.com/pages/dscroll_mobile.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS"], "developers": ["Robinson Technologies", "www.rtsoft.com"], "genres": ["Educational", "Puzzle"], "publishers": ["Robinson Technologies"], "esrb_rating": "Everyone 10+"}