{"id": 273665, "slug": "claude-van-clamme-presents-lambs-to-the-slaughte-2", "name": "Claude Van Clamme Presents: Lambs to the Slaughter Temple of Gods Edition (We Are Not Spies)", "name_original": "Claude Van Clamme Presents: Lambs to the Slaughter Temple of Gods Edition (We Are Not Spies)", "description": "<p><strong>Claude Van Clamme Presents - Lambs to the Slaughter Temple of Gods Edition\r\n</strong></p>\n<p><strong>Disclaimer:</strong> there are no lambs</p>\n<p>In a world, dominated by the ever present entertainer extraordinaire Claude Van Clamme, the old gods grow restless, for far too long the gods have been unsatisfied and sacrifices to them have reached an all time low mostly due to the human race being mesmerised by Claude Van Clamme’s tantalising shell on their television screens and the gods disapprove of the trials and tribulations and low entertainment level of the Claude Van Clamme’s latest Game Show - “Lies, and the Lying Liars who tell them”.</p>\n<p>Your job as a newly hired high-priest in the temple of gods is to sort through the decks of humans and ensure each god is well and truly satisfied.</p>\n\n\n<p>Welcome to Sacrifice Ltd!<br/></p>\n<p>Tomorrow is your first day, you will be in charge of choosing who to sacrifice to the gods.</p>\n<p>The four gods you will attempt to satisfy are:<br/>Sir Pent (Green): He loves strong people<br/>SkeleDeer (Yellow): He wants your gold<br/>Triangulon(Pink): He'll tell you a who to kill - in letter form<br/>King Octo(Purple): He likes smart people<br/>Our eschatologists tell us it would be bad if they're not happy!</p>\n<p>To select a target for sacrifice pick up a card corresponding to a person and stamp it with the corresponding stamp corresponding to the god.<br/>Be careful the next generation of a house will take after the surviving members of that house.</p>\n<p>The people will get angry if you kill them,<br/>if they belong to a house that house may attempt assassination - but they'll tell you beforehand.<br/>You can bribe the houses with our handy bribe board, this is also where you buy guards.</p>\n<p>You get money from donations from houses, the happier they are with you the more they'll give you.<br/>The Daily Sacrifice will give you all the information you need about the wills of the gods and the houses.</p>\n\n<p><strong>Gods: </strong></p>\n<p><strong>SirPent</strong> - The muscular snake lord himself made of pure muscle finds himself most satisfied by the humans of only the strongest stature.</p>\n<p><strong>Triangulon</strong> - The most picky and pointy on all sides of all the gods, will only be satisfied by only the most specific of humans.</p>\n<p><strong>Skeledeer</strong> - The god of strange crossover episodes where the actors are only in it for the money is a golden god and is also only in it for the money.</p>\n<p><strong>OctoKing </strong>- the smartest of all the gods, so smart in fact he realised he could carry 4 weapons prefers only the brainiest of all humans.</p>\n\n<p><strong>Houses:</strong></p>\n<p><strong>Keeley:</strong> Everyone that may or may not be named Keeley or may want to be named Keeley.</p>\n\n<p><strong>Thomas:</strong> Often massive fans and worshippers of a certain steam engined trains. House Thomas also contains many humans that may or may not be named Tom or Tom-Tom or Thomas.</p>\n<p><strong>Laners</strong>: Drivers undeserving of a license who don’t know how to stay in their lane or even how lanes on the road work so just drive like they own the road and get angry if you even dare to insinuate that they are in the wrong.</p>\n<p><strong>Bull:</strong> Generations and generations of worshippers of the great cow Knickers and all things cow related.</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/13b/13be9bc7e328045d0a6396265f88d1c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["We Are Not Spies"], "genres": [], "publishers": [], "esrb_rating": null}