{"id": 273674, "slug": "a-blood-gods-virgin-voyage", "name": "A Blood God's Virgin Voyage", "name_original": "A Blood God's Virgin Voyage", "description": "<p>Sacrifices must be made. You are a blood god, with the goal of returning to the mortal plane. In order to do this, you must sacrifice a virgin at your altar. You can bring them to life, but the altar is four rooms away.</p>\n<p>A game made from scratch  in 72 hours by myself and Clint Glenn for Ludum Dare 43.</p>\n\n<p>## Mechanics</p>\n<p>The game is played in three rotating phases:</p>\n<p>1. Spawn -- you must create a new virginal Loved One in the the Blood God's Chamber at the beginning of every turn. This costs 1 Soul, and if you enter the Spawn phase with 0 Soul you will lose.</p>\n<p>2. Encounter -- when you have rooms with at least three Loved Ones, a random encounter will occur. This only happens in rooms that have at least three Loved Ones. You will be forced to make a choice: you can make the Loved Ones fight to the death and preserve their virgin status with the winner gaining Strength, or they can kiss and lose their virgin status (but both will gain a Strength point).</p>\n<p>3. Act -- by selecting a room using the arrows in the bottom left, you may choose a single action per turn:</p>\n<p>    Rest: yield your action, with no effect to Soul or Loved Ones<br/></p>\n<p>   Advance: choose a Loved One to move to the front of the line in a particular room</p>\n<p>   Open Door: the Loved One at the front of the line will hold the door open, allowing those behind to move to the next room. The number of Loved Ones that move is determined by the Strength of the Loved One holding the door (e.g. 2 STR allows 2 Loved Ones to advance). The door holder will then be crushed by the door.</p>\n<p>   Touch the Idol: the Loved One at the front of the line can touch the Idols in the Corridor of Hope and the Corridor of Despair. This allows you to consume them for an increase in Soul:</p>\n<p>      Weakling non-virgins (STR: 0): 0 Soul</p>\n<p>      Weak non-virgins (STR: 1): 2 Soul</p>\n<p>      Strong non-virgins (STR: &gt; 1): 4 Soul</p>\n<p>      Virgins: 6 + STR Soul</p>\n<p>Your goal is to pass a virgin through the final door, beyond the Entry to the Altar room. Good luck!</p><p>## Philosophy<br/></p><p>We wanted to create a game that involved sacrifice at every level. The easy choice for a setting (a blood god using sacrifices to take over the world) eventually resulted in what we thought were some interesting mechanics. Playing this game, you lose something at just about every turn -- some Soul at the beginning, either a Loved One or someone's virginity at the Encounter phase, and you often trade a Loved One for advancement in the Act phase. It leads you to a lot of calculated risk decisions, and you're hopefully often left feeling like you've lost something-- making the joy you feel (when RNGesus rewards your risk-taking) that much better.<br/></p><p>The names of the Loved Ones were intended to be provided by the player for an extra layer of sadism, but we unfortunately (or fortunately?) did not have the time to implement that feature. Instead, there are some random names, but hopefully the relationship 'modifiers' will still lead to some drama and fun when it comes to deciding whether to make the Loved Ones kill or \"kiss\" each other.</p><p>We also focused on the gameplay tuning and design prior to anything else -- at the end of Friday night we had nothing but notes, and there weren't any graphics in the unity project until halfway through Sunday! There are some visual bugs and not a lot of polish as a result, but we hope that you can enjoy the game for its gameplay.<br/></p><p>## Credit</p><p>Designed and created by Zak Reynolds and Clint Glenn</p><p>Graphical and musical assets are original, created with the help of Pickle Editor, FL Studio, Serum, and Audacity. Sound effects were created with help from resources in the GDC audio pack, Image-Line samples, and freesound.org.<br/></p><p>Font: https://www.fontsquirrel.com/fonts/almendra<br/></p><p>Built with Unity.<br/><br/><br/></p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/019/0198bf5771618edf302247757b67dc83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zre"], "genres": [], "publishers": [], "esrb_rating": null}