{"id": 273610, "slug": "steampirates-of-bermuda", "name": "Steampirates of Bermuda", "name_original": "Steampirates of Bermuda", "description": "<p>My entry for Ludum Dare 43. Hunt down merchant ships, blast them to pieces and loot their valuables. Just watch out for your friendly neighbourhood Eldritch Horror. <br/></p>\n<p>If it gets to close, you might want to throw a crewmember overboard. Sure, your ship's performance will suffer, and the \"volunteer\" will be horribly devoured. But better him than you. And hey, more loot for the survivors, right?</p>\n<p>Okay, so serious time: This game is only barely done. The in-game UI showing you your score was left out due to time constraints so you only see your score when you finish, the cursor is still a default arrow, I couldn't find a free sound loop of a steam engine anywhere... <br/><br/>Nonetheless, I made a game. Not a very polished game, but still. Give it a spin if you want. Escape brings up a how-to and control list.</p><p>Post-Jam update: I spend an hour or two to add a few small quality-of-life improvments to the game. I finished the in-game UI so you can more easily view your current stats and I expanded the score screen at the end of the game. I fixed some mistakes in the terrain that could get your ship stuck in seemingly open water, as well as made sure the merchant ships don't get stuck so easily. I added a blinking-effect to the loot that starts when you're within looting range. <br/></p><p> If you want to judge my entry stricktly as it was at the end of the jam, take the original. If you want to have a bit more fun playing, take the new one. There isn't that much more work in it. <br/></p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/279/279f76f6e46b7e561b5e5810f7b6264f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["bificommander"], "genres": ["Action"], "publishers": [], "esrb_rating": null}