{"id": 273704, "slug": "devil-cult-party", "name": "Devil Cult Party", "name_original": "Devil Cult Party", "description": "<p>Manage a spooky demon death-cult.<br/></p>\n<p><strong>Bring about the doom of mankind, and watch out for competitors!</strong></p>\n<p>Human sacrifices, studying the occult, selling merch, bringing back the dead and transforming cultists into demonic abominations is all part of the business. Get to work, the world won't end itself!</p>\n<p>A game by @FrancisCoulombe , with music by  @askiisoft and @CBoyardee !</p>\n<p>ARROW: move<br/>X: jump<br/>C: use item/examine<br/>down+C: pick up or put down<br/>up+C: build</p>\n\n<p><strong>Tips and Trix:</strong></p>\n<ul><li><strong>Your role in the game is of manager</strong>; you cannot use the various constructions yourself, other than sacrificing cultists to the altar with the knife. You also <strong>cannot fight monsters yourself. </strong>All of this must be done by your followers.</li><li>You can micromanage followers by <strong>picking them up and putting them back down</strong> where you need something done, however.</li><li>The final challenge of the game is to <strong>build the dark portal and summon Satan</strong>, which costs a lot of time and resources, and has<strong> disastrous consequences</strong>.</li></ul>\n\n<p><strong>I think figuring out how most of the game works by yourself is the most fun, but here are a bunch of extra tricks to look over if you have a hard time getting started!<br/></strong></p>\n<p><strong>Resources:</strong><br/></p>\n<ul><li>Your 3 resources are<strong> Cash, Piety and Ambiance.</strong></li><li><strong>Cash</strong> is needed for all constructions and is generated over time <strong>by your cultists</strong>, and by <strong>merch booths</strong>. You also get some gold whenever you kill monsters infesting your temple grounds.</li><li><strong>Piety</strong> is needed for some of the more occult constructions and to use dark magic, and is slowly generated by having cultists sit in pews or chairs to pray.</li><li><strong>Ambiance </strong>is not exactly a resource, it's more like<strong> a</strong><strong> rating of how spooky your temple is</strong>. High ambiance brings more followers over time, makes them part with their money faster and increases the effectiveness of many of your constructions.</li></ul>\n<p><strong>Cultists:</strong></p>\n<ul><li>Devoted cultists are the backbone of your operation, and they do everything. They construct buildings, operate them, fight monsters and even produce cash.</li><li>Cultists regenerate health over time, but reanimated corpses do not, you will just need to reanimate them again at the Wicked Idol if they collapse.</li><li>You can direct them to clear debris obstructing the path deeper into your temple grounds, and seal monster-spawning objects like rat nests.</li><li>Cultists need food and drink! <strong>Build a kiosk somewhere </strong>or they will eventually stop working, leave your temple, or even die.</li><li>Cultists gain experience through many tasks.<strong> Higher-level cultists perform better</strong>, and are stronger in combat.</li><li><strong>Sacrificing cultists to the altar using the bloody knife</strong> fills it with blood, which readies it to be worshiped by other cultists and generate piety. You can also capture the soul of cultists into Soul Stone buildings, which can also be worshiped for piety.</li></ul>\n<p><strong>Constructions:</strong><br/></p>\n<ul><li>Build a library (and later an alchemy lab) to<strong> research new constructions.</strong></li><li><strong>Different constructions are available to build at different areas</strong> of your temple (outside, inside, and in the central sanctuary)</li><li>Most constructions you build affect the ambiance of your cult. <strong>Some buildings add to ambiance</strong> (statues, lit braziers, altars...) <strong>and others reduce it</strong> (folding chairs, merch booths, catering table)</li><li><strong>Constructions placed outside the walls</strong> of your central building have a lessened impact (be it negative or positive) on your ambiance, and <strong>constructions placed within the central room</strong> have doubled ambiance impact.</li></ul>\n<p>Good luck, and have fun!</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-08-28T23:19:09", "background_image": "https://media.rawg.io/media/screenshots/b9a/b9a352da6a9ace246a7e87b5a1394d8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FrankieSmileShow"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}