{"id": 27378, "slug": "cube-tactics", "name": "Cube Tactics", "name_original": "Cube Tactics", "description": "<p>\n      This title is a participating title in the Autumn Sale by Teyon. Get \n      select Nintendo 3DS games from Teyon with a 50% discount in the Nintendo \n      eShop. Visit the Nintendo eShop to learn more.\n    </p><p>\n      Fierce enemies roam the land of cubes, protecting their core and \n      bringing their opponents to mercy. Begin your training with Sir Knight \n      as you take to becoming a Cube Master to tackle these lethal enemies in \n      this strategic and tactical war-game with cubes.\n    </p><p>\n      Perfect your skills with over 25 Quests to complete in Single Player \n      mode and even more online Multiplayer battles with up to 3 enemies at \n      one time! Trample your enemies and build your army with numerous cubes \n      to earn medals not just for appearances but to equip and advance your \n      army with even more power! The battle for power and position has begun \n      in this tactical game of cubes!\n    </p><ul>\n<li>\n        Unique and strategic war-game with cubes\n      </li>\n<li>\n        Battle against more lethal enemies with online Multiplayer mode and \n        international rankings\n      </li>\n<li>\n        Over 25 tactical Quests to complete in Single Player mode\n      </li>\n<li>\n        Various cubes and fighters with unique combat abilities for thrilling \n        battles\n      </li>\n<li>\n        Multitudes of medals to collect and equip in-game for extra military \n        power!\n      </li>\n</ul>", "metacritic": null, "released": "2013-06-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/100/100b0f3597235d1e0be6692153290889.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo 3DS"], "developers": ["Fun Unit"], "genres": [], "publishers": ["Teyon"], "esrb_rating": null}