{"id": 273982, "slug": "hatty-tom", "name": "Hatty & Tom", "name_original": "Hatty & Tom", "description": "<p>We've chosen to use Mixamo for rigging and animations because it makes decent, fast and cool animations, that can be a little goofy sometimes, which we enjoy!<br/>We've used Photoshop for a few UI assets, and all the sound effects have been recorded by Pokang and his scuffed mic with various objects around his apartment.<br/>The super short music loop has been made by Pokang on LMMS, he's never really made music before so the track is very simple, we didn't want to have a near to silent world and we didn't want to use other's people assets!<br/>All the rest has been made by our super cool programmers who have made an crazy job at learning UE4 along their path to enlightment and who learnt a whole lot of cool things during the development of the game.<br/>We're impressed at how many things we've come to acheive during the 72 hours of the jam and these things include : </p>\n<p> -A cool main menu<br/> -A lot of animations for characters<br/> -A fighting system<br/> -An equipment system with items you can drop when needed<br/> -A dialog system which brings a story we entirely wrote and imagined from scratch<br/> -Crouching, jumping, movement features<br/> -A platformer part<br/> -A healing system<br/> -A very short cinematic<br/> -A checkpoint system<br/> -Very mean enemies that attack you just for the sake of it<br/> -Credits!<br/> -An excessive theine consumption by the team</p>\n<p>Bindings :         Controller     Keyboard</p>\n<p>-Move            Left stick       WSAD<br/>-Jump                  Y          Spacebar<br/>-Crouch                X             C<br/>-Respawn               B             R<br/>-Fight            Right Trigger  Left Click<br/>-Interact              A             Q<br/>-Drop Weapon      D-pad Right        G<br/>-Drop Armor       D-pad Left         H<br/>-Drop LegArmor    D-pad Down         F<br/>-Drop Hat         D-pad Up           N</p>\n<p>Now to give a little background about where this all started, Dumbeldor and Emeffe are both students and friends in the same class, and Dumbeldor met Pokang during another project which is called Skyrim Together, a Skyrim mod that has the objective of bringing multiplayer and coop to Skyrim.</p>\n<p>Feel free to tell us your honest opinion about our game, we'd love to hear it even if it's not positive!</p>\n<p>We're looking forward to playing all of your awesome submissions guys, I've personally noted some of them that I REALLY want to play.</p>\n<p>Thank you Ludum Dare to give us this wonderful opportunity to train ourselves and create cool stuff, we enjoyed this event so much as a team.</p>", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb919bf3f7823ef605a663ff013effb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pokang"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}