{"id": 274020, "slug": "breachsquad", "name": "BreachSquad", "name_original": "BreachSquad", "description": "<p>Entry for LD43</p>\n<p>=============================<br/>Breach Squad</p>\n<p>A turn-based tactical game about forced house demolishing,<br/>a violent action to take down buildings whose resident refused to move out in time.</p>\n<p>NOTE<br/>Due to time limit, I couldn't provide too much tutorial infomation inside the game, so please read below.</p>\n<p>=============================<br/>How to play</p>\n<p>Left mouse btn to select and issue command to units.<br/>Right mouse btn to quit/cancel any selection state.<br/>Drag to rotate the camera, mouse wheel to zoom in/out.</p>\n<p>When selecting move position, click on the unit itself to stay.<br/>When selecting attack target, click on the unit itself to rest, instead of performing any attack action.</p>\n<p>The goal of each level is to destroy ALL the buildings that belongs to enemy.<br/>You will lose if you lose all your units.</p>\n<p>=============================<br/>Combat Guide</p>\n<p>Units has different battle classes, they have bonus against one another, like Rock-Paper-Sissor</p>\n<p>BRUTE UNIT (Thug/Riot)  &gt;&gt;&gt;  MEDIA UNIT(Gov, / Journalist)  &gt;&gt;&gt; LAW UNIT(Police/Lawyer) &gt;&gt;&gt;&gt; BRUTE UNIT<br/>WORKER UNIT can only attack BUILDING</p>\n<p>The number on unit indicate the  HP  and strength of that unit, meaning that a unit at lower HP will attack less efficiently.</p>\n<p>Some terrain provide defensive buff or debuff for units standing on it. </p>\n<p>=============================<br/>Background</p>\n<p>The game concerns about the intense social conflict occurring in China,<br/>where the eager real estate developers could not wait to get rid of the old residents of the land.<br/>They conspired with local authorities and even hired thugs to drive the people out of their homes.</p>\n<p>Lawyers and journalists volunteered to help. But they were suppressed as well.</p>\n<p>In the cities, the powerless and the poor people were the sarcrifice of the fast urbanization and economical development.<br/>In this game, player was the enforcer of such dirty jobs, a link in the chain of greater grey business.</p>\n<p>More on this topic:<br/>https://en.wikipedia.org/wiki/Forced_evictions_in_China</p>\n\n<p>=============================<br/>Version<br/></p>\n<p>NOTE THE WEB VERSION IS NOT JAM VERSION</p>\n<p>V1.1 </p>\n<p>FIX BUG Top left turn number UI</p>\n<p>Unit facing when move and attack</p>\n<p>Unit battle hint in the unit card UI</p>\n<p>=============================<br/>Team</p>\n<p>I (Guoboism) am the only team member</p>\n<p>Music and sound are found on sites like opengameart.<br/>Voxel model and 2D stuff are created during the game jam.</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d29/d2907db0b6cf5bfcb551cf240c036ff3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["guoboism"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}