{"id": 274289, "slug": "desolate-text-version", "name": "Desolate (text version)", "name_original": "Desolate (text version)", "description": "<p>This is an adaptation of the Desolate boardgame by Grey Gnome Games. The creator has kindly given me permission to distribute this. You can find an official print-and-play edition of Desolate on PnPArcade.</p>\n<p>If you have previously played Desolate then this is a one-to-one translation of the game to digital text-based form so there shouldn't be any surprises.</p>\n<p>I have implemented it as a text-based game which runs in a Windows terminal. Input is via keyboard in order to enter choices for what to do next.</p>\n<p>Description of the original board game:</p>\r\nThere was no communication with Station 4 on the distant moon, X483. You were part of a rescue mission to investigate the silence. Upon arrival your ship lost the use of its controls and crash landed but meters away from the station.\r\nOnce inside you realized something terrible had happened. The station was occupied by aliens!\r\nStranded, you must make your way through the station to locate enough power cells to activate the escape shuttle. Will you be able to survive the horrors of the abandoned station?\r\n<p><strong>How to play</strong><br/></p>\n<p>Your goal is to collect 5 power cells without running out of health or oxygen. The game has an exploration deck (a card deck that is part of the boardgame) that represents rooms to explore and encounters with aliens.</p>\n<p>The game is split into \"levels\", which represent one use of the entire exploration deck, after which it is shuffled and a new level starts. Each level contains multiple \"turns\". Each turn consists of drawing two exploration cards. You are shown one and must decide whether to resolve that card or the unknown second card. When a level ends you consume 2 units of oxygen. If you reach 0 then you die.<br/></p>\n<p>Rooms provide you with the stated reward directly. Power cells can be found in Engineering. Conflict cards have an associated value, shown for example as \"Conflict (4)\". This value is added to a randomly generated value (1-6) to give the alien's health. When combat starts you automatically take a random amount of damage (0-4). You decide how much of your ammo to use in each combat round. Each unit of ammo gives you a dice roll, which are all added together to give the damage caused to the alien. If you haven't killed it then it damages you again (0-5 points) and a new round starts.</p>\n<p>For those familiar with the boardgame, the random values are generated from a conflict deck that this game maintains behind the scenes.</p>\n<p>The video shown on this page demonstrates a single play of an earlier version of the game.</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bf6/bf6d749550a001b27bf58b00d1f4943d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kemp"], "genres": [], "publishers": [], "esrb_rating": null}