{"id": 274264, "slug": "mortal-decisions", "name": "Mortal Decisions", "name_original": "Mortal Decisions", "description": "<p>You have been a space trucker for many years. Everyday you haul shipments which can save the life of those who need it. Unfortunately, for every life you save there are others that die. You can't save them all, so you have to decide who to sacrifice.</p>\n<p>Welcome to Mortal Decisions! A game of choices and sacrifice. Can you made the hard decisions when the time comes?</p>\n<p>In this game you will be presented with your ships Log Screen and a View of your ship. A panel on the right will let you know how many credits you have, how much fuel you have and the health of your hull and engines. Your job is to earn 10000 credits so you can finally retire.</p>\n<p>Below the Log Screen is the Contact Dispatch button. Use it to contact the dispatch where you can get a job, request a fuel ship or request a repair ship. When you request a job you will be presented with 2 options. The left option will be a job helping many people, the right option will be a job helping a single person. Choosing one job means the other job will not be completed and those people or that person will die.</p>\n<p>Once you choose a job the Log Screen will let you know what stage you are at. There is a possibility you will encounter Space Pirates. If you do you have 2 options, you can try to outrun them or you can drop your cargo and flee. If you try to outrun them there is a chance the Space Pirates will damage your ship but if successful you will continue the delivery and will get paid. On the other hand if you drop the cargo, while you will get away unharmed you will lose the job and the payment.</p>\n<p>If you run out of fuel, or your hull/engines get too damaged you will lose the game. Good Luck!</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/437/437a8ca1d11faf9df84a308fa070a0d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KunoNoOni"], "genres": [], "publishers": [], "esrb_rating": null}