{"id": 274227, "slug": "vikrifice", "name": "Vikrifice", "name_original": "Vikrifice", "description": "Why the viking is in tropics?! \r\n<p>These are the early adventures of the vikings. They were sacrificing the most dangerous beasts like pigs, goats and others to their gods. And these very gods were choosing the next place to sacrifice. This time, our brave viking with helmet on his eyes needed to go far far away to make the sacrifice. The animals which he needed were hidden by the enemies in caves! And from these caves only one thing could get them out: THE MEOW OF A KITTEN!</p>\r\nControls\r\n<ul><li><strong>Move</strong>: <strong>A/D</strong> or <strong>Arrow Keys!</strong></li><li><strong>Jump</strong>: <strong>Space!</strong></li><li><strong>Double jump</strong>: Press space and than second time when you need it!</li><li><strong>Pick up</strong> / <strong>put down</strong> pigs and other very endangered species: <strong>E!</strong></li><li><strong>Sacrifice</strong>: <strong>Q!</strong> (Only near the altar and don’t sacrifice the kitten you bully!)</li><li><strong>Have fun</strong>: <strong>Just play!</strong> :P</li></ul>\n\r\nFrom our team\r\n<p>We did it! It is our first LD Jam! In 72 hours we created 5 levels where you can completly immerse in real viking world. The whole truth about they real hunting is shown in this very game! After the game you will know how vikings were using kittens to hunt the most dangerous beasts!<br/>You can be sure that you will need to sacrifice a lot to pass these levels! </p>\n<p>You’ll find there the most endangered species like pigs, goats, sheeps and MORE!<br/></p>\n<p>And did you know that in the end there are <strong>TWO endings?!</strong> Which one you choose?!</p>\n<p>(hint: choose the right one)</p>\n<p>(hint 2: there is no right one! hahaha!)</p>\n<p>P.S. The game uses saves so you can come back and play further!</p>\n<p>Btw we made a <strong>poll</strong> to find out what happened to you on 5. level if you managed to play that long! It would be awesome for us to know the answer of this question. The poll is here: https://www.strawpoll.me/16978464</p>\n<p>Everything inside this game is created within 72 hours, including idea, mechanics, art, music, sound effects, levels and code!</p>\n<p>We hope you’ll love it as much as we do. ;)</p>\r\nMeet our hunting friend! The ancient technique to lure the animals!\r\n\r\nLevel 1 walkthrough:\r\n\r\nWe added Level 2 walkthrough on youtube!\r\n<p><strong>Change log</strong><br/>We needed to update the game in two places:<br/>- there was a typo in the game over information, it was scaled down in the big screen and had wrong color which was almost unreadable<br/>- in Level 2 we got rid of one spikes which we found behind flowers. That was causing sudden death of the Player because of the wrong collison there :/</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-08-28T23:19:05", "background_image": "https://media.rawg.io/media/screenshots/771/77163accc24d433928f35fddfcff2671.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lucidus"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}