{"id": 274338, "slug": "gold-digger-space-monkey", "name": "Gold Digger (Space Monkey)", "name_original": "Gold Digger (Space Monkey)", "description": "<p> <br/></p>\r\nSacrifices are not always the ones we expect.\r\n<p>What should you sacrifice? Gold? Your Uncle’s respect? Your workers well being? The choice is yours!</p>\n<p>GOAL\r\nMaximize your final score! </p>\n<p>Genre:\r\nStrategy</p>\n<p>Controls:\r\nMouse Only</p>\n<p>Setting :\r\nUncle John has a mining company. It’s still at the start of the business, but everything seems to be going well. He has three happy employees and has $30 in reserves. After one year of hard work, that means he is looking forward to go on a holiday. Because he has trust in you and seeks a potential successor in the family, he would like you to keep an eye on the business while he is on a trip to the nicest beaches in Jamaica. During this period of two weeks, he has given you all the rights to do anything you can to keep the company running.</p>\n<p>Shop:</p>\n<ul><li>Pickaxe - Improves working speed. Equipping your workers with the proper tools is extremely important for their efficiency and self-esteem.</li><li>Helmet - Mandatory protection equipment for diggers.</li><li>Coffee - Improves working efficiency, but your workers will start taking breaks when they feel like it.</li><li>Stimpack - Dramatically improves working efficiency. Drugs are bad.</li></ul>\n<p>Workers :</p>\n<ul><li>Red Worker - Costs 2 coins at the end of the day, 4 when you hire him. Severely underpaying people is very bad.</li><li>Orange Worker - Costs 5 coins at the end of the day, 10 when you hire him. Underpaying people is bad.</li><li>Blue Worker - Costs 10 coins at the end of the day, 20 when you hire him.</li><li>Green Worker - Costs 20 coins at the end of the day, 40 when you hire him.</li></ul>\n<p>I will implement a leaderboard in a post-jam version, but in the meantime you can post your score in the comments if you want to share it.</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-08-28T23:19:04", "background_image": "https://media.rawg.io/media/screenshots/b37/b37079a9fca72720b2a68039ce658e64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Space Monkey"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}