{"id": 274580, "slug": "colony-itch-tim-eriksen", "name": "Colony (itch) (Tim Eriksen)", "name_original": "Colony (itch) (Tim Eriksen)", "description": "<p>In Colony you play as the leader of a small colony on a far away planet. Disaster strikes when a transport ship heading for you with vital resources, crash lands and damages the colony! You must keep the colony alive until help arrives at any cost. Some may even have to make the ultimate sacrifice for the survival of the colony.</p>\r\nControls\r\n<ul><li>Point and click with the mouse</li><li>Scroll around the map with WASD, arrow keys or by touching the edges of the screen with the cursor</li><li>Hold down the Shift key to scroll faster</li></ul>\r\nHow to play\r\n<p>The various locations on the map will deteriorate and break down quickly. When a problem arrises in a location, a number is displayed over the location. Click the location to see the problems that need fixing.</p>\n<p>Each problem has a specific type (biology, electronics, engineering) and a risk rating. If you click on a task you may then select whom to send to the task. Different people are good at different things, so select the people that are skilled in the type of problem you wan’t to fix.</p>\n<p>The more skilled the people are, and the more people you select, the lower the risk rating will be. Safety in numbers! The risk rating determines the chance of the crew taking damage and how much damage they take.</p>\n<p>Once the task has been completed the assigned people receive damage, get more experienced in the type of problem they just fixed and are now available to take on new tasks!</p>\n<p>Note: People heal as long as they are home on the base and not assigned to any task.</p>\n<p>Keep on trying to fix problems as they pop up and try to save the colony!</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ac9/ac9916a6d80be61bda371024f3ed71a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tim Eriksen"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}