{"id": 274500, "slug": "affirmation-racer", "name": "Affirmation Racer", "name_original": "Affirmation Racer", "description": "<p>This is a simple 80s style racing game I made that displays affirmations that you choose on the sides of the tracks so you can subconsciously absorb those affirmations while you race.  It makes me feel good to play it because I've edited it to include nice affirmations for myself.</p>\n<p>I thought of it when I was playing around with how to make a simple 80s style racing game but I also wanted to make billboards on the side of the road.  Before I could get full billboards working I was able to display text along the sides of the tracks (as you will see when you play) and I liked it so much I decided to go with that approach.</p>\r\nGameplay\r\n<p>Affirmation racer has simple controls.  The arrow keys (or WASD) control the car.  Up accelerates and left and right turn the car.  Down decelerates and goes in reverse.<br/></p>\n<p>Your current speed and current track time are displayed on the rear bumper of your car.  The best lap time you've ever made for a given track is displayed under the checkered flag at the start of each track where it says \"Time To Beat:\".  If it says that the time to beat is 0.000s that just means you have never finished this track before.</p>\n<p>The controls are tuned to feel slippery, and the car bounces off the walls so it can be fun just bouncing around and trying to get through the tracks. The fastest scores however will involve timing your bounces and acceleration to keep aimed in the direction you want to proceed and not slow down too much (since each bounce necessarily slows the car down somewhat). </p>\n<p>Each level number is randomly generated making for an interesting game every time you advance to a new level.  For example: Level 3 is always the same level and no matter how many times you start the game it will always be the same, but level 4 will be different than level 3 and level 5 will be different than level 4 and so on.  Your goal is to race through the twists and turns as fast as you can to get the fastest possible time.   </p>\n<p>There are a theoretically unlimited number of randomly generated levels so you should be able to play for a very long time and since you can always change your affirmations, there is a lot of possible variety. <br/></p>\n<p>Affirmation Racer is currently only available for Mac.  Apologies to all other platforms.</p>\r\nProgress\r\n<p>Once you have a good time (or any time you are ready to move onto the next level) just drive to the right down the next level ramp and you will be warped to the next level (same concept applies for the previous level ramp to the left).</p>\n<p>The game starts you off on the same level you last played.  It keeps scores for each level you play.  </p>\r\nHow to add your own affirmations\r\n<p>I've included some super simple affirmations with the game but they weren't chosen to be particularly effective for anyone in particular and it will be most effective if you add your own. There is a file that contains the affirmations and you just need to edit that file and here's how:</p>\n<ol><li>Right click on the game</li><li>Select \"Show Package Contents\"</li><li>from there navigate to Contents/Resources/Data/StreamingAssets</li><li>Right click on Affirmations.csv in that folder and open it with text edit</li><li>Add or replace affirmations to your hearts content</li></ol>\n<p>Once you are editing the file remember a few things:  Hit return at the end of the last line so there is a blank line at the end of the file.  Don't use commas in your affirmations.  You can make each line pretty much as short or as long as you want and the game will split up the words into appropriately sized chunks to make it all display properly.  If its longer than the whole track though it just displays as much as it can until the text hits the finish line.  </p>\n<p> The game will loop through your affirmations over and over.  For example if you are on level 10 and you only have 9 affirmations it will show the first affirmation.  Because of this you can replace the entire list of course and add as many or as few as you want (although I don't think zero will really work but I haven't tried it!). </p>\r\nTroubleshooting  \r\n<p>To start the game you may need to temporarily override your security settings the the very first time you play it: Right click and choose Open and then it will ask you to login to override those settings for this app.<br/></p>\r\nConclusion\r\n<p>Enjoy the game and thank you for playing Affirmation Racer!</p>", "metacritic": null, "released": "2018-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7fbd266d05b728757ce1dcbbb38459e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["fabdynamic"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}