{"id": 274771, "slug": "adventurequest-worlds", "name": "AdventureQuest Worlds", "name_original": "AdventureQuest Worlds", "description": "<p>About AdventureQuest Worlds<br />\nJoin millions of players in a video game that grows every week!<br />\nCreate a free character and embark on an epic adventure in a beautiful and ever-growing fantasy world filled with monsters and quests. AdventureQuest Worlds is a free-to-play web browser-based MMORPG (massively multiplayer online role-playing game) with brand-new weekly releases, real-time combat, challenging quests, beautiful cinematic cut-scenes, thousands of equipable items, interchangeable Classes, and an entire world to explore.</p>\n<p>New Release every Friday!<br />\nWe expand the game every week with new monsters, weapons, quests, areas, holiday &amp; special events, new features and more! Because the game is built in flash, we can add and change things in the game while you play it. Our friendly team listens carefully to player feedback... and uses it to shape the direction of the game and storylines! We normally release the newest adventures on Friday, but we frequently do mid-week releases too.</p>\n<p>Over 35 MILLION accounts created<br />\nNo Downloads!<br />\nNo Spyware!<br />\nNo Spam!<br />\nNo Programs to install!<br />\nNo Kidding!<br />\nNew MONSTERS, WEAPONS, QUESTS weekly!</p>\n<p>Safe and Easy to Play!<br />\nWith flash based fantasy adventure games you can play anywhere, anytime, all the time! All you need is your web browser and the flash plugin (which is standard on most browsers) to jump into the action.</p>\n<p>Real Time Combat &amp; Gameplay<br />\nCreated from the ground up by our creative team, AQWorlds lets you explore and battle in real time.</p>\n<p>Multiplayer cooperative battles AND player-vs-player<br />\nStorylines that actually change the game world<br />\nSuper friendly &amp; crazy fun team building the game under your feet while you play it.</p>\n<p>Chat, Guilds, Partys and PvP!<br />\nWith flash based fantasy adventure games you can play anywhere, anytime, all the time! All you need is your web browser and the flash plugin (which is standard on most browsers) to play.</p>\n<p>Team up to battle monsters<br />\nBattle other players in special dueling arenas<br />\nGet your own house and customize it!<br />\nJoin guilds</p>\n<p>Game Features<br />\nAdventureQuest was waaaaay ahead of it&#39;s time!</p>\n<p>TONS of playable Character Classes<br />\nMulti-Class (Start as one class, learn ALL OF THEM!)<br />\nGroup Loot (When an item drops... EVERYONE gets it!)<br />\nEnhancements (Make ANY weapon max level.)<br />\nUltimate Customization (Change anything about your character at any time.)<br />\nPlayer Recomendation Shop (Suggest items on our forums... and yours might be picked to be created!)</p>\n<p>Epic Storylines that change the world<br />\nThe main plot of AdventureQuest Worlds is currently &quot;Drakath and the 13 Lords of Chaos.&quot; Each week, we continue the story by adding new places to explore and quests to complete. Players shape the direction of their story based on their feedback with our game development team. Occasionally we do side stories, sagas, holiday events and other special events. Some of our releases and events only happen once. Most of them change our game world forever...</p>\n<p>Evolving Main Storyline &quot;The 13 Lords of Chaos&quot;<br />\nSide Stories &amp; Sagas<br />\nHoliday Events<br />\nSpecial Events with special guests!</p>\n<p>Free to Play thanks to Upgrading Players<br />\nAdventureQuest Worlds is free to play! The team agreed that the entire main storyline should be completely free for all players to complete as we build it. If you enjoy the game and want to help us create the weekly releases, you can support us by becoming a Legend. Your account upgrade unlocks a ton of bonus features and content.</p>\n<p>Free to Play thanks to Upgrading Players<br />\nCheck out Lorepedia and our Player Handbook for awesome tips and tricks to make your battle skills the best in AQWorlds! See you in game :-)</p>", "metacritic": null, "released": "2008-06-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ae/0ae48ab5b038a433c112dce9a007f9ac.jpg", "website": "https://www.aq.com/default.asp", "rating": 0.0, "rating_top": 4, "added_by_status": {"owned": 6, "beaten": 1, "toplay": 1, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 5, "platforms": ["Web"], "developers": ["Artix Entertainment"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Artix Entertainment"], "esrb_rating": null}