{"id": 274899, "slug": "indian-wedding-royal-salon", "name": "Indian Wedding Royal Salon", "name_original": "Indian Wedding Royal Salon", "description": "Namaste Friends! Heartily welcomes you in this Royal Indian Wedding Games with Girls Love and Arranged Marriage Rituals.<br/><br/>Now a days, Indian Wedding Love with Girl Arrange Marriage is common. And Agree for this type of Western Cultural Wedding and Supports their Princess and Prince to live their life together. Wedding views includes: Hair Design, Makeup, Waist belt/Kamarbandh Decoration, Hair Braid/Gajara Decoration, Bride &amp; Groom dressup, Photoshoot. <br/><br/>Here bridal boutique for bride and bridesmaids for wedding. Dress and prepare for Indian wedding day love marriage. The prom salon to make Indian girl look like a royal princess. Bride &amp; BFFs are going to find stylish gown to make special occasion even more special. Wedding makeover offer a relaxing bridal spa for country girl to look gorgeous. As a princess, she is always copying for fashion styles and became role model for other girls. Groom also be a top model for others inspiration with new look of beard in perfect beard salon and wearing sherwani and kurtas.<br/><br/>Enjoy most fashionable wedding of the year, starting from adorable hair treatment and spa. Prom girl is waiting for perfect hair dresser. Be the fashion guru in salon shop and provide best beauty service. This hairstyle salon girl game gives wedding hair makeup for bride. Play traditional game with wedding toast.<br/><br/>This royal Indian wedding game includes royal wedding love marriage features like ethnic fashion wear for traditional wedding events, dress collections to decorate prom-girl and become salon designer, wedding todos couple games for girls, luxury clothing and fashion for Luxurious looking Barbie girl in all rasam, apply complete beauty treatment in make up dress salon game, beauty princess look unique with wedding dresses and Make-up. <br/><br/>Latest designer choli suit, sarees, Lehengas, use facial to look married girls delightful in romantic honeymoon as well, magical hair salon lol doll games, Girl look more beautiful in pernikahan ritual, by bridal makeup makeover with picking right wedding day outfit, fun at bridal party in this Hindu wedding ritual marriage.<br/><br/>Give Royal Bride a stunning look with attractive ornaments kalire, kamarbandh and more bridal jewellery. Add charm to Indian bridal by hot lipstick, haldi for Hindu girls, bridal hairstyle for wedding vows. Indian girl wonderful Henna/Mehndi designs for marriage games.<br/><br/>Features:<br/>- Play role playing game for girls, offer beauty treatment in Indian girl makeup salon to become a personal stylist<br/>- Luxury fashion and designer salon offer you what your crazy Indian Princess needs. <br/>- Use makeup kit for luxury fashion &amp; wardrobe for designer luxury clothing &amp; wedding styles items<br/>- Choose gown for morning ritual, noon rituals and evening rituals for rock summer wedding party<br/>- Girl games with asian wedding directory &amp; stylish and beautiful look for hot Asian girl<br/>- Dress up your Rani like maharani Padmavati to be a stylish icon and Beautiful Queen in Indian continent<br/>- play to show your Indian wardrobe stylist arts skill to Indian celebrity deep-veer wedding couple <br/>- Indian wedding story which is result of long love affair of Indian girls<br/>- add pages in your wedding story book and show up to World that you have a perfect choice for preparing Indian wedding hairstyles<br/><br/>INCLUDES<br/>Hair salon for unique hairstyles<br/>Makeover for a glowing skin to make Indian Girl look gorgeous<br/>bride and groom wedding dressing stylist salon for wedding ceremony organize on bride and groom home<br/>Attractive ornaments and lehnaga choli add more charm to Indian beauty<br/>Take a Click and Be Photographers to take pictures of people, events, places romantic couple lovely poses, Wedding rituals<br/>Get ready for wedding ceremony of Indian Princess and prince marriage celebration<br/>Top Country Theme Wedding fashion style for Girl Love Crush<br/>Arrange Marriage with romantic moments<br/>ndian Wedding Makeup &amp; Dress up with Indian Bridal Fashion Girl new styles<br/><br/>Totally free games for girls and kids!", "metacritic": null, "released": "2018-12-14", "tba": false, "updated": "2019-10-22T14:06:45", "background_image": "https://media.rawg.io/media/screenshots/623/623d1c225741ea322af6ca4aaab194e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dhaval Akabari"], "genres": [], "publishers": ["Dhaval Akabari"], "esrb_rating": "Everyone 10+"}