{"id": 274821, "slug": "date-night-2", "name": "Date Night", "name_original": "Date Night", "description": "<strong>Incredibly story driven match 3 game with the happiest of all happy endings!</strong><br/>Date Night is the next step in the evolution of virtual dating and casual sexual encounters – presented in a form of a catchy match 3 game, being a perfect entertainment and a time killer. Tired of your day-to-day basis? Hop on your tablet and play this puzzle game to relax, meet a sexy girl and use your head – and maybe even both of them! Level up and start dating your partner to ultimately explore the wildest of your all erotic fantasies with our without the help of virtual reality devices. Puzzle games have never been any more enjoyable – and sexy!<br/> <br/><strong>Game features:</strong><br/><ul><li>Engaging mechanics of a match 3 game.</li></ul><ul><li>Works with or without a VR headset.</li></ul><ul><li>Starring some of the hottest female models from all over the world.</li></ul><ul><li>Addictive story that is just too good to be true.</li></ul> <br/><strong>PUZZLE GAME? NOT THAT BORING ANYMORE!</strong><br/>Playing a puzzle game might sound like a total boredom to you, but Date Night is simply different. Here, the match 3 mechanism is just a background for the engaging story, which will in no time drag you in so much, that you won’t be able to stop playing!<br/> <br/><strong>DO I NEED A VR HEADSET? </strong><br/>With or without a VR headset, you can jump straight to the action and keep having fun with the beautiful girls from the Date Night. But if you, by any chance, have some VR goggles within your reach, grab them as soon as possible to unleash the full potential of this immersive experience!<br/> <br/><strong>HOT, HOTTER, THE DATE NIGHT!</strong><br/>Producers of the game made sure to cooperate only with the hottest female actresses working in the adult industry, so regardless of your high demands, you should find something (or someone, actually) suitable for yourself on one of many game’s levels. Brunettes? Blondes? Redheads? Keep on playing to eventually meet the girl of your dreams!<br/><strong> <br/>SUCH THINGS JUST NEVER HAPPEN… DO THEY?</strong><br/>Perhaps in the real life, the scenario of the Date Night game would be too good to be true, but here, inside of the virtual environment, every single aspect of this sensual journey is within your reach. Dive in and keep on playing to experience the adventure of your life, and don’t worry – if you won’t tell about it to your girlfriend, we will not do that either!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:20", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b37d4889f8d1ab26031b8086bbab872.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iLewd"], "genres": ["Casual"], "publishers": ["iLewd"], "esrb_rating": null}