{"id": 274867, "slug": "espn-tournament-challenge", "name": "ESPN Tournament Challenge", "name_original": "ESPN Tournament Challenge", "description": "The #1 bracket app is back and better than ever for the 2019 NCAA Men's College Basketball Tournament! Compete against friends, ESPN personalities and celebrities to see who finishes with the best bracket and hoops-bragging glory.   Did we mention it's totally free and you have a chance to win prizes and a trip to Hawaii for the 2019 Maui Jim Maui Invitational basketball tournament?<br/><br/>* Create up to 25 brackets and enter each bracket in up to 10 different groups to play against friends, celebrities, ESPN personalities, and fans across the nation.  The more brackets you fill out, the greater your chances to win!<br/>* Fill out your bracket in seconds by auto-filling with top seeds, ESPN’s Basketball Power Index (BPI) formula, or random teams. Or import your bracket, change the champion, and submit another bracket! <br/>* Easily sort your brackets by score to keep tabs on your best.. And to push those busted ones out of view!<br/> * View details on each matchup to make informed picks, including season and historical performance information for each team and video previews for each game of the tournament.<br/>* Need an extra edge? Subscribe to ESPN+ and get access to Bracket Predictor, Bracket Analyzer, and expert analysis for game-by-game insights to help you win. Additionally, get access to thousands of live streaming events and ESPN originals on ESPN.com, ESPN App, and connected TV devices. Start a free trial inside the app to check it out.<br/>* Once the games start, follow the action live in Bracketcast, ESPN's one-of-a-kind live scoring experience for brackets to track upsets and underdogs and see how they impact your performance.<br/>* Access Women's Tournament Challenge, Tournament Challenge Second Chance, and the ESPN Fantasy App from the ‘More Games’ tab to play all tournament long.<br/> <br/>Download the ESPN Tournament Challenge app and start your quest for hoops glory!<br/><br/>ESPN+ Subscription Terms<br/>-Access ESPN+ for $4.99 monthly, or $49.99 annually. You will automatically be billed for the full amount of your subscription every 30 days if you purchase a monthly subscription, or every 365 days if you purchase an annual subscription.<br/>-Payment will be charged to your iTunes Account at confirmation of purchase, unless you are offered and are eligible for a free trial. If you receive a free trial, you will be charged when your free trial period ends. Your account will be automatically charged for renewal, at the above purchase price, within 24-hours prior to the end of the current period. If you cancel prior to such 24 hour period, you will not be charged for the following applicable subscription period.<br/>-Your subscription may be managed, and you can turn off auto-renewal, by going to your iTunes account settings after purchase.<br/>-No refunds for the current subscription period are granted.  Cancellations of the current subscription take effect at the conclusion of the current subscription period.<br/><br/>Terms of Use - https://disneytermsofuse.com/<br/>Privacy Policy - http://www.disneyprivacycenter.com<br/>ESPN+ Subscriber Agreement - https://es.pn/plus-terms<br/><br/>Before you download this app, please consider that it includes advertising, some of which may be targeted to your interests. You may choose to control targeted advertising within mobile applications by using your mobile device settings (for example, by re-setting your device's advertising identifier and/or opting out of interest based ads).<br/><br/>Please note: This app features Nielsen's proprietary measurement software which will allow you to contribute to market research, like Nielsen's TV Ratings. Please see www.nielsen.com/digitalprivacy for more information. You may also visit Settings in the app to opt out of Nielsen measurement.", "metacritic": null, "released": "2010-03-14", "tba": false, "updated": "2019-07-29T10:58:04", "background_image": "https://media.rawg.io/media/screenshots/581/5812259484bdc6a1ca2ab620dd03c749_5LFeJBo.jpg", "website": "http://www.espn.com/espn/apps/download?app=tc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ESPN"], "genres": ["Strategy", "Sports"], "publishers": ["ESPN"], "esrb_rating": "Everyone 10+"}