{"id": 274891, "slug": "christmas-santas-gift-delivery", "name": "Christmas Santas Gift Delivery", "name_original": "Christmas Santas Gift Delivery", "description": "Merry Christmas! It’s time to deliver gifts with Santa and team on this Christmas Day.<br/><br/>\"Merry Christmas to All\" , A day before Christmas Day is time to deliver some gifts is the duty of the Santa  and team i.e. Elf, Reindeer and sleigh. Christmas celebration on is starts from 25th Dec that is on the Christmas Day. Santa and team have to get ready before that. In this Christmas Games you have to help to Santa and Elf and Reindeer get ready for gift delivery. Enjoy it as a part in spreading the wondrous joys in Santa’s gift delivery on this Christmas event. Every body is waiting for Santa to come up with best Christmas gifts.<br/><br/>New Year celebrations coming very soon, Santa have to be amazing at sleigh driving for gift delivery job so kids love him more.<br/><br/>Here you have to find reindeer from snow forest and then taken care of it and give perfect touch to them for Christmas season. Also, have to help elf to get ready with funky makeover and stylist dress up. And help to Santa with dress-up and at last decorate sleigh for Christmas gift delivery. In last Have to deliver gift easily. And that’s the happy ending of this little adventure Christmas story. This is the best Santa gift delivery games. Spread the joy while on gift delivery.<br/><br/>Features:<br/>- Santa’s rescue for reindeer<br/>- Enjoy amazing Christmas snow environment<br/>- Exciting gift delivery mission around world<br/>- Enjoy winter holidays with chill<br/>- perfect christmas game for holidays<br/>- Enjoy real time experience in gift delivery<br/>- Best Xmas Winter games with Xmas story<br/>- Best fun and aims to spread happiness in world with santa<br/><br/>Get ready for best xmas games in this christmas santa gift delivery game. Santa is coming for deliver gifts to humming in this Christmas holidays. Everyone is excited for Santa call for gift because image of Santa Claus is a loving person and always deliver free gifts on Christmas.<br/><br/>Hope you enjoyed playing our Christmas Delivery Games Adventure and if you want more features for this game please leave a comment.", "metacritic": null, "released": "2018-12-07", "tba": false, "updated": "2019-10-22T14:06:44", "background_image": "https://media.rawg.io/media/screenshots/947/9477faed7b231b35f7db16cfffe43624_aD2119u.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dhaval Akabari"], "genres": ["Adventure"], "publishers": ["Dhaval Akabari"], "esrb_rating": "Everyone 10+"}