{"id": 274869, "slug": "nfl-fantasy-football", "name": "NFL Fantasy Football", "name_original": "NFL Fantasy Football", "description": "This season, there's a new NFL team competing for a chance in the Super Bowl — yours! With NFL Fantasy, the official fantasy football game of the NFL, you're in control of your very own NFL team. Are you ready to build the next football dynasty?<br/><br/>Start your season by drafting a roster of real NFL players to join your team. Then, prepare for a new head-to-head matchup every week by setting your lineup and tuning in to NFL games to watch your player's action on the field turn into fantasy points for your team.<br/><br/>In a work league with a real hot shot? NFL Fantasy comes equipped with the tools you need to make it to the top, including NFL Fantasy-exclusive features like Next Gen Stats and all-new player comparison tools.<br/><br/>Looking to be the next Commissioner? Start your very own league and customize the rules however you want. Invite friends and family to compete with you and start your own football tradition.<br/><br/>NFL Fantasy is the home for fantasy football, from the football experts.<br/><br/>New for 2019<br/><br/>Introducing the future of fantasy football: the all-new, totally redesigned NFL Fantasy app, built from the ground up for 2019. Get closer to the game than ever before with the official fantasy football game of the NFL. Always 100% free.<br/><br/>- Best in class Player Profiles include all of the data and expert analysis fans need to make informed roster decisions, including NFL Fantasy-exclusive features like Next Gen Stats and game video recaps.<br/><br/>- Catch up with your league's activity or get a discussion going in the new Feed section.<br/><br/>- The completely redesigned Team section makes it easier than ever to build a winning roster, and improved player comparison tools help you handle critical game day decisions with ease.<br/><br/>- Enhanced features and performance in every corner of the app.<br/><br/>- The same great features and design on your iPhone and your iPad.<br/><br/>Plus, all of the fantasy football features you expect from the NFL:<br/><br/>- Create a league in minutes to start your own fantasy football tradition, or compete against other NFL fans in a public league.<br/>- Draft players live in-app.<br/>- The NFL Fantasy-exclusive Optimize Lineup feature makes fantasy football approachable for players of all skill levels.<br/>- Catch up with official stats, news, and injury updates direct from NFL experts.<br/>- Perfect your draft strategy by participating in a Mock Draft.<br/><br/>…and more!<br/><br/>This app features Nielsen’s proprietary measurement software which contributes to market research, like Nielsen’s TV Ratings. Please see http://priv-policy.imrworldwide.com/priv/mobile/us/en/optout.html for more information.", "metacritic": null, "released": "2014-05-16", "tba": false, "updated": "2019-07-29T10:57:53", "background_image": "https://media.rawg.io/media/screenshots/687/6876a74cb22735216f03e7b99453b8cd_5iOCtmD.jpg", "website": "http://fantasy.nfl.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["NFL Enterprises"], "genres": ["Strategy", "Sports"], "publishers": ["NFL Enterprises"], "esrb_rating": null}