{"id": 274830, "slug": "a-dream-of-burning-sand", "name": "A Dream of Burning Sand", "name_original": "A Dream of Burning Sand", "description": "Today we passed the point of no return.  We no longer have enough water to<br/>back out of the desert.  The only way open to us is forward: through the<br/>desert, to the Burning King.  To victory, or to death.<br/><br/>The strain of this journey is taking its toll on Nina.  No wonder — this is<br/>her first desert crossing.  I was born in the desert, but Nina was born in a<br/>city, in some land unimaginably far away.  She never held a sword before I<br/>summoned her to this world.  She never rode a horse.  She never slept under<br/>the open sky.  The latter, she still doesn't do.  Every evening, she vanishes<br/>before my eyes, and every morning she reappears, guided by the ancient magic<br/>that I have released.  And every night I spend in fear, alone, worried that<br/>she won't come back.<br/><br/>Because I can't do this alone.  I know how to use a sword, but I am no<br/>warrior.  No hero.  Not like Nina.  I have seen Nina fight, and I know that I<br/>cannot match her, despite my greater experience.  She has the instincts of an<br/>adventurer.  Where I like to retreat into by books, she goes out to face the<br/>world.  When I look at her, I see the face of the hero destined to defeat the<br/>Burning King.<br/><br/>The heat is not just draining our bodies, but our spirits.  I feel hot and<br/>tired and irritable.  I can only imagine how much worse this is for Nina, who<br/>is not used to the desert.  I can only imagine, because we rarely talk anymore.<br/>The heat makes speaking painful.  I wish I could tell Nina how much she means<br/>to me, how much I appreciate her taking this journey with me, but nothing comes<br/>out when I open my mouth.<br/><br/>Soon we will reach the great oasis of Daklath.  There we will replenish our<br/>waterskins, and hopefully our spirits.  The way through the desert is long,<br/>but we have already made it this far.  We will just have to keep going.  To<br/>victory, or to death.<br/><br/>Platforming action and adventure game puzzles.  Seven chapters.  Lots of sidequests.  More secrets than you will ever find.", "metacritic": null, "released": "2019-02-04", "tba": false, "updated": "2020-03-12T13:12:55", "background_image": "https://media.rawg.io/media/screenshots/d82/d826ea70ec6189210a62fd37f63dad1c.jpg", "website": "https://eldwood.com/a-dream-of-burning-sand", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Eldwood"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Eldwood"], "esrb_rating": null}