{"id": 274910, "slug": "valentine-dating-love-story", "name": "Valentine Dating Love Story", "name_original": "Valentine Dating Love Story", "description": "Do you like Romantic Love Stories? Then, This Love Game is for you.<br/>Welcome to our new love story with attractive characters and interactive story.<br/>Enjoy this beautiful story of love and friendship with dramatic, but never boring things. Are you ready to fall in love and start your romantic journey with your soul met! this virtual love story game lets you experience that from an entirely different point of view!<br/><br/>Valentines Day is coming! Do you have any plans? How to propose your dream soul-met? It would be an awesome date with your partner? Or a chat with your crush? Dress up your own avatar with different outfits and items, and while enjoying thrilling romance. Complete Challenges of Love! In sake of love, and unlock sweet scenarios with beautiful illustrations! And await for Happy Endings.<br/><br/>SHORT STORY:<br/><br/>The boy is first time in love and romance, but he have cold feet about his good friend, suddenly he were miss her and going to meet his crush. At that time her father is at home and she dose not come outside with guy. But she wanna meet him, for that she hang down a rope like thing from her house balcony. And boy can meet her by home climbing. In between he have to taken care of her father, they may take surprise checking in between.<br/><br/>After that they are doing chatting on mobile phone, than boy convince a girl for treat at restaurant.<br/><br/>Girl is also have a crush to that guy, so she get perfectly ready for a perfect date with her love. For that she van a spa treatment for her glory face, the n have a best makeover for gorgeous look, And in last she got perfect dress up.<br/><br/>At other side boy wanna impress her, so he designs a perfect valentine’s card for her.<br/><br/>And then tier both are meet at restaurant, and fall in love. In this story you can find beyond imagination excitement that never ends. Enjoy a romance! A romantic life biggest period arrives! As Love Aside, There Are Lots of Others Things to Enjoy.<br/><br/>Story Theme Includes:<br/>- Romantic Love Story<br/>- Valentine’s Day Celebration<br/>- Valentine’s Day Dating Story<br/>- Love the romance fictions, movies, dramas<br/>- Want to fall in love with a guy you like<br/>- Enjoy a dramatic romance in APP<br/>- Words which make your heart beating fast<br/><br/>Features :<br/>- Interact with your crush<br/>- Flirt and Find romantic moments<br/>- Decide the place to propose<br/>- Enjoy love adventure with your soul met<br/>- Experience pleasing music and sounds<br/><br/>NOTE :<br/>- In this game, do not need to register in any order<br/>- It is totally free game<br/><br/>Hope you enjoyed playing our Love Story Game and if you want more features for this game please leave a comment.", "metacritic": null, "released": "2018-10-12", "tba": false, "updated": "2019-10-22T14:06:46", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0a795bfda3f5e6d30ea9d7722feb7b2_NqoNZB9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dhaval Akabari"], "genres": [], "publishers": ["Dhaval Akabari"], "esrb_rating": "Everyone 10+"}