{"id": 274921, "slug": "valentines-week-celebration", "name": "Valentine's Week Celebration", "name_original": "Valentine's Week Celebration", "description": "Valentine Game : Valentine Week Celebration<br/><br/>Hey Guys, Are You Ready To Celebrate Valentine’s Week with Friends, Family and Your Soul-met.  <br/><br/>February is a Month of Love And Romance with cool windy winter environment. Every Lovers are waiting for this romantic time, to reveal their love and expand it. For that every body have their own valentines day gift ideas and food ideas. This is a game about the preparation of the Valentine party. Valentine's Days are celebrated at beautiful tropical beach, great night club, love is in the air.<br/><br/>Happy Valentines Day!!! Here, you can do different dressing fashion styles for couple. Every couples wants that valentine party more exciting. And they gets an idea to celebrate upcoming Valentine’s Day with lots of fun. On valentine’s day pink girls and sweet boys are more excites to propose they buddy with Unique styles. This Special Day is also celebrated as a St Valentine's Day! Sweet Pink Valentine is Moreover for Romantic Peoples who have “True Love” in there life.<br/><br/><br/><br/>Valentines Dating is more common now a days. Your love come true in this day. Valentine's Day Party is full of romance for your valentine with various formulas to impress your Valentine and express your love. Valentine’s corners are getting ready with their profession with valentine beauty salon for couples. This is a sweet holiday for everyone i.e. young, old people, kids. Moreover young girls and boys, will celebrate it in different way by flowers or gifts to their lover or exchange gifts. Couples refreshes their love with each other stronger, and lots of romantic things happen in a single day. Feb 14, is the valentines day. The day in which millions of people express their feelings to their crush. This full week is celebrated as a symbol of love. Youngsters planned to express their love feel to his/her in the way of Romantic Ring. <br/><br/>Features:<br/>- 7th, Feb - Happy Rose Day : <br/>\tFirst Day Of Valentine’s Week is celebrated as a Rose Day, Here in this game, you can enjoy, Introduction of different colors of roses and the meaning for that particular color and Enjoy mini game Jigsaw Puzzle with Rose Patels.<br/>- 8th, Feb - Happy Propose Day : <br/>\tSecond day is celebrated as a Propose Day, Here, you can enjoy mini game for various Gift Ideas, and propose your valentine.<br/>- 9th, Feb - Happy Chocolate Day : <br/>\tThird day is celebrated as a Chocolate Day, Here, you can enjoy a game for collecting chocolates as your Valentine like and gift her and express you likeness.<br/>- 10th, Feb - Happy Teddy Day : <br/>\tFourth day is celebrated as a Teddy Day, Here, you can enjoy a game for decoration of your favourite Teddy to impress your Valentine.<br/>- 11th, Feb - Happy Promise Day : <br/>\tFifth day is celebrated as a Promise Day, On this day couples are promised each other for their endless love.<br/>- 12th, Feb - Happy Kiss Day : <br/>\tSixth day is celebrated as a Kiss Day, On this day couples are kisses each other to reveal there love.<br/>- 13th, Feb - Happy Hug Day : <br/>\tSeventh day is celebrated as a Hug Day, Here the peoples are hugs each other very tightly to fill there love and responsibly towards three love.<br/>- 14th, Feb - Happy Valentine’s Day : <br/>\tThis is a day of romance celebrated as a Valentine’s Day, Here the peoples are express by asking a questions such as “Will you be my valentine?”, “Sweet Princess be my valentine?”, and by positive answering for their love to each other and enjoy it at different places they likes.<br/>- Select a perfect dress for princess be my Valentine<br/>- Very Attractive Romantic Sounds and graphic<br/>- Play and enjoy this Valentine game and share with your friends<br/>- Variety of Dresses for the best day<br/><br/>This game is filled with a lot of interactive activities that you will enjoy throughout game play.", "metacritic": null, "released": "2018-11-07", "tba": false, "updated": "2019-10-22T14:06:47", "background_image": "https://media.rawg.io/media/screenshots/fb3/fb37f0ad0e034e3d262eab6a176f4e0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dhaval Akabari"], "genres": [], "publishers": ["Dhaval Akabari"], "esrb_rating": "Everyone 10+"}