{"id": 274958, "slug": "out-of-the-box-mobile-edition", "name": "Out of The Box: Mobile Edition", "name_original": "Out of The Box: Mobile Edition", "description": "Survive in a wild adventure comedy of gangster and criminals as a club bouncer! Out of The Box is a captivating thriller where you decide the fate of the peculiar customers of a luxurious nightclub in a never-ending race against the clock!<br/><br/>EXPERIENCE A THRILLING GANGSTER PLOT…<br/><br/>In this time-management adventure you are Warren Baker, the new bouncer of the prestigious club The Box. After spending three years in jail, you just want to live an honest life and recover your daughter. However, the quirky clients of The Box will drive you closer to your turbulent past, involving you in a gangster scheme that threatens to destroy everything that you love.<br/><br/>…WHILE DEALING WITH THE CRAZY CUSTOMERS OF A NIGHTCLUB!<br/><br/>Every night, among the club’s visitors, you’ll find undercover cops, annoying celebrities, runaway criminals or ghosts from your past. As the new gatekeeper of The Box, you decide who enters and who doesn’t... by any means necessary. Be careful though, because each choice you make can influence the fate of the club and its clients. You’ll also need to keep your salary to avoid being evicted, to see your daughter again, and most importantly, to regain control of your life.<br/><br/>CHANGE THEIR FATES WITH YOUR CHOICES<br/><br/>Comedy and thriller blend together in this original premise where you control the head of security of The Box, experiencing both hilarious situations and epic moments during the busy nights of the club. Will you let teenagers into the club in exchange for money? Will you allow drunk VIPs to get away with their awful behavior? Or will you work with the police to bring down the most powerful gangster in town?<br/><br/>Only you can choose how their stories end.<br/><br/>FEATURES<br/><br/>-\t+300 unique characters to interact with, including celebrity cameos!<br/>-\tCritical decision-making with surprising (and hilarious) consequences!<br/>-\tYour own storyline inspired by classic gangster films<br/>-\tSpecial events and funny side stories to experience<br/>-\tPunch-to-face action… Only when necessary!<br/><br/>Out of The Box is a quirky, adventure bouncer simulator, a fun game for adults invested in gangster thrillers, time-management games and point and click adventures. Experience this adventure comedy on your tablet and mobile devices now!<br/><br/>Out of The Box features real-life influencers Mangel, Alexby and Azerrz as guest characters. Don’t miss the opportunity to interact with them while attending the crowded queue of The Box!<br/><br/>(L) Write a review to support us! (L)<br/><br/>Game available in English, French, German and Spanish.<br/><br/>Need help? Write us at support@raisergames.com<br/><br/>Discover our games on our website!<br/><br/>https://www.raisergames.com/<br/><br/>…And follow us on social media!<br/><br/>https://twitter.com/raisergames<br/><br/>https://www.instagram.com/raisergames/<br/><br/>https://www.facebook.com/RaiserGamesPublisher<br/><br/>https://www.linkedin.com/company/raisergames<br/><br/>https://www.youtube.com/channel/UCDV5fJwQk-YsljQnOdfCGlA", "metacritic": null, "released": "2018-12-05", "tba": false, "updated": "2022-09-05T11:09:15", "background_image": "https://media.rawg.io/media/screenshots/e77/e77ada07e46eac1988dd394dab37ece8_i3g2bIy.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Raiser Games"], "genres": ["Adventure", "Simulation"], "publishers": ["Raiser Games"], "esrb_rating": null}