{"id": 275027, "slug": "vibrometer", "name": "Vibrometer", "name_original": "Vibrometer", "description": "Vibrometer is a game that measures the vibrations of the human body.<br/>With Vibrometer you can challenge your friends and win if your body is more motionless than the bodies of the other players.<br/>Stretch the arms forward, keeping the device in one hand and press the button “START\" ... keep the device as motionless as possible (from START until TIMEOUT).<br/>Who consumes less energy wins the challenge.<br/>Vibrometer can also be used as a tool for measuring vibration by activating the \"recording\"... the tool will automatically calculate the minimum and maximum vibration along the axes x,y,z, the energy consumed and record the instantaneous values of the accelerations. These data will be saved for later use. Acceleration data recorded can also be displayed graphically.<br/><br/>For professional use (seismograph), it is recommended to use the \"myVibrometer\" app.<br/><br/>Features:<br/>- Measuring vibration in real time<br/>- Counter for consumed energy<br/>- Vibrations recording function<br/>- Calculation of minimum and maximum vibration along the axes x, y, z<br/>- Multiplayer game (wins the challenge the player who makes the device vibrate less)<br/>- Chart of accelerations recorded along the axes x,y,z<br/>- Zoom for accelerations diagram<br/>- Ability to save the diagrams of accelerations in the \"Photo Album\" of the device<br/>- Diagrams of accelerations can be sent by email", "metacritic": null, "released": "2010-02-09", "tba": false, "updated": "2019-10-22T14:06:55", "background_image": "https://media.rawg.io/media/screenshots/d1b/d1b53fad4036c52cbe1c51774b5e2693.jpg", "website": "http://www.ngcybit.it", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gianluca Natalini"], "genres": ["Action", "Family"], "publishers": ["Gianluca Natalini"], "esrb_rating": "Everyone 10+"}