{"id": 275091, "slug": "uphill-rush-usa-racing", "name": "Uphill Rush USA Racing", "name_original": "Uphill Rush USA Racing", "description": "Try today the newest addition to the most addictive, visually stunning and critically- acclaimed racing games series - Uphill Rush. <br/>Prepare yourself for the unforgettable ride and a real racing madness. It’s not yet another time killer that is easy to play and difficult to master. It’s the true unicorn among stunt, racing and sliding games; The ultimate bike blast, hovercraft sliding, car crashing and skateboard flipping experience that will kill time like no other game.<br/><br/>Are you a fan of extreme competition? If so, a Multiplayer mode will allow you to battle and blitz your opponents in the most vivid and exciting racing game. How quick can you conquer the leaderboard? Try the PvP mode and find out today.<br/><br/>Do you want to work on your skills and test your reflex? Then our new single player mode is the choice for you. Pick your challenge and progress as you master the game. This game will never get boring! Crash obstacles, flip as you perform your stunts, catch bonuses as you fly. Discover new adventures and become a legend of Uphill Rush Racing.<br/><br/>Explore completely new tracks taking you to the most exciting USA areas - Santa Monica Bay an NY City. Immerse yourself in this beautiful surroundings and enjoy the state of art graphic - a true rollercoaster for your senses. Mini racing, simple game, that will impress you with its beautiful 3D style.<br/><br/>Pimp your car, bike, skateboard, tank, unicorn and so much more. Become a legend of Uphill Rush leaderboard.<br/>Upgrade both the style and abilities of your bike, hovercraft, motorbike and whatever you always dreamed to compete as… Superhero, unicorn? Name it, we have it!<br/><br/>Features:<br/>- Discover two brand new beautiful worlds - New York city and Santa Monica Bay<br/>- Battle , blitz and bash your opponents in the PvP (multiplayer) mode. <br/>- Ghost racing enabled.<br/>- Challenge yourself in the Single Player Mode. Test your reflex, agility and speed in this addictive mini racing game.<br/>- Upgrade your bike, motorbike, FR, jet, car, skateboard, tanks, hovercraft and more.<br/>- Strategize by optimizing your vehicle. Choose between speed strength and acceleration and begin the racing madness.<br/>- Customise your look and show off your style. <br/>- Master  crazy stunts and unlock new bonuses<br/><br/>Don’t wait!  Discover today  brand new mini racing game from the creators of the legendary Uphill Rush Water Park Racing and Thrill Rush roller coaster racing.<br/>Uphill Rush USA Racing is the combination of everything you love in racing games. Whether it’s  FR, bike, skateboard or jet car stunts. Racing madness will never end in this most versatile and exciting mini racing game.<br/><br/>PRIVACY POLICY<br/>http://www.spilgames.com/mobile-apps-privacy-policy/<br/><br/>TERMS OF USE<br/>http://www.spilgames.com/terms-of-use/", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-07-29T17:09:34", "background_image": "https://media.rawg.io/media/screenshots/c00/c006ee648d5827adaa9b0ad129a9adab.jpg", "website": "http://www.spilgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SPIL GAMES"], "genres": ["Action", "Racing"], "publishers": ["SPIL Games"], "esrb_rating": "Everyone 10+"}