{"id": 275179, "slug": "crazy-cross-the-road-pro", "name": "Crazy Cross The Road Pro", "name_original": "Crazy Cross The Road Pro", "description": "Some stickman always take the road as their stage to show themselves. <br/>On the surface stickmans are ordinary, <br/>but when they stimulate their potential, <br/>stickman may Be the superheroes around you. <br/>In this game, you are God, control various game stickmans cross the dangerous road with all the way. They look seem to ordinary, but all with exciting spirit. <br/>This is a simulated action game. It can test your control and judgment. <br/>Not only game stickman is knocked down by vehicles in the game. <br/>Stickman has a range of image. You can choose what you like. All of them have different strengths. <br/>Weather and time will affect your grade. <br/>In the game you can make stickman to a superhero and let him cause a variety of car accidents. <br/>Don’t stand in the two trucks. <br/>haste, less speed.<br/><br/>What's new:<br/>Add new character:<br/>Jack: a butterball, he walks slowly, but he will let you earn the biggest prizes.<br/>Linda: a beauty, she is dexterous, and she will let you earn the medium prizes.<br/>Add equipment system:<br/>As pass the required stage, the relevant equipment will be unlocked. Need to buy in the shop. After the purchase, the character will come on the stage with the equipment. Different equipment will produce different results.<br/>Hairstyle: increase bonus<br/>Satchel: increase more bonus<br/>Roller-skates: increase movement speed<br/>Shield: stop the car<br/>Police-hat: let all the vehicles deceleration<br/>Add the stage clear’s way:<br/>Without limiting the character, one passes then stage clear.<br/>Add endless stage:<br/>Without limiting the character, one fails then stage over. The prizes will increase with the number of the successful character. More pass, more prizes.<br/>Add touch to the operating mode (Default mode):<br/>Touch the screen, the character will move to the point.<br/>Remove the mode of gravity sensor:<br/>This mode is not convenient to play in bed.", "metacritic": null, "released": "2014-05-04", "tba": false, "updated": "2019-10-22T14:07:08", "background_image": "https://media.rawg.io/media/screenshots/dac/dac914bbdf6f7d322972273bab1b028e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MSY Mobile"], "genres": ["Simulation"], "publishers": ["Suzhou Qisimiaoxiang Information Technology CO"], "esrb_rating": "Teen"}