{"id": 275258, "slug": "jumpy-fox", "name": "Jumpy Fox", "name_original": "Jumpy Fox", "description": "<p>This project was a lesson in the application of the 4-step process as applied to level design. The 4 steps to the process are introduction, development, twist, and conclusion. The mechanic that I have chosen to apply to this process is jumping.</p>\n<p>The first part of this level is made up of simple jumps that give you a safety area to learn the parameters of jumping in the game. There are some varying lengths of jumps. The jumps to take the player mostly horizontally, but there are also some platforms a little higher or lower to add variation vertically.   </p>\n<p>In part two the jumping mechanic is developed by having the player move vertically. Platforms force the player to ascend and descend. In this section, the player must also show more control to avoid spikes as well as to land on smaller spaces over greater distances.   </p>\n<p>Part three introduces the twist of controlled falling. The player must descend, but with the tight space the player is in and the spikes the player needs to control their descent through falling rather than jumping.\r\n  </p>\n<p>Finally, the player is challenged by having to use all the skills developed throughout the level. The player must pass horizontal jumps, vertical jumps, long jumps, control for small platforms and to avoid spikes, as well as controlled falling in the final section to show mastery.\r\n  </p>\n<p>This project would not have been possible without the help from Brackeys’ Unity 2D tutorials and all of the Sunny Land assets made by Ansimuz.\r\n</p>", "metacritic": null, "released": "2018-12-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/156/1560674d2a85996af703b76a0dba414b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Blake"], "genres": [], "publishers": [], "esrb_rating": null}