{"id": 275375, "slug": "fuball-2", "name": "FU!ball", "name_original": "FU!ball", "description": "<p>Watch as the footballers randomly running around or lying on the field and holding on to the sick knee is not interesting. Much more interesting when players jump, lose their limbs and everything explodes.</p>\n<p>A game with a simple and exciting gameplay. A game with a simple and exciting gameplay. One click will force players to beat, jump and tumble the field. During the match will appear bonuses that even more add fun to the gameplay of the game. One exact kick on the ball, and a ball in the goal.</p>\n<p>You can play with both AI and friends on the same device. In management you can choose to manage your players together or individually. There are also 2 modes: Play up to the first 5 goals and infinite mode.</p>\n<p>Many of the characters known to you heroes. Get free gifts and win your favorite hero. Gather your dream team and start an unforgettable match.<br/>Playing, you will get achievements. Some are easy to get, and others should work hard. You will also be able to compare your game results with other players.</p>\n<p>So, if you are at least interested in the game, you should try to play it. I am sure that you will only have positive emotions, because this is fun football.</p>\n<p>Features:<br/>- many different characters;<br/>- ability to share an open hero with a friend;<br/>- cheerful physics of players;<br/>- play with AI/friends;<br/>- free gifts;<br/>- 25 achievements;</p>", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/216/216f3a26db3742fe36cff62506c7718d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DITWOG"], "genres": ["Action", "Sports"], "publishers": [], "esrb_rating": null}