{"id": 275431, "slug": "mouswurk", "name": "MousWurk", "name_original": "MousWurk", "description": "<p><strong>Controls\r\n</strong></p>\n<p><strong>A/D - </strong>Move left or right</p>\n<p><strong>Q -</strong> Interact</p>\n<p><strong>Introduction</strong></p>\n<p>In this game, you are a clockwork rat and your entire life's purpose is to keep your world running. To do this, you must ensure that the main gearbox always has sufficient energy. As with all things, this gearbox will decay, but you alone have the resources to stop it. There is a bar at the bottom right corner showing you its current amount of energy, and the bar turns red when it breaks down. When this happens, the rate of decay will increase and you must fix it before you can wind it.<br/>If the bar hits 0, your world will end.</p>\n<p>When a building breaks down, what resources it requires will be shown above it. To fix the building, you must pick up the corresponding resources from the factories that produce them.</p>\n\n<p>Other buildings may also break. For example, when the music box stops, the music stops. When the dynamo stops, the lights go out.<br/>Furthermore, all broken buildings speed up the decay of the energy in the main gearbox.<br/>Worry not, if you have too much weight on your shoulders. You can dump all your items at the recycle bin if you no longer require them. You can also get a short speed boost by picking up a can of oil.</p><p><strong>Developed by:<br/></strong></p><p><strong>Team SanBaiKuai<br/></strong></p><p>Victoria Lim</p><p>Khoo Wei Ping</p><p>Kyle Chu<br/></p>", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/537/53727c698afd2b9d7b093ce31db48bba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kowalski985"], "genres": [], "publishers": [], "esrb_rating": null}