{"id": 275403, "slug": "zack-y-itch", "name": "Zack Y (itch)", "name_original": "Zack Y (itch)", "description": "<p>Zack Y is a 2D Old School Scifi themed platform action game based on the story of the Alien called Zack Y whose mission is to rule over the Earth. You play as the bad guy called Zack Y, whose mission is to eliminate the human armed forces within a given short time. <br/>Zack Y, The General of Alien Armed Forces, vowed to curb military power of all the countries on The Earth and to create a new world with aliens and also by taking human beings as their slaves. The famous human scientists and robotics experts of Tethis Robot Manufacturing Plant managed to create some powerful bots and missiles to stop the aliens from invading the Earth. But it soon turned out to be futile. The war finally broke out which resulted in bloodshed and the struggle for existence of human beings on the Earth. Who will win in the end<strong>?<br/></strong></p>\n<strong>Key Features:</strong>\n<ul><li>12 Levels to Play!</li></ul>\n<ul><li>Lots of enemies, and deadly traps.</li></ul>\n<ul><li>Collect items including health box, ammo and more.</li></ul>\n<ul><li>Collect Blue and Yellow orbs to get to the UFO.</li></ul>\n<ul><li>Challenging Situations and hard to master!</li></ul>\n<ul><li>3 Boss Battles!</li></ul>\n<p><strong>Note: I am a solo developer and I have done all of the graphics, character design, animations, level design, programming except for the music. I hope you will enjoy this little title.</strong></p>", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-08-28T23:19:01", "background_image": "https://media.rawg.io/media/screenshots/f1a/f1a987d574beed1220bac50b5fdd8e2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["AMAXANG GAMES"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}