{"id": 275646, "slug": "tempest-of-the-heavens-and-earth", "name": "Tempest of the Heavens and Earth", "name_original": "Tempest of the Heavens and Earth", "description": "A derivative game inspired by the Touhou Project universe.<br/>\n<br/>\r\n\"Rogue Celestial, seek out your own path to the heavens.\"<br/>\n<br/>\r\nControlling the ecstatic Celestial Tenshi Hinanawi, run all around the realms of Gensokyo to investigate the cause of suspicious earthquakes, the circumstances surrounding Iku Nagae's disappearance and to bring to light a grand conspiracy looming in the darkness.<br/>\n<br/>\r\nJust what is happening above ground? Who is the true mastermind...?<br/>\r\nUsing your inherent POWER and EGOISM, plunge forth and carve your way through the swirling in the eddies of conspiracy that engulfs Gensokyo! You are the path of righteousness itself!<br/>\n<br/>\r\n\"Ecstatic-class Stylish Action!\"<br/>\r\nThis 2D Action Game was created with the motto; \"Dodge like a butterfly, sting like a bee!\"<br/>\r\nEnjoy super gorgeous graphical effects and the ever so finely illustrated pixel art character animations.<br/>\n<br/>\r\nAs Tenshi is a high-spec girl, she can perform high-maneuver actions and super powerful attacks while maintaining her stylish composure.<br/>\r\n- \"Shoot\", \"Strike\" and \"Slash\" your way through a variety of enemies!<br/>\r\n- \"Dodge\" successfully to invoke \"Spirit Grasping\". Then counterattack!<br/>\r\n- During Spirit Grasping you can control the \"Weather\" in your favor!<br/>\r\n- Even if you take damage, no worries... Tenshi can \"Auto Heal\"!<br/>\r\n- Destroy a Boss' \"Amulet\" to render them defenseless and release a hellish flurry of attacks!<br/>\r\n- Use powerful table-turning \"Spell Cards\" to get out of prickly situations!<br/>\n<br/>\r\nUnlock skills, increase the number of moves you can use and customize your shots and spell cards to your liking.<br/>\r\nAfter clearing the main scenario, boss-attack, etc. challenge modes will be unlocked. Plenty of extra content for completionists!<br/>\r\nUsing the supreme mobility of a Celestial to elegantly dispose of assailants and deal them a virtuous blow of nobility!", "metacritic": null, "released": "2018-12-25", "tba": false, "updated": "2019-08-28T21:50:16", "background_image": "https://media.rawg.io/media/screenshots/3e8/3e842159e292d82bf993416edf8f8d0b.jpg", "website": "http://shakna.jp/Tempest/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LION HEART"], "genres": ["Action", "Indie"], "publishers": ["DLsite"], "esrb_rating": null}