{"id": 275670, "slug": "heretic-operative", "name": "Heretic Operative", "name_original": "Heretic Operative", "description": "Magic is a sin.  It corrupts everything it touches.<br/><br/>Those who use magic are branded as “Heretics” by the church, and heresy is punishable by death.<br/><br/>At the fringes of civilization, the mages of the Cultus Arcanum give themselves freely over to the Corruption – performing dark rituals to let loose untold nightmares upon the world.<br/><br/>It will take a powerful heretic to preserve the spark of magic against both the Church and the Cult.  <br/><br/>You are that Heretic Operative.<br/><br/><ul><li>Control a secret society dedicated to using magic for the benefit of the world, at a time when all mages are considered “heretics” to be hunted by the Templars.  <br/><br/></li><li>Master over 50 different spells to overcome challenges in and out of combat.  But be wary of the Corruption that accompanies magic.  The more powerful you become, the greater the risk of losing control.  <br/><br/></li><li>Fight enemy cultists, zealous templars, and ravenous monsters through a unique dice-based combat system.  Employ mercenaries, devastating spells, and powerful artifacts to prevail. <br/><br/></li><li>Explore the Northern Reach, where the frayed edges of the Empire are under constant threat.  From vast museums in the city of Ione, to the farms in the countryside, to ruined temples of ancient gods, to camps of raiding Orcs, every location offers unique challenges. <br/><br/></li><li>Make contact with other Heretic Operatives and recruit townsfolk to spread your Heretical influence and stop the diabolical Cultus Arcanum.  <br/><br/></li><li>Encounter more than 270 different adventure cards, full of challenging decisions that change the way your story unfolds.  Will you risk your life and mission to save innocents from a burning building or live with the stain on your soul from abandoning them?  Will you stand your ground against the Orcs for honor’s sake or be more prudent and flee?  Do you bother to learn all of the verses in the Elven Song of Greeting or is now the time to take a stand against ridiculous Elven ceremony?<br/><br/></li><li>More than 7 playable Operatives (and counting), 6 different story decks, and 4 enemy cults, means your story plays out differently each time.  Use different strategies and wisely deploy your resources to defeat the most challenging combinations.</li></ul><br/>Heretic Operative intertwines deep gameplay with a dynamic story to create an innovative and original experience: a unique fusion of strategy, RPG, and board game mechanics.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:14", "background_image": "https://media.rawg.io/media/screenshots/24c/24c9614b662cff5258e0f128117e26d1.jpg", "website": "https://www.cpromptgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1, "dropped": 1}, "playtime": 8, "achievements_count": 38, "ratings_count": 1, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["C Prompt Games"], "genres": ["RPG", "Strategy"], "publishers": ["C Prompt Games"], "esrb_rating": null}