{"id": 275657, "slug": "northern-tales", "name": "Northern Tales", "name_original": "Northern Tales", "description": "In a time when Earth is threatened by a mysterious army, the world is in desperate need of a hero.  <br/>\n<br/>\r\nRise up to the challenge, venture the ice plains, brave the storm, survive the piercing cold and defeat the hordes of frigid beasts that plan to take over the Earth.<br/>\n<br/>\r\nMake your way to the northernmost spot on the globe, in a ultimate attempt to stop the leader of this invasion force and save the planet from impending doom!<br/>\n<br/>\r\nIn Northern Tales, the player is given a simple, yet perilous, task: That of defeating invaders and restoring peace to the world.  To complete this task, you're granted hand weapons, a futuristic GPS/tracking system and an all terrain vehicle.<br/>\n<br/>\r\nThe vehicle is a fast moving target (harder to hit while moving) equipped with a slow but powerful weapon.<br/>\n<br/>\r\nHand weapons deal less damage, and you're more vulnerable to any attacks while on foot, but you can strike repeatedly, faster and with more accuracy.<br/>\n<br/>\r\n-Defeating all creatures in every level unlocks the next, as the character journeys to the great north, to find the source of this evil.<br/>\n<br/>\r\n-The more monsters you defeat in one go, the more chances you get to enhance your stamina, maximum health and attack strength.<br/>\n<br/>\r\n-You can upgrade your vehicle with loot obtained from defeating enemies.  <br/>\r\n(Loot spawning rate and perfect stats are inversely proportional.)", "metacritic": null, "released": "2018-12-24", "tba": false, "updated": "2019-08-28T21:50:15", "background_image": "https://media.rawg.io/media/screenshots/e5a/e5a3b5865366a798eab4ad31e14bd58c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Galaxy Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Galaxy Studio"], "esrb_rating": null}