{"id": 275658, "slug": "core-rescue", "name": "Core Rescue", "name_original": "Core Rescue", "description": "Core Rescue is a fast paced bullet hell!<br/><br/>Brought to life by a mysterious computer known only as 'The Core', you were made to be an antivirus.  And you had better be a good antivirus because there's an army of viruses between you and the Core that created you.  Tasked with saving this Core, you have a lot of challenges in your way, but you're not alone.  With a multitude of antivirus ships to choose from, each of which with their own special abilities and special virus killing weapons, it's time to jump into the game and rescue the Core.<br/><br/><strong>Features: </strong><br/><br/>Fight Through 15 tough story levels, plowing through countless viruses on your way to the Core that made you.  See if you can solve the mystery of the Core through clues in the environments,<br/><br/>6 Hard but Rewarding Bosses to fight, see if you can make it through the Hard Mode to fight the true final boss,<br/><br/>Over 5 unique ships to choose from, each of which with their own special weapons and abilities.  From your standard antivirus to an acidic ship specializing in destroying the organic corruption in the Core, to the Arrow, a ship designed to pierce enemies with its special abilities, you have a multitude of playstyles to work with.<br/><br/><br/>A stunning soundtrack made by Fan Favorite Musician: Waterflame, and our in house musician: Catch.<br/><br/>XBOX Controller support", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:15", "background_image": "https://media.rawg.io/media/screenshots/f9e/f9ee2a555901aec54d866ba0eaf15388.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hot Zombies Games"], "genres": ["Action", "Indie"], "publishers": ["Hot Zombies Games"], "esrb_rating": null}