{"id": 275604, "slug": "kurohyou-2-ryu-ga-gotoku-ashura-hen", "name": "Kurohyo 2: Ryu Ga Gotoku Ashura-hen", "name_original": "Kurohyo 2: Ryu Ga Gotoku Ashura-hen", "description": "<p>he second popular series presented by &quot;Ryu ga Gotoku Studio&quot; is now available on PSP®!</p>\n<p>A year has passed since then... He was looking for his future. And for himself.<br />\nThe man who was once called; &quot;The Mad Dragon of the Kamuro&quot; ...Tatsuya Ukyo.<br />\nThe man that wandered around the land of America and held his future in the palm of his hand should have been happy...<br />\nHowever, the emptiness that rushes in leads him back to his hometown of Kamurocho, Tokyo.<br />\nThe boys he met there. Those who lived on the edge as he once had.<br />\nThe encounter makes him realize what he&#39;s about to lose.<br />\nTatsuya was sent back to that place. To the underground fighting ground; &quot;Dragon Heat&quot;, a place where one should never return.<br />\nHowever, what was waiting there was Osaka&#39;s strongest martial arts group &quot;Ashura&quot; aiming to conquer Tokyo!<br />\nAnd the battle with Ashura has begun.<br />\nMysterious incidents begin to occur one after another in Tokyo and Osaka. The plot that unfolds beyond it threatens to sweep away Tatsuya and all of the boys!<br />\nWhat is the answer Tatsuya and the boys found in the battle?<br />\nFight if you live! If you fight, seize control of life!</p>\n<p>There is an answer...in battle!</p>", "metacritic": null, "released": "2012-03-22", "tba": false, "updated": "2023-01-21T22:46:07", "background_image": "https://media.rawg.io/media/games/c00/c00b94fddc3e9ac3b68830b11f1bbb71.jpg", "website": "http://kurohyo.jp/two/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 5, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 318, "game_series_count": 14, "reviews_count": 3, "platforms": ["PSP"], "developers": ["SEGA", "Syn Sophia"], "genres": ["Action", "Adventure"], "publishers": ["SEGA"], "esrb_rating": "Mature"}