{"id": 275632, "slug": "dungeon-of-dragon-knight", "name": "Dungeon Of Dragon Knight", "name_original": "Dungeon Of Dragon Knight", "description": "IntroductionDungeon of Dragon Knight is a dungeon crawler RPG game, based on grid system.<ul><li>Instant movement and combat based on the grid system.</li></ul><ul><li>Puzzle solving.</li></ul><ul><li>Props collection.</li></ul><ul><li> The challenging of the first-person perspective in dungeon will give you the felling that being trapped in the maze.</li></ul>Background Story       Your hometown was occupied by Orcs from the east. They burned, killed, plundered and committed all manners of crimes! Although you and your people stubbornly resisted external invasion, you were still outnumbered and failed. As a last resort, you and a few of your friends fled their homes with great sadness and stumbled into an unknown forest. Yet the sense of despair persisted, and the breath of death filled the forest.       Suddenly a woman appeared in front of you. She pointed to a hut not far away and said it would provide you with food and water, and let your team go in and rest. But when you pushed the door into the room, you realized that this is not the case. This woman's help came at a price. The hut was just the entrance to a cave, and the woman wanted you to find a villainous eroded dragon knight, Sowen, who had a magic weapon that is able to open the gates of hell in this bottomless cave. If you did not get the magic weapon, Sowen would chant a mantra at the time of the apocalypse and opened the gates of hell through it, and then the world would be gone. Even though you and your friend were exhausted, you agreed to the woman's request out of compassion and responsibility.<br/> Races and Classes<ul><li>The races includes humans, elves, dragons, dwarves, occupations with warriors, priests, mages, paladin, and warlords.</li></ul><ul><li>The difference between the front row and the back row makes you pay more attention to the overall balance.</li></ul><ul><li>Add the hard-core “saturation” and “load-bearing” systems to further increase the fun of resource management and role development.</li></ul>Puzzles and Traps<ul><li> There are so many traps in the dungeon that only grasping the opportunity and thinking hard can you solve the puzzles.</li></ul><ul><li>There are countless treasures and secrets hidden in the maze. Only by finding hidden institutions and solving complex puzzles can these mysterious treasures be seen again.</li></ul><ul><li>The truth of the Dragon Knight is hidden in every corner of the dungeon. Find them and get real answers from them.</li></ul><br/>Real-time combat<ul><li>Real-time combat surrounded by monsters and traps.</li></ul><ul><li>The selection of props and skills is more effective.</li></ul><ul><li>The continuous emergence of dungeon creatures make game atmosphere more intense.</li></ul><br/>MagicThe symbols that contain it’s own unique power, is from ancient. When two different energies meet, they will produce amazing changes.<ul><li>Magic system based on a symbol combination is constructed elaborately.</li></ul><ul><li>Contains multiple magic branches such as flame, water, air, earth, etc.</li></ul><ul><li>You can release healing, strengthening, defense, destruction, and a variety of functional magic through combining.</li></ul><ul><li>Only by constantly sovling the puzzles can you get more magic tips and control more powerful forces.</li></ul>", "metacritic": null, "released": "2019-06-21", "tba": false, "updated": "2020-01-22T13:08:09", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2f2723b21597cb1b743c26f2c271909.jpg", "website": "", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 23, "beaten": 3, "toplay": 2, "dropped": 2}, "playtime": 7, "achievements_count": 12, "ratings_count": 5, "suggestions_count": 576, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["HexGameStudio"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["HexGameStudio"], "esrb_rating": null}