{"id": 275745, "slug": "truck-simulator-open-world", "name": "Truck Simulator: Open World", "name_original": "Truck Simulator: Open World", "description": "First version of Truck Driver serial was downloaded by *30 Million* people all around the world.<br/><br/>Longing is over! Truck Driver is with you with the new version! <br/><br/>New Physics Engine: You will feel closest to real simulation in top level with improved physical engine. <br/><br/>•Unrivaled New Style: Along with new and endless story mode, unique and different 8 atmosphere is waiting to be discovered. Adventure is waiting for you in real weather conditions are fully reflected to your vehicle with all its feeling. <br/><br/>•Here are Field Monsters: 7 different types of vehicles, that are superior between each other, have specific power system, suspension structures, traction types. <br/><br/>•4 Different Game Modes: Excitement awaits you in all kinds with Career, Time Challenge, Free Mode and Multiplayer. <br/><br/><br/>•3 Different Multiplayer Mode Awaits You <br/><br/>Experience 3 different game modes in top level with people you don’t know from all around the world, your friends and family or people around you that plays the game but you don’t know!  <br/><br/>• Real Time Multiplayer - Finishing Race: Race with others with your current car and earn bitcoins and purchase better cars. <br/><br/>• Real Time Multiplayer - Relay Race: It doesn’t matter either your speed or finishing first, it doesn’t mean anything if you don’t go to finish line without flag! Hit your rival and capture the flag and go! <br/><br/>• Real Time Multiplayer - Sky Derby: There is an arena and one salvation in the sky, send your opponent down from the sky and stay alive! <br/><br/>Features<br/><br/>•15 different realistic weather condition<br/>•Obvious effect of driving experience in all weather conditions<br/>•New physical engine with its specific features of each car<br/>•Get your crane and don’t get stuck in anywhere<br/>•4 different game modes and endless level system in offline mode<br/>•Race with people all around the world with multiplayer option<br/>•Find yourself rivals in close range with find people around me feature. <br/>•Great realistic vehicle and atmosphere sounds", "metacritic": null, "released": "2017-02-26", "tba": false, "updated": "2019-10-22T14:07:10", "background_image": "https://media.rawg.io/media/screenshots/bea/bea6a704d5bf02543662f7200615d005.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huseyin Aydin"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Huseyin Aydin"], "esrb_rating": "Everyone 10+"}