{"id": 275702, "slug": "doka-2-guts-out-ninja", "name": "DOKA 2 GUTS OUT NINJA", "name_original": "DOKA 2 GUTS OUT NINJA", "description": "<strong>\"This is a game where you kill zombies or you yourself are zombie, this is a game where you kill  people in the most sophisticated ways\" </strong> - this words echoes over the streets, covered with piles of rotting corpses.<br/><br/>Crowds of gamers who have played at <strong>DOKA 2 </strong>roam them, attacking everything alive. Only a daring elf pedophile named Gross, a protector of the weak, an expert in all matters and a lover of children, can resist them.<br/><br/><strong>ATTENTION! </strong>If you play this game, then you will become a zombie and go kill school! In general, after any computer game you will go to kill school. Therefore, better go and play some \"russian roulette\", you naughty.<br/><br/>This game is <strong>NOT DOTA 2</strong>, and it doesn't pretend to be it!<br/><br/>Features:<br/>- 12 types of killing weapons (quote!)<br/>- crowds of enemies you can kill<br/>- guts out and bloody madness in pixel decorations<br/>- after the game you want to kill<br/><br/><br/><br/>This is a parody on a stupid russian pro-government \"expert\" Philip Gross-Dneprov, who blamed rock music and a game called \"DOKA 2\" in school shooting in the Crimea.<br/><br/>Thats what he said: \"There is a game \"Doka 2\". It is allowed in Russia from 18 years and older. This is a game where you kill zombies or you yourself are zombie, this is a game where you kill  people in the most sophisticated ways. That is, there you can come up with your own specific area, that is, you can come up with a school too, just blow it up, kill it. But there is a more sophisticated situation. There you are not making a bomb. You are given various weapons, you can trade.\"<br/><br/>This words instantly became a Russian meme, so we decidet to make this game.", "metacritic": null, "released": "2018-12-27", "tba": false, "updated": "2019-08-28T21:50:11", "background_image": "https://media.rawg.io/media/screenshots/828/8284f4238ea709b63de563b505b4adac.jpg", "website": "http://www.ocp.onl", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OCP", "Yuri Chuchmay"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["OCP"], "esrb_rating": null}