{"id": 275714, "slug": "drive-buy", "name": "Drive Buy", "name_original": "Drive Buy", "description": "Your job is to drive and deliver packages against the clock while balancing power-ups that could wipe out the competition.<br/><br/><ul><li>Make perfect deliveries.<br/></li><li>Earn the most credits.<br/></li><li>Stay alive!</li></ul><br/>Coming to PC in 2020, wishlist and follow Drive Buy to stay up to date.<br/><br/><br/><br/>Drive Buy has been coined \"Steams answer to Mario Kart!\" and \"If Crazy Taxi was multiplayer!\"<br/><br/><h3>ONLINE MULTIPLAYER CHAOS</h3>4 player multiplayer with friends online or kick back locally across multiple devices.<br/><br/>Vote on maps, play together or as rivals in various delivery themed game modes.<br/><br/>Be sure to keep your delivery pace up and make use of power-ups to earn the number 1 spot.<br/><br/><h3>POWER UP</h3>Detour from your deliveries to collect  power ups. Use them to Destroy, Freeze or Steal credits from rival drivers. 1-up the competition with homing missiles, sticky mines, freeze rays, coin magnets and more that are all at your disposal.<br/><br/><h3>DELIVER IN STYLE</h3>Win on the leaderboards and on the streets. Outstyle the competition with unique customisation options per character: vehicle skins, flashy wheels and boost trails. Earn new stuff by levelling up and taking part in BuyCorp challenges.<br/><h3>REVENGE MUCH?</h3>Throw up some emotes to let the other drivers know what you're thinking! Orchestrate satisfying take-downs and rub it in with emotes.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:18", "background_image": "https://media.rawg.io/media/screenshots/302/302eeb34c624a85de59e66f9177d5788.jpg", "website": "https://glitchers.com/drivebuy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["GLITCHERS"], "genres": ["Action", "Racing", "Indie"], "publishers": ["GLITCHERS"], "esrb_rating": null}