{"id": 275723, "slug": "rollercoaster-tycoon-joyride", "name": "Rollercoaster Tycoon Joyride", "name_original": "Rollercoaster Tycoon Joyride", "description": "Soar through the sky with RollerCoaster Tycoon Joyride™, a fully immersive coaster builder and rider exclusively for PlayStation®4 and enhanced for PlayStation®VR.  In the first virtual reality game in the RollerCoaster Tycoon® series, players can build and ride breathtaking roller coasters in thrilling environments with an easy-to-use coaster builder.  In a twist on the coaster experience, riders can shoot, blast, and explode moving targets to reach the top of the leaderboards.  Compete against friends and challenge them in multiplayer mode and share your incredible coaster creations with other players on PSN.  With special bonus events, and more fun-filled features, RollerCoaster Tycoon Joyride delivers a pulse-pounding and exhilarating experience.  Game also playable in non-VR mode on PlayStation®4.<br/><br/>1-4 players<br/>DUALSHOCK®4<br/>PlayStation®VR Compatible<br/>PlayStation®Camera Compatible<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>RollerCoaster Tycoon®Joyride © 2018 RCTO Productioins, LLC.  All rights reserved, RollerCoaster Tycoon® is a registered trademark of Chris Sawyer. ©2018 Chris Sawyer.  Produced, marketed and distributed under license by RCTO Productions, LLC, an affiliate of Atari Interactive, Inc. New York, NY.  Atari and the Atari logo are trademarks owned by Atari Interactive, Inc.  All other trademarks are the property of their respective owners.  Developed by Nvizzio Creations, Inc.In the first virtual reality game in the RollerCoaster Tycoon® series, players can ride breathtaking roller coasters and blast targets in thrilling environments.", "metacritic": null, "released": "2018-12-13", "tba": false, "updated": "2023-04-25T07:41:19", "background_image": "https://media.rawg.io/media/screenshots/ddb/ddbe494f2048e36b525d9f6fe4d6c42f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 42, "ratings_count": 2, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4"], "developers": ["Atari"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone 10+"}