{"id": 275751, "slug": "racing-rocket", "name": "Racing Rocket", "name_original": "Racing Rocket", "description": "Enjoy racing with this one of a kind and the best online and offline free racing game made until now.<br/><br/>OFFLINE RACING FUN AND HUNDREDS OF MISSIONS WITH ADVENTURE MODE<br/>Complete the missions that are added every week and take place in the exciting world of an amazing adventure.<br/><br/>REALTIME MULTIPLAYER RACING<br/>In multiplayer seasons, race with the rivals all around the world as multiplayer.<br/>Complete the season matches with success and pass to the next season, race with the harder rivals.<br/>Send voice record and emojis to your rivals while racing.<br/><br/>JOY OF RACING WITH YOUR FRIENDS IN PRIVATE ROOMS<br/>Arrange races  with your friends in the private rooms you created. Enjoy the free race.<br/><br/>A DIFFERENT RACE MODE WITH 4 PLAYERS<br/>In Offline Mode, In 4 Person races write your name to the first place.<br/><br/>PHYSICS BASED MOST REALISTIC RACING GAME<br/>Tens of vehicles that all having different physics and engine sounds will make you experience a very realistic simulation.<br/><br/>CUSTOMIZE YOUR CHARACTER AND VEHICLE<br/>Improve your vehicles and increase the chance of winning in the races. Unlock different characters and change the balance of race with using their super powers.<br/><br/>GAME FEATURES<br/>Unique graphics quality and race game type.<br/>You may forget what you know about physics based race games.<br/>Every time, show who is the boss to your rivals with offline race fun.<br/>If you dont have internet, there are missions.<br/>An offline and online racing game that should be in your device.<br/><br/>A unique racing game is now available on mobile, you should try now.<br/><br/>______________________________________________________________<br/><br/>Follow us on Social Media<br/><br/>Support    : http://www.roostergames.net<br/>Facebook : https://www.facebook.com/roostergamesnet/<br/>Youtube    : https://www.youtube.com/channel/UC6_kLS2W_1l9lKfHHSnovSg<br/>______________________________________________________________", "metacritic": null, "released": "2018-06-11", "tba": false, "updated": "2019-10-22T14:07:11", "background_image": "https://media.rawg.io/media/screenshots/a35/a3505f9643825106c9b809bbd35c1039_0xxAelV.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huseyin Aydin"], "genres": ["Action", "Racing"], "publishers": ["Huseyin Aydin"], "esrb_rating": "Everyone 10+"}