{"id": 275717, "slug": "deep-diving-simulator", "name": "Deep Diving Simulator", "name_original": "Deep Diving Simulator", "description": "<strong>Deep Diving Simulator</strong> will enable you to experience what it takes to be a modern diver. With a focus on realism, you will discover the uncharted waters of the world while carefully monitoring your oxygen level and decompression. Gather forsaken relics, visit sunken vessels, discover unknown species and be rewarded by various institutions who will pay good money for your findings. Each submerge gives you the opportunity to uncover mysteries that would prefer to remain forever forgotten, such as the lost city of Atlantis.<strong>Key Features</strong><ul><li><strong>Stunning Visuals</strong> - from the coldest oceans to the hottest seas, immerse yourself in the underwater adventure by experiencing beautiful locations and vivid sea life.<br/><br/></li><li><strong>Realistic Approach</strong> - each dive teaches you what it takes to be a professional diver as you must take care of your oxygen level as well as managing your position to avoid the life-threatening decompression sickness. <br/><br/></li><li><strong>Underwater Danger</strong> - the world you are about to visit is a precarious one as you have to avoid hidden rays, roaming sharks, and a whole lot more.<br/><br/></li><li><strong>Hunting for the Unknown</strong> - there are establishments who will hire you to recover various sunken objects or even photograph an exotic fish for a very good price. <br/><br/></li><li><strong>Prepare Yourself</strong> - after each successful dive you should consider upgrading your equipment to uncover areas you could not reach before.<br/><br/></li><li><strong>Games Beyond™</strong> - each living species you find in the depths will be saved in an encyclopedia that teaches you about the underwater world and its enigmatic inhabitants.</li></ul>", "metacritic": null, "released": "2019-05-26", "tba": false, "updated": "2019-08-28T21:50:10", "background_image": "https://media.rawg.io/media/screenshots/d27/d27ad0024490df54750aa96e6e990a1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 13, "beaten": 1, "dropped": 1}, "playtime": 5, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Jujubee"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Jujubee"], "esrb_rating": null}