{"id": 275726, "slug": "gungrave-vr-un", "name": "GUNGRAVE VR U.N", "name_original": "GUNGRAVE VR U.N", "description": "A standalone GUNGRAVE VR adventure featuring new enemies, stages and more!<br/><br/>After the battle to eradicate the nefarious drug SEED from South City, peace appears to have returned to the metropolis.<br/><br/>While rolling up the remaining distribution networks for the drug, Mika has received confidential intel on a chemical plant in the suburbs of South City, where suspicious lifeforms suggest the presence of SEED.<br/><br/>The battle is not yet over.<br/><br/>As undead assassin Beyond the Grave (Grave, for short) battles alone behind enemy lines...<br/>...a mysterious man watches his every move.<br/><br/>In addition to third-person action, GUNGRAVE VR U.N introduces brand new side-view stages that mix VR action with the feel of classic side-scrollers.<br/><br/>Experience the next level of intense VR action!KEY FEATURES<strong>New Perspectives for New Challenges</strong><br/>On top of the third-person action gameplay that made the series famous, GUNGRAVE VR U.N adds fast-paced side-scrolling and first-person sliding levels to the mix.<br/><br/><strong>Brand New Animation</strong><br/>GUNGRAVE VR U.N showcases the return of character designer Yasuhiro Nightow (Trigun) and the original GUNGRAVE designers at RED Entertainment as advisers, and features brand new anime cutscenes!<br/><br/><strong>Kick Their Ass!</strong><br/>Play how you want with three difficulty levels: Normal, Hard, and Kick-Ass. Are you hardcore enough to take down the Orgmen in Kick-Ass mode?", "metacritic": null, "released": "2018-12-11", "tba": false, "updated": "2019-08-28T21:50:10", "background_image": "https://media.rawg.io/media/screenshots/15b/15b0e5a17546d6e31627c18014033555.jpg", "website": "http://gungrave-vr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "dropped": 1}, "playtime": 4, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 4, "reviews_count": 0, "platforms": ["PlayStation 4", "PC"], "developers": ["XSEED Games", "IGGYMOB"], "genres": ["Action"], "publishers": ["XSEED Games", "Marvelous USA"], "esrb_rating": null}