{"id": 275730, "slug": "ultimate-bubble-shooter", "name": "Ultimate Bubble Shooter", "name_original": "Ultimate Bubble Shooter", "description": "Ultimate Bubble Shooter is an addicting, adrenaline-pumping game with thousands of totally awesome levels designed to sharpen your brain!<br/><br/>Play the most fun bubble pop game and join us on an exciting adventure in space. <br/>Drop and pop all the balls, reach high scores and win big. <br/><br/>Fan of bubble pop games? <br/>Just can’t get enough of fun brain teasers? <br/>Then this shooter is absolutely perfect for you! <br/><br/>Play now the best balloon blast game, and enjoy action-packed gameplay with plenty of fun boosters and exciting puzzle levels. Hit and blast all the bubbles to win points and complete different missions in this addicting bubble shoot adventure.    <br/><br/>This ultimate shooter game features fun puzzle levels, highly addictive gameplay, cool graphics and effects. Looking for a fun activity to pass the time? Here’s your chance to play free arcade games anytime and anywhere you want. Get Ultimate Bubble Shooter now, blast and pop balloons to become the greatest bubble popping champion! <br/>If you’re looking for fun games to play online or offline, you got to try our totally awesome bubbles game. No WiFi connection is required so you can enjoy an unlimited ball pop fun.<br/><br/>* Get Ready for a New Exciting Adventure! *                                                                                              Shoot, blast and pop all the bubbles by matching three colors - it’s super fun! Clear the board and move on to the next awesome puzzle level. Boost your gaming experience with amazing power-ups that will create massive explosions and clear a path to victory. Test your matching skills as you blast and break all the bubbles and clear levels. With more than 1000 levels and awesome features, you will enjoy hours and hours of bubble blasting fun!<br/><br/>* Bubble Pop Explosion! * <br/>Shoot and break 3 or more bubbles to create a line crush and win points. You can swap bubbles without limit, simply tap on your bubble to change its color. Use your logic and matching skills to overcome the obstacles and complete the different missions. <br/>TIP:<br/>Drop the big groups of bubbles first so you can clear a path. See which bubble color you are going to get next so you can plan your moves and create big explosions.  <br/><br/><br/>AMAZING FEATURES: <br/>- Enjoy thousands of balloon blasting levels. <br/>- Pop the bubbles and create great explosions. <br/>- Play and enjoy the ultimate shooter!<br/>- Boost your game and use awesome power-ups to advance.   <br/>- Pop 7 bubbles in a row to get a fireball that will burn every bubble on the way. <br/>- Drop 10 bubbles or more to get a bomb that will take out surrounding bubbles.                                 <br/>- Get a free gift every day!<br/>- Match and shoot bubbles and win levels.<br/>- Pop your way through the different challenges. <br/>- Tap on the screen to drag the laser aim and lift your finger to take a shot. <br/>- Make combinations of 3 or more similar colored bubbles to pop.  <br/>- This is EXTREMELY fun and addictive!!!<br/><br/><br/>Download this free shooter game with thousands of challenging levels to satisfy your itch for fun puzzles! <br/><br/>Liked the game?<br/>Please support us by rating the game so we can keep improving and create more fun levels. <br/><br/><br/>Ultimate Bubble Shooter is completely free to download and play, but some optional in-game items will require payment.", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-10-22T14:07:10", "background_image": "https://media.rawg.io/media/screenshots/954/95495eecd5a436454c69ef957f0ece3d.jpg", "website": "http://www.ilyon.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yonatan Erez"], "genres": ["Arcade", "Puzzle"], "publishers": ["Yonatan Erez"], "esrb_rating": "Everyone 10+"}