{"id": 275756, "slug": "canyon-crash-fall-down", "name": "Canyon Crash: Fall Down", "name_original": "Canyon Crash: Fall Down", "description": "Canyon Crash is an endless fast falling game<br/>Dive in the canyon with your heroes and beat your high score!<br/>Fall down as fast as possible to dodge the laser<br/>Fall down as deep as possible to collect better gems<br/><br/>COLLECT GEMS AND UNLOCK NEW CHARACTERS!<br/>* Gems have 5 different qualities, dig deeper to find them all<br/>* Unlock new characters when you achieve high scores<br/>* Choose between 20 different heroes to free fall and crash the blocks!<br/>* Upgrade your character to unlock better gems qualities<br/><br/>DODGE, DIG OR DIVE, IT'S ALL UP TO YOU!<br/>* Master Canyon Crash with all the heroes and families to beat your friends and control the leaderboards!<br/>* Powerups change your dive style in the Canyon<br/>* Dodge, dig or dive through the moving block lines to continue your falling course<br/>* Dodge the laser with the help of the powerups!<br/><br/>EASY TO PICK UP, AND FUN TO MASTER!<br/>* Tap left and right to control your hero precisely and dodge the blocks in your free fall down the canyon<br/>* Simple tap controls. Tap and hold to move your heroes faster on the blocks<br/>* Reactive controls made for a fast game<br/>* Control your ball fall through the blocks even in the last effort!<br/><br/>Canyon Crash is an endless fast game, beware!<br/>How deep can you get in this new endless falling game?<br/><br/>Visit us on Facebook and Twitter:<br/>https://twitter.com/QuickByteGames<br/>https://www.facebook.com/QuickByteGames", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-10-22T14:07:12", "background_image": "https://media.rawg.io/media/screenshots/362/362eb0a3f8cfa53cd4291c35f06291e1_aMI3fBa.jpg", "website": "http://quickbytegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["QuickByte Games"], "genres": ["Action", "Arcade"], "publishers": ["Appside"], "esrb_rating": "Everyone 10+"}