{"id": 27580, "slug": "underground", "name": "Underground", "name_original": "Underground", "description": "<strong>Underground – The System</strong><br/>Developed by Neoh Games Studios<br/><br/>Underground is an action-adventure, survival and exploration video game, its top-down gameplay takes Evee (protagonist) to explore the bowels of an underground system built to survive a chemical-biological war. Taking the player through synthetic biomes such as forest greenhouses, desert areas, residential condominiums and maritime areas; facing biological and mechanical enemies created to protect the underground from imminent threats, there are also enemies transformed by the chemically altered atmosphere after the war.<br/>The story - with threats of a possible chemical-biological war, some world leaders ordered that refuges be built to resist the coming war, with the capacity to shelter hundreds and even thousands of people for a long period; these are the underground, isolated, self-sustaining havens. Each subterranean is powered by aortic crystals, metritic energy crystals that keep synthetic biomes 'alive' and manage the system's behavior and defenses. The system has a simple objective, to maintain the balance of synthetic biomes and eliminate any type of biological invasion or not in the refuge. As it was to be expected, the undergrounds did not completely resist the nuclear chemical bombardments, making many undergrounds uninhabitable and totally hostile, few refuges partially resisted the war, bringing a problem that puts human existence in possible extinction; with the atmosphere made chemically toxic, the little oxygen and fresh water from underground become vital. Underground 01 of Ricks Cross located in Houstonian-USD is the largest built and the one that apparently suffered the least from the war. The protagonist Evee aims to invade this underground and diagnose the situation of the place, as this becomes the last possible salvation of the human race.<br/>Objective – Players control Evee, a scientific biologist with military training, who using the so-called Suit-tech, a kind of armor capable of resisting toxic and hostile environments, she will enter the refuge to destroy the crystals and eliminate the threats from the place. Evee has no record in this underground, so the entire system will identify her as a Class 5 threat, and she must be destroyed immediately.", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2022-03-25T03:50:19", "background_image": "https://media.rawg.io/media/screenshots/fba/fbacf817a0988204dc312ba309435e23.jpg", "website": "https://neohgames.com.br", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 771, "game_series_count": 0, "reviews_count": 1, "platforms": ["Wii U", "PC"], "developers": ["Grendel Games", "Neoh Games"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Grendel Games", "Neoh Games Studios"], "esrb_rating": null}