{"id": 275967, "slug": "city-school-bus-simulator", "name": "City School Bus Simulator", "name_original": "City School Bus Simulator", "description": "Play City School Bus Simulator game if you want to be a bus driver of big vehicles.Drive around the city in a school bus this is going to be fun and challenging.<br/>In this game you are the driving bus and your job is to pick up the students from school in awesome 3D designed city.<br/>Also Pick them up and bring them to school it's sounds easy right, think again we love a challenge so we challenge you to be as fast as possible otherwise you need to start over again.<br/>Do you love to drive something bigger? Driving a car is easy or parking one But bus parking and bus driving takes real skills. <br/>City School Bus Simulator games, coach bus simulator were never such to make you follow the traffic rules but this is best School Bus driving game which gives you best school bus driver platform. <br/><br/>So be a school bus driver and control the bus to preform as a skilled bus driver simulator man. In this school coach simulator get into that famous yellow school bus and use you controls to stay clear of dangers on the road with your driving skills. <br/>Get ready for a super sweet bus driver, all you need to do is pick up kids, and stay cool when the traffic starts jamming. <br/>City School Bus Simulator has a great AI system that will make the roads feel alive!<br/>City School Bus Simulator is a game for everyone to test driving skills , you need to practice everything from parking, reversing and use your mental skills to keep calm.<br/>City School Bus Simulator is an open world driving simulator game, drive the school bus, do flips and stunts by clearing huge ramps, jump through hoops and explore the city.This is your School Bus, you can bash it smash it or do whatever you want with your School bus in this coach driving game.<br/><br/>Challenging parking and driving missions. A great bus driving simulator game like this School Bus Driver 3D game has a special place for it’s fans Parking bus is fun ,your job is to drive and transport your student passengers around the city. You must drive to a timetable and Keep your school bus under control! Choose the best path to your end destination using map. Plan your route wise as you need to obey the traffic rules and take care that you don’t damage your School Bus .School Bus Pick Up Driving offers a newly developed vehicle system for a newer bus driving simulation feeling that has been never seen before So if you love school bus pick up driving games you should definitely try this game.<br/><br/>City School Bus Simulator features:<br/>- Driving is what you expect, busses are bigger than cars so you need to be careful<br/>- Huge School Buses to drive<br/>- Beautiful 3d environment <br/>- Many missions to drive and bus driving gameplay<br/>- Great physics of the buses<br/>- Traffic on the streets you need to watch", "metacritic": null, "released": "2017-02-25", "tba": false, "updated": "2019-10-22T14:07:28", "background_image": "https://media.rawg.io/media/screenshots/a46/a46f7e356adb0dc2892767c0ed1a74e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["RPG", "Simulation"], "publishers": ["jolta technology"], "esrb_rating": "Everyone 10+"}