{"id": 27601, "slug": "mega-man-zero-2", "name": "MEGA MAN ZERO 2 (Wii U)", "name_original": "MEGA MAN ZERO 2 (Wii U)", "description": "<p>For the entire month of May, Nintendo and Capcom are celebrating our<br />\nfavorite blue bomber, Mega Man, with six game releases on the Virtual<br />\nConsole™ service for the Wii U™ system. Learn<br />\nmore &gt;</p>\n<p>Zero must rejoin Ciel and the other Resistance fighters to stand a<br />\nchance against Neo Arcadia. But when a standing commander decides that<br />\nunsealing a dark, evil entity is the only option left, Zero will have to<br />\nequip every form of ability and weapon to turn the tides of war.</p>\n<p>A year after separating from the Resistance, Zero arrives in the new<br />\nResistance Base, where Commander Elpizo is now leading the fight against<br />\nNeo Arcadia. However, not all goes according to plan, and the threat of<br />\nawakening a legendary dark force foreshadows the start of a new war.<br />\nZero can use basic abilities like jump, dash, and wall kick to traverse<br />\nstages while equipping different sub weapons for different attacks. But<br />\nhe will also need to combine special items such as Cyber-elves, Forms,<br />\nand EX Skills to gain even stronger abilities and weapon upgrades. Zero<br />\nwill need to use all within his power to stop this latest calamity<br />\nbetween humans and Reploids!<br />\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you&#39;ll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.</p>", "metacritic": null, "released": "2015-05-21", "tba": false, "updated": "2023-06-19T13:31:18", "background_image": "https://media.rawg.io/media/screenshots/383/383ec182ef5453601f18c17222281db9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 1, "platforms": ["Wii U"], "developers": ["Capcom"], "genres": ["Action", "Platformer"], "publishers": ["Capcom"], "esrb_rating": "Everyone"}