{"id": 276176, "slug": "order-your-disorder", "name": "Order your Disorder", "name_original": "Order your Disorder", "description": "<p>Brief Description</p>\n<p>A 2D platformer game about facing anxiety. Player start from a not so clean scene and a bar showing anxiety level which goes up automatically. Player cleans up the enemies which are dirty faces , hands and bugs.The anxiety level decreases when player attacks with the cleaner. A NPC will show up in the next scene and tells the player to find the key to inner peace with zero anxiety. The key is a vacuum seal. The player will crawl into a machine that vacuum seals her. The final scene will be in a museum where gold frames are hung on the wall. Player wins by going into the gold frame , become an artwork and reach inner peace.</p><p>Rules</p><p>The first scene is a platformer game, player needs to kill enemies by attacking them with the cleaner. When the enemies are dead, the bar goes down, or it goes up automatically. When the player make it through the first level, they jump into a particle system and they will see a NPC, press the Q key to interact with him. After that they will go through the vacuum sealer to get themselves vacuum sealed. The vacuum sealed player enters the final scene which is a museum, going into the gold frame will end the game.</p><p>Artist's Statement</p><p>While discussing about serious games and games more than entertainment, I had an idea about making games about anxiety. I was suffering from anxiety for a while, and it made me hated myself a lot at that time. I couldn’t feel normal or happy when I see things like bugs or anything that I think are unclean. So I joked about vacuum sealing myself to my friends. And every time I visit museums in the city I see artworks and I wish I were that calm and peaceful. I wanted to show people how it feels like to have anxiety or any kind of disorder. I researched about mental illness like anxiety and obsessive-compulsive disorder. The symptoms for obsessive-compulsive disorder is over cleaning. And anxiety are mostly caused by depression. I made the character wear orange colored shirt because it a symbol for what prisoners wear in jail. Meaning life with anxiety feels like jail to me. Also there are no eyeballs in the eyes. I felt like it could make the character look more empty and hopeless for her life. The mechanics for the game are fairly simple. Mostly just moving with the arrows and fighting the enemies. It is like life, you move and something bothers you. It is important to make yourself comfortable.</p>", "metacritic": null, "released": "2018-12-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/13f/13f80fdeace6308b377c9efafd69b653.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["sleepin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}