{"id": 276167, "slug": "sands-of-steel", "name": "Sands of Steel", "name_original": "Sands of Steel", "description": "<p><strong>The year is 2006</strong>. The age of sophisticated adult prestige television — still mostly personal dramas and crime stories — is on the rise. Researchers at an experimental branch of a well-known cable TV studio have been tasked with exploring how other potent genre elements might be worked into the formula, namely fantasy and sci-fi. But the project they are about to begin will do far more than spawn a successful show — it will threaten television itself.</p>\n<p>\n</p>\n<p>Armed with the finest computers of the day, the researchers begin workshopping concepts for new shows and technologies that could speed up their development. To save on iterating by hand, they write an algorithm to pump out episode scripts — beginning with scripts for their first test series, a tawdry mashup of high-fantasy and futuristic genre tropes titled <em>Sands of Steel</em>. Using recent advances in computer animation, they find they are even able to write software into which they can feed these scripts to automatically generate footage suitable for showing audiences at test screenings. (The results are crude, but seem good enough to gauge the average viewer’s receptivity to very serious TV that also features spaceships, or dragons with relationship problems.)</p>\n<p>\n</p>\n<p>As soon as their early tests begin, though, a disturbing fact becomes clear. The researchers have stumbled upon the perfect formula for compelling television. Despite its primitive presentation, something about <em>Sands of Steel</em>’s precise mixture of random violence, barely-justified nudity and leaden cliché drives the test audiences wild. The plot of the show follows a dizzying number of characters both on and off the medieval desert planet of Covos, killing or undressing them seemingly at random, never heading in any discernible overall direction. But each time the end credits roll, the test subjects beg the researchers to generate a fresh episode — they yearn to, as one viewer even puts it, “binge watch” them.</p>\n<p>\n</p>\n<p>As soon as this report comes back to the executives in charge, the project is canned, the results filed away, and the researchers and test subjects disappeared. It’s all too obvious to the powers that be that this technology could obsolete their entire industry. In time, they begin quietly setting their human writers to work on some related concepts…</p>\n\n<p>\n</p>\n<p>Today, the lawsuits surrounding the disappearances have only recently begun to finally resolve. Despite the studio’s very grave acts, it was nearly impossible for lawyers to persuade them to release the source code from their archives as part of a settlement — until we had fully arrived in today’s unrecognizable, overwhelmingly-flooded media landscape. Colossi of human-crafted television now tower over the genre space that <em>Sands of Steel</em> once threatened to both create and destroy. Still, by releasing this reconstructed build of the original <em>Sands of Steel</em> generator, we hope to give you a glimpse at the future of infinite robo-television that could have been.</p>", "metacritic": null, "released": "2018-12-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b30/b30cc45cbfce8f113a63c15eb0f03423.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["breakfeast"], "genres": [], "publishers": [], "esrb_rating": null}