{"id": 276399, "slug": "airdnd", "name": "Airdnd", "name_original": "Airdnd", "description": "<p>In Airdnd you play as a bed and breakfast host trying to clean your place up for the upcoming guests. You have a limited time to do your chores, which have taken on the form of creatures that will attack you. The longer you avoid a chore, the stronger they get. If you defeat a creature, they will poof back into their inanimate state.You must then pick them up and carry these piles to their correct locations around the house to fully dispose of the creatures, or else these piles of dust and clothes will reanimate stronger than before.</p>\n<p><strong>What Tools We Used</strong></p>\n<p>Illustrations and animations were done using a combination of Adobe Illustrator and After Effects.</p>\n<p>The game was built using King's, creators of Candy Crush, free game engine Defold (https://www.defold.com) and programmed using Lua.</p>\n<p><strong>Credits</strong></p>\n<p>Keith Charles - Programming, Design\r\n<br/>Matt Dunne - Art, Animation</p>\n<p><strong>Notes/Post Mordem</strong><br/></p>\n<p>This was both of our first official game jam we've attended. It was a ton of fun with good people. It was also a big learning experience, at least for me (Keith). First off, this was pretty much my first foray into Defold as a game engine. Not knowing a whole lot about the inner workings nor a ton about Lua, it presented itself as a significant challenge. I chose Defold because with my brief experience with it prior to the jam, I knew it handled animation implementation and tilemapping very well, and it was just something I really wanted to dive into in a crash course sort of way. </p>\n<p>Most of the running code in this build was actually written within the last 6 hours of the jam because I had been going in one direction for most of the duration and was hitting road block after road block. My issue was I was trying to do something that Defold wasn't necessarily made for. At the last stretch, I decided to scrap the idea and start new on a significant chunk of the game. With that, we were able to at least get what you see here, and I'm pretty proud of it. </p>\n<p>There is only one creature that drops a random of three items (we animated 2 more creatures, but didn't have time to rig them up in-game). Creatures cannot harm you. There are no menus and <em>extremely</em> minimal GUI. All in all, We really enjoy this concept that we came up with and we're going to continue moving forward with development on the Defold Engine. </p>", "metacritic": null, "released": "2018-12-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/abc/abc0fdf2a1b91496145c15e76e2b46e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["deathbyboxes"], "genres": ["Action"], "publishers": [], "esrb_rating": null}