{"id": 276362, "slug": "chut", "name": "Chut!", "name_original": "Chut!", "description": "<p>🇫🇷 Chut! est un jeu vidéo sur la liberté d'expression développé par Them Games sur une commande d'Hérault Culture.</p>\n<p>Chut! est un jeu vidéo collaboratif et participatif, fabriqué avec des artistes et enfants du département de l’Hérault. Dans Chut! quatre joueurs ou joueuses doivent collaborer pour changer l'avis, et peut être changer la vie des habitants de 4 dictatures. Une dictature militaire, une dictature bureaucratique, une dictature religieuse et une dictature du spectacle. Incarnant quatre artistes, elles et ils doivent intervenir dans l’espace urbain du jeu par leur art, pour ramener la pluralité d’opinions et la diversité de pensée dans la ville.</p>\n<p>Entourés de badauds, le grapheur, la danseuse, le slameur et l’affichiste doivent tous ensemble collaborer et échapper aux forces répressives qu’ils ne peuvent pas combattre, pour ramener au monde les couleurs de la diversité.</p>\n<p>Le jeu se joue de 2 à 4 joueurs et n'est jouable qu'à la manette. Branchez jusqu'à 4 manettes et appuyez sur A pour rentrer dans la partie.</p>\n\n<p>🇬🇧 Chut! is a video game about freedom of expression developed by Them Games and Herault Culture.</p>\n<p>Chut! is also a collaborative and participatory game, crafted with artists, kids and teenagers from Hérault, a region in southern France. In Chut! four players have to collaborate to bring about change in four different dictatorships. A military dictatorship, a religious oppression, a bureaucratic totalitarian regime and a spectacle-driven tyranny. Stepping in the shoes of four different artists, they must intervene in public space through art, and not violence,  to bring back a plurality of opinions and thought in town.</p>\n<p>Surrounded by strollers and bystanders, the grapher, dancer, poet and poster artist must collaborate and escape the oppressive forces they can't fight to bring back the colors of freedom.</p>\n<p>The game is played from 2 to 4 players only with controllers. Plug up to 4 controllers and press A to step in the game.</p>", "metacritic": null, "released": "2018-12-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8a7/8a7a62112401aa7977e9d09cedf9f09c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Them Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}