{"id": 276572, "slug": "the-garden-of-horcruxes", "name": "The Garden of Horcruxes", "name_original": "The Garden of Horcruxes", "description": "<p>“<em>Something was standing on it which I thought at first was a tree trunk twelve to fifteen feet high and about one and a half to two feet thick […] it was made of skin and naked flesh […] On the very top of the head was a single eye, gazing motionlessly upward […] Above the head, however, was an aura of brightness. The thing did not move, yet I had the feeling that it might at any moment crawl off the throne like a worm and creep toward me. I was paralyzed with terror.</em>” (Carl Jung, c1909) <br/></p>\n<p><em>The Garden of Horcruxes</em> is a virtual reality sculpture garden inspired by the first dream of psychoanalyst Carl Gustav Jung and <em>The Legend of Zelda</em> videogame series. The environment itself is a psychoanalytic reading of <em>The Legend of Zelda</em> dungeons and their respective boss monsters. In Jung’s first (or “phallus”) dream he encounters a towering mound of flesh with one single eye and later describes this as a subterranean God “not to be named”. This is an Oedipal and phallic figure – that of the symbolic father of monotheistic religions. In the same vein, Link of <em>The Legend of Zelda</em> enters numerous subterranean structures to defeat monstrous one-eyed phallic egos that extend and diffract themselves in character and theme onto their domains. These are caricatures of fragile and condemned masculinities who howl in electronic pain when slashed in the eye with a sword, just as one might howl in pain when kicked in the groin. The artist invites you to a floating garden where you can view these diffracted ego monsters – these “horcruxes” condemned for eternity in a dream-like prison. \r\n  </p>", "metacritic": null, "released": "2018-12-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9a5/9a5060605d263b17b5ed5afc08db4e2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Tom Penney"], "genres": [], "publishers": [], "esrb_rating": null}