{"id": 276539, "slug": "t8-snake", "name": "T8 Snake", "name_original": "T8 Snake", "description": "<p><strong>T8 Snake</strong> is a porting from Commodore 64 to PC of the most innovative snake game of all time: P0 Snake! <br/></p>\n<p><em>P0 Snake </em>of Antonio Savona requires only one button to control the snake over 31 levels of different places. This will change what you ever know about a snake game!</p>\n<p><strong>T8 Snake</strong> offers the<em> Classic levels </em>of <em>P0 Snake </em>(all elements are accurately positioned as in Commodore 64 version thanks to the original source code contribution) and then improve it with <em>Modern levels </em>for a total of 64.</p>\n<p>T8 Snake supports up to 4 users, so you can let your friends to play to it without affects your levels progression.</p>\n<p>T8 Snake supports<strong> English</strong> and<strong> Italian</strong> language.<br/></p>\n<p>You can try this game with a <strong>free demo version </strong>that explore both classical and modern levels, while the <strong>final version</strong> is given just at the <strong>cost of a coffee </strong>for each people that contribute to it.</p>\n<p>Game is in <strong>Java</strong> and is tested in <em>Windows</em> and <em>Linux </em>(if you are a Mac users, please test the demo version before buy it).</p>\n<p>You can always run it with a simple <em>\"java -jar t8-snake.jar\"</em> from a console as soon as you had Java installed into your pc, but for Windows there are even an executable version that comes with and embedded Java Runtime Environment that simplify it.<br/></p>\n<p><strong>Android port </strong>for smartphone will arrived soon...</p>\n<p>For every question or problem please contact us at <em>iceteam@altervista.org</em>, <em>iceteamandroid@gmail.com</em> or PM at https://www.facebook.com/T8Snake/<br/></p>\n<p>Note: actually yuor system should have a video driver that use   hardware accellerate OpenGL graphics for let the game  to be executed correctly, so try the demo to be sure your system is suitable for T8 Snake.<br/></p>", "metacritic": null, "released": "2018-12-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/067/067192dba6b7f3ed6f88913e85f56305.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Ice Team"], "genres": ["Action"], "publishers": [], "esrb_rating": null}