{"id": 276557, "slug": "survival-itch-gamesio", "name": "Survival (itch) (Games.io)", "name_original": "Survival (itch) (Games.io)", "description": "<p>In this pakage there will be a compleat game that is 3D and your objective is to pick up items with F and use them with the left mouse button, for example if you want to kill a sheep for food you would need to pick up a axe with the F button and swing the axe at the sheep with the left mouse button.</p>\n\n\n<p>The map involves:</p>\n<p>sheep, a fully functional player that you can move around that has health and hunger, Mountains, Hills, Trees, Lava, Lamps and Lamposts, 6 houses, two villages, large trees, 3 types of mountains, pebbles, boulders, rocks, paths, grassy area (covers half of the map), bridges, signes, Rock arch, Fences, Axes, Med kit, campfire, Gems, Chicken, mutton, Benches (3 types), Crates, Firewood, Two types of flowers, two types of mushrooms, a swamp area, can climb the mountains, Dead tree, Tree stump, Lava plane underneath the map, Health bar, Hunger bar, Inventory with 10 slots in it to store food or meds or equipment, and much much more...      </p>\n<p>Note: This is the stuff for the pack that costs 5 USD.</p>\n\n\n<p>Extra Detail:</p>\n<p>Everything is 3D in the game and everything is solid so your character can not walk though it unlike some other games made with unity.</p>\n<p>To download you just need to press on the link and you can publish it as your own game but link the game to my account.</p>\n<p>The game is made in unity so if you want to update the game you need to install the latest version of unity and program it in there. If you do this you can still not say that it is just yours and you are the only one that did it, well you can but it would be apriciated.</p>\n<p>you will get all the updates for the game to put on yours, the updat that i am working on at the moment is a new map which will be a new file so come back soon for a new map.</p>\n<p>If you have any suggestioin on what I should improve on please give me suggestions in the comments</p>\n<p>release date: 9/12/2018 </p>\n<p>if you want to feel free to donate more than the asking price, this is only if you want to do that and there is going to be a christmas sale very soon where it will be 75% off until the end of the 25TH of December.</p>\n<p>Since you have read so far you deserve to know a glitch, iy fou eat some food after you die and then equip the axe you will be able to go anywhere without haveing to worry about hunger, so do as you please, but dont fall of the map, who knows down there?well i know whats down there since i have been, it is just a endless void of nothingness which you will keep on falling through forever... Or did I just say that to scaer you, Who knows?</p>\n\n\n<p> updates will be shown in the notes section here:</p>\n<p>4. There has been an update of the cheapest version yet, there are now three maps, this map is a small compact area with a simple camera, a house, a player, two trees, 27 large rocks, 15 small rocks, a campfire, a sign, 3 fences, a light, a bench and lots and lots of grass on the floor and much much more...</p>\n<p><strong>more will be future updates coming soon...</strong></p>\n\n<p>In the future  I am going to be working on an amazing  version of the game where you will get the tools and you can create the map however you chose to, whether it be a robotic sci - fi area or an ancient underground tomb! This will be coming in a while so dont get your heads in a twist, this is big!<br/></p>", "metacritic": null, "released": "2018-12-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b49/b49da2afcb509549cef6e610e65e6e3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Games.io"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}