{"id": 276670, "slug": "outcome", "name": "OUTCOME", "name_original": "OUTCOME", "description": "WHAT IS THE GAME?▸<strong>OUTCOME</strong> - futuristic CO-OP fps shooter game with great opportunities.  It will contain a large number of interesting ideas (for example, AI, a lot of CO-OP game modes, maps, equipment like planes, tanks, turrets, weapons, customization and much more!)  Be at war alone or with friends, arranging a zombie survival or a huge war with smart AI!<br/><br/>At the moment, I develop this game alone, proving to myself and others that everything can be done. The game is planned to be released in the middle of 2019 in the alpha. Now, almost all aspects of the game are ready and thought out, the shell of the game is made, so I recently successfully started creating all this. I will listen to all feedback of the fans and I am sure - together we can do anything!STORYLINE <br/>▸The game presents the near future, when the world is on the threshold of creating incredible technologies.<br/><br/>Corporation ''COBRA'' creates bio-robots that capture people into slavery, conduct experiments. Under the pretext of good deeds, this corporation destroy everything they see fit. They are opposed by the whole world, with the task forces - \"AURORA\".  In addition, there will be others, for example - \"Rebels\".COOPERATIVE<br/>▸The game will focus on co-op mode (up to 4 players), but you can play alone. You will be able to host any game modes, maps, choose the weather and other available settings for free. I understand that this is the main function of the game and I will try to do everything to make you have a cool time with friends or other players.MAPS<br/> ▸In the game there will be a large number of maps, on all maps it will be possible to change weather conditions and other settings. Maybe I will make a level editor with steamworks, so you can will create new maps!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:50:08", "background_image": "https://media.rawg.io/media/screenshots/bb1/bb17ecdf264ccb5ed2a484f0aea9e4a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VergeXGamer"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["VergeXGamer"], "esrb_rating": null}