{"id": 276648, "slug": "werewolf-hunter-x", "name": "Werewolf Hunter X", "name_original": "Werewolf Hunter X", "description": "<strong>The Rundown:</strong><br/>Werewolf Hunter X is a retro style 2d crafting survival and sandbox game that is currently in development by SeaCreatureSandwich, and boasts unique item building, procedural generation, rogue-like resource scarcity, mythical monsters, and much more.<br/><br/><strong>Game Mechanics:</strong> <br/>The unique Item Design mechanic allows the player to create, and share custom items in game time.<br/>This can be handy for getting out of sticky situations. Stuck in a pit? Build a ladder! About to go into battle? Build a sword!<br/>Want that sword to be made of Spaghetti noodles? That’s up to you. Material properties directly affect the player and the game world around them, so building armor out of lava is not recommended. There is no limit to what you can create when you design the items yourself!  <br/><br/>Werewolf Hunter X also boasts Procedural world generation, random events, and rogue-like resource scarcity/trade-offs<br/><br/>Day and night cycle mechanics are also featured with persistent time, as well as weather mechanics, and player stats and buffs such as: Energy, speed and health.     <br/><br/><strong>​The Recipe Design Mechanic: </strong><br/>The Item design tool can be accessed at any point during the game. This is where the player will pick ingredients, shapes, colors, review the potential item stats, give the item a name and create the recipe. Save your design and then return to your adventure to create it, all in real time.   <br/> <br/><strong>The Story:</strong> <br/>A long time ago the planet called Earth was destroyed. The final act of the human race as Earthlings was to build four massive ships that would hold the sum of our kind. The ships were sent out into the far reaches of the universe in hopes that we might find a new home for mankind. <br/><br/>Roughly twenty two hundred years later one did! The planet was 98% compatible. Until then the best rating had been less than 5%. The planet's original inhabitants seemed to have suffered a species ending event that left the planet more or less intact.<br/><br/>After a thorough assessment while in orbit we landed and began to colonize. Our disassembled ship became strong walls around the colony, keeping out the wandering, ruthless monsters that were the shadows of the planet's previous tenants. <br/><br/>A message was sent to the other three ships so that they could make their way to Humanity's new home, as they had all planned so long ago. <br/><br/>Now, we are left to prepare for their arrival. We must build our small colony into a great empire, fight off the demons of the new world, and conquer the unruly landscape of our new home.", "metacritic": null, "released": "2018-12-28", "tba": false, "updated": "2019-08-28T21:50:09", "background_image": "https://media.rawg.io/media/screenshots/6ce/6ce5b2d4f789ce7d67313b1a32160a16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Sea Creature Sandwich"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Sea Creature Sandwich"], "esrb_rating": null}