{"id": 276725, "slug": "gold-train-frvr-railway-maze", "name": "Gold Train FRVR - Railway Maze", "name_original": "Gold Train FRVR - Railway Maze", "description": "Solve challenging and unique puzzles, by connecting railroads and building a safe way to make the railway reach the train station. Improve the locomotive and add wagons (for goods or passengers) and vaults to get as much gold as you can in your way over the rails. Do it as fast as you can or the train will crash! This plumber style game mixes the western aesthetic of the old trains transporting gold with the flow puzzles. The best pipe connecting game to keep your brain sharpen!<br/><br/>Play Gold Train FRVR now if you’re a jigsaw lover. Easy to play but challenging and engaging, the best option for both kids and adults!<br/><br/><br/>A new railroad puzzle game! Gold Train FRVR is your new favorite railway line game! Addictive and fun gameplay that will hook you up for hours! Drag, drop and rotate track tiles to complete the lines for the train and try to reach the next station! Evolve and improve your train and get as much gold as you can on your way to the station to reach the higher score among your friends! Each scenario is a new challenge, how many gold coins can you get?<br/><br/>Gold Train FRVR is a truly relaxing railroad puzzle game where there’s NO LIVES MODE. Play as much as you want! Moves are not limited, if none of the pieces fit on the board, just press the shuffle button and new railway tracks will appear. Squeeze your brain with hours of pipe connecting and drag the train tracks wisely! Be careful and select the right tile to assemble the railway road and get the train to the station safe! Can you become the railroad tycoon of the wild west?<br/><br/>Try to solve the puzzles using all the railroad tracks to maximize your score, and reach the train station before the time runs out to get a bonus. You have two options in each stage: solve the puzzle as fast as you can to multiply your gold earnings or relax and play at your own pace since there is no time limit. Sharpen your wits to solve the challenges of each puzzle with the best brain training game. Connect the railroad tracks and save the trains!<br/><br/>Relaxing gameplay that mix pipeline games and classic puzzle with a fresh railroad-theme where all the pieces can be swapped and shuffled to connect the railway tracks. The railroad tracks need to be connected before you can continue, otherwise the train will crash and you’ll lost all the gold! All that you need is correctly connecting the pipes from one point to another. Don’t be afraid of getting stuck, since you can always change, shuffle and switch the pieces as many times as you need to solve the railway puzzle.<br/><br/>Drive a railroad through hundreds of wild west levels. Build the train tracks from the starting point to the destination train station, and try to fill all the blanks with the railway pieces. Cross the rivers using wooden bridges or build rail crossings to go through the same site several times. Try to pass by the mine to fill the vaults with gold coins, then use the money to improve and upgrade the parts of the railroad: locomotive to add multipliers to your score, wagons for transporting both goods and passengers, and vaults to fill with gold coins.<br/><br/>Gold Train FRVR is a low storage game, you don’t need more than 40 mb to play! This railroad connection game only focuses on giving you a truly fun experience in a low mb game for free. It’s an easy to play pipe connecting game with incredibly addictive and simple controls, so both young and adults can have fun. Play online or offline, since you don’t need an internet connection to play this railway puzzle game. And relax, you can play as much as you want, there’s no time limit!<br/><br/><br/>Do you like it? We have a lot of free games for you!<br/>https://frvr.com<br/>https://goldtrain.frvr.com<br/>https://fb.me/frvrgames<br/>https://fb.me/goldtrain.frvr.instant", "metacritic": null, "released": "2018-12-10", "tba": false, "updated": "2019-10-22T14:07:40", "background_image": "https://media.rawg.io/media/screenshots/580/5801dd76f84ab6eb0c05bb64bb79b3ed_KVOzfgd.jpg", "website": "https://frvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FRVR"], "genres": ["Board Games", "Puzzle"], "publishers": ["FRVR ApS"], "esrb_rating": "Everyone 10+"}