{"id": 276721, "slug": "mahjong-frvr-shanghai-puzzle", "name": "Mahjong FRVR - Shanghai Puzzle", "name_original": "Mahjong FRVR - Shanghai Puzzle", "description": "Relax, take a look at the board and try to match some tiles, It’s time to play Mahjong Solitaire! Solve unlimited boards and exercise your brain with a DAILY NEW LEVEL!<br/>Find your zen in this classic shanghai solitaire game designed with BIG original chinese TILES, simple controls and a relaxing asian music. No time limits, no moves limits… It’s just you and the mahjong blocks!<br/><br/>Worried about running OUT OF LEVELS? Relax, your mahjong adventure has just started! This shanghai solitaire has UNLIMITED BOARDS to be solved! Enter this timeless classic game and find a new challenge every day full of tiles waiting to be matched!<br/><br/>Playing Mahjong FRVR it’s truly a pleasure for your eyes and an extremely fun experience for your brain. The gameplay is simple yet addictive: you just have to match identical chinese tiles (flowers, dots, bamboos, dragons, winds or characters) and remove them from the board, exposing the tiles under them for play. The game is finished when all pairs of mah jong blocks have been removed from the table, or when there are no exposed pairs remaining. Seems easy but, be careful and choose all pairs wisely, or you can run out of options! Even the mahjong masters find a challenge here!<br/><br/>Remember the CLASSIC MAHJONG PC version that you used to play for hours? The game that has so many names: Taipei solitaire Mahjong, Mahjongg solitaire, Mah jong, Majong, or even the “chinese tile matching game”. The classic board game is back! Mahjong FRVR is the perfect remake of the epic chinese board game. Designed with BIG 3D TILES and an original relaxing asian music. All colors and graphics give you a deluxe top mahjong experience. It’s the perfect time killing game for a short period of refreshing brain training on the bus, in the toilet or in the office. An easy to play retro board game for all ages and all kind of devices.<br/><br/>Mahjong FRVR is relaxing casual game and there are INFINITE UNDOS during the game! Just find your strategy and try to solve this chinese puzzle the way you want. Match some pairs of tiles, explore the rest of the blocks and then undo your movements and start all over again. Be smart and change that pair of flowers for two bamboo tiles and continue solving the mahjong board!<br/><br/>Discover the Calendar Mode and find a new challenge every day! Choose between facing the daily classic shanghai level or giving a try to all previous puzzle boards. Then, choose among various difficulties: start from Casual mode and relax yourself with an easy matching gameplay and then try the challenging mode, a perfect brain training for mah jong experts!<br/><br/>Mahjong FRVR is a low storage game, you don’t need more than 36 mb to play! This classic lightweight mahjong solitaire game only focuses on giving you a truly fun experience in a low mb game. It’s an easy to play Shanghai Mahjong with incredibly addictive and simple controls, so both young and adults can have fun. Play online or offline, since you don’t need an internet connection to start matching pairs of chinese blocks. And relax, you can play as much as you want, there’s no time limit! It’s just you and your brain!<br/><br/>Download now and play the best classic Mahjong Solitaire game!<br/><br/><br/>Do you like it? We have a lot of games for you!<br/>http://frvr.com<br/>https://mahjong.frvr.com/<br/>http://fb.me/frvrgames<br/>https://www.facebook.com/mahjongfrvr", "metacritic": null, "released": "2016-06-25", "tba": false, "updated": "2019-10-22T14:07:39", "background_image": "https://media.rawg.io/media/screenshots/c8c/c8c56d749a2a65d24b23144032af363b_FCHkj6A.jpg", "website": "http://frvr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FRVR"], "genres": ["Board Games", "Puzzle"], "publishers": ["FRVR ApS"], "esrb_rating": "Everyone 10+"}