{"id": 276738, "slug": "gummy-land", "name": "Gummy Land", "name_original": "Gummy Land", "description": "If you are looking for the best match 3 game, you've come to the right place!<br/><br/>Just match 3 candies to fulfill the orders and serve the customers - it's that simple! Serve customers from around the globe visiting famous landmarks such as the Eiffel Tower, Statue of Liberty, the Great Wall of China and many more!<br/><br/>When the puzzles get challenging, you can always use a ton of FREE powerups such as bomb, color blaster, rocket and more. If things get lonely, connect with Facebook and invite your friends to join you on the sweetest match 3 puzzle adventure of your lifetime!<br/><br/>For the first time ever, a match 3 game with multiple game modes such as 'Boss Fight' where you use your matching skills to defeat the evil Dr. Bitterbite and 'Rescue Birds' where you free captured birds by releasing them off the board. With more than 500 levels, the fun never stops, and we keep adding new levels every week, so you don't run out of puzzles! <br/><br/>Gummy Land features:<br/><br/>-- Simple &amp; addictive match 3 puzzle gameplay<br/>-- Variety of entertaining game modes such as Boss Fight, Rescue Birds, Waffle Mania and more<br/>-- Roam around the world and visit Paris, Las Vegas, China, India and more<br/>-- Find and serve over 20 unique &amp; witty customers<br/>-- Sign up with Facebook to play with friends and sync progress across devices<br/>-- Stunning powerups such bomb, rocket, color blaster and more<br/>-- Play daily and win free rewards and gifts<br/>-- Over 500 fun-filled levels with more added every month <br/><br/><br/>Available in English, français, Deutsche, italiano, Español, Português, русский, Tiếng Việt, bahasa Indonesia,  عربى, ไทย, čeština, 简体中文, 中國傳統的, 한국어, 日本語, Türk, Nederlands, dansk, svenska, norsk, Suomalainen<br/><br/>------------------------------------------------------------------<br/>Gummy Land: http://gummyland.madovergames.com<br/>MadOverGames: http://madovergames.com<br/>Facebook: https://www.facebook.com/madovergames<br/>Twitter: https://twitter.com/madovergames<br/>Youtube: https://www.youtube.com/user/MadovergamesWoW<br/>Google+: https://google.com/+MadovergamesWoW", "metacritic": null, "released": "2018-12-12", "tba": false, "updated": "2019-10-22T14:07:42", "background_image": "https://media.rawg.io/media/screenshots/ec6/ec650706c5f71a8c472430a56df79650.jpg", "website": "http://gummyland.madovergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MadOverGames"], "genres": ["Adventure", "Puzzle"], "publishers": ["MadOverGames"], "esrb_rating": null}