{"id": 2767, "slug": "far-cry-primal", "name": "Far Cry Primal", "name_original": "Far Cry Primal", "description": "Welcome to the Stone Age, a time of extreme danger and limitless adventure, when giant mammoths and sabretooth tigers ruled the Earth and humanity is at the bottom of the food chain. As the last survivor of your hunting group, you will learn to craft a deadly arsenal, fend off fierce predators, and outsmart enemy tribes to conquer the land of Oros and become the Apex Predator.<br />\nGAME FEATURES<br />\nSTONE AGE BY FAR CRY: The rich setting of the Stone Age provides a new setting filled with unpredictable mayhem, dangerous threats, and incredible stories that Far Cry is known for.<br />\nRISE ABOVE EXTINCTION: Play as Takkar, a seasoned hunter and the last surviving member of your group. There is one goal: survive in a world where you are the prey.<br />\nFIERCE WILDLIFE AND SAVAGE AND MAJESTIC WORLD: This is earth before man laid claim to it, where deadly sabretooth tigers ruled the world, giant woolly mammoths were kings, and herds of massive Elk stormed through the plains. Discover these and many more daunting creatures in the savage open-world of Oros within the towering redwood forests, harsh taiga, cold glacial mountains and humid swamps.<br />\nIn order to enhance your immersion, the entire dialog audio is in a primitive language inspired by Proto-Indo-European, a language that was spoken by our ancestors 12,000 years ago, and subtitled in English.</p>", "metacritic": 74, "released": "2016-02-23", "tba": false, "updated": "2024-04-17T11:30:50", "background_image": "https://media.rawg.io/media/games/119/119bb59e64c7956171a33df0d35aee6b.jpg", "website": "http://far-cry.ubisoft.com/primal/", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 232, "owned": 2185, "beaten": 616, "toplay": 165, "dropped": 337, "playing": 48}, "playtime": 9, "achievements_count": 202, "ratings_count": 801, "suggestions_count": 584, "game_series_count": 7, "reviews_count": 815, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Ubisoft"], "genres": ["Action", "Shooter"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Mature"}