{"id": 276856, "slug": "treasure-hunt-a-hidden-object-mystery-game", "name": "Treasure Hunt - A Hidden Object Mystery Game", "name_original": "Treasure Hunt - A Hidden Object Mystery Game", "description": "Let's start your adventure here: the journey of mystery and treasure hunting. Along the way, you will seek out secrets, solve mysteries and then find hidden objects. Treasure Hunt - Fun Games Free is one of the best h.<br/>You will find multiple levels in mysterious and enchanting scenes in Treasure Hunt - A Fun Hidden Objects Game, each more challenging than the previous one. Picture puzzles, Silhouette stages and Word lists all represent the most classic yet never-stop-surprising challenges you can find in Hidden Objects games. Treasure Hunt is the challenging hidden objects game you've been looking for.<br/><br/>Features: <br/>- Challenging escape based in a dark, mysterious scene. <br/>- Amazing riddles and picture puzzles to complete on your adventure. <br/>- Three types of hidden object levels: item pictures, silhouette, and word lists. <br/>- A great way to challenge your brain to solve puzzles. <br/>- A brand new map system to discover all levels<br/><br/>How to Play: <br/>- Look carefully at each screen as you try to locate and match items. <br/>- Tap an item to collect it. <br/>- Match words to the images to find more hidden objects. <br/>- Navigate through the puzzles using the convenient map system. <br/>- If you get stuck, you can buy hints to help you out.<br/><br/>Wanna have more games? We would love to hear from you! <br/>Find us on Facebook at https://www.facebook.com/BigBearEntertainmentGames <br/>Or on Twitter at https://twitter.com/Big_Bear_Entert <br/>For more information about Big Bear Entertainment, please visit http://www.bigbearentertainment.net", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-07-29T16:20:45", "background_image": "https://media.rawg.io/media/screenshots/83c/83c07ed1244ff2f86a9186bf3b8f55ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Bear Entertainment"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Bear Entertainment"], "esrb_rating": "Everyone 10+"}