{"id": 276882, "slug": "haunted-hotel-eternity-a-mystery-hidden-object-gam", "name": "Haunted Hotel: Eternity - A Mystery Hidden Object Game (Full)", "name_original": "Haunted Hotel: Eternity - A Mystery Hidden Object Game (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>You thought it would be an easy assignment to protect a wealthy philanthropist and collect a nice paycheck. Who would want to harm an innocent, bumbling professor anyway? But when a mysterious sniper takes aim and the bullets start flying, you’re forced to take refuge in the abandoned Eternity Hotel. Once inside, you realize that you may never be allowed to leave!<br/><br/>• WHO WOULD WANT TO KILL KEVIN REYNOLDS?<br/>Does this have anything to do with the secret medical treatments he helped develop? And what happened to Tobias, Professor Reynolds’ security officer? His fate may hold the key to your very survival!<br/><br/>• CAN YOU OUTWIT THE MASKED MASTERMIND?<br/>Search through dark and terrifying hidden object scenes to free yourself from the clutches of a madman.<br/> <br/>• FIND YOUR WAY OUT OF THE HAUNTED HOTEL<br/>Put your detective skills to the ultimate test with sinister puzzles and hair-raising mini-games. <br/><br/>• UNLOCK THE SECRET OF THE ETERNITY PROJECT IN THE BONUS GAME<br/>Discover the hidden origin of Professor Reynolds’ creation and enjoy additional Collector’s Edition exclusives including collectibles, achievements, and more!<br/><br/>*This game is best experienced on iPhone 4s/iPod Touch 5th gen and up.* <br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-02-07", "tba": false, "updated": "2019-10-22T14:23:34", "background_image": "https://media.rawg.io/media/screenshots/56d/56d68011acdf24a4e0dbd579eb30f1e8_6P7wCk3.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}