{"id": 2768, "slug": "monopoly-game", "name": "MONOPOLY Game", "name_original": "MONOPOLY Game", "description": "**YOU VOTED &amp;amp; THE CAT’S OUT OF THE BAG** Thanks to the votes from YOU and thousands of loyal MONOPOLY Facebook fans from 185 different countries, the CAT mover is now available to play with in this latest update as well as in the classic board game version of MONOPOLY! <br/><br/>BUY, SELL &amp;amp; TRADE FAMOUS PROPERTIES <br/>From Marvin Gardens to Water Works to Park Place, own and manage the famous holdings of the MONOPOLY board.<br/><br/>EMPLOY HANDS ON MANAGEMENT<br/>Shake your device to “roll” the 3D dice. Tap the screen to manage your properties. Building hotels or taking a “Chance” is easy and intuitive.   <br/><br/>CHOOSE YOUR LEVEL AND LOOK <br/>Play through 3 levels of difficulty and save games in progress. Also customize the number of players, the “game rules,” and even the game environment.<br/><br/>FEELING MORE COMPETITIVE?<br/>Challenge up to 3 friends via local WiFi and Pass ‘N Play Multiplayer, and up to 2 friends with Bluetooth Multiplayer. <br/><br/>PLAY WITH OTHER iOS FRIENDS <br/>You can even play multiplayer games with friends who have MONOPOLY for iPad (just note that you’ll be playing the iPhone/iPod touch version).<br/><br/>So buy Boardwalk! Go directly to jail! Are you ready? It’s “GO” time!<br/><br/><br/>Requires acceptance of EA’s Privacy &amp;amp; Cookie Policy and User Agreement.<br/>User Agreement: terms.ea.com<br/>Visit https://help.ea.com/ for assistance or inquiries.EA may retire online features and services after 30 days’ notice posted on www.ea.com/1/service-updates.Important Consumer Information.  This app: Contains direct links to the Internet; Collects data through third party analytics technology (see Privacy &amp;amp; Cookie Policy for details).", "metacritic": null, "released": "2009-11-20", "tba": false, "updated": "2019-10-22T14:28:11", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ff733388067670ef5f335746173b078.jpg", "website": "http://www.eamobile.com/iphone-games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Electronic Arts"], "genres": ["Board Games", "Family"], "publishers": ["Electronic Arts"], "esrb_rating": "Everyone 10+"}