{"id": 276921, "slug": "aeroplanes", "name": "Aeroplanes", "name_original": "Aeroplanes", "description": "Get your wings and fly to victory in this fun game of strategy. <br/><br/>Command your small army of 3 war planes in fights against your friends via GameCenter or against \"Frank\", the smart brain we put inside your device for single player mode. <br/><br/>They say \"lose sight, lose fight\"! Not in this case. Games are turn based and progress is always saved. You can face many enemies at once in multiple online games like a brave soldier would. <br/><br/>Two types of planes are waiting on the runway. Choose between small angry planes or big powerful ones. <br/><br/><br/><br/>What else is there: <br/><br/>- an artificial intelligence for single player missions that strikes with no mercy, never cheats and never takes prisoners (we call him \"Frank\". General Frank). <br/><br/>Frank masters two difficulty levels, try to beat him on Hard mode if you dare. <br/><br/>- leaderboards to compare your skills with other great pilots. <br/><br/>- medals and achievements for war heroes. Are you good enough to become “Skymaster”? <br/><br/>- spread the news of legendary victories on Facebook and Twitter. <br/><br/>- to mark your place in history, the scores against every enemy are recorded and remembered. <br/><br/>- use the latest communication technologies to command your squadron on iPhone or iPad. <br/><br/>- lost a fight? The war is long. Review ended battles and rethink strategies. <br/><br/><br/>Pretty cool, huh? <br/><br/><br/>So pilot, start your engine, climb the winds, <br/><br/>touch the sky and remember the wise words of The Greatest: <br/><br/>\"The man who has no imagination has no wings\" - Muhammad Ali", "metacritic": null, "released": "2013-08-11", "tba": false, "updated": "2019-10-22T14:35:29", "background_image": "https://media.rawg.io/media/screenshots/d31/d31898b7c31814b6c6aa38a8eaa235ea_jXBK6IZ.jpg", "website": "http://www.victorcampeanu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Victor Campeanu"], "genres": ["Board Games", "Puzzle"], "publishers": ["Victor Campeanu"], "esrb_rating": null}