{"id": 276930, "slug": "gearald", "name": "Gearald", "name_original": "Gearald", "description": "Help Gearald the loveable robot to find a way through crazy levels and tricky mazes! Gearald is a first generation robot, simply designed to walk straight forward. You can program him by placing triggers and teleporters and by combining colors to get to the goal.<br/><br/>In every level, you get various buttons and fields. Place them cleverly, observe the environment and see if your plan works and Gearald makes his way to the goal. Also, make sure not to use too many switches to get the full score.<br/><br/>At first, you'll work with direction-altering fields. As soon as Gearald hits one of those, he'll change direction. During the course of the game, you'll get more and more fields / triggers:<br/><br/>- Color Switch: Raises or lowers fields of that specific color.<br/>- Teleporter: Teleports Gearald to another teleporter in the level.<br/>- Time Switch: Raises or lowers linked fields once.<br/>- Bombs: Destroy passed boxes.<br/><br/>Level for level will become more challenging. A special feature allows you to peek at the optimal walking path. But use this feature wisely, because you only have limited use.<br/><br/>Plus, an in-app purchase removes ads and adds more levels!<br/><br/>Gearald is sure to provide long-lasting puzzle-fun and will make time fly by. Are you clever enough to solve all the levels?", "metacritic": null, "released": "2012-11-12", "tba": false, "updated": "2019-10-22T14:33:42", "background_image": "https://media.rawg.io/media/screenshots/198/198650ee6954a69123f661d1c33a27fb.jpg", "website": "http://lochmann-apps.de/gearald-245-en.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Benjamin Lochmann"], "genres": ["Adventure", "Puzzle"], "publishers": ["Benjamin Lochmann New Media"], "esrb_rating": "Everyone 10+"}