{"id": 276968, "slug": "vr-crazy-car-stunt-rider-extreme-fast-driving-3d", "name": "VR Crazy Car Stunt Rider: Extreme Fast Driving 3D", "name_original": "VR Crazy Car Stunt Rider: Extreme Fast Driving 3D", "description": "GOOD News for the VR Games fans and lover. this is a special gift for the VR games fan. Enjoy this game on winter and Christmas 2017. this is the best VR car stunt racing and simulator game of 2017. this is a first Virtual reality car stunt and racing on App store.<br/>which have lots fun and craze to entertain you.<br/>If you are a best racing stunt car driver!<br/>Get ready to become a real stunt driver by driving real asphalt stunt car across the great challenges of real adventure driving. Tight your seat belt and ride your stunt car in a racing beach stunt tracks to become a real stunt driver. Drive car on racing track, with huge jumps and avoid to upcoming obstacles.<br/>On this you have use the apple sensor glasses or Virtual reality glasses because this is an fantastic adventure game of VR. <br/>Win challenges on racing track with your airborne car across stunning 3D race environment.<br/>Driving stunt car is an awesome new stunt simulation game.Stunt car simulator gives you a real challenge of racing with dangerous and skill driving experience. Stunt drive car simulator is like an ultimate racing game. Real car stunts is an action packed extreme fun driving game. This game is available on android market, drive asphalt car and become the best real stunt driver.<br/><br/>Come and play the most exciting car stunt game. Drive your car through amazing beach stunt tracks and perform some exciting stunts.<br/>You've to drive save like a real stunt driver and prove yourself as a racing track driver. In this game different hurdles are included and different obstacles are placed on every level!<br/>Complete mission through all course in the specific time.<br/>Road is filled with sharp turns and epic loops, so drive carefully.Complete your stunt dream while performing in this game.In this enjoyable game you will race against multiple amazing cars. Choose your favorite sports car and complete all level; get three stars and collect money to unlock the other cars and motivating levels. Each level is more thriller than the previous level. Stunt car simulator gives you a real challenge of racing track with dangerous and skill driving experience. on this this airborne racer stunt game you have race against the world best car drivers. so show your fast speed driving skills and win the title of best monster sports car racer.<br/><br/>Enjoy the thrill of driving and huge jumping through spectacular car stunt ramps with this epic stunt game. Show your stunt skills and racing career on fast tracks and complete amazing levels of adrenaline driving skills. This is the best new adventure game also available on app store. Download this game on your mobile and tablets. Enjoy the stunt car simulator.<br/><br/>How to set things:<br/>- Play the demo on your Smartphone<br/>- Put the Smartphone in apple cardboard glasses housing<br/>- Align your phone in center <br/>- Check for blurriness... rotate lens for proper focus<br/>- Wear your apple glasses and enjoy the stunt car racing<br/><br/>Features:<br/>-\tMultiple camera Views<br/>-\tStunning and Beautiful 3D Beach environment<br/>-\tPerfect and easy game play and control<br/>-\tReal fast driving feeling<br/>-\tDifferent views and beach sports car stunt<br/>-\tBeautiful Roads and beach sea highways<br/>-\tRealistic Sounds", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-10-22T14:07:49", "background_image": "https://media.rawg.io/media/screenshots/59f/59fcb21495ca8f8cb4f62d9acc7af0a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["Simulation", "Racing"], "publishers": ["jolta technology"], "esrb_rating": "Everyone 10+"}