{"id": 277036, "slug": "pianinko-dzieciece-piosenki-i-plansze-z-nutkami", "name": "Pianinko - dziecięce piosenki i plansze z nutkami", "name_original": "Pianinko - dziecięce piosenki i plansze z nutkami", "description": "Pianinko to fantastyczna aplikacja przeznaczona dla dzieci które chciałyby rozpocząć swoją przygodę z grą na pianinie. Na pianinku można grać swoje własne melodie jak i piosenki z 20 dostępnych plansz z kolorowymi nutkami, dzięki którym nasze pociechy w łatwy sposób mogą nauczyć się grać najpopularniejsze dziecięce piosenki. Tryb „Grajek” to tryb w którym pianinko wygrywa piosenki, niezależnie od tego jaki klawisz został naciśnięty tak więc nie musimy się obawiać „kociej muzyki” ze strony naszych maluchów ;) Do dyspozycji jest również 5 różnych instrumentów  jakie można wypróbować, każdy na pewno znajdzie swój ulubiony.<br/><br/>Oto lista piosenek:<br/>- Wlazł kotek na płotek<br/>- Krakowiaczek<br/>- Kurki trzy<br/>- Kolorowe kredki<br/>- Witaminki<br/>- Panie Janie<br/>- Kotek Puszek<br/>- Stary niedźwiedź<br/>- Bajka iskierki<br/>- Biedroneczki są w kropeczki<br/>- Pluszowe niedźwiadki<br/>- Myj zęby<br/>- Jadą jadą misie<br/>- My jesteśmy krasnoludki<br/>- Mam chusteczkę haftowaną<br/>- Jestem sobie przedszkolaczek<br/>- Idzie niebo ciemną nocą<br/>- Ojciec Wirgiliusz<br/>- W górze tyle gwiazd<br/><br/>Instrumenty do dyspozycji:<br/>- pianino<br/>- gitara elektryczna<br/>- flet<br/>- saksofon<br/>- organy", "metacritic": null, "released": "2012-10-06", "tba": false, "updated": "2019-10-22T14:07:55", "background_image": "https://media.rawg.io/media/screenshots/92a/92a85679b954881cd60ff42c782ac7c7_QJryZ6r.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Internet Designs"], "genres": [], "publishers": ["Internet Designs"], "esrb_rating": null}