{"id": 2771, "slug": "cubemen", "name": "Cubemen", "name_original": "Cubemen", "description": "single player &amp; online multi-­player awesomeness! Get ready for some crazy Cubemen action!<br/>It’s the age old struggle between Good vs Bad, Blue vs Red, Little men vs Little men. Use your own<br/>little Cubemen to defend your base from other little Cubemen that are trying to run it over. It’s the<br/>usual story, but with many very interesting twists.<br/><br/>Play a purely defense game in various modes on a sweet selection of levels, or go into Skirmish<br/>mode and play a new type of TD game against either the computer or another human opponent.<br/>That’s right.. Two way REAL-­TIME TD against the computer or a real person!<br/>It’s TD like you’ve never seen or experienced before.Key Features:<ul><li>35 local Single-player Defense levels in ranging difficulties from beginner to insane<br/></li><li>25 local Real-time Multi-player Skirmish levels (play One v.s One against AI or another Human)<br/></li><li>9 local Real-time Multi-player 6 way online Mayhem levels<br/></li><li>No static towers... Your towers are actually Cubemen. Place them and move them around at will.<br/></li><li>Real 3D environments with Height, Cross overs, bridges and floating platforms.<br/></li><li>6 Single-player Defense modes to choose from with local and online leader boards<br/></li><li>Online Leader-boards and Statistic tracking<br/></li><li>41 Achievements to earn <br/></li><li>Clean, rich and simplistic visuals that keep the focus on the strategy</li></ul>", "metacritic": 74, "released": "2012-03-16", "tba": false, "updated": "2023-04-14T13:37:07", "background_image": "https://media.rawg.io/media/screenshots/dcb/dcbfbb01db2fe4bff4cc751e21c6bedc.jpeg", "website": "http://www.cubementd.com", "rating": 2.36, "rating_top": 1, "added_by_status": {"yet": 21, "owned": 547, "beaten": 3, "toplay": 2, "dropped": 12}, "playtime": 1, "achievements_count": 44, "ratings_count": 28, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 28, "platforms": ["PC", "iOS", "Linux", "macOS"], "developers": ["3 Sprockets"], "genres": ["Action", "Strategy", "Family", "Indie"], "publishers": ["3 Sprockets", "Seon Rozenblum"], "esrb_rating": null}