{"id": 277113, "slug": "minibeasts", "name": "MiniBeasts", "name_original": "MiniBeasts", "description": "<p><strong><em>Some history:</em></strong> <em>This project dates back to Jan/Feb 2012. It was my first attempt at programming a game, and I'm posting it for archival (and embarrassment) purposes</em><em>.</em></p>\n<p><em>Back in late 2011/ early 2012, I decided I wanted to try making something other than tabletop games. So, I sat down with a J</em><em>ava textbook, read less than half of it in a month, and said, \"Fuck it, I know how to code a game now!\" About another month later, I had made this prototype.</em></p>\n<p><em>Core concept inspired by </em>Digimon<em>, combat inspired by </em>Kongai<em>.</em><br/></p>\n<p>- - - - -</p>\n<p>You start with an egg. Hatch it, feed it, play with it, and watch it grow into several of many possibilities. At higher evolutions, you can train it, take it into fights, and care for this perfect monster of yours.</p>\n<p>Good luck discovering all of the possible variants!</p>\n<p>Notes:</p>\n<ul><li>This game is entirely text-based. The only \"graphics\" is the colored band around the window</li><li>Time in the game only progresses while the window is open. Your pet will be right where you left off if you need to close it and take a break :)</li><li>Time is sped up in this prototype, but there will still be a lot of waiting between later evolutions. It's a v-pet! Feel free to do other things and check back in every now and then</li><li>Coloration and patterning changes a little bit over a pet's lifetime, and will be partially inherited by the next egg. You can delete the \"current.pet\" file if you want to start over fresh. However, some colors can only be unlocked over generations, and there are \"special effects\" that can only be inherited from Ancients</li><li>(Consider \"force\"ing a pet to death if you'd like to keep your coloration but still reset to an egg)</li></ul>", "metacritic": null, "released": "2018-12-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/648/64837775b376da9659aa2b22138c33ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Stralor"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}