{"id": 277398, "slug": "space-justice-kacpervakri", "name": "Space Justice (kacperVakri)", "name_original": "Space Justice (kacperVakri)", "description": "<p>Class struggle never ends. High-born rulers do what they can to grow in power, while low-born subjects have their own opinions about who should be in control.</p>\n<p>You play as space station \"Royale\", trying to rule as one and only king. You will face many problems: peoples of the planets, who are always unhappy, enemy ships trying to break morale even further, or even traders who are just getting in your way everywhere you try to go. </p>\n<p>But! You have some tricks up your sleeves, to keep control over your subjects. You can give them love, you can give them peace, you can give them lots of money, and if those fail, you can also use war missiles and nukes. Desprate times, desprate methods.</p>\n<p>Depending on your actions, planets may sometimes make a festival for you... or start a revolt to overthrow your rule. </p>\n<p>Good luck your Majesty! You will definitely need it.</p>\n<p>_____________________________________</p>\n<p>How to play:</p>\n<p>1. Whole game is controlled with a space button<br/>2. You can do following actions: move, send a missile to decimate planet, send supplies to make people happy, or launch a nuke to kill ships. Actions are aviable randomly, and a few next are always displayed on the left side of screen.<br/>3. Your goal is to expand your kingdom- you do that by gaining reputation, shown on the right side of screen. You loose reputation for each angry planet, and gain for each happy planet. When your reputation drops to 0 you loose.<br/>4. Red ships are bad guys, shoot them before they corrupt your planet and make inhabitants angry.<br/>5. White ships are traders- they don't affect your planets, but if you shoot them you will loose reputation.<br/>6. Have a nice game! And remember- the more you tighten your grip, the more star systems will slip through your fingers. </p>", "metacritic": null, "released": "2018-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9d1/9d19c33d791a02d8befc8590d0236bc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kacperVakri"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}