{"id": 2774, "slug": "knock-knock", "name": "Knock-Knock", "name_original": "Knock-Knock", "description": "<p>Knock-Knock is a survival horror game developed by Russian studio Ice-Pick Lodge on Unity.</p>\n<p>The main difference from most horror games is that the fear factor itself is achieved by using the environment. Sounds, creepy texts, suspense - all of that affects the players.</p>\n<h3>Plot</h3>\n<p>The game&#39;s plot is full of unclear moments and allows for multiple interpretations. There is a house in a middle of the forest. It has been used as a lab and a home for three generations of its residents. The Last Resident, just like his ancestors, studies the world around him. One day, the Resident notices that his environment weirdly changes - sounds appear here and there, items get missing. The Resident wants to figure out what&#39;s going on.</p>\n<h3>Gameplay</h3>\n<p>The main objective of the game is to help the Resident survive in his house until dawn. This can be achieved by walking around the house and turning the light on in its rooms. Only if the player turns on the light in the room, it becomes possible to interact with the items placed inside that room. Such items are the clock, that can be used to speed up time, or hiding spots. </p>\n<p>Lighting is an indicator for the appearance of your enemies as it turns off when someone is close to the player. The gameplay is affected by the Resident&#39;s bad memory and eyesight. </p>\n<p>The time in the game is relative. It can pause, pass as usual, or go back. This depends on the player&#39;s actions.</p>", "metacritic": 57, "released": "2013-10-03", "tba": false, "updated": "2024-01-22T16:09:53", "background_image": "https://media.rawg.io/media/games/3f9/3f99d409124962fa6e125409254528c3.jpg", "website": "http://knock.ice-pick.com/", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 77, "owned": 904, "beaten": 121, "toplay": 36, "dropped": 78, "playing": 4}, "playtime": 3, "achievements_count": 66, "ratings_count": 192, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 195, "platforms": ["Xbox One", "PlayStation 4", "macOS", "PC", "Linux", "Nintendo Switch", "PS Vita", "Android", "iOS"], "developers": ["Ice-Pick Lodge"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ice-Pick Lodge"], "esrb_rating": "Teen"}