{"id": 27756, "slug": "pocket-card-jockey", "name": "Pocket Card Jockey", "name_original": "Pocket Card Jockey", "description": "<p>Stack cards like it&#39;s a race to the finish. And it is! In this fast-paced mash-up of solitaire and horse racing, you&#39;ll jockey your way to victory by clearing cards to energize your horse. You can even level up your noble steed through strategic positioning on the track. Can you master solitaire and horseback racing…at the same time?!</p>\n<p>After you get a dozen races under your belt, you can retire your horse—a sad moment for any jockey. However! You can relocate your horse to your very own farm and pair them with other retired horses to breed new ponies...that are completely adorable! Eventually these babies will pony up by maturing into horses that you can ride in competitions for prizes. You can then get items at Chirp&#39;s shop, such as puzzle pieces or temporary bonuses. After completing certain puzzles, your horse will gain even more stats when leveling up. That’s some next-level jockeying!</p>\n<p>Solitaire + Horses = one crazy-awesome gaming mash-up!</p>\n<p>Jettison your horse down the track in this fast-paced form of solitaire</p>\n<p>Level up your horses to enhance their stats</p>\n<p>Retire horses to the farm to breed ponies, win more races, and earn more prizes</p>", "metacritic": 83, "released": "2013-07-31", "tba": false, "updated": "2023-05-27T09:55:18", "background_image": "https://media.rawg.io/media/screenshots/f72/f72387a28b17e9589e094edfd428e713.jpg", "website": "", "rating": 4.17, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 4, "beaten": 5, "toplay": 3, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 6, "platforms": ["Nintendo 3DS", "iOS", "Android"], "developers": ["Game Freak"], "genres": ["Racing", "Casual", "Card", "Puzzle"], "publishers": ["Nintendo"], "esrb_rating": "Everyone 10+"}