{"id": 277663, "slug": "furious-sniper-shooter", "name": "Furious Sniper Shooter", "name_original": "Furious Sniper Shooter", "description": "Just aim and shoot enemies within the area. Enjoy to play Sniper Special Mission 3D which is the dynamic sniper missions action game. The game provides the environment to target the enemies within your scope. Hold your rifle and try to take the head shots of your enemies as you are the real sniper assassin. Shoot the enemies in your area a shooter and clear the area from such elements that disturb the peace of the land. As a shooter you have ammunition available to you in the form of sniper guns and sniper rifle.<br/>Sniper Special Mission 3D is the best of all the sniper games on the store because it offers the unique idea to kill enemies in your area and also it allows you to play under different embedded code names                    and you will be responsible of your area. Your basecamp is the area from which you belong to. Hence, as an expert sniper you have the best skills to target your enemies and not let them allow to entre in other area.<br/>Sniper Special Mission 3D is the ultimate sniper assassin game as it truly provides the sniper gamming environment. To win the missions your expertise and skills must not be lesser than the American sniper. Shoot the ammunition from the gun and wait until the sniper reloaded.<br/>How to Play <br/>Sniper Special Mission 3D is the game with nonstop fun and thrill. To challenge yourself as a sniper you are open to play the game in the following way.  <br/>\t•\tPress play button to select the mission.<br/>\t•\tPress start button and read the mission objective.<br/>\t•\tPress start button to shoot the enemies.<br/>\t•\tPress next button to start the next level.<br/>\t•\tPress menu to return to the main menu.<br/>\t•\tComplete all the missions according to the mission statement.<br/> Features <br/>Sniper Special Mission 3D has features that make it compatible with the games like sniper fury. The main features are as follows.<br/>\t•\tReal 3d Environment.<br/>\t•\tReal Sniper Missions.<br/>\t•\tAim and Shoot the Target.<br/>\t•\tMultiple Sniper Missions.<br/> Privacy Policy <br/>We neither collect sensitive user information for ourselves nor for our partners.", "metacritic": null, "released": "2017-05-05", "tba": false, "updated": "2019-10-22T14:31:12", "background_image": "https://media.rawg.io/media/screenshots/acd/acdd8d651e26f3739297a4e7aafeeae5_lpGT2Qd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atif Mumtaz"], "genres": ["Action", "Adventure"], "publishers": ["Atif Mumtaz"], "esrb_rating": "Mature"}