{"id": 2776, "slug": "razor-salvation", "name": "Razor: Salvation", "name_original": "Razor: Salvation", "description": "Defend your homeland. Save the Cheer leader. Save the world.<br/><br/>As commander of the dropship &amp;quot;Salvation&amp;quot;, you are tasked with rescuing Earth&amp;#39;s inhabitants and helping with the EDSF defence effort.<br/><br/>Razor Salvation is the first instalment in a series of games that will take the player along the story of the Xenos and why they have invaded our planet Earth.<br/><br/> <br/><br/>Features<br/><br/>DYNAMIC COVER-BASED AI -Enemies exhibit different strategies and duck in and out of cover.  Dynamic objects can be blasted around the level and the enemy will continue to find cover behind them!  Shoot the Xenos, protect the civilians! Or leave them alone and watch the infected eat them...<br/><br/>FIRST PERSON &amp;quot;BEACH HEAD&amp;quot; DEFENCE - Use the classic FPS weapons like grenade launcher, rocket launcher and railgun.  Access to awesome specials like the Redeemer!<br/><br/>IPAD 3 RETINA - Full 2048 x 1536 resolution real-time 3D graphics.<br/><br/>CONSOLE GRADE GRAPHICS - Specular bump mapped textures and full-screen pixel effects for all devices down to iPhone 3GS.<br/><br/>PLAYER CREATED FACTIONS - Create your own factions with friends and fight together to be the top performing Faction in the world!<br/><br/>FIGHT FOR YOUR REGION - Help your world region to the top of the rankings!<br/><br/>UNIQUE LEADERBOARD TITLES - Be the best shooter or savior and show off with the ability to be at the top!<br/><br/>IOS FEATURES - GameCenter leaderboards and full iCloud sync.<br/><br/><br/>Follow us for the latest info and game news!<br/><br/>• http://crescentmoongames.com/other-games/<br/>• http://facebook.com/crescentmoongames<br/>• http://twitter.com/cm_games", "metacritic": null, "released": "2012-05-29", "tba": false, "updated": "2019-07-30T01:28:10", "background_image": "https://media.rawg.io/media/screenshots/edf/edf7070c140fe0ded55ce1b1712f1370.jpg", "website": "http://crescentmoongames.com/other-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Crescent Moon Games", "Blowfish Studios"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Crescent Moon Games"], "esrb_rating": "Teen"}