{"id": 277662, "slug": "amazing-dog-simulator-play-super-dog-life-role", "name": "Amazing Dog Simulator: Play super dog life role", "name_original": "Amazing Dog Simulator: Play super dog life role", "description": "Winter holidays are over! but not the love of dogs whether they are pet or stray dogs.<br/>Who does not want to be in life of such cute dogs, live a day of dog life, how do they live in this wonderful life. Play as dog, battle the fears and live troubles of dog, guard your areas. embody the wonderful dogs, play around, hunt around, fight for your space and walk around in this wonderful 3d space. Level up and unlock other breeds and levels to play.<br/><br/>Amazing Dog Features:<br/><br/>Full Offline Game<br/>- Play full offline game whenever you want, no internet required.<br/>- Fight and explore the areas in 3d<br/>- Enter in the mind and body of dog<br/><br/><br/>Simulated Dog Life Game Play<br/>- Simulation provided you every aspect of dog life, play around and find things<br/>- Different locations to chose and wonder as stray dog<br/><br/>Challenging Levels<br/>- Play the dog sim level by level<br/>- you get different missions in each level<br/>- level up to unlock more dog breeds<br/><br/>Free World Game Play<br/>- Play as the amazing stray dog around<br/>- challenge whatever you find interesting<br/>- game play guides you whatever you can as dog<br/><br/>Dog Breeds<br/>- Different Dog breeds are provide to choose from<br/>- Chose the breed you love and want to play as<br/>- See the stats of each dog and learn", "metacritic": null, "released": "2017-02-02", "tba": false, "updated": "2019-10-22T14:31:12", "background_image": "https://media.rawg.io/media/screenshots/701/701563427d5a337f348a36cd1aa489ba_QC0EkJ3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atif Mumtaz"], "genres": ["Simulation", "Racing"], "publishers": ["Atif Mumtaz"], "esrb_rating": "Everyone 10+"}