{"id": 277668, "slug": "lets-play-snooker-3d-free", "name": "Lets Play Snooker 3D Free", "name_original": "Lets Play Snooker 3D Free", "description": "Let's Play Snooker in full 3d environment with 3d physics. One of the most realistic and playable snooker games you have ever played. If you play snooker at home or in club with your friends, then you will love this game for sure.<br/>Game Play Modes:<br/>This unique game offers two game play modes:<br/>Practice Mode: in which you can learn and play game as a Single player, play complete game single handly, <br/>Two Player or Multi-Player Mode: You can play snooker against your friends or any other at same time as you play snooker game in the club.<br/>Flag Selection:<br/>When entering names player also have to select flag of there favourite countries.<br/>The game includes flags of top ranked 10 most playing snooker nations of 2014<br/>1- Australia<br/>2- Germany<br/>3- England/Great Britain<br/>4- China<br/>5- Brazil<br/>6- Wales<br/>7- Scotland<br/>8- Belgium<br/>9- Ireland<br/>10- Thailand<br/>Game Play:<br/>- Swipe screen up &amp; down to adjust your view on table before playing shot<br/>- Set ball movement right, left, top &amp; bottom for spinning ball accordingly<br/>- Play with your friend on same device<br/>- When player 1 completes his shots then player 2 turns comes (There would be a label calling the next turn)<br/>- Use chalk on stick for playing proper shots<br/>- Player can give replay shot to his/her opponent on fouls<br/>- Set cue ball in D when potted <br/>- Full Snooker rules apply<br/>Game Features:<br/>- Play live with your friends<br/>- Full High quality 3D environments<br/>- Full 3D physics<br/>- Flags of worlds top most ranked snooker playing nations<br/>- Practice Mode: Play to learn with proper snooker rules<br/>- Multi-Player Mode: Play snooker against your friends or any other on same device<br/>- 2 Camera modes: Ariel &amp; 3D mode<br/>Feels like playing Real Snooker in a room. Immature players can learn &amp; play for fun, but experts can challenge there friends to play game professionally. <br/>Let's Play Snooker 3D, become a master, and become Snooker Champion.<br/><br/>RationalVerx Gaming Studios<br/>------------------------------<br/>Web: www.rationalverx.com<br/>facebook.com/rationalverx<br/>twitter.com/rationalverx<br/>Note: This free game is supported by advertisement within the App only as per Google Policy.", "metacritic": null, "released": "2015-05-07", "tba": false, "updated": "2019-10-22T14:31:13", "background_image": "https://media.rawg.io/media/screenshots/410/410d9832e25bb4d515290a6bc2a4840c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atif Mumtaz"], "genres": ["Action", "Adventure"], "publishers": ["Atif Mumtaz"], "esrb_rating": "Everyone 10+"}