{"id": 277644, "slug": "american-truck-driving-3d-full", "name": "American Truck Driving 3D Full", "name_original": "American Truck Driving 3D Full", "description": "Drive a real truck in American Truck Driving 3D!<br/><br/>Become an American truck driver. Choose cargo and drive it. Transport cargo to city warehouses. Upgrade your truck for better driving. Fix and refuel an American truck at service stations, driver. Avoid driving cargo above speed limit, follow driving rules for the transport. Spend money wisely and enjoy day and night driving.<br/><br/>Features of American Truck Driving 3D:<br/><br/>- Transport missions<br/>- Different cargo<br/>- Real USA trucks<br/>- Game economy simulator<br/>- Day and night transport driving<br/>- Truck service stations<br/>- Gas stations on the road<br/><br/>American Truck Driving 3D is for real drivers. Good transport controls help your be a driver in the simulator. Continue cargo driving even at night. Choose missions for your big USA truck. Spend your evening on the road, driver!<br/><br/>Be accurate American truck driver. Keep your transport in good condition. Feel what is American road in American Truck Driving 3D. Upgrade the transport, prepare it for road, the simulator is challenging.<br/><br/>Use a simulator's map and a driving arrow to check the road. Pay driver's attention to simulator's economy - spend money on upgrades to improve transport cargo driving. Explore American road in the simulator, earn money for cargo truck driving. Be a truck driver with the simulator - try long-distance driving, transport cargo, visit American cities, refuel the transport on the road.<br/><br/>Feel like an American truck driver with our driver simulator. Transport cargo to different cities. Choose driver missions. Repair the truck if necessary. Transport all cargo and earn money for driving. Upgrade to transport faster and enjoy the driver simulator. Visit real American cities. Try easy truck controls we made in the simulator.<br/><br/>Road is challenging, driver! Transport cargo in truck simulator to many American cities. Try truck driving and write us. Earn money for cargo delivery. Follow driver regulations, transport accurately. Buy a new USA truck if you don't like your transport in the driver simulator.<br/><br/>Try all transport missions in American Truck Driving 3D and enjoy being a driver!", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-10-22T14:31:09", "background_image": "https://media.rawg.io/media/screenshots/5f3/5f3b763e70c23331b4abdf2af7296453.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": "Everyone 10+"}