{"id": 277941, "slug": "jian-dao-shi-tou-bu", "name": "剪刀石头布", "name_original": "剪刀石头布", "description": "Game introduction of Rock, Paper and Scissors.<br/>\r\nTeam destroy tower mode, Personal combat mode<br/>\r\nRule: The simplest rule is that the attributes are mutual restriction.<br/>\r\nPaper can crumb rock<br/>\r\nRock can beat out scissors<br/>\r\nScissors can cut paper in half<br/>\r\nPersonal combat mode：You will win after kill everybody.<br/>\r\nTeam mode：You will win after destroy the enemy's tower.<br/>\r\nWSAD key - - - Control action<br/>\r\nSpace key - - - Jump<br/>\r\nShift key - - - Sprint<br/>\r\nNumber 123 key - Use props<br/>\r\nTab key- Realtime achievement<br/>\r\nDestroy tower mode: The two sides will randomly generate a tower after opening, respectively as follows: scissors tower, rock tower, paper tower.<br/>\r\nIf your team generates scissors tower: the enemy rock can come to destory tower.<br/>\r\nIf your team generates rock tower: the enemy paper can come to destory tower.<br/>\r\nIf your team generates paper tower: the enemy scissors can come to destory tower.<br/>\r\nIn order to give players a longer, bigger and more lasting experience, We set up that a tower will change into another one randomly after loosing half of the blood by attack,in order to the players can experience longer, bigger and more durable game.<br/>\r\nWe added a lot of props in order to the players can experience longer, bigger and more durable game.<br/>\r\nRandom door: Open it will help you transfer to random places on the map.<br/>\r\nUniversal glue: Throw it on the ground, and then people who step on it will be stuck.<br/>\r\nBomb: Can injure the enemy, the closer the bomb, the more blood loss.<br/>\r\nFlying broom: Can fly at High Speed<br/>\r\nProtective shield: Can defend all attacks<br/>\r\nTransparent cloak: Can be invisible<br/>\r\nChange card: Can change to other roles randomly<br/>\r\nIt's not a game of luck decide victory or defeat, it's more like a game of psychological strategy. We will update more interesting functions and maps constanly, please look forward to it.", "metacritic": null, "released": "2018-12-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ce/5cefa279c349c4b2bcb48a9f24b204a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["剪刀石头布"], "genres": ["Action", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["剪刀石头布"], "esrb_rating": null}