{"id": 277995, "slug": "wu-yi-shi-navigation-koishi-navigation", "name": "无意识Navigation ~ Koishi Navigation", "name_original": "无意识Navigation ~ Koishi Navigation", "description": "\"Koishi Navigation\" is a table pet to develop an adventure RPG<br/>Players will play the ancient love, travel and adventure on the earth in the hundreds of years before the establishment of Fantasy Township.<br/>#————————————————————————————————————————————#<br/>The game development is progressing slowly, and the content and functions will be gradually improved. Currently, it is <strong>early access</strong> version;<br/>Currently only open stand-alone functions will be open in the future <strong> online version</strong>;<br/>The current pricing is for stand-alone pricing, which will result in a <strong> large price increase </strong> after subsequent online connection.<br/>#————————————————————————————————————————————#<br/>【Great adventure of heartbeat？】Waking up in the cabin, saying good morning to the sister who depended on her, she went out like a soul and ran to the distance where no one knew the end point.<br/>She is <strong>Koishi Komeiji</strong>.<br/>This is the world of Fantasy Town 100 years ago. Everything is so prosperous.<br/>The Eastern world is quiet, solemn and majestic, while the western continent seems to be planning a feast.<br/>But the excitement was theirs, and she had nothing - not even her own thoughts.<br/>Her footsteps were continuous, and the road continued to stretch under her feet.<br/>Discover new things, meet new partners, and meet incredible challenges.<br/>Even in this world, will she change the course of history? Or build a paradise where humans and monsters live peacefully together?【This is a table pet !】The essence of this book is table pet. Enjoy flirting with Koishi on the table!<br/>Attention should be paid to the property bar on the right side at all times. Don't let love die of hunger, thirst and overwork. The empirical value of death punishes a lot.【It may be an open world adventure】Seamless but stitched large map, in-place explored open map mode,<br/>But how can Koishi stay in only one place to be honest! You can't always control where you are going.<br/>Random exploration, random props, enemy with opportunity and - Emmm, the battle can not be so random, will die!<br/>It is even possible to randomly enter the gap and find that the eggs of the New World and Columbus are also uncertain.【Maybe a RPG】There are all kinds of NPCs and monsters on the map, everything can be investigated, everything can be negotiated, everything can be attacked - ah, don't hammer the well!<br/>Pay attention to your abilities when negotiating with the NPC, because it is still the above sentence - you can't completely control the relationship.<br/>If the radio waves are not right, she may at any time put the enemy's first level in the bag at the negotiating table.<br/>And, remember to go home every day to eat your sister’s meal~~【FQ&amp;A】<strong>Q.What is the operation of the game?</strong><br/>A.On the right is the game function bar. What function you want to use is just that, but the current half of the buttons are not yet installed.<br/>The Window menu bar will display the program small icon, the right button can call out the menu, you can hide the love, you want to restore after hiding, please double click this small icon.<br/><br/><strong>Q.Is there only one game map?</strong><br/>A.There are buildings on the big map, and the building enters by pressing the button of the shape of the house.<br/>There is only one big map, there are many buildings/mazes, all are projects to be perfected~<br/><br/><strong>Q.How can I gain exp?</strong><br/>A.There is no exp from defeating monster. The dropped Power-point can be used to gain skills. The exp of Koishi is increased by hanging up. <br/><br/><strong>Q.Does the game have a main story?</strong><br/>A.Yes。", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:58", "background_image": "https://media.rawg.io/media/screenshots/b9d/b9d2f736bd042a1a7f9ad68ca5570f71.jpg", "website": "http://www.zri.moe", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 359, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zero Research Institute"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Zero Research Institute"], "esrb_rating": null}