{"id": 277944, "slug": "steamcraft", "name": "Steamcraft", "name_original": "Steamcraft", "description": "Let your creativity run wild and build the best combat vehicle for no-holds-barred battles. SteamCraft features a massive selection of components and an impressive arsenal for crushing your foes on land and in air.<br/> <br/> <strong>●</strong>Craft the craziest combat vehicle – the only limit is your imagination!<br/> <strong>●</strong>Show off your skills and blast enemy vehicles to smithereens!<br/> <br/>Create one-of-a-kind combat vehicles unlike anything the world has ever seen, equip them with an entire arsenal, get behind the wheel, and duke it out with other players in massively magnificent bloodbaths. Annihilate your enemies on land and in the air while honing your skills. Win battles and use the new weapons and armor you unlock to upgrade your creations. Make your armor tougher and your weapons deadlier. Team up with friends and deploy side by side, capturing bases and destroying enemies.<br/> <br/> Features: ■ Advanced construction system that allows you to create a truly unique combat machine.<br/> Fight on land and in the air!<br/> ■ Over <strong>600</strong> construction components and <strong>40</strong> weapons!<br/> ■ Realistic damage model: destroyed sections fly off of your vehicle according to the laws of physics!<br/> ■ Multiple game modes, including deathmatch, team deathmatch, and capture the flag.<br/> ■ Exciting special effects, dynamic gameplay – that’s SteamCraft.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:17", "background_image": "https://media.rawg.io/media/screenshots/eb8/eb80530c6e67cd2623ace444a7e05313.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 666, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Last Level", "SOFF Games"], "genres": ["Action", "Racing", "Massively Multiplayer"], "publishers": ["Last Level"], "esrb_rating": null}