{"id": 278149, "slug": "biathlon-mania", "name": "Biathlon Mania", "name_original": "Biathlon Mania", "description": "Ski, shoot and win!<br/>More than 3,000,000 players from all over the world have already experienced the exciting life of a professional biathlete. Do you have what it takes to ski fast and then shoot down all the targets? It is time you joined the other players in the only game of its kind. In Biathlon Mania you can even compete against real biathletes from the World Cup circuit.<br/><br/><br/>Biathlon Mania is an action sports game with RPG elements and the most successful and most played biathlon game of all time. You can control, improve and train your biathlete as you see fit. You decide everything that goes on - improve your attributes, construct new facilities, learn new skills, build up your club, defeat opponents from all across the world, win tournaments and be at the top of the world. Whether you win or become an also-ran is purely down to your skill. Show everyone that you’ve got it! Biathlon Mania is easy to learn, but difficult to leave.<br/><br/><br/>- Play against thousands of players from all over the world<br/>- Master the combination of cross-country skiing and shooting<br/>- Challenge real biathletes<br/>- Create, level-up and customize your biathlon hero<br/>- Defeat opponents, climb to the top of the rankings and earn achievements<br/>- Test your skills in tournaments, daily league and the world cup<br/>- Join with your friends, become a member of a club and fight for the title in club championships<br/>- Improve your skills on various tracks, use the speed, endurance and shooting attributes to your advantage<br/>- Gain sponsors, improve your equipment and build facilities such as fitness center, shooting range or many more<br/>- Have fun with a wide array of minigames, fulfill daily tasks and earn rewards<br/>- Enjoy the RPG elements<br/><br/><br/>So what are you still waiting for? Experience the life of a biathlete in the exciting multiplayer world. Choose one of the 31 available languages and play for free anywhere and whenever you like!<br/><br/><br/>- - - - - - - - - - - - <br/>Support: support@biathlonmania.com<br/>Privacy Policy: http://s1.biathlonmania.com/privacy-policy <br/>EULA: http://s1.biathlonmania.com/license <br/>Website: http://s1.biathlonmania.com/ <br/><br/><br/>The user expresses his/her unqualified assent to the Terms of Service of the game, Privacy Policy and rules of the game by registering in the game or installing the game on his/her device, acknowledges that the Terms of Service and Privacy Policy are only available in English and Slovak languages, agrees with this fact and understands their content. The user also agrees that the game will start being provided before the expiration of the period for rescission of the contract and declares that he/she was duly informed of this fact in terms of art. 7, section 1 of the Terms of Service. The rules can be found on the pages of the individual game servers and they may vary from server to server.<br/><br/><br/>By purchasing premium currency or premium services provided by the operator for real money, the user confirms that he/she agrees with these Terms of Service, that he/she is over 16 years old, that he/she is qualified and authorized to make the payment and that he/she makes it willingly and without pressure and is aware of the fact that the game is provided for an indefinite period of time in accordance with the Terms of Service.", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2023-03-22T02:00:40", "background_image": "https://media.rawg.io/media/screenshots/422/4226b3bfc7a7a876aee26fb22ae21a79.jpg", "website": "http://s1.biathlonmania.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["POWERPLAY MANAGER"], "genres": ["Simulation", "Sports"], "publishers": ["POWERPLAY MANAGER"], "esrb_rating": null}