{"id": 278123, "slug": "backgammon-play-live-online", "name": "Backgammon Play Live Online", "name_original": "Backgammon Play Live Online", "description": "The best free multiplayer Backgammon game. Join a game instantly or play with friends now!<br/><br/>Play live backgammon with friends and players around the world with PlayGem Backgammon for iOS. Download the FREE app from iTunes and enjoy the best version of this game on the Internet.<br/><br/>PlayGem Backgammon offers FREE play with people you know, your Facebook friends, or millions of players worldwide. This leading social strategy game attracts hundreds of thousands of people who seek to challenge themselves each day!<br/><br/>We’ve taken one of the oldest board games and made it even more fun! Download the app today to learn the rules of backgammon, perfect your strategy, and have a great time with a super cool mobile app for iPhone and iPad.<br/><br/>Online Challenges and Tournaments<br/><br/>Backgammon is a game of skill and luck. It’s a challenge you can now engage in with millions of players from all over the world, so set up PlayGem Backgammon on your iOS cell phone or mobile device and start competing! Take part in matches and tournaments and let our unique matching system quickly find you another player to go up against. Or, challenge one of your real-life or Facebook friends!<br/><br/>Fun with Worthy Opponents<br/><br/>Have a good time playing online matches and tournaments while improving your strategy against worthy opponents. The app finds you an international player to challenge, so you both can master the rules and become increasingly better. <br/><br/>Climb the Leader Board<br/><br/>Gain experience (XP), level up, unlock achievements, and climb the Leaders Board to get to international backgammon fame! Invite your friends to join in the excitement, too, and find out who truly is the best player.<br/><br/>Beautiful and Unique Boards<br/><br/>As you’re playing PlayGem Backgammon, you can work to unlock seven beautiful and exotic boards. Each has its own special music and themes!<br/><br/>Features<br/><br/>Awesome additional features that you’ll find in PlayGem Backgammon include:<br/><br/>• Live contests that are quick, simple, and smooth<br/>• Multi-platform challenges across Facebook and iOS cell phones and mobile devices<br/>• 100 percent certified dice<br/>• Best customer support<br/>• Free and unlimited gameplay!<br/><br/>By Any Name, It’s Still The Same<br/><br/>Players from around the world love backgammon, but they sometimes call it by different names. It doesn’t matter if you refer to it as Tavla, Dado, Tavli, Tapa, Trictrac, Tric Trac, Tabula, Acey Deucey, Narde, Shesh Besh, Nackgammon, Plakoto, Gul Bara, Takhteh, or Moultezim—they all mean the same thing, and they refer to one of the best games on the planet!<br/><br/>Start playing with your friends or enjoy a fun match with a new international friend. If you don’t know how the rules, it’s okay! You’ll be able to learn quickly and take part in cool online challenges.<br/><br/>Grab your dice and board, and download PlayGem Backgammon today!<br/><br/>Players from all over the world love their backgammon board and dice, but can call this great board  game by different names. Some call it: Tavla, Tavli, Tapa, Trictrac, Tric Trac, Tabula, Acey Deucey, Narde, Shesh Besh, Nackgammon, Plakoto, Turkish Backgammon, Greek Backgammon, Russian Backgammon, Roman Backgammon, Gul Bara, Hyper Backgammon, Takhteh or Moultezim, ששבש,שש בש – they all mean the same fun game, and we LOVE it!<br/><br/>Even if you misspelled it and wrote back gammon, nackgammon, nack gamon, backgamon, bacgamon,  bakgamon or anything else – we don’t mind misspellers, you’re invited to an exciting free online backgammon game.", "metacritic": null, "released": "2014-04-23", "tba": false, "updated": "2019-10-22T14:31:18", "background_image": "https://media.rawg.io/media/screenshots/aec/aec7b213a64d6816adb742114e053acf_jZnPRlX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Playgem Technologies"], "genres": ["Board Games"], "publishers": ["Playgem technologies"], "esrb_rating": null}