{"id": 278204, "slug": "battle-fleet", "name": "Battle Fleet", "name_original": "Battle Fleet", "description": "BATTLE FLEET 2 is now available for iPad and OS X<br/><br/>\"Challenging and exciting\" - AppAdvice.com<br/>\"Dreadfleet meets Axis &amp; Allies\" - BoardGameGeek.com<br/><br/>BATTLE FLEET is the ultimate Mac naval strategy game. You are in command of a fleet of US or Japanese ships in the Pacific theater of war during World War 2. <br/><br/>The game features innovative turn based gameplay, allowing you to move your fleet into position, aim individual turrets on each ship and sink the enemy fleet.<br/><br/>Features:<br/>Single Player Battle Mode - Face off against an AI opponent.<br/><br/>US Campaign - Play through unique and challenging missions as the Captain of the USS Knight.<br/><br/>Japanese Campaign - Take command for the Empire of Japan and experience the other side of the story.<br/><br/>Hotseat Multiplayer - Play against another Human opponent on the same Mac. Pick your fleets, outfit your ships and sink your opponent.<br/><br/>Control up to 3 ships at once, including Frigates, Destroyers, Cruisers, and more. <br/><br/>Hunt and Sink a powerful Battleship in the US Campaign. Launch waves of aircraft from your carriers.<br/><br/>Arm your ships with Torpedoes, Spread Turrets and massive 14\" High Explosive guns!<br/><br/>Access Strategic Command support such as Airstrikes, Sabotage, and Naval Minefields.<br/><br/>Control the aim and power of each of your ship's guns.<br/><br/>Maneuver your ships to maximize their firepower with a full broadside attack.<br/><br/>Check out the full trailer at: <br/>http://www.BattleFleetGame.com/<br/><br/>Also available for the iPad!", "metacritic": null, "released": "2012-05-29", "tba": false, "updated": "2019-10-22T14:31:22", "background_image": "https://media.rawg.io/media/screenshots/2bc/2bc42844f0b6ed31ca6cdf4171507247.jpg", "website": "http://www.battlefleetgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Mythical City Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Mythical City Games"], "esrb_rating": null}