{"id": 278237, "slug": "tripeaks-free", "name": "TriPeaks Free", "name_original": "TriPeaks Free", "description": "TriPeaks Solitaire (some of you may know it as TriTowers, MagicTowers or ThreeTowers), offers fans of the original Klondike format something different, a new task in fresh surroundings. TriPeaks, however, is not a new game; in fact, it was created way back in 1989 by Robert Hogue - who, incidentally, still develops and updates of the game. <br/><br/>LAYOUT <br/>Like all of the spin-off versions of solitaire, Tri Peaks remains respectful to the original game and while the gameplay is different, the end goal is the same. Where the Klondike version of solitaire relies a lot on luck, Tri Peaks requires a lot more thought and skill to complete. <br/><br/>As the name suggests, Tri Peaks involves three peaks, these are formed in the shape of pyramids. 18 cards are dealt in overlapping and face-down to make three pyramids. Overlapping these pyramids, a further ten cards are dealt face-up with the remaining cards used to make up a stock pile, one of which is lies face-up, creating the waste pile. <br/><br/>HOW TO PLAY <br/>As the player, your aim is to move all cards from the layout to the waste pile. Demolish the peaks and win the game. <br/><br/>No game of Solitaire, however, is ever as straight-forward as simply moving cards from one pile to another. Cards that are placed on the waste pile must be lower or higher by one number than the card already on the pile. For example, the 5 of Diamonds, 5 of Clubs or 7 of Hearts can be built on the 6 of Spades. <br/><br/>If building has stalled it is possible to use cards from the stock pile to kick-start the game. Aces building on Kings and Kings building on Aces will restart a sequence. A game is over either when the peaks have been demolished (meaning you win), or when building can no longer occur and is impossible to complete. <br/><br/>BONUSES <br/>There are a number of bonuses awarded in Tri Peaks. Extra points are given for every peak demolished and for every card remaining on the table when the game is won.", "metacritic": null, "released": "2014-11-03", "tba": false, "updated": "2019-10-22T13:55:23", "background_image": "https://media.rawg.io/media/screenshots/450/4506ed5d6826fde85cbdca1d0c71250b.jpg", "website": "http://www.pawpawsoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pawpaw"], "genres": ["Card", "Puzzle"], "publishers": ["Beijing Pawpaw Internet"], "esrb_rating": null}