{"id": 278404, "slug": "a-viagem-inesquecivel", "name": "A Viagem Inesquecível", "name_original": "A Viagem Inesquecível", "description": "<p><strong>THIS GAME IS ONLY CURRENTLY ABALIABLE IN BRAZILIAN PORTUGUESE. THERE ARE PLANS TO MAKE AN ENGLISH TRANSLATION OF THIS GAME, AVALIABLE BEFORE MID 2019 </strong></p>\n<p>     Ah, férias. Você, sua mãe e sua irmã embarcam em uma viagem que promete ser inesquecível. De fato esta será, porém não da maneira que imagina....</p>\n<p>     Após sofrerem um grave acidente de avião e terem a própria mãe desaparecida, você, e sua irmã, antes rivais, agora terão que unir forças e interromper brigas internas para poder reagir perante a uma ameaça demoníaca que tem alguma relação com o desaparecimento, procurando exterminá-la. Somente assim poderão ter a tão sonhada vida em família de volta! </p>\n\n<p>    <em> Neste jogo, terás as seguintes funções:</em></p>\n<p>       <em>- Customização de personagem:</em> haverá um  total de 36 possíveis aparências possíveis para o personagem principal. Poderá também determinar o gênero deste (masculino ou feminino), além de denominá-lo por conta própria.</p>\n<p>     <em>  - Acesso a conquistas: </em>Serão 30 conquistas disponíveis para serem alcançadas durante a jogatina. Inclusive, essas conquistas não servem apenas para demonstração: ao desbloquear cada uma delas, dentro do próprio jogo, um item ou valor monetário (DINHEIRO DO JOGO, NÃO É DINHEIRO DE VERDADE!!!!!!) será fornecido como recompensa, auxiliando na sua jornada! Quanto mais difícil for a conquista, maior o prêmio! Já se conseguir completar todas, receberá um item único e especial! </p>\n<p>      <em> - Capítulo Extra: </em>Após o fim da história principal, ainda terá mais enredo e desafios a cumprir, além de novas áreas a explorar!       </p>\n<p>       <em>- Torre de Batalha:</em> achou que o desafio havia terminado, depois de completar o modo campanha e o capítulo extra? Ledo engano! Agora, terá que passar pela Torre de Batalha, um desafio insano com uma mistura maluca de todos os inimigos que já enfrentou antes, em diversos locais! São 50 níveis, que tornam-se gradualmente mais difíceis. Ah, e não poderá salvar o jogo durante o desafio. Entretanto, caso perca, o seu recorde mais alto será mantido. Preparou-se?   </p>", "metacritic": null, "released": "2018-12-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3fa/3fa9338c233f137b817c1f4245823fcc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MParaGames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}