{"id": 278622, "slug": "bluebonnet-plague-navigator-edition", "name": "BlueBonnet Plague - Navigator Edition", "name_original": "BlueBonnet Plague - Navigator Edition", "description": "<p>THIS IS THE UPDATED VERSION OF THE GAME AS OF 12/18/18!<br/></p>\n<p> TO PLAY THE LUDUM DARE EDITION GO HERE: https://goatboatgames.itch.io/bluebonnet-plague<br/></p>\n<p>Controls are mouse only.</p>\n<p>Find ingredients with your assistants to create potions, then test them out. You have to find the cure to the plague.</p><p>Follow us to find out what future updates are in store on our twitter page here:<br/>https://twitter.com/games_boat<br/></p>\n<p>V1.1 The Navigator update is here! A minimap has been added to the dungeon as well as character profiles, simply right click on their portrait on the character select screen or click the info button after selecting them to get some additional details about them. Additionally, the Potionpedia is here! This handy guide will let you know about current mixtures you've invented and what they do as well as record potential mixes based on clues you can find in the labyrinth.<br/></p>\n<p>V1.01 Text box in dungeon adjusted to show text better. Currently there's a bug that if you click ingredients on the main page you will throw away those ingredients. Don't do this.\r\n</p>\n<p>Please rate us for Ludum Dare 43, here: https://ldjam.com/events/ludum-dare/43/bluebonnet-plague</p>\n<p>Credits:</p>\n<p>Deviant: Lead Programmer, Lead Designer, Director\r\nTopper: Assistant Programmer\r\nShadelow: Visual Designer\r\nPeaceMaker: Visual Designer, Additional Game Design\r\nGoshDiggityDoozle: Character Artist\r\nMaakole: Character Artist\r\nQuickStudy: Research &amp; Development</p>\n<p>Story:\r\n</p>\n<p>There once was a girl in west Texas, she lived in a mansion with many servants as her father was an oil tycoon making a fortune on the black gold rush. One day she was frolicking through the fields when she spotted some beautiful <em>blue wildflowers</em> \"These will look lovely in my afternoon gown\" she thought, and carelessly plucked one out of the soil. The spirit of the fields was pleased that someone liked their work so much that they would take it home. But the next day the girl returned, the spirit was about to reveal itself to the girl to remind her the importance of these flowers when the girl spoke \"These will look <em>lovely</em> in my birthday bouquet to mother\" And once again, the spirit was pleased with her generosity. The days went on and the girl continued to take the wildflowers from the fields every day, and every day the spirit's happiness turned more and more to anger at the girls lack of satisfaction with how many flowers she had already taken. Until there was one left. The girl now a young lady returned to the field \"A pity only so many flowers is all this field is good for, but daddy will have no trouble making new use for this.\" The spirit was furious with the girl and showed herself at once giving her a warning \"If you come to this field once more you and everyone who has had one of my flowers will surely regret it.\" The young lady puffed up her chest saying \"What can <em>you</em> do that my daddy can't fix? Hmm?\" As she bent over, and plucked the last of the wildflowers in the field. The spirit was speechless at the gall the young lady was showing and began reciting a curse onto the girl for her thanklessness and selfishness. \"May your skins color turn green as the grass you tread and its texture as course as dirt, sores and boils of all sizes will cover your body just as my beautiful flowers covered this field. Let this disease plague you and all you know until you learn to be as selfless as the field you've plundered.</p>\n<p>Scared the young lady ran home to her servants to reassure her it was just a hallucination. A few days later she fell ill with a fever, as did anyone attending to her. They made her a suit to wear around the village but it was too late. One servant had gone shopping and soon the town was infected as well. Rumors spread about the tycoons daughter and neighboring towns began to avoid the little village she stayed in. The young lady didn't intend for any of this to happen, and pleaded for her daddy to fix her complexion so that she may go outside again. Doctors and medicines came from every nation to her aid but none a cure. The young lady now a young adult has given up on anyones help but her own. She will find a cure and bring the town back to it's former glory. Every day she tries mixing herbs together and has her servants act as test subjects to find a cure, where she is today.</p>\n<p>name of the game: Bluebonnet Plague</p>", "metacritic": null, "released": "2018-12-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a22/a22f3f8c0994bcb367772c61c4861863.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GoatBoatGames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}