{"id": 278606, "slug": "jumgeon", "name": "Jumgeon", "name_original": "Jumgeon", "description": "Pitch\r\n<p>Jumgoen is a fast-paced dungeon-crawler with changing player abilities while taking elements from the rogue-lite and shmup genres.</p>\r\nGame Outline\r\n<p>Jumgeon is a rogue-lite shoot-em-up with a heavy focus on reincarnation. With every death, the player will experience a new variation of gameplay as the hero is reincarnated as a different animal with different abilities. The player must navigate through rooms filled with enemies to try to get all the \"repentance orbs\" in order to win. This is a skill-based game where the player has five lives to collect all the orbs. Each reincarnation will alter the experience in some way which will also add an element of tension as the player must adapt to these new styles of gameplay.</p>\r\nGame Summary\r\n<p>Jum, a skilled hunter, never failed to provide for this tribe. Although he was skilled in the art of the hunt, he had no empathy for the creatures he slaughtered. He was merciless and enjoyed killing animals. One day, Jum killed the Alanimal, a divine beast, triggering a storm that shrouded the world in darkness and silence. Through the heavy black there was a sliver of light which lead Jum to a cave. Now, Jum must enter the cave in order to face his sins and atone.</p>\r\nSelling Points\r\n<ul>\n<li>Experience reincarnation with multiple characters.</li>\n<li>Multiple forms of gameplay tied each character.</li>\n<li>Unique enemies.</li>\n<li>30 different levels.</li>\n<li>There is a narrative.</li><li>Multiple endings based on performance,</li>\n</ul>", "metacritic": null, "released": "2018-12-19", "tba": false, "updated": "2019-08-28T23:18:51", "background_image": "https://media.rawg.io/media/screenshots/1a6/1a6b7adc3057bd71ef0c7fb0f3f89a51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["sijd"], "genres": ["Action"], "publishers": [], "esrb_rating": null}