{"id": 278764, "slug": "divine-trials", "name": "Divine Trials", "name_original": "Divine Trials", "description": "Description\r\n<p>You are hero that will face the divine trials: a series of 1 vs 1 battles against the most formidable opponents of the Greek civilization. But for that, not only you need to be skillful in the arena, but also you need to please the gods by giving them gifts in exchange for power.</p>\n<p><strong>Divine Trials</strong> is a bullet-hellish boss rush game where you face different bosses in order to achieve the feat of beating the trials made by the gods.</p>\n<ul>\n<li>bullet hell - <em>check</em></li>\n<li>formidable bosses - <em>check</em></li>\n<li>amazing pixel art - <em>check</em></li>\n<li>stunning soundtrack - <em>check</em></li>\n<li>FUN - <em>check</em></li>\n</ul>\r\n\r\nPatches\r\n-&gt; Divine Trials v1.0 (18-DEC-2018 5:50AM GMT-3)\r\n<p>This is the version submitted within the game jam deadline. It is available in the Download section for the Windows platform. <br/><br/><strong>This is the version that is currently available to be played in the web in this page.</strong></p>\r\n-&gt; Divine Trials v1.1 (19-DEC-2018 1:50AM GMT-3)\r\n<p>This is a minor bug fix patch post-jam. The following topics are exactly the changes made in this patch in comparison to v1.0.<br/>The version submitted within the game jam deadline is v1.0.<br/><br/><strong>This version is currently available only as a windows downloadable and will be updated to the web version once the jam evaluation period is over.</strong></p>\n<ul>\n<li>Fixed a bug where you could be offered the same choice more than once between trials</li>\n<li>Fixed a bug where the text of the choices was slightly misaligned</li><li>Fixed a bug where you would be hit in the choice screen from the projectiles of the previous fight, making you start your next trial with less HP than the intended</li><li>Rephrased the wording in the choices screen to notify the player that lifes are reset between each trial and that the sacrifice buff/debuff is only 1 life</li></ul>\r\n\r\nExtra Credits Holiday 2018 Game Jam\r\n<p>This game was made in <strong>5 days</strong> as an entry for the Extra Credits Holiday 2018 Game Jam. Chick here to check other entries:</p>\n<p>https://itch.io/jam/extra-credits-holiday-2018-game-jam/entries<br/><br/>The theme of the jam was \"present\". We decided to approach the theme with the idea that presents must be given to the Gods in exchange for benefits that will help your hero to beat the divine trials ahead.</p>\r\n\r\nControls\r\n<p><strong>WASD</strong> = Movement<br/><strong>SPACE</strong> = Shoot Projectiles</p>\r\n\r\nCredits\r\n<p>Bernardo Hörner - Game Systems Programming<br/>Gabriel Barros - Sound Design and Music<br/>Ian Albuquerque - Visual Assets and Enemy AI<br/>Renan da Fonte - UI Programming</p>\r\n\r\nSpecial Thanks\r\n<p>Eduardo Wichrowski<br/>Raphael Ramos<br/>João Victor Galindo<br/>RPG - Rio PUC Games</p>", "metacritic": null, "released": "2018-12-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/af3/af3bd32a98a9cb419cb04b43183c4493.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Ian Albuquerque", "ggdbarros", "SirBernhart"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}