{"id": 278810, "slug": "substitute-teacher", "name": "Substitute Teacher", "name_original": "Substitute Teacher", "description": "<p>\"¿You know what's the worst part of being a substitute teacher? <strong>Trying to learn the names of all the kids for only one day.</strong> Everyday a different classroom, a different set of strange kids and a new attendance list to check. Fortunately I always get a few notes about the kids and their particular quirks, that kinda helps going through the list quickly. Every second counts, all I want is to get it done and bounce!<strong>\"</strong></p>\n<p><strong>Try to check the attendance correctly before the time runs out. Every day is a new paycheck, try getting to work as many days as posible!</strong></p>\n<p>-------------------------------</p>\n<p>Controls: Mouse Click</p>\n<p>Gameplay: </p>\n<p>- Identify the students that are currently in the classroom by their descriptions and mark them on the clipboard. BE CAREFUL, there are some students that are not actually there and maybe they like wearing the same clothes as the present students.</p>\n<p>- Once you are sure of your answer (or when the timer runs out), the list will be checked. If you accumulate more than 3 errors in your run, you'll lose.</p>\n<p>- Go as many days as you can! Every new day on a streak gets 5 seconds less to check the attendance, so you have to be quick.</p>\n<p>-------------------------------</p>\n<p>This game is an entry for Extra Credits Holiday 2018 Game Jam (itch.io/jam/extra-credits-holiday-2018-game-jam), where the theme was \"Presence\". I tried making a simple mix between Papers, Please and Guess Who where you had to try to check correctly the attendance of the students based on their clothes and movement.</p>\n<p>This was made by a 1 man team: Benjamín Cordero a.k.a lovvyvoy, a chilean game developer. I hope you like it!<br/></p>\n<p><em><strong>(If this game doesn't run correctly on your browser, I attached the MAC version of this game at the end)</strong></em></p>\n<p>Assets used:</p>\n<ul><li>BGM: Mac Demarco - Young Coconut</li><li>SFX: http://soundbible.com/tags-school.html</li><li>Models: MagicaVoxel</li><li>Engine: UE4</li></ul>\n<p>To do on the future:</p>\n<ul><li>Misdirection, cloth changes</li><li>More assets</li><li>New dimensions of difficulty</li><li>Highscores</li><li>Backstory</li></ul>\n<p>Inspired by running the attendance at school, where you had to responde \"Presente\" whenever your name was called. Also, by this old meme video:  Ayurame, por favor, tengo muchos quiaraseres</p>", "metacritic": null, "released": "2018-12-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/41a/41a19efdf09c2e2918b199fd8847d559.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["lovvyvoy"], "genres": [], "publishers": [], "esrb_rating": null}