{"id": 278927, "slug": "paper-warriors", "name": "Paper Warriors", "name_original": "Paper Warriors", "description": "Introduction\r\n<p><strong>Paper Warriors </strong>is a 2D co-op 1v1 brawler stylized like it was completely hand-drawn on paper. The game features 3 stages and 3 playable character each resembling a fantasy archetype, each consisting of their own unique moveset and corresponding stats giving each character a unique playstyle with specific pros and cons. The combat is based on Rock-Paper-Scissors type of attacks as a core mechanic.<br/></p>\r\nControls \r\n<p>Currently the game's controls only works for a keyboard with a number pad where each player will control their character with certain controls that are meant to split up the keyboard to the Player 1 (left) and Player 2 (right).<br/></p>\n\n<p>Each character has 3 attacks:</p>\n<ul><li>Basic Attack</li><li>Anti-Aerial Attack</li><li>Aerial Attack</li></ul>\n<p>Where there is an advantage and disadvantage triagnale between those three hits, Basic Attack beats Anti-Aerial but is countered by Aerial.<br/></p>\r\nCharacters\r\n\r\nBrawler\r\n<p>The Brawler is our hardest hitting character but that also gives him the shortest range. Out of all the character, he is the only character with an aerial that is also a gap closer to help him reach his opponent. The brawler excels at close-combat and is a all or nothing type of playstyle.<br/></p>\r\n <br/>\r\nS<strong>wordsman<br/></strong>\n<p>The Swordsman is our all-around character that is a jack of all trades, master of none. He can fight either in close-combat or at a distance without being too heavily outmatched.<br/></p>\n\n<strong>Mage<br/></strong>\n<p>The mage is the character with the most range but that comes with having the least amount of damage. The mage excels at distanced combat and is really good at controlling the stage.</p>\r\nStages\r\n<p>There are currently 3 stages in Paper Warriors:</p>\n<ul><li><strong>Binder Paper Stage: </strong>The bare-bone binder paper stage where anything is possible.</li><li><strong>Martial Arts Stage:</strong> This stage is based on the iconic Martials Arts Tournament stage from Dragon Ball.</li><li><strong>Forest Stage: </strong>The Forest stage is based on those forest setting fights seen alot in tradition fighting movies.</li></ul>\n\r\nInstructions\r\n<p>Download the file and unzip it. Both Windows and Mac version are included in the zipped file and can be run through an exe in each respective operating system file. Mac users will have to navigate a bit further into the Mac folder to find the exe: </p>\n<ul><li><strong>Paper</strong> <strong>Warriors ver.1.0.0 -&gt; Paper Warriors ver. 1.00 Mac.app -&gt; Contents -&gt; MacOS</strong></li></ul>", "metacritic": null, "released": "2018-12-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/989/9891b925f7b5513ce414d962732b4653.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["svfc108", "FonicArtist"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}