{"id": 279078, "slug": "chicken-pox", "name": "Chicken Pox", "name_original": "Chicken Pox", "description": "Pimp your chicken, pick your ride and jump into hours of addictive egg grabbing fun!<br/><br/>Dodge past crazy sheep, weave through herds of cows and time your run perfectly through closing gates to grab the eggs and make it to the finish line - can you get them all before your fuel runs out?<br/><br/>* CHOOSE your ride from Pox's awesome garage!<br/>* UNLOCK fast paced mini-games that test your skill and reflexes!<br/>* REVEAL cool pictures by grabbing the eggs in order!<br/>* CUSTOMISE Pox and the eggs by mixing and matching hats, glasses and masks in hundreds of cool and funny combinations!<br/>* FIND all the hidden blue eggs in each level for bonus rewards!<br/>* EXPLORE Chicken Pox’s stunning 3D environments - Play in the Farm, Ocean and Airport!<br/>* COMPETE against your friends and be the Chicken Pox leader!<br/>* NEW content added regularly!<br/><br/>Chicken Pox is free to play! Download now! <br/><br/>“Chicken Pox totally caught me by surprise! I love this game! 5/5”<br/>“Cool chicken, amazing game concept. I'm addicted already”<br/>“Who knew that grabbing eggs could be so much fun! Stunning visuals, and fantastic gameplay\"\"<br/>“So much fun! I love dodging the obstacles and the mini-games are great! 5 Stars”<br/><br/>---<br/>Want to Learn More?<br/>Facebook: www.facebook.com/ChickenPoxGame. Keep updated on new features and game hints!<br/>Instagram: www.instagram.com/ChickenPoxGame. See the latest new environments, rides, hats and glasses!<br/><br/>---<br/>Reviews<br/>Please rate Chicken Pox and leave us a review!<br/>We love hearing from our fans! If you have suggestions or support queries, please email us at support@chickenpoxgame.com<br/><br/>---<br/>Chicken Pox is completely free to play but you can buy special items to use in game. You can turn off the payment feature by disability in-app purchases in your device’s settings.", "metacritic": null, "released": "2018-11-28", "tba": false, "updated": "2019-10-22T14:31:29", "background_image": "https://media.rawg.io/media/screenshots/beb/bebe2bedd73806f9b0ed3ea291a1673d_4CCNsnM.jpg", "website": "http://www.chickenpoxgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nosy Jones"], "genres": ["Adventure", "Family"], "publishers": ["Nosy Jones"], "esrb_rating": null}