{"id": 279050, "slug": "fabulous-angelas-true-colors", "name": "Fabulous - Angela's True Colors", "name_original": "Fabulous - Angela's True Colors", "description": "Your favorite fashionista is back with a style-filled New York adventure as can only happen to Angela!<br/><br/>Angela's dream is to open a fashion boutique in the heart of New York's most glamorous designer area. It's nearly Fashion Week, and she's ready to shine. With new sketches in her portfolio, she’s off to find investors, who are closer than she thinks… But when reigning fashion queen Noémie hears about the hot young designer trying to take over, she sets out to destroy Angela's plans.<br/><br/>At first Noémie's plan seems to succeed, and Angela returns home with her tail between her legs. But Angela wouldn't be Angela if she let some fading designer dull her sparkle!<br/><br/>Your work is cut out for you. Can you assist Angela with her boutique *and* help her get into the New York Fashion Week?<br/><br/>👠 <strong>Create dresses</strong>, and stock bags, shoes, jewelry and other accessories for Angela's shop<br/>👠 <strong>Decorate the boutique</strong> to make it New York chic<br/>👠 <strong>Dress up your models</strong>, give them hairstyles and glam makeup, and send each beauty onto the runway<br/>👠 Are your fingers nimble enough to defeat our <strong>exciting time management gameplay</strong>?<br/>👠 Design your way through <strong>60 story levels and 24 challenge levels</strong><br/>👠 <strong>Earn your highest score</strong> in the 6 fabulous Endless Levels<br/>👠 <strong>Give your models a <strong>fashion makeover</strong> and share your most amazing haute couture outfits on Facebook<br/>👠 Are you <strong>Team Angel</strong> 😇 or <strong>Team Devil</strong> 😈? Which advice would *you* give Angela?<br/>👠 Discover <strong>two secret levels</strong>!<br/>👠 Master 20 unique <strong>fashion-themed minigames</strong></strong>", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-18T20:22:13", "background_image": "https://media.rawg.io/media/screenshots/e01/e01c02c33b029f114986a4726a1aeba0.jpg", "website": "http://www.gamehouseoriginalstories.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["GameHouse"], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["Gamehouse"], "esrb_rating": null}