{"id": 279015, "slug": "quotes-quest-match-3", "name": "Quotes Quest - Match 3", "name_original": "Quotes Quest - Match 3", "description": "Play Quotes Quest to unlock 525 inspirational quotes of famous people and to pass extra 175 challenges - this all comes up to 700 unique colorful levels.Set your game theme colors anytimeChange your dynamically animated background theme anytime you like - there are more than 160.000 (YES, 160-thousand) combinations of colors to choose from, combined with 700 unique levels of various tile items and tile colors - that is more than 112.000.000 (YES, 112-million) of colorful theme/level combinations!<br/><br/>Play this relaxing and addictive game and select music to listen to while you play it, or mute music all together quickly and easily from any scene and any window. <br/><strong>Get inspired today - go, get ready and play!</strong> Your quotes are waiting for you.The game includes:- more than 160-thousand color combinations of themes<br/>- 700 unique and relaxing levels to play<br/>- 525 quotes of famous people to be unlocked and read at anytime you like<br/>- more than 112-million unique color combinations of gameplay grids and animated background colors<br/>- selection of relaxing and cool ambient music tracks to help you relax your senses during your play<br/>- 30 aquamarine pixelated fish swimming about<br/>- hundreds of animations (tile items, fish, buttons and UI, backgrounds, even the cursor itself)<br/>- currently 99 achievements waiting to be unlocked, plus stats waiting to be kept", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:53", "background_image": "https://media.rawg.io/media/screenshots/d96/d96a23874fad0ffa1f3278e16b24ee3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ľuboš Duda"], "genres": ["Casual", "Indie"], "publishers": ["Ľuboš Duda"], "esrb_rating": null}