{"id": 279090, "slug": "boomboom-casino-vegas-slots", "name": "BoomBoom Casino - Vegas Slots", "name_original": "BoomBoom Casino - Vegas Slots", "description": "Join the NEW KING of FREE SLOTS!<br/>Experience the NEVERENDING RUSH of HUGE WINS in authentic VEGAS style!<br/><br/>Find the BEST slot game experience right here in BoomBoom Casino!<br/>Epic wins! Unlimited Fun! We got it all!<br/>The super high quality slot games with the most unique features and themes will leave you breathless!<br/>BoomBoom Casino provides the Authentic Vegas Experience and MORE!<br/><br/>● Brilliant slot games with stunning graphic. A new addition releases every 2 weeks!<br/>● Win up to 100 amazing Free Spins with explosive wins!<br/>● Your highway to Colossal Jackpots! <br/>● Countless Free Bonus Coins available every hour!<br/>● Collect colossal prizes with up to 1000X reward in Special Bonus Games played right at the lobby!<br/>● Accomplish New Missions daily for even more Free Coins.<br/>● Simply play and level up to enhance your Bonuses and Benefits by several folds!<br/>● Share and receive gifts with friends daily.<br/>● Exclusive benefits available for High Rollers in BoomBoom Lounge.<br/><br/>Step into the colorful floors of BoomBoom Casino for a fabulous experience now!<br/><br/>Free Coin links and Events with HUGE prizes are posted daily!<br/>https://www.facebook.com/boomboomcasino<br/><br/><br/><br/>- BoomBoom Casino is intended for use by those 21 or older for amusement purposes only.<br/>- BoomBoom Casino does not offer real money gambling or an opportunity to win real money or prizes.<br/>- Practice or success at social casino gaming does not imply future success at real money gambling.", "metacritic": null, "released": "2018-12-20", "tba": false, "updated": "2019-10-22T14:31:29", "background_image": "https://media.rawg.io/media/screenshots/151/15124618c100198b23cb6cd4bbd2ab37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Baobab Games"], "genres": [], "publishers": ["Baobab Games Co"], "esrb_rating": null}