{"id": 27908, "slug": "fifteen", "name": "FIFTEEN", "name_original": "FIFTEEN", "description": "Welcome to a world where creativity knows no bounds.<br/><br/>Embark on a journey of artistic mastery with “Fifteen,” a captivating puzzle game that transcends conventional boundaries. Immerse yourself in a world where each swipe brings you closer to completing intricate images in a seamless blend of creativity and challenge. Elevate your gaming experience with multiple levels featuring diverse themes, from iconic landmarks to captivating portraits, vibrant wildlife, and dynamic vehicles. Engage with the game in a revolutionary 3D 360-degree perspective, where every twist and turn offers a new dimension to your puzzle-solving adventure.<br/><br/><strong>Gameplay:</strong><br/>“Fifteen” challenges you to reshape the world, one swipe at a time. Navigate through levels by intuitively switching puzzle pieces into the perfect fit with a simple mouse swipe. The elegant mechanics and fluid controls enhance the gameplay, providing a satisfying and immersive experience. As you progress, witness the transformation of fragmented images into breathtaking compositions.<br/><br/><strong>How to Play:</strong><br/>- Click to move the right pieces to complete the whole picture.<br/>- Explore various size levels, from small to 3X Large, to suit your preference.<br/>- Enjoy the satisfaction of bringing diverse themes and special GIFs to life through your puzzle mastery.<br/><br/><strong>Diverse themes:</strong> <br/>Dive into a rich tapestry of themes that cater to every aesthetic preference. Whether you’re exploring renowned landmarks, studying the intricacies of people, marveling at the diversity of animals, or embracing the dynamic world of vehicles, “Fifteen” has a puzzle for every art lover. Each theme promises a visual feast and a unique challenge that keeps you coming back for more.<br/><br/><strong>3D 360-degree Perspective:</strong><br/>Immerse yourself in a gaming experience like no other. “Fifteen” introduces a groundbreaking 3D 360-degree perspective, allowing you to view and manipulate puzzle pieces from every conceivable angle. This innovative feature adds depth to your gameplay, transforming each level into a virtual canvas waiting for your artistic touch.<br/><br/><strong>Features:</strong><br/>- Intuitive mouse swipe controls for seamless gameplay<br/>- Multiple levels with diverse themes: landmarks, people, animals, vehicles, etc.<br/>- Engaging puzzles that challenge and inspire<br/>- 3D 360-degree perspective for a fully immersive experience", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2023-12-22T09:10:36", "background_image": "https://media.rawg.io/media/screenshots/04c/04c8cc201b6fc8e191c0dba2e8d9e25e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Nintendo 3DS", "Wii U"], "developers": ["RCMADIAX", "Latte Games JSC"], "genres": ["Casual", "Indie"], "publishers": ["RCMADIAX", "Latte Games JSC"], "esrb_rating": null}