{"id": 279172, "slug": "werewolf-vs-villager", "name": "Werewolf vs villager", "name_original": "Werewolf vs villager", "description": "The Rules <br/><br/>- Setting Up <br/><br/>There should be at least five players. More numbers are better. Please, decide a person who will play a moderator role. All the rest players sit in a circle. The moderator decides a number of players and roles on the werewolf application. There should be at least two “Werewolf” players and one “Seer” All the rest “Villager”. Push the start button and give the app to the first player. The player should put his name and check his role, but must keep it secret. The next player does the same way as previous player. If they have done it all and then give the app back to the moderator. Two players are now secretly werewolves. They are trying to slaughter everyone in the village. * The number of werewolves can be grown as the number of players <br/><br/>- The Game: Night and Day <br/>The game proceeds in alternating night and day phases. We begin with Night. At Night, the moderator tells all the players \"Close your eyes.\" Everyone should. The moderator says \"Werewolves, open your eyes.\" The two werewolves do so, and look around to recognize each other. The moderator says \"Werewolves, pick someone to kill.\" The two werewolves silently agree on one villager to kill. (It is critical that they remain silent. The other players are sitting there with their eyes closed, and the werewolves don't want to give themselves away. Sign language is appropriate, or just pointing, nodding, raising eyebrows, and so on.) When the werewolves have agreed on a victim, and the moderator understands who they picked, the moderator says \"Werewolves, close your eyes.\" The moderator says \"Seer, open your eyes. Seer, pick someone to ask about.\" The seer opens his eyes and silently points at another player. (Again, it is critical that this be entirely silent -- because the seer doesn't want to reveal his identity to the werewolves.) The moderator silently signs thumbs-up if the seer pointed at a werewolf, and thumbs-down if the seer pointed at an innocent villager. The moderator then says \"Seer, close your eyes.\" The moderator says \"Everybody open your eyes; it's daytime. And you have been torn apart by werewolves.\" He indicates the person that the werewolves chose. That person is immediately dead and out of the game. He reveals his card, showing what he was, and leaves it face-up. Now it is Day. Daytime is very simple; all the living players gather in the village and lynch somebody. The mob wants bloody justice. As soon as a majority of players vote for a particular player to die, the moderator says \"Ok, you're dead.\" That player then reveals his card, and the rest of the players find out whether they've lynched a human, a werewolf, or the seer. There are no restrictions on speech. Any living player can say anything he wants -- truth, misdirection, nonsense, or lie. Contrariwise, dead players may not speak at all. As soon as the sun comes up and the moderator indicates that someone is dead, he may not speak for the rest of the game. No dying soliloquies allowed. Similarly, as soon as a majority vote indicates that a player has been lynched, he is dead. If he wants to protest his innocence or reveal some information (like the seer's visions), he has to do it before the vote goes through. No player may reveal his card, to anyone, even when he is killed. All you can do is talk. Once a player is lynched, night falls immediately and the cycle repeats. Everyone closes their eyes, the werewolves (or werewolf) secretly select someone to kill, the seer (if alive) secretly learns another player's status; then the sun rises, one player is found dead, and the remaining players begin to discuss another lynching. Repeat until one side wins. <br/><br/>- Winning <br/>The humans win if they kill both werewolves. The werewolves win if they kill enough villagers so that the numbers are even. (Two werewolves and two humans, or one werewolf and one human.) At that point they can rise up and slaughter the villagers openly.<br/><br/>* Please, go to our website for more detail.", "metacritic": null, "released": "2017-07-24", "tba": false, "updated": "2019-10-22T14:31:32", "background_image": "https://media.rawg.io/media/screenshots/042/0429efdfd988ed62521c8621ed387c6b.jpg", "website": "https://sites.google.com/view/heavystoney/apps/werewolf-and-villager", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["joong seok lee"], "genres": ["Strategy", "Board Games"], "publishers": ["joong seok lee"], "esrb_rating": null}