{"id": 279263, "slug": "gunship-battle-air-strike-2018", "name": "Gunship Battle Air Strike 2018", "name_original": "Gunship Battle Air Strike 2018", "description": "Welcome to the helicopter shooting games or helicopter gunships games and get ready for the helicopter fight in helicopter fighting games. Helicopter gunship battle grounds is the most immersive helicopter 3d battle games in PVP action games. So hurry up and be the part of this unknown battle and take control of most powerful helicopter combat and become a brave solider in in helicopter fighter games.  In this helicopter games, helicopter army simulator games use strategically fire your powerful machines guns and devastating missiles to slay hordes of enemies across the world. Guide with precision your combat helicopter and demolish the enemy military bases with helicopter attack in the world’s greatest combat of helicopter 3D battle games! Use power Gunship and Strike the enemies by using combines tactics, flying skills in this army helicopter game, helicopter driving games or helicopter fighting games. Don’t wait any more take part in helicopter driving games and experience the battle of sky. You are a helicopter pilot in helicopter fighting games and your objective is to take down the enemies’ bases during the gunship combat missions. This best gunship battle games or helicopter shooting games offers you to strike the enemies in the worse situations of combat. <br/><br/>Are you ready to become the helicopter fighter in helicopter fighting games or helicopter fight game? In this Helicopter Gunship Battlegrounds fly helicopter in unknown battle and enter the battleship down the enemies and complete the missions one by one. Start war or helicopter attack in helicopter shooting games by sitting in gunner seat of Helicopter 3d battle games and beat enemy with your gunship helicopter full loaded with Guns and Missiles. This Helicopter Gunship Battlegrounds need 2 heavy Strikes in different missions. Enemy base and Enemy camp is also full loaded with heavy Gunship Tanks you need to take care of that and avoid tower enemy as it can destroy your helicopter and camp enemy as well. In this helicopter games or helicopter strike games Radar show enemies, red dots update is alert feature of game that will alter by updating dot enemies red. Try to strike enemy before enemy alert. <br/><br/>Download Helicopter Gunship Battlegrounds for free and enjoy the realistic simulation, high-quality graphics, amazing sound effects, engaging and addictive gameplay, so many helicopters to choose from, and challenging levels. This free gunship battle game, helicopter fighter games or helicopter Battle games  comes with a clean and neat design and the interface is so user-friendly and the gameplay is so easy to learn that you’ll get the whole idea after flying the 3D helicopter for a few times and completing the first levels. Once you completely get used to the gameplay, you need to be fully focused and have a decent strategy in order to survive the air strike combats and missions. <br/><br/><br/>Features for Helicopter Gunship Battlegrounds<br/>• Clean and neat design with fresh and intuitive interface<br/>• High-quality 3D graphics with surrounding sound effects and music<br/>• Realistic 3D helicopter simulator<br/>• Easy to learn, yet addictive gameplay<br/>• Different helicopters to use in the gunship battle<br/>• 2 different game modes and 2 different scenes to play in: Desert or Sea<br/>• Different challenging levels <br/>• Enable protective shields<br/>• Free to play", "metacritic": null, "released": "2017-12-07", "tba": false, "updated": "2019-10-22T14:31:36", "background_image": "https://media.rawg.io/media/screenshots/608/6085ab3bee770e222ff1efed444e872d.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani"], "genres": ["RPG", "Strategy"], "publishers": ["Syed Usman Ali Shah Gillani"], "esrb_rating": null}