{"id": 279286, "slug": "sweet-shop-tower-match-3-jello", "name": "Sweet Shop Tower - Match 3 Jello", "name_original": "Sweet Shop Tower - Match 3 Jello", "description": "Have fun matching candies and exploring the world of candy sweets with cute animals! Yum!<br/><br/>Players will find delight in this sweet match 3 puzzle game. Just try to match 3 or more candies in a row!<br/><br/>Sweet Shop Tower features:<br/>● Sugary sweet candy treats that will leave you hungry for more!<br/>● Discover yummy environments and meet the sweetest characters like jelly fish, star fish, gummy bears, turtles, puppies and kittens!<br/>● Unlock adventurous levels and discover special treats for dessert!<br/>● Helpful magical powerups and boosters to beat tough levels (e.g. mint and count down bombs)<br/>● Easy and fun to play, challenging to master. Build up a fruit splash mania!<br/>● Hundreds of sugar sweet levels in the Sweet Shop Tower - more being added every month!<br/>● Play alongside friends and competitors on social networks!<br/><br/>Tips and tricks:<br/>- Try to set up chain reactions to enjoy higher scores as a ballet of sweets tumble and fall from the board!<br/>- On mint levels, remove them as fast as possible before it spreads!<br/>- Remember to keep an eye on count down bombs!<br/>- Keep making appointments to play to earn free spins of the bonus prize wheel!<br/>- Try out different avatars for your choice of pet style (tap on your avatar) - there are more than 30 cute n cuddly animals to choose from!<br/>- Mix and match your super candies! How about a chocolate smoothie?<br/><br/>DOWNLOAD AND MATCH TODAY!", "metacritic": null, "released": "2015-08-28", "tba": false, "updated": "2019-10-22T14:31:38", "background_image": "https://media.rawg.io/media/screenshots/3ed/3ed82b13cca057e4299655f3669bb2fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zen Capital"], "genres": ["Family", "Puzzle"], "publishers": ["Zen Capital"], "esrb_rating": null}