{"id": 279292, "slug": "army-tank-free-battle-game", "name": "Army Tank - FREE Battle Game", "name_original": "Army Tank - FREE Battle Game", "description": "Download and play the best free army tank game now! It’s unbelievably addictive with lots of strategy involved.<br/><br/><br/>“Best Tank Game in the App Store.”<br/><br/>Visit the Tank Armory to upgrade your tank’s powers and measure yourself against the top players from around the world on our global leaderboard. With levels designed to challenge all users with an adaptable difficulty grading, Army Tanks requires skill, cunning and loads of ammunition to conquer the enemy. Check out the screenshots to see why you need to download the app now!<br/><br/>**Awesome Features**<br/>− Choose your hero tank wisely... Is it going to be the 'Destroyer' or the 'Attacker' or a mystery tank?<br/>− Get secret powers to upgrade your tank. <br/>− If you're good you'll get some free credits to upgrade your tank.<br/>− Top quality graphics and sounds<br/>− Various joystick options. (Choose between gravity or old school analog controls)<br/>− How good are you??? Will you play on the Easy, Medium, Hard, or Brutal difficulty level?<br/>− Share top scores by Facebook, Twitter or Email<br/>− International rankings published on our global leaderboard<br/>- Many levels to conquer and mystery enemy tanks to unlock. <br/><br/>*** Tips ***<br/>− Visit the armory to upgrade your tank to gain new destructive powers.<br/>− Be adaptable, the enemy tanks and terrain are constantly changing and evolving and you tactics will need to adapt.<br/>- Theres a lot of strategy involved...you'll need to test your wits and skills. Mix it up a little to see what works for you. <br/><br/>Join Us<br/>Website: http://ArmyTankGame.com<br/>Facebook: http://www.facebook.com/ArmyTankGames<br/>Twitter: http://twitter.com/ArmyTankGame", "metacritic": null, "released": "2014-04-12", "tba": false, "updated": "2019-10-22T14:31:39", "background_image": "https://media.rawg.io/media/screenshots/69f/69f75dba3d75fcf709cbdc3e85161273.jpg", "website": "http://ArmyTankGame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lab41"], "genres": ["Strategy", "Arcade"], "publishers": ["Lab41"], "esrb_rating": "Everyone 10+"}