{"id": 27939, "slug": "pokemon-ultra-sun", "name": "Pokémon Ultra Sun, Ultra Moon", "name_original": "Pokémon Ultra Sun, Ultra Moon", "description": "<p>Take on the role of a Pokémon™ Trainer and unravel the mystery of the<br />\nLegendary Pokémon Necrozma&#39;s new forms: Dusk Mane Necrozma in the Pokémon<br />\nUltra Sun game and Dawn Wings Necrozma in the Pokémon<br />\nUltra Moon game. You can encounter and battle 400+ Pokémon,<br />\nincluding new forms. A brand-new showdown awaits!</p>\n<p>Discover the Legendary Pokémon Solgaleo and Lunala&#39;s new Z-Moves and<br />\ntheir mysterious connection to the Legendary Pokémon Necrozma. Then<br />\nventure into Ultra Wormholes to explore the Ultra Beasts&#39; home world,<br />\nencounter every Legendary Pokémon, and uncover Ultra Megalopolis, a dark<br />\nworld where Necrozma has stolen the light. On the bright side, the Alola<br />\nregion has new activities, and fresh landscapes to explore with some<br />\nassistance from your powered-up Rotom Dex. You&#39;ll need all the help you<br />\ncan get if you&#39;re going to stop Giovanni, Ghetsis, and the rest of Team<br />\nRainbow Rocket from taking over the Alola region!</p>\n<p>As a Pokémon Trainer, uncover new mysteries in the Alola region and<br />\nbeyond!</p>\n<p>Encounter over 400 Pokémon, including new forms, on a quest to become<br />\nPokémon Champion</p>\n<p>New Z-Moves for Necrozma, Solgaleo, Lunala, Mimikyu, Lycanroc, and<br />\nKommo-o</p>\n<p>Ultra Warp Ride Solgaleo or Lunala into Ultra Wormholes and surf with<br />\nMantine</p>\n<p>Take photos and share them with friends in Alola Photo Club</p>\n<p>Face off with Team Rainbow Rocket to determine the fate of the Alola<br />\nregion!</p>", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2024-03-20T13:26:41", "background_image": "https://media.rawg.io/media/screenshots/c90/c90ccff08926e422c682ceb3804342bb.jpg", "website": "https://www.pokemon-sunmoon.com/ultra/en-us/", "rating": 3.76, "rating_top": 4, "added_by_status": {"yet": 49, "owned": 48, "beaten": 226, "toplay": 32, "dropped": 65, "playing": 22}, "playtime": 0, "achievements_count": 0, "ratings_count": 185, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 190, "platforms": ["Nintendo 3DS"], "developers": ["Game Freak"], "genres": ["Adventure", "RPG"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}