{"id": 27944, "slug": "sine-mora-ex", "name": "Sine Mora EX", "name_original": "Sine Mora EX", "description": "<p>Sine Mora is a Latin expression meaning “without delay.” The setting of this shoot &#39;em up game is described as “style-inspired dieselpunk.”</p>\n<h3>Plot</h3>\n<p>There are two plots in the game, developing at different points in time.</p>\n<p>The first story is about a father who avenges the Empire for his son. His son, a bomber pilot, was executed by the Empire because he refused to drop a nuclear bomb during the Enkies attack.</p>\n<p>The second story is about the last survivors of the Enkie race, who also plan to take revenge on the Empire for the fact that the Empire destroyed them.</p>\n<p>Both plots of the game often develop in the same locations, but the differences between the situation in these places are very significant, because the events of different plots occur at completely different times.</p>\n<p>Everything happens on the planet Seol, which is very hike to Earth. However, the crust of this planet is very unstable, and this is the cause of the constant earthquakes. The landscape of the planet is very variable, its geography changes significantly over very short periods of time.</p>\n<p>By the time the game starts on the planet, two main factions compete: the aggressive Empire, ruled by the dictator, and the kingdom of Atarak, inhabited by the Enkie race.</p>\n<p>The Enkie race follows the teachings of the great prophet Enkie and is able to manage time. They can carry themselves and any object at any time past or future.</p>\n<p>The empire does not know how to manage time, but it is developing a machine that can do it. This machine will be able to accelerate the individual time of any object or living being, in order to bring it to the end of its existence, erasing, as soon as possible.</p>\n<h3>Gameplay</h3>\n<p>The player controls the aircraft, the main weapon of which can be upgraded. The main weapon can be used without limitation. There is also a secondary weapon. It is more powerful, but its use is limited.</p>\n<p>The player&#39;s performance is estimated by the sum of the indicators: the destruction of enemies, the damage received, collected powerups (shielding, extra time, and upgraded weapon).</p>\n<p>Destruction of enemies with the primary weapon will increase the game&#39;s score multiplier, while use of the secondary weapon or time manipulation will reset the multiplier.</p>\n<p>The game has four difficulties: normal, challenging, hard and insane.</p>\n<p>Game modes are: Story, Arcade, Score Attack, and Boss Training.</p>\n<p>Instead of health, a player’s state is measured by time. At the beginning of each level, the player receives a certain amount of time. This time can be reduced (accelerated) due to the actions of enemies, and the destruction of enemies, on the contrary, increases, stretches time.</p>", "metacritic": 82, "released": "2017-08-07", "tba": false, "updated": "2024-04-15T07:52:54", "background_image": "https://media.rawg.io/media/screenshots/ec2/ec2d4b29f9dd149918d91431a0f65a6e.jpg", "website": "", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 83, "owned": 1058, "beaten": 33, "toplay": 10, "dropped": 38, "playing": 8}, "playtime": 3, "achievements_count": 48, "ratings_count": 68, "suggestions_count": 608, "game_series_count": 0, "reviews_count": 69, "platforms": ["PlayStation 4", "Nintendo Switch", "PC", "Xbox One"], "developers": ["THQ Nordic", "Grasshopper Manufacture", "Digital Reality", "Gyroscope Games"], "genres": ["Action", "Shooter"], "publishers": ["THQ Nordic"], "esrb_rating": "Mature"}