{"id": 279432, "slug": "mon-village-est-magique-the-forgotten-crypt", "name": "Mon Village est Magique: The Forgotten Crypt", "name_original": "Mon Village est Magique: The Forgotten Crypt", "description": "<p>(Français plus bas / French below)</p>\n<p>                                                                                ***</p>\n<p>//ENG//<br/></p>\n<p><strong>Mon Village est Magique: The Forgotten Crypt is an interactive comics (kind of Visual Novel), created by the collective The Icehouse for Christmas 2018. It is a game with a short story to read, accompanied by various illustrations: characters, scenery and narrative views make the experience close to a small cartoon. From 8 years old (features nasty ghosts!).</strong></p>\n<p>\"Seb and Tommy are surprised by a violent storm and take shelter in the icehouse ruins, but the wind is too strong and their campfire goes out. Scared and frightened, they decided to face the bad weather with the hope of regaining the safety of their home. Alas they get lost on the way and fall into a hole hidden in the tall grass, forgotten by all.... \"</p>\n<p>Learn more about the world of Mon Village est Magique and subscribe to the newsletter:<br/>https://www.monvillageestmagique.fr<br/></p>\n<p>                                                                                ***<br/></p>\n<p>//FR//<br/></p>\n<p><strong>Mon Village est Magique : La Crypte Oubliée est un projet de bande dessinée interactive de type Visual Novel, créée par le collectif The Icehouse pour Noël 2018. Il s'agit d'un jeu avec une courte histoire à lire, accompagnée d'illustrations variées : personnages, décors et vues narratives rendent l'expérience proche d'un petit dessin animé. Dès 8 ans (met en scène de méchants fantômes !).</strong></p>\n<p>\"Seb et Tommy sont surpris par un violent orage et se mettent à l'abri dans la glacière, mais le vent est trop fort et leur feu de camp s'éteint. Effrayés et frigorifiés, ils décident d'affronter les intempéries avec l'espoir de retrouver la sécurité de leur maison. Hélas ils se perdent en chemin et tombent dans un trou caché dans les herbes hautes, oublié de tous... \"</p>\n<p>Apprenez-en plus sur le monde de Mon Village est Magique et inscrivez-vous à la newsletter :<br/>https://www.monvillageestmagique.fr<br/></p>", "metacritic": null, "released": "2018-12-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e5b/e5bbfaf4e52396c003b46f89594ee131.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Icehouse"], "genres": [], "publishers": [], "esrb_rating": null}