{"id": 279534, "slug": "murder-in-monster-town", "name": "Murder in Monster Town", "name_original": "Murder in Monster Town", "description": "<p>Beezle Bub is my name.  I'm a monster detective in the cesspool otherwise known as Monster Town.  Me and my partner, Mephista, have been solving cases and cracking skulls.  Not necessarily in that order.  Things were going just fine until the morning a murder fell right into our laps.  Not literally but it turns out it's a guy who we did some work for and now we're the prime suspects (mainly because we were the last two monsters to see him alive).  So, now we have to solve this case not only to find out who did it but to also clear our good names.    And I swear I'm going to make whoever framed us pay!</p>\n<p><strong>Game Features:</strong><br/>-Solve the mysteries of the Underworld<br/>-Fight monsters<br/>-Play the detective<br/>-Discover the truth about your past<br/>-Meet interesting people and beat them up for clues<br/>-Utilize the Black Market (it's run by Fairies ironically)<br/>-Unleash your Rage and transform into a giant monstrosity<br/>-Use your Detection skills to find hidden items<br/>-Use your Negotiation skills to barter better deals from NPC monsters<br/>-Convince other monsters to join you<br/>-Synthesize your own items<br/>-Mow through enemies using Team Moves<br/>-Find Santa Klaws and get a present from him </p>\n<p>Credits:<br/>-Dragon Kid sprite by hiddenone, Kadokawa &amp; Avery<br/>-Dragon &amp; Remaker sprites by whtdragon<br/><br/></p>", "metacritic": null, "released": "2018-12-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cc4/cc4705183fc11feefa0f6fa7c5136c63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xorclev"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}