{"id": 279584, "slug": "charms-of-the-witch", "name": "Charms of the Witch", "name_original": "Charms of the Witch", "description": "<p>Whoosh! How about letting some magic and fun in your life?<br />\nIt’s very simple to do! The portal to a wonderful world of match 3 games is already open, and you are only one touch away from the ability to create magic with your fingertips! :)</p>\n<p>“Little witch Selena has already sorted all charms to make it easier for you to collect them three in a row. By the way, you can combine more than three which is even better - just one easy movement of your finger and several charms turn into… an amulet! An explosion of a chain of amulets is a magnificent fairy show that makes Selena jump joyfully! When this happens, her assistant Batsy, a cute bat, flaps her wings so fast that she isn’t even allowed on the game screen - she could easily brush all the stones off the field and make it impossible to count the points. And it is very important to keep track of them as at the end of each level one receives a reward depending on a number of points scored. </p>\n<p>In our fun match 3 games you can also compete with your friends: a person who scores more points gets the crown. What can be more pleasant than winning in such a friendly competition?</p>\n<p>By the way, I forgot to introduce myself - I&#39;m Patrick the Leprechaun. Selena and I are good old friends ever since I lost my pot and she helped me to find it. Now I never let it out of my hands. However, I’m ready to give it to someone who manages to catch me. So, if you accept my challenge and succeed - a pot of treasure is yours. The deal is tempting, isn’t it? Then I hope to see you soon!”</p>\n<p>Now it’s time to highlight a few ingredients that make Charms of the Witch match 3 game so spellbinding:</p>\n<ul>\n<li>bright graphics and atmospheric music  </li>\n<li>dynamic carefully thought-out levels with a huge number of explosions, cool effects, and magic bonuses!  </li>\n<li>the magic world of Charms of the Witch invites the best players in the match 3 games genre to unite with friends in a fun and venturous competition. Just log into a social network to exchange gifts with friends and compete for the crown at every level.  </li>\n<li>ability to play without an Internet connection, that, you may agree, is a pleasant bonus on a long trip!  </li>\n</ul>\n<p>Let’s mix everything, add a pinch of enthusiasm and a handful of fun, dance with a tambourine to get rid of bugs, and….. Whoosh! Do you feel that the gravity of a portal has increased?</p>\n<p>Go ahead! Touch the portal and start your journey through the incredible landscapes of match 3 games along with Selena and her friends. Join us and have fun!</p>\n<p>If you have any questions, problems or wishes, here is the magic support address where everything gets solved magically quickly: support@nevosoft.com</p>", "metacritic": null, "released": "2017-01-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/066/0669e2801d6cb36142602ad7aac51912.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Nevosoft"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}