{"id": 27967, "slug": "new-super-mario-bros-u", "name": "New Super Mario Bros. U", "name_original": "New Super Mario Bros. U", "description": "<p>New Super Mario Bros. U is a new, side-scrolling adventure featuring<br />\nMario, Luigi, Toad … and your Mii character. Now’s your chance to step<br />\ninside the Mushroom Kingdom and explore new worlds, new power-ups and<br />\nnew ways to play. Up to five players* can jump into the fun, with up to<br />\nfour people using Wii Remote controllers and one on the Wii U GamePad.<br />\nThe experience is different, depending on which controller is used.</p>\n<p>The Wii U GamePad controller offers a new way to experience<br />\nmultiplayer Mario fun. Create Boost Blocks out of thin air to help<br />\nplayers navigate tricky stages or access hidden orhard-to-reach items,<br />\nand distract onscreen enemies, all with the tap of their finger or<br />\nstylus.</p>\n<p>Swoop through levels and cling to walls when Mario transforms into<br />\nFlying Squirrel Mario, or gently float through the air while hanging<br />\nonto Balloon Baby Yoshi.</p>\n<p>Boost Mode also makes cooperative speed runs possible for the first<br />\ntime. Use the GamePad to interact with and manipulate enemies and<br />\nobjects in real time, and discover new ways to find the fastest route<br />\nthrough each stage.</p>\n<p>In addition to the main Story Mode, in which players must rescue<br />\nPrincess Peach, New Super Mario Bros. U features three more exciting<br />\ngame modes, including: ◦ Boost Rush: Using Boost Mode, two to five<br />\nplayers work together to clear many different courses in the fastest<br />\ntime possible. The scene auto scrolls, forcing you to move ahead<br />\nthrough the course. As you collect more coins, the scene scrolls<br />\nfaster. Once you’ve completed your run, you can watch a replay of<br />\nother players’ Boost Rush to help strategize for your next attempt. ◦<br />\nChallenge Mode: Numerous single-player and multiplayer challenges<br />\nincorporate a series of familiar Super Mario gameplay concepts in a<br />\nfun, competitive way. These challenges offer high replay value as<br />\nplayers try to achieve the best score and unlock new challenges. Boost<br />\nMode Challenges help players practice the teamwork necessary for<br />\neffective Boost Mode gameplay. After finishing, players can watch a<br />\nreplay of their Challenge to strategize for next time.</p>\n<p>Play on the big screen or the small screen. Switch single-player<br />\ngameplay from the TV to the GamePad at any time to continue playing<br />\neven when others are using the TV.</p>\n<p>Families and friends can experience Mario together like never before<br />\nwith Miiverse. See other players’ comments and accomplishments while<br />\nyou play, and leave your own feedback for others to see when connected<br />\nto the Nintendo Network (broadband Internet access required).</p>\n<p>In-game content available for purchase using stored account funds.</p>", "metacritic": 84, "released": "2012-11-18", "tba": false, "updated": "2024-03-31T21:24:35", "background_image": "https://media.rawg.io/media/games/5f7/5f74872bea96cb395a0514bbe54e7b5a.jpg", "website": "http://newsupermariobrosu.nintendo.com/", "rating": 3.89, "rating_top": 4, "added_by_status": {"yet": 23, "owned": 69, "beaten": 155, "toplay": 32, "dropped": 47, "playing": 8}, "playtime": 48, "achievements_count": 0, "ratings_count": 142, "suggestions_count": 364, "game_series_count": 17, "reviews_count": 143, "platforms": ["Wii U"], "developers": ["Nintendo"], "genres": ["Adventure", "Platformer"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}