{"id": 279639, "slug": "neurobloxs", "name": "NeuroBloxs", "name_original": "NeuroBloxs", "description": "“NeuroBloxs” is the Casual Game for Hardcore Gamers! It’s an original “Puzzle Action Shooter” game…\r\n\r\nJust imagine to be engaged in a frenetic shoot ’em up action and at the same time to have to apply the logical and strategical skills typical of puzzle games. Think, react and shoot in a hurry to survive! You’ll be simply forced to stretch your gyrus to the limits…\r\n\r\n\r\nColoured tiles are falling down and you will be quickly overwhelmed if you not destroy them! You can decide to simply shoot or let them combine by color to disappear. Any horizontal, vertical or diagonal combination of three or more tiles is allowed. However, white tiles (with trail) cannot be combined and it’s better to shoot them, otherwise you’ll lose space to combine the other coloured tiles.\r\n\r\nSwarms of nasty aliens will keep you always under pressure, so you’ll have very limited time to react and to choose the best strategy for each shot…\r\n\r\nThe goal is not only to try to survive as long as you can, but with the best score possible! Hit aliens before landing or you will lose points. It’s also better to destroy tiles in a combination instead of shooting them one by one, because the score will be higher. If you are hit by an alien or a tile you will lose a life and points. The game is over when you have run out of lives or there is no more space for new falling tiles.\r\n\r\nYou can use the hyperspace (a teleport) and mega-bombs, but these resources are limited. You can reload them by destroying the big UFOs that will occasionally move across the top of the screen.\r\n\r\nMost of the aliens will land on the ground, however some will try to impact on the tiles, that consequently can be destroyed or, worse still, transformed into white tiles. Also, some aliens, when hit will not die, but will immediately reborn, redoubled and more aggressive. Keep this in mind for your game strategy!\r\n\r\nFinally, when the space for falling tiles will start to be short, some killer tiles will start to be spawned. Do not let them landing or you will lose a life! The killer tiles are easily identifiable by their trail.\r\n\r\nThere are 2 Game Modes (each with 3 difficulty levels):\r\nSurvival Mode. This is a fast action-packed endless runner game mode. There are six progressive increases of speed and number of objects (enemies and tiles) during a game session.\r\nLevels Mode. This game mode is more strategical. You need to achieve a minimal number of tile combinations to move to the next level. Avoid obstacles and pitfalls in 24 different and complex Levels!\r\n\r\nAre you ready for this new challenge? Try to climb to first place in the online ranking!\r\n\r\n\r\nNOTE: the game is in English language only.", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-06-04T09:59:39", "background_image": "https://media.rawg.io/media/screenshots/f2b/f2b163812ff7d73a60141f79d85373f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 39, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}