{"id": 279600, "slug": "azusa-rp-online", "name": "Azusa RP Online", "name_original": "Azusa RP Online", "description": "Roleplay Focused <br/>The game is completelly designed to allow the player to develop their character into the game's story, while at the same time interacting with other players, and being able to define the future with their actions, and, as time passes, these characters will grow old and pass away, allowing the player to play with their next generations progressively, and experience an exciting timeline.<br/><br/>Players in Azusa can develop their character into being almost anyone, or anything, from a simple baker working in a castle, to an engineer that builds a prosperous city, or even a strong and brave hunter that becomes a Guardian of Olympo, granted with enough powers to protect or destroy the world, or even a retired Guardian that uses his final years to teach and train young guardians to protect future generations!<br/><br/>In Azusa's universe villains are also other players, making it even possible to completely destroy a prosperous city, changing the direction of the game's story! <br/><br/>Guardians<br/>Since mythological eras, Hades has been trying to turn earth into his realm by killing every creature, however, when evil appears, young heroes wearing the legendary olympian armors, with fists strong enough to cut the sky and open craters on earth, risk their lives to save the world! They are known as Olympian Guardians, and, being backed by the Gods in Olympo, Zeus, Poseidon and Athena, they fight to define the destiny of earth!<br/><br/>These armors were organized in two different tiers: The ordinary guardians, who are based off creatures, showing their roles of protecting the creation, and the golden guardians, whose armors were directly crafted by the gods, and usually fight to protect them. The golden armors are organized in groups: Elites, the one assigned for those who fight for Zeus; Marines, for those who protect Poseidon and the ocean; Zodiac, for those responsible of protecting Athena's Temple; And Princes, for those responsible of keeping order in the underworld.<br/><br/>Each armor has a unique playstyle and set of skills, making the combat be a unique mixture of strategy and real time action, while also assuring that each battle is completely dynamic and unpredictable.<br/><br/>Guardians are picked by \"destiny\" as they fight in Elemental Arenas that are scattered around the entire world. Kids are commonly sent to train and grow into dangerous zones to, one day, be gifted with one of these legendary armors and, using their cosmo energy, manage to manipulate the armors' elements, developing new techniques and unique builds/playstyle.<br/><br/>Underworld<br/>After dying, the player in the Azusa world goes to the Underworld, the realm of Hades, which has been redesigned by himself to be a place of suffering and punishment for humans. With the aid of suffering, Hades is able to annihilate all that is good in the souls of those who perished, transforming them into ferocious and ruthless beings called Reapers. Now, wearing the armor of the Underworld, the Reapers' main goal are to spread death and chaos across Earth.<br/>In other words, a friend long dead may return as a villain trying to kill you and destroy everything he once loved. As the great wars continue, the destruction between nostalgic battles makes up perfect dramatic scenes of this world of Roleplay.<br/><br/>When you die, you will descend Yomotsu Mountain and find yourself near the Hell Gate;<br/>Whenever you are walking through the underworld, try to read the instructions, as they will explain each of the sections of hell (named Jails or Prisons) and what they are for;<br/><br/>After crossing the gate of Hell, you will be in the first valley of the first prison; this valley is the edge of the Acheron river; here is where the indecisive souls spend their eternity trying to cross the river in an infinite loop; there is a way to cross the Acheron River, and it is only through the Raft of Souls; To call the raft, you must drop all the money on the shore and give up your past life, the Soul Raft will take you to the second valley: the Hell's Court.<br/>In this hall there is the book of judgments, its written the names of the dead and their main sin, once you read the book and be judged, you will be taken to one of the 16 valleys within the 8 prisons of the underworld;<br/><br/>You will not be able to walk through prisons as a normal soul; you will be there suffering until you become a Reaper or be rescued; every prison has its own sufferings; and each one functions as a training method unique to that area. Once you can master the sufferings and enter the world of nightmares; you will be able to end your agonies by killing your good side; it will be a difficult battle, but if you kill it, you will return as a Reaper, the main villains of the game, who can roam freely through the prisons of the underworld;<br/><br/>Character Customization<br/>Create a unique character by customizing your appearance through numerous combinations of hair and clothing and play with one of the 5 races in the Azusa universe, not just humans, you can unlock rare races like Angels, Demons, Kappas, Lemurians and go through unique experiences while you explore the universe of the game;<br/><br/>You have the freedom to develop a perfect match for your play-style as you can decide the talents your character will have increasing each status gain directly; but Azusa's character customization is not limited to the creation window, while you play you can learn many different training methods and be trained by several masters as they will also define how strong your character will be. Your adventure will not only define the history of the world around you, but also the unique attributes of each character.<br/><br/>Civilian, Masters and Fighters​​<br/>There are 3 main classes in the game, which will also define most of your adventure in Azusa, even while fights and powers are commonly used to set the fate of the world, Azusa's universe is not simply about battles. Each of these classes will define the importance and role you will play.<br/><br/>The Civilian class hold most of the traits of utility and tend to play through a common lifestyle; do not think that civilians are determined to be weak, for they too can become powerful Guardians; The Civil class are the only ones able to learn all the civil traits at once, they can be builders, doctors, tailors, barbers, etc. And generally they are the richest classes of the game; they can build homes, furniture, create stores and more!<br/><br/>People in the Masters class are great at training friends or students as their traits help them increase the status gains of who they are training with; Masters can also develop fighting styles that will increase players' chances of a critical attack, counter-attack, or even combo of consecutive hits;<br/><br/>Fighters are the ones who have the best fighting potential as their traits increase their talents (how fast they will gain status), but only your style of play will define how strong you really can be!<br/><br/>Every class depends on each other. Use the money in game to interact and get help from each other; In addition, each class can learn a single random civil trait, so it is possible to roll a fighter with medical trait.<br/><br/>Training Methods and Ranks​​<br/>In Azusa there are many ways to become stronger; you can become one of the most powerful players in the game simply by Roleplay, but there are still several other things you can do to see some progression, most of these training methods should be learned from other players, mainly players with Ranks;<br/><br/>Ranks are characters with an important global position, such as: the king of a city, a god, a gold Guardian or a hermit living in a forest; To become a character with one of these positions you must be responsible and fit such role and lead the history of the game as such; and some of the main functions of these ranks are to teach and train future Guardians, ensuring the fluidity and dynamism of history;<br/><br/>There are more than 28 training methods so far to be learned; they are mainly organized in 3 styles, active trainings, Half Afk training and action training; Action training usually doesnt need to be learned because they are more like punching a sandbag or sparing with friends or masters. Active training methods require you to concentrate and reach certain arrow directions, these methods are the most efficient, the more concentration you get, the greater your gains. Half afk methods are the easiest to use because you can leave your character training and do other things on your computer, like watching a video on youtube, etc.<br/><br/>The active training methods are organized into three categories: Meditation, Cosmo Charge and Shadow Sparing; and you can increase your mastery in these categories while you train a method on them; but there are two different types of active training across these categories, we call them \"local training\" and \"normal training\"; local trainings can only be used in certain areas of the world, for example, a training method to try to reverse the flow of waterfalls can only be used near a waterfall, so it is a local training. Local training increases your Elemental Control, depending on the element of your cosmos, and the control will affect the damage of your elemental technique!<br/>So, training in the desert, Asgard or any of the different biomes of the Azusa world will build your character in different ways!<br/><br/>Biomes​​<br/>You can adventure through the many biomes in Azusa world, each biome has its own unique possible local training and architecture, and are commonly protected by different gods; there are also different materials in each zone of Azusa world, so if you are an explorer you can travel and commercialize resources around the world and gain decent profit, learn different architecture styles and of course, fight for the justice or destruction of a region!<br/><br/>Dungeons<br/>Administrators also have the freedom to make custom dungeons, zones filled with challenges, traps, puzzles and unique enemies that protect important secrets or treasures. Some canonical dungeons already exist in the game while others are created as global history progresses, allowing players to discover new places never seen before as they look for treasures that can help them win wars and protect the world.<br/><br/>Relics and Treasures​​<br/>Relics are objects similar to Armors, forged with a certain amount of cosmo energy inside, turning them into treasures capable of giving someone powers and techniques; Most relics hold a unique utility, others only hold an extra amount of power, but all of them are usually keys to decide a battle, some relics are so powerful that they overpower the guardian armors themselves!<br/><br/>However, these artifacts are usually collected by thieves or mythological creatures and are commonly protected by them in dungeons; but there are also custom relics made by experienced Lemurians. The relics utility vary in almost everything, from relics able to burn or poison your enemies, to relics that are able to absorb blasts or deflect them. It will all depend on your luck as you explore the games world!<br/><br/>Time Travel And Custom Gods​​<br/>The amount of things you can do and change in Azusa's universe is unlimited thanks to custom gods and time travel, systems that further enhance Roleplay's ability to affect and change history;<br/><br/>With time travel you can experience situations and events never seen before in other online games, such as going back to a point in the Azusa's base history and find canonical heroes or even travel back in the distant past and find characters that one day were played by other people. These events can even be influenced or changed by the presence of travelers! But time travel are very rare events that can affect the future on a grand scale, when these drastic changes happen, Global Story is reviewed and a \"Time Skip\" can happen;( leaps in time of 80 years), sending all players in the actual present to their next generation where the changes would be applied; It is worth mentioning that the time travel system is a complex mechanic, usually managed by one or more administrators, who, combined with the roleplay system, allow almost infinite mutability in the development of game history.<br/><br/>At other hands these journeys are also used to complement the base story, causing travelers to participate in or assist canonical events, not necessarily resulting real changes in the universe, but rather ensuring that such events have indeed taken place. Like for example joining the moment that Hades rebelled against Zeus for the first time, ending up perhaps being responsible for the first Great Wars that take much of Azusa's lore.<br/><br/>Custom Gods are systems that allow new gods to emerge to further complement the game's history, depending on whether different gods can be revived or discovered, as can be created by the players; generating with it a completely new line and direction for the main plot of this universe<br/><br/><br/>Trial Systems<br/>In the game there is a system that promotes the interaction between the players and motivates them to explore the universe and the history of Azusa as they develop their characters.<br/><br/>Similar to how tabletop RPG masters lead a campaign, administrators can modify a set of choices, tests, effects, depending on what's going on in the story. For example: A player can find a book in a library shelf that mentions the location of a dungeon, after talking about it in public, a group ends up going to the right place to explore it, they may end up falling into a hidden cave where they would go through various challenges, traps, enemies, all depending on the roll of dices, quality of roleplaying and of course, several types of end could come out of it. As a result, administrators are always able to scale up possible adventures along with the events explored by players. The trial system intertwines with several other mechanics, for example there are trials and adventures that serve as training so that young guardians can learn new methods of training or how to awaken the Sixth Sense; Or even trials whose result ends up releasing a new area of ​​the game, with new ranks or gods;<br/><br/>What differs the trial system from other MMORPG quests is that the trials are usually only completed once, with the main function of judging situations whose outcome can completely change the course of the game's history; and as trials are made and things are going on in history, managers can always create new adventures or challenges that fit the previous results. Ensuring the fluency promised by the style of the game focused on Roleplay, allowing the game experience to always be unique, since the adventure can not simply be repeated or undone.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:16", "background_image": "https://media.rawg.io/media/screenshots/5c3/5c3035322cc6bd221f8f31b81a8e939f.jpg", "website": "http://www.azusarp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Inutaishos"], "genres": ["RPG", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Inutaishos"], "esrb_rating": null}