{"id": 279785, "slug": "mountain-motor-cross-bike-sim", "name": "Mountain Motor-Cross Bike Sim", "name_original": "Mountain Motor-Cross Bike Sim", "description": "Offroad Motor-cross Bike Rider-Mountain Racing PRO is an action packed fun game. Live life on the edge! Be the Crazy bike rider. Drive your bike through amazing landscapes, Mountains and perform some amazing stunts!<br/>Fasten your seat belt and speed through some challenging levels. Each level is more thrilling than the previous level. Perform some serious stunts and race to the finish line really fast! <br/>Come and play the most exciting bike stunt game. In Offroad Motor-cross Bike Rider-Mountain Racing PRO free, you will feel like a real stunt rider! Experience the fastest and most exhilarating 3D stunts action.<br/>Racing on heavy motorcycle is a fast paced, challenging game to play. The faster you drive the higher you score! <br/>So what are you waiting for? Get Offroad Motor-cross Bike Rider-Mountain Racing PRO NOW and race to the finish line!<br/><br/>This moto extreme game brings mayhem to your mobile as you race down hill and rev your engine to hill climb to toughest challenges on your way to success. As you race to become the greatest bike racer ever and beat your friends will you be able to handle the explosions and unique obstacles each level provides or will you crash out?<br/><br/>ACCELERATE and ESCAPE in a world made for you!<br/><br/>This is the best game you'll ever play in motorcycle racing games or bike racing games. You might've played other games like this, but not this one.<br/><br/><br/>FEATURES:<br/>- Unlockable super cool Bikes<br/>- Difficult levels with steep slopes and sharp turns.<br/>- Timed Levels<br/>- User Selected Control scheme<br/>- Checkpoints<br/>- Challenging Levels of Bike Driving &amp; Racing<br/>- Realistic game sounds<br/>- Tilt steering<br/>- Simulator like controls<br/>- Easy to learn and drive<br/>- Dangerous hilly environment<br/>- Real-time Racing, Simulation, Fast &amp; Drifting<br/>- Highly Additive &amp; Immersive Gameplay<br/>- Smooth and realistic bike handling<br/>- More high octane levels coming soon", "metacritic": null, "released": "2017-04-19", "tba": false, "updated": "2019-10-22T14:39:25", "background_image": "https://media.rawg.io/media/screenshots/c50/c50352d6c3fe0a6fd99ffa2e2ee5b9de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Junaid Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Junaid Ahmad"], "esrb_rating": null}