{"id": 279781, "slug": "cargo-trailer-transport-truck", "name": "Cargo Trailer Transport Truck", "name_original": "Cargo Trailer Transport Truck", "description": "Cargo Trailer Transport Truck Simulator is a driving simulation game in a city environment and gives the driver a chance to drive heavy transportation grand truck for transporting cars, home shifting, oil drums and other lots of services. Feel like a real driver in this grand truck driving simulator and transport the cargo of your clients on their request, load cars and cargo in the trailer carefully, park it in given locations and unload it carefully. Experience the feel of a real truck transporter, Download and Play Grand Cargo Trailer Transport Truck Driver!<br/>GAME PLAY EXPERIENCE:<br/><br/>Cargo Trailer Transport Truck Simulator gives the driver an addictive game play experience and realistic city environment to drive the grand transporter heavy truck. It gives you smooth driving and handling controls which will make you play this game for hours. Be on time to satisfy your clients because being late will result in the failure of your consignment. Driving in the city traffic, not to harm pedestrians and also avoid accidents with cars and crashes, like a skilled driver. Drive the truck; transport the cargo and cars and then park the grand trailer to complete your consignment. Play like one of the best cargo trailer transporter driver in the city!<br/><br/>TRANSPORTER DRIVING MISSIONS:<br/><br/>There are multiple missions you can carry out in this game; starting missions are kept easy to make you comfortable with controls and game play. After starting few driving missions, you will face real challenges in this truck driving simulation game to transport goods and cars. In some levels you will be a car transporter driver to deliver cars for your clients on time. Some of your clients are shifting home so you have to deliver their goods, deliver woods and timber from jungle to city and a lot of missions to carryout.<br/><br/>Cargo Trailer Transport Truck Driver Key Features:<br/><br/>-\tSmooth and Easy driving Controls<br/>-\tRealistic City Environment<br/>-\tTrailer and Truck parking <br/>-\tCargo Transport Challenges in City Traffic<br/>-\tCrash effects while colliding with traffic Cars and Buildings<br/>-\t<br/>How to Play:<br/><br/>-\tUse Steering Wheel to drive your cargo truck<br/>-\tUse Brake, Reverse and Accelerate Buttons Drive. <br/>For More, Visit the Help Screen in Main Menu.<br/><br/><br/>NOTE: You can play this game for FREE and also WITHOUT INTERNET!", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2019-10-22T14:39:25", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8ef307bb4d87feca890225af9035f11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Junaid Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Junaid Ahmad"], "esrb_rating": null}