{"id": 279740, "slug": "vr-zombie-warfare", "name": "VR Zombie Warfare", "name_original": "VR Zombie Warfare", "description": "Zombie Warfare – is a fearful 360 VR horror shooter. Use VR Headset, glasses or cardboard to<br/>immerse in a world filled with zombies. Fight undead hordes without leaving home!<br/><br/>Zombie Warfare — virtual reality game.<br/><br/>Zombie Warfare is an exciting VR adventure in the world of zombie apocalypse. Explore dark<br/>dungeons of the city and fight for your live using gun. Feel the post-apocalyptic atmosphere and<br/>survive in the world full of dangers, turn ups and fear. Immerse yourself in a world where only<br/>your shooting skill saves you from becoming one of the zombies.<br/><br/>360 VR emulator — 360 degree freedom.<br/><br/>Enjoy the authentic 360 3D VR world, where an ultra-realistic virtual reality with carefully crafted<br/>sound and detailed 3D graphics are merged together. Here you are waiting for clear, bright and<br/>colorful models and characters, as well as complete freedom and an absolute unobstructed<br/>view of 360 degrees (like 3D 360 degrees cinema).<br/>Fibrum is a new word in the sphere of VR games. Test yourself as the only survivor in the ultra-<br/>detailed, dynamic world full of dangers!<br/><br/>Compatible with Virtual Reality (VR) glasses<br/><br/>Application requires virtual reality headset (hmd or Homido) or  VR-<br/>glasses such as Google Cardboard): FIBRUM VR, ANTVR, Carl Zeiss VR One GX, ColorCross,<br/>Cynoculars, Durovis Dive, Fove 0, FreeFly, Homido center (V2), Merge VR, Nibiru, Puyo Box,<br/>Refugio 3D, Stooksy, Tepoinn 3D, VR KiX, VR Smartview, VR View-Master DLX, VRTRIA,<br/>VRTX One, Xiaomi VR 3D Glasses. In addition to the above models, it is possible to use the<br/>virtual reality headset and 3D / VR glasses of other samples and manufacturers.<br/><br/>VR games free trial<br/><br/>The app implements a freemium system. During the whole trial period, you can play absolutely free! If<br/>you like the app, register a promotion code or purchase the app to use the application to the fullest and<br/>get unlimited access to it. To do this, just go through a quick registration in Fibrum Platform.<br/><br/>Fibrum Platform VR<br/><br/>Do you want to know more about Fibrum VR applications? Install and try our most popular 3D<br/>virtual reality games (vrgames). From a wide range of accessible worlds — space shooters,<br/>westerns, crazy three-dimensional races, breathtaking rides, colorful and hilarious adventures<br/>and horror worlds of zombie apocalypse, select the emotions you want to experience. Here you<br/>will find the best 3D game and virtualreality for every taste!", "metacritic": null, "released": "2015-08-05", "tba": false, "updated": "2019-10-22T14:31:49", "background_image": "https://media.rawg.io/media/screenshots/76a/76a31b8fb6ebb378b8e2f084cfeba12a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FIBRUM"], "genres": ["Action", "Arcade"], "publishers": ["Fibrum"], "esrb_rating": null}