{"id": 279725, "slug": "ukulele-extreme", "name": "Ukulele Extreme", "name_original": "Ukulele Extreme", "description": "This ukulele (uke) tutor is one of the best virtual guitar for mobile &amp; tablet. The app offers tons of songs with easy lessons, and we add new tabs every week! Don't waste more time, start playing now!.<br/><br/>Ukulele Extreme is a simulator app realistic hawaiian guitar (ukelele or 4-string mini guitar) simulator apps featuring a user-friendly interface and an awesome sound quality. Learn thousands songs, tabs &amp; chords, and create awesome music directly on your device. The app has dozens of useful options and playing modes and is a perfect fit for both beginners and mastered guitarists &amp; Ukulele (uke).<br/><br/>All the notes have been recorded from the live ukulele. With the help of Ukulele Extreme you can easily strum, pluck, and strike the strings to play the chords of any complexity and figure out your favourite tunes, riffs and songs or make up your own....<br/><br/>Main features of the app:<br/>- 650,000+ Guitar, Ukulele tabs<br/>- Play all guitar, ukulele tab with practice mode<br/>- A huge ukulele chords database with tabs (tablature)<br/>- All guitar chords with Magic chords mode<br/>- Explore guitar, bass &amp; ukulele chords, tabs for more than 650,000 songs<br/>- Supports a wide variety of keyboard instruments (Piano, Grand Piano, Pipe Organ, Harpsichord, Accordion, Electric Guitar, Harp, Cello Pizzicato, Guzheng, Nylon Guitar, Plucked String, Music Box, Sitar, Xylophone, Harp, Vibes, Clarinet, Ukulele, Brass, Thai Bells, Tabbla, Dizi, Banjo, Flute, Saxophone, Cellto, Hamonica, Trumpet, Violin, Panpipe, Maracas, Tuba, Dulcimer, Kalimba,...)<br/>- Lessons mode for easy learning<br/>- Music games to practice<br/>- Magic Ukulele mode added<br/>- Various guitar &amp; ukulele sound<br/>- Strings options to fit your finger<br/>- Awesome and beautiful design<br/>- Various skin color: Ukulele Soprano, Ukulele Concert, Ukulele Tenor &amp; Ukulele Baritone<br/>- Various works of greatest artist available<br/>- High Quality sounds of ukulele including: Soprano, Concert, Tenor &amp; Baritone<br/><br/><br/>With Ukulele Extreme, you have a real virtual pro music instrument right in your pocket ! No need to carry your instrument all the time, you can start jamming at any time, play riffs tabs and chords anywhere, anytime.", "metacritic": null, "released": "2018-12-06", "tba": false, "updated": "2019-08-02T02:59:05", "background_image": "https://media.rawg.io/media/screenshots/5dd/5ddb89f80247e73e35dda155465de969.jpg", "website": "https://www.facebook.com/Ukulele-Extreme-1561224400646316/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tran Thi Bao Nguyen"], "genres": ["Puzzle"], "publishers": ["Tran Thi Bao Nguyen"], "esrb_rating": "Everyone 10+"}