{"id": 279774, "slug": "etch-a-sketch-it", "name": "Etch A Sketch IT!", "name_original": "Etch A Sketch IT!", "description": "In Etch a Sketch IT!, you can see your photos magically etched onto an Etch a Sketch. Just take a photo or upload one from your library and see it transformed into an Etch a Sketch line drawing. You can add fun stickers and upload to your social channels! And when you want to start drawing, the Classic Etch a Sketch mode has you covered. Draw using Etch a Sketch’s classic white knobs and use new features like adjusting line thickness, line color or add stickers and patterns to make your creations totally unique! When you’re done, you can save your image, shake to erase and start your next creation!<br/><br/>FEATURES<br/>- Take a photo or upload one and see it drawn onto an Etch a Sketch<br/>- Add stickers and share from your gallery<br/>- Draw using Classic Etch a Sketch Mode and adjust line thickness, color, background and add stickers<br/>- Classic red and white Etch a Sketch design<br/>- Shake to erase!<br/><br/>For more than 50 years, children and adults alike have been discovering the magical world of creativity and pencil-free drawing with Classic Etch A Sketch! The iconic frame, easy-to-use knobs, classic magic screen and shake-to-erase feature — not to mention the endless hours of fun it provides — have made it popular all around the world! Sketch, erase, and sketch again with Etch A Sketch.<br/><br/>CONNECT WITH US<br/>Visit our official site at http://etchasketch.com<br/>Privacy Policy http://etchasketch.com/privacypolicy<br/>Terms of Use http://etchasketch.com/termsofuse<br/> <br/>SUPPORTED DEVICES<br/><br/>This app supports these devices:<br/>1. iPad 4 and above<br/>2. iPad Mini and above<br/>3. iPhone 5 and above<br/>4. iPod Touch 5th Gen. and above<br/>Updates may affect compatibility.<br/> <br/> <br/>SPIN MASTER:<br/>Etch a Sketch is part of Spin Master, a multi-category children's entertainment company. Since 1994, Spin Master has been designing, developing, manufacturing and marketing consumer products for children around the world and is recognized as a global growth leader within the toy industry. Hatchimals, Paw Patrol, Air Hogs, Kinetic Sand, Zoomer, and Tech Deck are a few of the Spin Master Brands. http://www.spinmaster.com/<br/> <br/>Note:<br/>·       This app is free to download and contains no in-app purchases.<br/>·       This app requires acceptance of Spin Master’s Privacy Policy, TOS and EULA", "metacritic": null, "released": "2017-06-29", "tba": false, "updated": "2019-10-22T14:31:51", "background_image": "https://media.rawg.io/media/screenshots/d86/d86bfa0213c9a50e005c4417fcfbf49f.jpg", "website": "http://etchasketch.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Spin Master"], "genres": ["Family"], "publishers": ["Spin Master"], "esrb_rating": "Everyone 10+"}