{"id": 279741, "slug": "crazy-swing-vr", "name": "Crazy Swing VR", "name_original": "Crazy Swing VR", "description": "Take a ride on a fantastic swing in virtual reality! Soar to the highest skyscrapers and brace yourself<br/>for a breathtaking flight down. You will definitely remember this ride!<br/><br/>Compatible with Virtual Reality (VR) glasses<br/><br/>The application requires a virtual reality headset (Google Cardboard-like): FIBRUM VR, ANTVR, Carl Zeiss<br/>VR One GX, ColorCross, Cynoculars, Durovis Dive, Fove 0, FreeFly, Homido center (V2), Merge VR, Nibiru,<br/>Puyo Box, Refugio 3D, Stooksy, Tepoinn 3D, VR KiX, VR Smartview, VR View-Master DLX, VRTRIA, VRTX<br/>One, Xiaomi VR 3D Glasses. In addition to the above models, it is possible to use the virtual reality<br/>headset and 3D / VR glasses of other samples and manufacturers.<br/><br/>360 VR emulator — 360 degree freedom.<br/><br/>Enjoy the ultra-realistic 360 3D VR world with detailed graphics and carefully crafted sound merged<br/>together for the most immersive atmosphere.<br/>Put on your VR-headset and experience an incredibly emotional adventure in virtual reality.<br/><br/>VR games free trial<br/><br/>The app implements a freemium system. During the whole trial period, you can play absolutely free! If<br/>you like the app, register a promotion code or purchase the app to use the application to the fullest and<br/>get unlimited access to it. To do this, just go through a quick registration in Fibrum Platform.<br/><br/>Fibrum VR<br/><br/>Do you want to know more about Fibrum VR applications? Install and try our most popular 3D virtual<br/>reality games (VRgames). Select one of the many virtual worlds: space shooters, westerns, crazy three-<br/>dimensional races, breathtaking rides, colorful and hilarious adventures as well as horrors of zombie<br/>apocalypse. We have a 360 VR experience for every taste!", "metacritic": null, "released": "2014-11-18", "tba": false, "updated": "2019-10-22T14:31:49", "background_image": "https://media.rawg.io/media/screenshots/b9f/b9f72a2d980ab76b4018304db28fe03c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FIBRUM"], "genres": ["Adventure", "Arcade"], "publishers": ["Fibrum"], "esrb_rating": null}