{"id": 279736, "slug": "beauty-rivalry-dress-up-story", "name": "Beauty Rivalry: Dress up Story", "name_original": "Beauty Rivalry: Dress up Story", "description": "【Descriptions】<br/><br/>Beauty Rivalry is a card game that includes dressing and makeup, telling a love story in the Forbidden City. As a firstborn daughter of an eminent family, you were sent to the palace to attend beauty selection. You didn't mean to be a lady in the palace, but the Emperor fell in love with you at the first sight. Other Concubines were green with envy. Life in palace were full of schemes and dangers, forcing you to toss between love, friendship, fate, conspiracy and betrayal. What will you do? Accept it or fight it, it's entirely up to you. <br/><br/>【Feature】<br/><br/>[Story]<br/>Not only can you read the main story, you can also write your own story in branch story to get different ends.<br/><br/>[Dressing]<br/>Collect materials to craft your finery and take a well dress in Harem. More than 300 clothes can be collocated, makes you be a dress up queen! From head to toes, there are endless possibilities!<br/><br/>[Makeup]<br/>Hundreds of makeup to choose from! Court style, mythological style, vintage style……any style you want is all included here! Change your eyes, mouth, and more to customize your personal look!<br/><br/>[Love]<br/>Find your perfect love here, get married then, have a Prince. This game is an easy way to spend time with your partner.<br/><br/>[Palace Life]<br/>Enjoy life in the Palace. Rurality, Fishing, cooking and more. You may have a pet in your mansion.", "metacritic": null, "released": "2018-12-26", "tba": false, "updated": "2019-10-22T14:31:48", "background_image": "https://media.rawg.io/media/screenshots/e0c/e0cb7842f34152ed812db9cd60b6b771_mwUBVS1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RENREN HU YU"], "genres": ["RPG", "Card"], "publishers": ["RenRen Hu Yu"], "esrb_rating": "Teen"}