{"id": 279832, "slug": "word-guru-puzzle", "name": "Word Guru Puzzle", "name_original": "Word Guru Puzzle", "description": "The best word searching puzzle game \"Word Guru Puzzle\" is here! It ‘s a puzzle game for training your brain and learning new words! Just swipe the letter to Word Guru Puzzle and get stars !<br/><br/>What makes Word Guru Puzzle so special!<br/>-Simple, easy and addictive game!<br/>-Contains numerous words<br/>-Return to try again the completed rounds!<br/>-Get stars to unlock new rounds.<br/>-Gorgeous graphic.<br/>-No time limited, take your time to find new words!<br/><br/>You may play many word searching games before, and felt invincible. If you wanna prove yourself again, the wholly new word search game -Word Guru Puzzle is waiting for your challenge! <br/>【Warm Notice】<br/>※ Completely free to download and play, however some game items can also be purchased for real money.<br/>※ Play with a reasonable time and restrain from overindulgence.<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/>Subscription options<br/>In our game we have the following subscription options:<br/>Membership offers a weekly subscription for $2.99.<br/>It gives 150 Coins every day.<br/>Moreover, it removes all banner ads and pop-ups.<br/><br/>End of trial period and subscription renewal<br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial period or subscription<br/>You can turn off the auto-renew for the subscription whenever you want in the settings if your iTunes account. Check https://support.apple.com/HT202039.<br/>When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option.<br/>If you have any questions or comments, feel free to contact us at zouguo@ileadsoft.com<br/>Privacy Policy: http://www.ileadsoft.com/about/show.php?lang=cn&amp;id=106<br/>Terms of Use: http://www.ileadsoft.com/about/show.php?lang=cn&amp;id=107", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-10-22T14:31:52", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba6bd264c3ecbf243b13ca81117cd1e1_zUzHFss.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arabbaramj"], "genres": [], "publishers": ["iLead software co"], "esrb_rating": null}