{"id": 279899, "slug": "winter-timber-truck-simulator", "name": "Winter Timber Truck Simulator", "name_original": "Winter Timber Truck Simulator", "description": "Get ready for challenging winter missions. You can drive a real timber truck in the Winter Timber Truck Simulator. Explore winter forest and enjoy the timber truck simulator atmosphere. It is not easy simulator. Learn how to drive a timber truck and carry your timber cargo in winter. Do you like cargo games and driving? So, it is time to drive in Winter Timber Truck Simulator. Drive to feel the power of timber truck. Drive in winter without roads, it is a great cargo truck simulator for real men!<br/><br/>Features of Winter Timber Truck Simulator:<br/><br/>- Truck upgrades<br/>- Easy driving controls<br/>- Offroad winter terrain<br/>- Great 3D graphics<br/>- Real trucks sounds<br/>- Day and night change<br/>- Many NPCs with unique missions<br/>- Mud physics<br/>- Weather effects<br/>- Career mode<br/>- Open World mode<br/>- Navigation map<br/><br/>Get a timber truck and become a professional driver in winter!<br/><br/>Feel like a real worker! Load and drive your timber cargo and be fast, other timber workers are waiting for timber truck. Drive across winter roads in the simulator. Earn money and upgrade your timber truck. Test your timber truck driving skills in winter with the simulator. Use a timber crane to load and unload logs to your timber truck. Drive carefully and don't lose your cargo in the big winter forest. Deliver your timber cargo. Fight with offroad terrain in the simulator. Test the power of timber truck. It is great timber truck simulator! Drive and don't lose your timber cargo.<br/><br/>Today is the best day to drive a cargo truck with our timber truck simulator. Load and unload your timber truck with cargo. Then drive your timber cargo in winter. Complete missions in the simulator and enjoy the winter offroad. Drive your cargo in timber truck and earn money. Then upgrade to drive cargo faster.<br/><br/>Complete timber deliveries. Try to transport timber cargo in winter, race your timber truck and be accurate! Timber guys don't like waiting for cargo. Drive to destination point. Drive like a timber truck driver with our simulator. Finish all timber cargo missions.<br/><br/>Become a timber truck driver with Winter Timber Truck Simulator!", "metacritic": null, "released": "2017-01-21", "tba": false, "updated": "2019-10-22T14:31:55", "background_image": "https://media.rawg.io/media/screenshots/100/100da58d95f4189710cafa83492fb4ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": "Everyone 10+"}