{"id": 279854, "slug": "get-number-one", "name": "Get Number One", "name_original": "Get Number One", "description": "Thanks for your support!<br/><br/>***If you don't like puzzle games: please do not download!<br/><br/>US Customer:<br/>\"SUPER ADDICTING..LIMITLESS CHALLENGE - Once you figure out how it works...takes a little time...this is really a great game! If you enjoy number puzzle games like sudoku, you will definitely enjoy this one. Give it a chance!\"<br/><br/>You like to think ahead, you are a strategist, you are in control, the puzzle comes to its solution..BUT WAIT: \"what's this 3 doing here?\"<br/><br/>\"Numbers to 1\" is an exiting new puzzle concept for those who like to use (and train) their brains.<br/><br/>If you like sudoku, *traffic jam*, Rubik's Cube, river crossings, or other logic/ strategic puzzles, you will like this one!<br/><br/>The objective of the game is to get all the numbers to 1 using strategical moves; just tap, no sliding needed. The moving number will be decreased by the number(s) it passes. If e.g. a 6 jumps over a 1 and a 2 it becomes a 3 (6-1-2 = 3). Final gap must be bottom right!<br/><br/>Lower levels are for learning, higher levels become challenging!<br/><br/>Tip: if you're stuck turn on the colors to see which numbers belong to which columns: look at the stripes beneath them.<br/><br/>The higher levels are more difficult, but you can play as many puzzles at one level as you like!<br/><br/>FEATURES:<br/>- Almost unlimited number of addictive and challenging puzzles<br/>- Choose 5 dimensions at will<br/>- Remembers score per dimension<br/>- Colors on/off for less/more challenge<br/>- Cool, clear graphics<br/>- Easy to learn, difficult to master", "metacritic": null, "released": "2015-11-06", "tba": false, "updated": "2019-10-22T14:31:53", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffe5ea68362d68a3135a8ed19fc474a4_2eSINzM.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Yi Min Shen"], "genres": ["Strategy", "Puzzle"], "publishers": ["Yi Min Shen"], "esrb_rating": "Everyone 10+"}