{"id": 279845, "slug": "black-jack-21-dot-free", "name": "Black Jack 21 Dot Free", "name_original": "Black Jack 21 Dot Free", "description": "21 points is generally used in the 1-8 decks of cards. Makers winning numbers to each player two cards face above; to two cards, a card face up (called the winning numbers), a card face down (called dark card). The calculation of the hands of poker points: K, Q, J, and 10 license are counted as 10 points. A license can be counted as of 1 points can also be counted as of 11:00, decided by the players themselves. All the rest of the 2-9 license according to its original face value. First, players began to take another card if the players get the first two cards is an A and a 10-point card, it has a Black Jack (Blackjack); this point, if the dealer does not have Black Jack, players will be able to win two times stake (1 lost). If the dealer winning numbers an A, the players can consider buying a insurance, the amount is half of the gambling chips. If the banker is a blackjack, the players back the insurance money and win; If the banker does not have blackjack the player loses the insurance to continue the game. Black Jack the player can continue to take cards, free how. As far as possible to 21 points, rely on, the closer the better, the best is 21 points. In the licensing process, if all the cards add up to more than 21 points, the players lose - call ringing off the hook (Bust,), the game also 21 points bust schematic end. If a player is not ringing off the hook, they decided not to card when the dealer put that dark card to open it. Usually 17 points or 17 points is no longer to take the card, but there may be 15-16 or 12-13 points is not a chance to brand or 18-19 continue to take the brand. If the banker is ringing off the hook, and then he lost. If he was not ringing off the hook, then you are with him than the point size, greatly win. The same number of points for a tie, you can get back your bet.<br/><br/>21点一般用到1-8副牌。庄家给每个玩家发两张明牌，牌面朝上面；给自己发两张牌，一张牌面朝上(叫明牌)，一张牌面朝下(叫暗牌)。大家手中扑克点数的计算是：K、Q、J 和 10 牌都算作 10 点。 A 牌既可算作1 点也可算作11 点，由玩家自己决定。其余所有2 至9 牌均按其原面值计算。首先玩家开始要牌，如果玩家拿到的前两张牌是一张 A 和一张10点牌，就拥有黑杰克(Blackjack)；此时，如果庄家没有黑杰克，玩家就能赢得2倍的赌金（1赔2）。如果庄家的明牌有一张A，则玩家可以考虑买不买保险，金额是赌筹的一半。如果庄家是blackjack，那么玩家拿回保险金并且直接获胜；如果庄家没有blackjack则玩家输掉保险继续游戏。没有黑杰克的玩家可以继续拿牌，可以随意要多少张。目的是尽量往21点靠，靠得越近越好，最好就是21点了。在要牌的过程中，如果所有的牌加起来超过21点，玩家就输了——叫爆掉(Bust)，游戏也 21点爆牌示意图就结束了。假如玩家没爆掉，又决定不再要牌了，这时庄家就把他的那张暗牌打开来。一般到17点或17点以上不再拿牌，但也有可能15到16点甚至12到13点就不再拿牌或者18到19点继续拿牌。假如庄家爆掉了，那他就输了。假如他没爆掉，那么你就与他比点数大小，大为赢。一样的点数为平手，你可以把你的赌注拿回来。", "metacritic": null, "released": "2015-03-14", "tba": false, "updated": "2019-07-01T03:32:21", "background_image": "https://media.rawg.io/media/screenshots/38a/38a8224259fb4b2423928ff97a854e49.jpg", "website": "http://www.59186618.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yi Min Shen"], "genres": ["Card"], "publishers": ["Yi Min Shen"], "esrb_rating": "Teen"}