{"id": 279996, "slug": "beware-of-the-bad-seed", "name": "Beware Of The Bad Seed", "name_original": "Beware Of The Bad Seed", "description": "It’s up to you to protect the magical garden and save the daisy in distress. The never ending waves of naughty, carnivorous plants threaten the life of daisies everywhere in this mystical world! Take charge and be the hero! Beware of the Bad Seed and whack those carnivores into oblivion. Click “…More” to learn why you should download this App today! <br/><br/>You’ve been charged with a mission: protect the daisies and strawberries from those nasty, toothy carnivores. You must hit them in the head and clear them out of the magical garden as fast and furiously as you can. Tapping the screen with your finger, you rid the world of four of those beasties right away but watch out; you don’t want to hurt one of those happy, dancing daisies! <br/><br/>As you play Beware of the Bad Seed, it will probably remind you of that arcade room classic, Whack a Mole. That’s because this is a revamped version but with a highly addictive 3D plant twist. <br/><br/>You’ll never have to worry about getting bored with Beware of the Bad Seed, there’s variety packed into every download. With three game modes, two display modes and three types of villainous daisy killers, you’ll never tire of saving those sweet little daisies. Oh yes, there’s a strawberry that needs saving, too. See, variety and surprise is waiting for you here. You just never know what’s going to pop up where. <br/><br/>The graphics are awesome, too. You’ll be playing in incredible 3D clarity that makes those smiling flowers and the bad plants’ menacing mouths seem all the more real. <br/><br/>Beware of the Bad Seed is easy to play. You only need you Mac, your finger and your track pad or mouse to smack the bad guys and perform your garden rescue. No extra equipment is required to irradiate the nasty carnivores and work your way to scoring on the leaderboard. <br/><br/>Features you get in Beware of the Bad Seed: <br/><br/>• User friendly, intuitive interface\u2028<br/>• Three game modes: time attack, arcade and Tic Tac Toe<br/>• Retina display support.<br/>• Game center integration (requires OSX Mountain Lion).<br/>• Three types of naughty plant : carnivorous simplus, arnivorous toxicus, carnivorous rarus\u2028<br/>• One cute daisy and one tasty strawberry.<br/><br/>Come on, the daisies and strawberries are counting on you! Download Beware of the Bad Seed now and be their hero. <br/><br/>Have fun! <br/><br/>See this App in action here: http://www.youtube.com/watch?v=p7AQVqaPDTw and join our Facebook page: http://www.facebook.com/pages/Beware-of-the-Bad-Seed/120155958022690", "metacritic": null, "released": "2010-06-10", "tba": false, "updated": "2019-10-22T14:31:57", "background_image": "https://media.rawg.io/media/screenshots/ef9/ef913621090a474b6ca13156698b4206_RY9u5KL.jpg", "website": "http://www.realtech-vr.com/bbseeds/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["Realtech VR"], "genres": ["Arcade", "Family"], "publishers": ["Stephane Denis"], "esrb_rating": null}