{"id": 279932, "slug": "restaurant-mania-little-additive-fun-free-game", "name": "Restaurant Mania - little additive fun free game", "name_original": "Restaurant Mania - little additive fun free game", "description": "Start your diner business&amp; expand your hotels chain all over the city. <br/><br/>You own a fast-food restaurant and you have to cook delicious meals for your customers.<br/><br/>Have fun cooking delicious meals in your restaurant kitchen for your customers , increase your marketing budget so you have even more clients to your restaurants and have a lower delay time between every client<br/><br/>Restaurant Mania tests your time &amp; resource management skills. Take orders, cook food and serve customers as quick as possible to earn maximum profit. By providing speedy service and delicious food, please customers and earn big tips to keep the town’s diners in business.<br/>Your hard earned money then can be used to decorate interiors, use beautiful cookery, improve ambience of your very own restaurant to create center of attraction in the city.<br/><br/>Carry enough food stock to cater daily customer demands. Soothe impatient guests before they get angry and pay less. As restaurant’s popularity increases, you earn more money. Experience the situation and strategy of real cafe business.<br/><br/>Create a restaurant Mania story of yours who aspired and established a successful Diner business and eventually became the great Restaurant Mania.<br/><br/>Download &amp; become Restaurant Mania now!<br/><br/>Game Features: <br/>• Design and build a unique cafe with stunning variety and creativity. <br/>• Colorful and vivid graphics.<br/>• Simple and easy-to-use tap interface.<br/><br/><br/>If you like our work, please like us on Facebook, to offer you better games. FOLLOW US at https://www.facebook.com/photongames<br/><br/>Also, watch out game trailer on YouTube!", "metacritic": null, "released": "2016-02-11", "tba": false, "updated": "2019-10-22T14:31:56", "background_image": "https://media.rawg.io/media/screenshots/c6a/c6a96d7e5cb1ec0c7e0642b60c5d566e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiran Jodhani"], "genres": ["Board Games", "Family"], "publishers": ["Kiran Jodhani"], "esrb_rating": null}