{"id": 279991, "slug": "iron-fist-boxing", "name": "Iron Fist Boxing", "name_original": "Iron Fist Boxing", "description": "Don’t settle for imitations! Iron Fist Boxing is THE original real-time 3D MMA fighting game, the first one ever produced for the AppStore. Totally revamped to offer you the ultimate in fighting challenge, Iron Fist Boxing now features a new input system, longer career mode, more game modes and all the characters you could ever ask for. Click “…More” to learn why you should download this App today!<br/><br/>“Overall, this is one of the better fighting games on the iPhone. After you get past the initial difficulty factor and get the hang of the combos and powerups, you should have a fun time playing with Iron Fist Boxing 2nd Round.”<br/>- Unnamedgeek.com/<br/><br/>Today, you’ve decided to take your fighting career to a new level. Training hard for the World circuit, your arms ache as you pummel the punching bag, building the muscles, focus and technique that you’ll need to win. <br/><br/>Nothing and no one else exists in this moment, it’s just you and the sound of your gloves slapping the bag. You’re going to be the next champ if it kills you. And it might.<br/><br/>Iron Fist Boxing is the original, real-time 3D MMA fighting app. Don’t be fooled by imitations, if you want authentic, heart-racing action, incredible next generation graphics and the absolute ultimate in gaming challenge. <br/><br/>This application pushes the envelope, offering you six different game modes, as well as nearby multiplayer capability. It’s non-stop action, all the way, as you train, spar with a friend or live out your fantasy fight career.<br/><br/>You’ll experience high quality audio and real-time 3D graphics that have never been seen before, thanks to the app’s retina display support. Regardless of which device you’re using, the camera views are spectacular and your screen, with its easy multitouch controls, may give you an unfair advantage over your virtual opponent.<br/><br/>There are 32! characters for you to fight in this fast-action game. They all have MMA combat styles and are not above throwing in a few other disciplines to take you down: Boxing, Muay Thai, Savate, Kick Boxing, Brawler and Full Contact. <br/><br/>You’ve got your work cut out for you, if you want to claim the title, better start training now. To help you out, the app features many super moves and dodges.<br/><br/>If you win, congratulations! Your achievements will appear online for the whole world to see and your name will grace the global leaderboard to let everyone know you’re a champ.<br/><br/>Why not challenge a friend to a sparring match to see which one of you is the better fighter, or just for a fun game.<br/><br/>Look at some of the features you get in the amazing Iron Fist Boxing:<br/><br/>• The original, real time 3D MMA fighting game.<br/>• Optimized and multitouch for maximum performance and speed<br/>• 32 different challenging characters<br/>• 6 play modes - Story, sparring, training, Speed Bag training, Punching Bag training and Punch-o-Meter<br/>• Incredible camera views<br/>• Multipeer connectivity support for multiplayer sparring mode.<br/>• Accelerometer for flexible playing.<br/>• Game Center enabled with leaderboard and achievements<br/>• Gain access to new costumes and new attacks.<br/><br/>Download Iron Fist Boxing now and use challenging fun to see what you’re made of.<br/><br/>See this App in action here: http://www.youtube.com/watch?v=73FyKVgYiZ<br/><br/>Compatible with iPhone 5, 6 and 6+", "metacritic": null, "released": "2008-12-24", "tba": false, "updated": "2019-10-22T14:39:51", "background_image": "https://media.rawg.io/media/screenshots/705/705a9dfbebfc71aa47e9f48581f11dd7.jpg", "website": "http://www.realtech-vr.com/ironfistboxing/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Realtech VR"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Stephane Denis"], "esrb_rating": "Teen"}