{"id": 280067, "slug": "stories-gone-mad", "name": "Stories Gone Mad", "name_original": "Stories Gone Mad", "description": "Poindexter, a pint-sized scientist, has grown bored with his library of stories. He wants to make his stories more interesting and that's where you come in! You will need to feed Poindexter's super computer a series of words so that she can insert them in a story to generate something new and exciting. That's right, his computer is a \"she\".<br/><br/>Stories:<br/><br/>Read existing stories or ad lib and write new stories of your own. This app contains original stories, fairy tales, nursery rhymes, and even the popular MASH game. Many stories adapted from classical works have new twists and have been rewritten as madlibs. Here are some of the stories available in the app:<br/><br/>Note: any story marked with (*) is not available in the free version<br/>- The Three Little Pigs<br/>- Little Red Riding Hood<br/>- Cinderella*<br/>- The Ugly Duckling<br/>- M.A.S.H. (short and long versions)<br/>- Hansel &amp; Gretel*<br/>- The Tortoise and the Hare<br/>- Jack and the Beanstalk<br/>- Rumplestiltskin<br/>- Goldilocks and the Three Bears<br/>- Hey Diddle Diddle<br/>- The Revolting Blob<br/>- The Frog Prince<br/>- The Lion and the Mouse<br/><br/>Target Audience &amp; Education:<br/><br/>This game can be enjoyed by anyone. It has been made suitable for younger children but, older crowds will still appreciate the humor thrown in and should not hesitate to try this out. This app may be suitable for kids as an educational tool to help them learn about English words, nouns, verbs, adjectives, adverbs, grammar, and sentence structure. Stories are reviewed and edited by English and Education professionals in Canada.<br/><br/>Content &amp; Updates: <br/><br/>Stories written by the app Developer are mainly shortened versions of classic fairy tales that have been adapted to work with this app so, they are a different take on these stories and sometimes even have new twists. This app works offline, too! You will want to be connected to a network the first time you load this up to get initial content so, go ahead and open it as soon as it finishes installing. The libs (library of stories) will continue to update in the future whenever you open this app with a network connection.<br/><br/>Disclaimer:<br/><br/>When a story is created in the app or is shared and leaves the domain of the app, it is no longer property of the app Developer and becomes the property or creation of the user. The author of Stories Gone Mad is not responsible for words used (or combinations of words) that can be made offensive to someone.", "metacritic": null, "released": "2013-12-02", "tba": false, "updated": "2019-10-22T14:39:52", "background_image": "https://media.rawg.io/media/screenshots/d06/d0641a4f3ee91bda126af100ec85638c.jpg", "website": "http://mobilewebsmart.com/StoriesGoneMad", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brendan Barr"], "genres": [], "publishers": ["Brendan Barr"], "esrb_rating": null}