{"id": 280261, "slug": "quest-for-the-book-of-truth", "name": "Quest for the Book of Truth", "name_original": "Quest for the Book of Truth", "description": "<p>This game is made with PICO-8. This game is also hosted at https://www.lexaloffle.com/bbs/?tid=32727.</p>\n<p>PICO-8 is a fantasy console. More information about PICO-8 can be found here: https://www.lexaloffle.com/pico-8.php.</p>\r\nHow to play\r\n<p>On the title screen, press the <strong>Z key</strong> or the <strong>X key</strong> to start the game.</p>\n<p>Once the game is started, your character can be moved around the screen using the <strong>arrow keys</strong>.</p>\n<p>The <strong>Z key</strong> will use the item shown in the top-right of the screen. You will start with a sword, but you will need to find other items in order to complete the game.</p>\n<p>Pressing the <strong>X key</strong> will open a menu which shows the name of your current item. Once you have obtained other items, you can switch which one is being used by pressing the <strong>up and down arrows</strong>. Press the <strong>Z or X key</strong> to close the menu and continue playing.</p>\n<p>The game treats the <strong>C and V keys</strong> as equivalent to the <strong>Z and X keys</strong>.</p>\r\nObjective\r\n<p>To complete the game, you will need to obtain the <strong>Book of Truth</strong>. In order to do this, you will need to explore the game's world and find useful tools.</p>\r\nItems\r\n<p>You will need to find multiple items in order to reach the Book of Truth. Below are some of the items you will be able to find.<br/></p>\n<p>You may find other items during your adventure. It's down to you to figure out how to use them!</p>\r\n Sword\r\n<p>You start the game with this item. It's a good weapon for dealing with enemies. You can even swing it while moving!</p>\r\n Bow and Arrows\r\n<p>This item can be used to attack enemies from a distance. If you hold the button down, you can move around before you shoot the arrow. It can also be used to hit switches from further away. You won't ever run out of arrows, so you can use as many as you like.</p>\r\n Bombs\r\n<p>This item can be used to break cracked rocks. It's also a powerful weapon! A bomb will explode a short while after it is placed. You won't ever run out of bombs, but you will need to wait a little bit after using one before you can place another. It's not possible to hurt yourself with a bomb, so there's no need worry about that.</p>\r\n Teleport Rod\r\n<p>This magical item will teleport you to its tip when you release the button. It is not possible to teleport into solid objects. An image will appear when you hold the button down to show you where you will warp to. It will be green when it is possible to warp.</p>\r\n Potion of Life\r\n<p>When you find one of these potions, your maximum life will increase. As a bonus, your current life will be refilled.</p>\r\n Key\r\n<p>These keys are required to open the gates blocking your way to the Book of Truth. You will need one key for each gate.</p>\r\nObjects and Obstacles\r\n<p>The world is full of interesting objects and obstacles. Here are some of the things you may encounter:</p>\r\n Treasure Chests\r\n<p>You can open a treasure chest by approaching it from below. Who knows what's inside?</p>\r\n Blue Switch and Moving Blocks\r\n<p>When you hit a blue switch with one of your items, it will cause all of the moving blocks to change positions. When a block is raised, you won't be able to walk past it. Each blue switch will affect all blocks in the game, so try to plan ahead.</p>\r\n Orange Switch\r\n<p>When you hit an orange switch with one of your items, it cause something to happen nearby.</p>\r\n Gate\r\n<p>These gates will block your way to the Book of Truth. Each one requires a key to open it.</p>\r\n Fusion Altar\r\n<p>This mysterious altar is crucial to completing the game. It can be used to enhance the functionality of your items. After you have found it, you will need to visit it multiple times to be able to reach the Book of Truth. Its strange power can be used by approaching it from below.</p>\r\nTips and Advice\r\n<ul><li><strong>Make good use of your items</strong>\r\nWhen you get a new item, try it out so that you know what it does. Think about places you have seen where you might be able to use that new item!</li><li><strong>The world can be confusing</strong>\r\nOne of the biggest challenges in this game can be figuring out where everything else is in relation to each other. If you're struggling to remember where everything is, consider drawing a map as you explore.</li><li><strong>Take note of locked treasure chests</strong>\r\nSometimes you'll see a treasure chest that you cannot obtain with your current equipment. There's likely something important in there, so make sure you remember to come back for it later!</li><li><strong>Death is not the end</strong>\r\nIf your life reaches 0, you will be returned to the game's starting point. You'll get to keep everything you've obtained though, so don't feel disheartened! If you're finding one place too difficult, try going somewhere else and coming back later.</li></ul>\n<p>Good luck on your quest!</p>", "metacritic": null, "released": "2018-12-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e2c8363ddeeb6a0b433eec168354ba4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mush"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}