{"id": 280406, "slug": "bombyourfriend", "name": "BombYourFriend", "name_original": "BombYourFriend", "description": "___Game Concept :<p>‘Bomb your friend’ est un jeu en 2D vu de profil, jouable en multijoueur local. Durant des manches rapides, une bombe apparaît sur un joueur aléatoire, ce dernier doit s’en débarrasser avant la fin d’un compte à rebours d’une minute par manche.<br/>Il doit entrer en contact avec son adversaire pour lui transmettre la bombe. Ce dernier doit donc fuir à tout prix.</p>\n<p>___</p>Scénario :\r\n<p>Nous sommes en 2009, dans un futur lointain. Deux amis scientifiques de longue date ont enfin mis au point une bombe révolutionnaire : une bombe qui ne fait exploser que son porteur. Elle pourrait donc pallier les décès collatéraux liés aux bombes destructrices encore utilisées partout dans le monde. Ce grand projet a été dévoilé dans un salon mondial des inventions. Mais, lors de la présentation, la tension monta et des frictions se firent ressentir entre les deux collègues. Une violente dispute explosa, pour savoir lequel était le vrai inventeur de cette poule aux œufs d’or...</p><p>___<br/></p>\r\nConditions de victoire:\r\n<p>Pour gagner, le joueur ne doit pas avoir la bombe sur lui à la fin du compte à rebours. Le jeu se déroule sur trois manches d’une minute chacune.</p>\n<p>Il n’y a aucun moyen de laisser la bombe sur le sol, de couper le compte à rebours ou d'empêcher l’explosion.<br/>Le seul moyen de gagner est donc de faire exploser son adversaire.<br/>Au bout des trois manches, le joueur ayant deux manches gagnées, gagne la partie.<br/>La bombe apparaît trois secondes après le début de la manche, et est donnée à un joueur aléatoire.<br/>Le joueur porteur doit donc se déplacer vers l’autre joueur pour lui céder la bombe.</p><p>___<br/></p>\r\nLa musique :\r\n<p>‘Bomb Your Friend’ utilise deux musiques :</p>\n<p>Au menu principal, la musique est : « Tokyo Rose – Armageddon »<br/>J’ai choisi cette musique car elle correspond au menu principal : elle symbolise la Retrowave, a un rythme adapté et une durée suffisamment longue.</p>\n<p>Durant les manches : J’ai composé la musique pour l’occasion sur ‘Music Maker’, un logiciel de Musique Assistée par Ordinateur, en utilisant des boucles et des instruments directement inspirées des années 80.<br/>La musique dure exactement une minute, pour correspondre à la durée des manches.</p>\n<p>Pour immerger le joueur et augmenter l’importance de la musique dans ‘Bomb Your Friend’, l’arrière-plan est animé en rythme avec la musique</p>\n<p>Disponible pour écoute ici :<br/>L'OST de BombYourFriend a écouter sur SoundCloud !</p><p>___<br/></p>\r\nGenre:\r\n<p>Multijoueur en local, Action, Intense, 2D, Plateforme, Arcade, Compétitif</p><p>___<br/></p>\r\nThème:\r\n<p>Années 80’s, Rétro, Imitation du futur imaginé dans les années 80’s, Retrowave</p><p>___<br/></p>\r\nDéjà disponible:\r\n<p>Le personnage peut se déplacer sur le terrain de droite à gauche, ainsi qu’effectuer des sauts.<br/>La bombe est distribuée en début de partie et se donne en rentrant au contacte du joueur.</p>\n<p>Les touches ‘Q D’ et ‘← →’ permettent un déplacement latéral du personnage,<br/>Les touches ‘Z’ et ‘↑’ permettent au personnage de sauter.</p>\n<p>La touche « Echap » est utilisée pour mettre le jeu en pause.</p><p>___<br/></p>\r\nA venir...:\r\n<p>Immobilité impossible : A partir du moment où le joueur a lancé un déplacement, celui-ci ne s'arrête pas jusqu’à ce qu’un autre mouvement soit donné, il est donc impossible de rester immobile. Par exemple, si le personnage part sur la gauche, il continuera sur la gauche jusqu'à ce qu’un autre ordre soit donné.</p>\n<p>Tacle : Le tacle est l’action principale de combat dans le jeu. Réservée au porteur de la bombe, elle permet d’effectuer une ruée vers l’avant pour rattraper le fugitif, l’étourdir un bref instant, et lui donner la bombe. Ce mouvement a un temps de recharge de cinq secondes.</p>\n<p>Esquive : L’esquive est l’action défensive disponible pour le fuyard. Elle lui accorde une ruée également, mais elle contient un temps de recharge plus long que le tacle, à utiliser donc, au bon moment. Ce mouvement a un temps de recharge de sept secondes.</p>\n<p>Bombe projetable : Le joueur peut projeter la bombe à courte distance pour tenter de toucher son adversaire. Tel un élastique, si la bombe ne touche pas l’adversaire, la bombe revient vers son lanceur et il ne peut pas réitérer cette action pendant dix secondes.</p>\n<p>Bonus / Malus : Un système de boite contenant des objets aléatoirement choisis parmi une liste de malus et de bonus en quantité égale, permet de donner un coté challenge et aléatoire à la partie.<br/>Le joueur saura donc si l’objet est un malus ou un bonus seulement après l’avoir récupéré.</p>\n<p>Les boites actuellement présentes dans le jeu seraient cassables par le joueur avec la touche d’interaction. Elles pourraient contenir les bonus / malus. Lorsque un nombre trop important de boite seraient détruites, de nouvelles boites arriveraient par des tuyaux sur le coté des niveaux.</p>\n<p>Objets à usage unique : Une chance sur deux que les objets ci-dessous soient inefficaces. Ceci permet de toujours garder un coté aléatoire lors du gameplay.</p>\n<p>Concoction de froid instantané : Gèle l’adversaire si ce dernier est au contact.</p>\n<p>Tête de méduse : Immobilise un court instant l’adversaire s’il est dans le champ de vision du lanceur.</p>\n<p>Trois niveaux supplémentaires :</p>\n<p>Trois niveaux ayant des mécaniques semblables, mais des ambiances radicalement différentes. L’utilisateur aura le choix du niveau. Ils permettraient une meilleure re-jouabilité, mais resteront sur les mêmes bases pour ne pas dérouter les joueurs occasionnels.</p>\n<p>Le laboratoire des scientifiques : pièce propre, immaculée, avec des machines futuristes / rétro, plateformes de téléportations dans le niveau, assez vaste tout en étant clos. Contient des actionneurs pour ouvrir et fermer des portes, déplacer des parois.</p>\n<p>Le hall d’exposition : Une ambiance avec des lumières type spots, éventuellement une foule affolée au premier plan, les deux personnages évolueraient sur une scène au sol, puis des échafaudages aux murs. On peut imaginer des rideaux sur les deux extrémités du niveau.</p>\n<p>Un entrepôt : Un niveau plutôt sombre avec comme seule source de lumière des luminaires pendus à des câbles, des grandes étagères sur lesquelles le joueur peut monter, des portes autonomes qui s’ouvriraient de manière cyclique et se fermeraient avec des timers.</p><p>___</p>\r\nMore soon !", "metacritic": null, "released": "2018-12-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/36b/36bc4d38669bdd3916bd736c25029dab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["F4ilortrue"], "genres": ["Action"], "publishers": [], "esrb_rating": null}