{"id": 280535, "slug": "donjon-les-rois-de-la-bagarre-prologue-24", "name": "Donjon, les Rois de la Bagarre (Prologue 2/4)", "name_original": "Donjon, les Rois de la Bagarre (Prologue 2/4)", "description": "<p><strong>ATTENTION/WARNING : jeu en français uniquement / french game only<br/></strong></p>\n\n<p><strong><em>Ceci est un projet amateur Fan Art  Game :</em><br/></strong></p>\n<p><strong>Donjon, Les Rois de la Bagarre</strong> est une adaptation très libre de la bande dessinée d'heroïc fantasy parodique de <strong>Lewis Trondheim et Joan Sfar</strong>.</p>\n<p> Page wikipédia de la bédé Donjon</p>\n<p>Comment lire Donjon (sur 9ème Art) ?                          <br/><br/><br/></p>\n<p>Mon jeu est un  projet de RPG à la fois classique (combat tour par tour, leveling, des donjons évidemment ...) et en même temps original et décalé. <br/></p>\n<p>\r\nLa bédé étant autant comique que tragique ( genre les Livres V et VI de kamelott) et pas forcément que pour les enfants (ne confiez pas le Donjon Monster \"Les Profondeurs\" à un gamin de 9 ans !) je vais essayer, avec mes \"moyens\" de garder cet état d'esprit. <br/></p>\n<p><strong>Sfar</strong> et <strong>Trondheim</strong> se moquent aussi, mais avec respect, des codes traditionnels des univers de type fantasy ... alors quoi de mieux qu'un jeu de rôle pour partager ludiquement cet univers ? <br/></p>\n<p>Mon scénario est écrit dans les grandes lignes mais je me laisse beaucoup de marge, de liberté (avec des clins d’œil à ma culture pop perso), pour intégrer de nouvelles idées au fur et à mesure des épisodes à venir (j'aime beaucoup improviser).</p>\n<p>La bédé est \"à tiroir\" autour de trois périodes, <em><strong>Potron Minet</strong>, <strong>Zénith</strong> e<strong>t Crépuscule</strong></em>. Le jeu <strong>Donjon, Les Rois de la Bagarre</strong> sera articulé autour de la période <em>Zénith</em>, en tirant un poil sur le <em>Crépuscule</em> à la fin (si j'y arrive) !<br/><br/>Le jeu est relativement scripté (avec un système de choix pouvant partiellement modifier la suite).  J'essaye de faire en sorte que le gameplay et la narration correspondent un minimum au matériel d'origine (la bédé) et soient aussi ouverts à des non initiés.<br/><br/>\n</p>\n<p>On peut dire que pour bien jouer, vivre pleinement \"l'aventure\", il faut se préparer à un peu de lecture (en plus de très nombreux dialogues vous trouverez livres, parchemins, messages secrets, parfois entre deux pierres, parfois par poulet volant ...).</p>\n\n<p><em>Nous sommes sur une planète nommée Terra Amata, dans un monde medieval fantasy peuplé d'oiseaux, mammifères et sauriens humanoïdes. Les humains n'existent pas dans l'univers Donjon, ceux qui s'en rapprochent le plus sont les trolls cavernicoles et les p'tis lutins.</em><br/></p>\n\n<p><strong><em>Prologue, partie 1: Herbert, un héritier dans l'ennui<br/></em></strong></p>\n<p><em>Vous incarnez Herbert, unique héritier du Duché de Vaucanson, condamné à mort pour meurtre.<br/></em></p>\n<p><em>Durée : moins de 2 heures</em></p>\n\n<p><strong><em>Prologue, partie 2: Horous, le magicien de la nuit</em></strong><br/></p>\n<p><strong>\n</strong><em><em>Vous incarnez Horous, nécromancien du Donjon missionné pour retrouver le corps de l'ex-femme de son patron, le Gardien.</em></em></p>\n<p><em>Durée : moins de 2 heures</em></p>\n\n<p><strong><em><em><strong>Prol</strong>ogue<strong>, partie 3 : Isis, une princesse qui s'enfuit (à venir)<br/></strong></em></em></strong></p>\n<p><em>Vous incarnerez Isis, princesse Kochaque fugueuse.</em></p>\n\n<p><strong><em><em>Prologue, partie  4: Marvin, un dragon sous la pluie (à venir)</em></em></strong></p>\n<p><em>Vous incarnerez Marvin, garde du corps du Gardien du Donjon.</em><br/>                                                                                    <br/></p>\n\n<p>Cette première partie est le prologue de Donjon les Rois de la Bagarre. Découpé en quatre, chaque morceau présente un des personnages jouables principaux. <br/></p>\n<p>Après avoir terminé ce prologue je ne pense pas me lancer sur un \"gros jeu méga long\" (ça demanderait trop de temps pour présenter quelque chose, probablement des années). <br/></p>\n<p>Ce sera plus probablement une formule d'épisodes, d'histoires courtes comme celles de ce prologue (1 à 6 heures de jeu max). Je veux raconter les aventures de mes quatre personnages principaux, mais aussi des micros histoires indépendantes de la trame principale (un peu comme la série Donjon Monster ... ou des DLC de jeux !) avec d'autres héros à un incarner (parfois de l'univers de la bédé, parfois de l'univers de Donjon Pirate, parfois de mon imagination).<br/></p>\n\n<p>Sur ce ...<br/><br/></p>", "metacritic": null, "released": "2018-12-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/937/937f49aed46b712b8d1be624f059e933.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gilberto Zongo"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}