{"id": 28054, "slug": "bai-qu", "name": "Bai Qu 百曲", "name_original": "Bai Qu 百曲", "description": "<p>SynopsisLocation is the ancient capital city Nanjing, China. And time is when spring turns into summer.<br />\nWhile visiting his sick father, college student Wei Qiuwu accidentally encountered a concertina playing little girl in the hospital.<br />\nAn inharmonious pair, seemingly. But soon, Wei Qiuwu became a good friend of Li Jiayun, the little player. And both of them act as an indispensable tune in each other&#39;s life.<br />\nWith the accompaniment of sedate Nurse Yang Qin and cheerful high school student He Jia, the story surrounding Li Jiayun is about to begin...<br />\nAfter they get familiar with each other, He Jia guide Wei Qiuwu and Li Jiayun to visited a lot of interesting places, acquainted with a variety of people and encountered with a diversity of things.<br />\nThey became an inseparable trio as well as good friends, everything looks like blissful. Until one day, Yang Qin unveiled Wei Qiuwu the cruel truth under a fairy-tale cover...Key FeaturesThe official sequel of Shan Gui.<br />\nA storyline of 8 to 12 hours, with multiple routes and endings.<br />\nWithout an absolute &quot;right choice&quot;, different ending contains different meaning.<br />\nAn unordinary story, theme with love and caring in ordinary daily life.<br />\nAn modern story happened in an ancient country.<br />\nMain characters with full voice.<br />\nDelicate and realistic backgroud pictures, field recording ambient sound to makes you felt you were in the scene.<br />\nOver 20 wonderful background music tracks, which include varieties of music genres.<br />\n2560×1440 resolution for game and 4096×2304 for CGs.</p>", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2022-03-18T16:40:11", "background_image": "https://media.rawg.io/media/screenshots/796/796bc7419e74b323a801766d89b37b36.jpg", "website": "http://baiqu.cngal.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 22, "beaten": 2}, "playtime": 4, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC", "macOS"], "developers": ["Magenta Factory", "ZiX Solutions"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Magenta Factory"], "esrb_rating": "Everyone"}