{"id": 28057, "slug": "carrier-deck", "name": "Carrier Deck", "name_original": "Carrier Deck", "description": "But can you manage the deck of the Nimitz-class nuclear powered supercarrier, the USS Ronald Regan (CVN-76)?<br/><br/><br/><strong>Carrier Deck</strong> is a fast paced time management game where you will play as the Air Officer on board a CVN-76 in the midst of active war. You, alone, are responsible for all aspects of operations involving aircraft on the ship and you'll need to <strong>work fast</strong> to ensure everything happens in time for the highest chances of warfare success.<br/><br/>Load the right planes and helicopters up and ready them for the required military missions. <strong>Manage both launching and landing</strong> the planes, avoiding crashes that could spread throughout the deck wrecking multiple planes and damaging the ship.<br/><br/>In Carrier Deck, you'll manage a staggering array of aircrafts including the F18 Hornet and Super Hornet, Chinook and S3 Viking, through a campaign that covers the oceans all over the globe. Test your skills in a full spectrum of operations across the globe in extensive campaign mode, or just try the Skirmish mode for a quick challenge.<br/><br/><strong>FEATURES</strong><br/><br/><ul><li>1. Full management of the flight deck incl, moving, fueling and arming of aircraft<br/></li><li>2. Aircraft maintenance and management of the hangar deck<br/></li><li>3. Selecting and launching of search missions to detect enemy air, surface and submarine threats<br/></li><li>4. Tasking and launching of intercept missions<br/></li><li>5. Special Forces deployment and Amphibous operations<br/></li><li>6. Ground strikes and close air support missions<br/></li><li>7. Receiving and dispatching cargo missions<br/></li><li>8. Full range of aircraft and helicopters onboard from fighters to early warning and detection aircraft.</li></ul>", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2019-08-28T22:06:48", "background_image": "https://media.rawg.io/media/screenshots/db0/db079aed24f71176283ed3394d5c8037.jpeg", "website": "http://slitherine.com/products/product.asp?gid=680", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "toplay": 1}, "playtime": 3, "achievements_count": 33, "ratings_count": 1, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "PC"], "developers": ["Slitherine Software", "Every Single Soldier"], "genres": ["Strategy", "Simulation"], "publishers": ["Slitherine"], "esrb_rating": null}