{"id": 280639, "slug": "shi-xie-yin-bloody-spell", "name": "嗜血印 Bloody Spell", "name_original": "嗜血印 Bloody Spell", "description": "<p>&quot;Bloody Spell&quot; is a martial arts action role-playing game. The core of the game is battle-oriented, and it combines many fighting elements and systems.</p>\n<p>Ten years ago, Yejin and his sister Li went to practice martial arts under the sect of Wanfa. Since then, they have been far away from the complicated human world.Ten years later, the mysterious organization that claimed to be Void Legion invaded the sect,  and then the world was in chaos, and the brothers and sisters were reinvested in the chaotic world.The sisters who are dependent on each other are taken hostage, and the disciples have been killed in one by one... At the moment when the bloodthirsty spell is opened, Yejin who knows himself, can he fulfill his commitment to everyone? And who is the last to be able to help the building, to save the devastated world?</p>\n<p>In terms of combat, this game uses multi-weapon switching as the main feature, and for each weapon in different speeds, power and positioning, design a variety of different skills, a variety of skills combo, greatly enhance the game cool feeling, excellent hitting and handling feel make it even better.</p>\n<p>The highlight of the level design is the form of random combination, that is, the scenes, monsters, equipment, and configuration of the props that the player is reborn after death are different from before, so that the game presents diverse characteristics, increasing the level variables and The game is fun.</p>\n<p>The &quot;Bloody Spell&quot; system is that, Yejin uses special skills in the body&#39;s evil spirit curse to achieve various effects such as violent walking, bullet time, roar breaking, assassination execution, counterattack and blood return, etc., which is to enhance the character&#39;s attack power and auxiliary combat. And to simplify the battle, add to the character and weapon attributes, and some even play a role in determining the battle.</p>\n<p>The system makes the combat part more flexible, more selective and versatile, while also ensuring the smoothness and refreshment of the battle. In addition, many interesting side quests, diverse survey elements, and mini games interspersed with them greatly expand the game&#39;s fullness and playability.<br />\nWe hope to see ten different players in ten different ways. If the enemy&#39;s threat is too great, you can use the bloodthirsty skills, assassinations, flying props, scene agencies to destroy them. Finally, please be careful in this Survive in the game.</p>", "metacritic": null, "released": "2022-01-26", "tba": false, "updated": "2023-09-03T19:01:44", "background_image": "https://media.rawg.io/media/screenshots/b4a/b4a78a32128d53a457f37328212a7c59.jpg", "website": "https://weibo.com/2042172087/profile", "rating": 3.39, "rating_top": 4, "added_by_status": {"yet": 21, "owned": 221, "beaten": 6, "toplay": 33, "dropped": 11, "playing": 2}, "playtime": 2, "achievements_count": 67, "ratings_count": 24, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC"], "developers": ["艺龙游戏"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["艺龙游戏"], "esrb_rating": null}