{"id": 280658, "slug": "story-jar-shall-we-date", "name": "Story Jar @ Shall we date?", "name_original": "Story Jar @ Shall we date?", "description": "So, join our cast of cute men and embark on a journey that will leave you breathless.<br/><br/>Current available series are:<br/>●Vampire●<br/>Tonight you will become a blood sacrifice for a vampire.<br/>You are born as the \"Moon's Beloved Child\" that all vampires crave and are fascinated by. According to the old covenant, you are destined to becoming a sacrifice for the Vampire King. <br/>One night, he takes you to his room where you're alone together. Lying on the bed, you prepare yourself to have your blood sucked - however what you ultimately feel is not pain, but pleasure.<br/><br/>●Pirates●<br/>You are the princess of a certain country. In order to protect a secret treasure passed down in your kingdom for generations, you and your companion, Nagisa, head out to the open sea. <br/>Dangerous pirates seeking thrills.<br/>A ship commanded by the prince of the powerful country that your fiancée lives in.<br/>The Navy, protectors of peace and defenders of justice.<br/>A mysterious ghost ship filled with secrets.<br/>Whose helping hand will you choose?<br/>Start a brand new adventure on the sea filled with romance and excitement!<br/><br/>●Pretty Awesome●<br/>Due to certain circumstances, you decide to take part in the Queen of F Contest.<br/>Behind this dazzling world, you’ll discover a web of lies and deceit.<br/>Everyone has a secret no matter who they are...<br/>Are you ready to be the one to sit on the Queen’s throne and steal the spotlight?!<br/><br/>●Beastmaster and Princes●<br/>In the Kingdom of Cattleya, you dream to be a skillful beastmaster like your mother...<br/>When you’re looking for a beast of your own, you run into these four animals on the street. <br/>After a while, you eventually find out that they can speak a human language.<br/>To your surprise, they are actually the missing princes from the Kingdom of Fasan!<br/>They confess that a curse turned them into beasts.<br/>Get ready to set out on a journey to break the curse!<br/><br/>●Become Elite●<br/>Your rich uncle has suddenly passed away! You're going to inherit a share of his will, including the famous Water Lily estate. Together with three obnoxious butlers, you will spend the next three weeks training to come out into society at a formal debut.<br/><br/>●Wand of Fortune●<br/>In a magic school from a distant land, there is a girl so awful at magic that the professors don't know what to do with her. That girl is you.<br/>At wit's end from your constant magic failures, the professors seek help by transferring you to an entirely different school.<br/>That school is the Mills Crea School of Magic in the Magic City of Latium, the nexus of magic power where all aspiring wizards and wizardesses dream to go.<br/>Your heart is filled with grand expectations as you step through the gates, only to be delivered heart-crushing news.<br/>By nature, all wizards and wizardesses possess a magic element, but you possess none.<br/>With no one understanding the cause of your anomaly, it is deemed to hold perils and possible dangers.<br/>You are strongly required to obtain an element during your enrollment at Mills Crea.<br/>Will you be able to discover your missing element?<br/><br/>●THE NIFLHEIM●<br/>Our king would like you to become the next queen...!<br/>Summoned by three unfamiliar men, you are brought to a kingdom named Niflheim.<br/>While getting to know the funny and adorable members of Niflheim, you come to meet the love of your life.<br/>Who will be your eternal lover?<br/><br/>●Mononoke Kiss●<br/>“I’ll protect you. Now, make a decision.”<br/>A long, long time ago, you, as a princess, were born with a silver spoon in your mouth. You spend most of your days just simply enjoying a fortunate life. That is, until your castle is suddenly attacked by Mononoke.<br/>You discover that they’re after...You?! But why?!<br/>No worries, though! A band of handsome Mononoke will be at your side to protect you.<br/>So, defeat your enemies and win back your peaceful life!<br/>Who will you pick to join you on this epic journey?!<br/>A forbidden love between human and Mononoke is about to begin!<br/><br/>Our apps are available for<br/>iOS 9.0 or later<br/><br/>*Except for<br/>iPad 2(2gen)<br/>iPhone 4S<br/>iPod touch(5gen)<br/>iPad mini(1gen)", "metacritic": null, "released": "2018-12-20", "tba": false, "updated": "2019-10-22T14:39:59", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac6a55367d3ff6cf0a5691bacdfd2ee0_5PnREBv.jpg", "website": "http://shallwedate.jp/en/bundle/bundle_002.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NTT Solmare"], "genres": ["Adventure", "RPG"], "publishers": ["NTT Solmare"], "esrb_rating": "Teen"}