{"id": 280602, "slug": "toilet-merryarcadecom", "name": "Toilet (MerryArcade.com)", "name_original": "Toilet (MerryArcade.com)", "description": "<p>Run the gauntlet through narrow alleys to find a toilet. Bribe your way forward by shooting Thai money at opponents and their home bases, through 15 challenging levels.</p>\n<p>Maintain good health by avoiding to touch the opponents and their projectiles. At zero health you are taken to hospital with a hefty bill. Keep in a good mood to stay alert and fast. Some opponents add to your mood, some ruin it if you get too close. You have 90 days on your visa. Use them well! When your visa runs out, you can get an expensive extension. When your money runs out the game ends, and you are kicked out of Thailand.</p>\n<p>Some tips:</p>\n<ul><li>Shoot the home bases as soon as possible, to prevent more opponents to come.</li><li>Know when to fight and when to run past the opponents.</li><li>The girlfriend is a tough cookie. Send her in to nasty areas to take a hit before you do.</li><li>Don't worry when the girlfriend is lagging behind. She will always find a way to you.</li><li>All opponents will stay away from traffic and tunnels.</li></ul>\n<p><strong>On a computer</strong>, use a mouse and click in the direction you want to move. Click and press the space key to shoot. You can also use the arrow keys, but the game gets harder to play. Press the I key for info, the P key to play and the Return key to pause.</p>\n<p><strong>On a tablet or phone</strong>, tap near the direction button to move, and tap on the gun button to shoot. Tap at the top to pause.</p>", "metacritic": null, "released": "2018-12-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e1d/e1da662b60570658c141cb30575460ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MerryArcade.com"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}