{"id": 280645, "slug": "path-to-valhalla", "name": "Path To Valhalla", "name_original": "Path To Valhalla", "description": "Welcome to the devastated world of <strong>Path To Valhalla</strong>. <br/>You´ll help Enki, a worthy ANUNNAKI from the Sirian civilation at Mother Earth, to find Anubis` lost child, named Kalilah. They will face one great challenge: to  free all humans from the slavery by the hands of the Warlord Khao Rá. Who proclame him self to be, the true GOD of the new world.FEATURES<ul><li>Story Mode.<br/></li><li>Arcade Mode.<br/></li><li>Hack N Slash.<br/></li><li>Advanced Combat System.<br/></li><li>Intense Battles.<br/></li><li>Local and On-line Co-op Gameplay.<br/></li><li> On-line Multiplayer.<br/></li><li>Character Evolution.<br/></li><li>Build your own army along your <strong>PATH TO VALHALLA</strong>.</li></ul><br/><br/><strong>MEN HAVE FORGOTTEN THE DAYS OF THE DESTROYER. ONLY THE WISE KNOW WHERE IT WENT, AND WHEN IT SHALL RETURN.</strong><br/><br/><br/><br/>40 STEPS TO VALHALLA<ul><li>Collect the forty pages from Enki´s proverbs, lost over the years. To understand Kalilah´s past and about the ancient world´s devastation story. </li></ul>STEP ONE<br/>We SIRIANS are the conquerors of worlds, powerful beings capable of unimaginable deeds. We SIRIANS were at war, a war for the dominance of a planet named NIBIRU. For many centuries we fought. This war was waged between our greatest warriors and the IGIGI, inhabitants of NIBIRU. As always, with war came knowledge. We learned about the IGIGI and their planet. NIBIRU´s orbit enters a specific solar system every 3,600 years, and we were approaching that, as foretold in our history.<br/><br/>Our expedition’s to Mother Earth was formed by me, ENKI, known as the wise one; DEODAT, the forger; ELOHIM and GENESIS, the creators; And KHAO RÁ… who was to be our biggest mistake.You will find all other steps during GAMEPLAY.<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:43", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd58100bcddca280d507ef5bb9d12f9e.jpg", "website": "http://www.pathtovalhalla.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DCF Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["DCF Studios"], "esrb_rating": null}