{"id": 280640, "slug": "relaycars", "name": "RelayCars", "name_original": "RelayCars", "description": "Welcome to RelayCars™: The new way to experience cars<br/>\r\nStep inside the Showroom to view our growing library of product accurate vehicle models like never before in full, real-time, room-scale, 6-DoF freedom as part of your research and shopping experience. Select vehicles from our growing model library and place any given vehicle in one of three designated spaces on the showroom floor. You can view the car from any angle, step back and admire the vehicle in full, catch a front 3/4 view, or get up close and personal to admire design highlights, wheels, brakes, grill details, tires, and lighting. <br/>\r\nThen, step up to the Podium.<br/>\n<br/>\r\nUpon Entry:<br/>\r\n• Take a look around! Get familiar with the showroom and admire the automotive art on the walls. But let's get to why you're here: the vehicles!<br/>\r\n• You will notice that three vehicles are already in place.<br/>\r\n• Feel free to take your time, spanning from space to space on the showroom floor admiring the vehicles from any angle using the teleport feature. <br/>\n<br/>\r\nTo Navigate Room using Teleport:<br/>\r\nPress and hold the circular touch-pad <br/>\n<br/>\r\nThe Podium<br/>\r\nYou will notice each showroom space designated for a vehicle is accompanied by a Podium.<br/>\r\nYou can consider each Podium to be your command module to many features:<br/>\r\n• Bottom left button: View and select vehicles available, more vehicles coming all the time.<br/>\r\n• Bottom middle button : Select vehicle color<br/>\r\n• Bottom right button: View the interior of the vehicle in a full 360º interior panorama.<br/>\r\n• Top Left Button: View vehicle specs<br/>\r\n• Top Right Button: View scorecards and reviews<br/>\n<br/>\r\nTo Select Your Vehicle:<br/>\r\n• Tap the bottom middle button with your controller<br/>\r\n• An arc of blue spheres containing available vehicles for your research and review will appear to the right of the podium. <br/>\r\n• Hover the controller over the vehicle of your choice, pull the trigger to select and hold, use the controller to toss the selected vehicle towards the current vehicle, releasing mid throw so that the vehicle-sphere lands on the current vehicle. <br/>\r\n• In a flash, your chosen vehicle will appear.<br/>\n<br/>\r\nTo Select Your Color:<br/>\r\n• Choose from the full library of OEM product correct paint colors applicable to your given vehicle choice. <br/>\r\n• Tap the bottom middle button with your controller<br/>\r\n• An arc of OEM product correct colors will appear to the right of the podium.<br/>\r\n• Hover the controller over the color of your choice, pull the trigger to select and hold<br/>\r\n• Use the controller to toss the selected color towards the vehicle, releasing mid throw so that the color-sphere lands on the vehicle. <br/>\r\n• The color sphere will disappear in a cloud of particles, coating your vehicle in the selection of your choice.<br/>\n<br/>\r\nGet in the Driver's Seat:<br/>\r\n• Step inside the vehicle interior placing the controller over the sphere at the bottom right of the podium.<br/>\r\n• Press the trigger and you will be transported to a 360º interior panorama of the vehicle.<br/>\r\n• To exit, simply release the trigger.", "metacritic": null, "released": "2019-01-04", "tba": false, "updated": "2019-08-28T21:49:44", "background_image": "https://media.rawg.io/media/screenshots/c0f/c0f5e99672ec74ceb022503769c53ef1.jpg", "website": "https://www.relaycars.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RelayCars™"], "genres": ["Casual"], "publishers": ["RelayCars™"], "esrb_rating": null}