{"id": 280683, "slug": "plunge-3", "name": "Plunge", "name_original": "Plunge", "description": "It's time to take the Plunge! Enter the adventure of Billie, the billionth prisoner of a wacky medieval mega-prison, who longs to find freedom on the other side. Rather than try to climb her way out, Billie realizes the only way to freedom is to escape further into the depths below! Dodge, dash, and defeat a wide variety of guards, creatures,  and otherworldly beings bent on preventing passage in this exciting turn-based dungeon plunger!<br/><br/>In Plunge, players will find a new and unique experience, especially for those familiar with the puzzle and roguelike genres. Each floor is an individual challenge meant to test the very best in a battle of brawn and wits. Don't miss this opportunity to find out why Plunge was nominated for the 2017 PAX Rising showcase, the 2016 and 2017 Portland Retro Gaming Expo showcases, the 2019 PAX 10 Selection and multiple showcases with Indie Mega Booth at PAX West and GDC! <br/><br/><br/><br/>- Play as Billie or a variety of other cartoony characters with charming criminal charges!<br/><br/>- Turn-based roguelike action!<br/><br/>- Movement with sliding ice physics agains enemies with unique and peculiar patterns!<br/><br/>- Over 400 randomly selected levels across three separate challenging sections!<br/><br/>- Plunge and Plunge again with fast pick-up-and-play experiences!", "metacritic": null, "released": "2018-05-10", "tba": false, "updated": "2023-05-15T11:21:10", "background_image": "https://media.rawg.io/media/screenshots/300/300decd6ddab057ff7ba2f5d2e0c8b6f_8tjFCT6.jpg", "website": "https://www.plungegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 16, "ratings_count": 1, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Nintendo Switch", "iOS"], "developers": ["Adknown", "Spooky Buns"], "genres": ["Action", "Adventure", "Strategy", "Arcade", "Indie"], "publishers": ["Adknown", "Spooky Buns Games"], "esrb_rating": "Everyone 10+"}