{"id": 280727, "slug": "retro-parsec", "name": "Retro Parsec", "name_original": "Retro Parsec", "description": "Enjoy the nostalgia of this classic game re-created in the original style of the TI-99/4a computer game from the 1980's!<br/><br/>Re-live the era with blocky but colourful graphics and simple but captivating sound effects.<br/><br/>You are the commander of the starship Parsec patrolling an alien planet. Suddenly, the on-board computer announces that you are about to come under attack by small alien fighters and large, heavily armed, hostile alien cruisers!<br/><br/>The fighters are highly mobile, and unless they are eliminated by your laser, they fill the screen, restrict manoeuvering of your craft, and may cause a deadly collision. The cruisers are highly aggressive and their armament devastating. Armed with photon missiles, they track your ship and fire on it. You must out-manoeuver and destroy them with accurate fire from your ship's laser. If you survive the waves of alien craft, do not let down your guard, for you also have to blast through an asteroid belt or refuel your ship, demanding the utmost in skilful flying.<br/><br/>Parsec is a challenging, exciting game packed with thrills. Danger and excitement are brought on with each new attack. Some of Parsec's features include:<br/><br/>- Waves of attack from seven different alien craft.<br/><br/>- Challenging flights through refuelling tunnels.<br/><br/>- Asteroid belts through which you must blast a path for your starship.<br/><br/>- Synthesised speech to warn of approaching alien craft or when it's time to refuel.<br/><br/>- Three different lifts to vary the speed at which the ship moves vertically.<br/><br/>- Increased difficulty levels to challenge you.<br/><br/>Parsec is a one-player game which tests your skills and strategy. Movement of the ship on screen may be controlled by on-screen controls or an MFI certified Bluetooth controller.<br/><br/>When the Bluetooth controller is used, the A button is for firing the laser and the B button alters the lift speed.<br/><br/>Scoring of points for destroying alien craft increases with waves and levels. Bonus points are awarded for successfully navigating an asteroid belt and refuelling.<br/><br/>Asteroid belts increase in speed and duration as levels increase. Extra ships are awarded at certain score levels throughout the game.", "metacritic": null, "released": "2016-04-11", "tba": false, "updated": "2019-10-22T14:32:03", "background_image": "https://media.rawg.io/media/screenshots/6b9/6b9f7832363ab8f78a8328a2b44ce1b6_4ELho84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yesung Moore"], "genres": ["Action"], "publishers": ["Yesung Moore"], "esrb_rating": "Everyone 10+"}