{"id": 28075, "slug": "cooking-simulator", "name": "Cooking Simulator", "name_original": "Cooking Simulator", "description": "Experience the world of restaurant cooking in a highly polished, realistic kitchen. Use ovens, gas stands, pots, pans, bowls and plates, everything you need in a kitchen. Prepare dozens of lifelike ingredients - from vegetables through fish to steaks and poultry - to cook over thirty real dishes - or anything you like.<br/>This is your kitchen. You can do anything here. If you really don't want to, you don't even have to cook anything. Throw kitchen knives like darts. Set fire to cardboard boxes, cook a steak on them, and then save the day with a fire extinguisher. Build a tower out of pots and trays. Everything with real-life physics.<br/>However, if you'd rather be a cook, the same physics engine gives you unlimited opportunities. Cut some vegetables, put them in a pot and boil. Use a blender to make a soup. Bake a fish fillet, but remember not to burn it! See your ingredients transform with temperature. The kitchen experience awaits!<br/>Subtly modify your dishes according to your clients' whims. Use different spices to make them love your cooking, and they will write you a unique review you will not forget!<br/>Deliver fine dishes and unlock new, more refined recipes as your fame grows. Acquire social media reviews, Michelin stars and rise through the ranks of the greatest cooks - but beware! The Mystery Client awaits, and if you fail to please him, much of your hard work will be lost.", "metacritic": null, "released": "2019-06-05", "tba": false, "updated": "2024-03-13T21:04:08", "background_image": "https://media.rawg.io/media/screenshots/a85/a85692b735a17d9b5996ac393924b5a9.jpg", "website": "", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 24, "owned": 512, "beaten": 19, "toplay": 23, "dropped": 61, "playing": 11}, "playtime": 4, "achievements_count": 366, "ratings_count": 82, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 84, "platforms": ["Xbox One", "Nintendo Switch", "PC", "PlayStation 4"], "developers": ["Wastelands Interactive", "Big Cheese Studio"], "genres": ["Simulation", "Casual"], "publishers": ["Forever Entertainment", "PlayWay"], "esrb_rating": null}