{"id": 280726, "slug": "living-legends-frozen-beauty-a-hidden-object-fairy", "name": "Living Legends: Frozen Beauty - A Hidden Object Fairy Tale (Full)", "name_original": "Living Legends: Frozen Beauty - A Hidden Object Fairy Tale (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>The Queen has chosen your sister as her successor, but are her promises too good to be true? There are many secrets awaiting you in the castle, but the biggest dangers lie beneath the icy mountain passes. <br/><br/>• EXPERIENCE A NEW TWIST ON A CLASSIC TALE <br/>Snow White will guide you in your quest to save your sister. Learn her history as you travel through the queen’s castle. <br/><br/>• SAVE YOUR SISTER! <br/>You’ve taken care of your sister since your mother’s death, but now she’s in danger. It’s up to you to find her and ensure her safety. <br/><br/>• CAN YOU DEFEAT THE EVIL QUEEN? <br/>The queen has been maintaining her youth by tricking beautiful young women into entering her lair so she can steal their life forces. <br/><br/>• ENTER A MAGNIFICENT WORLD BY UNLOCKING THIS COLLECTOR’S EDITION <br/>Meet a mysterious Alchemist in the bonus game. Take a step behind the scenes with the beautiful wallpapers and concept art in this lovely Hidden Object Puzzle Adventure! <br/><br/>*** Discover more from Big Fish! *** <br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter <br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames <br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2015-03-26", "tba": false, "updated": "2021-03-22T03:29:00", "background_image": "https://media.rawg.io/media/screenshots/4ca/4ca627142ffd503c054f9e7d9a0a7a45.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}