{"id": 280745, "slug": "love-escape-the-secret-of-her-room", "name": "Love Escape! -the Secret of her Room", "name_original": "Love Escape! -the Secret of her Room", "description": "You were invited to your girlfriend's room for the first time.<br/>But, you were locked into the room for some reason!<br/>Can you solve many tricks hidden in the room, and escape from her room!?<br/>A surprising truth is waiting for you!<br/><br/>Love Escape! is a room escape game with story that contains  elements of fantasy and mystery a little bit. (You can also skip the story, and enjoy only escape.)<br/><br/>･The stage is pretty and attractive girl's room. Not only that, but this game is very honestly and orthodox.<br/> <br/>･The difficulty is very reasonable, so you must feel refreshed when the puzzle is solved!<br/><br/>･This game has a well thought-out story. As you solve tricks, a great mystery will be unveiled step by step!<br/><br/>･The operation is very simple, you need only to tap and swipe. Everybody can enjoy soon with \"How to play guide\".<br/><br/>･This game is Auto save. So you can play in your spare time.<br/><br/>･With handwriting memo function, you can note the worrisome things soon.<br/><br/>･Tips book help you when you can't advance.<br/><br/><br/>[It is recommended for such a person]<br/>-I love puzzles, reasoning, and solve the mystery. <br/>-I like to have mental exercise fun. <br/>-I want to do something at killing time.  <br/>-I also like SF and mystery.<br/>-I like password puzzles.<br/>-Away from the everyday, I want to excite and throb.<br/>-I attractive to a mysterious world. <br/>-I want to go out with a girl who has a little secret. <br/>-I'm interested in stylish interior. <br/>-I want to hang around the pretty room. <br/><br/><br/>[The Characters]<br/>･Rumi Kroto<br/>The idol of this school, the class president, the president of astronomical club, and your girlfriend.<br/>She has all of beauty, kindness, and intelligence, so she is respected from both men and women.<br/>Her favorite food is oranges.<br/><br/>･Toma Nicks<br/>The most handsome man in the school, so he is very popular among girls.<br/>But he doesn't seem to be interested in love, He take up an ironic and unfriendly attitude to everyone. <br/>He belongs to the astronomical club too.<br/>He is often beside Rumi for some reason.<br/>His favorite food is donuts.<br/><br/><br/>*We will inform about update and the continuation on twitter.If you'd like, please follow us!<br/>　https://twitter.com/loveescape7<br/><br/>*If you could never solve, please ask me on twitter or e-mail.<br/><br/>*Thank you very much for the person who reviewed. <br/><br/>*Our mother tongue is not English. So if you find wrong english, We are glad to tell us.<br/><br/>*This game is fiction. It doesn't have any relation to person or group of the real.", "metacritic": null, "released": "2014-04-11", "tba": false, "updated": "2019-10-22T14:32:04", "background_image": "https://media.rawg.io/media/screenshots/6f1/6f19190f6d55a9b501a1e44caa5ae2df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tomoki Uchiyama"], "genres": ["Adventure", "Puzzle"], "publishers": ["TOMOKI UCHIYAMA"], "esrb_rating": null}