{"id": 2808, "slug": "super-mega-baseball", "name": "SUPER MEGA BASEBALL", "name_original": "SUPER MEGA BASEBALL", "description": "Hammer Longballo and a friendly cast of semi-athletic baseball stars invite you out to the ballpark for a blazing fast, ultra-responsive game of hardball. Super Mega Baseball is easy to learn, but you'll want to master jumping, diving, wall-catches, power swings/throws and cut-off plays to prevail in season mode versus the CPU, or to dominate your friends in local multiplayer for up to 4 players.<br/><br/>Super Mega Baseball is backed by a solid simulation of the sport with accurate physics, realistic statistical outcomes, and full tracking of batting and pitching statistics across individual games and seasons. Choose your Ego for a fair degree of difficulty regardless of your skill level. Earn Starpoints for your in-game achievements, level-up, and hire the best coaches and trainers to improve your team over the longer term. And of course, fully customize the name and appearance of your squad to your heart's delight with the in-game character editor!<br/><br/><br/><br/>Additional hardware required for Remote Play.<br/><br/>1-4 players<br/>1MB minimum save size<br/>DUALSHOCK®4<br/>Remote Play<br/>1080p HD Video Output<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2014-12-16", "tba": false, "updated": "2019-08-02T16:25:28", "background_image": "https://media.rawg.io/media/screenshots/72f/72f4228661da6a276ad8619f8c456b8f.jpg", "website": "http://www.supermegabaseball.com/", "rating": 3.76, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 95, "beaten": 3, "toplay": 1, "dropped": 11}, "playtime": 0, "achievements_count": 36, "ratings_count": 17, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "developers": ["Metalhead Software"], "genres": ["Sports", "Arcade"], "publishers": ["Metalhead Software"], "esrb_rating": "Everyone 10+"}