{"id": 28088, "slug": "wisdom-of-war", "name": "Wisdom of War", "name_original": "Wisdom of War", "description": "Wisdom of War is a kind of strategy game that can be suspended instantly, the one side needs to collect resources, develop economy, build up defensive and offensive architecture, set up powerful attacking troop and destroy enemies’ all buildings to obtain final triumph.<br/>\n<br/>\r\nDifferent from general instant strategy game, it can be suspended instantly and most of the operations proceed in suspension, which removes the demands for hands’ operation speed in traditional instant strategy game so that players can focus on strategy application.<br/>\n<br/>\r\nAnother characteristic is that, it combines elements of comprehensive arrangement; since the movement of leading role and various operations take some time, it is necessary to arrange various activities as a whole to achieve highest efficiency.<br/>\n<br/>\r\nThere are 5 categories of resources available for collection and the methods for collecting various resources are different; some resources will only be obtained by destroying enemy’s troops.<br/>\n<br/>\r\nPlayers can build up over 24 kinds of different buildings and some even carry two different auxiliary buildings. Because the functions of auxiliary building are different, but the quantity is limited, players need to consider about constructing what kind of auxiliary buildings.<br/>\n<br/>\r\nEnemy’s AI carries certain randomness, so each game in the same level will experience different processes, which means that, plays shall play to the score rather than adopt fixed strategy each time.", "metacritic": null, "released": "2017-06-06", "tba": false, "updated": "2019-08-28T22:06:47", "background_image": "https://media.rawg.io/media/screenshots/d08/d082f9b1d1b65ac4c91e0e14cd7af003.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yang Sun"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Yang Sun"], "esrb_rating": "Everyone"}