{"id": 280809, "slug": "icons-quest", "name": "Icons Quest", "name_original": "Icons Quest", "description": "Icons Quest is a funny words based game like  4 pics 1 word, the goal of this game is to arrange the letters to find a mysterious word.<br/>To guess the mysterious word you have up to 4 icons or emoticons related with the hidden word.<br/>There are some special levels when you have to guess movies titles, places, videogames titles and more. You can unlock more levels with stars.<br/>This app tests your knowledge at solving words puzzles, if you get stuck on a level you can try to use an hint or ask to your friends.<br/><br/>There are some different hints you can use to pass a level:<br/><br/>- Add a related icon (up to 4)<br/>- Add a correct initial letter (up to 3)<br/>- Delete some incorrect letters (up to 3 times)<br/><br/>To use an hint you need some coins but do not run out of coins if you want to solve all the levels. You earn coins every time you guess a word.<br/>Use the coins also in the shop to improve your score or to earn more stars and coins quickly.<br/>The app also have world leaderboards and additional achievements to make the gameplay more interesting.<br/><br/>You have a lot of mystery words, download now the app for free, test your skill and have fun !!!<br/><br/>Game walkthrough here: http://pentawire.altervista.org/?section=14&amp;pageID=10<br/><br/>Note: Uninstalling the application involves the loss of all progress.", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-10-22T14:40:00", "background_image": "https://media.rawg.io/media/screenshots/c34/c3483f7eb6419d9268cc13e811c31ba9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Raffaele Amuso"], "genres": ["Puzzle"], "publishers": ["Raffaele Amuso"], "esrb_rating": null}