{"id": 280979, "slug": "twilightinfinite", "name": "twilight.infinite", "name_original": "twilight.infinite", "description": "<p>A project built in an engine constructed for a mini game jam.  This was an opportunity for me to learn Visual Studio ('cause previous projects have all been Linux) and play with a new 2D graphics framework called Simple2D.  I'm reasonably happy with how things turned out given the 72-hour constraint.</p>\n<p>Code is written in C++.  I use QueryPerformanceTimer, which means that there isn't a Linux version ... but otherwise there isn't really anything that would bind this application to Windows.  I may look into a port to other platforms eventually (just for fun).</p>\n<p>The mazes are procedural - I used a really simple little recursive driller to make 'em.  All mazes are 36 tiles wide by 18 tiles tall.  The mazes are generated with one entrance and one exit - the exit is guaranteed to be a specific distance away from the entrance, but otherwise the placement is random.<br/></p>\n<p>The lighting effect is a combination of a few different things - a shader, a simple light calculation, and the way the assets are made.  The shader is a random dither with a time-based component - the time gives a little variation to the way the dither works (making things more visually interesting).  The shader is applied to all textures, and clamps colors to black, white, or a dark shade of red.</p>\n<p>The light calculation is a little flood-fill algorithm that runs and applies an ever-decreasing illumination value to tiles within a specific distance from the player, with light permitted to take a turn.  Walls are easier to illuminate than floors, because the wall textures have a much higher white component.</p>\n<p>The assets are built with quite a bit of gray - the dithering algorithm will apply differently to the large gray sections over time, giving them a little bit of a twinkle effect.<br/></p>\n<p>In any event, I hope you enjoy the game, and thanks for taking a look!<br/><br/></p>", "metacritic": null, "released": "2018-12-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/364/364deba309c92e41d3bf907d85955b03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cubic1271"], "genres": [], "publishers": [], "esrb_rating": null}