{"id": 2809, "slug": "tsuro-the-game-of-the-path", "name": "Tsuro - The Game of the Path", "name_original": "Tsuro - The Game of the Path", "description": "Create your own journey with <strong>Tsuro: The Game of the Path</strong>. Place a tile, and slide your stone along the path created... but take care! Other players’ paths can lead you in the wrong direction - or off the board entirely. Paths will cross and connect, and the choices you make affect all the journeys across the board.<br/><br/><h3>BEAUTIFUL</h3>The intricate artwork of the original board game is brought to life with fluid animation and sparkling pyrotechnics. Every component has been recreated in meticulous detail, including the box!<h3>PLAY WITH FRIENDS</h3>Tsuro supports up to 8 players, around one device or online. Play against your friends on desktop, mobile and VR, or go solo to see who can build the longest path.<h3>EXCLUSIVE NEW MODES</h3>Classic Tsuro, plus 4 new ways to play, exclusive to the digital version: Solo, Fuse Mode, Loop Battle and Longest Path.<br/><br/><br/><h3>FUN FOR EVERYONE</h3>Tsuro is easy enough for anyone to pick up... but it requires cunning and strategy to become a master.<h3>CRAFTY AI OPPONENTS</h3>Choose from 3 AI personalities to challenge your strategic skill.<h3>MASTER THE DRAGON</h3>Over 50 achievements put your path-building skills to the ultimate test.<br/><br/><br/>", "metacritic": null, "released": "2016-02-03", "tba": false, "updated": "2023-11-04T19:59:27", "background_image": "https://media.rawg.io/media/screenshots/52a/52a0abaeb43f29bba9821b68c053c009.jpg", "website": "http://thunderboxentertainment.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "toplay": 1, "dropped": 2}, "playtime": 1, "achievements_count": 53, "ratings_count": 2, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "macOS", "PC", "iOS", "Android"], "developers": ["Thunderbox Entertainment"], "genres": ["Strategy", "Board Games", "Casual", "Family"], "publishers": ["Thunderbox Entertainment", "Thunderbox Entertainment G.P."], "esrb_rating": "Everyone 10+"}