{"id": 28103, "slug": "park-bound", "name": "Park Bound", "name_original": "Park Bound", "description": "Park Bound is a massively multiplayer playground featuring player crafted parks. Each park contains a variety of worlds to explore, play, and meet other players. Every world presents goals and challenges to overcome with unique collectible treasures that can unlock special worlds in the park. Players can pick up jetpacks, soar the sky with hang-gliders, and even roll inside balls to complete objectives.<br/><br/><strong>The Parks</strong><br/>The game is a continually growing ecosystem of parks created by both the community and the developer. Each park, managed by a single player, is its own self contained universe that offers consistent level quality as well as a place to return to as more levels are created. Parks can be visited by jumping into portals located throughout the hub world or by using the in-game park browser.<br/><br/>While every park shares common characteristics of 3D platformers, levels can be created with a variety of styles and objectives. Some levels may be an intense obstacle course requiring expert precision, analysis, and execution. Other levels may be open worlds with a variety of smaller challenges to be completed independently. Levels can have special rewards for taking difficult paths, finding secret locations, completing a section under a specified time limit, or gathering collectibles in a dangerous area. Some levels could even exist to showcase visually impressive scenes or simply be a comfortable environment to relax and socialize. Regardless of the type, each park is it's own living space intended to bring value to players who visit.<br/><br/><strong>Level Editor</strong><br/>As a creator, the level editor gives you full control of everything in your park. Once the park is opened it is always online and accessible to anyone with the game. You can watch your park from above, play alongside visitors, and view real-time population metrics to gather valuable feedback about your levels.<br/><br/>The level editor gives the tools to create spaces efficiently without limitations. Using a visual interface creators build entire levels without any programming or scripting languages. The editor provides customizable shape primitives, terrain, voxels, materials, animations, lighting, music, sound effects, particles, prefabs, and more. Prefabs give designers the ability to create complex re-usable objects in discrete packages. Park Bound embraces an open design philosophy where creations can be shared and modified freely between authors. This atmosphere of collaboration allows authors to combine and improve existing ideas to create new worlds.<br/><br/><br/>Trailer features music by Ozzed available under CC BY-SA 3.0", "metacritic": null, "released": "2017-07-18", "tba": false, "updated": "2019-08-28T22:06:47", "background_image": "https://media.rawg.io/media/screenshots/fa9/fa987945c36a870e05722504f2ff2609.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Bambastic Games"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["Bambastic Games"], "esrb_rating": "Everyone"}