{"id": 28108, "slug": "vehicle-vr", "name": "Vehicle VR", "name_original": "Vehicle VR", "description": "Welcome to Vehicle VR, an addicting and rage-inducing game. Your goal is to complete levels by getting to the finish box at the end. All maps are made to test your common knowledge and quick reflexes. Compete with your friends and people around the globe to get the fastest times! Will you be able to finish the map quicker than anyone has ever done? Vehicle VR is playable with and without a VR-headset.Key Features:<ul><li>21 unique and well-balanced maps</li></ul><ul><li>Two gamemodes for endless fun!</li></ul><ul><li>Full SteamVR compatibility; supporting the Oculus Rift, the HTC Vive and any other SteamVR supported headset</li></ul><ul><li>An exact timer, showing the amount of time it takes for you to finish the map</li></ul><ul><li>A slowmo mode which can be activated by holding down F</li></ul><ul><li>A restart button to quickly reset the current level (Ctrl)</li></ul><ul><li>A system that resets the car in case you fall of the map (you'll need it)</li></ul><ul><li>And if you flip over, you can press shift to flip right back up</li></ul><ul><li>An in-game menu where you can check the keybindings and quit the game</li></ul><ul><li>And off course, the vehicle that you use to make your way through those levels</li></ul><br/>Both Firstperson aswell as Thirdperson are viable options, see which one you prefer. You can switch between those two camera-angles at all times by pressing tab.", "metacritic": null, "released": "2017-06-09", "tba": false, "updated": "2019-08-28T22:06:47", "background_image": "https://media.rawg.io/media/screenshots/251/2514b4bd27023ab93243054022129af6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 40, "beaten": 1}, "playtime": 1, "achievements_count": 7, "ratings_count": 2, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Nick Helweg"], "genres": ["Action", "Strategy", "Racing"], "publishers": ["Nick Helweg"], "esrb_rating": "Everyone"}