{"id": 28117, "slug": "blackeye", "name": "BlackEye", "name_original": "BlackEye", "description": "BlackEye is an adventure game, and its main character is the inhabitant of the world of Koyte.<br/>Koyte is a planet which diameter is 4.5 times more than the diameter of Earth, but its mass is less than that one of Earth. There is almost no atmosphere at the surface. At the same time the planet is pitted by caves that go many thousands kilometers down and keep all the life and air inside.<br/>Koyte is really the planet of caves. Rumors say that about a thousand years ago the advanced civilization prospered on the planet. Ancient caves still store strange objects and mechanisms left by that civilization. Everything is different on the planet now. Something happened to those ancient forerunners. Now this mysterious world is divided into two - upper and lower ones. Some rational beings live in the upper world. Probably they are descendants of the ancient people as they feel quite cozy and good here. Life of the lower world is completely different. Ugly creatures, blood-thirsty predators, that know no mercy, live in the lower world. There is nothing more hated for them than the inhabitants of the upper world! No one inhabitant of the upper world would voluntarily go down to the lower world. However the main character has to reach the bottom!<br/><br/><br/><br/>On his way downward, BlackEye (as his tribesmen call the main character) learns how to battle against creatures of the lower world. He masters new types of weapons and protection.<br/>BlackEye becomes more sturdy and stronger with each battle. He has a very important ability; he is able to store a huge number of useful things in the pockets. Using them separately or in various combinations he can work wonders. Who else except BlackEye can pick up a heart of the beehive of Stony bees destroyed by him and to use it in his purposes?<br/><br/><br/><br/>Help BlackEye! Go through the lower world together! Discover a huge world of caves, use artifacts of an ancient civilization, and solve its secrets. And at the end, with any luck, you’ll learn a history of this strange world — the planet of caves, the world of Koyte.<br/><br/><br/><br/>Current build contains:<br/><br/>- 33 levels<br/><br/>- 5 types of weapon mods<br/><br/>- 7 types of monsters<br/><br/>- secrets and puzzles<br/><br/>- XBOX gamepad support<br/><br/>- The original game-play: the character can shoot while doing somersault. And he can \"stick\" to the walls while sliding down.", "metacritic": null, "released": "2017-06-08", "tba": false, "updated": "2019-08-28T22:06:46", "background_image": "https://media.rawg.io/media/screenshots/563/563a732985557f5a57dd28a704507863.jpg", "website": "http://blackeye.dnovel.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 57}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dnovel"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Dnovel"], "esrb_rating": "Everyone"}