{"id": 28119, "slug": "super-rocket-shootout", "name": "Super Rocket Shootout", "name_original": "Super Rocket Shootout", "description": "Twins never have it easy, and it’s no different for Maurice and El Bruto!  Frustrated with their inability to execute on their elaborately planned bank heists, they squabble and bicker only the way brothers can, leaving a trail of chaos and destruction behind them.<br/><br/><strong>SUPER ROCKET SHOOTOUT</strong> is a frantic and fun 2D pixelart brawler game, mixing platformer and fighting mechanics for up to 4 players (CPU or local multiplayer). The combat system is both accessible and deep, with super agile jetpack-induced movements, combos, super attacks, counters, extras weapons and more! Jetpack, Guns and Explosions <ul><li>Master your jetpack and slip right behind your enemies.<br/></li><li>Use your shotgun from a distance or at melee range.<br/></li><li>Throw homing missiles, boomerangs, teleport-bombs and many more crazy weapons.</li></ul><br/> Deep fighting system<ul><li>Use your shield wisely, throw perfect blocks.<br/></li><li>Build combos and fill up your Super meter.<br/></li><li>Throw devastating Super Moves, Super Attacks and Counters.</li></ul><br/> Lots of content<ul><li>Engaging story mode, local multi player mode, team play.<br/></li><li>8 playable characters with each its own abilities and Super Attack.<br/></li><li>8 interactive and destructible stages.<br/></li><li>Tons of achievements and un-lockable extra weapons.</li></ul><br/><br/><br/><br/>Super Rocket Shootout is a great way to hang with friends and enjoy the charming game characters, as well as a perfect outlet to release any pent-up frustrations!<br/><br/>Super Rocket Shootout was developed by Oddly Shaped Pixels, a one man development studio with its global headquarters in Lyon France.", "metacritic": null, "released": "2017-07-14", "tba": false, "updated": "2019-08-28T22:06:46", "background_image": "https://media.rawg.io/media/screenshots/989/9894e07dc5a8108d2c3f798b41594fe5.jpg", "website": "http://www.oddlyshapedpixels.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34}, "playtime": 3, "achievements_count": 62, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC", "Linux", "macOS"], "developers": ["Oddly Shaped Pixels"], "genres": ["Action", "Indie"], "publishers": ["Plug In Digital", "Digital Tribe"], "esrb_rating": "Everyone"}