{"id": 281348, "slug": "would-you-rather-dirty-evil", "name": "Would You Rather Dirty & Evil", "name_original": "Would You Rather Dirty & Evil", "description": "Would you rather is a drinking game, created for party animals, teens, college students, college dropouts, bachelorettes and all the other party people that want to drink to start their night. <br/><br/>Game can be played offline, without WIFI, and it consists of a bunch of cards you read to your friends. It's a perfect game against your sobriety.<br/><br/>We made this game because you and your friends are boring and you can’t come up with funny stuff that gets you drunk yourself.<br/><br/>-----! FEATURES !----- <br/><br/>-\t850+ Cards <br/>-\t8 Packs <br/>-\tHours of getting to know your friends<br/>-\tFor 2 players minimum<br/>-\tHours of fun<br/>-\tHating your friends and humanity in the end<br/>-\tPublic embarrassment and disappointment<br/><br/>-----! HOW TO PLAY !-----<br/><br/><br/>-\tGather your „friends“<br/>-\tRead the cards<br/>-\tEverybody votes who would do what<br/>-\tPeople who voted for option with less votes are losers and they have to drink. If only one person voted for an option they are a mega loser and they have to drink double.<br/>-\tThe losing voters drink. If there is a draw, everybody drinks. If only one person drinks, they drink double.<br/><br/>\"All of my friends are horrible human beings and I can't look them in the eye anymore but it was fun so I guess it was worth it\"", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-10-22T14:32:15", "background_image": "https://media.rawg.io/media/screenshots/35c/35c196abfceb321383dbb2b760e37219_6chn8cd.jpg", "website": "https://gamenight-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kristian Markovic"], "genres": ["Card"], "publishers": ["Kristian Markovic"], "esrb_rating": "Mature"}