{"id": 281375, "slug": "dodgedot", "name": "DodgeDot", "name_original": "DodgeDot", "description": "Ask yourself how many games have enthusiastic players who are still playing and competing weekly for five years, six years, seven years, or nearly eight years?! Very few, unless you’re talking about DodgeDot™! What on earth can make a game so simple, yet so compelling and addictive? Why is the DodgeDot™ player community so fanatic and dedicated?<br/><br/>DodgeDot™ is truly a game for everybody with players around the world from 2 years old to in their nineties. With over 22 miliion games played to date, it’s incredibly simple to play. DodgeDot™’s basic rules can be described in less than a minute and many players learn the basics just by jumping in and quickly discovering them by trial and error. It's a game that can be played at a gentle and relaxing pace and yet also provides plenty of challenges for players that want to develop their dexterity, playing strategy, and overall game skills for competition. <br/>DodgeDot™ is elegantly simple, yet produces infinitely rich gameplay:<br/><br/>- Drag the moving colored dots to matching goals to score points<br/>- Clear all moving dots from field to advance to the next level<br/>- Avoid colliding with dots of different colors<br/>- Avoid contacting unmatched goals of different colors<br/>- Join dots of the same color to earn bonus points<br/><br/>The nature of the game's dynamics are infinitely variable, with its dots moving in different directions and speeds, and with time and every player interaction affecting the subsequent dot movement patterns and point values.<br/><br/>DodgeDot™ is also a visually pleasing game of colors.  Choose your favorite four-color schemes to play with, from a large selection of palettes.<br/><br/>- New Game Rounds with fresh starting patterns for Levels automatically start every Monday!<br/><br/>- Built in leaderboard network where you can have your own profile, see rank listings for players, friend other players,etc.<br/><br/>- All registered Jampaq Network players have an opportunity to compete for fresh rankings every week!<br/><br/>- Supports Apple's Game Center for high score leaderboard!<br/> <br/>- This is a universal application, so buy it for iPhone/iPod Touch and you can also install it on your iPad!<br/><br/>*** WAS FEATURED ON Apple's \"WHAT'S HOT\" LIST! ***<br/><br/>DON'T FORGET TO JOIN THE JAMPAQ NETWORK!<br/>REGISTRATION'S FREE &amp; SIMPLE IN-APP!<br/>. . . . . . . . . . . . . . . . . . . <br/>Watch videos at: <br/>http://www.youtube.com/dodgedot <br/><br/>Here’s what DodgeDot™ players have to say:<br/><br/>“Total Addiction!!!!  It’s hard to put it down.... The game is mesmerizing…. I have come to the conclusion that the best games in the App Store are those that concentrate more on the gameplay and concept, and less on having the fanciest, largest game around. My favorite games are the simplest and most elegant … and DodgeDot™ tops the list”<br/><br/>“I’ve been playing DodgeDot™ for over 3 years and still enjoy it as much as I did then. If people would only try it, they would be pleasantly surprised why it’s such a great game that’s hard to put down”<br/><br/>“This is truly one of the few games I absolutely cannot bring myself to delete, no matter how low I become on memory. This is a definite must buy!!!”<br/><br/>“This is great for all ages (at age 63, I should know) and the video instructions are beautifully done. …worth way more than you’re payin’. As a retired teacher, I view this as a fantastic opportunity to both develop... and retain thinking skills. These folks put a lot of thought into development and execution! Don’t pass it up!”<br/><br/>“This game has all the makings of a timeless classic. I find myself always coming back to DodgeDot™.”<br/><br/>\"Soooooooo Addicting. Seems easy till it blows your mind and you throw your iPod/iPhone at the ground. Either way great game I simply can't stop playing.  \"<br/><br/>\"Excellent game. Entire family from 3 to 83 loves it\"<br/><br/>\"This may be the winner on my list of 'Most addictive games for the iPad.' My daughter is addicted, I'm addicted and my mother is addicted! Love it, love it love it\"<br/><br/>\"Deceivingly simple at first, and gets challenging pretty soon. Reminds me of Tetris.\"", "metacritic": null, "released": "2009-10-02", "tba": false, "updated": "2019-10-22T14:40:00", "background_image": "https://media.rawg.io/media/screenshots/d59/d593d9df51e71ed7afac87dca8c72959_okvsz0d.jpg", "website": "http://www.dodgedot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jampaq"], "genres": ["Strategy", "Arcade"], "publishers": ["Jampaq Software"], "esrb_rating": null}