{"id": 281378, "slug": "15-puzzle-plus-3-games-in-1", "name": "15 Puzzle Plus - 3 games in 1", "name_original": "15 Puzzle Plus - 3 games in 1", "description": "Three variants of the classic 15 puzzle can be played:<br/>    1. Slide the tiles in a random sequence to a selected goal sequence.<br/>    2. Select a magic square sequence as a goal, i.e., whose rows, columns and diagonals sum to 34. The empty position contains a phantom 16 tile.<br/>    3. Take on a challenge puzzle and from a start sequence, reach the goal sequence in the minimum number of tile moves.<br/><br/>Features:<br/>    * Tile numbers can be changed to Arabic, Eastern-Arabic, Perso-Arabic, Chinese, Hebrew, Indian, Japanese, Korean or Thai numerals.<br/>    * Tiles in the goal position are outlined in red.<br/>    * The start tile sequence can be shuffled before play starts.<br/>    * The color of the even tiles, odd tiles, case and numbers can be changed to any color using a color wheel.<br/>    * Challenge solutions can be played forward and backward.<br/>    * Tiles moved to achieve the goal are counted and can be timed.<br/>    * The Best Overall Score for 15 and 34 puzzles is kept and displayed.<br/>    * All Settings and scores are persisted between app launches.<br/>    * Detailed Help on app features within the app and on the support website verusapps.com.<br/><br/>Send e-mail to support@verusapps.com to report issues, make improvement suggestions or ask questions.", "metacritic": null, "released": "2016-03-18", "tba": false, "updated": "2022-07-22T10:14:38", "background_image": "https://media.rawg.io/media/screenshots/08b/08b8f970268b784413137fda1ae5f3d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gilbert Hansen"], "genres": ["Board Games", "Puzzle"], "publishers": ["Gilbert Hansen"], "esrb_rating": "Everyone 10+"}