{"id": 281382, "slug": "blocky-city-goat-full", "name": "Blocky City Goat Full", "name_original": "Blocky City Goat Full", "description": "Start blocky city survival, be a goat in the simulator!<br/>Become a blocky goat today and run across city streets. You can wreck and smash down everything with your blocky animal! Visit all streets, parks, even graveyard! There are a lot of objects to break. Goat’s life is easy - upgrade and make mess in the city. Eat strange park mushrooms and see what may happen with your animal in the survival simulator. Enjoy missions and spend many hours here. <br/><br/>Features of Blocky City Goat:<br/><br/>- Crazy missions<br/>- Blocky graphics<br/>- Breakable infrastructure<br/>- Big blocky city to explore<br/>- Crazy mushrooms<br/>- Animal survival mode<br/>- Bazooka!<br/><br/>Start a crazy goat survival in a big city with Blocky City Goat! Best thing to do - find and fire a bazooka. Run, eat, crash - be a nasty goat in the simulator is better than be a boring human. Explore blocky city locations with your animal, break everything, even hit innocent people right on the city streets. Meet enemies and attack whoever you want with your goat.<br/><br/>Don't be a good man in the animal world. Instead, be a city goat in animal survival simulator! Feel how to be ba-a-a-d, do crazy things. Create your own strategy, survival in the city is not easy for an animal. Finish all goat quests - they are absolutely crazy, but funny. Feel like a real bad goat in the city.<br/><br/>We enjoy crazy goats and do our best to make great city animal survival. Complete all city missions, do crazy animal things. Run wherever you want in city survival mode, or choose animal quests mode and have a fun. In both of them search every corner in survival simulator, you never know what you may find.<br/><br/>Start playing Blocky City Goat, forget about boring routine!", "metacritic": null, "released": "2017-01-29", "tba": false, "updated": "2019-10-22T14:32:17", "background_image": "https://media.rawg.io/media/screenshots/622/6227ed678ecec2b6881ba2935b46a4f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Arcade"], "publishers": ["Game Maveriks OOO"], "esrb_rating": "Teen"}