{"id": 281344, "slug": "spider-solitaire-plus", "name": "Spider Solitaire Plus!", "name_original": "Spider Solitaire Plus!", "description": "A Classic solitaire card game featuring the same addictive gameplay with a more stylish presentation!<br/><br/>\"Spider Solitaire Plus\" brings you the classic Solitaire style of fun!<br/><br/>We have stayed true to the spirit of Spider Solitaire, and very carefully designed this classic but modern game. Experience the crisp, clear, and easy to read cards, simple and quick animations, and subtle sounds, in any game themes!.<br/><br/><br/>Game Features:<br/>• The Classic Spider Solitaire experience.<br/>• Various Themes: You can choose card front, back and table!<br/>• Fun &amp; Challenging Achievements<br/>• Availability for both tablets and mobile phones<br/>• A Simple and clean layout<br/>• Daily challenges<br/>• Enjoy Unlimited Undo and Hints!<br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/>* Spider Solitaire Plus offers Adfree Subscription, which removes ads for selected period. <br/><br/>We offer the following subscription options:<br/>* 1 Month Subscription offers a monthly subscription for $4.99.<br/>* 6 Month Subscription a subscription for 6 months for $35.99.<br/>* 1 Year Subscription offers a year subscription for $39.99.<br/><br/>* All prices are based on US dollars. Pricing in other countries may vary and actual charges may be converted to local currency depending on the country of residence.<br/>* Payment will be charged to iTunes Account at confirmation of purchase.<br/>* Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>* The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>* Subscriptions may be managed by the user and auto-renewal may be turned off by going to Account Settings after purchase.<br/>* You can turn off the auto-renew for the subscription whenever you want to through iTunes account. Check https://support.apple.com/HT202039. <br/>* When your current subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option. <br/><br/>Terms of Use: http://www.bitmango.com/terms-of-service/<br/>Privacy Policy: http://www.bitmango.com/privacy-policy/<br/><br/><br/>NOTES:<br/>• This app contains banner and interstitial ads.<br/><br/>E-MAIL<br/>• help@bitmango.com<br/><br/>LIKE us on FACEBOOK<br/>• https://www.facebook.com/BitMangoGames<br/><br/>Contact us if you have any questions, ideas for improvements or experience any bugs when playing the game: help@bitmango.com<br/><br/>Your feedbacks will be considered for our future updates.", "metacritic": null, "released": "2018-12-15", "tba": false, "updated": "2019-10-22T14:32:15", "background_image": "https://media.rawg.io/media/screenshots/0e9/0e9d9ecb1056faf4c2dfba21244bfe23_0MJv1ga.jpg", "website": "https://www.facebook.com/bitmangogames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BitMango", "XLsoft"], "genres": ["Card", "Puzzle"], "publishers": ["BitMango", "XLsoft"], "esrb_rating": "Everyone 10+"}