{"id": 281431, "slug": "tron-bike-transform-robot-life-rider", "name": "Tron Bike Transform Robot - Life Rider", "name_original": "Tron Bike Transform Robot - Life Rider", "description": "After the success of US Army Tank Transform Robot we present you this new and amazing Tron Transform Robot Payback. The battle still continues against the invaded robot transformation cars and the motorcycles into the little big city. Now it’s a big question whether you protect your homeland with the tron bike transformation robot and kill all of them evil robots or just look as a spectator and gives the fair chance to evil robot cars to destroy your homeland. These car bots are extremely dangerous and are ready to kill people, so show no mercy and unleash hell out of them on the battlefield and destroy all of the war robots and protect the peaceful city. You have the opportunity to show the world that you are a talented tron rider and a hero in this fast and furious Transforming games.<br/><br/>In this moto robot game, game play is simple but tough as you control your futuristic robot and transform it to grand tron bike simulator. There are lot of different levels, your goal is simply to survive for as long as possible as your bike accelerates getting faster while putting your helmet on. This raceing moto is the insane looking ride with an impressive horse power. In this tron transformation game, robot morphs from a speeding tron bike into an upright gusti robot and moves on two legs and unleash its punches and Kicks.<br/><br/>Game Features:<br/>◆  Simple controls anyone can control a Tron Bike.<br/>◆ Stunning graphics and easy to learn, intuitive touch screen controls<br/>◆ Transform Tron Bike to robot and robot to Tron Bike.<br/>◆ Stunning bike Physics and drive.<br/>◆ Realistic sounds engineered for this moto robot game.<br/>◆ Different camera views.", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2019-10-22T14:32:18", "background_image": "https://media.rawg.io/media/screenshots/b71/b71ea5a96c5e8de1983f30325b866a77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Salman"], "genres": ["Simulation"], "publishers": ["Muhammad Salman"], "esrb_rating": null}