{"id": 281468, "slug": "rolling-ball-car-crash-racing", "name": "Rolling Ball Car Crash Racing", "name_original": "Rolling Ball Car Crash Racing", "description": "Ever wished to ride in lamborghini aventador  with an adventure of thrilling drift car crash. If yes, then prepare yourself for this highly engaging Rolling Ball: Car Drift Racing. Enjoy this SUV driving simulator in amazing impossible off-road, mountain, highway &amp;  roadway tracks. In this wrecking ball extreme racing car game, you have an opportunity to test your professional driving skills of extreme sport demolition derby. Drive like a drift master with your favourite Aventador in this classic car wreck rolling simulation. Step into your american muscle stunt car to perform on different xtreme tracks with super Aventador 3d autocar simulator. Experience endless driving while escaping rolling Cannonball car crash. <br/><br/>Rolling Ball: Car Drift Racing offers you best multiple cannonball challenges in realistic world of sports car destruction. This futuristic lamborghini aventador with excellent Vehicle Control has spectacular speed. Select your favourite drifting Aventador from the variety of sedan, SUV, E36 model car and get ready for this destructive rolling battle. Drive aventador professionally with luxury 4x4 Prado driving simulator for successful completion of car racing. Utilize its accurate physics engines to avoid hitting rolling cannon ball, so that you can cross the winning line as soon as possible.The ultra engine of extreme sport SUV ensures you realistic drifting on  racing track. Dodge all crazy obstacles with top speed aventador simulator in this rolling Cannonball drift car adventure. <br/><br/>Aventador car racing on offroad tracks with impossible speed is no longer easy job as you have to escape cannon ball that are ready to crush you down. All you need is to drive as professional racing car driver in this unpredictable Rolling Ball: Car Drift Racing. You have to give race war while moving through mountain roads to finish race line as fast as possible  for longer demolition derby. Be careful at offroad tracks as you got to pass all checkpoints &amp; dodge rolling Cannonball that are chasing you to crash your drifting car. <br/><br/>Drive lamborghini aventador  carefully for right speed jump and find direction to reach at the endpoint in roadway tracks. Remember you have short time for this car wreck race war, Complete your track in level time as number of missions are waiting for you. Be a professional drifter to enjoy this Rolling Cannonball aventador and Expertly utilize this advanced american muscle drift simulator to successfully accomplish this balls destruction extreme racing car battle adventure.<br/> <br/>So, Are you excited for drifting car race? Get engaged to Rolling Ball: Car Drift Racing to enjoy drive at extreme car wreck offroading simulation. This thrilling racing adventure with destructive crash derby will definitely make your day. Experience this Aventador Simulator and just keep drifting aventador under the presence of cannonball.  Be aware from their rolling destructive attack that is trying to crush you, and stop you to win crossing line. Drive your favourite classic car lamborghini aventador in this amazing  Rolling wrecking ball extreme racing car battle adventure.<br/><br/>Game Features:<br/><br/>»High quality HD graphics with different Environment<br/>»Real drifting car Aventador driving simulation.<br/>»Multiple levels along rolling ball challenges<br/>»Amazing Tricky stunt of drifting off-road vehicle. <br/>»Easy and Real-time Cannonball driving Experience<br/>»Multiple rolling Racing tracks with difficult challenges<br/>»Smooth controls to handle against tricky ramp <br/>»Advanced Aventador with Realistic Driving Simulator", "metacritic": null, "released": "2017-11-15", "tba": false, "updated": "2019-10-22T14:32:20", "background_image": "https://media.rawg.io/media/screenshots/950/9503f9710e750dae6ead7405d43cf3f7_qq0Kqp0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Salman"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Salman"], "esrb_rating": null}