{"id": 281476, "slug": "flat-tire-repair-mechanic-shop", "name": "Flat Tire Repair Mechanic Shop", "name_original": "Flat Tire Repair Mechanic Shop", "description": "Time to fix autocar with suitable tire rim in all new scrap mechanic car factory simulation game. Fix the monster truck crankshafts &amp; give auto mechanic car tires repair service at Flat Tire Repair Mechanic Shop and become the best auto technician mecanico in the new york town city. Hurry up! Park your smart car outside junkyard workshop, There is a lot of auto service to perform at virtual garage tire repairing shop. <br/><br/>Fix up monster truck flat tyres! Be a daring auto mechanic to use new workshop tools! Run a small tyre car factory in a professional auto technician manner. Match a tyre with accurate model and check tires size of the autocar to complete each tune-up section at the classic mechanic garage car repair. Perform scrap mechanic workshop duty and move on to the next repair shop level! <br/><br/>Visit super mechanic work shop (the best car service in town ) to avail all auto repair service relating to tires in Flat Tire Repair Mechanic Shop. Makeover your crash car repair with plentiful supply of tool box. Tire Repairing Shop includes vast collection of repairing facilities for racing cars. Be an auto technician mecanico repair, remove and fit tyres for all types of vehicles with adjusted wheel alignment motorcycle mechanic sim. <br/><br/>Game features:<br/><br/>» Variety of Tasks (Tire change, fix &amp; Repair)<br/>» Superb puncture shop HD graphics<br/>» Fully Equipped car fixing Workshop<br/>» Simple controls and Easy gameplay<br/>» Deal car wheels at Challenging garage levels<br/>» Fix up mechanical problems at repairing garage<br/>» Mechanical tools &amp; advanced machines<br/><br/>Deal with flat tires, tune-up smart car, change the wheels, by using jack, fix tires and rims at repairing Shop. Customers are looking for genuine repair service station for their vehicles recovery.  Pump the burst tyre with accurate air pressure and Lift the auto repair mechanic hood in workshop to add some motor oil so that retro car break engine will run smoothly while driving. just come across to mechanic garage car factory and work at hot car wheels, puncture tyres to provide auto service. Choose tire size with usual rims, old-fashioned so, that to be fitted on your vehicle. Select the right tire for the vehicle maintenance to make it more than test drive and experience real car garage job with exclusive  Flat Tire Repair Mechanic Shop. <br/><br/>Learn how to Fix the punctured tire and auto tune muscle car engine break so that it could be ready for test drive. Take care of retro car at speed bumps as due to messy roads, tire get deflated! No worries the auto mechanic puncture shop is near, one can take his/her autocar at scrap mechanic repairing auto service station to fix it or replace spare parts. This tire repair shop motorcycle mechanic simulator is a crazy car factory garage workshop. <br/><br/>Show off your impressive mechanic skills in this thrilling tire repairing shop. Fix It and tune up smart car fixing at workshop! Download Flat Tire Repair Mechanic Shop puncture shop and start car fixing, monster truck spare parts. Use the screwdriver and welder to fix the broken parts, internal autocar mechanic and find the precise nuts and bolts to be connected for service station. Upgrade mechanic garage as you complete each garage repair shop level!", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-10-22T14:32:21", "background_image": "https://media.rawg.io/media/screenshots/aae/aaef8255d2dd3edb88d273865f1a80e7_T4PLrqB.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Salman"], "genres": ["Adventure", "Simulation"], "publishers": ["Muhammad Salman"], "esrb_rating": null}