{"id": 281441, "slug": "freestyle-parkour-runner-go", "name": "Freestyle Parkour Runner Go", "name_original": "Freestyle Parkour Runner Go", "description": "Run fast and jump high to show parkour tricks! Hold on tight and get amazed with Freestyle Parkour Runner Go training game! More obstacles, flipping, backflip and freerunning adventure is waiting for you. Take your parkour flight and get ready to join most amazing parkour running games. You have a chance to become best flip master, try unbelievable rooftop stunts, jumps, extreme flips and slides to pass obstacle course. Perform like free running roofers in endless thrill of extreme street running parkour simulator! <br/><br/>Parkour stunts is a simple training discipline that includes running, climbing, swinging, jumping and rolling from obstacle course. Leap and move from place to place and building to building by showing parkour jump. Go for impossible jumps and flips to complete your stuntman action task in Freestyle Parkour Runner Go. <br/><br/>Game features: <br/><br/>» 3D city skyscrapers rooftop environment<br/>» Multiple freerunning modes - backflips<br/>» Endless thrill for roofers runner<br/>» Real parkour runner simulation<br/>» Amazing 3D graphics <br/>» Intuitive and smooth controls<br/>» Exciting parkor street running missions <br/><br/>Let’s get started to freerunning stunt man parkour game and go for free run thrilling adventure. Go through crazy parkour adventure now! And take part in roofers runner, extreme rooftop stunts and extreme parkour training. Freestyle Parkour Runner Go offers unbelievable stunt simulator, freerunning and parkour tricks. So, What are you waiting for? Participate in this street runner of parkor escape game, avoid falling down from rooftops while crossing over obstacles and amazing free runner impossible jump.<br/><br/>Select your extreme parkour boy or girl runner to run free on city rooftops and construction sites to show off tricky stunts. Act like real tracer to achieve the fame as a city parkour master! <br/><br/>Download Freestyle Parkour Runner Go for more hard parkour jump to perform and get more thrill as guaranteed! This will definitely thrill you by free running, climbing, swinging, jumping and other movements.", "metacritic": null, "released": "2018-07-28", "tba": false, "updated": "2019-10-22T14:32:19", "background_image": "https://media.rawg.io/media/screenshots/4ad/4ad8f6df919b3bb99d93f8c110eb6f98_Jc4Ah67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Salman"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Salman"], "esrb_rating": null}