{"id": 281439, "slug": "classic-car-robot-transformation-metal-battle", "name": "Classic Car Robot Transformation – Metal Battle", "name_original": "Classic Car Robot Transformation – Metal Battle", "description": "Classic Car Transform Robot is designed to fight against enemy steel robot machines. Evil robots team is creating chaos and took control over the city. These illegal alliance of bots have the power to demolish cities. Don’t let your rival bots become champion of bot fighting world, unleash the extinction and apocalypse on those who dare to assault you. Build the ultimate team and Lead your battle robot to glorious victories in this ultimate bot warship. Become the best defiance autobot and win the final fight for planet earth.<br/><br/>No evil robot enemy will dare attacking the next time when these ultimate classic car transform robot warriors bring them down and Smash on the enemy who are attacking the city. Get ready for an action packed robot transform fight where silver metallic bodies will fight to defend peace in city. This breath taking robot game takes you the robot war zone, experience intense fighting against death machines and destroy iron monster cars. Every level challenges you to destroy more cars for maximum achievement. Can you keep up with the craziness? Amongst the madness, do not lose your cool.<br/><br/>Game Features:<br/>» Brutal Car Controls for Steering Wheel and Pedals<br/>» Smooth Transform Robot movement<br/>» Realistic Sounds Engineered for this Classic Car Robot game<br/>» Transform Classic Car to Robot and Robot to Classic Car<br/>» Stunning Car Physics and drive<br/>» Mesmerizing 3D graphics and environment<br/>» Different Camera views", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-10-22T14:32:19", "background_image": "https://media.rawg.io/media/screenshots/f67/f670be5e836145dcd0a691e3d5d11590_mOhDuiH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Salman"], "genres": ["Simulation"], "publishers": ["Muhammad Salman"], "esrb_rating": null}