{"id": 281460, "slug": "robot-car-crusher-2k17-demolition-derby", "name": "Robot Car Crusher 2K17 - Demolition Derby", "name_original": "Robot Car Crusher 2K17 - Demolition Derby", "description": "For every beginning there's an end. Every shiny new car on the road will one day end up in a junkyard. This Robot Car Crusher 2k17 game is all about to crush cars, kick metal robots and trample weak humans as they run for their lives. But watch out, the evil transform cars is prepared to fight back. These transform cars captures the peaceful city and trying to spread the chaos in the city. Hit the transform robot cars with your robot like bumper cars collision and explode all the evil cars in the air.<br/><br/>Every level gives you a new challenge, gameplay is really easy but yet difficult to be on top. You have played lot of explosion games, car crusher games and destruction games but this game is different from those games. You have a robot with super power of throwing the missile from its arm. Now your robot become a super hero it has shiny metal punches, iron foot kicks and a super power of throwing missile, So get your hands onto it and play like a pro.<br/><br/>Game Features:<br/>» Hilarious Tank Control for Steering Wheel and Pedals.<br/>» Splendid and Intuitive On-Screen Controls.<br/>» Stunning Super Fast Cars to Crush.<br/>» Magnificent Sound Effects.<br/>» Excellent Robot Movement and Controls.<br/>» Playable on Multiple Devices.", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-10-22T14:32:20", "background_image": "https://media.rawg.io/media/screenshots/7a1/7a1c7fad39cb29ef02743f40dbbebedd_D5z5voD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Salman"], "genres": ["Simulation"], "publishers": ["Muhammad Salman"], "esrb_rating": null}