{"id": 28151, "slug": "nba-live-18", "name": "NBA Live 18", "name_original": "NBA Live 18", "description": "<p>NBA LIVE 18 is all about player control, taking place where skill meets style. Every outcome is based on the actions you take, with mechanics that make every choice and twitch skill more impactful than ever before.</p>\n<p>ONE-ON-ONE MECHANIC</p>\n<p>Discover an array of game-changing moves and hundreds of fresh player signature styles, animations, and interactions at every position, with unprecedented one-on-one control and responsiveness.</p>\n<p>REAL PLAYER MOVEMENT</p>\n<p>Delivers on-ball defense with control and responsiveness, letting you stay with the ball carrier and cut off the drive through skill-based timing windows.</p>\n<p>IN THE POST</p>\n<p>Be in position to control bigs and use size and strength to blow by your opponent, cut off the drive, protect the basket, or score down low.</p>\n<p>ON-COURT AWARENESS</p>\n<p>Experience rim-rattling dunks, smooth layups, and the pure physicality of player interactions within one-on-one gameplay around the basket, featuring an amazing amount of animation variety and signature finishes.</p>\n<p>PHYSICS-BASED TRANSITIONS</p>\n<p>With more animations than ever before, each baller in the game maintains realistic momentum throughout every matchup and every move. You’ll feel closer to real action than a front row seat.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-25T17:45:59", "background_image": "https://media.rawg.io/media/games/0c5/0c5a29941dcc045b408c1975e1888089.jpeg", "website": "", "rating": 2.86, "rating_top": 4, "added_by_status": {"owned": 46, "beaten": 2, "toplay": 1, "dropped": 10, "playing": 1}, "playtime": 0, "achievements_count": 26, "ratings_count": 14, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 14, "platforms": ["Xbox One", "PlayStation 4"], "developers": ["Electronic Arts"], "genres": ["Sports"], "publishers": ["Electronic Arts"], "esrb_rating": null}