{"id": 281650, "slug": "monster-truck-vs-formula-cars", "name": "Monster Truck vs Formula Cars", "name_original": "Monster Truck vs Formula Cars", "description": "Monster Truck vs 3D Formula Cars Racing is one of the fastest Truck racing games that you're likely to play this year. Get into your high performance Monster truck and accelerate to breath taking speeds on the track, beat your formula AI by your road rage destruction racing Trucks and take home the Cash and become one of the greatest racing legends to compete in the Monster Truck vs Formula Racing arena! Compete against other racing cars off the grid and win the race to top the podium and unlock the next stunning racing destructive monster truck action stunt.<br/>The racing Truck’s gear is on full throttle and the foot is on the pedal, all you will need to do is to take control and drive your huge wheels Monster Truck on some of the fastest race tracks in the world. Yes you have been hit by Real Grand Formula. 3D Monster Truck vs Formula Grand Prix Racing is the ultimate formula racing game that lets you kick some serious formula Cars.<br/>3D Monster Truck vs Formula Sports Cars Racing features:<br/>- High-end racing Monster Trucks and cars outrunning each other<br/>- Brilliant HD graphics in a visually stunning 3D experience<br/>- True to life adrenaline rush of driving a professional Monster Truck<br/>- Simply tilt your phone left and right to stay clear off vehicles push race button to move forward<br/>- Built for gaining high speeds like no other asphalt game<br/>-Rally on different types of tracks - with asphalt surface or semi-grass or sand<br/>- Sure to be your favorite along with other Asphalt racing games or Monster truck and formula games<br/>- My way or the highway racing experience – take the competition to the next level", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-10-22T14:40:03", "background_image": "https://media.rawg.io/media/screenshots/b58/b589c47feba2df8df22a9e577bc89ecd_JWJlceG.jpg", "website": "http://raheelswati.wordpress.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Haroon Swati"], "genres": ["Sports", "Racing"], "publishers": ["Haroon Swati"], "esrb_rating": null}