{"id": 281652, "slug": "xtreme-parking-maniac-absolute-trials-supercars", "name": "Xtreme Parking Maniac: Absolute Trials Supercars", "name_original": "Xtreme Parking Maniac: Absolute Trials Supercars", "description": "Car driving is something that almost everyone loves and most of the people do it every day. If you love to drive vehicles and take them to another level then xtreme parking maniac is the best thing for you.<br/><br/>Xtreme Parking Maniac offers presents you some of the best super cars to drive in a big environment which comprises of dry docks filled with shipping containers, buildings, multi-story and single-story parking lots.<br/><br/>in Xtreme Parking Maniac you have to put your driving skills to a test and drive your way through the challenging paths and avoiding any and all hurdles while trying to reach to your destination on time.<br/><br/>The game features realistic vehicle physics system to simulate realistic car behaviour. <br/><br/>The game offer a variety of situations where you have to drive onto the shipping containers or some times find your way or jump your way on to the roof tops pulling of dare devil stunts.<br/><br/>the game features supercars such as Audi A6, Mazda RX-7, Lamborghini Aventador, Ford Mustang, Chevrolet Camaro etc.<br/><br/>In each level you have to reach certain check points before you can go to the final stage.  Each level has 3 stars on it. You can use those stars to unlock new vehicles.<br/><br/>each vehicle has unique properties. some parts of the map might not be accessible by all vehicles.<br/><br/>The controls are very simple and straight forward. <br/>All you have to do is drive safe and fast. <br/><br/>so lets drive and yolo!", "metacritic": null, "released": "2017-01-26", "tba": false, "updated": "2019-10-22T14:32:26", "background_image": "https://media.rawg.io/media/screenshots/96d/96d072b006a6cbb7fa1401f12eac3d09_Fol9Ag1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Uzair Mehmood"], "genres": ["Simulation", "Racing"], "publishers": ["Uzair Mehmood"], "esrb_rating": null}