{"id": 281661, "slug": "crime-city-santa-rope-hero", "name": "Crime City Santa Rope Hero", "name_original": "Crime City Santa Rope Hero", "description": "Save helpless people and their children from wield creatures and merciless villains. Free streets from drugs and crimes. Stop military pressure and secure the city from local dirty zombie cops.Use your Santa Claus Rope hero super powers and don’t let anyone escape your anger. Swing Around the city and find the outlaws. <br/>Clear the city of bandits and wait for Santa to arrive with presents.<br/>You are the oldest Santa’s helper. You have seen many ugly things for your long career, that is why now your methods are the same. That’s why Santa Claus sent you from the North pole for faults to bring the spirit of Christmas and to clean all the dirt crime, disease Zombies and Orcs in the city on the island, which was cut off by the snowstorm.<br/>Get quests by phone messages and take your arsenal and turn cold streets into hot, but stop all marauding and criminal. Make the gift for the innocent citizens and children!<br/>Save helpless people and their children from the merciless villains. Free streets from drugs and crimes.<br/><br/>This Santa Claus Mafia Crime city simulator is an ultimate gang war web swing and web shooting rope master hero game with gangster combat chase and counters the crime group. Have you ever played Santa Crime games where you play as a Santa Claus? This time Santa captured by gangster and you save his life. Santa have a special candy rope that can help him swing and fly like a super santa rope man. <br/>And remember what Santa Claus says we wish you a Merry Xmas…<br/>And a happy New Year!<br/><br/>Game Featurs<br/><br/>•New christmas adventures of santa the rope man.<br/>•Dynamic rope shooter with RPG elements ,web swing, web shots or web bullets.", "metacritic": null, "released": "2018-12-13", "tba": false, "updated": "2019-10-22T14:32:27", "background_image": "https://media.rawg.io/media/screenshots/03d/03da23d9ee44659e3f8ad0e809e4c43e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Haroon Swati"], "genres": ["Action", "Adventure"], "publishers": ["Haroon Swati"], "esrb_rating": null}