{"id": 28171, "slug": "21-days", "name": "21 Days", "name_original": "21 Days", "description": "Live As A Syrian Refugee For 21 Days!<br/>21 Days is a simulation adventure game in which you can experience the life of syrian refugees. Main character is a syrian man named Mohammed Shenu who escaped from Syria to western europe. Becoming Mohammed Shenu for 21days, you have to manage money, time, hunger and mental status. You may experience the life of refugees who keep their body and soul with only a faint hope. From now on, you are Mohammed Shenu.[story]Mohammed Shenu is a Syrian who just arrived in western europe. He has luckily been granted 'refugee status'. However, this is not where story ends. He has his wife Warda and his son Abdul on their way to europe. Fortunately according to 'The Principle of the Unity of the Family'(UNHCR), he and his family can both live together in europe with refugee status, only if they finally come to arrive europe. So, Mohammed now has to earn money to send them money necessary for evacuation.[gameplay]You Always Have to Take Control Of Two Things. 1) Mohammed's life : Mohammed needs to eat(hunger), work(money) and at the same time relax(mental).<br/>2) Family's life : Mohammed needs to send money that his wife requests every 3days. Or they would be out of contact with you.<br/><br/>There are about 15 places that you can go. At each places there are many NPCs that you can interact with. Interacting with those NPCs would help your life in europe. You can either get jobs or fall into temptation of crime through NPCs.", "metacritic": null, "released": "2017-06-16", "tba": false, "updated": "2019-08-28T22:06:45", "background_image": "https://media.rawg.io/media/screenshots/7ee/7ee86f5cc4f6539309fcf801766bac94.jpg", "website": "http://21daysgame.info/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 4, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Hardtalk Studio"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Hardtalk Studio"], "esrb_rating": "Everyone"}