{"id": 281840, "slug": "animus", "name": "ANIMUS", "name_original": "ANIMUS", "description": "<p>ANIMUS places the gamer into the role of a solitary warrior who must<br />\nfight his way through a dark and desolate world full of horrific<br />\nmonsters. The mythology-based hardcore action style transports the gamer<br />\ninto the realm of the game, and its namesake. Animus is very tactical in<br />\nthat it requires the learning and application of tactical skills to<br />\ndefeat enemies who would otherwise brutally punish any gamer expecting<br />\ncasual battles.</p>\n<p>Leveling, skill point placement, farming equipment and materials, as<br />\nwell as attack and defensive mechanics are crucial. Types and attributes<br />\nof weapons, armor, and accessories are important. The Proficiency tree<br />\nwithin the character status area should be utilized to advance further<br />\ninto the game. The amount of HP, amount of HP recovery, dodge time and<br />\ndistance, stamina control are some of the important stats to cover in<br />\nthat area.</p>\n<p>Players are rewarded for how they balance their equipment before a<br />\nbattle, and how they place skill points in their Proficiency tree.<br />\nPreparedness will carry you far.</p>\n<p>The type and grade of drops get better upon progression and following<br />\nplaythroughs or at higher difficulty levels. Players will farm material<br />\nand equipment. Much needed equipment drops (weapons, armor, accessories)<br />\noccur in the sub-quests, which are indicated by blue flags. This is<br />\nsimilar with the Rift (yellow flag) areas as well. However, Rift areas<br />\naward players with Rift weapons, which are in most cases stronger<br />\nweapons with dual attributes, comparable to other weapons of identical<br />\ngrades.</p>", "metacritic": null, "released": "2019-01-03", "tba": false, "updated": "2019-10-22T13:48:50", "background_image": "https://media.rawg.io/media/games/69b/69ba431df959e7b0820a580539afe3fd.jpg", "website": "https://www.facebook.com/AnimusStandAlone/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android", "Nintendo Switch"], "developers": ["TROOOZE"], "genres": ["RPG"], "publishers": ["TROOOZE"], "esrb_rating": null}