{"id": 28181, "slug": "katana-x", "name": "Katana X", "name_original": "Katana X", "description": "<strong>Katana X</strong> is a sword simulation action game designed specifically for VR utilizing tracked motion controls. It's a highly accessible game that is easy to get into and strangely addicting once you start. This game takes real physical skill of body control and hand–eye coordination to get high scores. If you like motion gaming, swordplay, and having a serious workout session, this is the game for you.<br/><br/>Katana X was initially inspired by the famous mobile fruit slicing game, but we wanted to make a game that you can actually feel like you are wielding a sword and correctly physically interacting in the virtual world. Slice with the sharp edge of your sword, try for combo opportunities, and avoid hitting bombs to achieve the high score! With practice and the right technique, you might be surprised how high a score you can achieve. Who will be the next Katana Master?Features<ul><li> Physics based, realistic cutting simulation - cut precisely, how you want, and where you want<br/></li><li> New fruit cutting training modes, to get familiar with the basics of the game<br/></li><li> Multiple fruit modes with a completely reworked spawning system<br/></li><li> Multiple new tatami mat cutting challenges<br/></li><li> 2 unique scenes with day and night settings<br/></li><li> Customize your swords with six changeable blades (katana or ninjatō variants) and three handles (shirasaya, cane, classic katana fitting)<br/></li><li> Compete against your friends on local leaderbords or Katana X players from all over the world on the global leaderboards<br/></li><li> Enjoy immersive, highly detailed 3D graphics and 3D positional audio in VR<br/></li><li> compatible with HTC Vive and Oculus Touch</li></ul>Warning: Please Play Safely! <br/>We care about your safety and the safety of others. This is an active, skill based game that simulates real world sword wielding behavior. Due to the nature of fully immersive virtual reality, you may not be aware of your real surroundings. Please make sure your play area is clear from walls, people, animals and any other obstructions that you may collide with once in this VR game. Don't forget to use your wrist strap. If you feel tired or experience any discomfort, discontinue playing. Take breaks often. By playing this game you accept all risk and liability.Your Katana X Dev Team,Ben and Alex", "metacritic": null, "released": "2017-06-09", "tba": false, "updated": "2019-08-28T22:06:45", "background_image": "https://media.rawg.io/media/screenshots/946/946751e8d6959c70a34206e633aee1a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aargle"], "genres": ["Action", "Simulation", "Sports", "Indie"], "publishers": ["Aargle"], "esrb_rating": "Everyone"}