{"id": 281915, "slug": "bitworm", "name": "Bitworm", "name_original": "Bitworm", "description": "Collect bits to grow your worm — but don't bite your tail! Outwit (and out-eat) an army of hungry ants and fast-moving centipedes in this challenging, 8-bit quarter game. <br/><br/>Bitworm is a throwback to classic arcade games of yesteryear, complete with retro graphics and 8-bit sound tones. In this alteration of the classic Snake game, you work to grow your worm by obtaining bits while avoiding running into ants. <br/><br/>Work quickly to eliminate all of the ants in each stage to progress to the next stage. If an ant eats a bit, it may spawn a new ant! If you take too long to clear a stage, more ants will spawn!<br/><br/>The longer you grow your worm's tail, the easier it will be to trick ants into hitting you, but don't bite your tail! Biting your own tail will spawn a centipede! Centipedes move as fast as you do, and can grow up to 50 segments long! They are also smart enough to avoid running into your worm!<br/><br/><br/><br/><br/>If the current game is too difficult for you, you can type \"<strong>EXTRALIFE</strong>\" on the main menu to start the next game with an extra life.<br/><br/>If the game isn't challenging enough for you, type \"<strong>TOOEASY</strong>\" on the main menu. This will make the next game you play spawn only blue ants that move as fast as you do. And if that doesn't sound hard enough -- you will only be given one life to clear the entire game!<br/><br/><br/>", "metacritic": null, "released": "2019-01-18", "tba": false, "updated": "2019-08-28T21:49:36", "background_image": "https://media.rawg.io/media/screenshots/cfd/cfda510b281d607a979b9de608f6d628.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atarei"], "genres": ["Action", "Strategy", "Casual"], "publishers": ["Atarei"], "esrb_rating": null}