{"id": 28194, "slug": "game-of-loot", "name": "Game of Loot", "name_original": "Game of Loot", "description": "Game of Loot: A FREE and fresh take on the classic Dungeon Crawler meeting Puzzle Tile Gameplay! Battle through dungeons inspired by match 3 and collapse games and blended with item crafting abilities and an RPG inventory!<br/><br/>Search for loot, craft items, and outfit your raiders with the best equipment possible. But plan your attacks well, you'll face battles requiring strategy and quick reaction to defeat your foes!<br/> <br/>*4.5 of 5 Star Rating: \"The most fun I've had since becoming bored with Candy Crush\" -Fria Gordo<br/><br/>LOOT each dungeon you raid for riches!<br/>COLLECT the ingredients and recipes you find in your inventory<br/>CRAFT your own Weapons and Armor from the Loot you've found<br/>EQUIP your Raiders with the best items you can<br/>BUILD the most powerful raiding party possible<br/><br/>It’s part Puzzle Tile Game, part Role Playing Game!<br/><br/>THINK before you move to deal the most damage possible<br/>QUICK reaction will be needed. Gameplay is fast and exciting!<br/>DODGE magical attacks that change the tile board<br/>ATTACK after building the most damage dealing combo possible<br/>REVIVE your fallen Raiders as a last resort<br/><br/>====NOTES==== <br/>A network connection is NOT required to play. <br/>Game of Loot is free to play but real money can be used to acquire new equipment and revive fallen Raiders. If this is something that you don't want to be available to you, just disable in-app purchases via your device settings.<br/><br/>====FRIEND, FOLLOW, and LIKE====  <br/>Facebook: http://fb.com/GameOfLoot<br/>Twitter:      http://twitter.com/GameOfLoot<br/>Google+:   https://plus.google.com/u/0/b/104519104544696262110/104519104544696262110/about", "metacritic": null, "released": "2015-07-30", "tba": false, "updated": "2019-10-22T14:30:38", "background_image": "https://media.rawg.io/media/screenshots/63f/63f4912da3335bcafeb2e7bc59bb8805.jpeg", "website": "http://www.gameofloot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Super Ultra hyper"], "genres": ["RPG", "Puzzle"], "publishers": ["Super Ultra Hyper"], "esrb_rating": "Everyone 10+"}