{"id": 281936, "slug": "eternal-exodus", "name": "Eternal Exodus", "name_original": "Eternal Exodus", "description": "Story<br/>Welcome to Hell, kid.<br/><br/>The afterlife isn't what you expected.  Instead of fire and torment, you're forced into a tumultuous sea of opposing political and religious forces all competing for control.<br/><br/>Luckily, you have a Subjugator: a forbidden wrist-worn device that allows you to summon demons.Gameplay<ul><li>150 unique demons to catch and fuse<br/></li><li>Form a party of up to 4 demons at a time<br/></li><li>Fuse demons together to get a more powerful species of demon that inherits up to 4 of its parents' spells and skills<br/></li><li>Craft weapons and armor for your demons<br/></li><li>Sidequests to catch legendary demons<br/></li><li>In classic 90s JRPG fashion, you'll encounter a variety of minigames during your quest<br/></li><li>Built in a custom engine on top of Unity</li></ul><br/>Heavily inspired by franchises like Shin Megami Tensei and Pokemon, Eternal Exodus has a series of mechanics that, while easy to learn, offer depth and complexity.  Catch demons in the wild, and fuse them with demons in your party to create stronger species of demons.<br/><br/>Through skill inheritance, you can fuse demons to end up with demons who otherwise wouldn't naturally be able to learn the skills you give them.  Want a Clammy that can cast Heal-All?  Simply level up a Whisper to level 8 so it learns it, then fuse the Whisper with a Skullray to get a Clammy.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:34", "background_image": "https://media.rawg.io/media/screenshots/bd1/bd1ea40a616e69cd784aaaa1331a9fb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Fordesoft"], "genres": ["RPG"], "publishers": ["Fordesoft"], "esrb_rating": null}