{"id": 281946, "slug": "paintly-color-by-number-fun-coloring-art-book", "name": "Paint.ly Color by Number - Fun Coloring Art Book", "name_original": "Paint.ly Color by Number - Fun Coloring Art Book", "description": "Feel stressed or bored💆? Open this fun number coloring book we have created for you and enjoy the art of painting🔥. “Paint.ly” has upgraded the traditional Coloring Book APP with more fashionable and modern works. Every picture is marked by numbers,  users only need to fill in the color according to the predefined numbers for a perfect work.  <br/><br/>Whether you like modern art🎨, florals🌺, animals🐘or characters👨👩🧒, there are variety of themes you can choose. At the same time, you can generate a Time-Lapse video to restore the coloring process and quickly post it on social media📱and share the fun coloring with friends and family🍻🎈.<br/><br/>Key features:<br/>- 🎨Paint.ly anywhere: no other tools needed<br/>- 🔥Various themes for all tastes: animals, florals, artworks and more <br/>- 💈Use hints if you get sucked in finding the numbers<br/>- 🎁Fresh feeling: new images every day <br/>- 🍻Share with friends: show your wonderful works of art <br/><br/>Being together to rediscover the joy and relaxation of coloring whenever you like. Easier to paint and faster to have fun😄. Focusing on your own feelings, creating excellent pictures with this number coloring Book! A great deal of colorful pages is waiting for you, join us to build your own world of color and beauty 🎊🎊🎊", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:09:17", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c871c1c1b5c9356d46099e85d3c7120.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pinso Marketing"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}