{"id": 28191, "slug": "rusty-quest", "name": "Rusty Quest", "name_original": "Rusty Quest", "description": "Save your planet from an invasion of alien robots and machines!<br/><br/>Rusty Quest is an action packed jump and run shooter, where you fight your way through levels full of alien robots and machines trying to take over your world. Powerful extra weapons and various vehicles will help you with your quest, but be warned - it won’t be easy!<br/><br/><br/>GAME FEATURES<br/>* Play exciting levels and challenges against various rolling, floating, crawling and walking machines!<br/>* Fight your metal enemies with cannons, lasers, grenades, gravity beams and other extra weapons!<br/>* Drive tanks and other vehicles for increased firepower and higher speeds!<br/>* Use the powerful dual virtual stick controls to walk, run, jump, duck, crawl, climb and shoot your way through your enemies’ lines!<br/>* Enjoy the mesmerising sound track, powerful sound effects and awesome explosions!<br/>* Climb the Game Center Leaderboards to compete with your friends or other players around the world!<br/>* Play on all of your iOS devices, with game progress synchronised over iCloud!<br/><br/><br/>CUSTOMER SUPPORT<br/>If you are experiencing any problems running the game, please visit us at rustyquest.com/support<br/><br/>STAY IN TOUCH<br/>We’d love you to stay informed about launch dates in new countries, new versions, upcoming features, or to provide feedback to us!<br/><br/>Like us on Facebook: facebook.com/RustyQuest<br/>Follow us on Twitter: @Rusty_Quest<br/>Subscribe to our News mailing list: rustyquest.com/rusty-quest-news<br/><br/>You can also send your feedback to feedback@rustyquest.com!", "metacritic": null, "released": "2017-05-14", "tba": false, "updated": "2019-10-22T14:30:38", "background_image": "https://media.rawg.io/media/screenshots/846/84655a6cfb43842f48322ebcd5e98d35.jpeg", "website": "http://rustyquest.com/rusty-quest", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Code Handwerker"], "genres": ["Action", "Arcade"], "publishers": ["Code Handwerker"], "esrb_rating": "Teen"}