{"id": 281916, "slug": "chishiki-runner", "name": "Chishiki Runner", "name_original": "Chishiki Runner", "description": "Play with your classmates and friends to see who learns first!<br/>\n<br/>\r\nUse the game in the classroom to study and have fun with the contents of your subject!<br/>\n<br/>\r\nThe game chishiki runner is a simulation of a board game, in which players use dice to advance on the board, however, there are two ways to win ... A winner is the one who arrives first at the goal, who at the same time ends the game, and the other winner is ...<br/>\n<br/>\r\nThe specialty of this game is its use as an educational tool, so whenever the dice are rolled, a question will be asked to the player, if he succeeds he will advance, otherwise he will lose his turn.<br/>\n<br/>\r\nThe second winner is decided by whoever answers the most questions correctly.<br/>\n<br/>\r\nThis game is designed to be a learning tool, so the user must first fill out a questionnaire with questions and answers, which will appear during the game.<br/>\n<br/>\r\nIt was initially designed as a tool to review concepts with higher education students in a way that activates emotions and teamwork while learning. You can use this program to liven up your class.<br/>\n<br/>\r\n- As a student you can play or accompanied to review concepts of interest while you play.<br/>\r\n- As a teacher, use it in class to review concepts with your students, activate their emotions and work as a team while they learn.<br/>\r\n- Use Information Technologies in a different way<br/>\r\n- Up to 8 players, can be 8 individuals or up to 8 teams if you are in class<br/>\r\n- Record up to 5 different questionnaires for different classes or subjects.<br/>\r\n- Languages: English and Spanish", "metacritic": null, "released": "2019-01-21", "tba": false, "updated": "2019-08-28T21:49:36", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dc153361976218f7654652601cc1dc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arrayansoft"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Arrayansoft"], "esrb_rating": null}