{"id": 281951, "slug": "saloon-shootout-mse-europe", "name": "Saloon Shootout (MSE Europe)", "name_original": "Saloon Shootout (MSE Europe)", "description": "<p>Saloon Shootout - This is my submission for the Reaction Game Jam. I solo developed this game over a course of a few days I would say that the assets I used are 50% original and 50% sourced from one of my resource dumps, that I have at my disposal. </p>\n<p>This is my first ever attempt at a game jam and I have yet to find my footing so don't expect miracles yet this has been a fun exercise for me and I intend on taking part in many more future ones, hopefully with a team of developers and much more completely original assets</p>\n<p><strong>OK Introductions over lets go:</strong></p>\n<p>Saloon Shootout is a western styled shooting gallery, you know like the fairground attractions that you usually have to throw some projectile at to knock the target down. <br/><br/></p>\n<p><strong>How to play:</strong></p>\n<p>The controls are really simple. you use the mouse to move the target and then click to shoot it down.</p>\n<p>Each target hit scores you 100 points, also the targets will get faster and faster until the timer gets to 0.5 /sec.</p>\n<p>If you miss a target you will loose a life. When all of your lives are depleted the game will end and you will get your final score. </p>\n<p>That's it really for the game-play loop nice and simple but also challenging and fun. </p>\n<p><strong><br/>Final Thought</strong><br/>Let me know what you guys think and any suggestions would be very much appreciated, as with all my future game jam games i will love to develop them further and your feedback here will help that amazingly</p>\n<p><strong>What i missed out on</strong><br/>Well due to the New years period I had less time than i wanted to add some of the features i liked i will list them below</p>\n<ul><li>More Saloon Scenes</li><li>More Animations</li><li>Better Flow</li><li>More fluid Targeting</li><li>Score Adjustments based on time</li><li>Difficulty levels</li></ul>\n<p>These may still come but it really depends on what you guys suggest.</p>\n<p>Have Fun</p>", "metacritic": null, "released": "2019-01-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/98f/98f76efe9ff08d3638a43156228f97f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MSE Europe"], "genres": [], "publishers": [], "esrb_rating": null}