{"id": 282008, "slug": "unreal-pt", "name": "Unreal PT", "name_original": "Unreal PT", "description": "<p>Unreal PT was under constant development over the course of 10 months, starting in April 2018 and ending in January 2019. Textures, models, animations, gameplay, and code have been recreated from scratch (more details on this in the development logs). </p>\n<p><strong>Specs/Technical<br/></strong></p>\n<p><strong>Minimum Tested Specs: </strong><br/>CPU: i3-7100U 7th Generation with Intel HD 620<br/>GPU: Integrated<br/>RAM: 8GB DDR4<br/>HQ SSR Turned off and resolution at 35% gets ~30fps with these specs<br/></p>\n<p><strong>Performance: </strong>The game has been optimized; however, there are graphics options to help further increase performance if you have a less powerful GPU<strong>.</strong></p>\n<p><strong>Gameplay Notes\r\n</strong></p>\n<p><strong>Supported controls:</strong> Mouse + Keyboard, Playstation and Xbox controllers, VR motion controllers. </p>\n<p><strong>Additional Notes: </strong>The gameplay is nearly identical to the original. The biggest difference is the very end of the game has been changed slightly to make beating it more consistent. The controls are explained as the game progresses, but if you get stuck at any point I've included two text files in the main directory, one with the controls, the other with a guide on how to beat the game.</p>\n<p><strong>VR</strong></p>\n<p><strong> <br/>Edit:</strong> I've got one report that VR has some issues which may cause nausea, so proceed with caution. If I get any more reports like this I'll officially remove VR support. It is possible to complete the entire game using only VR and your preferred control input method.<br/><strong>NOTE 1:</strong> The game will automatically start in VR mode if a VR headset connected. If you have one connected and want to play it normally, you will have to disconnect it first.<br/><strong>NOTE 2:</strong> Room-scale vr is not officially supported. It works, but you will clip through objects if you start physically moving away from the center.</p>\n\n<p>I hope you guys enjoy playing this as much as I loved making it!<br/></p>\n\n<p>Twitter: https://twitter.com/RadiusGordello<br/></p>", "metacritic": null, "released": "2019-01-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/85e/85e8ec947aea3efbb9201eae76800b3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["RadiusGordello"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}