{"id": 28201, "slug": "metro-exodus", "name": "Metro Exodus", "name_original": "Metro Exodus", "description": "<p>Metro Exodus is the third installment in the Metro series. It is based on the series of post-apocalyptic novels by Russian writer Dmitry Glukhovsky. The game is the sequel to Metro: Last Light and is set two years after its ending.</p>\n<h3>Plot</h3>\n<p>Exodus takes place in the year 2036 in post-apocalyptic Russia. According to the Metro universe backstory, in 2013 the planet was devastated by a total nuclear war. The atomic bombing left many parts of the Earth&#39;s surface uninhabitable due to high radiation rates, dangerous mutated monsters, and anomalies abound. The last remnants of humanity survive by hiding in the subway tunnels (hence the name of the series). The main protagonist is Artyom, a former dweller of Moscow Metro. Together with his wife Anna, he escaped the capital to search for survivors in the Russian Far East (thus making the “Redemption” ending of the Last Light the series&#39; canon). </p>\n<h3>Gameplay</h3>\n<p>The player controls Artyom from the first person view. Exodus introduces the sandbox open-world, although the game combines it with the traditional linear levels. Unlike in previous games, Exodus is set mostly outside the subway system. Thus, the game also introduces the weather, the day and night cycle and the change of seasons. The player explores the Russian wilderness during and after the nuclear winter and rides a steam locomotive named Aurora through Siberia.</p>", "metacritic": 81, "released": "2019-02-13", "tba": false, "updated": "2024-04-20T19:21:13", "background_image": "https://media.rawg.io/media/games/152/152e788b7504aa2753c86dae912fb34c.jpg", "website": "http://www.metrothegame.com/", "rating": 4.16, "rating_top": 4, "added_by_status": {"yet": 540, "owned": 4552, "beaten": 1366, "toplay": 792, "dropped": 307, "playing": 127}, "playtime": 6, "achievements_count": 293, "ratings_count": 1592, "suggestions_count": 623, "game_series_count": 3, "reviews_count": 1619, "platforms": ["PC", "PlayStation 5", "Xbox One", "PlayStation 4"], "developers": ["4A Games"], "genres": ["Action", "Shooter"], "publishers": ["Deep Silver"], "esrb_rating": "Mature"}