{"id": 28202, "slug": "wolfenstein-2-the-new-colossus", "name": "Wolfenstein II: The New Colossus", "name_original": "Wolfenstein II: The New Colossus", "description": "<p>Wolfenstein 2: The New Colossus is a singleplayer FPS developed by MachineGames. It is the third installment in the rebooted series.</p>\n<p>Set in the alternate 1961 where Nazi Germany won World War II, the game picks up right at the end of Wolfenstein: The New Order. After sustaining heavy injuries in the battle with Wilhelm &quot;Deathshead&quot; Strasse, BJ Blaskowicz orders a nuclear strike on Deathshead&#39;s compound in order to cripple the Nazi war machine, but he is evacuated by his comrades before the rocket launch. Blaskowicz falls unconscious for 5 months and is woken up by a Nazi attack. The player has to repel the attack and end the Nazi reign over America once and for all.</p>\n<p>The New Colossus features several stealth-action elements, just like the previous title in the series. There are some major differences in the mechanics: now BJ can modify his weaponry on-the-go, dual wield two different weapons at the same time. The cover system makes a comeback. The Protagonist doesn&#39;t stick to cover, leaning out of it instead.</p>\n<p>The game offers a linear storyline, but the player is free to complete side-missions in any order they like. Completing these missions is rewarded with new weapon upgrades.</p>", "metacritic": 86, "released": "2017-10-25", "tba": false, "updated": "2024-04-18T21:20:45", "background_image": "https://media.rawg.io/media/games/a0e/a0ef08621301a1eab5e04fa5c96978fa.jpeg", "website": "https://wolfenstein.bethesda.net/?utm_source=Steam", "rating": 4.09, "rating_top": 4, "added_by_status": {"yet": 410, "owned": 4070, "beaten": 1518, "toplay": 543, "dropped": 254, "playing": 87}, "playtime": 11, "achievements_count": 784, "ratings_count": 1677, "suggestions_count": 629, "game_series_count": 9, "reviews_count": 1699, "platforms": ["PlayStation 4", "PC", "Nintendo Switch", "Xbox One"], "developers": ["Bethesda Softworks", "id Software", "Arkane Studios", "Panic Button", "Machine Games", "Goodbye Kansas Games", "Doctor Entertainment"], "genres": ["Action", "Shooter"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Mature"}