{"id": 282162, "slug": "xen-the-alien-full-game", "name": "Xen the Alien (Full Game)", "name_original": "Xen the Alien (Full Game)", "description": "<p><strong>Xen the Alien</strong> is a third-person, action-adventure and puzzle game that follows the exploits of an Alien scout named Xen desperately trying to find his way back home after being marooned on the Alien planet Naytonia. Xen must traverse the different locations of the planet in search of the missing parts of his Ship as well as contend with a mysterious military presence on the planet using either a lethal or stealthy approach, the choice is yours!</p>\n\r\nFEATURES\r\n<p>Here are the features you can expect from the full game:</p>\n<ul><li>Rich storyline and narrative in story mode.</li><li>Explore 8 different and unique locations on the planet Naytonia.</li><li>Unique cartoon art style.</li><li>A variety of vehicles to ride, including Hover Boards, Flying Saucers and Rocket Packs.</li><li>Dispatch enemies with an impressive array of Weapons (<em>Gauntlets</em>), including Sniper Rifles, Mini Guns, Guided Rocket Launchers and Remote Grenade Launchers.</li><li>Battle a range of enemies with smart AI that investigate incidents, have different personalities/tactics and can pick up and use the same weapons, items and vehicles you can.</li><li>Competitive play with online leader boards for each stage (story mode and challenge mode), tracking highest scores and fastest times among players.</li><li>Design your own stages with the level editor and share on the community website for others to download and play, providing an almost limitless experience.</li></ul>\n\r\nINTERNET CONNECTION\r\n<p>Xen the Alien can be played offline without an internet connection, but with an internet connection you will have a much more enjoyable experience and be able to:</p>\n<ul><li>Upload your high scores to the community website for bragging rights!</li><li>Publish your progress via the @XenTheAlien Twitter Account.</li><li>View community stats like players with highest scores, best times, etc for each stage.</li><li>Download and play new stages created by other players.</li><li>Upload your own stages created using the Level Editor for other players to download.</li></ul>\n\r\nCHEAT CONSOLE &amp; LEVEL EDITOR\r\n<p>The <strong>Cheat Console</strong> and <strong>Level Editor</strong> are <strong>LOCKED </strong>for this version of the game.</p>\n<p>The <strong>Cheat Console</strong> will enable you to cycle through the cheat commands and execute them in-game, e.g. get any weapon, vehicle or item you like at any time). The <strong>Level Editor</strong> will enable you design your own stages and share on the community website for others to download and play.</p>\n<p>If you would like to get the version of the game that includes the <strong>Cheat Console</strong> and <strong>Level Editor</strong> then check out our Developer Page: https://hexgear.itch.io for <strong>Xen the Alien</strong> (<em>Full Game + Cheat Console + Level Editor</em>). It's only <strong>$5.00</strong>!</p>\n\r\nDOWNLOAD &amp; INSTALL INSTRUCTIONS\r\n<p>Extract the \"<em>xta-full-game.zip</em>\" file to any location on your hard drive and double-click the \"<em>XTA Full Game.exe</em>\" file to launch the game.</p>\n<p>You will need the <strong>DirectX End-User Runtime</strong> installed for this app to work. This is frequently used by many DirectX 9 games so you may already have it installed, but if not you can find it here.</p>\n\r\nCONTROLS\r\n<p><strong>W</strong> Move forward<br/><strong>S</strong> Move backwards<br/><strong>A</strong> Strafe left<br/><strong>D</strong> Strafe right<br/><strong>SPACE</strong> Jump<br/><strong>LEFT CLICK</strong> Fire weapon<br/><strong>RIGHT CLICK</strong> Mouse look<br/><strong>F1</strong> enable/disable debug info display<br/><strong>PAUSE ICON</strong> pause game/manage inventory<br/><strong>OBJECTIVES ICON</strong> display/track stage objectives<br/><strong>SCREENSHOT ICON</strong> freeze game/take screenshot<br/></p>\n\r\nFEEDBACK\r\n<p>We would appreciate your honest feedback on any bugs encountered, game performance (fps, load times), presentation/graphics, gameplay, and most importantly, is the game fun? Drop a comment below!</p>\n<p>Thank you.</p>\n\n<p> Twitter @XenTheAlien</p>\n<p> Facebook XenTheAlien</p>\n<p> YouTube XenTheAlien</p>\n<p> Official Website</p>", "metacritic": null, "released": "2019-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/92e/92e0a22d63e06621e81e3d9ef387867b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hexgear"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}