{"id": 282181, "slug": "the-great-wizards-tournament", "name": "The Great Wizards Tournament", "name_original": "The Great Wizards Tournament", "description": "<p>Great Mage : \"Hey Wizard! Yes you... you think you're the best mage on the universe don't you?\" <em>heavy breathing. </em>\"Then come and prove your value on our tournament!\"</p>\n\n<p>Customize your character. Chose its name and color, WOW!<br/></p>\n<p>Discover strong spells, build the spellset that will suit your preferences! <br/></p>\n<ul><li>Want to become the filthiest mage of the universe, no one can blame that!</li><li>Want to be the most undkilllable brute of this arena, your opponents will tremble at your sight!</li><li>Want to use the great power of arcane magic in order to defeat multiple enemies at the same time, everything is possible!</li><li>Want to sit in a chair and watch some dummies fight, also a hell of a fun!</li></ul>\n<p>Join our community on Discord (https://discord.gg/qWa7syB) and fight magicians from your region to become the <strong>\"Gifted of the Gods</strong>\"!</p>\n\n<p><em>The game is currently in development. So unfortunately there won't be a lot of players, but the game will be filled with some bots so you can try the game. Moreover we have only one server which is located in Paris, so for players far from it, delay can be too important.. If you are not from Europa and want to try the game, please contact us in the comments so we can find a solution together ( purchase of new server, local server,..)</em></p>\n<p><em>Thanks for trying the game and please share with us (bugs, suggestion, ideas,..). </em></p>\n<p><em>Updates Coming soon !</em></p>", "metacritic": null, "released": "2018-12-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/100/1009c272a2abe7aa3422dc57d903865e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jean-Marc Studio | JMS"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}