{"id": 282226, "slug": "auldhame", "name": "Auldhame", "name_original": "Auldhame", "description": "<p>An “Unknown Being” travels in a wide, surreal country, which is apparently no longer inhabited (at least in the ordinary sense of “inhabited”).</p>\n<p>The main goal in the story is to find your old home: your “auld hame.”</p>\n<p>The story is best played fullscreen.</p>\n<p>There are no places where you can get stuck, though in a couple places you might think you are. There is always a way back to any spot in the story, though it may be a long way.</p>\n<p>Shortcuts</p>\n<p>If you have visited Safehame or Baton you can get back to them from Manlulka Hall by clicking on the picture of Lorry (to go to Baton) or the picture of Grandbar (to go to Safehame).</p>\n<p>To leave Baton without going all the way to the island and all the way back, you can click to the left when in front of The Powdered Hare. Similarly if you do not want to leave Baton after getting off the boat, you can click to the right and go to The Powdered Hare, or click to the left and go to the hedge.</p>\n<p>If you get stuck here is a Runthrough (spoilers of course) of how to get to the main destination, but nothing else. There is a lot more to find in the world, it is unlikely that you will find it all (unless you become my Patron on Patreon, and I tell you about them all).</p>\n<p>This was made for my sister for Epiphany, and revamped for the end of 2018. Happy Christmas!</p>\n<p>God be with you all!</p>\n<p> - Patrick</p>\n<p>P.S. You can support the creator on Patreon!</p>", "metacritic": null, "released": "2019-01-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cb5/cb5d384aedbaefb65e697c47c3432e8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kneeling"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}