{"id": 282445, "slug": "dont-match-four", "name": "Don't Match Four", "name_original": "Don't Match Four", "description": "<p>Drop a red tile.  Drop a black tile.  Fill the board without getting four in a row.  300 puzzles are currently available and its harder than it looks.</p>\n<p>It's tricky and addictive.  I'm proud of this.  </p>\r\nHow to play\r\n<p>Press keys 1-7 to drop the next tile on that column.</p>\n<p>The color of the tiles alternate between red and black.</p>\n<p>When the game board is completely full of tiles you win.   However if you are filling the game board and accidentally make four in a row of any color in any direction you lose.</p>\n<p>Press 'r' to go back to the menu screen.</p>\n<p>Press 'd' to bring up debug information.</p>\r\nHow to start the game\r\n<p>On the title screen use the arrow keys to navigate the options then press space to start playing.</p>\n<p>There are three difficulty levels and 100 levels at each difficulty level.   Press left or right to select a level (between 1 and 100).   Press up or down to select the difficulty (easy, normal, hard).  Hard is a lot more difficult than normal.</p>\n<p>When you win or lose press space to be taken back to the title screen to try again.</p>\n<p>The game will remember where you left off the next time you start it up.</p>\n<p>The levels were generated with an algorithm that guaranteed they are all solvable somehow.</p>\r\nVariations\r\n<p>After you've mastered the 300 levels available in the game it can be fun to try to beat them as fast as possible.   You might have to practice the same level many times to beat your own personal record.</p>\r\nConclusion\r\n<p>Thank you for playing this game.  Please leave any comments or feedback below.  Let me know how far you get!</p>", "metacritic": null, "released": "2018-12-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4e8/4e831aef838d8c9137acae3c69c0aa12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fabdynamic"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}