{"id": 282627, "slug": "defend-your-land", "name": "Defend Your Land", "name_original": "Defend Your Land", "description": "<p>Generate your economy, build massive defenses, and shoot through the hordes of radiated freaks. Defend Your Land is a mashup of tower defense and fps with a free form building system and satisfying gun play. Shoot and build your way through 30 waves of incredibly difficult game play featuring 6  unique animated enemies, 6 differently styled weapons, and 10 building types to play the way you want.</p>\n<p><strong>BUILDING DEFENSES</strong><br/></p>\n\n<p>A core part of game play is choosing how to use your defenses. Create farms to generate your economy each round and defend them with a multitude of turrets and walls. Buildings are not repairable so be sure to take care of them after you build em.</p>\n<p><strong>WEAPONS AND SHOPPING</strong></p>\n\n<p>With a custom built shooting system guns have realistic kick and accuracy (the more you spray the more you miss). You only start with the 9mm pistol but you have the choice to use your credits on weapons in the shop instead of defenses. This is not only a different path but a necessary one due to the boss rounds that appear every 10 waves. Also, don't forget to buy ammo because if you forget and run out, you're gonna have a bad time!</p>\n<p>Thanks for reading this far. The first 25 people to donate any amount will get their chosen usernames in the credits of the next update, I appreciate you just downloading it in the first place though. This game was solo developed by me over 10 months. It is made to be a very difficult game so don't get frustrated if it takes a while to develop a winning strategy. There is a good chance I missed some things in version 1.0 so make sure to check back for updates after community feedback!</p>", "metacritic": null, "released": "2019-01-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d50/d50cae20a6346168fd8b8696dea051c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NeckbeardProductions"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}