{"id": 282613, "slug": "femida-fourth-trial", "name": "Femida: Fourth Trial", "name_original": "Femida: Fourth Trial", "description": "<p>This is a pre-alpha version of one crime case. Not a complete game, just a demo of a little portion. We invite you to participate in the development by suggesting questions for trial, warrants, evidence and other details. </p>\n<p>Femida is a point'n'click detective adventure about justice for Windows, Mac and Linux. The video game is set in a dystopic world of the State. The State has recently undergone a violent revolution and rapidly restructures.  In a year, it transitioned from a totalitarian communism and now struggles to establish democracy. Provisional government lustrated most of the public servants so capital needs fresh blood. You win a labor lottery to work at Metropolis, capital of the State. The protagonist accepts the summon leaving his countryside life with wife and kids back in the Town. The transfer to Metropolis promises a fulfilling job, good money, and many opportunities. You were born there, your mother still resides in the capital and works for the government. But it's not the only reason you accepted the offer. Your father disappeared during the revolution and his fate is still unknown to this day. </p>\n<p>The game has 2 layers: your job as a judge and your personal investigation into what happened to your father.</p>\n<p>Judge's duty  The first layer is your job. This is not a simulation of what a judge's job is. It fictionalized distillation of it. We didn't aim for realism, we want you to have fun doing it. Job puts you in a loop: 1) You are briefed about the case by police - you give warrants. Underfunded and corrupt police of the State struggles to investigate.  2) You review the results of the investigation: profiles, forensics conclusions, evidence. Then you connect the dots. Some groups might try to intimidate you, the public might try to sway you.  3) Trial starts and you ask questions based on your conclusions. You update your judgment and determine a sentence or proclaim the person innocent. If chaos doesn't break loose during the session, of course. 4) Newspapers from all of political spectrum report on your decisions. Characters react to them. You get the consequences. </p>\n<p>Hero's duty The latter layer is about your investigation into the fate of your father. This part will look like a visual novel. Not a weird one, we promise...or maybe not. This part is still in production, but you can see the characters in the video. </p>\n<p>The universe of Femida is generalized and draws inspiration from different cultures and historical events. We don't make allusions to any particular real-life political parties of figures, neither do we ponder any radical ideologies of the right or the left wing - so you can relax. Not everything has to be political. Femida is primarily exploration,  not a propaganda. Femida only advocates the basic morals, principles, and ethics that make justice systems work. Femida makes us see and appreciate the progress our ancestors struggled and died for us to enjoy. Femida reminds us what paths are tempting and rewarding in a short-term, but disastrous and regrettable in a long run. Femida celebrates a complete ownership of one's life, will and intrinsic value of a life of every human being. Femida encourages personal responsibility, truth and reminds how each action of every individual determine the fate of humanity.  </p>\n<p>This demo contains only 4th case out of 7 crimes cases presented to the player in the game. We need your help! Please, suggest court orders and questions  to ask the participants of the case. Also, provide your opinion &amp; recommendations on how to improve!   </p>", "metacritic": null, "released": "2019-01-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ef3/ef3e685902f59b0b1189b751b46f0d73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["loznevoy"], "genres": ["Adventure", "RPG", "Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}