{"id": 282731, "slug": "final-boarding-call", "name": "Final Boarding Call", "name_original": "Final Boarding Call", "description": "<p>Final Board Call is a morality-heavy, post-apocalyptic game wherein you're required to make choices on who can/cannot come aboard the New Dawn, a ship designed to escape the evil clutches of Armageddon as the war between angels and demons wages on in the distance. The choices you make are vital to the success of the interplanetary excursion, as letting on demons in disguise (as evident by certain characteristics such as abnormal height, satanic tattoos [etc]) or 'negative assets' (those who are unemployed, convicted criminals, medically dependent [etc]) could prove fatal to your end goal.</p>\n<p>-=+=- INFO -=+=- </p>\n<p>Due to time constraints we were not able to fully explain the character's profile however characteristics of a demon; Unusual height, Severely under weight, no family, tattoo(s) and no disabilities or injuries. What the character looks like should not be used to judge them since its just random.<br/></p>\n<p> For the final stats:</p>\n<p>Total Demon - amount of demons you accepted.</p>\n<p>Total Skill Points - This is contributed to by the profession of the character; Janitor &lt; Astronaut. Disabilities or injuries give a skill point penalty. This is also effected by languages spoken.</p>\n<p>Total Morality - Affected by conviction status and tattoo(s).</p>\n<p>Total Capacity - The total amount of people accepted (15) plus their total family members.</p>\n<p>Hope this helps :D</p>", "metacritic": null, "released": "2019-01-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4c4a375ed5d9bc3297f426aa99ea528.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["joshuaemq"], "genres": [], "publishers": [], "esrb_rating": null}