{"id": 2827, "slug": "defense-of-fortune-the-savior", "name": "Defense of Fortune: The Savior", "name_original": "Defense of Fortune: The Savior", "description": "Let's be the savior of the Fortune world.<br/><br/>\"Defense of Fortune : The Savior\" is Episode 3 of The Fortune Chronicle Series.<br/>\"Rebirth of Fortune\" and \"Sorcerer of Fortune\" are in The Fortune Chronicle Series, these games were SRPG and Puzzle. <br/>The Defense of Fortune is a new challenge as a defense style game.  <br/><br/>The goal of the game<br/><br/>The goal is defending castles with request of every lord of castles in the world.<br/>You have to defeat all of the enemies before tearing the castles down.<br/>Save all of the castles from enemies and upgrade units and facilities with money which gained by defeating enemies.<br/>Ultimately, eliminate the conspiracy of Ancient Dragon which is a mother of evil.<br/><br/>Rule of the game<br/><br/>1. You must defend the castle. <br/>\"Wave\" is that monsters are approaching to the castle continuously.<br/>There are about 18 to 50 monsters in a Wave.<br/><br/>2. You can use 8 units which are Soldier, Thief, Ninja, Knight as Assault Units and Archer, Healer, Gunner, Sorcerer as Long Range Units.<br/><br/>3. You can block the enemies by placing Assault Units on the field or Long Range Units on the castle.<br/>You can upgrade ability of units with money.<br/><br/>4. The Healer gather The Ether to supply money without attack.<br/>You Tap the icon above it, get some money.<br/><br/>5. The Sorcerer has the magic of Thunderbolt and Meteor with normal attack.<br/>You need to see the magic icon above it.<br/><br/>6. The Catapult can attack many of the enemies at the same time.<br/>You can upgrade It's capacity, accuracy, power, reload time with money.<br/><br/>7. You can build the tower on field side with a big money.<br/>You can place long range units on the tower in the path of monsters.<br/>It makes easy to defend castle.<br/><br/>8. If the castle durability gage becomes zero by the monster's attack, then the game is over.", "metacritic": null, "released": "2011-07-01", "tba": false, "updated": "2019-10-22T14:20:38", "background_image": "https://media.rawg.io/media/screenshots/050/050033f15065b25bef11f56d94f7a34e.jpg", "website": "http://dotomchi.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dotomchi Games"], "genres": ["RPG", "Strategy"], "publishers": ["Dotomchi Games"], "esrb_rating": null}