{"id": 282845, "slug": "transport-services", "name": "Transport Services", "name_original": "Transport Services", "description": "You will be able to build roads for buses and trucks, as the cheapest variant for the short distances. Rails for trains to travel longer routes with huge capacities or airfields with planes for very picky passengers, that are designed for an even longer distance of travel.Game features:<br/><ul><li>3 game difficulties. Where easy means s stress-free game without any punishments for overcrowded stations while on the opposite side, hard mode is pretty challenging on how far you can get before you go bankrupt, then there’s normal mode which is for everyone who wants to have some responsibility, but does not want let the game punish them too much.<br/><br/></li><li> procedurally generated world<br/></li><li> dynamically growing cities from few houses up to the city full of skyscrapers! And it is all done by the way you care for your cities needs!<br/></li><li>Simple passengers. There are cities of some colors and passengers of another color inside them. Which means that the passenger of its color wants to travel to the city of his color. <br/></li><li>Simple product consumption. Move products to all cities, where they’re not produced. Make sure all cities have as many kinds of products as you can deliver. They pay you more if you satisfy all city needs, rather than transporting just one sort of product. <br/></li><li>Trains, planes, buses, and trucks...tooot! tooot!</li></ul>IMPORTANT NOTE!!!<br/>This is an early access game. There are bugs!!! We are glad we are able to make the fully featured game, unfortunately, it will take some patches to catch them all. Thanks for the patience. Extra features are planned (water, bridges, tunnels), but we are not promising any deadlines as we plan to focus a majority of our developing time on our main project “World of Castles”, But bug fixes for transport services will still be a high priority.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:32", "background_image": "https://media.rawg.io/media/screenshots/140/140dcad522e7ca2427a6b89ba2131235.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["Hammer Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Hammer Games"], "esrb_rating": null}