{"id": 282886, "slug": "de-profundis", "name": "De Profundis", "name_original": "De Profundis", "description": "Une explosion a éclaté au centre commercial. Daniel, qui était sur les lieux, se retrouve désormais plongé dans le noir. Il n'a aucune idée de ce qui est arrivé, et doit se débattre dans les débris, sans le moindre moyen de s'éclairer.<br/><br/>Heureusement pour lui, il n'est pas seul dans la pénombre. Bientôt, il rencontre une jeune femme mystérieuse : Thémis. Cette dernière est familière avec l'obscurité, ce qui pourrait être d'une aide précieuse.<br/><br/>D'autres survivants se joignent à eux, et tous cherchent un moyen de s'en sortir. Mais dans le noir complet, beaucoup de choses sont possibles... Surtout celles qu'on ne peut pas voir.<br/><br/>________________________________________<br/><br/><strong>De Profundis </strong>est une fiction interactive : les choix du joueurs influent sur le déroulement du scénario.<br/><br/><strong>Son histoire est orientée vers les domaines du suspense et du mystère.</strong><br/><br/><strong>Sa présentation est unique</strong>, elle a été conçue pour refléter de manière originale la situation que vit le héros du jeu : l'histoire se déroulant dans le noir total, un soin très particulier a été porté à l'atmosphère sonore et musicale du jeu.<br/><br/><strong>Les répliques de ses personnages ne sont pas doublées par des acteurs, mais elles sont accompagnées par les notes et mélodies d'un instrument qui est propre à chacun d'eux. </strong>Chacun de ses dialogues s'intègre ainsi musicalement dans son ambiance sonore, et le rythme de cette musique est directement liée à celui du joueur.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:29", "background_image": "https://media.rawg.io/media/screenshots/8d2/8d2f47050ac1362b4a002e0937847e12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["points contigus"], "genres": ["Adventure", "Indie"], "publishers": ["points contigus"], "esrb_rating": null}