{"id": 282890, "slug": "cyber-ops", "name": "Cyber Ops", "name_original": "Cyber Ops", "description": "<strong>Cyber Ops</strong> is a story-based tactical hacking game, told from the point of view of a mission control supervisor, operating from the distance. <br/>You are the eye in the sky, the invisible hand, the cyber ghost, looking after your team over the net.<br/><br/>Cyber Ops is an innovative take on the stealth / hacking genre that explores the relationship between the operator and real people on the other end of the line through immersive narrative and challenging gameplay.Story<br/>The young nation of Baltia has earned its right to freedom after a long and painful war, but now the stakes are higher than ever before.<br/><br/>You are part of the <strong>Geist Division</strong>, a secret high-tech unit created by the government to protect the country from all kinds of next-gen threats. As the Operator, your mission is to provide remote support to a group of spec-ops agents deployed in urban terrains. You must control devices and systems with your deep hacking abilities, and scan the environment to provide the safest routes for your squad.Features<br/><ul><li>More than 6 hours of story missions full of cyberpunk themes, investigation and political intrigue.<br/></li><li>Real-time audio feedback from squad leaders brings life to the world of Cyber Ops.<br/></li><li>Different hacking mechanics to keep control of doors, security devices and cyberlink-equipped brains.<br/></li><li>Squad management: recruit new blood for the infiltration squads.<br/></li><li>Research and Development: develop new weapons and cyber-implants to improve the agents performance.<br/></li><li>Retro-futuristic computer interfaces and dark analog synth-based music inspired by 80's cult movies.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:29", "background_image": "https://media.rawg.io/media/screenshots/98d/98d50e248620f31b0036ca001f32b874.jpg", "website": "http://www.octetostudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 65, "toplay": 2}, "playtime": 2, "achievements_count": 24, "ratings_count": 1, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Octeto Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Games Operators"], "esrb_rating": null}