{"id": 282915, "slug": "nomads-of-the-fallen-star", "name": "Nomads of the Fallen Star", "name_original": "Nomads of the Fallen Star", "description": "Set on a distant uncharted &amp; hostile planet, where descendants of a colony fleet that struck disaster have clung on to survive until the eventual rescue. However, decades later, without signs of contact from the fleet, the growing satellite colonies, fragmented due to ideological divides, have begun skirmishes over the limited resources. <br/><br/>A full blown war of conquest looms on the horizon that could risk humanity's fragile existence on this harsh new world.<br/><br/>As the chaos approaches, you take the role as the leader of a rag-tag bunch of scavengers / mercenaries. Your goal is to scavenge, trade, sabotage, fight and help conquer your way to fame and glory. Along the journey, you will meet allies that will join in the struggle to survive the wasteland, and perhaps together, you can unravel the mystery on the origins of the colony and change the fate of all those who call this barren world home.<br/><br/><strong>Key Features:</strong><br/><br/><ul><li> A deep economic simulation lay beneath, where each colonists at outposts consume resources and contribute to production or gathering. Merchant caravans traverse the wasteland, hauling goods to where they are needed. Disruption in the flow of resources leads to dire consequences while offering others opportunities to be exploited.<br/><br/></li><li> A competitive design where other groups of free scavengers roam the world seeking the same opportunities to exploit as the player. Want the precious advanced alloys from the recent fallen space debris? Or that lucrative trade request? So do others, and they will not appreciate your rag-tag gang interfering.<br/><br/></li><li> Factions will raise militia armies to defend or raid and conquer their enemies. Each recruit needs to be equipped and supplied, including basics such as munitions, without which, their guns will fall silent in battle. <br/><br/></li><li> Mercenary contracts that carry consequences. Be it clearing raiders for a faction to help their economy grow, or sabotage their enemy's outposts to cripple their war capability.<br/><br/></li><li> Equip your squad with many different weapons, each providing a unique balance and tactical options. Train their combat skills as they gain levels, and specialize them further with a selection of many perks.<br/><br/></li><li> Hunt the xenobeasts on this hostile world and use their skin, carapace, and organs in crafting useful items and armor.<br/><br/></li><li> An epic sci-fi story awaits, along with side-quests and random encounters.</li></ul>", "metacritic": null, "released": "2019-04-19", "tba": false, "updated": "2019-10-22T14:37:38", "background_image": "https://media.rawg.io/media/screenshots/435/435f34c606ff48ca4f59a21e8c2fd307.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 11}, "playtime": 2, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Huy Phan", "Anh Huy Phan"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Huy Phan", "Anh Huy Phan"], "esrb_rating": null}