{"id": 282971, "slug": "ragnarok-m-eternal-love", "name": "Ragnarok M - Eternal Love", "name_original": "Ragnarok M - Eternal Love", "description": "Dear Adventurers:<br/> <br/>Ragnarok M: Eternal Love is about to receive its biggest update yet—RO2.0!<br/> <br/>RO2.0 holds the promise of bright and distant lands. In the past, we journeyed together on an \"adventure of love and courage\". But as we look forward to the future, the adventure will never truly end—we promise to become a better version of ourselves in the future and continue this journey together with you!<br/> <br/>Our adventure is about to shift to a new continent—Asgard, and a new partner \"Ninja\" will join our adventure team! At the same time, a new set of servers has been opened. We welcome all adventurers to join this new adventure. New players can start from the academy, and rapidly level up to Base Level 120 and T4 job classes. Start out from a higher level and immerse yourself in an exciting adventure!<br/><br/>Depart on an adventure of love and courage, pursue the promise of a bright and distant land!<br/><br/>- A Brand New Map, \"Eclage,\" Has Arrived in the Land of the Pixie!<br/>At the top of Yggdrasil, which looks out onto the Star Bridge, there is a place that belongs to the pixies—The Glorious Domain. When the shattered Star Bridge destroys the peace and tranquility of this realm, will you choose to honor your oath of protection or will you rush to freedom? Go to the realm of \"Eclage\" and journey into uncharted territory on the other side of the Star Bridge!<br/><br/>- An All-New Server Offers a Stress-Free Starting Point for Adventures!<br/>Now that our new server is open, newbies can enroll in \"Cryptura Academy\", complete a 30-minute entrance ceremony and immediately level up to Base Level 120. In 2 days, you can reach T4 and easily catch up after 21 days! Start out on a new adventure bursting with excitement!<br/><br/>- An All-New \"Ninja\" Class Featuring Hundreds of Ninjutsu for Different Combinations!<br/>Ninjas emerge from the darkness with a puissant spiritual power and an array of hand seals and jutsu nourished by it! In addition to featuring a new mechanism for auto attack and combos, they also have skills from three major skill branches, including Flowing Blade, Wind Monster, and Ninjutsu, which allows for a more versatile ninja build!<br/><br/>- A New Instance Dungeon, \"Palace of Beauty\" and Partner \"Brooke\"<br/>A treasure that has been passed down from generation to generation by the pixies is attracting the covetousness of outsiders. Now, a new crisis has emerged! Proceed to our new map \"Palace of Beauty\" and gradually awaken the hidden power of \"Brooke\". You can grow your powers together with \"Brooke\" in the land of the pixies!<br/><br/>- New Special Crossover Event Launched: Slayers Premium<br/>Advance your magic and become the very best slayer! Lina Inverse, Gourry Gabriev, and Zelgadis will arrive on the continent of Midgard to explore the mysteries of Magic Words with you. Advance to become a formidable slayer, resist the evil demon race, and embark on a new adventure!", "metacritic": null, "released": "2019-01-08", "tba": false, "updated": "2023-09-27T17:38:02", "background_image": "https://media.rawg.io/media/screenshots/c1a/c1a0ea60f150508296df3154717cb0a8_E0Enaok.jpg", "website": "", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 3, "beaten": 2, "toplay": 1, "dropped": 3, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS"], "developers": ["Gravity Interactive"], "genres": ["Adventure", "RPG"], "publishers": ["Gravity Interactive"], "esrb_rating": null}