{"id": 282954, "slug": "titan-phoenix-justice-knights", "name": "Titan Phoenix: Justice Knights", "name_original": "Titan Phoenix: Justice Knights", "description": "Enjoy entailing fighting in Titan Phoenix: Justice Knights- the realistic and amazingly-exciting arcade fighter super hero game. Control the Titan Phonix - one of the most iconic super hero duos to fight in battles and defeat evil villains. Alternatively, join your friends in multiplayer story co-op! <br/>Villains with various power and weapons attacked the city lead by their bosses. The Titan Phoenix superheroes duo is the only thing that can stop the rise of darkness..<br/>Can you help in the fight against evil?<br/>It’s time to defeat the increasing number of dangerous villains. Start your amazingly exciting fighting adventure with Titan Phoenix!<br/><br/>DEFEAT THE EVIL VILLAINS IN THRILLING BOSS BATTLES<br/>An amazing arcade nostalgia gameplay is brought to modern times with the most beautiful realistic graphics and the most dramatic sound effects for yours and your friends ultimate satisfaction. Play a campaign, arcade or start a multiplayer story co-op. With simple on-screen joystick for moving, jumping and fighting with your hero character on this arcade action game, you need to defeat the evil villains in awesome boss battles. Compete with your friends in a multiplayer arcade!<br/><br/>VARIOUS GAME MODES, HINTS AND HEALTH PACKS<br/>On this multiplayer arcade you can choose to play various game modes to test your skills such as the campaign mode, the multiplayer mode and the arcade mode. Challenge yourself or compete against other players, start new games or continue playing games you’ve already started, all possible with this multiplayer game. Also, the super hero fight game offers you hints to help you progress and get further and health packs that you can collect to help you heal when it’s need. <br/><br/>UNLOCK NEW AREAS TO FIGHT IN AND GET THE HIGHEST SCORES<br/>By progressing and getting further in the arcade game you can use your achievements and scores to unlock new areas to fight in, keeping you interested in playing and hooked to this exciting and realistic arcade fighting game. Challenge yourself and your friends to play this action arcade and try to defeat all the evil villains on your way to become the ultimate hero and win the highest scores on the multiplayer arcade. <br/><br/>TITAN PHOENIX: JUSTICE KNIGHTS FEATURES:<br/>- Amazing arcade nostalgia game play brought to modern times<br/>- Beautiful and realistic graphics<br/>- Join your friends in multiplayer story co-op<br/>- Compete with your friends in multiplayer arcade<br/>- Defeat evil villains in awesome boss battles<br/>- Multiple game modes <br/>- Unlock new areas to fight in <br/>- Hints and health packs to help you progress <br/>- Get the highest scores to become the ultimate hero<br/>- Free superhero fighter for download <br/>---<br/>Download one of the most amazing action arcade super hero games in 2018!<br/>Fight in battles, compete against friends and try to defeat all the evil villains on the way.<br/>Download Titan Phoenix now on Appstore for FREE!", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-07-29T10:22:01", "background_image": "https://media.rawg.io/media/screenshots/ef3/ef330bbaa68c70366f1d5c0b8eba25a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bad Wolf Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["BAD WOLF SRL D"], "esrb_rating": "Everyone 10+"}