{"id": 283062, "slug": "futuristic-flying-car-2018", "name": "Futuristic Flying Car 2018", "name_original": "Futuristic Flying Car 2018", "description": "Futuristic Flying Car 2018<br/>Futuristic Flying Car 2018 is the most realistic HD flying shooting car stunt real demolition with best extra ordinary super jet plane dogfight best shooting game.Be the best real iron best hero in real flight flying simulator and jet flight super fast pilot simulator shooting action 3d of best war zone among the real sports car racing shooting action games.This is  the best jet plane real flight simulator amazing with muscle super car flying simulator best HD in ever best super city rush dogfight amazing survival arena.Futuristic Flying Car 2018 is also Flying Car real Shooting war Battle full Adventure War real Simulator shooting and best sports flying real car stunt high demolition simulation which is the best and most new super idea of sports car racing shooting action war games and flying car real stunt demolition super games or car real flight games best amazing extreme realistic for free 3d game.<br/><br/>Futuristic Flying Car 2018 is the ever realistic super best game of spots real flying car amazing high demolition simulator shooting 2018 is here  now with car flying real robots games with best fun and 3d flying super jet dogfight battle real among est the car flying shooting fast  robot games,so fight evil in in adventurous flight as iron hero or super hero. Enjoy the ever best super high fly game of flying car stunt real demolition with real high speed flight simulator best 2018.Futuristic Flying Car 2018 is real fun as real jet amazing flight pilot super simulator. Enjoy the super amazing most real best flight simulator of war best plane flight simulator amazing with war pilot simulator carry on fun of dogfight full survival among est the real flying super flight simulator action war strike games of 2018.", "metacritic": null, "released": "2018-01-13", "tba": false, "updated": "2019-10-22T14:32:40", "background_image": "https://media.rawg.io/media/screenshots/720/720961deb0f2c58a5b262d4c2153e00f_V4upRYg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaleel Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Jaleel Ahmad"], "esrb_rating": "Everyone 10+"}