{"id": 283098, "slug": "taxi-driver-public-transport", "name": "Taxi Driver Public Transport", "name_original": "Taxi Driver Public Transport", "description": "Taxi Driver Public Transport: <br/>Fasten your seat belts and get ready for a thrilling drive as a fearless Taxi Driver!<br/>Taxi driving gets more exciting with this brand new game. Drive on steep hill roads and experience gorgeous views like never before. Drive at high speeds and don’t let curvy paths and treacherous turns slow you down. The passengers are waiting, SO HURRY UP!<br/>Feel the thrill of steering your Taxi through beautiful but deadly mountains, and reach your destination in time. Transport passengers safely by tapping into various controls and drive settings. Beautiful 3D environments and vehicles with plush interiors will make you feel like the master of your profession. Enjoy easy controls and smooth game play while cruising through the hills.<br/>Taxi Driver Public Transport is packed with thrilling and exciting pick and drop missions. Pick up passengers from distant locations and take them to their destination on time. The sights of snowy rocky hills will add enjoyment to your journey.<br/>Taxi Driver Public Transport Features:<br/>* Amusing Visual and Sound Effects<br/>* Beautiful Environments<br/>* Variety of Taxi’s with Realistic Vehicle Physics<br/>* Amazing Hill Station Environments and 3D Graphics<br/>* Realistic Animated Passengers<br/>* Thrilling Precision Taxi Driving Experience<br/><br/>Enjoy Taxi Driver Public Transport, the best offroad driving game of 2017!<br/><br/>Your suggestion would be our great pleasure for the improvement of the game features time to time. Thanks.!!", "metacritic": null, "released": "2017-10-21", "tba": false, "updated": "2019-10-22T14:32:42", "background_image": "https://media.rawg.io/media/screenshots/74e/74e30038e59eef641a2d0f5ec93cd0b1_IRwue7t.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaleel Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Jaleel Ahmad"], "esrb_rating": "Everyone 10+"}