{"id": 283039, "slug": "football-frvr-free-kick-goal", "name": "Football FRVR - Free Kick Goal", "name_original": "Football FRVR - Free Kick Goal", "description": "The football is placed, the ground vibrates with the chants of the fans and the stadium is waiting for you, the star kicker of the team! It’s your turn to kick the ball and score the field goal that will make your team win this american football tournament. Are you ready? Then shoot that ball and send it to the middle of those posts!<br/><br/>Become a skilled field goal kicker and train your free kicking skills with Football FRVR, a new american football simulator where you’ll learn how to pass, punt and kick the ball like a real professional football player. Controls are simple and the goal is clear: Swipe your finger on the screen to control the direction and the power of your free kick, then try to send the ball right between the scoring post and kick your way to the hall of fame! Just remember that hitting the post or shooting wide right or left will end the game and will kick your team out of the competition!<br/><br/>Enjoy a physics based game that will hook you up for hours. Control the ball path and the power of your punt and learn how to kick a football like a north american football player. And if you feel skilled enough, try to collect all the stars that you’ll find floating over the goal post. Hit 5 of them in a row with an accurate field kick and win a golden trophy (only for pro football players).<br/><br/><br/>Football FRVR is a truly fun gridiron experience where your only mission is to shoot the ball to the goalpost and perform your best free kick. No matter if you are a pro right-footed kicker or a skilled left-footed punter, all that count is to shoot a goal and win. Simply kick hundreds of field goals and get the highest highscore in the tournament! This casual game is designed for both players looking for a fun time and hardplayers looking for a real challenge. Quick and incredibly addictive gameplay, easy to play but hard to master.<br/><br/>This sports simulator is easy to learn and fun to play, but also offers challenges. Send the ball between the goal posts without fail and you'll kick your way to football glory. Extra points are there for the taking if you can hit the elusive stars that pop in and out of play. Was that a gold cup? Hit it and pocket a pile of points you can use to show off your kicker skills!<br/><br/>Playable in airplane mode, without data connection. No 4G or Wi-Fi required. It’s the perfect casual kickoff game for a short period of refreshing kick training time on the bus, at school or in the office. Easy to play sports game for all ages and all kind of tablets and phones. It runs smoothly both on high-grade smartphones and low-performing devices.<br/><br/>Football FRVR is a low storage game, you don’t need more than 39 mb to play! This field goal kicking game only focuses on giving you a truly fun experience in a low mb game for free. It’s an easy to play american football game with incredibly addictive and simple controls, so both young and adults can have fun. Play online or offline, since you don’t need an internet connection to train your kicking skills. And relax, you can play as much as you want, there’s no time limit!<br/><br/>Feel like a professional american football player behind the scrimmage line, feel the heat of the stadium, aim your kick and shoot the ball to score the decisive goal of the victory!", "metacritic": null, "released": "2018-12-18", "tba": false, "updated": "2019-10-22T14:32:39", "background_image": "https://media.rawg.io/media/screenshots/88a/88ad9662b28f5cd08ccd8138ea47538e_QjWvL79.jpg", "website": "https://frvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FRVR"], "genres": ["Sports", "Arcade"], "publishers": ["FRVR ApS"], "esrb_rating": null}