{"id": 283069, "slug": "tractor-trolley-simulator", "name": "Tractor Trolley Simulator", "name_original": "Tractor Trolley Simulator", "description": "Amazing Tractor cargo Simulator, for every one to enjoy a natural village life like a real heavy-duty tractor trolley simulator. Really driving tractor will always remain a challenge but a tractor with a big loaded trolley is a serious tough to drive specially on off road tracks. Just imagine yourself as you are in mountains driving tractor trolley on off road tracks among high hill mountains and time is short and limited and task is tough and important &amp; also challenging, so you will be in hurry to perform this heavy-duty.Play the latest tractor farming simulator and tractor trolley cargo transporter 3d with the difficult and latest challenges of to be a cargo duty driver of animal cargo &amp; other farming goods to transport them in off road tracks and city roads, mountain tracks. Tractor trolley cargo transportation will definitely take you in the brand-new experience of tractor simulation games and heavy-duty cargo transport. Enjoy the most enjoyable and most wanted goods &amp; animal cargo transportation adventure of huge and real challenges to be the best driver of tractor driving games and tractor simulation games.<br/>Game Feature:<br/>Beautiful Environment.<br/>Big Challenging level.<br/>Stunning HD graphics.<br/>Good Control of tractor.<br/>Experience a cargo tractor.<br/>After Play This game Feedback us with your Reviews.", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-10-22T14:32:40", "background_image": "https://media.rawg.io/media/screenshots/64e/64eecbdf16120e92965ddcbd3172eeb5_YptRM1u.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaleel Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Jaleel Ahmad"], "esrb_rating": "Everyone 10+"}