{"id": 283067, "slug": "city-3-prado-park-drive", "name": "City 3 Prado Park Drive", "name_original": "City 3 Prado Park Drive", "description": "City 3 Prado Park Drive:<br/>   Welcome to the new modern game of futuristic most addictive City 3 Prado Park Drive with full of realistic prado parking fun. This real drive City 3 Prado Park Drive game is specially developed for those users who love to play Prado driving and Prado parking games. In all of best parking prado games on app store, only this Prado drive real parking game is perfect and best parking game to improve your Prado, Car parking and Prado driving skills. These are excited and challenging parking prados and challenging parking levels which will really shock you. This parking frenzy simulation game contains large number of parking prados and real multistory parking environment for full entertain of prado parking lovers.<br/>How to Play:<br/>click the play button to start this parking game.Press left or right buttons to select your Prado.Press accelerator button to speed up your Prado.Change the gear to go forward or reverse.Press the brake button to stop or reduce the speed of your Prado.Avoid to hit any parking hurdles or cones.Use camera button to change camera views.<br/>Features of Prado drive real parking game:<br/>Exciting 3d game environment<br/>Addictive sound effects of game<br/>HD graphics<br/>Large number of parking prados<br/>Many challenging parking levels<br/>Very realistic game control<br/>Improving Your Driving and Parking skills", "metacritic": null, "released": "2017-10-06", "tba": false, "updated": "2019-10-22T14:32:40", "background_image": "https://media.rawg.io/media/screenshots/16c/16c9c5e4f78373609fae511cddf718ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaleel Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Jaleel Ahmad"], "esrb_rating": "Everyone 10+"}