{"id": 283009, "slug": "coloring-cars", "name": "Coloring Cars", "name_original": "Coloring Cars", "description": "A wonderful and free application for cars coloring.<br/>The application contains 32 images of vehicles for coloring. The images are very attractive for adults and kids.<br/>Cars Coloring is game full of vehicles. Color the Cars Coloring on your phone or tablet in this virtual coloring game and painting book. It so easy that even toddler can play, paint &amp; draw. This coloring game where children and adults can color vehicles. Both, boys and girls will love this coloring game. In this coloring game you can find many types of vehicles such as monster truck, racing car, fire engine, bulldozer, tractor, motorcycle, aircraft and train.<br/><br/>What's this Cars Coloring game is about?<br/> The application contains 60 images for coloring vehicles.<br/> You can easily fill out an entire region, draw with a pencil or brush and use an eraser.<br/> Saves your pictures to the gallery of your device.<br/> Both girls and boys will love it.<br/> 20 beautiful colors.<br/><br/>You can paint, draw or doodle whenever they want to. Doodling, painting and drawing was never so easy and funny. It is the time to be creative by downloading this free app. With this application the user can get familiar with many vehicle types such as cars, racing cars, bicycle, fire engine, bulldozer, tractor, motorcycle, airplane and train.<br/><br/>We, at Forqan Smart Tech, have always sought to provide the best for your family through applications designed, and directed each age group separately, our belief in the feature each evolutionary stage passes by your son, but in order to lend life skills and the mentality to learn and grow and play correctly and properly, and to communicate with his peers and the environment surrounding it.", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-10-22T14:32:37", "background_image": "https://media.rawg.io/media/screenshots/9ff/9ff5c94d701561abaec496394c9c7b8a_QDEMJsT.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mohamed Masti"], "genres": ["Family"], "publishers": ["Mohamed Masti"], "esrb_rating": null}