{"id": 283148, "slug": "oil-tanker-supply-truck-offroad-fuel-transporter", "name": "Oil Tanker Supply Truck - Offroad Fuel Transporter", "name_original": "Oil Tanker Supply Truck - Offroad Fuel Transporter", "description": "Let’s start the heavy duty oil tanker truck engine, drive the powerful oil tanker &amp; enjoy the oil cargo truck driving experience &amp; offroad mountain traffic. Oil Tanker Supply Truck is one of the best liquid fuel cargo transporter truck game with oil tanker parking &amp; driving simulator experience. Let’s play the Oil Tanker Supply Truck game that gives you life-like oil tanker driving skills to control heavy duty trailer on offroad tracks. Your goal is to make sure continuous oil supply to offroad gas stations.<br/><br/>Oil Tanker Supply Truck is an offroad oil delivery duty &amp; professional driving game in which you have to drive and control long heavy trucks with oil tankers attached. Your responsibility is to maintain fuel supply to mountain areas. Fill your oil tanker from oil refinery and drive to deliver highly flammable gasoline fuel to different offroad gas stations within time limits to meet the demand of petrol or diesel. You will drive this heavy duty oil transporter truck to its destinations with extreme driving care &amp; accuracy.<br/><br/>The main objective of this game is to drive, park &amp; transport highly dangerous gasoline fuel safely from oil refinery to different offroad gas stations. Now put your hands on the oil transport tanker's steering wheel and be the offroad master of the hills. Challenge yourself to become an expert driver of this heavy fuel transporter truck.<br/><br/>Oil Tanker Supply Truck Game Features:<br/><br/>+ Game Center Achievements and Leaderboard<br/>+ Driving Experience of Heavy Transporter Truck with Oil Tanker<br/>+ Exciting Levels to Enjoy Oil Tanker Truck Driving<br/>+ Driving Fun on Mountain Roads with Real Traffic<br/>+ Heavy Truck Driving Simulation with Smooth Steering &amp; Hydraulic Brakes<br/>+ Different Camera Angles to explore the 3D Offoad Environment<br/>+ A Unique Concept of Mountain Oil Transportation<br/>+ Amazing Gameplay with HD Graphics<br/>+ Play as a Virtual Oil Transport Truck Driver", "metacritic": null, "released": "2016-07-01", "tba": false, "updated": "2019-07-30T11:17:26", "background_image": "https://media.rawg.io/media/screenshots/48f/48f78a9ad8a5959d0f6b9b97b3c0d44d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["elinx technologies"], "genres": ["Adventure", "Simulation"], "publishers": ["elinx technologies"], "esrb_rating": "Everyone 10+"}