{"id": 283232, "slug": "quickgame", "name": "QuickGame", "name_original": "QuickGame", "description": "Supports 2 to 20 players. Enjoy playing board games, but hate when they are ponderously slow? Want to fit a game in a short amount of time? Then QuickGame™ is for you!<br/><br/>You'll be surprised at how a game clock can transform a game, keeping people fast, and encouraging them to think ahead in other people's turns. Now with QuickGame™ you can use a game clock on a game with more than 2 players (unlike traditional game clocks).<br/><br/>Also functions as a debate timer! Set the start &amp; add time to zero, and the turn order to \"freestyle\". Then tap who is speaking, and the app will keep time.<br/><br/>Feature List:<br/>• Supports 2 to 20 players!<br/>• Specify any initial time, from 1 minute to 10h+<br/>• Two timer modes: game timer &amp; turn timer<br/>• Three different turn orders: clockwise, counter-clockwise and freestyle <br/>• Count up mode, set 0 to the start &amp; add time, and it will count up, not down<br/>• Optionally, each turn can grant an additional amount of time (great for variable length games)<br/>• Players can be marked as defeated to remove them from the game<br/>• During the game, you can add additional time to all players, or to the current player, and adjust the added time per turn.<br/>• Change the color and label of players<br/>• Rotate the gameboard during setup (using two-finger rotate gesture).<br/><br/>With QuickGame™, we don't enforce any strict \"out of time\" rule. This is left up to you. The counter will go into the negative, so you can clearly see who is out of time (and by how much) and can punish them how you see fit (e.g. \"they lose\").  We feel that this keeps things more friendly: perhaps you just want to keep things snappy, and not actually force people out of the game. It's all up to you.<br/><br/>It's possible to add extra time to a particular player if you need, so you can easily cater for beginners by giving them more time (or, you can just let them go negative, and turn a blind eye).<br/><br/>The \"additional time per turn\" feature is also useful. This keeps the game moving along, without forcing a game to end before its time. The more turns you have, the more time you get. Mid-way through the game, if you need to tweak how much is added to each turn, that's possible.<br/><br/>QuickGame™ has some pretty neat features too to avoid losing your game clock mid-game:<br/>• Crash/reboot protection: if you restart the app while a game is in progress, everything continues as it should.<br/>• Unlimited Undo: forgot to pause the timer for a snack break? No worries, with QuickGame all actions can be undone.<br/>• End the game by accident? You can go back to it.<br/>• Notifications alert you to when the time is up, even when the app is closed (only when a \"Time's up\" sound is configured, and notifications are enabled).<br/><br/>We hope you like QuickGame™ and try it for your future gaming sessions. If anyone ever uses it with a 20-person game, please take a photo and email us :)<br/><br/>We have a few ideas on how to make QuickGame™ even better, like being able to customise the player names, adding sound effects and more. The more support we get the more we will do, so if you like it, please spread the word!", "metacritic": null, "released": "2013-08-25", "tba": false, "updated": "2019-10-22T14:32:47", "background_image": "https://media.rawg.io/media/screenshots/260/2606ce5f7dc656787987886b6a5d6c57_0Lm16He.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["geospike.com"], "genres": ["Board Games"], "publishers": ["Geospike"], "esrb_rating": "Everyone 10+"}