{"id": 283292, "slug": "danse-macabre-thin-ice-a-mystery-hidden-object-gam", "name": "Danse Macabre: Thin Ice - A Mystery Hidden Object Game", "name_original": "Danse Macabre: Thin Ice - A Mystery Hidden Object Game", "description": "Play the trial for FREE!  Pay once &amp; complete the adventure!<br/><br/>Ruth Fisher is the star of a popular figure skating show, but the final dress rehearsal is suddenly cancelled when her biggest fan turns up dead. It seems that he was trying to warn her about something, but what could it be? You’ve been called in to protect her, but can you keep this young celebrity from danger, or will this show’s opening night be her final performance? <br/><br/>• THE SHOW MUST GO ON!<br/>Who would want to see this famous skater dead? Her partner, who was publicly humiliated by Ruth earlier? Her rival, who’s jealous of her fame? Or could it be her manager, the very same man who hired you to protect her?<br/><br/>• EXPLORE A WINTER WONDERLAND<br/>Pour over the crime through spectacular hidden object scenes.<br/> <br/>• DON’T CRACK UNDER PRESSURE!<br/>Investigate the suspects in a variety of sparkling puzzles and clever mini-games.<br/><br/>• SOLVE A KIDNAPPING IN THE BONUS GAME<br/>Keep the suspense going and enjoy additional Collector’s Edition exclusives including collectible snow globes, morphing objects, special achievements, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-06-24", "tba": false, "updated": "2019-10-22T14:32:49", "background_image": "https://media.rawg.io/media/screenshots/be9/be9df391955f331cc2902a30538d7052_HbYF2j6.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}