{"id": 283362, "slug": "rescue-hero-minions-edition-2014", "name": "Rescue Hero - Minions edition 2014", "name_original": "Rescue Hero - Minions edition 2014", "description": "Rescue Hero-Minions edition 2014 is a new innovative match game! <br/>Objectives differ in over 50 levels to rescue heroes. Among them, many level you can unlock easily, , but there are some hard levels make you stuck for days or for months. Make matches of 3 or more identical minions and you will create blasts! Starts out simple, but things get more and more interesting and challenging when the higher level you reach,the more blocks there are!<br/>Rescue Hero- Minions edition 2014 is rated as the super hit casual game for who loves jewels matching games. Start your jazzy journey in this puzzle adventure! ! More fun with colorful Minions!<br/>Game Features: <br/>● Many challenging levels of Minion heroes<br/>● New tricky blockades<br/>● Stunning and powerful effects<br/>● Play high score in game center<br/>● Small size but super impressive graphics<br/>How to Play:<br/>- Just tap there or more minions of the same color.<br/>- There is no time limit, but each stage has target points to proceed to next stage..<br/>- Remember just two rules: The more minions you pop, the more scores you will get and Try to clear all block, you will get a lot of bonus.<br/>Now,let's start our crush minion journey. You will love and be addicted to  the fun, creativity and excitement of this great minion game.", "metacritic": null, "released": "2014-04-13", "tba": false, "updated": "2019-10-22T14:32:50", "background_image": "https://media.rawg.io/media/screenshots/d04/d04d6663cb44ffffd796e82c7ef475c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JUPITECH PTY"], "genres": ["Arcade"], "publishers": ["JUPITECH PTY"], "esrb_rating": null}