{"id": 283375, "slug": "olliolli-switch-stance", "name": "OlliOlli: Switch Stance", "name_original": "OlliOlli: Switch Stance", "description": "<p>\n      With over 75 Awards and Nominations including BAFTA Best Sports Title \n      2015, OlliOlli: Switch Stance includes both OlliOlli and OlliOlli2: \n      Welcome to Olliwood - bringing together the defining Skateboarding \n      Series of this generation!\n    </p><p>\n</p><p>\n      Making it’s Nintendo Switch debut, OlliOlli mixes addictive one-life \n      gameplay with over 120 tricks and grinds to pull across 50 deviously \n      crafted Levels, 250 Challenges, Spots Mode and Daily Grind. Not enough \n      for you? Complete all Challenges to unlock the super skilful RAD Mode!\n    </p><p>\n</p><p>\n      Rack up the biggest and coolest combos along the way then time your \n      landing to perfection to rule the Leaderboards.\n    </p><p>\n</p><p>\n      The iconic skater goes all green-screen with a stunning new look in \n      OlliOlli2: Welcome to Olliwood, plucking you from the street and \n      dropping you squarely in the middle of the big screen’s most bodacious \n      cinematic locations!\n    </p><p>\n</p><p>\n      The sequel boasts all new Ramps and Epic Hills allowing for monster air \n      and multi-route levels. Further, OlliOlli2’s combo system has been \n      expanded. The joy of Manuals, Reverts, Revert Manuals and Grind \n      Switching gives you more control and expression than ever before.\n    </p><p>\n</p><p>\n      The hallowed ‘Tricktionary’ also expands with new specials including 540 \n      Shove-its, Anti-Casper Flips and Darkslides.\n    </p><p>\n</p><p>\n      All of this with another 5 unique worlds, 50 Levels and 250 Challenges \n      to tear through. Daily Grind, Spots Mode and RAD Mode also make a return \n      to top it all off!\n    </p>", "metacritic": null, "released": "2019-02-14", "tba": false, "updated": "2023-02-09T02:30:27", "background_image": "https://media.rawg.io/media/screenshots/0c7/0c734359f2ee56f04140ae7ea78f9e32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 6, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch"], "developers": ["Roll7"], "genres": [], "publishers": ["Gambitious"], "esrb_rating": null}