{"id": 283380, "slug": "bash-the-bear", "name": "Bash The Bear", "name_original": "Bash The Bear", "description": "<p>\n      Lead the squad of hedgehog commandos in reclaiming the mushrooms stolen \n      by the lazy bear from the forest animals. Work out a plan, put your \n      prickly friends in place, and light the fuze! Teach the old rascal a \n      lesson – show him who is the boss here!\n    </p><p>\n</p><p>\n      \"Get ready to have real fun! Lead the squad of hedgehog commandos in \n      reclaiming the mushrooms stolen by the lazy bear from the poor forest \n      animals. Work out an elaborate attack plan, put your prickly friends in \n      place, light the fuze – and let the explosive fun begin!\n    </p><p>\n</p><p>\n      Use powerful cannons, baseball bats, and everything else you have at \n      hand to right the wrong in your own home. Teach the old rascal a lesson \n      – show him who is the real boss in the forest!\"\n    </p><p>\n</p><p>\n      \"Get ready to have real fun! Lead the squad of hedgehog commandos in \n      reclaiming the mushrooms stolen by the lazy yet ravenous bear from the \n      poor forest animals. Time to restore justice! Work out an elaborate \n      attack plan, put your prickly friends in place, light the fuze – and let \n      the explosive fun begin!\n    </p><p>\n</p><p>\n      Keep in mind that a couple of dynamite crates can solve any problem! \n      Teach the old rascal a lesson – show him who is the real boss in the \n      forest!\"\n    </p>", "metacritic": null, "released": "2019-01-16", "tba": false, "updated": "2019-01-11T03:56:11", "background_image": "https://media.rawg.io/media/screenshots/4b4/4b4c6380df8b6676d8daf2d03b911088.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": ["FuryLion"], "genres": [], "publishers": ["FuryLion Group"], "esrb_rating": null}