{"id": 283339, "slug": "skate-board-jumper", "name": "Skate Board Jumper", "name_original": "Skate Board Jumper", "description": "Skate Board Jumper is a new free skate games with a lot of challenge, players and levels to Unlock! If you are looking for skateboard games, so this the right choice for you. As this Skateboard Jumper is different from any other Skateboard game and rated as one of the the best time killer games application. Speed Up, Jumpand Turn as Fast as posible!<br/>How to play:<br/>It's easy and fun to play! All you have to do is just to touch the screen and off you go. It is your touch that will let the skater boy jump with his patin. If you are among newbies out there, do practice jumping before you start succeeding in going up one level at a time. To win all this stages you only need fast in decision making and accuracy.<br/><br/>Features:<br/>- Simple and intuitive control<br/>- Attractive graphics<br/>- Colorful animation<br/>- Fun and addictive<br/>gameplay<br/>- Amazing fantasy skateboard<br/>game sounds<br/>Do you think you are up<br/>for the challenge? Download and get on your board now to skate your way to the<br/>top and earn score as high as possible! Compete against other players from<br/>around the world by your own strategy.<br/>Play with your friends, complete achievements, gain experience and upgrade your favorite skater. You can also customize your outfits, boards, trucks and wheels with real Skateboard Jumper.<br/>Download this game for free now and start enjoy.", "metacritic": null, "released": "2015-04-23", "tba": false, "updated": "2019-10-22T14:32:50", "background_image": "https://media.rawg.io/media/screenshots/bae/bae179fe393ba4ab4e776ada9bf504c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JUPITECH PTY"], "genres": ["Action", "Arcade"], "publishers": ["JUPITECH PTY"], "esrb_rating": null}