{"id": 283314, "slug": "uncharted-ocean", "name": "Uncharted Ocean", "name_original": "Uncharted Ocean", "description": "Exploring new route with the background of the Age of Discovery. Enjoy the rich experience by sailing across the oceans around the world. <br/>    In the amazing sailing voyage, you could meet a variety of disasters caused by the uncertain weather. You can also plunder caravans, meanwhile you could be pursued by pirate ships.<br/>    In Uncharted Ocean, you can recruit outstanding sailors, attack and occupy ports to achieve the goal of conquering the oceans.<br/>    At the same time, you can get rich by collecting things and treasures, buying and selling goods.<br/>    If you want to experience the extra fun of the game, finding surprises of the game is a good choice. For example, finding the Black Market and triggering the hidden plots to collect many kinds of super equipments and working drawings. <br/>   It is a simulation and role-playing video game series dealing with sailing and trading, themed around the Age of Discovery. In the games, the player takes up the role of a captain and manages a seagoing fleet to participate in trades, privateering, treasure hunting, exploration, and plain piracy. Even though the series is largely open-ended, there is still a loose plot which requires the player to follow certain paths, and deviating from these paths may stall the progress of the story.<br/><br/>Background:<br/>    The Age of Discovery, or the Age of Exploration  is an informal and loosely defined term for the period in European history in which extensive overseas exploration emerged as a powerful factor in European culture and was the beginning of globalization. It also marks the rise of the period of widespread adoption in Europe of colonialism and mercantilism as national policies. Many lands previously unknown to Europeans were discovered by them during this period, though most were already inhabited. From the perspective of many non-Europeans, the Age of Discovery marked the arrival of invaders from previously unknown continents.<br/><br/>    The period is between the 15th century and the 17th century when European explorers sailed the seas to open new alternative ways to Asia when the Ottoman Empire blocked the land routes.This period was characterized by the rivalry between Spain and Portugal, the advent of colonization, and general exploration. In later games, other countries are also involved. Some historical events during the Age of Discovery, like the Treaty of Tordesillas, were mentioned.<br/><br/>Features:<br/><br/>*Trade - Nearly a hundred of ports, each one of them has different specialty goods.<br/><br/>*Naval battles - Have a casual chat with other ships on the sea, or... just run!<br/><br/>*Ship building - Start your mighty fleet by building ships, customizing hulls --- adding cannons and <br/>figureheads!<br/><br/>*Investment - Investing ports to activate port buffs, you can even be the mayor!<br/><br/>*Crew- plenty of crew arrange systems for you to boost navigating.<br/><br/>*Weather - Ship sailing speed is influenced by the wind speed and power. You can't see too much far through fogs, while storms always bring damage to your ships. No one dares cross the formidable Cape of Storms without ships strong enough.<br/><br/>*Sailing status - There is never a plain sailing. You must be able to handle every kind of emergencies in time, such as innutrition, scurvy, damaged sails, collapsed goods and even rebels among crew.<br/><br/>*Extra items - you can use extra items to fish, collect drinkable water and recover treasures in the  bottom of the ocean.<br/>Attack on ports.<br/><br/>*Duels mode - Duels mode can be activated by certain plots, rebels of crew and even when you recruit a new crew... so let's play solo!<br/><br/>*Explore - You can explore sites outside cities or ruins along coasts. Except common materials, you may also gain hundreds of rare collections.<br/><br/>*Black Marketeer - He is the man who holds the top grade goods in hand but does not appear commonly. It depends on your luck what you can get from him.", "metacritic": null, "released": "2018-08-08", "tba": false, "updated": "2019-10-22T14:32:49", "background_image": "https://media.rawg.io/media/screenshots/d58/d586b616c66503486a34e9ee5b5e2cd7_9NsdPB0.jpg", "website": "http://www.locojoy.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Tianjin Locojoy Technology"], "genres": ["Adventure", "Simulation"], "publishers": ["Tianjin Locojoy Entertainment Technology Co.,ltd."], "esrb_rating": "Everyone 10+"}