{"id": 283349, "slug": "monkey-sky-streaker", "name": "Monkey Sky Streaker", "name_original": "Monkey Sky Streaker", "description": "This monkey loves banana and he is on the way to collect as many banana as he can.<br/><br/>Sky Streaker Game is inspired from a lovely monkey who loves eating bananas and enjoy challenging mischief.<br/> <br/>CAUTION: Sky Streaker is extremely addictive. Play at your own risk!<br/> <br/> How to play <br/>Click respectively two sides, if the monkey touch the clothes, he will die<br/>If the monkey eat the bananas, he will get score and coins<br/>You can use those coins to upgrade or buy more items for your pet, such as: Glass, Hat, Headphones...<br/>Especially, with the Glass, your Monkey will have chance to enjoy combo of banana...<br/> <br/>Game players will feel highly challenged with the increasingly difficult challenges when the trap is getting closer to each other. You need to keep your eyes open and your hands ready on the Sky Streaker because one false move and your Monkey falls down and die immediately.<br/>This cute Ski Streaker will bring you endless joy!<br/> <br/>         \tSome features<br/> <br/>Free Ski Streaker game app<br/>The excellent and fantastic graphics<br/>The easy- to- use controls<br/>Addictive gameplay and soundtrack<br/>Social Features - share your high score photos on facebook!<br/>Whether looking to beat a friend's record, complete missions or unlock achievements, Ski Streaker packs a full load of fun for everyone!<br/>Hours of fun for you, your friends and your family. Download Ski Streaker for Free, right now!", "metacritic": null, "released": "2015-06-27", "tba": false, "updated": "2019-10-22T14:32:50", "background_image": "https://media.rawg.io/media/screenshots/4bd/4bdc382c3d60fc542a344aba0c2ed52e_wlm5WaL.jpg", "website": "http://jupitech.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JUPITECH PTY"], "genres": ["Arcade", "Puzzle"], "publishers": ["JUPITECH PTY"], "esrb_rating": null}