{"id": 283461, "slug": "strange-terror-from-the-deep", "name": "Strange Terror From The Deep", "name_original": "Strange Terror From The Deep", "description": "<p>Story: You survived the terrors in space, took a few years to recover from that experience and now you're back on your feet, ready to get back to work. However, your luck just can't get any worse. The creature you were transporting on your submersible has broken free from captivity and killed off most of your crew. All that's left is you, Dr. Salmon, Commander Nathan and The Captain. Now only one question remains. Are you a bad enough dude to escape the terrors from the deep?<br/></p>\n<p>Explore a large and  all new derelict submersible, featuring 7 endings, a bunch of gadgets, tools and objectives and 21 brand new monsters, each with their own special abilities, strengths and weaknesses! Featuring special guest monsters such as, Baldi (legally obtained by Basicly Games LLC), an old friend from Strange Terror From Beyond The Stars, Nosferatu and more! And if you ever feel like the terrors that lurk in the deep are too easy to handle, then get ready for hardcore mode. Try to survive against two monsters in this all new mode added into Strange Terror From The Deep. A challenge only you can accomplish! (That's a lie, many can beat it I'm sure)<br/></p>\n<p>Will you be able to save your friends or leave them to their watery grave? Find out, in this brand new sequel to Strange Terror From Beyond The Stars!<br/></p>", "metacritic": null, "released": "2019-01-10", "tba": false, "updated": "2019-01-11T04:06:04", "background_image": "https://media.rawg.io/media/screenshots/be3/be3a5c7ef40ad556d83ce6464c5e741c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dave Microwaves Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}