{"id": 283792, "slug": "alexandria-library-xyz", "name": "Alexandria Library XYZ", "name_original": "Alexandria Library XYZ", "description": "<p>www.patreon.com/AlexandriaLibraryXYZ<br/></p>\n<p>Study in Alexandria Library XYZ and become a wizard.</p>\n<p>Travel in a last airbender narrative type world, visiting villages to helping them solve their problems zelda style, and return to your wizard school Alexandria Library XYZ where wise animal masters will teach you more technical powers so you can do even stronger spells.<br/><br/>In Alexandria you will be able to learn all undergraduate level knowledge found in a degree in mathematics and a degree in physics.<br/><br/>Each subject is a particular type of magic, and you will go to a particular village to learn it. Once you complete all the challenges in that village you will have mastered that subject, that skill, that particular type of magic. You will be able to measure your progress and collect more and more color coded math and physics skills, until you master all the branches of magic.<br/><br/>Learn by doing fast and small choices, little experiments, and getting huge amounts of feedback, that way you can learn even if you are distracted or tired, but you can also make progress incredible fast by getting the zone.<br/><br/>Tie mathematical concepts to emotional meanings, you will want to succeed in mastering a skill if the fate of the world depends on it and the love of your life is at risk. Or if you want to see what happens next, or you think summoning apples and other small objects is cool. Once your emotions are engaged your whole brain will be recruited, because is how it evaluates something is important. Your memory will be working better, and you maybe even dream with mathematics. (seriously, this seems to be a somewhat common effect of playing this game).<br/><br/>Day/night cycles of 60/10 minutes will remind you of resting and taking a break after working hard. Food, water, and other rewards will remind you of eating and drinking in the real world to regain your energy, so you can keep studying in the Alexandria Library XYZ.<br/><br/>Collect scrolls and notes, and cure your own diary with valuable resources. Knowledge is power, it allows you to DO and have an effect in the world. Post and upvote useful resources to specific challenges.<br/><br/>Our objective in Alexandria is to lower the bar of physical and emotional excruciating effort necessary to learn math and physics, making it an extremely chill activity.<br/><br/>Imagine a world where 90% of people are scientifically literate. Where the common folk walking down the street actually knows quite a bit of math and physics, without never hadding to put expensive effort on it, and just because there was a very entertaining game available to waste time on. A world where people make informed decisions, and where they can engineer they way to a better life. Just imagine.<br/><br/>Alexandria Library XYZ is a web browser game, lightweight so anybody around the world with a relatively slow computer or device and play it.<br/><br/>If you want to play more please support the project, your support makes this educational game possible. Thank you. Click on the link below to help create the Alexandria Library XYZ game.</p>\n<p>www.patreon.com/AlexandriaLibraryXYZ<br/></p>", "metacritic": null, "released": "2019-01-07", "tba": false, "updated": "2019-01-11T04:47:50", "background_image": "https://media.rawg.io/media/screenshots/43d/43da6262499c9871df9c6206d17b3b04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SSCharles"], "genres": ["Strategy", "Educational", "Puzzle"], "publishers": [], "esrb_rating": null}