{"id": 2837, "slug": "albedo-eyes-from-outer-space", "name": "Albedo: Eyes From Outer Space", "name_original": "Albedo: Eyes From Outer Space", "description": "Inspired by 60s pulp sci-fi movies, Albedo: Eyes From Outer Space is a first-person adventure game. Working as a night-watchman at a partially abandoned, secret research facility, you are knocked unconscious by a nearby explosion. Waking in the complex’s basement you look up and see a gaping hole in the ceiling. Escaping the damaged building is only the start of your troubles and as you begin to explore the base you encounter strange, unearthly organisms. Is this all because of some sort of biological experiment gone wrong? You’ll need to fight for survival as you unravel the mysteries and solve the problems that lie ahead.<br/><br/><br/><br/><ul><li>A 60’s sci-fi, b-movie inspired narrative, with plenty of mystery and suspense! <br/></li><li>Stunning 3D environments and detailed objects to manipulate. <br/></li><li>Realistic and atmospheric sound effects will envelop you in your surroundings. <br/></li><li>Adventure-style gameplay featuring puzzle elements and incorporating first-person shoot’em-up action.<br/></li><li>Twenty detailed rooms to explore; each full of mystery, strange visions and intricate puzzles to solve. <br/></li><li>An advanced physics engine making object interaction extremely immersive. Pick up and use objects as you would expect to in reality. <br/></li><li>Over 100 items to interact with. <br/></li><li>Unique hint system using a device to ‘see into the future’ to help solve complex problems.<br/></li><li>Multiple challenging mini-games and puzzles.<br/></li><li>Unearth hidden areas, discover Easter eggs and unlock achievements. <br/></li><li>Over 8 hours of challenging gameplay!</li></ul><br/><br/>", "metacritic": 66, "released": "2015-04-09", "tba": false, "updated": "2022-09-29T23:57:53", "background_image": "https://media.rawg.io/media/screenshots/729/7295eaa2f274e9cd9711d31fa4d0e90e.jpg", "website": "https://www.facebook.com/AlbedoEyesFromOuterSpace", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 289, "beaten": 4, "toplay": 3, "dropped": 3, "playing": 1}, "playtime": 3, "achievements_count": 122, "ratings_count": 5, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 5, "platforms": ["Xbox One", "PlayStation 4", "macOS", "PC"], "developers": ["Merge Games", "Z4G0 and Ivan Venturi Productions"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Merge Games"], "esrb_rating": null}