{"id": 283876, "slug": "project-loading", "name": "Project Loading", "name_original": "Project Loading", "description": "<p>Project Loading, a puzzle game with minimalist design, is the adventure of a Loading Bar on its way to reach 100%. Play and find out that, while you’re wondering why the hell the loading is taking so long, the Loading Bar is actually going through hell for you, and you will end up by pulling for it!<br/></p>\n<p>Project Loading is a precision and ability videogame, designed to the last detail in order to create hundreds of little brain teasers.<br/>Tilt your phone and move it to reach 100%!</p>\n<p>Play more than 100 levels and face several obstacles: Slow-down and Speed Areas, Bouncers, sudden position changes caused by the Anchors, and Barriers to open. All of it in a short given time!</p>\n<p>The most important thing? Not to get out of the field of crosses, or you will start all over again!</p>\n<p>Activate power-ups such as Infinite Time, Immortality or Resurrection, thinking about when and where they may be more useful in order to reach the next level!</p>\n<p>Create your own levels and share them with your friends, who will test their nerves trying to complete them.<br/>Share your best levels with the Analphabeta Studio team: you may have a chance to see them released in the future!</p>\n<p>In Project Loading the everyday words are ‘defeat’ and ‘failure’, but at the end of it your self-control will be fit even for a Zen master, promise!</p>\n<p>Features:<br/>-Arcade/ Puzzle Game<br/>-Use of the accelerometer to move<br/>- 100+ levels<br/>-Minimalist graphics<br/>-Pop culture references<br/>-Easy game with short levels<br/>-Countless items and obstacles to interact with<br/>-Level Editor</p>", "metacritic": null, "released": "2019-01-07", "tba": false, "updated": "2019-01-11T04:58:04", "background_image": "https://media.rawg.io/media/screenshots/d55/d55bd6b47f04ded4b6d0b0837e9533d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["AnAlphaBeta Studio"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}