{"id": 283983, "slug": "frio3-parting-and-meeting", "name": "Frio3 - Parting and Meeting", "name_original": "Frio3 - Parting and Meeting", "description": "Frio3 is a sequel of original Frio2, contains additional Survival-Horror elements at its most atmospheric in an advanced technique. This is the last of the three stories.<br/><br/>The game starts in an earlier timeline set in a decaying town, deserted and ghostly, centering on two sister last one left nearby who got involved in a ghost accident.<br/>With this game, You will be exploring the most extremely scary experience and tasked with figuring out the proper tools and deciphering all clues with your wit and keen observation for survive.<br/><br/><br/><ul><li> Upgraded Graphic and Scaring props<br/>-Graphics have been greatly improved and many shock points have been added to create an improved (scary) atmosphere in the game.<br/><br/></li><li> It supports 9 languages.(Subtitle)<br/>-English, 日本語, español, Deutsch, français, русский, Indonesia, ไทย<br/><br/>※ Those who consider their state of mind and body to be weak are advised not to play this game. Realistic appearances of the evil spirits might give you a heart failure.  <br/>This is not a mere scare tactic. The Elderly, pregnant and underage individuals are restricted from playing this game.<br/><br/>By default, use the keyboard and mouse. But you can also play it on a touch screen PC.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:26", "background_image": "https://media.rawg.io/media/screenshots/e7a/e7a9e5b7fd231296bbd1213edcabed78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zoocros"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["zoocros"], "esrb_rating": null}