{"id": 284066, "slug": "card-party-uno-card-game", "name": "Card Party - Uno Card Game", "name_original": "Card Party - Uno Card Game", "description": "Who's down for a party!?<br/><br/>This classic party card game is now much crazier, bigger and better.<br/><br/>Gameplay is like uno and crazy eights… But it has the most crazy cards you have ever seen in your life! Wowza!<br/><br/>You and your friends will love to play this classic party game. Download and get blown away!<br/><br/>Card Party Features:<br/><br/>• Play Card Party online for with players across the world<br/>• 10 unlock-able special cards like Dice, Bingo, and Wizard<br/>• New 6 Player Mode for frantic fun!<br/>• Play with Facebook Friends or as Guest <br/>• Earn Coins and level up!<br/>• Fast cards, competitive and fun<br/>• 9 Unique Leagues to unlock with new ways to play<br/>• FREE bonus coins every day!<br/>• Excellent game graphics and animations<br/><br/>This party card game is so popular all over the world you probably already know how to win!<br/><br/>On your turn, play a card that matches the top card in the centre of the table. To win, must play all of your cards before your opponents do.<br/><br/>If you win you get a special chicken dinner surprise! <br/><br/>Card Party is based on classic party games but also designed to give you a totally new fun experience, gameplay is like Crazy Eights,  but we will surprise you with new and exciting cards and a unique way to play. Card clash is also a family game like monopoly, game of life, bingo, with up to six players at once!<br/><br/>Some of our unique cards include: <br/><br/>• ALMIGHTY WIZARD - casts a spell on all players!<br/>• MEGABLOCK - Block everyone!<br/>• WARP PIPE - Takes cards to another dimension<br/>• ARROW  - Shoot another player with an arrow!<br/>• HAND SWAP - Swap your hand<br/><br/>….And many, many more! <br/><br/>It is a simple color and number card match game. Play with 6 players and progress across 8 leagues unlocking new cards. Everyone from your family, even grandparents and kids can enjoy a game with Friends, and Buddies.<br/><br/>Every league you unlock is different, some leagues you will start with four cards and in others you get eight! Each league also has a time limit per game. If nobody gets rid of all their cards before the timer runs out the game will end and coin prize will be awarded to players with the least cards left.<br/><br/>The first player has to match the card in the discard pile either by number or color or the player can throw down a special card else he must pick a card from the deck. If he can play what is drawn, great. Otherwise the turn moves to the next person.<br/><br/>The winner is first one who has no cards left. <br/><br/>Tips &amp; tricks to be remembered:<br/><br/>• Play your cards before the timer runs out<br/>• Play Smart! You can choose to pickup a card instead of playing a card during your turn<br/>• Forcing your opponents to pickup more cards than you can also lead to victory<br/>• Get a coin monopoly and unlock new cards<br/><br/>You will also soon be able to create a room with friends. This is the classic games uno! Race to get rid of all your cards. Use the crazy cards against your opponents.<br/><br/>You think this is the ideal card game for you? Bingo! Say goodbye to spider solitaire, uno, bingo, monopoly. Say hello to card party!<br/><br/>Download this Party Card Game for your phone and tablets today and have endless hours of fun, we hope you feel Card Party is much better then the competition.<br/><br/>So, what are you waiting for? Download Card Party!!<br/><br/>Please rate and give your feedback for Card Party to help us improve the game on: feedback@bombayplay.com", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2019-10-22T14:32:53", "background_image": "https://media.rawg.io/media/screenshots/73b/73b43144b274c7d1e3ce5a19ee7e6e1c.jpg", "website": "https://www.bombayplay.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bombay Play"], "genres": ["Board Games", "Card"], "publishers": ["Bombay Play Private"], "esrb_rating": null}