{"id": 284023, "slug": "polygon-color-by-number", "name": "POLYGON: Color by Number", "name_original": "POLYGON: Color by Number", "description": "Color by number with Polygon app. Take a break and spend some time with top coloring book for adults! Polygon App is a great stress-reliever that helps you to create masterpieces in a simple way. <br/><br/>This low poly puzzle game will definitely help you to relax and create some amazing artworks.<br/>Color and recolor cute pictures — no special set of skills needed! Enjoy it and have fun!<br/><br/>- Amazing choice of wonderful drawing pages: Animals, Birds, Marine, Flowers, Places, Food, People  — lots of pictures to explore;<br/>- We prepare special Holiday content so you can celebrate with us;<br/>- Enjoy unique pictures in polygonal style;<br/>- New images are added daily: explore various collections and categories;<br/>- No wifi needed — color top art works anytime, anywhere;<br/>- Share your artworks with friends in one tap.<br/><br/>Painting has never been easier! Relax and enjoy Polygon app!<br/><br/><br/>Polygon Premium.<br/><br/>Polygon Premium is a paid subscription that allows you to unlock all pictures, get rid of interstitials and banner ads.<br/>Weekly subscription with 3-day free trial period is $7.99, monthly $17.99, and annually $69.99 or equal to the same price in USD.<br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/>Subscription will be automatically renewed for the same price and duration period, auto-renew can be turned off at least 24 hours before the end of the current period.<br/>Your account will be charged for the subscription fee within 24 hours prior to the end of the current period for the price initially selected.<br/><br/>Subscriptions may be managed by you and auto-renewal may be turned off by going to the user's iTunes Account Settings. <br/>For more information please visit the link https://support.apple.com/HT202039. <br/><br/>No cancellation of the current subscription is allowed during the active subscription period.<br/>Unused portion of a free-trial period will be forfeited when a user decides to subscribe.<br/><br/>EULA: http://severex.io/terms/<br/>Privacy Policy: http://severex.io/app/recollect/privacy/", "metacritic": null, "released": "2018-12-28", "tba": false, "updated": "2019-08-02T03:03:27", "background_image": "https://media.rawg.io/media/screenshots/8de/8ded05696fbfdc41a378a4e3dfe2c892.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Severex"], "genres": ["Board Games", "Puzzle"], "publishers": ["Severex PL SP Z O O"], "esrb_rating": null}