{"id": 284045, "slug": "go-frog-go-the-all-new-strategic-gameplay", "name": "GO Frog GO - the all new strategic gameplay", "name_original": "GO Frog GO - the all new strategic gameplay", "description": "GO Frog GO is a great fusion of action and puzzle gameplay. To stay away from the spikes behind and avoid being twined by the traps, players have to do single-step moves, that is climbing to an adjacent block, or to jump over blacked obstacles in between blocks of equal distance. Climbing has a relatively slower moving speed than jumping. The moving pattern has consulted a historical game \"Sternhalma\", or in another name the \"Chinese Checkers\", a board game invented centuries ago in Germany. Frogs appear in the game are all poisonous and re-designed in comic style. Developer is hoping players to learn about the characteristics of these poisonous frogs while playing the game, and BE CAUTIOUS when you see them!  More characteristics of the game:<br/><br/>Mode:<br/>Leading the frog to stay away from the skies behind, and avoid being twined by the traps for too long. Frogs can do single-step moves, that is climbing to an adjacent block, or to jump over a blacked obstacle in between blocks of equal distance. Remember, climbing has a relatively slower moving speed than jumping. Players are going to be challenged by the increasing number of traps, the fewer blacked obstacles when moving forward and the accelerating moving speed.<br/><br/>Traps:<br/>1.Arrow, the frog is allowed to climb or jump toward the arrow's direction only upon stepping,<br/>2.Snowflake, the frog will be frozen for one second upon stepping,<br/>3.Mud, the frog can only climb to the next block upon stepping,<br/>4.Rip, the block will black out in one second and the frog must leave within the time.<br/><br/>Skin(s):<br/>15 different skins are available for unlock using candies eaten in Classic Mode and Infinity Mode. These skins are real poisonous frogs from around the globe with significant characteristics drawn in comic style. Short description of their biography are provided.<br/><br/>Monetization:<br/>The game is completely free for iOS devices. Developer has implemented interstitial ads and banner ads. Players can disable these ads by purchasing the No Ad. option at the store.", "metacritic": null, "released": "2017-01-23", "tba": false, "updated": "2019-10-22T14:32:52", "background_image": "https://media.rawg.io/media/screenshots/6ac/6ac828f7299ca5dd40db1294e3dd43f8.jpg", "website": "http://www.giantbear.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Giant Bear Technology"], "genres": ["Strategy", "Puzzle"], "publishers": ["Giant Bear Technology"], "esrb_rating": null}