{"id": 284153, "slug": "adventures-of-fluzz-land", "name": "Adventures of Fluzz Land", "name_original": "Adventures of Fluzz Land", "description": "facebook.com/AdventuresOfFluzz <br/>facebook.com/TopArcade <br/><br/>(official video included) <br/>http://youtu.be/h1JotvLvXqA <br/><br/>Your new cute super hero has finally arrived! It's time to take him for a ride. <br/><br/>--- FEATURES --- <br/><br/>- Play the whole of World 1. <br/>- Perform many special moves. <br/>- Run, jump, spin, crouch and even fly to overcome the dangers which lay ahead. <br/>- Use your special gun, just load them with fruit and knock down your enemy.<br/>- Adventures of Fluzz will offer fast and great gameplay on all iPad versions. <br/>- Works great on old and new devices, as smooth as it can get. <br/>- Online scores for main game. <br/>- Control configuration. Play the way you want. <br/><br/>--- UPGRADE TO THE FULL VERSION AND GET --- <br/><br/>- 4 exciting themes. (woodlands,desert,pyramids and snow). <br/>- Complete worlds and unlock amazing mini games which will have you hooked for hours. <br/>- Hang on to balloons, bounce off from springy mushrooms, dodge arrows, fire and much much more. <br/>- Includes many puzzle elements which will have you guessing what to do next. <br/>- Face the ultimate battle in every world, where you will face King Hong himself. <br/>- Re-play any level you want.<br/>- Online scores for main game and for the 4 mini games, the competition just cannot get better. <br/>- Best value for money guaranteed. <br/>- We go the extra mile just for your entertainment. <br/><br/>******* THE STORY ******* <br/><br/>Theres big trouble going on in Animville. <br/>King Hong has turned against all our animal friends and magically enchanted them against you. <br/><br/>The only animals that resisted this spell were the bunnies, so King Hong trapped them all inside cages. <br/><br/>Only you managed to escape! <br/><br/>Now it is up to you to set out on this quest to free all your friends and perhaps break the enchantment. <br/><br/>Take control of Fluzz, a cool bunny who likes to take the sun and has amazing abilities. <br/>Your adventure begins in a beautiful woodland where the sun is always shining. <br/>Try and overcome all the hazards here and you will travel far to the hot deserts, a place screaming of danger in every corner. <br/>Can you guide Fluzz to the ancient pyramids and enter one of the most enchanting places ever known? <br/>Finally you will face your last battle in the snowy wastelands, so be ready to equip your bunny with a thick coat to keep him warm. <br/>It's sure to be extremely cold and dangerous out there. <br/><br/>Only Fluzz can save Animville and put an end to the nasty King Hong. Are you ready for adventure, fun and a big blast!!! <br/>Go on Fluzz is waiting for you... Pick Tap and Play... <br/>If you think this was all, you're in for a shock. There's much much more. <br/>Complete the worlds to unlock amazing mini games. You have a total of 4 mini games which will take the competition to another level where you will face all your friends to beat their scores. <br/><br/>******* THE FUTURE ******* <br/><br/>- Introduce other cute animals so you can control them too, each with their unique abilities. <br/>- More exciting and dangerous worlds. <br/>- More mini games to keep you hooked and playing for longer. <br/>- And last but not least, any bugs found or reported will be fixed and updated quickly. <br/><br/>I would like to thank everyone for your time and support. <br/>Your purchase of Fluzz will ensure it just gets better and better with free updates forever.", "metacritic": null, "released": "2013-07-27", "tba": false, "updated": "2019-10-22T14:32:57", "background_image": "https://media.rawg.io/media/screenshots/c97/c978ac5b0cd8b88e5d8f69253d7dc571.jpg", "website": "http://www.toparcadeapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Joe Pitto"], "genres": ["Adventure"], "publishers": ["Joe Pitto"], "esrb_rating": "Everyone 10+"}