{"id": 2842, "slug": "braveheart", "name": "Braveheart", "name_original": "Braveheart", "description": "*** NEW YEAR SALE! Get Braveheart with 66% discount! ***<br/><br/>-- Braveheart is a good, tough action game. Every time you play, you acquire something, whether it’s gold, a new level, a weapon upgrade, or a perk – you always make progress. The spinning swing is a cool move, too; it’s fun to get up a head of steam and then arc into a horde of incoming enemies. Give it a download. <br/>- IGN Score: 7.5 (Good). <br/><br/>-- Braveheart stands tall and proud, boasting refreshing controls, extensive character customization options and superb graphics.... The only real risk is once you get the game you won’t have time for much else. <br/>- Touch My Apps - 10/10 <br/><br/>-- You just might even end up being surprised, like I was, that games of this quality DO exist for the iPhone. <br/>BUY IT! <br/>- The Adrenaline Vault<br/><br/><br/>Braveheart is a dynamic action / role-playing game with a unique combat system. King has sent you, the brave knight Richard, in search of the Holy Grail - an ancient chalice that has been protected for centuries by the most powerful creature on Earth, the Great Dragon! The king has promised the person who finds it not only half of the kingdom, but also his beautiful daughter’s hand in marriage. But uncovering this treasure will not be easy. You must use various tactics to fight the dangerous enemies and overcome the treacherous obstacles that stand in your way. Can you conquer the dark forces against you to find the Grail and claim your prize?<br/><br/>Game features:<br/>- Heart-pounding action with plenty of enemies to kill<br/>- Engaging fantasy storyline<br/>- 10 different weapons to use in battle<br/>- Magical spells that can be conjured during combat<br/>- Bonuses that provide special powers and abilities<br/>- Unique boss battles - kill or be killed!<br/>- A beautiful game world with numerous locations to visit", "metacritic": null, "released": "2010-12-02", "tba": false, "updated": "2019-10-22T14:28:12", "background_image": "https://media.rawg.io/media/screenshots/647/647d2ddd8a894b3e07b64c460c574b63_YmBDdy9.jpeg", "website": "http://gaijinent.com/en/games/braveheart/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gaijin Entertainment"], "genres": ["Action", "RPG"], "publishers": ["Gaijin Entertainment"], "esrb_rating": "Teen"}