{"id": 284213, "slug": "drumy", "name": "Drumy", "name_original": "Drumy", "description": "Drumy is a music game, designed to provide a fun way to exercise your rhythm sense. <br/><br/>You are challenged to complete 100+ unique levels/rhythms on a Djembe drum with sets of 8 or 16 beats. After some levels, the tempo will be stepped up live during the game. A coloring scheme is used for the different playing areas, making the logic easily understood by children as well.<br/><br/>The individual rhythms are split in three different difficulty and thematic groups:<br/>- Rhythm (Level Sections: 1-4 ; Total of 36 Levels): <br/>You are introduced to the world of Drumy.  Every rhythm has 8 beats and there are two playing areas one for the left and one for the right hand, colored in red and yellow respectively.<br/>- Coordination (Level Sections 5-8 ; Total of 36 Levels):<br/>In this group, we introduce a third drum playing area. The coordination between your hands and eyes becomes key. The rhythm sets become ever more richer and colorful. <br/>- Mastery (Level Sections 9-12 ; Total of 36 Levels)<br/>Each level is now consisting of 16 beats and it gets real fun to play.<br/><br/>Music and music playing has been many times reported to have positive and lasting effects on the human brain and emotions. Drumy is a great way to get you started or to foster your skills.<br/><br/>You can customize Drumy by changing the drum's size, showing or hiding a metronome, or choosing to continue or stop playing upon level completion.<br/><br/>Drumy runs on your iPhone and iPad and is integrated with Game Center. <br/><br/>Demo Video and More Info: http://creatub.com/drumy.html<br/><br/>Drumy Featured history - App Annie Link (requires free registration):<br/>http://www.appannie.com/app/ios/drumy/features/#device=iphone&amp;date=2013-02-05", "metacritic": null, "released": "2013-02-05", "tba": false, "updated": "2020-11-23T02:47:02", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac61ddad0d7a4aaf4b45c3a872f187ad_Omfoqc0.jpg", "website": "http://creatub.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CREATUB OOD"], "genres": [], "publishers": ["CREATUB OOD"], "esrb_rating": "Everyone 10+"}