{"id": 284493, "slug": "shadow-dancer-itch", "name": "Shadow Dancer (itch)", "name_original": "Shadow Dancer (itch)", "description": "<p>The Game is a Hack and Slash game with Third person perspective. The game will feature agile movement, smooth combat and fluid carnage. The Player/Protagonist must annihilate all who stand in the path of her vengeance.</p>\n\n<p><strong><em>STORY</em></strong><br/></p>\n<p>Elise was a noble princess of royal blood. She had a doting queen and a powerful father who was the Banner Legion's esteemed General. She was safe, loved and happy that it didn't even matter that she was blind. That is, until she found herself in the dark, the feeling of cold steel pressing against the back of her neck and the damp of her gown soaked in her Mother's blood. Through the white noise that filled her mind she roared her lungs out shaking the very floor till she heard the solitary echo of a steel knife hitting the marble floor and a body following soon after.</p>\n<p> </p>\n<p>\"This one will do just fine...\" a jarring voice bellowed as she felt an alien energy coursing through her body. As she blinked away her tears she could see for the very first time. The first time she saw her glorious Kingdom, she saw it consumed by chaos and flames. The first time she saw her lovely mother, she saw her lifeless body with a slit throat. The first time she saw herself, she saw a fragile, frightened little girl drowning in her own tears. She was still blind, but now she could see the world through the eyes of....this thing looming over her.</p>\n<p> </p>\n<p>\"Stand up, child. I will grant you your vengeance\", she did not know what this entity was but she did not care. She knew what she had to do, a trial of blade and blood. She will embark on this dark and dangerous path to exact her wrath on the ones responsible. She will carve through any and all who stand in her way with such elegance, stealth and grace that she became a living myth, a ghost, the harbinger of death....the Shadow Dancer.</p>", "metacritic": null, "released": "2019-01-12", "tba": false, "updated": "2019-01-14T03:28:27", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a9d7d3fb66c3c76aa5066bc656018ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ashwin K"], "genres": ["Adventure", "Fighting"], "publishers": [], "esrb_rating": null}