{"id": 284563, "slug": "your-time-ends-now", "name": "Your time ends now", "name_original": "Your time ends now", "description": "<p>Take control of a character that ends the time of enemies for its benefit.<br/>Killing an enemies time appropriately is the focus, and that leads you to a final battle against grandfather time to test your skills.</p>\n\n<p><strong>This is a small game, made in a week for bolt jam #4, using Unity with the Bolt Visual Scripting asset.<br/>I focused on getting the gameplay and idea into the project, so regrettably it's lacking in areas like sound (doesn't exist). There's danger when fighting the boss, but no health is there to lose.<br/>But hopefully you enjoy the concept and gameplay that resulted from the theme <em>'Killing Time'</em>.<br/></strong></p>\n<p>I tried to keep the in-game tutorial brief.<br/><em>However in-case it was to brief and you'd like more details:<br/></em><strong><em>WASD:</em></strong> Movement.<strong><em>SPACEBAR:</em></strong> Press this to activate your characters 'long hand'. You use this to kill enemies at their time, however your longhand rotating around the screen must match theirs.<br/>Because you're often facing the enemy, I chose to mirror your screens hand so it's easier to match up with the enemies.<br/>This also swaps the direction your hand is rotating in. You can use this to try and align yourself for an enemies upcoming rotation. However take note that missing an enemy will lose your current charge (described below).<strong><em>SHIFT:</em></strong> Hold this down to activate your 'short hand' and charge an enemy 'shot', launching your closest enemy.<br/>This has 3 levels of charge when you can release, each with a different strength shot.<br/>You can gain a maximum of 2 charges. Sometimes you can use this to launch an enemy, then if it's still the closest adjust it's trajectory midair.<br/>Use A/D to rotate your target direction, and W/S to rotate your target height.</p><p>------------------------------<br/></p>\n<p>A purpose of this game jam was to build a game purely with Bolt as the visual scripting mechanism, no actual code. This inspired me to take another shot with another visual scripting tool, as it's really nice to be able to make games in a 3D space, especially small projects like this that just wouldn't work in 2D.<br/><strong>To summarize the end result:</strong><br/>I still hate Unity.<br/>I LOVE Bolt! And to think a version 2 is being worked on, I'm already in love with version 1.<br/><br/>As part of this gamejam is to show you've worked on your project with Bolt, below are 2 recordings while I was working on the project. I don't have enough time to record anything more now, a.k.a. minutes from submission time as always D:<br/>However I'll try to record a full game through of this in Unity aftewards and add that further below.<br/></p><br/><br/>", "metacritic": null, "released": "2019-01-12", "tba": false, "updated": "2019-01-14T03:38:02", "background_image": "https://media.rawg.io/media/screenshots/97c/97c42732fdc8661984ae81ab6272f11c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Swift Illusion"], "genres": ["Action", "Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}