{"id": 28458, "slug": "alien-hominid-hd", "name": "Alien Hominid HD", "name_original": "Alien Hominid HD", "description": "Alien Hominid HD, the award-winning 2D side-scroller from The Behemoth, is now available for Steam! With hand-drawn graphics, excitingly fast gameplay, and the humor that started it all, loading up this title is like traveling decades back in time, with improved visuals and the same hardcore gaming experience.<br/><br/>Navigate your surroundings by jumping, dodging attacks, grabbing agents, and digging underground! Use your trusted blaster to shoot at anything in your path and hurl grenades towards your enemies for epic explosions! Catch agents off guard with your knife in close-up combat, or chomp their heads off if that’s more your style. <br/><br/>Whether you’re playing solo or 2-player local co-op, Alien Hominid HD is back with the three classic difficulty options:<br/><br/><ul><li>Easy - 7 lives and continues, with two shields from weapon pickups<br/></li><li>Normal - 5 lives and continues, with one shield from weapon pickups<br/></li><li>INSANE - 3 lives and continues, one hit kills</li></ul><br/>Tired of chomping heads? All of the original mini games are here for any aliens wanting a quick break, including:<br/><br/><ul><li>201 levels of PDA Games<br/></li><li>Super Soviet Missile Mastar<br/></li><li>All You Can Eat<br/></li><li>Neutron Ball<br/></li><li>Pinata Fiesta<br/></li><li>Challenge Mode</li></ul><br/>And that’s not all – the game is complete with Steam achievements, in addition to weekly and monthly leaderboards for all three difficulties! Come back to the game that started it all for The Behemoth while crossing your fingers and hoping you remember those pesky boss patterns…", "metacritic": null, "released": "2010-06-23", "tba": false, "updated": "2023-11-03T19:24:56", "background_image": "https://media.rawg.io/media/screenshots/fa2/fa288ed3b6eb6e40df71c9094519978c.jpg", "website": "https://www.alienhominid.com", "rating": 3.27, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 321, "beaten": 22, "toplay": 4, "dropped": 21, "playing": 3}, "playtime": 1, "achievements_count": 24, "ratings_count": 62, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 62, "platforms": ["PC", "Xbox 360"], "developers": ["The Behemoth"], "genres": ["Action", "Indie", "Platformer"], "publishers": ["Microsoft Studios", "The Behemoth"], "esrb_rating": "Teen"}