{"id": 284579, "slug": "bittersweet-thinking-of-cremation", "name": "Bittersweet (Thinking of Cremation?)", "name_original": "Bittersweet (Thinking of Cremation?)", "description": "<p>Welcome to the game \"Bittersweet\".</p>\n<p>This is my sixth game and it's less funny than the last one. Like, if the last game was \"All You Need Is Love\", this game is \"Yer Blues\".\r\n  </p>\n<p>But I digress, this time it's about a young woman named Teagan whom the player is tasked with guiding through a series of strange thought experiments. There's a story and you solve puzzles and maybe it'll even provoke you to think some thoughts you find interesting.\r\n</p>\n\n<p>THE BASICS FOR PEOPLE WHO HATE PARAGRAPHS<br/>____________________________________________</p>\n<p>1. Save often, save plenty.<br/>2. Left mouse = use, Right mouse = Examine<br/>3. You can examine inventory items and combine them.<br/>4. The first NPC you meet will give semi-explicit hints if you ask em'. (This is stated in the game, but you know...)<br/>5. Seriously, if you see something and think that maybe you should save (and I can't stress this enough) you should save.</p>\n<p>Alright, you can go do the thing now.</p>\n\n<p>THE BASICS FOR PEOPLE WHO DON'T MIND READING PARAGRAPHS<br/>__________________________________________________________</p>\n<p>Welcome to the game \"Bittersweet\".</p>\n<p>It is my sixth full title.<br/>Inside this folder is everything you'll need to play the adventure game and help with the game design process. <br/>To launch the actual game simply open the appropriate folder and run the .exe or application file 'Bittersweet'.</p>\n<p>[CONTROLS]<br/>The game is played entirely with the mouse. Left click operates, uses, picks things up, and walks, while right click examines things.<br/>At the top of the screen in game is an inventory menu, as well as a menu with saving, loading, and a volume slider. <br/>All dialogue is passed with a mouse click or any key pressed.<br/>You can examine items, and combine them.</p>\n<p>[GRAPHICS]<br/>Due to variations among computers there are a multitude of potential graphical errors.<br/>If when you launch the game it is very small in either windowed or fullscreen, or if the pixels seem blurred or poor quality, try launching the setup application (the other program with a blue cup icon). Here you can try changing the windowed to fullscreen and the filtering. <br/>The best filtering setting is 'Max nearest-neighbour filter' for all resolutions.</p>\n<p>[FEEDBACK]<br/>If you're feeling like a constructive human being, inside is a .doc file which can be emailed back to me for feedback. </p>\n<p>Cheers,<br/>Fransis </p>", "metacritic": null, "released": "2019-01-11", "tba": false, "updated": "2019-08-28T23:18:31", "background_image": "https://media.rawg.io/media/screenshots/8e9/8e9b1be735d3ebad0a5ce5813d572d3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thinking of Cremation?"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}