{"id": 284532, "slug": "delve-itch-asperity-games", "name": "Delve (itch) (Asperity Games)", "name_original": "Delve (itch) (Asperity Games)", "description": "<p><strong>Delve</strong> is a game about adventuring ever deeper into an endless dungeon, fighting progressively stronger monsters, collecting progressively better gear, and earning lots and lots of gold. There are 115 quattuorvigintillion possible map layouts (that's 1077),  so  you'll always have new rooms to explore, monsters to fight, and loot to earn!</p>\r\nAlpha Release\r\n<p>During the early alpha, the game will be free to download and play. After the Alpha stage of the game is completed, the final alpha release will become a free demo, and the game will enter a paid beta to full release. I'm shooting for an asking price of $10 post-alpha, and plan on continuing to update and improve the game to make it a game people want to play.</p>\r\nDevelopment Progress?\r\n<p>If you're interested in the project's development status and what I'm currently working on, I spam all my development info on my website here. There I regularly post about what I've been working on, and it also serves as an archive of my work progress.</p>\r\nImportant!\r\n<p>The game is in extremely early alpha, probably with a few bugs. It's gonna take time work out the bugs.<br/><br/>The game is basically only playable in 1080p right now, as the UI is not fully finished, and I do all my testing at 1080p<br/><br/>Feel free to leave comments about the game below!</p>\r\nSystem Requirements\r\n<p>Windows Vista/7/8/10 and .NET Framework<br/>Keyboard and Mouse<br/>4GB RAM<br/>nVidia GTX 650 Equivalent or better.<br/>1920x1080 resolution support<br/> (more resolutions will be added later)</p>", "metacritic": null, "released": "2019-01-12", "tba": false, "updated": "2019-08-28T23:18:31", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba6a290d9c89bb5ac31e887a5f3ff563.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Asperity Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}