{"id": 284671, "slug": "the-wild-age", "name": "The Wild Age", "name_original": "The Wild Age", "description": "In the game, take on the role of the new ruler, who has the task of creating a new, fully independent settlement on several islands.<br/>It is necessary to hire villagers and fulfill the main task for each island. But it will not be easy, because every night the enemy goblins attack to your settlement, trying to prevent your efforts.<br/>As a ruler, you can only give orders using a single raw material in the game (coins). And yours villagers carry out the tasks and their roles according to your decision.<br/>Meeting the goal is not always easy and you have plenty of options to develop your strategy.<br/>Completing main tasks in the main campaign will open for you a special rewards for easier passage through the game.YOUR CHARACTER<ul><li>There are <strong>several avatars and mounts</strong> available.<br/></li><li>Each avatar and mount has <strong>different attributes</strong> that change the approach to the <strong>resulting strategy</strong>.<br/></li><li>Several kinds of <strong>pets</strong> that follow and help you.<br/></li><li>Possibility to <strong>adjust</strong> the look of <strong>coins</strong>, the coin <strong>bag</strong> and the <strong>coat of arms</strong> of the settlement.<br/></li><li>To <strong>unlock</strong> some options, it is necessary to perform the <strong>main tasks</strong> in the campaign.<br/></li><li>Whenever it is <strong>possible to change the avatar</strong> settings and <strong>continue</strong> with this settings <strong>in the already played game</strong>.</li></ul>YOUR HELPERS<ul><li><strong>Builder</strong> - He's builds and improves buildings.<br/></li><li><strong>Forester</strong> - He's cutting a tree and clearing wooded locations to further expand the your settlement.<br/></li><li><strong>Farmer</strong> - It ensures a stable supply of coins before the winter comes.<br/></li><li><strong>Archer</strong> - He hunts wild animals during the day and he's primary defender for your settlement at night. It can change its position and adapt to the situation (for example: change its defensive position).<br/></li><li><strong>Knight</strong> (soon - not available now) - He can defends archers and is able to follow the leader during the attack on the goblin base.</li></ul>YOUR DECISION<ul><li>Ability to cancel an action already entered.<br/></li><li>Ability to cancel an already built structure.<br/></li><li>Ability to change your character and mount.<br/></li><li>Possibility to create an island according to your ideas and share with your friends.</li></ul><br/>The Wild Age is inspired by the \"Kingdom\" series of games, and we do not intend to keep this as a secret. At first glance, it may be a mere conversion of the game into 3D, but the opposite is true. <br/>From our point of view, it is as more about the evolution of a very interesting concept which deserve further development.<br/>We want to offer players the similar gameplay, but enriched with new features which we find interesting and for the whole game beneficial.<br/><br/><strong>Game elements we want to gradually implement into the game:</strong><br/><ul><li>Knight (as NPC)<br/></li><li>The ability to attack enemy camps<br/></li><li>Side quests<br/></li><li>Fine-tune and add more text translations</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:22", "background_image": "https://media.rawg.io/media/screenshots/a6b/a6b312dee01db94eb4818516c3efae25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "beaten": 1, "dropped": 2}, "playtime": 2, "achievements_count": 45, "ratings_count": 3, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["McMagic Productions"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["McMagic Productions"], "esrb_rating": null}