{"id": 284682, "slug": "mist-hunter", "name": "Mist Hunter", "name_original": "Mist Hunter", "description": "Mist Hunter - is a blistering fast, first-person shooter adventure with a fluid movement system and an arsenal of strange magic weapons.<br/><br/>A young reckless Mist Hunter travels across the universe fighting the forces of Immortal Warlock R'axa to keep the magic order in balance.<br/><br/><br/> <br/><br/><br/><br/><br/>After a devastating battle The Immortal Warlock R’axa has finally been defeated.  The survived Mist Hunters have managed to imprison the weakened Warlock in a pocket dimension and stop his deadly crusade.<br/><br/>However, the Warlock’s legacy lives on. Scattered throughout the galaxy, HIS most faithful adepts relentlessly seek ways of bringing their Master back into our world.<br/><br/>Only the Mist Hunters can prevent the returning of R'axa. <br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><ul><li> <strong>Maze Mode</strong>- a rogue-lite mode with the ever-changing layout of the Maze, upgrades and weapons. To have better control over the level generation we design level plans by hand. <br/><br/></li><li> <strong>The Summoning Mode</strong> - an endless arena mode that offers quick, adrenaline-infused runs that will challenge your skill and reflexes. It all spiced up with random upgrades and power-ups. <br/><br/></li><li> Fluid and <strong>responsive movement system</strong> that gives a high degree of traversal freedom from the get go. Double jumps and dashes that can be later upgraded and infused with special traits. <br/><br/></li><li> Over<strong> 100 upgrades</strong> that can drastically change the playstyle <br/><br/></li><li> Powerful <strong>power-ups</strong> that may help you win the hardest of the battles<br/><br/></li><li><strong> 3 arenas</strong> in The Summoning Mode. <br/><br/></li><li> 2 formidable <strong>bosses</strong><br/><br/></li><li> Over <strong>10 types</strong> of enemies<br/><br/></li><li> <strong>Combos system</strong><br/><br/></li><li> <strong>8 unique magic weapons</strong>, each with two distinct fire modes</li></ul><br/>", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2020-12-16T14:46:23", "background_image": "https://media.rawg.io/media/screenshots/29d/29d6f93ebd5f160ac55601ea27d88699.jpg", "website": "http://floxstudios.com/mist-hunter/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 528, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch"], "developers": ["Flox Studios", "Satori4"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Flox Studios"], "esrb_rating": "Teen"}