{"id": 284680, "slug": "red-tractor-tycoon", "name": "Red Tractor Tycoon", "name_original": "Red Tractor Tycoon", "description": "Red Tractor Tycoon – Manage your own Farm!<br/>You sit at the wheel of your trusty tractor in the farming game Red Tractor Tycoon and create a flourishing farm from nothing. You have a vast host of agricultural equipment at your disposal. With the help of ploughs, sowing and harvesting machinery, you’ll turn the barren hex fields into blossoming landscapes. Sounds straightforward, right? But wait until you see the drones, shrinking beams and EMP technology! This tractor game has near endless possibilities!<br/><br/>Red Tractor Tycoon – Plow, Sow, Harvest<br/>Be it wheat, corn, or carrots – you’ll plant all sorts of crops on your hex field map in this crazy tractor game. Of course, there are also plenty of animals to keep and breed. Extensive production chains will allow you to process your resources into tasty products such as pancakes, apple sauce and popcorn. That’ll bring in loads of money too, which you can wisely invest in new products or research. There are no limits to your fantasy in Red Tractor Tycoon. Give your creativity free rein and explore the world how you see fit. Which path you choose and how you go about it is all up to you!<br/><br/><br/><br/>Features:<br/><br/><ul><li>Explore a huge world<br/></li><li>Steer your tractor and attach a wide selection of equipment<br/></li><li>Design your farm property according to your wishes<br/></li><li>Experiment! There are many complex production chains and factories to discover<br/></li><li>Research new products and devices to help you expand your farming empire</li></ul><br/>Red Tractor Tycoon – The Farming Simulation for Pros<br/>Plowing along on your little red tractor you’re in the thick of it and can determine every detail of your farm yourself. The world is your oyster at the start of the game!", "metacritic": null, "released": "2019-02-19", "tba": false, "updated": "2019-08-28T21:49:22", "background_image": "https://media.rawg.io/media/screenshots/809/8095c5dd6094a7b1c56b70741aef7d7d.jpg", "website": "https://company.upjers.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Upjers"], "genres": ["Simulation"], "publishers": ["Upjers"], "esrb_rating": null}