{"id": 284700, "slug": "dysmantle", "name": "DYSMANTLE", "name_original": "DYSMANTLE", "description": "<p>As you ascend from your shelter after the long long years, a brave new old world awaits you. A world inhabited with nasty and vile creatures. A world with no other human soul to be seen. A world with nature in reigns now. A world that&#39;s about to get even worse.<br />\nYou need to find a way to escape the wretched island. But before that, enjoy the bittersweet apocalypse.<br />\nBreak over 99% of all objects for materials with the right tools. No barrier will stop you.<br />\nFight with (or run away) nasty and vile creatures of the post-apocalyptic era.<br />\nExplore the handcrafted open world and uncover its mysteries.<br />\nSurvive. Clear areas of monsters and claim it as yours.<br />\nBuild outposts to establish your presence.<br />\nCraft permanent weapons, tools, outfits, and trinkets.<br />\nHunt dangerous game or tame them for your post-apocalyptic zoo ranch.<br />\nFarm exotic plants and reap the rewards as crop gets ripe.<br />\nSolve puzzles above ground and underground in the Tombs of the Old Ones<br />\nFish cunning scaly things under the watery surface.<br />\nCook delicious recipes for permanent stat and ability upgrades.<br />\nExplore the ruins of the past and discover technology from the hitech era. Gain technological advantage against the hostile environment. Or go deeper and recover the ancient lost knowledge from the hidden tomb chambers of the old ones. Acquire materials with almost magic-like properties and use them to craft insanely powerful gear.<br />\nOver 99% of everything can be broken for materials with the right equipment. Do that, and collect the sweet nectar of the old world: plastics, rubber, and metals. There is a reasonable number of different materials to gather. Find Recipes to craft permanent items and upgrades.<br />\nExplore the vast hand-crafted open world and build Outposts to establish your presence. Claim back the land area by area. Find hidden treasures and solve puzzles long ago forgotten. Find your means of escaping the island.<br />\nThe world after the end is inhabited by nasty creatures. Something vile has affected most of the wildlife and former human inhabitants of the island -- turning them into aggressive beast-like creatures. Slay them and collect their loot - or run away and come back when you&#39;re stronger. Fight using various melee and ranged weapons. Create traps and lure monsters in. Do whatever it takes.<br />\nYou will not be fighting just to maintain the status quo. This IS NOT a game about starving. You won&#39;t be constantly looking for a tasty cockroach to fill your over-metabolic stomach while waiting for the unavoidable bliss that is death. You will never die of hunger. You will get more powerful, and unlock permanent upgrades. The world is a dangerous place, and you may take a few steps back once in a while, but eventually you will thrive.<br />\nEnjoy the bittersweet apocalypse.<br />\nI think this is pretty obvious, but the game is still in development. This means the details will still change and features may get added, changed, or removed. More details will be announced during 2019!<br />\nOur team is not very big, so things take time. We&#39;re also building our own very technology and 3D engine for the game at the same time. We like to make sure we can do all the crazy stuff we want -- while ensuring everything runs smoothly on devices from PCs &amp; next-generation consoles to mobile phones (and maybe toasters in the future).<br />\nPlease wishlist the game to support the development! :)</p>", "metacritic": null, "released": "2020-11-05", "tba": false, "updated": "2024-04-05T13:27:41", "background_image": "https://media.rawg.io/media/screenshots/599/59905f4cc9614a53f36989a26098d13c.jpg", "website": "https://www.dysmantle.com", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 299, "beaten": 24, "toplay": 37, "dropped": 25, "playing": 10}, "playtime": 7, "achievements_count": 109, "ratings_count": 52, "suggestions_count": 575, "game_series_count": 0, "reviews_count": 53, "platforms": ["iOS", "Xbox One", "Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["10tons"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["10tons"], "esrb_rating": "Teen"}