{"id": 284769, "slug": "yag", "name": "Yag", "name_original": "Yag", "description": "Yag is a shared Role Playing Game virtual table intended to be played online with friends.Everything you need to know:Complete info about Yag can be found on its website.<br/><br/>You'll find there:<br/><ul><li> The detailed list of features (\"Features\" tab)<br/></li><li> Links to Youtube tutorial videos in english and french (\"Tutorials\" tab)<br/></li><li> Links to all available videos, tutorials and news (\"Videos\" tab)<br/></li><li> The full YAG-LUA API documentation (\"Lua api\" tab)</li></ul>What you can do with Yag:<ul><li> Create a server / connect to a friend's server (up to 8 simultaneous players)<br/></li><li> Setup an infinity of parametrized procedural dungeons and their environement with different visual themes<br/></li><li> Choose your characters/creatures among hundreds of 3D animated miniatures.<br/></li><li> Equip your 3D characters with hundreds of weapons/spells/objects and have them ride any 3D creature.<br/></li><li> Share pictures from the internet: use any picture available through a public url as a map or a pawn.<br/></li><li> Have 3D dice rolling and get their results displayed in a journal (results can be public or private)<br/></li><li> Manage Character Sheets with automated dice rolls<br/></li><li> Manage action rounds with initiative<br/></li><li> Use embedded LUA scripting to:<br/>- Fully automate character sheets<br/>- Fully customize the dice language<br/>- Modify pawns properties (initiative, health points, ...)<br/>- Create rulesets<br/>- Generally do what you want with a scripting language <br/></li><li> Change day/night time and have the sun move at any chosen speed for real time scenes<br/></li><li> Hide your pawns from other players (e.g: invisibility spell) or from all players if you are the Dungeon Master<br/></li><li> Use 3rd or 1st person view to see through the eyes of any character/creature.<br/></li><li> Prepare and save your scenes (dungeons, pawns, character sheets, options)<br/></li><li> Import/Export your Character Sheets in text format to prepare/edit/save them in any 3rd party program.<br/></li><li> If your video card is Ansel compatible, use Yag as a map generator by creating high res pictures of dungeons and printing them for your real table.<br/></li><li> Make beautiful screenshots using in game mechanism (any custom res), Steam, or Ansel (if you have an Ansel compatible video card)</li></ul><br/>Yag is system agnostic: it does not rely on any game rule and can be used to play any game with any rules as long as it requires a gameboard, pawns, and dice.<br/><br/>Yag offer a lot of possibilities and hence is fairly complexe to fully use, but it can be used progressively:<br/><ul><li> first only as a shared visual setup (dungeons and pawns): Yag is designed so that setting up a complexe scene should only take seconds.<br/></li><li> then you can use ingame dice with the journal<br/></li><li> then you can learn to use the ingame character sheets that will let you manage characters and automate dice rolls<br/></li><li> then you can use initiative, manage rounds, and use the more complexe options Yag has to offer<br/></li><li> finally you can learn to use the API with the LUA language and do whatever you want</li></ul><br/>Yag is entirely silent: you'll have to use a 3rd party audio server (Teamspeak, Steam, Discord...) to talk with your friends.<br/><br/>Yag is not a single player game, there is no AI, no goal set ingame, no villain to fight, nothing to win, it is merely an online shared gaming table.", "metacritic": null, "released": "2019-02-05", "tba": false, "updated": "2019-08-23T12:11:14", "background_image": "https://media.rawg.io/media/screenshots/8c0/8c07a13db401d95f3ff13a2cde5ed0b2.jpg", "website": "http://yagame.fr/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bonjourcoco"], "genres": ["RPG", "Indie"], "publishers": ["Bonjourcoco"], "esrb_rating": null}