{"id": 284742, "slug": "gao-kao-gong-han-mo-ni-crazy-school-simulator", "name": "高考工厂模拟(Crazy School Simulator)", "name_original": "高考工厂模拟(Crazy School Simulator)", "description": "\"When I came, there was only a bunch of offbeat students smoking, fighting and skipping classes; and when I am to leave, it's the best school in the province with the highest enrollment rate.\" <br/><br/><br/><strong>Conducting teaching work </strong><br/>As a Principal, your most important work is to arrange the teaching tasks reasonably; and the cornerstone of teaching is to teach students in accordance with their aptitude. A good principal will determine the teaching method based on each student's personality and talent. <br/><br/>Whether students are to study in arts or science classes, to be assigned to key classes or regular classes, or to concentrate underachievers in the ignorable class, or to make no social distinctions in teaching, will be decided by the player himself. <br/><br/><br/><strong>Maintenance of school discipline </strong><br/>Maintaining discipline is an important means of ensuring the enrollment rate of a school. Every student has his or her own behavior pattern. They will sleep, read comics, listen to music in classes, keep monstrous hairstyles, smoke in the toilet, go over the wall to various entertainment venues, and even gang up to go to the Internet cafe to play computer games. <br/><br/>To improve students' scores, you must use a variety of measures to prevent violations from spreading among students. For this reason, you can choose to punish the students who violated the school rules by penalties including standing before the class, running laps, writing self-criticism, even demerit recording and expulsion. <br/><br/><br/><strong>Special means to maintain financial balance </strong><br/>To ensure the enrollment rate, quality teachers must be guaranteed. But training excellent teachers requires a good deal of money. As a first-class Principal, you must increase income and reduce expenditure through various means. If necessary, some special means can also be adopted. For example, by collecting school-choosing fees and increasing the prices of canteen dishes, a large amount of funds can be obtained in a short time. However, these methods often come with negative effects and should be used with caution.<br/><br/><br/><strong>Coping with inspection from leaders </strong><br/>Being a principal in China not only requires you to complete your own teaching tasks, but also to learn to deal with all kinds of inspection by superiors, who will assign you some special documents, such as: reducing the burden of students, conducting quality education, and offering nutritious meals for students. If the leaders are not satisfied, you will face serious consequences.", "metacritic": null, "released": "2019-01-29", "tba": false, "updated": "2019-08-28T21:49:17", "background_image": "https://media.rawg.io/media/screenshots/8a4/8a4d2f8da101d0d3d1af5c8bbba2a375.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Altay Workshop"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Altay Workshop"], "esrb_rating": null}