{"id": 284710, "slug": "mei-mao-bing-zhi-zuo-ren-psychosoft-ltd", "name": "没猫病制作人 / Psychosoft Ltd.", "name_original": "没猫病制作人 / Psychosoft Ltd.", "description": "People who have heard of cat disease say they don't have cat disease. Do you have cat disease?<br/>\n<br/>\n<br/>\n<br/>\r\nThis is a cat disease people see will find resonance, no cat disease people see the game will have cat disease, myrrh is our purpose. In a relaxed and pleasant atmosphere, as dean, you will open the door to a new world, facing all kinds of cat patients, with an extraordinary way to tide over difficulties again and again. Encounter hope and find pleasure in a simple and desperate life. Here, you not only need to run a good company, but also act as your psychiatrist, sympathize with them and fight for wisdom and courage. If you find life monotonous? Come to Dog Psychiatric Hospital, let's get seriously ill together.<br/>\n<br/>\n<br/>\n<br/>\r\nWarm Tip: The game is full of time, please don't watch when you drink water.<br/>\r\nOperational tips: long press left mouse button can fast forward<br/>\n<br/>\r\nThe dog had a nightmare. In the dream, the second uncle who is the cat demon gave you an inexplicable test paper, and the test results tell you that you are an excellent neurosis! When your second father-in-law monk is confused, a loud palm falls from the sky, slowly waking up, you are inexplicably thrown a face of adult foot washing water. He was told that he was in a dog psychiatric hospital, the company his second uncle had asked you to do, and that he had somehow incurred a huge debt of $4 million in rent.<br/>\n<br/>\n<br/>\n<br/>\r\nAt first, to survive, you tricked people in the psychiatric hospital into making games and competing. But when you hand over the hard earned money to the landlady, you will know what despair and despair are.<br/>\n<br/>\r\nFrom then on, everything towards money has become your goal in life, you will play your trick to the extreme, as a producer without cat disease, crush everything with IQ and EQ, change the edge of all kinds of cat disease, until you come into contact with the dream of the National Competition again..", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:19", "background_image": "https://media.rawg.io/media/screenshots/126/12664afc3d72a6754274ebcc1fb95d58.jpg", "website": "http://www.66rpg.com/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["橙光游戏"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["橙光游戏"], "esrb_rating": null}