{"id": 284807, "slug": "huuuge-stars", "name": "Huuuge Stars", "name_original": "Huuuge Stars", "description": "Putting the social in social casino! <br/><br/>It’s time to meet new friends in Huuuge Stars, a revolutionary new game which puts the social in social casino! With revolutionary new features and 25+ unique, amazing Slots, the game will guarantee you’ll be feeling like a real Star in no time!<br/><br/>Meet new Friends<br/><br/><br/>Ever wondered if any other slot maniacs live in your town? Would you like to make the social casino just a tiny bit more social? Activate location services to meet friends from your area and spin together!<br/><br/>Personalize Your Experience<br/><br/>Tired of generic avatars in social casino games? We have a solution! You can now upload your own avatar and make your virtual casinogoer truly your own!<br/><br/>Play thrilling Slots<br/><br/>Huuuge Stars offers you a collection of 25+ completely unique, beautiful Slots that will have you spinning away for days! Whether you’re a fan of classic Slots or modern beauties, you’ll surely find something for yourself!<br/><br/>► Hit the Grand Jackpot in Fu Fu Fu Fortunes and Jackpots!<br/>► Spin the Wheel of Wins!<br/>► Get some tasty Free Spins in Big Win Burgers!<br/>► Win some bling in Huuuge Jewels!<br/>► Get 777 wins in Speedy Spins!<br/><br/>On top of that, be sure to play HUUUGE LINK – a set of four Slots that share a truly HUUUGE Grand Jackpot to see how easy it is to win massive Jackpots in no time! Prepare to be amazed by the wonders of Ancient Egypt and China in this amazing Slot adventure.<br/><br/><br/><br/>Get awesome bonuses<br/><br/>Spinning isn’t the only way to get Coins in Huuuge Stars! Grab some freebies and play the Lottery to get them!<br/><br/>► Collect Free Coins every 15 minutes in the Lobby!<br/>► A Free Bonus will appear in the Shop every 8 hours!<br/>► Play the Lottery to win up to 5 MILLION COINS!<br/>► Get extra Coins and Bucks every time you level up!<br/><br/><br/><br/>Read our Terms of Use (www.huuugegames.com/terms-of-use), Privacy Policy (www.huuugegames.com/privacy-policy) and other important information.<br/><br/>Our games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.<br/><br/>► The game is intended for a mature audience.<br/>► The game does not offer real money gambling or an opportunity to win real money or real prizes.<br/>► Wins made while gambling in social casino games can't be exchanged into real money or real rewards.<br/>► Past success at social casino gambling has no relationship to future success in real money gambling.", "metacritic": null, "released": "2019-01-03", "tba": false, "updated": "2019-10-22T14:05:48", "background_image": "https://media.rawg.io/media/screenshots/561/561e33679dea2e41960bfe9c0c6093d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huuuge Global"], "genres": ["Card"], "publishers": ["Huuuge Global"], "esrb_rating": null}