{"id": 284979, "slug": "milk-delivery-tanker-drive", "name": "Milk Delivery Tanker Drive", "name_original": "Milk Delivery Tanker Drive", "description": "Milk Delivery Tanker Drive is like pizza delivery games. If You are crazy about such kind of games; this is actually what you need. Who doesn’t need fresh and pure milk daily from the farm to their door step? Everyone I guess! This milk supply truck is here to fulfill your needs, having fresh milk straight from the dairy farm is possible in this Milk Delivery Tanker Drive game.<br/><br/>In this Milk Delivery Tanker Drive game, fresh milk is bought from dairy farms on specific farm trucks to the big city, here now it’s your job to manage all the transportation of milk carefully from cargo truck to bottles, also collect them all in one delivery van to deliver them with a perfect truck driver, in this Milk Delivery Tanker Drive game.<br/><br/>You are the in charge of this transportation delivery duty, take your milk supply truck on roads and delivery all the milk on time at right place crossing busy roads. You will also be provided with many kind of transporter truck like cargo truck, tanker truck and many more to transport the fresh dairy milk bottles to the customer’s door step.<br/><br/>Features of Milk Delivery Transport Truck: <br/>Drive your truck fastly as you have limited time to complete your job.<br/>When you are done with transporter truck delivery, speedup your vehicle to stores and milk shops.<br/>Find milk parking area and park Your tanker truck appropriately.<br/>This Milk Delivery Tanker Drive game Is one of the fun entertaining game.<br/>Amazing 3D graphics<br/>Extremely powerful gears for acceleration<br/><br/><br/>Enjoy Milk Delivery Tanker Drive game and let us know about your valuable feedback and suggestions so that we can improve it for our loving fans.", "metacritic": null, "released": "2017-12-24", "tba": false, "updated": "2019-10-22T14:40:09", "background_image": "https://media.rawg.io/media/screenshots/a24/a244ec832f9206b7417b2a031cadbbee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nouman khan"], "genres": ["Adventure", "Simulation"], "publishers": ["Nouman khan"], "esrb_rating": null}