{"id": 285041, "slug": "zombies-fury-2", "name": "Zombie's Fury 2", "name_original": "Zombie's Fury 2", "description": "Fight for your life wiping out as many zombies as you can, with a katana as your only weapon, in a world hit by devastation. <br/><br/>How to play: <br/>Tap on either the right or left side of the screen to strike a blow in that direction and try to dodge the zombies when they strike at you. If a zombie hits you, tap the screen several times to get rid of it. The less lives you have left, the faster you will have to tap the screen. Be careful, it will get more and more difficult to escape from their clutches! <br/>When the character is not attacking, its level of life will progressively increase. <br/><br/>Features: <br/>• HD graphics <br/>• Two characters to choose from <br/>• Gamecenter <br/>• It's FREE! <br/><br/>Story: <br/>In 2012, humanity managed to achieve the long sought-after dream of eternal youth thanks to “Eternum”, a compound created by NextGenetics as a result of their important advances in genetic engineering. \"Eternum\" could make the cells of the human body regenerate without a single imperfection, stopping the tissues in the body from aging and enabling people to live practically forever. A regular dose of \"Eternum\" prevented the body from getting old. The prohibitive price with which the product was launched into the market only served to increase the differences between social classes, since only the most powerful families could afford to buy it.   <br/> <br/>This turn of events lit the fuse of collective madness; furious crowds spilled out onto the streets, fed up of governments and a capitalist system that was asphyxiating them, fed up of being treated like slaves by the powerful families that controlled all the money and power of the world. They demanded that a discovery such as this should be within the reach of all citizens; everyone deserved to be blessed in the same way. <br/> <br/>With the help of Last Dawn sect, Norman Dickinson, the latest Nobel prize for genetic engineering, created a compound capable of altering the genetic structure of \"Eternum\", converting the elixir of eternal youth into a mortal poison that inverted the process of regeneration, causing the body of anyone who took it to quickly rot.   <br/> <br/>At the end of 2012, Last Dawn managed to break into the premises of NextGenetics and sabotage the production of \"Eternum\" by mixing it with Norman Dickinson’s compound, creating the poison known as \"Mortalis\". The new compound had been ingested by hundreds of people before the terrifying truth was discovered. What was happening caused a great reaction among the powerful families, who were enraged by this act of rebellion that was being displayed by who they considered to be “their herd of animals”.   <br/> <br/>Motivated by the sweet taste of revenge, they hired a group of geneticists to collect samples of \"Mortalis\", synthesize it, and create a powerful bacterium that could be transmitted by blood. The plan was to slowly decimate the huge army of indignant citizens, demonstrating once and for all, who the absolute sovereigns were. <br/> <br/>The bacterium produced by the synthesis spread without control, wiping out a large part of humanity in just a week. <br/> <br/>Extremely upset by their error of calculation, the great families regretted causing the catastrophe, as such a small society would not be enough to satisfy their voracious hunger for power… but this was not the only error of calculation they had made. Just over a month later, unexpected secondary effects appeared: the dead began to rise from their graves converted into zombies who were hungry for fresh meat, causing frenzy among the few survivors, whose only hope is to eliminate all the infected people and rebuild a new world.", "metacritic": null, "released": "2011-11-07", "tba": false, "updated": "2019-10-22T14:40:10", "background_image": "https://media.rawg.io/media/screenshots/971/97156eb653b0787a03ff187677762b66_fiL6XA7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NO2 Web and Mobile Applications"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["NO2 Web and Mobile Applications"], "esrb_rating": "Mature"}