{"id": 285021, "slug": "living-death-hunter", "name": "Living Death Hunter", "name_original": "Living Death Hunter", "description": "Living Dead Hunter<br/><br/>Free to Play &amp; Download on GOOGLE play store.<br/><br/>Some mad scientist research on human dead body. They try to give life to human dead body. After 10 to 20 Years they were success in their project but they were aware about virus infection. They have no idea about what a huge problem create for whole world.<br/><br/>Living dead Body gone mad and attack on city. Now 70 to 80% of people are infected with that danger virus and be wild zombies. They are very Hungry dead body and looking for blood. Most of army person also infected all world is in danger now.<br/><br/>We lot's every thing now it's time of Revenge, its time of Do or Die, it's time of war against Zombies. <br/><br/>American Govt. need person who is gunner export, Sniper shooter,one man army person,fighter,hunting export,hunter,brave. If you have one of quality than Country need you. Country are ready for huge zombie hunter contracts.<br/><br/>Shoot zombies with Sniper,Pistol,Rocket launcher,machine gun,shot gun,AK-47. You have to be very careful because infected monster zombies are very wild. Be a Road killer hunt all zombies from Road area of Highway. <br/><br/>This is Multilevel Survivor &amp; Shooting Game. You have fight with city deadly zombies. You have to clean the infected area. Be a Killer &amp; kill all zombies and complete all zombie killer contract.<br/><br/>Be Ready to pull the trigger. Upgrade your shooting skills as a living dead killer. Enhance your arsenal of weapons, such as shotguns and rifles and use your skills to kill as many of your enemies.<br/><br/>Lot's of action in Zombie Boss Mission. <br/>Come and Fill the thrill of horror Experience a truly immersive 3D environment &amp; excellent graphics in this action game. <br/><br/>Are you ready to Fight with Infected army of Zombies ?", "metacritic": null, "released": "2016-10-16", "tba": false, "updated": "2019-10-22T14:22:52", "background_image": "https://media.rawg.io/media/screenshots/016/01653ab049a3c4e1c9f5299f9dbaac58.jpg", "website": "https://www.facebook.com/pages/Nikhil-Products-Fun-CLub/1533470653591056", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikhil Solanki"], "genres": ["Action"], "publishers": ["Nikhil Solanki"], "esrb_rating": null}