{"id": 285019, "slug": "car-roof-jumping-parking-stunt-full", "name": "Car Roof Jumping & Parking Stunt Full", "name_original": "Car Roof Jumping & Parking Stunt Full", "description": "Welcome to the wild tournament of sports car! Today you’re not going to race with each other – you’re going to level up your parking skills with Car Roof Jumping &amp; Parking Stunt!<br/>Start the engine of your super car and begin this trial! This city is your stunt track, so enjoy hurling and whirling! Reach an unbelievable speed and then try to park accurately! Your mission is to drive up the treacherous rooftops and park as exquisite as possible!<br/>Choose your parking challenge and find yourself at the roof of the neighboring store or at the most dangerous house right under the sky! Earn points to buy power-ups and upgrades for your sports car or even buy a new vehicle such as truck or jeep! Do your best and complete all the tasks in Car Roof Jumping &amp; Parking Stunt game!<br/>Be ready for different missions, perform outrageous stunts and have fun leveling up your parking skills in this unusual game!<br/>Car Roof Jumping &amp; Parking Stunt features:<br/>•\tUltimate city parking simulator<br/>•\tAmazing car tricks and stunts for much fun<br/>•\tMany different cars to ride<br/>•\tIntuitive controls<br/>•\tRealistic 2D graphics<br/>Feel the heat of parking mania with Car Roof Jumping &amp; Parking Stunt! Drive your sports car through the city streets, perform mad tricks and have fun!", "metacritic": null, "released": "2017-01-12", "tba": false, "updated": "2019-10-22T14:22:44", "background_image": "https://media.rawg.io/media/screenshots/cb9/cb98185d65d11f1f3cff4fa16954aa0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Racing"], "publishers": ["Tayga Games OOO"], "esrb_rating": null}