{"id": 285022, "slug": "flying-truck-junkyard-parking", "name": "Flying Truck Junkyard Parking", "name_original": "Flying Truck Junkyard Parking", "description": "Free 3D Flying Truck junkyard Game 2017<br/><br/>Welcome to the Junk Yard! Want to flay a junkyard truck?? Yes flying and driving junkyard truck game, Feeling Exited???<br/><br/>Take control of four vastly different trucks, with unique handling and demands of your driving and flying skills. There is different type of vehicles available like Bulldozer, Forklift, Mini truck, Crain, junkyard truck, etc...Here is not a construction truck not excavator games, or not a dumping truck driver parking. Free 3D Junkyard Truck Driving and flying simulation game for the real skilled drivers out there. Start driving this amazingly realistic 3D truck without the need of a truck driver’s license. This is a simple 3d physics truck game that combines aspects like Driving, parking and Flying junkyard Truck experience.<br/><br/>Start Driving with truck and command your driving skills, in this game there are 5 modes which is very interesting, you are gonna love this different modes with different trucks<br/><br/>There are different modes for flying junkyard flying truck<br/><br/>1.\tNormal mode<br/>2.\tFuel mode<br/>3.\tTimer mode<br/>4.\tInvisible mode <br/>5.\tdeluxe mode<br/><br/>In each Mode there are 10 levels you have to complete all levels. In time mode you have to complete level in given time. in fuel mode you have to complete your level with given fuel tank, in normal mode there is no restriction but if truck touch scrap yard 3 time than game is going to crashed and in deluxe mode there is Crain and you have to lift the car and drive the Crain.<br/><br/>Collect different check points and reach to the destination and if your truck will touch any scrap yard 3 times then your game is crashed. You can fly your truck with the help of flying mode button on screen.<br/><br/>Featuring stunning graphics and exciting Flying missions, try the most original flying game EVER!<br/><br/>The 3D junkyard truck will be easy to control because of the steering wheel and the pedals on the screen and also view camera option.<br/>We challenge you to complete the 50 different levels of this free junkyard flying truck. if you can do this you can proudly call yourself a real Truck Driver and Flying man!<br/><br/>We hope you will enjoy this amazing real flying junkyard truck driving game and give us some love by downloading this game. So start to download and give us rate.<br/><br/>Key features:<br/><br/>• Truck driving physics are amazingly realistic<br/>• Easy to control truck, this makes it fun to play for all ages people<br/>• Many different levels of driving and real flying, so you will learn everything about driving and flying one of these big 3D trucks <br/>• Amazing 3D game and 3D city road to drive in with your different truck.<br/>• Fun to play free 3D junkyard flying Truck game<br/>• No WiFi? No Problem to run game.<br/>• Offline game Play.", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2019-10-22T14:22:55", "background_image": "https://media.rawg.io/media/screenshots/996/996fb038426f291b51c776e766cabbfb.jpg", "website": "https://www.facebook.com/pages/Nikhil-Products-Fun-CLub/1533470653591056", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikhil Solanki"], "genres": ["Racing", "Family"], "publishers": ["Nikhil Solanki"], "esrb_rating": null}