{"id": 285085, "slug": "cinderella-an-interactive-fairytale", "name": "Cinderella - An Interactive Fairytale", "name_original": "Cinderella - An Interactive Fairytale", "description": "<p>\n      Explore the magical world she lives in, feed pigeons, bond with the \n      castle's watchdog (a noble Pomeranian) and save the prince in this \n      little adventure for fairytale enthusiasts of all ages! Enjoy a \n      relatable and diverse mix of characters who prove that being beautiful \n      is not about fulfilling common, unattainable ideals of beauty. In \n      addition to the interactive story and its puzzles, some mini-games are \n      also included and seamlessly incorporated into the narration.\n    </p><p>\n</p><p>\n      Tired of being hassled by ads and in-game-purchase offers? So are we, \n      which is why you will find neither in this game. Another thing you won't \n      find in this game are external links and violence. All of this makes the \n      game also suitable for children of a young age, especially since the \n      professional voice actors Sky du Mont, Lisa Pitt and Geoffrey Steinherz \n      lend their amazing voices to the narrator and the characters, so the \n      story can be enjoyed even without being able to read.\n    </p><p>\n</p><p>\n      Jump right in and enjoy this charming, hand-drawn interactive fairytale!\n    </p><p>\n</p><p>\n      *** Nominated for the German children's software award TOMMI 2018 ***\n    </p><p>\n</p><p>\n      In a nutshell:\n    </p><p>\n      * Interactive, self-written story based on Perrault's Cinderella\n    </p><p>\n      * Hand-drawn illustrations and animations\n    </p><p>\n      * Custom composed music\n    </p><p>\n      * Made with love, tailored to kids\n    </p><p>\n      * Professional voice acting in English and German\n    </p><p>\n      * No ads, no in-game purchase options\n    </p>", "metacritic": null, "released": "2019-01-18", "tba": false, "updated": "2019-01-18T03:41:02", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": ["Golden Orb"], "genres": [], "publishers": ["Golden Orb"], "esrb_rating": null}