{"id": 285178, "slug": "elven-haven", "name": "Elven Haven", "name_original": "Elven Haven", "description": "<p>The Galdoren Forest has always been a safe haven for the elves who have turned down the offer to live among mortals and meddle in their affairs. Those who have agreed to stay within the forest now live in small communities usually made up of a few dozen rather big families. All the elven clans in Galdoren answer to the Arch King Rothan the Enlightened, protector of the Ever Tree in the very centre of the forest, making it the most sacred of all the sacred places in Galdoren, so as a result it is also the place where to largest and most meaningful members of the great elven houses reside. The forest itself covers the area of tens of thousands of kilometres, but no mortal has ever been able to accurately measure its size as everyone knows that walking among the trees of Galdoren is like striding through a never ending maze only to eventually die from starvation or to be eaten by some wild beast. Assuming you don’t encounter the children of the forest first of course as the elves of the Galdoren Forest rarely take hostages. The forest has always been acting as shield against the ruinous ambitions of the mortal kind, their greed and the devastation they leave behind, however not all of the forest is safe, as the green thicket is also a perfect home for other creatures wanting to stay away from the watchful eye of the manlings, foul beastmen and the greenskin raiding parties often like to roam the woods and launch their attacks on mortals from within it. Making sure outsiders don’t come too close to the elvish settlements is the task of the Vathanrian Guard, the protectors of the woods who use their martial prowess to slay all those who pose threat to the wellbeing of their people.</p>\n<p>Shev is known among her folk as a frequent trouble maker. This doesn’t however, prevent her from being a well respected member of the Vathanrian Guard and one of the most talented marksmen of her clan. During one of her routine patrols far from the village Shev encounters a dying elf, member of her own clan, the protagonist learns that he has been captured and then tortured by a band of marauding greenskin who forced him to reveal the location of Shev’s village. The race against the time and the race against the tide, the tide of foul greenskins...</p>\n<p>You play as Shev, use WASD to move and HOLD down the left mouse button in order to shoot.</p>\n<p>==&gt;You will be able to experience three different playstyles using three different weapon choices, try them out and choose the one that suits you best!</p>\n<p>==&gt;Kill enemies to increase your score and place yourself on the top of the scoreboard!</p>\n<p>==&gt;Act and move quick, different types of enemies are waiting around every corner both ranged and melee.<br/></p>", "metacritic": null, "released": "2019-01-17", "tba": false, "updated": "2019-08-28T23:18:30", "background_image": "https://media.rawg.io/media/screenshots/0f6/0f65a4ce0ceba15fc823e740bae4f844.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vespies"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}