{"id": 285257, "slug": "super-companion-box-gm48-jam-game", "name": "Super Companion Box (gm48 jam game)", "name_original": "Super Companion Box (gm48 jam game)", "description": "<p><strong>This was from my first game jam back in October 2018. The game wasn't designed for html5... if you come back and play this game, some funky string concatenation happens with the saved numbers, so scores aren't loaded properly </strong><strong>¯\\_(ツ)_/¯ </strong></p>\n<p>This game is heavily inspired by Super Crate Box by @Vlambeer. It's an iteration based on their unique scoring system. Instead of getting weapons to control, you get companions that do their own thing. If you enjoy this game in any capacity, please go check out the original. <strong>It's fantastic.</strong></p>\n<p>CHARACTER UNLOCKS:</p>\n<ul><li>Collect 10 boxes total</li><li>Collect 20 boxes in a single game (a high score of 20)</li><li>Collect 50 boxes total</li><li>If you'd like to just have all the characters available without unlocking them by collecting boxes, just press 'P' on the keyboard</li></ul>\n<p>Controls Keyboard:</p>\n<ul><li>A to move left</li><li>D to move right</li><li>Space to jump/select</li><li>Enter to pause/unpause</li><li>Q to quit</li></ul>\n<p>Gamepad Controller:</p>\n<ul><li>Left stick to move</li><li>A to jump/select</li><li>start to pause</li></ul>\n<p>HOW TO PLAY: The title screen will load. You can select \"start\" to begin a game. The green number on the bottom left is your high score, while the white number on the bottom right is the total number of boxes you've collected.</p>\n<p>At any time in the game, there will be one box on the screen. Move yourself to the box. Touching a box will reveal another box somewhere on the screen. Touching a box will also give you a new companion! These companions will help you fight off bad slimes that are trying to kill you. Don't touch one, or it's game over! Falling off the bottom of the screen will kill you as well. Your companions cannot harm you in any way. They're your friends! Some companions are very powerful, but remember that your score is the number of boxes you get in a single round, and not how long you survive or how many enemies you kill. Good luck!</p>", "metacritic": null, "released": "2019-01-16", "tba": false, "updated": "2019-01-18T04:05:16", "background_image": "https://media.rawg.io/media/screenshots/fe1/fe14361bcfbe37e37cee00b2cf2b4565.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ToastKitten"], "genres": ["Action"], "publishers": [], "esrb_rating": null}