{"id": 285437, "slug": "vind", "name": "Vind", "name_original": "Vind", "description": "<p><em>Vind is a demo of a project made by Forgotten Key. It's a prototype meant to demonstrate some basic parts of a new game in a new IP we call Vind.<br/></em></p>\n<p><em>The demo you can play here would at most be called an <strong>early pre-alpha version</strong> of the game we imagined we would build.<br/></em></p>\r\nOverview\r\n<p>Vind is a game about helping people, getting to know both characters and the world they reside in, and having an amazing adventurous journey doing so. <br/></p>\n<p>In the demos we have posted here you can fly, cook, build, find stuff, talk to people, complete quests and solve puzzles.<br/></p>\n<p>Everything made here is or was very much WIP and we used it mainly to showcase the project to publishers and investors. Goal was to develop further, but future is unclear for the project at the moment.<br/></p>\r\nTwo demos\r\n<p>One that showcases a test scenario that showcases different elements we put together in development. Here you follow a story line, looking for a way to enter the tower you have seen in your dreams.<br/></p>\n<p>Another that showcases more of the flight, where we imagine the level to be a connection or transition in an open world between two different locations. This has a bit more balancing done on the flight mechanic, but no other features than that.<br/></p>\r\nControls\r\n<p>The demos don't contain any tutorials, so it's HIGHLY RECOMMENDED to at least have a look at the control scheme down below (you need a controller to play the demo properly, both Xbox One and PS4 controllers work):<br/></p>\r\nLicense\r\n<p>Both specific demos distributed on this page are licensed under Creative Commons as defined through the link below. Linking to this page is deemed by the developers as an acceptable way to fulfill attribution in the license.<br/><br/></p>", "metacritic": null, "released": "2019-01-15", "tba": false, "updated": "2019-01-18T04:29:54", "background_image": "https://media.rawg.io/media/screenshots/831/8319721cc38e041e6ede4b69ae85dbf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Krumbukt"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}