{"id": 285549, "slug": "yunoki-memories", "name": "Yunoki Memories", "name_original": "Yunoki Memories", "description": "<p><em><strong>Yunoki Memories</strong></em> or <strong><em>YunokiRoom Memory</em></strong>, is a visual novel made by one of YunokiRoom's producers, Maple Channel (めいぷるちゃんれる). Follow Sakura, a middle school student  who gets her wish for you to be her boyfriend granted. A life of Anime and Slice of Life are waiting for you in this game!</p>\n<p>List of \"Yunoki Memories\" Characters<br/></p>\n<p><strong>Sakura Kirishima (霧島さくら)</strong></p>\n<p>Sakura Kirishima is an average 14-year-old school girl, who have recently moved to Kanagawa Prefecture with her older sister Rena Kirishima, attended a school there in Gunma Prefecture, her birthplace. Her birthday is October 16th, 2004.</p>\n<p><strong>Nana Kishimoto (岸本奈々)</strong></p>\n<p>Nana Kishimoto is the flirty 15-year-old schoolgirl and is childhood friend of Sakura Kirishima since when they're elementary school kids. Nana also wants to be a manga artist like her, she also helps her flirt with her crush. Her birthday is January 10th, 2004.</p>\n<p><strong>Rena Kirishima (霧島レナ)</strong></p>\n<p>Rena Kirishima is a smart 20-year-old photographer, who is Sakura's older sister. Rena is actually strict with others except for her younger sister Sakura who she only loves. Her birthday is Feburary 14th, 1998.</p>\n<p><strong>Mai Suzuki (鈴木麻衣)</strong></p>\n<p>Mai Suzuki is a cheerful 11-year-old rabbit, who is a fragile and a gothic emo who is dressed in Lolita. Mai also brings good luck to Sakura when she is a rabbit. Her birthday is November 20th, 2007.</p>\n<p><strong>Risa (リサ)</strong></p>\n<p>Risa is Sakura's pet cat who always follow her each time. Risa can be the most powerful cat of all the time. </p>\n<p>Voice Actor: Yunoki Space</p>\n<p><strong>Tera (テラ)</strong></p>\n<p>Tera is a fairy that visits Sakura in her dreams. She also follows Sakura too just like Risa who is a cat in the real world.</p>\n<p><strong>Evil Grandmother (</strong><strong>悪の祖母)</strong></p>\n<p>This is Sakura and Rena's evil grandmother, who is actually abusive and disrespectful to Kanagawa people.</p>\n<p><strong>Azure (紺碧)</strong></p>\n<p>Azure is Evil Grandmother's bodyguard and protector, who wanted to destroy Sakura and her friends.</p>\n<p><strong>Junkosama (純子様)</strong></p>\n<p>This is Junko-sama, she is the daughter of Rena's half sister and is Sakura's half-cousin.</p>\n<p><strong>Himeko Nishimura (西村姫子)</strong></p>\n<p>This is Himeko Nishimura, a former Japanese heavy-weight boxing girl. </p>\n<p><strong>Selenachan (セレナちゃん)</strong></p>\n<p>Selenachan is Nana's boss at the Mapuru Cafe where she works there.</p>\n<p><strong>SIDE CHARACTERS!</strong></p>\n<p><strong>Sakurako Kirishima (霧島さくら子)</strong></p>\n<p>Sakurako is Sakura and Rena's forgotten sister, who was probably alone in Gunma Prefecture.</p>\n<p><strong>Tomoko Nishimura (西村知子)</strong></p>\n<p>Tomoko Nishimura is literally Himeko's younger sister and a character from the \"MapleStory 2\" anime series. She is also cheerful as an elf. Her birthday is December 16th, 2003.</p>\n<p><strong>Yunoki (ゆのき)</strong></p>\n<p>The titular protagonist and is the storyteller.</p>\n<p><strong>Creator (クリエイター) Mistakenly Nickname: Chiruno (チルノ)</strong></p>\n<p>The creator of the YunokiRoom Universe.</p>\n<p>NOTE: The game might not work if you have a Japanese language not installed on your computer. The only way to resolve the problem is set your computer's language to Japanese so you can play it.</p>", "metacritic": null, "released": "2019-01-06", "tba": false, "updated": "2019-01-18T04:44:39", "background_image": "https://media.rawg.io/media/screenshots/451/45164a2fa6ffa140578da85d076f5ad8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Holyshit"], "genres": [], "publishers": [], "esrb_rating": null}