{"id": 285647, "slug": "ore-no-ryomi-2-the-restaurant", "name": "Ore no Ryomi 2: The Restaurant", "name_original": "Ore no Ryomi 2: The Restaurant", "description": "<p>Ore no Ryomi 2: The Restaurant is a restaurant management game. Similarly to its predecessor, it&#39;s an action-strategy game where the player needs to both manage his funds, and to personally prepare all the dishes for the customers. </p>\n<p>Before the start of each day, the player can spend his money to purchase expansions for his restaurant, including new food menu items, as well as useful equipment. Once the day starts, the player must manage his time carefully in order to cater for all the customers&#39; and the restaurant&#39;s needs, from morning till closing hours. </p>\n<p>Throughout the day, new customers keep coming in and ordering food, and events (such as the need to wash dishes, or a fire in the kitchen) pop up which require the manager&#39;s attention. Each customer and event is represented by a gradually vanishing bar. Preparing food, and taking care of problems, is usually done through a simple, action minigame. The player can only take on one of these at a time, but it is possible to serve prepared meals to customers while in the middle of something else. </p>\n<p>Each customer expects his food to be prepared exactly according to order. If the player messes something up, either by adding the wrong ingredients or by under- or overcooking the food, the customer will pay less. And if a customer waits too long without their order being attended to, they get furious and leave, causing a small money penalty. Things get even more hectic during the &quot;Rush Hour&quot; that comes twice every day, during which large crowds of customers keep coming in. </p>\n<p>Ore no Ryomi 2 also contains a number of &quot;Challenges&quot;: the player, invited to the Iron Chef TV show, tries to complete a specific difficult task, such as preparing a number of perfect dishes in a limited time. Throughout the game the player receives trophies and awards, which he can proudly view in his Trophy Room, if he has purchased it.</p>", "metacritic": null, "released": "2004-04-18", "tba": false, "updated": "2019-01-19T13:43:26", "background_image": "https://media.rawg.io/media/screenshots/4a6/4a63fd83025732968f3d68da332e64cc.jpg", "website": "http://www.vertigogaming.net/main/freeware/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vertigo Gaming"], "genres": ["Action", "Strategy"], "publishers": ["Vertigo Gaming"], "esrb_rating": null}