{"id": 285682, "slug": "devotion-2", "name": "Devotion", "name_original": "Devotion", "description": "<p>From the creators of the IndieCade Journey Award winner Detention, Red Candle Games brings you a story Inspired by East Asian folk culture. Devotion is a first-person atmospheric horror game depicting the life of a family shadowed by religious belief. Explore as a 1980s Taiwan apartment-complex lost in time gradually shift into a hellish nightmare. Delve into the vows each member of the family has made, and witness their devotion.StoryYou step into your apartment, 80s music drifts through the air, an idol show plays on the television; a nostalgic setting surely, but what is this feeling of unease? You question this place you used to call “home,” noticing as it distorts with every shift of your eyes, anxious as your surroundings skirt the precipice of the extraordinary. As you push through each memory, uncovering the layers of each mystery, you may find buried in this home, the unsettling truth of those who lived here.<br />\n“Remember what you prayed for…”FeaturesFirst-person atmospheric horror<br />\nStory-driven exploration and intrigue<br />\nSound design applying the use of East Asian instruments and 80s Taiwanese music<br />\nRelive the 1980s Taiwanese lifestyle through visuals and setting<br />\nUnique Taiwanese/East Asian reference (folk culture, elements of taoism/buddhism)Original Theme Song<br />\nWritten and performed by Golden Melody Award winner “No party for Cao Dong”.</p>", "metacritic": 86, "released": "2019-02-18", "tba": false, "updated": "2023-07-21T19:20:52", "background_image": "https://media.rawg.io/media/games/c3a/c3a4ecea3f9ccf77125aa4ad5bbc9961.jpg", "website": "http://www.redcandlegames.com/devotion/", "rating": 4.08, "rating_top": 4, "added_by_status": {"yet": 23, "owned": 69, "beaten": 66, "toplay": 45, "dropped": 7, "playing": 1}, "playtime": 4, "achievements_count": 2, "ratings_count": 60, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 65, "platforms": ["PC"], "developers": ["RedCandleGames"], "genres": ["Adventure", "Indie"], "publishers": ["Winking Skywalker", "Indievent"], "esrb_rating": null}