{"id": 28568, "slug": "assassins-creed-ii", "name": "Assassin's Creed II", "name_original": "Assassin's Creed II", "description": "<p>Assassin&#39;s Creed II is the second installment in the AC series, the center of which is stealths kills, exploring the world and enemy encounters. It is the straight sequel to the first part of the series and the beginning of the Ezio — the protagonist — trilogy, followed by &#39;Brotherhood&#39; and &#39;Revelation.&#39;<br />\nThe events take place in Rome, during the Italian Renaissance (1476-1499), we play as Ezio Auditore and are fighting against Knight Templar, being the Assassins. At the same time, all of the installments within a series are connected with each other by the Desmond storyline: all of the enchanted worlds he travels to are just simulations achieved through using &quot;Animus&quot; — a particular device which gets in the DNA and allows its user to drive around their memories. <br />\nThe game involves following mechanics — presuming the player to chase around some target, not moving to close, but not getting far at the same time; exploring quests — the heart of movement mechanics is parkour, and fighting — hero&#39;s arsenal involves swords, spears, and other melee weapons as well as ranged ones: bows, crossbows, and javelins.</p>", "metacritic": 89, "released": "2009-11-17", "tba": false, "updated": "2024-04-18T19:22:40", "background_image": "https://media.rawg.io/media/games/1be/1bed7fae69d1004c09dfe1101d5a3a94.jpg", "website": "http://assassinscreed.uk.ubi.com/assassins-creed-2/#/home", "rating": 4.42, "rating_top": 5, "added_by_status": {"yet": 207, "owned": 3538, "beaten": 3344, "toplay": 156, "dropped": 374, "playing": 50}, "playtime": 14, "achievements_count": 152, "ratings_count": 2753, "suggestions_count": 631, "game_series_count": 19, "reviews_count": 2777, "platforms": ["Xbox 360", "PlayStation 3", "Xbox One", "PC", "macOS", "PlayStation 4"], "developers": ["Ubisoft Montreal"], "genres": ["Action"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Mature"}