{"id": 285631, "slug": "proton-kaldrin", "name": "Proton (Kaldrin)", "name_original": "Proton (Kaldrin)", "description": "<p>Hey you !</p>\n<p>Proton is a complete Twin Stick shooter demo I created using Unreal Engine 4 during my Game Design degree !</p>\n<p>We had to make a Twin Stick Shooter in 3 weeks as groups of 3, and we designed a very original twin stick shooter that has very developed movement mechanics using the shots of the player !</p>\n\r\nConcept\r\n<p>This is a speed run /scoring TSS where your objective is to reach the end of the level with the highest score, but enemies will try to block your road to reach it, so try to kill them all to gain points, or simply avoid them to reach the end faster and score more chrono points ?</p>\n<p>The movements / shoot mechanics are quite advanced, hard to master, but offer a deep level of possibilities of what the player can do ultimately if he masters it to progress in the game, and he will learn more and more as he plays !</p>\n\n<p>You can move your cube right and left, switch plans, and double jump. Your jumps recharge each time you hit something with your cube, that'd be a wall, an enemy, or your own shots.</p>\n<p>You can shoot in any direction you want (Except if you haven't found a power up yet), and switch your recoil mode, thrust or no thrust, your shots will make you fly or not move you at all, and they will bounce on walls up to three times.</p>\n<p>You have a power bar representing your current health, but also your shoot power, and it can raise up to 5 if you destroy blue power-ups.</p>\n<p>You can use 1 power unit to slow down time for 15 seconds and be able to understand more the quick situations going on and react.</p>\n\n<p>A full game would have a lot of levels, score ratings, online leader boards and a level editor for community levels, and probably many speed runners x)</p>\n\r\nCommands\r\n<p>- Space / Right trigger : Jump<br/>- QD / Left joystick  X : Horizontal movements<br/>- ZS / Left joystick Y : Plan switch<br/>- Left click / Right bumper : Shoot (Requires at least 1 power)<br/>- Mouse / Arrow keys / Right joystick : Aim<br/>- Right click / Left trigger : Switch thrust mode (Requires at least 1 power)<br/>- A / Left bumper : Bullet time (Requires at least 2 power)</p>\n<p>I HIGHLY recommend playing with a controller, it's jump too hard to aim via mouse in the current demo.</p>", "metacritic": null, "released": "2019-01-12", "tba": false, "updated": "2019-01-18T04:57:18", "background_image": "https://media.rawg.io/media/screenshots/218/218d31f4be9324eef1f265efec8b6058.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kaldrin"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}