{"id": 285710, "slug": "cyndy", "name": "Cyndy", "name_original": "Cyndy", "description": "<p>Welcome to Cyndy, a porn adventure. The world of porn is on the change. With mainstream studios going down and the rise of Internet porn, now it&#39;s your chance to make a name for yourself in this world.<br />\nAs the main character of this game, you will have to start a porn studio, with only a phone in your pocket and grow it to professional, expensive studio equipment. You are the director, so you will decide who plays in your movies, what kind of movies you will create and if you will succeed or not, as failure is always an option. Using your looks, wits, and charm, you will be able to seduce others to play in your porn projects. Or, if that fails, you can always pay them! The better the equipment you use, props and more actors you have used in your project, the more money you will make, and when the times are right, you will be able to rise from a small-time amateur to a PORN GIANT, with a studio to rival 20 Century Fox&#39;s!<br />\nAs you play the game you will enjoy hundreds of sexy and sex filled 3D renders, with more to be added as the game evolves. These images will represent sex scenes with multiple categories: threesomes, orgies, couple, lesbian and solo. Also, BDSM and power play, with more to come in the future. As another means to make money in this game I have added the option of robbing people and sell whatever you get from them and asking Cyndy to strip at the local bar. And all of this wrapped around a story that will introduce you to the game, and guide you to your future.<br />\nAt the time of release, the game consists of a 3D map for the town, with day and night cycle, dynamic lights. The events and movies in the game contain 650 sexy and full on sex images, and around 120 support images and 17755 words in total.<br />\nFuture plans include a 3D Film Studio, with buildings to be built and 3D actors to populate it. Also, all the movies or photoshoots will be done with 3D models, the players being able to record them in real-time.</p>", "metacritic": null, "released": "2019-01-31", "tba": false, "updated": "2021-04-06T15:38:29", "background_image": "https://media.rawg.io/media/games/d64/d640a54d841497d960fd36d28aa639b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 17, "toplay": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 3, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["DreamBig Games"], "genres": ["Simulation"], "publishers": ["DreamBig Games"], "esrb_rating": null}