{"id": 285705, "slug": "crossextion", "name": "Crossextion", "name_original": "Crossextion", "description": "Crossextion is a simulation/game/sexual communication tool. It is a minimalist meditative rhythm game. <br/>\n<br/>\r\nSex is the oldest rhythm game in the world. It is like making music. It is about keeping pace. It is about trying. It is about putting an effort to keep up with someone else.<br/>\n<br/>\r\nGameplay:<br/>\r\nYou control a penis moving in and out of a vagina. The app allows you to “record” your motion and save it. When you “play” a saved “record”, the vagina will flash in the pattern that you previously recorded. You then have to match the motion of the penis with the in and out pattern of the vagina. The closer you match the pattern, the faster the meter fills up.<br/>\n<br/>\r\nSexual Communication:<br/>\r\nThe player can record the motion that they want to experience and let their significant others play it. They can show their partners the motions that they want to experience by literally recording them and then having their partners play them.<br/>\n<br/>\r\nFeatures:<br/>\r\nThe vagina is recreated using concave soft body physics.<br/>\r\nAs you fill up the meter and come close to orgasm, the simulation lights up with various patterns and colors.<br/>\n<br/>\r\nExperiment Successes:<br/>\r\nThe experience created is trippy and interesting. It matches what I envisioned in my head I wanted to make.<br/>\n<br/>\r\nExperiment Failures:<br/>\r\nThere is no gameplay as such. You can play till the meter fills up. The entire gameplay loop lasts for five or so minutes.<br/>\n<br/>\r\nThis is a great piece to show people and watch their faces go W-T-F.", "metacritic": null, "released": "2019-01-31", "tba": false, "updated": "2019-08-28T21:49:13", "background_image": "https://media.rawg.io/media/screenshots/7e7/7e71f0cd528d28a3a945c6f461eb16e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mechanics As Metaphor"], "genres": ["Indie"], "publishers": ["Omey Salvi"], "esrb_rating": null}