{"id": 285759, "slug": "bingo-90-live-slots-poker", "name": "Bingo 90 Live + Slots & Poker", "name_original": "Bingo 90 Live + Slots & Poker", "description": "play Vegas Slots and 90 ball Bingo online - UK bingo!<br/><br/>Bingo 90 Live HD plus slots is a famous online bingo and Vegas slots for mobile and tablets. Play BINGO and SLOT game and meet with players worldwide. Our 90 Ball Rooms offer everything any Bingo lover could ask for! <br/><br/>You'll find Huge Jackpots, Gorgeous graphics and all day Bingo. There are 3 chances to win a prize with every ticket! Be the first to complete 1st line, 2nd line, or the full house to win the pot! We offer to play online bingo with various rooms and friends, Wherever, Whenever. <br/><br/><br/>How to Play <br/>The Lobby <br/>1. To enter a room simply double touch or two touch on the Room area in room list. <br/>2. The status of room is “Playing”, or time stamp of remained time to play <br/>3. There are 4 types of room, Emerald, Sapphire, Diamond and Ruby. <br/>4. Each room type requires the minimum tick price. For example, a ticket price in Emerald is 5P and Diamond ticket’s 1￡. <br/><br/><br/>The Room <br/>1. When you fist visit a room, it’s divided into two columns. <br/>2. Right column is ticket list to buy. Another ticket list can be shown to swipe ticket list. <br/>3. Touch a ticket to buy, the status of ticket is changed to “Selected”. Touch “SELECT MAX TICKETS”, 18 tickets will be selected. <br/>4. Touch “BUY SELECTED TICKETS”, then all of tickets to be chose will be bought. <br/><br/><br/>The Game <br/>1. One of the great things with online Bingo is that you won’t need to worry about marking your cards as you go, the computer will do all this for you. <br/>2. While you enjoy the game or chat with your friends, our automatic daubers will mark your cards and keep a record of how many correct calls you need to win <br/>3. We’ll also ensure that your most complete cards are pushed to the front so you can make sure you’re watching the front of the race! <br/>4. We’ll flag it up each time someone wins and automatically credit your account! <br/><br/>The Prize <br/>1st line pot : When All numbers of the first line on a ticket is called, you win 1st line pot <br/>2nd line pot : When All numbers of the second line on a ticket is called, you win 2nd line pot <br/>HOUSE : When All numbers of the all three line on a ticket is called, you win HOUSE Jackpot", "metacritic": null, "released": "2010-09-07", "tba": false, "updated": "2019-10-22T14:33:02", "background_image": "https://media.rawg.io/media/screenshots/974/9743a4dbc8e90d4cbc0e9f95864b5bbc_33qOsyU.jpg", "website": "https://www.facebook.com/Bingo90Live/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fungrep"], "genres": ["Board Games"], "publishers": ["Fungrep"], "esrb_rating": null}