{"id": 285883, "slug": "mystery-tales-alaskan-wild-hd-a-mystery-hidden-obj", "name": "Mystery Tales: Alaskan Wild HD - A Mystery Hidden Object Adventure", "name_original": "Mystery Tales: Alaskan Wild HD - A Mystery Hidden Object Adventure", "description": "Play the trial for FREE!  Pay once &amp; complete the adventure!<br/><br/>When you agreed to visit your sister in the cold of Alaska and meet her new family, you were expecting a warm welcome. But when your sister is kidnapped, you realize that this may not be the happy home that it appears to be. Can you save your sister Ellie from the sinister force that wants to destroy her? Or is she forever trapped in this land of ice and frost?<br/><br/>• THE FAMILY THAT PREYS TOGETHER STAYS TOGETHER<br/>What secrets lie in this family’s dark past? What’s the connection between your sister’s disappearance and the strange illness that struck her fiancé Daniel when he was a child?<br/><br/>• CAN YOU MELT A FROZEN HEART?<br/>Drive through the icy blizzard of the cold dark north brimming with intriguing hidden object scenes.<br/> <br/>• LET THE SPIRIT ANIMALS GUIDE YOUR WAY<br/>Get help from the animals through your powerful amulet to solve beautiful puzzles and frosty mini-games.<br/><br/>• DEFEAT THE DARK SHAMAN IN THE BONUS CHAPTER<br/>Match wits with a true mystic and enjoy additional Collector’s Edition exclusives including morphing objects, achievements, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-03-22", "tba": false, "updated": "2019-10-22T14:33:08", "background_image": "https://media.rawg.io/media/screenshots/439/439f35519561a977a79ee411d54ab390_mF8xBrC.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}