{"id": 285808, "slug": "united-front", "name": "United Front", "name_original": "United Front", "description": "United Front is a free to play, global MMO RTS modern war game for you. <br/><br/>Build bases, plunder neighbors, recruit veteran fighters, and join with your allies in a bid for global domination!<br/><br/> Features: <br/>- Join the fray of over [53] nations on a global map<br/>- Deploy over [240] types of units to round out your army<br/>- Mix and match unit types to make a ferocious fighting force<br/>- Utilize army, air force, naval units, and special forces to crush the enemy<br/>- Build your base, develop technologies, or steal tech from your foes<br/>- Create carrier strike groups for attack missions and power projection<br/><br/>A carrier group has been spotted in route to your region. The standard they bear is that of a bitter foe. You’ve notified your allies and they’re mobilizing for conflict.<br/><br/>It’s time to deploy carriers, air force, special ops, and armored divisions of your own to neutralize the incoming threat.  <br/><br/>Welcome to United Front. Make alliances, develop your general’s abilities, build bases, raid neighbors, and bring stability to this war-torn Earth.<br/><br/>Join with thousands of players around the globe in a game of strategy, war, alliances, and intrigue. Plot swift counter attacks with allies or go rogue as an unaligned mercenary state. Direct your dealings in warfare and diplomacy on a massive world map full of plunder and peril!<br/><br/>- Follow and like us on Facebook!<br/>Facebook: https://www.facebook.com/UFWarGame<br/><br/>If you have any questions, feedback, or suggestions, please feel free to contact us!<br/>E-mail: unitedfrontcs@gmail.com", "metacritic": null, "released": "2018-12-24", "tba": false, "updated": "2019-10-22T14:33:05", "background_image": "https://media.rawg.io/media/screenshots/34d/34df02d6cb619e534a43ef7094d286cf_vRs28Dg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FT Entertainment"], "genres": ["RPG", "Strategy"], "publishers": ["FT Entertainment"], "esrb_rating": null}