{"id": 285843, "slug": "draw-hills-road-racing-games", "name": "Draw Hills Road Racing Games", "name_original": "Draw Hills Road Racing Games", "description": "Only you can help them. All you have to do is Draw Road in this racing game and let them drive ahead on your road as a final unpredictable option in Road Draw Game. Be aware while drawing the road as you can draw unlimited road in one go but you must have to pick up your finger and draw road again to avoid tricky obstacles on your way. Everything counts when the fate is out and fuel is going low too. Don’t forget to draw road, and let the old monster in this rainy, jungle and hill climb environment. Collect the star coins as they are not just there for spinning but for unlocking the amazing road draw environments and old but classic monster cars and vans.<br/>Road Draw is one of the unique and interesting free racing game. Its concept is totally different than the traditional racing. It's a race for survival and race for tracks that never existed before.<br/><br/>How To Play The Game:<br/>Draw road race is classic race game and it's really easy but technical to handle the cars, jeeps, monster trucks, vans and buses to keep moving on your own paths, yes just start draw something for unlimited racing mania, pick up your finger and start drawing again. Where there is will there is a way. So if you stuck in your own drawn road, release the finger and draw road again. Don’t forget that every time you draw the third road first segment will disappear, so be focus and be aware of trees, caves, ancient hanging bells, bee hives and mud heaps on your way keep moving and climb hill and drive through dusty rusty and rushy areas as much as you can and keep collecting the coins and fuel tanks.<br/><br/>Features:<br/>1. Weather effects.<br/>2. Classic Toon environments. <br/>3. Physics based racing.<br/>4. Awesome game play.<br/>5. Unique game idea.<br/>6. Draw road of your own thought and tricks .<br/>7. Make Your Monsters Driving Stunts.", "metacritic": null, "released": "2018-10-25", "tba": false, "updated": "2019-10-22T14:33:06", "background_image": "https://media.rawg.io/media/screenshots/da5/da5c18c500185a7cf01e9c1cdc1ec3c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ghulam Ayesha"], "genres": [], "publishers": ["Ghulam Ayesha"], "esrb_rating": null}