{"id": 285945, "slug": "you-cant-land", "name": "You can't land.", "name_original": "You can't land.", "description": "The year is 2077. Humans have been blinded by their obsession to expand into space. Despite all warnings from the past, countless unsupervised space missions have polluted the Earth’s atmosphere to a point of no return. An old data drive holding valuable information must be transported from the remains of the International Space Station back to the surface if humans are to keep open their doorway to space. You take the role of an emergency response astronaut who will attempt to remotely land the valuable spacecraft back to Earth.<br/><br/>But can you land?<br/><br/>More on the game:<br/><br/>[ GAMEPLAY ]<br/>The return of a classical and well familiar arcade gameplay. Tap anywhere on the left or right side of the screen to either decelerate or accelerate your spacecraft. <br/><br/>[ MUSIC ]<br/>Feel how the tension of your task increases as you sore through the atmosphere with our headphone ready music. Beware the pressure of the space void.<br/><br/>[ ATMOSPHERE ]<br/>The game represents a controller screen from which you can control your spacecraft. Mind that disturbances may occur on the screen as you get closer to the surface. Or you can simply enjoy the breathtaking visuals of our planet captured from the orbit. Reaching a goal is not the only thing a game can offer.<br/><br/>[ IDEA ]<br/>There are millions of pieces of space debris currently orbiting the planet and we are unable to track most of the smaller pieces, which can cause a significant danger to our future satellite architecture and space missions. There are measures being considered to battle this issue, however, this game shows the dark future where actions were only considered and never applied, underestimating the threat, as humans often do.<br/><br/><br/>[GIF &amp; SHARE]<br/>You can always save the memory of your biggest achievement by sharing an HD screenshot or upload your last few seconds of gameplay to our GIPHY channel.<br/><br/>Good luck! You will need it.", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2021-02-12T04:54:20", "background_image": "https://media.rawg.io/media/screenshots/0dc/0dc70634d7f84eba6914d5c2aebd483e_5voVmu0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kristiyan Yordanov"], "genres": ["Arcade", "Casual"], "publishers": ["Kristiyan Yordanov"], "esrb_rating": null}