{"id": 285964, "slug": "myth-defense-hd-lf-lite", "name": "Myth Defense HD: LF lite", "name_original": "Myth Defense HD: LF lite", "description": "Popular game in tower defense genre comes to Appstore!<br/>\"Myth Defense: Light Forces\" has the best elements of \"tower defense\" games and also includes such original features as alchemy, random maps, campaign and more. <br/>The game supports all screen resolutions (iPhone/iPod 3-5, iPad 1-4, iPad mini). <br/>This is a free lite version of the game.<br/><br/>Full version features in brief: <br/>- Battle mode: 4 basic maps + random map <br/>- Achievements and ranks <br/>- Campaign: 18 maps; replay campaign many times to obtain a prize and a higher rank <br/>- 2 independent profiles: Advanced and Casual<br/>- Various skills enhancements <br/>- 22 tower types + 3 special traps <br/>- Special characteristics of towers and enemies <br/>- Alchemy: create various runes to enhance your towers <br/>- Terrain features: use swamps, puddles, etc. to employ the best tactics <br/>- 33 levels of hardness <br/>- Multilingual interface <br/>- Panoramic sound on the battleground; original sounds and music <br/>- Game Center support <br/>- iCloud support (use your profile on several devices) <br/>- Interactive help items for beginners <br/>- ability to post screenshots/scores to Twitter, Facebook, VKontakte, Flickr, etc.<br/><br/>The game has two independent profiles, for advanced (challenging) and casual (easy) play.<br/>Casual profile is active by default but you can switch to another and both profiles will be saved.<br/>Older versions had only one profile now called \"advanced\".<br/><br/>Player's progress of the free limited version can be loaded in the full version (Play-&gt;reload profile). <br/><br/>We believe the game will be especially interesting for those who like \"Fieldrunners\", \"Sentinel\", \"Kingdom Rush\" and other \"tower defense\" and strategic games. <br/><br/>To enjoy playing the game even more read our How-To's: http://smartpixgames.com/faq.php#md_howtos <br/><br/>Youtube: https://www.youtube.com/watch?v=aGbtywU_jUQ<br/><br/>***Press about the game*** <br/><br/>appdictions.com 4.5/5<br/>appstorearcade.com 9.5/10 <br/>theiphoneappreview.com 4/5<br/><br/>appstorearcade.com:<br/>\"Games in this genre often promise in their description that it “brings a completely new experience”. This is usually a gross misrepresentation. Then along comes “Myth Defense: Light Forces” which doesn’t make any such claim and yet incorporates one of the biggest evolutions to the TD genre.\"<br/><br/>\"Combining solid \"tower defense\" strategy, beautiful graphics, tons of upgrades and different game modes, Myth Defense: Light Forces must be the best \"tower defense\" game...\"<br/><br/>pocketgamer.co.uk:<br/>\"Helicopters will constantly undermine you and you'll often find yourself overwhelmed by mace swinging orcs. But if you get beyond that, you'll find a rich, engaging and highly rewarding experience.\"<br/><br/>\"With the earning of GPs and artifacts, players can create a huge number of variations in their game(s), making Myth Defense Light Forces an extremely fun, entertaining, and engaging game.\"<br/><br/>gamezebo.com:<br/>\"Myth Defense offers lovely visuals that are among the best. It's very well presented and there is no noticeable slowdown, even when the screen is bursting with towers, fireballs, arrows and goblins.\"<br/><br/>\"Just watch this video and tell me this doesn’t look amazing. The developing company, Smartpix Games, has made your addiction extremely easy.\"<br/><br/>\"The art and visuals are crisp and detailed, and the sound effects and music definitely make the game seem like an epic fantasy. There is a lot of content here. If you like \"tower defense\" games, this is probably going to satisfy your \"tower defense\"itch.\"<br/><br/>seetechno.com:<br/>\"Challenging without having to be irrationally complicated or impossible to progress hanging around. More Options than another \"tower defense\" I have come across.\"", "metacritic": null, "released": "2012-12-10", "tba": false, "updated": "2019-10-22T14:33:14", "background_image": "https://media.rawg.io/media/screenshots/b44/b44c11563614c424ec464cd727567212.jpg", "website": "http://smartpixgames.com/mythdefense.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Smartpix Games"], "genres": ["Action", "Strategy"], "publishers": ["Dmitry Shepelev"], "esrb_rating": null}