{"id": 286089, "slug": "regal-tails", "name": "Regal Tails", "name_original": "Regal Tails", "description": "<p>Regal Tails is an epic tale of a mothers conquest to end a war that stole her family from her.  Set in a fantasy world of knights and furries, you get to lay the ground works of the tale of Naja; the fierce lioness war chieftain.</p>\n<p>Breaking away from conventional visual novel formats where you takes back seat of a nameless character, here you will take the role as director of the narrative.  Guide several characters down your own path.  Every decision will ultimately alter the final outcome to the grand design! <br/></p>\n<p>Can you help snag victory for Naja or will you doom her to a fate most unpleasant? <br/>SiriusLeeLost has forged together an astonishing team of people for this project: Kabrion (Artist), TheEmberFox (composer) pair up to bring you this passion project to life!</p><em>\n<p><strong>How free range do you have to the story?</strong></p>\n<p>Regal Tails dives into a fantasy world where YOU are the narrator!  Although the story centers around Naja you will gain the option of seeing the perspective of several characters within the war.<br/> </p><p>How you play them will alter the war!</p>\n<p><strong><strong>NSFW?</strong></strong><br/>Yes!<br/><br/>Content will include blood, violence, and sexual interactions.<br/>For public access stores, such as Steam, certain scenes will be mild down.<br/>We will, however, have several scenes for various characters in the story for a separate download; if desired.  The main orientations will be straight, but we are flexible to change things up if the demands are called from patrons!<br/></p>\n<em>\n<p>Expect more in the updates to come!</p>\n<p>Until then, feel free to follow us on: <br/></p>\n<p>Patreon - https://www.patreon.com/RegalTails<br/>Twitter - https://twitter.com/RegalTails<br/>FA - http://www.furaffinity.net/user/regaltails/<br/><br/></p>\n<p>Artist/Programmer - Kabrion<br/>Sound - TheEmberFox<br/>Author - SiriusLeeLost<br/>Editor - Desirnee<br/></p>\n</em><br/></em><p><em><em>Editor Notes:  Game is in alpha.  Many concepts, designs, and dialog can and will change upon development.<br/></em></em></p>", "metacritic": null, "released": "2019-01-20", "tba": false, "updated": "2019-01-21T03:32:47", "background_image": "https://media.rawg.io/media/screenshots/405/4050971e846f349fbc923e1979cfd0e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Regal_Tails"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}