{"id": 286095, "slug": "overpunch", "name": "OverPunch", "name_original": "OverPunch", "description": "<p><strong>OverPunch</strong> is an simultaneous turn based local multiplayer strategy game. You take turns entering commands for the red and blue ships and execute them. The  First person to destroy the opponent (hit 4 times) or collect the beacon and head to base of your ships color, wins.<br/></p>\n<p><strong>How to Play</strong></p>\n<ol><li>Click the Command HUB button</li><li>Click the Add Command button to add commands for the red player's ship</li><li>Click the Punch It In button to set commands and move on</li><li>Click the Add Command button to add commands for the blue player's ship</li><li>Click the Punch It In button to set commands and move on</li><li>Click the execute button to execute the commands simultaneously</li></ol>\n<p>Note - You can add upto 5 commands. Each command executes for 2 seconds. A turn will last for 10 seconds, even if you haven't added 5 commands. Some commands like speed will continue to execute if not explicitly set to 0. UI elements are not really optimized for play on smaller screens; the apk would be best played on larger tablets than smaller phones.</p>\n<p><strong>Music</strong></p>\n<p>Hand Balance Redux Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p><strong>Extra</strong></p>\n<p>As part of the rapid prototyping class I am giving this semester, we'll be doing 5 games in the coming five weeks. This is the theme reveal game for Project 3 of week 3! Get with it!<br/></p>\n<p>This unit was greatly inspired by the 2018 GDC talk by game developers and professors Douglas Wilson and Bennett Foddy which talks about the \"Game a Week\" model.<br/></p>", "metacritic": null, "released": "2019-01-20", "tba": false, "updated": "2019-01-21T03:33:27", "background_image": "https://media.rawg.io/media/screenshots/abc/abc422fa79f7d54d8a1ed55bc06649dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Yadu Rajiv"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}