{"id": 286143, "slug": "sky-fortress-zhulong", "name": "Sky Fortress Zhulong", "name_original": "Sky Fortress Zhulong", "description": "<p>Sky Fortress Zhulong is a series with three-story arcs with the first arc made in 20 hours using RPGMaker MV. The project began on Friday, January 18, 2019 at 9:00pm CT and suspended on Sunday, January 20, 2019 at 5:00pm CT. The project will continue development with popular support.</p>\n\n<p><strong>Story</strong></p>\n<p>The Sky Fortress series focuses on aspects of fantasy living in a post-civil war world. Many factions such as the Academy, the Demonic Confederacy, and the Imperial Guardsmen that used to make up the Empire separated and fought to unite the land from the chaos. Each faction had their own agenda for ruling over the Empire, none of the factions could ever agree with one another, and some factions simply did not like one each other.</p>\n<p>The civil war was originally thought to end in a few years, but instead lasted a hundred years. Over half of the Empire's population perished from the bloody battles and atrocities committed in attempts to end the chaos. Every faction relied on the sky fortresses built to end wars. But instead the commanders of these fortresses hid themselves and refused to participate. Instead of war, these sky fortresses were built and launched like arks and preserved much of the former Empire. Residents of such fortresses were largely immune from the dangers and suffering from the civil war. As the war dragged on, sky fortress residents started to view the war as entertainment while people on the land started fighting for their own survival. After the civil war, these sky fortresses are seen as massive time capsules of pre-war luxuries and technologies.<br/></p>\n<p>Near the end of the civil war, a brave child named Sanctuary was born and joined the Academy as a vanguard. This child fought many battles and earned many great achievements against major powers. Now a grown woman and the civil war ended, Sanctuary desires to claim a sky fortress that she fantasized about for so long that kept her alive and fighting.</p>\n<p>So begins the journey of our heroine Sanctuary to claim a sky fortress for herself!</p>\n\n<p><strong>Main Features</strong></p>\n<p>- A spunky cast of characters each with their dementia try to survive a post-civil war fantasy world filled with sky fortresses and innuendos of horrible post-civil war life.</p>\n<p>- NPCs and adversaries that declare uncertain allegiances to a new empire led by a mysterious Academy.</p>\n<p>- Modern JRPG-style boss and mid-boss battles with smart triggers and sub-events.</p>\n<p>- Familiar gameplay elements from RPGMaker environment</p>\n<p>- Side-view graphics</p>\n<p>- Charge Turn Battle (CTB) system</p>\n<p>- Skill and magic-based combat focus</p>\n<p>- Elemental strength and weakness system<br/></p>\n<p>- Weapon and armour durability system<br/></p>\n<p>- Player row formation and up to ten party-member system</p>\n<p>- Primary story class and sub-class archetype system</p>\n\n<p><strong>Works Cited</strong></p>\n<p>RPGMaker MV assets</p>\n<p>YTB plugins</p>", "metacritic": null, "released": "2019-01-20", "tba": false, "updated": "2019-01-21T03:39:36", "background_image": "https://media.rawg.io/media/screenshots/201/20148d4d74c3efd5dd05715f86898619.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["alanjpan"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}