{"id": 286145, "slug": "kuro-shield-demo-1019", "name": "Kuro Shield (demo 1019)", "name_original": "Kuro Shield (demo 1019)", "description": "<p>Here is a project I have been working on for a few months, with hundreds of hours on it. I started a platform game but the desire to do a shoot is before, so exit the platform and here is a 100% danmaku shoot.<br/><br/>So, gameplay level is close to a cave  naturally, but with a good share of gigawing. (for now everything is played on the keyboard with arrows and WXCV, but you can use joy2key if you miss the stick):<br/><br/>button 1 : fire<br/>button 1 hold : laser (as a cave game for sure)<br/>button 2 : shield<br/>button 3 : autofire<br/>button 4 : bomb<br/><br/>Namely that the bomb removes bullets from the screen but does no damage to an enemy, on the other hand it brings the different gauge to zero<br/>The shield is at the heart of the scoring system, but at first glance at the HUD:<br/><br/><br/><br/>1 / a shield for lives (there only one remaining)<br/>2 / the score multiplier gauge<br/>3 / the current multiplier (up to X20)<br/>4 / the remaining bombs<br/>5 / the shield gauge<br/>6 / the score<br/><br/>So basically to score, it is necessary to wait until the gauge of the shield is at the max and to launch the shield, the ship is invincible during a little time during which it is necessary to absorb the enemy bullets to transform them in coins which will make climb the gauge of the score multiplier.<br/><br/>Then, in normal mode, when a ship explodes, if its explosion touches bullets, these bullets are transformed into coins which will be worth 1000 points at the base, multiplied by the current mutiplier (thus 1000 if empty multiplier up to 20000 if at max). When in kuro shield mode, coins = 100pts only</p>\n<p>Final game will be free !</p>", "metacritic": null, "released": "2019-01-20", "tba": false, "updated": "2019-01-21T03:39:52", "background_image": "https://media.rawg.io/media/screenshots/133/13343445e2f3ed2140b36c301e9c0f75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["1guy1room"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}