{"id": 286253, "slug": "ultimate-cops-c64-compilation", "name": "Ultimate Cops (C64 Compilation)", "name_original": "Ultimate Cops (C64 Compilation)", "description": "<p>Alf Yngve blasts back onto the C64 with the definitive collection of super-enhanced <strong>COPS</strong> games.  This compilation features FOUR full games from Alf featuring brand-new front-ends, enhanced in-game effects, new power-ups, stunning bitmap presentation screen and superb soundtracks.  The package also features two previously unreleased <strong>COPS</strong> bonus games!<br/></p>\n<p> <strong>COPS</strong></p>\n<p> Europe in the near future... Several cities have merged into EURO-CITY - a vast metropolis of 30 million people. Corruption and gangsterism has turned Euro-City into a war zone. Enter the city's toughest cops: Mike \"Mad Dog\" McTavish and Singh \"Big Bang\" Kapoor. They must crush the gangs and bring down the crime bosses - no matter how high up they are!</p>\n<p> </p>\n<p> <br/><strong>COPS II - Holiday Cops</strong><br/> <br/>Mike \"Mad Dog\" McTavish and Singh \"Big Bang\" Kapoor go on a well-deserved vacation to the Greek islands... But their holiday turns into a nightmare. A terrorist group captures several small islands. Tourists and natives become hostages.<br/>Mike and Singh choose to go after the terrorists - on their own! </p>\n<p> </p>\n<p><strong>COPS III - Cops, Robbers &amp; Dinosaurs</strong><br/> <br/>Christmas in Euro-City: While most police officers are off-duty, the snowed-in metropolis explodes with crime.  Bank robbers rob... Neo-Nazis go berserk... violent fanatics attack... and terrorists join the fray. Police officers Mike \"Mad Dog\" McTavish and Singh \"Big Bang\" Kapoor must work overtime to save the city - and Christmas.</p>\n<p> </p>\n<p><strong>COPS - The Final Chapter<br/></strong> <br/>The near future...<br/>Pope Maledict I has been arrested and put on trial.<br/>A mysterious cult breaks Maledict out of prison and attacks the city.<br/>Police officers Mike \"Mad Dog\" McTavish and Singh \"Big Bang\" Kapoor are old and tired. But they get one last assignment, the job no other cop wants... Mike and Singh must stop the terror wave and catch Maledict... at any cost.</p>\n<p> </p>\n\n<p>  <strong>** ULTIMATE COPS - GAME FEATURES **</strong></p>\n<p>• Six full games in one pack! </p>\n<p>• Brand new front-ends by Richard Bayliss! </p>\n<p>• In-Game enhancements &amp; power-ups!<br/> <br/>• 1 or 2 player co-op ACTION!<br/> <br/>• Additional graphics by Carl 'Mase' Mason &amp; STE '86!<br/> <br/> • Stunning cover artwork by Oliver Frey! </p>\n<p> \r\n</p>\n<p><strong>Help support Alf Yngve's fantastic C64 projects,<br/>illustrating and novel writing via Patreon.</strong></p>", "metacritic": null, "released": "2019-01-19", "tba": false, "updated": "2019-01-21T03:55:57", "background_image": "https://media.rawg.io/media/screenshots/e19/e19a40089ed8650fbc80872ec74ff833.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Psytronik Software"], "genres": ["Action"], "publishers": [], "esrb_rating": null}