{"id": 286333, "slug": "elemental-puzzle", "name": "Elemental Puzzle", "name_original": "Elemental Puzzle", "description": "<p>Match an element to its opposite to destroy them both (fire+water, earth+air).</p>\n<p>Match a crystal (flashing diamond) to <em>three </em>of its opposing element to destroy them all.</p>\n<p>Clear all crystals to complete a level.</p>\n<p>You lose if an element locks into the red grid square.</p>\n<p>Made in ~15 hours of dev time. Weakness: Scope.</p>\n<p><strong>Controls</strong></p>\n<p>Move left/right with left stick, d-pad, or arrow keys.</p>\n<p>Drop immediately with spacebar or A button.</p>\n<p><strong>Strategies</strong></p>\n<p>A gem counts as a color in its line. So, Fire - Fire - Water Gem - Fire Gem will destroy the Water Gem, as will Fire - Fire - Fire Gem - Water Gem. But note that the Fire Gem is <em>not </em>destroyed, as it is not touching three of the opposing element - only one.</p>\n<p>You can clear groups vertically or horizontally.</p>\n<p>If you clear under a stack of elements, they will fall. Gems will not.</p>\n<p>Elements can be used to clear up opposing elements in the \"wrong place.\" If an element touches multiple of the opposite element it will destroy them all (not gems).</p>\n<p>An element connected to a line of opposing elements will clear all the opposition - <em>unless </em>they're touching a gem of the same type. So, Fire will clear Water - Water - Water - Water. But if it's Water - Water - Water <strong>Gem </strong>then only the first Water will clear.</p>", "metacritic": null, "released": "2019-01-19", "tba": false, "updated": "2019-01-21T04:06:08", "background_image": "https://media.rawg.io/media/screenshots/61c/61c491c0c0d09128b2f83ff923353f85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Joshua McLean"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}