{"id": 28633, "slug": "forza-horizon-2", "name": "Forza Horizon 2", "name_original": "Forza Horizon 2", "description": "<p>The open world car racing simulator, part of the Forza game series, or rather the sequel to the Forza Horizon game, which was released in 2012. The game has a continuation - Forza Horizon 3.</p>\n<h3>Gameplay</h3>\n<p>In the story of the game, the player participates in the fictional Horizon racing festival, taking place in southern France and northern Italy.</p>\n<p>The game world of Forza Horizon 2 is about three times larger than the world of the game Forza Horizon.</p>\n<p>In total, the game has more than two hundred different cars, among which there are exotic, rally, trucks and &quot;hot&quot; hatchbacks. Among them: Lamborghini Huracán LP610-4 and Lamborghini Aventador in the version of Veneno, McLaren P1, LaFerrari, Koenigsegg Agera, Bugatti Veyron in the version of Sport.</p>\n<p>Players explore the terrain in which the races take place, take part in races and other events - without all this, you cannot advance further in the game. Time of the day, day and night, were present in previous games, and in Forza Horizon 2 for the first time in the Forza Motorsport series a dynamic weather system was implemented.</p>\n<p>To the modes of the game, known from previous games, new modes are added. For example, the Bucket List is a group of competitions, the result of which is taken into account for all group competitions in total. In multiplayer mode in the Bucket List, you can invite a friend or a random player, this mode has its own name Co-Op Bucket Lists. Another mode, also multiplayer, Car Meets, allows players to compare their cars. For multiplayer ringing modes are also available, sprint races, off-road racing and others.</p>\n<h3>Additions</h3>\n<p>The first addition to Storm Island (for the Xbox One version of the game) contains a new terrain - Storm Island. It has its own tracks, five new types of competitions, the expansion of the game engine weather system, five new cars and one car in the hangar.</p>\n<p>The supplement dedicated to Porsche cars contains ten cars, including the Porsche 944, Porsche 911 GT3 RS, Porsche Macan Turbo, Porsche Cayman GT4.</p>\n<p>Forza Horizon 2 also has a Fast &amp; Furios cinema franchise - Forza Horizon 2 Presents Fast &amp; Furious. In this supplement, nitrous oxide appears for the first time in the Forza Motorsport series.</p>", "metacritic": 86, "released": "2014-09-30", "tba": false, "updated": "2024-04-10T23:06:14", "background_image": "https://media.rawg.io/media/games/9a8/9a8be216c8907959a9984eec3a2cc8d1.jpg", "website": "https://forza.net/horizon", "rating": 4.21, "rating_top": 4, "added_by_status": {"yet": 28, "owned": 1157, "beaten": 186, "toplay": 29, "dropped": 108, "playing": 26}, "playtime": 2, "achievements_count": 138, "ratings_count": 349, "suggestions_count": 179, "game_series_count": 4, "reviews_count": 350, "platforms": ["Xbox One", "Xbox 360"], "developers": ["Sumo Digital", "Playground Games"], "genres": ["Racing", "Arcade"], "publishers": ["Microsoft Studios"], "esrb_rating": "Everyone 10+"}