{"id": 286568, "slug": "welltown", "name": "WellTown", "name_original": "WellTown", "description": "WellTown injects you directly into the bloodstream of New Zealand’s creative heart via virtual reality. With the assistance of an outrageously lovable local, you can choose from a range of experiences inspired by actual attractions while situated on the breath-taking vantage point high above Wellington city. Absorb the dawn chorus of New Zealand’s native birds amidst the beautiful native bush that surrounds the city. Busk on Cuba St as the new drummer for local band, the Orchestra Of Spheres. Run a coffee cart in crisis as the morning’s zombified commuters converge upon it for their caffeine fix. Take a jump off a diving platform on the waterfront or a dip in Wellington’s beautifully clean harbour. And be surrounded by the serenity of the star-filled night sky and welcome Matariki, Maori New Year.<br/><br/><br/><br/><ul><li>The best New Zealand has to offerFrom exploring natural wonders to cultural marvels. <br/></li><li>DiscoverThe incredible lifestyle of the most walkable city in the world. <br/></li><li>PlayWith local musos, dive into the harbour and try to stave off the Coffeepocalypse. <br/></li><li>Explore Get lost in the exquisite chorus of the local bird life or surrounded by the harbours crystal waters.<br/></li><li>Meet the localsMade by Wellingtonians, to personally guide you through everything this city has to offer. Wild, weird and ridiculously lovely.  <br/></li><li>Become your best, most Wellington self! </li></ul><br/><br/><br/><br/><br/>WellTown also features several additional experiences from some of Wellington’s best institutions! <br/><ul><li>Explore the Weta Cave and meticulously crafted artefacts that can be found in your favourite films From the Weta Workshop.<br/></li><li>Join the All Blacks haka at Westpac Stadium.<br/></li><li>Discover what it is like to work at Xero, one of the world’s leading software companies.<br/></li><li>Learn about one of our richest historical educational institutions at Victoria University of Wellington.<br/></li><li>Find out how you could unleash your creativity at Te Auaha.<br/></li><li>Enjoy New Zealand's culture and heritage at one of the most interactive museums, Te Papa.<br/></li><li>Meditate on the Treaty of Waitangi that shaped New Zealand at the He Tohu exhibition</li></ul><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:05", "background_image": "https://media.rawg.io/media/screenshots/861/86188c384137b97f9f3835107f2d13b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wrestler"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["WREDA"], "esrb_rating": null}