{"id": 286569, "slug": "spectrums-path", "name": "Spectrum's Path", "name_original": "Spectrum's Path", "description": "Awareness, meet roleplay. An existence has been lifted. Worlds have merged as one. And a dark conquest threatens everything with neither regard nor shame.<br/><br/>Time is of the essence more than ever, and this could be the last thing we shall ever know. Unbeknownst to its originator, the conquest of all worlds has the potential to result in the full termination of known existence. And no less than three unique worlds have already been fused as a result.<br/><br/>But it's not over yet. Fate is about to call ten unique individuals to put an end to further intrusion on the essence of all that is known. But this is no ordinary task, nor an ordinary call to action. This is the kind of situation for which anyone can be ascribed to fate. The kind of situation whose ascribed champion can be originated from anywhere. The kind of situation where practically anything can happen...<br/><br/>and will, because that's exactly what was to come and who to expect as the calling for this job has reached those born of the spectrum's path, a consideration not <br/>easily described of themselves, even to this day. The mission to come may be difficult, even in terms of their unique considerations. But there's one clear thing as our crew prepares to assemble, as the situation responsible for such extreme measures has only just begun.<br/><br/>And since you have the most unique crew on the job here, there's much to expect even by their own standards. But there's a lot that goes into doing such an important job, and you can expect just as much in return.<br/><br/><ul><li>Classic roleplay experience with the gameplay you expect from an epic quest of this caliber. All requisite decisions from engaging the enemy, defending yourself, utilizing your special skills and upgrading your loadout are faithfully represented down to the wire, guided and perfected by a veteran of adventures past in a charming, retro-style callback to some of the greatest stories ​ever told.<br/></li><li>Mad skills by the bunch. Like anyone set on the path for his destiny, you'll unlock everything from a mind purification wave that saps out poison to a powerful sacred-light restoration to recover health before you risk getting K.O.'d... plus a sweet, badass strong-arm technic to charge up during battle. Charge enough and you can let 'er loose and shove it up the face! And that's just for starters.<br/></li><li>Relatable starring role and supporting cast. No one-off, actions-do-the-talking, quiet on the job here. Tedd Meyers just had a very rough night, and next he knows is that he steps out to make haste for the daily grind of his job... only to find that <strong>four mutant slimepods</strong> have set a rather inescapable trap. (And you thought your day was bad.)<br/></li><li>In fact, everyone here's got a personality. Everyone! From Jorge and his slow, collected advice-giving to emotionally-charged Jenn Garnerson and her unease in describing certain situations (she might even be one like Tedd!) there's nobody in this adventure who is excessively reserved in explaining themselves, let alone showing off what they're made of.<br/></li><li>Surprising casualties. You know it's all on the line when the person you least expect gives himself to the cause just before an unexpected contribution from the last possible neighbour you expect to get involved. (That's some serious expectations - no pun intended.)<br/></li><li>Whiz-bang for your buck. Even in cases where the psyche limits biologic function, the numerous societies of VI Delta have their own creative solutions for the full integration thereof.<br/></li><li>There goes the fourth wall. When it's all on the line, sooner or later you know there's gonna be trouble... from targeted attack planning to a major coronary incident at the worst possible time. As they say, you can expect the unexpected when it gets this tough - everything that could reasonably go wrong is liable to rear up in your face before you're even done with the kitchen sink!<br/></li><li>A multitude of many hours worth of adventure. It's a long way to go, but someone's gotta do it. Too bad fate picked the wrong spectrum-bred pair for this - but with all that awaits them, Tedd and Jenn are set to make the best of this mess of a devising for which they're patently stuck in the middle... even against the worst odds imaginable.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:49:05", "background_image": "https://media.rawg.io/media/screenshots/690/69074012811213d7c611d10718b7d796.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BreakerZero"], "genres": ["RPG", "Indie"], "publishers": ["Dedderomedia"], "esrb_rating": null}