{"id": 286598, "slug": "clicker-rpg-tap-princess", "name": "Clicker RPG Tap Princess", "name_original": "Clicker RPG Tap Princess", "description": "One day, a king of a country was kidnapped.<br/>His daughter, the princess, embarks with her minions on a quest to save her father.<br/><br/>- Defeat the monsters by tapping -<br/>Attack and defeat the monsters by tapping!<br/>Once the monsters are defeated they will leave you coins!<br/>Use the coins to upgrade the princess and defeat more monsters! <br/><br/>- Heartening minions -<br/>Minions are heartening companions who will attack automatically!<br/>Use the coins to upgrade the minions!<br/>When the minions attack, they steal coins from the monsters with strange powers!<br/>You can leave the minions be and the coins will still continue to build up!<br/><br/>- Monsters keep getting stronger -<br/>Each time you defeat a monster, their level grows and become stronger.<br/>Each time they level up they will leave more coins!<br/>There's no limit to the monster's strength.<br/>Try and see what level you can get to.<br/><br/>- \"Relics\" powerful treasures -<br/>Relics are powerful treasures that will make the princess and minions stronger!<br/>To get a relic, level up the princess and get \"Rebirth\"!<br/>You can get a relic by using the \"crystal\" you get through reincarnate!<br/><br/>Let's start on the quest!<br/><br/><br/>*The game is free but also offers some in-game purchases.", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-10-22T13:56:09", "background_image": "https://media.rawg.io/media/screenshots/43e/43ebe1e95ae60f2dc49ef133816d96b6_YMaJBzd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shinichi Nishimori"], "genres": ["Adventure", "RPG"], "publishers": ["SHINICHI NISHIMORI"], "esrb_rating": null}