{"id": 2865, "slug": "anthill", "name": "Anthill", "name_original": "Anthill", "description": "@ GAME OF THE WEEK! @<br/><br/>The best game on the App Store just got even better! Due to popular demand, we've added the new 'Antology' campaign. Eight new nail-biting levels and an Endless Mayhem mode!<br/><br/>@@@@@<br/><br/>AWARDS:<br/><br/>- Anthill has been selected as iPad Game of the Week!<br/>- Anthill has made the Quality Index Top 10 list!<br/><br/>REVIEWS:<br/><br/>\"A must-have.\" - slidetoplay.com, 4/4<br/><br/>\"Strategy done right.\" - 148apps.com, 4.5/5<br/><br/>\"…the execution is amazingly fluid and perfectly suited to iOS.\" — iFanzine, 4.5/5<br/><br/>\"…it’s hard to not call it one of the best, if not the best line drawing TD title available for the iOS.\" — the-app-shack.com, 10/10<br/><br/>\"…a total blast!\" — unboundgamer.com, 9/10<br/><br/>Featured on thegametrail.com! Thanks guys!<br/><br/>@@@@@<br/><br/>FOR QUEEN AND COLONY!<br/><br/>Join the ranks of Anthill, a tactical trail defense game based on the real-world behavior of ants. The award-winning user interface enables you to draw pheromone trails to direct your troops, moving streams of ants rather than individuals.<br/><br/>Engage in the mission to protect your hill as wave upon wave of enemy bugs are thrown at you. Don't wait, join the colony today!<br/><br/>EAT WHAT YOU KILL<br/>Take down a bug with your soldiers, then direct your workers to bring back the carcass for dinner - yum!<br/><br/>SURGICAL STRIKES<br/>Simply tap the screen to send out bomber ants to take out those pesky ladybugs. Satisfaction guaranteed!<br/><br/>UPGRADES! UPGRADES! UPGRADES!<br/>Buy permanent upgrades for your troops! Turn your bombers into carpet bombers, inspire courage in your workers, and make your soldiers more brutal. Boo-ya!<br/><br/>UNIVERSAL APP<br/>Buy once, use for both your iPad and iPhone! We don't charge double for the same game.<br/><br/>@@@@@<br/><br/>QUOTES FROM THE FORUMS:<br/><br/>\"…It the kind of game that grabs you and doesn't let go untill you can't stay awake anymore and the ipod touch slips out of your sweaty hands and falls on the floor.\"<br/>— eugekava<br/><br/>\"This is a really great TD game that feels so different from the rest. It oozes with charm and personality while having a top notch gameplay! It's frantic, fast paced but most of all fun! That's all, go for it guys you won't regret it :)\"<br/>— killercow<br/><br/>\"It truly is a unique and fun change to the genre (...), and well worth the money.\"<br/>— paul hendricks<br/><br/>@@@@@<br/><br/>With close to 40 exciting missions, beautiful surroundings, dozens of different enemies and many days of gameplay, you will love your queen and colony! <br/><br/>Compatible with iPhone 3GS and newer, 3rd generation iPod touch devices and all iPad models.<br/><br/>iPhone4: REQUIRES iOS 4.2 OR NEWER.<br/><br/>VISIT US: www.anthillgame.com<br/>FOLLOW US: www.twitter.com/imageform<br/>LIKE US: www.facebook.com/imageform", "metacritic": null, "released": "2011-10-06", "tba": false, "updated": "2024-04-07T22:14:54", "background_image": "https://media.rawg.io/media/screenshots/561/561200998e96ec21c0680e809b44e006.jpg", "website": "http://anthillgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "iOS"], "developers": ["Image & Form"], "genres": ["Action", "Strategy"], "publishers": ["Image & Form International", "Thunderful"], "esrb_rating": "Everyone"}