{"id": 286614, "slug": "qubetown", "name": "QubeTown", "name_original": "QubeTown", "description": "[FANTASY ADVENTURE QUBETOWN LAUNCHES!]<br/>Do you like a town full of cute and cubic characters and animals?<br/>Welcome to QUBETOWN, the best free to play online farming game!<br/>Every day is an exciting adventure in our town! Harvest crops, raise animals, and even explore dungeons to find awesome treasures!<br/><br/>Build a big farm to feed farm animals and pets and grow crops ranging from wheat to cotton.<br/>To make your town flourish, build bakeries and dessert shops to turn harvested crops into items you can trade. Trade with friends in Market Island or with cute dragon, elephant, and whale characters in exchange for exciting quests. <br/>Collect citizens and heroes to help your town-building adventure more prosperous and to protect your citizens from evil trolls.<br/>Don’t forget to socialize with friends by joining cooperating guilds and playing exciting minigames.  <br/>Reveal QubeTown’s story by exploring various types of expedition. <br/>And don’t worry, you are not alone! There are brave citizens and cute animals to help your explorations.  <br/>Build the best town by designing it your way. Customize characters and re-arrange structures the way you like it. Compete with friends to see who can build the coolest town!<br/>Download for free right now and build your greatest QUBETOWN!<br/><br/>QubeTown Features : <br/>* Build your own town with a variety of unique buildings and cute landscape decorations<br/>* Harvest crops, produce food, and craft goods for your citizens<br/>* Trade goods with neighbors and friends to earn gold and prosper<br/>* Expand your property with golds earned from completing quests and trading<br/>* Explore and travel to mysterious dungeons with your brave citizens and heroes<br/>* Protect your citizens from evil trolls destroying your town.<br/>* Customize your Lord or Lady with one-of-a-kind hairstyles and costumes<br/>* Decorate your village with cool sculptures and personalized placements<br/>* Discover interesting and engaging stories with Tommy <br/>* Meet cute animals including dragons, elephants, and pandas!<br/>* Play minigame with other Lords from all over the world. <br/>* Socialize by inviting your Facebook friends or make new friends in cooperating guilds and communities.<br/><br/>Qubetown is a free online farming and town building game with unique system of dungeons and trading. Download for free and start your fantasy farming adventure today!<br/>Do you need more information, my lord? Learn more about the game! <br/><br/>Facebook: www.facebook.com/qubetown", "metacritic": null, "released": "2019-01-22", "tba": false, "updated": "2019-07-01T01:51:00", "background_image": "https://media.rawg.io/media/screenshots/c72/c72175119ae92b7a6f9b1d01edd94b1a_Bg5RpcJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Webzen"], "genres": ["Simulation", "Family"], "publishers": ["Webzen"], "esrb_rating": null}