{"id": 286676, "slug": "dominion-minion", "name": "Dominion Minion", "name_original": "Dominion Minion", "description": "NOTE: YOU CANNOT PLAY DOMINION ON YOUR IPHONE WITH THIS APP.<br/><br/>Tired of shuffling? This app will shuffle your action cards, choose ten and sort instantaneously by box, cost and alphabetically. Then just get out your boxes, grab the cards in order from each box and you're ready to play.  No more fiddling around with those lame blue-bordered randomizer cards... you could even throw them away! There's even a Black Market helper, so you don't need to set up a Black Market deck when playing with this promo card.<br/><br/>You'll have more time to play and less time to set up and tear down.  Personally I've found this eliminates FIVE MINUTES of the setup and teardown time for every single game I play. Also, the results are more random. Keep track of them with this app - and if you managed to add promo cards to your collection like Black Market and Envoy, this app can include them in the draw as well.<br/><br/>Choose with which sets you want to play. Your friend doesn't have Guilds and Adventures? Turn them off. Visiting Germany to show off your skillz abroad? Choose the German cards - the interface will remain in English!  The app will remember your settings automatically, so you don't have to set it up again each time. What are you waiting for? Get it now and spend more time playing, because we all know Dominion players already shuffle too much!<br/><br/>This app is not affiliated with Rio Grande Games, Hans im Glück or any other publisher of Dominion.", "metacritic": null, "released": "2009-11-14", "tba": false, "updated": "2019-10-22T14:33:25", "background_image": "https://media.rawg.io/media/screenshots/5b3/5b31112f55b8667e21989392e32c0dcb.jpg", "website": "http://www.chucksmith.de/dominion-minion", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chuck Smith"], "genres": ["Board Games", "Card"], "publishers": ["Chuck Smith"], "esrb_rating": null}