{"id": 286639, "slug": "ninja-up", "name": "Ninja UP!", "name_original": "Ninja UP!", "description": "Join the endless running action in one of the best new retro arcade games for mobile. Draw lines to create new springboards for your ninja to jump from so he can bounce his way up and up! But be prepared: You'll need to show your best ninja skills to reach top heights. <br/> <br/>NINJA UP! FEATURES<br/> <br/>• Dodge a flurry of cool enemies from ninjas to fun UFOs.<br/>• Bounce from the top of a busy city to the top of the world and the glorious depths of space itself!<br/>• Enjoy intuitive and fun gameplay that kids and adults can enjoy in this cool arcade action game. All you have to do is draw lines for your ninja to bounce off of, trying to go up and reach the best height possible in an endless sea of challenges.<br/>• Discover cool ninja power-ups that will help you run to the top of the leaderboards and look down upon the endless pixel posers beneath you.<br/>• Put your top skills to the test to unlock all the fun jump master characters and new pixel costumes.<br/>• Challenge your friends and invite them to put their best jump skills to a fun test! <br/> <br/>Ninja Up! is a pixel-perfect title for any fan of endless run games, arcade fun, and run and jump action -- and for everyone from kids to adults. <br/>_____________________________________________<br/>Visit us at www.what.games<br/><br/>Follow us on: <br/><br/>Facebook: https://www.facebook.com/WHATgamesOfficial/<br/>YouTube: https://www.youtube.com/channel/UCdYDfC-K4vtEQGkh7hY--0w <br/>LinkedIn: https://www.linkedin.com/company-beta/18157777/ <br/><br/>This app may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>End-User License Agreement: www.what.games/eula <br/>Privacy Policy:  www.what.games/pp<br/>Terms of Use: www.what.games/tos", "metacritic": null, "released": "2014-07-17", "tba": false, "updated": "2019-10-22T14:33:23", "background_image": "https://media.rawg.io/media/screenshots/14f/14f4e0794b71d11d21aa4cfd77be2636.jpg", "website": "http://www.what.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WHAT"], "genres": ["Action", "Adventure"], "publishers": ["WHAT"], "esrb_rating": "Everyone 10+"}