{"id": 286619, "slug": "block-puzzle-jigsaw-puzzle", "name": "Block Puzzle - Jigsaw Puzzle", "name_original": "Block Puzzle - Jigsaw Puzzle", "description": "Block Puzzle - Jigsaw Puzzle is a classic puzzle game and totally free. You can enjoy it anytime and anywhere , no need of WIFI or data.<br/><br/>It's simple and easy, just drag and drop and fill up all the grids. But once you play it, you will be addicted to this block puzzle.<br/><br/>The goal of this game is to place blocks to eliminate a whole row or a whole column on a vertical or horizontal line on the grid. The more blocks you remove, the higher the score you will get. Remember that if there is no extra space in the grid then the game is over.<br/><br/>How to play:<br/>- Drag the block onto the pad<br/>- Try to put them all in rows or columns<br/>- The more block you eliminate at once, the higher scores you will get<br/>- If the grid cannot put the new block below, the game will end<br/>- block puzzle can not be rotated<br/><br/>Features:<br/>- Classic block puzzle<br/>- Simple but fun <br/>- Various themes:color,glow,wood,jewel <br/>- Leaderboards to see your friends and competitors.<br/>- 8*8 and 10*10 jigsaw mode<br/><br/>From now on, Let's enjoy a simple and addictive block puzzle game! once you start, you'll be hooked!<br/><br/>Block Puzzle - Jigsaw Puzzle Subscription Terms:<br/>- Remove ads and vip exclusive benefits per day for one week is $2.99 USD per week.<br/>- All prices are subject to change without notification. We occasionally run promotion prices as incentives or limited time opportunities for qualifying purchases made during the promotional time period. Due to the time sensitive and promotional nature of these events, we are unable to offer price protection or retroactive discounts or refunds for previous purchases in the event of a price reduction or promotional offering.<br/><br/>- Payment will be charged to iTunes Account at confirmation of purchase.<br/><br/>- Subscription automatically renews for the same price and duration period as the original package unless auto-renew is turned off at least 24-hours before the end of the current period<br/><br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package.<br/><br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase.<br/><br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information.<br/><br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period.<br/><br/>-When you cancel the subscription,all the privilege you are entitled to will be invalid<br/><br/>Please see the \"Privacy Policy\" at：https://sites.google.com/site/mindgolimitedgameprivacypolicy/<br/><br/>And the \"Terms of Use\" at：https://sites.google.com/site/mindgotermsofuse/", "metacritic": null, "released": "2018-12-30", "tba": false, "updated": "2019-10-22T14:33:21", "background_image": "https://media.rawg.io/media/screenshots/ac9/ac98a3dd1481e4f08b587df74cddbbe4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindgo"], "genres": ["Board Games", "Puzzle"], "publishers": ["Mindgo"], "esrb_rating": null}