{"id": 2868, "slug": "pacific-fleet", "name": "Pacific Fleet", "name_original": "Pacific Fleet", "description": "\"It really has too much detail and logic to be dismissed as an arcade game.\"<br/>- Neal Stevens, subsim.com<br/><br/>\"One of six games you should have played in 2013 (but probably didn't).\"<br/>- Owen Faraday, pockettactics.com<br/><br/>Pacific Fleet is turn based game set upon a detailed simulation depicting naval warfare during World War II.<br/><br/>Check out the full game trailer at:<br/>http://www.youtube.com/watch?v=8k7dq_0fPPc<br/><br/>Features:<br/>- All new graphics depict the greatest war at sea in stunning full 3D<br/>- Historically based ships, aircraft, weapons and dozens of ship upgrades<br/>- A unique blend of deep strategic planning combined with quick tactical decisions<br/>- Play as the US Pacific Fleet or Imperial Japanese Navy<br/>- 90 combat zones to battle through on your way to victory<br/>- Single Battle and Multiplayer Hotseat modes<br/>- Complete 44 achievements<br/>- Sink ships with realistic buoyancy physics, not with hit-point bars!<br/>- Submarine warfare and carrier operations with dive bombing and torpedo bombers<br/>- Dynamic weather, shore bombardments and night engagements<br/>- Target specific ship subsystems to sink or cripple the enemy<br/>- 17 playable ships<br/>- 8 playable aircraft<br/>- Random ship placement, wind, weather and night engagements make each play-through unique<br/>- NO ADVERTISEMENTS. NO IN APPS. ONE PRICE = FULL GAME.<br/><br/>Join us on Facebook for latest news and ongoing discussion with the developer:<br/>http://www.facebook.com/pages/Pacific-Fleet/313315455431274", "metacritic": null, "released": "2012-09-20", "tba": false, "updated": "2019-08-02T06:03:12", "background_image": "https://media.rawg.io/media/screenshots/a13/a1340004a9eb0ea7ea128edd08746d46.jpg", "website": "http://www.youtube.com/watch?v=8k7dq_0fPPc", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Killerfish Games"], "genres": ["Action", "Simulation"], "publishers": ["Killerfish Games"], "esrb_rating": null}