{"id": 286990, "slug": "the-anima-island-demo", "name": "The Anima Island DEMO", "name_original": "The Anima Island DEMO", "description": "This game is available both in English and Spanish.\r\n<p>Twitter - Facebook - Tumblr</p>\r\nIn the midst of a quiet and peaceful island, strange creatures begin to arise and awake all of its inhabitants' questions. Intelligent and human-like, they will spark a young woman's curiosity, who will dig deep into their origins and motivations to understand who they really are.\r\nAbout this demo\r\n<p>This is a demo which contains about 10 minutes of gameplay that represent the first scene in the story. </p>\n<p>You will play as a female protagonist, a young vlogger that just heard rumours about some mysterious sightings in a nearby forest and is more than ready to head in and take a look at what's happening around. </p>\n<p>This demo contains no voice acting, but you can activate auto-voicing by pressing V. The rest of the controls are easy and you'll be able to play with just a mouse.</p>\n<p>I would love to hear your thoughts about the game, so feel free to share them on your personal blog or do a video about them! Gameplays are more than welcome :)</p>\r\nThe future of The Anima Island\r\n<p>This VN is currently in progress and there is no release date planned yet.</p>\n<p>The completed game will feature multiple endings, optional branching routes that will let you learn more about the Island and its characters, and a true end. </p>\n<p>These are some of the features that will be improved and implemented in the final version:</p>\n<ul><li>Improved (cooler) user interface.</li><li>Improved sprites and CGs, as well as a CG gallery.</li><li>Improved sound effects, as well as character voice beeps.</li></ul>\n<p>If you'd like to suggest anything else, then by all means - please do so!</p>\n<p>Because this is a project I'm doing pretty much on my own and I want to pay every other person that is involved in it for their work, I would truly appreciate any kind of support. You can find me at Ko-fi and I have an online store, too (it's got TAI merch!).</p>\r\nSpecial thanks\r\n<ul><li><strong>Alessandro \"Somax\" Melaiu</strong>, for his support and help in TAI's plot and development.</li><li><strong>EternalSushi</strong> [YouTube], for the wonderful music he composed for TAI.</li><li>...and to everyone who's been following and supporting the project thus far!</li></ul>\n<p>I sincerely hope you enjoy your first steps into the Island 💙</p>", "metacritic": null, "released": "2019-01-23", "tba": false, "updated": "2019-01-25T03:58:53", "background_image": "https://media.rawg.io/media/screenshots/705/70586ccf192ae284491d8aeda7a307af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["siplick"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}