{"id": 286986, "slug": "deathbound-workaround-games", "name": "Deathbound (Workaround Games)", "name_original": "Deathbound (Workaround Games)", "description": "<p>Deathbound é um Action-RPG 3D com elementos de Rogue Lite ambientado na idade das trevas. O jogador irá controlar uma criatura sem forma própria, mas que é capaz de absorver a essência de heróis mortos em batalha e transformar-se neles para enfrentar combates desafiadores. Na busca para entender sua própria origem, acaba encontrando na consciência desses heróis um novo propósito para lutar!<br/></p>\n<p>Deathbound não tem a intenção de competir com Dark Souls, mas sim de trazer novos conceitos para os fãs do gênero criado por ele, aumentando a variabilidade do gameplay ao longo da aventura, criando situações onde o jogador terá que se adaptar a diferentes estilos de combate.</p>\n<p>Deathbound também conta com elementos de gameplay que remetem à Rogue Legacy, como personagens gerados proceduralmente com morte permanente, e Trine com a transformação em múltiplos personagens, com estilos de jogo diferentes.</p>\n<p>Entre algumas features do jogo destacamos a possibilidade do jogador absorver a essência de personagens que encontrar no caminho e se transformar neles inclusive durante ataques, variando dinamicamente o estilo de combate. Estes personagens serão gerados proceduralmente com diferentes estilos de combate, armas e visuais, e uma vez que o jogador morra com um personagem, ele é perdido permanentemente. O Jogador pode ter até 4 personagens simultaneamente, e pode ir alternando entre eles, de acordo com as situações do combate. O jogador também poderá absorver o fragmento da essência dos inimigos que derrotar e invocá-los para ajudar no combate com um dos seus ataques.</p>", "metacritic": null, "released": "2019-01-23", "tba": false, "updated": "2019-01-25T03:58:20", "background_image": "https://media.rawg.io/media/screenshots/2c0/2c061600096885347477dbec655cd521.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Workaround Games"], "genres": [], "publishers": [], "esrb_rating": null}