{"id": 287147, "slug": "some-stock-game", "name": "Some Stock Game", "name_original": "Some Stock Game", "description": "<p>A school project developed by Dexter Truong, Tianyao Liu, John Yue, Nicola Battista</p>\n<p>A competitive 2-4 player game. Your objective is to make $1000000 in hard cash before anyone else does!<br/>To do this, you must trade in stocks belonging to 4 different companies. <strong>The more money invested into a company, the faster their stock will grow!</strong><br/>However, each company also has its own unique perks! Purchasing the companies' different services gives you the power to make even more money, or completely destroy the market!<br/>There are two modes: <strong>Monthly Review Mode</strong>, which only allows players to make decisions at the start of every month, and <strong>Panic at the Exchange Mode</strong>, where if you don't keep up, the market will leave you in the dust!</p>\n<p><strong>Controls:</strong></p>\n<p>This game supports 1 keyboard player and up to 3 Xbox controller players.</p>\n<ul><li>Select Button - Arrow Keys (keyboard), Left Circle Pad (controller)</li><li>Confirm Button - Z (keyboard), A Button (controller)</li><li>Back Button - X (keyboard), B Button (controller)</li></ul>\n<p><strong>Objective: </strong>Make $1000000 in liquid money.</p>\n<p><strong>Buying and Selling Shares:</strong></p>\n<ul><li>Each of the 4 companies has its own stock. </li><li>By buying shares from a company, you also invest in it. </li><li>The more collective investment a company gets, the faster its share will rise in price. </li><li>When you sell a share, you'll get money equal to its current value.</li><li>The stock of a company also affects the potency of their services.</li></ul>\n<p><strong>Companies and Services:</strong></p>\n<p>The 4 companies have vastly different services that players can use for a cost proportional to the money they have on hand.<br/>These services increase in potency the higher their stock.</p>\n<ul><li>Dexter Explosives Ltd. - Sabotage Company Share (reduce the value of a company's share), Sabotage Company Growth (reduce a company's growth rate)</li><li>Tian Insurance Inc. - Insure Money for 30 Days (temporary mitigation against goon squad attacks on money), Insure Shares for 30 Days (temporary mitigation against goon squad attacks on shares)</li><li>John's Goon Squad - Attack Player Money (directly reduce a player's liquid money), Attack Player Shares (directly reduce a player's number of shares)</li><li>Bubba-Bemoney Dividend Fund - Deposit (deposit money in the fund to receive money over time), Withdraw (withdraw your deposit)</li></ul>\n<p>May the most ruthless trader prevail!</p>", "metacritic": null, "released": "2019-01-22", "tba": false, "updated": "2019-01-25T04:21:15", "background_image": "https://media.rawg.io/media/screenshots/ad0/ad0551fbfcb1525eedf87facc49f432a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tian nya"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}