{"id": 287263, "slug": "the-customers-always-an-asshole", "name": "The Customer's Always an Asshole", "name_original": "The Customer's Always an Asshole", "description": "<p><strong>The Customer's Always an Asshole</strong><br/></p>\n<p>We all know the frustration of the supermarket. The store is full of people, searching for the stuff you need takes forever and in the end you find out that your product is gone. The waiting line is endless and the cashier has bad attitude. You’re looking for revenge but don’t know what to do. Well, look no further! In “The Customer’s always an Asshole” it is payback time and you’re dismantling a supermarket in any and every possible way. You’re all by yourself throwing around punches and kicks showing them inventory who’s boss. But it get’s better! This time, money is not an issue. Instead of your regular shopping trip, trying not to break anything, you’re encouraged to go full berserk and do as much damage as possible. Everything you destroy ends up on your bill - the bigger the better!</p>\n<p><strong>Controller:</strong><br/><strong>Navigate: Left Stick<br/>Punch: A<br/>Kick: B<br/>Ultimate: Y<br/></strong></p>\n<p><strong>Keyboard:</strong><br/><strong>Navigate: Arrow Keys or WASD<br/>Punch: Left Mouse Click<br/>Kick: Right Mouse Click<br/>Ultimate: Middle Mouse<br/></strong></p>\n<p>We just released an update.</p><p><strong>Update Notes:</strong></p><ul><li>Menu now controllable with both, mouse and controller</li><li>Smoother controlls for the fighting moves. Moves don't get stuck anymore.</li><li>You can now save more than one screenshot. Before there was an issue with the file names.</li><li>Controll scheme for fight moves is visible in the lower right corner of the UI</li></ul><p>We hope you enjoy the game.</p>", "metacritic": null, "released": "2019-01-21", "tba": false, "updated": "2019-01-25T04:37:22", "background_image": "https://media.rawg.io/media/screenshots/6b3/6b32109e25297d39c1c1018c50e8928e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Farry1"], "genres": ["Action", "Simulation", "Fighting"], "publishers": [], "esrb_rating": null}