{"id": 287327, "slug": "first-snow", "name": "First Snow (itch)", "name_original": "First Snow (itch)", "description": "Having moved away from her friends and family to attend community college, Allison Merlo is a fresh student struggling with the day to day challenges of life.<br/><br/>Faced not only with living independently for the first time, but also having to get past her nerves to find new friends in an unfamiliar environment, she finds herself falling in with a group of eccentric writers and artists.<br/><br/>As she pushes through this new stage in her life, the art of the cold and enigmatic Eileen Turner takes her attention, setting her on a course she never expected.<br/><br/>First Snow is a prequel spinoff of the currently unreleased visual novel Twofold, focused on Allison and Eileen's first months in community college in the leadup to Christmas, and the many varied people who surround them.<br/><br/><br/><br/><br/>A freshman just out of high school, Allison is still adapting to life in college. Grades aren't a problem for her, but living away from home and family, surrounded by strangers, fills her with an unshakeable feeling of loneliness. Though she's a sweet girl who tries to be kind to everyone she meets, her quiet personality hasn't made it easy to find new friends. Nevertheless, things are beginning to change.<br/><br/><br/>Eileen likes spending her time alone, so she doesn't care much about finding friends. Her cold and brusque demeanor makes sure that most aren't interested, anyway. Focusing instead on her pursuit of art, she's set up shop in an old, seldom-used art room in one corner of the campus to improve her painting skills. Hardly anyone enters her space but her, and she prefers it that way.<br/><br/><br/>Loud, energetic and always excited, Caprice has quickly become recognized in the art department as a somewhat strange girl. This doesn't bother her any. She's never been the type to let others' opinions get her down. After sitting next to Allison in life science class, Caprice decided the two of them must be friends. Extrovert and introvert, the two get along surprisingly well.<br/><br/><br/><ul><li>A charming papercraft style that persists through to all aspects of the game, from the character sprites to the custom UI!<br/></li><li>A comprehensive extras gallery, showcasing CGs as well as guest art from numerous talented artists!<br/></li><li>A totally original soundtrack!<br/></li><li>An engaging girls' love romance story by Suriko, a writer of the visual novel Katawa Shoujo! <br/></li><li>100% free!</li></ul>", "metacritic": null, "released": "2019-01-20", "tba": false, "updated": "2020-08-27T22:29:07", "background_image": "https://media.rawg.io/media/screenshots/faf/faf9cf7a7733fa645ba50683f999596e.jpg", "website": "https://firstsnow.salty-salty-studios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["Salty Salty Studios", "furimari"], "genres": ["Casual", "Indie"], "publishers": ["Studio Élan"], "esrb_rating": null}