{"id": 287373, "slug": "deck-of-ashes", "name": "Deck of Ashes", "name_original": "Deck of Ashes", "description": "<p>&quot;The Outcasts brought Ash Curse upon us all, and they are the only ones who can lift it.&quot; - Ash Master.<br />\nDeck of Ashes is an adventure rogue-lite game with thoughtful and tactical card battles. Lead the cast of antiheroes on a quest for redemption. Explore the dark fantasy world. Complete quests and collect cards for your unique Battle Deck. Put your survival and resource management skills to the test when upgrading your Camp of allies.<br />\nThe choices that drive your journey - where to go, which resource to collect, which risk to take, and which card to craft - are the difference between success and untimely demise.<br />\nCan you rid the world of the Ash Curse?Features<br />\nCreative deck-building - collect combat cards that fit your unique playstyle and crush the enemy!<br />\nUnique hand-drawn eerie art style.<br />\nDynamic dark fantasy world - travel through a procedurally generated, changing world in search for cards, supplies and glory!<br />\nVarious biomes that harbour different monster classes - each biome affects the gameplay and offers a unique set of opponents!<br />\nSurvival and resource management - you have limited opportunities to restore health or spent cards, so use them wisely!<br />\nCamp - strategically improve your base depending on your style of play.<br />\nPermadeath - unless you use the help of dark magic, then when you die, you die for good.Deck-building done right<br />\nWe provide you with the best deck-building tools we could develop. If you are a newbie - we got you covered, as there are sets of cards that obviously work well together. And if you are ready to go crazy with your own deck idea, there is a 100+ cards for each character to explore and combine. BEWARE: a ton of potential to go nuts with the unexpected combos!Dynamic and dangerous world<br />\nDeck of Ashes features a procedurally generated world where danger waits around every corner. Sudden ambushes, cataclysms, and random events will force you to constantly adapt and explore fleeting opportunities to gain an edge! Refine your strategy on the go to ensure your survival!Upgrade the Camp to meet your needs<br />\nDifferent strategies require vastly different upgrades of your Camp. The resources are scarce, and you won&#39;t be able to upgrade everything in one playthough, so choose wisely!</p>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2023-10-30T05:27:18", "background_image": "https://media.rawg.io/media/screenshots/5a6/5a6edb7709138853825bf2be4d2f0a6b.jpg", "website": "https://aygamesco.com/", "rating": 3.11, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 95, "beaten": 2, "toplay": 22, "dropped": 10}, "playtime": 2, "achievements_count": 86, "ratings_count": 17, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC"], "developers": ["AY Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["AY Games"], "esrb_rating": null}