{"id": 287338, "slug": "zaero-for-quake-ii", "name": "Zaero for Quake II", "name_original": "Zaero for Quake II", "description": "<p>After the industrial and military superstructures had been destroyed, and the fires were reduced to smouldering embers, the earth military began the unceremonious task of looting alien resources, specifically the rare and valuable energy crystal deposits. An Extraction Plant was hastily constructed to the pillage the mines and storage depots in the Kandi mountains southeast of the Stroggos capital Cerberon.</p>\n<p>With their Makron leader dead the unorganized Strogg could offer nothing more than passing resistance. The cities and their remains closed up like hermit crabs, hoarding what little resources they had, to prepare for the day when they would again fiercely defend their ground. The earth forces had no interest in attacking these fortified cities. The enemy had retreated and now the victor was stealing its meat.</p>\n<p>Several tense earth years passed with the two races sharing breathing space. The human base was designed for quick evacuation at the earliest sign of hostility. The plan was to take as much as we could carry before the aliens regrouped and drove us from the planet. After abandoning the Extraction Plant, the earth forces would flee back to earth with a brimming load of Steedium, closing the galactic portal behind them. But the Stroggos home world is vast. There are plenty of places to hide and lick wounds while longing for bitter retaliation.</p>\n<p>Like a bonfire fueled by the heavens, the main Mining Facility suddenly erupts into flames, filling the inside of your cockpit with a searing light...</p>\n<p>&quot;Shit!&quot; you cry, swerving the jet off to the side to avoid collision with the huge wall of fire. As you whip your head around to make sure of what just passed by, you know the time has finally come: the Strogg are retaliating.</p>\n<p>Life on Stroggos had been fairly quiet since the War, but you were never completely comfortable being stationed here with a colony of researchers, scientists, and military personnel, here only to harvest the planet&#39;s valuable power crystals, Steedium. Although no one expected this business endeavour to be a free ride, they certainly weren&#39;t prepared for what was in store...</p>\n<p>A klaxon went off down below on the Colony Complex, and a voice comes across your radio headset, &quot;Attention all personnel: proceed to shuttle pad for emergency evacuation. Repeat, proceed to shuttle pad for emergency evacuation.&quot;</p>\n<p>&quot;What&#39;s the situation down there?&quot; you call over the radio, making a sharp pass down toward the Complex, joined by the remains of your fighter unit.</p>\n<p>&quot;We&#39;re abandoning the Complex, soldier,&quot; Commander Kelvin replied. &quot;We have problems, though,&quot; he continued. &quot;The Strogg have set up a security barrier around this entire sector. Nothing is getting out. We can&#39;t penetra..atm..sphere until what... is generat... it is shut down.&quot; Radio contact was breaking up.</p>\n<p>&quot;Sir,&quot; one of your unit fighters calls in, &quot;I got high energy readings at five o&#39;clock.&quot;</p>\n<p>&quot;Copy Zaero-2,&quot; you reply, circling the Complex. &quot;Follow my lead.&quot; Elsewhere, almost secluded by the mountains lies a large Satellite dish, perched atop the rocks. It seemed odd that no one had ever noticed it before, even more so that it was there, in the middle of nowhere. Where did it come from?</p>\n<p>&quot;Target acquired,&quot; Zaero-2 announced, coming into position along the rest of the fighter unit.</p>\n<p>&quot;Roger Zaero-2,&quot; you reply, targeting the Satellite Dish on your display screen. &quot;On my mark...&quot;</p>\n<p>Down below, parallel to the Satellite Dish, a tower emerges from the rock, revealing a Strogg-manned cannon, spinning around to face the fighter jets. It soon stops, then fires up at the unit.</p>\n<p>&quot;Incoming! Three o&#39;clock!&quot; Zaero-3 shouts. &quot;Evasive act..&quot; Zaero-3 took the hit, careening into his wingman and clipping your tail, which sends you spinning uncontrollably to the ground. The scream of tearing steel fills your ears.</p>\n<p>&quot;Zaero Unit,&quot; Commander Kelvin&#39;s voice calls out from your displaced radio headset in a pile of debris that was once your fighter jet. &quot;If anyone can hear this, you&#39;re our only hope. Shut down energy field generator....don&#39;t know how long we...&quot;</p>", "metacritic": null, "released": "1998-01-01", "tba": false, "updated": "2019-02-10T20:28:59", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1fb7ad14dfa3fa4e57dde25d34a4b51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Team Evolve"], "genres": ["Shooter"], "publishers": ["Macmillan Digital Publishing USA"], "esrb_rating": null}