{"id": 287452, "slug": "puzzle-fruit-tap-block-games", "name": "Puzzle Fruit - Tap Block Games", "name_original": "Puzzle Fruit - Tap Block Games", "description": "Pop Fruit :) is a picture exquisite, well-made,easy to play elimination game. <br/>Just click on two or more fruits to remove them. As a simple entry game, is very suitable for leisure time leisure, but to play a high score or need a lot to start your brain. <br/>The more fruits you remove each time, the more points you get.<br/>If you can eliminate all the fruit box, then the end of the game you will get more reward points. <br/>Once the game on the line, it swept the world, has been on the billion players! Once started, do not stop! <br/>The game set a rich daily landing reward, pleasantly surprised, a lot of Gifts, is to pass the time, the best choice for leisure and entertainment.<br/><br/>Game features<br/>- Click on two or more fruits of the same color to eliminate<br/>- The higher the fruit score is, the more it is removed at one time<br/>- The lower the remaining fruit, the higher the score obtained<br/><br/>Basic play<br/>[Classic games are played]<br/>Very classic way to eliminate, just click or two or more of the same color of fruit can be eliminated, there is no barrier restrictions. So that players happy a consumer in the end.<br/>[Fruit box]<br/>\"PopStar\" and \"Tetris\" the perfect combination of creativity and the birth of the classic pure joy! Simple and fun to play, just a variety of shapes to fill a row of fruit or a row to complete the elimination. Only need to download a game, you can experience two games are played, how to eliminate will be happy to double!", "metacritic": null, "released": "2017-01-19", "tba": false, "updated": "2019-10-22T14:33:41", "background_image": "https://media.rawg.io/media/screenshots/820/8208e59d243ed86bdc18351fdd96e6ed_4uKcEd2.jpg", "website": "http://letendo.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["War Games"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["War Games"], "esrb_rating": "Everyone 10+"}