{"id": 287444, "slug": "the-war-of-genesis", "name": "The War of Genesis", "name_original": "The War of Genesis", "description": "Go to war against fearsome monsters and the armies of Dark Armor to reclaim the continent of Antaria. <br/>Experience captivating stories and become a true hero in a new strategy MMORPG!<br/><br/>BATTLE WITH POWERFUL HEROES AND MACHINA<br/>- The War of Genesis features a large cast of heroes with unique abilities to adventure with.<br/>- Control ancient Machina: Devastating machines of war that can turn the tide of battle.<br/><br/>STRATEGY FOCUSED GAMEPLAY<br/>- Battle using your ideal party of different Airships/Machina/Heroes!<br/>- Customize your characters with different items and skills to suit your personal strategy.<br/>- Research technologies to unlock new Airship capabilities and become the best captain!<br/><br/>PvE &amp; INTENSE REAL-TIME PvP<br/>- Perfect your strategy by hunting various monsters.<br/>- Defeat raid bosses and fend off dark forces! <br/>- Battle players around the world in intense, real-time war PvP!<br/><br/>EXPANSIVE MMORPG GUILD SYSTEM<br/>- In this MMORPG, don’t adventure alone! Strengthen your forces by joining a guild!<br/>- Assemble your fleet and warp into intense battles!<br/>- Upgrade your guild base and defend your territory from other guilds.<br/><br/>MMORPG ECONOMY SYSTEM<br/>- Joining a guild makes you a shareholder! Invest and help your guild grow.<br/>- Collect resources to help your guild dominate!<br/>- Obtain valuable items with the trade system and always be war-ready!<br/><br/>MAKE YOUR OWN ADVENTURE<br/>- Create your own epic quests, side stories, and secret histories with custom story mode!<br/>- Share your creations with your friends and fellow players around the world.<br/>- The best custom adventure will be featured as a monthly best!<br/><br/>Access Authorizations in JOYCITY Games<br/>- Camera authorization is required to customize your admiral portrait image.<br/><br/><br/><br/>**By downloading this game, you are agreeing to our Terms of Service and Privacy Policy.**<br/><br/><br/>Like us on Facebook: https://www.facebook.com/thewarofgenesis<br/>Customer Support: https://gnss.zendesk.com/hc/en-us<br/>Terms of Service &amp; Privacy Policy: http://policy.joycity.com/en<br/><br/><br/>The price of monthly subscription is $9.99.<br/>Machina Speed up +10% , hero attack in monster combat +5%, hero defense in monster battles +5% during hunting while subscribed.<br/><br/>Please note:<br/>1) Payment will be charged to your iTunes Account at confirmation of purchase.<br/>2) Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. <br/>3) Your account will be charged for renewals within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>4) Subscriptions may be managed by the user and auto-renewal may be turned off by going to your Account Setting after purchase<br/>5) The subscription will be renewed within 24 hours of the monthly payment date. The subscription effective dates may be subject to change every month.", "metacritic": null, "released": "2019-01-24", "tba": false, "updated": "2019-10-22T14:33:40", "background_image": "https://media.rawg.io/media/screenshots/c90/c90365f4806ebbde7ac498436b97f8ab.jpg", "website": "http://thewarofgenesis.joycity.com/en", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JOYCITY Corp"], "genres": ["RPG", "Strategy"], "publishers": ["JOYCITY Corp"], "esrb_rating": "Teen"}