{"id": 287463, "slug": "bubble-shooter-puzzle-games", "name": "Bubble Shooter - Puzzle Games", "name_original": "Bubble Shooter - Puzzle Games", "description": "Pop, match and blast bubbles to save baby squirrels! <br/><br/>Play Free! No Network Required! Fluent shooting experience!<br/><br/>Play the brand new exciting bubble shooting puzzle game and enjoy an amazing tour in the magic woods. Baby squirrels were kidnapped by Big Wolf and trapped in special bubbles. You need to plan every pop and burst colorized bubbles to get them out!<br/><br/><br/>Features:<br/>- New levels will be added every week.<br/>- Super easy to pick up and play! Applicable to Any Ages!<br/>- To Kill the Boring Time! <br/>- The levels will get harder gradually and you’ll never get bored.<br/>- Beautiful graphics and cool animations.<br/>- Four different dramatic Boosters that help you win the game. The Boosters are all easy to master!<br/>- Smooth and perfect operation of the game! Fluent shooting experience!<br/>- Free download and free level updates!<br/><br/><br/>How to play ? <br/>- Move your finger to the target, aim, and shoot!<br/>- Match 3 or more Bubbles to Burst!<br/>- Burst all the bubbles to rescue baby squirrels and try to get more score on each puzzle.<br/><br/>Please Note:<br/>-While the game is free to download and play, some in-game items and functions can be purchased for real money.<br/>- Any time at Any Place! The game is an off-line game, so No Network Required!<br/><br/>The game makes a commitment developing your brain and exercise your fingers! It will get much relaxation and happiness! <br/>Start an adventure to rescue cute squirrels and collect shiny pinecones NOW !<br/>You will find it so addictive! <br/><br/>For every 5 levels you pass you earn coins. But no need to worry, the first coins are on us! Use the coins to buy fireballs and bombs by simply tapping on them. <br/><br/>So get ready, take aim and shoot bubbles!!", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-07-30T00:45:29", "background_image": "https://media.rawg.io/media/screenshots/344/344582790c997c675b963e4b285cd3e9_Sx3ssyf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JUNWEI ZHONG"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["JUNWEI ZHONG"], "esrb_rating": "Everyone 10+"}