{"id": 287445, "slug": "rage-of-kings", "name": "Rage of Kings", "name_original": "Rage of Kings", "description": "My lord, enemies are closing in! They want your land, your gold and your crown! We need you to lead us, raise a massive fantasy army, and crush our enemies once and for all!!!<br/><br/>◆ CITY<br/>- Construct and upgrade your castle, farms, army barracks, hospital, and more, all to ensure you can survive severe PvP &amp; PvE attacks.<br/>- Research and forge FAST for cutting-edge tactics and armor.<br/>- Craft new equipment sets, and equip magical items such as Silver Knight Armor to increase attributes.<br/>- Increase your stats with the college, and research technologies.<br/><br/>◆ CONQUEST<br/>- Sweep the battlefield in huge real-time PvP matches!<br/>- Vanquish roaming monsters for their treasures, from horrific White Walkers to massive Giants.<br/>- Attack other player’s castles to plunder their resources and climb the power rankings!<br/><br/>◆ RESOURCES<br/>- Wisely deploy resources to ensure you always have enough to sustain your city and army.<br/>- Break up the Fog wisely in order to find and gather more precious resources than other lords.<br/>- A cunning emperor will not depend solely on his own production, but will venture through his castle gates to raid and lay siege to rival castles to supplement his needs. <br/><br/>◆ ALLIANCE<br/>- Forge diplomatic and strategic alliances with global players all in real time.<br/>- Befriend, duel and chat with players from globe in real-time.<br/>- Talk &amp; strategize with your alliance members in Global Chats - Alliance Chat, 1 on 1 Chat, or Chat with the entire world.<br/>- Rally together to take down enemies you could never face alone!<br/>- Assist one another to speed up the progress of buildings and research.<br/>- Share and expand the Field of View (FOV) with allies and get an even wider FOV by joining an alliance.<br/><br/>◆ THRONE BATTLES<br/>- Attack and occupy the Throne to become the King.<br/>- Become the King and rule the kingdom. Repay your allies and destroy your enemies.<br/>- Give buffs and special titles to players in your kingdom, as well as kingdom buffs.<br/>- Grow your city, protect it from the threat of evil lords, and mark your rightful place in the history books as a true King!<br/><br/>◆ VISUAL FEAST OF MIDDLE EARTH<br/>- Immerse yourself in the dark world of fantasy and myth.<br/>- Amazing environment with Day/Night Mode on local time.<br/>- Spectacularly animated RTS battles.<br/>- A medieval fantasy world shrouded in Fog awaits you to discover it.<br/>- Knights, Elves, Dragon Warriors, Toxic Manticores and more incredible creatures await you on the battlefield!<br/><br/>◆ MMO REAL TIME STRATEGY WAR GAME<br/>- THIS is a game you won’t be able to put down as your screen will constantly be lit up with new battles, chats, campaigns, upgrades and new kingdoms which are opening all the time. <br/>- If you like multiplayer strategy games, you’ll love this game where you must fight to survive!<br/><br/>Enemies or Friends? Repay or exact Revenge？My lord, download Rage of Kings and start building your realm now! Rule the lands in the action packed world of Rage of Kings.", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2019-10-22T14:33:40", "background_image": "https://media.rawg.io/media/screenshots/f01/f01bc0ec95d71f3e9b40be310f57d770_saLL8AO.jpg", "website": "https://www.facebook.com/RageofKings/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["liu chong"], "genres": ["Strategy", "Simulation"], "publishers": ["liu chong"], "esrb_rating": null}