{"id": 287443, "slug": "aion-legions-of-war", "name": "Aion: Legions of War", "name_original": "Aion: Legions of War", "description": "Witness the mobile game revolution!  Aion: Legions of War is the first strategy RPG to combine visceral gameplay, breathtaking console quality graphics, and massive-scale battles to deliver an unparalleled gaming experience on your device. <br/><br/>Embark on a journey to unravel the secrets that lay within a war torn AION universe, and experience a story ripe with discovery, vengeance and redemption as it unfolds across stunning cinematics in the palm of your hand.<br/><br/>Amass powerful heroes to lead your Legion against players around the globe to battle for glory!  Engage in epic 20-hero raids where teamwork is key, or challenge the world to competitive combat in the Duel Arena.<br/><br/>FEATURES<br/><br/>Astonishing Visuals<br/>• Console-quality graphics never before seen on mobile<br/>• Witness stunning in-game graphics and fully rendered cutscenes, along with spectacular heroes, abilities and worlds to explore<br/><br/>Massive Multiplayer Battles<br/>• Dominate your enemies across vast and diverse battlefields - global tournaments, co-op raids, guild matches and more<br/>• Pit your heroes against fire-breathing dragons in 20-character raids, and put the power of your Legion to the test!<br/> <br/>Build the Ultimate Legion<br/>•100+ heroes to discover and collect - armored warriors, monstrous beasts, colossal cyborgs, and more<br/>• Differentiate your heroes to build an invincible Legion to stand against all enemies!<br/><br/>Intense Strategic Gameplay<br/>• Amass powerful tanks, devastating damage dealers and protective healers from your Legion and dominate your enemies with overpowering strategy<br/>• Time your special attacks with precision to counter enemy onslaughts<br/><br/>Dynamic Hero Progression<br/>• Harness the power of Awakening to unleash powerful hero transformations and hidden abilities, build teams based on affinity to gain the advantage<br/>• Deck out heroes with a plethora of equipments, such as legendary weapons, armor and accessories, to create undefeatable champions<br/><br/>A New Generation of Aion<br/>• Reimagining of the megahit PC MMORPG franchise - Aion - in an all new mobile adventure! <br/>• Mobile exclusive story -- Encounter an original story where an ominous villain threatens the delicate balance between two warring races, Elysea and Asmodae.", "metacritic": null, "released": "2019-01-24", "tba": false, "updated": "2019-10-22T14:33:40", "background_image": "https://media.rawg.io/media/screenshots/6e2/6e2ec3e9d92cfc4027cc09a6482e9e5e_WHZ0Y9K.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["NCSOFT Games"], "genres": ["RPG", "Strategy"], "publishers": ["NC Interactive"], "esrb_rating": null}