{"id": 287598, "slug": "hen-racing-simulator-race-free-range-chickens", "name": "Hen Racing Simulator - Race Free Range Chickens", "name_original": "Hen Racing Simulator - Race Free Range Chickens", "description": "Not the dangerous rooster fighting but we present you the cure and gorgeous hens racing game, select the hen you like, and race her against other hens, these chickens love running and racing around, for them this racing track is <br/>designed to have fun. Race the angry free range chickens in open racing tracks. <br/>Hen/chicken racing is also a lapping game, where you have complete the laps to win whole game whether it is single race or tournament.<br/>These hens are not the broiler chickens but raised in open organic free world, these are totally wild/feral chicken, specially bred and raised.<br/><br/>Play these different type of racing using your trained pet hen.<br/><br/>1) Quick Race<br/>Get it done quickly and win it in single go. get the top free range hen trophy.<br/><br/>2) Tournament race<br/>This is a complete tournament of running chickens , where you get in to knock out style game,the one who stays last, is killed from the tournament.<br/>this hens tournament is just like other pro racing game , where where your main goal is not to get knocked out.<br/><br/>3) Bet Racing Mode<br/>Place the bets on your best chicken and run the hen you like in this race to win the maximum.<br/><br/>Features<br/><br/>* pet racing tracks for free range chickens<br/>* good 3D environment with organic chicken loving audience<br/>* Interactive GUI, one of the best<br/>* Best hen race AI", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2019-10-22T14:40:15", "background_image": "https://media.rawg.io/media/screenshots/80a/80ad56370d2dfeb57cb57c11e2fc318a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atif Mumtaz"], "genres": ["Simulation", "Racing"], "publishers": ["Atif Mumtaz"], "esrb_rating": null}