{"id": 287522, "slug": "tic-tac-toe-x0-game", "name": "Tic Tac Toe - X0 Game", "name_original": "Tic Tac Toe - X0 Game", "description": "Synonyms of this game name:<br/>- Tick-tack-toe, tic-tac-toe, tick-tat-toe, or tit-tat-toe (United States, Canada)<br/>- Noughts and crosses or naughts and crosses (United Kingdom, Republic of Ireland, Australia, New Zealand, South Africa, Zimbabwe)<br/>- Exy-ozys, xsie-osies (verbal name only) (Northern Ireland)<br/>- Xs and Os (Egypt, Republic of Ireland, Canada, Zimbabwe)<br/><br/>More detailedly, to guarantee a draw, O should adopt the following strategies:<br/><br/>If X plays corner opening move (best move for them), O should take center, and then an edge, forcing X to block in the next move. This will stop any forks from happening. When both X and O are perfect players and X chooses to start by marking a corner, O takes the center, and X takes the corner opposite the original. In that case, O is free to choose any edge as its second move. However, if X is not a perfect player and has played a corner and then an edge, O should not play the opposite edge as its second move, because then X is not forced to block in the next move and can fork.<br/>If X plays edge opening move, O should take center, and then follow the above list of priorities, mainly paying attention to block forks.<br/>If X plays center opening move, O should take corner, and then follow the above list of priorities, mainly paying attention to block forks.<br/><br/><br/>When X plays corner first (best move for them), and O is not a perfect player, the following may happen:<br/><br/>If O responds with a center mark (best move for them), a perfect X player will take the corner opposite the original. Then O should play an edge. However, if O plays a corner as its second move, a perfect X player will mark the remaining corner, blocking O's 3-in-a-row and making their own fork.<br/>If O responds with a corner mark, X is guaranteed to win, by simply taking any of the other two corners and then the last, a fork. (since when X takes the third corner, O can only take the position between the two X's. Then X can take the only remaining corner to win)<br/>If O responds with an edge mark, X is guaranteed to win, by taking center, then O can only take the corner opposite the corner which X plays first. Then X can take a corner to win.", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2019-10-22T13:56:14", "background_image": "https://media.rawg.io/media/screenshots/737/73734de28214dcfd6a2c9a09c57d4362.jpg", "website": "https://www.facebook.com/Tic-Tac-Toe-X0-Game-747637482084994/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Softnoesis"], "genres": ["Puzzle"], "publishers": ["Softnoesis"], "esrb_rating": "Everyone 10+"}