{"id": 287686, "slug": "ae-bingo", "name": "AE Bingo", "name_original": "AE Bingo", "description": "Play Bingo like never before! Different kinds of exciting rooms, two game modes, more cards than any other Bingo game and also vivid bingo sounds!<br/><br/>Every game grants rewards to level up and unlock new features! More cards than any other Bingo game!<br/><br/>ARCADE BINGO EXPERIENCE<br/>AE Bingo has thrilling arcade-style gameplay features such as boosts, collection items and lots of achievements coming soon.<br/><br/>TWO GAME MODES<br/>1) Classic mode:<br/>Use tickets to buy cards and play a game. The system will call 32 numbers total. Mark the called numbers quickly! When you see any one of the winning patterns on your card, tap the BINGO button to get the bingo! Take care, bad bingos will freeze the card for some time.<br/>2) Speed Bingo mode: <br/>Bet to start a game. The system will automatically call 12 numbers and over the game. Players will get different pays if the number of bingos are different. This mode is very thrilling.<br/><br/>COLLECTIONS AND REWARDS<br/>Travel around the world through different mysterious Bingo rooms with unique collections items and get your rewards!<br/><br/>CUSTOM DAUBERS: <br/>You can customize your daubers in your profile page. A lot of special shapes can be used for your Bingo Cards. To be the fashion guy!<br/><br/>Having problems? Any suggestions? We would love to hear from you! You can reach us at support@ae-mobile.com<br/><br/>Enjoy it now and you won't be sorry!", "metacritic": null, "released": "2014-10-28", "tba": false, "updated": "2019-10-22T14:33:48", "background_image": "https://media.rawg.io/media/screenshots/622/62273e853d9cab5af7232be76960794c_VYnyCrc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AE Mobile"], "genres": ["Board Games"], "publishers": ["AE Mobile"], "esrb_rating": null}