{"id": 2887, "slug": "veggie-samurai-hd", "name": "Veggie Samurai HD", "name_original": "Veggie Samurai HD", "description": "JOIN OVER 4 MILLION VEGGIE SAMURAI PLAYERS!<br/>It&amp;#39;s time to give veggies what they have had coming for years!!<br/><br/>Feel the power at your finger tips!  Put your swordsman skills to the test as you use your fingers to slice and dice veggies of all shapes and sizes in Veggie Samurai. <br/><br/>********     NOTICE     ********<br/>Please update your iPad iOS via iTunes to the current iOS 4 prior to installing the latest version (1.4) of Veggie Samurai HD.<br/><br/>Unfortunately Apple&amp;#39;s development guidelines do not support or intend the use of backward iOS compatibility, as they do not support iOS downgrading for development and/or testing.<br/><br/>***************************<br/><br/>Veggie Samurai is an addictive, pickup-and-play action game that puts you in the heart of all-out veggie carnage.<br/><br/>******  7 DISTINCT GAME MODES  ******<br/>--- Samurai Mode - 3 Lives.  No time limit.  Avoid dropping veggies.  Avoid poison vials.<br/><br/>--- Hardcore Mode - Only 1 life.  No mistakes.<br/><br/>--- Harmony Mode - Time based.  No poison.  No lives.  More action.  More combos.<br/><br/>--- Chaos Mode - All Out veggie smack-down.  3x the pace.<br/><br/>--- Sort Mode - Selective slicing.  Only the chosen veggie shall pass.<br/><br/>--- Match Mode - Frenzied action.  Spot the matches.  Slice combos.  Use the &amp;quot;Wild Pepper&amp;quot;.  HUGE combo sizes.<br/><br/>--- Training Mode - Free play.  No time limit.  No hazards.<br/><br/><br/>******  FEATURES  ******<br/>--- Slicing AND Dicing allows you to cut up veggies multiple times (some veggies can be diced a surprising number of times...)<br/><br/>--- Watch your score skyrocket as you perform Slice Combos, Multi-Dice Combos, Dice Chains, Pea Killers, Onion Blossoms, and more!<br/><br/>--- Score big bonus points with Rare MEGA VEGGIES that can be triggered by figuring out the secret, in-game prerequisites<br/><br/>--- Keep your eyes peeled and score big points with the rare bonus veggies!<br/><br/>--- Fight for global bragging rights atop the Game Center Leaderboards<br/><br/>--- 32 Achievements and counting… (as if dicing veggies to bits wasn’t enough)<br/><br/><br/>Now go out and prove your worth as a VEGGIE SAMURAI…<br/>Veggie Samurai HD is in no way associated with Halfbrick Studios and/or the game Fruit Ninja.", "metacritic": null, "released": "2010-06-20", "tba": false, "updated": "2019-10-22T14:28:13", "background_image": "https://media.rawg.io/media/screenshots/634/6344b134bbf599f6f0fbfba413edd87f.jpeg", "website": "http://www.veggiesamurai.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["QuantumSquid Interactive"], "genres": ["Action", "Arcade"], "publishers": ["QuantumSquid Interactive"], "esrb_rating": "Everyone 10+"}