{"id": 288737, "slug": "accel", "name": "Accel", "name_original": "Accel", "description": "To escape the cyber world of ACCEL you’ll have to go beyond your limits with your spaceship. You’ve played games where you could go up and down, you’ve beaten games that made you go left and right, but in ACCEL we’re adding a new variable, 360 degrees maneuverability. Instant fun and aw guaranteed in this short but exciting adrenaline filled arcade scorer.   <br/><br/><strong>games features :</strong><br/><br/>- Control your ship through 3 levels where you will test your agility and your reflexes.<br/>- Make the highest score possible score in a scoring game with progressive difficulty.<br/>- Avoid obstacles to gain more speed and increase your score.<br/>- Choose your ship from 4 possible.<br/><br/><strong>Accel a game by objectif 3D:</strong><br/><br/>Accel is a student group project. Our school,objectif 3D-game is specialized in game conception and is located in Montpellier, France. <br/><br/>Our goal? To match students passion for video game with the expectations of recruiters. We therefore do our utmost to ensure the sustainable hiring of our students at the end of their studies : from a pedagogy based and rooted in the reality of professional practices to contacting the studios that recruit.<br/><br/>The courses, mainly based on practice and personal investment, reproduce the working conditions of production studios to provide technical know-how and professional skills. The year is punctuated by individual projects, and group projects, which make it possible to apply the knowledge acquired, develop teamwork and affirm individual skills.", "metacritic": null, "released": "2018-08-01", "tba": false, "updated": "2020-03-17T11:18:57", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd573ca84f7ea1689705b95adb508343.jpg", "website": "https://www.objectif3d.com/galerie-games-accel/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Objectif 3D - game", "Objectif 3D"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Objectif 3D - game"], "esrb_rating": null}