{"id": 288798, "slug": "steel-rats-demo", "name": "Steel Rats Demo", "name_original": "Steel Rats Demo", "description": "La version complète de Steel Rats™ est disponible sur GOG.com. Vous pouvez l'acheter ici\n<br/>\nEnfourchez votre moto pour tout démolir dans cette révolution du genre action arcade en 2,5D. Des combats à moto aussi destructifs qu'explosifs et des cascades à couper le souffle font partie du gameplay se déroulant dans un monde rétro-futuriste. Alternez entre 4 personnages aux capacités uniques, et éclatez tout sur votre passage à travers niveaux regorgeant de Ferrailleurs impitoyables !\n<br/>\n<br/>\nDevenez membre des Steel Rats, un gang de motards qui se sont jurés de protéger leur ville de l'invasion d'une armée de robots venus d'ailleurs : les Ferrailleurs. Foncez à travers des hordes d'ennemis, alternant entre quatre personnages aux capacités uniques pour tout détruire grâce à votre machine de guerre exceptionnelle : une moto lanceuse de flammes à la roue acérée. \n<br/>\n<br/>\nParcourez le monde rétro-futuriste de Steel Rats™ dans une version alternative des États-Unis des années 40. Équipez-vous et chevauchez votre destrier chromé pour sauver Coastal City de l'invasion d'une horde de Ferrailleurs. Votre moto est votre seule arme, conçue pour anéantir vos ennemis (toujours avec style) alors que vous traversez, de haut en bas et de droite à gauche, les toits et tunnels de la ville infestée.\nCaractéristiquessFoncez, tirez et envolez-vous dans un même jeu !\n<br/>\nTestez un style différent. Steel Rats™ mélange les genres comme aucun autre jeu n'a osé le faire, alliant des cascades à moto en 2,5D, de la course sur plateforme et des combats impressionnants toujours à moto.Foncez pour détruire !\n<br/>\nVotre moto est votre seule arme contre la horde de Ferrailleurs aliens. Associez combat rapproché et tirs précis grâce à tout un arsenal allant des roues aux lames acérées, au pot d'échappement lanceur de flammes en passant par des harpons. Vous trouverez sans aucun doute une méthode imparable pour abuser de ces outils afin d'anéantir vos ennemis.Roulez avec style\n<br/>\nDémarrez votre moteur et apprivoisez les commandes de votre moto pour effectuer des figures et anéantir les Ferrailleurs grâce à votre attirail d'armes et de capacités spéciales. L'imagination est clé : roulez sur les murs, abusez de backflips ou tirez en l'air la tête à l'envers !Chargez pour explorer !\n<br/>\nDécouvrez les secrets de Coastal City et dévoilez le mystère de l'invasion de Ferrailleurs. Explorez chaque niveau, trouvez tous les objets à collecter, débloquez de nouvelles zones et prenez la tête du classement.Rencontrez le gang !\n<br/>\nChoisissez l'un des quatre membres des Steel Rats pour commencer à jouer, puis alternez avec les autres à tout moment. Chaque personnage possède une capacité et une arme uniques grâce auxquelles vous pourrez démolir les hordes de Ferrailleurs.\n<br/>\n<br/>\n<br/>\nUn motard endurci originaire de Boston. Orgueilleux leader des Steel Rats, chevauchant sa moto blindée droit vers l'inconnu.\n<br/>\n<br/>\n<br/>\nNée au Brésil, elle a grandi dans les rues de Coastal City. Cette pilote intrépide laisse ses ennemis gisant dans une trainée de flammes. \n<br/>\n<br/>\n<br/>\nUn adolescent nippo-américain surdoué. Mécanicien brillant et ingénieur prodigieux.\n<br/>\n<br/>\n<br/>\nArtiste expérimenté d'un cirque itinérant allemand. Un fou à lier qui aime vivre (et conduire) dangereusement.", "metacritic": null, "released": "2019-01-30", "tba": false, "updated": "2019-07-25T21:05:31", "background_image": "https://media.rawg.io/media/screenshots/9cd/9cd5be8d69e9863ee0590083ef969fab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 69}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tate Multimedia"], "genres": [], "publishers": ["Tate Multimedia"], "esrb_rating": null}