{"id": 288740, "slug": "jump-doper-cozy-pitch", "name": "Jump Doper (Cozy Pitch)", "name_original": "Jump Doper (Cozy Pitch)", "description": "   ONE OF FOUR GAMES IN COZY PITCH PACKJump Doper is one of four short games in the Cozy Pitch Pack. Each game is a polished idea that we know can turn into something much bigger. Vote for your favorite using the in-game menus and the winner gets expanded in a sequel. Cast your vote and make your voice heard!FEATURES<br/>Test your reflexes while playing the most dangerous game of jump rope. Mess up and you’ll get sliced, don’t get sliced too much or you’re out. Reach high scores and unlock bonuses in this twitch arcade game.<br/><br/><br/><strong>PURE REFLEXES:</strong> play with one button. No multitasking. No fluff. It’s all about timing. It may sounds simple, but it’ll take some real practice to master as the rope gets faster and faster.<br/><br/><br/><br/><strong>UNLOCK CHARACTERS:</strong> Reach high scores to unlock different skins. All characters have the same stats, but for some reason we always do best with water bottle.<br/><br/><strong>LEADERBOARDS:</strong> Compete against your friends for the highest score on the online leaderboards.ISN’T THIS A FREE GAME? Yes! Kind of. There is a free beta available online and we've decided to leave it there. This Cozy Pitch Pack version has some small additions, improvements, and bug fixes. Most importantly, this is your way of showing us you want a sequel. If you like this game and want to show your support, here is your chance.COZY GAME PALS: We are a duo of experienced creatives. Bryan is the coder, he has worked on Journey, The Last of Us, and Uncharted 4. Crista is the is the artist, she has worked at Cartoon Network, Nickelodeon, FOX, and Warner Bros. We are working together as Cozy Game Pals to add variety to the types of games you can play.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:54", "background_image": "https://media.rawg.io/media/screenshots/046/04682d9f5b20c87a22e15e5f4658208e.jpg", "website": "http://www.cozypitchpack.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Cozy Game Pals"], "genres": ["Action", "Indie"], "publishers": ["Cozy Game Pals"], "esrb_rating": null}