{"id": 288728, "slug": "tokyo-snap-cozy-pitch", "name": "Tokyo Snap (Cozy Pitch)", "name_original": "Tokyo Snap (Cozy Pitch)", "description": "   ONE OF FOUR GAMES IN COZY PITCH PACKTokyo Snap is one of four short games in the Cozy Pitch Pack. Each game is a polished idea that we know can turn into something much bigger. Vote for your favorite using the in-game menus and the winner gets expanded in a sequel. Cast your vote and make your voice heard!FEATURES<br/>Spend a week in Tokyo to get some great photos for your feed. Learn the latest fashion trends, make friends, and take the perfect pictures to rack up likes on Street Snaps.<br/><br/><br/><strong>CAPTURE THE PERFECT PIC</strong> <br/>Learn how to take the perfect trendy picture. Pay attention to your composition and the latest fashion trends to get the best response.<br/><br/><br/><strong>MAKE FRIENDS</strong> <br/>Get to know the fashionable locals. Each character has a different story and a different fashion style.<br/><br/><strong>GET POPULAR ON STREET SNAPS</strong><br/>Select your best pictures, “upload” them to Street Snaps, and get comments on your photos telling you how well you did and how to improve. Get enough followers and you can even get free upgrades to your gear from sponsored brands! (Note: this game is completely offline and all ‘online’ interactions are simulated).COZY GAME PALSWe are a duo of experienced creatives. Bryan is the coder, he has worked on Journey, The Last of Us, and Uncharted 4. Crista is the is the artist, she has worked at Cartoon Network, Nickelodeon, FOX, and Warner Bros. We are working together as Cozy Game Pals to add variety to the types of games available.", "metacritic": null, "released": null, "tba": false, "updated": "2023-06-03T20:08:02", "background_image": "https://media.rawg.io/media/screenshots/e62/e6263ed469911181b4a73ffb6cbaf20f.jpg", "website": "http://www.cozypitchpack.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cozy Game Pals"], "genres": ["Indie"], "publishers": ["Cozy Game Pals"], "esrb_rating": null}