{"id": 288723, "slug": "hunting-fields-of-jackals", "name": "Hunting fields of Jackals", "name_original": "Hunting fields of Jackals", "description": "<strong>Jackals is not a usual 3rd person vehicle shooter game, it is also an off-road racing/battle royale concept and PVE element combined game.</strong><br/><br/><br/><br/>In Jackals(in short of Hunting fields of Jackals), players will drive various modern military vehicles that armed with real-world heavy weapons racing and fighting against other players and AIs.Only one player/team can win in a round, the winner could be either the first who reaches the final destination/checkpoint or the last man stand.<br/><br/><br/><br/>Third party AI forces will join the battle with players, the forces consist with air and ground units, if players are willing to take the risk fighting with them, special items and powerful weapons can be retrieved as the trophy.<br/><br/><br/><br/><br/>Apart from playing with fully customized vehicles and on-board weapons, players can also have the chance to control reconnaissance drones, airborne gunships, combat drones through PVE gained special items, also some powerful weapons like various portable missile launchers and grenade launchers can be the game changer. Choose right vehicles for each of game round is essential, every vehicle differs from others in many ways, armor speed and firepower, generally, these factors are against each other, becoming a sharpshooter might not be able to rule the game sufficiently, instead, planning smartly could be a better choice. Customize your vehicle, and choose wisely to fit your strategy and win a game.<br/><br/><strong>what's the special </strong><br/><br/><br/><br/>\t1 Vehicles are needed for speed! in this game, shooting is still the core element, but might not be the most important one, if staying alive during conflicts is hard for you, consider becoming the fastest and avoid those then!<br/><br/><br/><br/>\t2 Separated roles on one vehicle or team up and fight in a fleet!\t<br/><br/><br/><br/>\t2 Heavy weapons and modern vehicles that resemble every facet in the real world military power.<br/><br/><br/><br/>\t3 AI players and NPCs add uncertainties and tactical flexibility into the competition between players.<br/><br/><br/><br/>\t5 Classic military equipments and mordern warfare elements<br/><br/>And more is await for you to discover and put the idea in.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:56", "background_image": "https://media.rawg.io/media/screenshots/53d/53d687f31fa6210296a0547ec8d6cd58.jpg", "website": "http://www.squatnine.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["squatnine"], "genres": ["Action", "Racing", "Indie"], "publishers": ["squatnine"], "esrb_rating": null}