{"id": 288772, "slug": "globesweeper", "name": "Globesweeper", "name_original": "Globesweeper", "description": "Globesweeper is a twist on the classic minesweeper game. Use the numbers to work out all the tiles that are safe to reveal but be careful one mistake revealing a mine will cause the whole globe to detonate and you will have to start again!<br/><br/>With hexagon, triangle and classic square game modes, 5 different globe sizes and 3 difficulty settings you can be playing on anything from tiny hexagonal globes made of 92 tiles to colossal triangle globes with 20,480 tiles.<br/><br/>Gain achievements to unlock all 14 themes including planet Earth, the Moon, Mars, stylish gold, ruby, emerald and sapphire.<br/><br/>Can you beat a colossal globe?How to Play<br/>Each tile you reveal will have a number on it (blank means 0). This is the number of mines on adjacent tiles*.  For example in hexagonal mode if you have a tile with a 3 on it and 3 of its 6 adjacent tiles have been revealed you know the other 3 are mines. <br/><br/>Now if you have a tile with 1 on it and one of its adjacent tiles has been marked as a mine you know the other 5 adjacent tiles are safe to be revealed as its mine is already accounted for. <br/><br/><br/><br/>Using this technique carry on until the whole globe is revealed. The same technique can be used for both the triangle and the classic square game modes.<br/><br/>*Adjacent tiles are any tiles that share a corner. For hexagons this is 6 tiles, squares 8 tiles and triangles 12 tiles.<br/><br/>    Key Features<ul><li> Hexagonal, classic and triangle modes<br/></li><li> 5 globes sizes to choose from<br/></li><li> 3 difficulty levels<br/></li><li> Global scoreboards<br/></li><li> 14 themes to unlock</li></ul>", "metacritic": null, "released": "2019-02-12", "tba": false, "updated": "2023-02-20T16:02:37", "background_image": "https://media.rawg.io/media/screenshots/ed4/ed4b26fdae44295ce6f1acb63af11fb9.jpg", "website": "http://www.incandescentgames.co.uk/", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 33, "beaten": 1, "dropped": 1}, "playtime": 2, "achievements_count": 16, "ratings_count": 6, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 6, "platforms": ["Linux", "PC", "macOS"], "developers": ["Incandescent Games"], "genres": ["Casual", "Indie"], "publishers": ["Incandescent Games"], "esrb_rating": null}