{"id": 288786, "slug": "rick-henderson", "name": "Rick Henderson", "name_original": "Rick Henderson", "description": "Features■ Infinite replayability<br/><br/>■ 20+ weapons with 20 more in the making<br/>■ 40+ enemies split into 5 factions with more coming<br/>■ 5 bosses in multiple variations<br/>■ Beautiful golden days of 16-bit games pixelart graphics<br/>■ Blood pumping synthwave and electro musicThe Game Loop<br/><br/>The Game Loop consists of Levels. Levels are generated by combining hand-crafted waves (consisting of single enemies, squadrons, waypoint enemies and their combinations), multiple bosses' variations and random events to provide unique, but satisfying experience every time you play.<br/><br/>First level is composed of Pirate only waves with a Pirate boss at the end. When you defeat the Pirate Boss, you get to choose a perk from a random selection of perks which will fit your play style (better firing rate for a weapon type, score bonus, and so on) and then enter the Warp. Random events can occur while being in warp, either a Warp Malfunction, which will drop you in the middle of a Meteor Storm, single faction space (the idea is to implement a special Warp Dweller faction which can be only found in Warp), or other similar hazards during the next Level.<br/><br/>Next Level is made of Pirates AND Rift Miners, and so on until the final Boss. When you defeat it, you loop through the game again. The Bosses remain the same (in a sense of words, another variation of the Boss will be spawned on second loop) for each level, but the enemies are tougher, faster, fire more often and new, harder waves are added. Also, all the enemy factions are present from the start of Game Loop number 2.<br/><br/><br/><br/>To deepen the replayability of the game, i included several random events that will keep the players on their toes:Warp MalfunctionI borrowed this idea from Galaga Deluxe, one of my favorite games from Amiga 500 back in the day. Between the levels, there's a small chance that your warp drive will malfunction and you may end up in null-space where you will be attacked by solo faction ships only, or get stuck in a  meteor storm that can yield extra points or end your run if you are destroyed in it. If i get enough funding, i'd really like to make a special Warp Dweller faction that would appear only during the Warp Malfunction.Asteroid Rain, Laser Barrage, MinefieldComplete the level during some of these events for an additional score multiplier.PerksDepending on your style of play, at the end of each level you are presented with a choice of perks that can help you last longer, be it a faster ship, more health, additional score multiplier, better firing rate for certain types of weapons, critical hit chances for your weapons and so on. If you remember Crimsonland, then you get the idea.<br/><br/><br/><br/>There are over 20 weapons (for now, plan is to have around 40) divided into three groups Bullet, Missile, Energy. Each of the weapon types deals a different amount of damage based on the type of enemy armor, which is spread out into Unarmored, Armored and Shielded.<br/><br/>Bullet weapons deal normal damage to all armor types.<br/>Missile weapons deal extra damage to armored enemies, but less damage to shielded enemies.<br/>Energy weapons deal extra damage to shielded enemies, but less damage to armored enemies.<br/><br/><br/><br/>Switching between weapons takes a small amount of time so you need to have a plan prepared in split second for every incoming wave!<br/><br/>PiratesYour typical cannon fodder faction, aggressive small and medium ships that make up the ship and weapon quality with numbers.<br/><br/>Rift MinersMining AI gone haywire, a lot of blades, drills and industrial grade weapons and armor.<br/><br/>Terran ConfederacyHighly organized military fleet with tight formations and organized attacks.<br/><br/>Paragon CultMysterious cult utilizing an unknown source of energy in form of yellow orbs both for weapons, propulsion and cloak systems.<br/><br/>SunDyne CorporationPrivately owned space exploring corporation equipped with cutting-edge technology that let's no-one stand in their path.<br/><br/><br/><br/><br/><br/>A very important matter that i must admit i was quite oblivious to inclusion in the gaming until recently, but i vow to give my best for the game to be played by everyone and make it possible for people with visual impairments to compete for the highest score.<br/><br/><strong>The things i've done until now:</strong><br/><br/>Colorblind mode for people with Protanopia, Deuteranopia and Tritanopia.<br/><br/><br/><br/>For people that have problem with <strong>flashing lights</strong>, background screen flashes when hit are able to be turned off.<br/><br/><strong>Screen shakes</strong> can be turned off if someone is bothered by those, and i'm quite sure they can make someone dizzy, at least.<br/><br/><strong>Bloom levels</strong> will be adjustable to enable more crisp visual presentation.<br/><strong>Things i'm planning to do:</strong><br/><strong>High-contrast mode</strong> for people with low vision.<br/><br/>I'm open to other improvements, if they are viable to do in a reasonable time-frame by a one man team.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:51", "background_image": "https://media.rawg.io/media/screenshots/468/468198310aa101e78c49ddc6056f368e.jpg", "website": "http://www.fatpugstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fat Pug Studio"], "genres": ["Action", "Indie"], "publishers": ["Fat Pug Studio"], "esrb_rating": null}