{"id": 288775, "slug": "grounds-of-glory", "name": "Grounds of Glory", "name_original": "Grounds of Glory", "description": "Grounds of Glory is an online arena-based PvP game. It features destructible elements, proper projectile collision and reactive spells and abilities. Its fast-paced and action-packed combat is heavily dependant on positioning, reaction speed and aiming your projectiles. <br/><br/><strong>Gameplay</strong><br/>Is a pillar blocking your way? Destroy it! Is a projectile flying towards your critically wounded teammate? Throw yourself forward, intercept it and save his life. Do you see a crowd control spell being cast on you? Be fast enough and escape it using your dash or teleport!<br/><br/>Grounds of Glory currently supports 2v2 and 3v3 game formats. Are you alone and want to play with someone? Don't worry, we’ve got you covered; use the supported solo-queue option. All game modes use proper matchmaking while the dedicated servers offer a lag-free and stable experience.<br/><br/>ARCANIST<br/>Powerful spellcasters, able to wield three distinct types of spells with either instant or prolonged effect. Arcanists excel in controlling the battlefield and they can even summon otherworldly beings to do their bidding for a short time.<br/><br/>PROPHET<br/>Shielding to prevent damage, mending injuries and supporting others in various other ways, Prophets are indispensable to every team. They can turn the tides of battle in their favour by using their diverse arsenal of spells.<br/><br/>WARRIOR<br/>Masters of melee weapons, Warriors can switch between dual wielding and two-handed weapon styles, trading the frequency of attacks for their impact. When they close in on their target, they can make short work of dispatching their foe.<br/><br/><strong>Progression System</strong><br/>When you level up and acquire all the abilities, masteries and talents, the game has just begun. Grounds of Glory will offer seasons with unique gear sets and other cosmetic enhancments to the game. Some rewards are reserved only for the best: participate in ranked mode to obtain titles and epic cloaks that make you stand out on the battlefield.", "metacritic": null, "released": "2019-02-22", "tba": false, "updated": "2019-08-23T12:11:12", "background_image": "https://media.rawg.io/media/screenshots/056/05621ca63ae07a719ac58192998a942c.jpg", "website": "http://groundsofglory.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 509, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GG STUDIOS"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["GG STUDIOS"], "esrb_rating": null}