{"id": 288827, "slug": "solitaire-10-classic-card-game", "name": "Solitaire 10 classic card game", "name_original": "Solitaire 10 classic card game", "description": "Solitaire is the #1 classic Solitaire with all the features you’d love to see on this famous card game! Enjoy this app on your iPhone or iPad! <br/><br/>We offer the true essence of the classic solitaire, also called Klondike or Patience. Some of you will remember the windows Solitaire you loved to play but here offered with a far more engaging user experience.<br/><br/>No other Solitaire game offers such an user-friendly interface. Experience the easy to read cards, crisp clear, delightful sounds, beautifully designed Klondike solitaire as you have never done before.<br/><br/>You can customize the background, use the draw one or draw 3 cards and use Vegas mode. The draw one card version is easier to play and most games are possible to be won but if you feel like a bigger challenge try the draw 3 mode.<br/><br/>Some features:<br/><br/>• Exceptional game interface <br/>• 1 or 3 draw card modes<br/>• Klondike version<br/>• Vegas scoring available<br/>• Super easy to read cards and crisp clear interface<br/>• Tap to move the cards or use your finger to drag and drop them<br/>• Auto-save and resume if you are interrupted<br/>• Use the special hints to show useful moves<br/>• Click on the joker icon to cheat if you are on the mood…<br/>• Right and Left handed modes<br/>• Option to auto complete to finish a solved game<br/>• Enjoy custom backgrounds and cards<br/>• Access your statistics<br/>• Universal app for iPad, iPhone and iPod<br/><br/>Try not to get even more addicted to this best of the breed game that we made just for you! Download it and start playing now!", "metacritic": null, "released": "2016-10-21", "tba": false, "updated": "2019-10-22T14:33:54", "background_image": "https://media.rawg.io/media/screenshots/d51/d51a41ae73d7b5e7bdd9d28bdd49c685_ZtGxzvi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Junix Games"], "genres": ["Card", "Family"], "publishers": ["JUNIX"], "esrb_rating": null}