{"id": 288983, "slug": "jumping-rabbit", "name": "Jumping Rabbit", "name_original": "Jumping Rabbit", "description": "<p>When the awesome Quill artist <strong>Goro Fujita </strong>started to push his animated scenes to the next level by offline-rendering them in Redshift/Octane, I knew that I wanted to attempt the same photoreal look and feel in Unity's new <strong>High-Definition Render Pipeline</strong>. Fortunately he was so nice to share the base Alembic file, so I gave it a shot! </p>\n<p>While I'm still not 100% happy with the result, I think I got far enough to share this for others to try. </p>\n<p>This is my result, trying to match the original render:</p>\n<p>\n</p>\n<p><em>Realtime scene in Unity, rendering at at least 60 frames per second</em></p>\n\n<p><em>Original Facebook Post by Goro Fujita, rendered in several hours in Redshift with AfterEffects grading</em></p>\n\n<p><em>Side-by-side comparison</em></p>\r\nRealtime!\r\n<p>The realtime scene allows to do a couple of cool things you can't do in an offline render:</p>\n<p><strong>You can fly around in it.</strong></p>\n\n<p><strong>You can interactively change the lights.</strong></p>\n\n<p><strong>What you see is what you get.</strong></p>\n\n<p><em>(what you see in the Scene View)</em></p>\r\nUsage\r\n<p>When you start the .exe, it will cache the Alembic file. This takes a moment and will eat your RAM (about 6 GB). I didn't add any checks whether you have sufficient RAM before loading - you have been warned.</p>\r\n\r\nTechnical Details\r\n<p>The workflow was the following:</p>\n<ul><li>Goro Fujita drew and animated the scene entirely in VR (using <strong>Oculus Quill</strong>)</li><li>he exported it as <strong>Alembic </strong>file (containing the entire frame-by-frame animation)</li><li>I imported the Alembic file into <strong>Unity</strong>, applied some caching to make it play in realtime (and filed some bug reports along the way)</li><li>I set up materials and lighting in the new <strong>High-Definition Render Pipeline</strong> to match his reference</li></ul>\n<p>The Alembic file was too big to play it, so I needed to cache individual frames - taking up a lot of RAM (~6GB for those 60 frames with ~9 Million vertices each) - this is all very very unoptimized, I was pretty surprised it worked at all.</p>\r\nVR - waiting for Unity...\r\n<p>Unfortunately, the HDRP as of today is not in a state yet where all of these features work in VR (Notably, volumetric lighting). Once it is, I'm definitely gonna make a build for VR to finish the crazy cycle tech allows nowadays - created in VR (in Quill), rendered in the slow old-fashioned way, rendered in realtime, back to VR.</p>", "metacritic": null, "released": "2019-01-31", "tba": false, "updated": "2019-02-01T03:16:05", "background_image": "https://media.rawg.io/media/screenshots/134/1349c0525e0ee41b576900065c77d3bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["herbst"], "genres": [], "publishers": [], "esrb_rating": null}