{"id": 289197, "slug": "hyperspace-decorator", "name": "Hyperspace Decorator", "name_original": "Hyperspace Decorator", "description": "<p>Precursory AI decorator sim-environment, assumed to be created during the 48 standard hour event known as<strong> Global Game Jam 2019</strong>.<br/></p>\n<p>Your purpose is to select furniture for the alien assets aboard<strong> [factory_ship_id]</strong>.</p>\n<p>As agreed in <strong>[subject_contract]</strong>, assets can only receive one piece of furniture per standard year.</p>\n<p>As agreed in <strong>[subject_contract]</strong>, assets will not be allowed to choose furniture themselves to ensure maximum efficiency, compliance with ship regulations and compliance with general system law.</p>\n<br/>\n<p> Your task is to<strong> read asset bios</strong>,<strong> determine their preference</strong> and <strong>select furniture that makes them feel</strong> <strong>\"at home\"</strong>. You will select the correct room furniture  in regards to <strong>[room_stat_ cosiness]</strong>, <strong>[room_stat_virtuality]</strong> and the material components <strong>[room_mat_metal/gas/bio]</strong>.</p>\n<p>Your performance will be evaluate at the end of asset <strong>work shifts</strong>. Increased productivity due to adequate accommodation will result in more funds allocated to your on-board replication facilities.<br/></p>\n<br/>\n<p>Up to <strong>[30] pieces of furniture objects</strong> will be made available for printing after completing work shifts.  <strong>[contract]</strong> will be expanded to allow employ of up to <strong>[3] alien species</strong>. Room size will also increase as seen fit by <strong>[accommodation_overlord_mind].</strong><br/></p>\n<br/>\n<p>Reduced productivity due to failing to provide ample decoration will encure a <strong>penalty</strong>.  If your funds are depleted after a shift-end review you will be replaced by a more efficient decorator AI.</p>\n<p>Insert <strong>[complementary_encouragement_phrase]</strong> of your own preference.</p>\n<p><strong>[creator_reference_appendum]</strong>: Not really happy with how this game turned out, but it got quite a bit of content and complexity to it so I put it up regardless. The UI is still messy at times and the economy might be a tad unbalanced. Feel free to leave feedback. Writing the alien quirks and spiriting the furniture was fun, other than that I spend half the time with working on the UI and it didn't even turn out good. :o If you want a better jam game play my last years entry. :p I like that better at least.<br/></p>", "metacritic": null, "released": "2019-01-30", "tba": false, "updated": "2019-08-28T23:18:14", "background_image": "https://media.rawg.io/media/screenshots/23a/23ae41e8d422a7276391cf08fd201186.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["sleeper_games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}