{"id": 289160, "slug": "tiny-rpg", "name": "Tiny RPG", "name_original": "Tiny RPG", "description": "Set out on a Tiny Adventure!\r\n<p><strong>A happy couple finds their egg stolen by a T-Ruckus! You play as one of the dino-parents trying to chase the thief through a magical realm. </strong></p>\r\nWhat's in the 'box'?\r\n<p><strong>This might be one of the smallest RPG games you'll ever play! After choosing your hero in the tiny character creator you will pick your path through perilous lands. Level up and learn new moves to defeat your foes and gather treasure. It will come in handy once you find the tiny evil end-boss T-Ruckus.  </strong></p>\r\nHow to Play?\r\n<p><strong>Use the arrow keys on your keyboard to navigate through the game. Up and down usually provide different options.  These can either be cycled through, canceled or confirmed by pressing the left or right arrow key.</strong></p>\n<p>    </p>\r\nSharing is caring!\r\n<p><strong>This project was developed by me (Emiel Kampen) as a prototype for a larger game. Please let me know what you like and dislike about Tiny RPG as it will help me improve the final version. </strong></p><p>If you enjoy TinyRPG, please consider donating! All the funds will be used to further develop TinyRPG into bigger game for a release on other platforms.  </p><p><strong>You can also follow me on Twitter via @Prrrpl to get the latest news and updates on this and future versions of Tiny RPG!</strong></p>Special thanks:<p><strong>Cover/Marketing Art</strong>: Sonja Van Vuure (@SipSapSon)</p><p><strong>Playtesting and Feedback</strong>: Jeroen Wimmers (@JeroenWimmers), Ferdi Özgürel (@Ferdi_Ozgurel), Killkonie and anyone else who took part in pre-release testing.</p><p><strong>Other</strong>: Gamekings, Hogeschool voor de Kunsten Utrecht.</p>", "metacritic": null, "released": "2019-01-30", "tba": false, "updated": "2019-08-28T23:18:14", "background_image": "https://media.rawg.io/media/screenshots/181/181dc5b9baf565eda8a0d272e85e6410.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Emiel Kampen"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}