{"id": 289267, "slug": "night-light-itch-yucchi-wafie-woww_lucas-lingham92", "name": "Night light (itch) (Yucchi, Wafie, woww_lucas, lingham92, YumikoShimizu)", "name_original": "Night light (itch) (Yucchi, Wafie, woww_lucas, lingham92, YumikoShimizu)", "description": "<p><em>This game was created during Global Game Jam 2019. This jam theme was \"What home means to you?\" and the duration is 48 hours.</em></p>\n<p><em>From: 25/Jan/2019 - 27/Jan/2019</em></p>\r\nSummary\r\n<p><em>You play as a family member, protecting your grandmother in the house while in another dimension. Your objective is to scare away the demons who are attracted to her.</em></p>\n<p><em>These demons are afraid of the light, using your torchlight and other household equipment. But always remember, it's dangerous for kids to play with fire!</em></p>\n<p><em>Play though 4 levels of puzzles!</em></p>\n<strong>Controls </strong>\n<p><em>WASD - Movement</em></p>\n<p><em>V - Open Inventory</em></p>\n<p><em>Double Tap 1 or 2 while Inventory is open to select item to equip.</em></p>\n<p><em>Press F to interact with items on your hands or set candles on fire while using a match.</em></p>\n<p><em>Press E to interact with objects to carry or move stuff WHEN YOU ARE HOLDING THE FLASHLIGHT.</em></p>\r\nVideo\r\n\n<strong>Simple Guide</strong>\n<p><em>Anything colored RED will be able to be moved, approach it with a torchlight and press E. Drag along the green path.</em></p>\n<p><em>Intractable objects will be highlighted in white. You will be able to interact or activate something with it. Example, pressing E on a candle while holding the torchlight will enable you to carry the candle, whereas when you press F on the candle while using the matchsticks, you will light it up instead.</em></p>\n<p><em>Flammable objects will catch on fire if there is a fire near by for too long.</em></p>\n<p><em>When the level starts, players have 15 seconds to prepare for the wave. Survive till the timer reaches 0. At -15, it will load the next</em></p>\n<strong>Credits!</strong>\n<p><em>Thanks to everybody who have decided to come along this journey when I invited you all!</em></p>\n<p><em>I hope that it is a great first time experience for some of you.</em></p>\n<p><em>Hansel, Junxuan, Vanessa, Samuel, Andrew, Adilah, Ling Han, Hoe In, Calvert, Aloysius, Wafie, Lucas, JingJie, Marcus, YunHan and myself, Zi Sheng.</em></p>\n<p><em>Special Thanks to Erbse for the amazing sounds!</em></p>", "metacritic": null, "released": "2019-01-30", "tba": false, "updated": "2019-02-01T03:56:26", "background_image": "https://media.rawg.io/media/screenshots/814/8141b0713c34a73fd02c0420c854b13c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yucchi", "Wafie", "woww_lucas", "lingham92", "YumikoShimizu"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}