{"id": 2894, "slug": "invisible-inc", "name": "Invisible, Inc.", "name_original": "Invisible, Inc.", "description": "<p>Developed by the Canadian Klei Entertainment, Invisible Inc. is a turn-based strategy with elements of stealth and roguelike. The game takes place in a dystopian future: in 2074 and the huge multinational corporations seized power from the world government. Invisible Inc. - a private intelligence agency and a corporate contractor, conduct sophisticated undercover operations and use complex AI system called Incognita.</p>\n<p>At the beginning of the game, the security system of the agency was breached and most of the agency was lost. The remaining employee manages only to save AI, but its existence is questionable: the system can exist without connecting to a powerful computer for only 72 hours. Finding the right hardware becomes the main task of surviving agents. The player plays the role of their remote operator.</p>\n<p>The gameplay is similar to the X-COM games: all missions are turn-based. Each agent under player’s control has a limited action point that he can use during the turn. Often the main task on the map is to possess a certain object. During the missions, the player can complete additional quests that allow you to open new agents and equipment.</p>", "metacritic": 82, "released": "2015-05-12", "tba": false, "updated": "2024-01-17T22:44:37", "background_image": "https://media.rawg.io/media/games/849/849c187c0b5d4cd1ee3283148f7e4cdb.jpg", "website": "http://invisibleincgame.com/", "rating": 3.53, "rating_top": 4, "added_by_status": {"yet": 219, "owned": 2267, "beaten": 106, "toplay": 82, "dropped": 157, "playing": 24}, "playtime": 3, "achievements_count": 46, "ratings_count": 344, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 344, "platforms": ["iOS", "Nintendo Switch", "PlayStation 4", "Linux", "macOS", "PC"], "developers": ["Klei Entertainment"], "genres": ["Adventure", "Strategy"], "publishers": ["Klei Entertainment"], "esrb_rating": null}