{"id": 289684, "slug": "mona-vovvy", "name": "MONA (vovvy)", "name_original": "MONA (vovvy)", "description": "<p>You are just a girl who is walking her dog. In the way you will encounter something you wouldn't expect and you would want to discover it.</p>\n\n<p><strong>Controles</strong></p>\n<p>Uso de teclado y ratón para controlar el personaje.</p>\n\n<p><strong>Historia</strong></p>\n<p>Eres una chica adolescente que vive en un orfanato. Mientras paseabas al perro comunitario, éste se adentra en una mansión abandonada porque estaba paseando al perro. El perro se pone a perseguir un gato, y lo sigue hasta el interior de la mansión, tú vas tras él en su busca.</p>\n<p>La mansión está abandonada a las afueras de la ciudad. La mansión pertenecía a una familia rica de comerciantes. La familia constaba de la madre, el padre y una hija, vivían en la casa con una pareja casada, los cuales eran empleados de la misma. La mujer era cuidadora de la niña, y el hombre se encargaba de la cocina. Los padres eran muy exigentes con el servicio, y la cuidadora de la niña cayó enferma. Ésta al ser forzada a seguir trabajando pese a su enfermedad, acabó transmitiendo la enfermedad a la hija y ambas murieron. </p>\n<p>Los padres se desesperaron con la muerte de su hija, ya que su concepción fue prácticamente un milagro, y sabían que no podrían volver a tener más hijos. En su lugar intentaron otra opción mucho menos tradicional, resucitar a su hija. Se gastaron toda su fortuna en investigar métodos para tratar de resucitarla: poderes místicos, curanderos milagrosos venidos de remotos lugares, santería, ... y cuando ya parecía que no iban a conseguirlo, un extraño hombre les vendió por una gran suma una pócima que según él ya había probado y funcionaba ciertamente. Les advirtió sin embargo que pese a que su hija viviría, el resultado no sería el que esperaban.</p>\n<p>Aferrados a un clavo ardiendo los padres aceptaron, y tal y como les dijo aquel hombre su hija vivió. No parecía haber rastro alguno de efectos secundarios ni defectos en su hija, así que simplemente estos se alegraron y regocijaron ante la idea de su hija viva de nuevo. Toda la casa estaba repleta de alegría, toda, excepto las cocinas… Durante la celebración por la vuelta de su hija , el cocinero envenenó a la dichosa pareja. Él no había podido permitirse aquellos extravagantes métodos, y no tenía consigo más que pesar por la muerte de su esposa, de la cual culpaba a aquellos padres esclavistas con los que había seguido viviendo aguardando su venganza. </p>\n<p>No pudo sin embargo, hacerle nada a la niña, aquel milagro viviente, totalmente puro e inocente no había tenido culpa de nada, el hombre así lo sabía, pero se sentía demasiado culpable para cuidarla él mismo, de manera que la llevó a un orfanato de la localidad donde la dejó sin ser visto. Tras esto el hombre se marchó de la ciudad, para no volver.</p>\n\n<p><strong>Errores conocidos</strong></p>\n<ul><li>El perro Max no siempre mira en la dirección en la que se mueve debido a un error de trackeo.</li><li>Si vuelves a darle a continuar desde el menú in-game desaparecen las cámaras.</li></ul>", "metacritic": null, "released": "2019-01-28", "tba": false, "updated": "2019-08-28T23:18:11", "background_image": "https://media.rawg.io/media/screenshots/15e/15ef6e4e2ca54dd05db2324a64172f29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vovvy"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}