{"id": 289688, "slug": "kawaii-home-defense", "name": "KAWAII HOME DEFENSE", "name_original": "KAWAII HOME DEFENSE", "description": "Description\r\n<p>The main goal is to defend your home. This home has a bar lifethat makes you lose if it reaches 0.</p>\n<p>With your character, you can throw 4 different elemental projectiles, water, fire, ice and earth. when a character is hit by these projectiles he loses a very few life points, but he is affected by the element . For ice effect, enemy is slowed during the element effect duration.<br/></p>\n<p>When a character (either, a player, an enemy or the house itself) is under more than one element effect, it generates a new behaviour, or it cancels both effects : </p>\n<p>FIRE + EARTH : damage over time applies</p>\n<p>ICE + WATER : freeze (movment is not possible anymore)</p>\n<p>EARTH + WATER : heal over time</p>\n<p>FIRE + ICE  / FIRE + WATER / ICE + EARTH : cancel both effects</p>\n<p>When a player is dead, you can still see him (a tombstone appears) and you can resurrect him if you apply the HEAL effect (throw a water and an earth projectiles to do it). That means you can still continue to play if one of your allies resurrect you. The end of the game only appears when the house has no more life points.</p>\n<p>You can also heal the house itself ;-) <br/></p>\r\n\r\nControls\r\n<p>All controls are performed with a gamepad. The gamepad configuration is automatically detected if you use either a GameCube controller via the MayFlash USB adapter, or a Microsoft XBox controller. By default, if tour pad is not recognized, it uses the XBOX configuration.</p>\n<p>Move your character with the direction stick.<br/></p>\n<p> Throw 4 different elemental projectiles. Use the four buttons to throw (A,B,X,Y). If you keep them pressed, the projectiles go out fastly. The projectile direction is the same than the player one.</p>\n<p>If you want to shoot without moving, you can press the right pad trigger to stop your movement, and keep targetting with the stick.<br/><br/></p>\r\n\r\nDownload\r\n<p>\n</p>\r\n\r\nRepository\r\n<p>\r\nThe Mercurial(hg) software repository is available here.\r\n</p>\r\n\r\nLicence\r\n<p>\r\nCreative Commons BY-NC-SA 3.0 (Attribution-NonCommercial-ShareAlike 3.0 Unported) - 2019 - RPH Studio.<br/>\n</p>", "metacritic": null, "released": "2019-01-28", "tba": false, "updated": "2019-02-01T04:56:35", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd5f31417c2a5e03578ec72c2f354c20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["RPH Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}