{"id": 289886, "slug": "full-spectrum-warrior-complete", "name": "Full Spectrum Warrior: Complete", "name_original": "Full Spectrum Warrior: Complete", "description": "NOTICE: Activation key must be used on a valid Steam account. Requires internet connection.COMPLETE EDITION  Full Spectrum Warrior  Full Spectrum Warrior: Ten HammersFULL SPECTRUM WARRIORFull Spectrum Warrior is based on a light infantry-training simulator designed by Pandemic Studios for the U.S. Army as a tool to reinforce Army doctrine and squad tactics amongst troops. Full Spectrum Warrior is a squad-based, tactical-action game that delivers the experience of squad level command in the heat of battle. The product was developed with expertise from University of Southern California's Institute for Creative Technologies, which worked with Pandemic to bring state-of-the-art technology to the game. Designed to simulate today's challenges of urban combat missions, Full Spectrum Warrior delivers a level of realism and accuracy that has never been seen in a military-based game.KEY FEATURES  Unique combination of tactical and action gameplay  Authentic implementation of U.S. Army Infantry doctrine  Simple control scheme lets you command eight soldiers in real time  Squad equipment reflects real weaponry and equipment currently in use by the U.S. Army  Incredible AI brings the soldiers to life  Immersive urban environments with danger around every corner  Rules of Engagement simulate real-world conditions and alter the difficulty level  Engaging objectives keep your soldiers on their toes  Realistic animations for squad members, modelled after a combat veteran who is also an active-duty Sergeant in the U.S. Army RangersFULL SPECTRUM WARRIOR: TEN HAMMERSSequel to the award winning squad-based/real-time tactical combat game, Full Spectrum Warrior: Ten Hammers improves on the ground-breaking and authentic military gaming experience with a number of innovative features threaded throughout every aspect of the game. As squad leader, players coordinate the actions of multiple infantry squads, leading them through a variety of hostile environments. An intuitive control scheme allows control of the squads in real-time as players outthink, outmanoeuvre and outgun enemies through more than 12 levels of intense urban warfare. Players must utilize authentic combat tactics as they battle enemies with an explosive arsenal of weapons, high-tech military equipment and new controllable mechanized units. With an enhanced multiplayer mode, player can go online and battle friends through a variety of new head-to-head and team-based objective missions.KEY FEATURES Intense Squad Based Combat - Suppress and disband insurgent forces with the latest arsenal of weapons and equipment - all based on real-world military weaponry including the ability to control mechanized units, such as Bradley Tanks and Armoured HumveesTrue Military Gaming Experience - Use real-world combat tactics to command infantry squads, ranging from US Light Infantry and US Ranger Forces to Multi-National UN Coalition Forces - taking on a variety of combat missions through war torn environmentsInnovative Genre-blending Game Play Experience - Delivering the most genuine infantry combat experience ever, combining squad-based combat and real-time tactical actionEnhanced Strategy - New features include the ability to enter interior environments and position sniper teams, save and protect hostages and control additional fire teams, Charlie and DeltaCommand Responsibility - The lives of the squad members lie in the players every movement and decision. An in-game replay video system, allows players to evaluate their squad's combat effectiveness and learn from mistakesFriend or Foe Online Game Play - Take the action online for a variety of multiplayer modes. Play through the game in Co-Op mode, go head-to-head with other players or team up for objective based missionsDeveloped by Pandemic Studios (Star Wars: Battlefront, Mercenaries and Destroy All Humans!)SYSTEM REQUIREMENTS   Windows 98/ME/2000/XP  Pentium IV 2 GHz  512 Mo RAM  1.5 Go free space on hard drive required  Graphic card 128 Mo", "metacritic": null, "released": "2007-07-16", "tba": false, "updated": "2019-02-23T11:08:43", "background_image": "https://media.rawg.io/media/screenshots/dc6/dc6ce8659010eaa68bbcb8626168e054.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 618, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Shooter"], "publishers": ["THQ Nordic"], "esrb_rating": null}