{"id": 289838, "slug": "cat-nabbit", "name": "Cat Nabbit!", "name_original": "Cat Nabbit!", "description": "<p>Harley (The Human), just wants to relax for the weekend, and comes home to a giant mess in her house. She has 30 seconds before her weekend officially starts, and must clean up her cats mess before she can relax. Run around and clean up the dirty objects. Time your cleaning correctly to get items around your house 100% clean. Failing will only clean it a little bit. Make sure you time it well, so you can get everything extra sparkly before the timer runs out!</p>\n<p>Controls:\r\nUSB Controller enabled, Keyboard Controls enabled.</p>\n<p>Keyboard:\r\nPlayer 1: Arrow Keys to move, Z to interact with objects\r\nPlayer 2: E,S,D,F to move, Tab to interact with objects</p>\n<p>Controller: D-Pad to move, B-Button to interact with items around the house. Make sure you visit the How to Play section before playing to read up on everything needed.</p>\n<p>Main Task: Clean everything in the house before the timer runs out. The messier the job, the longer it will take to clean up.</p>\n<p>Single Player: Play as the Human, as they try to tidy up their house, and keep it clean , so they can relax and enjoy their weekend. The only problem is, there are some little troublemakers, who think that it's a fun game to watch their human clean up after them.</p>\n<p>Multiplayer: Player 1 will play as the human cleaning the house, while the secondary player(s) will play as the cats making the human's house their own personal scratching post.</p>\n<p>The Human: Run around the house cleaning up after your mischievous cats, trying to keep the house as clean as possible before the timer runs out. Make sure to time those active cleaners, to clean up as fast as possible.\r\nActive Cleaner: (Humans) Time the Active Cleaner event to get the task done faster. Misses will clean slower and waste precious time off the clock.</p>\n<p>The Cats: Run around causing mischief and making messes to keep your human busy, trying to keep the place as messy as possible before the timer runs out.\r\nActive Mess: (Cats: Meow!) Time the active mess to make more of a mess and continue your mischievous ways. Misses will go slower, and waste precious time off the clock.</p>\n<p>Credits:\r\nAll of us here would like to say thanks to the great folks at PIGSquad for putting on this great event, and bringing us together to create this fun, interactive game that we will continue to work on and polish for the official showcase. We would also like to thank our pets who helped influence this game, since this game is like a part of our daily lives.</p>\n<p>Anne Strickland, our esteemed Composer making all of our fantastic sound effects and the music, would like to thank her cat Rudy for her inspiration.</p>\n<p>Ryan Saul, our wonderful programmer who spent many hours and time working on bugs and finding fixes for everything like a champ, would like to thank his cat Oscar - a big inspiration for this project.</p>\n<p>David Tran is an amazing artist who brought us some amazing pixels in record time, even having to go to his day job in the middle of all this. He has no pets, but enjoyed the idea, and had great input as a whole.</p>\n<p>Last but not least is our Writer, Producer/Project Manager Nick Jackson. He would love to thank his entire team for their great work and dedication which made it super easy to manage. He would also love to thank his pets (yes plural) for their inspiration on the project. Pet names in no particular order: Jace, Jaiden, Riley, Chewbacca, Havok, and Lorna.</p>\n<p>Thank you all for a great time and a fun event, can't wait until the next Jam!</p>", "metacritic": null, "released": "2019-01-28", "tba": false, "updated": "2019-02-01T05:17:33", "background_image": "https://media.rawg.io/media/screenshots/33c/33c5a07536576ab26f721bb0f3e8d7be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ryan Saul"], "genres": [], "publishers": [], "esrb_rating": null}