{"id": 289872, "slug": "digger-simulator-2011", "name": "Digger Simulator 2011", "name_original": "Digger Simulator 2011", "description": "You know what a plate vibrator is? And when you hear the term \u0093gravel bed\u0094, you think of big yellow machines instead of uncomfortable bedroom furniture? Then you definitely should get the \"Digging-Simulator 2011\". And just in case you aren't familiar with terms like foundation trench and idler, this game is a must-have any way! Excavate and pour concrete like a pro: Launch your own digging-company with a mini excavator and start into one of the five different scenarios. In the beginning, you only handle small jobs, like excavating supply and small foundations trenches.. But soon you can invest the earned money into heavy technology which you can use to solve demanding and diverse challenges. In a realistic 3-D environment, you excavate pits and foundation trenches for large buildings, and then fill them with the appropriate concrete construction technology. Use your road roller to create sub grades and lead your small company to success. The \"Digging-Simulator 2011\" offers you more than ten different types of professional hardware equipment \u0096 from the idler to the cement mixer vehicle. Compare your excavator success with your friends using the scoring list, or excavate and bulldoze at your heart\u0092s content during unscored games. Features:Diverse equipment technology Unique floor system with different earth layers Physically realistic material behavior High quality visuals via modern shader technology Challenging tasks and scenarios Economic simulation: from small business owner to the excavation mogul. Helpful automatic operations for complex equipment such as concrete pump and hydraulic excavator Interface for game controller/joystickSYSTEM REQUIREMENTSWindows XP (SP3)/Vista/7 Pentium or equivalent Processor with at least 2 GHz 2 GB RAM DirectX 9.0c compatible video card (min. Shader model 2.0 and 256 MB RAM) Screen resolution at least 1024x768 Windows compatible sound card Gamepad/joystick (optional)", "metacritic": null, "released": "2009-09-10", "tba": false, "updated": "2019-02-23T11:08:45", "background_image": "https://media.rawg.io/media/screenshots/d96/d96a455e002ebf791fc8669ca199936c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Astragon Entertainment"], "esrb_rating": null}