{"id": 289895, "slug": "a-train-9", "name": "A-Train 9", "name_original": "A-Train 9", "description": "NOTICE: Activation key must be used on a valid Steam account, requires internet connection.  ABOUT THE GAME\t\t\t\t\t\tA-Train 9 isn't just a train simulator: it's an intricate city simulation game with an emphasis on the railway system. In this 3D simulation game, you'll take control of a fledgling railway company on a quest to amass a fortune and develop a bustling metropolis! Your company is primarily a railway enterprise, but you'll also need to construct buildings, roads, factories, and many other subsidiaries to attract customers for your railways. You'll be building your fortune not just through your railway, but through your subsidiaries. Everything is interconnected: your subsidiaries will affect your railway, and vice versa. This latest installment of the A-Train series is loaded with new features, such as upgraded graphics, enhanced camera controls, trucks and buses, power management, and more! The ten pre-made scenarios will put your management skills to the test, and the refined map editor will enable you to forge the city of your dreams from scratch - terrain and all!  Here are some of the key factors involved in your success:\t Time &amp; Nature: The flow of passengers will fluctuate throughout the day, and operating trains during dead periods will be disastrous for your business. A-Train 9 offers extensive control over schedules, allowing you to fine-tune each of your train routes. You must also take into account terrain and weather when it comes to growth and planning.  Financial Management: Your balance sheet must not be in the red if you want to earn a profit. You'll need to keep track if your financial reports and use the banks and stock market to your advantage if you wish to succeed! Taxes will also come into play each year. Use savvy business and financial tactics to gain an advantage!\tRailway Costs: Time and nature affect the railway as mentioned above, but so do other elements. Tracks and trains are expensive to build and maintain, so you'll never want excess if your goal is to make a fortune. Some stations are versatile but expensive, and others are limited in their use but cheap to maintain. Each of the 10+ trains has a distinct advantage and disadvantage, so weigh your options wisely before you spend a small fortune on new trains!   Materials: You'll need a great flow of materials, as they are required to build subsidiaries and grow your empire. Be sure your freight trains and trucks are running at peak performance, and take advantage of in-game tools to optimize your management of materials!Subsidiaries: Each subsidiary you control (apartments, stores, restaurants, parks, etc.) has the potential to grow the city, your railway company, and your wallet. But it's a delicate balancing act! Build too many and you'll have empty buildings andhuge maintenance bills. Build too few and nobody will flock to your city, leaving your trains without passengers. Other companies will move in if your area is attractive enough; they may compete with you on a real estate level, but the people they bring will still have to use your trains!KEY FEATURES  Upgraded Graphics: The 3D graphics from A-Train 8 have been improved, making this the most visually advanced game in the series to date!    Enhanced Camera Controls: Follow your trains and take beautiful panoramic shots of your creations unlike ever before! Many of the shots in the trailer above were taken from the in-game controls that will be at your fingertips!    Trucks &amp; Busses: Trains are no longer alone! Use these new inclusions to more efficiently transport materials and customers.    Power Management: A-Train 9 adds a new wrinkle to the formula with power plants! Your city will require power, but excessive power is wasteful. Your options for supplying power are considerable: solar arrays, nuclear reactors, and tidal plants are all available!    New Structures: You'll have access to a variety of new structures, including wind turbines and ancient Japanese castles. Your cities will look more diverse and alive than ever before!SYSTEM REQUIREMENTS \t\t  Minimum:   OS: Microsoft Windows XP/Vista/7 (32 bit or 64 bit)/8  Processor: Intel Core 2 Duo E8400 3.0GHz / AMD Athlon 64 X2 Dual Core 4000+  Memory: 256 MB RAM  Graphics: Nvidia GeForce 8600 GT / ATI Radeon 9500 Pro  DirectX: Version 9.0  Hard Drive: 1 GB available space", "metacritic": null, "released": "2014-05-23", "tba": false, "updated": "2019-02-23T11:08:42", "background_image": "https://media.rawg.io/media/screenshots/670/670c4584e62b74e9e7819f78cac30c85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Plug In Digital"], "esrb_rating": null}