{"id": 289873, "slug": "garbage-truck-simulator-2011", "name": "Garbage Truck Simulator 2011", "name_original": "Garbage Truck Simulator 2011", "description": "Start with a small waste disposal truck and take over the truck driver's role. Your driver can be individually designed by you and you can enjoy detailed controls and instruments in the cockpit-view and realistic street traffic. Drive your colleagues to the destination area quickly and safely with the aid of a navigation system. But watch out for traffic rules: The police's radar systems can be mounted anywhere! Next to that, your car will break down, if damaged too severely, due to a realistic damage system. At your destination, you haul the containers to the truck, empty them with the push of a button and put them back in your truck. You will be enthused about the detailed animated controls for loading and unloading equipment. Your loading space is full? Then activate the compactor and make space for the remaining waste.Once you complete a job, there's money in the register. Invest your earned cash into your company right away: Upgrade your vehicle or purchase one of the additional five different garbage truck models. In the freely navigable gameworld, there are also containers and building rubble waiting to be collected by you and to be dropped off at the disposal site.Immerse yourself in the realistic simulation of an exciting professional field and lead your own company to success in the \u0093Garbage Truck Simulator 2011\u0094.Features:Five garbage trucks with detailed cockpits and instruments Animated control for loading/unloading equipment, loading mechanics and compactor Different waste types such as household waste, rubble and toxic waste Realistic driving and curve behavior with different acceleration values Gigantic city area with highways \u0096 freely navigable at any time Fully automatic collection possible Incinerator or recyclables site are destinations of disposal tripsSYSTEM REQUIREMENTSWindows XP (SP3)/Vista/7 Processor with 2.0 GHz (Dual Core Processor is recommended) GeForce 6 or equivalent ATI Model with 128 MB RAM 1 GB RAM (2 GB are recommended) approx. 1,5 GB free hard drive space", "metacritic": null, "released": "2010-11-22", "tba": false, "updated": "2019-02-23T11:08:45", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfb82c7d99efc4b1e0df4cd995a15fde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Astragon Entertainment"], "esrb_rating": null}