{"id": 289980, "slug": "hearts-of-iron-iv-death-or-dishonor", "name": "Hearts of Iron IV - Death or Dishonor", "name_original": "Hearts of Iron IV - Death or Dishonor", "description": "Death or Dishonor is a new Country Pack for Hearts of Iron IV, and expands upon players\u0092 ability to experience history\u0092s greatest conflict from any point of view. This new pack focuses on the countries caught between the Soviet Union and Nazi Germany during World War II -- faced with the tough choices of starting a conflict with a global superpower, or compromising their ideals to strike a deal for their own survival.\t\t\t Including new National Focus Trees for Hungary, Romania, Czechoslovakia, and Yugoslavia, Death or Dishonor adds new unique events, nation-specific art and music, and much more, giving players all-new ways to experience -- and change -- the course of history.\t   \tKey Features \tDeath or Dishonor includes:\t  Four New Focus Trees: Experience the war from the difficult perspectives of Hungary, Romania, Czechoslovakia, and Yugoslavia.  Equipment Conversion: Update your arsenal by converting older units -- or make use of captured enemy vehicles and gear.  New Music and Art: 3 new thematic musical tracks from composer Andreas Waldetoft, new art content for the four focus nations, and new troop voiceovers.  New Diplomatic and Puppet Interactions: License military technology to bring other nations\u0092 weapons to the field or sell your advances to the highest bidder. Fascist countries get new subject levels like Reichskommissariat, with access to licenses, industry and strategic resources. The instated governments are held in an iron grip, making it harder for them to break free.", "metacritic": null, "released": "2017-06-14", "tba": false, "updated": "2024-01-24T16:09:43", "background_image": "https://media.rawg.io/media/screenshots/533/5330aeb7ef869555e51f472603440dd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}