{"id": 289929, "slug": "fallout-4-far-harbor", "name": "Fallout 4 - Far Harbor", "name_original": "Fallout 4 - Far Harbor", "description": "<p>NOTICE: Requires the base game Fallout 4 in order to play. Activation key must be used on a valid Steam account, requires internet connection.   ABOUT THE GAME    A new case from Valentine\u0092s Detective Agency leads you on a search for a young woman and a secret colony of synths. Travel off the coast of Maine to the mysterious island of Far Harbor, where higher levels of radiation have created a more feral world.  Navigate through the growing conflict between the synths, the Children of Atom, and the local townspeople. Will you work towards bringing peace to Far Harbor, and at what cost? Far Harbor features the largest landmass for an add-on that we\u0092ve ever created, filled with new faction quests, settlements, lethal creatures and dungeons. Become more powerful with new, higher-level armor and weapons. The choices are all yours.      SYSTEM REQUIREMENTS     Minimum:   OS: Windows 7/8/10 (64-bit OS required)  Processor: Intel Core i5-2300 2.8 GHz/AMD Phenom II X4 945 3.0 GHz or equivalent  RAM: 8 GB RAM       Hard disk: 30 GB free HDD space  Video card: NVIDIA GTX 550 Ti 2GB/AMD Radeon HD 7870 2GB or equivalent                                          Recommended:   OS: Windows 7/8/10 (64-bit OS required)  Processor: Intel Core i7 4790 3.6 GHz/AMD FX-9590 4.7 GHz or equivalent  RAM: 8 GB RAM     Hard disk: 30 GB free HDD space  Video card: NVIDIA GTX 780 3GB/AMD Radeon R9 290X 4GB or equivalent</p>", "metacritic": 77, "released": "2016-05-19", "tba": false, "updated": "2024-02-12T11:49:07", "background_image": "https://media.rawg.io/media/games/ddc/ddc628285975634af34ccff2bf7cc9de.jpeg", "website": "", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 16, "beaten": 56, "toplay": 11, "dropped": 7, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 56, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 58, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Bethesda Game Studios"], "genres": ["Action", "Shooter", "RPG"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Mature"}