{"id": 289956, "slug": "omsi-2-add-on-citybus-o305g", "name": "OMSI 2 Add-On Citybus O305G", "name_original": "OMSI 2 Add-On Citybus O305G", "description": "NOTICE: Requires the base game OMSI 2 in order to play. Activation key must be used on a valid Steam account, requires internet connection.  ABOUT THE GAME\t\t\t\t\t\tThe „Citybus O305G“ allows you to take a journey through time. The „Citybus O305G “ as a pure vehicle add-on aims to build a virtual monument for the articulated pusher busses of the first generation and sends you right back into the early 1980s.  \tThe add-on “Citybus 0305G” contains two variants of the articulated pusher bus for OMSI 2. The eye catchers are the different fronts of the busses. One related to the “VÖV-Front” and the other to the “StüLB-Front”. Both models come in different colour and interior variants. Another highlight is the authentic pollution model and the start behavior that is affected by weather and battery conditions.\t The busses have a manually changeable rolling band display and can be used on the OMSI 2 default maps “Berlin-Spandau” and “Grundorf”.\t   Hint: We recommend using this articulated pusher bus in combination with the OMSI add-on „Citybus 0305“ since it also contains hof-files and suitable varnishes for those.KEY FEATURES  Two variants of the articulated pusher bus with different fronts    Different colour painting and interior design variants    Realistic models and sounds based on the real-world O305G    Authentic pollution model    Automatic doors (middle and back)    Stop request button with original sounds    Weather and battery affected starting behaviour    Rolling band display for Spandau line 92, Grundorf line 76 and city bus sphere “Neuendorf”    Repaintable in combination with the OMSI-Repaint-ToolSYSTEM REQUIREMENTS \t\t    OMSI 2 – The Omnibus Simulator min. 2.2.032  Operating System: Windows XP / Vista / 7 / 8.1 / 10  Processor (CPU): min. 2.8 GHz  Memory (RAM): min. 4 GB  Free hard disk space: 400 MB  Graphics card: min. 1024 MB, DirectX 9.0c or higher", "metacritic": null, "released": "2016-03-08", "tba": false, "updated": "2019-02-23T11:08:33", "background_image": "https://media.rawg.io/media/screenshots/679/67981e9e6e152efa5779d7057057c942.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Aerosoft"], "esrb_rating": null}