{"id": 289950, "slug": "hearts-of-iron-iv-together-for-victory", "name": "Hearts of Iron IV - Together For Victory", "name_original": "Hearts of Iron IV - Together For Victory", "description": "History forged the ties. Empire made them tighter. Can war tear them apart?Join the Dominions as they step up to the challenge of defending the motherland for King and Country in Together for Victory, the first major expansion for Hearts of Iron IV, the critically acclaimed strategy wargame from Paradox Development Studio. This expansion puts the focus on British Commonwealth nations, deepening the experience of playing these outposts of the English language.\tKey Features  New national focus trees and events for Canada, Australia, New Zealand, The Raj (India) and South Africa\t  Alternate historical path for each of the Dominions, with options to stay loyal to Great Britain, or forge a new, more independent destiny\t\t  New autonomy system giving subject states degrees of independence from a foreign master\t  Changes to Lend-Lease allow you to ask your allies to send you desperately needed equipment   A Spearhead battle plan command allowing more control over grand encirclements and punching through enemy lines  Technology sharing will allow Commonwealth nations to quickly catch up with British assistance     Land Battle log: Learn by past victories or defeats. Giving you history over recent battles. and statistics on equipment losses, you can see exactly how your troops are performing.\t\t *This will be included in the Field Marshal Edition", "metacritic": null, "released": "2016-12-15", "tba": false, "updated": "2024-01-24T16:09:49", "background_image": "https://media.rawg.io/media/screenshots/a8d/a8df3598aae0bdfdc0455bead6c6ecf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}