{"id": 289944, "slug": "europa-universalis-iv-rights-of-man", "name": "Europa Universalis IV: Rights of Man", "name_original": "Europa Universalis IV: Rights of Man", "description": "NOTICE: Requires the base game Europa Universalis IV in order to play. Activation key must be used on a valid Steam account, requires internet connection.  ABOUT THE GAME\t\t\t\t\t\tParadox Interactive presents the newest expansion to Europa Universalis IV, the landmark historical grand strategy game from Paradox Development Studio. Rights of Man adds greater depth and detail to a host of game systems. New decisions, greater customization and added personality are all coming to the best-selling game about exploration, trade and conquest.KEY FEATURES  Great Powers now have special diplomatic abilities: Don\u0092t let your development lag while you expand, so you can make use of new threats and overtures to neighbors    Personalities and traits for monarchs and military leaders will add bonuses to your nation or assist you in battle    Queens can be generated by royal marriages, and serve as regents if an underage heir ascends to the throne    Subject nations can be given more specific instructions on how to behave at war    Fetishist nations can choose from a number of cults, and uncover new options as they wage war and make alliances    Coptic nations will be tasked with preserving their faith through the control of holy sites throughout the near east    Other Features, including a new faction system for Revolutionary Republics, a unique new government form for the Ottoman Empire, the ability to abdicate, allowing building in subject states, and debasing currency for quick cashSYSTEM REQUIREMENTS \t\t  WindowsOS: Windows 8 / 7 / Vista / XPProcessor: Intel® Pentium® IV 2.4 GHz or AMD 3500+Memory: 4GB RAMHard Drive: 6GB free hard disk spaceGraphics: 512 MB DirectX 9.0c compatible card - NVIDIA® GeForce 8800 or ATI Radeon® X1900 - 1 GB recommendedSound: Direct X- compatible soundcard DirectX®: 9.0cInternet connection or LAN required for multiplayer \t   MacOS: Mac OS X 10.6.8 or betterProcessor: Intel Core Duo Processor (2GHz or better)Memory: 4GB RAMHard Drive: 6GB free hard disk spaceGraphics: 1 GB - GLSL 1.3, OpenGL 2.1 compatible card - ATI Radeon HD 6750 / NVIDIA® GeForce 320 / NVIDIA® GeForce 9600 or higherInternet connection or LAN required for multiplayer\t\t  LinuxOS: Ubuntu 12.04 LTSProcessor: Intel Core Duo Processor (2GHz or better)Memory: 4GB RAMHard Drive: 6GB free hard disk spaceGraphics: 1 GB - GLSL 1.3, OpenGL 2.1 compatible card - ATI Radeon HD 6750 / NVIDIA GeForce® 320 / NVIDIA® GeForce 9600 or higher,Internet connection or LAN required for multiplayer\t    ©2015 Paradox Interactive\u0099. Trademarks belong to their respective owners. All rights reserved.", "metacritic": null, "released": "2016-10-11", "tba": false, "updated": "2023-01-25T21:34:47", "background_image": "https://media.rawg.io/media/screenshots/69e/69ee10ef4372c50248c50a11fcce9898.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 538, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}