{"id": 289972, "slug": "mafia-iii-faster-baby", "name": "Mafia III - Faster, Baby!", "name_original": "Mafia III - Faster, Baby!", "description": "In Sinclair Parish, a rural town west of the Bayou, Sheriff â\u0080\u009cSlimâ\u0080\u009d Beaumont rules on a platform of fear and violence. When a Civil Rights leader is murdered, and other activists are targeted, Lincoln joins forces with sister-in-arms Roxy Laveau on an explosive mission to expose the townâ\u0080\u0099s corrupt underbelly. Engage in high-octane car chases, epic new military-grade combat tactics and seedy operations to bring Slim and his corrupt Sheriffâ\u0080\u0099s Department to justice. IMPORTANT NOTICE: Faster, Baby! is part of the Season Pass. If you own the Season Pass, you should not purchase Faster, Baby!, as you already are entitled to it.Key features\t\t\t  \t    SINCLAIR PARISH: An all-new township west of the Bayou run by corrupt law enforcement dedicated to enforcing their way of life through fear and violence. Expansive and varied terrain sets the stage for epic car chases and all-new combat tactics.  A NEW PLOT OF FAMILY, BETRAYAL, AND REVENGE: Partner with local activist Roxy Laveau to avenge the murder of a prominent Civil Rights leader and bring Sheriff â\u0080\u009cSlimâ\u0080\u009d Beaumont and his gang of corruption to justice.  REDEFINE YOUR REVENGE STRATEGY: Expanded stunt driving and combat mechanics, new vehicles and weapons add all new opportunities to engage enemies behind-the-wheel and on foot.  EPIC REWARDS: Unlock unique Faster, Baby! rewards to further personalize your path to revenge. Equip Roxyâ\u0080\u0099s MK 1020, a silenced SMG that spits hellfire. Put the pedal down in Roxyâ\u0080\u0099s sporty Lassiter Nightcrawler, made for the chase. Plus, get access to the Blue Genius and The Experience outfits, and more!", "metacritic": null, "released": "2017-03-28", "tba": false, "updated": "2023-03-13T20:02:59", "background_image": "https://media.rawg.io/media/screenshots/eb0/eb027ffee35a37a9a6f8ae7fdaaa8efb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["2K Games", "Aspyr"], "esrb_rating": null}