{"id": 289989, "slug": "cities-skylines-green-cities", "name": "Cities: Skylines - Green Cities", "name_original": "Cities: Skylines - Green Cities", "description": "Cities: Skylines - Green Cities is a new expansion for the city-builder from Colossal Order, adding new ways for players to build earth-friendly towns. The expansion adds 350 new assets to the core game, adding a massive selection of new visual options, complete with eco-friendly buildings, organic shops, electric vehicles, and new services designed to make pollution a quaint notion of the past. Players can create more diversified cities, or go completely green as the urban population grows. New in-game services and buildings arrive alongside revisions to noise and environmental pollution, making the skies safer for Chirper at last. \t        Key FeaturesAnd that\u0092s just the tip of the iceberg, with exciting new features such as:    Story to Story, Building to Building, Street to Street: New Eco-Friendly Buildings, New specialization buildings, new alternative service buildings, new unique buildings, electric cars, new parks  --  350 new assets in all giving a unique new look to Cities: Skylines.  I Wish I Was Special, You\u0092re So Very Special: New specialized options for all city zones, plus leveled-up specializations for the first time in Cities: Skylines.  So What So What So What\u0092s the Scenario: 3 new scenarios, 4 new policy options, and a new Monument to make your friends Green with envy.  Why Do Birds Suddenly Appear More Stylish: Of course we\u0092ve included a new hat for Chirper.", "metacritic": null, "released": "2017-10-19", "tba": false, "updated": "2021-01-11T11:59:22", "background_image": "https://media.rawg.io/media/screenshots/2c7/2c70521bad12601f420c3ca5469fceae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": [], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}