{"id": 289900, "slug": "europa-universalis-iv-el-dorado", "name": "Europa Universalis IV: El Dorado", "name_original": "Europa Universalis IV: El Dorado", "description": "NOTICE: Requires the base game Europa Universalis IV in order to play. Activation key must be used on a valid Steam account, requires internet connection.  ABOUT THE GAME\t\t\tParadox Development Studios ups the stakes with the latest and third expansion from Europa Universalis IV \u0096 The Art of War. Centered on the 30 Years War and bubbling political instability between church and state, this expansion features improved gameplay mechanics that\u0092s puts warfare at the forefront of your quest for domination and triumph.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tImproved naval combat and full army control means the course of victory rests solely on your shoulders. Will you choose to triumph alone or rely on the combat strengths of your allies? Your decision will decide if your empire lasts through the ages. KEY FEATURES  30 years War: Unique mechanics and events for the religious conflict that ravaged Europe.    Napoleonic Era: Fight for or against the revolution and create entirely new custom client countries on the map from your conquests.    Fighting on land or at sea: You can now sortie from sieges, transfer occupation to allies and give objectives to your subjects and allies. Entire Fleets can now be upgraded with one click, you can now mothball fleets to avoid paying maintenance, and your fleets can be set to automatically transport armies.    Marches: Turn your vessels into bulwarks against your enemies, getting less tax but strengthening their defenses.    Improved Diplomacy: Sell Surplus Ships, Fight for your subjects CB, Declare War in Support of Rebel factions in other countries and new peace options.    Gameplay Enhancements: Build entire armies in one click and abandon cores that you no longer wish to support.    Free Features for the accompanying patch: Completely new rebel mechanic, local autonomy on province level, new cardinal system for Catholics, new reformation mechanics and a new look map.SYSTEM REQUIREMENTS \t\t  WindowsOS: Windows 8 / 7 / Vista / XPProcessor: Intel® Pentium® IV 2.4 GHz or AMD 3500+Memory: 4GB RAMHard Drive: 6GB free hard disk spaceGraphics: 512 MB DirectX 9.0c compatible card - NVIDIA® GeForce 8800 or ATI Radeon® X1900 - 1 GB recommendedSound: Direct X- compatible soundcard DirectX®: 9.0cInternet connection or LAN required for multiplayer \t   MacOS: Mac OS X 10.6.8 or betterProcessor: Intel Core Duo Processor (2GHz or better)Memory: 4GB RAMHard Drive: 6GB free hard disk spaceGraphics: 1 GB - GLSL 1.3, OpenGL 2.1 compatible card - ATI Radeon HD 6750 / NVIDIA® GeForce 320 / NVIDIA® GeForce 9600 or higherInternet connection or LAN required for multiplayer\t\t  LinuxOS: Ubuntu 12.04 LTSProcessor: Intel Core Duo Processor (2GHz or better)Memory: 4GB RAMHard Drive: 6GB free hard disk spaceGraphics: 1 GB - GLSL 1.3, OpenGL 2.1 compatible card - ATI Radeon HD 6750 / NVIDIA GeForce® 320 / NVIDIA® GeForce 9600 or higher,Internet connection or LAN required for multiplayer\t    2013 Paradox Interactive\u0099.  Trademarks belong to their respective owners.  All rights reserved.", "metacritic": null, "released": "2015-02-26", "tba": false, "updated": "2023-01-25T21:34:34", "background_image": "https://media.rawg.io/media/screenshots/f94/f94c3c85300118208d21034b683564a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}