{"id": 289954, "slug": "omsi-2-add-on-strassenbahn-nf6d-essengelsenkirchen", "name": "OMSI 2 Add-on Strassenbahn NF6D Essen/Gelsenkirchen", "name_original": "OMSI 2 Add-on Strassenbahn NF6D Essen/Gelsenkirchen", "description": "NOTICE: Requires the base game OMSI 2 in order to play. Activation key must be used on a valid Steam account, requires internet connection.   ABOUT THE GAME\t   OMSI 2 premiere \u0096 Get on rails in the popular bus simulation at the Ruhr district for the first time.\t   15 tram stops (two of those subway stops) through challenging alleys from Essen to the broader streets of Gelsenkirchen. A depot and the underground point of return round up the scenery nicely. The route is partly with other traffic and without and creates a high amount of diversity. That way the virtual tram driver has an authentic driving experience and has to always keep track of his surroundings. The add-on Tram Essen/Gelsenkirchen offers a lot of new possibilities for the world of OMSI.\t\t Focus of the add-on is the tram NF6D (MGT6D) that was developed in Kassel in 1988. It uses three-phase drive and is 28,6 meters long and 2,3 meters wide.Maximum speed of the tram is 70 km/h and allows to transport 171 people at max. In contrast to many other trams it doesn\u0092t ride on the normal railway but on the for the Ruhr district typical meter-gauge tracks.The tram was the first that was suited for the large-floor area and 42 trams have been delivered to the BOGESTRA in 1992.\t\t\t\t\t\t\t\t\t   KEY FEATURES  Tramlines with 15 stops    Map is based on the cities Essen and Gelsenkirchen\t       More than 100 individual objects, buildings and new rails      Parts of the route are in the Underground     Real timetable dates of EVAG\t\t    Including a Tram Typ NF6D of BOGESTRA    Including some paints of other transport companiesSYSTEM REQUIREMENTS \t  OMSI 2 \u0096 The Omnibus Simulator min. 2.2.032  Operating system: Win 7/8/8.1/10  Processor (CPU): 2,8 GHz  RAM: 4 GB or higher  Free hard disk space min: 2 GB  Graphic card min: 1024 MB (DirectX: 9.0 or higher)  Internet connection and user account required for Steam", "metacritic": null, "released": "2016-07-28", "tba": false, "updated": "2019-02-23T11:08:33", "background_image": "https://media.rawg.io/media/screenshots/5f0/5f0fb5783ed1a8e575ad3c17ff1227fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Aerosoft"], "esrb_rating": null}