{"id": 289957, "slug": "omsi-2-add-on-citybus-o405o405g", "name": "OMSI 2 Add-On Citybus O405/O405G", "name_original": "OMSI 2 Add-On Citybus O405/O405G", "description": "NOTICE: Requires the base game OMSI 2 in order to play. Activation key must be used on a valid Steam account, requires internet connection.  ABOUT THE GAME\t\t\t\t\t\tExperience the next classic in the world of public buses: the Citybus O405, built between 1987 and 2001, belongs to the last generation of high-floor buses. The successor to the Citybus O305 was a very popular vehicle and is still in use today thanks to its robustness.\t\t\t\t This add-on includes two versions of the bus: The 12 metre standard variant (O405) and the 18 metre articulated variant (O405G). They both feature realistic 3D models and sounds based on recordings of their real-world counterparts.Components like the gearbox, ticket machines and destination displays are created using custom scripts and animations to make sure they behave as lifelike as possible. Unique amongst the OMSI add-ons so far is the dynamic rain feature which places accumulating rain drops onto the windshield that can actually move.\t\t At the same time, a modular structure of the busses ensures exceptionally high customisability. The player can choose between different doors, ticket machines and other aspects of the vehicles and even change them on the fly without having to reload the bus. Adding to that, every part of the model is repaintable so you can use it in any way you like.KEY FEATURES  1980's Citybus O405 in 12 metre standard and 18 metre articulated variant    Fully detailed interior and dashboard    Realistic models and sounds based on real-world O405(G)    \"Dynamic rain\" accumulating and moving on the windshield    Custom, highly realistic destination displays and ticket machines    Modular set-up for great customisability, e.g. doors, ticket machines    Every part of the bus is repaintable    On-the-fly customisation to change various aspects of the bus while drivingSYSTEM REQUIREMENTS \t\t    OMSI 2 \u0096 The Omnibus Simulator min. 2.2.032  Operating System: Windows XP / Vista / 7 / 8.1 / 10  Processor (CPU): min. 2.8 GHz  Memory (RAM): min. 4 GB  Free hard disk space: 400 MB  Graphics card: min. 1024 MB, DirectX 9.0c or higher", "metacritic": null, "released": "2016-03-08", "tba": false, "updated": "2019-02-23T11:08:33", "background_image": "https://media.rawg.io/media/screenshots/38b/38bfeb84ce24c30fca473e0af7e90454.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Aerosoft"], "esrb_rating": null}