{"id": 289995, "slug": "omsi-2-add-on-bremen-nord", "name": "OMSI 2 - Add-On Bremen-Nord", "name_original": "OMSI 2 - Add-On Bremen-Nord", "description": "Following the OMSI add-ons Berlin X10 and Rheinhausen, the third OMSI routes add-on from Halycon Media takes players to the beautiful city of Bremen in northern Germany.In collaboration with Bremer Straßenbahn AG (BSAG), we\u0092ve recreated eight regular bus lines plus additional special lines for OMSI 2: the Omnibus Simulator.Over 500 new 3D objects have been produced specially for this add-on, making the routes highly memorable.Includes licensed MAN buses in different variants with genuine liveries. Thanks to the support of BSAG, not only are the routes based on actual timetables, but genuine on-board announcements are used. The modular selection options enable a whole host of different bus variants.Numerous Bremen streets have been virtually recreated in high detail based on route maps, and lots of new junctions, landmarks and distinctive buildings have been developed as 3D objects specially for this OMSI add-on. Passenger voices with north German accents, new AI vehicles and the faithful recreation of actual routes add up to a realistic experience of what it\u0092s like to drive a bus through north Bremen.\t  Key features            Lines included in this add-on:  Drivable BSAG lines from 2009 to December 2011: 75 (between Rönnebeck and Grohn), 76 + 76E, 78 and 79  Thanks to the chronology function, from December 2011 the 90s lines are added to the game: drivable lines 95E (Vegesack \u0096 Rönnebeck), 96, 97, 98 and 99  Lines 75 and 76 run from the Blumenthal depot to Vegesack rail station (75/76) and Jacobs University in Grohn (75)  Lines 75/76: run through Lüssum, past Blumenthal water tower, Blumenthal rail station, North Bremen hospital and Gustav-Heinemann-Bürgerhaus, and via Sagerstraße to Vegesack rail station\t Other features:  BSAG MAN Lions City, 12 m, 2009 model, and BSAG MAN Lions City, 18.75 m, 2009, 2010 and 2012 models  Rail traffic (DB AI route Bremen-Vegesack \u0096 Bremen Central Station, NWB AI route Bremen-Vegesack \u0096 Bremen-Farge) with accurate rolling stock  Genuine BSAG announcements from 2010 and 2016  Officially supported by Bremer Straßenbahn AG (BSAG)  Genuine BSAG liveries and timetables  New AI vehicles (cars, taxis, ambulances) add more variety to road traffic  North German passenger voices  Recreation of actual routes with memorable features  Chronological events such as diversions, building sites and relocated bus stops  Lots of new junctions and road features  Over 500 new, location-specific 3D objects (e.g. buildings, ships and landmarks)", "metacritic": null, "released": "2017-11-30", "tba": false, "updated": "2019-02-23T11:08:28", "background_image": "https://media.rawg.io/media/screenshots/63d/63dab5fd4b6192ad524f511d886e700d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Aerosoft"], "esrb_rating": null}