{"id": 289994, "slug": "sid-meiers-civilization-vi-rise-and-fall", "name": "Sid Meier's Civilization VI: Rise and Fall", "name_original": "Sid Meier's Civilization VI: Rise and Fall", "description": "The Civilization VI: Rise and Fall expansion brings new choices, strategies, and challenges for players as they guide a civilization through the ages. The expansion introduces new Great Ages, Loyalty, and Governors systems, expands existing Diplomacy and Government systems, and adds eight new civilizations, nine new leaders, a variety of new units, districts, wonders, buildings, and more. Can you lead your people into a Golden Age of prosperity? Or will your empire face the challenges of a Dark Age?\t  Civilization VI is a game about building an empire to stand the test of time, and the Rise and Fall expansion brings new choices, strategies, and challenges for players as they guide a civilization through the ages. Can you inspire the Loyalty of people around the world, or will you lose cities to your rivals? Will you establish a Golden Age for your civilization, or be mired in a Dark Age? In Civilization VI: Rise and Fall, you truly become a leader for the ages.Successful leadership of a civilization can send it into a prosperous Golden Age, but falling behind can usher in a Dark Age. Respond well to the challenges of a Dark Age, and your civilization can rise again into renewal with a Heroic Age.Encourage the Loyalty of your citizens to keep your borders intact, or inspire Loyalty among other civilizations to expand your empire. World borders continually shift and change as Free Cities emerge from empires, and neighbors compete for the Loyalty of cities across the map.With the new the Governor system, players are able to further customize and specialize their cities, as well as react to the new challenges of Dark Ages and Loyalty. Each of the seven unique governors has its own promotion tree, and lends itself to different playstyles and strategies. In addition to these new systems, Civilization VI: Rise and Fall introduces eight new civilizations and nine new leaders. Eight new world wonders can be constructed, as well as a variety of new units, districts, buildings, and improvements. There are more ways than ever before to build, conquer, and inspire.      Key Features  GREAT AGES: As your civilization ebbs and flows, and you reach milestone Historic Moments, you will move towards Dark Ages or Golden Ages, each providing specific challenges or bonuses based on your actions in game. Rise triumphantly from a Dark Age, and your next Golden Age will be even stronger \u0096 a Heroic Age.  LOYALTY: Cities now have individual Loyalty to your leadership \u0096 let it fall too low, and face the consequences of low yields, revolts, and the potential to lose your city if it declares its own independence. But one civilization\u0092s loss can be your gain as you inspire Loyalty among cities throughout the map and further expand your borders.  GOVERNORS: Recruit, appoint, and upgrade powerful characters with unique specialization bonuses and promotion trees to customize your cities, and reinforce Loyalty  ENHANCED ALLIANCES: An enhanced alliances system allows players to form different types of alliances and build bonuses over time  EMERGENCIES:  When a civilization grows too powerful, other civilizations can join a pact against the threatening civilization, and earn rewards, or penalties, when the Emergency ends.  TIMELINE: Review your civilization\u0092s history at any time with the new Timeline feature, a visual journey through the Historic Moments that you encountered on your path to victory.  NEW LEADERS AND CIVS:  Nine new leaders and eight new civilizations are introduced. Each brings unique bonuses and gameplay, as well as a total of eight unique units, two unique buildings, four unique improvements, and two unique districts.  NEW GLOBAL CONTENT: Eight new world wonders, seven natural wonders, four new units, two new improvements, two new districts, fourteen new buildings, and three new resources have been added.  IMPROVED GAMEPLAY SYSTEMS: The Government system has been enhanced with new Policies, including Dark Age Policies, new hidden leader Agendas, new Casus Belli, and additional improvements to existing systems.", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2023-04-30T20:05:22", "background_image": "https://media.rawg.io/media/screenshots/90d/90d7acee6e8ac04c4ab409fbe3e34d6e.jpg", "website": "", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 6, "beaten": 3, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["2K Games", "Aspyr"], "esrb_rating": null}