{"id": 290003, "slug": "hearts-of-iron-iv-waking-the-tiger", "name": "Hearts of Iron IV - Waking the Tiger", "name_original": "Hearts of Iron IV - Waking the Tiger", "description": "Years before Europe went to war, Japan\u0092s imperial ambitions targeted the divided Chinese Republic. Crippled by political paralysis and centuries of fitful development, China is still not a pushover. With vast reserves of manpower and resources, not to mention a giant landmass, the Republic of China and its temporary ally, the Communists under Mao, can withstand another aggressor. There have been, after all, very many.Waking the Tiger is the newest expansion for Paradox Development Studio\u0092s celebrated World War II strategy wargame, Hearts of Iron IV. This expansion adds new gameplay options for all players, and has a special focus on the Asian front of the deadliest war in human history.\t        Key FeaturesFeatures in Hearts of Iron IV: Waking the Tiger include:\t    National Focus Trees for China: Guide the Chinese Republic or Communist China through the war, guided by your own vision of the future.  Modified Focus Trees for Germany and Japan: Two major Axis powers now have alternate history paths, including the chance to depose Hitler or restore democracy to Japan.  Chain of Command and General Traits: Put multiple armies under the direction of a field marshall to coordinate large movements of army groups, using the traits of your generals to take advantage of their unique skills.  Decisions: Spend your political power on national decisions and missions to strengthen the war effort.  And more: Scavenge equipment from the battlefield, use Volunteer Air Corps, acclimatizing troops, and other changes.", "metacritic": null, "released": "2018-03-08", "tba": false, "updated": "2024-01-24T16:09:47", "background_image": "https://media.rawg.io/media/screenshots/ddf/ddfc3ca3942d197c8e71c1ce5ae8c162.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}