{"id": 290030, "slug": "omsi-2-add-on-man-citybus-series", "name": "OMSI 2 - Add-on MAN Citybus Series", "name_original": "OMSI 2 - Add-on MAN Citybus Series", "description": "There\u0092s hardly any other vehicle which has characterised the German cityscape and omnibus history as much as the \u0093Lion\u0092s City\u0094 series by MAN. Players can now enjoy the low-floor bus on their PC. The add-on \u0093MAN Citybus Series\u0094 for OMSI 2 contains the \u0093overland vehicle\u0094 A20, the solo vehicle A21, the articulated bus A223 and the 15 meter long version of the A26.Thanks to their modular concept, all 4 buses can be customised. Up to 45 options can be selected, from hub caps to doors, seats and internal displays. Pick your preferred vehicle and customise it to your preferences.In addition all buses can be repainted to customise them to your own needs and services.All models have original sounds and animations \u0096 in particular the rubber gaiter of the articulated bus which performs close to reality when turning in a curve. The player can take a seat in the VDV cockpits which includes the display for the vehicle diagnostic system.\t  \t\t\t\t\t\t\t\t\t\t\t\t\t         Key Features  The MAN Citybus in 4 variants (Solo, Solo 15m, \u0093Overland\u0094, and articulated bus)  Modular concept with up to 45 various settings (depending on vehicle type)  Realistic sounds, models and animations  VDV cockpit including display with vehicle diagnostic system  Fully repaintable  Realistically animated rubber gaiter", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2019-02-23T11:08:22", "background_image": "https://media.rawg.io/media/screenshots/ffb/ffb589743da49f86f9aa98098952904f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": [], "publishers": ["Aerosoft"], "esrb_rating": null}