{"id": 290034, "slug": "battletech-flashpoint", "name": "BATTLETECH Flashpoint", "name_original": "BATTLETECH Flashpoint", "description": "NOTICE: Requires the base game BATTLETECH in order to play. Activation key must be used on a valid Steam account. Requires an internet connection. About the game\t BATTLETECH's first-ever expansion adds new gameplay, depth, and over 30 hours of new content to your mercenary experience. Introducing Flashpoints: high-stakes, branching short stories that link together mercenary missions, crew conversations, special events, critical choices, and rare bonus rewards to take BATTLETECH's endgame and Career-Mode gameplay to the next level. Flashpoints embroil you in the feuds and machinations of the various Great Houses of the Inner Sphere, and are designed to keep even the most hardened mercenary commanders on their toes. In addition to narrative twists and turns, some Flashpoint stories feature consecutive deployments in which players can\u0092t repair or heal between missions, while others feature infiltration contracts that restrict the tonnage of deployable BattleMechs. Beyond adding over 30 hours of exciting Flashpoints to BATTLETECH, this expansion comes complete with three new \u0091Mechs (including the highly anticipated Hatchetman), a challenging new mission type, and a new tropical biome for the biggest and most challenging BATTLETECH experience yet.Here's just a few examples of the many new stories and challenges you'll face as a mercenary commander in Flashpoint:  Extracurricular Activities - The petty squabbling of political rivals takes a deadly turn when civilians are caught in the crossfire. Will you escort them to safety at the risk of your MechWarriors and their 'Mechs\u0085 even if they can't pay?  Criminal Mind - The routine capture of a criminal syndicate\u0092s warehouse uncovers the resting place of an ancient BattleMech. Will you share this information with your employer or keep the \u0091Mech for yourself?  Headhunting - The Zhao twins are a thorn in the side of your employer and it\u0092s time to terminate their command. But when their forces are routed and the siblings flee in two directions you\u0092ll need to choose which commander -   and which unique salvage - you\u0092ll pursue.Key features   NEW BATTLEMECHS - Expand your 'Mech arsenal with the armor-chopping power of the Hatchetman, the speed and versatility of the Crab,   and the battle-computer-equipped Cyclops.  NEW ENCOUNTER - Target Acquisition is an exciting new mission type that challenges you to put your light and medium 'Mechs to the test.   Take control of three locations to triangulate fire an enemy installation before time runs out.  NEW BIOME - Take the fight to all-new lush, tropical environments - but watch out for the spore clouds (or use them to your advantage!)           system requirements  Windows - Minimum  Requires a 64-bit processor and operating system  OS: 64-bit Windows 7 or Higher  Processor: Intel® Core\u0099 i3-2105 or AMD® Phenom\u0099 II X3 720  Memory: 8 GB RAM  Graphics: Nvidia® GeForce\u0099 GTX 560 Ti or AMD® ATI Radeon\u0099 HD 5870 (1 GB VRAM)  DirectX: Version 11  Network: Broadband Internet connection  Storage: 30 GB available space  Sound Card: DirectX 9 sound deviceAdditional Notes: Multiplayer is compatible between Windows and Mac versions.\tWindows - Recommended  Requires a 64-bit processor and operating system  OS: 64-bit Windows 7 or Higher  Processor: Intel® Core\u0099 i5-4460 or AMD® FX-4300  Memory: 16 GB RAM  Graphics: Nvidia® GeForce\u0099 GTX 670 or AMD® Radeon\u0099 R9 285 (2 GB VRAM)  DirectX: Version 11  Network: Broadband Internet connection  Storage: 30 GB available space  Sound Card: DirectX 9 sound deviceAdditional Notes: Multiplayer is compatible between Windows and Mac versions.\t\t\t Mac - Minimum  Requires a 64-bit processor and operating system  OS: macOS High Sierra 10.13.3  Processor: Intel® Core\u0099 i5-4670  Memory: 8 GB RAM  Graphics: Nvidia® GeForce\u0099 GTX 775M (2 GB VRAM)  Network: Broadband Internet connection  Storage: 30 GB available spaceAdditional Notes: Multiplayer is compatible between Windows and Mac versions.\tMac - Recommended  Requires a 64-bit processor and operating system  OS: macOS High Sierra 10.13.3  Processor: Intel® Core\u0099 i7-7700K  Memory: 16 GB RAM  Graphics:  AMD® Radeon\u0099 Pro 580 (8 GB VRAM)  Network: Broadband Internet connection  Storage: 30 GB available spaceAdditional Notes: Multiplayer is compatible between Windows and Mac versions.   Linux - Minimum      OS:  Ubuntu 18.04LTS,  64-bit and higher or SteamOS   Processor:  Intel® Core\u0099 i3-3240 CPU @ 3.40GHz × 4   RAM:  8 GB   HDD:  35 GB   Graphics card:  GeForce GTX 560 Ti/PCIe/SSE2   Sound card:        Linux - Recommended      OS:  Ubuntu 18.04.1 64-bit or SteamOS   Processor:  Intel® Core\u0099 i5-4460 or AMD® FX-4300   RAM:  16 GB   HDD:  35 GB   Graphics card:  Nvidia® GeForce\u0099 GTX 670 or AMD® Radeon\u0099 R9 285 (2 GB VRAM)   Sound card:            .nxw-product-description h3 { text-transform: uppercase; padding-bottom: 5px; margin-bottom: 10px; border-bottom: 1px solid #999;}      .nxw-product-description * + h3 { margin-top: 20px;}      .nxw-product-description h5 { font-size: 1em; margin-bottom: 5px;}      .nxw-product-description p { margin: 0 0 10px;}      .nxw-product-description dt { font-weight: bold; margin-bottom: 3px;}      .nxw-product-description dd { margin-left: 0;}      .nxw-product-description dd + dt { margin-top: 10px;}      .nxw-product-description ul { margin-top: 0; -webkit-padding-start: 20px; list-style-type: square;}      .nxw-product-description ul.airy-list li { padding-bottom: 10px;}      .nxw-product-description img { max-width: 100%; margin-bottom: 20px;}      .nxw-product-description .tagline { font-weight: bold;}      .nxw-product-description .img-desc { margin-left: auto; margin-right: auto; display: table;}      .nxw-product-description .img-desc img { margin-bottom: 10px; margin-left: auto; margin-right: auto; display: block;}      .nxw-product-description .note, .nxw-product-description .early-access-note, .nxw-product-description .steam-note, .nxw-product-description .origin-note, .nxw-product-description .uplay-note { padding: 10px; margin: 0 0 15px; border: 1px solid #999;}      .nxw-product-description .sysreq-desc { font-size: 12px; margin-top: 20px;}      .nxw-product-description .copyrights-desc { font-size: 10px;}", "metacritic": null, "released": "2018-11-27", "tba": false, "updated": "2019-02-23T11:08:22", "background_image": "https://media.rawg.io/media/screenshots/16e/16e0c21ab13137c00dc25a7545e6017e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harebrained Schemes"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}