{"id": 290012, "slug": "homefront-the-revolution-the-voice-of-freedom", "name": "Homefront: The Revolution - The Voice Of Freedom", "name_original": "Homefront: The Revolution - The Voice Of Freedom", "description": "<p>NOTICE: Requires the base game Homefront®: The Revolution in order to play. Activation key must be used on a valid Steam account, requires internet connection.  ABOUT THE GAME         You are Benjamin Walker, hero of the Resistance and the most wanted man in America.  Now you are risking everything to infiltrate Philadelphia and ignite a revolution that will sweep the KPA out of America on a tide of bloody vengeance.         If you fail all hope for freedom is surely lost...                                                   SYSTEM REQUIREMENTS   Minimum:  OS: Windows 7/8/10 all x64  CPU: Intel Core i5-4570T (2.9 GHz) or equivalent or AMD FX-6100 (3.3 GHz) or equivalent  GPU: GeForce GTX 560 TI (1024 MB) or equivalent or Radeon R7 260X (2048 MB) or equivalent  RAM: 6144 MB   Recommended:     OS: Windows 7/8/10 all x64  CPU: Intel Core i5-2500K (3.3 GHz) or equivalent or AMD FX-8320 (3.5 GHz) or equivalent  GPU: GeForce GTX 760 (2048 MB) or equivalent or Radeon HD 7870 (2048 MB) or equivalent  RAM: 8192 MB © 2016 and published by Deep Silver, a division of Koch Media, Austria. Developed by Deep Silver Dambuster Studios. Homefront, Deep Silver and their respective logos are trademarks of Koch Media GmbH. Portions of this software are included under license  © 2004-2016 Crytek GmbH. All rights reserved. Crytek, CryEngine and their respective logos are trademarks of Crytek Group. All other trademarks, logos and copyrights are property of their respective owners. All rights reserved.</p>", "metacritic": null, "released": "2016-09-28", "tba": false, "updated": "2022-09-28T05:55:57", "background_image": "https://media.rawg.io/media/screenshots/9d3/9d395bd9421f3e738dd92ce7c4e98644.jpg", "website": "", "rating": 3.0, "rating_top": 1, "added_by_status": {"owned": 2, "beaten": 7, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 7, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": [], "genres": ["Shooter"], "publishers": ["Deep Silver"], "esrb_rating": null}