{"id": 290189, "slug": "death-invasion-zombie", "name": "Death Invasion: Zombie", "name_original": "Death Invasion: Zombie", "description": "Shoot, fight off zombies, find the truth, and complete the ultimate revenge in this last age!<br/>Death Invasion : Zombie is a third-person shooter game that gives players the freedom to control the movement and adjust to automatic or manual shooting according to their needs.<br/>This end of the world is not a natural disaster, but a man-made disaster. The Dark Legions has created a zombie virus in order to achieve its own unknown purpose. The virus leaked in an accident and slowly penetrated into the whole world in every corner, including the city where our protagonist lives. The once vibrant town became the city of death. The center of the virus source is where the Dark Legions is located. They have been transformed into the ultimate zombie BOSS, looking for them, embarking on the road of revenge, and completing the ultimate revenge!<br/>Revenge requires strong equipment support, and only when you are fully armed, will you have the opportunity to complete the ultimate revenge. First of all, you have to find a piece of pure land in this last world to provide you with a steady stream of equipment support. You need a good gun to shoot, so you have to build your own arsenal, which is used to forge your own firearms. The strength of the firearms is the foundation of survival.<br/>Second, farmland, warehouses, laboratories, research institutes, watch towers, and exchanges are all essential. They can produce equipment, weapons, props, and talent. These things can increase the character's health, toughness, dodge, movement speed, attack power, while also providing you with the most direct battlefield support.<br/>This road of revenge is destined to be hard, but you have faith, you are the embodiment of justice. Remember, don't be kind to any zombies, they need to be redeemed. All you have to do is aim, pull the trigger, fire, and use the gun in your hand to remove all obstacles on the road.<br/>Only when the final revenge is completed, the infected zombies can be freed, and the city of death can regain its vitality! Set foot on the journey, Warriors, Justice is waving to you. Go to survive in this zombie shooting game, and complete the ultimate revenge to save this city of death!", "metacritic": null, "released": "2019-02-01", "tba": false, "updated": "2019-10-22T14:36:09", "background_image": "https://media.rawg.io/media/screenshots/34e/34eda3c7d026353189b5d2648f430400.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sichuan Quleduo Network Technology Co"], "genres": ["Adventure", "RPG"], "publishers": ["Sichuan Quleduo Network Technology Co"], "esrb_rating": null}