{"id": 290188, "slug": "starlit-adventures-golden-stars", "name": "Starlit Adventures Golden Stars", "name_original": "Starlit Adventures Golden Stars", "description": "Become the greatest Starkeeper in the Upper World!<br/><br/>Help Bo and Kikki the Starlit to find and return the stars that Nuru has stolen from the sky and hid across the Lower Lands! Go on epic adventures that will have you explore fantastic worlds, fight nightmarish enemies, collect dazzling treasures, and solve brain-teasing puzzles using an array of Special Suits!<br/><br/>Starlit Adventures is an original action/adventure-platform, free-to-play game for all ages and specially designed for mobile. You’ll have lots of fun with clever controls, adorable and cute characters, beautiful visuals and a wide range of gameplay mechanics to deliver a valuable and memorable experience.<br/><br/>FEATURES:<br/><br/>* CONSOLE QUALITY content for a memorable experience!<br/><br/>* LOTS OF LEVELS in 8 WORLDS, each one with new challenges!<br/><br/>* UNLOCK ALL SUITS with unique special powers and play in different ways!<br/><br/>* OTHERWORDLY BOSSES guard the end of each world and will do anything to stop you!<br/><br/>* RICH VISUALS, beautiful story and unique characters!<br/><br/>* STICKER ALBUM to complete!<br/><br/>* GREAT CONTROLS specially designed for Apple TV!<br/><br/>* VISIT THE INFINITE TOWER and try to go farther!<br/><br/>* OPEN UP CHALLENGES and unlock many more levels!<br/><br/>DISCOVER STARLIT ADVENTURES!<br/>http://www.StarlitAdventures.com", "metacritic": null, "released": "2016-09-23", "tba": false, "updated": "2019-07-29T11:03:05", "background_image": null, "website": "http://www.StarlitAdventures.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rockhead Games", "Rockhead Estudios"], "genres": ["Action", "Adventure"], "publishers": ["Rockhead Servicos em Informatica LTDA", "Rockhead Estudios"], "esrb_rating": "Everyone 10+"}