{"id": 290274, "slug": "reaper-soi", "name": "Reaper SOI", "name_original": "Reaper SOI", "description": "Reaper is the best-of-class reference tool for Magic: the Gathering. It out-gathers Gatherer® and slashes through card sets to find the ones you want  in an instant providing extremely rapid search-and-translate for Japanese and English cards in both languages. <br/><br/>This version features the new 'Shadows over Innistrad' set and was released for for the Tokyo Grand Prix event in May 2016, to help English and Japanese gamers play MTG together. <br/><br/>The App was originally written for the Chiba Grand Prix, Japan in 2015, where Judges allowed its use at the tournament who also praised its utility and speed of searching. It was likewise allowed for use this year, and once again praised for its unique searching and card finding system. <br/><br/>Firstly, the cards are shown sorted by their Converted Mana Cost in a stylish, easy-to-read list that can be toggled between their Japanese and English versions depending on your native language and the card's written language. <br/><br/>Secondly, Reaper's unique search interface provides very rapid searching by Mana Cost and Rarity. You do not have to peck out Collector's or Multiverse ID numbers, or switch to another screen to build a search query! Instead, you  simply tap the mana colours of the card you want translated and the datastore finds what you want instantly - there is no waiting for the search results to be returned. You can then select the exact card you want with a touch, flip it to your preferred language, and save it to a Tick List for quick reference later on.<br/><br/>Example: if your opponent plays a card that costs 3 Colorless and 2 White mana to cast, you can tap the Plains button twice, and instantly see a list of cards that match. (You could also tap the Colorless button three times to get the exact card, but since the search happens immediately and displays the few cards that match that cost, this usually isn't necessary).<br/><br/>Reaper is designed to be used during matches in a competitive situation, and has been built for speed from the ground up. It is the fastest system of its kind on any platform - very much faster than Gatherer and Oracle, and since there is so little delay, it is realistic to use it during a match.<br/><br/>To keep Reaper tournament-friendly, all the information in the App is obtained solely from Gatherer/Oracle, and no other information (such as pricing or card evaluation) has been added.<br/><br/>The use of electronic devices at sanctioned events is at the discretion of the tournament referees, but the previous version of the App was very warmly received by players, officials and referees at the MTG Grand Prix event in Chiba, Japan last year.<br/><br/>- Disclaimer &amp; Legal Compliance - <br/><br/>Reaper SOI for iPhone makes use of Wizards of the Coast intellectual property, namely the cards, their names, terms and rules terminology of their game 'Magic: the Gathering' and without challenge of any kind.<br/><br/>The use of this Wizards' property is specifically permitted by their generous Fan Site provision, and all trademarks, reserved names including 'Shadows over Innistrad' and copies of the cards' artwork are therefore properly recognised as belonging to Wizards of the Coast and used in accordance with that provision.<br/><br/>All software design, user interface design, database design, data modelling, and all other software engineering by Lachlan Scott, Senior Code Mage, Fudõshin Design 2015-2016. <br/><br/>I hope this App will be of assistance to the global MTG community and help bring people together to enjoy competing. Our thanks to Wizards of the Coast for their generous legal provisions that make this app possible, and for such a great game!", "metacritic": null, "released": "2015-09-10", "tba": false, "updated": "2019-10-22T14:34:23", "background_image": "https://media.rawg.io/media/screenshots/717/7175364f309f7db276987fb4778e24a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lachlan Scott"], "genres": ["Strategy", "Card"], "publishers": ["Lachlan Scott"], "esrb_rating": "Everyone 10+"}