{"id": 290211, "slug": "citytopia", "name": "Citytopia", "name_original": "Citytopia", "description": "Design, build and run the most extraordinary city in Citytopia™, the new city tycoon building game from the makers of Rollercoaster Tycoon®  Touch™!<br/><br/>KEY FEATURES:<br/><br/>• Build the Most AMAZING City: Discover and place many different types of buildings, ranging from residential to commercial, and industrial to beautiful parks. Each building added develops your skyline, attracts more citizens and helps grow your economy.<br/><br/>• A HUGE Playground: Progressively unlock all the neighborhoods, buy more real estate, and expand your city from a humble hamlet into a sprawling Citytopia. Satisfy your citizens, who aren’t shy to express their thoughts on the town’s state.<br/><br/>• Take on CHALLENGING Missions: Complete a constantly-changing set of missions to level up faster. Stock your fleet of trucks and buses to go on transportation quests earning massive boosts in progression.<br/><br/>• Collect a WIDE COLLECTION of Cards: Open free packs every day to find new buildings, decorations, vehicles and more. Find cards to unlock new creations and upgrade them to boost existing infrastructure. Discover rare and epic cards with outstanding stats like towering skyscrapers and zero-emission vehicles.<br/><br/>Follow the latest news about Citytopia on Facebook and Twitter!<br/>https://www.facebook.com/Citytopia/<br/>https://twitter.com/Citytopiagame<br/><br/>Have fun!", "metacritic": null, "released": "2019-01-31", "tba": false, "updated": "2019-07-29T23:16:53", "background_image": "https://media.rawg.io/media/screenshots/0ce/0cef0b0287ffa6264e58e09bcf795f1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atari"], "genres": ["Strategy", "Simulation"], "publishers": ["Atari"], "esrb_rating": null}