{"id": 290299, "slug": "kids-school-bus-adventure-premium", "name": "Kids School Bus Adventure. Premium", "name_original": "Kids School Bus Adventure. Premium", "description": "School bus has come to our bus stop. Come in, sit down and feel yourself comfortable. Hippy invites you to the new road adventure! Today you are the driver of our school bus. But don’t stay long on this bus stop. Holidays are far away and that means that all the teachers are waiting for their pupils in school. Let’s go! Car traffic is not an obstacle. Our school bus goes through the city. Our destination is school!<br/><br/>Educational games with Hippo are renewed with a new game - kid’s car simulator. You will like this game if you are bored with pretty normal kid’s racing. Normal kid’s racing is monotonous. It is not interesting just to drive a bus, children like adventures. And we will give these adventures to your kids. Hippo school bus is not just kid's simulator. You, like a real bus driver, will catch kids on bus stops and fight rough car traffic. Don’t be sad, if the crash happens. It is not difficult to repair a car, we have all the tools and parts for quick and well-qualified repairing work. Broken wheel? No problem! We have tire jack and spare. Motor is out of control? Not a problem too! Open motor hood and change broken details. It is so interesting and exciting to repair a car. If you suddenly have lack of fuel, petrol station will help you. We will help you to refill a gas tank of school bus and pay for it. When we end up with petrol station, we will have a very responsible task. And remember, there are pupils inside. Teachers are waiting for them. School opens its doors to all the happy pupils till the moment when holidays begin. That’s why we will have a lot of tasks and road adventures.<br/><br/>Have a lot of positive emotions together with your kids! Stay tuned and follow Hippo. Our games for boys and girls will make you and your kids happy.", "metacritic": null, "released": "2017-02-21", "tba": false, "updated": "2019-10-22T14:34:26", "background_image": "https://media.rawg.io/media/screenshots/566/566eca640c9ff7a8c0ed5c53e60cb51c_qfuug2L.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oculist"], "genres": ["Adventure", "Racing"], "publishers": ["CLEAR INVEST"], "esrb_rating": "Everyone 10+"}