{"id": 290269, "slug": "marudai", "name": "Marudai", "name_original": "Marudai", "description": "Marudai is the fastest and most powerful database for Cardfight! Vanguard ©Bushiroad on any  platform, listing every English language card in the game, including the new Generation Stride Trial Decks G-BT01-4!<br/><br/>Its unique interface allows you to rapidly search for cards - or groups of cards, and find them almost instantly, in whichever Booster, Extra Booster, Special, Promo and Trial Deck they were published<br/><br/>Marudai works with three lists: a main Cards List, plus a Clans List and an Expansions List, and either of the Clans or Expansions Lists can be viewed at the same time as thie Cards List.<br/><br/>This makes it possible to see the range of possible selections, the selection you made, AND the effect of the selection at the same time on the same screen (see screenshots).<br/><br/>The filtered cards are clearly shown with their image and key game information; a table index allows you to jump between clans, and a search field lets you filter cards' names; and new Detail View provides a clear list of selected cards' abilities.<br/><br/>Each of the three lists are then 'cross-linked' together, so that the selections and searches in one list  affect the content of the others, so if you select a particular booster in the Expansions List, you can see which clans were included; or if you select a particular clan in the Clan List, you can see which expansions covered that clan. <br/><br/>Plus, the search field is great for sub-clan searches, such as Shadow Paladin 'Revengers', or Gold Paladin 'Liberators' and seeing which expansions have the cards you might want for your decks.<br/><br/>— Release Schedule —<br/><br/>The App is in continual development with improvements now being released every month or so , and to manage Bushiroad's new releases.<br/><br/>Version 1.4 (prev. version) listed 2700+ cards in the 47 English expansions published to date<br/>Version 1.5 (prev. version) provided a major speed increase, and images that remained missing<br/>Version 1.6 (prev. version ) included the BT17 - 'Blazing Perdition ver. EN' release<br/>Version 1.7 (this version) now provides a 'detail view' for card abilities and all the new G-TD cards!<br/>Version 1.71 (late May) will provide any new PR Cards still missing<br/>Version 1.8 (early June) a quick list to help reference card abilities during games<br/>Version 2.0 parallel listings for all Japanese cards <br/><br/>See our website: https://fudoshindesign.wordpress.com/software/ for examples of how Marudai can be useful to you, and for more information about future releases.<br/><br/>— Legal Compliance —<br/><br/>Marudai for Cardfight! Vanguard is an app by Fudõshin Design that supports the trading card game Cardfight! Vanguard, owned and © Bushiroad - All Rights Reserved. <br/><br/>Fudõshin Design is not affiliated with Bushiroad, and the images, card names, data and game terms are obtained directly from their official Cardfight!! Vanguard Official Portal Site (http://cf-vanguard.com/) and redisplayed as-is, in accordance with the guidelines stated there, without alteration, claim or challenge of any kind. <br/><br/>The clan images in the Clan list picker were initially developed by Alice, of V-Mundi.com (the best cardfight site on the web), and used by permission. Thanks, Alice!", "metacritic": null, "released": "2014-11-21", "tba": false, "updated": "2019-10-22T14:34:23", "background_image": "https://media.rawg.io/media/screenshots/986/9866067b1aade4853223c4837d0730f8.jpg", "website": "https://fudoshindesign.wordpress.com/software/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lachlan Scott"], "genres": ["Strategy", "Card"], "publishers": ["Lachlan Scott"], "esrb_rating": "Teen"}