{"id": 290204, "slug": "gangstario", "name": "Gangstar.io", "name_original": "Gangstar.io", "description": "WELCOME TO THE CRIME CITY OF URBAN MIAMI!<br/><br/>The cops are chasing in numbers but can you run them all to make a mafia team to play a numbers game? Gangstar.io game is made for the fans of .io games who love to strategize and solve the puzzles of growing and evolving. As you grow your gang picking up each mafia member, there's a huge chance of you getting caught. Make sure to loot coins on each run so that it becomes easy for you to unlock bigger, stronger and powerful gang members. Download the free .io game on your iPhone now and have smashing action-arcade fun with your doodle army full of mafia and gangstars.<br/><br/>In Gangster.io, the rules of survival are simple. Play hide and seek with police by dodging them throughout the city of Miami. Beware of the potholes, roadblocks, cars and other traffic so that you don't slow down or even get caught. Once you spawn at this urban crime city, run fast and get maximum brutes on your mafia team. Don't forget to collect the loots so that you can unlock and hire some of the brutal mafia members. PS: Running zig zag will help you only if there are no cops running opposite to you!<br/><br/>Top Features<br/>- Battle Royale Team Mode<br/>- Large map to run around, hide and seek coins.<br/>- A realistic city with trees, vehicles, potholes and road blocks.<br/>- A new weather to enjoy each game<br/>- Multiple Touch Controls - Multi-Tap or Use Virtual Joystick<br/>- Gang up to loot more from streets.<br/>- Use loot coins to get new brutes or doodle army for your gangstar.<br/>- Play free games anytime you want - No internet required for this urban crime.<br/><br/>Upcoming Features<br/>- New gangsters or skins (Imagine the Godfather)<br/>- Move away from Miami and make new urban crime cities (Italy, Vegas, Tokyo and more..)<br/>- Daily, weekly and monthly gangstar and loot quests (more fun baby!)<br/><br/>Get your iOS friends to the gang so that you can have fun together when our new update is launched.  Our upcoming update will have a real time PVP battles which is equally addictive and entertaining. Also, brag about the escape strategies of your gangstar with your friends with just a tap of social sharing feature. <br/><br/>In case you need any assistance for your gangstar or have a feedback, shoot a mail to support@gamebettr.com.", "metacritic": null, "released": "2018-10-12", "tba": false, "updated": "2019-10-22T14:34:20", "background_image": "https://media.rawg.io/media/screenshots/69e/69eddad7782b31c52ff52ef93a866546.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DOD Media Group"], "genres": ["Action", "Arcade"], "publishers": ["DOD Media Group"], "esrb_rating": null}