{"id": 290357, "slug": "sleeper-agent-7-vr-intro-vignette", "name": "SLEEPER AGENT 7 VR intro vignette", "name_original": "SLEEPER AGENT 7 VR intro vignette", "description": "<p>SLEEPER AGENT 7 VR is a game project in development utilizing Google's Cardboard VR system and any Cardboard compatible headset along with a standard game controller in a First Person Shooter scenario. You play as an agent with amnesia whose only memories are fuzzy and of near constant training with weapons while being subjected to various mind control processes including torture, hypnosis, the use of psychedelic drugs, and possibly even surgical procedures. The object of the game being to either \"accomplish the mission\" whatever that may prove to be, or maybe to find out who is behind the curtain controlling you as a puppet and deal with them as you see fit, while not becoming a patsy, or being arrested and locked up as a paranoid psychotic conspiracy theorist. This intro release is to primarily test the user  interface and some of the game mechanics. As usual there is hidden content with rewards for whoever happens to find it.</p>\n<p>THIS GAME REQUIRES A GOOGLE CARDBOARD COMPATIBLE HEADSET AND STANDARD GAME CONTROLLER.<br/><br/>Use Gaze for 3 seconds to pick up interactable items.</p>\n<p>Look down to see your inventory.</p>\n<p>Gaze at the inventory item to equip and de equip an inventory item.</p>\n<p>Use the Left Joystick on your game controller to Move ,  Up = Forward,  Down = Back, Left = Strafe Left,  Right = Strafe Right.<br/></p>\n<p>Use the Right Joystick vertical axis to rotate,  Left = Left Rotate, Right = Right Rotate</p>\n<p>Use the A or Fire 1 button to Shoot</p>", "metacritic": null, "released": "2019-02-03", "tba": false, "updated": "2019-02-04T03:20:18", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e1788554896c46ca210f34451664de4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Argonaut"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}