{"id": 290306, "slug": "scan-splat", "name": "scan & splat", "name_original": "scan & splat", "description": "Download scan &amp; splat to see the Jucee characters come to life! <br/><br/>Simply open the app, point your device's camera at the logo on a label then tap your screen.  (You can also download the labels for free from our website - Jucee.co.uk)<br/><br/>Using the latest augmented reality technology, our Jucee characters will fly off the bottle, eventually splatting on your screen. Watch out, you may have to move your device to catch 'em.<br/><br/>How quickly can you fill your screen?<br/><br/>Here's who to look out for from the Jucee Crew: <br/><br/>Ozzie Orange - Always smiling, Ozzie Orange loves a good prank. He's the closest thing to a leader within the Jucee Crew and loves bouncing around whilst dancing to his favourite band - the Happy Mondays.<br/><br/>Archie Apple - The most hyperactive apple you will ever meet, Archie has a personality that is 100 mph. He likes rocking out, watching films and playing jokes on Peggy Pineapple.<br/><br/>Barry Blackcurrant - Also known as 'Baz' by his peers, Barry Blackcurrant is the smallest of the crew, but by no means the quietest. His clumsy nature causes havoc at times, but he always means well. <br/><br/>Susie Strawberry - A winner of the Teenage Dance Challenge 2015, Susie loves practising her pirouettes and having picnics in the park. Her bubbly personality is contagious and will have you in giggles. <br/><br/>Rosie Raspberry - Roise is the brains of the gang. She knows how to have fun but works hard and focuses on planning her successful future. She likes everything Disney and knows the words to every song by Pink.<br/><br/>Charlie Cherry - Whilst being the fittest of the crew, Charlie Cherry enjoys a lot of outdoor activities including mountain biking, hiking and rock climbing. His best acheivement is bouncing the highest out of the whole crew. <br/><br/>Peggy Pineapple - Peggy loves her Amercian sports. She watches American Football regularly and can even do a 360 flip on her skateboard. She's a proud tom-boy and rocks out to both Busted or Mcfly, but never at the same time.<br/><br/>Try scanning different bottles/labels to meet the whole crew:<br/><br/>- Orange<br/>- Apple &amp; Blackcurrant <br/>- Cherries &amp; Berries<br/>- Summer Fruits<br/>- Orange, Lemon &amp; Pineapple<br/><br/>You can also download the labels for free from our website - Jucee.co.uk", "metacritic": null, "released": "2016-07-04", "tba": false, "updated": "2019-10-22T14:34:27", "background_image": "https://media.rawg.io/media/screenshots/d9f/d9f18716ac996cd9a44ba94c7a3aa358_nBTsgCn.jpg", "website": "http://www.jucee.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Studio Liddell"], "genres": [], "publishers": ["Studio Liddell"], "esrb_rating": null}