{"id": 290455, "slug": "tichess", "name": "TIChess", "name_original": "TIChess", "description": "<p>Simple Chess game for TIC with random AI player (empty computer screen) and two Minimax players with stochastic choices on the branching paths and maximum branching set. Second minimax player explores the search tree more deeply than the first. Second minimax player (angry face) should take a while to compute his moves.<br/>Better played with between two human players. Putting two angry computers one against the other is not recommended. AI's may take some time to compute their actions (About 6 minutes for hard AI).<br/>The game's code is a mess but should be well commented enough so that you can understand it. If you want any help understanding it just send me a message on itch.</p>\n<p>Controls:<br/>* Arrow keys to move cursor on table and on menus.<br/>* A (z on keyboard) Selects pieces and selects options on menu<br/>* B (x on keyboard) cancels the selection of a piece and leaves in-game menu.<br/>* X (a on keyboard) opens in-game menu<br/>In-game Menu help:<br/>* Arrow resumes the game<br/>* Select a player's icon to cycle it between human, random AI, Easy Minimax AI and \"Hard\" Minimax AI.<br/>* Select the looping arrow to restart the game.<br/>* Click on the door if you're a heartless person.</p>\n<p>KNOWN BUGS:<br/>* When two AIs are battling it out, the \"AI thinking\" icon shows the faster AI, not the correct one.</p>\n<p>WON'T FIX:<br/>* No audio is intentional. Audio on these kinds of games tended to be what I hated most as a child.<br/>* Cursor points to where the AI moved its piece to help the player identify what move was made.<br/>* I don't plan on adding animations.</p>\n<p>Made by USPM for the FFS2019 game jam.</p>", "metacritic": null, "released": "2019-02-03", "tba": false, "updated": "2019-02-04T03:33:25", "background_image": "https://media.rawg.io/media/screenshots/94b/94b34a9a60592ccb12134d32f2419add.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "Web"], "developers": ["Um Singelo Pug Manco"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}