{"id": 290534, "slug": "i-wanna-go-home-2", "name": "I Wanna Go Home (itch)", "name_original": "I Wanna Go Home (itch)", "description": "<p><strong>I Wanna Go Home</strong></p>\n<p>Global Game Jam 2019 - NYU Game Center (Brooklyn Site)</p>\n<p>Won: <strong>Best Overall Game, Best Audio</strong></p>\n<p>Nominated: <strong>Best Visuals, Best Narrative, Best Game Design</strong></p>\n<p><strong>Controls: </strong></p>\n<p>Z - Select Option, Interact</p>\n<p>Arrow Keys / WASD - Move</p>\n<p><strong>Summary:</strong> <em>I Wanna Go Home</em> is a 2D narrative game about attending a high school party as the “new kid in town”, and working up the confidence to talk to a dozen party goers, and, hopefully, not be the “new kid” anymore.</p>\n<p><strong>Mechanics: </strong>The primary mechanic in <em>I Wanna Go Home </em>revolves around the gaining and losing of confidence. By being honest, you can make new friends and gain confidence. But like in real life sometimes you say the wrong thing without realizing it and that social snafu leads to you losing confidence.  Some characters will be pretty intimidating, so you’ll need a lot of confidence to speak with them.</p>\n<p>If making new friends is proving difficult, you can try drinking to boost your confidence. However, drinking makes it harder to communicate by scrambling your dialogue choices. If you drink too much you won’t have any idea of what you’re trying to say until you’ve already said it. </p>\n<p>Having enough confidence allows you to talk to more and more intimidating members of the party, until you finally have enough confidence to talk to Ivy, your school crush.</p>\n<p><strong>Credits:</strong></p>\n<p>Featuring the Game Design work of Emi Schaufeld and Michael Fegreus</p>\n<p>The coding and unity development of Michael Fegreus and Rebecca Jones, with Yarn assitance from Harry Rabinowitz and Emi Schaufeld</p>\n<p>\r\nBrilliant writing by Harry Rabinowitz, Emi Schaufeld and Magnolia Porter</p>\n<p>Art: <em>I Wanna Go Home</em> features hand drawn characters, backgrounds, and animations by our amazing artists and illustrators. With work from Corinne Stein, Courtney Sanders, Magnolia Porter, and Rachel Jones</p>\n<p>Music: <em>I Wanna Go Home</em> includes digital sounds as well as an original score performed and recorded by our amazing musical Andy Bow and Trent Garlipp. A large variety of string instruments, including acoustic guitars, bass guitar, and ukulele were used to create “themes” for the various characters in the game! </p>\n<p><strong>Statement on Alcohol and Consumption:</strong></p>\n<p>We do not associate drinking with being a confident person, nor do we encourage unsafe drinking practices. <em>I Wanna Go Home</em> borrows a lot from the team’s personal experiences with alcohol and high school parties. This game is meant to emulate these experiences.</p>", "metacritic": null, "released": "2019-02-03", "tba": false, "updated": "2019-02-04T03:43:57", "background_image": "https://media.rawg.io/media/screenshots/1dc/1dcbb5e43d9d48004fc7d6245e25f7ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["michael.fegreus"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}