{"id": 29069, "slug": "fifa-10", "name": "FIFA 10", "name_original": "FIFA 10", "description": "<p>FIFA 10 is a football game, the 17th installment in FIFA series. The game was released in 2009 on the all platforms — handhelds and stationery — possible, making its way through a total of 10 gaming platforms covering the sixth and seventh generation of video game consoles.</p>\n<h3>Manager Mode changes</h3>\n<p>The mode was rebuilt when compared to the previous parts of the game due to the vast amount of critics towards it. The &quot;Total Football Experience&quot; was added to see the latest transactions and game changes transparently. The finances question were put on hold and changed the correlation of forces from the sponsor&#39;s side to the director&#39;s.<br />\nThe manual experience system from the previous part was also cut.</p>\n<h3>Gameplay</h3>\n<p>The gameplay is generally not changing across the series. The minor changes are set into the fields of stadiums: 50 stadia from Europe and all over the world. <br />\nThe game also features 500 teams which are divided into 30 leagues. Russian premier league makes its first appearance in FIFA series in the 10 chapter. <br />\nThe gameplay process is accompanied by voiceover commentaries in twelve languages. Every featuring speech supports about 30 thousand remarks each.</p>", "metacritic": 84, "released": "2009-09-30", "tba": false, "updated": "2024-04-07T05:51:45", "background_image": "https://media.rawg.io/media/games/297/297bb5ec95c05e3d5778d352ee304813.jpg", "website": "http://fifa.easports.com/home.action", "rating": 3.47, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 687, "beaten": 130, "toplay": 7, "dropped": 98, "playing": 2}, "playtime": 0, "achievements_count": 102, "ratings_count": 208, "suggestions_count": 444, "game_series_count": 30, "reviews_count": 208, "platforms": ["PlayStation 3", "Xbox 360", "PC", "PSP", "Wii", "PlayStation 2"], "developers": ["Electronic Arts Canada", "HB Studios"], "genres": ["Sports"], "publishers": ["Electronic Arts"], "esrb_rating": "Everyone"}