{"id": 2906, "slug": "mutant-fridge-mayhem-gumball", "name": "Mutant Fridge Mayhem - Gumball", "name_original": "Mutant Fridge Mayhem - Gumball", "description": "FOOD FIGHT! Team up as Gumball, Darwin, and Anais to take down the mutant leftovers! <br/><br/>DESTROY ALL LEFTOVERS!<br/>Dad's expired jelly has mutated everything in the Watterson's refrigerator! Now Gumball, Darwin, and Anais are all that stand between Elmore and total mutation domination! Dish out the destruction across 30 different levels! <br/><br/>CHOOSE YOUR CHARACTER!<br/>Switch between Gumball, Darwin, and Anais to defeat swarms of mutant food. Each character has his or her own special abilities. Gumball throws a rampaging temper tantrum; Anais uses the power of Daisy the Donkey to heal her teammates; and Darwin uses a bubble shield to block attacks.<br/><br/>MANLY POWER-UPS!<br/>Man up! Give your characters manly mustaches to transform them into burly fighters. Or lock and load with the tennis ball cannon. That rotten grub won't stand a chance.<br/><br/>MUTANT FRIDGE MAYHEM - It's the ultimate food fight!<br/><br/><br/>**************** <br/><br/>If you're having problems with this app, contact us at advanced.platforms@turner.com. Tell us about the issues, your device &amp; OS version. <br/><br/><br/>**************** <br/><br/>IMPORTANT CONSIDERATIONS: <br/>App includes option to buy in-game items with real money, costing $1.99-$9.99USD (or equivalent in applicable regional currency). You may disable in-app purchases if you adjust your device settings. <br/><br/>iOS will keep you logged on for 15 minutes after an initial in-app purchase. Additional purchases won’t require a re-entry of your password during this 15-minute interval. This is a function of the iOS software and not within our control. <br/><br/>This app may contain ads for Cartoon Network &amp; our partners’ products &amp; services. <br/><br/>PRIVACY INFORMATION:  <br/>Your privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc.  This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below.  This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services.  Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes.  By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device.  The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Apple, Inc.  Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Apple or your wireless carrier.<br/><br/>Terms of Use: http://www.cartoonnetwork.com/legal/termsofuse.html <br/>Privacy Policy: http://www.cartoonnetwork.com/legal/privacy/mobile.html <br/><br/><br/>********************************** <br/>If you're having any problems with this app, feel free to contact us at advanced.platforms@turner.com. Tell us about the issues you're running into as well as what device and OS version you're using.", "metacritic": null, "released": "2012-12-13", "tba": false, "updated": "2019-07-29T10:38:43", "background_image": "https://media.rawg.io/media/screenshots/6eb/6ebab7b43c090ee165efe6e065c31513.jpeg", "website": "http://www.cartoonnetwork.com/apps/gumball/mutant-fridge-mayhem/", "rating": 4.33, "rating_top": 5, "added_by_status": {"owned": 3, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS"], "developers": ["Cartoon Network"], "genres": ["Action"], "publishers": ["Turner Broadcasting System"], "esrb_rating": "Everyone 10+"}