{"id": 290722, "slug": "wampus", "name": "Wampus", "name_original": "Wampus", "description": "<p>Wampus is an overhead arcade narrative adventure game developed for the Nintendo Entertainment System -- yes, the original NES!</p>\n<p>Wampus takes place in the world of Irata, first introduced in the obscure economic simulator game M.U.L.E in 1983.</p>\n<p>Irata is a planet invaded by colonialists farming and mining the land for its natural resources. These resource-stripping activities threaten the local flora and fauna, especially the Mountain Wampus, who get hunted for their treasure.</p>\n<p>As a young wampus, players set out to rid Irata of the settler invaders and restore harmony to the land. While a fun lark, Wampus explores themes of environmentalism, conservationism, stewardship of the land, and the destructive nature of colonialism.</p>\n<p>Wampus takes 25-60 minutes to complete, depending on skill and experience.</p><p>FOR BEST EXPERIENCE: I recommend getting an original NES controller and a USB adapter for it. You can find one here or here.</p>\n<p>* * *</p>\n<p>Wampus was made possible thanks to NESMaker, an engine developed to make NES development a reality for people who are not versed in assembly language.</p>\n<p>In order to play Wampus, you'll need an NES emulator. I recommend FCEUX. Many emulators do not have mapper 30 support, which is the mapper NESMaker uses for its games. </p>\n<p>Once you have FCEUX downloaded, start it up and open the Wampus.nes ROM. The game should work fine.</p>\n<p>I don't know of an NES emulator for Mac that supports Mapper 30 yet, but if I find one, I'll update this page.</p>\n<p>* * *</p>\n<p>While essentially complete, I will continue to make changes to Wampus over the next year.</p>", "metacritic": null, "released": "2019-02-01", "tba": false, "updated": "2019-08-28T23:18:07", "background_image": "https://media.rawg.io/media/screenshots/fed/fed1a356be8375a89ab3fa4db65128ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 4, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["John Vanderhoef"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}