{"id": 290883, "slug": "puzzle-bobble-galaxy", "name": "Puzzle Bobble Galaxy", "name_original": "Puzzle Bobble Galaxy", "description": "<p>Puzzle Bobble Galaxy is a puzzle video game developed by Lancarse and published by Taito for the Nintendo DS. It was first released in Japan under the title Space Puzzle Bobble on December 18, 2008. It was later released in North America under the title Space Bust-A-Move on July 28, 2009, and in Europe under the title Puzzle Bobble Galaxy on August 28, 2009.</p>\n<p>As with the previous games in the Puzzle Bobble series, the player controls a pointer on the bottom of the screen (with either the gamepad or Taito&#39;s paddle controller) that shoots differently-colored bubbles upwards. The object is to shoot bubbles at other bubbles of the same color at the top of the screen. When a group of three or more bubbles that touch each other are formed, then that group disappears. The objective is to clear the screen of all bubbles. Players can pick up various power-ups during the course of gameplay, such as stars that clear the playing field of all bubbles of a specific color or a flame that destroys a group of bubbles, regardless of color, within a certain radius. The levels remains the same, with some levels containing boss battles. The game includes a story mode, in which players go through eight &quot;worlds&quot; that reveal a story. It also includes a mode in which players can compete against other users via a Nintendo Wi-Fi Connection.</p>", "metacritic": null, "released": "2009-08-28", "tba": false, "updated": "2019-02-07T22:08:23", "background_image": "https://media.rawg.io/media/screenshots/095/0953a64e663e67e138639442dccdc29d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo DS"], "developers": ["Lancarse"], "genres": ["Puzzle"], "publishers": ["Square Enix"], "esrb_rating": null}