{"id": 290989, "slug": "bears-restaurant", "name": "Bear's Restaurant", "name_original": "Bear's Restaurant", "description": "Where do we go after we die? And more importantly, what do we eat?<br/><br/>In Bear’s Restaurant, you play as a little cat who just landed a job at the afterlife’s coziest eatery. As the lone waiter assisting the friendly bear who owns the joint, it’s your job to greet the newly deceased, take their orders, and deliver them each a final meal to help their souls rest in peace. <br/><br/><br/><br/>The only problem is, the clientele here come from all walks of death, and in many cases, they’re awfully indecisive. In order to help send these weary spirits to their final destinations, it’ll be your job to dive into their memories and try to decipher what their last suppers should be. In doing so, you’ll get to see firsthand how they lived, how they died, and what foods left the deepest impressions on them while they were alive.<br/><br/><br/><br/>Winner of the Avex Prize at the 2019 Google Play Indie Games Festival in Tokyo, Bear’s Restaurant is a game that’s touched the hearts of players all around the globe, with over a million downloads worldwide. This new-and-improved definitive version features all of the content from the original iOS/Android release, full widescreen display, and controller support, plus an all-new epilogue chapter that’s sure to answer those lingering questions.<br/><br/><br/><br/>If it’s epic battles, mind-bending puzzles, or state-of-the-art cutscenes you’re after, you won’t find them here. But if you’re in the mood for a shorter, more wholesome experience—one that’ll fill your heart like a home-cooked meal you’ll remember for years to come—look no further.<br/><br/>[Content Warning]<br/>While this game does not include any graphic imagery or gore, please be aware that the story does touch on a wide range of potentially distressing subject matter, such as murder, suicide, and various other manners of death that may be traumatic for some players (e.g. illness, traffic accidents). User discretion is advised.", "metacritic": null, "released": "2019-02-06", "tba": false, "updated": "2024-03-03T18:04:02", "background_image": "https://media.rawg.io/media/screenshots/bfe/bfe3f0baa620c559de4cead3324fa33a_zzzF8XH.jpg", "website": "https://daigostudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "beaten": 3, "toplay": 1, "playing": 1}, "playtime": 60, "achievements_count": 5, "ratings_count": 3, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS", "Linux", "iOS"], "developers": ["Odencat", "Daigo Sato"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Odencat", "Daigo Sato"], "esrb_rating": null}