{"id": 290925, "slug": "riscord", "name": "Riscord", "name_original": "Riscord", "description": "Riscord is a text-based visual novel that takes place inside of an instant messaging application between the summer of 2016 and the summer of 2018. You’ll explore relationships with multiple college / sixth form students such as Lizzy, Peter, Laura, Austin and many more to be announced. Each decision made will impact the narrative of the game in various ways; the ramifications of these actions may not be felt until many episodes later, but some of the smallest actions will have some of the most significant consequences.<br/><br/>Riscord will cover various controversial issues such as cyber-bullying, gender identity, mental health and much more during through its entirety. If you are currently experiencing any of these, please reach out and talk to someone.The Riscord Universe<br/>Riscord is the foundation for an interconnected games universe known as The Riscord Universe. It will feature colourful personalities, stories and adventures that get expanded upon with each new release. We can’t wait to show what we have planned for our upcoming interconnected universe.Features<ul><li>Multiple Endings triggered by your dialogue choices, friendships and actions within the Riscord messaging client.<br/></li><li>Server-Wide and Independent Conversations with branching paths.<br/></li><li>Profile pictures, customizable social media accounts and nicknames.<br/></li><li>Featuring Independent Artists such as Seagulls, The Bar Stool Preachers and many more.<br/></li><li>Transmedia Storytelling.<br/></li><li>A refined stylish interface you see and use every day.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:43", "background_image": "https://media.rawg.io/media/screenshots/93e/93e92603f92dac9d402b53e3548a0af7.jpg", "website": "http://www.radsheepstudios.co.uk/riscord", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rad Sheep Studios"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Rad Sheep Studios"], "esrb_rating": null}