{"id": 290986, "slug": "fashion-boutique-cash-register-fun-cashier-counter", "name": "Fashion Boutique Cash Register – Fun Cashier Counter Simulator Game", "name_original": "Fashion Boutique Cash Register – Fun Cashier Counter Simulator Game", "description": "From the makers of Supermarket Cash Register Free, another fun filled cash management, mobile game with additional focus to improve your mathematics and calculation skills. <br/><br/>Money management will now be an easy task with the latest addition of Fashion Boutique Cash Register in which point of sale is briefly described with cashier pro abilities.<br/><br/><br/>Your role as cashier is to maintain the money management at fashion boutique through proper usage of credit card machine and cash register. Not only just boutique but detailed levels will also provide a chance to maintain a cash register at various points of sale such as grocery store and supermarket as well.<br/><br/><br/>This super interesting cash management game provides fine learning of reasoning and calculating skills in various environments. You are equipped with credit card machine and cash register machine to run a smooth point of sale with no errors and mistakes.<br/><br/><br/>To get the maximum insight, detail to deal with the customers and managing cash register machine, Fashion Boutique Cash Register has all these features. Just download it and get the realistic learning platform to enhance your financial know how and different operations in money management.", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-10-22T14:34:33", "background_image": "https://media.rawg.io/media/screenshots/7e7/7e79071dfc76797aa34cd9bf675419ea_GYTxCL3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appricot Studio"], "genres": ["RPG"], "publishers": ["Appricot Studio"], "esrb_rating": "Everyone 10+"}