{"id": 290910, "slug": "interrogation", "name": "Interrogation", "name_original": "Interrogation", "description": "Interrogation is a difficult noire detective game about ethics, morality, radicalization and the nature of authority. Strategically manage the special police department tasked with bringing down a terrorist organization which threatens the very structure of society: The Liberation Front. Uncover their mysteries in iconic movie-like Interrogation scenes, using a complex conversation simulation system. Solve hard conversational puzzles by psychologically manipulating realistic suspects. Decide their fate, your fate and the city’s. <br/><br/><strong>Features:</strong><br/><ul><li>Deep and increasingly difficult conversational puzzle gameplay - each interrogation can be approached in several thousand ways<br/></li><li>Complex psychologically realistic characters<br/></li><li>A story that studies important contemporary topics: political radicalization, abuse of power and mental health<br/></li><li>3 different world-defining endings<br/></li><li>Intricate department-management strategy gameplay<br/></li><li>Atmospheric noir art and music<br/></li><li>Character art rotoscoped over actor footage</li></ul><strong>Gameplay</strong><br/>The interrogation scenes are the core of the game. You will engage in real conversations, needing to emotionally manipulate the suspects in front of you into a confession. You can do this by asking questions, pressing contradictions and tensions in their statements, but also through \"enhanced\" interrogation. Understanding their backgrounds, and thus their motivations, is key in choosing whether to approach this task through intimidation, guile or empathy. As the story progresses this will get very difficult and <strong>you will be deceived</strong>.<br/><br/><br/><br/>In this, the game won't hold your hand. Your choices have consequences and every line you say can make or break the interrogation. Read the reactions of your subjects, adapt your strategy. To what lengths are you willing to go to attain your goals… that is your choice. Your destiny and that of the world is in your hands.<br/><br/><br/><br/>Beating a complex and realistic terrorist organization is no easy task. You will also need to carefully manage a limited budget, skillfully allocate missions to your agents and be cunning in the way in which you talk to the press, politicians or even other members of the police. In Interrogation you need to do all these things and do them well. <br/><br/><br/><br/>The Liberation Front will not be easy to dismantle.<strong>Art</strong><br/>Noire, gritty, immersive and serious, we’ve carefully hand-draw every animation by rotoscoping over 1000 photos of over 40 actors, some of them with more than 40 years of experience on stage. Heavy but smooth soundtracks underlining the mood of each “episode” along the way will bring the foreboding atmosphere to its fullest.<br/><br/><strong>Story</strong><br/>Rich or poor, progressive or conservative, women or men, the Liberation Front's potent lure fills its ranks with people from all layers and corners of society. They want to violently dismantle social order as we know it and to rebuild it from the ground up. Can you stop them? Will you stop them?<br/><br/><strong>Purpose</strong><br/>Interrogation is a narratively immersive convo-puzzle game that challenges common preconceptions about highly relevant contemporary subjects like terrorism, police brutality and the power dis-balances between citizens, the state and large corporations. It thus follows in the footsteps of games like \"This War of Mine\", \"Papers Please\", \"This is the Police\" and \"Orwell\" by being an indie title that tries to raise important moral, ideological and practical questions into the minds of its players. <br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-26T19:57:59", "background_image": "https://media.rawg.io/media/screenshots/77d/77da136eed4888ad1043e74e7194e5d1.jpg", "website": "https://critique-gaming.com/interrogation", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 100, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 8, "ratings_count": 3, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "macOS", "PC"], "developers": ["Critique Gaming"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Critique Gaming"], "esrb_rating": null}