{"id": 290950, "slug": "bubsy-paws-on-fire", "name": "Bubsy: Paws on Fire!", "name_original": "Bubsy: Paws on Fire!", "description": "From the developers of the BIT.TRIP series comes Bubsy: Paws on Fire!, the latest and greatest in bobcat-based gaming.<br />\nOinker P. Hamm is determined to capture every animal in the universe for his “Amazootorium.” Bubsy, fearing mostly for himself, is just as determined to stop him. Two archrivals, stitched together by the cruel knitting needles of fate. No matter who emerges victorious, there is one thing we know for certain: There’s going to be a whole lot of yarn along the way.<br />\nSo, so much yarn.<br />\nFeatures:<br />\nFour playable characters, each with their own unique mechanics! Fly and shoot your way through the air as The Woolie, take it underground with Arnold’s bonus levels, or run your way to victory with Bubsy and Virgil Reality!<br />\nAn all-new story featuring the unlikely alliance between Bubsy and his archrivals, The Woolies!<br />\nOver 100 levels set across three different worlds!<br />\nThree boss battles!<br />\nA unique combo system and set of leaderboards for every character!<br />\nA shop with costumes and cosmetics, all of which players can unlock just by playing the game. There are no in-game purchases!<br />\nUnique character dialog for every level!<br />\nA variety of collectible types, ensuring maximum replayability!<br />\nThe return of Oinker, Terri, Terry, and many other characters from previous Bubsy incarnations! We even have Virgil Reality from the Bubsy cartoon pilot—we dug deep!</p>", "metacritic": null, "released": "2019-05-14", "tba": false, "updated": "2019-11-19T18:52:33", "background_image": "https://media.rawg.io/media/screenshots/546/546a523cd00cfc98948fea6c36f9c068.jpg", "website": "https://www.accoladegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 28, "toplay": 2, "dropped": 1}, "playtime": 16, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 308, "game_series_count": 4, "reviews_count": 1, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Choice Provisions", "UFO Interactive Games"], "genres": ["Action", "Adventure"], "publishers": ["Accolade", "UFO Interactive"], "esrb_rating": null}