{"id": 291019, "slug": "fruit-juice-maker-drink-simulator-and-drink-maker-", "name": "Fruit Juice Maker - Drink simulator and drink maker game", "name_original": "Fruit Juice Maker - Drink simulator and drink maker game", "description": "*Peep* *Peep* ….. Let’s take you on an adventurous ride in the juice factory, where you can see how the juices are made. Fruit Juice– Drink Simulator game it’s not just about making juice games, it’s about letting kids learn how juice makers work in the juice factory. Learn how the juice making works, from getting the fruits to sorting out the best fruit for the perfect fruit juice maker. This maker game can be enjoyed anytime.<br/><br/>With this Fruit Juice Drink Simulator, boost your kid’s interest in juice making games and let them be a make juices expert and master of their own crazy factory. Let your kids and girl make their own frozen slushy, drinks, snack food or even soda and watch them become master of kids juice maker instantly with this quick and easy drink maker game. From challenging juice making and drink making to refreshing fruit juice making this maker game has it all. <br/><br/>Key Features: <br/><br/>•\tEasy tap and drag Juice Making<br/>•\tFun and easy, fresh juice making games for everyone.<br/>•\tTons of exciting different fruits to make juices<br/>•\tKid’s friendly content for them to perfect their frozen slushy or even soda skills.<br/>•\tFree and simple girls, kids juice maker games food cooking. <br/>•\tSuitable for the whole family.", "metacritic": null, "released": "2015-05-24", "tba": false, "updated": "2019-10-22T14:34:35", "background_image": "https://media.rawg.io/media/screenshots/f3c/f3ca40678f196c1e392a592fd762cc99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appricot Studio"], "genres": ["Adventure", "Family"], "publishers": ["Appricot Studio"], "esrb_rating": "Everyone 10+"}