{"id": 291020, "slug": "supermarket-girl-cash-register", "name": "Supermarket Girl Cash Register", "name_original": "Supermarket Girl Cash Register", "description": "Prepare yourself for amazing Supermarket Girl Cash Register featuring cashier girl handling cash register in a beautifully designed shopping mall and supermarket environment. This cashier game provides you amazing opportunity to handle cash register with time management skills &amp; perform Christmas shopping from the toy shop or colorful grocery store. Supermarket Girl Cash Register lets you enjoy realistic real-time shopping in a superstore, which also lets you explore various sections of superstore or beautiful makeup. <br/><br/><br/>Supermarket Girl Cash Register lets you play as cashier girl of the shopping mall or colorful superstore, which is highly experienced in handling cash register also handling various customers arriving after Christmas shopping from different stores including toy shop or colorful grocery store along fashion shop and handle them with time management.<br/><br/>Salient Features:<br/><br/>- Highly engaging kids game based play mode.<br/>- Highly engaging various levels designed with cashier app simulation.<br/>- Beautifully designed colorful one-stop shopping in a realistic shopping mall.<br/>- Highly advanced instant payment receiving methodologies including cash, credit card.<br/>- Astonishing interface to shop various items including Christmas toys or high school uniform items.", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-10-22T14:34:35", "background_image": "https://media.rawg.io/media/screenshots/08d/08da393edfb0ba68b6b7f242998fb208.jpg", "website": "http://www.appricotstudio.com/appricot-2d/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appricot Studio"], "genres": ["RPG", "Family"], "publishers": ["Appricot Studio"], "esrb_rating": "Everyone 10+"}