{"id": 2910, "slug": "flight-unlimited", "name": "Flight Unlimited", "name_original": "Flight Unlimited", "description": "*Due to the high quality graphics an iPhone4, iPad, or iPad2+ is required*<br/><br/>------------------------------------------------------------<br/>Experience the ultimate Flight Simulator.  Flight Unlimited is a graphically intensive flight simulator that offers some of the best visuals in the app store.<br/><br/>Critics argue that Flight Unlimited has some of the most impressive graphics ever seen on the iPhone/iPod/Ipad.  <br/>It&amp;#39;s the only flight simulator (on any platform) to offer a fully rendered, detailed city to explore.  <br/><br/>Fly through out the city and explore over 100 buildings and streets.   <br/><br/>Can you land on a one way road?<br/><br/>Never before has a flight simulator offered this level of environmental detail.  <br/><br/>Flight Unlimited pushes the device to its max to offer the ultimate in performance and visual effects.  <br/><br/>Features:<br/>- Pilot the beautiful Cesna 172 and Challenger 300 aircraft, complete with spectacular glass and metallic reflections. <br/>- Discover an expansive city with detail never before seen in a Flight Simulator on any platform <br/>- Explore an expansive lake and buzz the various boats in the water<br/>- Fly from any camera angle you desire<br/><br/>*Flight Unlimited is best experienced with your device set to max brightness*<br/>------------------------------------------------------------<br/>Note: The update is on its way.  It will be massive. If you&amp;#39;ve already downloaded the app the update is free.<br/><br/>- Complete overhaul of the flight physics engine<br/>- A new plane (private jet)<br/>- And more!", "metacritic": null, "released": "2011-11-30", "tba": false, "updated": "2019-10-22T14:28:13", "background_image": "https://media.rawg.io/media/screenshots/142/142183a77ceb5a5c212845b0331ad13a.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TAS Games"], "genres": ["Simulation", "Racing"], "publishers": ["TAS Games"], "esrb_rating": "Everyone 10+"}