{"id": 291120, "slug": "mon-rush", "name": "Mon Rush", "name_original": "Mon Rush", "description": "Funniest little monsters runner game is here! Train your monsters and invade those towns!<br/>Download Mon Rush now!<br/><br/>Mon Rush features: many different type of \"mon\", various locations, HATS, and upgrades!<br/>Mon Rush is easy to play. Simply tap to jump and collect coins. Buy your own hats collection and more!<br/>Mon Rush is all about collection! Control your monsters and run around the cities. Touch the human to transform them into monsters as well! <br/>Mon Rush also has a lot of quests: Complete the quests to get special bonus at the end of each race. More stars more rewards!<br/>Mon Rush is fun to play! The human have prepared the bombs, cars, tanks, and even helicopters to fight our \"mon\". Destroy all and transform those human into monsters too. <br/><br/>In Mon Rush, monsters are able to transform into a collection of monsters with special skills: Ghost, M-Rider, Ninja, Dragon, KinhKong, Midas,... and more! Collect coins to unlock these transformation skills. Each monster have different skills. Ninja can slash everything in front of him. Midas can make everything into coins. And Dragon, the ultimate form of monster, can squash everything under his feet! Remember to upgrade monsters skills to get better transformations. <br/><br/>FEATURES of Mon Rush<br/> - Pixel art runner game<br/> - Cute little adorable monsters. Look at those feet!<br/> - Fun goals!<br/> - Collect coins to unlock transformations<br/> - Tons of daily quests with big rewards!<br/><br/>HOW TO PLAY Mon Rush<br/> - Tap to Jump<br/> - Avoid bombs, cars, helicopters and obstacles<br/> - Don't drop into the alley!<br/> - Collect coins to unlock collections<br/> - Upgrade skills<br/><br/>Download Mon Rush simple runner game now!<br/> <br/>Like Mon Rush? Rate us!", "metacritic": null, "released": "2018-11-30", "tba": false, "updated": "2019-10-22T14:34:38", "background_image": "https://media.rawg.io/media/screenshots/b76/b768e73da53533cf3639d9a6c4959b74_uqWM060.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["vmoga"], "genres": [], "publishers": ["Viet Game Development"], "esrb_rating": "Everyone 10+"}