{"id": 291104, "slug": "gungun-online-shooting-game", "name": "Gungun Online: Shooting Game", "name_original": "Gungun Online: Shooting Game", "description": "Gungun Online is a global real time online shooting strategy game for everyone. With simple drag and shoot mechanic and exciting gameplay, along with illuminating effects, GunGun Online will definitely bring you fun and endless enjoyment.<br/><br/>In addition, GunGun Online has more than 10+ unique mobiles with different way to play: destroy terrain, bungee, magic type, lightning, bomb planting,... Also, the game has up to 30+ strong avatars &amp; fabulous skins to choose from. With different custom modes: 1v1, 2v2, score, death match, ban pick,.., it will help you to improve yourself as you progress.<br/><br/>HOT FEATURES  <br/><br/> * Real-time online multiplayer 1 vs 1, 2 vs 2 mode. Enjoy competing with friends and other players<br/> * Campaign mode: Explore the GunGun Online worlds to gather ingredients to progress to next level.<br/> * Ingame chat system: Chat with your teammates!<br/> * Clan: Build your own Kingdom with your friends.<br/> * Strategic mobiles: Over 10+ different mobiles with unique skills. And more to come! <br/> * Avatar system: Transform into legendary heroes that you love<br/> * Cosmetics: Become fashionista! A lot of Skins to choose from. <br/> * World leaderboard: Best players will be honored with utmost titles and rarest rewards!<br/> * No registration required to play! Play with your Google, Facebook account directly!<br/><br/>HOW TO PLAY<br/><br/> - Select a mobile to join a battle in arena or campaign mode to fight with another players or monsters.<br/> - You will gain points and be awarded medals as you progress. Climb the leaderboard and become the ultimate Dragon!<br/> - There are 4 kinds of mobiles: physic, magic, boom, light. Each kind of mobile has different advantage to different kind of mobiles. Make sure to use this to your advantage.<br/> - There are many different avatars to choose from. Each avatar have unique skill. Using avatar skill at the right moment may turn the tide of the match.<br/> - There are various items to use during the match: dual, heal, teleport, shield. Use these wisely to win the game.<br/> - Shuffle through from different room mode to have a more interesting match: avatar on, avatar off, wind enabled, no wind, 1vs1, 2vs2 score, 2vs2 death match, sudden death.<br/><br/>Join us now and enjoy Gungun Online!<br/><br/> - Check out our latest news and claim Free gifts from the Fanpage: <br/>Facebook: https://www.facebook.com/gungunonline<br/>Twitter: https://twitter.com/GungunOnline<br/><br/> - Or join Gunguners community group: https://www.facebook.com/groups/643250102472955/", "metacritic": null, "released": "2016-01-14", "tba": false, "updated": "2019-10-22T14:34:37", "background_image": "https://media.rawg.io/media/screenshots/0d5/0d54efac111e4187d635d8977c8ad0e7.jpg", "website": "https://web.facebook.com/gungunonline", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["vmoga"], "genres": ["Action", "Strategy"], "publishers": ["Viet Game Development"], "esrb_rating": "Everyone 10+"}