{"id": 291182, "slug": "silk-road-match-3", "name": "Silk Road Match 3", "name_original": "Silk Road Match 3", "description": "Coins rule in this new match 3 adventure game. Grab your camel and travel the ancient trade route from Rome to China during the 1st century AC. Match ancient coins, visit important cities and build your reputation as a master trader. The 6,000km Silk Road will take you from the sunny Mediterranean, through arid deserts, over high mountains and across the Asiatic Steppes. There’s a great fortune to be made here for a skilled trader! Join the thousands that played and loved our preview version.<br/><br/>Your trusty camel companion, Matthias, will guide you along the treacherous route through the Roman, Parthian, Kushan and Han Empires. Be certain to use the correct coins in each location, or you’ll be chased out of town by the gate guards! Visit famous cities, interesting villages and trading posts full of exotic goods. Match ancient coins to unlock puzzles at each stop and build your reputation. Can you earn a high enough status to gain admittance to the next Empire? They won’t let in just anyone; only traders with excellent reputations are allowed to travel the whole route. New coins and exotic goods await you in each culture in this tile-matching video game.<br/><br/>Silk Road Match 3 Game features:<br/><br/>-Match game play with ancient coins from past empires<br/><br/>-Toss an ancient coin in the Daily Reward Fountain for coin prizes everyday<br/><br/>-Over 200+ addictive levels to challenge your skills for trading and matching fun<br/><br/>-Encounter three civilizations (Han Empire -China civilization coming soon), and multiple trading posts and cities along the famous Silk Road<br/><br/>-Each civilization has a gate with a guard requiring a minimum number of stars to enter<br/><br/>-Different tile matching puzzle play: Targeted Score, Timed Puzzles, Drop Down Ingredient Collection, Board Clear<br/><br/>-Unique ingredients available in each civilization<br/><br/>-Fun facts from your camel companion as you travel the Silk Road<br/><br/>-Beautiful and colorful historical scenes<br/><br/>-Quick tutorial level to jumpstart your journey<br/><br/>Game Boosters<br/><br/>+5 moves, +30 seconds, bomb (remove 1 coin for free), random color (randomize color of 3x3 square of coins), swap (swap any two coins for free), +2 wildcards, +5 spinning coins, +5 exploding moneybags<br/><br/>Coin Play is Fun<br/><br/>Isn't it time to move on from candy to something of more value like coins. Say goodbye to jelly, put your hat on, pack up your camel and prepare yourself for adventure on the Silk Road. Our now famous camel \"Matthais\" will keep the journey exciting with sassy comments to keep your pressing on down the long trail. Users love his spirit and expressions he shares following your accomplishments. He will lift your day as you play this game on your commute to and from work.<br/><br/>Solve the puzzles of the Silk Road to make your fortune and become a Master Trader. Your next addictive Match 3 adventure game begins now!<br/><br/>More levels and civilization unlocks are coming soon. Future trading route expansions are planned.<br/><br/>Looking for games you can play offline? No wifi is required to play Silk Road Match 3<br/><br/>Matthais would love to hear from you.  If you love the game please provide a review comment and feel free to send us suggestions.  We prefer to keep our camel happy and his travelers.  Support is also available.", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-07-30T02:04:56", "background_image": "https://media.rawg.io/media/screenshots/56b/56b7fa4213d82a4f5ec3946276742783.jpg", "website": "http://silkroad.dig-itgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dig-It Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Dig-It Games"], "esrb_rating": null}