{"id": 291297, "slug": "sniper-combat-assassinthe-frontline-modern-killer", "name": "Sniper Combat Assassin:The Frontline Modern Killer", "name_original": "Sniper Combat Assassin:The Frontline Modern Killer", "description": "Commando Black Ops Officer! You have been called to infiltrate &amp; clear the extreme remote and dangerous enemy camps with limited of weapons and without any support available at this time in Sniper Combat Assassin: The Fronline Modern Killer. You are expected to clear these extreme remote and dangerous bases at any cost and show the courage and strength for what you have trained for!<br/>The Training:<br/>For Sniper Combat Assassin: The Fronline Modern Killer, there is an extensive commando training level that you have to clear before you will take up the extreme dangerous of the assignment any commando has been assignment before. In this training we will use the advance military commando weapons like berretta, AK47, Shotguns, Cold Commando, Green Bret Knifes, Samurai Swords, Blades etc and survive alone in the extreme environment island. After successful completion of the training you are ready to take these zombies, alien robots, enemy commando bases on your own.<br/>The Missions:<br/>You will be drop in the enemy bases on your own and clear the bases one by one. These enemy bases have been taken by the unique kind of the enemies like zombies, alien robots, and criminal commandos. And you have clear these alone without any external support. You will drop without any weapons and will only have your Green Beret knife with you. You have kill the enemies and use their weapons to kill and survive. <br/>The Sniper Combat Assassin: The Fronline Modern Killer is an action packed shooting war game. Encounter the enemies with advance state of the art weapons: knives, blades, Green Beret knife, samurai swords, armor, Ak-47, shotguns, sniper rifle, cold commando and new destructive lethal weapons. Shoot at site! You are the brave Assassin commando from the army force. Aim to shoot the head shots of your rival, strive hard so that no ferocious terrorist can run away. With every targeted gun shots you would get in practice with your targets.<br/>Your country and countrymen are looking towards to be successful in these extreme frontline commando missions in the history of counter strike history. Failure in these missions will have fatal consequences. <br/>Good Luck and God be with all of us!<br/>Game Features:<br/>- 3D FPS (First Person Shooter game)<br/>- Real Battlefield 3D environment<br/>- Multiple Challenging Counter Strike Missions<br/>- Easy GUI and controls<br/>- Multiple Extreme Enemies AI<br/>- Multiple Advance Weapons Selections <br/>- Genre: Adventure, Action and Thrill", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-10-22T14:34:47", "background_image": "https://media.rawg.io/media/screenshots/1f1/1f183e394e5080513182f9b13b1e2a1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Adventure"], "publishers": ["Liaqat Khan"], "esrb_rating": "Teen"}