{"id": 291203, "slug": "beauty-hair-style-spa-and-salon-for-girls", "name": "Beauty Hair Style Spa and Salon For Girls", "name_original": "Beauty Hair Style Spa and Salon For Girls", "description": "For all the budding hair stylist girls out there, Beauty Hair Style Spa Salon brings the fun experience at the touch of your finger, right on your phone!<br/>Spend time in the hair spa and give a special hair treatment by choosing the finest herbal oil, shampoo and conditioner.<br/>Use dandruff medication to treat the scalp with care.<br/>Wash, rinse and steam the hair to make it shine.<br/>Blow dry with the dryer and the hair is now ready for styling.<br/>Choose the length that suits your style and cut the hair.<br/>Apply the hair style that will give her the most beautiful look!<br/>Now it’s time for coloring! Choose from a variety of colors and apply the streaks or full colors for that amazing celeb look!<br/>And last but not the least, go wild with numerous hair accessories like hair bands, bows, clips, tops and lots of hair bling to get to the ultimate makeover!<br/>Take a photo of your creation to store it. You can also share it with your friends on Facebook.<br/>So don’t wait! Become the best hairstylist and create gorgeous makeovers that even celebs and starlets would covet<br/><br/>Features:<br/>-HAIR SPA treatment with SHAMPOO, CONDITIONER and WASH<br/>-SCALP CARE with HERBAL OIL and DANDRUFF medication<br/>-STEAM and BLOW DRY for shining hair ready for styling<br/>-HAIR CUT to keep the length short or long or medium<br/>-CHOOSE HAIR STYLE for a new look every time<br/>-COLOR the hair with streaks or full color chosen from a wide range of colors.<br/>-ACCESSORIES galore! Top up your creation to complete the best HAIR MAKEOVER !<br/>-ENJOY a step by step HAIR SALON experience<br/>-Take PHOTO and share your pretty look and style with your friends<br/>-Full game for FREE (no in app purchase needed)", "metacritic": null, "released": "2014-07-13", "tba": false, "updated": "2019-10-22T14:34:43", "background_image": "https://media.rawg.io/media/screenshots/b72/b72619f2a8bc4b2d78a98742352f2ca2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAYTINUM SOFTWARE AND MULTIMEDIA"], "genres": ["RPG"], "publishers": ["PLAYTINUM SOFTWARE AND MULTIMEDIA PRIVATE"], "esrb_rating": null}