{"id": 291248, "slug": "baby-kitchen-pizza-little-chef", "name": "Baby Kitchen: Pizza Little Chef", "name_original": "Baby Kitchen: Pizza Little Chef", "description": "Do you like games about cooking? Take charge of the kitchen. In this game you don’t need to grow your cooking skills form the very beginning because you’re already the master chef beyond compare!<br/><br/>It’s lunch time! Hungry? Grab your apron – let’s make delicious pizza! Cook after your favorite recipes or try absolutely new ones. Drag items from the fridge to make your perfect dish. In this kitchen food never runs out, all ingredients are fresh and delivered right from the farmer market so that you could have the perfect setup for preparing delightful dishes! Select your favorite pizza base, add cheese, vegetables and meat. And don’t forget to decorate your masterpiece with a special sauce. Now take a fork and get ready to treat yourself to the tastiest pizza ever! \t<br/><br/>Unleash your imagination! This pizza baking game turns ordinary cooking into a really fun activity! Have fun - experiment with yummy ingredients. Make a veggie pizza or one with super extra meat! <br/><br/>What will you find inside these pizza maker cooking games? <br/>•\tUnlimited open-ended gameplay. Cook delicious food without any pressure. Here’re no inpatient or disappointed clients;<br/>•\tUse lots of different ingredients. Dozens of possible combinations to make your own pizza games;<br/>•\tTap on the prepared pizza to eat it all by yourself!<br/>•\tMaster your cooking talent with pizza making games. Make your creativity work;<br/>•\tStunning decoration to make your dishes look really outstanding;<br/>•\tPreschool cooking games for little kids is fun for kids of all ages and adults as well!<br/><br/>Warning! Don’t play the pizza maker games for kids on empty stomach since the treats in the app look sooooo mouthwatering! Yummy!<br/><br/>Are you hungry for more food best cooking games? Check out other themes in the series!", "metacritic": null, "released": "2017-03-07", "tba": false, "updated": "2019-10-22T14:34:45", "background_image": "https://media.rawg.io/media/screenshots/44a/44a14f712660790fd48dec88e7e9de5f.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gadget Software Development and Research"], "genres": ["Simulation", "Family"], "publishers": ["Gadget Software Development and Research"], "esrb_rating": "Everyone 10+"}