{"id": 291284, "slug": "elite-valet-car-parking-the-extreme-driving-test", "name": "Elite Valet Car Parking: The Extreme Driving Test", "name_original": "Elite Valet Car Parking: The Extreme Driving Test", "description": "Start your engines and get ready for the nonstop thrilling car driving, drifting, racing and parking action in severe traffic conditions that will get you on edge of your seats in Elite Valet Car Parking: The Extreme Driving Test. This will be an extreme car driving and parking test not for the ordinary drivers but for the drivers able to handle different class of super and sport cars in heavy traffic conditions with time is also ticking!<br/>You have multiple deluxe cars, jeeps, 4x4, sports, super cars options to select to show your super-fast driving skills. In Elite Valet Car Parking: The Extreme Driving Test you need to drive your cars on different city routes and reach the parking spot on your given time. These city routes and tracks are loaded with the severe traffic that will test your car and driving skills at the same time. Become an ultimate car transporter with car speeding, drifting, maneuvering and parking skills. Every level and mission will be more challenging and exciting as you move on with the game. This will an ultimate car racing experience that you will get in this additive and non-stop action racing, drifting and parking game with an amazing 3D graphics, smooth gameplay and real controls. You will not stop at any cost until you will finish all the missions and tracks.<br/>You must download this Elite Valet Car Parking: The Extreme Driving Test racing simulation game to feel the action packed super-fast sports cars equipped with high speed nitro, turbo booster and are on the loose in city and highway traffic. Ready to be dazzled and busted!<br/>Extreme Feature:<br/>1)\tBrilliant Graphics &amp; Animations<br/>2)\tGreat camera angles for unique gaming experience<br/>3)\tAmazing Controls and Gameplay<br/>4)\tExciting racing, drifting &amp; parking missions<br/>5)\tNon Stop Action Packed Thrill", "metacritic": null, "released": "2017-05-25", "tba": false, "updated": "2019-10-22T13:55:41", "background_image": "https://media.rawg.io/media/screenshots/02c/02ca5b6222d3e1fd3b7888d66251fb7e_XnGeni4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["RPG", "Simulation"], "publishers": ["Liaqat Khan"], "esrb_rating": "Everyone 10+"}