{"id": 291262, "slug": "angry-battle-choppers", "name": "Angry Battle Choppers", "name_original": "Angry Battle Choppers", "description": "Get to the Choppah!<br/><br/>As you hover high above the chaos of war, the once beautiful tropical jungles have become a battlefield.  The enemy is pursuing you with every helicopter and B-52 stealth bomber they have in their arsenal.  Watch out for heat-seeking missiles coming your way from their military aircraft.<br/><br/> <br/><br/>Show off your superior heli pilot skills and dodge enemy artillery as you fire your weapons and destroy their helicopters and stealth bombers.<br/><br/> <br/><br/>---------------- <br/>Here's how the game works: <br/><br/>Gameplay is simple and becomes more challenging as you avoid obstacles: <br/><br/>- Slide your thumb or a finger on your Helicopter at the left of the screen to move forward, back, up and down to avoid oncoming enemy choppers, B-52 stealth bombers, and missiles.<br/><br/> <br/><br/>- Tap the right side of your screen to fire your weapons at the enemy aircraft<br/><br/>- Collect the Medals of Valor to unlock more advanced helicopters to fight with<br/><br/>- The longer you play, the faster the game moves. Each time you play Angry Battle Choppers, it changes so you never play the same game twice <br/><br/>- Gamecenter Leaderboards let you see how you score compared to other players by how long you're able to survive and grab medals of valor<br/><br/>- Challenge your friends to beat your score!", "metacritic": null, "released": "2013-01-27", "tba": false, "updated": "2019-10-22T14:34:46", "background_image": "https://media.rawg.io/media/screenshots/4ca/4ca1ce80f24757473187a3c3ef176b07_TIEgcxV.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JUDRI LENTA MB"], "genres": ["Action", "Arcade"], "publishers": ["JUDRI LENTA MB"], "esrb_rating": "Teen"}