{"id": 291287, "slug": "heavy-excavator-machine-extreme-dump-crane", "name": "Heavy Excavator Machine: Extreme Dump Crane", "name_original": "Heavy Excavator Machine: Extreme Dump Crane", "description": "Want to test your HTV (Heavy Traffic Vehicle) Excavator machines driving skills? Get ready to handle heavy duty extreme excavator vehicles? These hydraulic muscle excavation cranes are not easy to handle in Heavy Excavator Machines: Extreme Dump Crane. <br/>You have to plan your excavator and digging tasks step by step. First, you need to move excavation crane near to the rubble. Then rotate the excavator to excavate the rubble and dump it into the dumper. Automatic switched control will allow you to drive the dumper, you’ll have to park the loader dumper into the parking spot.<br/>Heavy Excavator Machines: Extreme Dump Crane is for fans of extreme excavation challenges, with real heavy excavator and telescopic crane with extraordinary graphics that will also gratify double parking simulation enthusiasts.<br/>Drive through the high rugged rough terrain with incredible real 3D graphics and animations and with this heavy excavator you can perform all the hydraulic operations like universal winch, rotation, elevation and extension. Use steering that allow easy maneuvering in tight quarters. Test your heavy excavator handling skills at a real construction site with Heavy Excavator Machines: Extreme Dump Crane. <br/><br/>Game Features:<br/>• Easy Steering, Brakes, Lifting and Rotation Controls.<br/>• Incredible 3D Graphics &amp; Environment.<br/>• Multiple heavy duty vehicles<br/>• Challenging  Gameplay Missions<br/>• Real Heavy Excavator Driving Experience.<br/>• Explore the Construction Site environment.<br/>• Complete all Levels of Driving and Excavation<br/>• HD Graphics, Animations and Sound Effects", "metacritic": null, "released": "2017-05-14", "tba": false, "updated": "2019-10-22T13:55:41", "background_image": "https://media.rawg.io/media/screenshots/a6c/a6ce8a07450e24192a72b8292a28745e_PlzvGqR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["RPG", "Simulation"], "publishers": ["Liaqat Khan"], "esrb_rating": "Everyone 10+"}