{"id": 291269, "slug": "virtual-basket-manager-pro", "name": "Virtual Basket Manager PRO", "name_original": "Virtual Basket Manager PRO", "description": "Start your career as Coach-Manager in Virtual Basket Manager PRO (Name Editor! No Adds!)<br/><br/>Choose one of 92 world's teams in 5 different Ligues, sign good free agents, do trades, buy and sell players, train them to improve your results, and manage directly the match (or, if you prefer, simulate it).<br/><br/>- PRO EDITION: With this edition, you can contribute to hold this title for the future, and you will not find adds during the game (except the video you CAN choose to watch or NOT to earn diamonds); and you will also find a little \"live\" editor; in any moment you will be able to change teams names and players-coachs surnames and names. Plus, a start bonus of 40 diamonds!<br/><br/>- GAME AVAILABLE IN 3 LANGUAGES: The only-one managerial basketball game available in 3 different languages: English, Spanish and Italian!<br/><br/>- 92 TEAMS OF THE MOST IMPORTANT CITIES ALL OVER THE WORLD<br/><br/>- 5 DIFFERENT CHAMPIONSHIP LEVELS (League A, League B, League C, League D, First Division)<br/><br/>- MORE THAN 1000 PLAYERS in the database, everyone with different phisical/techniques/mental skills (15 in total, as defense, pass, intelligence,ecc.)<br/><br/>- 7 different special skills for players (sniper, 3-point specialist, general on court, defense's anchor, strong rebounder, closer, tenacious defender)<br/><br/>- You can MANAGE DIRECTLY THE MATCH, or SIMULATE IT  instead.<br/><br/>- You can play SEVERAL SEASON IN LINE, building up a real career as Coach<br/><br/>- At the end of each season, you will fight to advance in upper League or to remain in your League by PLAYOFFS and PLAYOUTS<br/><br/>- Besides Championship, there are CUPS for different series, and one GENERAL CUP between all best teams from all championship levels<br/><br/>- EARN EXPERIENCE POINTS AS COACH, and spend your points to improve you every time that you skip  to a new \"LEVEL\"<br/><br/>- TEAM TRAINING to choose the best combination about session hours between the various skills<br/><br/>- If you will be a powerful winning Coach,  other Teams could ask you if you want to head their bench<br/><br/>- ADVANCED SEARCH to find players, with 5 different kinds of filtering<br/><br/>- SINGLE PLAYERS STATS<br/><br/>- Many STRATEGIES combo during the matches<br/><br/>- REALISTIC BASKET-MARKET, with buying, selling, signs, trades and prolongs<br/><br/>- FAVORITE PLAYERS LIST: You can add \"interesting\" players from other teams!<br/><br/>- DAILY NEWS about market, injuries, matches, training and more<br/><br/>- EXTRA FUNNY NEWS about extra-basketball player adventures<br/><br/>- Sponsorship<br/><br/><br/><br/>Do you have some advices or suggestions for us? Contact us to: vbmm.info@gmail.com<br/><br/>Visit us online on Facebook: http://www.facebook.com/virtualbasketmanager<br/><br/>Follow us on Twitter: https://twitter.com/InfoVbmm<br/><br/>Visit our website: http://angels-games.blogspot.it/<br/><br/>Terms and conditions: https://drive.google.com/file/d/0B-H-6_4oUzambTJ2TjBvM3hMTlE/view?usp=sharing<br/><br/>Privacy Policy: https://drive.google.com/file/d/0B-H-6_4oUzamaDNYaFh3QTNnSVE/view?usp=sharing<br/><br/><br/>Disclaimer: Every surname, name, nationalities, avatar and every other feature about players and coaches are totally random, because generated by the app. Therefore, every connection about people and/or animals and/or things is purely random.<br/>VB MANAGER PRO is a realistic management app, but i's also full of irony and funny situations. Let's not let the fun get out of it!!  ;-)", "metacritic": null, "released": "2016-03-12", "tba": false, "updated": "2019-10-22T14:34:46", "background_image": "https://media.rawg.io/media/screenshots/c5f/c5fb006de6abdf8f62007498cc50078f_rWVoyHD.jpg", "website": "http://www.angelsgames.it/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Luca Angelini"], "genres": ["Strategy", "Sports"], "publishers": ["Luca Angelini"], "esrb_rating": "Teen"}