{"id": 291362, "slug": "boscage-bird-hunting-wildlife-sniper-shooter", "name": "Boscage bird hunting: Wildlife sniper shooter", "name_original": "Boscage bird hunting: Wildlife sniper shooter", "description": "Come on join your duty you are hired by an airport regulatory department as a bird hunter. In boscage bird hunting:  wildlife sniper shooter yours aim is nothing just to clear the area from birds as they are creating problems during flight takeoff and landing i.e. bird collide with airplanes or distract pilots. This game is full of entertain and shooting those who love shooting and hunting must play this game. You become a hunter in this game, some inflatable birds will fly right in front of you. You are going to shoot them down. The more birds you shoot down, the higher score you will get. Sounds easy? Don't lose too many targets, the chance to get to the next level depends on how many birds you shoot in current level, so try your best to aim and shoot. boscage bird hunting:  wildlife sniper shooter designed for shooting action gamers willing to play safari hunting action game with commando silent killer skills on fire hunter sniper guns aim headshots on enemies, birds, sharpen your skill set by using modern x sniper guns, and upgrade your weapon as a special ex-military police sniper commando hunter. Prepare the modern sniper shooting assault commando shooting adventure to show gorilla commando skills like a military assassin with thrilling and exciting sniper bird hunting missions.", "metacritic": null, "released": "2017-04-07", "tba": false, "updated": "2019-10-22T14:34:50", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd497c9eb29d364c2f6d472ba0148e48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Adventure"], "publishers": ["Liaqat Khan"], "esrb_rating": "Mature"}