{"id": 291368, "slug": "dino-hunting-safari-jurassic-adventure-shooting", "name": "Dino Hunting Safari: Jurassic Adventure Shooting", "name_original": "Dino Hunting Safari: Jurassic Adventure Shooting", "description": "The most dangerous of the Predators species are on the Loose! The largest of the carnivorous animal are on the human hunt in the Dinosaur Jurassic safari park. In Dino Sniper Hunter: Deadly Jurassic Safari, you have to hunt the predators before you are hunted. Load your weapons: rifles, shotguns and assault rifles and shooting skills and hunt these furious dinosaurs. The park has been taken by these beasts and they have started killing the humans or other animal in their way. Encounter the non-stop hunting experience with this Dino Sniper Hunter: Deadly Jurassic Safari game.<br/>The only game which lets you see amazing meat-eating dinosaurs in action and challenge them for ultimate survival! This is a hunting simulation that is completely true to life and totally breathtaking. You land on a distant planet inhabited by dinosaurs and progress from a shy wildlife observer to a stealthy and ruthless T-Rex hunter. Journey to a hidden, untouched island and hunt the most ferocious animals in history. Encounter beasts long thought extinct in Dino Sniper Hunter: Deadly Jurassic Safari, from the docile stegosaur us to the terrifying T. rex, Hunt through lush and dangerous environments like the shipwreck-strewn coast, overgrown jungle and dinosaur boneyard! Load up on firepower with destructive weapons like the rocket launcher and shuriken crossbow. You’ll need a powerful arsenal and an expert strategy to take down these beasts! Challenge the hunt with all the dinosaur spices: Apatosaurus, Pteranodon, Spinosaurus, Stegosaurus, Triceratops, Velociraptor and many more, all dinosaurs are with their terrifying roars!<br/>Game Features:<br/>- Non Stop Adrenaline <br/>- Addictive game-play<br/>- Action packed Dino hunting missions<br/>- Smooth and easy controls<br/>- Advance Assault and Sniper Weapons<br/>- High Definition Graphics<br/>- Real Jungle Jurassic Environments<br/>- Best Shooting Game.", "metacritic": null, "released": "2017-05-04", "tba": false, "updated": "2019-10-22T14:34:50", "background_image": "https://media.rawg.io/media/screenshots/158/158ea5e5d97da4ec88294a1d5ef1d468_15ELSwY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Adventure"], "publishers": ["Liaqat Khan"], "esrb_rating": "Mature"}