{"id": 291363, "slug": "drive-auto-flying-rickshawaerial-experince", "name": "Drive auto flying rickshaw:Aerial experince", "name_original": "Drive auto flying rickshaw:Aerial experince", "description": "Tired of playing vehicle simulation games? It's to live your dream with Drive Auto flying rickshaw simulator: aerialist experience. It's not only an airplane that takes a high flight, now you play as auto rickshaw driver. A complete city environment is there to enjoy your road drive and when tired of driving on the roads, let's take off and fly with your auto rickshaw. This is the perfect futuristic game for the lovers of flying simulators. Fly high into the skies and enjoy the thrill of controlling a tuk tuk flight. Everyone want to fly a vehicle? It’s time to get on the racing gears and flying your own Tuk Tuk auto rickshaw. Here Drive Auto flying rickshaw simulator: aerialist experience gives you opportunity for you fulfil your dream and become a tuk tuk pilot.<br/> Enjoy as the tourist travelling inside the city high in the skies. Not only airplanes can fly but it’s your own tuk tuk auto that will fly with wings. Enjoy the flight simulation experience with your own driving vehicle. A new genre in the market of games where your end up enjoying the thrill of flying a vehicle. A free roaming adventure where no objective will stop your air tour. A futuristic concept in the simulation games to fly vehicles and acclaim yourself as a pilot. Drive you auto Rikshaw on the road and let it fly in the air like a flying car or flying bus. You are going to become a futuristic driver of a flying simulator game. Nobody needs an airplane to fly now!!! Relive the old tradition and let’s Drive Auto flying rickshaw simulator: aerialist experience", "metacritic": null, "released": "2017-04-08", "tba": false, "updated": "2019-10-22T14:34:50", "background_image": "https://media.rawg.io/media/screenshots/10a/10abbb30a838216aeecd464dae601c9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Simulation"], "publishers": ["Liaqat Khan"], "esrb_rating": "Everyone 10+"}