{"id": 291361, "slug": "vr-eurocity-bullet-train-extreme-subway-drive", "name": "VR Eurocity Bullet Train: Extreme Subway Drive", "name_original": "VR Eurocity Bullet Train: Extreme Subway Drive", "description": "Get ready to handle the huge and fastest machines ever build by man on this planet earth. Drive and handle the super-fast speeding bullet trains and engines in VR Euro city Bullet Train: Extreme Subway Drive. These extreme heavy duty machines are not easy to handle and drive specially with the speed and momentum these can achieve in a short span of time!!!<br/>Travel through the amazing and astonishing locations on the bullet trains in VR Euro city Bullet Train: Extreme Subway Drive where you are the driver of these bullet trains. You have move one location to another and make stops to pick the passengers waiting on the designated stations. Be careful and be alert for the signs and signals appears as you travel through lighting fast locomotives as it may result in the catastrophic accident or you may have miss your station. Drop off your passengers on their destination stations safe and sound. Time management is very crucial as time is ticking and you may face obstacles and extreme weather conditions to tackle with.<br/>Don’t waste your time and download VR Euro city Bullet Train: Extreme Subway Drive simulation game to experience the one of the best train simulation available on VR. So get your VR cardboard devises and become the ultimate bullet train driver. Speed is nothing to do with the size!<br/>Game Features:<br/>1)\tExcellent VR graphics<br/>2)\tExtreme Heavy Trains<br/>3)\tWonderful locations and sceneries<br/>4)\tAddictive traveling levels", "metacritic": null, "released": "2017-06-02", "tba": false, "updated": "2019-10-22T14:34:50", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fdb6adddbbf199afa40614ef7132c1e_WvD3FyD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["RPG", "Simulation"], "publishers": ["Liaqat Khan"], "esrb_rating": "Everyone 10+"}