{"id": 291372, "slug": "vr-extreme-bike-rider-highway-stunt-racing", "name": "VR Extreme Bike Rider: Highway Stunt Racing", "name_original": "VR Extreme Bike Rider: Highway Stunt Racing", "description": "The most daring &amp; extreme highway motorbike stunt racing game experience is back with a bang. <br/>In VR Extreme Bike Rider: Highway Stunt Racing you are supposed to test your motor bike driving &amp; stunt skills to beyond limits, perform extreme maneuvers, escape the cops, pass through heavy traffic and be a most wanted biker gang leader!<br/>With VR Extreme Bike Rider: Highway Stunt Racing become an underground highway biker leader in to the territory of extreme motor bikers where you are going to enjoy, have fun &amp; get thrilled with top motor bike racing game, this bike racing game includes extreme bike racing, bike attack and motor bike stunts features for bike game lovers. Prepare yourself for a real war game with other motor bikers gangs and whoever stay longer on road will be a real hero and king of the bike kingdom. <br/>Become the most wanted stunt bike racer and smash the gangsters of the city Highway with your kick, punch and bike ride to dodge your enemy bike riders who are coming to attack and let you down in a deadly road accident with cars &amp; so timed your kick shooting, punch shooting and bike jump to flick &amp; fly accurately to get down your enemy in a most dashing way in this war with road thugs of gangster city.<br/>So download now the VR Extreme Bike Rider: Highway Stunt racing cum nonstop action packed game and enjoy the highway biker gangs with amazing VR experience! <br/><br/>Game Features:<br/>1. Amazing VR Racing Stunt Experience.<br/>2. Advance and custom sports bikes.<br/>3. Smooth &amp; Easy game-play.<br/>4. Motor bikes with turbo stunt features.<br/>5. Grip bikes rhythm on max speed.<br/>6. Hit and Destroy Rival Biker gangs.<br/>7. Stunning slow motion feature.", "metacritic": null, "released": "2017-05-15", "tba": false, "updated": "2019-10-22T14:34:50", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cf9664ed81929fcada62ac35322a3d1_tpOQ2n0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Racing"], "publishers": ["Liaqat Khan"], "esrb_rating": "Everyone 10+"}