{"id": 291321, "slug": "sniper-covert-operation-assassin-on-the-kill", "name": "Sniper Covert Operation: Assassin on the Kill", "name_original": "Sniper Covert Operation: Assassin on the Kill", "description": "Battle through the endless war situation, reach at a point where there is no shelter, no place to hide, you are open to fire and there are other soldiers on the hit to go towards you, but the sniper training and complete practice you have got through all this time has made you a Silent assassin sniper shooter to cope up with the battle and warfare situations. With Sniper Covert Operation: Assassin on the Kill get into one real amazing battle in the 3D field. Assassins need assassination to kill and eliminate, find and shot the enemies soldiers. Become an elite survival sniper. Show real men courage, sniper shooting is made exactly for you. Enemies are holding weapons, guns and shooting rifles as well. Be brave, cope up with this situation. Make better plans, to strike the army op opponents, in this war and killing game.<br/>In Sniper Covert Operation: Assassin on the Kill fury gun strike and head shots can give you the complete control over your opponent strike men. Aiming can be made perfect by the focus given on-screen and fire is for shooting. First make an angle then, aim to target and there you go on an Elite Sniper City mission. Multiple challenges in Elite City Sniper game are for those who give time to this game and check the real talent in them.", "metacritic": null, "released": "2017-04-21", "tba": false, "updated": "2019-10-22T14:34:48", "background_image": "https://media.rawg.io/media/screenshots/c4e/c4e80c912b430d6194b6c4f73848d7d8_6x8ymDe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Adventure"], "publishers": ["Liaqat Khan"], "esrb_rating": "Mature"}