{"id": 291359, "slug": "wild-animal-sniper-safari-hunting-adventure", "name": "Wild Animal Sniper: Safari Hunting Adventure", "name_original": "Wild Animal Sniper: Safari Hunting Adventure", "description": "Are you ready to hunt down the most dangerous and deadly predators on earth? Then prepare yourself for the most amazing hunting experience of all time!  Kill before Killed! Hunt before Hunted. This Wild Animal Sniper: Safari Hunting Adventure animal hunting game will test you to the limits to hunt down the most dangerous animals on planet earth. Hunt down the jungle animals in this best first person sniper shooting and hunting game.<br/>Grab your advance weapons and hunting guns and get ready for most exciting Wild Hunting Safari. Wild Animal Sniper: Safari Hunting Adventure will take you across the world where you will hunter in the snow covered Alaskan mountains, desert landscape, lush green forests, dark jungles and safaris. <br/>You can hunt wildlife like deer’s, lions, panthers, stags, elephants, buffaloes, wild boars, beasts of the forest, bears, rhinos, rabbits and other wild animals and wild birds . It became a challenge for expert hunter. <br/>Use your fire to take to take down. Use high power realistic modern weapons like assault, sniper rifles, AK-47 rifle, Beretta and UMP for hunting. Go forward and take a head shot and you will be awarded on accurate head shot. Beautiful rendered scenery and multiple weather seasons. Mini map helps you to hunt with accuracy. <br/>Targeting on running animals is also s challenge for you. Use your modern army sniper shooting skills to kill these animals before they attack on you or runaway.<br/>Wild Animal Sniper: Safari Hunting Adventure game is for all adults, teenagers and family can also play this game.<br/>Game Features:<br/>- Non Stop Adrenaline <br/>- Addictive game-play<br/>- Action packed hunting missions<br/>- Smooth and easy controls<br/>- Advance Assault and Sniper Weapons<br/>- High Definition Graphics<br/>- Real Jungle Environments<br/>- Best Shooting Game.", "metacritic": null, "released": "2017-04-29", "tba": false, "updated": "2019-10-22T14:34:50", "background_image": "https://media.rawg.io/media/screenshots/92d/92d3f00d8eec7b8da2f14c8891f09389.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Adventure"], "publishers": ["Liaqat Khan"], "esrb_rating": "Mature"}