{"id": 291311, "slug": "grand-city-crime-war-clash-of-zombies-gangs", "name": "Grand City Crime War: Clash of Zombies Gangs", "name_original": "Grand City Crime War: Clash of Zombies Gangs", "description": "Load your guns and protect your Grand City from the deadly bloody Zombies. The city is under attack and taken by these undead zombies. In this Grand City Crime War: Clash of Zombies Gangs you need to step up and take back your city from these predators as you are still not infected by the zombie virus. All your city is infected and blood is everywhere. Shoot zombies in the head to be the best killer of the city and survive, or just become another zombie like them. In this Game you will need to manage your Weapons, Shotguns, Axe and bullets and kill every undead before they drive you to your death! <br/><br/>With this Grand City Crime War: Clash of Zombies Gangs encounter the extreme crime zombie hunt where all the city has been terrorized by them. These Zombies gangs are fighting with each other and also infecting any human left in the city. You the only hope for the remaining people left in this brand city. Take your gun and shoot to kill all the undead criminals of your city. Lots of mission &amp; activities of thief auto, Zombie Shooting, drive trucks, shot guns, axes to kill your these predator zombies who are on the human hunt. Hunt them before Hunted! <br/>Pull the trigger and watch extreme kills with nonstop action packed camera angles! In this game you can make zombies bleed a tsunami by shooting them on the face! Become the undisputed zombie hunter and take your city back with a BANG! on Grand City Crime War: Clash of Zombies Gangs!<br/><br/>Game's features:<br/><br/>- Best Nonstop action.<br/>- Realistic Environment and 3D Physics.<br/>- Challenging dangerous levels<br/>- Multiple rifles, shotguns and blades.<br/>- Amazing Gunshot Angles &amp; Effects", "metacritic": null, "released": "2017-05-09", "tba": false, "updated": "2019-10-22T14:34:48", "background_image": "https://media.rawg.io/media/screenshots/498/498f23966dd76006919b02102eaacbc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Liaqat Khan"], "genres": ["Action", "Adventure"], "publishers": ["Liaqat Khan"], "esrb_rating": "Mature"}