{"id": 291564, "slug": "the-beholder", "name": "The Beholder", "name_original": "The Beholder", "description": "<p>This is an RTS style game from the first person perspective set in the late medieval period. I got the idea to make such a blend between genres about 3 years ago, when i was searching the internet for RTS games, since that is my favorite genre of games. And i've always wanted to actually help out my units do stuff, and to my surprise i only found 4 games that had done something like this, but they were all old and outdated to play. So i started making this project. You get to be a king in your own land. You left your home village out of rage of being constrained by society and the monarchy. Everything still functions like a normal RTS, with some exceptions, there are gatherers, buildings to build and military units to control. But you can control and manage everything, if you feel that your gatherers are not producing enough wood, or you just need a bit more for a building and dont have the time to wait, you can simply gather it yourself. If you see an unwinnable fight taking place, instead of watching how your army is defeated, you get to fight with them, or as you command them to attack, you get to be among your brothers in arms as you all storm the enemy. This is my vision for my game and the experience i hope to craft for you. But of course there is automation set in place, if you feel like you dont want to micro-manage everything all the time, you can just sit back and watch your city work. </p>\n<p>Currently the game is in alpha and will not be going into the cliche \"early access indie game\" state. I was planning to only release this game to the public when i feel that it is perfectly playable, but as is i've been developing it by myself for so long that the interest has mostly faded and available dev time has gone down. Although, i might still add some stuff to this in the future, if proper motivation is in place. About 70% of the models and textures are done for the game, the UI is theoretically all made, but i think i will be redoing it completely, since i feel that it doesn't fit with the current feel of the game, nor the end experience. The sound design is about 50% done but i still need to make tunes and background music. I've done a lot of programming so far and the game is really big from that aspect, but a lot more still needs to be done(about 80-90% complete). There was a plan to make this a multiplayer game, but unity has recently announced the scrapping of their multiplayer framework, and the development of a new one, the release date of which is not known at this time; i've never even seen this framework and would have to learn it, but i feel the game was badly programmed for multiplayer support later on, this should have been a huge focus in the early stages of development, so this might never get implemented into the game. There are a lot of models missing still, and more ideas never developed, but the core idea is viewable and explorable as in any game.</p>\n<p>Please leave all feed back you can about how the game functions, feels, looks, etc. All feedback is welcome; if you feel this project was a waste of mine or anyone elses time, do let me know. Perhaps this would motivate me to fix it up a bit. </p>\n<p>I've made a github repo for the game, if anyone wants to contribute. Everything in the game has been constructed from nothing into what you see, only things like audio and texture albedo maps were not created by me. I am a solo dev and always wanted to be, but this project is too much at this time, so i will let it die in honor, by letting it see the light of an itch.io server somewhere, and also let the community have at it.</p>\n<p>https://github.com/BaffledBanana/The-Beholder<br/></p>\n<p>I have written a manual for the game, it is a bit outdated probably, so the information there might not be 100% accurate or some features that the manual talks about might not be in the game. No need to read it all or read it at all, just check out the controls and maybe chapter 9 or the Tl;Dr.</p>\n<p>https://docs.google.com/document/d/1RyFYd4-6DJk4zgdT9u2iXdUilASbXBnd8kbcGpNAm2U/...</p>\n<p>Thank you for checking out the page!</p>", "metacritic": null, "released": "2019-02-06", "tba": false, "updated": "2019-02-08T04:32:46", "background_image": "https://media.rawg.io/media/screenshots/a82/a82ed5ff6569cb394f2edc1504bf337d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NoVowelStudios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}