{"id": 2915, "slug": "dogchild", "name": "Dogchild", "name_original": "Dogchild", "description": "Dogchild narrates the story of the young and enigmatic Tarpak, an impulsive and brave guy with extraordinary abilities: a strong sensory union with nature and a special symbiosis with his inseparable dog, Tarao. Together, they will embark on a journey in search of the truth behind the disappearance, under strange circumstances, of his parents. From them he inherited a considerable fortune, an intelligence to be put to use for those who most need it, and a profound respect for nature which ended up in this strong link with Tarao and other animals. On his journey, they will have to use their abilities and those of their allies to protect the planet from the threat of Cornish Inc., a company with dark intentions which experiments on animals. In their fight against Cornish, they will count on the use of their only weapon: a rubber ball. This, with its movements and rebounds on any surface, will allow them to confront any enemy that gets in their way.<br/><br/><br/><br/>1 player<br/>5GB minimum save size<br/>DUALSHOCK®4<br/>1080p HD Video Output<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>M 3505671 word with graphic, owned by Dario Avalos, 15.09.2014, Nice Classification 9 Vienna classification 02.09.15", "metacritic": null, "released": "2016-01-11", "tba": false, "updated": "2023-11-13T08:09:38", "background_image": "https://media.rawg.io/media/screenshots/380/3809bf354013622dcbf4723dd6e07df5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 15, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 16, "ratings_count": 3, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4"], "developers": ["Animatoon Studio"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}