{"id": 291629, "slug": "rad-rocket", "name": "Rad Rocket", "name_original": "Rad Rocket", "description": "Robots have invented rocket jumping and they need you to test it for them! Use your experimental rocket launcher and make your way up from their secret underground facility all the way up to the surface and beyond!  Get ready for over 2500 meters of precision platforming, rocket explosions and smooth jazz. You will experience a whole lot of failing, falling and getting back up again through seven different zones in this punishing precision platformer.      <br/><br/>No savescumming, no checkpoints... NO MERCY!<br/><br/><ul><li> <h3>Controls: Rocketjump to launch yourself to where you want to go. Easy to learn but hard to master.</h3><br/> </li><li><h3> Difficulty: Failure is a feature. We trry to keep things challenging, but fair.</h3><br/> </li><li> <h3>Local multiplayer: Help each other get higher or work against a friend in local multiplayer, switch between horizontal or vertical splitscreen with the press of a button (Currently only mouse and keyboard for player 1 and a controller for player 2 are supported)</h3><br/> </li><li> <h3>Alternate paths: Choose different paths and find shortcuts. However remember: The bigger the reward, the greater the risk!</h3><br/> </li><li> <h3>Cosmetics: Earn and a equip a collection of 12 hats during gameplay</h3><br/> </li><li> <h3> Auto-save: We save everything, even your mistakes.</h3><br/> </li><li> <h3>Tutorial: Learn the art of the rocketjump in an easygoing (optional) tutorial. </h3> </li></ul>", "metacritic": null, "released": "2019-02-06", "tba": false, "updated": "2020-09-11T19:09:36", "background_image": "https://media.rawg.io/media/screenshots/359/35950ffd82588feaee5d71523efaa9e4.jpg", "website": "https://strafingforward.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Stephen Pearce", "Strafing Forward"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Strafing Forward"], "esrb_rating": null}