{"id": 291893, "slug": "handheld", "name": "HandHeld", "name_original": "HandHeld", "description": "<p><strong>Game Info</strong></p>\n<p><em>Handheld</em> pins two players against each other in a physical fight over who has control over the phone. When the game first starts, players must both place one finger on their side of the phone to start the game. A countdown timer starts when the players are both ready. Once the game starts, the players must try to put more fingers on their side of the phone to cause the side to grow. If a player's side grows to be the size of the screen, that player wins. There are no official rules for the game so players can use any means necessary to win the game (my personal favorite is punching)</p>\n<p>This game was created in a weekend to test my abilities and show my professor that I was capable of learning new skills quickly. I wanted to join Professor Tanenbaum's VR research team at UCI despite having limited knowledge of Unity. I created this app using the information he taught us in a lecture about using the body in games.</p>\n<p><strong>Contributions</strong><br/></p>\n<p>This was my first solo project in Unity. I had previously worked on one game jam before this project but I was mainly an artist. This project required me to find workarounds for problems that I could not find the solutions to. Looking back at my code I can see that I did not have a complete grasp on the basic concepts of canvases and game objects but I am proud that I was able to make the code work in such a short period of time.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-02-08T05:18:42", "background_image": "https://media.rawg.io/media/screenshots/afb/afb8ae829901b9cbbec265c8f073a608.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Xsce_sk"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}