{"id": 29182, "slug": "war-for-the-overworld-anniversary-collection", "name": "War for the Overworld: Anniversary Collection", "name_original": "War for the Overworld: Anniversary Collection", "description": "To celebrate War for the Overworld’s second anniversary we’ve bundled together more content than you can shake a Skarg at: base game, Underlord Edition extras, Heart of Gold expansion, My Pet Dungeon DLC, Crucible DLC.<br/><br/>\n\nWar for the Overworld<br/>\nTired of invading dungeons? It's time you built your own! War for the Overworld is a Dungeon Management Game that employs your favourite aspects of the RTS and God Game genres. Carve out your Dungeon and conquer the Overworld!<br/><br/>\n\nUnderlord Edition Extras<br/>\nIn War for the Overworld, each and every Underlord is their own unique being. A dungeon is a direct reflection of an Underlord’s presence and individuality. The Underlord Edition includes an extra Dungeon Theme, game soundtrack, lore book The Dungeoneer’s Guide to the Underworld (English only), and short story compilation All That Is Gold (English only)!<br/><br/>\n\nHeart of Gold Expansion<br/>\nHeart of Gold is the first narrative expansion to War for the Overworld, which puts you in the role of the gold-hungry Underlord Kasita. Under the mentorship of the despicably devious Mendechaus (voiced by Richard Ridings), you’ll sate your thirst for wealth and power in the golden dukedom of Phaestus.<br/><br/>\n\nMy Pet Dungeon DLC<br/>\nMy Pet Dungeon is the chilled-out management experience in War for the Overworld - an 8-level campaign voiced by Richard Ridings and focused on exploration and discovery, where the only restriction is your own devilish fancy.<br/><br/>\n\nCrucible DLC<br/>\nCrucible is the survival game mode in War for the Overworld, pitting you against your evil mentor turned bloodthirsty invigilator, Mendechaus (Richard Ridings) and his endless onslaught of minions. How long will you survive? And more importantly, will you top the global leaderboards?", "metacritic": null, "released": "2015-04-01", "tba": false, "updated": "2019-08-28T22:06:44", "background_image": "https://media.rawg.io/media/screenshots/b2a/b2aa35067540ff6acb9d38d9bbc0c164.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 638, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["Brightrock Games"], "genres": ["Action", "Strategy"], "publishers": ["Brightrock Games"], "esrb_rating": null}