{"id": 291922, "slug": "caverns-of-twitch", "name": "Caverns of Twitch", "name_original": "Caverns of Twitch", "description": "Welcome to the Caverns of Twitch!\r\n<em>A twitch integrated adventure!</em>\r\nStory (IMPORTANT):\r\n<p>I didn't have time to put the story in the game. Essentially you (streamer) are a guide and the denizens of twitchland (viewers) are rallied to defeat a dark evil looming in caves underground. Starting out they may be humble peasant folks with sticks, t-shirts and bandannas. Eventually they may end up with light sabers, in plaid, with jester caps! Rally your viewers to the cause. Exploit Use them to help defeat the great evil below! The guide (streamer) controls when to return to town and heal, who will be selected to fight each battle, and can upgrade the viewers!</p>\n<p>There are about 7 battles in the jam version<br/></p>\n<p>The viewers control what roles are used in the fights and what abilities their characters perform</p>\n<p><strong>Class Breakdown<br/></strong></p>\n<p><strong>Warrior Actions:</strong><br/><strong>attack - attacks<br/>defend - taunts damage away from others<br/><br/>Mage Actions:<br/>fireball - does fire damage<br/>blizzard - does ice damange, occasionally makes ice cream<br/><br/>Healer Actions<br/>heal - duh<br/>cure - nothing, don't use! (soon it will cure disease and poison, it's called scope kids) </strong><br/><br/></p>\r\nHow to play:\n<p>Streamer:<br/>Enter your channel name into the box below and then click play!<br/>After the game starts a bot user named \"tigerjams\" will join your channel<br/>Mod this bot, similar to most other bots it needs elevated permissions to be chatty during the game<br/>Your role as the streamer is to pick the players from chat that will battle in the fights!<br/>you are in control of the party.. kinda... a little, hey it is just like streaming!</p>\n<p>chat people: <br/></p>\n<p>when the game loads type \"join\" in chat to join<br/>after you join there are several commands you can do.<br/>In Town:<br/>(whisper the bot tigerjams [/w tigerjams <command/>])<br/>role <mage, healer,=\"\" warrior=\"\"> -- changes your role<br/>actions -- lists your available actions<br/>action <action> -- changes your battle action<br/>stats -- lists your stats<br/>leave -- leaves the game</action></mage,></p>\n<p>In the caves:<br/>actions -- list your actions<br/>action <action> -- changes your action</action></p>\n<p>If you are a healer <strong>do not user cure!</strong> I didn't code it into the game yet :(<br/></p>\n<p><strong>Solo Play</strong><br/></p>\n<p>If you do not have enough players you can spawn npc members, but<strong> they will only be warriors</strong>. Join with your own twitch account via chat to switch into a healer or mage as needed if you intend to play alone. Just start the game, put in your twitch handle, go to your channel (even if you do not stream it will still connect and work fine) This is kinda like playing a board game alone and not as fun. But I put it in there if you can't find someone streaming it and still want to play<br/></p>\n<p><strong>Hint: I know a guy who will play this with you on his stream<br/></strong></p>\n<p><strong>Tiger_J - Twitch</strong></p>\n\n<p><strong>Coming soon (all this was cut due to time)<br/></strong></p>\n<ul><li>Cure will do something</li><li>Music</li><li>SFX</li><li>Animations</li><li>Story and descriptions</li><li>More colors</li><li>Endless Mode with score</li><li>Viewers Characters will save on leaving the game</li><li>Items will be way cooler</li><li>Enemies will drop loot</li><li>For Story Mode the Streamer will navigate the party in a world map</li><li>NPCs will be able to have their roles set so single players will not need to use their twitch chat to play (but try to play on twitch, the NPCs were used as a debugging method and I left them in for helping low viewer streams)</li><li>Sandwiches!</li><li>References to obscure pop culture and inside jokes</li><li>At least 1 fart reference</li></ul>", "metacritic": null, "released": "2019-02-04", "tba": false, "updated": "2019-08-28T23:18:03", "background_image": "https://media.rawg.io/media/screenshots/e27/e27125958edf38b8c27ebb6f9702070b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TigerJ"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}