{"id": 292078, "slug": "galaxy-trucker-extended-edition", "name": "Galaxy Trucker: Extended Edition", "name_original": "Galaxy Trucker: Extended Edition", "description": "The award-winning adaptation of Vlaada Chvátil’s award-winning board game. Already includes the expansion <strong>ALIEN TECHNOLOGIES</strong>!<br/><br/>Build space ships, dodge meteors, and fight off bad guys, all in a quest to be the trucker with the most cosmic credits at the end of the game.<br/><br/>“This is one hell of a good game” – Pocket Tactics, rated 5/5 <br/>“They hit it out of the park” – BoardGameGeek, rated 5/5 <br/>“Hands-down the best adaptation of a board game to the digital format yet seen” – Pocket Gamer, rated 4.5/5 <br/><br/><strong>FEATURES:</strong><br/>-\tOfficial adaptation of a space-faring classic<br/>-\tFamily-friendly gameplay accessible to all ages<br/>-\tBuild your own spaceship from different tiles<br/>-\tLocal multiplayer on the same device<br/>-\tCompete online and play multiple games at the same time<br/>-\tGo frantic in real-time mode, or slow things down in turn-based mode<br/>-\tA campaign, special ship parts and more exclusive to this digital version!<br/>-       <strong>Comes with an expansion Alien Technologies!</strong><br/><br/>Can you build a space ship from sewer pipes? Are you willing to face meteors, pirates, and smugglers? Can you fly a five-engine ship after four engines have been destroyed? Then you are our kind of trucker! <br/><br/>We offer good pay, a xenologically diverse crew, and a dynamic work environment. Bonuses paid for prompt delivery. <br/><br/>Sign up to be a galaxy trucker today!<br/><br/>Czech Games Edition is committed to bringing great games to the international board game community. Since 2007, CGE has produced over 20 games and expansions, including Dungeon Lords, Tzolk'in: the Mayan Calendar, Last Will, Space Alert, and Tash-Kalar: the Arena of Legends. Now CGE expands into the realm of digital board games with Galaxy Trucker.", "metacritic": null, "released": "2019-03-07", "tba": false, "updated": "2019-08-28T21:48:37", "background_image": "https://media.rawg.io/media/screenshots/fbd/fbd5a323efa00942abf4619f5a55a655.jpg", "website": "https://galaxytrucker.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 29}, "playtime": 2, "achievements_count": 93, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["CGE digital"], "genres": ["Strategy", "Indie"], "publishers": ["CGE Digital"], "esrb_rating": null}