{"id": 292039, "slug": "harryrabby-elementary-math-subtraction-in-columns", "name": "HarryRabby Elementary Math - Subtraction in Columns", "name_original": "HarryRabby Elementary Math - Subtraction in Columns", "description": "<p>The original HarryRabby was an action packed puzzle game with levels of fun and excitement. HarryRabby Version 2 is reworked to to have accessibility in mind. It includes many levels of challenge and way more game options specifically for low vision gamers.<br/></p>\n<p>The Elementary Math editions are specifically designed for learners who are new to computer/mobile games. Simple but interesting gameplay, with mobile touch screen support, the game can be played on mobile devices as well as on desktop computers. Player just needs to click or touch on the correct answers in order to allow HarryRabby to land safely and proceed to the next level. Many things are adjustable, including object moving speed and color mode (high contrast, brightness, grayscale, B&amp;W, inversed display…etc).</p>\n<p>This FREE version have unlimited number of simple subtraction in columns with 2 numbers (within 10). Questions are randomly generated. The gameplay is simple. HarryRabby needs to land safely. To do so you must click on the correct answer before he falls off the cliff or runs into some harmful obstacles.</p>\n<p>Note that the FREE version does not require special installation. You can play directly from within the web browser. Depending on your device, the game supports different color modes for users with weak vision to proceed forward. </p>", "metacritic": null, "released": "2019-02-03", "tba": false, "updated": "2019-02-08T05:38:28", "background_image": "https://media.rawg.io/media/screenshots/f10/f108930740530de0234ea3a3f0613f63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fingertainment"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}