{"id": 292192, "slug": "idle-harbor-tycoon-sea-docks", "name": "Idle Harbor Tycoon - Sea Docks", "name_original": "Idle Harbor Tycoon - Sea Docks", "description": "Ahoy Mateys!<br/><br/>Do you like boats and traveling? Thinking about starting a business and becoming your own boss? Why not become a harbor tycoon?<br/><br/>Build your own harbor, buy new boats, yachts and ships. Research new transportation technologies to become the best harbor tycoon in the world!<br/><br/>Take care of your passengers and offer them the best sea travel experience. Happy tourists bring in more money to develop new improvements for your dock and fleet. Upgrade the dock facilities and services to create the most popular harbor in the world!<br/><br/>Develop a business strategy that will help your transportation business thrive while keeping passengers happy therefore increasing profit. Make sure to invest in your research department as it will help you to improve the harbor’s services and make it the most popular among tourists. Hire the best sailors and captains and convince passengers to set sail from your port!<br/><br/>But the fun doesn’t end there. Continue your tycoon adventure by selling your harbor and building a new one. You will start over, but this time with all the business know-how previously acquired. The new harbor will grow faster and be more profitable thanks to your accumulated experience. You will also gain investors for the new harbor that will increase your revenue.<br/><br/>Smart harbor managers make smart decisions all the time. Decide which new services to make available and buy new boats and ships to improve your fleet and docks. Unlock new designs and bigger boats to earn more money. Upgrade your small pier into a huge dock and conquer the sea! <br/><br/>If you like incremental games, you’ll love Idle Harbor Tycoon. Like with other clicker games, there is always something to do, from researching new technologies and buying better ships to improving services to attract tourists. You can also sell your harbor and start over (prestige) with all your previously acquired management experience, which will help you earn more money with your new harbor.<br/><br/>Features:<br/>- Easy to play for every player<br/>- Numerous challenges for any player at any level<br/>- Awesome technologies to discover<br/>- Unique items to improve your harbor facilities<br/>- An extensive fleet of boats<br/>- Great animations and 3D graphics<br/>- Save your progress to the Cloud and recover it if you change your device", "metacritic": null, "released": "2018-12-21", "tba": false, "updated": "2019-07-29T12:41:12", "background_image": "https://media.rawg.io/media/screenshots/d10/d10a7050d6dfdffa256e2ed57660dfd3_YXw8PaM.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Strategy", "Simulation"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Everyone 10+"}