{"id": 292187, "slug": "horse-pony-doctor-care", "name": "Horse & Pony Doctor Care", "name_original": "Horse & Pony Doctor Care", "description": "Quickly, let's go to the operating theatre to give birth a newborn baby pony!<br/><br/>Our pony horse is pregnant and needs to go to the horse hospital where an expert veterinary surgeon can take care of our pony horse and its future newborn baby pony. But before you start with the surgery, make a general body examination and a general check up. Then watch with an ultrasound scan our pony's newborn and decide which type of pregnancy surgery it needs! Let's test your skills and see what kind of horse doctor you are!<br/>Remember that in order to succeed with your pony pregnancy surgery you will need all types of surgical instruments such as stethoscopes, thermometers, injections, oxygen masks, ultrasound machines, anaesthesia etc. Help our pony to give birth to its baby in the hospital and take care of the newborn baby pony once its born!<br/><br/>- Discover your vet abilities in our horse hospital taking care of cute mares and ponies <br/>- Learn vet skills and practice pregnancy surgeries at the hospital clinic!<br/>- Family game appropriate for kids of all ages<br/>- Use different surgery tools and learn what doctors feel like in the operation theatre of a horse hospital<br/>- Different difficulty levels and characters<br/>- Intuitive gameplay<br/><br/>You will have real fun taking care of horses and ponies! Maternity calls you! Do you dare trying this free pregnancy simulator for kids full of surprises?", "metacritic": null, "released": "2019-03-13", "tba": false, "updated": "2019-10-22T14:00:23", "background_image": "https://media.rawg.io/media/screenshots/ee4/ee46af7081f361cb59a111d6355298fa_iY9PN1o.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oscar Garcia"], "genres": ["Adventure", "Family"], "publishers": ["Oscar Garcia"], "esrb_rating": "Everyone 10+"}