{"id": 292225, "slug": "pacybits-fut-19", "name": "PACYBITS FUT 19", "name_original": "PACYBITS FUT 19", "description": "The new PACYBITS FUT 19 is here! This year we combined our DRAFT and PACK OPENER into One Amazing App, by far the best we have ever released.<br/><br/>Build unlimited drafts AND open unlimited packs! Find out about latest cards and build squads. Compete in new exciting online modes. Complete Draft and Squad Building Challenges to earn unique prizes. Grow your card collection and trade cards with other players. Become the best player and build the greatest club in the world!<br/><br/>FEATURES<br/>• Play unlimited DRAFTS, simulate tournaments, and complete Draft Building Challenges (DBC).<br/>• Open unlimited PACKS.<br/>• Learn about all FUT cards and practice building squads.<br/>• Build squads with your cards and compete in the brand new VERSUS mode. Lead your club to Div 1 Title.<br/>• Trade cards with other players in the new and improved Trading mode.<br/>• Become the Online Draft Seasons champion, and compete in daily knockout tournaments.<br/>• Collect thousands of awesome FUT 19 cards. New cards are added every week.<br/>• Complete Squad Building Challenges to earn unique rewards, like special PacyBits SBC, Icon and All-Star cards.<br/>• Unlock exclusive Special Badges for your club by completing achievements.<br/>• Enjoy many more new and unique features, modes, and of course, packs and rewards!<br/><br/>As always, we have so much more planned for you this year, so stay tuned for awesome new updates!<br/><br/>This application’s sole purpose is to help its users learn how to build the best FUT drafts and squads, find out more about latest FUT players and updates, and grow the mobile FUT community. This application is not endorsed by or affiliated with Electronic Arts Inc. All trademarks and copyrights belong to their respective owners.", "metacritic": null, "released": "2018-09-26", "tba": false, "updated": "2019-07-31T00:10:48", "background_image": "https://media.rawg.io/media/screenshots/5ee/5eee83882c53aa5a4fdfc0985c880dd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["PacyBits"], "genres": ["Simulation", "Sports"], "publishers": ["PacyBits"], "esrb_rating": "Everyone"}