{"id": 292251, "slug": "helicopter-simulator-2017-premium", "name": "Helicopter Simulator 2017 Premium", "name_original": "Helicopter Simulator 2017 Premium", "description": "Become a skilled pilot in this amazing helicopter simulator! Fly your aircraft in New York city, very detailed in 3D and very live scenario! With cars, trucks and other aircrafts flying with you. Be challenged by the simulator missions! You will have + 3000 missions to play, depending on the helicopter you are using.<br/><br/>A third person control to walk in the city with your pilot, and explore more closely the details.<br/><br/>You will have to be very precise to take off and land, facing all the real life problems of a pilot, like flying many different helicopters each with it’s own characteristics, different weather conditions - and day and night -.<br/><br/>The missions include fire and rescue situations, transportation of high value assets and VIP person, land in ships, buildings, city areas such as sport squares, medical rooftops and cruise ships.<br/><br/>MAIN FEATURES:<br/>- 30 helicopters, free and by purchase. And one unlocked special aircraft landed on one of the city building rooftops.<br/>- Huge 3D New York City, very detailed.<br/>- Live scenario, cars, trucks, weather conditions and fly during day and night.<br/>- 3 person control for the pilot. - You can also walk on the city! Awesome! -<br/>- More than 3000 missions<br/>- Transportation, military, saving and tour missions<br/>- Fire and Rescue missions: collect water from the ocean or pools. Rescue people from the fire!<br/>- Shoot missiles at targets and save the day<br/>- Fly through dangerous locations!<br/>- Very accurate simulator algorithms!<br/><br/>Enjoy this helicopter simulator, we are always doing our best to give you the best experience on your Mac! Give us your feed back and let us know what you think about our simulator!", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-10-22T14:05:34", "background_image": "https://media.rawg.io/media/screenshots/694/6949da873bf33ad95dec01b251b81391.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Thetis Consulting"], "genres": ["Action", "Simulation"], "publishers": ["Thetis Consulting"], "esrb_rating": "Everyone 10+"}