{"id": 292245, "slug": "chess-club-open", "name": "Chess Club - Open", "name_original": "Chess Club - Open", "description": "Welcome to The New Chess Club - Multiplayer Online Chess! <br/><br/>Game's Highlights: <br/><br/>- integrated with Facebook and Game Center - there is no need for a new account or password <br/>- push notifications <br/>- chat with your opponents using the build in chat<br/>- simulate the opponent's moves using strategy mode<br/>- unlimited number of easy to manage simultaneous games <br/>- view the finished games statistics, so that your can keep the score with your friends <br/>- Elo ratings<br/><br/>- multiple ways to find opponents and start a game <br/><br/><br/>- beautiful graphics rooted in functionality <br/>- easy aids for beginners<br/><br/> <br/>Connect with your family, friends, colleagues or even with random opponents around the world and enjoy one of the oldest board games in history - Chess.<br/> <br/>This turn based version of the game, integrated with Apple's Game Center, lets you enjoy the best of both worlds so you can play whenever you have time.<br/> <br/>Chess Club provides multiple ways to find an opponent and start a game - search online, choose a favorite from your own list of friends, a random opponent from the worldwide club or just bump to play.<br/> <br/>Create an unlimited number of games that are easy to manage due to our simultaneous play interface and push notifications that never fail. Move from game to game with just one swipe - no need to leave the game interface and hustle through the main menu.<br/> <br/>Are you a beginner or do you find yourself playing a game that started so long ago that you don't really remember what you've done? Chess Club's graphic elements are specially designed to improve your game experience and help solve some of these problems - easy to recognize history browsing, graphic alerts for mate, checkmate or risky moves, cool transitions.<br/> <br/>Take advantage of your iPhone's capabilities while enjoying all the things you love about the classic game.", "metacritic": null, "released": "2011-06-06", "tba": false, "updated": "2019-10-22T14:05:01", "background_image": "https://media.rawg.io/media/screenshots/446/4469659e00b73bb31c1209d9c66219bd.jpg", "website": "http://chessclub.sparkleidea.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sparkle Idea"], "genres": ["Strategy", "Board Games"], "publishers": ["Ciprian Lupeanu"], "esrb_rating": "Everyone 10+"}