{"id": 292331, "slug": "tap-n-pop-arcade-group-remove-free", "name": "Tap 'n' Pop Arcade: Group Remove (FREE)", "name_original": "Tap 'n' Pop Arcade: Group Remove (FREE)", "description": "Introducing Tap 'n' Pop Arcade, Group Remove edition. After a great success of our Tap 'n' Pop Classic - we bring you the arcade edition for even more popping fun!.<br/>Remove the balls of same color by tapping on them. The board will fill up with new balls if you remove all balls below the red \"refill\" line.<br/>The challenge is to remove as many balls as possible with one move. This gives you more points and more level progress.<br/><br/>Two game modes are available - with and without a time limit. <br/>   - In the no time limit version - you simply have to make sure you don't run out of moves<br/>   - In the time limited version you also have to watch the level progress which goes down with time.<br/><br/>Some comments<br/><br/>\"Wow - this is bejeweled and removem in one!\"<br/>\"What a unique gameplay\"<br/><br/><br/>Tap 'n' Pop Arcade, Group Remove Edition allows you to rotate your iPhone/iPod touch to re-arrange ball positions and help you out when you think you are getting close to running out of moves. <br/><br/>If you like games like Tap 'n' Pop Classic, Bejeweled, Tetris, Trism, Removem and other puzzle games you will absolutely LOVE Tap ‘n’ Pop Arcade, Group Remove Edition. It is challenging, fun and never boring.", "metacritic": null, "released": "2009-11-24", "tba": false, "updated": "2019-10-22T14:09:26", "background_image": "https://media.rawg.io/media/screenshots/d5a/d5a240a6ad54a681ed044873ab42062e.jpg", "website": "http://www.softwareriver.com/html/tapnpop.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Software River Solutions"], "genres": ["Strategy", "Puzzle"], "publishers": ["Software River Solutions"], "esrb_rating": "Everyone 10+"}