{"id": 292373, "slug": "jade-rousseau-the-secret-revelations", "name": "Jade Rousseau: The Secret Revelations", "name_original": "Jade Rousseau: The Secret Revelations", "description": "Jade Rousseau is a street-smart detective, but a troubled soul. Seeking some solitude—or perhaps simply to run away from her past—the disillusioned Rousseau transfers to a remote police outpost in the northern Italian Alps: Sant' Antonio. But what she stumbles onto in this quiet little town will be sure to change her life! Help Jade, and her mysterious partner David, investigate a series of murders and strange occurrences, which lead into a larger mystery involving: secret societies, terrorist activity and church scandal!<br/>Follow the clues from the small Italian town of Sant' Antonio all the way to Rome, and even into the secret recesses of the Vatican itself! On your journey collect evidence, put the pieces together; decipher ancient codes and symbolism; and solve a variety of puzzle mini-games. But be careful with your choices and conclusions, as powerful mysteries will surely be protected at all costs by powerful people!<br/>Features<br/>•Episode No 1 in the Jade Rousseau series of mystery adventures<br/>•Experience a mystery detective drama as an unfolding interactive adventure series<br/>•Intriguing real world content where you investigate secret societies and ancient codes and symbolism and terrorist activity and church scandal<br/>•Variety of story related puzzle minigames<br/>•Interesting characters and beautiful cut scenes", "metacritic": null, "released": "2011-04-19", "tba": false, "updated": "2019-10-22T14:14:54", "background_image": "https://media.rawg.io/media/screenshots/01c/01c84872793e9b0a60bd26bf4e6f2ba3.jpg", "website": "http://www.rune-soft.com/product.php?product_id=171", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Runesoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Runesoft"], "esrb_rating": null}