{"id": 292312, "slug": "space-rocket-first-stage-landing-simulator", "name": "Space Rocket - First Stage Landing Simulator", "name_original": "Space Rocket - First Stage Landing Simulator", "description": "This game shows how hard it is to recover the first stage of a rocket. Try to land smoothly as you can. <br/><br/>- Experience the unique thrill of landing a reusable rocket on a land or drone ship in the middle of the ocean.<br/>- Compete with your friends and world-wide players to see who's the best rocket pilot.<br/><br/>Right now, most rockets are destroyed or lost after they launch into space, meaning entirely new rockets must be built for each mission. Reusable rockets that land themselves are a critical aspect of reducing the cost to reach orbit and increase space access. Space tourism become a reality for everyone and also we will be able to establish a city on Mars in the future. <br/><br/>Reusability<br/>The rocket doesn't travel straight upward into space but follows a parabolic arc up and away from the launch pad. Because of this, the rocket has to go through a lot to conduct a ground landing. The first stage of the rocket separates at the edge of the earth’s atmosphere. Than the vehicle has to slow down in the direction it's heading and completely turn around. It conducted a series of three recovery burns to maneuver the rocket to a designated landing spot at sea or on land and extreme decelerate it from supersonic speeds for a propulsive soft landing, intact and upright using a quartet of landing legs that deploy in the final moments before a slow speed touchdown.", "metacritic": null, "released": "2016-09-20", "tba": false, "updated": "2019-08-02T03:26:30", "background_image": "https://media.rawg.io/media/screenshots/570/570c153efd7140019d743922152d7554.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaroslav Pribyl"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Jaroslav Pribyl"], "esrb_rating": null}