{"id": 29235, "slug": "zombie-quarantine", "name": "Zombie Quarantine", "name_original": "Zombie Quarantine", "description": "<strong>Lead survivors out of 20 different complex mazes while quarantining or curing the infected in this fun puzzle game that's sure to test every ounce of your mental skills. Get close and personal by playing not only from above in 2D but also in 3D as you scour every inch of the maze for the best possible route all in real-time.</strong><br/><br/>The basic rules:<br/><br/>A set number of the <strong>blue</strong> characters (civilians) must reach the exist zone (blue area).<br/>A set number of <strong>orange</strong> characters (zombies) have to be eliminated.<br/>...all before the time runs out.<br/>...Oh and if a zombie reaches the reaches the blue area, you are penalized 2 civilian units.<br/><br/><br/>Plus:<br/><br/>The <strong>green</strong> characters (the army) act as towers, and can't move. But they will kill any character. Beware.<br/><br/>The <strong>white</strong> characters are scientists, and they can cure zombies back into civilians. <br/><br/>There are buttons at the top of the screen which let you end the game, or reset the current level. Press ESC anytime to bring up the save and load menu.<br/><br/>There are 20 levels.<br/><br/>Made in Unity v4 &amp; 5.<br/>Credits in game.  <br/><br/><strong>!!Seizure Warning!!</strong><br/>Bright colors and rapid moments are in this game. But most of the time can be avoided. <br/><br/><strong>!!Blood Warning!!</strong><br/>There is a minimal amount of blood on certain floor tiles, and when a unit is shot there is no blood. <br/>-Recommended age to play = 13+<br/><br/><strong>!!Difficulty Warning!!</strong><br/>This game is a test of skill. A test of management which may 'kick you into shape and heighten your senses'. <br/><br/><strong>!!Sound Warning!!</strong><br/>This game has many repeating sounds. There is no in-game sound level management. <br/><br/><br/><br/>This game is tricky, but there are tactics which will help:<br/><br/>1) Units change direction when they are in the middle of certain paths such as the corners and the T-sections. They will also change direction if they run into a wall, or another unit.<br/> <br/>2) Scientists have a range of about 1 &amp; 1/2 halls. When you see a scientist move, the effected zombie has about 3 seconds until they are cured into a civilian unit.<br/><br/>3) Some army personnel can kill, with 1 shot. But most of the time it takes ~5 shots to kill a unit.<br/><br/>4) Isolating individual units quickly, and reserving them for later can help with the pace of the game. Level 5 is a real test of this tactic. <br/><br/>5) There are wooden barricades on certain levels which only the zombies can attack and destroy.<br/><br/><br/><br/>Controls:<br/><br/>Click on the walls to create a safe or unsafe path for the characters.<br/>Use the AWSD keys to move the camera around the level.<br/>The the mouse wheel to zoom in and out.<br/>Every level has an optional camera view. <br/>Clicking on the change camera button will swap to a alternate camera view. Click the change camera button again to stop the rotation of the camera. Clicking the button a 3rd time will reset it back to the main camera.<br/><br/>There may be updates for this game, depending on the public opinion on the current progress. Anyone to purchases this version will receive new versions for free.<br/><br/><br/><br/>Known glitches:<br/><br/>If the hall areas get filled with too many units, they may glitch and push each other through walls, or push each other off the main middle path. So try and keep them all moving, just for long enough for you to reach the requirements, and hit the end level button.<br/><br/>No units spawning - this is a rare glitch, but to fix it, go back to the main menu and click on options &gt; credits &amp; help. Then try the game again. Somehow, that might fix the spawning issue.<br/><br/>Save &amp; load not working - There may times where it seems as though the level has not been saved. However if you close the game and start it again, the saved level should be there.<br/><br/>Known development issues:<br/><br/>Zombie Quarantine is one of the 1st games I made in Unity with the help from 2 programmers. There are a few features which were cut from the original idea because of time constraints and people's lives moving on. <br/>Your purchase of this game helps the funding of other games in development. <br/><br/>Enjoy.", "metacritic": null, "released": "2017-06-23", "tba": false, "updated": "2019-08-28T22:06:43", "background_image": "https://media.rawg.io/media/screenshots/4ef/4efbd4fe5f008b6e188df9126bc8c9e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tobop Productions"], "genres": ["Strategy", "Casual"], "publishers": ["Shangri-La Game Studios"], "esrb_rating": "Everyone"}