{"id": 292526, "slug": "vestige-itch-eshe", "name": "Vestige (itch) (Eshe)", "name_original": "Vestige (itch) (Eshe)", "description": "<p>Vestige is a work in progress game project.<br/>It feature high speed pilotage, exploration, and free graphic expression in a vast open world.</p>\n<p>The player controls an entity hovering above the ground, which can gather spherical followers in the environement, forming a \"pack\" behind it. Followers allow the player to reach higher speed, and to unlock special actions.<br/>The player can chose between 3 stances for his pack, which control their shapes and overall abilities. </p>\n<ul><li>The \"Standard/Basic\" stance is focused around movement and manoeuvrability. </li><li>The \"Rake\" stance ups the collecting power of the avatar.</li><li> And the \"Needle\" Stance allows for maximum speed (using a short but powerful Boost) and dodging capacities.</li></ul>\n<p>Followers can also be used to leave a permanent trace of their trajectories on the ground, allowing the player to express himself, and to leave souvenirs on which he will stumble later on.<br/></p>\n<p>The game doesn't have any objectives for now, it is simply a proof of concept for our means of interaction and rulesets! (Note that there might be some bugs while playing, especially in the canyons environment, we are sorry for that)\r\n</p>\n<p>From this base, we are working on building a complete gaming experience (and correcting the bugs ^^). Stay tuned.\r\n</p>\n<p>____________________</p>\n<p>To play the demo, simply download the zip and decompress it. Remember to turn on/plug in your gamepad before launching the .exe file.</p>\n<p>Controls are on gamepad, but you'll need a mouse for the menus!</p>\n\n<br/>\n\n<p>If you have performances issues, consider launching the game in a lower quality. Disable the water reflectivity and reduce the grass distance may also increase your performances.</p>\n<p>____________________</p>\n<p>Made by these 5 students in Game Design at ICAN, Paris :</p>\n<ul><li>Apollinaire Behra Le Cam (Suburban_Scum on itch.io)</li><li>Bekir Kilinc (Enlocke on itch.io)</li><li>Margaux Muller (Daeneb on itch.io)</li><li>Charly Rousseaux (myself, Eshe)</li><li>Rodolphe Vial-Pailler</li></ul>", "metacritic": null, "released": "2019-02-10", "tba": false, "updated": "2019-02-11T03:41:07", "background_image": "https://media.rawg.io/media/screenshots/e73/e73ca229bcff8b5a544d349e4c19e4f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eshe"], "genres": ["Action", "Adventure", "Racing"], "publishers": [], "esrb_rating": null}