{"id": 292535, "slug": "devtycoon", "name": "DevTycoon", "name_original": "DevTycoon", "description": "<p><strong>Hey! We are DevStudio and we are happy to present you the first public alpha release of our game named DevTycoon! </strong></p>\n<p><strong>First important note: this game is still at a very early stage of development and many things might and will change in the future. Feel free to share your thought's, give ideas and report bugs that you found.</strong></p>\n<p><strong>What is DevTycoon?</strong></p>\n<p>Well, it is basically a developer's simulator. You start as a freelancer doing several orders for clients. It's up to you to choose who you want to be - graphic designer, programmer and what you want to do. Will it be a website design, mobile applications or games? It is up to you to choice.</p>\n<p><strong>DevTycoon features:</strong></p>\n<p>At the moment the only thing that you can do in DevTycoon is to start your carrer as a Webdeveloper. Of course in future updates there will be much more content and different things to do. As for now we've implemented some main mechanics that will expand in the future:</p>\n<ul><li>Programming system that allows you to fulfill commissions</li><li>Managing finance of your company</li><li>Hiring employees to make your work faster</li><li>Creating your own character</li><li>Building system that allows you to customise your work environment.</li><li>Day/Night Cycle</li></ul>\n<p><strong><em>You can see the details in the Devlog.</em></strong></p>\n\n<p><strong>What's next?</strong></p>\n<p>There are many ideas for what should be in the game. Currently we are going to focus on expanding mechanics that already are in the game. In the meantime we will add more content (eg. new models, skills etc.) and try to fix as many bugs as possible to make you playthrough more enjoyable.</p>\n<p><strong>Who are we?</strong></p>\n<p>We are a small group of young people from Poland who wanted to created a game that we would play ourselves. Our studio was originally founded by Denis Szwarc. Then I joined him. Now I'm the Lead Game Designer and you may know me as Roman. My real name is Jakub Kiryluk and I'm 17. </p>\n<p>Here is a list of people that took active part in making this game:</p>\n<ul><li>Jakub \"Roman\" Kiryluk - Lead Game Designer, Main Programmer, Co-founder of DevStudio</li><li>Denis Szwarc - Lead UI Designer, Additional Programmer, Game Designer, Founder of DevStudio,</li><li>Michał \"Misieq\" Paciorek - Lead Level Designer, Lead Game Tester, Game Designer, 3D Models Artist</li><li>Tomasz \"Yamikaze\" Jaskot - Public Relations, Social Media, Game Marketing</li><li>Jakub \"Prince Polonias\" Brodzik - 3D Models Artist</li><li>Bartłomiej Lewczuk - 3D Models Artist</li><li>Przemysław \"Jacobowsky\" Kruszka - 3D Models Artist</li></ul>\n<p>We would also like to thank R1SK, elLiquido, Setto and all other testers that helped us during development!</p>\n<p><strong>Your feedback</strong></p>\n<p>We are really counting on your feedback about our game. You found some bugs? Have any sugestions on improving it? Maybe you think the game is too hard or too easy? You can write to us about it anywhere. Here on itch, our social media or by direct message to one of our creators.</p>", "metacritic": null, "released": "2019-02-10", "tba": false, "updated": "2019-02-11T03:42:14", "background_image": "https://media.rawg.io/media/screenshots/db5/db5fcd4a67cfa0817223f2a803620367.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DevStudio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}