{"id": 292602, "slug": "viral-insurgent", "name": "Viral Insurgent", "name_original": "Viral Insurgent", "description": "Summary\r\n<p>Play through a series of challenges and fight your way through to the win!<br/></p>\n<p>Featuring 6 unique levels designed to test you to your highest ability, a unique combat system and a classic feeling movement, Viral Insurgent is guaranteed to put you through your paces in a fun, frantic action platformer.</p>\n\r\nIn-Depth\r\n<p><strong>Classic Movement<br/></strong></p>\n<p>The movement in <em>Viral Insurgent</em> closely models the classic Arena FPS games of the late 1990s, with fluid motion and strafe jumping as a central mechanic.</p>\n<p>Strafe jumping has been streamlined to be easy to use so you can <strong>always </strong>feel like a badass!</p>\n<p><strong>Fast-Paced Combat<br/></strong></p>\n<p>In <em>Viral Insurgent</em>, you are provided with a variety of devastating weaponry:</p>\n<ul><li>12 Gauge Shotguns</li><li>Machine Guns</li><li>Railguns</li><li>Grenade Launchers</li><li>Rocket Launchers</li><li>Syringe Shooters</li></ul>\n<p>Each of these weapons has a variety of uses for different situations to get the best experience, and more weapons are coming in later patches.</p>\n<p><strong>Satisfying Gameplay<br/></strong></p>\n<p>Described by one Early Access player as, \"...the Dark Souls of retro 90s action platformers\", <em>Viral Insurgent</em> pits the player against incredibly difficult scenarios, leading to extreme satisfaction after chipping away at an obstacle for a long time, just to complete it.</p>\n<p><strong>Short but Sweet Campaign<br/></strong></p>\n<p>The 5 challenge missions included in <em>Viral Insurgent</em> are sure to test your strength, being very small levels, however, multiple individuals have clocked in times<em> over 2 hours </em>on just the first 3<em>.</em> It has a very addicting quality... beware!</p>\n<p><strong>The Gift That Keeps On Giving<br/></strong></p>\n<p><em>Viral Insurgent </em>is due to continue getting maps, weapons, game modes, bosses, and other new content additions after launch, meaning there will always be something new.</p>\n<br/>Legal\r\n<p>Music by the fantastic Kevin Macleod - incompetech.com</p>\n<p>Kenvector Future  font from kenny-fonts on OpenGameArt</p>\n<p>Various sounds from SoundBible.com</p>\n<p>Icons from game-icons.net</p>\n<p>If content within this product is too similar to or explicitly contains your copyrighted material, or if the crediting on this page is not up to your standards, feel free to contact me.<br/></p>\n<p>This product is provided as-is. <br/></p>", "metacritic": null, "released": "2019-02-09", "tba": false, "updated": "2019-02-11T03:52:16", "background_image": "https://media.rawg.io/media/screenshots/c7b/c7b9be35d139b43b512bfb072b0f08b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Winnitude!"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}