{"id": 292770, "slug": "ne-touchez-pas-5-itch", "name": "Ne Touchez Pas 5 (itch)", "name_original": "Ne Touchez Pas 5 (itch)", "description": "<p><em>Ne Touchez Pas 5 is coming March 2nd 2019, for a free-to-keep-forever weekend! After this, it will cost $1.</em></p>\n<p><strong>An extremely difficult game with one simple rule - <em>do not touch.</em></strong></p>\n<p>In Ne Touchez Pas 5, you navigate 100 different levels with six different characters, all with unique control methods, attempting to reach the finish in one piece. Dodge deadly fans, evade eviscerating laser beams, and manoeuvre around moving segments, hit switches to open paths, collect optional bits and throw yourself through the void at the end of each level to progress.</p>\n<p>Play as: <br/></p>\n<ul><li>L'Oiseau, a french bird that flaps its little wings!\r\n</li><li>Jetpod, a tiny pilot with the lust for thrust!\r\n</li><li>Rockit, a rocket built for destruction but here to kick some walls!\r\n</li><li>Astro, an astronaut that doesn't know why they're here and is getting dizzy!\r\n</li><li>Car, with a full tank of petrol and a six digit milometer!\r\n</li><li>Square, just here to give people an easy mode!</li></ul>\n<p>Features 100 levels, 480 collectables, progress tracking, catchy music with a nostalgic easter egg for the four people that will remember the original Ne Touchez Pas games from the noughties, and a quit button for when you get stuck. You will probably get stuck.      </p>", "metacritic": null, "released": "2019-02-08", "tba": false, "updated": "2019-02-11T04:15:49", "background_image": "https://media.rawg.io/media/screenshots/c0b/c0ba49da7fee098b636e822e88ec28dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chequered Ink"], "genres": ["Action"], "publishers": [], "esrb_rating": null}