{"id": 29272, "slug": "robros", "name": "RoBros", "name_original": "RoBros", "description": "Introducing the first-ever strategic escort shooter where you plan your path before grabbing your gun! Gameplay is split in two phases: planning and execution. When planning, you map your route on a 2D map while using battery power as you plot your path. In the action phase, you race down winding corridors and gun down rogue robots that impede your path while protecting your charge from harm. The completion of each level is dependent on the cooperation of a robot duo as one provides the power while the other provides the protection.Key Features<ul><li>Innovative combination of cerebral, strategic planning with intense, tactical shooting<br/></li><li>A subversion of the typical escort mission<br/></li><li>A pistol for precise shooting or a shotgun for easy clearing<br/></li><li>Use your bullet-time ability for extra accuracy<br/></li><li>3 maps and levels of progressing difficulty plus a tutorial level<br/></li><li>New obstacles and enemies with each level<br/></li><li>Scorekeeping and online leaderboards<br/></li><li>Download and play for absolutely <strong>FREE!</strong></li></ul>PremiseA virus has spread throughout an automated robot assembly factory, causing the entire production of robots to go rogue. Two service robots BURT (Battery Utility Robot Transporter) and IRN-E (Industrial Reparative Net-Engineer) are the only ones unaffected by the virus. BURT is a moving battery robot who transports and supplies energy while IRN-E is a highly-functional maintenance robot. These two must work together by making use of their functions to gather any spare batteries strewn throughout the factory so they can fight their way out.About Us<strong>Team B.R.O.S.</strong> (Best Reputable Operations Studio) is a ten-man team of graduate students who are part of the University of Utah's world-famous Entertainment Arts &amp; Engineering game development Master's program. We are releasing this game for free in hopes of any further support and funding in turning this project into a full-fledged, market-worthy game. We have invested a year and a half of our time, thought, energy and passion for games into bringing an innovative idea to fruition and we couldn't be more excited to share the fruits of our labor with you! Your feedback is valuable to us and we'll dedicate all of our efforts to the expansion and improvement of this game.", "metacritic": null, "released": "2017-06-14", "tba": false, "updated": "2019-08-28T22:06:42", "background_image": "https://media.rawg.io/media/screenshots/e78/e7836f518c61bcc2ff4faf1785ea6fe0.jpg", "website": "http://eae-robros.weebly.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 119, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team B.R.O.S."], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Team B.R.O.S."], "esrb_rating": "Everyone"}