{"id": 292859, "slug": "delta-squad", "name": "Delta Squad", "name_original": "Delta Squad", "description": "Delta Squad is an arcade game that will bring back memories to nostalgic players that grew up playing games in the 90’, but with a fresh looking for the modern era.<br/><br/><br/><br/><br/>After the alien invasion in FullBlast our heroes were enjoying a break, but fun never lasts, and the Dictatorship forces of General Rumanovsky wants to control a mortal virus that will destroy humanity, and that won’t happen under the Delta’s watch!, the squad is here to stop Rumanovsky’s plans of global domination.<br/><br/><br/><br/>Play solo or gather up to 4 friends in a local co-op mission to stop the Dictatorship forces of Rumanovsky who wants to control the earth.<br/><br/><br/><br/><br/><br/><br/><br/><br/>The game features 5 levels with 10 missions each plus 5 sublevels, do you want to join the Delta Squad and help humanity once more?<br/><br/>- Gorgeous 3D graphics<br/>-Story campaign with 5 levels or play any level you want for a quick game!<br/>-Play solo or gather up to 4 players in local co-op mode<br/>-Ambient soundtrack <br/>-Achievements<br/><br/><br/><br/><br/>This game ONLY WORKS with a controller, you won't be able to play if a controller is not connected. There's NO support for keyboard and mouse throughout the game.", "metacritic": null, "released": "2019-10-29", "tba": false, "updated": "2019-11-19T19:30:39", "background_image": "https://media.rawg.io/media/screenshots/bc0/bc0b59cc168d4a1356921bb94911da83.jpg", "website": "https://eskemagames.es/deltasquad.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "beaten": 1}, "playtime": 0, "achievements_count": 77, "ratings_count": 1, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC", "macOS"], "developers": ["EskemaGames", "Eskema Games"], "genres": ["Action", "Shooter"], "publishers": ["Ratalaika Games", "EskemaGames"], "esrb_rating": "Teen"}