{"id": 292856, "slug": "crumbling-world", "name": "Crumbling World", "name_original": "Crumbling World", "description": "A Dark Fantasy Lowpoly Action RPG inspired by the classics <strong>Prince of Persia (1989)</strong>, <strong>Diablo</strong> and <strong>Ghouls'n Ghosts</strong>DescriptionCrumbling World manages to combine three popular genres (infinity runners, action, and role-playing games) to create an engaging and story-driven experience. Run through seamless, ongoing levels as the world rapidly crumbles below your feet. Fight off a never ending onslaught of enemies with your favorite combat class. As you progress through the game, upgrading your character’s skills and attributes can make the difference between saving the world from the Evil Forces, or perishing with it.<br/><br/>In order to save the humanity, Crumbling World players must choose one of five character classes. Some might feel that the best way to save humanity is by embracing it. For these players, the classes of Knight, Wizard, and Archer are available in both male and female character designations. For those that want to embrace the mythology of the Crumbling World, players can opt to save the World with either the Brute or the Creature. With each character class comes a unique set of attacks and attributes, allowing players the opportunity to try different loadout combinations to see which options are their favorite.<br/><br/>With a procedurally generated world, every playthrough of Crumbling World is guaranteed to be more engaging and challenging than the last. With every playthrough of the game vegetation, obstacles, and enemies are randomly placed throughout each of the twenty five levels, ensuring that each attempt at saving the World brings new and exciting scenarios with it. This intentional randomness, combined with the game’s unique isometric camera viewpoint, are guaranteed to provide a new, cinematic gaming experience each time players enter the World of the Evil Forces.<br/><br/>These levels span five unique and challenging regions. Fight through the Fields, survive the Forests, sprint through the Towns, scale royal Castles, and descend into the Dungeons as you continue your epic quest to save the world from the Evil Forces that have taken control of everything you know and hold dear. Take heed of which character classes and loadouts prove to be most effective, as learning which style of play works best for you can make the difference between saving the world, or perishing with it.Features<br/><ul><li>Five Classes, 7 Characters<br/></li><li>+40 Different Enemies, Unique Enemies and Boss Enemies<br/></li><li>5 Regions with procedural levels<br/></li><li>3 Modes: Easy, Medium and Hardcore<br/></li><li>Real-Time Combat<br/></li><li>Upgrade your skills and abilities</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:32", "background_image": "https://media.rawg.io/media/screenshots/dd1/dd1181f7891fd621d0ddfde2f3fda3a7.jpg", "website": "http://www.dumearts.com/crumbling-world/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 551, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Dani Marti"], "genres": ["Action", "RPG", "Casual"], "publishers": ["Dume Arts"], "esrb_rating": null}