{"id": 292873, "slug": "super-president-how-to-rule-the-country", "name": "Super president How to rule the country", "name_original": "Super president How to rule the country", "description": "Gameplay:<br/>2d meme platformer where you play as Tsar President and mission to collect enough taxes and getting back to throne. Player can get collect taxes by killing enemies and other obstacles. at least 80% of taxes need to be collected that can complete level and get in throne. Every level will give player 1 achievement. 5 different levels and unlocked level systemSTORY<br/><br/><br/>Nepotism, corruption, crisis - all this is not the part of the Beautiful Russia of the Future. The only vital problem is the crossing of their own possessions on the way to the legitimate Throne. Now this is especially crucial as another set of the US sanctions brought to a nervous breakdown - the world acquired poisonous colors, and the evil turned into good. <br/>Help the true patron of Mother Earth, Tsar Vladimir, to overcome his psychedelic trip and find the way to the desired Throne, so that order and prosperity could reign over the country once again. No crabs, bumblebees and special services. Only you and the oppositionists dead inside. <br/><br/>Feel yourself in the role of the master of destinies - the Super President! You are free to kill or let go the opponents on your way! <br/>Drink for rushing! Drink, increasing your chances to walk through! <br/>Need more gold! Collect taxes without being distracted by the boring composition of the robbing laws! Also avoid mystery holes in ground which will trap you forever<br/><br/>Defend yourself from brisk liberal freelancers using empty bottles taken from homeless people and collect hidden taxes from the authorities from their corpses. If at the end of the level you fail to fill the treasury, the Throne will reject you! <br/><br/><br/><br/><strong>HOW TO PLAY</strong><br/>WASD – movement<br/>Space – Jump<br/>Left Mouse Button – Throw a bottle<br/>F - KickFeatures:- Achievements<br/>- Several enemies<br/>- Drink which gives more health<br/>- Taxes to collect<br/>- Basic settings<br/>- 5 levels", "metacritic": null, "released": "2019-03-06", "tba": false, "updated": "2019-08-28T21:48:31", "background_image": "https://media.rawg.io/media/screenshots/2c2/2c2e8f2b06619a7570b82310be559a4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ruskija game experience"], "genres": ["Adventure", "Indie"], "publishers": ["Tero Lunkka"], "esrb_rating": null}