{"id": 29280, "slug": "home-wars", "name": "Home Wars", "name_original": "Home Wars", "description": "Do you hate bugs and arachnids? Seeing them creeps you out? Would you like them to disappear off the face of the Earth? GOOD! This the right game for you!<br/>\n<br/>\r\nIn Home Wars you’ll play as a General of a toy soldiers army, with the sole purpose of saving the owner’s house from the invasion of those damn Bugs.<br/>\n<br/>\r\nThe special feature of this game is that you can go instantly into first person towards any selected unit, getting a damage bonus for everything you'll hit.<br/>\n<br/>\r\nIn the Campaign, there are two different phases:<br/>\r\n- the Home Mode, where you’ll have to manage, turn after turn, your Headquarters, recruit troops, buy ammunition, spy on enemies, unlock new units and decide the best moves for your armies<br/>\r\n- the Battle Mode, playable in real time, where you’ll fight face to face with the enemy till the last soldier falls.<br/>\n<br/>\r\nThe Bugs will aim to collect as much food as possible, they will use it to create new lethal Swarms and to evolve their Nest. On the other side, you’ll have to prevent that and get the right resources to create an army able to fight off those creatures.<br/>\n<br/>\r\nUse the versatile Infantry, the armored Vehicles, the powerful Artillery and the deadly Aircraft to destroy anything that has more than 4 legs!<br/>\r\nYou can also build defensive structures and traps to protect sensitive targets such as Outposts, Trucks, Supply Crates.<br/>\n<br/>\r\nStop the enemy invasion room by room, fight it in the main 3 types of battles and in the other secondary missions. Attack enemy’s convoys, defend satellites through intense aerial dogfights, protect surrounded recon squads using a powerful gunship and much more to win the War.<br/>\n<br/>\r\nThere is a technology tree that allows you to unlock more powerful units using the Experience gained on the battlefield.<br/>\n<br/>\r\nIn Home Wars there are no maintenance costs for armies, but you’ll have to buy gradually the ammunition your men need. You can buy 7,62mm, 12,7mm, 20mm, 30mm, 40mm, 150mm, 320mm, rockets, missiles, bombs … and much more.<br/>\r\nAs regards the bombs, there are four types of ammunition: High Explosive, Incendiary, Cluster and Toxic.<br/>\r\nEvery single shot in Home Wars has unique characteristics, so it's up to you to find the winning combination for each battle.<br/>\n<br/>\r\nShow no mercy to the enemies, they want to kill us!<br/>\r\nDo not hesitate to burn them alive with napalm, to poison them with insecticide or to trap them in barbed wire, because remember: <br/>\r\nTHE ONLY GOOD BUG IS A DEAD BUG!", "metacritic": null, "released": "2017-06-13", "tba": false, "updated": "2019-08-28T22:06:41", "background_image": "https://media.rawg.io/media/screenshots/f8b/f8b74476020b11795d0bf5596f4173fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Insane Dreamers"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Insane Dreamers"], "esrb_rating": "Everyone"}