{"id": 292854, "slug": "dance-of-death-du-lac-fey", "name": "Dance of Death: Du Lac & Fey", "name_original": "Dance of Death: Du Lac & Fey", "description": "London, 1888. With Whitechapel’s citizens living in the shadow of Jack the Ripper, Arthurian legends take to the streets in a thrilling quest to stop the killer before he strikes again. <br/><br/>Take on the roles of immortal hero Sir Lancelot Du Lac, and cursed sorceress Morgana Le Fey, as you hunt London’s most prolific serial killer. Join forces with Whitechapel local, Mary Jane Kelly, to explore the capital’s underbelly, meeting a diverse cast of characters who fill the streets of the Metropolis with noise and colour.<br/><br/>Explore the sights, sounds, and locations of the Ripper’s London, and immerse yourself in all that the Victorian era had to offer. <br/> <br/><br/><strong>KEY FEATURES:</strong><br/><ul><li>A thrilling tale set at the turn of a century, just as London was gripped by the Autumn of Terror. <br/></li><li>Three playable characters. See London through a different lens as they wrangle their own personal, and physical, demons. <br/></li><li>Explore historically accurate crime scenes, each based on and including true-to-life reports from the era. <br/></li><li>A sprawling, branching narrative where in-game decisions impact on each character’s resolution. <br/></li><li>A wide array of characters to meet, and a plethora of true-to-life locations, each fact-checked by leading experts in the field of Victorian history. <br/></li><li>An incredible voice cast with actors from Penny Dreadful, Game of Thrones, Black Mirror, and Dragon Age. <br/></li><li>Developed by Salix Games, a new indie team with AAA experience from the likes of Rocksteady and Lionhead. <br/></li><li>Plotted by Philip Huxley, writer on Batman: Arkham Knight and Killzone, alongside BAFTA Breakthrough Brit winner, Jessica Saunders.. </li></ul><br/><br/>Crafted by Salix Games, Dance of Death: Du Lac &amp; Fey has been meticulously researched to bring the Ripper story to life, all the while shining a light upon previously untold stories. The stellar line up of voice talent includes Penny Dreadful and Tudors actress Perdita Weeks as Lady Morgana Le Fey, Dragon Age and Torchwood star Gareth David-Lloyd as Sir Lancelot Du Lac, and Utopia and Black Mirror actress Alexandra Roach as Mary Kelly, each guiding us on a journey through the twisted streets of Whitechapel. With beautifully rendered graphics that blend 2D and 3D, as well as lovingly composed music and soundscapes, Dance of Death: Du Lac &amp; Fey breathes new life into the adventure genre, putting its own mark on this often-misunderstood period of history.", "metacritic": null, "released": "2019-04-05", "tba": false, "updated": "2023-12-01T02:33:54", "background_image": "https://media.rawg.io/media/screenshots/6e2/6e2344a7badfbf07af38c8c71849c556.jpg", "website": "http://www.salixgames.com", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 38, "beaten": 6, "toplay": 11, "dropped": 1, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Salix Games", "Tea Clipper Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Salix Games"], "esrb_rating": "Adults Only"}