{"id": 293, "slug": "warhammer-40k-deathwatch", "name": "WARHAMMER 40K: DEATHWATCH", "name_original": "WARHAMMER 40K: DEATHWATCH", "description": "Deathwatch® is a turn based strategy game, set on the edge of Imperial space, where your Space Marines will engage the Tyranids in a series of tactical engagements. From war ravaged cities, to the insides of Tyranid bio-ships, your mission will see your Kill Team rise in strength and skill as you face ever greater threats and peril.  Clad in black armor, the Deathwatch is an elite, secret order of Space Marines. Drawn from the greatest heroes of several Chapters of the Adeptus Astartes, they are dedicated to combating the ever present alien menace that threatens the Imperium. In the game you will be able to customize your Kill Team with over 200 different weapons and wargear relics and take on the campaign.<br/><br/>1 player<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>Warhammer 40k: Deathwatch © Games Workshop Limited 2016. Games Workshop, GW, Space Hulk, Warhammer 40,000, GW, the Games Workshop logo, the Double headed/Imperial Eagle device, Adeptus Astartes, Blood Angels, Dark Angels, Genestealer, Space Marine, Space Marine chapters, Space Marine chapter logos, Space Wolves, Tyranid, Ultramarines, Warhammer, 40K, Warhammer 40,000 and the Warhammer 40,000 device the foregoing marks’ respective logos and all associated marks, logos, names, places, characters, creatures, races and race insignia, illustrations and images from the Deathwatch game are either ®, TM and/or © Games Workshop Limited 2016, variably registered in the UK and other countries around the world. All rights reserved. Software Rodeo Games © 2012-2016 Developed by Hoplite Research, LLC.  Published by Hoplite Research, LLC", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2019-10-23T14:56:29", "background_image": "https://media.rawg.io/media/screenshots/088/08824d127253e62604d111875c303f80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 632, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4"], "developers": ["Hoplite Research"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Teen"}