{"id": 293240, "slug": "reduced-transmission-hd-online", "name": "Reduced Transmission HD online", "name_original": "Reduced Transmission HD online", "description": "We present to you the long-awaited version of HD Reduced transmission!<br/><br/>The new online version of the series of RT - not a simulator but a game of offroad<br/><br/>You must Delivery cargoes on Soviet and European trucks, offroad vehicles in remote, hard-to-reach locations, where roads with hard surfaces are almost absent, and only hard-to-reach forest trails predominate.<br/>There are many modes in the game: Walk uphill, rally, offroad drag racing on offroad, trophy raids on offroad and many other competitive modes, you can compete with friends or play with strangers on the net!<br/>Also for fans of the simulator modes there is delivery of cargoes at different offroad locations, with different conditions! The Big size of some of the Maps in the game !  you will need to overcome fords, swamps, mud and so on. If you do not like driving on the roads - you can pave your way through the forest or the mountains!<br/>Exciting races on impassability are not reduced to prohibitive speeds; to win in the receipt or delivery of goods - you have to make a lot of effort.<br/>Also you will improve SUVs to get to hard-to-reach places! It is necessary to improve the engine, put the wheels with good patency and protect the power frame or bumpers, well, if you want to stand out, you can paint the car!<br/>In the lowered gear a great emphasis is placed on physics! Very realistic car behavior! You have the option to lock the differential, turn on all-wheel drive and lower gear, lower the wheels to improve the contact spot, and this affects the permeability and fuel consumption. There is a limited supply of fuel, which you need to replenish in time from experience in the game of tanks. Realized damage that affects the behavior of the car ... And many other features!<br/>Also realistic deformable dirt is realized, offroad cars can leave after themselves the tracks on the road, making it difficult for the subsequent journey, to be buried by wheels in soft ground.<br/><br/>Features:<br/>• Realistic behavior of offroad cars on the track<br/>• Multiplayer game for 10 people<br/>• Rides day and night, in any weather<br/>• Delivery order<br/>• Competition modes: Drag racing on offroad , offroad Trophy raids, rally trucks, Hill Climb, derby on trucks ...<br/>• Different cars from different countries<br/>• Manual Transmission<br/>• the inclusion of reduced gear, locking, lowering tires and much more ...<br/>The large fleet of cars from the most legendary cars from Russian ZIL 130, Kamaz, Ural and Kraz I, and also European ones such as MAN, the legendary PETERBILT 379, GMC M35 and many others! Cars and maps will be added to the updates!<br/>The maps are very realistic nature! Trees, grass, fog also works a dynamic system of day and night, the sounds of nature during the day and night, the water and the behavior of cars in the water", "metacritic": null, "released": "2019-02-06", "tba": false, "updated": "2019-10-22T14:34:13", "background_image": "https://media.rawg.io/media/screenshots/fff/fff95a97785e8fcda1b9b72f94ea7a9e.jpg", "website": "http://tm-games.ru", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivan Pavlikov"], "genres": ["Simulation", "Racing"], "publishers": ["Ivan Pavlikov"], "esrb_rating": "Everyone 10+"}