{"id": 293312, "slug": "soul-dungeon-brave-knight", "name": "Soul Dungeon: Brave Knight", "name_original": "Soul Dungeon: Brave Knight", "description": "Soul Dungeon: Brave Knight is coming! Recall legion and fight now~Classic Grand Summoners War RPG game. <br/><br/>Dungeon and Valor. Strengthen action performance！Start with one simple quest: Find the Ancient guardian’s legacy! The sleeping Dragon league awake brings you a different fighting experience.<br/>Just like classic RPG. New monsters and epic equips have been added. These monsters will become Heroes and join your legion! Find the legacy from treasure box till you satisfied. You can also get reward form different kinds of quests<br/>Legend Companion comes to the Battle Frontier. Companion system becomes more powerful. Companions can get their epic equipments and they have their own unique skill to power up your legion! Heroes and Dragon Crusade, several kinds of Legend companion are waiting for your legion.<br/>Heroes’ Formation of team is important. Battle will become more strategically and funny. Grouping your own legion with different companions and skills, satisfy your formation to make battle easier! Keep watching your formation in battle.<br/>Epic Equipments become more fun. Get materials in levels and then use them to power up your epic equipments.<br/>You may see fantasy castles, forests, lakes, volcanoes and outsiders Large and beautiful scenes, so you are immersed in the mysterious fantasy continent. Begin a new adventure in here and become Drgon crusade of kingdom<br/>Fighting in Frontier! Well-designed crusade action, so you have a completely different battle experience, and brings more gorgeous exquisite fighting action.<br/>Companion Formation, PVP, arena, elite levels, daily quest will open to all players. Challenge yourself Now! Dragon crusade, it’s time to find sleeping legacy, to beat the Legend dragon!<br/><br/>Features：<br/>Variety of roles and companions<br/>Outstanding fighting experience<br/>Full of strategic companion selection and equipment selection<br/>A lot of role skills, bring a different battle experience<br/>A wealth of equipment and enhanced systems, give you a variety of options<br/>Collect all kinds of companions, build their own Crusade legion<br/>Concise and clear operation, allowing players to easily get started", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-10-22T14:34:29", "background_image": "https://media.rawg.io/media/screenshots/ae0/ae0bda7e4949c9c6ec1df3a5519dc184.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["wu zheyu"], "genres": ["Adventure", "RPG"], "publishers": ["wu zheyu"], "esrb_rating": null}