{"id": 2933, "slug": "fantavision", "name": "FantaVision", "name_original": "FantaVision", "description": "Experience Fantavision™ for the PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita system or PlayStation App.<br/><br/>Catch ‘em. Detonate ‘em. Watch an explosive display of brilliant pyrotechnics that you control. Sounds pretty simple. But once you get the hang of it, it gets faster, tougher and more fantastic than you could ever imagine!<br/><br/>A PYROTECHNICS PUZZLE CRAZE!<br/>A fast and furious puzzle game taken to all new heights! Combines action, shooting, strategy and puzzle gameplay. It’s totally addictive with mind-blowing intensity.<br/><br/>COMBINATIONS, CHAIN REACTIONS, EXPLOSIONS!<br/>Combine a wild assortment of flares and other special FX to create explosive chain reactions! Then replay your aerial spectacular and vary the camera angle, weather conditions and more!<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>This title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.<br/><br/>", "metacritic": null, "released": "2015-12-22", "tba": false, "updated": "2023-12-09T14:59:51", "background_image": "https://media.rawg.io/media/screenshots/775/77572e28467246813a07269c368b757f.jpg", "website": "", "rating": 3.3, "rating_top": 3, "added_by_status": {"owned": 53, "beaten": 1, "dropped": 4}, "playtime": 0, "achievements_count": 36, "ratings_count": 10, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 10, "platforms": ["PlayStation 4"], "developers": ["Sony Interactive Entertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}