{"id": 293349, "slug": "idle-planet-miner", "name": "Idle Planet Miner", "name_original": "Idle Planet Miner", "description": "If you enjoy clicker &amp; digging games, Idle Planet Miner is perfect for you! Idle Planet Miner is an incremental, digging, idle clicker game that lets you take control of a mining ship and dig deep into the cores of planets across the solar system! Just start clicking to mine rare metals. Hire special mining managers, dig deep, sell ore, craft alloys, and more! Upgrade your Mining Ship and planets to increase your profits, dig up valuable riches and expand your empire across the stars.<br/><br/>Digging for ore has never been more exciting! Tap to dig, then upgrade your ship &amp; planets and hire mangers to help you dig deeper, faster. Unlock a new crafting recipes, new planets and more! Craft an Empire that will span the stars!<br/><br/>Download now and start digging for ore in one of the most addicting incremental idle clicker games! Dig your way through the stars!<br/><br/>IDLE PLANET MINER FEATURES<br/><br/>Idle Clicker Gameplay<br/>● Idle to increase your mining rate!<br/>● Tap to smash asteroids and earn rare ore!<br/>● Mine: Earn coins and hire managers!<br/><br/>Incremental Upgrades<br/>● Create an Empire Across the stars!<br/>● Hire managers to improve your output!<br/>● Evolve your digging strategy! Unlock special projects to improve your output!<br/><br/>Upgrade Your Mining Ship<br/>● Play the Market: respond to supply &amp; demand across the galaxy to maximize profits!<br/>● Research special projects and profit!<br/>● Rewards to permanently upgrade your mining ship are everywhere!<br/><br/>Idle Mining<br/>● Earn ore and coins when you're not playing<br/>● Quests- complete quests to earn premium rewards<br/><br/>Idle Planet Miner is the perfect incremental clicker / idle game for fans of endless fun. Idle the day away digging for ore, rare metals, coins, and more!<br/><br/>Idle Planet Miner - Dig your way through the stars!", "metacritic": null, "released": "2019-01-23", "tba": false, "updated": "2019-07-30T08:31:58", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe4b0f302049c489ca0a2704df6810b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Iron Horse Games"], "genres": ["RPG", "Simulation"], "publishers": ["Iron Horse Games"], "esrb_rating": null}