{"id": 293390, "slug": "yang-chun-bai-xue-lyrica", "name": "陽春白雪-Lyrica", "name_original": "陽春白雪-Lyrica", "description": "《Lyrica》is a rhythm game combined classic poems and modern musics, in addition to classic styled narratives.<br/> <br/>The story portrays a young man Chun who wants to become a musician. One night he has a dream of traveling to the ancient past in China and encounters a mysterious poet. <br/><br/>The game combined music notes and classic poems, gamers experience the beauty of Chinese calligraphies and poems by tapping on the lyric that sync with the rhythm, or draw a calligraphy through the music notes.<br/><br/>===Features===<br/>1. Lyrics are important part of the gameplay.<br/>2. We applied Chinese calligraphy to the gameplay.<br/>3. We’re the first rhythm game that collects indigenous music, Taiwanese Hokkien music, and a cappella music. <br/>4. We combined classic Chinese literature with Taiwanese modern culture in our storyline. <br/><br/>Lyrica is a rhythm game that’s unique in many ways. It’s musically entertaining; it expresses literature artistically; it applied poetries in the gameplay and created a new gaming experience for the gamers.<br/><br/>===Awards===<br/><br/>2017  2nd International Mobile Games Awards SEA “Best Meaningful Play”<br/>2017  3rd Tencent GAD Game Award “Best Mobile Game”<br/>2017  International Mobile Games Awards CHINA Nominee<br/>2017  Indie Pitch Awards Nominee<br/>2017  TapTap Annual Game Awards \"Best Audio\" Nominee", "metacritic": null, "released": "2018-11-22", "tba": false, "updated": "2019-10-22T14:34:52", "background_image": "https://media.rawg.io/media/screenshots/4a5/4a58d8724e04dcb19e9433d0a7c9ec8e_FVyHz5M.jpg", "website": "https://www.facebook.com/LyricaGame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Han Chuang Culture and Art Co"], "genres": ["Arcade", "Casual"], "publishers": ["Han Chuang Culture and Art Co"], "esrb_rating": null}