{"id": 293432, "slug": "fish-tank-free-casual-fishing-game-for-adults-kids", "name": "Fish tank - Free casual fishing game for adults, kids and toddler - HD", "name_original": "Fish tank - Free casual fishing game for adults, kids and toddler - HD", "description": "Fish Tank Games Free For Kids is a new fishing games for kids where you need to bring Mike the fish as far as possible!<br/><br/>This cool sea fishing games for kids is free to play and does not need wifi. If you or your kids like fish racing games or fish and shark games, you will be pleased to play this cute mini game. This fish tank games seems to be easy, but keep in mind that there is a lot of danger underwater! Scuba divers will try to touch you, urchin can bite you and fisherman fish hook lines will try to catch you!<br/><br/>Fish Tank Games Free For Kids is suited for adults, kids and toddler. With a wonderful soundtrack it's the best fish games ever. Toddlers will love Mike the fish, he is so cute! Mike the fish is trapped in his fish tank and cannot escape. So he moves all the time to avoid the underwater dangers!<br/><br/>How to Play:<br/>- Mike the fish know how to swim, but he is heavy<br/>- Touch the screen anywhere to make him swim higher<br/><br/>Game Features:<br/>- Fun fish tank game<br/>- Easy for toddler, fun for both adults and kids<br/>- HD graphics<br/>- Beautiful sound track and sound effects<br/>- Simple one touch control gameplay<br/><br/>Dive deep into the ocean and play Fish Tank Games Free For Kids!", "metacritic": null, "released": "2015-08-20", "tba": false, "updated": "2019-10-22T14:34:56", "background_image": "https://media.rawg.io/media/screenshots/bb2/bb293dc3383c842cf030cd439b819c21_KGM8fpq.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Arcade"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Everyone 10+"}