{"id": 293413, "slug": "burning-hot-inferno-vegas-casino-slot-machine", "name": "Burning Hot Inferno - Vegas Casino Slot Machine", "name_original": "Burning Hot Inferno - Vegas Casino Slot Machine", "description": "Play Burning Hot Inferno Vegas Casino Slot Machine and WIN BIG with never ending action! Get FREE COINS EVERY 5 MINUTES! Featuring HUGE PAYOUT and exciting gameplay! BURN THE SLOT through FREE SPINS in our Burning Hot VEGAS STYLE slot machine. Spin the reels and WIN BIG while you enjoy beautiful graphics and entertaining sounds of LAS VEGAS. Be welcomed to the new style of slots games!<br/><br/>Burning Hot Inferno Vegas Casino Slot Machine was created with the fun atmosphere of LAS VEGAS in mind where the DEVIL is CUTE and is your friend! Experience FUN PLAY, HUGE PAYOUT, FREE SPINS and BONUS LEVEL UP. Start the game win an incredible amount of $100,000. Play and get a chance to win the ONLINE JACKPOT of $1,000,000 !!!<br/><br/>Keep your device BURNING HOT: fill your Hot drink and play this devil theme slot to get all your free spins.<br/><br/>Features of Burning Hot Inferno Vegas Casino Slot Machine:<br/>- Free coins every 5 MINUTES<br/>- Initial BONUS OF $100,000!<br/>- Reel Slot feeling and sound of LAS VEGAS REELS<br/>- Premium graphics and sound effects<br/>- FREE SPINS, BONUS, JACKPOT<br/>- Free coins on LEVEL UP!<br/><br/>Look no further, you've finally found the best slot machine on iOS!<br/><br/>This game is targeted for an adult audience (21+). This game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at this game does not imply future success at \"real money gambling\".", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-10-22T14:34:54", "background_image": "https://media.rawg.io/media/screenshots/4d1/4d1a7a64fa800d998f60867d1d320eed_MTzi6NN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Card"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Teen"}