{"id": 293434, "slug": "horseshoe-casino-cowboy-slots-machine-with-bonus", "name": "Horseshoe Casino - Cowboy Slots Machine with Bonus", "name_original": "Horseshoe Casino - Cowboy Slots Machine with Bonus", "description": "Play Horseshoe Cowboy Vegas Casino Slot Machine and WIN BIG with never ending action! This beautiful classic 9 lines slot machine with bonus game will make you want to play all night long. First, take a tiny sip of your good old bourbon and spin the reels to win HUGE AMOUNT OF GOLDS! Featuring AWESOME PAYOUT and exciting gameplay, this high quality wild west slot machine is filled with entertaining animations and realistic slot machine sounds.<br/><br/>Download and get a chance to get rich today! Go back in time with the Cowboys and Sheriffs and spin the wheel of fortune to win up to 4 TIMES your gains! Free spins and good payout and you could win big money. Get FREE MONEY EVERY 5 MINUTES to play! BURN THE SLOT through FREE SPINS in our WILD WEST COWBOY STYLE slot machine. Spin the reels and WIN BIG while you enjoy beautiful graphics and entertaining sounds of the wrangler atmosphere. Be welcomed to the new style of slots with bonus games!<br/><br/>Horseshoe Cowboy Vegas Casino Slot Machine was created with the fun atmosphere of the WESTERN in mind where the FUN and EASY MONEY was available. This slot machine is filled with amazing bonus, free spins and a HUGE DAILY JACKPOT. Play this epic cowboy ranch slot and get a chance to double your money on EVERY WINNING SPIN! Experience fun western play, awesome payout, FREE SPINS and BONUS LEVEL UP in horse shoe slot machine. Start the game win an incredible amount of $100,000. Play and get a chance to win the ONLINE JACKPOT on every reel spin! Get this free to play game now and get bonuses chips for every 5 minutes of gameplay. Double your winning and get free spin with this high quality casino with bonus game!<br/>Stay at home and open your device, fill your glass and play this horseback theme slot to get all your free spins. Spin the classic 9 lines, five reels wheel machine and get a chance to win big!<br/><br/>Features of Horseshoe Cowboy Vegas Casino Slot Machine:<br/>- Free coins every 5 MINUTES<br/>- Initial BONUS OF $100,000!<br/>- 5 reel wheel machine<br/>- Old School 9 lines payout<br/>- Reel Slot feeling and sound of the wild west!<br/>- Premium HD graphics and sound effects<br/>- FREE SPINS, BONUS, JACKPOT<br/>- Double winnings on every spins<br/>- Free coins on LEVEL UP!<br/><br/>Look no further, you've finally found the best slot machine on the Store!<br/><br/>This game is targeted for an adult audience (21+). This game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at this game does not imply future success at \"real money gambling\".", "metacritic": null, "released": "2017-05-15", "tba": false, "updated": "2019-10-22T14:34:56", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea9a942f0b45599fa79be06964abb266.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Card"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Teen"}