{"id": 293439, "slug": "snowmobile-stunt-racing-game", "name": "Snowmobile Stunt Racing Game", "name_original": "Snowmobile Stunt Racing Game", "description": "Snowmobile Stunt Racing Game Free - the latest free snow mobile racing games!<br/><br/>This challenging snowmobile game is a fun physic racing games for kids. The goal is simple, race, climb snowy hills and collect money on your way. If you're looking for a free snowmobile racing games for kids, look no further, this new snow racing will make you happy! But you have to be very careful when you race this free extreme snowmobile driving. If you go too fast, the snowmobile will flip and everything will explode! <br/><br/>This fun snowmobile games for kids is an extreme snowmobile driving experience. Do your kids like to play with trucks, cars or snowmobile? Simple controls makes the game easy enough to play for toddlers and preschool children and adults.<br/><br/>The game includes 5 snowmobile. Collect diamonds and youl will be able to purchase a new snowmobile in the store. Playing this free snowmobile games for kids, you get to master your jumping and crashing skill.<br/><br/>Features of Snowmobile Stunt Racing Game<br/>- FREE to play<br/>- 5 snowmobile to choose from<br/>- Plenty of diamonds in every levels<br/>- Cool snow and scenery graphics and audio track<br/>- Easy controls, even for kids<br/>- Awesome 2d physics<br/>- Support HD tablets and Phones<br/><br/>If your kids enjoys racing games, then this game is the perfect fit.<br/>Download and play Snowmobile Stunt Racing Game now!", "metacritic": null, "released": "2016-11-12", "tba": false, "updated": "2019-10-22T14:34:56", "background_image": "https://media.rawg.io/media/screenshots/381/3819cd2e7389c4e9d98fb0dde2439ec8_0JesJUX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Racing", "Arcade"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Teen"}