{"id": 293428, "slug": "soldier-vs-zombies-soldier-shooting-game", "name": "Soldier vs Zombies - Soldier Shooting Game", "name_original": "Soldier vs Zombies - Soldier Shooting Game", "description": "Soldier Zombies Shooting Games is a the latest army soldier vs zombies gun shooting games.<br/><br/>You are Arnold the biggest soldier of the army, but your town is infested with ugly zombies!<br/>So the goal is simple, cross the city and kill all the zombies! Don't get bite by them and collect coins on your way! You will be able to upgrade your gun for a machine gun or even a shotgun to blast zombies in the head!!!<br/><br/>KILL ALL THE ZOMBIES TO SURVIVE!<br/>In this city where zombies have taken your town, you can jump to avoid them if you want, but the best way to survive for an army soldier is to shoot zombies and kill them!!<br/><br/>COLLECT ALL THE GOLD! <br/>The only way to get a better gun is to collect many coins, so shoot all the zombies and upgrade your weapon now! In the shop you will find the best shooting gun, revolver, machine gun and shotgun!<br/>Army soldier, you're on your way home!<br/><br/>Soldier, Big Guns, Zombies and Blood in this shooting games, what more could you ask for?<br/><br/>FEATURES:<br/>- 9 levels fully loaded with zombies!<br/>- Great selection of weapons : Revolver, Machine gun and Shotgun<br/>- HD graphics<br/>- HD Quality Audio<br/><br/>Download and play Soldier Zombies Shooting Games now !", "metacritic": null, "released": "2015-10-17", "tba": false, "updated": "2019-10-22T14:34:55", "background_image": "https://media.rawg.io/media/screenshots/570/57084d5d52c399227fa2bc8b549ad81a_ObvailX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Adventure", "Arcade"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Teen"}