{"id": 293444, "slug": "a-skateboard-and-a-rock-gods-skate-like-there-is-n", "name": "A Skateboard And A Rock Gods- Skate Like There Is No Tomorrow !", "name_original": "A Skateboard And A Rock Gods- Skate Like There Is No Tomorrow !", "description": "A Skateboard And A Rock God - Skate like there's no tomorrow!<br/><br/>This new free skateboard games brings all the fun of skateboarding to your device. Try to skate as long as you can while avoiding the 'Death' and collect coins and stars on your way. More coins means that you can buy some new skateboarding clothes! Skate slow for fun or fast as a Rocket, just try to avoid the 'Death' and you will be fine. Otherwise, take your coins a get a new dentist !  Mike the rock god learn how to skate and decided to take some run with quarter pipes and kickers. He's having fun and try to be high in the sky while collecting stars... <br/><br/>FEATURES OF A Skateboard And A Rock God - Skate like there's no tomorrow!<br/>- Loaded with nice graphics, play this free skateboard games for hours of pure HD entertainment. <br/><br/>CHOOSE YOUR SKATEBOARDING OUTFIT<br/>- Choose between 4 outfits for your skateboarder. Classic, Black Metalcore Dude, Classic Blue Coat, or simply underwear !<br/>- Play for hours of fun and do all the skateboard freestyle that you can with your outfit!<br/><br/>FUNNY and HILARIOUS <br/>- Are you enjoying broken noses? Feeling a rush when you see blood drips? Go fast on your skateboard and  don't break your neck!<br/><br/>FUN FOR EVERYONE<br/>- Learn how to improve your skateboarding skills in this skateboard games for free. Collect stars and coins and buy some new skateboard clothing!<br/>-Nice dubstep music track to help you feel better and relaxed. Say goodbye to anxiety with this skateboard stunt games!<br/><br/>Download and play : A Skateboard And A Rock God - Skate like there's no tomorrow!", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-10-22T14:34:57", "background_image": "https://media.rawg.io/media/screenshots/a71/a71ed3d71af054beab2cb7cdba8af2ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Action", "Arcade"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Everyone 10+"}