{"id": 293443, "slug": "amazing-santa-run-christmas-game-for-kid", "name": "Amazing Santa Run - Christmas game for kid", "name_original": "Amazing Santa Run - Christmas game for kid", "description": "Christmas is coming! Run Santa Run and get into your sleigh!!!<br/><br/>It’s time for some fantastic Santa run and jump race with the Christmas games for kid! <br/><br/>Enjoy challenging levels and run with Santa and collect all the cookies in this app designed for ages 2 &amp; up.<br/>When you download the Christmas games for kid App you’ll get to run and jump with Santa in 12 challenging levels. The levels are designed to be an easy game for kids but also challenging for older kids. Christmas games for kid is fun and challenging for kids of all ages!<br/>Santa loves cookies and need to collect them to retrieve is sleigh!<br/>The best Santa games for kids. Prepare yourself for the best Christmas run and jump game. This Christmas games for kids is the perfect Christmas game this year! Play as Santa and run and jump trough 12 exciting levels.<br/><br/><br/>Features:<br/>- Easy Christmas gameplay for kids<br/>- Beautiful Santa animation<br/>- Lots of cookies to collect!<br/><br/>How to play:<br/>- Choose from one of the 12 levels<br/>- Tap to jump<br/>- Use Santa to collect as much cookies as you can<br/>- Next level will be unlocked when you finish<br/><br/>The fun never stop in this Christmas games for kids! Run and jump with Santa as much as you can!", "metacritic": null, "released": "2014-12-09", "tba": false, "updated": "2019-10-22T14:34:57", "background_image": "https://media.rawg.io/media/screenshots/c6f/c6ffaf06f04f9e030d9f4db0b4f207a9_xQziNwY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akimis"], "genres": ["Adventure", "Family"], "publishers": ["Akimis solutions informatiques"], "esrb_rating": "Everyone 10+"}