{"id": 293574, "slug": "trains-girl-locomotion", "name": "Trains Girl Locomotion", "name_original": "Trains Girl Locomotion", "description": "Welcome to Trains Girl Island\r\n<p>It's a beautiful sunny day on Trains Girl Island. A beautiful day... EXCEPT, the denizens of Trains Girl Island want to hang out, but have no convenient infrastructure with which to travel!</p>\n<p>Only you, the train planner of Trains Girl Island, can connect friends and loved ones together!</p>\n<p>Build tracks, connect the towns, and add trains to your growing network. Can your infrastructure stand up to the task of getting everybody to Cat Town for the boardgame night? How about Chickenville for the LAN Party? There is only one way to find out...</p>\r\nInstructions\r\n<p>Use the tile selector to choose a track type, and click place tracks. The red X is the eraser, and the small house returns you to the central train building.</p>\n<p>Certain obstacles prevent the placement of tracks! Specifically, water and mountains. Trees do not block the way, and can be built over/erased. Bridges are automatically built or disassembled when appropriate connections are on either side of a river.</p>\n<p>There are three kinds of signals.</p>\n<ul><li>Regular signal - Denoted in the side bar by a single cyan light. These prevent trains from going to the track ahead if there is a train on the space in front of it. These are important to prevent trains from crashing into eachother.</li><li>Chain signal - Denoted in the sidebar by a dual yellow light, these prevent passage if all exits of the next track are closed! When yellow, the train will check ahead to see if the next signal it wants to go to is passable. These help keep intersections from getting deadlocked!</li><li>Train stop - Denoted in the sidebar by a pair of red lights. These are where trains stop! Place next to a town to give that town a place for trains to pick people up! Alternatively, any stop that is not connected to a town will be treated like a train depot, and trains that don't have anywhere better to be will go there to wait for their next trip, and be out of the way of other trains!</li></ul>\n<p>Click on the central train building to add more trains to your network!</p>\n<p>Mouse over towns to see their names. Click to see who is there right now and where they want to go!</p>\n<p>Sometimes, trains don't make the wisest decisions. They may get gridlocked, crash, or try to drive into the ocean. If a train gets stuck, click on it to give it a bit of nudge out of its current dire predicament.</p>\n<p>In desktop versions, hold Q to quit. The game autosaves your tracks and signals when you leave, which can be loaded next time.</p>\r\nControls:\r\n<ul><li>WASD/arrow keys : move the camera around</li><li>Mousewheel, or - and = keys : Change camera zoom</li><li>Number keys - Hotkeys for various tiles to place.</li><li>R - Rotate the currently selected tile.</li><li>Escape key - Deselect current tile.</li><li>H - Home key. Go home!</li><li>M - Mute or unmute music!</li><li>Q - Hold to quit</li></ul>", "metacritic": null, "released": "2019-02-14", "tba": false, "updated": "2019-08-28T23:17:59", "background_image": "https://media.rawg.io/media/screenshots/8c0/8c06f3efaaba5cc7c6e2582f25f26e58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Lauren H"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}