{"id": 293795, "slug": "brain-storms", "name": "Brain Storms", "name_original": "Brain Storms", "description": "<p>Benjamin Franklin was known for his distaste for patents and patenting his inventions. So when he died, and an evil patent officer stole his inventions to patent them himself, his assistant couldn't stand this lack of respect and resurrected his brain to give him the chance to fight back against the evil patent officer. Using his postmortem invention, a mechanical vehicle capable of firing three different elemental storms controlled by his own thoughts, Ben Franklin could now go to war against the patent officer's blatant plagiarism!</p>\n<p>This game was built as a student final project at Full Sail University. It was created in less than 4 months by a small group of students. The majority of the art and all of the music were only added in the last month of development.<br/></p>\n<p>Developer warnings:</p>\n<p>Moving Platforms are super buggy! Our time constraints did not allow us to fix this bug so don't rage at the platforms too much! (You may even find some speed-run strats!) </p>\n<p>Sometimes it helps to restart the stage. All levels are available in the stage select screen on the main menu at all times.</p>\n<p>Using non-recommended settings will likely contain unforeseen bugs. The recommended settings were the ones used to test every build.</p>\n<p>Windows 10 appears to have more bugs than Windows 7 or 8. All other OS's were not tested, including Mac. (One team member used a Mac to play the final game once and did not report any unknown bugs.)<br/></p>", "metacritic": null, "released": "2019-02-13", "tba": false, "updated": "2019-02-15T05:35:38", "background_image": "https://media.rawg.io/media/screenshots/865/865f7241e50d8571fe1cbc586d057b7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Voila"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}