{"id": 29383, "slug": "hexen-ii", "name": "HeXen II", "name_original": "HeXen II", "description": "<p>The Four Horsemen of the Apocalypse lurk in the shadows before you. They are Death, Pestilence, Famine, and War. They are the root of all that is evil. They are the least of your worries. The last know Serpent Rider, Eidolon, lives. As the Necromancer, the Assassin, the Crusader, or the Paladin, you must defeat the dark generals and their Hell-spawned legions before you can face the Archfiend and attempt to end his ravenous onslaught. Go in peace and you will surely die.<br />\nExperience the Quake Engine&#39;s true, polygon-based modeling for the most realistic, detailed environments ever seen in 3D gaming.<br />\nPossess distinct spells, powers and 32 new weapons. With experience, gain levels, more hit points and certain abilities that apply to your specific character class, such as increased speed, firepower, and jump distance.<br />\nBludgeon your way through four demon-infested worlds - Medieval, Egyptian, Mesoamerican and Roman. Smash stained glass windows, collapse structural beams, and pulverize trees.<br />\nCome face-to-face with Knight Archers, Fire Imps, Were-Jaguars, Skull Wizards and more. Go in with friends, or go against foes in a bloody Deathmatch. Up to 16 players can go at it via LAN and over the Internet.</p>", "metacritic": null, "released": "1997-08-31", "tba": false, "updated": "2023-10-26T13:24:34", "background_image": "https://media.rawg.io/media/screenshots/0fe/0fece94ba577d93b20e791e5976c81f7.jpg", "website": "http://www.idsoftware.com/games/vintage/hexen2/", "rating": 3.52, "rating_top": 4, "added_by_status": {"yet": 58, "owned": 798, "beaten": 26, "toplay": 17, "dropped": 32, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 67, "suggestions_count": 525, "game_series_count": 2, "reviews_count": 67, "platforms": ["PC"], "developers": ["Raven Software"], "genres": ["Action", "Shooter"], "publishers": ["Activision Blizzard", "id Software"], "esrb_rating": null}