{"id": 29380, "slug": "zombie-wars", "name": "Zombie Wars", "name_original": "Zombie Wars", "description": "<h3>ZOMBIE BATTLES; </h3> Impressive weapons, simple fun and immersive maps. Survive and destroy the zombies. Kill more zombies and get more money. Improve your skills and race yourself on practice maps.<h3>Game Modes</h3><strong>ZOMBIE WAVE MODE:</strong> In this mode, you have to kill all zombies up to 20 waves. No extra lives, no bombs, just guns and bullets. Collect the falling objects from the zombies and survive. Kill more zombies and earn money to get more different weapons and open weapon boxes. Once you've finished all the waves, you can move on to the next section.<br/><br/><strong>TRAINING MODE</strong> In this mode, you can enter one of the practice maps and test your skills and experience weapons. You will also learn a little about general game mechanics and weapon dynamics. Remember, first of all you have to survive.<h3>current and Dynamic</h3>Up-to-date maps will always be added, updated weapons and different zombies will be added. Let us know about your experiences, problems and anything you want to change about the game. Steam trading cards and in-game achievements will be updated soon. We would like to state that the game is currently in the trial phase. We will develop and grow together with you valuable players.", "metacritic": null, "released": "1996-01-01", "tba": false, "updated": "2021-06-04T03:56:46", "background_image": "https://media.rawg.io/media/screenshots/22c/22cccf58ca7fe6a0742801aee7ff9ac1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gee Whiz! Entertainment", "İsmail GÜNGÖR"], "genres": ["Action", "Arcade", "Casual", "Indie"], "publishers": ["Sprint Software", "HOLO GAMES"], "esrb_rating": null}