{"id": 293968, "slug": "panzer-marshal", "name": "Panzer Marshal", "name_original": "Panzer Marshal", "description": "<p>Historical tactical scale World War 2 turn based strategy game, that puts the player in the role of an Axis or Allied army officer. You command battalion level units with the objective to fight with the enemies and to defeat crucial landscapes such as the cities, battlefields and other key strategic points.  Forge a battle winning army and conquer your foes. Do you have what it takes to be a Panzer Marshal ?</p>\n\r\n“No plan survives contact with the enemy”<br/>                                                                  --  Field Marshal <strong>Erwin Rommel</strong>\n<p>   <br/></p>\n<p>• USA, German and Soviet campaigns in 100+ historical accurate scenarios, and introductory tutorial scenario. <br/>• 4000 historically accurate units, each unit having more than 20 stats and only being available depending on scenario year, based on AdlerKorps equipment. 30 countries available. <br/>• Build you own core army, train your core units to increase their experience, gain prestige to upgrade or buy new units, carry them over scenarios as the campaign progresses. <br/>• Units can gain Leaders in combat for more abilities <br/>• Special unit actions depending on unit class <br/>• Cross platform save/load game state at anytime beside the automatic turn save . Cloud based save/load game facility to continue playing on other devices. <br/>• 20 Terrain types that influence combat, weather and ground conditions, automatic reinforcements. <br/>• Strategic overview map of entire battlefield, clean user interface that never hides the battlefield from player. <br/>• Full featured unit upgrade/purchase Equipment window with sorting and filtering </p>\n\n<p><em>Thank you for your support,</em><br/></p>\r\nPanzer Marshal\r\n<p><em>                                  Call to mind</em></p>\n\n<p>Report issues or propose enhancements.<br/>Checkout our facebook page for gameplay videos and news.</p>", "metacritic": null, "released": "2019-02-10", "tba": false, "updated": "2019-02-15T06:00:46", "background_image": "https://media.rawg.io/media/screenshots/a96/a96050a5b11fd06aa247b0a6d7da7d49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nicu Pavel"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}