{"id": 294089, "slug": "shai-la-of-the-sith-v2", "name": "Shai-la of the Sith (v2)", "name_original": "Shai-la of the Sith (v2)", "description": "<p><strong>English </strong>:</p>\n\n<p>\"Star Wars\" fan game.</p>\n<p>Shai-la of the Sith is a young girl who worked in the first Death Star construction during the Imperial era... until the Dark Lord of the Siths, Darth Vader, detected her because of the Force he felt in her. She then became his apprentice and discovered her new life and new powers.</p>\n<p>Take control of Shai-la during several missions on different planets, and live the two trilogys events through her eyes!</p>\n<p>This game is fully playable with keyboard.<br/></p>\n<p>Winner of the 2009 AGS Award for best non-point and click game.<br/></p>\n<p>***</p>\n<p><strong>Français </strong>:</p>\n<p>Fan-game Star Wars. Shai-la du Sith est une jeune fille qui travaillait comme simple technicienne, aidant à la construction de la première Etoile Noire durant l’ère Impériale… jusqu’à ce que le Seigneur Noir des Siths, Dark Vador, la repère, car il sentait la Force en elle.\r\nElle devient alors son apprentie et découvre sa nouvelle vie et ses nouveaux pouvoirs.\r\nDirigez Shai-la à travers plusieurs missions qui vous amèneront sur différentes planètes de la galaxie, et revivez les différents événements des deux trilogies à travers ses yeux!</p>\n<p>Le jeu est entièrement jouable au clavier.</p>\n<p>Ce jeu a gagné l’AGS AWARD DU MEILLEUR JEU NON-POINT&amp;CLICK 2009.</p>", "metacritic": null, "released": "2019-02-12", "tba": false, "updated": "2019-02-15T06:17:39", "background_image": "https://media.rawg.io/media/screenshots/b12/b1221814e363813e468e12ffa3550456.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shai-la"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}