{"id": 2943, "slug": "the-treasures-of-montezuma-4", "name": "The Treasures of Montezuma 4", "name_original": "The Treasures of Montezuma 4", "description": "Free the gods’ powers and fulfill your destiny in the <strong>Treasures of Montezuma 4</strong>!  This new tile-matching puzzle game is overflowing with mystery and excitement!  Follow the story of Anna, who travels to an Aztec ruin to uncover an ancient secret. The journey is loaded with tons of levels, three all new game modes, and an epic boss battle that you will never forget!<br/><br/>With three all new game modes to play through, your trip to the jungle is going to last awhile!  You are not alone on this journey – the powerful totems will help you in your advantage unleashing their powerful magic! Each adventurer will have his own place of worship and power fulfillment – the Ziggurat that you can raise and grow. Learn the hidden powers of gods, upgrade your character all the way to level 100 and grab every achievement you can along the way!  Unlock the secrets of <strong>Emperor Montezuma</strong> today!<br/><br/>-  Three all-new game modes<br/>-  98 Story Mode levels and 69 Quest Mode levels<br/>-  Epic boss battle in Story mode<br/>-  Seven powerful totems and eight unique bonuses<br/>-  Build and decorate a Ziggurat<br/>-  Upgrade your character to level 100<br/>-  Tons of in-game achievements", "metacritic": null, "released": "2014-05-16", "tba": false, "updated": "2024-04-06T13:12:29", "background_image": "https://media.rawg.io/media/screenshots/e65/e65f6f53060001d7a079a2370a4eae12.jpg", "website": "", "rating": 3.32, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 244, "beaten": 12, "toplay": 1, "dropped": 5, "playing": 2}, "playtime": 4, "achievements_count": 157, "ratings_count": 31, "suggestions_count": 269, "game_series_count": 4, "reviews_count": 31, "platforms": ["PlayStation 3", "macOS", "iOS", "PC"], "developers": ["Alawar Entertainment", "SMARTPHONE LABS"], "genres": ["Adventure", "Arcade", "Casual", "Indie", "Puzzle"], "publishers": ["Buka Entertainment", "Alawar Entertainment"], "esrb_rating": "Everyone 10+"}