{"id": 294337, "slug": "rouge-noire-royal-solitaire-tv", "name": "Rouge Noire Royal Solitaire TV", "name_original": "Rouge Noire Royal Solitaire TV", "description": "The aim of the game is to file all foundation piles (A) and play so many rounds as possible.\\n\\n Every pile in the game is to be laid alternately with a red and black card.<br/><br/>To begin there are four decks with 10 cards (C). The uppermost card is uncovered and can be played.<br/><br/>On the  eight foundation piles (A) it starts with the aces if they appear in the play course. On them are laying  2, 3, 4. . . .  Q, K). The final picture shows 8 turned kings.<br/><br/>In addition, there are 2 auxiliary packages (B) which begin in each case with a black king and with a red king. On them you can lay  Q, J, 10, 9 . . . 3, 2.<br/><br/>The game goes on, while one turns the talon (D) card for card. Every card is to be checked whether it fits on an ace foundation piles (A) (with subsequent cards) or on a king's piles (B) (with subsequent cards). The king's piles (B) let themselves put down in the course of the game often card for card on an ace foundation pile (A). Then the free-become king's place again may be booked with a king. Every turned card of the talon which cannot be used is filed openly on the pile (E). If all cards are turned, the pile (E) becomes the talon (D) again - this may often happen arbitrarily.<br/><br/>For every laid card you get points. Bonus points will award for every closed ace pile.\\n\\n Your sixth best games are put down on the top list.<br/><br/>Good luck!!\"", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-10-22T14:35:05", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gerhard Lentschik"], "genres": ["Card"], "publishers": ["Gerhard Lentschik"], "esrb_rating": "Everyone 10+"}