{"id": 294361, "slug": "dream-job-fashion-show", "name": "Dream Job Fashion Show", "name_original": "Dream Job Fashion Show", "description": "Is your little girl ready to be an astronaut?  A scientist?  The President?!  Then the perfect dress-up doll has finally arrived!<br/><br/>Now she can be all of these and more with Career Fashion Show.  This forward-thinking dress-up app includes more than 12 careers for little girls to try out.<br/><br/>First you customize the virtual paper doll so it looks just like your child- you can select the doll’s skin tone, eye color, and hair to match.  Then the fun begins!  Select all kinds of different careers to see the doll dressed up as a doctor, a race car driver or an airplane pilot.  Girls have a wide variety of cool careers to choose from- from STEM jobs (science, technology, engineering and mathematics) to thrilling, heart pounding jobs that puts your child in the middle of the action.  How’s a girl to know she wants to be a professional deep sea diver or climb Mount Everest without picturing herself there?<br/><br/>This app helps your little girl see the possibilities of what she can become - widen her horizons beyond more traditional careers.  Let her dream of piloting helicopters across cities, managing her own top corporation as a CEO, or even making historic rulings as a Supreme Court Judge.<br/><br/>Play the app as a traditional dress-up game or for extra fun you can roll the dice to randomize the doll- and her outfit!  Will you end up with Space Cop, ruler of the Galaxy?  Or will you be the General Surgeon on top of Mount Everest?  Perhaps Judge Deep-Sea Diver is more to your liking.<br/><br/>The possibilities are endless!<br/><br/>If you have a little girl ages 3-8 or if you want to dress up yourself as your profession, all you amazing women firefighters and surgeons and astronauts out there, this is the perfect app for you.<br/><br/>Have fun and dream big for the future at the same time!<br/><br/>Features:<br/>-Retina HD<br/>-Game is for girls ages three and older.<br/>-Includes over 15 professional outfits with tons of accessories, plus 15 animal friends and 16 illustrated backgrounds.<br/>-Beautiful graphics by children's book artist Laura Tallardy.<br/>-Child-friendly!<br/><br/>Note for Parents<br/>This app:<br/>- Contains a limited amount of free content with an in-app purchase to unlock all items in the Parents page. <br/>- Does contain links to developer's other apps on a separate \"Parents\" page.<br/>- Does not contain links to social networks.<br/>- Does not use data collection tools.<br/>- Does not require an internet connection to play.<br/>Please see our privacy policy for more information.", "metacritic": null, "released": "2014-12-14", "tba": false, "updated": "2019-10-22T14:35:07", "background_image": "https://media.rawg.io/media/screenshots/db8/db83c0f727951a0a1cb7055b7df31b79_kzYSFoD.jpg", "website": "http://lauratallardy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laura Tallardy"], "genres": ["Simulation", "Family"], "publishers": ["Laura Tallardy"], "esrb_rating": "Everyone 10+"}