{"id": 294387, "slug": "medieval-battlefields-black-edition-2", "name": "Medieval Battlefields Black Edition", "name_original": "Medieval Battlefields Black Edition", "description": "Medieval Battlefields Black Edition is a turn-based tactical game that takes you back to medieval Europe!<br/>Train your armies, build your castles and improve your war equipment! Crush your enemies, outsmart your opponents and dominate the Dark Ages! Dive into the chivalric but unforgiving period of human history and pit your stratagems and tactical skills against other players. Play with up to eight people online or claim your victory alone!<br/><br/>You can be a knight of the English Crown, a champion of the French Court or a fierce Viking marauder as you navigate the ever-changing theatre of war. Wrest lands from those unwise enough to cross your path and finance your continental conquest! Will your campaigns be the stuff of songs and legends as you march to triumph? Or will you buckle under the onslaught of your adversaries? History is written by the victors – make sure you're not just a footnote.<br/><br/>● Fast paced turn-based tactical game <br/>● Play ONLINE MULTIPLAYER with up to 8 people<br/>● Form an alliance and crush the opponent team<br/>● Train your armies to defeat your enemies in over 20 single-player maps<br/>● Play Campaigns, Skirmish and HotSeat<br/>● Fight on behalf of England, France or as a savage Viking<br/>● 27 medieval army units, including elite units like: Templar knight, Paladin and Beowulf<br/>● Improve your troops and enhance your equipment<br/>● Upgrade your castle – victory favors the prepared<br/>● Dozens of challenging maps and varied battlefields<br/>● Online Top Players chart and ranking<br/>● In-game chat (multiplayer)<br/><br/><br/>TRY IT FREE, THEN UNLOCK THE FULL PACK OF FEATURES FROM WITHIN THE GAME! <br/>(no micro purchases)<br/><br/>-----------------------------<br/>Game available in: English, German.<br/><br/>-----------------------------<br/>If you like this game, please rate it! <br/>Also, check out other games from Cateia Games. <br/>Happy gaming!", "metacritic": null, "released": "2016-06-09", "tba": false, "updated": "2019-08-02T04:34:51", "background_image": "https://media.rawg.io/media/screenshots/e87/e877cac498ff338ba8ed770216690ca8_Q19IdtN.jpg", "website": "http://www.cateia.com/medievalbattlefields/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["Cateia GAmes"], "genres": ["Action", "Strategy"], "publishers": ["K.I.D"], "esrb_rating": null}