{"id": 294353, "slug": "find-the-difference-games-christmas-edition", "name": "Find the Difference Games: Christmas Edition", "name_original": "Find the Difference Games: Christmas Edition", "description": "Get into the holiday spirit with this beautifully illustrated Find the Differences Christmas puzzle game with art by renowned illustrator Wendy Edelson!  Each painting has five subtle differences- can you find them all and become a Christmas Difference Finding Master?! <br/><br/>Test your brain's visual skills and see if you can find all five differences in each of these gorgeous paintings.  Spot different tree ornaments behind Santa Claus when he comes down the chimney- are those extra antlers on the reindeer on the roof??  Join the festivities with forest animals dancing in the snow, cheerful frosty snowmen and yummy decorated Christmas cookies in 24 different holiday levels!  You'll love the seasonal music that plays while you train your brain to find the subtle changes in the pictures of cats, dogs, mice, deer, bunnies, birds and kids frolicking and ice skating in a snowy winter wonderland.  Tons of colorful peppermints and candy canes, frozen snowflakes, stockings stuffed with presents and woolen mittens will set the stage for family holiday fun for kids and adults!<br/><br/>The game will give you hints where to look more carefully if you need help finding all the differences. Celebrate with fireworks when you find all of them in time! <br/>This educational puzzle game is great for the whole family- all images are appropriate for all ages.<br/><br/>-This app includes 24 levels, 12 levels are free to try and the rest are available via an in-app purchase. <br/>-No third party advertisements. <br/>-Internet connection not required to play. <br/>-Does not contain links to social networks. <br/>-Does not use data collection tools.<br/>-Contains links to developer's other apps from the Credits page.<br/><br/>Please see our privacy policy for more information.", "metacritic": null, "released": "2013-12-06", "tba": false, "updated": "2019-10-22T14:35:07", "background_image": "https://media.rawg.io/media/screenshots/0f0/0f00ff5bebab5e1b0374fa335fecafcc_P7cmkle.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laura Tallardy"], "genres": ["Family", "Puzzle"], "publishers": ["Laura Tallardy"], "esrb_rating": "Everyone 10+"}