{"id": 294365, "slug": "find-the-differences-easter-bunny-free-edition-pic", "name": "Find the Differences: Easter Bunny Free Edition Picture Search Game for Kids", "name_original": "Find the Differences: Easter Bunny Free Edition Picture Search Game for Kids", "description": "Are you ready to enter an adorable world of Easter Bunnies, ducks and more to solve some fun wildlife puzzles? With beautiful graphics from children’s book illustrator Wendy Edelson, these 24 levels of springtime bunnies, flowers, ducks, chicks, birds, gardens and butterflies will delight boys and girls as they find all the differences in this classic spot-the-differences puzzle game.<br/><br/>Your children will love these detailed and friendly illustrations of animals doing what they do best! Baby bunnies snooze while mama bunnies watch over them, mama ducks take their chicks out for walks in the woods and birds sip from fountains in a spring garden. Toddlers, preschoolers and kids alike will have hours of fun quizzing their memory while hunting through pictures of frolicking rabbits, kittens playing in the sunshine, raccoons playing with ducks and chipmunks and bunnies eating fresh salad greens. With so many cute images to try, kids will learn observation skills while enjoying these charming and hand-painted illustrations.<br/><br/>The game will give you hints where to look more carefully if you need help finding all the differences. Celebrate with fireworks when you find all of them in time!<br/>This educational puzzle game is great for the whole family- all images are appropriate for all ages.<br/><br/>-This app includes 24 levels, 12 levels are free to try and the rest are available via an in-app purchase. <br/>-No third party advertisements.<br/>-Internet connection not required to play.<br/>-Does not contain links to social networks.<br/>-Does not use data collection tools.<br/>-Contains links to developer’s other apps and artist’s online portfolio from the Credits page.<br/><br/>Art by Wendy Edelson.<br/><br/>Please see our privacy policy for more information.<br/>http://lauratallardy.com/privacy-policy-en", "metacritic": null, "released": "2015-03-31", "tba": false, "updated": "2019-10-22T14:35:07", "background_image": "https://media.rawg.io/media/screenshots/3eb/3ebd04002e9fbb8b4a07265a36e28787.jpg", "website": "http://lauratallardy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laura Tallardy"], "genres": ["Family", "Puzzle"], "publishers": ["Laura Tallardy"], "esrb_rating": "Everyone 10+"}