{"id": 294367, "slug": "princess-fashion-show-gold", "name": "Princess Fashion Show: Gold", "name_original": "Princess Fashion Show: Gold", "description": "If your little girl wants to be a magic fairy tale princess, this is the dress up app for you! You can create your own beautiful princess with Princess Fashion Show- a virtual paper doll app that lets you make and dress up a pretty princess fit for a fairy tale! Select her skin tone, eye color, hair color, hairstyle and outfit to make this cute paper doll look just like you! <br/><br/>Have fun dressing up your princess from a wardrobe full of pretty dresses, jeweled tiaras, try on a glitter gem jewel necklace, bracelet, earring, ring (the jewelry sparkles!), fancy purse and folding fan to create the ultimate in royal style. Be a fashion designer and select different colors for the dresses and shoes for mix-and-match fun! <br/><br/>You can give your princess a name, and she can even have a royal pet, like a royal puppy or a sweet little kitten. She can model her fairytale outfit in lots of different scenes like a medieval castle, an enchanted forest, a rose garden, and more magical places! <br/><br/>Roll the dice to get a new princess with a different, random outfit every time. <br/><br/>When you're done giving her a beauty makeover, you can save your princess to your device's Photo Album. Show off your fashionista skills by creating endless outfits for your princess dress up doll! <br/><br/><br/>Features: <br/>-Game is for girls ages three and older. <br/>-Includes over 20 dresses with tons of accessories, 7 princess pets and 9 different backgrounds. <br/>-Beautiful graphics by children’s book artist Laura Tallardy. <br/>-Available in English, Spanish, French, German, Portuguese, Danish, Dutch, Italian, Russian, Korean, Japanese and Chinese <br/>-Child-friendly! <br/><br/><br/>Note for Parents <br/>This app: <br/>- Does not contain ads or in-app purchases. <br/>- Does not contain links to social networks. <br/>- Does not use data collection tools. <br/>- Does not require an internet connection to play. <br/>Please see our privacy policy for more information.", "metacritic": null, "released": "2012-10-16", "tba": false, "updated": "2019-10-22T14:35:08", "background_image": "https://media.rawg.io/media/screenshots/832/8327ca83f31825cef7adf2942d706473_Sn1Hmg9.jpg", "website": "http://princessfashionshow.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laura Tallardy"], "genres": ["Simulation", "Family"], "publishers": ["Laura Tallardy"], "esrb_rating": "Everyone 10+"}