{"id": 294300, "slug": "hangman-premium", "name": "Hangman Premium", "name_original": "Hangman Premium", "description": "*** GET ONE OF THE BEST WORD GAME, FREE WITH MORE THAN 5M DOWNLOADS WORLDWIDE! ***<br/><br/>A fun spin on a classical words and letters game, this hangman game will bring you more than any other available hangman app:<br/><br/>-----------------------------------------<br/>KEY FEATURES:<br/>- Over 10,500 hand-picked words (regular updates)<br/>- 7 beautifully designed themes with their associated characters and word lists (classic, cowboy, pirate, businessman, monster, stewardess and geek). Please save them from the rope and the gallows!<br/>- 6 extra themes: Beach, The wonderful Wizard of Oz, and Jack &amp; the Beanstalk, Halloween, Christmas, Easter<br/>- 8 difficulty levels (and more to come)<br/>- 5 different lifelines to help you guess words placed by some evil executioner<br/>- Beware though, because the task won’t be easy: Words to decipher have been carefully chosen<br/>- 3 languages, English (american &amp; british mix), French Pendu &amp; Spanish ahorcado<br/>- Upper levels can be unlocked by achieving specific scores. The extra Halloween &amp; Christmas, the Wonderful Wizard of Oz and Jack &amp; the Beanstalk themes can be accessed separately.<br/>- Social share by email, sms, Facebook<br/><br/>Stay abreast of your app latest developments, give your feedback and like it on:<br/>https://www.facebook.com/HangmanDeluxePremium<br/><br/>-----------------------------------------<br/>REGULAR UPDATES:<br/>Stay tuned, we will regularly update and bring new functionality and content (like Halloween) to your app!<br/>For iPad please use \"Hangman Deluxe HD\"<br/><br/>Hangman Deluxe Premium is brought to you by Oakfield Studio Limited, a software company that develops many apps, games and mobile services on different mobile platforms<br/><br/>Any issue? Please contact us at : hangman@oakfieldstudio.com, with your specific issue detailed.<br/><br/>Discover our apps &amp; services: http://www.oakfieldstudio.com<br/><br/>-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>Note : The hang-man game (also called jeu de pendu, el ahorcado, galgenmännchen, henker, l'impiccato, Jogo da Forca) is a classic word game, as well as a strategy game based on letter selection in order to guess and spell, discover or decipher words by finding all the letters constituting a specific word. It is close to other board games like puzzles, crossword puzzle, quizzes, mahjong, chess, sudoku, or trivia. This type of game will be enjoyed by the whole family, adults (for fun), as well as kids, children (for education purposes). It may help you learn new words, increase your vocabulary &amp; toefl score, thanks to its definitions taken from an official dictionary by guessing riddles from different categories. Definition of the word to guess, hints, clues, lifelines and good strategies will facilitate your progression throughout this challenge and avoid the rope and gallows ! In brief, it’s an educational, intelligent game for people fond of strategies, brain challenges while being still entertaining, interesting, fun with a beautiful design (check Halloween level) and a nice game play. We hope you’ll enjoy playing this hang man. On top of that, this app is free, isn’t that great !? Be smart, spice up your life, play Hangman Deluxe Premium !", "metacritic": null, "released": "2011-10-13", "tba": false, "updated": "2019-10-22T14:35:03", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd49eabb445d45f0f25e3b037097eb71.jpg", "website": "http://www.oakfieldstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oakfield Studio"], "genres": [], "publishers": ["Oakfield Studio"], "esrb_rating": "Everyone 10+"}