{"id": 294592, "slug": "they-will-never-stop", "name": "They Will Never Stop", "name_original": "They Will Never Stop", "description": "<p>\"They Will Never Stop\" is a mix between the classic breakout genre, and a shoot them up game. <br/></p>\n\n<p>The player's projectiles never disappear, making shooting a real decision to make, as it affects the difficulty of the game (more friendly projectiles = faster clear of the board = more enemy projectiles at once) and the scoring (the number of friendly projectiles is a score multiplier) .</p>\n<p>It's basically an endless score attack game, where each wave is a more densely packed with bricks than the one before.<br/></p><p>The game is designed to be played at 1920*1080 resolution. It scales badly with other resolutions, because I didn't really account for that while designing the game. My bad !<br/></p>\n<p>############################################################<br/></p>\n<p>Far away from civilization, strange bursts of energy have been picked up. Seeking answers, the Resolute discovers the sinister origin of these signals : an ancient people<br/>of emancipated androids rebuilds its once unstoppable army, in order to eliminate every living being in the universe...</p>\n<p>All is not lost ! The Resolute is armed with a weapon as powerful as it is unpredictable : the Anti-Entropy Canon, whose projectiles never stop.<br/>Will the Resolute's crew be able to stop this formidable foe ?</p>\n<p>############################################################</p>\n<p>I made TWNS as an exercise for my master's degree. As such, it is not meant to be a complete or mind blowing game. Its main purpose was to teach me how to<br/>work with 2D Vectors, and how to handle collisions with a very barebones game engine. That engine, NGCK, was made by one of my school's former teachers, and \"only\" implements a few basic necessities, such as displaying basic shapes, sprites, playing sounds. While I have plenty of ideas to make the game better, this will<br/>probably be the final state of the game.</p>\n<p>###########################################################</p>\n<p>Background song : Will Rosati - Lonely Troutman II</p>\n<p>This song is under the Creative Commons licence.<br/></p>", "metacritic": null, "released": "2019-02-17", "tba": false, "updated": "2019-02-18T03:35:12", "background_image": "https://media.rawg.io/media/screenshots/634/634f8571c0978d5c05de78e8379d7520.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wobs"], "genres": ["Action"], "publishers": [], "esrb_rating": null}