{"id": 294537, "slug": "densetsu", "name": "Densetsu", "name_original": "Densetsu", "description": "<p>-In the year 2xx5 a child and her friend as at the usual time went to play in the forest next to their village. It is then that an event will disrupt the life of these children.</p>\n<p>-Traumatized by what happened to himself child will spend 8 years before sinking into a universe mixing madness and utopia.</p>\n\n\n<p>-To advance in this world many choices will be to propose to you to build your own road in order to advance. Ally you to some people, integrated a group, stay alone ...</p>\n<p>-Be careful not to make bad choices you may regret in the future.</p>\n\n\n<p>-Densetsu is a rpg game for Windows, i was inspired by many great game like Earthbound, Final fantasy, Pokemon, Undertale or yet Heartbound.</p>\n<p>-Despite all my main inspiration remains UNDERTALE for the fights, and many books that I have read, for the story.</p>\n\n<p>-The creation of an independent game give the opportunity to modify much things at any moment. And you've understood, if I receive good idea from you the game will be modified in order to improve your gaming experience.</p>\n<ul><li>Moreover I think the best point of Densetsu will be to live differents adventures in several new game, thanks to random but also in the choice that you will make that will impact on the way that you will live this game.</li></ul>\n\n<p>-Densetsu is my first game, it was several years since I had the scenario of DENSETSU in mind and about a year ago I started without any knowledge in programming, game design, etc.</p>\n<p>-Everything about the project and made by me except music because I do not have this skill. For the latter I already have a group of people that interests me.</p>\n<p>-The game will be in English and french. English soon available, in about 2 weeks</p>", "metacritic": null, "released": "2019-02-17", "tba": false, "updated": "2019-02-18T03:27:08", "background_image": "https://media.rawg.io/media/screenshots/835/8355c6aea6d78e4b4ebb6c17deb11a6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frozeau"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}