{"id": 294605, "slug": "qubit-the-barbarian", "name": "Qubit the Barbarian", "name_original": "Qubit the Barbarian", "description": "<p>What is the goal of the game? Crush your enemies, see them driven before you, and observe the collapse of the quantum state!</p>\n<p>You are Qubit the Barbarian on a quest in the Quantum maze. On your quest you navigate through the mysterious changing labyrinth fighting enemies and looking for food to stay alive. By performing quantum measurements in different directions for the surrounding maze you clear new paths or build new walls based on the outcome of your measurement. Each tile is a qubit in the IBM QExperience quantum computer prepared in one of the three directions (X, Y, Z) thus having a predetermined or completely random outcome depending on the direction you make your measurement. Measure the qubits, clear your path and survive the maze as long as you can!</p>\n<p><strong>Credits:</strong><br/>Henri Sarasvirta – coding<br/>Petri Sarasvirta – coding<br/>Teemu Kivikangas – graphics<br/>Henri Lyyra – physics<br/>Leevi Leppäjärvi - physics<br/>Elie Abraham - music<br/>opengameart.org / artisticdude - sfx<br/><br/><strong>How to play:</strong></p>\n<p>Use arrows to move.<br/></p><p>Space to measure the state of the nearby qubits.<br/></p><p>Press 1, 2 or 3 to swap the measurement base. Hilighted forms will stay in their prepared quantum state when measured. Others produce random result.<br/></p><p>Collect the key and find the exit. Avoid demons. Kill slime to eat them. Food is either good, ok or really bad.</p><p>Run out of food and you will perish.</p><p>Good luck.</p>", "metacritic": null, "released": "2019-02-17", "tba": false, "updated": "2019-02-18T03:37:07", "background_image": "https://media.rawg.io/media/screenshots/a09/a095b140c52731a693787066dd7259a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exca"], "genres": ["Action"], "publishers": [], "esrb_rating": null}