{"id": 294740, "slug": "brief-history-of-perverted-dragon-warrior-rom-hack", "name": "Brief History of Perverted Dragon Warrior ROM Hacks", "name_original": "Brief History of Perverted Dragon Warrior ROM Hacks", "description": "<p><strong>Brief History of Perverted Dragon Warrior ROM Hacks </strong>is a very short look at four (4) perverted NES ROM hacks spanning 1997-2016 (the last of which is my own). My first encounter with Dragon Pervert (1999) around 2002 or 2003 has led me through an almost two decades long vortex of transgressive literature, art, and games. <br/><br/>I could write about these hacks forever, so don't read this as a complete or absolute text. I've tried to be extra short with my criticism and description. If the text were to be expanded, it'd be important to speak a bit more about the era and what these hacks' goals were in more clear language, and to better map the hacker family tree. I briefly address some of the language in the hacks, which I consider an open dialogue on several things: games culture, teen culture, hack culture, perversion in general and perversion as theme... I truly admire how many things turn into penises in Dragon Pervert, lol. <br/><br/>It's an RPG Maker MV game, and it's available for download as well as in-browser play. There's maybe ten minutes of \"content.\" Please let me know if you have any questions or comments or complaints. If you remember playing any of these hacks, PLEASE contact me : )<br/><br/>Further reading (as if you haven't heard enough from me):<br/>Video Games: A Gnostic Metaphor</p>", "metacritic": null, "released": "2019-02-16", "tba": false, "updated": "2019-02-18T03:56:34", "background_image": "https://media.rawg.io/media/screenshots/eef/eef5392b4e4eda640ae2b01647b6217e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["nilson"], "genres": ["RPG", "Educational"], "publishers": [], "esrb_rating": null}