{"id": 294895, "slug": "horror-run", "name": "Horror Run", "name_original": "Horror Run", "description": "<p>This is a (Two-Level) demonstration of a top down 8-bit puzzle solving game with horror elements in mind.</p>\n<p>[THIS IS ONLY A DEMO! WE WILL CONTINUE TO WORK ON THIS GAME FOR FURTHER ENJOYMENT! IT ALSO ONLY INCLUDES WINDOWS AND LINUX VERSIONS, BOTH 32 BIT AND 64 BIT.]</p>\n<p>(Controls)</p>\n<p> W\r\nASD - Controls for Moving forward and backward, or strafing left and right.</p>\n<p>[Mouse Control for smooth rotation. Move mouse left or right.]</p>\n<p>Return</p>\n<p>[GAMEPADS ARE ALSO ENABLED FOR THIS GAME, USE THE JOYSTICK OR PRESS A TO RETURN TO THE MENU!]</p>\n<p>In this game, you have 30 seconds to beat a puzzle in each room before it hits zero, if the countdown reaches to zero, then you will be teleported and or fallen back to the previous level, otherwise if you have no more rooms from falling, then the ghosts will absorb you out of existence and its game over...</p>\n<p>What makes this game unique is that with a simple collision detection to allow the player to reach to the next level, a whole endless amount of puzzles can be incorporated to this game to expand replays.</p>\n<p>You play as a lost hooded girl who upon finding out that some souls and spirits are trapped by twisted, evil ghosts you journey through treacherous rooms to reach towards the sacred Spirit Gems to ensure safety and freedom to the kidnapped souls. Failure to do so will result in you becoming the latest kidnapped soul.</p>\n<p>It works with the rule of beating a challenging puzzle within 30 seconds to allow the player to reach to the next room, so you use the [W,A,S,D] keys along with the mouse to move around as you attempt to solve each room, Gamepad support is also enabled for seamless control.</p>\n\n<p>Credits:</p>\n<p>Corruptinator: Programming, Debugging, Level Designer\r\nBlanchy: Sprites\r\nConor: SFX and Music</p>", "metacritic": null, "released": "2019-02-15", "tba": false, "updated": "2019-02-18T04:18:14", "background_image": "https://media.rawg.io/media/screenshots/d11/d115057e0d8e9409e471e04e3f534855.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sjsugamedev"], "genres": [], "publishers": [], "esrb_rating": null}