{"id": 295001, "slug": "batman-the-telltale-series", "name": "Batman: The Telltale Series", "name_original": "Batman: The Telltale Series", "description": "<p>Batman: The Enemy Within, 2017, is an episodic point-and-click graphic adventure video game, a sequel to 2016&#39;s Batman: The Telltale Series.</p>\n<p>The player controls the character, who, on the one hand, is the well-known billionaire, entrepreneur and philanthropist Bruce Wayne, and on the other hand, a crime fighter named Batman, hiding his real name from people.</p>\n<h3>The series</h3>\n<p>The Enemy Within is set in the same Batman continuity introduced in Batman: The Telltale Series - within Gotham, a city infested with crime and corruption. Both games are set in mid-to-late 2010s with technologies such as drones and smartphones. The places where The Enemy Within takes place are the same as in the previous game - Batcave, Wayne Enterprises and Gotham City Police Headquarters. The Enemy Within follows the events of the previous game, taking place between a couple of months to a year after these events.</p>\n<h3>Fresh interpretation of Batman in games, film, or comics</h3>\n<p>The creators of the series claim that the game offers the player to choose how to perceive certain situations - like Batman or Bruce Wayne. They promise a &quot;fresh interpretation of the universe set in current times, not tied to any existing iteration of Batman in games, film, or comics». To preserve this freshness, the creators of the game begin their story about Batman a few years after Bruce Wayne became Batman - they claim that it gives them the opportunity to be flexible in describing the character; As a result, the player, according to the creators of the game, also receives a certain freedom, playing for Batman in the branching narrative, which the game offers.</p>\n<p>Player selection influences what happens in the game next.<br />\nThe game includes situations where it is necessary to act quickly, as well as the investigation sequences. </p>\n<h3>Crowd play</h3>\n<p>In the games of the series there is also the so-called &quot;crowd play&quot;, it allows the game to be watched by an audience who can participate in the decision-making process.</p>", "metacritic": 79, "released": "2016-08-02", "tba": false, "updated": "2024-03-20T11:02:27", "background_image": "https://media.rawg.io/media/games/674/674b67b66f510f5b273f50ca09341ee2.jpg", "website": "", "rating": 3.74, "rating_top": 4, "added_by_status": {"yet": 142, "owned": 1338, "beaten": 457, "toplay": 65, "dropped": 60, "playing": 11}, "playtime": 9, "achievements_count": 0, "ratings_count": 398, "suggestions_count": 463, "game_series_count": 19, "reviews_count": 407, "platforms": ["Xbox 360", "PlayStation 3", "PC", "macOS", "Xbox One", "iOS", "Nintendo Switch", "PlayStation 4", "Android"], "developers": ["Telltale Games"], "genres": ["Adventure"], "publishers": ["Telltale Games"], "esrb_rating": "Mature"}