{"id": 295021, "slug": "orwell", "name": "Orwell: Keeping an Eye On You", "name_original": "Orwell: Keeping an Eye On You", "description": "<p>Orwell is a new governmental security program that has the power to survey the online presence of every person in The Nation. It can monitor all personal communications and access any computer. To preserve the privacy of citizens, human researchers examine the data Orwell finds and decide which pieces of information should be passed on to the security forces, and which should be rejected.<br />\nSelected from thousands of candidates, you are Orwell’s first human researcher. And when a terror attack rocks the Nation’s capital city of Bonton, Orwell, and you, are immediately put to the test. Starting with a single person of interest, you&#39;ll help the security forces build out and profile a network of potential culprits.<br />\nBut are these people really terrorists? What does the information you reveal to Orwell say about them? What if you find out things about them that not even their loved ones know? What is the real price of maintaining the security that the Nation is yearning for?Key Features<br />\nInvestigate the digital lives of citizens.<br />\nSearch web pages, scour through social media posts, dating site profiles, news articles and blogs to find those responsible for a series of terror attacks.<br />\nInvade the private lives of suspects.<br />\nListen in on chat communications, read personal emails, hack PCs, pull medical files, make connections. Find the information you need to know.<br />\nDetermine the relevance of information.<br />\nOnly the information you provide will be seen by the security forces and acted upon. You decide what gets seen and what does not, influencing how the suspects will be perceived.<br />\nSecure the freedom of the Nation.<br />\nFind the terrorists so the citizens of the Nation can sleep safe, knowing Orwell is watching over them.<br />\nMATURE CONTENT WARNING<br />\nPlease note, Orwell includes mature language at multiple points throughout the game as well as mature themes and is not suitable for younger players.</p>", "metacritic": 77, "released": "2016-10-27", "tba": false, "updated": "2024-04-09T01:38:47", "background_image": "https://media.rawg.io/media/games/2e1/2e187b31e5cee21c110bd16798d75fab.jpg", "website": "http://orwellgame.com/", "rating": 3.27, "rating_top": 4, "added_by_status": {"yet": 472, "owned": 4024, "beaten": 294, "toplay": 70, "dropped": 131, "playing": 17}, "playtime": 3, "achievements_count": 27, "ratings_count": 542, "suggestions_count": 260, "game_series_count": 1, "reviews_count": 548, "platforms": ["Android", "iOS", "PC", "macOS", "Linux"], "developers": ["Fellow Traveller", "Osmotic Studios"], "genres": ["Adventure", "Simulation", "Indie", "Puzzle"], "publishers": ["Fellow Traveller", "Surprise Attack"], "esrb_rating": "Teen"}