{"id": 295055, "slug": "light-of-gallery", "name": "Light Of Gallery", "name_original": "Light Of Gallery", "description": "<strong>Light Of Gallery is brand New Horror Game!</strong><br/>Escape From the Secret Galleries! Travel through the paintings at the request of EvillDoll.<br/>You have to interact Demon Pictures! Only then you can escape.<br/>But you have to be careful about your actions. Monsters can follow you and lead you to death.<br/>Sometimes you may be embarrassed by a wall with a monster.<br/>But do not worry! You have a safety zone to escape. <br/>Take a break from there!<br/>Is the statue blocking your way?<br/>Then, move the stone statue by erasing the demon pictures. <br/>You can find the way.<br/><br/>The EvilDoll in the art hall is very funny and can sometimes surprise you.<br/>But He will help you a lot. <br/>He is neither friend nor enemy, so be careful!<strong>Current game states and What to do later.</strong><br/><strong>SinglePlay</strong><br/><br/><br/>Now, You can play only Single Gamemode, But We will be Update Multiplay Gamemode.<br/>The main goal of the single-game mode is to escape the curse of the ArtGallery.<br/>There is one sub-topic we have prepared so far, and we are thinking about Two sub-topics.<br/>Only one sub-topic will be released at Early Access.<br/><br/>In Maze Maps, you must prioritize survival.<br/>The first sub-topics related to time.<br/>In time-themed maps, time is slower and faster. In that situation, you must avoid the monsters and achieve the purpose.<br/>In Arthall, we are going to lead the fear through stories and various interactions.<br/>You will be able to see the EvilDoll at the art hall.<br/><br/><strong>Multiplay Gamemode</strong><br/><br/>We are preparing a multi-game in hide-and-seek format.<br/>Maps and networking systems are already available.<br/>However, we are delaying the release of the multi-game mode for the balance update.<br/><br/>Once all the single modes are ready, we will release multi-game mode.<br/>Maybe after early access.DeveloperWe Are Korean University Students.<br/>This will be our first game, so there are a lot of deficiencies. <br/>But we will continue to update and get feedback. Until the day you enjoy the game.Our first game will be released on Steam at around 2019.03.05. Thanks.<br/><br/><br/>Our trailer is about to change soon. <br/>Much has changed and added to the mood and gameplay elements of the map, but it has not been updated yet. <br/>However, it is possible to update within a few days, so please understand until then. <br/>thank you.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:19", "background_image": "https://media.rawg.io/media/screenshots/2b5/2b5824524f7087bee5b528eee829d9f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamOFF"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["TeamOFF"], "esrb_rating": null}