{"id": 295056, "slug": "table-games-vr", "name": "Table Games VR", "name_original": "Table Games VR", "description": "Play dominoes and mancala against a virtual opponent, or klondike solitaire and marble solitaire, on your own.<br/><br/><strong>Dominoes</strong><br/><br/>The variant of dominoes in this game is block dominoes. Each player selects 7 dominoes. The rest are then put on the side. Each player takes turns to place down a domino, with a matching number, to either end of the line. If a player has no matching dominoes, then they must keep picking from the dominoes on the side, until they do. If there is none left on the side then the player skips their turn. The first player to place down all of their dominoes is the winner. The game ends in a block, if neither player can place down all their dominoes and the winner will be the one who laid down a domino last.<br/><br/><br/><strong>Mancala</strong><br/><br/>This is a generic name for a family of games that are similar but have different rules. This game features a specific set of rules that you may not be used to if you have played mancala before. The board consists of 6 holes in front of each player, with an additional collection hole to the right. The goal of the game, is to get more stones in your collection hole, then your opponent. Each player takes turns to pick one of the 6 holes in front of them, with 1 or more stones. One of these stones is dropped in each of the holes, moving counter clockwise, skipping the opponent's collection hole. If the last stone lands in the player's collection hole, then they have another turn. If the last stone lands in an empty hole in front of the player, it gets captured and placed in the collection hole, along with any stones in the opposite hole. When all 6 holes in front of either player are empty, the game ends and any remaining stones in front of the opposite player, are placed in their collection hole.<br/><br/><br/><strong>Klondike Solitaire</strong><br/><br/>This is the most popular version of solitaire. The goal of the game is to stack a full suit of cards on each foundation, in acsending order, starting from the Ace. The 4 foundations are located in the top right. The 7 card stacks along the bottom, are called the 'tableau'. Cards on these stacks can be of mixed suits, but have to be of alternating colors and in descending order, starting from the king. In the top left is the 'stock' stack, of which contains the remaining deck. 3 cards at a time are drawn from this stack onto the 'waste pile'. The top card is then allowed to be moved if possible. When all cards from the stock have been placed on the waste pile, then the stock can be rebuilt and the cards drawn out in the same way again.<br/><br/><br/><strong>Marble Solitaire</strong><br/><br/>The aim of marble solitaire is to capture all of the marbles, so that there is only 1 left on the board. To play the game, select a marble that has another marble in between it and an empty space. This marble will then jump over the other marble, capturing it and landing in the empty space. When a marble is captured, it will end up on the outer ring of the board. Marbles can only jump horizontally or vertically, except in the case of the triangle layout, where they can jump diagonally. There are 6 different board layouts to choose from. Remember to think ahead and to not leave any marbles unreachable.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:19", "background_image": "https://media.rawg.io/media/screenshots/21a/21a08c3ac0385e0b79fb6ecd382dee59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MobileFusion Apps"], "genres": ["Casual"], "publishers": ["MobileFusion Apps"], "esrb_rating": null}