{"id": 295090, "slug": "struggling", "name": "Struggling", "name_original": "Struggling", "description": "<p>Struggling is a physics-based coop game where each player controls one of the arms of a strange creature (kind word to describe the thing). By grabbing unto any surface, the monstrosity will need to painfully drag itself in different environments and overcome all kinds of obstacles while staying classy by wearing hats discovered along the way.<br />\nIn Struggling, your partner is more than just another character, he is part of yours. Ready yourselves to operate a makeshift boat, escape a wildfire, ride a motocross and explore the world while sharing the body of a “charming” abomination with your friend. You will be struggling!<br />\nUnorthodox and unique way to play and move the character with your friend by controlling one arm each in a physics based environment.<br />\nA handcrafted and wild coop adventure starring the weirdest protagonist you&#39;ll ever have the chance (or bad luck) to look at and play as.<br />\nGo on a pilgrimage to find the abomination gods and earn new powers to become a supreme/less mediocre being.<br />\nTons of exotic gameplay sequences using the coordination of both player controlled arms, ranging from wiring up explosives to operating a tank in a suburb.<br />\nLocal multiplayer games modes where you can face another abomination controlled by some of your friends in which you compete in various trials.<br />\nSolo mode where you control both arms for a radically different experience.</p>", "metacritic": 65, "released": "2020-08-27", "tba": false, "updated": "2023-05-02T07:28:45", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac662ae439dfa894da4abbc5e707b6b1.jpg", "website": "https://chasingratsgames.com/Struggling", "rating": 3.07, "rating_top": 1, "added_by_status": {"yet": 40, "owned": 734, "beaten": 8, "toplay": 7, "dropped": 9, "playing": 2}, "playtime": 2, "achievements_count": 79, "ratings_count": 15, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 15, "platforms": ["Nintendo Switch", "Xbox One", "PC", "PlayStation 4"], "developers": ["Chasing Rats Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Chasing Rats Games"], "esrb_rating": "Teen"}