{"id": 295126, "slug": "chromagun-vr", "name": "ChromaGun VR", "name_original": "ChromaGun VR", "description": "Welcome to ChromaTec’s test lab! You’re here to test our newest, state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to try and solve our meticulously designed test chambers. The basic principle is as easy as applying it is complex: Exit the chambers via the exit doors. But be weary of the WorkerDroids in charge of maintaining the chambers. They’re not exactly what you and I would call “human friendly”.<br/><br/>Use the ChromaGun to colorize walls and WorkerDroids to progress in the chambers. WorkerDroids are attracted to walls of the same color. Using that mechanic, try to reach the exit door of each chamber. Some doors are more complicated to use than others: They can only be opened using door triggers and only stay open as long as the triggers are occupied.<br/><br/>If all of this sounds like your brain can handle it, congratulations! You’re the perfect candidate for our test chambers!<br/><br/>That being said, welcome and good luck!<br/><br/><br/><br/>1 player<br/>150MB minimum save size<br/>DUALSHOCK®4<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/>Enhanced play with 1 PS VR Aim controller<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2019-02-19", "tba": false, "updated": "2019-08-02T16:18:59", "background_image": "https://media.rawg.io/media/screenshots/e4f/e4f55a70cd3ffb3ab290b1f0e1d5d2bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Pixel Maniacs"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}