{"id": 295237, "slug": "the-royal-affairs", "name": "The Royal Affairs", "name_original": "The Royal Affairs", "description": "The Royal Affairs is an online royal court life simulation and role-playing game set in the medieval times. You will start as an aspiring lord, and experience every aspect of the middle ages royal household – sensual court romances, cloak and dagger conspiracies, cut-throat politics, and glorious decisive battle! Reign and develop your realm, and eventually become the supreme king!<br/><br/><br/> GAME FEATURES <br/><br/>●Meet the beauties:<br/>You will encounter beauties with different personalities, they will fall in love with you. Who shall be the leading actress in your romances? The compassionate princess, the mystical court governess, or the fire-tempered duchess? Choose your queen as you like, and give birth to your next generation.<br/><br/>●Establish a dynasty:<br/>Raise your heirs and setup marriages to ensure that your lineage would run long and prosper. Find them best spouses when they become adults.<br/><br/>●Build your retinue:<br/>Exemplar knights, fearsome warriors, loyal servants, brilliant strategists. Thy biddings, my lord? Let them be your great assistance.<br/><br/>●Manage your kingdom:<br/>Oversee your council, handle affairs, issue edicts, and see your kingdom flourish. Manage your indispensable resources like money, food, and soldiers for the development of the kingdom, strengthen your power to resist any enemies who dare to violate.<br/><br/>●Forge alliance:<br/>Work hand-in-hand with the other lords to become the exalted King of Kings. Build an unbreakable alliance with friends to fight against other competitors in the world.<br/><br/>●Conquer more lands:<br/>You path to throne will not be unchallenged. Test your strategy and might in PVE and PVP features. For honor, for glory, and for the kingdom, you shall lead your army to crush the enemy and achieve your great dominance!<br/><br/><br/>Are you the one who would step forward to embrace and defend your love?<br/>Are you the one who would risk peril and bear arms for the people?<br/>Are you the one who would rein the power of the crown?<br/>My lord, your legend begins now...<br/><br/><br/>- Facebook: https://www.facebook.com/r2games.royal<br/>- Support: mobilesupport@r2games.com", "metacritic": null, "released": "2019-02-18", "tba": false, "updated": "2019-10-22T14:35:19", "background_image": "https://media.rawg.io/media/screenshots/2aa/2aabebcbb9133a0fe35a3efaf51fdd83_YfMtXct.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["REALITY SQUARED GAME CO"], "genres": ["RPG", "Simulation"], "publishers": ["REALITY SQUARED GAME CO"], "esrb_rating": null}