{"id": 295214, "slug": "slide-blox", "name": "Slide Blox", "name_original": "Slide Blox", "description": "Slide Blox is an awesome new hyper-casual game with amazing levels, and simplistic gameplay mechanics. It's seriously purely sliding blox and collecting coins.<br/><br/>Our entire team here is addicted to playing it and we think you will to!<br/><br/>---<br/><br/>Subscription Pricing and Terms<br/><br/>Our Slide Blox Premium is an auto-renewing subscription, it offers a 3 day trial, then renews on a $9.99/week basis.<br/><br/>With the Slide Blox Premium you unlock the ability to play on 3 totally new levels only available through this membership and all ads are removed from inside the game. <br/><br/><br/>Payment will be charged to iTunes Account at confirmation of purchase<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option. <br/><br/>Feel free to contact us with any questions or concerns here: contact@zennomedia.com<br/><br/>Privacy Policy: http://zennomedia.com/privacypolicy.html<br/>Terms of Use: http://zennomedia.com/termsofservice.html<br/>Subscription Policy: http://zennomedia.com/autorenewing-bloxpremium.html", "metacritic": null, "released": "2019-01-21", "tba": false, "updated": "2019-10-22T14:35:18", "background_image": "https://media.rawg.io/media/screenshots/49a/49a1ea3fec330c23c7e3744a658a0f6d_WAP0Eu0.jpg", "website": "http://zennomedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zenno Media"], "genres": ["Strategy", "Board Games"], "publishers": ["Zenno Media"], "esrb_rating": "Everyone 10+"}