{"id": 295210, "slug": "solitaire-34", "name": "Solitaire .", "name_original": "Solitaire .", "description": "Welcome to the Solitaire World! Classic Solitaire is a game that provides great fun for solitaire game lovers and new gamers who never play a solitaire game. Classic Solitaire is suitable for all ages and a best time killer, it also trains your brain and sharps your mind!<br/><br/>You can move or drag cards with a single tap to their destination. The cards should be ranked from King to Ace, only a King or a pile of cards with King at the top can be placed into the blank space of Tableau area and only Ace can be the first one placed into Foundation area. <br/>You can either play the easy Deal 1 games where most games are winnable, or if you feel up-to the challenge, try your luck with Deal 3 games and Vegas play modes.<br/><br/>The ultimate goal is to expose all cards and move them into Foundation. If you feel stuck, use Hint to help you get succeeded.<br/><br/>Features:<br/>1. Deal 1 card (Easyï¼‰or 3 cardsï¼  Hardï¼‰ as you like<br/>2. Unlimited UNDO supported<br/>3. Auto-collect cards on completion if you like<br/>4. Play any time &amp; any where <br/>5. 3 Game Scoring Modes: Standard, Vegas, and Vegas Cumulative<br/>6. Delicate animation and sound effects<br/>7. Statistics of gaming provided<br/>8. Hint helps you to win<br/>9. Leaderboards provided<br/><br/>Do you have the best score around? With Game Center enabled, you can check the Game Center leaderboards to see how your skills stack up against top players all around the world!<br/>The addicting game you?ve been playing on your computer for many years, now it goes along wherever you go. Download Classic Solitaire today, and get hooked on it!<br/><br/>Support<br/>Are you having problems? Visit https://sites.google.com/view/solitaire-classic game or contact us in game by going to Settings &gt; Help and Support.<br/><br/>Privacy Policy: <br/>https://sites.google.com/view/fast-fish-privacy-policy<br/><br/>Terms of Service:<br/>https://sites.google.com/view/fast-fish-terms-of-service<br/><br/>Parent’s Guide:<br/>https://sites.google.com/view/fast-fish-parents-guide", "metacritic": null, "released": "2019-02-18", "tba": false, "updated": "2019-10-22T14:35:17", "background_image": "https://media.rawg.io/media/screenshots/503/5035f1f7472bfc6f782ebdf777194ea2.jpg", "website": "https://sites.google.com/view/solitaire-classic", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Samsiah Emmi"], "genres": ["Board Games", "Card"], "publishers": ["Samsiah Emmi"], "esrb_rating": "Everyone 10+"}