{"id": 295232, "slug": "hyperspeed-race-with-friends", "name": "Hyperspeed - Race with Friends", "name_original": "Hyperspeed - Race with Friends", "description": "Fly into the future of social gaming. Hyperspeed is a fast paced racing game where you can play against your friends or anyone in the world. Now you can even talk to your opponents through live video while you play! <br/><br/>Put your Gameface on and join the race - Space awaits you.<br/><br/>Main features of Hyperspeed:<br/><br/>Real-Time Gameplay<br/>Go head-to-head against your friends or anyone around the globe in real-time. You can even talk to your opponents while you try to outrun them. Have a friendly conversation with people you just met or even try to effect your opponent’s concentration. <br/><br/>Power-Ups<br/>Power-ups add to the excitement of the game and come with great advantage. Power-ups can come to your aid – but you can also use them to attack your opponents’ Starship. <br/><br/>Gamefaces<br/>Express yourself with one of our stunning AR Gamefaces. From a collection of dozens  Gamefaces, you are sure to find one that matches your style. <br/><br/>Missions &amp; Ranks<br/>With our Missions you will also have the opportunity to compete against yourself. Complete the missions and rise through the ranks. Each rank even comes with an impressive title.  <br/><br/>Leaderboards<br/>You are not only going head to head against a single opponent, you are competing against the whole galaxy. With our separate leaderboards you can easily follow the progress of your friends as well as local racers from your city.<br/><br/>Chat<br/>Between games you can chat with your friends and even schedule your next race.<br/><br/><br/>Support email: support@teatime.games<br/><br/>Community guidelines: https://www.teatime.games/community-guidelines<br/><br/>Hyperspeed Facebook page: https://www.facebook.com/hyperspeedapp/<br/><br/>Please note that under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play Hyperspeed. The game also requires a network connection.", "metacritic": null, "released": "2019-02-20", "tba": false, "updated": "2019-10-22T14:35:19", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb902968c0d33c571ad99ba9ae165b0e_x1giarU.jpg", "website": "https://teatime.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Teatime Games"], "genres": ["Action", "Racing"], "publishers": ["Teatime Games"], "esrb_rating": "Teen"}