{"id": 295329, "slug": "halloween-spooky-monster-dressup-makeup-salon", "name": "Halloween Spooky Monster - Dressup Makeup salon", "name_original": "Halloween Spooky Monster - Dressup Makeup salon", "description": "Welcome to the Halloween party. Dear Girls are you waiting for the date of “31st October”? as Halloween Day for with lots of Amazing Halloween Characters including Witches, Vampires, Pumpkins, Monster Plants, Werewolves, Mummies, Zombies etc.<br/>Now you play the Halloween Spooky Makeup game every girl like spa in this game to play spa of monster girl and makeup the halloween girl to celebrating this day and play different games and pumpkins and ready to go the halloween cloths and dress select as you like, It's a fun way to celebrate the Halloween.Scary zombie, scarecrow, witch and vampire will put your children in a happy Halloween mood! Try different cross-breeds of the characters and be amazed to see the results.The game is optimized for phones.Assist her to select a unique suit of clothes, stocking, shoes, and the matched accessories including necklace, earrings, bracelet and headgear. At last, you can also choose a special prop such as various magic wands, etc in her hand. After all these process, she will appear in the biggest costume party, let's follow her and see how amazing it is!<br/><br/>This Monster girl like Spooky Makeup and Spooky Dressup up with Amazing Accessories and costumes to ready after cleaning all dirt in his face and Ready to look like a halloween Princess,Start with a soothing spa to make sure the girl’s hair and skin are flawless already to show up in the costume party. Next, help her choose a skin tone, hair style, eye color and put the makeup on.Hair highlighting brings out most attractive shades for your hair<br/><br/><br/>Features:-<br/><br/>- Spa &amp; Salon<br/>- Spooky Make up<br/>- Spooky Dress up<br/>-Various pretty masks designed by yourself to choose<br/>- Several stockings to choose<br/>- Plentiful shoes of different styles to choose<br/>- Many interesting props to choose, such as magic wands and so on<br/>- Different Dress Selection<br/>- Different Hair Selection<br/>- Select Lots of Makeup Accessories like a Lipsticks,Blush,eyeLance<br/>lens,colourful Shadows,Stylist EyeBrow,and EyeLash<br/>- Choose Diffearnt necklaces shoes and earrings<br/>Select this all Halloween Party Items for Halloween Monster Girl Salon<br/>Many hair styles and hair colors to choose <br/>- Try on dozens of different eye colors, eye-shadows, mascaras, lipsticks, and more<br/>- A lot of special clothes and dresses to choose<br/>- A huge variety of decoration items, including earrings, necklaces, bracelets, and headgears to choose<br/>Share the unique girl via Facebook or E-mail with just one click <br/>· Continued improvements of this game, please feel free to send us your feedbacks and suggestions<br/>Need You Know:<br/><br/>Contact Us: We love to hear genuine suggestions and comments, kindly rate your playing feel in words here on the store and for more information on updates, reach us freebabygames5@gmail.com and follow us on our social profiles.<br/><br/>-Facebook:- https://www.facebook.com/search/top/?q=Armored%20Techno%20Solution<br/>-Google+ :- https://plus.google.com/u/0/106200293371975045779<br/>\u2028-Twitter :- https://twitter.com/softtech_info", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-10-22T14:35:24", "background_image": "https://media.rawg.io/media/screenshots/e36/e3657fd6d1a2992b4a183b958fcae13f.jpg", "website": "https://play.google.com/store/apps/details?id=com.freebabiesgames.helloweenmakeover", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ajay Pandya"], "genres": ["Arcade", "Casual"], "publishers": ["Ajay Pandya"], "esrb_rating": null}