{"id": 295308, "slug": "zombie-tiles-smasher-dont-tap-monster-tiles", "name": "Zombie Tiles Smasher: Don't tap monster tiles", "name_original": "Zombie Tiles Smasher: Don't tap monster tiles", "description": "Zombie Smasher is the #1 addicting and entertaining game available on Google Play.<br/><br/>Get ready to defend your home as a mob of zombies is about to invade your town! Those undead creatures are back, and it's up to you to keep them brainless. Use your finger to tap on the zombies to smash and eliminate them before they break down your door.<br/><br/>The game is full of the stupid and little zombies with a music tiles tap the zombies and let the fun began.<br/>Smash Zombies with your finger in this great game!<br/><br/>Zombies Smasher is more social now - you can smash your friends' Zombies!!!<br/><br/>Highly entertaining for kids, boys and girls. Special virtual goods that make the game easier for young players can be acquired! It's so addicting! Experience this killer Zombies invasion!<br/><br/>Play  Zombie Smasher for FREE!!! Smash all Angry Zombies and save all Citizens. Easy, fun, addictive and FREE.<br/><br/>Now with 3 game modes!!! Classic, Quick, Arcade and Time!!!<br/><br/>Tap Tap Tap the zombie tiles as fast as you can and enjoy the smash sound of the zombies.try to make as fast as possible. play with your friends.<br/><br/> Features:<br/><br/>- Smash Zombies!<br/>- Don't smash Window Tiles!<br/>- 3 games modes<br/>- Play this simple and addictive game for FREE", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-10-22T14:35:23", "background_image": "https://media.rawg.io/media/screenshots/07b/07b52544b4346747195d08d6436268fd.jpg", "website": "http://www.armoredtechno.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ajay Pandya"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Ajay Pandya"], "esrb_rating": null}