{"id": 295442, "slug": "belovesight-game-jam-title", "name": "Belovesight (Game Jam Title)", "name_original": "Belovesight (Game Jam Title)", "description": "<p><strong>Belovesight (Game Jam Title)</strong></p>\n\n<p><strong>Jump and conquer the darkness of loneliness in my new platformer game Belovesight! You must find your sweetheart, and deliver your love to her! Or will you succumb to the fear of rejection?</strong></p>\n<p>Developer's note:</p>\n<p>This took me almost the span of the game jam to make. I tried multiple combos of colours for the characters to get a unique combination. My biggest struggle was getting the main mechanic, the 'light circle' (the space in which you can see), to work. I tried multiple techniques, and in the end I was about to give up, until I realised I could make it as part of the UI. I tried it, and it worked! There is no sound as I am not much of a sound engineer and/or musician, and do not have the software to do so (besides GarageBand on my phone, which I haven't used for this project).</p>\n<p> Also, the levels may be a bit tricky, as I myself found the levels frustrating. It is likely that you will die on your first play, buy you must take a look around the map, and take leaps of faith to discover a way up. Oh yeah, this is a platformer that goes <strong><em>UP</em></strong>. Have fun and I hope to hear feedback! </p><p>This game was made for Brackeys Game Jam, and the theme was 'Love is Blind'.</p>\n<p>- Caleb (LebbyFoxx)</p>", "metacritic": null, "released": "2019-02-21", "tba": false, "updated": "2019-02-22T03:35:11", "background_image": "https://media.rawg.io/media/screenshots/515/5153222d3278fa3d16c7d813c3442072.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LebbyFoxx"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}