{"id": 295535, "slug": "false-rebirth", "name": "False Rebirth", "name_original": "False Rebirth", "description": "Synopsis:\r\n<p>A <strong>psychological, story-focused</strong> game about the <strong>last remaining human</strong>, and his search for meaning in a post-apocalyptic world.</p>\n\r\nFeatures:\r\n<ul><li><strong>Intricate graphics.</strong></li><li>Start <strong>play</strong>ing from the very <strong>first second!</strong> (No boring intro-cutscene.)</li><li>A <strong>simple, emotional</strong> story, with philosophical elements.</li><li><strong>Choices</strong> that either lead to death, or rebirth, or both.</li><li><strong>Multiple Endings:</strong> 1 true ending, &amp; 4 false endings. (Every 'False' ending, adds another layer to the whole story.)</li><li><strong>'No Save'</strong> feature. (You die, you start over from the beginning.)</li><li><strong>'Graphical Randomization'</strong> (so that each time you play &amp; start over, certain elements appear slightly different from your previous experience).</li><li><strong>Awesometacular Music!</strong></li></ul>\n\r\nDetails:\r\n<ul><li><strong>Title:</strong> False Rebirth</li><li><strong>Subtitle:</strong> \"Am I... suppose to even be alive?\"</li><li><strong>Playtime:</strong> 45 min - 2 hrs</li><li><strong>Genre:</strong> Story-focused, Psychological.</li><li><strong>Game Engine:</strong> RPG Maker MV</li><li><strong>Play Mechanic:</strong> You walk (&amp; run) from one place to the next, interact, have dialogue, make choices, and progress through the story. (There is no battle system.)</li></ul>\n\r\nSystem Requirement:\r\n<ul><li><strong>OS:</strong> Windows 7 or higher</li><li><strong>RAM:</strong> 4 GB</li><li><strong>Graphics:</strong> A decent dedicated GPU (I'm talking like GTX 1050 level decent.)</li><li><strong>Directx:</strong> Version 11</li><li><strong>Processor:</strong> 32-bit, intel Core i5, quad core, (at-least 3.0 GHz).</li><li><strong>Storage:</strong> Around 300 MB available space</li><li><strong>Controls Support:</strong> You need either a Keyboard, or Mouse, or Gamepad. (Everything works! Thankfully.)</li></ul>\n\r\nControls: (Keyboard)\r\n<ul><li>Use Directional Keys for Movement (Can be changed to WASD from options).</li><li>Hold Shift to Dash while moving.</li><li>Press Z or Enter for Next/Interact. (Hold to fast forward cutscenes)</li><li>Press X to Open Menu, and Cancel/Back</li><li>Press Q or W to Open Message Log.</li></ul>\r\nControls: (Gamepad)\r\n<p>(If the controls are different for you, just configure them from the general options tab.)</p>\n<ul><li>Left analog stick for movement</li><li>Hold B to Dash</li><li>Press A for Next/Interact (Hold to fast forward cutscenes.)</li><li>Press X to Cancel/Back</li><li>Press Y to open Message log.</li><li>Press Start to Open Menu.<br/>(You may need to press 'A/B/X/Y' when the game starts, for the game to recognize the controller.)</li></ul>\r\nControls: (Mouse)\r\n<ul><li>Left click to move and interact. (Hold click to dash, and also to skip dialogue.)</li><li>Right Click to Open Menu, and Cancel/Back.</li><li>Use scroll wheel to Open Message Log.</li></ul>\n\r\nKnown Bugs\r\n<p>(I want to mention them here so you play the game fully prepared to encounter them. The reason these haven't been fixed is because... I couldn't fix them. They're mostly small bugs, that can easily be overlooked. )</p>\n<ul><li>Camera Zoom Stutter: (At a certain scene where the camera zooms in &amp; out, there is a slight stutter.)</li><li>The dust cloud (while running) doesn't appear when using a controller or mouse. (It only appears when you're using the Keyboard.)</li><li>In case of using a controller, if the character doesn't move at certain instances, just hold down the dash button.</li><li>Closing off the Menu takes time (10-30 seconds) on large maps.</li><li>In False End #4, there is a small cutscene where there is a massive fps drop for several seconds. &lt;--- So I edited the cutscene to look as if it's occurring in slow motion. :P</li><li>I admit, the game does suffer from optimization issue. And so it requires a good GPU &amp; CPU to properly run it smoothly. (And it may still lag at certain instances...)</li><li>I have gotten reports of a crash (once, per player) which happens only once, at random, and isn't there again when you replay through that part. (haha... I shouldn't have stuffed my game with a lot of effects...)</li></ul>\n\r\nMy Own Review of this game: (Written a day before publishing.)\r\n<p>(It's a VERY biased review. I just beta-tested my game, playing it dozens of time over and over again...)<br/>It's trash. It's high quality, genuine GARBAGE! I can't play this pile of poop anymore! (T_T)<br/>Sadly, I have to play it a few more times, make a recording of it all, and then use it to make a trailer...<br/>It's torture, I tell you.<br/>The dialogue is mediocre. Sure it's clear, and properly tells the story. But it's just... if you ask me to read all the dialogue in a playthrough... I'd be VERY embarrassed to do so. It doesn't sound like something anyone would actually say.<br/>The graphics are decent for an RPG Maker game, and that's been so much of my priority, that the game suffers on the performance side. (And hence unfortunately, a huge chunk of people may not be able to play this on their potatoes... even if the potatoes are on steroids.)<br/>The sound of the game is AWESOME! Because... I didn't make any of the music. I just... put them in there... and had them played in the... background, yeah...<br/>Score: -5/10<br/>(It's so bad, that you need to tell your friends about it!)<br/>\"Hey if it's so bad, why are you publishing it?\" ... because, it's taking space on my computer, so I thought this was the right place to archive it. (I'm a very moral human being; I do not permanently kill data.)</p>\n\r\nContext of Game's Development: (Written on 19/Feb/2019)\r\n<p>So, how did I come to make this game? I published my last game at around 16th November-2018 (title: False Awakening Ep 2) and at the time, Indie Game Making Contest (IGMC) was going on. I had 15 days to make a game for it, and I figured I should participate and cook up a small videogame.<br/>I literally spent the first week trying to write a short story for the game. And... I failed, miserably. I had an idea on what the story was going to be, but couldn't actualize the series of events in a way that the story would be engaging. And so in due time, I realized that I couldn't write 'short' stories with the skills I had, and that I needed to first learn the 'how' of it.<br/>I realized that and didn't act on it immediately, because certain opportunities came my way (as a result of publishing my last game) that took up few of my next days.<br/>With that, since the contest was almost over and I had nothing prepared on my plate, I figured I should just skip it. Starting December 2018, I went through some lectures and videos on writing short stories, and finished writing the script till the 4th (of December.) In just a week, I completed the first half of the game.<br/>Since the game was super short, (10 minutes of total playthrough) I thought I shouldn't put in any option to save. At the same time, since the game had scenarios where the player can hit gameover, and would have to start over from the beginning, there was an issue that the game can become too repetitive. (For those who get a gameover a few times.)<br/>So I figured I could counter that by randomizing certain features for the first half, so that the game would feel less repetitive. With that, I ended up randomizing a few more things than I planned, which forced me to add more to the script. (Because everything that was happening, needed to make sense in the scope of the story.)<br/>20 days after finishing my initial script, the first half of my game was fully completed. After that, I got busy with some family stuff, that took up my next 23-25 days. (I couldn't concentrate on my game during this period.)<br/>Come 20th January 2019, and I was able to start working on my game again. Going through the script after around a month, I realized that the events in the story weren't dramatic enough. So as I worked towards making each cutscene in the game, I added 'dramatic elements' to the story at every opportunity I got, so that there would be more weight to it.<br/>In my initial script, I had thought up a choice-system, but when I added it in the game, it felt too bland. Which prompted me to make alternate endings for the game. (Called 'false endings'.) So, I had to go back to the writing board, and add more layers to the story, and write more dialogue.<br/>When I was done doing that, I had to somehow foreshadow the second half of the game, in the first half. Which means that I had to add dialogue to the first half and... then the overall story became much more powerful. (And the game became two...err- five times longer. XD )<br/>It's been around 30 days since 20th January-2019, and I'm finally done with the game! (HUZZAHHHH!!!)<br/>That brings the total development time to around 1 month 20 days. (Excluding the 7 days I 'tried' writing a short story, but couldn't because I didn't know how to.)<br/>Well, that's all, I suppose. Thank you for reading! (Unless you didn't... which is completely okay because I'm mentally numb after beta-testing my game a dozen times. And instead of being unproductive, I happen to have ended up typing all this...)</p>\n\r\nCredits:\r\n<p>The complete credits (with links) are mentioned in a document right beside the .exe file, and inside the game. (I'm skipping from mentioning them here... because the list is a bit long.)</p>\r\nWant to make a let's play video?:\r\n<p>~THAT would be SO awesome! Go right ahead!</p>\r\nSpecial Note:\r\n<p>~Want to play more games like this one? Well, you can head over to my patreon page and contribute to their development!<br/>https://www.patreon.com/SigmaSuccour</p>\r\nBe sure to comment!\r\n<p>As you finish playing the game, please do be sure to comment and let me know! Even just a message saying, \"Ey! Playd yo gaym bruv.\" would mean A LOT!<br/>And should you choose to leave a review, then that's even better!</p>\n<br/>", "metacritic": null, "released": "2019-02-21", "tba": false, "updated": "2019-08-28T23:17:52", "background_image": "https://media.rawg.io/media/screenshots/af5/af57ae35804396288a71be4168cad623.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Salik Hussain"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}