{"id": 295583, "slug": "harryrabby2-rounding-23-decimals-free-version", "name": "HarryRabby2 Rounding 2/3 decimals FREE version", "name_original": "HarryRabby2 Rounding 2/3 decimals FREE version", "description": "<p>Looking to test your kid’s basic math skills? We have what you need here! This special series of  HarryRabby 2 includes products for learning different preschool/elementary/intermediate math topics.</p>\n<p>The Math Learning editions are action packed math games with levels of fun and excitement. Having accessibility in mind, special display and control features are available for low vision gamers. Simple but challenging gameplay, with mobile touch screen support, the games can be played on mobile devices as well as on desktop computers.</p>\n<p>The math questions are specifically made for toddlers, preschoolers, elementary and intermediate learners. Player clicks or touches on the correct answer to a math question in order to allow HarryRabby to land safely and proceed to the next level. The math questions are generated randomly. The full versions have 5 difficulty levels: value within 10, value within 20, value within 30, value within 40, and value within 50. The Free versions have just one difficulty level for you to try out.</p>\n<p>This game provides questions on rounding 2/3 decimals.</p>\n<p>Many game elements are adjustable, such as object moving speed and color mode (high contrast, brightness, grayscale, B&amp;W, inversed display…etc).</p>", "metacritic": null, "released": "2019-02-21", "tba": false, "updated": "2019-02-22T03:54:12", "background_image": "https://media.rawg.io/media/screenshots/562/56261f126486bf8e1feaf75b7155b39d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fingertainment"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}