{"id": 295556, "slug": "last-days-on-vr-survival-vr-game-of-zombie-hunter", "name": "Last Days on VR Survival: VR Game of Zombie Hunter", "name_original": "Last Days on VR Survival: VR Game of Zombie Hunter", "description": "<p>We <strong>Kingdom Studios - Free Action Games </strong>are very excited to offer you our new game of VR shooting with the tag of Last Day on VR Survival: Zombie Shooter Games 2K19. Do you like to play VR target zombies survival games, The Zombie Shooter Games, first-person shooters of VR shooting games and other best sniper games with virtual reality scenario? It’s not simple first-person shooters or apocalypse survival games however it has a proper story how zombie tsunami entered into your futuristic city. If you have an addiction of playing hunt for the zombie, vicious zombies with Last Man Survival, zombies 3d games, best shooter offline games, and other Offline Zombie Shooting games then you must download our Last Day on VR Survival: Zombie Shooter Games 2K19 because it’s also ultimate zombie survival game. It has three modes of ultimate shooting like zombies hunt, world war shooting and animal shooting with multiple missions at Commando Survival Battleground as well as VR target zombies game. <br/>The entire theater is covered with a zombie apocalypse, this deathmatch is about to start just like zombie shoot games! Survival in this last battleground &amp; fend off all the zombies! Save the world, defend the camp of the shooting games 2019, beat as many zombies as possible and become the zombie killer in such VR zombie target shooter games! It’s the last chance for survival in Zombie Games. It’s zombie fighting game, choose the best gun to fight against the dead that is walking towards you. Become undead shooter in VR zombie park kill. It’s not just about wonderful zombie shooting games, survival shooter zombie or Zombies Survival VR, however it has also incredible missions of world war real survival battleground &amp; VR gun games. Hostile nation unknown army squad is spreading zombie virus and they killed all of your City Sniper Gun Shooters. Now it’s the last man survival for you in this best zombie game &amp; you are the last hope of ww2 survival game &amp; Shooting Games FPS which is Last Day on VR Survival: Zombie Shooter Games 2K19.</p>\n<p><strong>Features of Last Day on VR Survival: Zombie Shooter Games 2K19 </strong><br/>Realistic shooting effects of Free FPS offline game.<br/>15 survival shooting missions of ultimate zombie VR shooter.</p>", "metacritic": null, "released": "2019-02-21", "tba": false, "updated": "2019-02-22T03:50:45", "background_image": "https://media.rawg.io/media/screenshots/4aa/4aa1c2811bbf1ccaff8b282f6b0ca370.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gameseller76"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}