{"id": 295552, "slug": "crazy-bunny-dash-run-bunny-rabbit-game", "name": "Crazy Bunny Dash Run - Bunny Rabbit Game", "name_original": "Crazy Bunny Dash Run - Bunny Rabbit Game", "description": "<p>If you like bunnies that not only hop over hurdles but also fight monsters, then Crazy Bunny Dash Run - Bunny Rabbit Game is just for you! Do you like to play bunny rabbit games, cute bunnies games, bunny adventure forest run, and FREE endless running games? Are you looking for a chance to play free best running games of jungle bunny speedster run, Looney Bunny Toons Real Jungle Dash and many other bunny rabbit games for kids? If yes, then you must download our Crazy Bunny Dash Run - Bunny Rabbit Game which is more engaging than rabbit runner games &amp; Subway Bunny Dash Run. You’ll enjoy a lot because you’ll also have options of character selection like a crazy bunny, bandicoot &amp; a girl toon character with upgraded powers of jumping and speedster run. You might have played many run bunny home, rabbit games, jumping bunny games, Bunny Rabbit Games 2k19 and other Bunny Run 3D Rabbit Racing Girls Game but this time we are going to publish two scenarios in one running game like simulation as well as action subway Rabbit Run. There will be fighting monsters on the way like cute bunny games &amp; you’ll have to get escape from Bunny Rush World with theme of Bunny Rabbit Game Girls Game.<br/>When you start this fun rabbit game, firstly crazy bunny will be default character and there will be space coins and gems along the way that the player will pick up to unlock the new adventure characters and you can also upgrade those characters of Hunted Jungle Runner 2018 by using coins &amp; gems like our rabbit real jump games. Bring your light speed instincts to our upcoming Crazy Bunny Run Real Adventure Game to hit the oncoming foes of rabbit games 3D, hop over risky hurdles like top run rabbit games and vibrant environments for Bunny Dash runner. Crazy Bunny &amp; friends will go on an adventure of cuddly bunny games that will keep you hooked for hours just like Bunny Rabbit Games 2019 &amp; Bunny Rabbit Run 3D games! So get ready for Looney Rabbit Bunnies in the world of jungle adventure. Childs game lovers always search for toon runner with the scenario of cute Bunny Rabbit Looney Animals games, so after having an analysis of stats about Bunny Rabbit Run 3D &amp; Subway Bunny Dash Run for free, we decided to develop a new Looney Bunny Toons Real Challenge Dash. It’s not only for boys, however, but it also has the cutest girl and boy Bunny Rabbits &amp; it’s the best FREE endless running game for Boys and Girls. Call it Subway Bunny Rabbit game of jungle.<br/>While playing this Crazy Bunny Real Endless Runner, on the way, there are many bad animals waiting for the bunny, so you have to help him beat those animals like The Bunny Run games. Take Crazy Bunny to thrilling environments full of enemies having bugs fans bunny and obstacles in our upcoming adventurer bug bunny games. When you purchase Bandicoots in Jungle Runner 2019, then throw fireballs like rabbit Bunny Hero. Collect as many coins &amp; gems as you can for crazy adventure in looney bunny games. It has realistic toon animations just like Looney Bunny Toons jungle real Dash 3D runner game. Come back for daily challenges of Tunes Dash 3D runner games and earn exclusive rewards with features of giant rabbit games! Do you want to make the record in rabbits chase games &amp; bunny rabbit games then use a variety of awesome powerups in Amazing Bunny Rabbit Animals World to reach the high score of jumping rabbits games? Jump, dash and slide past obstacles in such run bunny jump games 3d. Be sure to check out the Crazy Bunny Dash Run - Bunny Rabbit Game store where you can spend the coins that you collected in cute bunny games 2019! The crazy bunny will have a big gun with a round clip that will shoot lasers in our crazy rabbit rush games.<br/><br/><strong>Features of Crazy Bunny Dash Run - Bunny Rabbit Game </strong><br/><br/>Variety of awesome powerups in Subway Rabbit Rush.<br/>HD graphics of Amazing Adventure Bunny World.<br/>Unlock cool new Bunny Rabbits.<br/>Jump and slide past obstacles as a crazy bunny.<br/>Realistic animations of a fast bunny running game.</p>", "metacritic": null, "released": "2019-02-21", "tba": false, "updated": "2019-02-22T03:50:10", "background_image": "https://media.rawg.io/media/screenshots/425/42527b83de2b09a278e8a00ee45d0de5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gameseller76"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}