{"id": 295786, "slug": "super-tree-cop-2", "name": "Super Tree Cop 2", "name_original": "Super Tree Cop 2", "description": "<p>Now here's a venerable title that created quite a stir back in the day.....2008 that is.</p>\n<p>Created by a myself and a friend, Super Tree Cop 2 was the first game we ever completed and published (at the ripe old age of 12, a <em>smashing</em> start to a career). Back then, the primary Game Maker sharing site was YoYo Games' very own sandbox website, now defunct. <br/></p>\n<p>You play as a heroic tree who is a cop and also super, as he run jumps and shoots his way through 20+ action packed levels.</p>\n<p>(Loosely) based on the flash cartoon character by cyberturnip, featuring sound and graphics from Thexder, and pretty much everywhere else.<br/></p>\n<p>Experience this crushingly difficult cult-classic that created myths and legends...now available for the first time on Mac OSX systems.<br/></p>\r\n\"The game drew more attention than originally expected, no doubt due to its shining example of perfection of the craft - the balance of crisp mechanics, believable physics, riveting soundtrack, and masterful level design. It took some time for sure, but I remember that by 2011 the game had accumulated several thousand downloads. Most of all, however; the piece gained notoriety in the community in response to its high calibre of difficulty.<br/>\n<br/>You see, Super Tree Cop II requires the player to not only have a masterful combination of sufficient arcade-style platforming and lightning-quick reflexes, but to also think outside of the box. Or rather, the playing field itself. I can remember several instances where I had to willingly navigate the character outside of the established boundaries in order to proceed...it was a head-scratching yet revolutionary moment; a new axiom of gaming was in the works.<br/>\n<br/>It's evident that Super Tree Cop II is not only a faithful homage to the flash video by cyberturnip, but a virtual love letter to several video game inspirations of the time. Admittedly, the piece is not composed entirely of proprietary material - all of the music was borrowed (Jay had not yet picked up an instrument) and several of the backgrounds were as well. But these facts, too, show that he knew where he was coming from and where he wanted to go with this career.<br/>\n<br/>When I heard from Jay that plans were in the works to bring back Super Tree Cop II from the ashes by publishing it on the new website, my eyes lit up in the back of my head. All the memories of the paradigm-shift I had experienced when I played the game came flooding back to me. As a thank-you to all the dedicated fans who kept STCII in the back of their minds (and hard drives) during the years the game was offline, they've kept the game in it's original state; no remasters, nothing. It's a virtual time capsule. So fire it up, get your A-Game face on (again, this game is NOT a cakewalk) and prepare to experience video games on another plane entire\".<br/>                                     <br/>                                                                                                 George S. Michael<br/>                                                                                                 Editor-in-chief<br/>                                                                                                 Games Magazine<br/>", "metacritic": null, "released": "2019-02-20", "tba": false, "updated": "2019-08-28T23:17:51", "background_image": "https://media.rawg.io/media/screenshots/736/7361f9a51896e725f1034db1dd4cc009.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["LegitVidya"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}