{"id": 2959, "slug": "star-knight", "name": "Star Knight", "name_original": "Star Knight", "description": "Easy games are no fun! If you are tired of meaningless automatic actions, Star Knight is the perfect game for you!<br/> <br/> A fantastic balance between gorgeous graphics, adventure, and action, challenge yourself to the high level action platform game, Star Knight!<br/> <br/> The peaceful planet Gaon is under attack by hordes of monsters, and Dark Dragon Nidhogg took away the sun.<br/> Can the knight ‘Naro’ overcome the challenges ahead and bring back peace?<br/> <br/> * Complete the beautiful yet different stages!<br/> <br/> - Try again and again to reach the objective of stages full of various terrain and unique traps.<br/> - Defeat increasingly powerful and diverse enemies. You will be rewarded with satisfying hits during your attack!<br/> - Overcome bosses with special and powerful patterns and claim your reward!<br/> <br/> * Collect and grow your character!<br/> <br/> - Purchase powerful weapons with the coins you’ve collected! Better swords can contain more skills.<br/> - Collect runes to claim more powerful and impressive skills.<br/> - Find hidden items and jewel chests. Your character will become more powerful!<br/> <br/> * Participate in the competitive arena mode!<br/> <br/> - Fight as you wish in the simple stages of arena mode, and claim coins!<br/> - Survive the endless wave of enemies as long as you can and compete with other players!", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2019-10-22T13:59:59", "background_image": "https://media.rawg.io/media/screenshots/ec0/ec04208895ac11444b38a1ab6206e218.jpg", "website": "https://www.facebook.com/lnrgame?ref=aymt_homepage_panel", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["JungSang You", "LeftRight", "Left Right Co"], "genres": ["Action", "Adventure"], "publishers": ["JungSang You", "Left Right Co"], "esrb_rating": null}