{"id": 296158, "slug": "go-slice", "name": "Go Slice", "name_original": "Go Slice", "description": "Cut the paper with precision and reach the flag! It’s time to use your brain and find the best strategy to slice your way through. <br/><br/>The rules are simple and there are multiple solutions. Can you come up with the best tactics and achieve all levels with 3 stars?<br/><br/>Features<br/>* Simple, smart and fun gameplay<br/>* Cute, quirky art style<br/>* Many puzzles to solve!<br/>* Relaxing music<br/><br/>---<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>VIP MEMBERSHIP offers a weekly subscription, you will have a 3-days FREE trial period, after this period you will be charged $7.99. After buying this subscription you will unlock all VIP Characters, get 100 coins every day, 2 hints every day, and removes forced ads. This is an Auto-renewable subscription. The payment is charged to your account after confirmation. The subscription is renewed unless you turn it off 24 hours before the period ends. Your account will be charged for renewal as well. <br/><br/>End of trial and subscription renewal:<br/>• This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>• Payment will also be charged to iTunes account at confirmation of purchase.<br/>• Subscription automatically renews unless auto-renew is turned off at least 24 hours prior to the end of the current period.<br/>• The account will be charged for renewal within 24 hours prior to the end of the current period and identify the cost of the renewal.<br/>• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>Any unused portion of the free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription:<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes account. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option.<br/><br/>If you have any questions or comments, feel free to contact us at support@lucky-kat.com<br/><br/>Privacy Policy:  https://www.lucky-kat.com/games-privacy-notice/<br/>Terms of use:   https://www.lucky-kat.com/terms-of-use/", "metacritic": null, "released": "2019-02-20", "tba": false, "updated": "2019-10-28T03:34:31", "background_image": "https://media.rawg.io/media/screenshots/a7d/a7d577cc1486e762b191e1450cb991d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Lucky Kat Studios"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Lucky Kat Studios"], "esrb_rating": "Everyone"}