{"id": 296126, "slug": "balance-roll", "name": "Balance Roll", "name_original": "Balance Roll", "description": "Hello everyone, after a period of closed research and development, I brought this \"Balance Roll\" to everyone. This is a very sophisticated indie game, and every level has been carefully designed by me. The operation of game is simple, control your small ball, collect all the gold coins, and arrive to the end to pass.Various traps and obstaclesOf course, the road to success is always tortuous. There are various obstacles and traps on the way that stop you from moving forward: the floor moves, rotates, dangerous conveyor belts, unpredictable enemies, frictionless metal plates, Iron sticks, folding portals, mirrors, big fans that can blow you into the sky, and so on.Three different game modesThere are three different game modes for this game:<br/><br/>Classic mode: This mode is the normal mode of the game, you can create an archive record, through various tests, try your best to take risks;<br/>Challenge mode: In this mode, you only have one life. You can add one after passing one level, and break through yourself in a limited life to see how many levels can be challenged.<br/>Custom mode: In this mode, you can freely choose any level to practice, but the level must be unlocked after the other two modes are cleared;Four distinct theme stylesOn the basis of the unified gameplay, there are four distinct levels of different styles, whether it is the refreshing sea, the incomparable caves, the towering sky, the horrible castle, will give you a different Feeling. Even in the castle, you will suddenly enter another, more horrible world...OthersLet's talk about the difficulty. The difficulty in this game follows from easy to difficult. The latter level can be quite challenging. Not everyone can easily get through (ps: including myself).<br/><br/>Finally, I wish everyone a happy game! Happy life!", "metacritic": null, "released": "2019-03-15", "tba": false, "updated": "2019-08-28T21:48:12", "background_image": "https://media.rawg.io/media/screenshots/d12/d1290c1b19aed2e1070812a5e5b2b31a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blue Ice"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Blue Ice"], "esrb_rating": null}