{"id": 296171, "slug": "beauty-princess-wedding-salon", "name": "Beauty Princess: Wedding Salon", "name_original": "Beauty Princess: Wedding Salon", "description": "There's no secret that every girl has the dream of living a wonderful wedding day, since at early ages, little girls love to be a princess for her handsome prince, to be a beautiful bride! In this wedding game, the sweet little girls can enjoy some of the fun of marry me and perfect wedding games, what a wedding really looks like and how the girls can prepare themselves for this sort of beautiful event!<br/><br/>There is a long way to go to the altar and your journey starts right in the relaxing spa, there's a big day ahead you must relax before you go to the beauty salon and fashion makeup studios. At this luxurious spa, you'll get the perfect treatment to eliminate any kind of wrinkles, acne, dirt or anything that can make the skin your face looks bad for the big day, even more, you'll love the colors and perfume of the facial mask and the creams! Finish your time in this part of the beauty salon removing the mask and waxing the excess of hair from lips and eyebrows.<br/><br/>Had a great time with the spa treatment of this beauty salon? Well, the next level is the bride's makeup! With some real make up tools and colors you can have a lot of fun combining them in some of the most stylish ways you can think of! Pick a blush, a lipstick, makeup, eyeshadow, use mascara on your eyelashes matching your eye shadow and try even some eye contact lenses and… who knows? Maybe you'll look more beautiful with some blue eyes! Get your hair ready with some amazing hairstyles with a beautiful hair color. Choose the perfect wedding hairstyle!<br/><br/>You can't go to the altar with your nails undone! Let’s get them to look awesome at the manicure salon for girls! Let your imagination go wild with the nail art of the wedding manicure and combine different colors, stickers, glitter and think of an outstanding nail design that could impress your wedding guests!<br/><br/>Well after these beauty salon levels, you probably think you're ready to go, but there is still something to do: it is time to design your own wedding dress! The gown makes the bride shine! Dress up with wonderful top to go with a glamorous bottom dress and choose a belt or a bow if you think you need it. Complete the bride dressing stage by choosing the perfect bridal accessories, veil, high heels, hair style and the most fashionable tiara, jewels and gloves a bride could wear! This beautiful wedding dress will exceed all your expectations! Do not forget to choose a ring, a necklace and a pair of earrings!  <br/><br/>Okay! Now you have your wedding gown, take your bouquet because everything is ready for you to go to the church and get married! But is the groom ready? Well in this super wedding mania, you must take care of your bridegroom, choose him a luxurious costume, a suit matching your dream wedding, some stylish shoes, and the best jewelry. Make him look like a Hollywood actor or any other superstar you like, so you can finally hear this fashion couple are man and wife after he puts the wedding ring on your finger!<br/><br/>This all in one dress-up game is surely one to add to your collection! With plenty of activities to play, this marry me game is the one every girl will love playing! Take a photo of your wedding preparation and share it with your friends! Come to the wedding salon and play now!", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-10-22T14:33:40", "background_image": "https://media.rawg.io/media/screenshots/8be/8be59b652ffe5bb3a6283bf2fb7a6cb8_TroJfi8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tania San Vicente"], "genres": ["Simulation", "Family"], "publishers": ["Tania San Vicente"], "esrb_rating": null}