{"id": 296160, "slug": "onnect-pair-matching-puzzle", "name": "Onnect – Pair Matching Puzzle", "name_original": "Onnect – Pair Matching Puzzle", "description": "ONNECT is a connection-based PAIR MATCHING GAME with challenging levels.<br/><br/>Find the matching tiles, connect the pairs with up to three lines. Remove all tile pairs before the time is over. Become an expert level by level. Enjoy the collections of lovely animals, yummy fruits, interesting professions, exciting emojis and more.  <br/><br/>GAME FEATURES<br/>Well-designed challenging levels<br/>Arcade &amp; leisure modes<br/>Hint &amp; shuffle boosters<br/>Tile movements<br/>Levels with timed bomb cards<br/>Autosave, continue playing where you left off<br/>Various image collections<br/>Classic onet connect game mechanics<br/>Improves memory, focus, attention and concentration.<br/>NO ADS - package purchase removes the banner and interstitial ads.<br/>VIP SUBSCRIPTIONS - gives you premium onnect features for the selected period.  <br/>POLISHED - with satisfying and stimulating visual effects. <br/>IN YOUR LANGUAGE. The app support English besides Arabic, Chinese, French, German, Italian, Japanese, Korean, Portuguese, Russian, Spanish, Turkish, and Vietnamese.   <br/><br/>HOW TO PLAY?<br/>The aim is to REMOVE ALL TILES before the time is over.<br/>Find two IDENTICAL IMAGES and tap on to connect them.<br/>Tiles can be connected with up to 3 STRAIGHT LINES where there is no other tile blocking the line path.<br/>Use the HINT button to reveal a connectable pair.<br/>Use the SHUFFLE button to rearrange tiles.<br/><br/>Onnect is the most colorful and sparkling game among the FREE PUZZLE GAMES, especially the ones that have ONET CONNECT game mechanics. It can also serve as an ATTENTION TEST. Everyone can solve CHALLENGING MATCHING PUZZLES.<br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/>In Onnect – Pair Matching Puzzle we offer you the following two subscription options:<br/>1. A weekly subscription costing $3.49 (or equivalent in your currency) per week after a 3-day free trial period.<br/>2. A monthly subscription costing $9.49 (or equivalent in your currency) per month.<br/>After buying any of the subscriptions, you will get rid of all of the ads. This includes the Remove Ads product during your subscription period, which removes the non-optional banner and interstitial adverts from the game. Moreover, you will no longer need the optional rewarded video adverts thanks to daily rewards of your subscription. Daily rewards of your subscription include wild cards for the hint, shuffle, change image set, bomb-card defusing, and time extension features. You will have VIP access to three premium image collections. VIP members will be able to choose image sets to play.  <br/><br/>This is an auto-renewable subscription. The payment is charged to your account after confirmation. The subscription is renewed unless you unsubscribe 24 hours before the period ends. Your account will also be charged for renewal. The above-mentioned prices are for customers in the United States. Pricing in other countries may change and actual charges may be converted to local currency.<br/><br/>End of trial/introductory periods and subscription renewal:<br/>- The payment will be charged to your iTunes Account after a confirmation of purchase.<br/>- The subscription will be renewed unless you unsubscribe 24 hours before the end of the current period.<br/>- The account will be charged for renewal 24 hours before the end of the current period at the standard cost of the subscription.<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- No cancellation of the current subscription is permitted during the active subscription period.<br/>- Any unused portion of the free trial period will be forfeited when the subscription is purchased.<br/><br/>Canceling a trial or subscription:<br/>- In order to cancel a subscription during the free trial period, you need to cancel it through your account in the App Store. This must be done at least 24 hours before the end of the free trial period to avoid being charged.<br/>Terms of Use: http://www.chef.gs/onnect-terms<br/>Privacy Policy: http://www.chef.gs/privacy-policy<br/><br/>If you have any questions feel free to contact us at info@chef.gs", "metacritic": null, "released": "2018-11-07", "tba": false, "updated": "2019-07-29T15:37:33", "background_image": "https://media.rawg.io/media/screenshots/27c/27cc116be7fc7c3d86b19863028ef9c4.jpg", "website": "http://www.gamebility.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Erhan Eser", "CHEF GAME STUDIO YAZILIM TEKNOLOJILERI LIMITED SIRKETI"], "genres": ["Arcade", "Board Games", "Casual"], "publishers": ["Erhan Eser", "CHEF GAME STUDIO YAZILIM TEKNOLOJILERI LIMITED SIRKETI"], "esrb_rating": null}