{"id": 296282, "slug": "ultimate-ludo-saga", "name": "Ultimate Ludo Saga", "name_original": "Ultimate Ludo Saga", "description": "Ultimate Ludo Saga is one of the best Multi-player Ludo game that you can play with your family and friends. If you are looking for a classic Ludo game in 2018, Ultimate Ludo Saga will be your best and first preference. Ultimate Ludo Saga will remember your childhood memories to share with your friends.<br/><br/>Ultimate Ludo Saga is the king of Ludo games in 2018. 2 to 4 players can play Ludo Saga at a time.It’s a classic Ludo game that’s available for you to play in an all new modernized format. You can play Ludo Saga against the computer or Challenge your online friends and earn coins. Ludo Saga is not only enjoyable Ludo game but also challenging too. <br/><br/>Ultimate Ludo Saga is developed based on the classic Ludo game rules.<br/><br/>Rules of Ultimate  Ludo saga:<br/><br/>1) Ultimate Ludo Saga can be played between 2 to 4 players. 4 tokens will be provided for each player in this Ludo game. Player who gets all four tokens to the Home first is the winner. This Ludo game can continue to crown a winner, runner, third place winner and the fourth/last finisher.<br/><br/>2) The player must roll a six to move a token out of the yard.<br/><br/>3) Player gets another chance to roll the dice when the player rolls a six.<br/><br/>4) If a player get 3 times continuous six, third turn of the player will be skipped.<br/><br/>5) Player gets another chance to roll the dice when token crosses the finish line.<br/><br/>6) When a token occupies the opponents token, the player gets another chance to roll the dice and the opponent token is returned to the token owner's yard.<br/><br/>7) The safe places (star tiles) are for all the tokens.<br/><br/>8) The token(s) must be moved out and travel around the board to make it to home.<br/><br/>Features:<br/>1) Refined AI to give you a challenging experience.<br/>2) Polished graphics and sounds.<br/>3) Challenge your friends online with Multi-player feature. <br/><br/>Liked the game? We would love to get your feedback! Let us know what we can add to make your gameplay even more enjoyable and earn your 5-star review.<br/><br/>Contact Us: <br/>Questions? Contact us at https://mlokgames.wordpress.com/contact/", "metacritic": null, "released": "2019-01-03", "tba": false, "updated": "2019-10-22T14:35:35", "background_image": "https://media.rawg.io/media/screenshots/3d4/3d41b3a5521b42f48135597e1a419a98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lokesh Meesala"], "genres": ["Board Games", "Puzzle"], "publishers": ["Lokesh Meesala"], "esrb_rating": "Everyone 10+"}