{"id": 296287, "slug": "super-power-bubble-shooter", "name": "Super Power Bubble Shooter", "name_original": "Super Power Bubble Shooter", "description": "Super Power Bubble Shooter is an addictive, exciting, brain-training puzzle game with many fun levels packed with awesome challenges, power-ups, and effects. Play for free today and join the bubble popping mania of Super Power Bubble Shooter.<br/><br/>In Super Power Bubble Shooter all you need to do is to shoot and burst all the colorful balls and solve the fun puzzles and challenges to level up. Make combinations of 3 or more identically colored balls to pop the group and blast the bubbles away. Aim carefully to hit the target, strike and drop big groups of bubbles to unlock the booster powers. With cool new items and effects, powerful boosters and tons of puzzle levels, you just won’t put it down. Try it out today!<br/><br/>FEATURES OF SUPER POWER BUBBLE SHOOTER:<br/>Play and enjoy hours of endless fun. <br/>Bubbles are spinning, Precise aiming and bouncing off the walls are a must!<br/>Bubble swap is free, just tap on your bubble to swipe with the next bubble.<br/>Addictive and super fun to play.<br/>Multiple boosters to make the game exciting.<br/>Over 800 Levels and many more coming soon.<br/><br/>Super Power Bubble Shooter is an amazing bubble shooter game which will test your strategy and planning skills. Download now and play for free! <br/><br/>BOOSTERS IN SUPER POWER BUBBLE SHOOTER:<br/>Earn awesome power-ups  by popping 15 bubbles of same color:<br/>* Red Booster: It can blast up to 19 surrounding bubbles.<br/>* Blue Booster: It can blast all bubbles in a row and drop all the bubble below that row.<br/>* Yellow Booster: It can blast three small explosions, each popping up to 7 surrounding bubbles.<br/>* Green Booster : It can blast up to 7 bubbles in vertical direction.<br/><br/>HOW TO SUPER POWER BUBBLE SHOOTER:<br/>* Drag your finger to move the laser aiming and lift it to shoot bubbles.<br/>* Match at least 3 bubbles of the same color or more to pop the group.<br/>* Boost your experience with awesome power-ups.<br/>* Use your moves efficiently to overcome all obstacles and complete levels.<br/>* Pop and burst balls and clear the board.<br/>* Reach high scores by using the powerful boosters.<br/><br/>Liked the game? We would love to get your feedback! <br/><br/>Thank you!", "metacritic": null, "released": "2018-11-04", "tba": false, "updated": "2019-10-22T14:35:36", "background_image": "https://media.rawg.io/media/screenshots/e42/e42112232d20782403203daa4db35020_fBrRgAL.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lokesh Meesala"], "genres": ["Arcade", "Puzzle"], "publishers": ["Lokesh Meesala"], "esrb_rating": "Everyone 10+"}