{"id": 296453, "slug": "axe-alliance-vs-empire", "name": "AxE: Alliance vs Empire", "name_original": "AxE: Alliance vs Empire", "description": "Unite to fight! Join a guild, battle and experience the most immersive and large-scale MMORPG battles ever seen on a phone.<br/> <br/>Introducing AxE: Alliance vs Empire, a massive and innovative MMORPG set in a mysterious, fantasy open-world. Enter the epic conflict between two powerful factions as they fight to control the fate of the world. <br/><br/>Play online fantasy games with your friends and millions of players worldwide, using single player, co-op and competitive modes inspired by the best MMOs and open-world games on PC and console. <br/><br/>With a rich fantasy story, a comprehensive set of features, and a living open-world, AxE offers one of the most fully realized game worlds on mobile.<br/> <br/>CO-OP &amp; COMPETITIVE GAME MODES<br/>- Battle with your friends and millions of players across the globe.<br/>- Play competitive modes, from smaller, tactical 4 vs. 4 player faction combat to large-scale PvP battles.<br/>- Raid with your friends to defeat powerful dungeon bosses like dragons and giants.<br/>- Join a guild and plan around upcoming events using advanced guild, chat &amp; team management systems.<br/> <br/>FANTASY RPG STORY AND CHARACTERS<br/>- Enter a fantasy world and the epic conflict between the Darkhaan Empire and the Galanos Alliance.<br/>- Battle for control of rare and powerful relics to unlock the power of the universe.<br/>- Choose your path, with different missions and settings based on the decisions you make.<br/>- Encounter unforgettable friends and foes along the way.<br/> <br/>OPEN WORLD RPG<br/>- Explore an open world, filled with diverse locations, characters, quests, missions and loot, all filled with rich narrative and history. <br/>- Explore 22 unique areas, from the deserted plains of Lakeside Base to the inner sanctums of Venyon Island.<br/> <br/>LEVEL UP &amp; CHARACTER CUSTOMIZATION<br/>- Choose from six different and highly customizable character classes from the two factions. <br/>- Customize and upgrade your weapons, armor, abilities and more to match your play style and defeat your opponents.<br/>- Level up and apply your signature style to your character with unique skills and abilities.<br/> <br/>CONSOLE-LEVEL GRAPHICS &amp; PHYSICS<br/>- AxE offers full 3D, console-level graphics and motion physics for fast and dynamic real-time movements and super-fluid controls.<br/><br/>Enter a fantasy MMORPG with massive PvP battles and fight for control in AxE. Download now!<br/><br/>SUPPORT &amp; COMMUNITY<br/>Are you having a problem? Contact our 1:1 support in-game or send us an inquiry at help_axe@nexon.com<br/><br/>Follow us on official communities to get the latest news and updates!<br/>Facebook: https://www.facebook.com/AlliancevsEmpire<br/>Forum: https://m.nexon.com/forum/376<br/><br/>Terms of Service: http://m.nexon.com/terms/304<br/>Privacy Policy: http://m.nexon.com/terms/305<br/><br/>Recommended Specifications: Android 6.0 or higher / Galaxy S7 or higher<br/>Minimum Specifications: Android 4.4 / Galaxy S7<br/>- RAM : 3GB<br/>- CPU : Qualcomm Snapdragon 820 or Samsung Exynos 8 Octa (8890) SoC<br/><br/>APP PERMISSIONS INFORMATION <br/>In order to provide the below services, we are requesting certain permissions:<br/><br/>[Optional Permission]<br/>- Optional permission does not affect gameplay.<br/>Camera: Taking screenshots to help with customer service inquiries<br/>Photos: Attaching screenshots for customer service<br/>Microphone: Mic access to use voice chat<br/><br/>[Permission Management]<br/>:arrow_forward: Android 6.0 or higher - Settings &gt; Applications &gt; Select App &gt; Permissions<br/>:arrow_forward: Under Android 6.0 - Update OS version to retract permissions; Uninstall app<br/>※ If the app does not request consent for the permission, you can manage the permission by the above steps.<br/>※ This app offers in-app purchases. You can disable this feature by adjusting your device settings.", "metacritic": null, "released": "2019-02-22", "tba": false, "updated": "2019-07-29T14:40:02", "background_image": "https://media.rawg.io/media/screenshots/796/7962bf3a8804681dc4f3d837f28a62de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["NEXON Company"], "genres": ["Action", "RPG"], "publishers": ["NEXON KOREA"], "esrb_rating": "Teen"}