{"id": 296625, "slug": "area-51-itch-jonathan-cauldwell", "name": "Area 51 (itch) (Jonathan Cauldwell)", "name_original": "Area 51 (itch) (Jonathan Cauldwell)", "description": "<p>Fizzog the alien has crash-landed his space scooter on a primitive blue-green solar satellite in the outer reaches of the galaxy some 30,000 light years from galactic central point.  As luck would have it, the technology to repair his scooter does exist on this planet but only at a mysterious location known as Area 51.  Alas, this place is heavily guarded so collecting all of the required components is going to be tricky.  Fizzog will be needing your help.  There are just three controls: left, right and jump.  Simply collect the flashing blue/red squares to proceed to the next level.  Avoid the patrolling nasties, spikes and falling too far.</p>\n<p>Area 51 is a game for the 16K Spectrum in the Manic Miner tradition and started out as a 4K submission in the 2004 Minigame Competition.  The frame rate is identical to the one used in Manic Miner to give this game the same pace although the physics are somewhat different.  Where Smith went for crumbling platforms I opted instead for platforms that appear and disappear and deadly lasers.  There are a couple of special screens such as the Rocket Test Range (where the rocket's sequence can be learned) and the particularly sadistic Heavy Water Plant.</p>\n<p>There are 16 screens in total and the game will throw them at the player in a different random order every game, regardless of difficulty.</p>\n<p>You will need an emulator (or a 16K/48K/128K Spectrum) to play.</p>", "metacritic": null, "released": "2019-02-24", "tba": false, "updated": "2019-02-25T04:09:41", "background_image": "https://media.rawg.io/media/screenshots/c2c/c2c8cc6548da8b2ebe311fc8039f22d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jonathan Cauldwell"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}