{"id": 296989, "slug": "my-love-is-blind", "name": "My Love is Blind", "name_original": "My Love is Blind", "description": "<p>Guide your blinded love to safety using only your voice, but be careful because their demons are also attracted to the sound of your voice.</p>\n<p>My Love is Blind is a puzzle platformer created in 7 days for the #BrackeysGameJam. The theme for the game jam is \"Love is Blind\". In \"My Love is Blind\" the love of your life has been blinded and you must guide them to safety with the sound of your voice. </p>\n<p>My Love is Blind is available to play in the browser but also as a Windows download for those that prefer this or whose browsers do not support WebGL very well.</p>\r\nGameplay\r\n<p>The gameplay in \"My Love is Blind\" is very simple. On each screen you must guide your blind love to the exit arch using only your voice. You can call your love to the spot where you are projecting your voice or you can warn your love away from that spot.</p>\n<p>Enemies are always attracted to the sound of a voice even if it is warning.</p>\n<p>Machines are also attracted to voice and will move along their tracks based on the position of the voice. <br/></p>\r\nControls\r\n<p>The controls in \"My Love is Blind\" are very simple. </p>\n<p><strong>Left click:</strong> call your love to the spot where you are clicking</p>\n<p><strong>Right click: </strong>warn your love away from the spot where you are clicking</p>\r\nDevelopment\r\n<p>\"My Love is Blind\" was developed in Unity 2018.3 for the #BrackeysGameJam</p>\n<p>Per the rules, no external assets were used outside of Package Manager assets and fonts which have an open license.</p>\n<p>The font used is Pixeltype which is 100% free</p>\n<p>The package manager assets used are TextMeshPro and Cinemachine</p>\n<p>All music and sound effects were created in Garage Band on iOS. </p>\n<p>Pixel art was created using Pyxel Edit. I have never done pixel art before and the results show - it's not very good.</p>\n<p>Credits to StackOverflow for pointing me in the right direction on how to constrain a point to a line segment (used for keeping the machines on the tracks)</p>\n<p>https://stackoverflow.com/a/47484153<br/></p>\r\nStory\r\n<p>The story in \"My Love is Blind\" is about betrayal, forgiveness, and redemption using the theme of the jam as inspiration.</p>", "metacritic": null, "released": "2019-02-23", "tba": false, "updated": "2019-08-28T23:17:47", "background_image": "https://media.rawg.io/media/screenshots/c9f/c9f76abc2204f76be8831968a30a6513.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["morphinegames"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}