{"id": 296992, "slug": "love-is-blind-especially-from-the-friendzone", "name": "Love is blind - Especially from the Friendzone", "name_original": "Love is blind - Especially from the Friendzone", "description": "<p>Escape the Friendzone!</p>\n<p>You have been asked by your Friend to help move their house. Blinded by Love, or some illusion of it, you enthusiastically accept the offer with the hopes that this will some how get you out of the Friendzone. Your only goal now, Impress her with your amazing moving service abilities. Help move all of her belongings into the moving truck before time runs out. GOOD LUCK BUDDY</p>\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p>Controls: -WASD move (forward, back, left, right) - Mouse movement to look around and rotate directions. - Should feel like a standard first person</p>\n<p>Jump: - Space</p>\n<p>Left Mouse Click (hold): - Pick up </p>\n<p>Right Mouse Click: - Throw Object</p>\n<p>------------------------------------------------------------------------------</p>\n\n<p>Dev Notes:</p>\n<p>I work full time and I'm a full time student. I also had midterms this week so I ran out of time. But I wanted to submit something. I worked really hard on it for about a day! making a ton of progress. Then didn't touch it for a week. 12 hours before the deadline I figured I might as well scramble and get something submitted. So I threw out a bunch of features and Ideas I had (Sadly) I added in a way to win and lose. That is what you are playing! I hope you enjoy.  Other Notes:</p>\n<p>The Controller took me the most amount of time. Because we couldn't use the standard assets I had to come up with my own version. I think I did a good job, but under the hood it's not nearly as simple as I would like. The camera moves separately from the parent player and there are no looking/camera constraints. But I ran out of time to fix that.</p>\n<p>Picking up was fun to make. It's a simple script that I wrote. A simple raycast comes out of the camera and if it sees an object tagged for picking up and the user clicks the mouse the objects then has a moveTowards added to it that moves it to a child empty point in space in front of the camera.</p>\n<p> What I am most sad about is the fact that I didn't have time to compose a song about the friendzone for nice background music. </p>\n\n<p>Hope you Enjoy playing and can't wait for the next one!</p>", "metacritic": null, "released": "2019-02-23", "tba": false, "updated": "2019-02-25T05:02:54", "background_image": "https://media.rawg.io/media/screenshots/4b3/4b37fa92d54a9d1eb3657a5bac661766.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["austinGENEreeve"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}