{"id": 297281, "slug": "igknight-golf-defender", "name": "IgKnight Golf Defender", "name_original": "IgKnight Golf Defender", "description": "Not your typical Golf VR simulator! In modern times, people play golf as a leisure or competitive sports, but in the fantasy medieval age where the IgKnight warriors live in, Golf is a survival skill to defend their stronghold against monsters! From the high towers, hit your golf cannonballs towards the horde of monsters to destroy them.Features<br/>Main campaign: An unique VR tower defense mode where you try to survive the onslaught of a variety of enemies with your golfing skills. Use the physics mechanics to launch cannonballs with your golf club and destroy the invading dark army. There are a variety of special cannonballs that can be used as well to good effect depending on placement. <br/>Strength Test Challenge: See how far you can hit the golf ball.<br/>Accuracy Test Challenge: See if you can hit all the targets.<br/>Online leaderboard for main campaign and challenge modes.<br/>Optional 2-4 Player Multiplayer Campaign Mode.Others<br/>Custom version available now to reskin the game for commercial or event usage. Add logo branding and modern environments. Optimize the game play to have only strength test challenge or accuracy test challenge. Contact us now if you want to enquire more.<br/><br/>Custom controller version available now as well using a real golf club and Vive tracker for the most realistic experience. (We can make one for you or provide some guidelines for making a custom controller)", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:04", "background_image": "https://media.rawg.io/media/screenshots/bb0/bb0012ac50733b39e67991d2f6af482a.jpg", "website": "http://igknightgames.com/igknight-golf-defender/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ignite VR"], "genres": ["Action", "Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Ignite VR"], "esrb_rating": null}