{"id": 297284, "slug": "minimal-move", "name": "Minimal Move", "name_original": "Minimal Move", "description": "Minimal Move is a new perspective puzzle game in 3D.<br/>The game starts when the two space investigators, Kaiten and Ido landed on a mysterious planet for their mission to find out a secret of the planet. <br/>The rule of the game is simple: move blocks and go to a portal! <br/>Simple but complex, feel maximum space in minimal world.<br/>A new innovative puzzle game, welcome to the world of Minimal Move! <br/><br/><br/><br/><br/><strong>MINIMAL MOVE FEATURE</strong><br/><ul><li><strong>Solve puzzles : </strong>Move blocks and go to a portal. The rule is simple but the puzzle is complex. Because it’s 3D puzzle so you can rotate your view point and see how to move! Find your minimal move to a portal!</li><li><strong>Cooperate with or without : </strong>You can choose a single player or cooperation mode with two. In the game, cooperation with Kaiten and Ido is essential to go to a portal.</li><li><strong>Move blocks : </strong>Kaiten can rotate blocks and Ido can move blocks from side to side and up and down.</li><li><strong>Explore 7 worlds : </strong>There will be 7 worlds for the main story of the game. Each world will have different types of blocks for new ways of playing the puzzle.</li><li><strong>Play more than 100 levels : </strong>There will be more than 100 levels of puzzles to play.</li><li><strong>Meet fun characters : </strong>Adding to the main characters Kaiten and Ido, there will be many funny monsters and robots are coming on your way! You will find your favorite one on the journey!</li><li><strong>Discover the story : </strong>Minimal Move has beginning, that means it has ending. We have an original story that you can discover with Kaiten and Ido along with the game, and it has a surprising ending! When you complete all the 7 worlds, you will find out the secret of Minimal World! </li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:04", "background_image": "https://media.rawg.io/media/screenshots/a0c/a0c745c0fa1e90a8babcf6138c32040a.jpg", "website": "https://www.minimal-move.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tako Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Tako Studio"], "esrb_rating": null}