{"id": 297223, "slug": "freedom-finger", "name": "Freedom Finger", "name_original": "Freedom Finger", "description": "<p>Freedom Finger puts you in control of rookie space pilot, Gamma Ray, as they embark on an intergalactic rescue mission to save lunar scientists who have been taken hostage by terrorists. However, Gamma Ray soon discovers their mission may be more sinister than they thought, forcing them to make difficult decisions that determine the fate of the innocent hostages.<br />\n- Classic shmup gameplay shootin&#39; blended with platforming-like environmental hazards.<br />\n- Melee combat! You&#39;re flying a giant fist, so use it! Punch, toss, and smash enemies to smithereens!<br />\n- The unique Grab attack allows you to capture enemies! You can then use them as a shield or wield their guns against their own comrades!<br />\n- Fight your way through 36 handcrafted levels, spread out over 12 worlds! Each world features new enemies, power-ups, and challenges!<br />\n- A wide selection of difficulty settings. Whether you want to chill and enjoy the story or crank the difficulty for a butt-blasting ridiculous challenge, we&#39;ve got you covered!<br />\n- A highly satirical storyline that explores hot-button topics such as communism, US foreign policy, sriracha sauce, and crafting in videogames.<br />\n- Rhythm based chaos! The music is heavily connected to the gameplay, so things like enemies, bosses, attacks, and events are synced to the music.<br />\n- A unique soundtrack including music by Red Fang, METZ, Power Trip, Com Truise, White Fence, Ty Segall, Makeup and Vanity Set, True Widow, The Radio Dept., Drab Majesty, John Maus, Vektroid, Danimal Cannon, Cleaners from Venus, Male Gaze, Ezee Tiger, The Mall, and many more!</p>", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2023-03-09T23:02:17", "background_image": "https://media.rawg.io/media/screenshots/53d/53d1af83dc10a9c28ee520564c353a5c.jpg", "website": "http://WideRightGames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 26, "beaten": 1, "toplay": 8, "dropped": 2}, "playtime": 1, "achievements_count": 78, "ratings_count": 4, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "PC", "macOS"], "developers": ["Wide Right Interactive"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Wide Right Interactive"], "esrb_rating": "Mature"}