{"id": 297228, "slug": "unity-of-command-ii", "name": "Unity of Command II", "name_original": "Unity of Command II", "description": "Built on a brand new bespoke 3D engine, the game retains Unity of Command’s signature art style and delivers highly polished fluid gameplay. Easily accessible yet hard to master, Unity of Command II is the highly anticipated sequel to the cult classic that’s been turning novice players into battle-hardened grognards since 2011. <br/><br/>Unity of Command II lets you take command of Western Allies for the first time in the series. You will manage your army’s divisions as well as their supply and logistics. For the first time in Unity of Command you will face Fog of War. Reveal the unknown by capturing enemy soldiers and launching recon to gather intel on enemy troop positions. The enemy will seek to capture your units’ stragglers — regroup and strike back!Key Features<br/><ul><li><strong>Dynamic Campaign</strong> — Rewrite the history of the Second World War with a branching campaign where no two playthroughs are alike. <br/></li><li><strong>Headquarters</strong> — This new feature places army headquarters on the map, from which you will direct unit reorganization, bridging and resupply. Headquarters are not only essential to reinforcing and recovering lost unit strength, but are also able to deploy special abilities such as Emergency supply, redeploying units using HQ trucks, and many more.<br/></li><li><strong>Theater Assets</strong> — This feature from the original game is greatly expanded in Unity of Command II. Wreak havoc behind enemy lines by sabotaging infrastructure. Order your aircraft to provide aerial recon, contest air superiority, or deliver devastating bombing runs. Sustain units behind enemy lines with an air supply bridge.<br/></li><li><strong>Bonus Objectives</strong> — Participate in optional history-altering “what-if” objectives — lead the Western Allied charge to beat the Soviets to Berlin, or cancel Operation Market Garden to reinforce Patton’s army. <br/></li><li><strong>Fog of War</strong> - Deal with your enemies — but you’ll have to find them first. Reveal enemy positions by capturing stragglers, upgrading the HQ and using its special abilities such as Short Range Recon. <br/></li><li><strong>Deep Operations</strong> — Unity of Command changed the world of turn-based strategy games forever by introducing its signature feature, supply lines. Keep a watchful eye on your logistics while planning to strike deep beyond enemy lines, sever supply lines and encircle enemy units.<br/></li><li><strong>Accessible Scenario Editor </strong>— Unity of Command II features a full-fledged Allied campaign, with the addition of several defining battles of WWII that can be experienced from the Axis side. The game comes with a built-in scenario editor, allowing players to create and share new battlefields using the integrated Steam Workshop support.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-18T12:40:37", "background_image": "https://media.rawg.io/media/screenshots/e9e/e9e19e7e071f3c7b8f51341f402336a8.jpg", "website": "https://unityofcommand.net/", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 49, "toplay": 8, "dropped": 4, "playing": 1}, "playtime": 3, "achievements_count": 10, "ratings_count": 5, "suggestions_count": 300, "game_series_count": 1, "reviews_count": 5, "platforms": ["PC"], "developers": ["Croteam", "2x2 Games"], "genres": ["Strategy"], "publishers": ["2x2 Games"], "esrb_rating": null}