{"id": 297338, "slug": "honor-and-duty-d-day", "name": "Honor and Duty: D-Day", "name_original": "Honor and Duty: D-Day", "description": "Honor and Duty: D-Day is an online PVP shooter set during the D-Day landing in World War II. Players compete in Team Death Match, Domination, and Free For All matches or in a separate Battle Royale mode. Online games feature 16 v 16 matches (32 player FFA/BR) in a fast paced environment Players can drive tanks and jeeps across large maps in search of the enemy. Players rank up to unlock access to all 4 player classes which each have different abilities.<br/>\n<br/>\r\nPlayers can choose their class, character, and weapons from 4 classes, 4 player characters, and a number of weapons including machine guns, rifles, shotguns, a rocket launcher, and a flame thrower.<br/>\n<br/>\r\nHonor and Duty: D-Day originated as a VR game on the consoles and has now made the move to PC VR and features cross play with console players.  The game started out with a low poly art style but was recently remastered for it's release on the PC with all new textures. While the game is still cartoony in nature, it now has a more realistic style than the traditional single color style seen in many games. <br/>\n<br/>\r\nThe game went through numerous open betas on the console side before releasing to great player feedback and has since received 28 updates adding numerous features and fixes.  There are still many things coming to Honor and Duty: D-Day in 2020 including planes, mortars, new maps, and new game modes.", "metacritic": null, "released": "2019-02-26", "tba": false, "updated": "2020-09-11T03:06:20", "background_image": "https://media.rawg.io/media/screenshots/d70/d706a7cfe5bc6529a3da0a3434d2bf52.jpg", "website": "http://strangegamesstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 24}, "playtime": 0, "achievements_count": 31, "ratings_count": 1, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation 4"], "developers": ["Strange Games Studios"], "genres": ["Action", "Shooter"], "publishers": ["Strange Games Studios"], "esrb_rating": "Mature"}