{"id": 297343, "slug": "ngoa-long", "name": "Ngọa Long", "name_original": "Ngọa Long", "description": "Ngọa Long là Game Chiến Thuật đỉnh cao Tam quốc cực kì hấp dẫn, dàn dựng trên nền 2D. Với bất kỳ thế trận từ Quân Đoàn Phó Bản, Đoạt Thành Chiến, Vương Vị Tranh Đoạt Chiến, Hải Chiến… cũng cần một chiến thuật tinh tế mới mong xoay chuyển càn khôn làm chủ ván cờ của một hảo hán Minh Chủ Ngọa Long. Bạn tin vào tài lược của mình không? Hãy thử Ngọa Long ngay hôm nay!<br/><br/>Bối cảnh là cuối đời Đông Hán chiến loạn với sự xuất hiện của các vị anh hùng Tam Quốc phân thiên hạ Ngụy (Tào Tháo) – Thục (Lưu Bị) – Ngô (Tôn Quyền), bạn sẽ cần chiêu mộ các võ tướng nổi tiếng: Quan Vũ, Trương Phi, Triệu Vân, Mã Siêu, Gia Cát Lượng, Tư Mã Ý, Đại Kiều, Tiểu Kiều, Chu Du, Điêu Thuyền, Lữ Bố,… để phục vụ cho quốc gia của mình. Tham gia Ngoạ Long, bạn sẽ trở thành các Thành Chủ, xây dựng thành trì, chiêu binh mãi mã, bày binh bố trận, thách thức trí tuệ so tài với người chơi khác.<br/><br/>TÍNH NĂNG NỔI BẬT:<br/>- Hệ thống Võ Tướng: Chiêu mộ, huấn luyện, trang bị, xếp trận, thưởng cho các tướng.<br/>- Hệ thống Trang Bị: Cường hóa trang bị, tướng khí, kho trang bị ,….<br/>- Hệ thống Dinh Phủ: Tìm tri kỉ sau đó kết thành vợ, sinh con huấn luyện thành võ tướng.<br/>- Hệ thống Khoa Kĩ: Học các kĩ năng và trận pháp, chiêu binh<br/>- Hệ thống Lôi Đài: Chọn ra võ tướng mạnh tỉ thí đơn đấu.<br/>- Hệ thống Phó Bản: Vượt map phó bản quân đoàn sẽ nâng cấp thành chính và các võ tướng.<br/><br/>TÍNH NĂNG ĐỘC ĐÁO:<br/>- Tính năng Thôn Thiên Chiến: Chiếm thành trì với các mưu kế đa đoan để làm bá chủ thế giới, giành nhiều Chiến Tích<br/>- Phó bản Tinh Anh (Thành chính đạt từ cấp 170 trở lên)<br/>- Mở rộng phó bản: Vương Hỗn-Thành Dương Chiến, Mã Long-Thượng Đan, Điền Chương-Vũ Uy <br/>- Mở tính năng ghép và cường hóa Quân Ấn.<br/>- Giác ngộ các Tướng Xanh Lá (Titian) mạnh vượt trội<br/>- Tính năng Thám Bảo:  Thành Chính 140 tham gai, nhận các vật phẩm để nâng tướng Titan<br/>- Mở tính năng Vỗ Khôi Tháp: Khiêu chiến với Boss để nhận phần thưởng hấp dẫn. <br/>- Nhiều tính năng khác…<br/><br/>DÒNG MÁY HỖ TRỢ :<br/>Tương thích với hầu hết các dòng máy iOS<br/><br/>THÔNG TIN THAM KHẢO:<br/>Hotline hỗ trợ khách hàng : 1900561558 (cước phí 2000đ/phút)", "metacritic": null, "released": "2016-01-04", "tba": false, "updated": "2019-10-22T14:35:43", "background_image": "https://media.rawg.io/media/screenshots/8ac/8ac0196773c7d5ce8911d3a9500a6469.jpg", "website": "http://m.ngoalong.zing.vn/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VNG GAME STUDIOS"], "genres": ["Action", "Strategy"], "publishers": ["VNG SINGAPORE PTE"], "esrb_rating": "Teen"}