{"id": 297304, "slug": "gok", "name": "GoK", "name_original": "GoK", "description": " <strong> Game of kingdoms [/ b] [/ i] - adventures of warriors of the three kingdoms in the territory of the forgotten lands.<br/><br/>  -A creature called you whose origin you know nothing called for. Your task is to survive and protect the people who followed you to new lands. You will find a world shrouded in mystery and full of dangerous enemies that you need to overcome.<br/><br/><br/> - You get no help from the outside world. All that you have is you and those whom you brought with you to new lands. You will have to master these harsh lands on the move, build defense facilities, extract resources for the village. Explore the dungeons that fill this world. In a cruel forest, your life is under threat all the time: at any moment wild animals and horrible monsters can kill you.<br/><br/>PLOT<br/>  -A creature unknown to him, which called for help, penetrated Ragnar’s dream. Ragnar decides to go camping, taking with him five ships with brave warriors, and sets off. As a result, the creature led Ragnar to new lands. After disembarking and exploring it, the people of Ragnar stumbled upon an ancient altar. When Ragnar approached him, the statue spoke in the voice of a creature from his dreams. He decided to assemble a detachment and go on reconnaissance, ordering his people to start building the camp ...<br/><br/>Game process.<br/>- Participate in fierce battles with enemies, explore dark creepy dungeons, solve puzzles to access new treasures.</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:48:03", "background_image": "https://media.rawg.io/media/screenshots/14f/14fcb987c686558c6ac9d0a0e98f1f44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GSE"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["GSE"], "esrb_rating": null}