{"id": 297457, "slug": "hero-patrol-puppy-farm", "name": "Hero Patrol: Puppy Farm", "name_original": "Hero Patrol: Puppy Farm", "description": "What a pleasant life a dog can have beside its farmer! The only job of Bailey, our lovely farm dog, is to guard the sheep and watch the house. The rest of the day, a dog can enjoy the peace and the silence of the farmer house. Then, when the night falls, Bailey goes with the farmer to check all the doors and fences are closed so they can sleep safe. All the fences are properly closed tonight, as usual, but the danger is coming from above! Bailey needs to defend the farmer and guard the animals! This guard dog will not allow the enemy to harm its human!<br/>Run and avoid the attacks of the enemies. Prove you are the best guard dog, protect the farmer! Do not let the enemy win. Bailey! It is time to face the threat! Run to survive in this amazing adventure in a dark farm!<br/><br/>Features of this thrilling game:<br/>- Grab your guard dog and help it to get away from every enemy attack in this incredible racing game!<br/>- Choose your favourite character and prevent the enemy to get too close or it will hurt you!<br/>- Have hours of fun avoiding these aliens! Start running now to protect the farmer!<br/>- Easy mobile controls and amazing graphics!<br/>- Reach the checkpoints to boost the speed of Bailey!<br/>- Share your achievements with your friends and take your guard dog to the top of the leaderboards!<br/><br/>Help Bailey to protect the farmer in this dark night full of dangers! Start running with your guard dog to defeat the enemy! Play now!", "metacritic": null, "released": "2019-02-27", "tba": false, "updated": "2019-10-22T14:35:50", "background_image": "https://media.rawg.io/media/screenshots/e92/e92d0f22f81578383190eb08e7ee2982.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BEST FREE GAMES-FUN APPS"], "genres": ["Simulation", "Racing"], "publishers": ["BEST FREE GAMES-FUN APPS"], "esrb_rating": "Everyone 10+"}