{"id": 297418, "slug": "tattoo-maker-coloring-master", "name": "Tattoo Maker: Coloring Master", "name_original": "Tattoo Maker: Coloring Master", "description": "Tattoo games - open a tattoo design studio and start coloring the awesome patterns, animals, mandalas. Tattoo maker for boys and girls! Become a tattoo artist! Fill out the outlines with colors. Design and craft an awesome art!  Anything you want! Place the tattoo on your arm, back, chest - anywhere! Tattoo planner app for boys and girls! Design your own tattoo and see how it will look on your arm or back or anywhere you want! Be an ink hunter! Tattoo designs for all of you! Fab tattoo designs for girls and tattoo gun simulator for men! Coloring book or coloring pages where you can unwind and relax while designing an awesome art on your own skin! It’s not a photo and tattoo app. Here, you pick the outlines and fill it with colours from palettes. Tattoo maker - a game for boys and girls! Colorify your skin! Princess and prince of the tattoo industry! Pick the ink color and become a greatest tattoo artist of all times! So start playing tattoo games now! Plan your own tattoo (tattoo planner app) and look awesome! Get the tons of high quality images and drawings (including sketches). Frequently updated! Anti-stress coloring app with free fun artworks! Create and relax! <br/><br/><br/>You can pick the color palette, picture and theme depending on your mood today. Spring, summer, winter, and autumn colors! The best stress relief app! <br/><br/>- Simply tap to pick the color and paint<br/>- Lots of beautiful illustrations and drawings to color<br/>- Personalized color palettes<br/>- Easy to save your work and share it with all your friends<br/>- You can save different versions of your artwork for the same sketch and revisit later!<br/>- Pinch to zoom in/out, easy coloring!<br/>- Over 500 images and patterns<br/>- Experiment with beautiful palettes<br/>- Designed for adults but kids and little girls can also enjoy the coloring experience<br/>- Game works offline! No WiFi needed to relax on the best coloring book.<br/>- New images and pictures every week!", "metacritic": null, "released": "2017-03-27", "tba": false, "updated": "2019-10-22T14:35:48", "background_image": "https://media.rawg.io/media/screenshots/4b0/4b09e78897c704b2766e831df7f9636f.jpg", "website": "http://tinydragonadventure.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiny Dragon Adventure Games Sp"], "genres": ["Sports", "Puzzle"], "publishers": ["Tiny Dragon Adventure Games Sp"], "esrb_rating": null}