{"id": 297420, "slug": "archer-master-girl-archery-world-cup-girls-game", "name": "Archer Master Girl: Archery World Cup Girls Game", "name_original": "Archer Master Girl: Archery World Cup Girls Game", "description": "World's #1 archery game for girls! Sweet, cute colorful targets. Hottest and most realistic archery simulator for girls is here! Shoot &amp; win the tournament - become an archery master or archery princess! Aim and shoot the target at a shooting range! Bull's eye! Perfect game for little girls and adult women! Get the ultra realistic archery / bowman experience featured with stunning 3D graphics. Cute colors, sweet fluffy targets (flowers, gingerbread man, kittens, pets, strawberry). Shoot colorful rainbow arrows at targets set at various distances. Earn coins and buy new bows. Get ready for the intense olimpic challenge without a gun or crossbow - just bow &amp; arrow! Become an archery champion! Bow sport moved to another level. Shooting moving candy targets, over 50 levels, different levels of difficulty all covered with flowers, cuteness and glamour! Leave the fashion / dress games and the spa or nail salon games for little girls. No unicorns, pony and sweet kittens here! No strawberry shortcake or other silly things for little barbie girls! Here you've got a game for serious grown teenage girls. Be a champion! All for free - no need for internet connection to play it! So take off your high heels, make up your hair, grab bow &amp; arrow, take a deep breath and aim the target. Shoot and hit bull's eye! It's simple as cooking in the kitchen! Become a shooting expert! Start shooting targets like a pro! No crossbow, no machine gun or bazooka - just a professional sport bow. It's not another apple shooter, throwing knife or crossbow hunter! Serious archery game! Feel like a female legolas! <br/><br/>Coming Soon:<br/><br/>Multiplayer mode (world tournament)<br/>Olimpic Championship<br/>Apple shooting mode<br/>Traditional Archery Tournament<br/>Challenge mode<br/>New levels (pine forest, archery field, deadly desert, rain forest) <br/><br/><br/>Become an archery queen!<br/>Over 80 cute levels!<br/>First archery game for girls!", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-10-22T14:35:48", "background_image": "https://media.rawg.io/media/screenshots/fb3/fb36c0170e3b45fe34348c07cc5a4c4e_ViHm38W.jpg", "website": "http://tinydragonadventure.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiny Dragon Adventure Games Sp"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["Tiny Dragon Adventure Games Sp"], "esrb_rating": null}