{"id": 297493, "slug": "forest-fruits-crush-with-tasty-candy-sweet-sugar", "name": "Forest Fruits Crush with tasty candy & sweet sugar", "name_original": "Forest Fruits Crush with tasty candy & sweet sugar", "description": "Forest Fruit Crush is a match 3 puzzle game with delicious raspberry and berry in which you basically have to crush 3 candy fruits or more to get some nice points and advance more in the game!It is a classic match 3 game for kids or youngsters to play in their spare time with forest pudding or jelly crush butter!Begin a journey to rescue the forest from evil beaver!The happy Forest animals will guide you to crush the candy fruits and create vegetables combos!Join us into a surreal adventure in the candyland and forestland and of course the famous wonderland!Prepare for wonderful mountain animations and chocolate streams coming out of the chocolate trees!The game has all sort of delicacies like icecream,Lollipop,macaroons or delicious cupcakes to play with!The evil jelly boss will try to eat all of your sweets, but be prepared to takle him and win each level!Get your daily bonus for completing the levels and gain macaron,yogurt,licorice and getting tons of other bonuses!<br/>Don't forget that you will have to play with woodland cookies too which are also cool and you will fall in love with the fantasy forest full of fairies and elf fairy and lots of love!Blossom these sweets and bonbons out of the game and get the highest score!<br/><br/>Forest Fruit Crush Match 3 Features:<br/>● Match 3 games free play with tons of levels and bonus unlockable boosters.<br/>● Delicious jelly, gummy bear and your little toddler will adore to play with the jellies and the awesome game effects will blow their minds!<br/>● Candy saga game style with lots of combos and explosive action!<br/>● Mayn game goals like : move mode, time mode, collect the ingredients, etc.<br/>● Surreal graphics, you will want to eat the cotton candy,icing and the jellies in this game!<br/>● Match same color vegetables in your free time and relax by playing a super matching games!<br/>● Gorgeous woodland Ice Cream candies with raspberry topping and cookie flavours!<br/><br/>How To Play Forest Fruit Crush:<br/>● Swap and crush 3 candy or more to create forest acorn blast!<br/>● Crush 4 candy to create acorn soda in a line and to make a blizzard of sweets!<br/>● Crush 5 candy to create berry soda in a T or L shape to create forest blossom!<br/>● Crush 5 candy to create raspberry soda in a line to create a rainbow color blossom!<br/>● Put together 2 forest cakes to make a big forest mania blast!<br/><br/>Download Forest Fruit Crush today and start your amazing bonbon saga experience!", "metacritic": null, "released": "2016-10-16", "tba": false, "updated": "2019-10-22T14:35:52", "background_image": "https://media.rawg.io/media/screenshots/67b/67b4e6136256cef4afaef5f931060389.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lapusanu Patriciu"], "genres": ["Arcade", "Puzzle"], "publishers": ["Lapusanu Patriciu"], "esrb_rating": "Everyone 10+"}