{"id": 297411, "slug": "deadly-dino-hunter-shooting-game", "name": "Deadly Dino Hunter: Shooting game", "name_original": "Deadly Dino Hunter: Shooting game", "description": "Deadly Dino Hunter Shores. Shooting game for free. A hunting simulation game for boys! Hunt or be hunted! Carnivores Dino World in 3D! Shoot, use a bow, machine gun, and sniper rifle to take down the T-Rex or other beasts! Let’s hunt! Jurassic T-Rex is here! Take a journey to a hidden jurassic island and kill the most ferocious animals in history! Equip powerful weapons! Use a crossbow or a bow for silent kill! Progress through varied shooter series to win rifles, shotguns and assault rifles! 3D dinosaurs, a huge world, console quality graphics! Hunting simulator like never before! Glu hunter! Forget about hunting deer or wolves! Dinosaurs are the real challenge for a tough guy like you! Carnivores - the deadly dinosaur hunter! Experience amazing graphics with hi-res textures and realistic Jurassic models! The best quality dinosaur shooter games on your mobile devices! Great free game for boys! A unique shooter game for free! A casual adventure game, where you hunt angry dinos! Bored with a cat simulator or dog simulator games? Don’t want to be a deer hunter anymore? Play ‘Deadly Dino Hunter: Shooting game’. The world of hunting is here! Let’s hunt! Jungle and savanna hunting! <br/><br/><br/>FEATURES:<br/>3D stunning graphics<br/>Real - like dinosaurs models<br/>Hunting simulator experience<br/>Multi weapon shooter game! <br/>No WiFi hunting game! <br/><br/><br/>UPCOMING FEATURES:<br/>Multiplayer<br/>Co-op with friends<br/>Sharing on FB &amp; G+<br/>Sniper elite mode! <br/>Jurassic adventure - Silent Age mode<br/><br/><br/>Hunt dinosaurs! <br/>Use variety of weapons! <br/>Hunt or be hunted!", "metacritic": null, "released": "2016-12-06", "tba": false, "updated": "2019-10-22T14:35:47", "background_image": "https://media.rawg.io/media/screenshots/357/3576ec05967dba9587d454cad25ad495.jpg", "website": "http://tinydragonadventure.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiny Dragon Adventure Games Sp"], "genres": ["Action", "Adventure"], "publishers": ["Tiny Dragon Adventure Games Sp"], "esrb_rating": null}