{"id": 297407, "slug": "lets-catch-fish-spearfishing-3d-diving-fishing", "name": "Let’s Catch Fish: Spearfishing - 3D diving fishing", "name_original": "Let’s Catch Fish: Spearfishing - 3D diving fishing", "description": "Let’s go for some real underwater fishing simulator! Play the most awesome scuba underwater sport fishing games! Free diving with speargun! Grab your diver gear, speargun and dive deep into the sea. Let’s fish! Hunt down a hungry shark, a massive tuna or a king salmon using a speargun. No need for a fishing hook. Sport fishing games free for kids has been moved to another level! Be the ultimate scuba hunter. Beware of deadly sharks and barracudas. No reel, no fishing hook or tackle, no worm bait, no fishing rod or fishing hook no net. Just you and the speargun / harpoon. Enjoy the adventure in the world’s best fishing locations for underwater scuba divers. Let’s go fishing simulator! Relax and unwind! Catch the fishing simulator fever this season with this awesome spearfishing simulator game. Underwater scuba harpoon spear fishing games free for kids! Have fun while scuba diving and hunting realistic fish: from catfish, albacore and skipjack tuna to large species such as coelacanths, peacock bass and even white sharks. Be careful of shark attack! Travel to the photorealistic locations such as Florida Coast, The Great Reef, Red Sea and more! From Hanauma Bay to the Amazon River, and China! No place is off-limits, but shark evolution line made them ultimate underwater predators, watch! Leave your fishing hook and tackle, forget about the worm bait. Get in to the diving suit, prepare your gun and dive! Shark games won’t give you so many exciting moments as this underwater fishing simulator! Dive in the underwater sea paradise! Play Let’s Scuba Fish: Spearfish to get the ultimate experience of a diver! Explore the world’s most beautiful underwater areas. Deep underwater lies shark world. Become the ultimate underwater hunter. But beware! Water depth is a hostile environment. Oxygen can end at any time. A poisonous fish can kill you if it touches you, not to mention the hungry sharks! Shoot your harpoon accurately and you're quite a hunter yourself! Shark evolution gave them powerful jaws! Fascinating storyline, deadly fish, scuba diving - all this awaits you in this amazing game. Underwater Hunting - that’s what it is!<br/><br/>Controls made easy:<br/>Simple and intuitive interface and controls - just tap and shoot! No need to fill your tackle box with gear to lure in the big ones! No need to find the right combination of tackle and retrieval motion of the reel to catch the biggest one. You don’t need a fishing hook either. Just tap to shoot. Defend yourself from shark attack!<br/>Unlimited underwater scuba fishing games free for kids! Fish all day without any timers or energy limits to restrict your gameplay<br/><br/>Many different real-life species:<br/>We’ve got most of the species! All in high quality 3D graphics. Salmon, shark, catfish - you name it - we’ve got it! Spear Fishing games free for kids as you want it!<br/><br/>Jaw-dropping 3D graphics:<br/>Interact with catches, collect the fishes in album!<br/>Perfectly recreated physics of a fish so you can feel the excitement at your fingertips!<br/><br/>Compete against friends in a multiplayer mode:<br/>Get the best score in the leaderboards. Collect achievements!<br/><br/>Get hooked with Scuba Sport Fishing Simulator: Spearfish. Experience the thrill of catching a variety of freshwater and ocean fish. Immerse yourself in beautiful 3D locations! Let’s fish now! Watch out of shark attack!<br/>If you want to relax with other games such as: crossbow hunting, sport archery, crossbow target shooting or just bowhunting simply click “see other games” and play for free!<br/><br/>Time for some real fishing games free for kids!<br/>Stunning 3D graphics<br/>World wide fishing locations", "metacritic": null, "released": "2016-09-24", "tba": false, "updated": "2019-10-22T14:35:47", "background_image": "https://media.rawg.io/media/screenshots/184/1840627f3e703f38e946b3e1f256d720_sJWdloA.jpg", "website": "http://tinydragonadventure.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiny Dragon Adventure Games Sp"], "genres": ["Simulation", "Sports"], "publishers": ["Tiny Dragon Adventure Games Sp"], "esrb_rating": null}