{"id": 297448, "slug": "motorbike2019s-new-race-game", "name": "Motorbike:2019’s New Race Game", "name_original": "Motorbike:2019’s New Race Game", "description": "Prepare yourself to experience the best motorbike gaming app. More than 35+ motorbikes with real sound engines, 10 different modes to play and 750 levels to complete. Invite your friends online to race them in Los Angeles, Moscow, Istanbul, and more.<br/> <br/>Start the engine, hit the gas and experience the thrill of handling a 400 km beast.<br/>Compete with professional racers. Take a variety of scenes and enjoy this real driving experience. But do not let your guard down, because you will be arrested !<br/><br/>Outstanding Motorbikes<br/>Diligent work on the models in an effort of presenting you most fabulous details on the Motorbike. The splendor of your Motorbike will stun the eyes. The ignition sound of engine will roar all over the map.<br/> <br/>Exceptional Maps<br/>Most exhilaratingly realistic maps in the game for you with three environments; Daylight, Sunset and Night in five popular cities; Los Angeles, Moscow, Istanbul, London and Paris.                <br/> <br/>Joyful Controls<br/>The Motorbikes are exciting &amp; Joyful to drive with smooth controls and examined movements to make you enjoy your game to the fullest.<br/> <br/>Numerous Challenges<br/>There are several challenges from Police chasing after you, collecting Cards in the highway, getting the goal Combo, reaching the racer you are following in Hunter, Overtake the cars in the highway, speeding up to finish the race in specific Time and Distance.<br/><br/><br/>Features : <br/>750+  Different levels<br/>35+ Realistic motorbikes with Real Sound Engine<br/>New Realistic Maps; Paris, Istanbul, Moscow, London and Los Angeles<br/>Different environment in Daylight, Sunset and Night<br/>First person camera<br/>Playing with friends<br/>10+ different missions<br/><br/><br/>Pick up your Bike and prepare for challenges. <br/>Download it now !!!!", "metacritic": null, "released": "2019-02-21", "tba": false, "updated": "2019-07-29T20:36:23", "background_image": "https://media.rawg.io/media/screenshots/b5e/b5e93dc6adbcf5efa5ba684e24e184a3_Wbpgx6k.jpg", "website": "http://www.wolvesinteractive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wolves Interactive"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["WOLVES INTERACTIVE BILISIM YAZILIM TICARET LIMITED SIRKETI"], "esrb_rating": null}