{"id": 297405, "slug": "my-blocky-horse-racing-animal-care-game-for-girls", "name": "My Blocky Horse Racing: Animal Care Game for Girls", "name_original": "My Blocky Horse Racing: Animal Care Game for Girls", "description": "My horse heaven &amp; girls craft game for boys and girls! Ride a horse, take care of it! Build your own racing track! Own a horse! Ride little pony or a blocky mustang! Care for your horse by grooming, feeding and treating it. Build a bond together in a wide range of interactive 3D activities.<br/>Have a virtual pet: Horse! Have fun and run horse run! Building, mining (miner game) and exploration lite! Sim girls craft game for girls with animals! Be a princess with horse! Become a supermodel girl owning a whole stud farm! Running game for girls, building game for boys, crafting game for kids! All in one app! <br/>Creative app for creative girls and boys! Build a horse heaven. World of horses needs exploration! Have a horse quest, have a virtual pet! Have fun at horse derby! Build own Zoo! Take care of animals! No unicorn or little pony! No dress up game for kids or princess make up games for little girls! Serious game for serious girls! This blocky / crossy game gives you opportunity to take care of virtual pet, make friends, build and explore. Use pixel blocks to craft and build your own horse world! Feel like in girls craft . Design home or whole world! Build a palace or whole city (city building game). Candy craft game with lots of sugar! Great game for girls of any age! Free horse simulator in a blocky world! Mine, explore and craft! Adventure game with cute animals! So take your girlfriend or boyfriend on a horse ride with “My Horse Racing: Girls Craft”<br/><br/><br/>FEATURES:<br/>3D interior models <br/>Sandbox world of cubes<br/>Rotating and saving<br/>Custom wallpapers for girls, carpets and furniture mod<br/>Exterior design home - gardens, pools, flowers, parks <br/>House planner<br/>Cute pink and colorful textures<br/>Coloring book and sketch book<br/><br/><br/>COMING SOON:<br/>Multiplayer Exploration Mode<br/>Block Craft 3D Mode<br/>Girls Craft Mode<br/>Princess Craft extension pack (Cute Castle Interior Design)<br/>My Own Horse - Story Mode<br/>Build Craft Exploration extension pack (custom houses + extra furniture)<br/>Enigma adventure mode<br/>Pixel texture pack<br/><br/><br/><br/><br/>SEE OUR OTHER GAMES like coloring book or archery games for boys and girls!<br/><br/><br/><br/><br/>Ride a horse of any kind! <br/>Build and create anything!<br/>Make friends with horses and ponies!", "metacritic": null, "released": "2016-12-10", "tba": false, "updated": "2019-10-22T14:35:47", "background_image": "https://media.rawg.io/media/screenshots/17a/17ae9a47373eee420e07c7be4d8fd035.jpg", "website": "http://tinydragonadventure.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Tiny Dragon Adventure Games Sp"], "genres": ["Adventure", "Simulation"], "publishers": ["Tiny Dragon Adventure Games Sp"], "esrb_rating": null}