{"id": 297555, "slug": "sweet-world-sugarland-cascade", "name": "Sweet World Sugarland Cascade", "name_original": "Sweet World Sugarland Cascade", "description": "Sweet World - Sugarland Cascade is a brand new game with cupcakes,cake,muffin and bonbons destined to all kids and young people out there.Once you see the amazing graphics and the gummy bear you will want to eat the little coke candies in the game!This is the sugar daddy of match 3 candy games and will keep you spellbound!Enjoy colorful levels and prepare to be amazed of the amazing journey in candyland and sugarland!The game contains ice cream,Lollipop,jelly beans,brownies,pancakes,donut,sandwich,licorice.This is a classic match-3 game featuring your favorite food: candy! The goal is, of course, to complete every level with the highest possible score. In order to complete a level, you need to match three or more pieces of crunchy candy together, making sure they're all of the same type and create a big cascade of gummies.<br/><br/>Swap the sweets or pralines and try to create big combinations so as to get power-ups in reward. Power-ups help you remove more  brownies and so they increase your final score. You can also acquire different boosters to help you out in each one of the levels.<br/><br/>The game includes several types of levels so you'll always get different objectives to achieve. Sometimes, you need to be fast, obtain certain candy types or reach a minimum score. Remember that you need at least 2 stars to progress to the next stage.<br/><br/>There are more than 100 levels, so getting bored is not a thing: you have plenty of gameplay ahead of you to enjoy.<br/><br/>Features:<br/>• Tasty and sweet candies, your little kids will love playing with the jellies and will blow their minds with awesome game effects!<br/>• Over 100+ breath taking levels with delicious waffles,chocolate bonbons,praline.<br/>• Lots of game goals, move mode, time mode, collect ingredients mode, etc.<br/>• Surreal graphics, you will want to eat the licorice,cotton candy,icing,pina colada in the sugarland!<br/>• Do your best, get the highest score and Outwit, outlast and outplay the sweeties!<br/>• Match colors in your free time and relax playing a super puzzle game!<br/><br/>• How to play <br/><br/>- Match and crush 3 candy or more to gain new points<br/>- Crush 4 candy in a line to create a special candy which sends waves of lightning!<br/>- Crush 5 candy in a line to create a multi-color blossom bomb which explodes other sweets in the game when combined and bursts lightning thunder bolts<br/>- Combine 2 special bonbon to blaze a big part of the candies!<br/>- Enjoy this Cake Saga and become a master of the cookies!", "metacritic": null, "released": "2016-02-26", "tba": false, "updated": "2019-10-22T14:35:56", "background_image": "https://media.rawg.io/media/screenshots/bd1/bd1875a7d22cc115260f810fe4646094_iqoPXnA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lapusanu Patriciu"], "genres": ["Board Games"], "publishers": ["Lapusanu Patriciu"], "esrb_rating": "Everyone 10+"}