{"id": 297585, "slug": "taboo-drinking-cards-game", "name": "Taboo - Drinking Cards Game", "name_original": "Taboo - Drinking Cards Game", "description": "Taboo is a drinking game of guessing. You put a phone on your head and your teammates explain the words to you, tilt the phone up for next card, and tilt the phone down if you guessed the word correctly. Created for students, bachelorettes and all the other party people that want to drink to start their night. <br/><br/>Taboo game can be played offline, without WiFi, and it consists of thousands of words you read to your friends. It's a perfect game against your sobriety.<br/><br/>We made this game because you and your friends are boring and you can’t come up with words that gets you drunk yourself.<br/><br/>-----! FEATURES !----- <br/><br/>-\t5000+ Cards <br/>-\t18 Packs <br/>-\tHours of guessing with your friends<br/>-\tFor 2 players minimum<br/>-\tHating your vocabulary, friends and humanity in the end<br/><br/>-----! HOW TO PLAY !-----<br/><br/>-\tChoose cards you want to play with<br/>-\tGuess the words<br/>-\tLoser team drinks.<br/><br/><br/>Taboo - Drinking Cards Game Premium subscription:<br/>- Gives user instant access to all existing and future cards and removes all ads.<br/>- Subscriptions are from $1.99 weekly*<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- You will be able to access everything for the duration of the subscription<br/>- Subscription automatically renews for the same price and duration period as the original package unless auto-renew is turned off at least 24-hours before the end of the current period<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package)<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase<br/>- No cancellation of the current subscription is allowed during active subscription period<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit https://support.apple.com/en-us/HT202039 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period<br/>- Please note: any unused portion of a free trial period (if offered) will be forfeited when you purchase a premium subscription during the free trial period.<br/><br/>Links to our Terms of Service and Privacy Policy can be found below<br/><br/>Privacy Policy: https://gamenight-games.com/privacy-policy/<br/>Terms of Use: https://gamenight-games.com/terms-of-use/<br/><br/>* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD", "metacritic": null, "released": "2019-02-20", "tba": false, "updated": "2019-07-29T14:55:44", "background_image": "https://media.rawg.io/media/screenshots/384/384ed74d2fbc3a648018f281e595a85e_SETsTu1.jpg", "website": "https://gamenight-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kristian Markovic"], "genres": ["Board Games", "Card"], "publishers": ["Kristian Markovic"], "esrb_rating": null}