{"id": 297671, "slug": "harvester-farming-simulator-18", "name": "Harvester Farming Simulator 18", "name_original": "Harvester Farming Simulator 18", "description": "Become a modern farmer in Farming Simulator 18! Immerse yourself in a huge open world and harvest many types of crops, take care of your livestock - cows, sheep, and pigs - take part in forestry, and sell your products on a dynamic market to expand your farm!<br/><br/><br/>Get ready to enjoy real farming profession inside farm fields where you will perform real life farmer tasks like ploughing land, sowing seeds, watering crops, harvest fields, driving tractor, attaching farming tools and farm machines to farm tractor, transporting wheat, hay barrels and farm animals to city for sales and marketing. Truck driving and tractor driving is real fun especially when it comes to take control of harvest tractor and ploughing the barren farm fields in the village.<br/><br/>Tractor Harvester Farm Transport Simulator brings you close to nature as a farmer in village. This amazing farm simulator 2018 has multiple tasks to perform as a real village farmer. Tractor driving, truck driving, truck transport to city carrying farm fertilizer to village via truck driving requires real driving and transportation skills.<br/><br/><br/>Harvester farming takes plenty of dedication to drive the harvester tractor simulator on the farm fields. Farmer become a tycoon farmer by investing farm fields and driving tractor all the time. They city market is always catchy to sell the crops so drive the harvester farming tractor and sell the crops to city.<br/>Features:<br/><br/><br/>•\tUse realistic tractors and trucks from some of the biggest agriculture machine makers<br/>•\tAmazing HD graphics effects with 3D animations!<br/>•\tTruck transportation of farm animals and crops!<br/>•\tAttach the trolley with tractor to start farming mission!<br/>•\tPlough land, sow seeds, water fields, harvest crops &amp; much more!<br/>•\tRealistic easy gameplay mode in village &amp; city environment!<br/>•\tBest transport tractor farm simulator controls!<br/>•\tVariety of transport simulator tractors!", "metacritic": null, "released": "2018-01-29", "tba": false, "updated": "2019-10-22T14:36:01", "background_image": "https://media.rawg.io/media/screenshots/517/5178ec94ce028cf9d2a91c4d3f8ee1d4_YGdlmIB.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sublime Games"], "genres": ["Strategy", "Simulation"], "publishers": ["TAPINATION"], "esrb_rating": null}