{"id": 297663, "slug": "robot-truck-bike-transform", "name": "Robot Truck - Bike Transform", "name_original": "Robot Truck - Bike Transform", "description": "Robot Transporter Truck is an action packed robot transporting game where you will be transporting robot in the city  by riding cars and transforming into superhero robots. Save the city from destructive enemy robots who are waging a war on the city peace. This robot transporting game has fighter robots and fast cars and you need to reach the transporting  truck scene in time and transport robot by defeat the criminals in a one-on-one battle.<br/><br/>You are playing the superhero in this robot transporting game. Once a criminal incident is reported, speed to the crime scene &amp; transform your car into a battle ready robot and fight the enemy robot with iron knuckles. You need to win the fight and make sure that the criminals are wiped off. The enemy robot is a really good fighter and you need to be on your best robot fighting mode to win that superhero battle. Make sure you fight and defeat all the criminals and win the war to restore peace in the city. The super robot machine that can transform from a car sounds futuristic and has a superhero aura about it. It is a battle ready mean machine and can be a real menace for criminals to face in the city battle field.<br/><br/>Play  Robot Transporting  Truck as a robot bike and as a car and be the superhero your city is looking for.<br/><br/>Features of Robot Wars:<br/>+ Numerous Robot Transport Missions<br/>+ Car driving experience<br/>+ Real Robot Bike Gameplay<br/>+ Multiple robots to play with<br/>+ Play as a car or robot<br/>+ Awesome 3D game graphics", "metacritic": null, "released": "2017-07-28", "tba": false, "updated": "2019-10-22T14:36:01", "background_image": "https://media.rawg.io/media/screenshots/3e9/3e95aa9137ecb1dfcd2cba60e7df96a7_lKMZsZd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sublime Games"], "genres": ["Racing"], "publishers": ["TAPINATION"], "esrb_rating": null}