{"id": 297642, "slug": "pretty-good-solitaire-mini", "name": "Pretty Good Solitaire Mini", "name_original": "Pretty Good Solitaire Mini", "description": "Pretty Good Solitaire is the premier solitaire game collection with 720 different solitaire card games (plus 70 bonus games, for a total of 790 games).<br/><br/>Since 1995, Pretty Good Solitaire has been the choice of millions of solitaire players at Goodsol.com!<br/><br/>Includes the popular games Klondike, FreeCell, Spider, Yukon, Scorpion, Pyramid, Cruel and more.<br/><br/>Also includes many games invented for Pretty Good Solitaire, such as Demons and Thieves and Aces and Kings.<br/><br/>Features:<br/><br/>- Easy to play: just drag the cards or tap them to move them quickly. <br/><br/>- Beautiful cards: designed to look like real cards but be easy to see.  Use the special large suit card set or choose one of our other regular card sets.<br/><br/>- Full Undo and Redo: undo any move or all your moves, and redo them.<br/><br/>- Automatic Game Saving: saves your games when you leave and you can continue playing when you return. <br/><br/>- AutoPlay/QuickMove: option can automatically play cards to the foundations for you.<br/><br/>- Dynamic Card Sizing: pinch to make the cards smaller or spread to make them bigger. It automatically adjusts card size for portrait or landscape. <br/><br/>- Tap and hold on a pile to get more information about what cards can be played there.<br/><br/>- Tap the game name button to do a new game, play the next game number, or see your statistics.<br/><br/>- Tap the Rules button to see the rules of each game.<br/><br/>- Over 2 billion starting positions for each game. Game numbers compatible with the Mac and iPad versions.<br/><br/>- Statistics for multiple players.<br/><br/>Pretty Good Solitaire is the solitaire game for players who take solitaire seriously!", "metacritic": null, "released": "2019-02-25", "tba": false, "updated": "2019-07-30T08:18:24", "background_image": "https://media.rawg.io/media/screenshots/720/720e573c7b7084a7cc1083950f4d0c61.jpg", "website": "http://www.goodsol.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Goodsol Development"], "genres": ["Card", "Puzzle"], "publishers": ["Goodsol Development"], "esrb_rating": null}