{"id": 297694, "slug": "lummy", "name": "Lummy", "name_original": "Lummy", "description": "Can you mimic a famous Youtuber or Instagrammer?<br/>If your answer is YES, Lummy is your game. <br/><br/>Now, Lift your head up and repeat ‘supercalifragilisticexpialidocious’ three times?<br/>Do you like it? We have more tasks for you, you have 60 seconds to show your performance, do your best dude.<br/>You can play LUMMY up to 7 friends at the same time.<br/>If you play LUMMY, you can SING, SCREAM, ACT, DANCE, SPANK, SPIN OR MIMIC with your friends.<br/>Do your best, beat all your friends and share videos on your social media accounts. Challenge them and show them who is the God of DANCE or ACT.<br/>It is really easy to play. Add your friends name, choose your task cards and record your performance. If you wish, you can share on Facebook, Instagram, Twitter, Whatsapp, Messenger etc. <br/>You just need any friend that’s it, you do not need any equipment or tool. <br/>Fun forever :)<br/><br/>TASKS<br/>Act like a person who accidentally tries to milk the bull instead of the cow<br/>Make a declaration of love to any famous person and propose.<br/>Let your friend tickle you for 10 seconds at a time, 3 times.<br/>Pretend, you speak another language which you don't know.<br/>Act like a coward, a psychopath and a womanizer, one at a time.<br/>Beatboxing time show your talent. <br/>Look at the video camera like a totally confused idiot.<br/>Send 25 messages to a single friend of yours. Send a different word for each message.<br/>Shout like a goat.<br/>Lie on the floor and jump like a fish out of water<br/>Take a deep breath and sing any song without taking another breath<br/>Perform the solo haka dance", "metacritic": null, "released": "2019-02-24", "tba": false, "updated": "2019-10-22T14:36:03", "background_image": "https://media.rawg.io/media/screenshots/43d/43d71f4bca1b084d5e9b36b89af4c521_9bssLmn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Devil Delight"], "genres": ["RPG"], "publishers": ["Devil Delight Entertainment"], "esrb_rating": "Everyone 10+"}