{"id": 297692, "slug": "chain-cars-impossible-racing", "name": "Chain Cars - Impossible Racing", "name_original": "Chain Cars - Impossible Racing", "description": "Welcome to extreme car stunts mania where you need to drive chained cars on highway avoiding hurdles where impossible driving may break off moto chains. We have staged special chained cars against ramp, chained cars 3D, chained cars against bollard in Chained Cars Impossible Driving Simulator. Two car will be attached together with chain in between the impossible track and you will be on impossible stunt drive racing. The driver has to carefully chained cars such as it does not break chain in Chained Cars Impossible Driving Simulator. Xtreme coach, chained cars, chained cars against ramp, chained cars bollard, stunt car will perform some biggest tricky stunt and tricky race in this main event show Chained Cars Impossible Driving Simulator. Come over to grand show Chained Cars Impossible Driving Simulator in this crazy car racing stunt mania! The world best driver will drive chained cars in mad city to do tricky stunt and tricky race. In between the chained cars there will be hurdles that driver has to tackle with his extreme racing break off impossible driving tricky stunt skills.<br/><br/>Are you that dare devil to drive the chained cars against ramp, chained cars against bollard, chained cars 3D within mad city to perform the tricky race, tricky stunt and extreme racing on highway avoiding hurdles. If yes, give me a hell yeah! You are capable of doing anything in Chained Cars Highway Racing Stunts Driver. There are many routes of car driving in this chained cars extreme racing stunts simulator. Like truck chained with car, chained car against truck, chained car against xtreme coach, chained car against jeep. The xtreme coach chained with cars become difficult to control and break chain can break off easily. <br/><br/>Go in the show and show your full potential by doing tricky race, tricky stunt in the mad city show Chained Cars Impossible Driving Simulator. This impossible crazy stunt driving challenge game is a milestone in the category of the different model of the real highway motorcycle driver. There are a lot of extreme car, moto racing, extreme racing, and tricky stunt driver in Chained Cars Impossible Racing Stunts Driver game. Break off the adrenaline rush in your passion and go unleash the beast with in you in Chained Cars Impossible Driving Simulator. No balance in between can break chain and break off the driver spirit. Driver have anxiously waited for that moment for whole year. They have practiced car stunts, tricky stunt, and tricky race in their home town and now are ready to participate in this mega event Chained Cars Impossible Driving Simulator. Let’s get ready to rumble!<br/><br/>Features:<br/>•\tExtreme chained car driving challenge!<br/>•\tDon’t break off the chain in impossible driving!<br/>•\tShow real car stunts without breaking chain!<br/>•\tExtra ordinary 3D graphics!<br/>•\tDrive in offroad and city environment!", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-10-22T14:36:03", "background_image": "https://media.rawg.io/media/screenshots/ba0/ba00b04990225bfc37e47301b59ec20e_nsl0oKO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sublime Games"], "genres": ["Adventure", "Racing"], "publishers": ["TAPINATION"], "esrb_rating": null}