{"id": 297714, "slug": "monster-dinosaur-epic-driving", "name": "Monster Dinosaur- Epic Driving", "name_original": "Monster Dinosaur- Epic Driving", "description": "Attention! All animal simulator gamers, a NEW dino fun animal offroad transport game has arrived. Welcome to dinosaur safari zoo land where you would have to drive truck offroad and fly chopper at safari land. A business tycoon came up with idea of genetically cloning extinct monster dinosaur and to start a dinosaur offroad safari but now problem is how to transport them from their cages to safari in an offroad land. The safari park management has come up with two real options, First truck transport and secondly chopper transport. So you being OffRoad Dinosaur Truck Transporter Driver and chopper pilot would have to carry out this animal transport duty at safari destination.<br/><br/>Offroad Dinosaur Truck Driving &amp; Parking Simulator game is one of its kind in which you can drive the transporter trucks and can move the monster dinosaurs with easy gameplay features. Being OffRoad Dinosaur Truck Transporter Driver, your responsibility is to move the animal truck and pick dinosaurs from the locations and have to take it to the end location on offroad. Enjoy the animal Wildlife of these wild animals in the park. The distinctive feature regarding that wildlife dinosaur transporter game includes that flying chopper will also lift the cage of dinosaur to fly dino in their destination point. Unlike other animal transportation games, this Offroad Dinosaur Truck Driving &amp; Parking Simulator gameplay is different because other ones are only confined to monster truck transportation. <br/><br/><br/>Features:<br/>+ Bring all Monster Dinosaur creatures to Zoo.<br/>+ Real 3D Safari jungle Zoo environment and stunning graphics. <br/>+ Physics based realistic simulation game.<br/>+ Chopper and truck transportation vehicles <br/>+ Time deadline for each dino transport simulator mission<br/>+ Different kinds dinosaur creatures to transport<br/>+ Extremely smooth gameplay and amazing driving experience.<br/>+ Changing camera view, speedometer and map.", "metacritic": null, "released": "2017-10-06", "tba": false, "updated": "2019-10-22T14:36:04", "background_image": "https://media.rawg.io/media/screenshots/dad/dad86fb589ace15a225d81233f582cab_w1CqsKo.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sublime Games"], "genres": ["Adventure", "Simulation"], "publishers": ["TAPINATION"], "esrb_rating": null}