{"id": 297706, "slug": "jetpack-robot-game", "name": "Jetpack Robot Game", "name_original": "Jetpack Robot Game", "description": "Jetpack Robot Game is the best free robot endless run and jump game ever!<br/><br/>JetPack Robot Game is the most energetic addictive cerebrum jumping game ever! This diversion will give you a chance to think ahead before you make any bounce while playing this endless run and jump game. <br/><br/>Play the most exciting futuristic run game on App Store. Make your robot run throughout the day in amazing environmental game play! Take control of your robot and avoid hitting all enemies that are trying to kill you. This awesome game combines natural run simulator and fast paced action with an awesome and exciting environment, making up a fantastic and one of the best games in arcade category of App Store!<br/><br/>One of the Best Free Fast Endless run games only for you. Start with the robot which can flow free in the game play to reach your destination. Dash as far as you can and avoid your enemies to go to the exciting locations in the game play. Collect all the coins to score the highest possible score and be the Super Hero inside our game. The game is filled with Jetpack and a fast racing robot simulator, which will drive you crazy. Dash towards your destination, it’s one of the flow free running game, earn coins on the way to reach your ultimate goal and dash to make better score. If you are really interested to have a great score, just make it run faster and cover more distance than your friends. Don't forget to collect power-ups and coins.<br/><br/>The power-ups that we have inside our game can protect the robot for 5 seconds when you hit the enemy. There is also some other awesome power-ups to let you fly faster and get more points!<br/><br/>Play and challenge your friends by sharing this game with them. Dodge the enemies on the way to score higher than all your friends. <br/><br/>Are you ready to take up the challenge for fast running robot? Do you think that you and your robot can fly like a wind and avoid all enemies? If your answer is yes, then be ready to face difficult challenges ahead and enjoy the awesome graphics and environment. Good Luck!<br/><br/>• How to Play?<br/>1. First, you need to download our game from App Store and install it on your iPhone or iPad for Free!<br/><br/>2. Once you launch the game on your iPhone, you can tap the screen to start it. Then you will be able to see a robot in a realistic and amazing environment. The robot will start running automatically, but remember that you need to control it.<br/><br/>3. To make a jump with the robot, you need easily to tap the screen and the robot will make a jump. <br/><br/>4. Along your way with the robot, you will find many enemies that are trying to kill you. You should not hit any one of them or you will lose. They will try to not let you reach your goal, but you need to avoid them.<br/><br/>5. You need to collect coins in your way and also some Power-ups. The power-ups that we have inside our game can protect the robot for 5 seconds when you hit the enemy. There is also some other awesome power-ups to let you fly faster and get more points!<br/> <br/>Why you need to download and install Jetpack Robot Game instead of other running and flying games?<br/><br/>Nice:<br/>√ The game has been selected to give the best user experience and make it an addictive game.<br/><br/>√ Nice interface.<br/><br/>√ Endless.<br/><br/><br/>Free :<br/>√ Our game game is FREE and it will stay Free for life, so there is No hidden fees, no special members and no annual subscription fees to enjoy the best free futuristic endless run game ever!<br/><br/>Challenging:<br/>√ This game is for intelligent people who want to challenge their brain playing a fun game.<br/><br/>√ The game will become harder as your progress on it. And, since the enemies are generated randomly, on occasion you might not be able to complete it in the right way on the first try. <br/><br/>For Anyone:<br/>√ Jetpack Robot game is a free running and jumping game and it can be played by Adults and Teens. Your whole family can play it! <br/><br/>What are you waiting for ? Download our game Now and Enjoy playing the best Angry Ninja Monster run game ever!", "metacritic": null, "released": "2016-06-06", "tba": false, "updated": "2019-10-22T14:36:04", "background_image": "https://media.rawg.io/media/screenshots/d3d/d3d941de3b7ab1464a93289de48d5169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CANAAN JOHN"], "genres": ["Adventure", "Arcade"], "publishers": ["CANAAN JOHN"], "esrb_rating": "Everyone 10+"}