{"id": 297749, "slug": "army-robot-transform-war-3d", "name": "Army Robot Transform War 3D", "name_original": "Army Robot Transform War 3D", "description": "It's a time of war, pilot! Are you ready for surprise attacks, intricate tactical maneuvers and the many sneaky tricks your rivals have in store for you? <br/><br/>The future is here and robots are fighting wars as part of the US army. Futuristic Robot Transformation: US Army Transform is a new futuristic simulator and robot transformation game where the futuristic robots are part of the US army and fighting the war alongside the US army. As with each army unit, robots also need to be transported from the army robot base to different army robot units or to the front line. Army drivers are ready to drive in difficult terrains like hilly areas or off road tracks and they are also trained to drive army trucks in city. <br/><br/>Robot transportation is a lot different from your average city transportation as the robots are huge and they need to be transported with care on the army truck. The robots can also transform into cars and chase the opponent. You have to fight the enemy robot and fend off the robot attack on the city. Transformation of a robot has always been a fantasy of ours and Futuristic Robot Transformation: US Army Transport will let you give a chance to do that.<br/><br/>Destroy enemy robots, capture all the beacons, and upgrade your weapons to increase combat strength, speed, and durability of your battle robot. Prove yourself in each map and use different strategies and tactics to emerge victorious from battle!<br/><br/>MAIN FEATURES:<br/>– Many Army battle robots with different strengths;<br/>– Different weapon types, including ballistic missiles, energy and plasma guns. What will you choose?<br/>– many possible combinations of robots and weapons.<br/>– complete military tasks.", "metacritic": null, "released": "2019-02-02", "tba": false, "updated": "2019-10-22T14:36:06", "background_image": "https://media.rawg.io/media/screenshots/60a/60a10cfedd945c8bd8875fd5f51eef37_56Ck2DG.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sublime Games"], "genres": ["Action", "Racing"], "publishers": ["TAPINATION"], "esrb_rating": null}