{"id": 297702, "slug": "off-road-bike-dirt-drag-race", "name": "Off-road Bike - Dirt Drag Race", "name_original": "Off-road Bike - Dirt Drag Race", "description": "Offroad Crazy Bike Racing Game is an exciting &amp; wicked awesome game where you get to become a motogp bike racer on offroad and hill tracks. The exhilarating speed and extreme racing conditions on a cross country trail track will leave you filled with adrenaline. Bike racing and drifting on hill and offroad tracks is always a dangerous albeit exciting experience. The mid-air ramps and hurdles will make this nitro trail ride all the more fun. Cross country racing is never easy and you need extreme skills to manoeuvre your way through. We are sure that you will love this action packed bike simulator. It is a race against time and you are your own rival when it comes to improving your time.<br/><br/>Play with extreme caution as the hurdles can be tough to negotiate when you are going on top speed while riding your bike. You will feel like a drift racer going through all the ups and downs of a hilly &amp; offroad landscape. The drift and drag of a speeding bike are exciting. Biking away and performing bike stunts on the mid-air ramps is not a challenge to be taken lightly. <br/><br/>If you like racing games or have ever dreamt about becoming an offroad racer and win a race, then Offroad Crazy Bike Racing Game is a perfect fit for you.<br/><br/>We hope you enjoy the game.", "metacritic": null, "released": "2017-10-27", "tba": false, "updated": "2019-10-22T14:36:03", "background_image": "https://media.rawg.io/media/screenshots/d54/d542b719c2fb616cd0a787de7ec568fc_p4sCQr9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sublime Games"], "genres": ["Adventure", "Racing"], "publishers": ["TAPINATION"], "esrb_rating": null}