{"id": 297846, "slug": "kingdom-shell-official-demo", "name": "Kingdom shell official demo", "name_original": "Kingdom shell official demo", "description": "<p>Kingdom shell is a pixel art metroidvania. It's a cold fairytale of injusice, betrayal and retribution.<br/>Help half-demon Elias stop the threat looming over the Kingdom and atone for his sins.</p>\n\n<p>The shell that protected the Kingdom was broken. Sovereigns succumbed to the temptation of filth, poured from the nightmare realm and lead the Kingdom to decline. Nightmare creauteres terrorize the civilians.</p>\n\n<p>The Brotherhood, which has stood guard the Kingdom for centuries, does not cope with the threat. They are compelled to ask for help from the criminal. Elias the half-blood, in whose veins the blood of the demon flows, may be the only hope of the Kingdom.</p>\n\n<p>Kingdom shell is a game I'm working on alone. My goal is to make a metroidvania with an interesting story.</p>\n<p>When creating the game, I was inspired by the games Rygar and Castlevania on NES and Momodora on PC, but my game will be independent.<br/></p>\n<p><strong>The game features:</strong></p>\n<ul><li>Original fantasy story</li><li>Late 80's style graphics</li><li>Metroidvania elements: various secondary weapons, equipable items, power ups</li><li>Secret places</li></ul>\n<p>Music in trailer: \"Five Armies\" Kevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0 License</p>\n<p>http://creativecommons.org/licenses/by/3.0/\r\n</p>", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2019-08-28T23:17:46", "background_image": "https://media.rawg.io/media/screenshots/0ac/0ac46d081c969b5096c89548928e74c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cup_of_pixels"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}