{"id": 297860, "slug": "forknite", "name": "Forknite", "name_original": "Forknite", "description": "<p>Intro:</p>\n<p>Manipulation with a forklift in an industrial environment. Transporting the packages to the exact layout of the location at a certain time (as short time as possible).Locations are shipping containers or  dock shelters etc.</p>\n\n<p>Plot:</p>\n<p>The story begins in an industrial enclosure where color packages are created and each package is to be taken or transported to an exact location marked with the color of that package (color on the color). Then, after the package is transported, the player wins the points. In the next level, that same operation takes place in a closed hangar.\r\n  </p>\n<p> </p>\n<p>Gameplay:</p>\n<p>Simple simulation from a two-position of camera view that can be changed with the V key on the keyboard - for the view. Then, collecting red, blue and green packages by clicking on the mouse button and  moving to the marked red / blue / green positions. For each correctly transmitted package the player is rewarded with 50 points for green, 100 points for red and 200 points for blue package. if the player places the package on a different color marked position he will be destimulated with negative 30 points. The playing time is limited by the timer and is about 5 minutes per level.\r\n  </p>\n<p> \r\n  </p>\n<p>Platforms:\r\n  </p>\n<p>This 3D game or project is made in the unity game engine exclusively for the PC platform now, but if it shows interest and  continues to develop in the future it may come out on other platforms like Android, iOS, PS2 etc. \r\n  </p>\n<p> \r\n  </p>\n<p>Target audience:\r\n  </p>\n<p>The target group of people for this game will be  mostly serious non demanding people who dont look for level details and are not obsessed with advanced game graphics. It is also intended to the youngest generation to develop memory and motor skills.</p>\n<p>Game will be free for download on https://itch.io</p>\n<p> \r\n  </p>\n<p> Control Scheme and UI:</p>\n<p> The controls are very simple. Four buttons will be designated to move the vehicle (forklift).Keyboard key 'W'  to move forwards, key 'S' for back ,'A' to turn left and 'D' for the right. Click on the mouse and hold mouse button down raises the package from the floor if the forks are near the package then releasing the package by releasing the left mouse button.</p>\n<p> The score for package transported is determined in the upper left corner, and the timer that counts minutes and seconds are in the middle at the top of the screen.</p>", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2019-03-01T04:56:29", "background_image": "https://media.rawg.io/media/screenshots/30d/30d3f09210efae8667f55110e83a24c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Josyp"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}