{"id": 297850, "slug": "crimson-mist-mansion", "name": "Crimson Mist Mansion", "name_original": "Crimson Mist Mansion", "description": "<em>You are Jared. A prominent pupil of the mage guild in the capital, whose objective is to figure out what’s been going on at a mansion outside the capital. You see the grand building, large and majestic. You stand in awe. The ground however seems dark and dead. You think nothing of it and head inside.</em>\n<p>Crimson Mist Mansion is an unforgiving 2D platformer. You as the player will find yourself thrown into the middle of a twisted story of a desperate man, told through the scattered notes from his diary that you recover while investigating the mansion. </p>\n\n<p>The game features a very limited line of sight, fireballs and permadeath, maliciously positioned enemies, hidden rooms and up to four different endings depending on how many pieces of the puzzle you manage to uncover. </p>\n<p>Most of the assets in this game has been found either released in the public domain or with a Creative Commons license. All of these are backlinked below except for the assets we have generated internally. This game was developed as our first semester trial project at Dania Games, where we are currently studying for a degree in Computer Science. </p>\n<p><strong>Controls</strong></p>\n<p>This game is meant to be played with a controller, and has been designed for the PlayStation controller. We have however included Keyboard bindings as an alternative.</p>\n\n<strong>Action</strong><strong>Keyboard</strong><strong>PS Controller</strong><em>Movement</em>Arrow keys / ADLeft analogue stick<em>Jump</em>Up Arrow / SpacebarX-button<em>Shoot</em>C keyO-button<em>Start game</em>EnterStart<em>Retry</em>R keyTriangle-button\r\n<p>Freely available assets used in this project</p>\n<p>Fireball Sound - Using a modified version<br/>Caves of Gallet<br/>Skeleton Sprite Pack<br/>Brick Tiles<br/>Bookcase<br/>Paper Notes 1<br/>Paper Notes 2<br/>Tutorial Book<br/>Easter Egg Music</p>", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2019-08-28T23:17:46", "background_image": "https://media.rawg.io/media/screenshots/bda/bda855fb868cede3fe5dba58dd4f3be1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cavaleri", "KlarCola", "Streeco", "Constrak"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}