{"id": 297982, "slug": "heartbeat-analisse", "name": "Heartbeat (Analisse)", "name_original": "Heartbeat (Analisse)", "description": "<p><strong>Controls:</strong></p>\n<p><em><strong>W/A/S/D</strong></em> to move and <em><strong>MOUSE</strong></em> to look around.</p>\n<p>---------------------------------------------------------------</p>\n<p>We wanted to create an experience that didn’t involve traveling through the wilderness. And although we were inspired by Firewatch, we wanted to build an environment that was familiar, yet disconnected. The story follows an ordinary office worker named Greg. While working in his cubicle, thinking about the last conversation with his wife, Margaret, he gets caught in an explosion. After this, the player is sent into a dreamscape, in which they escape from with the encouraging voices of his lover. Greg wakes up from the coma, representing by the exiting of the dreamscape, seeing Margaret the hospital bed he awoke in. Our team comprised of Analisse, Fu and Michelle. In respective order, mainly doing asset modeling, audio, and mapping along with the narrative. And of course, we all dabbled in code, helping each other out occasionally. \r\n</p>\n<p>We had planned a lot for this game, which led the eventual “killing your baby”, as we couldn't make create that idea with the allotted time. Still, we had plenty of successes. For starters, the game was a good review for all us and a great way to learn new ways to code, which Michelle in particular, is very proud of as she worked on the lights in the maze. Secondly, we really got our narrative through, something we were striving to achieve, especially with Margaret being the one leading the player throughout the maze. Thirdly, Analisse brought the office to life with her assets from Maya and, I quote, “was a really good refresher ‘cos I forgot everything.” Fourthly, Fu gained experience editing audio clips on Adobe Audition, which surprisingly required lots of editing despite being short clips, but that's what made it all the more important. </p>", "metacritic": null, "released": "2019-02-27", "tba": false, "updated": "2019-03-01T05:14:14", "background_image": "https://media.rawg.io/media/screenshots/0a6/0a68ec0a656fdc4aa01e43a42fffdac3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Analisse"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}