{"id": 298106, "slug": "paintings-visager", "name": "Paintings (Visager)", "name_original": "Paintings (Visager)", "description": "<p><em><strong>Paintings  --  a tiny memory</strong></em></p>\n<p><em>\"Which one is mine and which was your grandfather's?\"\r\n</em></p>\n<p><em>My grandma stood beside me wearing playful smile as we looked at the two paintings together.</em></p>\n<p><em>One, dreamlike, soft, impressionistic. A woman in a gauzy dress.</em></p>\n<p><em>The other a muddy, moody, mess of figures scattered around a dingy bar.</em></p>\n<p><em>I pointed at one. \"That's his.\" </em></p>\n<p><em>She nodded approvingly. \"Yes. I love these ugly things.\"</em></p>\n<p><em>She looked at me and smiled again. \"Your grandfather and I were really different.\"</em></p>\n<p>- - - - - - - -<br/></p>\n<p><em>Paintings </em>was originally supposed to be released as part of the Meditations project led by Rami Ismail.  I withdrew <em>Paintings </em>from that project at the beginning of January because I fundamentally disagree with the way the project is/was run.<br/><br/>I hashed my thoughts out over several emails with Rami, and at the end of the day still feel like there were key issues with the way Meditations is set up that stop it from meeting my standards for the ways I believe equitable collaborations should be run. These were my concerns:</p>\n<ul><li><p>300+ devs made unpaid work for a project that mostly funnels credit and creative capital to Rami. Despite artists being asked to cap their work at 6 hours, this totals almost 2000 hours of unpaid labor on the artist side alone. I know numerous devs who made their meditations games while being financially strapped, and for those devs, even a token $20 payment could have been really impactful.</p></li><li><p>No one was told upfront how their work would actually be implemented or credited, or how they could reuse or repost their work . This created issues that were flagged after the launch, with none of the 300+ artists being credited in any way on the Meditations site initially. Additionally, artist were not told up front that their work would be used for multiple years.</p></li><li><p>Lastly, no contracts were signed.  And despite being told thousands of times by everyone I look up to in games to always work with a contract, artists were not offered an opportunity to contract their involvement. I believe seeking to contract the work would have flagged most of the above issues well in advance of the launch.</p></li></ul>\n<p>The reason I initially agreed to make a game for Meditations was because I got excited about the exposure it could bring, and I feel like this exposure was something that was implicitly promised to all artists getting involved. I regret getting swept up in that now, especially when I and we have so many conversations across the industry about valuing our work. <br/><br/>I think it's unethical for someone at the top of our industry to put emerging devs in the position of being asked to do free labor.  I think all too often requests for free labor benefit the person asking for it much more than the person giving it, and from my perspective that is the case here with Meditations too.<br/><br/>From conversations I've had with other folx, a number of people dropped out of the project when I did, and there are more still who feel uneasy about their involvement, but don't feel like they can afford to drop out because they've already done the work, and they think the exposure will be helpful to their careers. <br/><br/>I hope we continue to challenge each other to value our work more strongly in the face of so many external pressures that ask us otherwise. </p>\n<p>Thanks for reading all this way.</p>\n<p>Josie &lt;3</p>\n<p>- - - - - - -</p>\n<p>made using increpare's flickgame tool: https://www.flickgame.org/</p>\n<p>music and art by Josie Brechner</p>", "metacritic": null, "released": "2019-02-26", "tba": false, "updated": "2019-08-28T23:17:45", "background_image": "https://media.rawg.io/media/screenshots/648/648f8513487cd15bf915690da1e74faa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Visager"], "genres": [], "publishers": [], "esrb_rating": null}