{"id": 298325, "slug": "dumb-drunk", "name": "Dumb & Drunk", "name_original": "Dumb & Drunk", "description": "<p>While built on the classic party game trademarks such as multiplayer, fast pace and colorful graphics, the game adds new features to make it more compiling:</p>\n<ul><li>Absurd controls- The players are completely drunk and confused, and the game controls reflect it: they are pretty simple yet really hard to pull of. Each button controls a single player limb independently one form the other, rotate the arm, push things aside, stretch a leg to make a step. Moreover they change at the beginning of every game and during a game too, making it impossible to train any muscular memory.</li><li>Funny obstacles- Plenty of procedurally created obstacles will slow you down, on purpose or not, making the epic journey back home even harder and never boring. Will you be able to dodge them?</li><li>Keep an eye on the bars- Two bars show your current status: the balance bar will warn you if you are about to fall: lean on something or try to get your balance again, the nausea bar will tell you how wasted you are: walk steady and take a breath here and there.</li><li>Unique environments- Play in different cities, extremely stereotyped and each with their unique environment and obstacles, a mime will try to slow you down in Paris, a street performer dressed as the Statue of Liberty will bother you in New York and more!</li><li>Cooperate (or not?)- The players must help each other to get to your building gate as you and your friend have a key and both of them are required to open the gate, but then fight for the only bed so you don’t have to sleep on the hard and cold floor.</li><li>Artistic view- Cartoonic style graphic: big heads and short limbs, colorful textures and funny graphic effects take the players in the right mood to have fun, psychedelic and fast paced music with hilarious audio effects will make the game even funnier!</li><li>Dumb &amp; Drunk is a funny and hilarious yet frustrating party game that will keep you and your friends glued to the screen, game after game, each with different environments and obstacles!</li></ul>", "metacritic": null, "released": "2019-02-25", "tba": false, "updated": "2019-03-01T06:05:58", "background_image": "https://media.rawg.io/media/screenshots/f26/f26ef3744032d63ef0cdb44222ebaed6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["POLIMI Game Collective"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}