{"id": 298355, "slug": "risky-wings-demo", "name": "Risky Wings (DEMO)", "name_original": "Risky Wings (DEMO)", "description": "<p><strong>Risky Wings</strong> is intense flying game where you score points by flying risky.<br/></p>\n<p>The closer (and longer) you fly to the obstacles the more points you get.</p>\n<p>Your movement costs energy, and bumping into things costs even more. Keep an eye on your energy-level, because <em>out of energy</em> means <em>GAME OVER</em>.</p>\n<p>Levels are procedurally generated, so they're never exactly the same. Memorizing won't help (much), you need to learn to react to situation at hand and make best choice, really fast. A single mistake (probably) won't kill you, but two mistakes in the row will be fatal.</p>\n<p>Chose how competitive or meditative your flight will be :</p>\n<ul><li>arcade — find all required rune-keys to unlock portal to the next world</li><li>challenge — play single world for highest score combo-chain (ranked on leaderboard)</li><li>dark flight (not available in demo) — survive to the end in (almost) complete darkness (ranked on leaderboard)</li><li>zone (not available in demo) — never-ending zone where only way to restore energy is to score points (ranked on leaderboard)</li><li>zen — no scoring, no damage, just flight of fun and relaxation</li></ul>\n<p>Score for every flight earns you some experience points, and each level-up gives one upgrade-point. Those upgrade-points can be spent for number of upgrades and unlockable moves (horizontal and vertical dodge, air-brakes etc).</p>", "metacritic": null, "released": "2019-02-25", "tba": false, "updated": "2019-03-01T06:10:57", "background_image": "https://media.rawg.io/media/screenshots/d8e/d8edbe058be397ce9bbbee7b48d99c4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BLK Dragon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}