{"id": 298460, "slug": "real-celebrity-slots", "name": "Real Celebrity Slots", "name_original": "Real Celebrity Slots", "description": "Welcome to Real Celebrity Slots!, the best new free casino slot game featuring world famous celebrities! <br/><br/>Spin slots and test your luck, your favorite MARIAH CAREY and BRITNEY SPEARS casino slot machines are here! Real Celebrity Slots! is sure to pack lots of WINS with the best VEGAS experience on mobile! Play for FREE, earn complimentary COINS daily, and SPIN the wheel every day for EPIC wins!<br/> <br/>MARIAH CAREY comes to Real Celebrity Slots!<br/><br/>- Play beautiful slot machine games featuring some of the best MARIAH CAREY hit songs including \"Fantasy,\" \"We Belong Together,\" \"All I Want for Christmas is You,\" and more, with themes inspired by MARIAH’s top music videos!<br/><br/>Join BRITNEY SPEARS on a unique adventure!<br/> <br/>- Play rewarding slot machine games as you listen to your favorite BRITNEY SPEARS songs including “Womanizer,” “Crazy,” “Baby One More Time,” and more, with themes inspired by BRITNEY’s iconic music videos!<br/><br/>Take a trip down the heart of Vegas and the more you spin, the more you win!<br/><br/>- Unlock levels and discover quests, while exploring NEW WORLDS!<br/>- Collect thousands of FREE COINS daily just by logging in!<br/>- Breathtaking slot machine games with BONUS ROUNDS, BIG WINS and enormous JACKPOTS!<br/>- Daily Wheel SPINS with opportunity to win millions in coins!<br/>- Earn free spins for more WINS!<br/>- Compete with others in Tournaments and special events!<br/><br/>Connect to Facebook for more fun!<br/><br/>- Send and receive gifts with friends, and compare winnings on Leaderboards!<br/>- Sync your gameplay across devices so you don’t lose any progress!<br/> <br/>Keep an eye out for more celebrities, COMING SOON! Download Real Celebrity Slots! and start playing like a superstar!<br/><br/>PLEASE NOTE: <br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account.  You can disable in-app purchasing by adjusting your device settings.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game permits users to interact with one another (eg. chat rooms, player to player chat, messaging). Linking to social networking sites are not intended for persons under age 13.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at:  www.Glu.com/privacy<br/>- If you have a problem with this game, please contact us at: www.Glu.com/support", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2019-10-22T14:36:07", "background_image": "https://media.rawg.io/media/screenshots/3be/3be942314296a39524938c96c4ea1d5a.jpg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glu Games"], "genres": ["Adventure"], "publishers": ["Glu Games"], "esrb_rating": "Teen"}