{"id": 298445, "slug": "ufogen", "name": "UFOGEN", "name_original": "UFOGEN", "description": "UFOs have penetrated our solar system and are not at all friendly. Go to the defensive mission and destroy all enemy Ufo units. Fight in the universe, on the surface of the planets and also in the wormhole. Do not forget to save the other pilots of the destroyed aircraft and get extra power as a bonus.<br/><br/>Venus mission<br/> <br/> ... the surface of this planet is covered by clouds of poisonous gases. Storms and lightnings can not threaten you, but watch out for the high rock protrusions. Destroy all enemy Ufo units.<br/><br/>Mars mission<br/><br/> ... there is a massive volcanic activity on this planet. Clouds of smoke and dust reduce visibility. Meteorites are falling to the surface of the planet. Some of them can destroy the Ufo unit.<br/><br/>Uranus mission<br/> <br/> ... a cold planet full of pointed crystalline rocks. Clouds of poisonous gases reduce visibility. Stay at a greater height, but watch out for the meteorites. Destroy all enemy Ufo units.<br/><br/>Earth mission<br/> <br/> ... enemies are approaching and there is panic on the world. The Land Army shoots rockets to the Ufo units. Join the battle and destroy the enemy. Watch out for the protrusions of the mountains and satellites in the orbit.<br/><br/>Control the game with the arrow keys on the keyboard and the space bar or gamepad. Find a planet or a wormhole and press Enter or the left bottom button of the gamepad. Leave the planet or game by pressing Escape or the left top button of the gamepad.<br/><br/>Good luck", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:58", "background_image": "https://media.rawg.io/media/screenshots/1ee/1ee7448ae0e429978562a5ca6566930e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vladimir Pokora"], "genres": ["Action", "Adventure", "Simulation", "Casual"], "publishers": ["Vladimir Pokora"], "esrb_rating": null}