{"id": 298536, "slug": "classic-brick-gameunable-to-rotate", "name": "Classic Brick Game:Unable to Rotate", "name_original": "Classic Brick Game:Unable to Rotate", "description": "To hand the residual people, racing game and test the reaction force is his fingers are all thumbs. Which do not spell hand speed,eliminate time regardless of the physical strength ,arises at the historic moment. It is known as the most creative in the history of the game, use your strongest brain, simple and crude refreshes the highest score!<br/>First the game, if you have a feeling of seem to have met before? It is like, like the draughts of childhood. But both in connotation and effect, hex shellacking draughts N street! Perfect on the basis of both classic and upgrade to hexagon, square will eliminate schema evolution more ones. \"Look at an empty, put down\" is the hard truth hex game. Picture is pure and fresh bright beautiful, wonderful effect. Not only that, but can also be game scores to Weibo, let your friend heart hot!<br/>Hex game description:<br/>Main interface is a large hexagon chess game, players drag random hexagon combination in large hexagonal space, create and remove the complete one or more lines of lines, and eliminated by combo to get higher scores. When the board can no longer be put under any combination of a hexagon, will be GAME OVER.<br/>Hex opened three directions: horizontal, oblique, right, left can eliminate the precedent. No time limit, the play more freedom and more challenging. Want to get high marks, quickly take out you of the infinite spirit!<br/>- dynamic music + 3D effects, add hex resistance to play<br/>- many props help you won high marks, double the fun<br/>- share function let you with friend bask in scoring, together become a hexagon's got talent!", "metacritic": null, "released": "2016-09-09", "tba": false, "updated": "2019-10-22T14:36:11", "background_image": "https://media.rawg.io/media/screenshots/712/71285c08f25ef452d5c78dd300df79dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MaxApp Co"], "genres": ["Arcade"], "publishers": ["MaxApp Co"], "esrb_rating": "Everyone 10+"}