{"id": 298524, "slug": "castle-battle-new-td-game", "name": "Castle Battle - New TD Game", "name_original": "Castle Battle - New TD Game", "description": "Challenge new Brain and Strategy TD game: Castle Battle, fight your battle now!<br/><br/>the castle of Elester was attacked and occupied by unknown magical creatures! The castle is in chaos every corner! <br/><br/>You are named the king of the castle. Duty of  defend castle undoubtedly fell on your shoulder, take your brave soldiers with you, win the battle, honor the glory of Castle!<br/><br/>Spells and props can help you to fight! Burn your enemies to ashes! Deploy props onto battlefield, let them know your true capability! Also remember to recruit heroes, heroes have powerful skills. Talents in Talent Academy can provide you additional attributes! Fight with the toughest enemy! Lots of ways to earn generous coins: challenge levels from easy to difficulty, complete tasks, etc. <br/><br/>Key factors to Victory: COURAGE &amp; WISDOM. Use coins properly! Show your strategy talents in CASTLE BATTLE!<br/><br/>Game Features:<br/>- 45+ levels with lots of challenges<br/>- Custom-designed heroes: Knight, Assassin and Berserker…<br/>- Additional attributes designed for your castle, heroes and props <br/>- Unique props with strong battle effects<br/>- Mysterious bonus system: each victory comes a bonus card!<br/>- Surprises are continually on their way<br/><br/>The horn is howling! The war is to come! Defend your castle and WIN THE BATTLE!", "metacritic": null, "released": "2017-11-07", "tba": false, "updated": "2019-07-29T11:34:12", "background_image": "https://media.rawg.io/media/screenshots/e5d/e5d21fd243f3eea3f796a21220eaef78_jhp24bT.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["xiaojian chen"], "genres": ["RPG", "Strategy"], "publishers": ["xiaojian chen"], "esrb_rating": null}