{"id": 298569, "slug": "minigun-miner", "name": "MINIGUN MINER", "name_original": "MINIGUN MINER", "description": "KNOCK THEIR BLOCK'S OFF!<br/>DIG.BUILD.DESTROY<br/>USE THE MIGHTY MINI GUN, THE MOST POWERFUL WEAPON IN THE UNIVERSE TO TUNNEL AND DESTROY FULLY DESTRUCTIBLE LEVELS.<br/>THE SMASH HIT, FAST PACED MULTIPLAYER FPS VOXEL BLOCK SHOOTER. BATTLE PEOPLE AROUND THE WORLD.<br/>USE TNT OR ENDLESS BULLETS TO DESTROY THE LEVELS AND BUILD BASES WITH BLOCKS TO DEFEND YOURSELF.<br/>NO ADS. 100% CONTENT UNLOCKED &amp; READY TO ROCK. 100% AWESOME.<br/><br/>**NOW WITH ADDED SINGLE PLAYER ZOMBIE HORDE MODE!**<br/><br/>Have you ever wanted to use weapons to tunnel and destroy full levels?<br/>Mini Gun Miner lets you vaporize your way through awesome environments using the ultimate weapon : The Mini Gun!<br/>Dig under your enemies bases, pop up behind unsuspecting foes, create vast tunnel networks using your weapon as a tool of doom and digging.<br/>Build using our block system, create bases, walls, defenses and cunning traps. Funnel your enemies into your sights!<br/>Multiplayer mode allows you to unleash your plans and tactics on your friends and foes around the world<br/>If you want to slay some cube faced zombies, play single player in Horde mode carnage. Use your Mini Gun to dig trenches, and traps!<br/>Choose from many different character skins. <br/>the best bit? NO ADS. NO IN APP PURCHASES. ALL CONTENT UNLOCKED FOR YOUR DEADLY DIGGING PLEASURE.<br/>BOOM!!", "metacritic": null, "released": "2016-05-28", "tba": false, "updated": "2019-10-22T14:36:12", "background_image": "https://media.rawg.io/media/screenshots/826/82603338a579c07cbd8ca0422a4ea2a5_jsYulr3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["paul calvert"], "genres": ["Action", "Adventure"], "publishers": ["paul calvert"], "esrb_rating": "Teen"}