{"id": 298555, "slug": "the-jungle-kid-pro", "name": "The Jungle Kid Pro", "name_original": "The Jungle Kid Pro", "description": "Play real physics-based mango strike game with hungry cute jungle kid, where he is trying to hit the mangoes on a tree with his catapult. <br/><br/>In this game you have to help the kid to strike mangoes and feed him, Use catapult and stones and aim with proper angle and strength to hit the mangos from the mango tree. <br/><br/>Timer Mode: <br/>Within limited time hit as many as mangoes possible with unlimited stones and here you need act fast to grab maximum delicious mangoes.<br/><br/>Endless Mode:<br/> In this mode, you have given three stones and you will lose the stones if you miss the mango while hitting them, so aim properly and hit the mangoes. Avoid flying birds without hitting them, if you hit the birds then you will lose the count of stones. Go for highest mangoes as long as you have stones to hit the mangoes.<br/><br/>Level Mode:<br/>There are many different levels in this game, whereas each level introduces a new pattern of gameplay and you will be rewarded according to the easiest way he achieves the target with limited number of stones he had. To clear the levels player should figure out which action to do first and what to next in a proper order. The player is instructed what to do but not how to do. The player is given a target number of mangos to be collected in each level. A number of stones he has decided the number of chances he has to achieve the target. Achieving the target with a few stones by figuring out the easiest path to achieve them is considered as the puzzle in this game. <br/><br/>In certain levels, you must first identify which mangoes are ripening first and then need to hit in the ripening order to clear such levels. If you delay then ripened mango will fall down and again you have to retry to clear. Beware of some birds those might pluck the mango before you hit. There are frozen mangoes and you need to first clear the ice and then hit the mangoes.<br/><br/>Avoid hitting innocent birds and falling kites, but you can hit harmful pigs entering to destroy your catapult and try to dash Jungle Kid as well. To gain extra bonus time bonus and stones you need to hit the timer icon and stone bags falling from the sky. Each level you finish will be rewarded with the ratings depends on your accuracy and try to finish all the levels with the three stars. <br/><br/>Are you ready to feed this humble Jungle, Kid?", "metacritic": null, "released": "2018-09-24", "tba": false, "updated": "2019-10-22T14:36:12", "background_image": "https://media.rawg.io/media/screenshots/67d/67d01de059c4208d3b8c6c1422f7e66c_jAfq2lJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobi2Fun Mobile Entertainment Pvt"], "genres": ["Adventure", "Arcade"], "publishers": ["Mobi2Fun Mobile Entertainment (Bangalore) Pvt"], "esrb_rating": "Everyone 10+"}