{"id": 298540, "slug": "quick-classic-solitaire", "name": "Quick Classic Solitaire", "name_original": "Quick Classic Solitaire", "description": "Solitaire by MAXAPP2016 is the ORIGINAL maker of Solitaire with many Challenges. We’re ALWAYS updating our Solitaire to include fun new features! <br/>If you like Windows Solitaire, you're going to love our old school Solitaire game! Popular with casual fans and casino lovers alike, this is the same Solitaire game AS SEEN ON TV, and the only Solitaire app that includes so many Challenges. <br/><br/>MAXAPP2016 Solitaire stays true to the classic Solitaire card game (also known as Klondike or Patience), the most funny version of Solitaire. With amazing graphics tailored for iPhone/iPad and the best game play of any Solitaire app on the market, you’ll have a blast rediscovering your favorite classic game!<br/><br/>Solitaire is FREE to download! Play the classic card game now!<br/><br/>Solitaire is also known as Patience.<br/><br/>SOLITAIRE BY MAXAPP2016 FEATURES:<br/><br/>Fun Addicting Games of Classic Klondike Solitaire<br/>Klondike Solitaire Draw 1 card<br/>Klondike Solitaire Draw 3 cards<br/>Winning Deals: Increase the challenge<br/>Addicting, unique ways to play!<br/><br/>Challenge Games of Solitaire - Unlock Challenges Each Day<br/>Daily Challenges task you with completing unique feats every day<br/>Challenges keep the classic game of solitaire new every time<br/>Play Solitaire every day for a unique, challenging game!<br/><br/>Classic Games, Modern Options<br/>Solitaire statistics tracker: study your progress and playstyle<br/>Cards &amp; Tables can be fully customized<br/>No wifi required for Random Deals. Play anywhere!<br/><br/>Brain Training - Keep your Mind Sharp <br/>Solitaire is the original Logic puzzle. Stay mentally fit with a fun card game!<br/>Brain Games can help kids and adults alike in a fun, engaging way<br/>Challenges &amp; Achievements will puzzle your brain, put your logic skills to the test and keep you coming back to play!<br/><br/>GameCenter: Achivement &amp; Leaderboards<br/>View your scores on the leaderboards<br/>Play with friends: race against friends and see who finishes the fastest!<br/><br/>Solitaire by MAXAPP2016 is one of the best fun free games for kids and adults alike! If you’ve ever played Solitaire on your PC, enjoyed a round of casino blackjack, or any variants like Spider Solitaire or Tripeaks Solitaire, you’ll feel right at home in this authentic, original Klondike Solitaire game!<br/><br/>Download Solitaire and bring the classic game anywhere!<br/><br/>Solitaire is free to download, so it have some Ads, but you can purchase 'Remove Ads' to kill all Ads.<br/>Thank you for your support", "metacritic": null, "released": "2016-09-23", "tba": false, "updated": "2019-10-22T14:36:11", "background_image": "https://media.rawg.io/media/screenshots/c1e/c1e2f82fa260e54f4aaf656908e26bf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MaxApp Co"], "genres": ["Card", "Puzzle"], "publishers": ["MaxApp Co"], "esrb_rating": "Everyone 10+"}