{"id": 298556, "slug": "power-miners-merge-build", "name": "Power Miners: Merge & Build", "name_original": "Power Miners: Merge & Build", "description": "Create your own Town of power miners! Merge and unlock new cool characters! Increase the production and your passive income! Build your town and earn more and more boosters!<br/><br/>Upgrade your Miners, extend the Town, progress to the new undiscovered lands and Tap-Tap-Tap!<br/><br/>Combine bonuses wisely to create a powerful boost to your mining Town. Manage your business effectively and earn offline!<br/><br/>FEATURES:<br/>* Merge miners to unlock more powerful ones! (with super mustaches and awesome hats they all look different. Collect them all)<br/>* Build and upgrade your Town<br/>* Tap-tap-tap for the boost!<br/>* Get idle earning while offline<br/>* Progress to the new and undiscovered lands<br/><br/>Gold Membership<br/><br/>You can get Gold Membership for free for 3-days trial period. After the trial period, you will be automatically charged $4.99 for the weekly subscription which you can cancel any time. This purchase is an Auto-Renewable subscription. The membership will give you: +50% to all boosters duration, +50% to miners speed, +20% offline coins earnings, remove all random ads, 10 gems every day.<br/><br/>Payment will be charged through your iTunes Account at confirmation of purchase. Subscription automatically renews unless unsubscribed at least 24 hours before the end of the current period. An account will be charged for renewal within 24 hours prior to the end of the current period and identify the cost of the renewal. Subscription may be managed by the user and auto-renewal may be turned off by going to the user Account setting. Any unused portion of a free trial period if offered will be forfeit when the user purchases a subscription to that publication.<br/><br/>Privacy Policy<br/>http://tatem.games/privacypolicy<br/><br/>Terms of Service<br/>http://tatem.games/termsofservice", "metacritic": null, "released": "2019-03-01", "tba": false, "updated": "2019-07-15T02:02:45", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e8c0c3f26ae7ff94156e50b33b43e32.jpg", "website": "http://powerminersgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tatem Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Tatem Games"], "esrb_rating": null}