{"id": 298677, "slug": "my-virtual-fish-tank-simulator-aquarium-3d", "name": "My Virtual Fish Tank Simulator: Aquarium 3D", "name_original": "My Virtual Fish Tank Simulator: Aquarium 3D", "description": "Welcome to the small aquatic world right in your pocket! Create your own aquarium, decorate it, raise little fish up from little hatchlings to the aged fish and have fun with My Virtual Fish Tank Simulator: Aquarium 3D!<br/>Relax in the calm water of this beautiful ecosystem, watching beautifully swimming fish of all kinds! Choose one of the best backgrounds and decorations to make your fish bowl more comfortable and interesting for its little inhabitants! Get various wonderful marine fish right from the World Ocean and watch them growing! Would you prefer coral fish like damselfish, yellow tang and sea horse or aquarium fish such as goldfish? This choice is up to you!<br/>Although every fish is modest pet, you should keep an eye on all of them! Mind that they have their own health and food indicators, so be careful and feed them in time! You don’t want to watch them dying, do you? Enjoy these fantastic colors and beautiful fish in My Virtual Fish Tank Simulator: Aquarium 3D!<br/>Earn coins and buy different decorations for your aquatic life! Every sea plant and weed has its own unique color so choose wisely to make a design of your aquarium really perfect!<br/>My Virtual Fish Tank Simulator: Aquarium 3D features:<br/>•\tRealistic aquarium simulator – not just wallpapers!<br/>•\tInteresting and colorful fish<br/>•\tVariety of decorations and backgrounds<br/>•\tAddictive gameplay<br/>Enjoy this little pocket ecosystem! Raise colorful fish and have fun with My Virtual Fish Tank Simulator: Aquarium 3D!", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2021-03-05T07:09:31", "background_image": "https://media.rawg.io/media/screenshots/76f/76fb1da2d311249cca59935fc306cb70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Simulation", "Puzzle"], "publishers": ["Tayga Games OOO"], "esrb_rating": null}