{"id": 298668, "slug": "kids-play-visual-games", "name": "Kids Play Visual Games", "name_original": "Kids Play Visual Games", "description": "Kids Play Visual Games is an app that consists of 15 educational games developed to reinforce skills of visual and spatial perception, aimed at kids of all ages.<br/>Each of the levels in this game will help your child to process information and to implement visual skills through fun visual exercises, accompanied by the raccoon pet and its animal friends, which will compliment and encourage kids every time they solve the game.<br/><br/>VISUAL EDUCATIONAL GAMES <br/>Visual stimulation at an early age acts as a reinforcement to help their cognitive development and prevent possible attention and concentration problems. Babies and children will learn to:<br/>- Identify shapes and colors.<br/>- Process spatial relation: orientation, size and position.<br/>- Associate shapes with their pair.<br/>- Improve visual skills by searching for objects.<br/>- Develop manual dexterity and motor skills.<br/>- Detect the incorrect image among a list of items.<br/>- Differentiate figures and backgrounds.<br/>- Enhance their attention span and concentration.<br/>- Boost observation skills and their attention to detail.<br/><br/>Kids Play Visual Games are carefully designed with a simple interface in order to let children have fun while learning with animals and kid-friendly characters.<br/><br/>This game is free to download and play.  Ads can be easily removed by upgrading.<br/><br/>DIFFERENT LEVELS OF DIFFICULTY<br/>Our goal is that, whatever the intellectual capacity of the child may be, they can sharpen their visual abilities gradually. To do that, the game offers three levels of difficulty (easy, medium and hard), adapted to different ages and stages of development.<br/><br/>Easy: Ideal for beginners, especially for babies and kids who are at an early age.<br/>Medium: Perfect for children who are already familiar with the game.<br/>Hard: Suitable for kids who have managed to solve each game quickly and don’t need the help of parents or teachers to solve them.<br/><br/>EDUJOY EDUCATIONAL GAMES <br/>This app is part of a collection of educational games created by Edujoy in order to help kids develop new intellectual and motor skills from common things from their environment.<br/><br/>All our games are created by professional educators and psychologists in order to provide pedagogical content, necessary for the intellectual development of babies and children.<br/><br/>We love creating educational and fun games for you. If you have any suggestions or questions, feel free to send us your feedback or leave your comments.", "metacritic": null, "released": "2016-10-13", "tba": false, "updated": "2019-10-22T14:36:16", "background_image": "https://media.rawg.io/media/screenshots/956/9563ad7904e348889ad9ecc28d4048c6_g1AiOdr.jpg", "website": "http://edujoy.es", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EDUJOY ENTERTAINMENT"], "genres": ["Puzzle"], "publishers": ["EDUJOY ENTERTAINMENT"], "esrb_rating": null}