{"id": 298611, "slug": "smart-ships", "name": "Smart ships", "name_original": "Smart ships", "description": "In 2014 the game took first place among Board games for iPhone in Russia and Ukraine!!!<br/><br/>Two fleets meet in deadly opposition. Only the prudent mind and tactical skills of the best admiral can declare an unconditional victory. The ships conduct warfare by attacking blindly, filling all water area by means of shells. Such conditions create a practical boundless scope for tactics and strategy.<br/><br/>——————————————— <br/><br/>This is a mobile rendition of our classic childhood game Sea Battle. Sea Battle first appeared in paper form in the remaining 30 years of the last century. Considered as one of the most popular then and to this day. <br/>——————————————— <br/><br/>Now this ageless classic is realized in a new way for mobile platforms. Rules are simple and easy to follow. On a game field each player has ships, from foreboding battle ships to small boats. Opponents in turn fire across the field of the opponent, clicking on the corresponding boxes that represent the open waters. The victory is won by the admiral who sinks the last ship of the enemy.<br/><br/>——————————————— <br/>Help:<br/>On the game board each player arranges their own ships. They cast shells blindly into the open waters hoping to score a hit on the opponent’s ships. Victory is awarded to the admiral who sinks the most ships of their opponent.<br/><br/>Hint: Double press on a ship to change its direction.", "metacritic": null, "released": "2014-03-30", "tba": false, "updated": "2019-10-22T14:36:14", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0a09c65a4002dde54a1b356f02386a6_PJ0DRwP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Leonid Grebenyuk"], "genres": ["Strategy", "Board Games"], "publishers": ["Leonid Grebenyuk"], "esrb_rating": "Everyone 10+"}