{"id": 298631, "slug": "italien-universal", "name": "Italien Universal", "name_original": "Italien Universal", "description": "Unterwegs in Italien – Wir schicken Sie in Urlaub!<br/><br/>Italien ist berühmt für seine gute Küche und kulinarische Spezialitäten, geschichtsträchtige Bauten, antike Ruinen, Kunstschätze und landschaftlich schöne Gegenden. Aus gutem Grund ist „Bella Italia“ für Strand- und Kulturreisen immer wieder ein beliebtes Ziel. <br/><br/>Es gibt vieles zu entdecken! Reisen Sie mit unserem Quiz durch das beliebte Urlaubs- und Reiseland Italien und entdecken Sie das Land in seiner Vielfalt! Lernen Sie Wissenswertes über Kultur, Land und Leute, Kulinarisches, Interessantes und Besonderes kennen und lassen Sie sich inspirieren!<br/><br/>Spannende, aktuelle und gut recherchierte Fragen mit Erklärungen bei falschen Antworten machen das Quiz zu einem unterhaltsamen Begleiter. Sie können außerdem die einzelnen Themenrunden separat durchspielen. Die Themenrunden haben Inhalte aus den Bereichen: Kulturelles, Sehenswert, Kulinarisches, Landeskunde, Freizeit und Unterwegs.<br/><br/>Bei Unterwegs in Italien gibt es zwei verschiedene Antworttypen:<br/>Einfach: Nur eine Antwort ist richtig.<br/>Mehrfach: Eine, zwei, drei oder vier Antworten sind richtig.<br/><br/>Kurzbeschreibung:<br/><br/>- Mehr als 500 interessante Fragen <br/>- Erklärung bei falscher Antwort<br/>- Quizmodus<br/>- Auswahl nach 6 Themengebieten möglich<br/>- Einfache Bedienung<br/>- Schöne Grafik<br/>- Statistik<br/>- Spielsprache: Deutsch<br/><br/>Aus der beliebten Quiz-Serie „Gewusst was“! Weitere aktuelle Titel von den Entwicklern sind  „USA Universal“, „Deutschland Universal“, \"Frankreich Universal\", „Weltwissen Universal“, „Benehmen Quiz“, \"Forschung und Technik Quiz\" und „Wirtschaft und Finanzen Quiz“. Besuchen Sie auch gerne unsere Homepage http://www.redoctopus.de, um sich über neue Quiz zu informieren. Über Ihr Feedback und natürlich Sterne, wenn Sie unsere App unterstützen möchten, freuen wir uns sehr! <br/><br/>Wir wünschen viel Spaß!", "metacritic": null, "released": "2016-11-16", "tba": false, "updated": "2019-10-22T14:36:15", "background_image": "https://media.rawg.io/media/screenshots/79e/79e4312a01c0adf7400c39b6f177b53c_pSbT33B.jpg", "website": "http://www.redoctopus.de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Red Octopus"], "genres": [], "publishers": ["Red Octopus GmbH - Entertainment, Music & Art"], "esrb_rating": "Mature"}