{"id": 298612, "slug": "snlf-1942-guadalcanal", "name": "SNLF 1942 Guadalcanal", "name_original": "SNLF 1942 Guadalcanal", "description": "Welcome to our Battle Organizing Tool of our series „Frontline\"<br/>Organize your lists quick and easy to play a tabletop game in the Pacific 1943. <br/>Tokyo Express: This App helps you to quickly organize your 3rd or 7th Special Naval Landing Force (Japanese Naval Forces), Guadalcanal 1942/43 for a tabletop game (miniatures 1:100, 1:72, 1:56).<br/>You need no further book, in the app you find the organizer diagram, company information, units, history and as additional material special rules, overview of Japanese Arsenal etc. as a pdf. <br/>Our line is based on historical context, but as well you find some variations which might have been possible. <br/>Configurate a complete company with all needed elements (HQ, Combat Platoons, Weapon Platoons, Support Platoons) and see the total score of points in any change and combination, no limitation in points. <br/>List, view and store your company within the Battle-Screen for an upcoming battle with your friends. Store your current battle list, use it during the game and even mail it to your mail account or to your friends.<br/>Features:<br/>- Mobile Organizer Tool for your battle forces<br/>- Store your battle list <br/>- Send your lists by email to your account or to friends<br/>- Build up a cool company list and see the points at one glance – as well, if you change your points!<br/>- Easy to use configurator for full HQ, full Combat Platoons, full Weapon Platoons, full Support Platoons with detailed information<br/>- Complete arsenal overview of the forces<br/>- PDF with company diagram units, history and more<br/>- Two new Missions for table top games in 1/100, 1/72 e.s.o.<br/><br/>Our series \"Frontline\" is an organizer for tabletop-games. See also other Apps in the store.<br/>Get more information about all our apps here: http://www.redoctopus.de. Please feel free to send us your comments and feedback and of course a review in iTunes! Thank you for your support!", "metacritic": null, "released": "2015-06-12", "tba": false, "updated": "2019-10-22T14:36:14", "background_image": "https://media.rawg.io/media/screenshots/988/9889b1547c727cb42decf7c33ff516a1.jpg", "website": "http://www.redoctopus.de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Red Octopus"], "genres": ["Board Games"], "publishers": ["Red Octopus GmbH - Entertainment, Music & Art"], "esrb_rating": "Everyone 10+"}