{"id": 2988, "slug": "monkey-labour-80s-handheld-lcd-retro-game", "name": "Monkey Labour - 80s handheld LCD retro game", "name_original": "Monkey Labour - 80s handheld LCD retro game", "description": "\"Monkey Labour is a lovingly crafted riff on Nintendo’s Game &amp; Watch handhelds, but with its own unique gameplay.\" -- toucharcade.com<br/><br/>Features:<br/> * Hours of endless fun!<br/> * Try pressing your finger on the LCD screen!<br/> * Retro handheld device revival!<br/> * Immersive attention to details!<br/> * Compare your scores on Game Center!<br/> * Unique set of achievements!<br/><br/>\"Perfect recreation of a 1980s Game &amp; Watch device. Great attention paid to authentic details. ... Dawn of Play remembers those early handheld games, and pays proper homage with Monkey Labour. ... Our thanks to Dawn of Play for the trip down memory lane, since Monkey Labour is clearly a labor of love.\" <br/> - Slide to Play<br/><br/>Mobot the robot is expected to mindlessly labor at his job deep inside the bowels of a corporate production facility while his monkey boss vents frustration by throwing obstacles Mobot's way. <br/><br/>Help Mobot stick it back to the system while avoiding being replaced by a cheaper model in this deliciously retro 80s style electronic handheld game rehash.<br/><br/><br/>*************<br/><br/>\"Gamers who remember the Long Long Ago will get a kick out of today’s leading Fresh Game, Monkey Labour. ... For a casual game with some very old-school handheld ideas behind it, but with modern additions like achievements and online leaderboards, look no further.\"<br/> - Appolicious<br/><br/>\"... retro fun reborn ... The gameplay is simple but brilliant fun ... Monkey Labour may well be our favourite new iPhone game.\" <br/> - electricpig.co.uk<br/><br/>\"Dawn of Play’s first universal application entitled Monkey Labour will instantly bring you back to 80's and help educated new gamers to the enjoyment of gameplay simplicity. ... Monkey Labour features simple but addictive gameplay mechanics that any gamer will quickly get, however mastering the game will prove harder to master.\"<br/> - appversity.com<br/><br/>Like us on Facebook: fb.me/dawnofplay<br/>Follow us on Twitter: twitter.com/dawnofplay", "metacritic": null, "released": "2010-12-23", "tba": false, "updated": "2019-10-22T14:28:15", "background_image": "https://media.rawg.io/media/screenshots/b6a/b6a0b90fdb3c8313d3d358d4fa80efb8.jpg", "website": "http://dawnofplay.com/monkeylabour/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dawn of Play"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Razum"], "esrb_rating": null}