{"id": 299073, "slug": "battlecorp", "name": "BattleCorp", "name_original": "BattleCorp", "description": "<p><em>“Welcome to Toc Corporations, We have eliminated the need for humans to do work, and now we make them fight for our entertainment like they once did with us. 01101000 01100001 01101000 01100001 01101000 01100001 00100001 0001010. Please spend some time selecting the humans you want to fight for your entertainment, and watch the violent creature fight for meaningless rewards of grandeur.”</em></p>\n<p>BattleCorp allows you to make AI scripted combatants fight in an arena. You can try coding some AI yourself or use some of the predefined scripts to set up a simulated battle. Maybe you always wanted to see Stephanie in your office be the cowardly AI while Jeff the Brave mercilessly chased her around an arena.</p>\n<p><strong>Modding:</strong></p>\n<p>One of the points of this game is to code your own ai scripts and see how they fair in the real simulated world of BattleCorp</p>\n<p>You can mod things like the name generation and outfits as well but they aren't as fun as making your own doomsday AI.</p>\n<p><strong>In Development:</strong></p>\n<p>BattleCorp is currently in development. The main features have been added to the game but there will still be lots of room for improvements, bug fixing and polish. Thank you for choosing to play BattleCorp and we hope you enjoy your time with it.</p>\n<p><strong>Known Bugs:</strong></p>\n<ul><li>Resolution in options starts at screens resolution not the game resolution</li></ul>", "metacritic": null, "released": "2019-03-03", "tba": false, "updated": "2019-08-28T23:17:42", "background_image": "https://media.rawg.io/media/screenshots/3d8/3d863eabcd5f1335016adc583ef6b901.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kestcast"], "genres": ["Simulation", "Fighting"], "publishers": [], "esrb_rating": null}