{"id": 299112, "slug": "beyond-time-itch", "name": "Beyond Time (itch)", "name_original": "Beyond Time (itch)", "description": "<p><em>\"Someday our piecing together of knowledge will open up such terrifying vistas we shall either go mad, or flee into the safety of a new dark age\" - H.P. Lovecraft</em></p>\n<p><em>'Beyond Time' </em>is a Lovecraftian horror game, in which you take the role of an unnamed reporter from the Arkham Tribune. After recently returning from an ancient expedition to Egypt, you find yourself awakening in your office, surrounded by candles, with a faded recollection of prior events. Explore the shadowy alternate reality you find yourself within, and do all you can to uncover the eldritch truth that you spent so long yearning for.</p>\n<p>With this game, I wanted to try to capture a certain feeling invoked by classic, 90s horror games. As such, this game features a seldom used style of graphics and sound to help emulate that style, as well as incorporating the use of fixed camera perspectives into it's levels.</p>\n\n<p><strong>Controls</strong><br/></p>\n<ul><li>WASD - Movement</li><li>Left Mouse Click - Interact With Object</li><li>Right Mouse Click - Open Door</li></ul>\n\n<p><strong>Tips</strong></p>\n<ul><li>Almost everything in the game is intractable. If there's something that catches your eye in the environment, go over to it and press left-click. Usually there will be a good amount of text detailing part of the game's story. This can also give you hints on what your current objective is to achieve.</li><li>The game hosts an environment that is frequently changing. Be sure to revisit previous rooms, because you never know what may have changed!</li><li>The game is best enjoyed in a dark room with a good pair of headphones on.</li><li>Take your time! The game is short, but if you take the time to explore the world and read all of the notes around, you'll have a much better understanding of what's going on.</li></ul>\n\n<p><strong>Some Disclaimers</strong></p>\n<ul><li>Most of the ambient effects you hear in this game were made by me. However, certain sound effects, such as the doors opening and closing, were sourced from the public domain and edited heavily to suit the games aesthetic.</li><li>All of the games music was created by Kevin MacLeod (incompetech.com), and have not been edited.</li><li>The game contains flashing images, and while these are somewhat infrequent, please take this into consideration if that sort of thing could be an issue for you.</li></ul>", "metacritic": null, "released": "2019-03-02", "tba": false, "updated": "2019-08-28T23:17:42", "background_image": "https://media.rawg.io/media/screenshots/988/988e5cfdfca6d65869dad43b02c9a355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TomRobson"], "genres": [], "publishers": [], "esrb_rating": null}