{"id": 299304, "slug": "harm-other-demo", "name": "Harm Other (Demo)", "name_original": "Harm Other (Demo)", "description": "<p>Harm Other is a two-button narrative comedy game for PC and Mac consisting of five chapters with vastly different locations and themes:</p>\n<ul><li>Chapter I: KNEE DEEP IN THE READ</li><li>Chapter II: THY TEXT CONSUMED</li><li>Chapter III: WORD ME PLENTY</li><li>Chapter IV: BOOKMARKED FOR DEATH</li><li>Chapter V: ASHES TO ASHES, DUST TO DUST JACKET</li></ul>\n<p>The beginning of the game will occur at the start of Chapter I, the middle will be somewhere around Chapter III, and the end will probably be found in the last bit of Chapter V.<br/></p>\n\n<p>In the far flung future the response to every decision in life - no matter how enormous or insignificant - is a formal choice between Harm and Other.</p>\n<p>As a DropCo Intergalactic Independent Contractor you are uniquely trained to make such decisions in an official capacity by pressing a pair of brightly colored buttons. Often with very little information. Always with no idea what Harm or Other could possibly mean in the current context. In exchange for your extraordinary talents you earn nearly half of a living wage.</p>\n<p>Since the result of every choice is unique and each chapter contains at least one major branching path (not shown in the demo), you will be able to play the game four times before encountering every unfair and ridiculous outcome.</p>\n\n<p>Harm Other was successfully funded on Kickstarter last year and will be released as a paid game in 2019. This free PC demo contains the first portion of Chapter I. If you like it, please spread the word!<br/></p>\n<p>For questions, technical issues, and media inquiries email me at: ctstalker@somethingawful.com<br/></p>", "metacritic": null, "released": "2019-03-02", "tba": false, "updated": "2019-03-04T04:57:47", "background_image": "https://media.rawg.io/media/screenshots/fde/fdefc5093794692b16272834c8ff5e5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dennis Farrell"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}