{"id": 299498, "slug": "bruce-lee-return-of-fury", "name": "Bruce Lee - Return Of Fury", "name_original": "Bruce Lee - Return Of Fury", "description": "<p><em>\"Return of Fury\" is a continuation of the original game \"Bruce Lee\" developed by </em><em>DataSoft, Inc in 1984. It features all of the classic gameplay in a brand new world. Bruce's long-time foes, The Yamo and The Ninja also return, as always hell-bent on foiling Bruce's challenge.</em></p>\n<p><strong>WELCOME TO BRUCE LEE - RETURN OF FURY<br/></strong>35 years later, The Emperor had rebuilt the Forbidden World.<br/>Enemies regrouped and came back even stronger.<br/>There was no backing out of the challenge ahead.<br/>Be like water, my friend, and you will be victorious.<br/>The Legend has returned - The Adventure continues.</p>\n<p><strong>HOW TO PLAY<br/></strong>Up to 3 players simultaneously using Protovision's 4 player adapter.</p>\n<p><strong>PLAYER SELECT<br/></strong>Use joysticks 1-4 left/right to select character.<br/>Press fire button to assign a device for the character, press again for CPU control.<br/>Push up for bare upper body or iconic yellow jumpsuit.<br/>Press fire button on difficulty level NORMAL or HARD to start the game<br/>Bruce must be human controlled, or game will not start.</p>\n<p><strong>GAME MODES</strong><br/>NORMAL mode: 3 continues available, normal gameplay.<br/>HARD mode: Faster enemies and NO continues. Kung-fu masters only.</p>\n<p><strong>IN-GAME<br/></strong>SPACE to pause/continue the game.<br/>F1 to return to the Titles.</p>\n<p><strong>CREDITS<br/></strong>Original game by DataSoft, Inc. 1984<br/>Return of Fury modification by Megastyle<br/>Published by Megastyle 2019</p>\n<p><strong>BRUCE LEE<br/></strong>Original programming by Ron J. Fortier<br/>Graphics by Kelly Day<br/>Sound Effects and Title Theme by John A. Fitzpatrick</p>\n<p><strong>RETURN OF FURY<br/></strong>Maps, music and additional programming by Vidar \"dmx\" Bang<br/>Loading picture by Rune \"Sparkler\" Spaans<br/>Tape loading music by Anders \"Rage\" Rodahl<br/>Megastyle intro by Kåre \"Docster\" Johansen, Roy \"Rotteroy\" Widding<br/>Testing by Rotteroy, Docster, Rage, Andrew \"Merman\" Fisher and Vinny Mainolfi<br/>Linking by Chris \"Microbit\" Stanley<br/>Final compilation by Rotteroy<br/>Tape version mastered by Tom Roger \"SLC\" Skauen of Pond Software<br/>Tape loader made by Paul Hughes</p>\n<p><strong>FEEDBACK<br/></strong>We're grateful for any feedback you may have on this game:</p>\n<p>https://twitter.com/RebelAndroid (dmx)<br/>https://twitter.com/Rotteroy (Rotteroy)</p>", "metacritic": null, "released": "2019-03-01", "tba": false, "updated": "2019-03-04T05:26:52", "background_image": "https://media.rawg.io/media/screenshots/69f/69f51dc7f49271db56374c22f7796432.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 6, "reviews_count": 0, "platforms": ["PC"], "developers": ["Megastyle"], "genres": ["Action", "Fighting", "Platformer"], "publishers": [], "esrb_rating": null}