{"id": 299528, "slug": "tower-tank", "name": "Tower Tank", "name_original": "Tower Tank", "description": "<p>Défendez votre quartier général contre l'invasion de tanks ennemis. Il faut détruire 50 ennemis pour remporter la bataille.</p>\n<p>Durant la partie, vos bâtiments encore en état vous aiderons en fournissant des caisses de munitions.</p>\n<p>Quelques astuces:<br/></p>\n<p>- Trois tanks sont disponibles, chacun a des avantages et des inconvénients.</p>\n<p>- Votre tank est indestructible, profitez-en pour faire barrière contre les tirs ennemis.</p>\n<p>Contrôles:</p>\n<p>- Se déplacer: flèches de direction ou q, s, z, d.</p>\n<p>- Clic gauche: mitrailleuse (attention à la surchauffe)</p>\n<p>- Clic droit: obus (il faut attendre un temps de rechargement entre chaque tir)</p>\n<p>- Élève Premium de Gamecodeur: depuis le 15/07/2017</p>\n<p>- Langage et Framework utilisé: Lua et Love2d</p>\n<p>- Code par: Lucien</p>\n<p>- Musiques: Eric Matyas (http://soundimage.org/)</p>\n<p>- Graphismes: Bleed et Chabull (https://opengameart.org)</p>\n<p>- Sons: Google</p>\n<p>- Utilisation de librairies et codes externes: Non</p>\n<p>- Temps passé: 3 semaines et pas mal de galères</p>\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème:</p>\n<p>Je me suis inspiré des jeux de towers defense et de \"World of Tank\".</p>\n<p>- Petit postmortem:</p>\n<p>Le plus gros du code source provient de l'atelier \"Redemption of Sam\" que j'ai modifié pour obtenir ce que je voulais.</p>\n<p>Mon plus gros problème a été la gestion de la rotation des tanks ainsi que les collisions. Beaucoup de temps perdu, je n'ai pas pu faire tout ce que je voulais.</p>\n<p>Ce prototype pourrait être amélioré avec des traces de chenille, un scrolling, une meilleure intelligence des ennemis et un mode 2 joueurs.</p>\n<p>Merci à toutes les personnes qui m'ont donné un coup de main, en particulier sur les formules de trigo!</p>", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2019-03-04T05:30:57", "background_image": "https://media.rawg.io/media/screenshots/a1b/a1bc9a0e8eb8ee11adfed18224acb6cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lulu"], "genres": ["Action"], "publishers": [], "esrb_rating": null}