{"id": 299616, "slug": "hell-empire-sinners-flow", "name": "Hell Empire: Sinners Flow", "name_original": "Hell Empire: Sinners Flow", "description": "The deeper to Hell, the fatter the devils are ...<br/><br/>The cauldrons are polished, the torture equipment is sharpened, the chains are greased with love. Everything is ready for a painful tour to enjoy the Nine Circles of Hell. Where would you like to stay forever?<br/><br/>The goal of your whole life is to curry favor with Lucifer, the Prince of Darkness, to become his right hand, displacing insidious but beautiful Lilith, as well as Beelzebub, the Prince of Hell, who's as ancient as the world itself, and Asmodeus The Timekeeper. In order to be appreciated by him, to proudly become part of his Dark Majesty’s inner circle and take a well-deserved place beside his throne, you need to ensure that your personal Hell - the territory assigned to you - will become the most profitable Hell in terms of souls and sufferings.<br/><br/>Make it the most painful experience for murderers, unbearable for betrayers and unthinkably cruel for torturers.<br/><br/>Open all Nine Circles of Hell<br/>Each cauldron produces its own type of resources, at its own speed, depending on its volume. You can buy new cauldrons for resources, as well as hire guards and devils to guard sinners. When you get enough resources, you can open a new Circle of Hell.<br/><br/>Every sinner has their own cauldron<br/>More and more sinners come to each circle, place them in new cauldrons, according to their transgressions. Sinners arrive constantly. Make sure that they're getting placed in their cauldrons without a hitch, or you’ll lose the vicious souls, and because of that the Father of Lies will not give you an extra portion of blood.<br/>The moregrievous the transgression is, the more resources it brings.<br/><br/>Get ready to fight<br/>Things aren't that perfectly painful in Hell. The sinners revolt every now and then trying to escape to the Heaven or to the World of the Living. Fight them, do not let them escape!<br/><br/>And then He will appriciate you and reward you in ways you haven't even dreamed of.", "metacritic": null, "released": "2019-05-31", "tba": false, "updated": "2019-08-28T21:47:53", "background_image": "https://media.rawg.io/media/screenshots/f00/f0013e75a351a3101d1c60725d23d245.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Joystick Knights"], "genres": ["Strategy", "Indie"], "publishers": ["Joystick Knights"], "esrb_rating": null}