{"id": 299613, "slug": "dreamback-vr", "name": "DreamBack VR", "name_original": "DreamBack VR", "description": "<strong>WHAT’S DREAMBACK VR?</strong><br/><br/>DreamBack VR is a first person psychological horror in which you uncover the secrets of the historic Rickfford Mansion, utilising Unreal Engine 4 and built exclusively for Steam VR.<br/><br/><strong>OVERVIEW</strong><br/><br/>As Michael Shurtbell you are drawn into the dark Victorian Rickfford Mansion by a mysterious ghostly presence to uncover it's history and the deepest secrets of its previous owner and the tragic past of it's residents. Navigating the vast house you will unlock it's secrets and learn it's history through an interactive storytelling experience.<br/><br/>“Sometimes, we can draw upon subconscious to relive forgotten experiences, and these memories can change our lives forever”.<br/><br/><strong>GAMEPLAY</strong><br/><br/>Designed from the ground up and optimised for VR, DreamBack VR features a detailed fully interactive environment and puzzle mechanics. The player will advance through the story using immersive movement controls, dynamic handheld lighting and intuitive observation based problem solving. The game focuses on atmospheric/no combat gameplay.<br/><br/><strong>VISUALS</strong><br/><br/>The game environment has been design and implemented to offer the highest possible visual quality while maintaining the targeted performance for VR application. Profiling and optimizing are one of our priorities to offer the most fluid experiences and stable frame rates as possible and adaptable graphics options.<br/><br/><strong>AUDIO</strong><br/><br/>Sound has been designed to immerse the player deeply into the VR experience. Dynamic spatial and binaural audio systems together with high quality ambience and effects create a unique rich atmosphere. The game also features an exclusive soundtrack.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:53", "background_image": "https://media.rawg.io/media/screenshots/136/13639466d06f7050f580f5d9fd8067fb.jpg", "website": "http://comeovergaming.com/video-games/dreambackvr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Come Over Gaming"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Come Over Gaming"], "esrb_rating": "Adults Only"}