{"id": 299897, "slug": "lifeafter", "name": "LifeAfter", "name_original": "LifeAfter", "description": "<p>A blizzard of devastating virus beleaguered the world, bringing about the catastrophic disintegration of orders and covenants.<br />\nWhen the night falls, the world turned into a living hell, swarming with Infecteds. When you finally caught a break, and discovered a place to rest your sore feet, you found yourself exhausted, famished, low on ammo and plagued by the coldness of night. You can hear the growling of Infecteds, approaching, and you know it&#39;s going to be another night of angst and horror. How much longer can YOU survive?<br />\nLifeAfter, a mobile game depicting the survival of humanity in a post virus apocalyptic world, is officially launched.<br />\nLive on, together.<br />\n-Keep your will to survive and hopes alive.<br />\nThe world you once knew so well is now a foreign place in the wave of a virus epidemic. The life of survivors is constantly being threatened by diseases, famine, cold, Infecteds and organizations with hidden agendas. You&#39;ll have to stay calm amid all these dangers and believe there is a way out.<br />\n-Live on with anything available.<br />\nExplore every inch of the post-apocalyptic world - be it in the city full of Infecteds, or an abandoned mine, or a broken-down college, or a freezing cold forest up in the highlands - to scavenge essential materials in order to survive. You&#39;ll need to know how to hunt and gather for food, how to tend to your wounds and make arms to protect yourself.<br />\n-Encounter other survivors.<br />\nYou might encounter other survivors on your scavenging runs. You&#39;ll have to be extra careful, for they might attack you for loot. If they are amiable, you can choose to share with them your food, ammo and adventure stories.<br />\n-Build the final sanctuary for humanity.<br />\nWith the trusted friends you made along the way, you can find a place to camp and build, one brick at a time, until you have the final sanctuary for humanity. Together, around the campfire, humans may once again fend off the long, cold night with hugs.<br />\n【Contact us】<br />\nWebsite：http://www.lifeafter.game/<br />\nFacebook：https://www.facebook.com/LifeAfter.en/<br />\nTwitter：https://twitter.com/LifeAfter_en<br />\nDiscord：https://discord.gg/tEUgCSa</p>", "metacritic": null, "released": "2018-12-17", "tba": false, "updated": "2022-07-10T21:09:26", "background_image": "https://media.rawg.io/media/screenshots/02c/02cd10c670108325b2dc9c9ef0ddfddf.jpg", "website": "https://www.facebook.com/LifeAfter.en/", "rating": 4.17, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 6, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 579, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "iOS", "Android"], "developers": ["NetEase Games"], "genres": ["Adventure", "RPG"], "publishers": ["Netease"], "esrb_rating": null}