{"id": 299982, "slug": "puppy-love-rpg-legend-of-saga-quest", "name": "Puppy Love RPG: Legend of Saga Quest", "name_original": "Puppy Love RPG: Legend of Saga Quest", "description": "<p>The land of Puppylovia has been struck by a curse of madness. The town of Ciabatta has fallen to ruins and monsters are running amok. The feline guardian Freyz Inghart knows that he must put this right, as that curse is his alone to bear.</p>\n<p>Welcome to the <strong>Puppy Love RPG</strong>! Click your way through a pixelated fantasy world populated by a colorful cast of furry misfits gorgeously illustrated by Nai-chan. Chuckle through a dumb story full of intrigue, magic and madness. Smooch your way through a series of puzzle-based battles. Keep your allies alive while you figure out how to bypass your opponent's defenses. </p>\n<p>Puppy Love games draw their cast from the wonderful users of FurAffinity, creating a diverse cast of original characters. Twenty-five FA users put their characters forward to be woven into the beautiful tapestry that is the story of <strong>Puppy Love RPG</strong>, like actors playing roles within a fantastical story.</p>\n<p>- A visual-novel with a battle system? Who thought this was a good idea!?<br/>- A baffling array of meaningless dialogue options.<br/>- Real menus and options.<br/>- Innovative pre-downloaded-DLC to \"improve\" your play experience.<br/>- Four different game areas <em>and</em> a world map.<br/>- 25 Different hand-illustrated, partially animated characters to meet and <em>sometimes</em> smooch.<br/>- Five unique turn-based puzzle battles to overcome.<br/>- A story that <em>almost</em> makes sense.<br/>- Music by Nai-chan played on a real harp recorded in her actual bedroom.<br/>- If you know one of the people who's character is in the game, it might be even more fun for you to see them?</p>", "metacritic": null, "released": "2019-03-07", "tba": false, "updated": "2019-03-08T03:39:31", "background_image": "https://media.rawg.io/media/screenshots/a80/a805eafc837841d0244ae47592cacd5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Knockout"], "genres": [], "publishers": [], "esrb_rating": null}