{"id": 3000, "slug": "opus-the-day-we-found-earth", "name": "OPUS: The Day We Found Earth", "name_original": "OPUS: The Day We Found Earth", "description": "Help our little robot, Emeth, to fulfill a century-old promise by finding Earth in order to save Mankind—so step into the spaceship, operate a deep space telescope, and find out what’s out there in the unknown.“A robot without a goal is nothing more than a calculator. So, listen up... Your goal, is to find Earth. Do we have a deal?”- Dr. Lisa, the creator of the robot and who believes that Earth is not just a myth.“We have a deal… Emeth will find Earth!” - Emeth, the robot.<br/><br/><br/><br/><br/><br/><ul><li>An atmospheric experience with a rich story<br/></li><li> A whole galaxy to explore and get lost in<br/></li><li> Secrets of mysterious planets to be uncovered<br/></li><li> Meticulously crafted art <br/></li><li> A beautiful soundtrack to chill out to</li></ul><br/>Experience an emotional, atmospheric story of purpose and pursuit. <br/>In the far future, humanity has lost its way back. Help the childlike robot Emeth carry on his creator's will to find our long lost home, earth, together, as he realizes a greater purpose inside his tiny mechanical heart.<br/><br/>As the adventure begins, players operate an evolving space telescope to find Earth by scanning nearby stars. Also, the game is like a visual novel in which players can explore each crew member’s secrets scattered around the spaceship with rich narration.<br/><br/>Enjoy a full soundtrack of original music from composer Triodust.Woven deeply into every corner of the game. Prepare to lose yourself in the organically generated soundscape while wandering through the galaxy!<br/>", "metacritic": null, "released": "2015-10-22", "tba": false, "updated": "2022-07-30T13:47:07", "background_image": "https://media.rawg.io/media/screenshots/e0f/e0f835e31b98fdb24f85b804f51a4f23.jpeg", "website": "http://opus.sigono.com", "rating": 3.14, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 217, "beaten": 12, "toplay": 4, "dropped": 2, "playing": 1}, "playtime": 3, "achievements_count": 31, "ratings_count": 14, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 14, "platforms": ["Nintendo Switch", "iOS", "Android", "PC", "macOS"], "developers": ["SIGONO"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Flyhigh Works", "SIGONO"], "esrb_rating": "Everyone 10+"}