{"id": 300009, "slug": "cinderella-vr-itch", "name": "Cinderella VR (itch)", "name_original": "Cinderella VR (itch)", "description": "<p>Join Cinderella in a family-friendly virtual reality adventure through the classic fairy tale!<br/></p>\n<p>Be transported to a magical land with pumpkin carriages, fairy godmothers and medieval castles! Cinderella's story unfolds in front of you in virtual reality- and invites you to play along with interactive minigames! Lots of fun activities await- cooking puzzles, catching invitations in butterfly nets, a dancing game, and more!<br/><br/>Follow along in this immersive story as Cinderella gets invited to the Prince's Royal Ball, gets a beautiful new gown and rides to the castle in an enchanted pumpkin carriage. Dance with the Prince- but don't stay too late! Race back home before the spell is broken, then help the Prince find Cinderella. Keep the glass slipper from being destroyed by the angry stepsisters, too! With a bit of luck, you'll be able to see Cinderella and the Prince live happily ever after!<br/><br/><br/><br/><strong><em>Minigames include:</em></strong><br/><br/><strong>Flower Gathering</strong><br/>Learn how to interact with Cinderella's world by helping her gather a basket of flowers!<br/><br/><strong>Cooking Puzzle</strong><br/>Cinderella's stepsisters demand dinner, but they're really picky! Find the right ingredients to make them happy.<br/><br/><strong>Invitation Trouble</strong><br/>Cinderella's invitation to the Royal Ball has been destroyed! Help her retrieve all the pieces and put them back together again.<br/><br/><strong>Enchanted Gown</strong><br/>Help Cinderella make a beautiful new dress to wear!<br/><br/><strong>Carriage Ride</strong><br/>Using arcade style controls, drive Cinderella's carriage to dodge obstacles and make it safely to the Prince's Castle!<br/><br/><strong>Let's Dance!</strong><br/>Dance at the Royal Ball in this rhythm game that'll get you moving to the music!<br/><br/><strong>Balancing Act</strong><br/>Dodge to keep the glass slipper from getting broken by the angry stepsisters!<br/><br/><strong>Balloon Pop</strong><br/>Pop balloons with a magic wand!</p>\n<p>Cinderella VR is a friendly VR experience- there's nothing scary in the game, just wholesome fairy tale fun.<br/></p>\n\n<p><strong><em>System Requirements</em><br/></strong></p>\n<p><strong>-Oculus Rift or HTC Vive<br/>-Tracking controllers (no keyboard/mouse/gamepad support)<br/>-Room scale</strong></p>", "metacritic": null, "released": "2019-03-05", "tba": false, "updated": "2019-03-08T03:43:30", "background_image": "https://media.rawg.io/media/screenshots/9d6/9d6651ec7b9c09bc03ffbf6ccb0aa659.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ScottAdelmanApps"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}