{"id": 300043, "slug": "rise-of-the-necromage", "name": "Rise of the Necromage", "name_original": "Rise of the Necromage", "description": "<p>You play as a necromage, with no recollection of your conception. But you can raise the dead! And they are pretty friendly. To you at least. Not so much to the soldiers and peasants of the countryside.</p>\n<p>You travel trough forests and seas, trying to find the head priest, because he might have an anweser to your origin. And on the way you make a lot of Undead.</p>\n\n<p>One of the bigger things I tried. Got inspired by a gamejam entry and tried to give it my own twist.<br/></p>\n<p>As I believe it is quite fun to let your growing undead horde slaughter the enemies, but the art style broke the whole ting for me. I could for the love of me not make it any less of an eyesore. The current art you see, I already touched up a bit. It was even uglier in the earlier stages.</p>\n<p>Thats why this project never went further than this. You have a couple levels, a bit of story, a cheeky sidekick and I think that is enough.</p>\n\r\nI am a single developer and all my games will be free to play over at itchio/steam/etc...\r\nI am currently making games as a hobby. This won't change in the near future, but with enough support via Patreon I can outsource some parts of game-making like art, sound and music. This will not only vastly improve the games, but will make development much faster\r\nhttps://www.patreon.com/korbohned\r\nYour support is very appreciated!\r\nKorbohneD", "metacritic": null, "released": "2019-03-07", "tba": false, "updated": "2019-08-28T23:17:40", "background_image": "https://media.rawg.io/media/screenshots/31b/31b9d74a6b05f799bb31f187c6962ee0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KorbohneD"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}