{"id": 300213, "slug": "les-etoiles-den-bas", "name": "Les Etoiles d'en Bas", "name_original": "Les Etoiles d'en Bas", "description": "<p>Saurez-vous résoudre les énigmes du jeu pour retrouver toutes les étoiles ?</p>\n\n<p>Histoire :</p>\n<p>Il était une nuit au Royaume-Du-Dessus un Roi qui souffrait d’insomnie. N’en pouvant plus du rayonnement des étoiles qui l’empêchait de dormir, il s’approcha de sa fenêtre et hurla :</p>\n<p>\"-Abominables étoiles ! Je vous maudis ! Vous m’empêchez de dormir à vouloir éclairer le ciel chaque nuit ! Je vous ordonne de disparaitre ! \"</p>\n<p>Les étoiles disparurent, les nuits au Royaume Du Dessus se changèrent en ténèbres…Après plusieurs nuits plongées dans le noir les habitants commencèrent à s’agiter. Le Roi devait trouver une solution s’il ne voulait pas perdre sa tête à l’issue d’une révolution.</p>\n<p>Il fit appel à Flag, un Mage Noir très puissant. Ce dernier fusionna l’âme du Grand Héros défunt aux milles exploit dans le royaume (votre âme donc !) avec l’Armure des Dieux. Vous permettant ainsi de vous rendre dans le Royaume-du-Dessous récupérer les étoiles.</p>\n<p>Gameplay : <br/>Le gameplay est principalement basé sur l’exploration et la résolution d’énigmes afin de récupérer les étoiles. (Assez simplistes au début, le jeu n’a pas non plus pour objectif de vous prendre la tête pendant des heures.)</p>\n<p>Les monstres sont directement visibles sur la carte. Si vous vous approchez suffisamment l’Armure des Dieux foncera dans le monstre pour l’éliminer vous faisant perdre une partie de votre énergie.</p>", "metacritic": null, "released": "2019-03-05", "tba": false, "updated": "2019-03-08T04:13:34", "background_image": "https://media.rawg.io/media/screenshots/a60/a609b1c03fd79df65405804b401a1361.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunri"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}