{"id": 3002, "slug": "duke-nukem-manhattan", "name": "Duke Nukem: Manhattan Project", "name_original": "Duke Nukem: Manhattan Project", "description": "<p>Total Mutant Mayhem on Macs!<br />\nDuke Nukem takes his Mighty Boot to the Big Apple. Using G.L.O.P.P. (Gluon Liquid Omega-Phased Plasma), the maniacal Mech Morphix has transformed the creatures of New York City into an army of bloodthirsty mutants. In Duke Nukem: Manhattan Project, Duke must deploy W.I.N. (Weapons, Insults and Name-Calling) to rid the city of goo-based bad guys, and return peace and tranquility to The City That Never Sleeps.<br />\nOriginally released to commemorate the 10th anniversary of Duke Nukem in 2002, Duke Nukem: Manhattan Project blends together the best elements of Duke Nukem 3D and the best 2D sidescrolling of the first two games in the series, Duke Nukem and Duke Nukem II.<br />\nFrom babes, bombs and Battlelords, to goggles, guns and Gargoyles, revisit Duke&#39;s dynasty with these re-released classics. Return to a time when the King Of Action didn&#39;t need regenerative health or auto-aim - a time when action games were actually about action, an era when heroes had the strength to carry as many guns as they wanted and use as many cheats as they needed.<br />\nCelebrate Duke Nukem&#39;s 20th anniversary in sunshade-wearing, quick-quipping style with a title that - alongside the re-release of Duke&#39;s first two adventures - recognizes a series that&#39;s had a tremendous impact on an entire industry, and represents the best of Duke in a way that no other game could.<br />\n<strong><em>   Key Features:   </em></strong><br />\nA Good Day To Duke: Rip &#39;em a new one with 9 brand new weapons, including the G.L.O.P.P. Ray, Pipe Bomb, Pulse Cannon and the almighty &quot;press-to-kill-everything&quot; X-3000.<br />\nNew York, New York:  8 huge levels across various regions of New York City: Rooftop Rebellion, Chinatown Chiller, Metro Madness, Unholy Underworld, Fearsome Factory, Tanker Trouble and Deviant Drilling. And the last level is, let&#39;s say, a little out of town.<br />\nEvil Has A Snout: Blast, jump and smart-ass through more than 25 enemies, including Pig Cops, Gator Grunts, and Roachoids.<br />\nDuke The Director: A dynamic, zoomable camera allows the audience to catch Duke&#39;s best side. Both of them, of course.<br />\nWhat Are You Waitin&#39; For?: A potent blend of old school gameplay and smooth 3D visuals, Duke Nukem: Manhattan Project brings together the best of both Dukes for the ultimate Duke Nukem experience.<br />\nLet&#39;s rock!</p>", "metacritic": 58, "released": "2002-05-21", "tba": false, "updated": "2024-01-07T05:36:01", "background_image": "https://media.rawg.io/media/games/24d/24d7163164c078e49f4c7e45e55fdf9e.jpg", "website": "", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 29, "owned": 624, "beaten": 76, "toplay": 18, "dropped": 37, "playing": 4}, "playtime": 1, "achievements_count": 12, "ratings_count": 80, "suggestions_count": 458, "game_series_count": 10, "reviews_count": 80, "platforms": ["macOS", "Xbox 360", "PC", "iOS"], "developers": ["3D Realms", "Sunstorm Interactive", "Spawn Studios, Lda"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["Ubisoft Entertainment", "1C Company", "3D Realms", "Apogee Software", "Interceptor Entertainment", "HD Interactive", "ARUSH Entertainment", "Spawn Studios, Lda"], "esrb_rating": "Mature"}