{"id": 300288, "slug": "nekotoria", "name": "Nekotoria", "name_original": "Nekotoria", "description": "<p>Note: This game is a prototype!</p>\n<p>This is a game trying to simulate election in an alternate country \"United Kingdom of Great Nekos\", which has a similar political system with Great Britain. </p>\n<p>(\"Nekotoria\" is named after \"Victoria II\", by Paradox Interactive!)</p>\n<p>Top left corner, 3 buttons represents three different levels of difficulty.</p>\n<p>In the middle part, there is a bitmap showing the seats of the House of Lords and House of Commons. </p>\n<p>In the right parts and bottom parts, it shows the statistics and actions you can make. </p>\n<p>You have limited rounds. For each round, you can only do one thing: \"Money Politics\", \"Propaganda\", or \"Debate\".</p>\n<p>If you choose \"Money Politics\", it will increase your seats in the House of Lords; if you choose \"Propaganda\", it will increase your seats in the House of Commons. Neither of these two actions will impact on your politic coordinate. </p>\n<p>If you choose to \"Debate\", then further actions will come out. You have to choose one from the three different actions of debate. Note: you choice will have an influence on your seats of both Houses, and the politic coordinate!</p>\n<p>When your politic coordinate is close to a certain party, you can alliance with it. Just click on the colored rectangle beside its name. </p>\n<p>For different levels of difficulty, the tend that a party will alliance with you, the influence of you actions and debate will vary. </p>\n<p>If you win the House of Commons after all rounds, then you will won the election. However, as the House of Lords have the right to veto your laws, only winning both Houses will be counted as a complete winning. </p><p>//<br/>　　　　　　　　 ,-､　　　　　　　　　,.-､ <br/>　　　　　　　 ./:::::＼　　　　　 　 ／::::::ヽ <br/>　　　　　　　/::::::::::::;ゝ--──-- ､._/::::::::::::::| <br/>　　　　　　 /,.-&amp;dash''\"´ 　　　　　　　　 ＼:::::::::| <br/>　　　　　／　 　　　　　　　　　　　ヽ､::_| <br/>　　　　/　　　　●　　　 　 　 　 　 　 　 ヽ| 𝒩𝓎𝒶 <br/>　　 　 l　　　､､､　　 　 　 　 　 　 ●　　 　 l <br/>　　　 .|　　　 　　　　(_人__丿　　　､､､　 | <br/>:･ﾟ✧ *:･ﾟ✧ *:･ﾟ✧*:･ﾟ.✧:･ﾟ.✧ *:･:･ﾟ✧ *:･ﾟ✧ *:･ﾟ✧*:･ﾟ.✧:･ﾟ.✧ *:･. :･ﾟ✧ *:･ﾟ✧ *:･ﾟ:･ﾟ✧ *</p><p>Enjoy!</p>", "metacritic": null, "released": "2019-03-05", "tba": false, "updated": "2019-03-08T04:23:21", "background_image": "https://media.rawg.io/media/screenshots/d1a/d1af6708177eaa6ccb4cc093ba565b06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Neko Meow"], "genres": [], "publishers": [], "esrb_rating": null}