{"id": 300437, "slug": "cyclewave", "name": "CycleWave", "name_original": "CycleWave", "description": "<p><strong>I didn't have time to finish the game so this is still a work in progress, hope you like it so far though, would love some feedback on what can be improved and added... :D</strong></p><p>A Shoot em up with a twist where you are a buffer sign in a retro world. Imagine you kinda entered an 80s computer and am now getting attacked by mysterious blocks... Did i mention this was a roleplaying game too :D Nah but this was kind of finished last minute so many of the things i wanted to add in i guess you can just kinda imagine in your head. If i could add some other things that would be a timer or score system, enemy loot and a win condition.<br/></p>\n<p><strong><em>Move with:</em> WASD</strong></p>\n<p><strong><em>Shoot with:</em> LeftMouseButton</strong></p>\n<p><strong><em>Goal:</em> Avoid the enemies and bullets for as long as possible, remember your shots are evil! Try and discard of them when you have the chance because when you get hit by a enemy bullet and have the player bullets on you, the damage is much greater! (Btw if you fire your bullets at the enemy bullets you also take damage so be aware of were you fire them!) :D</strong></p>\n<p><strong>SPECIAL THANKS TO:</strong> <em>SammyD </em>for helping with coding and all kinds of other stuff, without your help i would've never been able to make this game! :)</p>\n<p>I hope you have fun with it! :P</p>\n\n<p><strong>Known Bugs:</strong></p>\n<p><em>Main Menu and Game Over screens not optimized for the screen size.</em></p>\n<p><em>MainMenu Music starts late.</em></p>\n<p><em>Player bullets do not spawn back correctly around the Player.</em></p>", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2019-03-08T04:43:34", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e9bf5a09d32b97b351f89bc507728db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mr.Hippo"], "genres": [], "publishers": [], "esrb_rating": null}