{"id": 300401, "slug": "reflecting-on-change", "name": "Reflecting on Change", "name_original": "Reflecting on Change", "description": "<p>Hi!</p><p><strong>NOTE: Run one of the .bat files</strong> if you have a high resolution screen or slow CPU, else it will be too slow!  <strong>ALSO: Don't give up! :)</strong><br/></p>\n<p>\"Reflecting on Change\" is my first game, and was made in about 3 days as part of the Extra Credits Game Jam #3.  It is a game of mirrors and reflection.  It can be finished in about 90 seconds, but I expect most people will take 4-10 minutes.  It only runs on Windows, unless it works under some emulators.  The mouse is locked to the window, so to exit, press the Esc key or Alt+F4.</p>\n<p>If it doesn't run for you on Windows, please let me know!  It might or might not need some Visual C++ runtime to be installed, but I don't know.<br/></p>\n<p>There's much to be improved about it, especially the slow performance, even on mid-range CPUs, and the poor graphical quality, but it is what it is, and I hope you enjoy it!  There's a photosensitive epilepsy warning, because the flashing of the slow redrawing on slower computers can get quite bad.</p>\n<p>To mitigate the slow performance, please run one of the .bat files to run it windowed at a lower resolution if the default full screen is too laggy.</p>\n<p>I have many ideas for a full game that could be made based on ideas from this game, but that will have to wait.</p>\n<p>Thanks for playing, and have fun! :)</p>\n<p>Cheers,<br/>Neil Dickson</p>\n<p>P.S. If you play randomly, there's about a 1/4 chance of finding the Extra Credits \"Walpole\" Easter egg.<br/></p>", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2019-03-08T04:38:34", "background_image": "https://media.rawg.io/media/screenshots/a8e/a8e93cf924a35e39d1f3365d16f97220.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neil Dickson"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}