{"id": 300543, "slug": "mtb-game-demo", "name": "MTB Game Demo", "name_original": "MTB Game Demo", "description": "<p>The MTB Game Demo is the first playable prototype of the developing mountain bike simulator. It presents you MTB School which consists of nine lessons. Each of them can be passed on satisfactory, good or excellent mark. The key feature of this simulator is maximally true physics including suspension working, balance maintain, interaction with the trail and aerodynamic.</p>\n<p>Longer video of riding:</p>\n<p>Video about suspension in the game: </p>\n<p>To enjoy playing MTB Game Demo your computer should meet following requirement:<br/></p><p>1. Operating system – Windows XP or newer<br/></p>\n<p>2. Processor – Intel i5 or better</p>\n<p>3. GPU – NVIDIA GeForce GTX 660 or better</p>\n<p>4. RAM – 2 GB or more</p>\n<p>5. Joystick or joypad</p>\n<p>This game is simulator, so joystick is what you must have to enjoy playing. However, technically, all controls could be assigned to keyboard and mouse with pressed right button will control turn and move forward/backward channel. So, at least you may pass first two lessons without joystick.</p>\n<p> To change graphical settings you can edit “graphic_settings.txt” file from the game folder (all parameters are well described there). I am not sure about all settings that will be present in full version, so I didn’t put them to the game menu.</p>\n<p> It is the first release, so errors and launch problems are expectable. You can help me to solve them be providing a problem description with \"shaders_log.bin\" file (will appear in the application folder) to the following address:   MTBGameDemo2019@gmail.com</p>\n<p>Game website: https://www.mtbsimulator.com<br/></p>", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2019-03-08T04:58:52", "background_image": "https://media.rawg.io/media/screenshots/321/3212e81dd05e6648a6ca0b62fcf4f543.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aleksandr_NK"], "genres": ["Simulation", "Sports", "Racing"], "publishers": [], "esrb_rating": null}