{"id": 30057, "slug": "blade-runner", "name": "Blade Runner", "name_original": "Blade Runner", "description": "<p>In 1997 Westwood Studios released a title that won universal praise from gamers and critics all around the world, along with accolades like AIAS’s Adventure Game of the Year award. Set in the same time and universe as the 1982 classic science fiction film by Ridley Scott, Blade Runner video game is now making a big comeback on modern computers.<br />\nIn the game, you take the role of detective Ray McCoy. Armed with your investigative skills and tools of the Blade Runner trade, you must roam the dark, rainy streets of Los Angeles A.D. 2019 in pursuit of androids gone rogue. Searching for those so-called replicants is a tough nut to crack because they look and behave almost exactly like real people. Faced with growing moral dilemmas, McCoy will soon have to answer questions about his own humanity.<br />\nFeatures:<br />\nImmerse yourself in the dark, gritty world of Los Angeles 2019, where you become both the hunter and the hunted.<br />\nExplore over 100 interactive environments including sets from the Ridley Scott’s 1982 movie.<br />\nTake part in a non-linear story that creates a unique experience every time you play.<br />\nInteract with over 70 motion-captured characters, all with their own AI and agendas.<br />\nWitness the climatic noir-style visuals, engulfed in smoke and rain.<br />\nRecognize the Hollywood cast from the original film including Sean Young, James Hong, Joe Turkel, Brion James, and William Sanderson.<br />\nListen to the ambient, multi-track audio and hear the music which includes specially recreated cuts from the original Blade Runner soundtrack.<br />\nStep into the role of detective Ray McCoy and utilize Blade Runner tools you know from the movie. Use ESPER photo analysis machine to distinguish replicants from humans, and analyze all case clues with the Knowledge Integration Assistant.</p>", "metacritic": 53, "released": "1997-11-21", "tba": false, "updated": "2023-07-24T11:03:08", "background_image": "https://media.rawg.io/media/games/8a1/8a1caa9a69ba9977caf6d3f42f4fd275.jpg", "website": "", "rating": 4.17, "rating_top": 5, "added_by_status": {"yet": 39, "owned": 152, "beaten": 34, "toplay": 40, "dropped": 13, "playing": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 43, "suggestions_count": 604, "game_series_count": 3, "reviews_count": 42, "platforms": ["Linux", "macOS", "PC"], "developers": ["Westwood Studios"], "genres": ["Adventure"], "publishers": ["Virgin Interactive Entertainment", "Alcon Interactive Group"], "esrb_rating": "Teen"}