{"id": 300548, "slug": "not-so-advance-wars", "name": "Not So Advance Wars", "name_original": "Not So Advance Wars", "description": "<p>Lors de la découverte du thème de cette jam #19, j'ai tout de suite eu envie de faire <strong>un jeu multijoueurs en ligne</strong>. Comme c'est quelque chose de très nouveau pour moi, je n'ai pas cherché l'originalité au niveau du gameplay ou des graphismes pour me concentrer sur la seule réalisation : je suis donc parti sur l'implémentation d'un Advance Wars.</p>\n<p>Côté client, j'ai choisi le couple Lua/LÖVE parce que c'est la seule technologie de jeu que je maîtrise à ce jour. Côté serveur, j'ai choisi Elixir parce que c'est un langage que j'aime et adapté à ce genre de serveur de jeu . Je reviens sur les aspects techniques plus bas. Comme d'habitude, tout le code est disponible sur GitHub : le client comme le serveur.</p>\n\n<p>Je n'avais jamais travaillé avec les sockets (en l'occurrence TCP) et ça n'a donc pas été facile de mettre le pied à l'étrier. Le processus de développement était assez laborieux puisque je testais avec deux ordinateurs. Je n'ai pu travailler que la dernière semaine de la jam : il y a donc 7 jours de travail acharnés derrière tout ça, à environ 10 heures par jour. Vive les vacances scolaires pour les enseignants !</p>\n<p>La mise en production du serveur (sur une serveur dédié Debian que je loue) a été triviale grâce à Distillery. Cet outil crée des exécutables à partir des sources Elixir et qui permettent de lancer le jeu en background, en foreground ou bien en foreground avec une console interactive (pour pouvoir surveiller ce qui se passe, intervenir, se rajouter de l'argent).</p>\n<p>Le jeu fonctionne sans base de données : tout est stocké en mémoire le temps de la partie, et la liste des joueurs connectés et des lobbies ouverts est stockée en mémoire pour toute la durée d'exécution du serveur. Elixir permet de lancer des \"processus\" qui tournent simultanément et attendent des messages. En l'occurrence ici j'en ai 3 : un qui gère les joueurs connectés (il maintient une liste au gré des connexions/déconnexions), un qui gère les lobbies (pareil, il maintient une liste des lobbies ouverts, les ferme quand un joueur quitte ou que la partie pour ce lobby démarre) et enfin un process pour chaque partie lancée, qui reste ouvert jusqu'à la fin de cette partie.</p>\n<p>Côté Lua, j'aime toujours la simplicité du langage mais je m'exaspère de la pauvreté de sa librairie standard et de son écosystème. Je pense changer bientôt de techno, sans doute au profit du langage Haxe et de l'un de ses nombreux moteurs.</p>\n<p>Le jeu fonctionne essentiellement avec des machine à état : l'app est une machine à états avec un état par écran : l'écran principal avec les joueurs connectés et les parties, l'écran qui affiche la partie en cours et l'écran de cinématique de combat. Chacun de ces écrans est également une machine à états. Et enfin dans la cinématique de combat, le background et chaque unité affichée est une machine à états également ! Cela m'a permis d'organiser <em>assez facilement </em>le déroulement d'un combat (et donc son animation).</p>\n<p>Les graphismes sont ceux d'Advance Wars, piochés sur spriters-resource.com. Les quelques effets sonores proviennent de soundbible.com et de Kaamelott pour le cor.<br/></p>\n<p>Je vous attends sur le jeu !</p>", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2019-03-08T04:59:30", "background_image": "https://media.rawg.io/media/screenshots/018/018f94b41a18c12d0941d3013a68056b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sephi-Chan"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}