{"id": 300623, "slug": "full-year", "name": "Full year", "name_original": "Full year", "description": "<p>Full Year is a game build from the idea that the different cycles of the Earth (Seasons) can work as mechanics to enhance a challenging platform by modifying the environment in which the game takes place and the way you interact with it. It is also a game that exposes the player to the idea that when a loved one is in danger time is of the essence.</p>\r\nStory \r\n<p>Full Year wakes up one day to find his beloved friend Seasons missing. Armed with determination and courage he ventures into the wild to try and find his best friend before is too late.</p>\n<br/>South Team Studios\r\n<p>S.T.S is a collective/platform created and developed by Andrés Merchán (Colombia), Santiago Romero (Colombia), and Fernando Mayorga (Mexico), for them to create and develop Video Games; (kind of) a Virtual Video Game Studio.</p>\n<p><strong>*iammayro@gmail.com    </strong></p><p><strong>https://iammayro.com</strong></p>\n<p><strong>**diegorosemary94@gmail.com </strong></p><p>https://www.instagram.com/diegorosemary94/</p>\n<p><strong>***mechanicalmediamusic@gmail.com</strong></p><p>http://mechanicalmediamusic.com/</p>\r\nDonations\r\n<p>This game is totally free, however, if you want to donate to help us develop more games, feel free to do it from the following link.</p>\n<p>https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=Q6LUD39692A...</p>\r\nChallenges Completed\r\n<p>1) Extra Credits: Include in-game credits for everyone who worked on your game with you. Bonus points for including everyone/everything who contributed to your game in even the slightest way possible.</p>\n<p>2) Extra Time: Make a game that encourages multiple playthroughs in some way. For example, something like a simple high score system, or something a bit more complex like multiple playable characters.</p>\n<p>- Multiple ending that change according to the amount of years it took you to complete the game.</p>\n<p>*Does this game include flashing lights/colors, loud noises, or jump scares? .... <strong>No</strong><br/>**Is any part of this game not family-friendly, or discusses sensitive/dark/controversial topics (such<br/>as graphic violence, emotional abuse, slurs, etc.)? .... <strong>No</strong></p>", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2019-03-08T05:10:00", "background_image": "https://media.rawg.io/media/screenshots/e63/e6382d59f916f9f0a931d967bb0701d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["iammayro"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}