{"id": 300686, "slug": "megaman-zero-3", "name": "MegaMan Zero 3", "name_original": "MegaMan Zero 3", "description": "<p>Mega Man Zero 3, known in Japan as Rockman Zero 3 (ロックマンゼロ3, Rokkuman Zero Surī), is a video game developed by Inti Creates and published by Capcom for the Game Boy Advance (GBA) handheld game console. It is the third video game in the Mega Man Zero series of Mega Man video games.</p>\n<p>This game follows almost exactly the same rules as its predecessor, Mega Man Zero 2. Once again, Zero has his Z-Saber, Buster, and Shield Boomerang. However, Zero&#39;s rod weapon (originally the Triple Rod in Mega Man Zero and the Chain Rod in Mega Man Zero 2) has been replaced with the Recoil Rod: a pair of tonfa-like weapons that can be aimed in all directions. When charged up, a powerful stabbing attack is performed, which can knock enemies back, or propel Zero into the air if aimed down to the ground, like a makeshift pogo stick.</p>\n<p>The Cyber Elf system has been given an overhaul with the introduction of Satellite Cyber Elves. These are different from the standard Cyber Elves, which have been renamed &quot;Fusion Elves&quot;, in that they are equipped for a constant benefit, and the use of them will not affect the mission ranking score. However, only two Satellite Elves can be equipped at once.</p>\n<p>Cyberspace is a new addition to the game. It is said by one Resistance Member (Hirondelle) that the portal to Cyberspace opened up due to Omega&#39;s arrival. Going through the door to Cyberspace leads the player into an area that looks exactly like the one in which they left but with a green tinge to it. Enemy appearances are less frequent and if a transfer of info from a Mega Man Battle Network 4/Mega Man Zero 3 link has been performed, certain virus enemies from the Battle Network Series will appear. All enemies drop health items (instead of other items, such as Secret Disks) in Cyberspace. Entering the Cyberspace causes certain Cyber Elves (both Fusion and Satellite, the ones with the A-mark on the lower left) to auto-activate without dying, even if not grown enough to be normally used, and these Elves do not affect the score. However, going into Cyberspace decreases the mission ranking score, making it more difficult to obtain an S or A Rank, which is needed in order to win EX Skills of the end-of-stage bosses. Zero no longer needs to &quot;level up&quot; in order to create weapon combos as they are already in place.</p>", "metacritic": null, "released": "2004-10-05", "tba": false, "updated": "2023-10-30T17:18:04", "background_image": "https://media.rawg.io/media/games/792/79223e08282669a77c0451d10f23277f.jpg", "website": "", "rating": 4.62, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 4, "beaten": 10, "toplay": 4, "dropped": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 8, "platforms": ["Game Boy Advance", "Nintendo DS"], "developers": ["Inti Creates"], "genres": ["Action", "RPG", "Platformer"], "publishers": ["Capcom"], "esrb_rating": "Everyone"}