{"id": 300737, "slug": "the-riftbreaker", "name": "The Riftbreaker", "name_original": "The Riftbreaker", "description": "<p>You play the role of captain Ashley S. Nowak - you are the Riftbreaker, an elite scientist/commando inside a powerful Mecha-Suit. Enter a one-way portal to Galatea 37, a distant planet at the far reaches of the Milky Way Galaxy, with the purpose of building up a base that will allow travel back to Earth and further colonization. Ashley&#39;s Mecha-suit, which she calls &quot;Mr. Riggs&quot;, can withstand the harshest environmental conditions and has a full range of equipment for base construction, resource extraction, gathering specimens and of course - combat. It is capable of traveling through rifts that connect space across vast distances.BASE BUILDING<br />\nYour task is to construct a two-way rift back to Earth. It is a very complex invention and requires enormous amounts of energy. Simple solar collectors and a few tons of steel will not be enough. You will need to build up a complex chain of mines, refineries, powerplants and research facilities to complete this mission.EXPLORATION<br />\nGalatea 37 is an unknown planet in the Sycorax belt of the Milky Way galaxy. Long distance surveys detected that it is inhabitable and perfect for colonization. The planet is full of rare minerals and substances that can be found in various locations around the globe. Varied biomes can surprise you with unknown fauna and flora as well as harsh weather conditions. Construct local outposts in resource-rich locations that will transport the required resources using rift technology.DEFENSE<br />\nYour presence on this planet will not go unnoticed. As you build up your industry and disrupt the natural order, the world will start seeing you as a threat. Build up your defenses. Construct walls, barriers and defense towers as the attacks get stronger with every passing day. You will face thousands of hostile creatures trying to eliminate your presence.HACK, SLASH, SHOOT<br />\nMr. Riggs can be equipped with powerful weapons and abilities that will allow you to take on the largest of beasts. You will need to be ready to face lots of hostile alien creatures as you scout the planet.GATHER SAMPLES AND STRANGE ARTIFACTSFallen beasts will drop valuable research specimens as well as rare resources. Use everything that you can gather to research and craft new technologies, buildings, weapons, and equipment. You can also scout the terrain using your sensors and dig for treasure buried underground.RESEARCHUse the samples that you&#39;ve gathered to research new technologies that will help you build up your base, improve your defenses, develop new blueprints for your Mecha-suit or improve existing technologies.CRAFTMr. Riggs is fully customizable and upgradeable. Use the blueprints that you&#39;ve researched to craft new parts and weapons. Utilizing better materials for the crafting process results in developing gear with improved properties. Each crafted item has unique properties.INTERACTIVE STREAMINGThe Riftbreaker™ has built-in integration with the most popular streaming services out there. The stream&#39;s audience can actively participate in the game through multiple options, e.g. by voting to send waves of new enemies, spawn environmental disasters like a tornado or by donating resources.THE SCHMETTERLING ENGINEThis game is built using the latest iteration of EXOR Studio&#39;s in-house developed Schmetterling 2.0 engine which was previously used to create X-Morph: Defense and Zombie Driver. We pride ourselves in delivering fluid gameplay and utilizing all of your hardware&#39;s capabilities - uncapped frame rate, support for widescreen monitors, customizable controls and more.COMMUNITY DRIVEN DEVELOPMENTIf you&#39;ve read everything and arrived all the way down here, then you might be interested in helping us shape the game. Please come and talk to us on the forums, our official Discord server or through any other of our social media. We&#39;ll be sharing inside info about our development progress, and we&#39;d love to hear your feedback. Please come and help us make Riftbreaker the game You want to play!</p>", "metacritic": null, "released": "2021-10-14", "tba": false, "updated": "2024-03-10T11:25:08", "background_image": "https://media.rawg.io/media/games/97d/97d257af0b770c67c92b523f8900c783.jpg", "website": "http://www.riftbreaker.com/", "rating": 3.87, "rating_top": 4, "added_by_status": {"yet": 28, "owned": 474, "beaten": 34, "toplay": 53, "dropped": 50, "playing": 13}, "playtime": 6, "achievements_count": 76, "ratings_count": 76, "suggestions_count": 560, "game_series_count": 0, "reviews_count": 78, "platforms": ["PC", "Xbox One"], "developers": ["Exor Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Exor Studios"], "esrb_rating": null}