{"id": 300716, "slug": "drumpfy-walls", "name": "Drumpfy Walls", "name_original": "Drumpfy Walls", "description": "Drumpf, God King of Mer'ca has declared a national emergency. Jump into an alternate reality where two okay countries, Mer'ca and Mer'xico are politically fighting over a border wall. Play as members of two groups, the \"Reds\" and the \"Blues\" as they face off each other in a literal battle over immigration and future votes.<br/><br/><br/>VISIT EXOTIC LOCATIONS ALONG BORDER BETWEEN MER'CA AND MER'XICO<br/><ul><li>The Bigly Valley - A lush valley with rivers, trees, and lots of wildlife<br/></li><li> The Beloved Forest - A huge, beautiful giant wood reserve<br/></li><li> The Passage - Where people used to move across the continent for centuries<br/></li><li> Watertown - Surrounded by lakes and rivers, hence the name  </li></ul><br/><br/><br/>ZANY CHARACTERS BATTLE AT THE BORDER<br/><ul><li>The \"Reds\" are tired of Mer'xicoan just waltzing across, you'll be bouncing babies back to Mer'xico<br/></li><li>The \"Blues\" think babies should become a citizen of Mer'ca, no problem. Bounce a baby over that wall to Mer'ca </li></ul><br/>BOOST UP OR DOWN WITH DRUGS SMUGGLED IN THE WALL<br/><ul><li>Bernie's Flakes - A white substance that boost your speed<br/></li><li>Big Blunt - A smoking cigar that slows your speed</li></ul><br/>WATCH OUT FOR OTHER CRAZY HAZARDS<br/><ul><li>UFO'S - These unidentified flying objects rain your worst fears down. Literally<br/></li><li>Bomb's - Built into the wall as a defense against invaders</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:49", "background_image": "https://media.rawg.io/media/screenshots/3e3/3e37e0ffd15ca8a5c2756c4c8774cebb.jpg", "website": "http://www.hotbox.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hotbox Garage"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Hotbox Garage"], "esrb_rating": "Adults Only"}