{"id": 300714, "slug": "monster-mashing-deluxe", "name": "Monster Mashing Deluxe", "name_original": "Monster Mashing Deluxe", "description": "Move LEFT and RIGHT to (s)mash some cute monster girls while dodging boulders.<br/>Slow down or get left behind and you lose!ADDITIONAL CONTROLS- and + to change volume, and 0 to mute<br/>Z, SPACE, ENTER to select<br/>A and D for the left-handed and smaller keyboardsGAME FEATURES<ul><li>5 Dungeon Palettes<br/></li><li>7 Unique Girls to Encounter w/Shiny Color Variants<br/></li><li>No delay between runs</li></ul>A BRIEF HISTORYMonster Mashing was initially created by ninjamuffin99, Digimin, and BrandyBuizel for the \"Strawberry Jam 2\" Game Jam and the original release was completed in 3 days made from the scraps of a cancelled RPG the group had initially planned to make.<br/><br/><br/>Initially published on Newgrounds March 1st 2018 and was so well received the game was continually updated to meet player expectations. For months users one-upped each other on the leaderboard, even becoming one of the most played games on the website that year, giving reason to tighten up the controls as well as add new monster girls and dungeon palettes in order to keep those long runs entertaining. <br/><br/>For its release on Steam the game underwent a massive overhaul, re-doing characters sprites, adding rare shines, a gallery, controller support, and more. Where this version includes 7 original monster girl designs, the original release, which became unbelievably popular, only had 2 girls and 1 dungeon palette.<br/><br/>This is the debut title created by the group \"Demins\"", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:49", "background_image": "https://media.rawg.io/media/screenshots/da7/da79352248ad03c7c003d047bd9225bd.jpg", "website": "https://twitter.com/shamedevs", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Demins"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Scarecrow Arts"], "esrb_rating": null}