{"id": 300771, "slug": "worlds-bane", "name": "World's Bane", "name_original": "World's Bane", "description": "<p>Invade worlds<br />\nWorld&#39;s Bane is a simulation strategy game where the player is a demon overlord invading randomly generates fantasy worlds. Inspired by story generators like RimWorld, Crusader Kings 2 and Dwarf Fortress, players will be able to explore, exploit and corrupt worlds populated by fully simulated characters with AIs governed by their traits, needs and relationships.Influence emergent stories<br />\nEach playthrough will generate a random fantasy world for the player to invade. Rather than using military force, the player must instead rely on his minions for subterfuge. Gather information about the world, the people inhabiting it and most especially the events that are taking place. Wielding Intel and using it against the world&#39;s defenders is the key to victory.<br />\nThe King has a paramour? Tell this to his Queen and watch as the scorned woman poison her lover&#39;s food. The Hero secretly dabbles in taboo acts? Inform his neighbors and they just might have him expelled from their faction. Then corrupt or recruit him while he is at his lowest point.<br />\nIn this game, knowledge trumps all. Use your wits to figure out the best way to utilize a piece of information for your agenda. While the goal is to eventually wipe out all factions, the best fun you might have in the game is just from simply playing with these characters&#39; lives.An overlord needs minions<br />\nYou influence the world using your minions. You may summon demons from the portal occasionally, but the bulk of your followers will come from corrupting and recruiting characters that populate the land.<br />\nAssign 5 Agents of Chaos to do your bidding:<br />\nSpy - An agent that gathers information about places and characters.<br />\nSeducer - An agent that corrupts heroes and recruits new minions.<br />\nDiplomat - An agent that builds relationships with other factions.<br />\nInstigator - An agent that sows discord and chaos.<br />\nDebilitator - An agent that halts unwanted actions and activities.Warfare is a last resort<br />\nThis game is not combat-focused. In fact, you&#39;re already in dire trouble if a faction has turned its eye on you and your portal. Assaulting a faction&#39;s settlement is the final step of wiping them out once they have been weakened enough from the actions you have done behind the scenes. In rare instances that you have to fight, the game employs a simple automated combat comprising of four characters on each side. The key to winning these skirmishes is by figuring out your opponent&#39;s strengths and weaknesses and forming the perfect party to defeat them.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-04T15:57:07", "background_image": "https://media.rawg.io/media/screenshots/de5/de5978dfedf6b30a253b9d1761e34878.jpg", "website": "http://www.maccima.ph", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 52, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 18, "ratings_count": 3, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Maccima Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Maccima Games"], "esrb_rating": null}