{"id": 300853, "slug": "off-road-mountain-heavy-excavator-crane-op", "name": "Off-Road Mountain Heavy Excavator Crane Op", "name_original": "Off-Road Mountain Heavy Excavator Crane Op", "description": "Like heavy machinery, crane operator and rescue games? Be the driver of a snow plow, excavator crane and dump truck to carry out the rescue operation in the mountain!<br/><br/>Heavy Excavator Crane Snow Plow Dump Truck Driving brings you the best excavator crane operator simulator game, with three different types of controls for the crane! Be ready to drive in the dangerous mountain with your snow plow and blow the snow out of the way! Make sure you don't crash the snow plow as you clear the way! Become a dump truck driver and take the snow to the dumper location, while evading snow slides in the most dangerous mountain range!<br/><br/>If you are a fan of heavy machinery, snow excavator crane, rescue operation, snow plow and truck driver games, then Heavy Excavator Crane Snow Plow Dump Truck Driving is the best game for you! Equipped with the most realistic snow excavator operator controls, giving you the best crane operator simulator to let you experience the thrill of clearing the ice blocking the road in the mountain and to help open up the traffic and rescue the people! Also experience the thrill of driving the snow plow and dump truck at the same time!<br/><br/>Heavy Excavator Crane Snow Plow Dump Truck Driving is equipped with amazing 3D visuals, engaging sound-effects, making you feel like a heavy machinery excavator operator, a snow plow and a dump truck driver, giving you the thrill of being a hero and rescuing people trapped due to snow-sliding in the mountain! Enjoy the chilly environment, with snow flakes falling and a blizzard brewing up as you carry out your rescue operation!<br/><br/><br/>Heavy Excavator Crane Snow Plow Dump Truck Driving Game Features:<br/>- Mind-Blowing 3D Graphics<br/>- Snowy Environment with a Blizzard Blowing<br/>- Realistic, Authentic and Engaging Sound Effects to give you the best Simulation Experience<br/>- Outstandingly Smooth and User-Friendly Controls<br/>- 3 Different Types of Heavy Machinery Vehicles to Control, including the Snow Excavator, the Snow Plow and Dump Truck<br/>- Full Control over Heavy Machinery's Snow Excavator Crane, with 3 Different Types of Movements in the Excavator Op Mode<br/>- Multiple Camera Angles to give you the Best Views<br/>- Multiple Missions to keep you Engaged all Day<br/><br/>Go ahead, download this excavator simulation game and enjoy the thrill of using an excavator, snow plow and dump truck, for a 3-in-1 experience!", "metacritic": null, "released": "2017-03-02", "tba": false, "updated": "2019-07-29T21:25:32", "background_image": "https://media.rawg.io/media/screenshots/89a/89a124f4ecaa50f323e6cd00bc369c9d_nPLeiL6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fawad Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Fawad Ahmad"], "esrb_rating": null}