{"id": 300845, "slug": "village-farming-simulator-2018", "name": "Village Farming Simulator 2018", "name_original": "Village Farming Simulator 2018", "description": "Gear up for the most realistic farming experience. Play as a farmer and cultivate your own land by sowing the crops using a realistic Seed Drill. Experience real-time farming with Farming Simulator 2017 Pro Off-Road. Your farm duty begins at the village as a hill farmer  with your heavy tractor and ends on your big trailer truck. Harvest and sell them in the market for cash and earn the proud title of the king or queen of agriculture. Begin the duty and drive the heavy trailer truck to the city as the pro driver to get the farm tractor to the village. Enjoy multiple driving experience with different tasks to accomplish. Time to work in the mountain valleys as the hill farmer to drive tractor, truck, seeders and harvesters. Manage your own big farm with the latest machinery to enjoy farming. Agriculture simulation, harvesting and growing crops at your own big farm. Farming Simulator 2017 Pro Off-Road is an agriculture and cultivation simulation game. Cargo transportation, farm truck driving and tractor drive all there with realistic physics. <br/><br/><br/>Features of Farming Simulator 2017 Pro Off-Road<br/><br/>- Realistic tractor farming simulator <br/>- Manage everything at your own farm <br/>- Realistic 3D Offroad environment<br/>- Enjoy all stages of having a farm <br/>- Get out in the field and harvest your crops <br/>- Multiple farming machine including Tractor, Harvester, Seed Drill and Sprayer<br/>- Grow Wheat, Barley and Canola at your farm<br/>- Sow and Harvest the crops with realistic Farming machines<br/>- Find the selling place offering highest price to maximize your profits.", "metacritic": null, "released": "2017-02-21", "tba": false, "updated": "2019-10-22T14:34:07", "background_image": "https://media.rawg.io/media/screenshots/75b/75bd54aed53e7744de0794a675da65a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fawad Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Fawad Ahmad"], "esrb_rating": "Everyone 10+"}