{"id": 300997, "slug": "league-of-light-the-gatherer-hidden-objects", "name": "League of Light: The Gatherer - Hidden Objects", "name_original": "League of Light: The Gatherer - Hidden Objects", "description": "Play the trial for FREE!  Pay once &amp; complete the adventure!<br/><br/>It’s time to return to Blake Mountain again, where The Hunter has asked the League of Light for help. He feels that someone, or something, is stalking him and his family, and the locals are afraid of a dark entity that turns people into scarecrows. When you arrive though, you learn that somebody is already there claiming to be a League agent, and you’re to be arrested as a fake!<br/><br/>• UNCOVER THE GATHERER’S DARK AND DEVIOUS PLAN!<br/>What does this villain want with Hank Hunter and his son? And who is this person pretending to be a League of Light agent?<br/><br/>• CAN YOU FIND THE IMPOSTOR IN TIME?<br/>Track down this fake agent through a world of spooky hidden object scenes.<br/> <br/>• YOUR LITTLE SCARECROW FRIEND IS BACK TO HELP YOU OUT<br/>Use your buddy’s special abilities to solve sinister puzzles and mysterious mini-games.<br/><br/>• YOUR ADVENTURE CONTINUES IN THE EXCITING BONUS CHAPTER<br/>See how the rest of this story develops and enjoy additional Collector’s Edition exclusives including collectible Owls, special achievements, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2017-05-07", "tba": false, "updated": "2019-06-21T02:44:28", "background_image": "https://media.rawg.io/media/screenshots/f4b/f4bc4b9014d93d44b9381315f000e232_Ey1hfNK.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}