{"id": 300900, "slug": "fantastic-jungle-animals-pictures-for-kids-free", "name": "fantastic jungle animals pictures for kids - free", "name_original": "fantastic jungle animals pictures for kids - free", "description": "fantastiques animaux de la jungle pour les enfants - jeu gratuit<br/><br/>Ce jeux est fait spécialement pour les enfants. La difficulté et ses graphismes sont adaptés pour un jeune public (moins de 8 ans).<br/><br/>Cette application est composée de deux jeux différents :<br/><br/>premier jeu :<br/>Dans ce jeu votre enfant utilise un maillet pour taper sur des taupes surgissant d'un trou. Le but est de faire un maximum de points dans un minimum de temps. Jouable à un ou <br/><br/>deux joueurs. A chaque niveau passé votre enfant gagne une photo d'animal de la jungle.<br/><br/>deuxiéme jeu :<br/>Dans ce jeux, différents objets apparaissent sur un tapis roulant. Pour gagner il faut supprimer les objets inutiles. Seul les objets demandés doivent tomber dans le panier au <br/><br/>bout du tapis roulant. A chaque niveau passé votre enfant gagne une photo d'animal de la jungle.<br/><br/><br/>Caractéristiques  :<br/>- Gameplay adapté aux enfants.<br/>- univers adapté aux enfants sur le théme des animaux de la jungle.<br/>- trois niveaux de difficulté.<br/>- interface simple adapté aux enfants.<br/>- 2 jeux différents disponibles.<br/>- 2 joueurs possibles sur un même appareil.<br/>- 40 images d'animaux de la jungle à libérer.<br/><br/><br/>les langues suivantes sont disponibles :<br/>albanais, allemand, anglais, basque, catalan, croate, danois, espagnol, estonien, français, finnois, galicien, gallois, hongrois, indonésien,irlandais, islandais, italien, <br/><br/>letton, lituanien, malaisien, neerlandais, norvegien, polonais, portugais, roumain, slovéne, slovaque, suedois, tagalog, tcheque, turc, finlandais, maltais.", "metacritic": null, "released": "2016-07-01", "tba": false, "updated": "2019-10-22T14:34:10", "background_image": "https://media.rawg.io/media/screenshots/b60/b60138626859a03ecc7fbb546a38029b_e3ZTSUe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["witkowski micael"], "genres": ["Family"], "publishers": ["witkowski micael"], "esrb_rating": "Everyone 10+"}