{"id": 300987, "slug": "vr-traffic-bike-rider-extreme-end-less-racing-3d", "name": "VR Traffic Bike Rider: Extreme End-less Racing 3D", "name_original": "VR Traffic Bike Rider: Extreme End-less Racing 3D", "description": "Are you looking for a top VR based bike racing game? If Yes! Then Strap yourself and Burn up the racing tracks with the fastest and thrilling adventurous tracks for you first time in Virtual Reality and experience the real thrill and adventure of 3D bike stunts.  And it's absolutely free!<br/>“VR Highway Moto” is a milestone in the genre of VR bike racing where you experience to drive real deadly racing on crazy asphalt racing tracks.<br/><br/>Your goal in the game is to Drive your bike, collect pickups and perform dangerous stunts to challenge your skills by achieved best time target forever.<br/><br/>“VR Highway Moto” is a tremendous achievement in the genre of VR gaming that lets you a play combines with stunning, HD quality graphics that let you explore a virtual world while playing in the comfort of your own home.<br/><br/>Tap on the nitrous and thrust full to experience the real speed of your bike in the ultimate turbo racing game. Build your racing career by completing all the challenging missions.<br/><br/>This game is all about adventure. Avoid accidents with other deadly traffic vehicles and Get READY to astonishing physics, eye-popping tracks which provides the best motorcycle gaming on straight roads with incredible high speed race tracks experienced by challenging and dangerous roads.<br/>Prove that you are the best motorbike racer!<br/><br/>Key Features:<br/><br/>• Stunning 3D HD quality graphics<br/>• Smooth and realistic bike handling<br/>• Different speed boosters to increase the speed<br/>• VR based 3D Environment <br/>• Gyro-meter based 360 degree rotation <br/>• Crisp, Cinema like, HD visuals Different exciting racing tracks<br/>• No time Limit, unlimited play and fun Easy to learn and drive<br/>• Realistic bike physics stunts<br/>• Best suited music tracks for locations and races", "metacritic": null, "released": "2017-01-09", "tba": false, "updated": "2019-10-22T14:34:16", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e3042fd7b7793ecafd0ce1b2da81321.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["Action", "Racing"], "publishers": ["jolta technology"], "esrb_rating": "Everyone 10+"}