{"id": 300959, "slug": "planet-labyrinth-3d-space-mazes-game", "name": "Planet Labyrinth - 3D space mazes game", "name_original": "Planet Labyrinth - 3D space mazes game", "description": "3D space maze games for kids to find the way out in the labyrinth planet<br/>Planet Labyrinth - 3D space mazes for kids is a 3D maze game where your goal is to guide the ball into the black hole on a 3D planet maze board by simply tilting the board using your device. The ball has to get into the black hole goals to complete the mission and to continue to play on another planet. This is a game of skill and dexterity! It’s perfect for kids and children to perform their motor skills. It is a fun brain game with logic and strategy. Your kids will love searching for the exit of the maze. <br/>There are 10 different levels on our space based Planet Labyrinth maze game. The story goes in our Solar System planets around the Sun. You will start on the coldest planet Mercury and continue to the farthest planet, Pluto, from Earth. Feel the heat of Mars, play close to the rings of Saturn and get lost in the grand Jupiter! And do not get dizzy on Venus rotating opposite direction! This educative game is also perfect for preschool children or toddlers as well. While they are enjoying our 3d tilt game, they can learn also learn the names of the planets!<br/>Download now and start to play with beautiful 3D graphic effects and nice music. You can also save and share your final result on the labyrinth.<br/>If you like our app, please rate and comment to help us improve!<br/>You can buy a version without ads.", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2019-10-22T14:34:14", "background_image": "https://media.rawg.io/media/screenshots/692/692638a381bdabc41b40a1316c46cd93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bonifacio Melero"], "genres": ["Arcade", "Puzzle"], "publishers": ["Bonifacio Melero"], "esrb_rating": "Everyone 10+"}