{"id": 3010, "slug": "dawn-of-discovery-harbor", "name": "Dawn of Discovery - Harbor", "name_original": "Dawn of Discovery - Harbor", "description": "Check out our Awesome Reviews!<br/>****<br/>“Score: 8 out of 10. Lush presentation, excellent visuals, and a truly rousing soundtrack – the whole experience is as polished as the deck of a Royal Navy frigate.” – PocketGamer.co.uk<br/><br/>“Score: 4 out of 5. Dawn of Discovery takes a very complex PC game and turns it into one of the iPhone&amp;#39;s more popular genres, the time management sim. If you love time management games, this is worth the price.” – AppSpy.com<br/><br/>“Score: 4 out of 5.  Dawn of Discovery - Harbor is an excellent and beautiful time-management game set in a legendary Dawn of Discovery universe true to all of the canons of the genre.” – TouchMyApps.com<br/><br/>**************<br/><br/>The successful Dawn of Discovery PC game series now continues on your iPhone or iPod Touch! Prove yourself in this new, thrilling time management game and become a successful harbor master in Dawn of Discovery – Harbor! Develop your skills as a harbor master and manage the incoming and outgoing ships and goods to meet traders’ needs. The more effectively you handle arriving ships and the faster you serve their traders, the more you’ll be rewarded!  <br/><br/>Earn enough money and become the Dawn of Discovery harbor master! <br/><br/>Features:  <br/>• 4 different harbors: Occident, Orient, Corsair and Venice that are upgraded during the game <br/>• 8 different traders ranging from the touchy Venetian to the Relaxed Salesman <br/>• 2 Game Modes: Story and Endless <br/>• Story with 36 Missions  <br/>• Earn 16 achievements  <br/>• Local Highscore for each map", "metacritic": null, "released": "2010-03-15", "tba": false, "updated": "2019-10-22T14:28:15", "background_image": "https://media.rawg.io/media/screenshots/395/3954d593a8bfb2663ae25470959be4d0.jpeg", "website": "http://dawnofdiscoverygame.us.ubi.com/pc/anno-harbor.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ubisoft"], "genres": ["Strategy", "Simulation"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Everyone 10+"}