{"id": 301156, "slug": "the-house-2019-7drl", "name": "The House 2019 7DRL", "name_original": "The House 2019 7DRL", "description": "<p>This is a roguelike game made in 7 days for the 2019 7 Day Roguelike Challenge. </p>\n<p>You enter a mansion where you believe some friends recently went missing. You find that you are unable to leave. Perhaps if you destroy the evil lurking here, you can escape! </p>\n\n<p>Designers notes: <strong>All combat is deterministic</strong> with the main stats being <strong>attack, health and movement</strong>. You can see what each monster will be able to do on their next turn and plan accordingly. </p>\n<p>The dungeon, items and monster placements are random.  I used Wang tiles to determine connectivity between 9 x 9 segments in the dungeon with a generic visual template covering the segments. Then, I created hand drawn 9 x 9 segments that can be inserted along with a description of the segment. Each segment still must correspond to one of the Wang tiles to maintain connectivity. I used the great information described here: http://cr31.co.uk/stagecast/wang/blob.html</p>\n<p>There is out of combat health regeneration so that each combat sequence is unique. You have an opportunity to run away to reset but may just find more enemies. I found this fun when playing. <br/></p>\n<p>Because there was little time for balancing difficulty, I used a slider that lets you find a level that works for you. Since I cannot really come back after the competition to adjust it, I thought it was a good compromise.  </p>\n<p>This is my first time deploying content with Unity so please let me know if there are any issues. I look forward to hearing feedback. </p>", "metacritic": null, "released": "2019-03-10", "tba": false, "updated": "2019-03-11T03:41:03", "background_image": "https://media.rawg.io/media/screenshots/d34/d34e480f7d704313baa6889e25a6e6e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["blockerz"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}