{"id": 301329, "slug": "shadows-of-life", "name": "Shadows of Life", "name_original": "Shadows of Life", "description": "<p><strong>Présentation</strong></p>\n<p>Nous avons là un J-RPG classique.</p>\n<p>Le gameplay n'a rien de révolutionnaire...<br/>Les combats sont du tour par tour avec une barre d'action qui se recharge... Lorsqu'un personnage level up, il faudra choisir des caractéristiques à augmenter. Sur certaines maps, les combats se déclenche par contact avec un ennemi tandis que sur d'autres, ils se font par rencontre aléatoire. Certains sprites de combat sont animés.</p>\n<p>Il y a pas mal de texte et quelques gaps. Il y aura quelques choix à faire durant les dialogues même si il n'y en a pas beaucoup pour le moment.</p>\n<p>Les musiques sont plutôt variés... même un peu trop, ce qui augmente assez grossièrement la taille du fichier... Elles ont presque toute été exporter par mes soins, c'est à dire qu'elles ne proviennent pas du logiciel RPG Maker MV. Certaines viennent de différents jeux vidéos, d'autres sont des remix, des compositions originaux, des ost d'animés, des visuel novel ou des jeux sur mobile...</p>\n<p>Le jeu est assez linéaire où il est très rare de s'y perdre.</p>\n<p>PS: Vous verrez parfois des dessins réalisés avec des logiciels Paint car j'ai voulu m'y essayer... Prenez les au second degré car je sais que je suis très mauvais en dessin. </p>\n<p><strong>Histoire</strong></p>\n<p><strong>L</strong>'histoire nous plonge dans les péripéties d'un jeune noble nommé Ed.<br/>Étant l'héritier de sa famille et venant d'atteindre ses 18 ans, une cérémonie de passage à l'âge adulte se prépare à son insu.</p>\n<p><strong>L</strong>e jour de la cérémonie est arrivé, et elle se déroulera ce soir. Les serviteurs et domestiques sont à l'affut, les invités commencent à arriver, la famille veillent à que tout soit en place... Tout commencent à être fin prêt pour cet évènement sacré.</p>\n<p><strong>N</strong>e voyant cette cérémonie que comme une formalité, Ed préfère passer le reste de son temps avec son entourage notamment : Edna, sa petite soeur, puis Phleo, le serviteur de son oncle et sans oublier Émilie, une invitée qui lui rend souvent visite et qu'il considère comme sa meilleure amie. Ed n'aura pas le temps de s'ennuyer car découvertes et réconciliations l'attendent tout en ayant de nombreuses choses à discuter avec ses compagnons.</p>\n<p><strong>U</strong>ne fois la soirée arrivée, son monde se bouleverse. Il ressent la nuit froide, mystérieuse et il fait la rencontre d'étranges personnes. Les rêves dont il a fait durant la journée refont surface et l'absence habituelle de son père qui le déteste n'arrange en rien les choses.</p>\n<p><strong>L</strong>a cérémonie qu'il considérait comme ennuyante et comme une formalité prendra vite une autre tournure car des forces obscures sont à l’œuvre. Ces ombres interviennent et finissent par l'envoyer dans le terrible endroit connue sous le nom d'Éternia, la \"prison\" dont on ne sort jamais et où on y reste pour l'éternité.</p>\n<p><strong>S</strong>on existence ayant toujours été remis en cause, Ed peut-il ainsi toujours avoir une raison de garder espoir ?</p>", "metacritic": null, "released": "2019-03-09", "tba": false, "updated": "2019-03-11T04:07:23", "background_image": "https://media.rawg.io/media/screenshots/aa7/aa7355d1c46fb96ab7ce75eeee1abddc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Symphotang"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}