{"id": 301430, "slug": "margit-fortress", "name": "Margit Fortress", "name_original": "Margit Fortress", "description": "Indiegogo Campaign\r\nA new old school game\r\n<p>Margit Fortress is a game that mixes elements from the old and new generation of games. The game with simple 2d graphics and platform gameplay with Castlevania and Super Metroid style maps has several current elements, creating new possibilities using physics and time to create complex and innovative fighting and puzzles, Making Margit Fortress gameplay truly unique.</p>\n<p>Combining with the innovative gameplay Margit Fortress will bother to tell a great story to the players, making it a truly complete game.</p>\r\nIntroduction of story\r\n<p>The civilization of Magyar prospered in peace, thanks to the god Man, a man of unknown origin who had 7 artifacts that gave him the power to rule the earth, making him a God.  Until one day everything changed, when the god man was found dead and the artifacts disappeared.</p>\n<p>Peace is then gone, bringing war and chaos to the kingdoms, behold the king of the citadel of Gyor took the leadership of the kingdoms, with the promise of finding the killer of the dead God.</p>\n<p>He accused the prince of Eger, a powerful wizard, of having killed God, and condemned him to perpetuated prison in Margit Fortress, a prison on an island where the dead god isolated the worst demons of civilization.</p>\n<p>The game begins when the younger brother of the condemned wizard finds in his house one of the artifacts of the dead god. Then part on an adventure to rescue your brother from Margit, even without knowing if your brother is innocent.</p>\n<p>To know the rest of this story help us create this game = D</p>\r\nMargit Fortess is also an RPG\r\n<p>The game will not only bring a beautiful gameplay with puzzles accompanied by a story. The game will have a wide variety of items and equipment, with a fun status system, making your character truly unique which can facilitate or hinder the fights. Of course to get the best equipment the player will need to explore the game a lot, being the exploration of maps another key point in the development.</p>\n\n<p>The game will have different bows for you to collect. Each with different features like coldown, strength and range.</p>\n<p>     </p>\n<p>Several different Skills to help solve puzzles, access new areas and defeat enemies.</p>\n\n<p>Control the time with one of the artifacts of the dead God</p>", "metacritic": null, "released": "2019-03-08", "tba": false, "updated": "2019-03-11T04:21:22", "background_image": "https://media.rawg.io/media/screenshots/59b/59b619001197d57869f600e00fd42509.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["indeogames"], "genres": ["Action", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}