{"id": 301492, "slug": "le-progres-du-ciel-promis", "name": "Le progrès du ciel promis", "name_original": "Le progrès du ciel promis", "description": "<p><em>Bonjour  Me voici de retour avec un nouveau mini-projet en cours de développement. J'ai tenté le pari de proposer quelque chose de différent, à savoir le fait d'avoir enlever les combats et de me détacher du genre RPG. Ainsi, le but de cette tentative de diversification personnelle est de procurer un sentiment de non prise de tête (pour le joueur, ainsi que pour moi-même) et de se laisser bercer par ce nouveau monde réaliste, accompagné de ses mystères. <br/></em></p>\n\n<p><strong>Synopsis</strong><br/></p>\n<p>Ryo reçoit une lettre d’un ami d’enfance, mort dans une explosion 10 ans auparavant, lui demandant de l’aide tout en abordant le sujet d'une étrange forêt existant hors du temps. Intrigué par son authenticité, Ryo décide de partir enquêter, en compagnie de Léna, en se rendant sur le lieu indiqué par la lettre, la tour d’une horloge. Ensemble, ils se verront propulser dans un futur qui leur est inconnu et découvriront les facettes obscures du monde qui les entoure avec comme fardeau sur leurs épaules, de nombreuses vies entre leurs mains. </p>\n<p>Plongez-vous au cœur d'une étrange aventure, avec le soutien de Léo, le mystérieux ami censé être mort, ainsi que celui de nombreux autres alliés pour un affrontement face un ennemi des plus redoutables, à savoir le futur lui-même, le présent, puis le passé.</p>\n\n<p><strong>Personnages</strong> <br/></p>\n\n<p><em>\n</em></p>\n<p><em>Nom : Ryo <br/></em></p>\n<p>Un garçon devenu orphelin qui tente de retrouver son ami pour l'aider à résoudre un mystère. Son passé reste encore inconnu.</p>\n\n<p><em>Nom : Léna</em></p>\n<p>Une fille qui vivait des journées heureuses avec son oncle. Elle a décidé de partir avec Ryo pour l'aider à résoudre le mystère de la lettre et pour découvrir de nouvelles choses.</p>\n\n<p><em>Nom : Léo</em></p>\n<p>Le mystérieux ami d'enfance de Ryo qui est mort 10 ans auparavant et auteur d'une lettre lui demandant de l'aide.</p>\n\n<p><strong>Gameplay</strong></p>\n<p>Les commandes de bases de RM sont utilisées. Le menu possède plusieurs icônes pour lire des informations. Une fonction d'auto-sauvegarde est implémenté dans le jeu. Pour la désactiver, allez dans les options. <br/></p>\n<p>A l'état actuel, le gameplay reste encore très limité. Avec un prologue et un seul chapitre terminé, la démo se concentre avant tout sur la narration. Il n'y a ainsi que 2 énigmes (dont une où il faut seulement donner la bonne réponse) et les interactions avec le décor sont encore très limité. (Le prochain chapitre se serait beaucoup plus axé gameplay)</p>\n\n<p><strong>Crédits</strong></p>\n<p><strong>----------Créateur----------<br/>-Symphotang</strong></p>\n<p><strong>----------Scénario----------<br/>-Symphotang</strong></p>\n\n<strong>\n<p>----------Making----------<br/>-Symphotang<br/></p>\n<p>----------Graphismes----------<br/>-Symphotang<br/>-NuraRay<br/>-Kadokawa<br/>-Enterbrain<br/>-Avery<br/>-BOUGAINVILLEA<br/>-PandaMaru<br/>-Lunarea<br/>-Celianna<br/>-Sarah_yt<br/>-StarbirdResources <br/></p>\n<p>----------Musiques----------<br/>-Dan Ch<br/>-Baccano!<br/>-Professeur Layton et la Diva éternelle<br/>-Dark Chronicle<br/>-Lanota<br/>-Professeur Layton et l'Étrange Village<br/>-Octopath Traveler<br/>-Valkyria Chronicles 4<br/>-Professeur Layton et le Destin perdu<br/>-Umineko no naku koro ni<br/>-Virtue's Last Reward<br/>-Lost in Harmony<br/>-The Promised Neverland</p>\n<p>----------Systèmes----------<br/>-Yanfly<br/>-Terrax<br/>-Moghunter<br/>-Galv<br/>-Hime<br/>-Masked<br/>-Pareidolon</p>\n<p>----------Remerciement----------<br/></p>\n<p>Je tiens à remercier particulièrement BlueRebellion et Maxis pour avoir participer aux dessins des faces des personnages, ainsi qu'à toutes les personnes qui m'ont soutenu.<br/></p>\n</strong><p><strong>Notes</strong>- Plusieurs lieux n'ont pas encore de nom (la boîte \"position actuelle\" du Menu est ainsi souvent vide vers la moitié de la démo)</p>\n<p>- La sauvegarde automatique ne se déclenche qu'après avoir déjà sauvegarder au moins 1 fois !<br/></p>", "metacritic": null, "released": "2019-03-07", "tba": false, "updated": "2019-03-11T04:29:54", "background_image": "https://media.rawg.io/media/screenshots/b9c/b9ccd8ce2f84ff7798a94df2e007ba79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Symphotang"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}