{"id": 301556, "slug": "chromosome-evil", "name": "Chromosome Evil", "name_original": "Chromosome Evil", "description": "<strong>RTS action</strong><br/>Multiple possibilities according to the way you build your team, soldiers are good killers, engineers can establish defense perimeter by building turrets, barricades or using special key points from the environment to build traps and medics can keep your team alive on a long run<br/><br/><br/><strong>TBS management</strong><br/>During this stage, you choose which location you want to send your squad to search for supplies and information, you choose how you want to equip your survivors and what skills you want them to get stronger at, you choose your route and you decide the best course of action for the random events that will present before you.<br/><br/><strong>Story</strong><br/>This is not your classical zombie outbreak, no, this story is much darker inspired by Lovecraft works, an ancient evil has returned from below the earth bringing with him creatures of nightmare, abominations of unspeakable terror and if that was not enough, the dead humans are brought back to life as animated flesh to fight alongside this evil.<br/><br/><br/><strong>Main Quest</strong><br/>You are part of what remains of army forces, your brother, the one who took care of you when your parents died was also part of the army and went missing during a mission a few miles from where you are stationed with the objective to gather information about these underground holes from were these creatures are coming from. You decide to embark on one last journey of redemption to see your brother one more time.", "metacritic": null, "released": "2022-03-23", "tba": false, "updated": "2023-01-06T04:12:24", "background_image": "https://media.rawg.io/media/screenshots/de7/de7ad27cf25a52c3d9f88b88b34fffaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 1}, "playtime": 17, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["S.C. 16 BIT NIGHTS", "Sergey Dovganovskiy", "conradproteus"], "genres": ["RPG", "Strategy"], "publishers": ["S.C. 16 BIT NIGHTS"], "esrb_rating": null}