{"id": 301554, "slug": "senity", "name": "Senity", "name_original": "Senity", "description": "<strong>THIS GAME DEVELOPS WITH YOU.</strong><br/>Slip into the role of a Cyber Mercenary either alone or as a team to stop Senity, a gone rogue military A.I. (Artificial Intelligence) that already claimed many lives on its way.  Survive long enough with your friends and find a way to stop her.<br/><br/>Certainly no unknown scenario, if there wasn’t a catch - this A.I. is real.<strong>SINGLE PLAYER / CO-OP</strong><br/>Play the campaign alone or with up to 6 players. You decide how it ends.<br/><ul><li>Campaign (default): Play the campaign as we intended it. Infiltrate the military development facility M.A.R.U. , uncover dark backgrounds in the development of Senity and find a way to stop the killing.</li></ul><ul><li>Campaign (Senity K.I.): Play new campaigns generated by real artificial intelligence based on your behavior and her will on-the-fly. Meet familiar and yet different characters with ever-new interaction, storyline and endings. Each campaign can be shared at any time using a dynamically generated seed and saved with its current progress - even if it's not yet completed.</li></ul><strong>HUNTING</strong><br/>In a massive online battle with up to 500 players, head for Senity and kill her in one way or another.<br/><ul><li>Find and kill Senity first or activate different, A.I. generated, placed and hidden Map Objectives.. Your way to the goal is never the same.</li></ul><ul><li>Move on a battlefield up to 20 kilometers without any restrictions.</li></ul><ul><li>Forge unholy alliances with up to two other teams on the battlefield, get buffs, and increase your win probability. But beware - only one can win in the end.</li></ul><ul><li>Loot items and weapons, repair damaged bodyparts and acquire super abilities based on your equipment - right in the middle of the battlefield.</li></ul><strong>MULTIPLAYER</strong><br/>No lootboxes, no Pay-2-Win or other unnecessary bells and whistles - just you and your skills. Challenge your enemies alone or with up to 5 Players in known game modes like Deathmatch, Team Deathmatch, Capture-the-Flag or Conquest.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:41", "background_image": "https://media.rawg.io/media/screenshots/fef/fefb2d564b0c54ca8b180008733d8494.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Excore"], "genres": ["Action", "Casual"], "publishers": ["Excore"], "esrb_rating": null}