{"id": 301599, "slug": "power-revolution-2019-edition", "name": "Power & Revolution 2019 Edition", "name_original": "Power & Revolution 2019 Edition", "description": "    • New political characters with 3D animated faces<br/>    • Implementation of a \"Digital Tax\" on the online giants. <br/>    • Fighting for women's rights with a sufficient and comprehensive budget (combating sexual violence, educational policy on gender equality...) and specific laws (harassment on the street, abolition of male-dominated mentoring, fighting female circumcision…)<br/>    • Possibility of taking over and governing a conquered country<br/>    • Legislation on motorway tolls<br/>    • Play up to 30 nations simultaneously in the same game<br/>    • The possibility of a tax on cannabis if it is legalized and its economic sector is opened <br/>    • Carbon tax (on CO2 emissions) <br/>    • Establishment of the legal age for consuming alcohol<br/>    • Active defense mode for missile-launcher units and destroyers that can automatically bomb enemy units entering a protected zone (allowing you to establish lines of defense)<br/>    • Distinguishing missile launcher movements from missile trajectories for all missile launchers<br/>    • Management of the electric car and self-driving vehicle industry <br/>    • The possibility of dismantling infrastructures on the map<br/>    • Closing and re-opening of nuclear power plants<br/>    • New technology: self-driving cars, hyperloop train (at more than 1000 km/h, constructible on the map), CO2 capture plants, high-density batteries, third generation nuclear power plant (EPR) ; and the addition of progress levels for scientific research.<br/>    • Simulation of electricity shortages<br/>    • Quantification of illegal economic sectors (drugs)<br/>    • Proliferation of riots in the region<br/>    • New displays, new comparative maps: global warming temperature curves up to the year 2100; social inequality; malnourished populations; terrorist threats; deaths due to drug use; environmental maps including forested areas, deforestation, organically cultivated areas; maps related to women's rights (salary equality, practice of female circumcision).<br/>    • Game option of whether or not to include actual historic results in calculating election results.<br/>    • New achievements.<br/>    • Various gameplay adjustments and bug correctionsMULTIPLE INTEGRATED OPTIONS    • Game operating as single-player with a multi-country mode allowing play with several countries simultaneously<br/>    • Game settings: terrorist activities, probabilities of natural disasters, reactivity of the populations, outbreak of war<br/>    • Player ranking online and in real time<br/>    • Incorporation of your own photos, logos, names to make the game even more realistic<br/>    • Interactive tutorial and game help available at all times during the game (in beginner mode)<br/>    • Learn about geopolitics by playing the QUIZZ mode, including more than 3000 questions<br/>    • Enjoy different configurations with double screen or 4K screen offering a customized interface<br/>    • More than 20000 texts and 12 hours of dialogs. 100% in English", "metacritic": null, "released": "2019-03-12", "tba": false, "updated": "2019-08-28T21:47:36", "background_image": "https://media.rawg.io/media/screenshots/016/01657fb4dcf9dd3e72ee26f6861693b2.jpg", "website": "http://www.power-and-revolution.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3}, "playtime": 14, "achievements_count": 71, "ratings_count": 1, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Eversim"], "genres": ["Strategy", "Simulation"], "publishers": ["Eversim"], "esrb_rating": null}