{"id": 301529, "slug": "narwhal-heist", "name": "Narwhal Heist", "name_original": "Narwhal Heist", "description": "Narwhal Heist is a comedy, stealth-platformer game in which Wally the Narwhal, a secret agent turned rogue, must complete various crime contracts in order to rescue his family. His arch nemesis, the cunning and ingenious Professor Wigglywams, has kidnapped his family for a $5,000,000 ransom. From banks to apartments to construction sites, Wally will traverse a variety of diverse environments in order to save his family.<br/>\n<br/>\r\nEach of the eight core story line levels has an additional Challenge Mode for the avid player, allowing them to replay it with an added difficulty for an increased reward. By finding a hidden Challenge Briefcase in a level, the player can unlock the Challenge Mode for that level and replay it at any time. Every Challenge Level plays completely different from the original by adding a unique and unexpected twist to the level, turning everything the player knows about the level on its head. In addition to the eight core levels and their corresponding challenge modes, Wally is able to purchase a variety of extra contracts in order to get money and acquire any upgrades he may need on his journey. With a variety of game modes and game-changing upgrades, Narwhal Heist provides tens of hours of entertainment.<br/>\n<br/>\r\nNarwhal Heist is, by design, a crushingly difficult game. We know this may attract some and deter others, so we've done our best to make it enjoyable for all. Narwhal Heist offers highly configurable difficulty settings; everything from Wally's movement speed to his slipperiness, from his amount of checkpoints to the amount of uses each checkpoint has. The player can play the game how they want and can adjust it to be more difficult or easier than it is to begin with.<br/>\n<br/>\r\nAside from difficulty, Narwhal Heist is enjoyable both for the player and the viewer. The game takes comedy in a unique direction by integrating it into both the dialogue and the gameplay. Funny physics; odd, fish-like controls; strange upgrades and other gameplay elements add to the comedic feel of the game. To top it all off, Narwhal Heist hosts a variety of highly talented voice actors to give life to the game and tell a story that will have everyone laughing.<br/>\n<br/>\r\nWe know there's a large speedrunning community out there determined to torture themselves in completing games in the quickest amount of time possible. Because of this, speedrunning is more than just an afterthought in Narwhal Heist. The levels and mechanics have been designed with speedrunning in mind, so that with enough time and dedication, even the toughest of these skill-based levels can be mastered. Hidden shortcuts and secret routes allow levels to be completed faster, while longer routes sometimes often bigger rewards, such as more collectables or Challenge Mode briefcases.<br/>\n<br/>\r\nFinally, Narwhal Heist can be played the way the player wants to play it. Each level has dozens of unique routes and can be completed in a variety of ways. Shortcuts and hidden areas reward the adventurous player, while skilled players may find it best to simply brute force their way through the most straightforward path. By using the game's Black Market, the player can use cash earned from previous contracts to either unlock more contracts or unlock upgrades. The choice is yours - the levels can be played in any order, and you can buy whatever you want. If you've just completed your first contract and would rather have a jetpack than another mission (at least, until you've earned more money), by all means, you're free to do so.", "metacritic": null, "released": "2019-06-20", "tba": false, "updated": "2019-08-28T21:47:43", "background_image": "https://media.rawg.io/media/screenshots/082/0824eb2f6d3642a3ab88537c6ea630d4.jpg", "website": "http://narwhalheist.xyz", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Connor Frye", "Haydn Davis"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Connor Frye"], "esrb_rating": null}