{"id": 301581, "slug": "mistover", "name": "MISTOVER", "name_original": "MISTOVER", "description": "<p>Game StoryThe unexpected appearance of the Vortex, Pillar of Despair, unleashed dreadful creatures that brutally raided the world. Defenseless and vulnerable, mankind was soon on the verge of extinction.<br />\nWhen all hope was lost, a miracle happened and the creatures suddenly vanished. Desperate to prevent the next invasion, the survivors created a group called the &#39;Corps&#39; that journeys into the Vortex from whence the creatures emerged. You will lead the Corps to reveal the secrets behind the incidents.<br />\nWill the human race succeed in changing the course of their destiny?In the Mist of the Vortex, Pillar of Despair...<br />\nYou will be constantly dealing with internal conflicts between &#39;satisfaction&#39; and &#39;greed&#39;.<br />\nLimited visibility will hinder your exploration.<br />\nUtilize skills and create effective formations to achieve victory.<br />\nDon&#39;t forget, even your best crew members have only one life.<br />\nUpgrading gear is not the only way to win.Key Features Contains 40-hours of expeditions in 5 distinct regions.<br />\nTurn-based RPG with a twist... It can change based on your actions.<br />\nMaps are always changing… practice different strategies in order to survive.<br />\nBuild an invincible Corps by combining and strategizing with 8 different Corps classes.<br />\nLearn new skills and upgrade equipment to enhance Corps Crew members.<br />\nThe Mist influences EVERYTHING that happens in the game.Your strategy will reshape the fate of mankind.<br />\nLead the Arta Kingdom&#39;s Corps into the Misty expedition!</p>", "metacritic": null, "released": "2019-10-09", "tba": false, "updated": "2023-06-19T04:43:05", "background_image": "https://media.rawg.io/media/screenshots/2c1/2c1ec73be56de540e54521a4fac601e2.jpg", "website": "https://www.playmistover.com/home", "rating": 3.08, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 41, "beaten": 2, "toplay": 17, "dropped": 5, "playing": 1}, "playtime": 1, "achievements_count": 160, "ratings_count": 12, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 12, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Krafton"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["KRAFTON"], "esrb_rating": "Teen"}