{"id": 301575, "slug": "trinity-of-chaos", "name": "Trinity of Chaos", "name_original": "Trinity of Chaos", "description": "Creatures from three different realms, the Dwarf, the Demoness and the Lion are no longer lords of chaos. Their servants betrayed them - now they have to ally with humans, who obtained the divine artifact desired by the chaos raiders.<br/>\n<br/>\r\nTrinity of Chaos is low poly style third person view city building fantasy game, where you can control every single citizen's function and watch your city grow from the inside. <br/>\n<br/>\r\nPlay interchangeably 3 unique characters which you have never seen anywhere before. Each one has different abilities. When not played, they’ll turn into a statues and add some buffs to the nearest area. During the phase of planning you can run through the city and watch up close the buildings that you’ve just set up.<br/>\n<br/>\n<br/>\r\nPlan the town<br/>\r\nOnly Town Hall and a few buildings were left after the first attack… Build the town from scratch, extend it more and more and choose constructions you’ll need to raise an invincible city. Grid based building method will allow you to build one of a kind city. You’ll have to find best building strategies in order to defend the town!<br/>\n<br/>\n<br/>\r\nRun the town<br/>\r\nPersonalize citizens by giving them orders, assigning their jobs or by recruiting them to the army - your choices are very important, you have to prepare the town for forthcoming events. Your people got hurt during the fight? Hire a medic as fast as possible! <br/>\r\nYou should probably start training a water wizard as well, because he’ll be the only one able to extinguish the fire on the burning building…<br/>\n<br/>\n<br/>\r\nDefend the town<br/>\r\nBuild the walls, guard towers and arm the warriors. The Town Hall won’t defend itself! Chaos will do everything to destroy the city and gain the artifact. Don’t let the evil win!", "metacritic": null, "released": "2019-03-22", "tba": false, "updated": "2019-08-28T21:47:39", "background_image": "https://media.rawg.io/media/screenshots/a2f/a2f5c4eaaa6f8b6e8ae502b28396aace.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["divineblackmsith"], "genres": ["Indie"], "publishers": ["divineblackmsith"], "esrb_rating": null}