{"id": 301534, "slug": "dominance", "name": "Dominance", "name_original": "Dominance", "description": "Dominance is a reckless, off-the-wall multiplayer top-down shooter, designed with an emphasis on build variety. Dominance’s main philosophy? Put as few restrictions on the player as possible! <br/><br/>In the game, you will defeat your opponents with a large arsenal of upgradable ranged and melee weaponry - from bouncing ricochet sniper rifles to hockey sticks, and more! <br/><br/>Mix &amp; match equipment and weaponry to create a perfect loadout - wage war on a huge map and use its varied terrain to your advantage.<br/><br/><br/><br/>A new twist on a multiplayer top-down shooter! Deliver death from all angles in this high-octane top-down shooter! Take out enemies with precise hits, predict their movement to come out on top - and utilize active skills, unique to each weapon type and character, to truly Dominate the battlefield.<br/><br/><br/><br/>Evolve your character and equipment! Explore the synergies and combinations of abilities, artifacts, guns and armor to find the one that perfectly compliments your style of play. <br/><br/><br/><br/>The world of Dominance plays an equally important role during battle - pay attention to your surroundings to stay ahead! Every area has its unique bonuses and hazards. Use the terrain to your advantage - hide in bushes to ambush your opponents, run on concrete to move faster and explore other unique properties of the game map! <br/><br/><br/><br/><br/>Choose between a roster of distinct characters - each with a unique set of active and passive abilities, as well as a leveling tree. Defeat other players to become stronger - and win games to unlock lore and customization items for your Hero.", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-13T05:13:00", "background_image": "https://media.rawg.io/media/screenshots/423/42302541cba78cb7b0513912f70249d2.jpg", "website": "https://dominance.online/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Onmoon", "INPLERON"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["Onmoon", "INPLERON"], "esrb_rating": null}