{"id": 301668, "slug": "kult", "name": "Kult", "name_original": "Kult", "description": "<p>Kult in his current version was build on a 2-week course on our University conducted by soerbgames.</p>\n<p>We had a lot of fun and learned a bunch of things how to work  with Unity, something like \"do not make a game this complicated that no one would understand...\" or \"you find youre functions easyer with less than 2000 lines of code in one skript\".</p>\n<p>The idea behind Kult was to make a good, complicated, 2-dimensional, grid based simulation with just a few attributes and a couple of interesting interactions between the tiles and the player. <br/></p>\n<p>The \"complicated\" part is well done and we felt in love with Kult while we worked hard on this game - so we want to make it a good game now.</p>\n\n\n<p>Kult is maybe some kind of \"politic simulation\", you have to build and hold temples in the world. The main attribute of a tile is his contribution (Im not sure that this is the right english translation of the german word... but we call it this way). The contribution and the gain of contribution per round interacts with the abjection and education of a tile an with the contribution of the neighbouring tiles.... and so one.</p>\n<p>You have to hold the contribution on a high level at each tile, while you build temples on the map. You influence the tiles with some actions. Thats all. Its pretty hard!</p>\n\n\n<p>We want to make Kult a better game, so here is a sneak peak what will happen in the future:</p>\n<ol><li> english translation (yep, its just playable in german right now... sorry :/)</li><li> better looking UI (damn, its soo ugly  - and just work fine with 1920x1080 px!)</li><li> better soundmanaging</li><li> custom playmodes</li><li> easyer start conditions (at the moment you need 4 or 5 trys to get a chance to win the game)</li></ol>\n\n\n<p>Have fun to play this small \"throw something against the wall\" game - and stay tuned, a english translation will come soon!</p>", "metacritic": null, "released": "2019-03-14", "tba": false, "updated": "2019-03-15T02:46:43", "background_image": "https://media.rawg.io/media/screenshots/db2/db2bc680aa6366e9141ffef039f90efc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["spamham"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}