{"id": 301698, "slug": "space-captain-mccallery-ep-2-pilgrims-in-purple-mo", "name": "Space Captain McCallery Ep. 2: Pilgrims in Purple Moss", "name_original": "Space Captain McCallery Ep. 2: Pilgrims in Purple Moss", "description": "<p><em><strong>In the lawless reaches of the galaxy known as the Renegade Sector...</strong></em><br/><br/>Space Pirate Captain McCallery is once again roaming the Renegade Sector in search of treasure and adventure! Along with his new robotic companion, he travels to a mysterious sunken ruin which he believes to be one of the the hiding places of the treasure of the Legendary Space Pirate Laserbeard. In this Low-Poly 3D Action-Adventure game, Captain McCallery must explore a strange and mysterious alien world, battle alien lifeforms, search for food, and ultimately find Laserbeard's Treasure.<br/><br/>This episode of Space Captain McCallery is a self-contained adventure and can be played without having played the first episode. However, if you want to start at the beginning, the first episode can be found here:</p>\n<p>https://malec2b.itch.io/space-captain-mccallery-ep-1-crash-landing<br/></p>\r\nExplore a Strange Alien World\r\n<p>Playing as Captain McCallery, you will travel through white cliffs and purple swamps, and delve into mysterious ancient ruins. Pay attention to your surroundings, as danger lurks behind every corner. This world is full of hidden paths and secrets to reward exploration.<br/></p>\r\nConsume Alien Plants\r\n<p>The Captain needs to eat to survive! Be on the lookout for plants which you can consume to regain your energy. Food items can have a variety of other effects, ranging from restoring health and increasing your dash length, to hallucinations. Explore your environment to find rare and beneficial items!<br/></p>\r\nBattle Alien Monsters\r\n<p>The game features fast-paced lock-on combat. Dash around your foes, dodging their attacks. Use your trusty laser gun to blast away at your enemies, or conserve your ammo by punching and throwing rocks. You'll be up against a variety of alien beings, including multiple boss fights.<br/></p>\r\nSurvival Mode\r\n<p>For those who want an extra challenge, there's Survival Mode. Survival Mode removes checkpoints from the game, and also removes enemy and item respawning. This mode requires caution and careful item-use in order to make it through.</p>", "metacritic": null, "released": "2019-03-14", "tba": false, "updated": "2019-08-28T23:17:34", "background_image": "https://media.rawg.io/media/screenshots/cf3/cf33de6872f47269b8e637fc6ef3541c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tales of the Renegade Sector"], "genres": ["Action"], "publishers": [], "esrb_rating": null}