{"id": 3016, "slug": "brotherhood-of-violence-2-blood-impact", "name": "Brotherhood of Violence 2: Blood Impact", "name_original": "Brotherhood of Violence 2: Blood Impact", "description": "Puts your fighting skills to the test with stunning 3D graphics, multiple fighting disciplines, and more than 400 ever evolving fighters that learn through artificial intelligence. <br/><br/>Battle your way through 30 environments to defeat punks, ninja, Yakuza and more. Watch out for the Big Boss. He has it in for you and his skills are unmatched! Click <br/>\"...More\" to learn why you should download this game today!<br/><br/>You're a former member of an elite brotherhood of assassins. The problem is, with this brotherhood there's no such thing as a \"former\" member. You knew the Big Boss would try to drag you back in, but you never thought he's kidnap your brother to get to you. Now you must follow the way of the warrior to find him and bring him home.<br/><br/>Brotherhood of Violence Features Include:<br/><br/>• High end 3D engine<br/>• Multitouch and  third-party game controllers.<br/>• Explore 30+ unique environments<br/>• More than 400 different stylized opponents to defeat!<br/>• Choose from 12 unique fighters or create your own with a deep character editor (features: face, complexion, weight, clothes, accessories and more)<br/>• Evolving fighters AI will keep you entertained<br/>• Play daily challenges: Hitman, Battle Royale and Survival !<br/>• Backup and restore your save games and credits on iCloud.<br/>• Game Center integration with ranking, leaderboard and achievements<br/>• In-App purchases available for game credits, unlocking more companions, more attacks styles, new abilities, clothes and more!<br/>• High quality character animations with 5 different fighting styles: Boxing, Muey-thai, Feral, Kung-fu and Karate<br/>• Stunning graphics, full 3D characters, advanced lighting and an unprecedented level of detail<br/>• Intuitive controls with jump, roll, attack, quick time events, super moves and more!<br/>• iOS 10 support.<br/>• Multiplayer online support up to 4 players, and 4 players with iOS7 game controllers. To play online, choose a challenge, select Online and invite a Game Center friend. Also available with Bluetooth from iOS App Settings menu.<br/>• New challenges, new graphics effects, new musics, new audio recorded in Japan by professional actors.<br/>• Airplay compatible.<br/>• Improved gameplay, new accessories, and much, much more.<br/><br/>Equip your character, learn your fighting technique. What's it going to be? Muey-thai? Kung-fu?  With five different disciplines to choose from, you're ready to jump right into the middle of the action!<br/>Get lost in the story with amazing cinematic effects, awesome lighting and intricate detail as you fight to rescue your brother. Your opponents learn through AI, so they're constantly evolving and learning your moves. What works for one bad guy today, may not work tomorrow! It's a tough fight, but you can get help if you need it. You can always unlock a companion to help you along the way.<br/>Three levels of difficulty ensure that you'll never be bored as you perfect your fighting style. All you have to decide is whether to follow the light path of the warrior, or go into the dark. Download Brotherhood of Violence 2 - Blood Impact now and get your brawl on!", "metacritic": null, "released": "2013-03-15", "tba": false, "updated": "2019-10-22T14:39:51", "background_image": "https://media.rawg.io/media/screenshots/0a9/0a9155f119354780118c2007566ce4c8.jpeg", "website": "https://www.realtech-vr.com/bov/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Realtech VR"], "genres": ["Action", "Adventure"], "publishers": ["Stephane Denis"], "esrb_rating": "Teen"}