{"id": 301625, "slug": "protocol-vr", "name": "Protocol VR", "name_original": "Protocol VR", "description": "In this game, you may find yourself in many deadlocks the only way out of which is DEATH. This game may make you angry more than once. This game may make you re-play some moments over and over. [PRESS ANY KEY] to start the game at your own risk.<br/><br/><strong>You were chosen to carry out the Protocol program.</strong><br/><br/>Your objective is to make \"first contact\" with an alien life form. <br/>Any violation of the Protocol will lead to the elimination of you and the entire operation.<br/>Remember, the fate of the humanity may depend on your actions. <br/>Once signed, the Protocol must be promptly implemented.<br/>Have a nice day!<br/><br/><strong>Plot</strong><br/>The action of Protocol, most likely, takes place in the near future. You are a flippant soldier who signs up for the Protocol program implementation. Packed in a landing box and dropped off somewhere in the Arctic Circle, not far from the Terminus research complex, your main objective is to follow a mysterious AI's orders, who uses you to make \"\"first contact\"\" within the Protocol program framework. Any deviation from AI's orders is considered to be a violation of Protocol; leading to the elimination of the complex and staff.<br/><br/><strong>Features</strong><br/>Protocol is a sci-fi comedy with a hint of horror, action and a twisted love story.<br/>Uncover an intriguing plot filled with conspiracies, plot twists, countless expletives, dark humour, and some light-hearted mockery.<br/><br/><strong>Have a Nice Day!</strong><br/>This is a phrase you will love AND hate because you have violated the Protocol AGAIN. If you think that hardcore is when you can defeat the biggest bosses, then try not to die when taking a snowball.<br/><br/><strong>Genre ambiguity</strong><br/>We still can't decide which genre suits this game. Adventure? Puzzle? Shooter? Immersive sim (seriously?)? Walking simulator? Crazy trip? Or, maybe... All in one?<br/><br/>Our other projects: Horror LOCO PARENTIS  and Startup Valley Adventure - Episode 1<br/>", "metacritic": null, "released": "2019-03-19", "tba": false, "updated": "2019-08-28T21:47:34", "background_image": "https://media.rawg.io/media/screenshots/549/54951016d6d01be413eb9b11be51be6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2}, "playtime": 0, "achievements_count": 51, "ratings_count": 2, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Fair Games Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Fair Games Studio"], "esrb_rating": null}