{"id": 301845, "slug": "pendula-swing", "name": "Pendula Swing", "name_original": "Pendula Swing", "description": "<p><strong>Pendula Swing</strong> is an episodic adventure game with RPG elements, set in a Fantasy version of the American Roaring 1920s. This download is episode 1 - \"<strong>Tired &amp; Retired</strong>\", where you get to know the great dwarf hero Brialynne, her idyllic life away from the madness of industrialisation and why she is forced to go back to the frantic and glamorous life of the nearest city, Duberdon.</p>\n<p>The<strong> Pendula Swing </strong>season is available on Steam. We have already launched 4 out of a total of 7 episodes and you can check the full series <strong>here</strong>.</p>\n<p><strong>Pendula Swing Key Features </strong></p>\n<ul><li>Find your own way to solve the challenges you face and shape what kind of person you want to be in these times of great progress and radical changes</li><li>An interesting main story arch that will spark your curiosity about the main characters’ life and dramas</li><li>Unrestricted exploration and discovery of a living town, filled with interesting people and complex stories. It’s up to you if you want to get involved</li></ul>\n<p><strong>Pendula Swing Fun Facts</strong></p>\n<ul><li>You play as Brialynne, an old dwarf lady who was once Pendula's greatest hero. Many years ago she retired to spend her days with her wife, Taheena, who has now passed</li><li>As Pendula's greatest hero, Brialynne is rich. Very. Rich. So your choices in Pendula Swing can, but do not have to be guided by fortunes to gain. You can choose to be (very) generous, since you have a huge treasure at home</li><li>You have a very sassy cat. You can have pets in many games, but none grants you a sassier companion than Katya</li><li>Pendula is inspired not only by the aesthetics, but also about the political, social and economic landscape of the Roaring 1920s. And sometimes the poorest can be the kindest. Also - prohibition</li><li>A word of warning - dwarven ale is strong, consume carefully</li></ul>\n<p>***</p><p>Each <strong>Pendula Swing</strong> episode - including this one - takes a bit over one hour to explore, even though it can be finished quicker. We added many side quests, stories and details that we hope will entertain you! We hope you enjoy<strong> Pendula Swing</strong>! Your feedback is very welcomed!</p><p>***</p><p>Got feedback? Or just want to say hi? Join our <strong>Discord server</strong>!</p>", "metacritic": null, "released": "2019-03-13", "tba": false, "updated": "2019-03-15T03:12:57", "background_image": "https://media.rawg.io/media/screenshots/89a/89a0474ac3de1e23a57ae8e729c742da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valiant Game Studio"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}