{"id": 3020, "slug": "samurai-way-of-the-warrior-hd", "name": "Samurai: Way of the Warrior HD", "name_original": "Samurai: Way of the Warrior HD", "description": "☞ SAMURAI II: Vengeance is coming on 21st October ☜<br/>★ \"Samurai is absolutely gorgeous. Not only is it a stunner, but the combat is perfectly paced and a lot of fun to experiment with as you discover the best combos.\" 8/10 - ign.com<br/>★ \"it's a clear example of how cool the iPad could be.\" - gizmodo.com ★ \"best looking apps you can find for the 9.7” screen\" - appadvice.com ★ \"It is a truly beautiful masterpiece worthy of finding a home on your iPad.\" - appmodo/ipadmodo.com ★<br/><br/>Multiple award-winning Samurai: Way of the Warrior for iPhone and iPod arrived on IPad finally. <br/>☛ ☛ SPECIAL INTRODUCING PRICE: SAVE ALMOST 40% ☚ ☚ <br/><br/>Features in Best Games of 2009 by Apple; Best App Ever Awards 2009 - Best Game Graphics Honorable Mention Award from 148Apps; and number 16 in the Top 100 iPhone Games of All Time from AppAdvice.<br/><br/>Samurai is absolutely gorgeous. Not only is it a stunner, but the combat is perfectly paced and a lot of fun to experiment with as you discover the best combos. 8/10 - ign.com<br/>it's a clear example of how cool the iPad could be. - gizmodo.com<br/>best looking apps you can find for the 9.7” screen - appadvice.com<br/>It is a truly beautiful masterpiece worthy of finding a home on your iPad.  - appmodo/ipadmodo.com<br/><br/><br/>As renowned as the iPhone version is for its stylized manga-like graphics and its bloody gameplay, the HD version takes all the virtues of the original and improves upon them. Carefully crafted comics establish and maintain the story line between battles, lending the action increased drama. The goal of the game is to kill all the enemies in a particular setting, so as to unlock the gate and proceed on to the next stage. The player controls the Samurai with his finger on the touch-screen, moving him in all four directions. Defensively, the player swipes their finger left, right, or up to evade an enemy attack. Swiping in this way over the enemy controls the player's attack. Successfully combining swipes activates powerful combination attacks. <br/><br/>Gameplay is set in the midst of the Japanese Sengoku period, and the player is Daisuke Shimada, a wandering Samurai. It is the most dangerous of times, and Daisuke must ultimately face the evil Daimyo Hattoro, who has spread fear and terror throughout the countryside. Many battles must be won before meeting Daimyo, and Daisuke does battle with enemies in many villages throughout feudal 16th century Japan. There are a great variety of settings in which battles are fought, and highly detailed foliage, bridges, arenas, houses, statues, streets, etc. The game is played from an overhead point of view and both graphics and movement are highly realistic within the stylized motif of the action.<br/><br/>• First hack and slash game developed specifically to leverage the iPAD touch screen.<br/>• Deadly Dojo only for iPad !!!<br/>• No more virtual joysticks or gamepads, only your finger and touchscreen.<br/>• Visit several unique environments in the Japan in a feudal 16th century setting.<br/>• Unlock all combo attacks and master your skills.<br/>• Never before seen comics storytelling<br/>• Special Dojo mode. Fight in the arena sparing enemies in the rounds.<br/>• Online leaderboards<br/>• Facebook and Twitter integration<br/>• Friends lists<br/>• Persistent player profile<br/>• Original movie like soundtrack.<br/>• And much more...<br/><br/>Recommended for fans of hack 'n slash games as Ninja Gaiden, Devil May Cry, God of War or Heavenly Sword<br/><br/>Gameplay video :<br/>http://www.youtube.com/watch?v=G-a1aQi9Llk<br/><br/>How To Play video:<br/>http://www.youtube.com/watch?v=Zg2lgWtoUuY<br/><br/><br/>AGON Online by Aptocore, for more info on AGON Online please visit:<br/>http://agon-online.com<br/><br/>Follow us on twitter<br/>http://twitter.com/MadFingerGames<br/><br/>Follow us on Facebook<br/>http://www.facebook.com/pages/Samurai-Way-of-the-Warrior/127648768229", "metacritic": null, "released": "2010-07-01", "tba": false, "updated": "2019-10-22T14:05:49", "background_image": "https://media.rawg.io/media/screenshots/26a/26a6b45ac968eab801eb2d9e8c47141a.jpg", "website": "http://www.madfingergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MADFINGER Games"], "genres": ["Action", "Adventure"], "publishers": ["MADFINGER Games"], "esrb_rating": "Mature"}