{"id": 302137, "slug": "high-entropy-test-builds", "name": "High Entropy - Test Builds", "name_original": "High Entropy - Test Builds", "description": "<p>Use computers (via GUIs or the command line), unlock doors, crawl through vents, fight enemies head on or find other ways to neutralize or avoid them... <em>High Entropy </em>is an action-adventure FPS inspired by some of my favorite immersive sims like <em>Prey</em>, <em>Dishonored </em>or <em>Deus Ex: Mankind Divided</em>, among others, although it won't be as complex as any of those games (this is a one man project).</p>\r\n\r\nIn Development\r\n<p>I'm making it using Unity and assets from its store (or similar places), that I modify to my needs, and others that I create from scratch, always trying to fit the look and feel that I've envisioned for the game.<br/></p>\n<p>As I mentioned above, the game is not finished. The test builds, at least at the beginning, will focus on the challenges section, with a few of the first levels available to play, which I think offers the best way  to test some of the gameplay mechanics as I introduce them while, hopefully, having fun playing the challenges themselves. I won't be sharing the story mode, at least at first, and if/when I do it will probably only be partial implementations or experiments.</p>\n<p> </p>\r\nCommercial Version\r\n<p>My ultimate goal is releasing a commercial version of the game on Steam (and maybe other sites later on), but only if it reaches a point where I feel like the game deserves asking money for it. In the meantime,  I think sharing these public builds here could be a worthwhile experience.  <strong>Hope you enjoy it</strong>.</p>\r\nA Game By\r\n<p>Álvaro García |  www.binarynonsense.com | @binarynonsense</p>", "metacritic": null, "released": "2019-03-11", "tba": false, "updated": "2019-03-15T03:56:50", "background_image": "https://media.rawg.io/media/screenshots/757/75773abd3098f752a2844aaa07c7e107.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["binarynonsense"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}