{"id": 302369, "slug": "neon-abyss", "name": "Neon Abyss", "name_original": "Neon Abyss", "description": "<p>Neon Abyss is a frantic roguelike action platformer features unlimited item synergies and unique dungeon evolving system. Each of your raids diversifies the dungeon experience and every choice you make alters the ruleset of the dungeon. You will die a lot in this game, and every time you die, you&#39;re just a step closer to your ultimate goal: to find the cure for your immortal curse.<br />\nBattle your way through an underworld eternally in flux, crush the new gods of bitcoin and nightclubs, combine your loot to achieve awesome power, and find the cure for your immortal curse. During your journey, you will gain powerful items, find adorable pets, meet strange passers-by, and discover countless secrets.<br />\nThere is a unique and expandable underworld. You can choose a personalized upgrade path to expand your dungeon and unlock new rooms, bosses, items, special rules, and new endings. Each of your adventures will expand the content of the dungeon, and every choice you make will change the rules of the game.<br />\nWe love builds! Passive effects between items will stack and affect each other, and there is no limit to the number of effects you can apply to your character. No one knows what will happen, or what you’ll create.<br />\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -Massive Content (with continuous updates)Dynamically generated maps, over 400 items, dozens of monsters with different styles, and countless secrets ensure that every adventure is completely fresh.Egg Hatching &amp; EvolvingAs you descend into the abyss, you’ll find eggs you can take care of which will hatch into a random pet. Each pet has a special ability and most can evolve as you play.Mini-GamesThere are many unique rooms in the dungeon, each one with new mechanics and rules. Take part in Piano Performances, Dance Competitions, Fight Clubs, and much more.Multiple Playable CharactersThere will be multiple unique characters with different abilities for players to choose from.Costume ChangesAll the items will change your character’s appearance! Some are cool, some are ridiculous, and when put together, you’ll look hilarious… and be hilariously powerful.Neon GodsThe God of Power. Gods of Bitcoin and Video. Today’s obsessions are transformed into new gods, and you are the one who dares to challenge their rule.Incredible SoundtrackAward-winning composer Min He, whose past credits include Princess Eun Hwa, Rift, and How to Get Away with Murder, has composed a dark-style electronic soundtrack to fit a war waged against Neo-Gods.The BarAfter each death, you will wake up in the Day’s End, where you can have a couple of drinks, listen to music for a while, and plan your next assault on the underworld.</p>", "metacritic": 78, "released": "2020-07-13", "tba": false, "updated": "2024-04-06T11:57:21", "background_image": "https://media.rawg.io/media/games/977/97759451a8b0fcb16ac9357c24140008.jpg", "website": "https://www.veewo.com/neonabyss", "rating": 3.41, "rating_top": 4, "added_by_status": {"yet": 104, "owned": 1272, "beaten": 48, "toplay": 43, "dropped": 103, "playing": 18}, "playtime": 4, "achievements_count": 158, "ratings_count": 135, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 138, "platforms": ["Xbox One", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["Veewo Games", "Veewo"], "genres": ["Action", "Shooter", "Indie", "Platformer"], "publishers": ["Team17 Digital", "VEEWO GAMES"], "esrb_rating": null}