{"id": 302341, "slug": "arizona-derby", "name": "Arizona Derby", "name_original": "Arizona Derby", "description": "<p>&quot;Arizona Derby&quot; is an action-packed off-road racer with highly realistic physic simulations, challenging AI&#39;s of the opponents, that continuously learning and trying to sabotage you with skillful ways, and the game is always exciting. It featuring high-end degree quality of the graphics, and gameplay features are carefully crafted based on three decades of the racing game experience. Also, &quot;Arizona Derby&quot; is specific since it has realistic off-road terrains, not flatten like in most of the other racing games, so you need to make good decisions, to choose right ways, to brake on time and to evade some parts of the roads, to jump at a right angle and to participate incoming off-road paths, with more realism and real off-road experience than other games, but require more skills, it&#39;s not almost driving and steering experience, but require training, skills, and devotion at all levels. Mastering different levels, weather conditions and all different off-roads, you will become skilled and able to compete at the higher AI settings and at night races.</p>\n<p>One of the unique features is that &#39;Arizona Derby&#39; has custom created soundtrack, inspired by insane racings styles, created by Houstoun Texas rap musician TxMic, which you can buy as DLC. And for those who prefer other genres, there&#39;s among 120 licensed upbeat racing tracks for all preferences, from rock, dance, electronic, classical songs to the jazz, smooth jazz, instrumentals, etc.</p>", "metacritic": null, "released": "2019-07-23", "tba": false, "updated": "2022-12-17T21:12:35", "background_image": "https://media.rawg.io/media/screenshots/567/5671b50615b80931416159242060ace2.jpg", "website": "http://www.arizonaderby.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 50, "dropped": 2}, "playtime": 1, "achievements_count": 40, "ratings_count": 2, "suggestions_count": 592, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Falcon Interactive"], "genres": ["Racing", "Indie"], "publishers": ["Falcon Interactive"], "esrb_rating": null}