{"id": 302362, "slug": "animal-fight-club-2", "name": "Animal Fight Club", "name_original": "Animal Fight Club", "description": "<strong>CREATE YOUR ARMY </strong><br/>With dozens of different types of animals at your disposal, generates an unbeatable army of genetically modified animals!<br/>Thanks to the power of the Mix Machine you will be able to combine pairs of animals. The result?<br/>The possibility of inventing hundreds of totally new and unique animals for your army.<br/>Each animal has its statistics, its health and its strengths and weaknesses: Mix them intelligently to get the most powerful creatures!<br/>Over 1000 possible combinations: The generation of new creatures has no limits!<br/><br/><strong>Fight online or offline </strong><br/>Once prepared, your army will be ready to fight locally or in multiplayer.<br/>Play through the campaign, discover the story and unlock new animals for your army, or challenge friends and random players using a powerful multiplayer implementation.<br/>Thanks to Peer To Peer technologies it will be possible to exploit a direct connection to have maximum stability and network speed in duels, as well as the guarantee that it will always be possible to play online in the future.<br/><br/><strong>Fantastic scenarios </strong><br/>Large variety of maps and scenarios related to the campaign mode, with fantastic and innovative locations.<br/>The panorama is an important point in the style of Animal Fight Club.<br/><br/><strong>Incredible performance </strong><br/>Designed to be a good compromise between stability, lightness and content, Animal Fight Club is able to run on most devices, even without a dedicated video card.<br/>How many more games can boast of this in 2019?", "metacritic": null, "released": "2019-07-26", "tba": false, "updated": "2019-11-19T18:33:03", "background_image": "https://media.rawg.io/media/screenshots/5d9/5d993db7c21226d36f568c77f0b8f898.jpg", "website": "https://corvostudio.it/afc.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20}, "playtime": 2, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Linux", "macOS", "PC"], "developers": ["Marco Amadei"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["Corvostudio di Amadei Marco"], "esrb_rating": "Everyone 10+"}