{"id": 302511, "slug": "outlive-the-west", "name": "OUTLIVE | THE WEST", "name_original": "OUTLIVE | THE WEST", "description": "<p><strong>O U T L I V E : THE WEST</strong><br/><em>Outlive is a third-person shooter Multi-Player Battle Royale game that takes place in the western setting. The idea derives from Red Dead Redemption 2's Online mode called Gun Rush.<br/></em></p>\n<p><strong>P L A N S</strong><br/><em>Well this game is more of a sample game I made alone in 4 days so I wont be touching it further. Its not directly related to Outlive except that it reuses Outlive's version of Shooter Anim System<br/><br/><strong>G A M E M O D E</strong><br/>The game is a online battle-royale. The player spawns randomly in the map with 7 other players. Players are tasked to explore and scavenge for loot to survive against other contestants. You earn kills, XP and rank throughout each match which works as player progression.</em></p>\n\n<p><strong>W E A P O N S</strong><br/><em>The game includes four variants of weapons along with 2 Special weapons. Apart from using weapons you can also do melee to do a significant amount of damage and even earn alot of XP from doing so.</em></p>\r\nSystemRequirementOSWin7/8/10ProcessorCore i3GPUNvidia GT720RAM4GB\r\n<p><strong>D I S C L A I M E R</strong><br/>The Following Game was made in 4 days just so that I could play it with my friends. It derives from Outlive's gameplay but its still not part of it directly as the whole team was not involved in the making. This is more of a sample game.</p>", "metacritic": null, "released": "2019-03-17", "tba": false, "updated": "2019-03-18T02:30:21", "background_image": "https://media.rawg.io/media/screenshots/fbd/fbdc3da3cec8ea867fdf3b96e79f10bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["M7™"], "genres": [], "publishers": [], "esrb_rating": null}