{"id": 302583, "slug": "mental-checklist", "name": "Mental Checklist", "name_original": "Mental Checklist", "description": "<p>WASD to Move // Space to Jump // Mouse to Look Around </p><p>This game is an abstract representation of my ADHD. You play as me, in my mind, as I struggle to concentrate. Before my attention flips from one task to another you have to jump onto a task and stay there to complete it. I chose this as my topic because it's something I deal with daily and I thought it would be an interesting thing to try to have other people experience, at least to a small degree. </p>\n<p>Making the game was difficult because I'm bad at both programming and 3D modeling. I had the most fun coming up with the concept and figuring out how I wanted to convey it, but some of the mechanics I wasn't able to include just because of time. Once I was really sitting down to code it all I had an alright time figuring out how to make all the things I wanted to include work together (it would be a stretch to call it \"fun\") but the 3D modeling was the least fun I think just because I'm very new to it and need a lot more time practicing. I don't think I made any particularly \"good\" or \"bad\" decisions, but there were a few things I wish I'd done differently at the beginning of the project, mostly from an organizational standpoint, that would have helped me with the functionality later on. However, I feel like a lot of that just chalks up to inexperience with code. </p>", "metacritic": null, "released": "2019-03-16", "tba": false, "updated": "2019-03-18T02:44:26", "background_image": "https://media.rawg.io/media/screenshots/b01/b01f1eae13f86b1ba6cc86d37d49adc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ajali"], "genres": [], "publishers": [], "esrb_rating": null}