{"id": 302685, "slug": "lunar-lander-remake", "name": "Lunar Lander Remake!", "name_original": "Lunar Lander Remake!", "description": "<p>Lunar Lander is a single-player arcade game in the Lunar Lander subgenre. The objective is easy to understand!</p>\n<p><strong>-Objective-</strong><br/>Your main objective is to try to land on the moon as safely and as much as you can with the limited fuel you are given,<br/>but be aware that hard landings won't end well!<br/>The more you land the more scores you will gain throughout the game.<br/>Amount of scores that you will gain by landing are based off the size of the landing area, <br/>the bigger it is the smaller your score gain will be!<br/>Each crash you receive will decrease your fuel so you the player should be careful about it!</p>\n<p><strong>-Gameplay-</strong><br/>The controls of the lander is smooth and responsive!<br/>The way you control your lander is quite easy to get the hang of it!<br/><strong>\"W A D\" </strong>or <strong>\"Arrow Keys\"</strong> are used for <strong>\"rotate</strong>\" and your <strong>\"thrusters\"</strong> to move forward.</p>\n<p><strong>-Additional Features-<br/></strong>Unlike <strong>\"original\"</strong> our game has randomly generated terrains and you can write a seed of your own too!<br/>The game asks for a <strong>\"seed\"</strong> input when you first start you can either type your own or just leave it to the game!<br/>Our game also includes a <strong>\"highscore\"</strong> list where you can see who has got the highest score of all and try to beat it!<br/>We have also added a song list to keep you entertained throughout your play time.<br/>And a game mode that we thought Time Rush! In this game mode your job is to land as much as possible within 3 minutes!</p>", "metacritic": null, "released": "2019-03-15", "tba": false, "updated": "2019-03-18T03:04:56", "background_image": "https://media.rawg.io/media/screenshots/bea/beaaef2cc453aebab598c2bb12139302.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheJayDuck", "nobbele"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}