{"id": 302608, "slug": "project-pantheon-alpha-demo", "name": "Project Pantheon Alpha Demo", "name_original": "Project Pantheon Alpha Demo", "description": "<p>This is a metroid-vania with a PvPvE focus as of right now that is in early development, so most if not everything is subject to change. As of right now there is no keyboard support (mostly because I cannot find a good control scheme for keyboard at the moment.)</p>\n<p>The goal of the game is that you and 4 friends are thrown into a set environment at different points. Your goal is to be the last one standing by any means necessary. Find power ups to grow stronger and to take out other players in the process.</p>\n<p>This game has been in development for 4 years do to multiple times where the project would be lost or the file would need to be scrapped do to massive amounts of glitches that made it a better choice to just restart. This games art-style is something that took a long time for all of us to get into something we like. I know that this game is by no means perfect but for me and the people working on it... it has been a long journey to get here. We from lads with hats hope you will enjoy the game we have been working on.<br/></p>\n<p>In this games development we went through at least 7 different ideas for art-styles. But ultimately settled on one that captured the tone of the game we wanted to make.</p>\n<p>The trailer is a far earlier build of the game.</p>\n<p>Power-ups in the game:<br/></p>\n<p>Missiles</p>\n<p>Railgun*</p>\n<p>Flak-Cannon*</p>\n<p>Phaser*</p>\n<p>Shot-Gun*</p>\n<p>Wall-Jump+</p>\n<p>Hazard Armor</p>\n<p>Shield</p>\n<p>Booster-Jump+</p>\n\n<p>Controls:</p>\n<p>Helpful debug button: R (Keyboard): Restart the game Only use this if there is a game breaking glitch and report it to me immediately :).</p>\n\n<p>Controls: Menu (Xbox Controller)</p>\n<p>LS: Move up and down</p>\n<p>DPAD-Up: Move up<br/></p>\n<p>DPAD-Down: Move down<br/></p>\n<p>A: Select</p>\n\n<p>Controls: Character (Xbox Controller)<br/>A: Jump</p>\n<p>Y: Toggle Weapon<br/></p><p>X: Interact with doors</p>\n<p>RT: Fire</p>\n<p>RB:LedgeHang<br/></p>\n<p>LS: Move left and right, aim up and aim down</p>\n<p>LSB: Sprint</p>\n<p>RT: Fire</p>\n<p>LB:Aim 45 degrees up</p>\n<p>LT: Aim 45 degrees down</p>\n\n<p>If one player is left in multiplayer you will be returned to the main menu by pressing the start button on your controller.</p>\n\n<p>Credits:</p>\n\n<p>Marketing Lead: Jake Hoerhold<br/>Game Design and Construction: Ethan Rotthoff<br/>Art: Desix Studios (Animation of Character and some of the stone assets)<br/>Art: Ethan Rotthoff (All other art assets and the creation of the character)<br/>Music Design: Charlie Pease</p>", "metacritic": null, "released": "2019-03-16", "tba": false, "updated": "2019-03-18T02:50:41", "background_image": "https://media.rawg.io/media/screenshots/a1a/a1ad0a09019982ba7e5cd8fb5eddc2e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fredxvi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}