{"id": 3028, "slug": "beyond-two-souls", "name": "Beyond: Two Souls", "name_original": "Beyond: Two Souls", "description": "<p>This game is often called an &quot;interactive film&quot; - because the proportion between the given story and the possibilities to influence the story is indeed somewhat different than in most games. The game develops between three points in the biography of the girl Jodie Holmes. In these three points, we find ourselves repeatedly. And in general, we see 16 years of her life, from 8 to 24 years.<br />\nJodie from birth has a gift of communication with a disembodied being called Aiden. In this context, the Jodie-Aiden couple can capture people&#39;s consciousness, move objects, and even strangle people. At the same time, Jodie is periodically exposed to attacks of vague energies.<br />\nHer parents are not her relatives, they give her to psychiatrists and refuse her. When the family of one of the psychiatrists perishes, Jodie, with the help of Ayden, establishes a connection with the deceased, she can let the living and the dead speak.<br />\nThe CIA is interested in Jodie&#39;s abilities and makes her become an agent. She then instructs her on several missions, but Jodie realises that she is being used for criminal activities - and refuses to cooperate with the CIA. CIA agents do not leave her alone, and she destroys them.<br />\nThe game has a lot of interpretations of what is happening in the world of the dead, different people use Jodi&#39;s forces in different ways. Jody herself also does not have a clear picture, she seeks and finds real parents, helps different people - but they rarely pay her the same.</p>", "metacritic": 73, "released": "2013-10-07", "tba": false, "updated": "2024-04-18T21:15:47", "background_image": "https://media.rawg.io/media/games/07a/07a74470a2618fd71945db0619602baf.jpg", "website": "https://www.quanticdream.com/beyond-two-souls", "rating": 3.79, "rating_top": 4, "added_by_status": {"yet": 375, "owned": 3727, "beaten": 1582, "toplay": 285, "dropped": 217, "playing": 72}, "playtime": 4, "achievements_count": 32, "ratings_count": 1693, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 1709, "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "developers": ["Quantic Dream"], "genres": ["Action", "Adventure"], "publishers": ["Sony Computer Entertainment", "Quantic Dream"], "esrb_rating": "Mature"}