{"id": 302854, "slug": "cyber-rage-retribution", "name": "Cyber Rage Retribution", "name_original": "Cyber Rage Retribution", "description": "Cyber Rage: Retribution – computer Action game in the genre of cyberpunk.<br/><br/>In the near future, humanity is faced with a serious threat. The last few years, the development of cyber-technologies has become popular among wealthy people, but another part of society is against robotization. At the junction of ideas, a split into two opposing camps takes place, and a terrible genius is in power. Steward Monster – a mechanic and the creator of implants, feeling the power of their knowledge, decides to enslave the population of the planet with the help of chips, under the influence of which people fall into madness and uncontrollable rage.<br/><br/>Can you resist the total plans of the Monster, leading the detachment of brave heroes?<br/>You have a choice of three strong characters of the resistance group: Boris, Magnus and Sonya.<br/><br/><br/>Boris is a former kick boxer, the leader of a broken gang.<br/><br/><br/>Magnus is an orphan, born in Chinatown, a monk and a graduate of the martial arts school.<br/><br/><br/>Sonya is a former mixed martial arts athlete. Once she was in a bar and quarreled with the head of the mafia, who tore off her right hand. Soon the arm was replaced with a powerful modernized prosthesis.<br/><br/>Your enemies are armies of soldiers of corrupt corporations and syndicates, bandits mercenaries and mutants from the laboratories of evil genius.<br/>Either alone or with a friend, go straight to the epicenter of the events of a huge metropolis to clean the streets of the future from enemy contagion!<br/><br/>Run the game and do it!", "metacritic": null, "released": "2019-04-02", "tba": false, "updated": "2019-08-28T21:47:27", "background_image": "https://media.rawg.io/media/screenshots/6a3/6a33966582d146f494103fc3e3691f7f.jpg", "website": "https://www.facebook.com/Extreme-Games-1531656503724867/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zulu"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "publishers": ["Extreme Games"], "esrb_rating": null}