{"id": 302894, "slug": "2d-paintball", "name": "2D Paintball", "name_original": "2D Paintball", "description": "<strong>Notice</strong>: This Game Is a Challenging Sim!<br/>We highly suggest reading &amp; watching the How-To-Play!<br/><br/>★ 2D PAINTBALL | A REAL-TIME COMPETITIVE MULTIPLAYER PAINTBALL SIM, IN 2D! ★<br/>Play the F2P Multiplayer Alpha on our website now!<br/><br/><br/><br/>★ GAME THEORY ★<br/><br/>The idea is to create a highly competitive 2D simulated speedball experience, by trying to re-create the true feel, strategy, and gameplay of playing tournament speedball. We believe that getting all of the \"small\" details right is what can really make this game work even in a 2D environment.<br/><br/>So in turn, this game will be less about graphics and more about actually getting the \"feels\" of strategic high-caliber paintball in 2D!<br/><br/><br/><br/>★ HOW-TO-PLAY / CONTROLS &amp; STRATEGY / GAMEPLAY TIPS ★<br/><br/>Check out our detailed How-To-Play on our website for the default controls, tips, tricks, and strategies to help you get a leg up on the others!<br/><br/><br/><br/>★ 2D PAINTBALL FEATURES ★<br/><br/>- \"3D\" Simulated Bunker Mechanics in a 2D environment (Dynamic ball arc / lower bunkers.)<br/>-- Player centered audio (paintballs \"woosh\" by, bounce/splat around you, near/far sounds.)<br/>- High-speed, Real-time Multiplayer (Custom 60+ and 128 tickrate server netcode!)<br/>- Customize Your Player (Head, Mask, Jersey, Gun, Hopper, Pods, Pack, and more!)<br/>- Play in 1v1 - 10v10 Events, co-op online or against online!<br/>- Competitive Divisions Ranked between D5 - D1, Semi-Pro, Pro, &amp; Masters.<br/>- Casual/Practice Game Modes (Team Deathmatch, King of the Hill, Pump Only, and more.)<br/>- Semi-auto, Ramping, Electro, Mechanical, &amp; Pump Paintball Guns + StatTrack markers!<br/>- \"Sightlines\" (Hard/Vision Restriction Mode) - Brings a whole new challenge to the game!<br/>- Difficult A.I. Bots - Be careful, this game isn't meant to be easy!<br/><strong>-- Skilled play is highly rewarded. Play smart, play tight, and shoot fast!</strong><br/><br/><br/><br/>★ 2D PAINTBALL -SINGLE PLAYER- FEATURES ★<br/><br/>- Play locally with no latency and up to 144* tickrate! - Super smooth gameplay<br/>- Pick any active field to play [sync online] (all fields unlocked in single player)<br/>- Choose your field settings and gameplay (all options unlocked in single player)<br/>- Select your loadout and customizations (all options unlocked in single player)<br/>- New field lighting options (morning, day, evening, dusk, stadium lights on/off)<br/>*Requires a decent CPU<br/><br/><br/><br/>★ 2D PAINTBALL -LOCAL / CO-OP / MULTIPLAYER- FEATURES ★<br/><br/>Want to have a LAN party? 2DPaintball - Steam Build will support Local Multiplayer / Coop on your local network... with only <strong>ONE</strong> copy of the game!<br/><br/>Fire up your single player custom match, and any computers on the local network will be able to connect to your field and play using a Chromium based web browser! -- How cool is that!<br/><br/>*Note, firewall options and port forwarding may be required for some networks.<br/><br/><br/><br/>★ 2D PAINTBALL -ONLINE MULTIPLAYER- FEATURES ★<br/><br/>- Earn XP to Unlock New Gear &amp; Fields (Guns, Hoppers, &amp; Paint.)<br/>- Paintball Field Creator &amp; Field Editor (100's of Maps In Rotation and more by our users!)<br/>-- Make an awesome map in our Field Creator &amp; we'll add it to the active map selection pool!<br/>- Daily PVP, Co-op &amp; Team Tournaments (Win Trophies and bragging rights!)<br/>-- Watch out, Tournaments are even Harder! You'll have to earn those trophies!<br/>- Ranked Matchmaking - PvP Only - ELO Rated, Team &amp; Solo Ranking (Highly competitive!)<br/>-- Be the best! Get Ranked vs. all other 2D Paintball players!<br/><br/><br/><br/>★ MORE INFO / HELP ★<br/><br/>If you are finding the game too difficult or are having technical issues, we highly suggest reading the always updated Gameplay Help &amp; Gameplay Smoothness Tips on our website. It's worth the read, and will help you better understand the inner workings of the game mechanics, controls, and ideal strategies.<br/><br/><br/><br/>★ CONTACT US! ★<br/><br/>Contact us about bugs, requests, feedback, questions, or just to say hi!<br/><br/>*We're always looking for new ideas, if you have any feel free to share with us! Leave some feedback on our website - We read each and every submission!", "metacritic": null, "released": "2019-05-01", "tba": false, "updated": "2019-08-28T21:47:23", "background_image": "https://media.rawg.io/media/screenshots/538/538e960a69aba40f2558d6b8c0f03b09.jpg", "website": "http://www.2DPaintball.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2Dio"], "genres": ["Action", "Strategy", "Simulation", "Sports", "Indie"], "publishers": ["2Dio"], "esrb_rating": null}