{"id": 302826, "slug": "blaster-master-zero-2", "name": "Blaster Master Zero 2", "name_original": "Blaster Master Zero 2", "description": "Mutant Blasting Action is back! Join Jason, Eve, and Fred on an intergalactic journey! <br/>\n<br/>\r\nThe side-scrolling/top-down hybrid action adventure title \"Blaster Master Zero\" returns with its long-awaited sequel!<br/>\r\nExperience the yet-untold story of Jason and Eve after defeating Earth's mutant scourge in \"Blaster Master Zero\" as they venture into the depths of space in their new battle tank, \"GAIA-SOPHIA\"!<br/>\n<br/>\r\nAfter eradicating the Mutant Core in the subterranean depths of planet Earth, Jason's partner Eve was infected by mutant parasites that have begun to slowly corrupt her body. <br/>\r\nThey now leave Earth behind and venture to Eve's home planet Sophia abroad G-SOPHIA in hopes of finding a cure.  <br/>\n<br/>\r\n・G-SOPHIA and the Gaia System<br/>\r\n    When G-SOPHIA falls from great heights or takes damage, the Gaia System converts the impact energy to SP for G-SOPHIA's weapons and functions.<br/>\r\n    Strategically traverse many different planets' terrain to generate SP and maximize the full potential of your battle tank G-SOPHIA!<br/>\n<br/>\r\n・Jason's newest ability: BLAST COUNTER<br/>\r\n    The BLAST COUNTER is a powerful counter-attack Jason can unleash on enemies the moment they attack.<br/>\r\n    Use the opening created by the COUNTER to unload your main and sub weapons on the defenseless enemy and clear top-down stages with speed and finesse!<br/>\n<br/>\r\n・Meet new pilots with their own support droids and Metal Attacker battle tanks<br/>\r\n　  Jason and Eve meet up with a variety of fellow Metal Attacker pilots and support droids as they journey through outer space.<br/>\r\n    Will their encounters create new friends and strong bonds, or they make new enemies and face even more strife...?", "metacritic": null, "released": "2019-03-20", "tba": false, "updated": "2023-03-22T07:43:15", "background_image": "https://media.rawg.io/media/screenshots/1bd/1bd04e3173b0378ab11c5ab8712dbcbc.jpg", "website": "http://blastermaster-zero.com/en/zero2/", "rating": 4.22, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 63, "beaten": 8, "toplay": 8, "dropped": 3, "playing": 1}, "playtime": 4, "achievements_count": 20, "ratings_count": 9, "suggestions_count": 136, "game_series_count": 9, "reviews_count": 9, "platforms": ["PC", "PlayStation 4", "Nintendo Switch", "Xbox One"], "developers": ["Inti Creates"], "genres": ["Action", "Platformer"], "publishers": ["Inti Creates"], "esrb_rating": null}