{"id": 302941, "slug": "grisaia-phantom-trigger-vol55", "name": "Grisaia Phantom Trigger Vol.5.5", "name_original": "Grisaia Phantom Trigger Vol.5.5", "description": "\"Grisaia: Phantom Trigger\" is a visual novel. More specifically, it is a kinetic novel, without any branching routes. Returning character artist Akio Watanabe and writer Ryuta Fujisaki bring you the latest installment in the acclaimed Grisaia series, \"Grisaia: Phantom Trigger\".<br/>\r\nTo celebrate the second anniversary of the series and its anime adaptation, volume 5.5 is planned to be released alongside volume 6 at the end of April.<br/>\n<br/>\r\nStory:<br/>\r\nWith nowhere else to go, Arisaka Shiori took a job at Mihama Academy. Now, three months have passed since she started her somewhat special position as a teacher at the \"school of assassins\".<br/>\r\nWhile she has tried her best to adapt to her new surroundings - and it seems like her students have finally accepted her - her teacher evalution is not quite so agreeable.<br/>\n<br/>\r\n\"She's, uh, unusually modest, and a bit clumsy. But she's sincere, and she tries her best at everything she does...\"<br/>\r\n\"I think she makes a great teacher, but that alone isn't going to keep her at Mihama.\"<br/>\n<br/>\r\nArisaka sees this harsh dose of reality as an opportunity to take an objective look at herself, delving deep the truth through conversations with her students. However, a certain nightmare continues to plague her like an illness...<br/>\n<br/>\n<br/>\r\nA girl, whose family has been branded murderers, closes her heart like a cocoon...<br/>\n<br/>\r\n\"I'm so scared...\"<br/>\r\n\"So scared of the outside world.\"<br/>\r\n\"What should I do?\"<br/>\r\n\"How can I convince them to leave me alone?\"<br/>\r\n\"What did I do to deserve this? Please, forgive me...\"<br/>\n<br/>\r\nSoon the time will come for Arisaka to make the biggest decision of her life.<br/>\n<br/>\r\n\"Do you still wish to continue in this job?\"<br/>\n<br/>\r\nWhich world will she choose to live in...?", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:18", "background_image": "https://media.rawg.io/media/screenshots/d24/d2408702409c4b855d472e4c78622251.jpg", "website": "http://grisaia-pt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 13}, "playtime": 4, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 18, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontwing"], "genres": ["Adventure", "Casual"], "publishers": ["Frontwing USA"], "esrb_rating": null}