{"id": 302918, "slug": "yi-fan-xun-zong-in-pursuit", "name": "疑犯寻踪 In Pursuit", "name_original": "疑犯寻踪 In Pursuit", "description": "Game introduction<br/>In the dark night, a murder occurred in a remote town. Eight suspects were wandering on the streets. Only 8 hours left, the innocents must prove their innocence and cooperate with the inspector to solve the case; but the real murderer must remain hidden in the crowd or escape from the town. Before the dawn, will the murderer be arrested or escape?Game description<br/>\"In Pursuit\" is a 1v1 strategy chess game. Players can choose to play a role of inspector or murderer. The game consists of 8 rounds. In each round,it will draw 4 out of 8 suspects. The two sides operate and move 2 in the order of 1-2-1.The suspects are excluded by the judgment at the end of the round (whether the murderer is witnessed). The inspector needs to prevent the murderer from fleeing the town and identify the correct murderer within the specified time as the winner. The murderer needs to hide in the suspects in 8 rounds until the dawn, or wait for an opportunity to escape from the town to win.Game Highlights<br/>+ Deep non-combat strategy gameplay<br/>+ Repetitive playability<br/>+ Play against AI or friends, the mutual game between high IQ<br/>+ Unique art style<br/>+ Fascinating background settingsContact us<br/>Welcome to feedback on this game through Weibo/QQ and other channels.<br/>Official Weibo：笑脸独立游戏工作室<br/>Official QQ：3168956408<br/>Official QQGroup：874695473", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:21", "background_image": "https://media.rawg.io/media/screenshots/f99/f99349c7e9b9bf8bffe8a9fb4cd78563.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Laughing Studio"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Laughing Studio"], "esrb_rating": null}