{"id": 303221, "slug": "life-is-pointless-itch-madgeniusgames", "name": "Life is Pointless (itch) (madgeniusgames)", "name_original": "Life is Pointless (itch) (madgeniusgames)", "description": "<p>Earn points by doing that which is pointless.<br/><br/>Based on the designer’s own struggle with depression, <em>Life is Pointless</em> takes the player on a cerebral and stoic adventure as they try to escape their meaningless existence. Deep and contemplative, the player is forced to repeatedly complete the same mundane tasks in this minimalist experience, watching as the days pass endlessly before them. More of a philosophical argument than a game, <em>Life is Pointless</em> will force you to take a closer look at your own daily actions, and determine if you, too, are in the pointless pursuit of points.<br/><br/>Features include:<br/>•\tOver .01 hours of exciting gameplay!<br/>•\tAbsolutely no multiplayer capabilities!<br/>•\tVivid color palette of black, white, off-white, and dark-grey!<br/>•\tPainstakingly produced over the span of almost an entire week!<br/>•\tTwo endlessly looping tracks of music, each an astonishing six seconds long!<br/>•\tRevolutionary day and night cycle!<br/>•\tIncredibly smooth learning curve!<br/>•\tPoints!<br/><br/>But the best part about <em>Life is Pointless</em> is that you don’t even need to be actively playing the game to earn points! For the truly devoted player who wants to live the game, rather than play it, they can minimize the application, and perform their daily computer routines. Even if the game loses focus, it will still record the number of key presses you enter, slowly adding them to your score. At the end of the day, you can go back into the game, and see just how many points your normally pointless existence has earned you!<br/><br/>“Fantastic!”<br/>-\tMade up game reviewer #1<br/><br/>“5 stars!”<br/>-\tMade up game reviewer #2<br/><br/>“The greatest game ever made!”<br/>-\tWill deManbey (<em>Game Designer, Life is Pointless</em>)<br/><br/>“Better than Car Theft Auto!”<br/>-\tWill deManbey’s Mom<br/><br/><br/>Disclaimer:<br/>If you haven’t already guessed from the above description, screenshots, and trailers, there isn’t all that much to this game. It was created from a place of twisted darkness in the designer’s soul, and publishing it was just something he decided to do for fun. He was originally going to make it free, but the same twisted darkness thought it would be hilarious to make people pay for it. That being said, do not purchase this “game” if you do not have a sense of humor. If you’re planning on feeling disappointed, and writing a negative review about it later, then you might as well stop right here. This game was built on negativity and disappointment, so the designer has plenty of it already.</p>", "metacritic": null, "released": "2019-03-19", "tba": false, "updated": "2019-03-22T03:01:01", "background_image": "https://media.rawg.io/media/screenshots/b7d/b7df16785511844d35399125fb8e7fcd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["madgeniusgames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}