{"id": 303276, "slug": "interdmusical", "name": "InterDMusical", "name_original": "InterDMusical", "description": "INTRODUCCIÓN\r\n<p>Interdmusical es un juego de música móvil dirigido a todos los públicos y que reúne una amplia variedad de estilos musicales. Con un encantador estilo gráfico y una selección de canciones que no dejarán indiferente a nadie, Interdmusical promete entretenimiento acompañado de buena música.</p>\r\n\r\nHISTORIA\r\n<p>InterdMusical tiene lugar en un universo en el que 6 dimensiones diferentes convergen en un evento musical que se organiza para probar la capacidad y la capacidad de crear música. Cada dimensión abandona un estilo musical diferente, por lo que tiene que defenderlo del resto para el jurado de qué dimensión es la mejor. El premio para el ganador será dar a conocer esta dimensión, dar un nombre y un reconocimiento en el Salón de la Fama Interdimensional en el campo musical. Entre los diferentes estilos musicales podemos encontrar: Disco, Clásico, Jazz, Rock, EDM y Drumstep. Cada uno tiene que ofrecer el mejor espectáculo posible, tanto a nivel musical como de espectáculo, y convencer al jurado de su dimensión es, sin duda, la mejor producción musical.</p>\n\r\n\r\nMECÁNICA\r\n<p>El objetivo básico del juego es seguir el ritmo del juego, que se verá como una serie de botones que aparecerán en la parte superior de la pantalla, siguiendo una línea hacia abajo, donde el jugador debe presionar para llegar al área designada. .</p>\n<p> <br/></p>\n<p><strong>Este juego ha sido realizado por alumnos de 2º de ESCAV (Granada)</strong></p>\r\nLos desarrolladores\r\n<p>Joaquin Rodriguez Martos</p>\n<p>Juan López Puerta</p>\n<p>Jesús Rodriguez García</p>\n<p>Alba Carpena Rubio</p>\n<p>Andy Rosado Villegas</p>\n<p>Sergio López Pérez</p>\n\r\nArte \r\n<p>Ana Casero</p>\n<p>Miguel Ángel Gil</p>\n<p>Oufan Zhang</p>\n<p>Ramón González</p>\n<p>Daniel Jiménez</p>\n<p>Pablo Jiménez</p>", "metacritic": null, "released": "2019-03-19", "tba": false, "updated": "2019-03-22T03:09:12", "background_image": "https://media.rawg.io/media/screenshots/a19/a1910bd9486237dcada9947eb16781bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InterDMusic"], "genres": [], "publishers": [], "esrb_rating": null}