{"id": 303358, "slug": "bqm-block-quest-maker", "name": "BQM - Block Quest Maker", "name_original": "BQM - Block Quest Maker", "description": "BQM is about two simple things - Challenge &amp; Create<br />\nDon’t be deceived by its pixel style look, it’s rather hardcore and never been easy.Block Quest Maker, is nothing like Crossy Road, it’s an RPG builder which drives you to get through the dungeons by fighting the monsters, saving the princess, and mostly solving the puzzles.<br />\nPure satisfaction, the moment you clear a dungeon, after failing 100 times.<br />\nYou may wonder if it’s difficult to design a level?<br />\nNo, anyone can enjoy this Maker, with a simple click of a mouse you can choose the elements, set the triggers, place the monsters/NPCs, and shape your own dungeons. Finally, share your level with the public. you can socialize with players who clear (or fail) your levels.<br />\nYou don’t like to create your own maps?<br />\nNo worries, you can focus only on playing dungeons made by other fans. There are a massive amount of maps uploaded by fans over the world. Some are fun, some are evil, some with good RPG storytelling that will have you hooked.The developers have selected a few classic and enjoyable dungeons as official maps.<br />\nWhy we call it an RPG?<br />\nYou: a warrior, can equip a sword and a shield, bombs, magic wands, with a variety of skins.Monsters: Orc, skeleton, slime, poisoned mushroom, bomb man, rocky, snake and spider, etc.. each of them has their own unique skill.<br />\nNPC: will give you hints, trigger events, they will sometimes even fight you if you attack them first!<br />\nEvents: block, float, fence, bomb, switch, arrow, portal…<br />\nAnd most importantly: saving the Princess!<br />\nConnect with BQM fans<br />\nYou are never alone in this game! There will be admirers and haters :-)After your first clearing of the dungeon you created, it can be published to all players while setting a price for an entry fee of your dungeon fee to make you earn golds from players who challenge your design.<br />\nRanks allow you to see newest, or the craziest maps invented by others. You may scream for it, or love it, or leave a comment after retrying 1000 times but still failed then saying “Goddamn insane!”<br />\nIf you are already an experienced gamer, you should make your own games now!<br />\n(We are a small developer and have quite a low budget for commercial quality localization and almost no money for marketing. We apologize for any wording mistake in multiple languages and hope you can help us to improve the store page appearance and build up the community with more creative content)</p>", "metacritic": null, "released": "2019-03-19", "tba": false, "updated": "2021-04-11T00:11:01", "background_image": "https://media.rawg.io/media/screenshots/c37/c3797c98398c43494c99cbc6f63accb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Nintendo Switch"], "developers": ["Gamera Game"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}