{"id": 303478, "slug": "last-men-alive", "name": "Last Men Alive", "name_original": "Last Men Alive", "description": "<p>Playable by only<strong> two people</strong> in either a <strong>public or private room</strong> (you need to know the room name to join the \"private\" one).<br/>Controls only for<strong> Mouse &amp; Keyboard.</strong></p><p><strong>PLEASE READ BEFORE PLAYING:</strong><br/><br/>I didn't have the time to make sure to state something like that, so I need to put it here.<br/><strong>Connecting:</strong><br/><br/>To connect to a game, you need to always<strong> input your name in the Input Field</strong> on the top.<br/>Then you need to decide whether you want to play a game with another random player, who's looking for a random player as well, by choosing the middle banner;<br/>(Then, all you need is to wait for him to start the game, or start the game yourself with the button in the middle of the screen &lt;<strong>only if two players are connected</strong>&gt;)<br/>OR<br/>Use the right banner to play with a friend of yours. Then you just both input the exact same name of the room and then press \"Survive\" button beneath it.<br/>(The button in the middle will prompt too, you can see if your friend connected and then press it to start)<br/><br/><strong>In-game:<br/><br/></strong>The bar on the right shows the distance between players. As said in the intro, <strong>you can't separate too much if you want to survive. </strong><br/><strong>The further you are from the other player, the stronger are the enemies.</strong><br/><br/>At any time in-game, you can hold <strong>TAB </strong>to see the names of yours and your teammate's  (top left corner of the screen).</p><p>Created by Toroll<br/>Follow me on my site, or itch.io, if you want to see progress on this and other games.<br/>Wish I had a day more of time to add sounds, more animations, more maps and a goal.<br/>For now, all you can do here is survive with a friend of yours, or a random player.</p>\n<p>Some credits:<br/>rileygombart -&gt; for creating a free top-down survivor<br/>A* Pathfinding Unity Asset<br/>Photon Unity Networking Asset<br/><br/></p>", "metacritic": null, "released": "2019-03-18", "tba": false, "updated": "2019-03-22T03:39:01", "background_image": "https://media.rawg.io/media/screenshots/345/34524bfb1f86ca57e8287ce5c5a7bffa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Toroll"], "genres": ["Action"], "publishers": [], "esrb_rating": null}