{"id": 303530, "slug": "dysjunction", "name": "DysJunction", "name_original": "DysJunction", "description": "<p>In Dysjunction, race to get the most points by building irresponsibly long tracks and keeping opponents from sending their own trains to the end in a local multiplayer experience for 2-4 players.<br/>In the first half, lay down tracks for your trains to follow. The longer the track, the more points sending a train will give, and the more trains you can send. You can even lay track over itself and the opponents' railroads to make a longer path.<br/>In phase 2, send trains out to attempt to reach the end. Adjust the speed and length of the train, as a faster and longer train will give more points. But be careful - crashing into an obstacle or opponent will stop the train, and keep you from getting points.</p>\n<p>2-4 Players<br/>Supports XBox Gamepads and keyboard<br/>Controls:</p>\n<p>Keyboard<br/>---<br/>Phase 1:<br/>Arrow keys - Rotate track placement<br/>Space - Place a track segment<br/>X - Undo the last track placed</p>\n<p>Phase 2:<br/>Space to send a train<br/>Up arrow - Increase length of the next train to send<br/>Down arrow - Decrease length of the next train to send<br/>Right arrow - Increase speed of the next train to send<br/>Left arrow - Decrease speed of the next train to send</p>\n<p>Gamepad<br/>---<br/>Phase 1:<br/>Left analog - Rotate track placement<br/>A - Place a track segment<br/>B - Undo the last track placed</p>\n<p>Phase 2:<br/>Y - Increase length of the next train to send <br/>B - Decrease length of the next train to send<br/>RT - Increase speed of the next train to send<br/>LT - Decrease speed of the next train to send</p>", "metacritic": null, "released": "2019-03-18", "tba": false, "updated": "2019-03-22T03:48:21", "background_image": "https://media.rawg.io/media/screenshots/c50/c500b808a6f83e1659b32a7f044ee40d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["codeHeavy"], "genres": [], "publishers": [], "esrb_rating": null}