{"id": 303544, "slug": "project-onism", "name": "Project Onism", "name_original": "Project Onism", "description": "<p>What does it mean to disappear? <br/></p>\n<p>To leave and one day come back? </p>\n<p>Or simply to vanish forever without a trace?</p>\n<p>\t\tSome will believe, that which disappears without a sound will </p>\n<p>always come back; whether it be the same, or something else</p>\n<p>entirely. Others, conclude that the abandoned ascend to a higher </p>\n<p>plane waiting only to be reunited. Even those with the</p>\n<p>bleakest of minds will speculate, but only to the extent of what’s </p>\n<p>lost is lost, never to be seen again.</p>\n<p>\tFor what does it mean to truly disappear; </p>\n<p>To have what once was fade away as a distant memory, </p>\n<p>left only to be forgotten over time. </p>\n<p>This is, the essence of humanity, </p>\n<p>the transient property of life that defines us all.</p>\n<p> As the definition of time skews,</p>\n<p> the lines which draw our memories blur, unrecognizable. </p>\n<p>Life as we know it fades,</p>\n<p> until reality becomes distorted,</p>\n<p> shifted, </p>\n<p>and lost. </p>\n<p>It is at this moment, when what it means to disappear becomes inherently obvious.</p>\n<p>Because memory is the only thing which proves existence...</p>\n\n\n<p>Project Onism is a Puzzle/Story based video game demo. The game features a child named Duncan who wakes up on a seemingly normal day, but as time progresses, reality slowly changes until things quickly get out of hand. Until the very end of the game, the player goes through a seemingly random set of events and has to solve puzzles to progress. The player eventually figures out they played through the 5 stages of grief from Duncan's perspective as he is dying from terminal illness. Only by living the grief of his own death, can Duncan accept his own fate.  This demo includes the beginning/introduction of denial, the first stage of grief.<br/></p>\n<p>Project Onism was canceled a while ago in 2018. The game was a demo made by me, Collin Patrick, and a good friend, Brandon Funk, for an advanced video game program/design class in high school. Sadly, continued development of the game was not possible due to time constraints of every day life. Although it was canceled, I felt I should publish the last build of the game so anyone could play it if they wanted to since we put so much work into it. </p>\n<p>Disclaimer: The game demo might take a few minutes to load after starting up and is not optimized. Although not optimized, it should sill run fine on most systems. The demo itself is fairly short, and really only introduces the story so don't expect anything big.</p>", "metacritic": null, "released": "2019-03-18", "tba": false, "updated": "2019-03-22T03:50:43", "background_image": "https://media.rawg.io/media/screenshots/788/788d07dadca5a6516cd5084c920e8639.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Collin Patrick"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}