{"id": 303526, "slug": "hikensha", "name": "Hikensha", "name_original": "Hikensha", "description": "<p>A brand new Yume Nikki fangame done in RPG Maker VX Ace, mostly focused on breaking the usual format of most fangames and even the source material itself.<br/><br/></p>\n<p>Summary:</p>\n<p>You take control of Yarishi, who doesn't quite remember certain events from the past besides how he had recurrent dreams when he was younger. Once again, the recurrent dreams are back but this time he's determined to find the reason and stop them once and for all.</p>\n<p>Content:</p>\n<p>The game features (or will feature eventually) improved graphics and animations(wich are constantly being updated as things are included), full length songs in order to make them less repetitive, and both major and regular NPCs you can sometimes befriend or can grant you access to some \"sidequests\", giving you clues, opening areas, adding occasional pieces of lore, etc. wich might also influence in the endings you might get.</p>\n<p>The areas also try to be as interactive as posible, and said interactions you  make (either positive or negative) influence the endings or your gameplay as a whole.<br/><br/>The game it's still in constant development, and while it's still far from being finished, I'm working on every single one of the assets all by myself and making sure to deliver the best possible features in terms of gameplay, visuals, audio, etc.<br/></p>\n<p>The demos are gonna be released on a MEGA folder wich will contain both the latest demo and older versions and backups of the game for anyone to try out!<br/></p>\n<p>Any questions or suggestions about the game, it's content, or future updates can be left down here in the comments~<br/></p>\n<p>(you can find me on Twitter as @MK_437 as well)</p>", "metacritic": null, "released": "2019-03-18", "tba": false, "updated": "2019-03-22T03:47:27", "background_image": "https://media.rawg.io/media/screenshots/eeb/eeb652c015a534659b886adacde792ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["K437"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}