{"id": 303609, "slug": "powder-vr", "name": "Powder VR", "name_original": "Powder VR", "description": "Ride for FREE while it's in Early Access!<br/><br/><br/><br/>Strap your headset on and ride the freshest powder VR has to offer. Pick your line and your method, fly through ice and snow at crushing velocity. Face every challenge with speed, precision, and skill- master the mountain from 14,000 ft. and dominate the rugged terrain.<br/><br/><ul><li> Hit the slopes and choose between <strong>skiing</strong>, <strong>snowboarding</strong>, and <strong>wingsuiting</strong> your way to the finish!<br/></li><li> Fight the clock and the terrain- drop down sheer cliffs, soar over glaciers, and slide across frozen lakes, dense forests and abandoned towns.<br/></li><li> Obliterate every speed record in the <strong>downhill race</strong>, score the highest points with the sickest tricks in <strong>freestyle</strong>, or navigate the perfect line in <strong>slalom</strong>.<br/></li><li> Adjustable comfort settings and gameplay <strong>optimized to reduce VR motion sickness</strong>.<br/></li><li> Choose between <strong>arcade</strong> and <strong>simulation</strong> styles to enhance the feeling of shredding the mountainside and the raw thrill of catching big air.</li></ul>In the full release:<ul><li> Tour six different mountains, each with their own unique environment, set of courses and challenges.<br/></li><li> Earn enough medals to heli-drop anywhere you like and free-roam explore every inch of the mountain.<br/></li><li> Get ready to reach ludicrous speed and create ridiculous stunts with the unlockable rocket pack.<br/></li><li> Steam achievements, additional unlockables and easter eggs.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:13", "background_image": "https://media.rawg.io/media/screenshots/2a3/2a3687ad38399d8c1d668191a5552cfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RainSoft"], "genres": ["Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["RainSoft"], "esrb_rating": null}