{"id": 303603, "slug": "toolboy", "name": "ToolBoy", "name_original": "ToolBoy", "description": "The story of a repair robot who, instead of going to a speedball match on a nearby planet on a free weekend, has to come to work to repair the fault in one of the corporate buildings, as usual in such cases it fell on him. By accident, he discovers a corporate board plot for a new project related to the department of power. Unfortunately, the conspirators know that they are being intercepted and begins to follow the hero. Toolboy starts to escape by solving new puzzles and revealing further details of the plot. over time Toolboy gains more skills as superpowers. Our hero also has an ally in the form of an old disconnected from the main computer system. Toolboy communicates with him in special information points getting more tips.<br/><br/>Help our Hero in this difficult mission, discover new powers, solve puzzles, climb, jump and swim, face opponents. Discover the story of a corporate conspiracy.<br/><br/>Toolboy is an old-style platform game inspired by classic platformers. <strong>You will find here the mechanics of the game from such classics as Mario, Rochard or Rayman</strong>!SuperpowersToolboy has 5 superpowers that start in order at each level.<br/><br/><ul><li>A pilot in the form of a Controller<br/>It allows you to control some devices by changing their direction of rotation.<br/><br/></li><li>CUBE<br/>Toolboy turns into a cube that looks like an element of scenery and this allows him to hide from the drones scanning the area.<br/><br/></li><li>SpeedRun<br/>A super race that uses our Hero in Speedruns between levels to escape from opponents.<br/><br/></li><li>Magnetic Walk<br/>Allows you to move large objects - mainly containers, which serve as elements for climbing and jumping to the next stages.<br/><br/></li><li>Drone<br/>Allows you to control the camera to review the situation around the hero. this allows you to choose a good way Dron is useful mainly on levels with climbing elements.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-25T22:07:44", "background_image": "https://media.rawg.io/media/screenshots/ee7/ee726fa2872e31d695627d4b1bfd8b21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 9, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Majestic Twelve"], "genres": ["Adventure", "Indie"], "publishers": ["Ultimate Games", "Art Games Studio"], "esrb_rating": null}