{"id": 304183, "slug": "lego-brawls", "name": "Lego Brawls", "name_original": "Lego Brawls", "description": "<p>Dream up the ultimate Minifigure brawlers and bash your way through all of your favorite LEGO® themes in the first team action brawler set in the LEGO universe. Play with friends at home or around the world and see how you stack up against the competition.</p>\n<p>BUILD THE ULTIMATE BRAWLER<br />\nDesign your ultimate LEGO Minifigure hero with unique style, strategy and personality. A cactus with an attitude? A scrappy janitor ninja who happens to have fighting chickens? A sledgehammer-swinging clown with a few scores to settle? Sure! Build the ultimate brawler and level them up with unlockable content!<br />\nBATTLE THROUGH EPIC LEGO THEMES<br />\nFrom the swashbuckling shores of Barracuda Bay, to the waterlogged caverns of Ninjago Seabound, to a dusty wild west saloon and the mythical Monkie Kid jungle, all of your favorite LEGO themes are brawlable! Collect unlockable minifigures, power-ups, and emotes along the way.<br />\nCROSS-PLAY WITH FRIENDS ACROSS PLATFORMS<br />\nTeam up and brawl 4v4, party with friends, or play a battle royale-style game mode where it’s “every-player-for-themself”. With multiple game modes, levels have unique challenges and win conditions.<br />\nBATTLE AND BUILD YOUR WAY TO THE TOP OF GLOBAL LEADERBOARDS<br />\nHow tough are you? Battle to the top and track your rank against everyone else in the world! Do you have what it takes to be the best?</p>", "metacritic": 56, "released": "2022-09-02", "tba": false, "updated": "2024-01-30T17:55:40", "background_image": "https://media.rawg.io/media/games/f48/f48a88e9a8f4c601721248b151be4928.jpg", "website": "https://www.legobrawlsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 26, "beaten": 1, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 34, "ratings_count": 1, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 5", "PC", "Nintendo Switch", "Xbox Series S/X", "Xbox One", "PlayStation 4", "iOS"], "developers": ["Red Games"], "genres": ["Action", "Casual", "Fighting"], "publishers": ["LEGO® Games"], "esrb_rating": "Everyone 10+"}