{"id": 304130, "slug": "gyro-boss-dx-itch", "name": "Gyro Boss DX (itch)", "name_original": "Gyro Boss DX (itch)", "description": "<p>Your home planet is under siege from a band of intergalactic pirates led by the fiendish Gyro Boss!</p>\n<p>Unfortunately your technology is no match for this deadly beast and his crazy weapons. Every game is doomed from the start, but you'll fight with honour to complete your mission objectives and achieve the best possible score.</p>\n<p>Dodge an endless assault of weapons as you orbit around the boss on a fixed circle, it's not as easy as it looks. Can you secure bragging rights as the best space pilot to bite the dust against the alien menace?</p>\r\n\r\nCrazy Weapons\r\n\n<p>Dodge Gyro Boss' crazy attacks including shoals of squid, extendable boxing gloves, cluster bombs, homing silverfish and many more. You can even find out which weapons cause you the most trouble by looking up your deaths in the statistics menu.</p>\r\n\r\nMultiplayer Madness\r\n\n<p>New to Gyro Boss DX - enter party mode with 2-4 players and battle the boss together. Party mode cycles through a variety of weird mini games including faulty brakes mode and civil war. Who will come out on top?</p>\r\n\r\nFifty Objectives\r\n\n<p>When your friends aren't around, you can always enjoy classic mode. We've added 50 objectives to the game so you can feel good about yourself even when you're failing miserably in your fight against the Gyro Boss.</p>\n<p>Dare to take on the Gyro Boss today. Your planet needs you.</p>", "metacritic": null, "released": "2019-03-22", "tba": false, "updated": "2019-03-25T03:06:40", "background_image": "https://media.rawg.io/media/screenshots/db6/db6cbc97483f640d90cc0356e92f9155.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chequered Ink"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}