{"id": 304187, "slug": "five-nights-at-freddys-vr-help-wanted", "name": "Five Nights at Freddy’s: Help Wanted", "name_original": "Five Nights at Freddy’s: Help Wanted", "description": "<p>Five Nights at Freddy’s: Help Wanted is a collection of classic and original mini-games set in the Five Nights universe. Survive terrifying encounters with your favorite killer animatronics in a collection of new and classic FIVE NIGHTS AT FREDDY’S™ experiences. “Where fantasy and fun come to life!”</p>\n<p>A VR headset is NOT required to play.</p>\n<pre><code>YOU’RE HIRED - Time to get your hands dirty. Repair claustrophobic ventilation systems, troubleshoot broken animatronics that could activate at any moment, or spend your evenings cowering in the nighttime security guard office.  \nCELEBRATE - Confront your favorite killer animatronics including; Freddy, Bonnie, Chica, Foxy, Springtrap, The Mangle, Funtime Foxy, and Circus Baby.  \nFUN FUN PRIZES - Toys, Plushies, Bobbleheads, and candy candy candy! Earn super fun prizes you can play with at the interactive Prize Counter! Collect well hidden Faz-Tokens to unlock even more rare collectibles for more SUPER FUN FUN FUN.  \nPIZZA PARTY - Scenes from classic titles have been updated and remade for a fully immersive experience including; Five Nights at Freddy’s, Five Nights at Freddy’s 2, Five Nights at Freddy’s 3, Five Nights at Freddy’s 4, and Five Nights at Freddy’s: Sister Location.  \nTWO WAYS TO PLAY - Experience the horror in flat (non-VR) mode or VR. Oculus Rift and HTC Vive are supported.\n</code></pre>", "metacritic": 66, "released": "2019-05-28", "tba": false, "updated": "2024-03-17T17:08:43", "background_image": "https://media.rawg.io/media/screenshots/89a/89afc622bafe66a47ae35468b70528de.jpg", "website": "https://www.steelwoolstudios.com/five-nights-at-freddys-help-wanted", "rating": 4.33, "rating_top": 5, "added_by_status": {"yet": 3, "owned": 27, "beaten": 4, "toplay": 8, "dropped": 3}, "playtime": 3, "achievements_count": 22, "ratings_count": 9, "suggestions_count": 216, "game_series_count": 11, "reviews_count": 9, "platforms": ["PlayStation 4", "Xbox One", "PC", "Nintendo Switch", "iOS", "Android"], "developers": ["Steel Wool Studios"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["ScottGames"], "esrb_rating": "Teen"}