{"id": 304295, "slug": "steamhounds", "name": "Steamhounds", "name_original": "Steamhounds", "description": "<strong>We're currently in active development - please consider wishlisting us, and get notified when the game is released!</strong><strong>To become a playtester, chat to the devs, and get access to the prototype right now, just click through our website link (over there on the right -&gt;) and join our Discord!</strong>  In Steamhounds, you will take control of a team of steampunk mercenaries, doing the dirty work of the shady factions who vie for control of a once-great industrial city.  Assemble a crew and build up their strength by deploying them on missions to infiltrate, steal, and eliminate their targets. Challenge your friends in competitive team-vs-team battles, or attempt to climb the online leaderboards in ranked matches.  <ul><li>A mash-up of traditional JRPG and tactical / grid-based combat<br/></li><li>With an innovative Stance system, you don't stand idle between turns - set up powerful combos and chain-reactions, and attempt to dismantle those of your opponent<br/></li><li>Adopt a formation before you fight, and adapt to the changing tides of battle<br/></li><li>Live, competitive online play. Fight for your faction, or for personal glory<br/></li><li>Build up your mercenary crew, take on missions, and uncover dark truths about the city and its inhabitants<br/></li><li>Stylish pixel art characters in a 3D world</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:04", "background_image": "https://media.rawg.io/media/screenshots/784/784118758d7a7a2e8467bf916b688cfe.jpg", "website": "https://discord.gg/StrayBasilisk", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Stray Basilisk"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Stray Basilisk"], "esrb_rating": null}