{"id": 304293, "slug": "mayhem-in-single-valley", "name": "Mayhem in Single Valley", "name_original": "Mayhem in Single Valley", "description": "<p>Help Jack survive his voyage of self-discovery!<br />\nJack, a local troublemaker, makes series earth-shattering discoveries on the day he is supposed to leave home for a new life in the city.<br />\nMayhem in Single Valley is a thoughtful top-down action adventure. Its focus on family, friendship, and everyday struggles mixed with its combat, mysteries, puzzles, and meta-fiction ponderings, provides an action-packed, humorous, and emotional gameplay experience.<br />\nSingle Valley is a microcosm of everyday life but with our fears and paranoia dialled up to eleven. Imagine a town where the craziest news stories happen regularly, where the odds of getting struck by lightning or attacked by misinformed townsfolk are never in your favour, and you are one step closer to envisioning life in Single Valley.​<br />\nFEATURES:<br />\nAn in-depth story with weird and wonderful fleshed-out characters.<br />\nDynamic context-based conversations and inner monologues.<br />\nLots of level-up items, Easter eggs, and mini games.<br />\nCombine different food types, antidotes, and poisons to escape and/or manipulate crazed wildlife and bosses.<br />\nCombine, use, equip, items. But beware! Searching through your knapsack leaves you vulnerable to attack.<br />\nPull, push, drag, and generally fling items about your environment to solve puzzles and overcome obstacles.<br />\nPortable cassette player based soundtrack. You decide what music you&#39;d like to accompany your battles.<br />\nLots of JJ Abrams-esque secret stuff I can&#39;t speak about right now : )</p>", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T04:05:26", "background_image": "https://media.rawg.io/media/screenshots/0cf/0cf2ad28c61052d301064c408131ba21.jpg", "website": "http://fluxscopic.com/mayhem-in-single-valley/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 95, "beaten": 1, "toplay": 6, "dropped": 3}, "playtime": 1, "achievements_count": 40, "ratings_count": 4, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "Linux", "PC"], "developers": ["fluxscopic"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["tinyBuild", "Fluxscopic"], "esrb_rating": null}