{"id": 304219, "slug": "sentenced", "name": "Sentenced", "name_original": "Sentenced", "description": "Sentenced combines the oppressive horror atmosphere and the complexity of survival, mixed with its stealth system and permadeath. In the depths of the labyrinth, a variety of monsters will not leave a place where you could relax in safety.<br/>\r\nSentenced challenges the player's cold blood and ingenuity, because it’s the only way you can collect everything you need to win. Look for resources that will help, if not survive, then extend your existence. Hide or run away, of course almost any enemy is mortal, but the noise of the fight will attract new monsters, and the patrons are such a rarity that it is better to save for the most extreme case.<br/>\n<br/>\r\nGame features:<br/>\n<br/>\r\nVarious types of monsters with their own features.<br/>\r\nSearch resources for survival.<br/>\r\nStealth mechanics, allowing to bypass hard places.<br/>\r\nA huge labyrinth, covered with darkness of mystery.<br/>\r\nA real challenge for hardcore players who are ready to prove that they can survive and get out from anywhere.<br/>\n<br/>\r\nOpportunities:<br/>\n<br/>\r\nRun away, hide, look for resources, use any opportunities to survive. Think over routes and possible ways for escape, wait for the right moment and save resources - no one knows if you will be lucky to find the right thing next time. And any mistake almost guarantees death. Permadeath. And a new start to race with death.<br/>\r\nGood luck!", "metacritic": null, "released": "2019-04-26", "tba": false, "updated": "2019-08-28T21:47:10", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aac78ac970b9d84b1eeac0a8d075a4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vitalij Kurjata"], "genres": ["Indie"], "publishers": ["Vitalij Kurjata"], "esrb_rating": null}