{"id": 304260, "slug": "we-are-the-caretakers", "name": "We Are The Caretakers", "name_original": "We Are The Caretakers", "description": "We Are The Caretakers is a real-time afrofuturist squad and society management game inspired by XCOM, Darkest Dungeon, Ogre Battle, and Northgard. Players will make difficult, permanent decisions to unite cultures on a post-postapocalyptic planet after the barrier that separates the Caretakers from the rest of the world mysteriously falls.<br/><br/>Only together can you protect the Raun -- massive, energy-charged, endangered animals -- that may be the key to saving the world.<br/><br/><br/><br/><ul><li> <strong>ORIGINAL AFROFUTURIST UNIVERSE</strong>: Former Activision-Blizzard artist Anthony Jones brings breathtaking afrofuturist style and human empathy to the complex sci-fi world of We Are The Caretakers.<br/></li><li> <strong>REPUTATION SYSTEM</strong>: Every action committed in the world has an effect on how the Caretakers are treated by others, and their ability to protect the endangered Raun that define their way of life.<br/></li><li> <strong>HUMAN SQUADS</strong>: Assemble squads from individuals with diverse traits, abilities, and personalities, each with geographic and personal ties to the land they patrol. Train and upgrade your Caretakers across 20+ unique job classes.<br/></li><li> <strong>TAILORED GENERATION</strong>: Procedurally-generated maps are created within sophisticated guidelines to ensure limitless variety that retains the singular storytelling and emergent moments enabled by one-off level design.<br/></li><li> <strong>COMPLEX CONFLICT</strong>: An innovative combination of turn-based combat, intent deduction, and permanent consequences shows the human cost of conflict, as well as provides alternative ways of resolving situations that fall outside of strict personal combat.<br/></li><li> <strong>NUANCED NARRATIVE</strong>: IGF-nominated narrative designer Xalavier Nelson Jr. creates a morally-complex world with human emotion at the core of every scenario, where the individuals outside your squad matter as much as the rangers you deploy on each map.<br/></li><li> <strong>CULTURAL DIPLOMACY</strong>: Meet international and community leaders inside your sci-fi HQ, considering how each of their conflicting demands will affect your ability to influence their factions in the future.<br/></li><li> <strong>RIGOROUS RESEARCH</strong>: Guide the direction and specialties of your organization by choosing field-level technology upgrades and large-scale research projects with nationwide impact.<br/></li><li> <strong>YOU GET A BABY RAUN</strong>: It will nuzzle against your bed long after it grows too large to reasonably do so. It is adorable.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:07", "background_image": "https://media.rawg.io/media/screenshots/340/34079e6b925b61c019686777c336ee57.jpg", "website": "http://www.wearethecaretakers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Heart Shaped Games"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Heart Shaped Games"], "esrb_rating": null}