{"id": 304274, "slug": "shores-unknown", "name": "Shores Unknown", "name_original": "Shores Unknown", "description": "Shores Unknown is a single-player tactical RPG featuring an innovative gridless battle system combined with epic fights against huge bosses and enemy armies.THE SHORES BECKONShores Unknown takes place in a land ruled by the iron-fisted Crown, and policed by the fearsome Inquisition, from whom it is said there is no escape. To the south lies the Empire and perpetual war, while to the north there is only the Murk — a seething wall of fog from which no ship has ever returned. In the midst of these grand forces, both natural and otherwise, our heroes must find a way to survive and to pursue their dreams of liberty.<br/><br/><br/>Play as the newly-made leader of a mercenary company, fresh off an assignment gone awry. Now on the wrong side of the Crown, allies and loyalty are paramount. Forced to venture through the maw of the Murk in a search for truth, players will explore unknown lands, forge new alliances, and wage battle against those who would see to their end. What dangers await on Shores Unknown?GAME FEATURES<ul><li><strong>Gridless tactical turn-based combat:</strong> take your time to assess the situation and command your characters in the Order Phase, then watch your strategy come to life during the Action Phase as the characters maneuver around the battlefield and carry out their orders.<br/></li><li><strong>Adaptive character advancement system:</strong> characters learn new skills and unlock new classes depending on their equipment and combat choices.<br/></li><li><strong>Deep party customization options</strong> allow the player to build the perfect mercenary team of their choice, allowing full control over equipment and skills used by each character.<br/></li><li><strong>Vibrant world</strong> rendered in low-poly stylistic full of little details to immerse yourself in. Explore the various locations of the game, interact with dozens of characters and uncover the secrets of the Shores.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-01-01T01:51:38", "background_image": "https://media.rawg.io/media/screenshots/669/669808db633a05e2d2cfe55e4099cf72.jpg", "website": "http://shoresunknown.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 14, "toplay": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vallynne"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Hitcents"], "esrb_rating": null}