{"id": 304205, "slug": "funbag-fantasy-sideboob-story", "name": "Funbag Fantasy: Sideboob Story", "name_original": "Funbag Fantasy: Sideboob Story", "description": "Critically acclaimed for its mature contents and equally captivating plot, “Funbag Fantasy” finally gets a direct sequel!<br/><br/>Picking up from where the harem route of the original game ended, this installment promotes the popular—though originally without their own endings—General Gladys and Prime Minister Emeralia to main heroines. But that's not all! As the story unfolds and embroils neighboring nations, many new heroines enter the stage.<br/><br/>The full-bodied fantasy awaits those who know how to get a bang out of funbags!Features- Traditional Visual Novel with multiple heroines<br/><br/>- Almost 200 beautifully drawn CGs to explore<br/>- 20+ hours of average reading time <br/>- Story written by Kagami Hiroyuki, a massive boob lover and widely acclaimed for his worldbuilding!<br/>- Character designed by veteran artist Q-Gaku!StoryA year and a half has passed since Lute Hende, the lowest graduate of the Knight Academy, ascended the throne of Edelland. The kingdom has seemingly secured itself lasting peace as an invasion from the neighboring Kingdom of Lingobard has been repelled. Even King Lute himself spends peaceful days cuddling with six beauties when he is free from his official duties.<br/><br/><br/>However, having been routed by General Gladys, the king of Lingobard, Bazalt I, has vowed to retaliate for the disgrace and begins devising a sinister plot. Meanwhile, in one of the major powers of Eurodia, the Kingdom of Fronce, start to appear those who resent the sudden rise of Edelland. The most prominent figure among them is the grand chamberlain of Fronce, Marquis Cuvier. In his plot to crush Edelland, he sets his sight on the succubus queen-consort, Shamsiel. And he is not the only one who finds Shamsiel's existence troublesome. Voices of dissent about the succubus queen rise in the State of Vacatin, the central point of reference of the Church of Holy Rood—Eurodia's most widespread religion.<br/><br/>Oblivious to the looming danger are Lute and Shamsiel, aiming-to-wed Gladys, and Lute-devotee Prime Minister Emeralia. What kind of show awaits our heroes facing three powerful opponents: the Kingdom of Lingobard, the Kingdom of Fronce, and the State of Vacatin?", "metacritic": null, "released": "2019-03-28", "tba": false, "updated": "2019-08-28T21:47:11", "background_image": "https://media.rawg.io/media/screenshots/181/181c3e0701d6e42f5e00fd9b9e4289ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 6, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 4, "reviews_count": 0, "platforms": ["PC"], "developers": ["Waffle"], "genres": ["Adventure"], "publishers": ["MangaGamer"], "esrb_rating": "Adults Only"}