{"id": 304210, "slug": "empire-patron", "name": "Empire Patron", "name_original": "Empire Patron", "description": "On a distant planet an interstellar spacecraft fell and crashed to pieces, on this spaceship was a cargo with a dangerous power source.<br/>The spacecraft was home to a highly intelligent nation called Indefinite who could only live underwater, they flew to collect resources from that planet, but something has gone wrong and they crushed on the planet.<br/>The planet was populated with Humans next to the sea, Creatures in the mountains, Mystic inside the forests and Undead below the ground. All of them saw the spacecraft crash and started searches to find artifacts.<br/>In order not to start an all-out war because of the artifacts, they chose warriors that will bring those artifacts-those warriors are called Empire Patrons.<br/><br/>You are playing one of 5 nations that you can choose from: Humans, Creatures, Mystics, Undead, and Indefinite.<br/>The goal of the game is to find artifacts to gain power and control over the rest of the nations.<br/>Once you defeat a creature or a monster in the RPG battle arenas the creature - or monster - is automatically added to your inventory in a card form and from there you can add cards to the deck to play in arenas against players around the world.<br/><br/>The collectible card game has five nations, at the beginning of the game you get to choose which of the five nations you’d like to play as. In total, there are 100 different cards for every nation and five unique battle arenas. There are two playing options, the first being a card game against the computer and the second being a card game Player vs Player.<strong>Examples of arenas:</strong><ul><li>The first map is a climate changing map that affects the players and the map transformation.<br/></li><li>The second map is a map that contains three towers from each side, and the goal is to destroy the enemy towers using warriors that are spawn in the moment cards are put down the spots assigned for warrior summoning.</li></ul>The card game also has an RPG playing element for mining cards and resources in storyline battle arenas where you can hunt opponents and collect them as cards to your inventory.<br/>These battle arenas are small open world locations where the storyline happens.<br/><br/><ul><li>5 nations.<br/></li><li>\t5 Emperors and their patrons.<br/></li><li>\t500 different cards in total (100 different cards for each nation).<br/></li><li>\t5 unique arenas in the card game.<br/></li><li>\t2 hours of background music in the CCG and hour of background music in the RPG.<br/></li><li>\tMulti-language support.<br/></li><li>\tPlayer vs Player multiplayer in the card game.<br/></li><li>\tPlayer vs AI in the card game.<br/></li><li>\tA card game mixed with other genres (for example card game mixed with MOBA).<br/></li><li>\tDozens of hours of card game multiplayer.<br/></li><li>\tDozens of special card effects and abilities.<br/></li><li>\tRPG storyline battle arenas.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:10", "background_image": "https://media.rawg.io/media/screenshots/4a5/4a5ef38b6c4fdbc0a9864e77a4537e26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["App Tech Innovations"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["App Tech Innovations"], "esrb_rating": null}