{"id": 304323, "slug": "tidal-tribe", "name": "Tidal Tribe", "name_original": "Tidal Tribe", "description": "In classical god game fashion, Tidal Tribe gives you the power to shape the terrain. Raise and lower the land to protect your village from floods and waves, all while using that very same water to build lakes and rivers, turning the desert land into a lush forest of trees and bushes.<br/><br/>And these plants are the key to your success: different plants provide different fruits that satisfy different needs of your NPC's. But they have different growing conditions too: some only grow close to the sea, others far away, some need a lot of sunlight, others prefer shadowy hills. Your job is to create a world that provides enough of all types to satisfy the needs of your people and make their village prosper. Oh, and make sure the paths to those trees don't pass around a dozen lakes and mountains and stuff, there's no point in having all those plantations if it takes ages to reach them...Features<br/><ul><li> Completely dynamic worlds: shapeable terrain, waves flowing through said terrain (and possibly eroding it), vegetation growing depending on the terrain and water, villages expanding and shrinking.<br/></li><li> NPC AI includes among others: collecting fruits, satisfying their needs, spending their free time, but also (if necessary, depending on the level and how you play): stealing to survive, guarding their plantations against thieves, fighting, waging war,...<br/></li><li> Story mode with 5 main missions, over a dozen side missions, as well as several minigames and other surprises. Oh, and different endings. However you shape the world, decides what path the story takes.<br/></li><li> Challenge mode (score attack &amp; time attack) with currently 4 challenges (more to come!).<br/></li><li> Free game mode: just play in a randomly generated world.<br/></li><li> Over four hours of original music.<br/></li><li> Created entirely by one person.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:47:02", "background_image": "https://media.rawg.io/media/screenshots/51f/51f1ad9e611aa0f6f9615254cd42e004.jpg", "website": "http://www.sepiarain.net/tidaltribe.htm", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["PowPit"], "genres": ["Simulation", "Indie"], "publishers": ["PowPit"], "esrb_rating": null}