{"id": 304333, "slug": "aca-neogeo-garou-mark-of-the-wolves", "name": "ACA NEOGEO GAROU: MARK OF THE WOLVES", "name_original": "ACA NEOGEO GAROU: MARK OF THE WOLVES", "description": "GAROU: MARK OF THE WOLVES is a fighting game released by SNK in 1999.<br/>The son of Geese Howard, Rock Howard, who has been raised by Terry Bogard is the main character in this first episode of a new generation in the “FATAL FURY” Series. ’<br/>Numerous new game mechanics such as the “Breaking” feature have been introduced in this acclaimed fighting masterpiece resulting in a game with a variety of deep strategies available to players.<br/><br/>The 'ACA NEOGEO' series has faithfully reproduced many classic NEOGEO masterpieces.<br/>Players can change various game settings such as game difficulty, and also reproduce the atmosphere of arcade display settings at that time. Players can also compete against each other from all over the world with their high scores.<br/>Please enjoy the masterpiece that built a generation for video games.<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1-2 players<br/>DUALSHOCK®4<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>Arcade Archives Series Produced by HAMSTER Co.*This title is based off the MVS (NEOGEO for arcades) version. There may be differences between this version and the versions for the home NEOGEO console and other home consoles.", "metacritic": null, "released": "2019-03-28", "tba": false, "updated": "2019-08-02T16:19:33", "background_image": "https://media.rawg.io/media/screenshots/3ed/3ed03cbda46f032abe03800cfac71815.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 474, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": ["HAMSTER"], "genres": ["Fighting"], "publishers": [], "esrb_rating": "Teen"}