{"id": 304321, "slug": "keepers-dungeon", "name": "Keepers Dungeon", "name_original": "Keepers Dungeon", "description": "<strong>Keepers Dungeon</strong> is a rogue-lite dungeon crawler where you must fight your way through several levels of the dungeon, facing up to 11 unique bosses and various monsters in order to best the dungeon. Spells are your weapons, you can combine different spell-tokens in order to create your own unique spells. There are over 700 possible spell combinations available for the player to explore. Additionally there are 18 different items to help the player slay monster and survive through the dungeon.<br/><br/><strong>Spells:</strong> There are 3 base spell the player knows at the start of the game. Each spell can be modified with up to five tokens from a total list of fifteen spell modifier tokens. Burn away your enemies with fire and meteors, control them frost and black holes or zap them away with lightning that pierces the enemies flesh.<br/><br/><strong>Items:</strong> The player can wear one armor piece and wield one weapon piece to help them fight their way through the dungeon. Find the best items by defeating bosses, besting events or trying your luck at the shop.<br/><br/><ul><li>Several hours of challenging, fun gameplay.<br/></li><li>3 different modes: Easy, Normal and Challenge.<br/></li><li>Unique play through every time with procedurally generated level, random item and spell token drops and two possible bosses for the first five levels.<br/></li><li>Achievements</li></ul>", "metacritic": null, "released": "2019-04-08", "tba": false, "updated": "2019-08-28T21:47:02", "background_image": "https://media.rawg.io/media/screenshots/abf/abfcfe6ec45edc17c7dca24e46fdd2a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 18, "ratings_count": 2, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["Joni Bäckström"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Joni Bäckström"], "esrb_rating": null}