{"id": 304316, "slug": "rashlander", "name": "RASHLANDER", "name_original": "RASHLANDER", "description": "RASHLANDER is a physics-loaded lunar lander roguelike that feels like spinning across an icy road and nailing a perfect parallel park. Inspired by arcade classics such as Sinistar and Asteroids as well as neo-retro games like Downwell, RASHLANDER's controls are simple, pure, and easy to learn with successful gameplay relying heavily on a little luck and a ton of skill.<br/><br/><br/><br/>The procedurally generated levels force players to build ability instead of learning set patterns, paving the way for a challenging experience and truly triumphant wins. Discover a dense network of game-changing upgrade systems and life-giving fuel stations—all while attempting to achieve the highest score in this skill-based, physics-stuffed tribute to the golden era of arcades.<br/><br/><br/><br/>After not quite seeing eye-to-eye with an all-powerful global entity known as GovCorp, a small team of terraforming researchers are forced to flee Earth in a hastily-prepared escape rocket. Things are a little less than ideal, however. Navigating a ship equipped with a highly explosive plutonium core nestled in the nose and a perpetually low fuel supply can get a little squirrely. You’ll need to skillfully slingshot around levels—dodging interstellar debris, scraping past gravity-heavy asteroids, and avoiding GovCorp drones—to successfully crash-land onto the goal-marked warp pads. Careful though, you’ll want to land your ship feet-first unless you’re a fan of incinerating your entire crew in super-explodey collisions.<br/><br/><strong>FEATURES</strong><br/><ul><li>Neo-retro lunar lander roguelike: offers a modern arcade experience to hardcore gamers, with a strong pick-up-and-play appeal. Was originally made for physical arcade cabinets.<br/></li><li>Upgrade system: players can utilize a dense network of upgrades as they play, adding flavorful twists to the gameplay with each upgrade.<br/></li><li>Secrets: numerous secrets for players to discover from abilities and alternate paths to as-yet-unconfirmed time travel.<br/></li><li>Impactful visual style: minimalistic and beautiful art design featuring wonderfully contrasting color schemes and dynamic shadow effects.<br/></li><li>Professional soundtrack: synthesized, beat-heavy bops by Fat Bard, whose prior compositions appear in work for Disney, WB Games, and Butterscotch Shenanigans. The soundtrack perfectly aligns with the frenzied emotions evoked as players progress.<br/></li><li>Twitch integration: Twitch integrated gameplay featuring viewer driven events, chat meta games, and chat members appearing as helpers or enemies in-game. Enables streamers to interact with and engage their communities. <br/></li><li>Score tables: Overall and Daily High-Score tables appeal to speedrunners and high-score-chasers, both of which have seen a sharp rise in popularity, especially in the streaming communities. </li></ul><br/><br/><br/>", "metacritic": null, "released": "2019-07-25", "tba": false, "updated": "2019-08-28T21:47:03", "background_image": "https://media.rawg.io/media/screenshots/353/353c5334649c65abd73ac45a19ee6627.jpg", "website": "http://rashlander.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ryan Davis"], "genres": ["Action", "Indie"], "publishers": ["Hitcents"], "esrb_rating": null}