{"id": 304431, "slug": "molien-attack-whack-a-mole", "name": "Molien Attack - Whack-a-Mole", "name_original": "Molien Attack - Whack-a-Mole", "description": "<p>Hit as many Moliens as possible, avoid traps and collect coins. Eradicate these alien moles called Moliens while avoiding their traps. Collect coins to buy unlockable items from the shop. Get the highest score possible in this whack-a-mole style game.\r\n  </p>\n<p> \r\n  </p>\n<p>Play the classic game of whack-a-Mole but with added features. Hit all Moliens (Alien Moles) as they get faster. Each hit will give one point and a miss will take one life. Avoid hitting on traps which take a life. Collect coins to use them later in the in-game store.   </p>\n<p> \r\n  </p>\n<p>Hit enough Moliens (Alien Moles) and you will go into rampage mode where you can increase the score. The Moliens (Alien Moles) get a lot faster in rampage mode. Each hit on mole gives 10 points. Each miss takes 5 points. Hitting on a trap will take away 10 points. In Rampage mode each coin value increase to 5. Avoid going to 0 score!\r\n  </p>\n<p> \r\n  </p>\n<p>Use the collected coin to get special items from the in-game store. Fullfill the requirements to unlock the items in use and use them to get the highest score. Unlock items such as Stone block to block one opening so you have to deal with less Moliens (Alien Moles) or get time capsules to slow down time so you can hit those fast jumping Moliens (Alien Moles) with ease. Or unlock different magnets to collect coins for you.\r\n  </p>\n<p> \r\n  </p>\n<p>Get the highest score!\r\n  </p>", "metacritic": null, "released": "2019-03-28", "tba": false, "updated": "2019-03-29T03:31:07", "background_image": "https://media.rawg.io/media/screenshots/9b2/9b2daa6c45d43b59aded49fa534e32db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["viseware"], "genres": [], "publishers": [], "esrb_rating": null}