{"id": 30451, "slug": "spelljammer-pirates-of-realmspace", "name": "SpellJammer: Pirates of Realmspace", "name_original": "SpellJammer: Pirates of Realmspace", "description": "SOLAR WINDS CARESS your face as mystic powers propel the majestic galleon through the atmosphere and into the ether of Realmspace. Gazing beyond the deck, you are overwhelmed by the beauty of the receding planet Toril, home of the Forgotten Realms. \"Ship insight!\" a lookout calls. The dreaded snail silhouette of a neogi warship eclipses the planet and rapidly closes to attack. You turn the massive ship toward the intruder and call out to your officers and crew, \"Man your station! Enemy off the port bow!\" <br/><br/>Captain your own Spelljammer ship in PIRATES OF REALMSPACE. <br/>Recruit officers and crew to man your magical ship. Soar into the ether and explore the planets of Realmspace. <br/><br/>Embark on adventurous missions - deliver precious cargo, pursue pirates - to build your reputation as a Spelljammer captain. Ultimately, discover the terrible conspiracy that threatens to conquer Realmspace itself! <br/><br/><ul><li><strong>SPACE COMBAT</strong>. Sail through space in a spectacular, first-person flight simulator. Engage enemy ships in real-time combat. Fire huge bolts from your ship's ballista and bring the enemy to heel! <br/></li><li><strong>BOARDING COMBAT</strong>. Move to close range, engage your grapples and board the enemy ship! Phased tactical combat gives you direct control over all your officers and crew as they use weapons and cast spells. <br/></li><li><strong>GREAT GAMEPLAY.</strong> Point-and-click to control all of the action and adventure. Superb graphics and sound effects heighten the drama. With new planets to visit and innumerable missions to fulfil, every adventure will be different than the last! Three levels of play make this game ideal for both the novice and experienced space mariner.<br/></li><li><strong>NOSTALGY 3D GRAPHICS</strong>. See fabulous mystical ships crewed by exotic creatures. Spelljam through wildspace filled with ship-crushing asteroids. Find the jewelled planets that await you. </li></ul>", "metacritic": null, "released": "1992-01-01", "tba": false, "updated": "2023-03-31T03:34:55", "background_image": "https://media.rawg.io/media/screenshots/f80/f80781ed6a2c396258de6a9e42aa864e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Cybertech"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Strategic Simulations", "SNEG"], "esrb_rating": null}