{"id": 304655, "slug": "higgy-2-the-wrath-of-mcmania", "name": "Higgy 2: The Wrath Of McMania", "name_original": "Higgy 2: The Wrath Of McMania", "description": "<p>“Here, <strong>Titchy</strong>.” Ian Higton ripped open a cat food pouch, causing his hungry kitty to scale up his leg. <br/><br/>“<strong>Ow!</strong>” Ian yelped, as claws met calf. “Maybe jorts aren’t the best clothes for cat-feeding… No. Can’t be,” he mused as he detached Titch. “Jorts are simply the best, better than all the rest.” <br/><br/>“<strong>Jorts won’t save you!</strong>” Ian’s nemesis crashed into the room. It was the wrestling heel, Mr. McMania. Oiled up to the nines, he cracked his knuckles. <br/><br/>Titchy hissed and launched herself at McMania. He snatched her out of the air, then issued a challenge: “Higton, you prick! Try to rescue your cat from my <strong>golden castle in the sky</strong>. My minions will make short work of you and your jorts!” <br/><br/>“How will I get there? It’s not like there’s a bus!” Ian protested. But McMania had scarpered. <br/><br/>Will Ian be able to save his cat? You decide.</p>\n\n\n<p><strong>CONTROLS:</strong><br/>This game supports Kempston joysticks, Sinclair joysticks in port 1 and keyboard</p>\n<p>O - Move left<br/>P - Move right<br/>Z - Jump</p>\n<p><strong><em><br/>YOU NEED A ZX SPECTRUM EMULATOR TO PLAY THIS GAME</em></strong>. It should work on any available emulators, but I've tested it on Fuse, ZX Spin and Speculator.<br/></p>\n\n<p><strong>CREDITS:</strong><br/></p>\n<p>Programming, graphics, sound, cassette inlay and anything else not listed here - <strong>MrTom</strong> of <strong>Beebush Games</strong><br/>Story written by - AtFruitBat</p>\n<p>Special thanks to Bendix Engmann for granting me permission to use her artwork in the production of this game. You rock.</p>", "metacritic": null, "released": "2019-03-26", "tba": false, "updated": "2019-08-28T23:17:22", "background_image": "https://media.rawg.io/media/screenshots/673/673202011e85920ab178f5e4d2cba2f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bee Bush"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}