{"id": 304688, "slug": "malm-2014-2015", "name": "Malm (2014-2015)", "name_original": "Malm (2014-2015)", "description": "<p>In september 2014 I started working on my graduation\r\nproject. This time I wanted to create a game with a systen (like\r\nchess for example), instead of linear experience like ‘The Free Project’ or\r\nCover Me. </p>\n<p>The whole project turned out to be a failure but I learned some\r\nvaluable lessons. I recorded every prototype and collected them in this ‘museum’.\r\nYou can walk around freely or follow the line that will guide you along the design process.</p>\n<p>--------------------------------------------------------------------------------------------------</p>\n\n<p>A short\r\nessay of reflection:</p>\n<p>I think I learned two things that can be used by other\r\ndevelopers. </p>\n<p>1.      Don’t start with the mechanics but\r\nwith the aesthetics.</p>\n<p>I think my\r\nbiggest hurdle was practicing a design theory based on the Mechanics-Dynamics-Aesthetics\r\nFramework. This theory argues that at the center of the game lie the mechanics,\r\nwhich result in dynamics when you play the game. On top of this system, like a\r\ncoating, are the aesthetics. So to make a good game system and not a linear\r\nexperience, I thought I should start designing the mechanics first and lastly\r\nthe aesthetics.</p>\n<p>I\r\nunderstand now that the MDA Framework approach to making games is very academic\r\nand (for me) not a practical one. A mechanic in itself, like moving, clicking,\r\njumping, opening, etc., doesn’t say that much. I believe the object (or world)\r\nthat is already designed by animations, colors or sounds, cultivate\r\nmechanics that express your ideas, feelings or thoughts much better. Knowing\r\nthat a character for example doesn’t have any arms, will give you a lot of information\r\nhow this character behaves and what kind of mechanics will suit. Without arms\r\nit is more difficult to keep balance. This could make the character constantly\r\nlook for balance or it could influence jumping and running around. Working from\r\nonly placeholders will give you abstract and general game mechanics, while\r\nmechanics with a ‘personality’ will give you more substance and direction. </p>\n<p>2.      The player creates the composition.</p>\n<p>In every\r\ndesign process you will encounter moments where it is unclear what you are\r\nmaking and what to do next. My mistake, in that moment, was to do more research\r\nand answer questions about the concept. This resulted in me constantly tweaking\r\nand adding elements to the game. For example I added more objects inside and outside the drawer. I added rules to those object to scale, multiply, throw them or change their colors. Later I added a mirror to the game, which gave a new concept to the player. I added a neural network the player could design that added a whole new set of rules. I tried to guide the player by adding or tweaking  architecture in the space. <br/></p>\n<p>My bachelor\r\ntook place at a theatre school and I learned to create games with a similar\r\nview on how to make theatre, which is called dramaturgy. This study teaches\r\n“about the dramatic composition and representation of the elements on the stage.”\r\n(https://en.wikipedia.org/wiki/Dramaturgy) Basically I learned how to ask the\r\nquestion ‘why?’ a lot about every element in your work. </p>\n<p>The creator\r\nof a theatre play adds elements to the stage like characters, colors,\r\nfurniture, another sentence, light fall to high-light something, sound effects,\r\netc. Then he or she composes those  elements in such a way to\r\nmake it understandable for the audience. There are ques for light, characters and music. The stage assets are chosen and placed in a position that explain a certain time period. Language can be used to explain a culture. The connections\r\nbetween those elements are structured and this structure gives meaning. A character standing in the rain without an umbrella gives another meaning than a character standing in the rain wíth an umbrella. The connections, suggested by the creator, create meaning for the audience.</p>\n<p>Because\r\nthe experience is linear, these structures are mostly one-dimensional. As a game\r\ndesigner, when you make a linear experience (like I did in ‘The Free Project’\r\nor in Cover Me) you have a much bigger freedom to add and tweak elements in\r\nyour game and change the composition, without making the game too confusing for\r\nplayers. During my\r\ngraduation project however, I wanted to create a system that was not linear\r\n(like checkers for example). The connections between the elements in a system\r\nare not structured by the designer but vary by the decisions of the player. In\r\na way, the player is making the composition. Therefore it is important to not\r\nadd too many elements because it can make the system very complex. If the\r\nstructure creates meaning and the player can create hundreds of structures, you\r\ngive the player a very messy and complicated experience. </p>\n<p>I adapted\r\nthe design practice from my theatre making peers, but did not yet fully\r\nunderstand that the player is the one who makes to composition. Whenever I got\r\nstuck in the design process, I took a step back and reflected on the concept.\r\nIt resulted in me changing and adding elements, which did not help to create a\r\nbetter game. Looking back now, what I should have done in moments where I got\r\nstuck, was to finish the game and play around to see the structures that would emerge\r\nfrom the placed elements, whether I knew the meaning behind it or not.</p>", "metacritic": null, "released": "2019-03-26", "tba": false, "updated": "2019-03-29T04:33:00", "background_image": "https://media.rawg.io/media/screenshots/0f4/0f4c1929af56c9eb26e9181a0b2aeadd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Charlotte Madelon"], "genres": [], "publishers": [], "esrb_rating": null}