{"id": 304831, "slug": "townlander", "name": "TownLander", "name_original": "TownLander", "description": "<p>Bonjour,</p>\n<p>ici je vous présente mon premier \"TownLander\", un projet finaliser, inspiré du célèbre LunarLander refais en LUA et LÖVE.</p>\n<p>Le projet est parti du cours de Gamecodeur gratuit donc j'ai été jusqu'au déplacement du vaisseau, ensuite en farfouillant sur le net j'ai ajouter:</p>\n<p>- Le son, music de fond, explosion, gameover, victoire, etc\r\n<br/>- L'ecran de démarrage et de paus\r\n- Les collisions (bord de l'ecran et tableau de score pour pas sortie et building pour conditions de victoire ou défaite)\r\n<br/>- Un systeme de carburant avant que les moteurs ne s'éteignent\r\n<br/>- Un systeme ou il faut atterrir \"correctement\" donc nez de l'appareil vers le haut pour pas se crash\r\n<br/>- Un systeme de scoring simpl\r\n- Des nuages qui se déplacent</p>\n<p>Tout ca pour en arriver à un résultat plus que correcte, stable et apparemment où il n'y a plus de bug.</p>\n<p>Sons repris sur divers sites :</p>\n<p>http://www.universal-soundbank.com/\r\nhttps://fr.ringtones.mob.org/tag=movies_games/ </p>\n<p>Graphisme par contre fais par moi via Adobe Photoshop et PyxelEdit (sauf la carcasse du vaisseau dont je me suis inspiré d'un déjà créer mais refais par moi quand même)</p>\n<p>Au niveau du code j'ai tout fais sauf la function CreateBlock, merci à Nono02P.</p><p>Merci  Duruti qui m'a donné un bout de code de timer pour que je voie comment ca fonctionne (même si au final j'ai fais le mien ^^).</p>\n<p>Je remercie quand même toute la communauté GC qui m'a pas mal aidé sur les points que je n'avais pu voir en cours (n'etant pas encore premium mais bientot lol) et que forcément sur le net pas toujours très clair (dont le timer pour les sons, ou encore les collision on m'a donner pas mal de lien d'info sur le AABB etc etc), dont DeadSystemqui passa pas mal de temps avec duruti et nono a m'expliquer :)</p>\n<p>Bon après coup... :)</p>\n<p>- J'ai morfler sur les collision qui voulaient pas se faire correctement mais ca a fini par passer <br/>- LE SON j'ai failli peter un cable sur ca, car comme le gameover est dans les collisions dans l'update il rappelait sans cesse ma function FinDePartie et donc si collision *200 y repetait le son 200 fois... d'ailleurs je cale toujours sur le paused et le resume mais bon... :)\r\n<br/>- Les graphismes... ma bete noir, je suis pas pour le graphisme pour un sous, j'ai donc fais ce que j'ai pu pour que cela ne sois pas trop moche lol</p>\n<p>Le reste en sois était des fois un peu embêtant sur des conditions trop longue ou quoi mais j'ai tenter avant de \"finaliser le code\" de simplifier au mieux, commenter au plus et de me stopper, car une fois qu'on voie la fin arriver on se dis, tiens je rajouterai pas ca (ce qui rajoute des lignes, des bugs et des prises de tete) puis tiens ca aussi puis ca et ca etc, finalement je m'en suis tenu a rajouter l'ecran de demarrage et de pause pour faire un peu plus \"vrai jeu\" :)</p>\n<p>Voila en esperant que vous aimiez le projet, j'ai fais deux fichiers rar, Distrib_exe, contenant le dossier executable avec l'exe et les dll requise, et TownLander_code pour regrouper tout ce que j'ai utiliser en images, son, main.lua mais sans le dossier de distrib.</p>", "metacritic": null, "released": "2019-03-25", "tba": false, "updated": "2019-03-29T05:10:56", "background_image": "https://media.rawg.io/media/screenshots/8ca/8caa6573bf36a0a415ddcd8467725fc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kozengod"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}