{"id": 304822, "slug": "midiphile", "name": "MIDIphile", "name_original": "MIDIphile", "description": "\n<p><strong>Project Start Date: </strong>March 15th, 2019</p>\n<p>Hello! My name is Trevor. I'm a college student from New York. I study Computer Science and Music. I think I've created something really cool that I want to share with the world! At the time of writing the project is incredibly young. But I've made monumental amounts of progress in that short time. Check out my Instagram to see the journey! The video at the top will change over time to serve as a demonstration of the project in its current state!<br/></p>\r\nJoin the Discord!\r\nSupport me on Patreon!\r\nWhere We Are Now:\r\n<p>Currently, I am cleaning up the project to prepare for the next version's integration. Once the project is cleaned and optimized to my standards it will be the first release for the MIDIphile tier!<br/><br/><br/><br/><br/><strong>MIDIphile Completion Date:</strong> TBA.<br/><br/><strong>Price:</strong> TBA.<br/></p>\r\nWhat can you do with MIDIphile right now?\r\n<p>In MIDIphile's current state, it is capable of visualizing live midi input from a connected device. It can do this in two modes: Live Mode and Recording Mode. Live Mode has the MIDI information come straight out of the digital piano on the bottom of the screen. Recording Mode has the midi information come into<br/><em> </em>the piano from the top of the screen. This is done with an intentional delay so you can incorporate the MIDI roll into any performance footage.<br/></p>\r\nThis is where I started:\r\n\n<p>What I have here is something I would call a \"MIDI Visualizer.\" I call it <br/><strong>MIDIphile</strong>! It comes from the Greek word <em>Philos</em> meaning \"the love of\". It displays live MIDI information in a beautiful, entertaining and customizable way. The video above is a demonstration of the first working version of the program. The following is that same program the next day.<br/><br/><br/><br/><br/></p>\r\n\r\n\r\nDevelopment Roadmap*\r\n<p>*The <br/><em>order</em> of integration may change over the course of the project. I have strong confidence in integrating everything however features may also be subject to addition or removal from the roadmap over the course of the project.</p>\n<ol>\n<li>Get input from any MIDI Device. This is the core of the entire project. It involves reading midi data sent from your piano or synthesizer in real time!</li>\n<li>Incorporate fully customizable UI. This involves designing a set of flexible assets that can be colorized and customized to your heart's content!</li>\n<li>Write MIDI Files! One of the challenges will be to take midi input from your device and record it to a midi file. It involves me taking time to research how MIDI is processed at the machine level. Then I simply need to translate the live midi data to machine code and boom! You've got yourself a MIDI file!</li>\n<li>Reading MIDI Files and playing them back! This goes along with the previous step. There are similar challenges as well. These two should be quick to implement. It involves taking that nasty machine code and making the program spit it out in a readable way.</li>\n<li>Audio synthesis! The sky is the limit here. This will require sampling audio and creating voices to make your midi instruments produce sound digitally! A task that will be more time consuming than it is difficult. I will take the time to compile a nice library of sounds to complete the audio workstation.</li>\n<li>Implement menus to customize the UI with ease. Right now you have to jumble around in text files and that's no fun! This will be one of the most time-consuming tasks. It is easy right now for me to use third party tools like an online color picker to set all of the colors by hand. But I want to implement one of my own. And a whole mess of other features too:\r\n\t\r\n\t<ul>\n<li>Color Pickers</li>\n<li>Custom Backgrounds</li>\n<li>Particle Editor</li>\n<li>Ability to enable/disable parts of the UI</li>\n<li>Sheet music viewer</li>\n<li>Metronome</li>\n</ul>\n</li>\n<li>It's a game! I might make some MIDI Based mini-games for fun! <em>MIDI</em>-games if you will. You will learn the foundations of music theory in a refreshing and entertaining way!</li>\n<li>Worldwide! At this point in time, the project is restricted to the Windows operating system. But don't fear Mac and Linux users. There is hope! With some time, love and a <em>lot </em>of learning. I will get this thing everything from your phone to your smart fridge! If you can plug your MIDI instrument into it I want this program to be there!</li>\n<li>I think that's everything I could ever hope to do for this project, but who will know what the future brings! A lot of bugfixes and updates probably and some more voices along the way.</li>\n</ol>\n<p>Thank you for taking the time to go through all of this. If this project interests you, consider supporting me by becoming a patron or simply following me on social media!</p>", "metacritic": null, "released": "2019-03-24", "tba": false, "updated": "2019-03-29T05:08:14", "background_image": "https://media.rawg.io/media/screenshots/fe9/fe903a1547cc452d0aeec115afbbbc26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bigband_it"], "genres": [], "publishers": [], "esrb_rating": null}