{"id": 304937, "slug": "sexxxnator-adult-sandbox-rpg", "name": "SEXXXNATOR: Adult Sandbox RPG", "name_original": "SEXXXNATOR: Adult Sandbox RPG", "description": "<strong>SEXXXNATOR</strong> is an RPG in the open world with a unique combat system and the ability to communicate with any girl.<br/><br/>You are a cyborg. And your goal is to sleep with the poor mother of the resistance leader, in order to make him semi robot and subordinate. It will not be so simple and through you will pass a huge number of girls.<br/>Each girl in the game is <strong>generated with a unique character and reacts differently to dialogues</strong>, pronounces different phrases, which also take from the character. Can I sleep. Unless of course you can seduce her.<br/>The source of this you also need to monitor their needs: eat, drink, sleep. For all this, you will need money and you will need to somehow earn it. And how - you decide. You can simply beat the bandits, or just work somewhere.<br/><br/>In total at the moment, each girl can have <strong>132 character options</strong> and <strong>40 variations of appearance</strong>. In addition, each of them can be undressed and have sex with them!<br/>When communicating with a girl, you will choose the style of communication, choosing one of the 11 options for communication. These can be jokes, lust, or even ordinary conversation. <br/>Each girl likes something of her own. And this is not just a stupid sorting out of options! You can start from the dialogues with the girl and find out what she likes more since her first phrases.<br/><br/>The game is in development and much of the plan is not yet implemented. I really hope for your support and feedback!<br/><br/>", "metacritic": null, "released": "2019-04-17", "tba": false, "updated": "2019-08-28T21:46:59", "background_image": "https://media.rawg.io/media/screenshots/447/447834c12a63a5db492bb1dbd72e64fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yen Pavlov"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Yen Pavlov"], "esrb_rating": null}