{"id": 304921, "slug": "sniper-elite-v2-remastered", "name": "Sniper Elite V2 Remastered", "name_original": "Sniper Elite V2 Remastered", "description": "<p>You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans’ final stand.<br />\nYour mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.<br />\nStealth is key as you find yourself trapped between two desperate armies in a race against time. Master authentic weaponry, stalk your target, fortify your position, set up the shot, and use your skill, patience and cunning to achieve the mission.<br />\nAll new graphics and rendering technology gives you improved ball busting X-ray kill camera detail. Witness the terrifying power of your bullet as it enters an enemy’s body.<br />\nWith all DLC missions included, take the fate of the war into your own hands, and hunt the Führer himself.<br />\nNew Features included in this Remaster…<br />\nAll DLC Included – Experience the infamous “ASSASSINATE THE FÜHRER” mission. Take the fight to new fronts in three new campaign levels. Hunt your foes with a variety of iconic weapons including the Lee Enfield MK III, M1D Garrand, M1 Carbine and more.<br />\nPhoto Mode  – Pause and step through the action frame-by-frame, position the camera, apply a filter, adjust the lighting and take stunning photos to share with the community. Including your epic X-Ray kill camera shots.<br />\nRemastered Visuals - Modernised renderer and post processing effects, enhanced level geometry, textures and particles, plus a revamped lighting system, and 4K support transports you to the front line.<br />\nNew Playable Characters – For the first time, play the campaign and multiplayer modes as one of 7 new characters from Rebellion’s Zombie Army series.<br />\nMultiplayer &amp; Co-op – Gather your squad and compete in 7 uniquely tense multiplayer modes, now for up to 16 players online*. Including Deathmatch, Distance King, Dogtag Harvest and Capture the Flag.</p>", "metacritic": 65, "released": "2019-05-13", "tba": false, "updated": "2023-11-13T15:18:17", "background_image": "https://media.rawg.io/media/games/f4f/f4f805c0067da96974182f3cf244c818.jpg", "website": "", "rating": 3.53, "rating_top": 4, "added_by_status": {"yet": 36, "owned": 373, "beaten": 50, "toplay": 48, "dropped": 19, "playing": 6}, "playtime": 4, "achievements_count": 262, "ratings_count": 56, "suggestions_count": 728, "game_series_count": 0, "reviews_count": 57, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Rebellion"], "genres": ["Action", "Shooter"], "publishers": ["Rebellion"], "esrb_rating": "Mature"}