{"id": 304922, "slug": "astalon-tears-of-the-earth", "name": "Astalon: Tears of the Earth", "name_original": "Astalon: Tears of the Earth", "description": "<p>Three explorers wander through a post-apocalyptic desert to find a way to save the people in their village. A dark, twisted tower has been pushed up from the depths of the Earth... but does it hold the answers they seek?<br />\nAstalon: Tears Of The Earth is LABS Works&#39; love letter to the games of the 80s, but what may seem like a simple action-platformer has several surprises under the hood!<br />\nUse the unique skills and personalities of three different characters to explore an evil tower. Defeat terrible monsters, find powerful items, and solve puzzles, reaching new heights in the tower with every attempt. Strengthen your party and change the rules by embracing death... and discover the countless secrets of the world of Astalon!<br />\nBeautifully detailed and authentic-looking pixel art, inspired by the 8-bit era of video games<br />\nCharacter art by Ryusuke Mita, creator of the manga Dragon Half<br />\nA chiptune soundtrack by video game music group KILLSCREEN<br />\nHundreds of rooms - countless hours of challenging exploration await you!<br />\nCollect a variety of magical items that will bestow your three characters with new abilities</p>", "metacritic": 83, "released": "2021-06-03", "tba": false, "updated": "2023-10-13T07:24:36", "background_image": "https://media.rawg.io/media/screenshots/f42/f429bdc1f051149e11bde4f3a9fc435a.jpg", "website": "http://dangenentertainment.com/games/astalon-tears-of-the-earth", "rating": 4.33, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 79, "beaten": 8, "toplay": 18, "dropped": 5}, "playtime": 11, "achievements_count": 40, "ratings_count": 11, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 12, "platforms": ["Xbox One", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["LABSWorks", "LABS Works"], "genres": ["Action", "Adventure"], "publishers": ["DANGEN Entertainment"], "esrb_rating": "Teen"}