{"id": 305088, "slug": "gravitus", "name": "Gravitus", "name_original": "Gravitus", "description": "<p>Gravitus is a retro styled arcade gravity puzzle/shooter - quite similar to the games Thrust and Gravitar - in which you must pilot your ship, the icarus, around a cave/arena with the goal of locating our lost terraformers and then escaping in to the atmosphere before  your mothership departs.</p>\n<p>Much of the difficulty is due to the fact that your ship can only thrust in one direction and is always being pulled down by the force of gravity. This makes shooting at enemies a fine balance of making sure you have enough elevation or upward thrust before attempting to destroy your target.... otherwise you'll find yourself making acquaintance with the ground quite often.</p>\n<p>The controls in Gravitus are very simple: You can turn left and right, thrust forwards (in the direction you are facing), shoot in the direction you are facing. Your spaceship has limited fuel which depletes as you use your thrusters, this can be refilled by flying through a fuel dump.</p>\n<p>Each mission stores your best five times and your best five scores, so go back in and play them again, to beat your best scores and times!</p>\n<p>The game is made to look and feel like a commodore 64 game, restrictions are on the 16 colours used and the screens resolution of 160x200. The width is doubles as all horizontal pixels are 2 pixels wide.</p>\n<p>Hope you enjoy playing the game, have fun!</p>\n<p>The Game is an entry into the SyntaxBomb 8 bit Wars competition.<br/></p>", "metacritic": null, "released": "2019-03-31", "tba": false, "updated": "2019-08-28T23:17:19", "background_image": "https://media.rawg.io/media/screenshots/617/6179eb4349bf8b2501b053bb02602026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["conceptAlpha"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}