{"id": 305244, "slug": "death-preposterous", "name": "Death? Preposterous!", "name_original": "Death? Preposterous!", "description": "What Happens When We Die?\r\n<p>Is death really as it seems?<br/>What if we had the wrong idea?<br/>What if death wasn't death at all?</p>\n<p>When a visit to the island's mansion turns out to be much more than our protagonist bargains for, discover what happens in the aftermath, uncover a nefarious secret, and earn an audience with the prestigious lord of the estate.<br/></p>\r\nExplore The Island\r\n<p>Explore the island to find curiosities. Experiment to discover their purpose. Search the island for a way into the mansion. Talk to people and get to know them (or don't, it's up to you.) Who you choose to interact with can change the way the game unfolds. There is more than one way to approach this story, and more than one tale to be told.<br/></p>\r\nDiscover Curious Creatures\r\n<p>During your journey you'll encounter a variety of strange and wonderful creatures to interact with. Some might be friendly, others might be afraid of you, and others still can be dangerous if handled the wrong way. But if you take the time to observe them, you might learn a thing or two, and get to know them better.<br/></p>\r\nCharacters:\r\n<br/>Darling\r\n<p>Darling is the main protagonist of the story. After a lengthy preparation period, he arrives as a new resident to the island, ready to begin a meaningful chapter in his life together with his wife Madeline in their new seaside home. But things turn out a bit differently than either of them planned, and a note left by Madeline is the start of an unbelievable chain of events...</p>\n<br/>Berta\r\n<p>The proprietress of the local tavern, Berta's meals are popular with residents of the island and visitors alike. There's never a slow day at her tavern, and she does what she can for those in need. Though, she has been known to take on more than she can reasonably handle sometimes.</p>\n<br/>Trudy\r\n<p>Trudy is the headmistress at the only schoolhouse on the island. It is her joy teaching children, and she makes the most of every day watching them learn and grow. But due to recent occurrences on the island, she and the children have lost their access to the school. To make matters worse, now she is being forced to tutor the son of the person who caused all this!<br/></p>\n<br/>Mindy\r\n<p>Mindy runs an herbalism practice on the island, as well as a storefront for a variety of flora. Effectively she's the island's naturopathic (and only) doctor. When dire circumstance begins befalling the residents of the island, Mindy discovers she has lost access to her supply of medicines.<br/></p>\n<p>These and many more characters await you in <em>Death? Preposterous!</em><br/></p>\r\nFeatures:\r\n<ul><li>Play as up to 10 different characters, or as few as 1.</li><li>Befriend key characters and learn more about their lives. Or don't. It's up to you.</li><li>Interact with creatures in refreshingly non-violent, puzzle-like encounters.</li><li>Earn a variety of ending sequences to the game that will differ depending on the way you played through it.</li><li>Save your progress anywhere in the game for a more flexible and enjoyable gameplay experience.</li><li>Play <em>Death? Preposterous!</em> using any of the following devices:<ul><li>You can play using just your mouse!</li><li>Or, using simple keyboard controls (4 arrow keys to navigate, 2 other keys for action/cancel/menu functions)</li><li>Or using a game controller that supports X-input, such as a USB Xbox 360 controller, an Xbox One Wireless controller, or the Logitech brand F310 and F710 model gamepads, just to name a few possibilities.</li></ul></li></ul>System Requirements:<p>Please keep in mind that these are <em><strong>approximate</strong></em> minimum system requirements.<br/></p>OS<br/>Windows 7/8/8.1/10 (32bit/64bit)<br/>Linux Mint 18 or above, Debian 8 or above<br/>CPUIntel Core 2 Duo or equivalentRAM2GB or more (4GB or more recommended)HDD2GB or more of free disk spaceGraphics Card<br/>One with OpenGL supportDisplayResolution of 1024×768 or greater", "metacritic": null, "released": "2019-03-30", "tba": false, "updated": "2019-04-01T03:12:08", "background_image": "https://media.rawg.io/media/screenshots/f01/f01fe0f7feb9ea6588b142b38ab84aee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Jay Ray Hawk"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}