{"id": 3053, "slug": "crusaders-quest", "name": "Crusaders Quest", "name_original": "Crusaders Quest", "description": "<p>Play a classic retro RPG that will bring back childhood memories!<br />\n▶ Retro Pixel Art<br />\nDo you remember the times of classic games?<br />\nImmerse yourself in the cute, nostalgic pixel graphics and flashy action gameplay of more than 1,000 unique 8-bit Heroes!<br />\n▶ A Vast World With a Captivating Story<br />\nAdventure through and defend the land of Hasla and its Goddesses from the forces trying to bring it to ruin!<br />\n▶ Thrilling Block Skill Gameplay<br />\nEnjoy the simple yet strategic match-3 block skill controls in this puzzle action RPG!<br />\nDiscover the exciting synergies between over 1,000 Heroes in an infinite number of team compositions, and turn the tides of battle with the Goddesses&#39; skills in critical moments!<br />\n▶ Soulbound Weapons, Sigils, and Inheritance<br />\nObtain Heroes&#39; exclusive Soulbound Weapons and awaken their latent powers.<br />\nUtilize the ancient blacksmith&#39;s practice of Inlaying to add powerful Sigils to your Heroes&#39; Soulbound Weapons!<br />\nOvercome challenges and acquire Ancient Books to grant your Heroes Inherited power from the past Heroes of legend.<br />\n▶ Deep PvP and World Boss Raids<br />\nConquer the Colosseum and real time PvP Arena to prove your strength all over Hasla!<br />\nFight through Ancient Dungeons overflowing with rewards and play with other Captains in World Boss Raids with challenging mechanics to take down massive monsters with 6 Heroes!<br />\n▶ Diverse and Frequent In-Game Events<br />\nFighting isn&#39;t the only thing Heroes do! Try your hand in interior designing for your Hero Home, a place for your Heroes to rest!<br />\nCompete in the Hasla Fishing Contest to see who can get the biggest catch, and receive special rewards!<br />\nThink you&#39;re a master chef? Satisfy Fergus&#39; hunger by cooking up a mean meal!<br />\nTeam up with other Captains in-game to lay siege upon opponents&#39; territories while defending your own!<br />\n- Crusaders Quest Official Facebook Page : https://www.facebook.com/CrusadersQuest/</p>", "metacritic": null, "released": "2014-12-11", "tba": false, "updated": "2022-03-07T03:08:03", "background_image": "https://media.rawg.io/media/screenshots/f3b/f3b43d3a0acbebdf9a871eec861cb227.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["NHN Entertainment", "NHN"], "genres": ["Action", "RPG"], "publishers": ["NHN", "NHN Entertainment"], "esrb_rating": null}