{"id": 305371, "slug": "eileens-otome-love-story-demo-0", "name": "Eileen's (Otome) Love Story [Demo 0]", "name_original": "Eileen's (Otome) Love Story [Demo 0]", "description": "<p><strong>SYNOPSIS</strong><br/></p>\n<p>\"Once upon a time, before being our beloved tutorial lady, Eileen was a normal girl who's very smart and loved the Ren'Py Engine. </p>\n<p>She is summoned to the <em>School of Visual Novels</em> as a tutor for the Ren'Py Engine, because they feel peers can teach fellow peers better than the regular teachers. The school is testing out various engines to use for their school, and whichever is proved to be the most powerful, easy to use, and loved by the students....that will be what they will use for their school. </p>\n<p>Of course, competition is fierce, and people want their engine of choice to win . Ren'Py is a little tough, due to it still having that programming aspect...it's up to Eileen to show the students under her the power of simplicity, despite the programming aspect of this engine. Can she do it?</p>\n<p>....Oh, and there's a possibility of finding love, too! She's still a girl after all and admires romance~\"</p>\n<p><strong>DEMO 0 FEATURES:</strong></p>\n<p>- 25,310 words<br/>- Lots of choices!<br/>- An MC with a personality!<br/>- Sprinkle of voice clips both custom &amp; from free packs<br/>- Some Ren'Py refs with a fan twist<br/>- Many eligible bachelors <br/>- Friendship paths too<br/>- Mixed stock sprite styles, I'm sorry xD<br/>- Badly drawn CGs by yours truly, I'm very sorry lol</p>\n<p><strong>Eileen's (Otome) Love Story</strong> was a very ambitious otome project I started back in 2013 and was my first attempt at the otome genre! It stars the tutorial character, Eileen, from the Ren'Py tutorial game, using the lovely free to use Eileen sprite created by Uncle Mugen. The project since has been on a long, LOOOOONG hiatus, and its fate remains unknown. My plan, however, is to at least release one more update to include writing I did past the original demo and maybe write a bit further, just so it feels \"complete\" even if it doesn't reach the original potential. This game is special to me as I made Eileen a fun and energetic character, and many of her traits inspired  Sebby for my other otome game, \"The Only One Girl { First Quarter }\". </p>\n<p>Despite the many flaws this project has, it is an important part of my game dev journey and taught me so much! So I hope you have fun with it for what it is, and can see the influence it has had on my other works ^^</p>", "metacritic": null, "released": "2019-03-29", "tba": false, "updated": "2019-04-01T03:39:37", "background_image": "https://media.rawg.io/media/screenshots/db4/db4bdec4ad11af23e61c904d1fe832d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux"], "developers": ["Tofu Sheets Visual"], "genres": [], "publishers": [], "esrb_rating": null}