{"id": 305648, "slug": "truco-by-playspace", "name": "Truco by Playspace", "name_original": "Truco by Playspace", "description": "Truco is a card game with the spanish deck originally from Spain. The Truco game is famous in all America, principally in South America. Truco has different versions, but the most famous is Truco Argentina.<br/><br/>The goal is to get a number, sometimes the game is divided on rounds.<br/><br/>Playspace was born in 2011 with the aim to transfer the classic games  to the online world. So the best Truco online has been created! Truco Playspace!<br/><br/>Truco Playspace is a  FREE multiplayer card game to enjoy while you are chatting with your friends. The best card online experience is here with Truco Playspace!<br/><br/>Features:<br/><br/>- It is free to play!<br/>- Chat and play with your friends.<br/>- Play special games: in pairs, turbo and private<br/>- Compete to be the best player in our Truco Ranking.<br/>- Get double coins when you win your games with the \"Double or Nothing\"<br/>- Unlock achievements and progress through the game getting gifts and coins<br/><br/>Download the app and enjoy with Truco Playspace, the best Truco Game! <br/><br/>Follow us on Facebook http://goo.gl/qXIggC and Twitter  https://twitter.com/playspace?lang=es to know more about the games of Playspace and contact us.<br/><br/>If you have any problem we will help you solve it. <br/>You can recommend us how we can improve our games https://www.facebook.com/playspace/?ref=ts&amp;fref=ts<br/><br/>Remember, you will need to be connected to play. <br/>Terms and Conditions:<br/>http://goo.gl/u30FLZ<br/><br/>Thank you, <br/>The Playspace Team.", "metacritic": null, "released": "2016-06-06", "tba": false, "updated": "2019-10-22T14:36:29", "background_image": "https://media.rawg.io/media/screenshots/c77/c7752a1ef272d89a4fb6766cf1f0bd0c_cZ9UgPK.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlaySpace"], "genres": ["Board Games", "Card"], "publishers": ["Playspace"], "esrb_rating": "Teen"}