{"id": 305625, "slug": "dot-n-beat-test-hand-speed", "name": "Dot n Beat-Test hand speed", "name_original": "Dot n Beat-Test hand speed", "description": "Dot n Beat is an absolutely addictive game with the most thrilling and exciting rhythm! You never wanna miss it!<br/><br/>2019 latest music arcade game, which tests your music rhythm and hand speed. Challenge your friends and see who has the last laugh! <br/><br/>A combination of various music written by the world's brilliant independent musicians, audiovisual effects and distinctive game playing-modes makes Dot n Beat enjoyable for all ages. A memorable music journey is about to start, let’s rock n roll!<br/><br/>How to play<br/>Follow the beats and control the moving direction of the light ball by tapping the screen. Listen to the rhythms and play to the music so that you can get a higher score and more diamonds. Move your fingers to experience the thrills of compact rhythms. <br/><br/>Key Features<br/>Easy to play, everyone can be the rhythm master<br/>Enormous songs by excellent independent musicians and fast-paced playing-mode make it impossible to stop playing<br/>Addicted rhythm, challenge your friend with a higher score<br/>Totally free-unlock more mysterious skins <br/><br/><br/>Auto Renewable Subscription:<br/>VIP Membership:<br/>7-day VIP Service includes following products WEEKLY:<br/>- No Pop-Up ADs<br/>- FREE Access to All Paid Music<br/>- 70 Revive Coins <br/>- One Special Skin<br/>- Unlimited Hearts<br/>7-day VIP Membership offers weekly VIP service subscription for $7.99 after 3-day free trial. When you start the free trial, auto-renewal will automatically be activated for an individual 7-day membership, to begin when the trial ends. Payment will be charged to iTunes Account at confirmation of purchase<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/>Canceling trial or subscription<br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039 . When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be cancelhttps://developer.apple.com/imessage/ed. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>Privacy Policy: https://bit.ly/2QzMTFz<br/>Terms of Service: https://bit.ly/2MeGaCB<br/>Terms of Subscription : https://bit.ly/2We2KQd<br/><br/>What are you waiting for? Download now and test your music sense and hand speed!", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2019-07-29T17:00:32", "background_image": "https://media.rawg.io/media/screenshots/576/5767c55d7470ed60cfebeb42fef30bc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Badsnowball"], "genres": ["Arcade", "Casual"], "publishers": ["BADSNOWBALL HONGKONG"], "esrb_rating": null}