{"id": 305634, "slug": "parcheesi-classic-online", "name": "Parcheesi Classic Online", "name_original": "Parcheesi Classic Online", "description": "Have hours of fun playing the best online multiplayer parcheesi and ludo! The board game that defined your childhood now for free! Play and compete with our community, invite your friends and family to join you and beat the highest scores of this awesome dice game!<br/><br/>Parcheesi or Ludo is an adaptation of Pachisi, a board game originated in India around the 6th century -at the same time as chess. The concept of this funny board game is clear: There are four players with four tokens of the same colour with a goal... Play and beat the opponents by moving all of your tokens to your goal box before everyone else! The parcheesi board has 68 boxes with numbers: Start in your corresponding nest and move forward by rolling your dices with the help of a dice cup until you arrive with your token to the goal box. You will need a strategy to win and beat the opponents. Do not get upset if you lose! This board game -with its variants- is easy to play but hard to master! Learn your own player tactics and achieve the necessary skills to be at the top of our parcheesi ranking!<br/><br/>Enjoy your childhood favourite board game now online and multiplayer! Chat with your friends while you challenge them or one of the other thousands of players who make up our Ludo community! Become the best Parcheesi online player and progress in this game learning new tactics!<br/><br/>FEATURES OF PARCHEESI LUDO MULTIPLAYER - CLASSIC BOARD GAME<br/><br/>- Have fun playing this free game! Upgrade your tokens with amazing emoticons and emojis!<br/>- Multiplayer game: Chat, compete and invite and play with your family and friends!<br/>- Easy rules and intuitive gameplay<br/>- Play special games: Choose between playing making teams with a partner, turbo mode or private<br/>- Compete to be the best player in our Parcheesi game ranking: Every match counts!<br/>- Get double coins when you win your games with the \"Double or Nothing\"<br/>- Unlock achievements and progress through this classic board game getting gifts and coins<br/>- Appropriate for kids of all ages! Make teams with your family members!<br/><br/>Recall your childhood memories in this ludo game and join our great parcheesi online community!<br/><br/>Enjoy the best free Parcheesi online in Playspace! Roll your dice and start playing a match now! But, above all, have fun with this popular board game!", "metacritic": null, "released": "2012-12-13", "tba": false, "updated": "2020-03-30T02:08:34", "background_image": "https://media.rawg.io/media/screenshots/8c4/8c40525318609d767a165cec0fee9f44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlaySpace"], "genres": ["Board Games", "Puzzle"], "publishers": ["Playspace"], "esrb_rating": null}