{"id": 305727, "slug": "yalghaar-action-fps-shooter", "name": "Yalghaar: Action FPS Shooter", "name_original": "Yalghaar: Action FPS Shooter", "description": "ONE NATION, ONE ARMY, ONE WAR. The fate of future generations depends on this top military commando operation. Get a chance to rescue hostages, neutralize hostile attacks, diffuse bombs and mines, eliminate enemy gunners and snipers in this modern combat. Take down miscreants in front-line battlefield with powerful guns in this FPS shooting game.<br/>Equip yourself with state of the art military weapons and lead your army to glory in this army adventure shooting game. Chase enemy boss and show them the way to hell in this action packed best FPS shooter game full of thrill. Combat against militant groups in realistic graphics.<br/>Yalghaar is a next-gen army warfare game in which you have to survive as a spy commando while coping with the bunch of enemy allied forces. Perform the most intense military commando operations and accomplish multiple thrilling tasks by performing stealth strikes. The use of AI is at its peak in this commando shooting game which has made this sniper game a masterpiece. Gear up with latest weapons as a spy commando. Use silent moves only, else you cover will be blown in no time. The militant forces are patrolling everywhere, so beware of them.<br/>You are a master of stealth, kill enemies and counter terrorism in this offline adventure shooting game. There are no rules in this battlefield. Risk your life in this fast paced army FPS gun shooting game, fight for domination! You are a ruthless terrorist hunter. Strike your blow in this one of a kind Pakistan's first modern warfare FPS shooter game.<br/>This is a strategic RPG with extreme gun shooting action and military warfare tactics. As an elite commando shooter, you are assigned multiple secret missions to save the world from militants. Select your weapon wisely as per situation and find some cover while shooting at the terrorist force. This top FPS game falls in the category of best shooting games due to its brand new action missions. Also, you will surely enjoy the high-quality graphics and realistic animations of this commando shooting game.<br/>In this army FPS game, you are an elite commando and when duty calls, you stand second to none in eliminating hostiles in combat. War against terror is in full swing and your company of heroes needs you in this Battlefield. Lead your squad in this realistic 3D FPS shooter. Shoot em up!<br/>Live the life of an SSG elite Commando equipped with Grenades and Sniper Rifles in this war on terror, you are on a secret mission behind enemy front-line.<br/><br/>The Yalghaar: Counter Terrorist Shoot - Free Action FPS Game Features: <br/>◉ Powerful classic infantry weapons to choose from including machine guns, sub machine guns, shotguns, sniper and pistols.<br/>◉ Tactical military adventure maps set in a realistic environment.<br/>◉ Serve Justice, earn medals and unlock powerful guns.<br/>◉ Encounter variety of threats including stealth, gunners, snipers and bombers.<br/>◉ Compete against the Leader board and make it to the top among other high caliber players.<br/>◉ Earn medals and raise you ranks.<br/>◉ Highly challenging and intense warfare action.<br/>◉ A lot of thrilling missions with new game objectives.<br/>◉ Excellent enemy AI and physics-based game play.<br/><br/>If you like “Yalghaar: Counter Terrorist Shoot - Free Action FPS Game Features”, please try our other games and don’t forget to rate and review.", "metacritic": null, "released": "2017-06-16", "tba": false, "updated": "2019-10-22T14:36:32", "background_image": "https://media.rawg.io/media/screenshots/0cb/0cb88fa24be6a747f19d790d8fe1cb44_GoaX2J8.jpg", "website": "http://game.yalghaar.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rockville Technologies, Pvt"], "genres": ["Action", "Adventure"], "publishers": ["Rockville Technologies"], "esrb_rating": "Mature"}