{"id": 305730, "slug": "era-of-legends-dragon-discord", "name": "Era of Legends: Dragon Discord", "name_original": "Era of Legends: Dragon Discord", "description": "Era of Legends — the next generation mobile MMORPG!<br/><br/>Fans of swords and magic! Embark on an epic adventure across the boundless world of the F2P MMORPG Era of Legends. Discover a captivating story, take on refreshing adventures, and try the unique gameplay features.<br/><br/>Bombard hordes of demons riding a griffin or hack your way through them controlling a massive robot. Collect magic beasts and send them into battle. Raiding or saving the continent of Eminoor from the forces of Evil alongside your relatives is priceless!<br/><br/>Era of Legends combines the best features of mobile gaming and the key qualities of the top MMORPGs. A vast explorable world filled with thousands of secrets, hundreds of class combinations and magic beasts, daring battles, and fascinating graphics. Hello, new wondrous life!<br/><br/>Key features:<br/><br/>Free exploration<br/><br/>The world of Era of Legends is so immense it will take time to explore even from the height of a griffin's flight. It is the perfect place to set foot into the unique zones, solve mysteries, hunt for hidden treasures, and make history by yourself or alongside your friends!<br/><br/>Tactical flexibility and diverse battles<br/><br/>Eight classes with unique specializations — is good. Plenty of all kinds of attack, defense or support magic beasts — is excellent. Combining class and magic beasts abilities — is fantastic, thousands of variations for every occasion and adversity.<br/><br/>A collector's heaven<br/><br/>Era of Legends has mounts, magic beasts, hero skins, and pretty much anything a true collector would crave.<br/><br/>Best genre qualities in one game<br/><br/>Clans, dungeons, holidays, server legends, remarkable events, raids, intriguing quests, sparkling online stories to tell in the real world. Era of Legends is massive and offers the players nothing less.<br/><br/>Colorful design and graphics<br/><br/>It's not the flying what makes the world so engaging. It's the reason to get off the mount after spotting a suspicious-looking meadow. Unusual architecture, unforgettable zones, and secluded spots full of curious for an observant explorer details — in Era of Legends amazing stories can be found under a rock. Literally.<br/><br/>Do you want to know more about Era of Legends? Visit our community page!<br/>Facebook https://www.facebook.com/eraoflegends101xp/<br/>Have questions?<br/>Contact support https://en.101xp.com/help", "metacritic": null, "released": "2019-03-23", "tba": false, "updated": "2019-10-22T14:36:32", "background_image": "https://media.rawg.io/media/screenshots/4ce/4ce905a5552c325d6f006092256ca153_ioXs2xX.jpg", "website": "https://eol.101xp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["101XP"], "genres": ["Adventure", "RPG"], "publishers": ["101XP"], "esrb_rating": "Everyone 10+"}