{"id": 305842, "slug": "zoo-mobile", "name": "Zoo Mobile", "name_original": "Zoo Mobile", "description": "Zoo Mobile – Open your own Zoo!<br/>Majestic lions, fluffy bunnies and curious kangaroos – in Zoo Mobile, you'll meet them all as you experience the colorful tycoon sensation and run your own zoo!<br/><br/>Create the Zoo of your Dreams!<br/>Build enclosures, keep all sorts of animals and provide them with tender loving care. The happier your animals are, the more visitors will come to your zoo.<br/><br/>Discover an extraordinary app that will captivate you with vibrant animal game features and a wide variety of zoo game options. Decorate to your heart's content and complete everyday tasks and exciting challenges, from caring for animals to breeding endangered animals. Zoo Mobile is jam-packed with fun features for animal lovers:<br/><br/>• A wide variety of stunning exotic animals<br/>• Adorable animations and cute cartoon graphics <br/>• Entertaining social gaming features<br/>• Create animal game habitats and surroundings<br/>• Regular updates and zoo game events<br/>• Game features that allow you to care for animals and breed animals<br/>• A back story and quest missions that are sure to draw you in<br/>• Long-lasting fun in a gorgeous tycoon setting<br/><br/>The Animal Game Adventure Begins<br/>Become a zoo director today and establish your own zoo. Decorate the walkways with unique zoo game items – from snack stands over restrooms to toy shops! <br/><br/>Download the Animal Game App!<br/>Prove your skill as a zoo manager, take care of adorable animals and turn your zoo into an awesome attraction. Explore the animal game adventure that is Zoo Mobile.<br/><br/>Play now and dive into a one-of-a-kind zoo game experience!<br/><br/>Note: Zoo Mobile is a standalone app and cannot be linked to existing accounts in the eponymous browser game.", "metacritic": null, "released": "2015-08-27", "tba": false, "updated": "2019-08-02T03:17:04", "background_image": "https://media.rawg.io/media/screenshots/a82/a82d5f58d54cac4c961a73d57a822846_W2ku9XV.jpg", "website": "http://apps.upjers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Upjers"], "genres": ["Action", "Simulation"], "publishers": ["Upjers"], "esrb_rating": null}