{"id": 305843, "slug": "myfreefarm2", "name": "MyFreeFarm2", "name_original": "MyFreeFarm2", "description": "My Free Farm 2 – Create your own Farm!<br/><br/>Experience the colorful world of My Free Farm 2. Cultivate your fields, keep and care for cuddly animals and process your farm fresh produce into all kinds of wonderful hand-crafted products. The possibilities are limitless! Let yourself be enchanted by this extraordinary farm game and discover My Free Farm 2!<br/><br/>Fantastic Farm Game Opportunities!<br/><br/>My Free Farm offers you an impressive 3D farm setting. Decorate your farm with beautiful decorations, build all kinds of production buildings, make virtual friends with your fellow players and dive into a lovingly detailed world. Zoom in close to admire the stunning details on your plants and animal and explore every corner of your farm property. Make use of countless farm game features:<br/><br/>Grow dozens of crops<br/>Keep and care for adorable animals<br/>Manufacture fabulous farm goods<br/>Expansive story quests<br/>Countless expansions and many unique decorations for your farm<br/>Regular farm game updates and events<br/>Intuitive game controls<br/><br/>My Free Farm 2 – Countryside Idyll on the Go!<br/><br/>Let the farm game fun can begin! Download My Free Farm 2 for your device and get your own mobile farm now. Come check out the fantastic farm game. Tend to your fields, expand your farm, care for cuddly critters, and make your farm prosper!<br/><br/>A Captivating Gaming Experience<br/><br/>Fresh air, beautiful country scenery, infinite possibilities and exciting challenges – My Free Farm 2 is a farm game destined to provide long-lasting farming fun! Try it out now – get the app and run your own farm!", "metacritic": null, "released": "2015-06-08", "tba": false, "updated": "2019-08-02T03:17:05", "background_image": "https://media.rawg.io/media/screenshots/19f/19f8d4a65e6044b6405d0869fce045ce_AQzLaJP.jpg", "website": "http://apps.upjers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Upjers"], "genres": ["Adventure", "Simulation"], "publishers": ["Upjers"], "esrb_rating": null}