{"id": 305898, "slug": "shooting-range-rifle-sim-3d", "name": "Shooting Range Rifle SIM 3D", "name_original": "Shooting Range Rifle SIM 3D", "description": "Calling all marksmen – are you ready for the ultimate sniper challenge? Rifle Shooting Range Simulator throws down the gauntlet and calls out every sharpshooter, hunter and gunslinger out there – put your skills to the test with this realistic shooting simulator and see if you’ve got what it takes to reach the highest level and beat the game!<br/><br/>Its takes nerves of steel and a cool head to steady your rifle and take aim. You’ve got a few seconds to make the shot, the clock is ticking, your hands feel like they’re made of rubber and the scope just won’t land on the bullseye – this is when one shot legends are born, this is the moment where the great make the shot and score maximum points while the weak snap and miss the target entirely.<br/><br/>So which one are you? Sure, you might find it simple to hit the target from 50 meters away with a 4x zoom, simple to score enough to get through to round to with a full clip and no wind, but how are you going to do when your target is 200 meters back, the wind has picked up and you’ve one bullet spare? <br/><br/>Maybe you’ll be one of those players that relies on their equipment. Perhaps you’ll go to the store and purchase the best rifle available. Or get yourself one of the top of the range scopes for better zoom. You might even change the caliber of your bullets or snaffle up some marksman’s gloves to improve your steady hold, but as every sniper knows, when it comes to it, it’s all about skill. You’re only as good as your last shot. <br/><br/>So where will your bullet hit? And what kind of a shooter are you? Do you like to play it safe and aim for the body, with all those point possibilities from 1-10? Or are you one of the crack shots that fears nothing and always goes for a headshot with the maximum score available? <br/><br/>And once you’ve mastered the 40 levels of intense target skills, then it’s time to up your game and take the timed challenge as we separate the game players from the 1000-yard stare sportsmen and women who can hit a pinhead from a thousand meters away and do it in the bat of an eyelid.<br/><br/>There’s nowhere to run, nowhere to hide and no getting away from it, if you can’t beat our game, you’re no shooter. Step right up and prove yourself in the ultimate rifle range challenge in Rifle Shooting Range SIM 3D!", "metacritic": null, "released": "2019-04-06", "tba": false, "updated": "2019-07-29T22:05:16", "background_image": "https://media.rawg.io/media/screenshots/3df/3dfb75a12257b3230d6554135665d73b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["fun cool games"], "genres": ["Simulation", "Sports"], "publishers": ["EDGE STUDIO"], "esrb_rating": null}