{"id": 305914, "slug": "free-kick-euro-2016-edition-france", "name": "Free Kick - Euro 2016 Edition France", "name_original": "Free Kick - Euro 2016 Edition France", "description": "Conquer the Europe championship in France! Now you can do it actually, winning the online rankings tournament.<br/><br/>Bright and colorful free kick game for those who are looking for the best 3D football game.<br/>Rules are clear: Choose your favorite football team, score beautiful goals with free kicks. Score more points, watch online rating of your team growing up!<br/>Every scored free-kick adds points to your team rating and decreases the rating of your opponent.<br/>Also you can share your most beautiful results with your FB friends. And compete with them online as well.<br/><br/>The game has three basic modes:<br/>- \"Championship\" - National teams online rating . Score points for your team and take away points from the rival teams.<br/>- \"Arcade\" - Participate in the Gamecenter rankings. Score free kicks and penalty shots, score points, and compete with other players and friends.<br/>- \"Training\" - a chance to hone your skills without risking positions in the rankings.<br/><br/>Invite your friends - the more players will play, the more chances to your national team to win the UEFA European Championship.<br/>The game is totally free-to-win, though you can make your way to success more comfortable with useful in-app purchases.<br/><br/><br/>Good luck and we hope you enjoy our game.", "metacritic": null, "released": "2016-03-05", "tba": false, "updated": "2019-10-22T14:36:42", "background_image": "https://media.rawg.io/media/screenshots/79d/79d2eb319dfb8c7220787e539004446f_vbMx7Ey.jpg", "website": "http://happy-penguins.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["\"Media5 Interactive\""], "genres": ["Simulation", "Sports"], "publishers": ["\"Media5 Interactive\""], "esrb_rating": "Everyone 10+"}