{"id": 305927, "slug": "champions-free-kick-league-17", "name": "Champions Free Kick League 17", "name_original": "Champions Free Kick League 17", "description": "Win the Champions League. Lead your favorite club to the top of the online rankings of European Champions League.<br/><br/>Football Champions Free Kick League 2017 - is the European free kick clubs championship with amazing atmosphere of the most prestigious soccer tournament in Europe.<br/><br/>You can play for your favorite club, immerse yourself in the world of  European football champions. Feel the exciting atmosphere of football match, the tension of the stadium.<br/><br/>Make beautiful penalty kicks, score goals, save goals playing for goalkeeper. Rise to the top of the tournament tables and prove that you and your favorite club is the champion!<br/><br/>The victory in the UEFA Champions League is the real dream of any football player. Stand in one row with the top football stars. Be like Messi,  Ronaldo,  Lewandowski,  Griezmann,  Neymar,  Hazard... Prove that you're the best.<br/><br/>Impress friends with victories and achievements, score penalties, watch for updates - install and play the best football game for fans of penalty and free kicks.<br/><br/>The key features of the Football Champions Free Kick League 2017 are:<br/><br/>- realistic animations, thanks to the latest motion capture technologies (with the participation of professional football players)<br/>- unique and realistic impact physics<br/>- high-quality 3D model of the player<br/>- curved blows of your enemy<br/>- convenient, intuitive control. (Learning to play is simple, but mastering is not so easy)<br/>- online ratings in real time<br/>- game statistics<br/>- European top clubs, grandees<br/><br/>Score goals, repel strikes, defend the honor of your club in the UEFA Champions League and achieve glory!<br/><br/>Additional features are:<br/><br/>- large number of teams<br/>- frequent updates<br/>- situation from real matches<br/>- the increasing complexity of the game of the goalkeeper of the opponent<br/><br/>Download the game and play today completely FREE!", "metacritic": null, "released": "2017-05-19", "tba": false, "updated": "2019-10-22T14:36:43", "background_image": "https://media.rawg.io/media/screenshots/fc3/fc38264ec497fa3e677571977a8acb48_aWmF7QY.jpg", "website": "https://www.facebook.com/Free-kick-penalty-soccer-302727633454282/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["\"Media5 Interactive\""], "genres": ["Simulation", "Sports"], "publishers": ["\"Media5 Interactive\""], "esrb_rating": "Everyone 10+"}