{"id": 305936, "slug": "sniper-shooting-champion", "name": "Sniper Shooting Champion", "name_original": "Sniper Shooting Champion", "description": "The game allows you to develop and perfect a shooting skills in the most beautiful places in multiplayer and career game scenarios. <br/>Choose your favorite weapon and compete with rivals from all the world<br/><br/>We created one of the best shooting game conditions:<br/><br/>- 30 legendary sniper rifles<br/>- True to life bullet physics and realistic sniper scope zoom<br/>- Picturesque real locations<br/>- Intuitive touch controls<br/>- More than 30 unique targets including movable<br/>- Iron sight for short distances<br/>- The sight of an infantry sniper for medium distances<br/>- Sniper scope for long distances and very long distances for a real Sniper Range Master<br/><br/>You can play Sniper Career, or quickly compete with the rivals in multiplayer mode.<br/><br/>And for real shooting kings, we developed sophisticated tasks, with moving targets.  <br/>Improved weapon purchases, will make your life easier, but you still have to make efforts!<br/><br/>Outstanding players will be awarded with generous awards and general recognition:<br/><br/>- International Tournaments<br/>- World, country ratings and Facebook ratings <br/>- Daily quests and bonuses<br/>- Wheels of Fortune<br/>- Daily awards<br/><br/>Today you can install and play in Ultimate Sniper Shooting for free.", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2019-10-22T14:36:43", "background_image": "https://media.rawg.io/media/screenshots/246/246c068739b3aba141b35a4e656278ea_Pa1r5wR.jpg", "website": "http://sportgames.zone", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["\"Media5 Interactive\""], "genres": ["Simulation", "Sports"], "publishers": ["\"Media5 Interactive\""], "esrb_rating": "Teen"}