{"id": 305967, "slug": "charming-elimination-funny-match-puzzle-games", "name": "Charming Elimination - Funny Match Puzzle Games", "name_original": "Charming Elimination - Funny Match Puzzle Games", "description": "Use different shapes to eliminate superimposed blocks<br/><br/>Features:<br/>Puzzle elimination, Exercise brains<br/>Support rotation, full of strategy<br/>Relax and enjoy a lot of fun<br/>A variety of modes, Simply can not stop<br/>Level mode: from simple to difficult, step by step<br/>Free mode: have strategy to eliminate, for high scores<br/>Challenge mode: both strategy and luck<br/>World Ranking: Show your record<br/><br/>The props in the game (Level mode and Free mode available):<br/>Bomb: Eliminate the blocks around the grid<br/>Big Head Nail: Eliminate all blocks in the current grid<br/><br/>Level mode: Eliminate all blocks by giving given shapes. The top 40 levels are basic, next levels are more and more difficult, challenging full!<br/>Some level is too difficult to play, maybe you have tried several times and did not pass? It doesn't matter, you can use 100 gems to get a bomb and big head nail props to continue the game.<br/><br/>Free mode:<br/>Each time there are three shapes to choose from, choose one you think the best to eliminate blocks. Every time you complete a round, you can get a bomb and a big head nail props. More rounds, much difficult. Through your talent and a little bit of luck, try to get the highest score!<br/>Tip:<br/>1) to reduce the occurrence of block isolation<br/>2) props as far as possible in the final use of each round<br/><br/>Challenge mode:<br/>Every time you have only one shape to choose from, put it in the best position, try to eliminate more blocks!", "metacritic": null, "released": "2017-05-17", "tba": false, "updated": "2019-10-22T14:36:44", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc894f73d83bc5dc2ac0194d1856ce56_SrQXaQg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wen Chen"], "genres": ["Puzzle"], "publishers": ["Wen Chen"], "esrb_rating": "Everyone 10+"}