{"id": 305964, "slug": "sike-bank-shot-basketball", "name": "SIKE! Bank Shot Basketball", "name_original": "SIKE! Bank Shot Basketball", "description": "Let's play something different!<br/><br/>Fun &amp; Challenging - Swipe to shoot and bounce off the wall to make the basket.  Easy to learn, but hard to master.  Don't get SIKED (psyched) out if you can't make the shots.  The key is to keep trying and learn how to shoot using angles.<br/><br/>BANK SHOT BASKETBALL FEATURES:<br/>+ Fun and easy to learn swipe basketball shooting game.<br/>+ Obtain experience points to gain levels and to unlock balls and different areas.<br/>+ Achievements with Game Center integration.<br/>+ Local and global leaderboards.*<br/>+ WiFi connection is not required to play.**<br/><br/>If you like this game, you can also check out Swipe Shootout:<br/>https://itunes.apple.com/us/app/swipe-shootout-basketball-fun/id1280209761<br/><br/>Note: This game contains in-app-purchase and advertisements. In-app-purchase is optional. Also, please note that advertisement viewing uses internet connection. Data charges may apply based on your service plan. Please contact your service provider for more details.<br/><br/>*Online leaderboard is a service provided by Game Center. To use the service, you will need to have internet connection and sign in to your Game Center account. Your scores are automatically uploaded to the leaderboard if you are signed in.<br/><br/>**Online services such as in-app-purchase and advertisement viewing will not be accessible during offline.<br/><br/>Visit Quest Monkey Games' official web page at www.questmonkeygames.com or the official Facebook page at https://www.facebook.com/QuestMonkeyGames/ to get the latest news and info about this game.", "metacritic": null, "released": "2018-10-23", "tba": false, "updated": "2019-10-22T14:36:44", "background_image": "https://media.rawg.io/media/screenshots/0c0/0c04fc09ebfd57e3ede41d3271d2c567_xfgdav4.jpg", "website": "https://questmonkeygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Quest Monkey Games"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Quest Monkey Games"], "esrb_rating": null}