{"id": 306018, "slug": "paranoia-happiness-is-mandatory", "name": "Paranoia: Happiness is Mandatory", "name_original": "Paranoia: Happiness is Mandatory", "description": "<p>Paranoia is a CRPG that takes place in humanity&#39;s last idyllic refuge, Alpha Complex, which is controlled by Friend Computer. All citizens enjoy a life of joy, cheerfulness and cleanliness. Questioning the benevolence of Friend Computer is an act of treason. Having access to information beyond your security clearance is an act of treason. Refusing to drink your daily dose of Bouncy Bubble Beverage is an act of treason. Treason is punishable by summary execution.<br />\nStay alert! Trust no one!<br />\nTraitors are everywhere, plotting to destroy The Computer, Alpha Complex itself, and our precious way of life. Identify them, report them – or eliminate them as the treasonous scum they are. Keep your laser handy!<br />\nYou lead a team of Troubleshooters with RED security clearance. Your job is to find trouble – and shoot it. Friend Computer monitors your every move, alert for any sign of treason, and will undoubtedly reward you for prompt and heroic action in defence of Alpha Complex – or punish treasonable acts, possibly by assigning you to be used as reactor shielding.<br />\nA retro-futuristic world filled with technologies as wondrous as they are deadly<br />\nCreate and lead a team of four Troubleshooters working for Friend Computer<br />\nChoose your specialisations from 16 available skills<br />\nUnique character progression through cloning (if you die, you progress!)<br />\nTactical combat system with active pause inspired by classic CRPG games<br />\nOriginal enemies, including malfunctioning robots, aggressive drinks dispensers and defective clones</p>", "metacritic": null, "released": "2023-10-03", "tba": false, "updated": "2023-03-23T11:12:45", "background_image": "https://media.rawg.io/media/screenshots/1a1/1a1774bdcaef006983eefc3f48907f38.jpg", "website": "https://www.facebook.com/PlayParanoia/", "rating": 1.75, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 7, "toplay": 20, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 8, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Cyanide Studio", "Black Shamrock"], "genres": ["RPG"], "publishers": ["Bigben Interactive"], "esrb_rating": null}