{"id": 306014, "slug": "project-witchstone", "name": "Project Witchstone", "name_original": "Project Witchstone", "description": "<h3>Living world</h3>\n<p>The world you explore is alive, meaning that characters that inhabit this world go on with their daily lives and move around following a routine (from their workplace to their home, for example). They also own properties, have personalities, friends and enemies, likes and dislikes, appreciation towards you, allegiance to factions, perception of their surroundings, etc.</p>\n<h3>Sandbox</h3>\n<p>Using actions common in RPGs (dialogue, combat, spells, abilities, stat checks, stealing, etc.) and less common ones (stealth, influence interface, etc.), you can interact, manipulate, and shape this world as you see fit. Our goal is to give you the freedom to live the adventure you want. No overarching pre-defined main story thread, you get to decide how you want to proceed.</p>\n<p>Want to frame an NPC for theft or murder? Want to join a faction, become their leader, and destroy the other factions? Want to destroy the factions but scheme in a way that they never know you&#39;re responsible? Want to become a treasure hunter instead? Maybe the best solution is to blow everything up?</p>\n<p>All of this is possible in our sandbox. How?</p>\n<p>With our systemic approach to narrative, tailored events will occur based on your previous actions. All crimes will result in law enforcement running an investigation and attempting to arrest the suspect. Any violent act committed against a faction will result in retaliation. Taking over someone&#39;s house will work fine until the previous owner&#39;s relatives or friends come to visit.</p>\n<p>These are some examples of the ripple effect you can cause in this world. And how you deal with the ripple effect will determine what happens after.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2019-08-28T21:46:57", "background_image": "https://media.rawg.io/media/screenshots/880/8805f1bfd7d2a1fb2ace73a0ee2eeefe.jpg", "website": "http://www.spearheadgames.ca/projectwitchstone", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Spearhead Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Spearhead Games"], "esrb_rating": null}