{"id": 306083, "slug": "solitaire-bliss-collection", "name": "Solitaire Bliss Collection", "name_original": "Solitaire Bliss Collection", "description": "Take a break and enjoy the ultimate Solitaire collection by Solitaire Bliss – <strong>over 100 solitaire game variants</strong> in one bundle.<br/><br/>The games are divided into 9 Solitaire groups:<br/><strong>Klondike</strong> – Classic and beloved Solitaire games such as Klondike Turn 1, Klondike Turn 3, Easthaven and Vegas.<br/><strong>Spider Solitaire</strong> – The most popular category on the web version, now with more than 15 variants such as Spider 1, 2 and 4 suits, Beetle, Scorpion and Wasp.<br/><strong>Freecell</strong> – Classic Freecell with numbered deals, along with Eight Off, Bakers Game, Sea Towers and Forecell.<br/><strong>Yukon</strong> – Difficult but challenging, Yukon, Russian, Australian and the Alaska Solitaire variant are always fun to play.<br/><strong>Forty Thieves</strong> – Including more than 20 variants such as classic Forty Thieves, Josephine, Squadron and Emperor.<br/><strong>Golf</strong> – Classic Golf and less known variants such as Ants and Black Hole.<br/><strong>Pyramid</strong> – Considered one of the hardest Solitaire games, about 0.5% Classic Pyramid games are won, not to worry - we included several easier variants too!<br/><strong>TriPeaks</strong> - Fun and fast, Tripeaks and Hidden Tripeaks<br/><strong>Pairing</strong> – Some pairing games require strategy (like Double Fourteen out) and some are pure luck (like Simple Pairs), but all are fun to play.<br/><br/>The collection offers a few advanced features such as:<br/><ul><li>Zoom in and out to change the cards' size<br/></li><li>30 of the most popular games feature Solvable-only mode which deals only games that could be won.<br/></li><li>Personal Statistics <br/></li><li>Save and Load your game to go back and try different courses of action<br/></li><li>Your latest game is auto-saved upon exit<br/></li><li>Daily Challenges for Klondike, Spider and Freecell – try to achieve the best score, time and moves and compete against other players from all around the world.<br/></li><li>Different backgrounds and card sets.<br/></li><li>Unlimited hints and undos<br/></li><li>Play in windowed or full-screen mode<br/></li><li>Drag and drop a card, or just click it to move to the next available spot.</li></ul><br/>The classic Solitaire experience you know and love, now in one bundle for Windows and Mac!", "metacritic": null, "released": "2018-09-30", "tba": false, "updated": "2022-10-17T06:53:46", "background_image": "https://media.rawg.io/media/screenshots/3d9/3d9476674aee3d511501a51673ee20af.jpg", "website": "https://www.solitairebliss.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC", "macOS"], "developers": ["Mongoose Net"], "genres": ["Board Games", "Casual", "Card"], "publishers": ["Mongoose Net"], "esrb_rating": "Everyone 10+"}