{"id": 306047, "slug": "beraltors", "name": "Beraltors", "name_original": "Beraltors", "description": "Beraltors is a 2D Metroidvania RPG that focuses around collecting monsters called Beraltors. Your father has been kidnapped by a big bad dude, oh no! You want to hug him and feel his warm chest against your skin. You will need to rescue him, but you are a pathetic cretin. There are a lot of evil wizard spells going around, monstrous creatures are appearing, and the bad guy who stole your father is jacked. You will need to use those cute Beraltors to rescue your father!<br/>\r\nThere are loads of Beraltors in Beraltors, over 70, and each Beraltor is a little different. They have different elements, stats, attacks and abilities. Ice Beraltors can go in cold areas, water Beraltors can swim and so on. Certain elements are strong and weak against other elements. Using a fire Beraltor against a water Beraltor will not be easy. You need to collect a diverse group of Beraltors in order to progress through the game and save your pops, Beraltors features a wide cast of character, in a silly, confusing world. Check it out!<br/>\n<br/>\r\nFeaturing<br/>\r\n- Over 64 different playable Beraltors, each with unique animations and abilities.<br/>\r\n- A story with around 10 - 20 hours of gameplay.<br/>\r\n- Use money in town to hire buddies, buy items, rescue ghosts, upgrade attacks, etc<br/>\r\n- Local two player Co-op..<br/>\r\n- Support Gamepad controller.<br/>\r\n- Unique hand drawn art style.<br/>\r\n- 4 difficulties", "metacritic": null, "released": "2019-05-01", "tba": false, "updated": "2019-08-28T21:46:56", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bcf36aa60fd2b4a8b7a2a3bf92eee38.jpg", "website": "http://www.Beraltors.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phair Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Phair Games"], "esrb_rating": null}