{"id": 306030, "slug": "lovers-of-aether", "name": "Lovers of Aether", "name_original": "Lovers of Aether", "description": "Now is not the time for war. Now is the time for love! The homecoming dance is tonight and you need a date pronto. Spend your school day talking to the students at Aether High. All the original characters from Rivals of Aether are in attendance. It's up to you to decide who you would like to take the the homecoming dance. Get to know each character by talking to them and asking questions. But the school day is not all about lollygagging. You'll have to attend classes, take a pop quiz, give a book presentation and play a game in the computer lab. At the end of the day, will you have a date to the dance?<br/><br/><br/><br/><ul><li>Less words than War and Peace by Leo Tolstoy! Don't spend the rest of your life reading the words in this game.<br/></li><li>Orcane is a pranskter! Do you like pranks? Then you'll love Orcane.<br/></li><li>Use your mouse and click stuff. Or use a touch screen and poke stuff. Or use your eyes and look at stuff. Or use your wallet and buy Rivals of Aether.<br/></li><li>Every character is some kind of animal. Someone told me that is an important feature for a dating game, but I have no idea why.<br/></li><li>Calm relaxing gameplay. Unlike in a fighting game, no one is out to destroy you and make you wish you never picked up a controller. You can talk to characters at your own leisure and enjoy the elaborate lore of Aether High.<br/></li><li>Sylvanos will help you get ripped. Follow his natural path and you too can obtain beautiful longtoids.<br/></li><li>Learn about all the drama that went down last night at the Ding Dong Tree. Who will you believe?<br/></li><li>An amazing soundtrack that will remind you of the fighting game with these characters so maybe you'll buy that game for all your friends after playing this game.</li></ul>", "metacritic": null, "released": "2019-04-01", "tba": false, "updated": "2023-08-16T15:07:57", "background_image": "https://media.rawg.io/media/screenshots/990/99046548acbdd14a9c20f686166eb0d0.jpg", "website": "https://www.rivalsofaether.com/", "rating": 3.19, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 221, "beaten": 12, "toplay": 3, "dropped": 4, "playing": 1}, "playtime": 1, "achievements_count": 15, "ratings_count": 20, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC", "macOS"], "developers": ["Dan Fornace"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Dan Fornace"], "esrb_rating": null}