{"id": 306107, "slug": "the-breakfast-club", "name": "The Breakfast Club", "name_original": "The Breakfast Club", "description": "<strong>The Main Course - </strong><br/>In the main game you can play solo or work together with friends to complete the levels before time runs out! It doesn’t stop there though, online leader boards mean that it’s not good enough to just complete when you can compete! Can you get the quickest time?<br/><br/>Teams of scientists spent at least 5 minutes studying the movement behaviour of inanimate objects and foods to deliver an accurate and interesting way of baking your way to victory.<br/><br/>Each level has a mechanic inspired by the film from which it takes its namesake. Whether avoiding sniper fire in Fry Hard or waiting for the ever changing seasons in Game of Cones, each level will force you to adapt to achieve the quickest time possible.<br/><br/><strong>Recipe For Disaster! - </strong><br/>We never said this was going to be easy! Its try, try and fry again in The Breakfast Club and it is an experience of hardship, if you make a mistake its game over and the level will reset! Communication, delegation and keeping your cool are all important to making sure you gain your well deserved victory.<br/><br/><strong>Who Needs Friends Anyway? - </strong><br/>Whether you play solo or with friends, we’ve got you covered. The more people you have the less time you have to complete the level, because more people makes it easier right? We’ll soon see about that.<br/><br/><strong>FACE/OFF - </strong><br/>Face/off will pit 2 players against each other in quick round based frantic food action to see who comes out on top. Do you try and complete the task as quickly as possible or attempt to interrupt your opponent? Friendships will be torn apart as you cook, jump and roll your way to victory! <br/><br/><strong>More On The Menu! - </strong><br/>It's not just cooking in The Breakfast Club, we have other game modes for when the stress of the main games gets a bit too much. Whether you're navigating your way through checkpoints in Five Second Rule or Slamming, charging and dodging your way to sumo victory in Riceball Rumble there is something for everyone.<br/><br/><strong>No Controller? No Problem - </strong><br/>You can play 1 or 2 players on the same keyboard, and you can mix and match with controllers too!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:50", "background_image": "https://media.rawg.io/media/screenshots/814/8147a09fc2b329b30292367000599cff.jpg", "website": "http://foggybox.co.uk/thebreakfastclub.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 74, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Foggy Box Games"], "genres": ["Casual", "Indie"], "publishers": ["Yogscast"], "esrb_rating": null}