{"id": 306131, "slug": "sheng-li-ji-zheng-yi-victory-is-justice", "name": "胜利即正义! / Victory is justice！", "name_original": "胜利即正义! / Victory is justice！", "description": "[game introduction]<br/><br/>The multi-player online competitive game made by one person is a fast-paced game in less than 5 minutes. It is easy to experience and get started quickly. It is suitable for starting a game during the game queue. Rich scenes and props, grass, poison gas, explosives, portal, map equipment, etc. The game can be free to add a choice of growth direction, unlock equipment rich strategy combination. The global ladder system represents your country. And then there's the faster 1v1 system. If there is any deficiency in the game, please forgive me. I hope I can continue to play the game for you in the future. Thank you.<br/><br/><br/>[introduction to playing method]<br/><br/>1. Each character has an active special skill and a passive skill. You are also free to choose three other active skills.<br/><br/>2. The map will gradually be filled with poisonous gas, from the outside to the inside. The last surviving player wins.<br/><br/>3. Picking up energy balls in the map can improve the level, and various properties will be enhanced after the level is improved.<br/><br/>4. You can choose the growth direction, attack power, health, critical strike, armor, and speed per level.<br/><br/>5. You can turn on your equipment to gain passive skills.<br/><br/>6. You can find unlimited gemstones hidden in the map and gain the ability of gemstones. After collecting all four gemstones, you can gain the ability of ring fingers.<br/><br/>7. Take advantage of the scene elements in the game, such as portal, explosives, grass, poison gas, etc.<br/><br/>8. You can get the mecha energy by killing, and the mecha can summon powerful mecha with energy up to 100%. Mecha can only summon once.<br/><br/>There's also a faster 1v1 system.<br/><br/>Operation introduction<br/>", "metacritic": null, "released": "2019-04-19", "tba": false, "updated": "2019-08-23T12:11:05", "background_image": "https://media.rawg.io/media/screenshots/dcb/dcbb8eb8a64bb4bb671d91caa4b1f730.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["程亦晗个人工作室"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Tengenstudio"], "esrb_rating": null}