{"id": 306168, "slug": "sword-fairy-6", "name": "Sword & Fairy 6", "name_original": "Sword & Fairy 6", "description": "Sword &amp; Fairy 6 is an RPG set in a stunning world of Chinese heroism &amp; fantasy come to life. <br/><br/>Embark on a journey to uncover ancient secrets and slumbering beasts in a world torn by warring factions and deception. Freely explore a world of hidden items and abandoned paths while customizing your party and weapons to your heart’s desire!<br/><br/>Choose the playstyle of your characters and weapons, combining unique attributes and combinations – and even morphing the way your weapon looks and attacks!<br/><br/>Fuse real-time and turn-based combat to one, with options to freely select what suits your playstyle.<br/><br/>Features:<br/><br/>• Explore a world of ancient Chinese mythology!<br/>• A fusion of real-time and turn-based combat, with player customization!<br/>• Use formations &amp; skills to break through enemy defences!<br/>• Seamless transitions from cut scenes to scenario battles!<br/>• Earn reputation by completing quests and finding items!<br/>• Play a variety of mini-games and puzzles scattered through the world!<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1 player<br/>20GB minimum save size<br/>DUALSHOCK®4<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2019-04-02", "tba": false, "updated": "2022-08-11T02:45:56", "background_image": "https://media.rawg.io/media/screenshots/038/0385a1543f0c964c9bd6e29aaef50755.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 596, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": ["EastAsiaSoft"], "genres": [], "publishers": [], "esrb_rating": "Teen"}