{"id": 306237, "slug": "racing-limits", "name": "Racing Limits", "name_original": "Racing Limits", "description": "Racing Limits defines the mobile standards of infinite arcade type racing games. Based on racing and overtaking vehicles both in city and highway traffic, this game features 5 enjoyable modes of racing: carrier mode, infinite mode, against-time mode, free mode and a multiplayer mode. You can choose between one-way and two-way traffic and choose among three times of day periods, namely “Morning”, “Sunset” and “Night”. <br/><br/>There are no limits in Racing Limits but only your racing skills! So drive as fast as you can, make sharp overtakes, do what you cannot do in real life, and finally race to your limits..<br/><br/>FEATURES:<br/><br/>-REALTIME MULTIPLAYER: You can compete with your friends or with other co-racers from around the world in multiplayer mode. This game implements the best real-time multiplayer racing in mobile devices. <br/><br/>-MULTIPLE CAMERA ANGLES: There are 4 camera angles. Helicopter, back, hood and cockpit. All vehicles you can opt to drive come also with high quality interiors to offer the best possible cockpit camera experience. <br/><br/>-VERY SENSITIVE AND EASY CONTROLS: Racing Limits has very easy and sensitive game controls for you to make great fun out of it.<br/><br/>-DRIVING PHYSICS: All cars in Racing Limits have realistic power, torque and gear ratios. The acceleration process and top speeds are based on a complete simulation. Vehicle body weight, gear ratios, engine power and torque ratios are all taken into account.<br/><br/>-LOTS OF VERY HIGH DETAILED VEHICLES:  Lots of vehicles with high levels of graphical detail are waiting for you to drive! The graphical details of cars present in Racing Limits are the bests of its category.<br/><br/><br/>-TUNINGS AND UPGRADES: You can customize your car by changing gear ratios, ride heights and wheel camber angles. You can upgrade your engine, brakes, and handling for better performance. Several body and rim colors are also available for you to choose.<br/><br/>-REALISTIC GRAPHICS: Racing Limits features lots of optimizations on very high detail and realistic graphics. <br/><br/>-LOTS OF RACE EVENTS: You will never get bored while playing Racing Limits. It has lots of carrier mode levels, 3 race tracks, 3 time of day periods and 5 different game modes. <br/><br/>-LANGUAGES: Six languages are currently supported in Racing Limits and lots of others are yet to come in future versions.<br/><br/>FOLLOW US:<br/><br/>* https://www.facebook.com/racinglimitsgame/<br/>* https://twitter.com/RacingLimits<br/>* https://www.youtube.com/channel/UCMThWAiBM_EBZWJ8l3OyCtg", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-07-30T20:24:04", "background_image": "https://media.rawg.io/media/screenshots/6d3/6d3da370f1c9a6ac2f55667a08c37c2e_hKcakgE.jpg", "website": "http://sbkgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Sadik Behlul Kuran", "SBK Games"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Sadik Behlul Kuran"], "esrb_rating": "Everyone"}