{"id": 306266, "slug": "clan-survivor", "name": "Clan Survivor", "name_original": "Clan Survivor", "description": "[Game Introduction]<br/>Assemble your ultimate formation and test your skills in numerous combats.<br/>Battle against legendary BOSS and become a newborn hero of the epic story.<br/><br/>[Game Features]<br/>\t•\tOutstanding Storyline<br/>Immerse yourself into the epic story and explore the vast world along your favorite characters.<br/>\t•\tOpen-fielded PVP battles<br/>Prepare yourself for the battle between players in the open area, eliminate others to claim your victory.<br/>\t•\tIntense Guild war<br/>Cooperate with your guild members and form the unbeatable defense lineup with strategy to overrule other players in the Guild War.<br/>\t•\tTactical formation<br/>Strike your enemy with your most deadly formation. Create the indestructible line-up with tactics and become the ruler of all.<br/>\t•\tFearsome bosses<br/>Unite the whole world as one and face the fearsome world BOSS together. Defeat insidious thieves and claim your prize.<br/>\t•\tUnique and innovative play-mode<br/>Fruit picking, fishing and other more enjoyable in-game content that will give you a whole new gaming experience.<br/>\t•\tHeaven’s Arena<br/>Defeat powerful enemies in the Arena and become the top of the world. Clear hundreds of floor to prove yourself.", "metacritic": null, "released": "2019-03-16", "tba": false, "updated": "2019-10-22T14:21:57", "background_image": "https://media.rawg.io/media/screenshots/38d/38df7f11ac9eb0b5880df43227aa06ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shijiazhuang Shitong Haina Network Technology Co"], "genres": ["RPG"], "publishers": ["Shijiazhuang Shitong Haina Network Technology Co"], "esrb_rating": "Everyone 10+"}