{"id": 306221, "slug": "mission-igi-commando-shooting", "name": "Mission IGI Commando Shooting", "name_original": "Mission IGI Commando Shooting", "description": "Play this most advanced and latest game of bravo unfinished shooter war in various exciting and challenging environments. A multi battlefields gameplay for players in which you have to accomplish various missions by using different ammunition and weapons. Use gun and sniper to attack on opponent army and finish the operation by getting success. Ultimate adventure of secret survival strike mission where you have to enter in various industrial area, fort climate, desert and army bridges to encounter opponent soldier. Clear the area one by one and become professional commando of this modern fury terrorist fps battle. Thrilling concept of critical impossible commando battle where you will experience realistic gameplay having challenging and advanced environments. Focus on your mission and fight against enemy. Different combat helicopters will come to attack on you. You have to survive against opponent military firing and bullets. Move continuously and clear the previous area by killing all counters.<br/><br/>Features:<br/>Multiple exciting environments and characters<br/>Different soldiers &amp; gangsters animations<br/>HD graphics and smooth interface<br/>Different camera angles and control selection<br/>Health adjustment and weapon selection<br/>Thrilling shooting war and gameplay", "metacritic": null, "released": "2019-04-18", "tba": false, "updated": "2019-10-22T14:11:44", "background_image": "https://media.rawg.io/media/screenshots/830/83064665e63044ae2169bec249f1018f_kIf79e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hoang Thi Khich"], "genres": ["Action", "Adventure"], "publishers": ["Hoang Thi Khich"], "esrb_rating": "Mature"}