{"id": 306305, "slug": "puzzle-sky-blox", "name": "Puzzle Sky Blox", "name_original": "Puzzle Sky Blox", "description": "Sky Blox Puzzle is a totally addictive and challenging puzzle game that will keep you hooked for hours! <br/><br/>So easy to play but hard to master, this game will make you crazy!<br/><br/>Your objective is to move the block throughout the level and try to slot it vertically into the yellow tile. <br/><br/>The game boasts 80 levels split into four packs catering for all types - from laid back gamer to dare devil player!<br/>It starts simple enough with the rookie level, but as you progress through the 3 other levels that can be downloaded directly from the game, new elements are introduced and the difficulty increases. <br/> <br/>The game features excellent graphics and can be played and controlled using either the touch or accelerometer!<br/><br/>Sky Blox Puzzle leaves no room for boredom or repetitiveness with a random gameplay function, and also records how many moves it take you to complete a level so you can beat your own personal best!<br/><br/>And what’s more, Sky Blox Puzzle lets you access your own Ipod music library so you can play whenever you wish to your fave tunes!<br/><br/>• Addictive gameplay: easy to play, hard to master!<br/>• Endless hours of fun!<br/>• Fully optimized for the touch screen with both landscape and portrait display<br/>• Two types of controls: touch or accelerometer<br/>• High Quality Graphics<br/>• Four difficulty levels for all types of players<br/>• iPod music library access: listen to your own music while playing the game", "metacritic": null, "released": "2010-07-17", "tba": false, "updated": "2019-10-22T14:24:32", "background_image": "https://media.rawg.io/media/screenshots/c57/c57bd2d03719660710570dee3e652640.jpg", "website": "http://www.amamobile.com/product_SKY_BLOX.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Advanced Mobile Applications"], "genres": ["Action", "Puzzle"], "publishers": ["Advanced Mobile Applications"], "esrb_rating": "Everyone 10+"}