{"id": 306389, "slug": "dig-in-a-dozer-game", "name": "Dig In: A Dozer Game", "name_original": "Dig In: A Dozer Game", "description": "Dig in and operate your bulldozer to get the job done right. As a heavy equipment operator, it’s your job to move earth, dig trenches, scrape dirt, fill in holes, and avoid causing damage on the job site. Experience the earth shaking power of dozer operation once you drop your blade and push mountains of dirt. There’s nothing like moving your bulldozer tracks through the mud to accomplish larger than life tasks on the job site. Complete 9 jobs in a row to perfection to earn the highest rating. Will you crumble under the pressure, or dig in to push through to the finish?<br/><br/>Use the same hand-eye coordination and spatial awareness in this game as the real heavy equipment operators out on the jobsite. Perform well enough and you could be directed to real life operator opportunities in your area!<br/><br/>Dig In: A Dozer Game features:<br/>-Randomly generated levels for enhanced replay-ability.<br/>-Experience increasingly difficult tasks as you progress through the game.<br/>-Dig trenches, move earth, fill in holes, and avoid causing damage.<br/>-Beautiful 3D graphics and sound design.<br/>-Links to real life heavy equipment opportunities.<br/>-Badge earning through the Skill Arcade.<br/><br/>Dig In was developed by the International Union of Operating Engineers Local 66 and Simcoach Games to build awareness of the career opportunities in heavy equipment operation and to connect players to real life apprenticeships.<br/><br/>The Western Pennsylvania Operating Engineers Joint Apprenticeship and Training Program offers 4 year apprenticeship courses to train Heavy Equipment Operators and Heavy Equipment Mechanic Technicians. To learn more about this program and other opportunities visit www.wpaoperators.org<br/><br/>Dig In: A Dozer Game is a Simcoach Skill Arcade app. Explore careers, practice basic job skills and earn badges to gain exposure to careers and training opportunities in your area. To learn more about the Skill Arcade check out www.simcoachgames.com.<br/><br/>Privacy Policy: http://www.simcoachgames.com/privacy", "metacritic": null, "released": "2018-09-01", "tba": false, "updated": "2019-10-22T14:30:04", "background_image": "https://media.rawg.io/media/screenshots/690/690d86dda6f667abf0cdf807bf7152dc_1Gem1p2.jpg", "website": "http://www.simcoachgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Etcetera Edutainment"], "genres": ["Action", "Simulation"], "publishers": ["Etcetera Edutainment"], "esrb_rating": "Everyone 10+"}