{"id": 306352, "slug": "reversi-fun", "name": "Reversi Fun", "name_original": "Reversi Fun", "description": "Reversi is a strategy board game for two players, which is the most popular turn based game, played on an 8×8 board look like chess board. There are sixty-four identical game pieces called disks or discs, which are light (White disk) on one side and dark (Black disk) on the other.<br/><br/>Players have to think and find out the well strategy to take turns placing disks on the board with their assigned color facing up. During a play, any disks of the opponent's color that are in a straight line and bounded by the disk just placed and another disk of the current player's color are turned over to the current player's color.<br/><br/>Try to take turn as more disks as you possible to beat your opponent.<br/><br/>No In-App purchase, no casino feature, free at all, free to learn and challenge.<br/><br/>There are 5 opponents to challenge from easy to hard:<br/>- A Lucky Child: He is just 9 years old. This is the easiest level.<br/>- Pretty Girl: She is beautiful, she is smart, she is 20 years old. This is medium level.<br/>- Gentlemen: He is handsome, he is 39 years old, he is sober. This is hard level.<br/>- Master: He is old, he is the master. You must have patience to play with him.<br/>- Grand Master: He is very old, excellent at reversi.<br/><br/>Special Features only in Reversi Fun:<br/>- You can review your match after playing game.<br/>- You can use unlimited undo.  <br/>- You can allow AI turn first.<br/>- Very Brilliant UI, excellent graphic, magic animation.<br/>- Pretty sound and music, vibrate when the turn is blocked.<br/>- Sign in and view leaderboard.<br/>- Can play with friends in 2 players mode.<br/><br/>Nice time to play Reversi Fun.", "metacritic": null, "released": "2018-06-21", "tba": false, "updated": "2019-10-22T14:26:34", "background_image": "https://media.rawg.io/media/screenshots/6ed/6ed4b763fc3f0a74691dde9ff050dddc_GHc9z4M.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Tuyen Mai"], "genres": ["Arcade", "Board Games"], "publishers": ["Tuyen Mai"], "esrb_rating": "Everyone 10+"}