{"id": 306439, "slug": "sierras-journey-to-health", "name": "Sierra's Journey to Health", "name_original": "Sierra's Journey to Health", "description": "Sierra learns about her liver as she prepares for a transplant!<br/><br/>Sierra is a normal kid in most regards; She likes soccer, hanging out with friends, and music most of all. One thing that is different about Sierra is that her liver is sick, and she needs a transplant. It’s hard to know how different life will be with a new liver. Sierra has so many questions. Will she get to keep playing soccer? What will happen after surgery? Are there other kids in Sierra’s situation? Join Sierra on her journey as she talks to experts and learns about liver transplants.<br/><br/>Sierra’s Journey to Health: Life with a New Liver is the third book in the BiblioTech© series. Other titles include: Cityhacks: In Search of Sleep and Rebound: Beating Concussions.<br/><br/>What is BiblioTech© Adaptive Reader™? <br/><br/>BiblioTech© is a platform for delivering engaging learning experiences through reading and interactive technology. Play games, watch videos, and make choices that impact the story. Along the way, learn real-life science content, including the function of the liver and what happens before, during and after a liver transplant.  Story chapters feature decision points where the reader can decide where to go next, which create 100s of variations on the flow of the story. <br/><br/>Use the digital notebook to store images, illustrations, vocabulary and important science facts. Interactive items include games, interviews with experts, interactive diagrams and fun illustrations that can give you more info that you can add to your notebook. Use your notes to help the main characters complete their quests. The Adaptive Reader™ technology lets the reader choose a reading level, making the story more accessible for learners without changing the narrative or learning goals.<br/><br/>Features include:<br/><br/>Unique and Interactive Experiences<br/>-Make choices to influence the storyline<br/>-Play fun games and puzzles<br/>-Watch animations of biological processes <br/>-Interact with colorful anatomical diagrams<br/><br/>Easy-to-use Reading and Note Taking Tools<br/>-Adjust reading level as you go<br/>-Turn pages with a swipe<br/>-Take notes while you read <br/>-Tap highlighted words for instant definitions<br/>-Automatically save your progress as you read<br/><br/>Privacy Policy: http://www.simcoachgames.com/privacy.html", "metacritic": null, "released": "2018-05-12", "tba": false, "updated": "2019-10-22T14:33:20", "background_image": "https://media.rawg.io/media/screenshots/b5d/b5d16c4ce6cc2588f3f3b31ff476eae8_C8nRMFB.jpg", "website": "http://thepartnershipineducation.com/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Etcetera Edutainment"], "genres": ["Adventure", "RPG"], "publishers": ["Etcetera Edutainment"], "esrb_rating": "Everyone 10+"}