{"id": 306405, "slug": "construction-crane-signals", "name": "Construction Crane Signals", "name_original": "Construction Crane Signals", "description": "Heavy equipment operators aren’t the only ones who need to know proper hand signals for construction. The Construction Crane Signals tool is for all construction trades to practice their understanding of mobile crane hand signals.<br/><br/>In this 23 question quiz, players must choose the appropriate hand signal animation based on the on-screen prompt. Choose correctly, and see the crane complete the task successfully. Choose incorrectly, and witness a disastrous accident. Receive feedback on the signals you missed and review them in the reference section of the application. Players who earn a perfect score on the quiz can generate a certificate of completion.<br/><br/>Construction Crane Signals:<br/>-Quiz mode featuring 23 different hand signals plus common wrong signals<br/>-High quality animations of each hand signal<br/>-Reference section to review each signal individually<br/>-Switch perspectives between the signal person’s point of view and the operator’s point of view<br/>-Certificate of completion for scoring 100%<br/><br/>Construction Crane Signals engages players in identifying and practicing their knowledge of the standard mobile crane hand signals, and was made possible by the generous contributions of the International Union of Operating Engineers, Local 66 and the Constructors Association of Western Pennsylvania.<br/><br/>The certificate in the app recognizes the player’s in-game performance and has no merit upon real life aptitude. See OSHA site for signal person qualification requirements: https://www.osha.gov/Publications/cranes-signal-person-factsheet.html<br/><br/>Privacy Policy: http://www.simcoachgames.com/privacy", "metacritic": null, "released": "2019-01-31", "tba": false, "updated": "2019-10-22T14:31:19", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5d0c5e121ffdbb0cee21e1e5bddc1f5_RrTVjkf.jpg", "website": "https://www.simcoachgames.com/about/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Etcetera Edutainment"], "genres": [], "publishers": ["Etcetera Edutainment"], "esrb_rating": "Everyone 10+"}