{"id": 306552, "slug": "baby-redemption-itch-shotgun-anaconda", "name": "Baby Redemption (itch) (Shotgun Anaconda)", "name_original": "Baby Redemption (itch) (Shotgun Anaconda)", "description": "<p>Baby Redemption is a high paced rogue-like shooter where you have to save babies in glorious intense slow-motion action. Weapons, bullets, babies and bullet-time. What more do you need?</p>\n<p>Gameplay comes first so all of the focus has been on making the guns and moment-to-moment action feel good. A typical run starts you off in your house, where you select your weapon from your gun rack, buy temporary upgrades and then you leave in your car. When you're ready you select how many runs you want to do back to back, the longer you go the more rewards you get and the chance of finding a kidnapped Baby increases. Beware though, enemies get tougher and you might bump into one of the games bosses.<br/><br/><strong>Highlights</strong><br/></p>\n<ul><li>Randomly generated levels - Each run presents a new layout and challenge created from a big list of rooms. </li><li>Guns on guns - Big list of guns, each fine tuned to present a different way of play.</li><li>Upgrades - Beating a wave gives you a random upgrade that tweaks your playstyle.</li><li>Great Juicy action - Each gun sound effect is punchy and tweaked by hand to give a satisfying knock when you press that shoot button</li></ul>\n<p>Baby Redemption is made by me, Shotgun Anaconda, a one-man band with a indie-game dream. I truly hope you enjoy my little project, if you have any questions or feedback feel free to tweet or email me.</p>", "metacritic": null, "released": "2019-04-04", "tba": false, "updated": "2019-04-05T05:18:20", "background_image": "https://media.rawg.io/media/screenshots/55c/55cc63d5e020edc8520c43e97c161e43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shotgun Anaconda"], "genres": [], "publishers": [], "esrb_rating": null}