{"id": 306551, "slug": "cursed-gem", "name": "Cursed Gem", "name_original": "Cursed Gem", "description": "You are Oliver, and you want to give a diamond ring to marry your beloved, Silvia. But you have no money, so you decide to explore a mysterious cave, an old diamond mine.<br/><br/><br/><br/>You are trapped inside, and a strange curse prevents deadly traps from taking your life ... You are immortal! but by not being able to leave the cave you will be condemned to die eternally.<br/><br/>Your mission will be to discover the secret behind this curse, deciphering the runic language thanks to the help of Jerry, your skull friend. Get the big diamond, break the curse and escape from the cave to return with Silvia.<br/><h3>Game Features</h3><ul><li> <strong>Single player adventure</strong> marked by powerful challenge, deadly traps and precision platforms.<br/></li><li> ​<strong>Explore</strong> and overcome a huge cave with <strong>more than 10 levels</strong>.<br/></li><li> ​<strong>More than 80 rooms</strong> with different designs: traps, puzzles, impossible jumps ...<br/></li><li> <strong>​Different difficulty modes</strong> that change the behavior of checkpoints.<br/></li><li> ​A <strong>\"nightmare\"</strong> difficulty mode: Play the entire adventure in the dark, with only a light helmet.<br/></li><li> <strong>​Exchange messages</strong> on the walls with other players. In true Dark Souls style.<br/></li><li> ​Decipher a <strong>cryptic runic language</strong> that you will find on the walls of the cave.<br/></li><li> <strong>​12 skins</strong> to customize your player. One of them being a well-known gentleman...<br/></li><li> ​<strong>55 achievements</strong> that will make you feel good about yourself.<br/></li><li> ​Soundtrack composed by Horror Pen &amp; Shote.</li></ul><br/>The controls are simple and accessible: Jump, hold on to the walls, slide. Push boxes and stones, press buttons to solve puzzles, use physics to your advantage. Every death teaches a lesson.<br/><h3>Some in-game pictures</h3><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2019-04-04", "tba": false, "updated": "2020-08-27T18:00:02", "background_image": "https://media.rawg.io/media/screenshots/9a1/9a1e094f62a84aa82c69c3d4e55e1282.jpg", "website": "https://cursedgemgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 55, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "Web", "PC"], "developers": ["aikoncwd"], "genres": ["Action", "Adventure", "Casual", "Indie", "Platformer"], "publishers": ["Vega Games"], "esrb_rating": null}