{"id": 306758, "slug": "lovelia", "name": "Lovelia", "name_original": "Lovelia", "description": "<p> <strong>Olivia (Playable character):</strong><br/></p>\n<p>Olivia had moved to Lovelia for her work at a Halloween Store. She likes Black Cats, Candy/Sweets and Halloween Decorations. In her free time she likes to sleep, play video games and go for a walk. On the outside she seems cold, but on the inside has a warm heart.</p>\n\n<p> <strong>Stephanie:</strong><br/></p>\n<p>Stephanie work at the local Pet Store. She likes Animals, Nature and Walks in the Park. In her free time she liked to go to the Park, admire the scenery and animals that are sometimes there.  Stephanie is a very bubbly and cheerful being, always giving off positive vibes.</p>\n\n<p> <strong>Ian:</strong><br/></p>\n<p>Ian is a Film Student at the local University. He likes Explosion Visual Effects, Coffee and playing Video Games. Ian currently doesn't have much free time due to working on his final project for his studies, but normally he would play lots of Video Games and eat Junk Food. He is also Olivia's childhood friend.</p>\n\n<p> <strong>Alexis:</strong><br/></p>\n<p>Alexis works as a Cop at the town's Mall. She likes Justice, Doughnuts and Night time  visits to the Beach. She works most of the time, but when she is not working you can find her at the Bar. Alexis is normally rather serious and enforces the rules, but deep down she had a soft and feminine side.</p>\n\n<p> <strong>Chad:</strong><br/></p>\n<p>Chad is a Social Media Star who lives in the city. He likes Partying, Boxing and Causing mischief with his haters. When he is not filming a videos for his fans, he can be found wondering around different parts of the town. Chad is normally very cocky and smug, but is very dedicated to his fans.</p>\n\n<p> <strong>Game created by Sam Wilson (Sampai)</strong></p>\n\n<p><strong>Follow me on Tumblr and Instagram</strong><br/>Game Development Blog: https://sampai-gamedev.tumblr.com/<br/>Instagram: https://www.instagram.com/sampai_gamedev/</p>\n\n<p><strong>Future Updates:</strong><br/>-Music<br/>-Custom UI<br/>-Voice Acting<br/>-More Characters<br/>-More Story<br/></p>\n\n<p>Thank you for viewing my game page!</p>", "metacritic": null, "released": "2019-04-03", "tba": false, "updated": "2019-04-05T06:03:33", "background_image": "https://media.rawg.io/media/screenshots/572/5720f5015464b6d9490a13e988c135bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ItsSampai"], "genres": [], "publishers": [], "esrb_rating": null}