{"id": 306773, "slug": "evolution-spore-multiplayer", "name": "Evolution Spore - Multiplayer", "name_original": "Evolution Spore - Multiplayer", "description": "<p>We develop a multiplayer game where you can play for the cell and be able to improve it in the editor. The game will have several game modes and rating system.<br/></p>\r\nWhat is the main gameplay\r\n<p>You have a cage, your task during the game is to eat other cells. Collect cells and evolve into a new form of life. In the game you will have a full editor in which you can make your new cell. Modify it as you want.</p>\n<p>We are developing a multiplayer game with scalable online. The game will be cross-platform with the support of such systems: Windows, Mac, Linux, Ios, Android. The game will also be cross-platform multiplayer. You can play with friends from any device.</p>\r\nWhat We Need &amp; What You Get\r\n<p>Your financial support will help us finish the game faster, create more game content and pay for game servers. For help with financial support, we will provide you with unique features and perks.</p>\n<p>If the amount of funds will not reach our goal, we still continue to develop the game. Our task is to make an interesting and exciting game that you could play yourself.</p>\n\n<p><strong>How many players will the game session be?</strong><br/>We aim for a high-performance solution that is easy to scale.</p>\n<p><strong>What game engine are you using?</strong><br/>Unity - The game will be written taking into account the entity component system to receive high-performance code in the game.</p>", "metacritic": null, "released": "2019-04-03", "tba": false, "updated": "2019-04-05T06:06:35", "background_image": "https://media.rawg.io/media/screenshots/f57/f570d4b2cb3d64836058dbec1e64088d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["appbomb"], "genres": [], "publishers": [], "esrb_rating": null}