{"id": 306989, "slug": "potato-thriller-steamed-potato-edition", "name": "Potato Thriller Steamed Potato Edition", "name_original": "Potato Thriller Steamed Potato Edition", "description": "<p>After receiving an anonymous tip about the whereabouts of the Potato Man, bounty hunting team Quindalin and Dexter depart on a mission to put an end to the Potato Man once and for all.<br/></p>\n<p>\n<strong>You'll get to...</strong></p>\n<ul><li>Laugh.</li><li>Cry.</li><li>Fall in love.</li><li>Talk to a hot dog.</li><li>Get deep-fried.</li></ul>\n<p>After about 2 years of being a Steam exclusive game, <strong>Potato Thriller Steamed Potato Edition</strong> has finally come to itch.io! The difference between this version and the classic version of the game is that the steamed potato edition includes extra bonus content, many new secrets and easter eggs hidden all over the place, smart difficulty feature and many more enhancements.<br/></p>\n<p>Essentially this is the director's cut version of Potato Thriller and the recommended version to get. The Steamed Potato Edition originally launched exclusively on Steam on Jun 22, 2016 as a special thank you to the Steam community for voting and for helping the game pass through the Steam Greenlight process back before it was replaced by Steam Direct. It's 2019 now and I want this version of the game to be available to more people and live on platforms outside of just Steam.</p>\n<p>The game is awkward and cringy, especially the voice acting I did myself. Sometimes I look back at this game and wonder, what was I thinking when I decided to make this? I remember watching many youtubers and streamers play this game and I would cringe each time I heard my own voice come up. The gameplay is wonky and the story I came up with is... \"interesting\". Despite all this, I am still and will always be super proud of this game and I wouldn't of made it any other way. I love looking back at it and seeing how far I have come since. Hope you enjoy!</p>\n<p><strong>NOTE: </strong>This version of the game is only available for <strong>Windows.</strong></p>\n<p><em>– Potato Thriller –<br/>A Samer Khatib Game<br/>Snowconesolid Productions<br/>Samer Khatib (Snowconesolid Productions) LLC ©2016</em></p>", "metacritic": null, "released": "2019-03-31", "tba": false, "updated": "2019-04-05T06:53:48", "background_image": "https://media.rawg.io/media/screenshots/ce4/ce431e5e7e6d3b96fda9ba75ef384bb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["snowconesolid"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}