{"id": 307171, "slug": "adecke-cards-games-deluxe", "name": "Adecke - Cards Games Deluxe", "name_original": "Adecke - Cards Games Deluxe", "description": "Realistic cards games with emotions close to reality.<br/>\n<br/>\r\nAdecke include six cards games. Cultural games played around china, europe and america since the old ages.<br/>\r\nThe six cards games can be played with differents variations and options. Adecke contain solo games. All games is accesible at anytime in the main menu.<br/>\r\nYou start the game and play. Very simple and quick. A good time, playing cards games, in front of a table, within a couple of seconds.<br/>\r\nThe six selected games contain differents kind of gameplay.  The best of every style, and the best of all ludic cards games. <br/>\n<br/>\r\nThe Bull :  Also named as the \"150\". The Bull is a cooperative game where you need to gather points previously bidded with your partner. You have to deal with two opponents. The goal is to get a total of 500 points (optionaly 300 pts). If you bid \"The Bull\" and get all points in a round, you win 500 pts. It's an all-in case where a tiny mistake can make you plunge under even. or loose the game.<br/>\n<br/>\r\nThe Whist : The Whist  a.k.a \"9\" is  a free for all game. You start at 9 points. Every time you win a turn, give you the opportunity to reach 0 pts. Trump cards must be a big part of your hand. Better be ready, even with your assets, your opponents keep cards that will make you fall apart.<br/>\n<br/>\r\nThe Ass-Hole : The Ass-Hole game is a free for all party game. You have to be smart and play cards in the right time to take the seat of the president. The last player with an empty hand is the ass-hole. Something you don't want to be.<br/>\n<br/>\r\nThe Cribage : Every erudit know the Cribbage. It's a mathematic game where you need to find the way to get a good amount of points in a turn. Be smart, find tricks, and get over your opponent. <br/>\n<br/>\r\nThe Hockey : This is the memory cards games where you need to remember played cards. You have to keep in hand the cards that make you win the game  Be  patient, find a hole, do the pass and GOALLLL!<br/>\n<br/>\r\nThe Speed : You last game is a real-time playing cards. Each player must play as quickly as possible. Play cards fast, make your opponent stunt and win the game.  <br/>\n<br/>\n<br/>\r\nCribbage<br/>\r\nMilitary Whist (9)<br/>\r\nBull (150)<br/>\r\nPresident<br/>\r\nHockey<br/>\r\nSpeed<br/>\n<br/>\r\nMany features :<br/>\n<br/>\r\nGameplay :<br/>\n<br/>\r\nMouse clicking or Mouse sliding on play.<br/>\r\nResizable cards.<br/>\r\nRealistic games layouts.<br/>\r\nDynamic cards positioniing.<br/>\n<br/>\r\nVisuals : (All content is available at anytime in the extra section)<br/>\n<br/>\r\nCards Decks<br/>\r\nTables<br/>\r\nFloors<br/>\r\nAvatars<br/>\n<br/>\r\nMore : <br/>\n<br/>\r\nMany opponents<br/>\r\nGames count<br/>\r\nUpdates", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:45", "background_image": "https://media.rawg.io/media/screenshots/796/7964ca2a3e03635d750716f91c77ad5a.jpg", "website": "https://www.facebook.com/jeuxadecke/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Philippe Pelchat"], "genres": ["Casual"], "publishers": ["Philippe Pelchat"], "esrb_rating": null}