{"id": 307133, "slug": "reflow", "name": "reflow", "name_original": "reflow", "description": "<p>reflow is an Augmented Reality game and difficult to explain in words, so just check out our trailer at: http://xymatic.com/reflow</p>\n<p>reflow is a new way to play with your iDevice and the world! Using the realtime camera image, the game abstracts your environment into a black and white level. Let virtual fluids flow on everything that meets your cameras eye. Use whatever you like - friends, objects, pets, strangers - to solve the given challenges in the most unique way. Play wherever you want - parties, bars, parks, schools, the office - do it alone or collaboratively with friends and colleges. Share your solution pics online via twitter, facebook, email and other services or compete for highscores with players worldwide using Game Center.</p>\n<p>Just give it a shot: Level with your world! Now!</p>\n<p>While playing reflow you have to change the way you think about playing a computer game. The goal is to guide the flow of virtual colored streams, emerging from sources. They have to flow into similar colored sinks, while possibly being altered on the way by color changers. The level is a black and white abstraction of the real world. You have to alter the camera angle and/or scenery to solve the level - there is no pre-canned solution.</p>\n<p>selected Features:<br />\n- Share your solutions via twitter, facebook, email and other services.<br />\n- Compete with players from all over the world using Game Center.<br />\n- 40 challenges are waiting for your world, your skills and your aesthetic perception.<br />\n- Full control over image parameters using multi-touch.<br />\n- Particle based flow that interacts in realtime and adheres to realworld gravity.<br />\n- Colors and sounds.</p>\n<p>For hints, tips and support check the app support page (http://xymatic.com/reflow-feedback).</p>\n<p>If you experience problems with the app: We want to help you! Just send us a mail to support@xymatic.com</p>", "metacritic": null, "released": "2011-07-09", "tba": false, "updated": "2019-10-22T13:48:57", "background_image": "https://media.rawg.io/media/games/815/815f544c640568370d7e3a19adf98dd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}