{"id": 307256, "slug": "touch-pianist-tap-in-rhythm-and-perform-your-favou", "name": "Touch Pianist - Tap in Rhythm and Perform Your Favourite Music", "name_original": "Touch Pianist - Tap in Rhythm and Perform Your Favourite Music", "description": "Tap on the screen and magically perform beautiful music!<br/><br/>Touch Pianist is a musical toy / instrument that allows the user to perform hard-to-play classical piano music favorites (from composers like Beethoven, Mozart, Bach, Satie, Debussy to name a few) just by tapping the rhythm of the piece's particular sound events on a computer keyboard or a touch screen. <br/><br/>It also provides live visualisation of the pieces that are being performed. There is no score keeping, the user is free to perform the music in any way they wish. The premise is that it is really fun to perform a piece you know well, exactly like you feel it with so little effort.<br/><br/>Touch Pianist has CoreMIDI support so you can use your favorite piano / sound plug-in in your computer as a sound source if you wish.<br/><br/>Some of the highlights from the included pieces:<br/><br/>Debussy - Clair de Lune<br/>Beethoven - Moonlight Sonata (All movements)<br/>Erik Satie - Gymnopédies (1, 2 and 3)<br/>Chopin - Most popular pieces, and all 24 preludes<br/>Bach - Well Tempered Klavier Book 1 (All preludes and fugues)<br/>Beethoven - Pathetique Sonata (All movements)<br/><br/>Rachmaninoff, Liszt, Brahms, Schumann and many, many more! Playing them is extremely fun, and no prior musical skill is needed. Give it a try and you'll see.", "metacritic": null, "released": "2015-05-07", "tba": false, "updated": "2021-03-05T05:58:48", "background_image": "https://media.rawg.io/media/screenshots/965/9657b038f45b2efe3919bc04a3f8e013.jpg", "website": "http://touchpianist.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EarSlap"], "genres": [], "publishers": ["Batuhan Bozkurt"], "esrb_rating": null}