{"id": 307221, "slug": "grisaia-phantom-trigger-vol6", "name": "Grisaia Phantom Trigger Vol.6", "name_original": "Grisaia Phantom Trigger Vol.6", "description": "\"Grisaia: Phantom Trigger\" is a visual novel. More specifically, it is a kinetic novel, without any branching routes. Returning character artist Akio Watanabe and writer Ryuta Fujisaki bring you the latest installment in the acclaimed Grisaia series, \"Grisaia: Phantom Trigger\".<br/>\n<br/>\r\nStory:<br/>\r\nAoi Haruto is a handler at Mihama Academy. To him, today is just another normal day, but the others can't help but notice that his behaviour seems a bit unusual. Seeing Haruto like this spreads a feeling of unease among the students of class A.<br/>\r\nIt's the day when Haruto, along with Sengoku Ichiru, Ukawa Chihiro, and the other members of the first generation of Phantom Triggers go to visit the grave of one of their old friends, located deep in the mountains.<br/>\n<br/>\r\nThere sleeps Haruto's master - Aoi.<br/>\n<br/>\r\nThe group makes this journey every year, and their car is filled with playful banter at first. But as they approach their destination, they're overcome by silence and regret, as the memories of the life of Aoi - a young woman so vicious, and yet so pure - return once more.<br/>\n<br/>\r\n\"If ya don't feel upset 'bout yer loss, yer better off quittin'. If ya don't enjoy the experience you've gained today, then yer not suited for the job.\"<br/>\r\n\"Can't ya say that 'bout almost anythin', though? It all depends on the person an' their values.\"<br/>\r\n\"He's just too nice - he's not suited to be a killer...\"<br/>\r\n\"Hey! Haruto, stay with me! Ya really gonna die on me here?\"<br/>\r\n\"Can I have my smokes back now, Master...?\"<br/>\n<br/>\r\nLife is passed from one generation to the next.<br/>\n<br/>\r\n\"All matter eventually breaks down, and all life eventually dies. Entropy - that's all there is to it.\"<br/>\n<br/>\r\nWhat events led to Aoi's final moments in this world...?", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:41", "background_image": "https://media.rawg.io/media/screenshots/46a/46a67a1c7ff68e243ca3b550783dacc7.jpg", "website": "http://grisaia-pt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 13}, "playtime": 4, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 417, "game_series_count": 18, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontwing"], "genres": ["Adventure", "Casual"], "publishers": ["Frontwing USA"], "esrb_rating": null}