{"id": 307236, "slug": "dinosaur-hunter-jurassic-jungle", "name": "Dinosaur Hunter: Jurassic Jungle", "name_original": "Dinosaur Hunter: Jurassic Jungle", "description": "Face fearsome dinosaurs in the Jurassic Jungle where it's kill or be killed.<br/><br/>This epic first person shooter takes you away to a survival settings where you must survive a series of missions to save yourself and others in the Jungle.<br/>Complete the missions and save your friends, or play survival and see if you can survive the longest and kill the most dinosaurs.<br/><br/>EPIC WEAPONS<br/>Every level adds a new weapon all with realistic bullets, reloading and shooting animations.<br/>Defend yourself with machine guns, pistols, crossbows, rockets, bombs, grenades and more.<br/><br/>AWESOME LEVELS<br/>Play until you've killed more dinosaurs than anyone else of follow along the story including helping people escape, setting bombs, night time missions,<br/>find helicopter escape zones, sniper missions and more.<br/>The gameplay becomes harder the more you play and the dinosaurs more aggressive.<br/><br/>SURVIVAL MODE<br/>How long can you survive against the dinosaurs and can you kill more than anyone else? Can you beat the high score list? <br/><br/>REALISTIC DINOSARUS<br/>Dinosaurs become aware of your presence and will attack or hunt you down or even run away. Can you defeat them all?<br/> <br/>SUPER GRAPHICS<br/>Immerse yourself in this high quality graphics environment.<br/><br/>FREE TO PLAY<br/>Nothing to purchase, play for free.", "metacritic": null, "released": "2016-01-07", "tba": false, "updated": "2019-10-22T14:36:46", "background_image": "https://media.rawg.io/media/screenshots/40d/40df1ba22589e3a1f1799ff528bf5d95_ZGBgksK.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobile-Apps"], "genres": ["Action", "Simulation"], "publishers": ["mobile apps"], "esrb_rating": null}