{"id": 307302, "slug": "dig-that-gold", "name": "Dig That Gold", "name_original": "Dig That Gold", "description": "Can you step up to the challenge, solve puzzles and escape the mines?  <br/>REAL 24k GOLD REWARDS await those that can!<br/><br/>* Use quick thinking and strategy - get out with the all the gold before you run out of air!<br/>* Hundreds of mines to solve, secret levels to discover and bonus mini games!<br/>* Use fun Power-ups to blast your way out of tricky situations!<br/>* Check in daily to get extra Power-ups and coins <br/>* Play against your Facebook friends and compete in Global Leaderboards!<br/><br/>Join us at www.facebook.com/digthatgold/<br/><br/><br/>GAME RULES<br/>1. These rules form part of the terms of use. By downloading and playing the game you confirm that you agree to, and accept these terms, including these rules.<br/><br/>2. The aim of the game is to collect nuggets of virtual gold (Virtual Gold) by “Mining” (finding and breaking blocks of which some contain nuggets of Virtual Gold, and reaching the mine exit before your air or energy run out), and “Panning” (separating worthless dirt nuggets from the virtual gold by swiping away lines from the edge of a virtual gold pan). These gameplay types are distributed through an overarching game environment.<br/><br/>3. Virtual Gold (a) is merely a measurement of score within the gameplay and has no monetary value. (b) is never an asset or property of the player. (c) does not constitute, represent or promise any exchange or redemption into perceived real world value.<br/><br/>4. We reserve the right to change the appearance or mechanics of the Game, including the way in which Virtual Gold is allocated and collected.<br/><br/>5. The Game offers in-app purchases such as tools, keys and outfits (Virtual Goods) that you may use within the Game. These Virtual Goods have no monetary value beyond the scope of the Game, and the Terms of Purchase.<br/><br/>6. Based upon your progress within the game, including the amount of Virtual Gold you have managed to collect, and your adherence to the Game’s rules, we may at our discretion award you a bar of physical Real 24K Gold Bar (Award Gold). Accepting this award will reset the amount of Virtual Gold you have collected. You will then be able to continue to play with your existing in-Game inventory and progress.<br/><br/>7. You will see an in-game progress bar to indicate your progress towards the award target. However, this progress bar is only an approximate indication; the amount of Virtual Gold needed to reach your Award Gold may vary from time to time based on a number of factors including the number of people playing the game and the fluctuating price of real world gold. However, we make every effort to ensure that the offers of Award Gold operate fairly between all players.<br/><br/>8. If you accept an offer of Award Gold, then the provision of Award Gold will be processed by Global Exchange Platform Ltd (company no. 09460371) of 20-22 Wenlock road, London, N1 7GU, United Kingdom (www.globalexchangeplatform.com). You will need to accept the terms and privacy policy of Global Exchange Platform Ltd, and create an account in order to receive your Award Gold. Global Exchange Platform Ltd will charge a nominal fee to create an account (www.globalexchangeplatform.com/terms).<br/><br/>9. If you cease to be entitled to use the Game in any of the circumstances set out in the terms of use, then you shall also forfeit any Virtual Gold or Award Gold that you have collected and any Virtual Goods you have acquired and shall not be entitled to any refund or compensation.<br/><br/>10. If you (a) use (or attempt to use) any bots, third party software or any similar methods to accumulate Virtual Gold, acquire Virtual Goods or otherwise participate in the Game, or (b) hack, alter (or attempt to hack or alter) the Game in any way, then we may suspend or terminate your account and/or remove from your account any Virtual Gold and any Virtual Goods.<br/><br/>For full T&amp;Cs. Please see www.digthatgold.com/terms or contact feedback@digthatgold.com<br/><br/>Apple is neither a sponsor nor an award provider for 'Dig That Gold'. No Apple products are provided as awards from the Game.", "metacritic": null, "released": "2019-03-13", "tba": false, "updated": "2019-07-01T02:08:36", "background_image": "https://media.rawg.io/media/screenshots/001/00154a8887961baee92a95c639a48ef0_LAF2Wlk.jpg", "website": "http://digthatgold.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayStack"], "genres": ["Adventure", "Puzzle"], "publishers": ["PlayStack"], "esrb_rating": null}