{"id": 307357, "slug": "valkyrie-anatomia-the-origin", "name": "VALKYRIE ANATOMIA -The Origin", "name_original": "VALKYRIE ANATOMIA -The Origin", "description": "A brand-new RPG from Square Enix<br/>\"Battlemaiden Valkyrie, the origin story\"<br/> <br/>◇Story◇<br/>The story begins in death... <br/><br/>The main character, Battlemaiden Lenneth Valkyrie, is preparing for the final war of the gods, Ragnarok. As ordered by Odin, the lord of the gods, Lenneth chooses the souls of heroes to become Einherjar. In their final moments, right before death fully engulfs their souls, they are brought to Valhalla and made to fight in the war of gods.<br/><br/>In this tragedy of men and gods, the Valkyrie grows evermore fond of mortals, and their way of life... <br/><br/>Will you be able to choose the right future?<br/><br/>◇Newly published RPG by SQUARE ENIX◇<br/><br/>\"Battlemaiden Valkyrie, the origin story\"<br/><br/>A fantasy RPG inspired by Norse-mythology where the entwined fate of gods and mankind is told using innovative scenario-based game design.<br/><br/>The battle system remains faithful to the familiar style loved by fans of the series and feels intuitive.<br/><br/> ◇3 Things About the Game◇<br/>1.  Immerse yourself in the world of Norse-mythology - Get excited for creative and original scenarios!<br/>2.  Get big critical hits in using a unique combo-driven battle style!<br/>3.  The best BGM the industry has to offer breathes life into the game!<br/><br/>The scenarios, battle, and BGM combine to forge a superlative immersive experience.<br/><br/><br/>◇Characters◇<br/>Odin, Lenneth, Frey, Silmeria, Arngrim rejoins the battle!<br/>Familiar characters from ”Valkyrie Profile”,<br/>crossovers and completely new characters join the fray!<br/><br/>Recurring characters have received a new and fresh design!<br/><br/>Official Facebook Page: https://www.facebook.com/ValkyrieAnatomiaEN/<br/>Japanese Official Website: http://www.valkyrieanatomia.com/", "metacritic": null, "released": "2019-04-04", "tba": false, "updated": "2019-07-30T04:02:18", "background_image": "https://media.rawg.io/media/screenshots/a88/a8813967409760982e6ec41bcf9c1880_ISnseIu.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 4, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WonderPlanet"], "genres": ["RPG"], "publishers": ["WonderPlanet"], "esrb_rating": null}