{"id": 307376, "slug": "word-bright-word-game-puzzle", "name": "Word Bright – Word game puzzle", "name_original": "Word Bright – Word game puzzle", "description": "We all want to improve our ability to memorize for long periods. Therefore<br/>training your brain is an important task for all of us.<br/>In our complicated life, which contains career, family, house caring, and more<br/>duties, we can easily forget important things, and training your brain helps you<br/>achieve your goals more efficiently.<br/>One of the best ways to train your brain and improve your IQ is to play word<br/>games every day and you will feel the change in a short time.<br/>Word Bright is a completely new and exciting word game waiting for you to take<br/>on the challenges and prove your brain skills through word puzzles.<br/>Engage with word play - Word Bright will train your brain using fun and exciting<br/>word puzzles including new game-play features and unique levels, the game is a<br/>great brainteaser with new challenges for you to explore.<br/>Play now free, simply build the words and earn coins!<br/>How to play?<br/>- Watch our tutorial to get a feel for the game<br/>- Swipe the letters according to the possible word you think it should be.<br/>- Any word is related to a specific theme: animals, weather, human body, food,<br/>beach, kitchen, fruits, transport, drinks, desserts, space, furniture, travel,<br/>occupations, safari, the sea, vegetables, clothing, school, sport, and restaurant.<br/>Desert. Movies, wild west, party, water, shopping, coffee, river, in the city, sound,<br/><br/>herbs &amp; spices, books, fishing, accessories, insects, hotels, games and flight –<br/>THE POSSEBILITES ARE ENDLESS!<br/>- Find hidden words and advance to more difficult levels as you make progress.<br/>- At our shop you can shop for more coins and advance faster in the game.<br/>- Feeling stuck? At any moment of the word play game, you can ask a friend for<br/>help with a click of a button.<br/><br/>Features:<br/>- Simple, easy, and addictive game-play using word puzzles<br/>- The game includes cool effects and music<br/>- Daily spin of a roulette that make you earn free coins<br/>- Challenge yourself, train your brain and improve your IQ<br/>- Tons of levels to play through, we are adding levels all the time<br/>- Difficulty increases as you progress through the levels<br/>- No timers! Play at your own pace!<br/>- Applicable to all ages!<br/>- Daily rewards<br/>- Play OFFLINE anytime and anywhere<br/>- Improve your vocabulary and brain power<br/>- Outstanding level design and stunning graphics<br/>- Ask your friends for help if you get stuck!<br/>- Sharpen your perception<br/><br/>So what are you waiting for?<br/>Download Word Bright NOW to begin training your brain and become a word<br/>puzzle master!<br/>See you at the game!", "metacritic": null, "released": "2018-08-06", "tba": false, "updated": "2019-10-22T14:36:52", "background_image": "https://media.rawg.io/media/screenshots/7db/7dbb29b99f04574404c7e76294363a57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brightly"], "genres": ["Puzzle"], "publishers": ["BRIGHTLY"], "esrb_rating": "Teen"}