{"id": 307362, "slug": "mr-billionaire", "name": "Mr. Billionaire", "name_original": "Mr. Billionaire", "description": "Welcome to Mr. Billionaire! Ready to experience the life of the rich? Here you are able to establish your business empire and compete with others!<br/>How about becoming a new king in the financial realm by managing enterprises of multiple industries? Ever wish the gifted characters to be recruited into your companies and distributed of luxury cars? Eager to promote yourself from a city's newcomer to a international legend? You can achieve all the above in Mr. Billionaire!<br/><br/>Features:<br/>1. Leisure choice: Earn big money by a few taps every day!<br/>2. Hire Talents: Recruit talented individuals to work for you in your business.<br/>3. Build Your Empire: Establish a commercial empire of your own via starting business in multiple industries such as food, film, railway and bank.<br/>4. Commercial Wars: Fight with other billionaires in the field without gunpowder and take more spots in trade centers around the globe!<br/>5. Salon &amp; Assistant: Meet your assistants in salon and talk them into helping you achieve bigger goals!<br/>6. Interact with others: Build the strongest chamber of commerce and help each other, or spread rumors to your competitors, causing them to earn less. It’s all up to you!<br/>Contact us: bill@movga.com<br/>Facebook page: https://www.facebook.com/movgabillionaire/", "metacritic": null, "released": "2019-04-05", "tba": false, "updated": "2019-10-22T14:36:51", "background_image": "https://media.rawg.io/media/screenshots/409/4092dee0bb0f5236992619430327360a.jpg", "website": "https://www.facebook.com/Mr-Billionaire-1024986644369276", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xiaofei XiaofeiZhao"], "genres": ["Strategy", "Simulation"], "publishers": ["Xiaofei XiaofeiZhao"], "esrb_rating": "Everyone 10+"}