{"id": 307380, "slug": "mining-trucker-parking-simulator-a-real-digger-con", "name": "Mining Trucker Parking Simulator a Real Digger Construction Truck Car Park Racing Games", "name_original": "Mining Trucker Parking Simulator a Real Digger Construction Truck Car Park Racing Games", "description": "Welcome back to The Quarry Pit! <br/>A brand new range of Heavy Machinery awaits your driving prowess. These are the Monsters of the Trucking World – only the very best drivers need apply to drive in this sequel to our Monster Hit Parking Game! <br/><br/>_____________________________<br/>HEAVY TRUCKING<br/>-------------------------------------------------<br/>Can you Master The Metal? Drive 3 Monstrously Big Trucks around some of the trickiest terrain ever made for any parking game! Steep hills, rough ground, narrow chasms, tight passageways… it’ll take all your awareness to make it through unscathed with these beastly trucks!<br/><br/>_____________________________<br/>QUARRY LORRIES<br/>-------------------------------------------------<br/>Featuring dozens of exciting missions around the New &amp; Realistic 3D Quarry Map. Drive the Excavator, the Hauler and the Articulated carrier trucks to pass all the jobs on offer!<br/><br/>_____________________________<br/>PARKING SIMULATOR<br/>-------------------------------------------------<br/>Follow the courses to make your way precisely to the parking zones on each mission. Can you complete them in the best possible times without damaging the Trucks?<br/><br/>_____________________________<br/>FREE TO PLAY<br/>-------------------------------------------------<br/>The Main Game Mode is 100% FREE to Play, all the way through, no strings attached! Extra Game Modes that alter the rules slightly to make the game easier are available through In-App Purchases. Each mode has separate GameCenter leaderboards to make for totally fair competition!<br/><br/>_____________________________<br/>COMPETE TO BEAT!<br/>-------------------------------------------------<br/>Can you beat the Worlds best Truck Drivers? Now is your chance to find out where you are in the career ladder of a successful Quarry Truck Driver! <br/><br/><br/>_____________________________<br/>GAME FEATURES\t<br/>▶ 3 HUGE Quarry Trucks to Drive<br/>▶ DOZENS of Fun and Tricky Missions to complete<br/>▶ 100% Free-2-Play Missions<br/>▶ Customisable Control Methods (Buttons, Wheel, Tilt &amp; MFi Game Controller Support)<br/>▶ Multiple Cameras to get the best view on your parking spot  <br/>▶ Runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (4th Generation)<br/><br/>-------------------------------------------------<br/>From the creators of “The Best Parking Games on the App Store” (a comment given by many of our happy players!). See our other games for many more exciting Parking Simulator games!", "metacritic": null, "released": "2015-07-12", "tba": false, "updated": "2019-10-22T14:36:52", "background_image": "https://media.rawg.io/media/screenshots/c05/c05cee034c72564bf125104ac383220f_JbcD5aX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}