{"id": 307472, "slug": "shapes-at-play", "name": "Shapes at Play", "name_original": "Shapes at Play", "description": "Help move shapes across the screen with your finger and soon you’ll find yourself making and playing with different types of vehicle, including a car, a boat, a cable car, a hot air balloon and – toot toot! – a train! Just tap the vehicles to make them move and send them on their way – over mountain peaks, across the sea or into the cloudy sky!<br/><br/>BOLOGNARAGAZZI DIGITAL AWARD 2015 - Special mention.<br/>\"For the creative design and ability to stimulate out-of-the-box thinking: a circle can be a wheel, a cloud or a button ... Intuitive and fun, extremely suitable for young children.\"<br/><br/>---<br/><br/>THIS IS A MINIBOMBO APP!<br/><br/>• It's simple and intuitive<br/>One single gameplay and no navigation menu for maximum accessibility.<br/>• It takes the right amount of time<br/>A short game sequence full of surprises, suitable for the young users it was designed for.<br/>• It's much more fun if played together<br/>Designed for sharing so that parents can play with even the youngest of children.<br/><br/>---<br/><br/>WHO IS MINIBOMBO?<br/><br/>Minibombo is an Italian publishing house dedicated to little children and the grown-ups who read along with them.<br/><br/>This application starts on the pages of a book. Would you like to know more? Then start turning the pages of SHAPES AT PLAY and find out just what the triangles, circles and squares have in store for you …", "metacritic": null, "released": "2016-03-14", "tba": false, "updated": "2019-10-22T14:36:58", "background_image": "https://media.rawg.io/media/screenshots/2e9/2e9025a5b6ce4281772ae647620cc2f5.jpg", "website": "http://www.minibombo.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TIWI"], "genres": ["Adventure", "Family"], "publishers": ["TIWI"], "esrb_rating": "Everyone 10+"}