{"id": 307632, "slug": "vard-the-vampire", "name": "Vard The Vampire", "name_original": "Vard The Vampire", "description": "<p><strong>Controls:</strong></p>\n<ul><li><strong>W/Up Arrow</strong>: Walk up</li><li><strong>A/Left Arrow</strong>: Walk left</li><li><strong>S/Down Arrow</strong>: Walk down</li><li><strong>D/Right Arrow</strong>: Walk right</li><li><strong>Space Bar/Left Mouse/F: </strong>Attack</li><li><strong>Enter:</strong> Navigate Menus/Screens</li></ul>\n<p><strong>Features:</strong></p>\n<ul><li>Be a vampire that's <strong>really bad</strong> at controlling your blood lust.</li><li>Kill people in self-defence... or just kill innocent people.</li><li>Get <strong>cool blood powers</strong> that <strong>kind of slowly kill you</strong> but <strong>they look cool</strong> so <strong>it's chill</strong>.</li><li>Wear a <strong>green plaid shirt</strong>.</li><li>Did I mention <strong>blood tentacles</strong> <strong>shoot out of your hands</strong>?</li><li>Get <strong>yelled at</strong> by a <strong>Game Over screen.</strong></li></ul>\n<p><strong>Description:</strong></p>\n<p>You are Vard. You're... not the brightest vampire out there, but you have weird blood powers. These blood powers make you very adept at killing folks to drink from them, but the powers come at a cost. Every time you use them (and just... in general, honestly), you bleed out. In order to stay alive, you have to keep drinking folks' blood to keep alive. And hey, the town festival happens to be on! Sweet! People will be popping up left and right, so there'll be no shortage of blood supply.</p>\n<p>Seems simple, right? Well, it is. Kind of. Y'see, a few people are aware that you're up to your old tricks of casually murdering people again, so they've been keeping an eye out for you. And they have fight AND flight on their side. Some will run away, others will come chase you to throw down... before they, too, make a hasty escape.</p>\n<p>All is not lost, though! You've noticed that you tend to stay in one of three states. You have your normal state, where people generally just see you as any other person and leave you alone. Until you attack them, of course.</p>\n<p>Your second state is when you really just want to stay alive, and you're close to expiring, like an old glass of milk out in the sun. You tend to look a bit... off, shall we say, so folks tend to either attack you because you're gross or run away because they think you're going to kill them. And they're not wrong! You don't have enough strength left in you to fight off people that fight you, so you need to chase down an innocent person to stay alive. Yay!</p>\n<p>Your third and last state is one of pure blood rage. This is when you've had a few too many people in one go, and you're so powerful you can't even contain it any more. You very quickly use up your energy, because moderation is for losers, so you never stay like this very long. But you're a LOT faster. Oh, and people also attack you on sight, once again because you look a bit... nasty, shall we say.</p>\n<p>Also... don't try to make a run for it. A lot of people boycotted the festival because they knew you were gonna be there, but... well, bigots are bigots, and they're kind of waiting for you outside the festival grounds. Even if they don't manage to take a swing at your blue-tiful face, your anxiety makes you bleed out even harder when they're near. So I guess you're kind of stuck in the festival for the time being.</p>\n<p>Good luck, Vard! Hope you don't die tonight!</p>", "metacritic": null, "released": "2019-04-07", "tba": false, "updated": "2019-08-28T23:17:14", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5df97ac08c428c63393611475e089b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jordan Han"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}