{"id": 307759, "slug": "tmm-entourage-itch", "name": "TMM: Entourage (itch)", "name_original": "TMM: Entourage (itch)", "description": "Description\r\n<p>Tales of Mystics and Madmen: Entourage or TMM: Entourage for short is a top down shooter with a couple of RTS mechanics mixed in. You pick one of three sides and fight either the other two in various competitive or just one side in cooperative game modes. Each player character is joined by three bodyguards which may be controlled by your friends at the push of a button on a gamepad. The game offers various objective-based game modes which vary in length and style, with most of them sharing the same principles. Although this game can be played by yourself, it is more fun to engage in conflict with your friends locally and with others around the globe.<br/></p>\r\nBackground\r\n<p>Three sides fight for supremacy. They are called Primitivists, Progressionists and Royalist. The Prims are deeply connected with nature and draw influences from various African and Asian cultures. Progs have aristocratic origins and happen to be techno-lovers (literally), they tend to invent the next big thing before anyone else gains knowledge of their last big thing. The Royals foster nobility and pride and like to duel each other if not fighting off some bigger threat.<br/></p>\r\nKey Features\r\n<ul><li>PvP Game Modes: King of the Hill, Escort, Team Deathmatch, Warfare and more\r\n</li><li>PvE Game Modes: Stronghold, Onslaught, Tug of War and more\r\n</li><li>Each mode changes gameplay in some way\r\n</li><li>Leaderboard support for various Game Modes </li><li>Campaign Mode: Play increasingly difficult matches with your friends vs bots, progress between sessions is saved\r\n</li><li>Hotjoin local coop: Up to 4 players can play locally, three of them can join/leave at any time\r\n</li><li>Lead the charge as Commander, your bodyguards (Entourage) follow you\r\n</li><li>Change the appearance and weapons of your Commander and bodyguards during the match\r\n</li><li>Unique RTS/Shooter mix: control a single unit and build turrets directly, order troop movement indirectly and their composition\r\n</li><li>Invade the enemy's base to kill their workers reducing their income\r\n</li><li>Various weapons with primary and secondary fire modes unique to each faction\r\n</li><li>RPG mechanics to round up the gameplay: gain technology points by defeating enemies and empower your troops, use skills to buff your allies\r\n</li><li>Call and enter a gunship to turn the tide of battle\r\n</li><li>Procedural map generator: each game mode requires a different map layout, the map generator creates maps according to set rules\r\n</li><li>Match customization: there are various parameters which can be set to adjust game length, starting resources etc\r\n</li><li>New game modes and maps will be added at irregular intervals as free DLC</li></ul>", "metacritic": null, "released": "2019-04-07", "tba": false, "updated": "2019-04-08T05:32:05", "background_image": "https://media.rawg.io/media/screenshots/694/694f125570e27703247365edfdf8a737.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChocolateShipGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}