{"id": 307751, "slug": "dear-biscuits", "name": "Dear Biscuits", "name_original": "Dear Biscuits", "description": "Enjoy a fun-filled, chaotic day out in the park with up to four players... and lots of deer!\r\n\n<p>Dear Biscuits is a couch multiplayer party game for 2-4 players. Set in a modeled and  hand-painted locale inspired by our experiences in Japan's Nara Park, it is designed for players of all ages to be able to easily participate in some deer-feeding frenzy.</p>\n<p>Dear Biscuits was created as our final thesis project as students of JMC Academy.</p>\r\nHow to Play\r\n<p><strong>Analog Stick - Movement<br/>A Button (Hold) - Feed<br/>A Button (Tap) - Dash</strong></p>\n<p>Feed some deer to bring them to your island. The player with the most deer by the timer's end, wins! </p>\n<p>A random event occurs every minute. Each event can bring large amounts of variance and really turn the tables around, so be sure to quickly adapt to whatever the game throws at you. <br/></p>\n<p>All modern controllers should be supported. Unfortunately, there are currently no keyboard/mouse controls, nor are there any plans to implement them.</p>\n<p>Although it wasn't exactly designed with this in mind, the game can begin with only one player. By all means, please do feel free to play solo- though do be aware that there isn't a loss state in place for single player sessions. <br/></p>\r\nCredits\r\n<p><strong>Programmer</strong><br/>Benjamin Pangrazio</p>\n<p><strong>Artists</strong><br/>Chase Mallee <br/>Emma Tatam<br/>Icun Prayitno<br/>James Pitt <br/></p>\n<p><strong>Composers</strong><br/>Joseph Dipisa-Fiorenza <br/>Pieter Julian Triharto <br/></p>\n<p><strong>Advisors</strong><br/>Angela Pinila <br/>Daniel Dang <br/></p>", "metacritic": null, "released": "2019-04-07", "tba": false, "updated": "2019-04-08T05:29:16", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee8cb2dbc1e1d377135eb54f02e7c58e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Icun P"], "genres": [], "publishers": [], "esrb_rating": null}