{"id": 307975, "slug": "byte-sized-boss-beatdown", "name": "Byte-Sized Boss Beatdown", "name_original": "Byte-Sized Boss Beatdown", "description": "<p><em>Byte-Sized Boss Beatdown</em>, developed in collaboration with MediaSmarts is a free 3D action adventure game that personifies antidotes versus threats. Through a strenuous boss gauntlet, players attempt to repair their Grandma’s virus infected computer. Can you overcome the obstacles impeding your grandma's ability to send e-cards? Faced with a stream of standalone levels to play, you'll come to know the vulnerabilities that bosses exploit.</p>\n<p>If you think you're a good grand-kid capable of helping your Grandma, see if your computer science knowledge is up to snuff in <em>Byte-Sized Boss Beatdown</em>.</p>\n\n\n<p>If you are a professional in an educational practice, you'll find this game useful in a teaching context. Games are often falsely thought of as solely recreational. More and more, we are seeing a paradigm shift in the games industry to present entertainment in an educational manner. James Paul Gee's writings in <em>What Video Games Have to Teach Us About Learning and Literacy</em>, published in 2003 delves into situated meaning and cognition. This is to say that using the jargon that developers or systems use are not necessarily conducive to mimicking or creating a desired understanding in players. Through gameplay, <em>Byte-Sized Boss Beatdown</em> teaches computer science elements and necessary steps to protect one's personal computer from viruses in a context where it makes sense in an introductory way.</p>\n<p>Don't believe us? Take a look at <em>Dumb Ways </em><em>to Die</em>, the world's most popular public service announcement. Metro Trains Melbourne launched the campaign to promote rail safety, with release of the first game within a year, after the video went viral. It is by looking to these examples that we are inspired to build out games in aims to achieve learning objectives.</p>\n<p>As a result, by the end of <em>Byte Size Boss Beatdown,</em> players are be able to:</p>\n<ul><li>Recognize computer threat classifications that can afflict computers</li><li>Identify how viruses, malware and neglect to maintain system checks negatively impacts their computer</li><li>Distinguish appropriate methods in removing these computer threats and repair file systems afterward through computer system access</li><li>Recall how in-game activities and solutions are paralleled to real world benefit</li></ul>\n\n<p>\n</p>\n<p>This game was developed in the span of 6 months by a group of five fourth year undergraduate Game Design and Development students at Wilfrid Laurier University in collaboration with MediaSmarts for our Capstone project. Made by:</p>\n<p>@TylersHallWay<br/>Morgan Percival<br/>Keanan Zimmer<br/>Matan Bellilti<br/>Sean Harrison<br/></p>\n<p><strong>Installation Instructions:</strong></p>\n<ul><li>Download the folder below</li><li>Extract the folder content </li><li>Open the folder</li><li>Click on the executable (.EXE file or application file)</li></ul>\n<p>If Windows asks for permission, click \"Allow\".<br/>You are now playing <em>Byte-Sized Boss Beatdown</em>!</p>", "metacritic": null, "released": "2019-04-05", "tba": false, "updated": "2019-04-08T06:22:58", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d1b5619c48a1e0347029af02ce494a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tyler Hall", "Keanan", "harr6560", "Morgan Percival"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}