{"id": 30804, "slug": "dragon-raja", "name": "Dragon Raja", "name_original": "Dragon Raja", "description": "The Most Anticipated Game award-Unreal Open Day 2019<br/><br/>Created with Unreal Engine 4, Dragon Raja is a next-generation open world mobile game that offers a gigantic, immersive world through the use of cutting-edge technology and stunning graphics. In Dragon Raja, players are able to create one-of-a-kind characters to play, explore, and fight alongside their friends from all over the world.<br/><br/>STUNNING GRAPHICS<br/>Dragon Raja was developed using the top Unreal Engine 4. It boasts a unique in-game world of a gigantic scale and filled with vivid details. Day or night, sunshine or rain, players can explore the world of Dragon Raja freely! Dragon Raja also uses a simulated physical collision system and optical motion capture technology to deliver “smart” in-game environment that maximizes players’ gaming experiences. Its fantastic graphics will gives players the feel of playing a PC game!<br/><br/>GIGANTIC OPEN WORLD<br/>Many landmark locations around the world have been recreated in Dragon Raja that global players are sure to recognize. From Tokyo to Siberia, every scenic location has been seamlessly integrated into the game’s open storyline. NPCs will also give separate quests or engage in different dialogue based off of player choices, giving them the power to change the world.<br/><br/>COMPREHENSIVE CHARACTER CUSTOMIZATION<br/>Dragon Raja features a comprehensive character customization system. Players will be able to define their character’s personality through their responses to unforeseen events. In Dragon Raja, players are able to create unique characters and dress them however they choose—with endless choices. Casual, retro, street, and futuristic are just a few of the styles players could choose from when styling their characters with additional styles to come!<br/><br/>FIERCE REAL-TIME COMBAT SYSTEM<br/>Dragon Raja’s realistic combat and gameplay deliver an electrifying PvP system. Players can test their skills in duels, battlegrounds that hold hundreds of players, or fight for honor through guild matches. Besides that, the game’s PvE system is equally exciting featuring a multitude of unique bosses and riddle solving making each PvE instance run a fresh experience. <br/><br/>TEAM UP WITH FRIENDS WORLDWIDE<br/>Player-to-player interactive gameplay is at the heart of the Dragon Raja experience. There are challenges that require teamplay as well as multiplayer quests that can only be completed with teamwork. In order to facilitate with in-game communications, Dragon Raja features real-time voice chat system, one-click multiple language translation function, an interactive in-game social sharing platform as well as standard text chat. Players are able to join up with friends from all over the world!<br/><br/>TONS OF INNOVATIVE GAMEPLAY MODES<br/>For the casual gamer, Dragon Raja offers dozens of gameplay modes as well as a unique career system. Whether they would like to be a Michelin-starred chef, an entertainment superstar, or a racing champion every player in Dragon Raja is in control of their own destiny. <br/><br/>STORY<br/>The Dragon Lord, once sealed away by a group of humans known as hybrids, has come back to life. The hybrids—humans gifted with superpowers—are gathering to prepare for the coming battle which is sure to be an epic showdown.<br/><br/>In order to support high game quality and massive game contents, the file size of Dragon Raja is relatively large. Please note that contents of 1.5 GB need to be downloaded after the first installation. And another 1.5 GB of art assets need to be downloaded after entering the game.<br/><br/>Device Compatibility:<br/><br/>System version: Android 5.0 or above<br/>RAM: 2GB or more<br/>Free space in the system: at least 6 GB<br/>CPU: Qualcomm Snapdragon 660 or higher<br/><br/>SNS<br/>Facebook: https://www.facebook.com/DragonRajaEN<br/>Twitter: https://twitter.com/DragonRajaGame<br/>Discord: https://discord.gg/aVdWR5A<br/>Reddit: https://www.reddit.com/r/DragonRajaMobile/<br/>INS: https://www.instagram.com/dragonraja_design/<br/>Pinterest: https://www.pinterest.com/dragonraja2019/<br/>VK: https://vk.com/dragonrajamobilegame", "metacritic": null, "released": "2000-01-01", "tba": false, "updated": "2020-03-23T02:06:27", "background_image": "https://media.rawg.io/media/screenshots/5a0/5a01b92de697f7feae540bd7ef7d5739.jpg", "website": "http://www.dr-int.com", "rating": 4.33, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 4, "beaten": 1, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 557, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "Android", "iOS"], "developers": ["Archosaur Games", "eSofnet"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["Famous Heart", "eSofnet"], "esrb_rating": null}