{"id": 308085, "slug": "thistledown-a-tragedy-of-blood", "name": "Thistledown: A Tragedy of Blood.", "name_original": "Thistledown: A Tragedy of Blood.", "description": "A personal tragedy forces Oni to push beyond the boarders of her village, in search of an unspeakable horror. As she assembles the pieces of an ancient magical contract, Oni leaves a bloody trail behind her, careening towards darkness, death, and worse.<br/><br/><strong>Gameplay:</strong><br/><br/>A platformer which is primarily focused on story and place. Mechanically light, but with some melee combat (which you are able to toggle off, if you just want the story). You'll explore the world and experience the story through conversations and cutscenes.<br/><br/>Here's what we focused on when making Thistledown:<br/><br/>StoryStories help us navigate our lives, stories move us, and make us better. They rarely get attention in the action-oriented world of video games. We enlisted a group of script advisors to help us make sure that Thistledown was a beautiful story well told.<br/><br/>WorldWe sought to make a world that felt real and bigger than the story itself, so we put in major work building the world of Thistledown, only 10% of which will be in the game. We made a world that feels like you are only glimpsing a bit of it, because you are. <br/><br/>CharactersWe take pains to animate and create unique portraits and personas for every character in our 60+ cast of characters.<br/>We don't do throw-away NPCs.<br/><br/>PainThistledown is a small, personal story set in an epic fantasy world. It's a meditation on the pain and helplessness that we feel in the face of tragedy, and how we cope. If you prefer your games light and insubstantial, Thistledown is not for you.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:39", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f818d463bf4281e35469dd89c131d89.jpg", "website": "http://thistledowngame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["andhegames"], "genres": ["Indie"], "publishers": ["Doubtful Games"], "esrb_rating": null}