{"id": 308063, "slug": "eamon", "name": "Eamon", "name_original": "Eamon", "description": "<p>Eamon, sometimes known by the longer title The Wonderful World of Eamon, is a role-playing adventure game created by Donald Brown and released for the Apple II in 1980. The game is a text adventure similar to other early titles like Adventure (1976) or Zork (1980) and to later text-based Multi-user dungeons (MUDs), though with many role-playing elements not available in other interactive fiction. Eamon software is non-commercial and is freely available in the public domain.</p>\n<p>Brown encouraged players to modify and add to Eamon, and published technical information on the game to assist them. Eamon is notable for being one of the first adventure games designed to be modular, with expansion packs written by users forming an integral part of the game experience. A master disk called the &quot;Main Hall&quot; is used to manage player characters and to facilitate their transfer between individual adventures. The character retains his or her attributes and statistics from adventure to adventure, as well as up to four weapons.</p>\n<p>The game&#39;s interface is similar to that of most other text adventures — the game presents the player with descriptions of the character&#39;s surroundings, including events, artifacts, monsters and exits, then prompts the player to enter a command. These commands include such things as moving in certain directions (NORTH, EAST, UP, etc.), readying weapons, attacking, getting or dropping items, interacting with characters, casting magical spells or checking inventory.</p>", "metacritic": null, "released": "1980-12-30", "tba": false, "updated": "2022-10-24T00:48:56", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "beaten": 4, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 4, "platforms": ["Apple II"], "developers": [], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}