{"id": 308195, "slug": "marimba-real", "name": "Marimba Real", "name_original": "Marimba Real", "description": "The Marimba is a percussion music instrument consisting of a set of wooden bars struck with yarn or rubber mallets to produce musical tones. Resonators or pipes suspended underneath the bars amplify their sound. The bars of a chromatic marimba are arranged like the keys of a piano, with the groups of two and three accidentals raised vertically, overlapping the natural bars to aid the performer both visually and physically. This instrument is a type of idiophone, but with a more resonant and lower-pitched tessitura than the xylophone. A person who plays the marimba is called a marimbist or a marimba player. Modern uses of the marimba include solo performances, woodwind and brass ensembles, marimba concertos, jazz ensembles, marching band (front ensembles), drum and bugle corps, and orchestral compositions. Contemporary composers have used the unique sound of the marimba more and more in recent years. (https://en.wikipedia.org/wiki/Marimba)<br/><br/>The Marimba Real is simulation app using Yarn mallet with Roll feature. Frequency ranger: C3 -&gt; F6.<br/><br/>More offline and online songs for practice (With the ability to change speed, transpose).<br/><br/>Play with multi modes:<br/>- Full (Left &amp; Right hand)<br/>- Only Right hand<br/>- Right hand (Marimba or Piano Left hand)<br/>- Real Time<br/>- Auto-play (Preview)<br/><br/>Support multi views and adjustable UI for optimal experience. <br/><br/>Record feature: record, play back and share to your friends.<br/><br/>Export .wav file feature: export and save .wav file (With the ability to change speed, transpose).<br/><br/>** Songs is updated regularly", "metacritic": null, "released": "2019-03-06", "tba": false, "updated": "2019-10-22T14:37:03", "background_image": "https://media.rawg.io/media/screenshots/fab/fabce43597129cb9460ed82c849a1328.jpg", "website": "https://www.sonoscore.com/index.php/marimba", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Son Truong Ngoc"], "genres": ["Simulation"], "publishers": ["Son Truong Ngoc"], "esrb_rating": "Everyone 10+"}