{"id": 308211, "slug": "karate-kings-fight-19", "name": "Karate Kings Fight 19", "name_original": "Karate Kings Fight 19", "description": "Let’s imagine yourself as a karate &amp; martial art master that is ultimate king fighter in kung fu karate fighting. Karate is an ancient martial art built around self-defense that originates from Japan and China. Play the toughest &amp; real kick fighting game app against world undisputed fighting champions ever.<br/><br/>Game offers real training game app especially developed for fans who love to play pro karate action games. Karate &amp; martial art fighting become extremely popular worldwide and have many fighting variations. This Karate Training game will help you to learn Karate for free through your handy ios device.<br/><br/>In this game, there are blockage techniques to defend yourself from enemy attack. Your opponents use various training styles including taekwondo, muay thai, kung fu, boxing and other, show your top level training skills to overcome all of opponents with the power.<br/><br/>Keep an eye on every move of your enemy that is fighting with you. Take timely decision, attack on enemy with punches and kicks on proper time and block enemy attack using accuracy and speed in your actions. Quickness is key to win the hand to hand fights.<br/><br/>Go toe-to-toe against 30+ bone crushing fighters from Bangkok, Korea, Thailand, china, japan, and Singapore. Advanced animation and stunning 3d graphics bring the real karate experience to your hand, while intuitive touchscreen controls make jab, hook, and uppercut feel natural and fun. Learn Karate for all levels and easy for free with this game app.<br/><br/><br/>Game Features:<br/><br/>- Learn karate in training mode to test your pro fighting skills<br/>- Select trained karate fighter with kung fu tiger fighting styles<br/>- Get promoted by defeating king fighter tournament legends<br/>- Win karate matches &amp; get rewarded points to unlock next match<br/>- Battle against toughest fighters to win world karate tournament<br/><br/>Kung fu king pro karate tournaments with big rewards<br/>Background music &amp; sound effects will increase your energy in karate ring<br/><br/>Let us know how you liked the game. We are working on the game updates and your suggestions are valuable for us.", "metacritic": null, "released": "2018-12-28", "tba": false, "updated": "2019-07-29T22:40:02", "background_image": "https://media.rawg.io/media/screenshots/69b/69bb72f0094211309e3eb11feb530992.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["S Tanveer Hussain"], "genres": ["Action", "Adventure", "Sports"], "publishers": ["S Tanveer Hussain"], "esrb_rating": null}