{"id": 308276, "slug": "soul-goddess-hero-battle-2018", "name": "Soul Goddess- Hero Battle 2018", "name_original": "Soul Goddess- Hero Battle 2018", "description": "Dive into the epic battle and emerge as an ultimate champion of the world. Become the superhero sword fighting queen of anime world. Best anime fighting scenarios taken to a whole new level of sword fighting games. Soul Goddess is the latest modern combat fighting game of 2018 which is full of action and RPG fighting skills. It's one of the best samurai warrior games. Superhero soul goddess  is an ultimate ninja warrior fighting game of 2018 in which you will take revenge from black shinigami demon witch and her subordinates. <br/><br/>You don't have the ultimate team or ultimate champions. You’re alone in this in this grand battle warfare against the evil army of demons. Omae wa mou shindeiru she says as she kill demons. An evil samurai ,ninja sword fighters and warriors you can find all of them in it. Use your super powers to defeat the shadow ninja of the mist. Stop the demons in this ultimate ninja warrior fighting game. You will take revenge from black reaper mutant warrior lord. From the infinite blades of the world, you now can choose the immortal blades from the most precious armoury available. You were trained by shinobi sensei to become the best sword fighter of the shinobi world. Prove yourself as the real superhero ninja fighter.You have special moves and super powers. Use your dual swords infinite blades and fight evil. <br/><br/>Make sure this doesn't turn into another survival battleground game. Be one of the ultimate Japanese girls who take on devious succubus like evil creatures. Live up to your legend as the great Sword fighting champion. Never lose your way, Be the ultimate superhero fighting warrior who stands above all the other super heroes present on planet earth and beyond ! If you love sword fighting games , you're going to love this anime ninja legends modern combat game.<br/><br/>Download the best sword fighting game of 2018 for free. <br/><br/>Game Features:<br/><br/>- New modern combat system<br/>- Many Particle Effects and Amazing multiple environments<br/>- Many deadly weapons of destruction and chaos<br/>- Upgradable stats<br/>- Upcoming new Characters<br/>- Anime effects<br/>- Special Moves, Power Moves", "metacritic": null, "released": "2018-11-14", "tba": false, "updated": "2019-10-22T14:37:06", "background_image": "https://media.rawg.io/media/screenshots/254/254c42296a636870a1390210e2a23ec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Osama Saleem"], "genres": ["Action", "RPG"], "publishers": ["Muhammad Osama Saleem"], "esrb_rating": "Mature"}