{"id": 308243, "slug": "construction-simulator-3", "name": "Construction Simulator 3", "name_original": "Construction Simulator 3", "description": "Discover an idyllic European town in the sequel to the popular Construction Simulator 2 and Construction Simulator 2014 with officially licensed vehicles by famous brands: Caterpillar, Liebherr, CASE, Bobcat, Palfinger, STILL, MAN, ATLAS, Bell, BOMAG, WIRTGEN GmbH, JOSEPH VÖGELE AG, HAMM AG and MEILLER Kipper. Take on diverse and challenging contracts. Build and repair roads and houses. Shape the skyline of your city and expand your vehicle fleet. Discover a completely new map and unlock new contracts and vehicles with your growing company. <br/><br/>CONSTRUCTION SIMULATOR GOES EUROPE<br/><br/>Explore a 3,2km² map, lovingly designed to resemble the idyllic Alpine foothills and play in three different districts: The village where you establish your company, a spacious industrial area and a modern town. Use the time between jobs to explore the freely drivable open world.<br/><br/>BRAND NEW FEATURES: LIEBHERR LB28 &amp; COCKPIT VIEW<br/><br/>Enjoy the Liebherr LB28 drilling rig for bridge construction for stable and deep foundations during bridge construction and other exciting missions! Another feature long-awaited by many fans is the cockpit view. Now you can enjoy Construction Simulator 3 from the inside of every vehicle and get a first hand feel of what it's like to take control of epic machines! <br/><br/>OVER 50 VEHICLES BY 14 BRANDS<br/><br/>A huge amount of vehicles is waiting for you! Choose the right machine for every job: Take on the challenges of road works and refurbishments with machines by Caterpillar, BOMAG or WIRTGEN GmbH, VÖGELE AG and HAMM AG. Available for the first time: The E55 compact excavator or the T590 compact track loader from Bobcat will make earth moving a walk in the park! Get behind the wheel of the MAN TGX truck to visit your local gravel pit or supply store and discover new heights with the Liebherr 150 EC-B 8 tower crane. <br/><br/>OVER 70 NEW CONTRACTS<br/><br/>Prove your skills on the job: From small Bavarian style family homes to industry warehouses and skyscrapers - more than 70 challenging contracts demand all your skills and precision in Construction Simulator 3. Refurbish crumbling roads and use your large vehicle fleet to master every challenge. Shape the skyline of Neustein through your unique work!<br/><br/>-   Over 50 vehicles by 14 brands<br/>-   New Cockpit view<br/>-   Over 70 different contracts<br/>-   Liebherr LB28 for e.g. bridge construction", "metacritic": null, "released": "2019-04-10", "tba": false, "updated": "2019-08-02T04:54:54", "background_image": "https://media.rawg.io/media/screenshots/64c/64c960a4278d8f31e58bd9272b3d30aa_Y6PQe8t.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["astragon Entertainment"], "genres": ["Action", "Simulation"], "publishers": ["Astragon Entertainment"], "esrb_rating": "Everyone"}