{"id": 308339, "slug": "janggidosa", "name": "장기도사", "name_original": "장기도사", "description": "\"역시 소문대로 기력과 기능이 최강이네요.<br/>PC 버전용 장기도사를 아이폰용으로 그대로 구현해 놓았네요.<br/>그래픽 깔끔하고 다양한 기능이 뛰어나네요.<br/>인터넷에 널려있는 gib 기보 파일를 그대로 사용할 수 있다는 점이 최대의 장점 같습니다. <br/>스마트폰 장기 게임분야에서 독보적이라 생각됩니다.\"<br/>                    - 프로 9단 김경중<br/><br/>-  PC용 장기도사에 이어 스마트폰용도 최강의 기력을 가졌습니다. <br/>- 최하수: 18~13급, 하수: 12~6급, 중수: 5~1급, 고수: 1~4단, 초고수: 5단 이상 입니다.<br/>- 인터넷 카페에 올라온 기보를 터치하면 장기도사가 실행되면서 기보를 볼 수 있으며 저장을 할 수도 있습니다. <br/>- 수만 개의 프로, 아마 기보를 인터넷에서 무료로 다운 받을 수 있습니다.<br/>- 휴대폰에 저장한 기보를 PC에 올려 PC용 장기도사로 볼 수 있습니다. <br/><br/>■■■ 아이폰용 장기도사의 기능 ■■■ <br/><br/>- 최하수부터 초고수까지 5단계의 수준을 선택할 수 있어서 초보부터 프로까지 사용할 수 있습니다. <br/>- 다양한 포진법에 따라서 두므로 매번 다른 수로 대국을 할 수 있어 싫증이 나지 않습니다. <br/>- 장기도사의 기풍을 면포, 면상, 변칙 중 선택할 수 있습니다. <br/>- 대국도중에라도 대국자를 바꿀 수 있어서 수 연구를 하기에 좋습니다. <br/>- 사람에게도 시간제한을 둘 수 있으며 제한시간이 다되면 초읽기를 해줍니다. <br/>- 실수하기 기능이 있어 장기도사가 사람처럼 실수를 하게 할 수 있습니다. <br/>- 장기도사끼리 대국을 하게 할 수 있습니다. <br/>- 장기도사가 생각 중이거나 대국이 끝난 뒤에도 무르기가 가능합니다. <br/>- 힌트 보기 기능이 있어 장기도사로부터 도움을 받을 수 있습니다. <br/>- 기보 저장/감상이 가능합니다. <br/>- 기보감상 시 의문이 생기는 수를 두어 보기로 두어 볼 수 있어 수 연구에 좋습니다. <br/>- 자동이동 기능으로 편리하게 기보를 볼 수 있습니다. <br/>- 하나의 파일에 여러 개의 기보를 저장할 수 있어 기보관리 하기에 좋습니다. <br/>- 기보의 각 수마다 해설을 넣을 수 있으며 나중에 해설을 수정할 수도 있습니다. <br/>- 기보 삭제, 정보 수정을 할 수 있습니다. <br/>- 기보 자동저장 기능이 있어서 자동으로 기보를 저장할 수 있습니다.<br/>- 변화수를 입력할 수 있어서 체계적으로 장기를 연구할 수 있습니다. <br/>- 접장기를 둘 수 있습니다. <br/>- 박보를 만든 뒤 장기도사가 박보를 풀게끔 할 수 있으며 사람이 풀고 장기도사가 응수를 하게끔 할 수도 있습니다. <br/>- 사람끼리 두기로 해서 두면 초반에 두어지는 각 수의 비율을 알 수 있어 포진법을 익힐 수 있습니다. <br/>- 경험쌓기 기능이 있어서 장기도사가 잘못 둔 수는 되풀이하지 않으며 결과가 좋은 수는 다시 둡니다. <br/>- 대회명, 대국자명, 차림으로 기보를 검색할 수 있습니다.<br/>- 스킨을 바꿀 수 있습니다.<br/>- 장기판을 바꿀 수 있습니다. <br/>- 남성, 여성 소리를 선택할 수 있습니다. <br/>- 휴대폰이 차림, 기풍을 랜덤하게 설정하게 할 수 있습니다. <br/>- 중단된 대국을 이어두기 할 수 있습니다.<br/>- 사람끼리로 놓을 경우 초시계로 사용할 수 있습니다. <br/><br/>■■■ PC와 아이폰과의 기보 주고받는 법 ■■■<br/><br/>기보 자료실에 있는 기보를 컴퓨터에 일단 받으세요.<br/>아이튠즈를 실행한 뒤에 컴퓨터와 아이폰을 케이블로 연결하면 왼쪽 위에 휴대폰 모양의 그림이 생깁니다. 그걸 클릭한 다음 왼쪽에서 파일공유를 클릭하세요. 오른쪽 파일 공유에서 장기도사를 클릭한 다음에 오른쪽에 있는 추가 버튼을 클릭하세요. 내 컴퓨터에서 기보가 있는 폴더로 이동 한 다음에 추가하고 싶은 기보를 더블클릭하면 추가됩니다.<br/>반대로 아이폰에 있는 기보를 PC로 옮기려면 다음으로 저장 버튼을 클릭하면 됩니다.<br/><br/>- 기보는 장기도사 홈페이지와 인터넷 장기 카페 등에서 받으실 수 있습니다.<br/>- 설명서는 장기도사 홈페이지 기보 자료실에 있습니다.<br/>- PC용 장기도사를 구입하시려면 www.janggidosa.co.kr 를  방문해주세요.", "metacritic": null, "released": "2011-12-21", "tba": false, "updated": "2019-10-22T14:37:10", "background_image": "https://media.rawg.io/media/screenshots/897/8974371d23ef3ae9e178a914efd814c3.jpg", "website": "http://www.janggidosa.co.kr", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kepler Tech"], "genres": ["Board Games", "Puzzle"], "publishers": ["KyoJin Kim"], "esrb_rating": null}