{"id": 308357, "slug": "ace-slots-play-6-slots-for-fun", "name": "Ace Slots, Play 6 Slots For Fun", "name_original": "Ace Slots, Play 6 Slots For Fun", "description": "Ace Slot is a unique, upbeat and ultra-exciting slot for fun that combines 6 slot machine games that are equally exciting and have the best features of all online casino slots. Huge payouts, unique HD artwork, stunning audio-visual effects and lovely &amp; interesting gameplay are what make Ace Slot to stand out from the crowd of all slots machines available for mobile devices. It’s ad free as well and available to enjoy for Apple TV<br/><br/>$$ 6 DIFFERENT GAMES IN ONE $$<br/>You start with the  Zombieland Slots, and after you unlock levels or get to a certain numbers of coins you can unlock Sweet N Gem Slots, Animal Slots, Egyptian Treasures and Knights Quest. Each of these online slots has different graphics, visual effects and characters. This is not your usual casino app, it is way more enjoyable, versatile and entertaining.<br/><br/>$$$ LURE INTO THE COMPETITIVENESS OF THESE SLOTS FOR FUN $$$<br/>The competitiveness is what makes this casino slot game amazing. The fact that you need to get a certain amount of coins and to get to a certain amount of levels in order to pass through the different type of games is what will keep you engaged into this slots for fun! Slot Casino entertainment to the fullest!<br/><br/>$$$ ACE SLOT, PLAY 6 SLOTS FOR FUN FEATURES $$$<br/>- 6 slots for fun in 1 game<br/>- one of the most fun &amp; versatile slot machine games<br/>¬ all slots are based on unique artwork, graphics and characters<br/>- online casino slots with HD Sound Effects and Music<br/>- stunning animations<br/>- competitive spirit<br/>- levels and locked games<br/>- all standard slots betting features are included<br/>- free and without any ads<br/>---------------------------------------------<br/>Play slots and enjoy the amazing features of Ace Slot.<br/>Slot casino entertainment has never been more exciting with these freeslots. <br/>Get it for FREE and have a real online casino slot enjoyment on any mobile device or smart TV.", "metacritic": null, "released": "2017-03-20", "tba": false, "updated": "2019-10-22T14:37:10", "background_image": "https://media.rawg.io/media/screenshots/63e/63e29eff1bfd85b3c2408325a9527bbc_YMiphxW.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["True Ronin Games"], "genres": ["Simulation"], "publishers": ["True Ronin Games"], "esrb_rating": "Mature"}