{"id": 308619, "slug": "run-cockroach-run", "name": "Run Cockroach Run", "name_original": "Run Cockroach Run", "description": "<p><strong>Avoid the obstacles, try to not fall in the holes and be careful with the flip-flop!</strong></p>\n<p>Controls: <strong>Left Arrow Key</strong> / <strong>Right Arrow Key</strong>: Menu Action and Movement</p>\n\n<p>Hello everyone me (Patrick Rodrigues - @patrickprz) and my friend Adriel finished our game for the two button game jam, the game is called Run Cockroach Run and tells the history about Bartolomeu's escape. Everything started on a summer day, when I arrived at home and turned the lights on, I saw a cockroach in the wall (somehow she was even charismatic). I tried catch her with my hands to put her out of the house but she ran seemed scared, probably because someone must have tried to kill her somewhere in the neighborhood (the game is about this). With some work I got her with my hands, however she bit me (in this moment I learned that cockroaches can bite). After that I decided to wait for her to calm down, yet strangely the cockroach began to follow me in the home and started to demonstrate a certain level of consciousness, so I decided to give her a name (Bartolomeu). The game is almost a tribute to this precious time that we spent together. I hope you enjoy the game experience! And please leave some feedback in the comments section.</p>\n<p>Music:</p>\n<p><em>Contains music ©2019 Joshua McLean (mrjoshuamclean.com)<br/>Licensed under Creative Commons Attribution-ShareAlike 4.0 International</em></p>", "metacritic": null, "released": "2019-04-11", "tba": false, "updated": "2019-04-12T05:00:51", "background_image": "https://media.rawg.io/media/screenshots/2ba/2ba01c8d100a0dc529cffc3919176b04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Adrieldf"], "genres": ["Action"], "publishers": [], "esrb_rating": null}