{"id": 308814, "slug": "ingeste", "name": "INGESTE", "name_original": "INGESTE", "description": "Anyone can climb the mountain!\r\n<p>EX.ULT VIDEOTAINMENT presents a mod of the Pico-8 version of <em>Celeste</em> that replaces Madeline with everybody’s favorite hungry pink blob! Instead of dashing and wall-jumping, you’ll run, flap, float, and inhale your way up the mountain. A spring breeze is blowing flower petals across the slopes. Collect optional Maximum Tomatoes, just for fun. We made minimal edits to <em>Celeste</em>’s level designs to allow for 100% completion.</p>\r\nControls:\r\n<ul><li>Arrow Keys: Walk, Fly, and Crouch</li><li>Z: Jump / Flap</li><li>X: Inhale / Exhale</li></ul>\n<p>If you’ve played <em>Celeste</em>, you know that part of its story is about overcoming anxiety and realizing that anybody, with enough determination and the right tools, can climb the mountain. (If you <em>haven't</em> played Celeste, go buy it!) The scene with the feather and the breathing exercise is so memorable! Madeline’s journey to work with herself, rather than against herself, has meant a lot to us. The generous Assist Mode shows us there's no wrong way to make it, and that it's cool to play games in whatever way you like.</p>\n<p>This mod asks <em>and answers</em> the question: what if a friendly pink balloon with shoes climbed Celeste Mountain?<br/></p>\n<p>This is an idea that started as a joke during Episode 46 of You’re Too Show, a podcast where we look for depth and hilarity in kids' media. We’ve been talking about <em>Kirby: Right Back At Ya!</em> and were struck by a scene in which Kirby falls asleep while fighting. Metaknight says that Kirby’s freedom from anxiety is his greatest strength. We were like, “Whoa! That reminds me of the feather scene in Celeste. Wouldn’t it be funny if…?” And then we realized it was actually a cute and thematic idea, and put it together over a few weeks as a side project.</p>\n<p>Follow <strong>EX.ULT VIDEOTAINMENT</strong> here on Itch or on Twitter @EXULTgames to see more cute game things we’re working on!</p>\r\nMod Credits:\r\n<ul><li>Nick Splendorr: Design &amp; Code - @nosplendorr</li><li>Ryan Splendorr: Art &amp; Animation - @resplendorr</li><li>Jacob Regus: Musical Arrangements</li><li>We gratefully include a modified version of @trianull’s Pico-8 cover of “Green Greens”: https://www.lexaloffle.com/bbs/?pid=60633</li></ul>\r\nSpecial thanks to:\r\n<ul><li>Caleb Zane Huett for help with the concept and play testing.</li><li>Lucy Ralston and Tony Ransom for feedback and code help.</li><li>All our friends in C.A.F.E. for encouragement and feedback.</li><li>The Celeste team for making such a great game. Go buy Celeste! https://mattmakesgames.itch.io/celeste</li><li>HAL Labs for all the joy they’ve brought into our lives over the years.</li></ul>\n<p>Save this Pico-8 Cartridge to play it locally in Lexaloffle's Pico-8!</p>", "metacritic": null, "released": "2019-04-09", "tba": false, "updated": "2019-04-12T05:49:20", "background_image": "https://media.rawg.io/media/screenshots/a3b/a3bb947dd7fdee41c7f1e71003ae12e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["EX.ULT VIDEOTAINMENT"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}