{"id": 308925, "slug": "mothballs", "name": "Mothballs", "name_original": "Mothballs", "description": "<p><strong>tw homophobia, internalized homophobia, body image, sexism, guilt</strong></p>\n\n<p><em>Even most seemingly insignificant of things may carry the heaviest of memories. <strong>Mothballs</strong> explores the concept of losing and finding, both physically and emotionally. D</em><em>elve into our protagonist's memories and piece together the events that have led her to where we begin, sitting in a tiny, dark closet (how ironic).</em></p>\n<p><strong><em>5,068 words, five characters, two endings!<br/></em></strong><em>Play through the game twice to learn the full story and get both endings!</em></p>\n\n<p><strong>Mothballs</strong> is a visual novel about navigating the intersection between being Asian-American and LGBTQ+. Our protagonist is a Vietnamese lesbian named Juliet, who is struggling to come to terms with her sexuality, among other things. Through finding some seemingly insignificant objects, Juliet slowly recalls the memories that have caused her to seek solace in the first place.</p>\n<p>Written, coded, and designed by Alexandra Tang (floraltine)<br/>Art and sound-editing by Jessica Chu (chuminder)<br/></p>\n\n<p>I wanted to make a game that was personal to me and that, despite the gravity of the topic, offered some hope and light. I wanted to make a game that I wish I'd had when I was growing up. I hope this game will be that for the people who find themselves in the position I was in then.<br/></p>\n<p><em><strong>Note: </strong>This game was created for my capstone project for Macaulay Honors College and designed during ARTS 172 (Game Design) for my final project.</em></p>", "metacritic": null, "released": "2019-04-09", "tba": false, "updated": "2019-04-12T06:14:36", "background_image": "https://media.rawg.io/media/screenshots/cb3/cb3504d9a86d534051d0a9b91229cced.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["floraltine", "chuminder"], "genres": [], "publishers": [], "esrb_rating": null}