{"id": 309040, "slug": "wailing-heights-itch", "name": "Wailing Heights (itch)", "name_original": "Wailing Heights (itch)", "description": "<p>A coffin-rocking, body-hopping, musical adventure game, set in a horrific hamlet of monsters.</p>\n<p>Set in a peaceful, blood-curdling village blessed with gorgeous panoramic mountaintop views and the blissful stench of rotting corpses, <strong>Wailing Heights</strong> is home to the likes of vegan werewolves, hipster vampires, soulful zombies and all manner of well-adjusted supernatural taxpaying home-owners.</p>\r\nStory\r\n<p>Meet <strong>Frances Finklestein</strong>, the one-time manager of the all-time greatest rock band that Great Britain ever produced: <strong>The Deadbeats</strong>. <br/></p>\n<p>After being invited to a gig in a town no one's ever heard of, Frances Finklestein is trapped in a holding cell, charged with the crime of... Being Alive! A mysterious cellmate teaches you the power of possession. You learn to \"body­-hop\", leaving your corpse in the holding cell and jumping from ghost to vampire to werewolf to zombie. Each creature's skills and abilities bring you one step closer to getting your body out of lock-up and getting the hell out of Wailing Heights. But of course, it's never that easy…</p>\n<p>As you jump from one musical monster to another, familiar sounds and faces start up show up. The Deadbeats have returned as the undead, and they want to get the band back together.</p>\r\nGameplay\r\n<p>In a twist on classic adventure games, you collect lyrical clues as you explore the town. Add these ingredients to your musical possession wheel, and sing your soul right into a monsters' body, gaining their supernatural abilities and moving one step closer to escaping Wailing Heights.</p>", "metacritic": null, "released": "2019-04-08", "tba": false, "updated": "2019-04-12T06:41:33", "background_image": "https://media.rawg.io/media/screenshots/b11/b11c4a482da00f45f69111cdc6cc6c41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["outsidergames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}