{"id": 309008, "slug": "apartment-3906", "name": "Apartment 3906", "name_original": "Apartment 3906", "description": "<p><em>1991, the 22’nd of May, at the break of dawn, a family is awoken by the shrill screams of a woman. The family gathers at their bedroom window as they eye the empty streets outside to find the source of the commotion. The street is slick with mildew, and nothing is moving. As they are about to give up and head back to bed the doors to the apartment building across the streets slam open. A woman, terrified, exhausted exits the two massive front doors and collapses in the middle of the concrete path. The family, startled, draws their drapes shut and calls the police.</em></p>\n<p><em>The affair is handled quietly. The authorities say it was a domestic affair, nothing more. The land- lord shortly evacuates all tenants living on the third floor and has reportedly bared shut apartment number 3906. No one is allowed to set foot on the third floor, even more so: Apartment 3906. </em></p>\n<p><em>Present day: you are investigating what really happened in apartment 3906 to uncover whatever gruesome event has caused such panic.</em></p>\n\n<p>Apartment 3906 is the product by two students who made it as a project for a two week course in experimental game design and prototyping.</p>\n\n<p>Mads Kramer - Modelleing, texturing, creative process</p>\n<p>Anders Christian Larsson - Programming, prototyping, modelling, texturing, sound design. creative process</p>\n\n\n<p>------------</p>\n\n<p>All sounds were found on Freesound.org, FreeFSX.co.uk and ZapSplat.com</p>\n<p>Glitch shader for Unity can be found here: Unity Asset Store</p>\n\n<p> </p>", "metacritic": null, "released": "2019-04-08", "tba": false, "updated": "2019-04-12T06:34:31", "background_image": "https://media.rawg.io/media/screenshots/00c/00c40787bf2e60e9b18f0da68754a313.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anders Christian Larsson", "Madskramer"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}