{"id": 309101, "slug": "dungeon-lord", "name": "Dungeon Lord", "name_original": "Dungeon Lord", "description": "Synopsis<br/>\n<br/>\r\nMontecristo was a devil who, due to the betrayal of his subordinates, suffered defeat at the hand of humans.<br/>\r\nAt the last moment, he was granted a final miracle.<br/>\r\nHe succeeded in returning to the past before all of his misfortunes began.<br/>\n<br/>\r\nHowever, his body had shrunk in the process, and he was now the size of a small child...<br/>\n<br/>\r\nA demon, defeated by the world and abandoned by his subordinates...<br/>\r\nKnowing what the future had in store for him, he made up his mind.<br/>\n<br/>\r\nThe only thing I can rely on... is the dungeon!<br/>\r\nAnd who the hell betrayed me anyway?!<br/>\n<br/>\n<br/>\n<br/>\r\nFeatures of this game<br/>\n<br/>\n<br/>\r\n- Based on the popular Korean internet novel called \"Dungeon Lord\"<br/>\n<br/>\r\n- Written by Workingdog, who wrote the scripts for the mobile games \"She is a Mermaid\" and \"The Fox Awaits Me\"<br/>\n<br/>\r\n- A fictional story set in a fantasy world created for an internet novel<br/>\n<br/>\r\n- Story-rich gameplay(about 500 pages worth) and beautiful girls animated with care<br/>\n<br/>\r\n- Excellent performances by professional Korean voice actresses<br/>\n<br/>\r\n- Summon monsters, study them, and then evolve them! An infinite amount of resources and spells are at your fingertips.", "metacritic": null, "released": "2019-04-08", "tba": false, "updated": "2023-11-04T21:32:32", "background_image": "https://media.rawg.io/media/screenshots/8e5/8e53cb6141994191d064d9aef27c0737.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TALESSHOP Co", "Dakiria"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["TALESSHOP Co"], "esrb_rating": null}