{"id": 309190, "slug": "black-survival-eternal-return", "name": "Black Survival: Eternal Return", "name_original": "Black Survival: Eternal Return", "description": "The test subjects eventually will return once more to the survival game.<br />\nExperience the Black Survival in a completely new way!<br />\nThe new 3D Lumia island will let you live through the survival to its fullest.<br />\nExplore Lumia Island where abandoned cities and pure nature coexist.<br />\nThere are various materials needed for survival in the entire island. Find them!<br />\nBe careful, there are many things on this island that might kill you.<br />\nOver 400 different items await you, but you will have to hurry to find it on time.<br />\nCombine hatchet and leather to create a battle axe. and combine motor for Bone Crusher.<br />\nAll items are limited, so you must use them efficiently.<br />\nA variety of Test subjects await you, including the Serial Killer, Jackie, and the clumsy cop, Aya.<br />\nAll Test subjects have their own abilities and masteries. Use them carefully..<br />\nDepending on the experiment subject you choose, you will have a completely different experience.<br />\nKeep moving, and you will move much faster due to increased moving masteries.<br />\nKeep fighting, and you will become stronger than others due to increased fighting masteries.<br />\nWhat masteries will you raise first? Make your choice.<br />\nRemember, only one test subject can become the winner.<br />\nThe stronger does not necessarily win, so take advantage of the situation.<br />\nLet there be glory to the pawns, who reached the end of despair!</p>", "metacritic": null, "released": "2023-07-20", "tba": false, "updated": "2024-04-15T13:24:34", "background_image": "https://media.rawg.io/media/screenshots/199/199b1769522219bb7a20089606a4291b.jpg", "website": "", "rating": 2.6, "rating_top": 1, "added_by_status": {"yet": 14, "owned": 901, "beaten": 2, "toplay": 2, "dropped": 25, "playing": 5}, "playtime": 2, "achievements_count": 0, "ratings_count": 40, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 40, "platforms": ["PC"], "developers": ["O'olBlue"], "genres": ["Strategy", "Indie"], "publishers": ["O'olBlue"], "esrb_rating": null}