{"id": 309225, "slug": "bikesvscops", "name": "BikesVsCops", "name_original": "BikesVsCops", "description": "BikesVsCops WORKS WITH: iPhone 6S, 7, 7 Plus, 8, 8 Plus, X, XS, XS Max, and XR.<br/><br/>BikesVsCops DOES NOT WORK WITH: iPhone 5S, 6, 6 Plus, iPad, iPad Air, Mini 2, Mini 3, and iPod Touch. (iPad version coming soon.)<br/><br/>Requires internet connection or cellular service and at least iOS 9.<br/><br/>Ever want to outrun the cops? Ever want to open the throttle all the way and cross the finish line first? Well, here’s your chance! Be a part of the viral brand that provides daily entertainment to millions of users!<br/><br/>BikesVsCops includes:<br/><br/>ARTIFICIAL INTELLIGENCE AND PHYSICS!<br/>Your goal is to beat \"Blaze\"! He's the fastest rider the streets have ever seen. Blaze knows every turn and responds to every obstacle, all while cops lurk in the shadows. Once the cops activate, there’s no stopping their pursuit. It's a battle to the finish line! They’re smart enough to figure out every turn, avoid every obstacle, and adjust their speed to make sure you don’t cross that finish line! It's up to you and your ability to beat Blaze and avoid the cops \"Busting\" you all at the same time.<br/><br/>6 DIFFERENT BIKES!<br/>Work your way through 6 different motorcycles, (250cc, 500cc, 600cc, 750cc, 1000cc, and 1300cc) each with different acceleration, max speed, and handling. Get the fastest bike and dominate Blaze and the COPS!<br/><br/>NITROUS BOOST!<br/>If you find yourself falling behind or the cops are just too close, hit the Nitrous button for a two second burst of speed!<br/><br/>CAREER MODE!<br/>There's 16 exciting levels to beat with each one getting harder as you go. Beating a Run the first time only ticks the cops off more, so you have to beat Blaze again except it won't be as easy the second time! <br/><br/>As you move through Career Mode, the Runs getter longer, harder, and the cops get meaner! And don’t forget about Blaze, he’s not going to let it be as easy as you think!<br/><br/>GET AWAY MODE:<br/>If you can’t get enough of the cops in Career Mode, then Get Away Mode was made for you! How long can you last when 24 cops have one mission and that is to take you out! The longer you can last, the higher up the leaderboard you’ll go!<br/><br/>Keep an eye out for constant updates to the game. We’ll be adding more cities, bikes, and modes! Along with character customizations, bike customizations, and more. Join the movement and don’t let Blaze and the cops take you down!<br/><br/>Follow BikesVsCops at:<br/>Web: http://www.bikesvscops.com<br/>Instagram: http://www.instagram.com/bikes_vs_cops<br/>Facebook: https://www.facebook.com/BIKES.VS.COP/<br/><br/>Privacy Policy: https://www.bikesvscops.com/pages/bikesvscops-mobilegame-privacypolicy<br/><br/>While this game is free to download and play, there some items in the game that cost real money. You have the option to buy extra hits of Nitrous, upgrade to a faster bikes, or watch Ads to earn other rewards.<br/><br/>Powered by Unity Game Engine.", "metacritic": null, "released": "2019-03-17", "tba": false, "updated": "2019-10-22T14:37:15", "background_image": "https://media.rawg.io/media/screenshots/1cf/1cf792c56f347d368ea0daf8afe06ed7.jpg", "website": "http://www.bikesvscops.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Unlawful Studios"], "genres": ["Racing"], "publishers": ["Unlawful Studios"], "esrb_rating": "Everyone 10+"}