{"id": 309203, "slug": "dragon-shadow-battle-2-warrior", "name": "Dragon Shadow Battle 2 Warrior", "name_original": "Dragon Shadow Battle 2 Warrior", "description": "Dragon Shadow Battle 2: Super Hero Warriors officially debuted as a major event on the world and Apple Store. The best combat action game of 2019 will bring player amazing experiences. You will transform into your own superheroes and fight for justice and peace on the planet.<br/><br/>Super Battle of God vs Devil base on Apple Store has been return! Good games on mobile, smartphone and tablet. Offline games but also features online, multiplayer, leaderboard, challenge mission system.<br/><br/>You will transform into your character and adventure though many different planets, learn a lot of martial arts and also versus many legendary characters. The battles are extremely fierce and in order to win the player must have the proper tactics combined with the super saiyan skills.<br/><br/>You can play game everywhere, everytime,: you can play when cooking, in office, in the car or bus, plane, train, even when you watching football, anytime you want.<br/><br/>Game are made for everybody , all age , boy or girl, children or adult , men or women, under or over 18 age. <br/><br/>Dragon Shadow Battle 2 Legend: Super Hero Warriors is not an online game so you can only play with the character of the machine<br/><br/>The best game ever for dragon battle legend fan with more than 80 saiyan forms.<br/><br/>The cool saiyan transform effect and many bosses what you will love the way to fight if you love for dragon shadow battle 2 legend Fan FC and You like it.<br/><br/>Become super heroes and warriors of legend with full skill of a super hero special more than all on global.<br/><br/>In this game, you will in super hero role also superheroes and fight with big bosses, the most dangerous enemies in universe. Your enemies will upgrade their power each level, and … they will absolute make you hard to win.<br/><br/>Dragon Shadow Battle 2 Legend: Super Hero Warriors is a fight game with dark characters, only 1, 2, 3 or 4 times you do not hit you will be defeated by your opponent.<br/><br/>The game is designed in the form of shadow and flexible movement, shadow fight battle of 2 dragon warriors in the world.<br/>-----------------FEATURE-------------------<br/>- Easy to play and control a to z<br/>- 20 Super Hero ball Levels with amazing graphics shadow<br/>- 80 levels / story with &gt; 40 bosses.<br/>- Many challenges each levels<br/>- Many characters to collect and upgrade.<br/>- Easily earn coin with watch reward video<br/>- Use many skill to beat Boss, melee attack, air attack, ground attack.<br/>- Use god beans to recover health and power.<br/>- Use coins or watch video to re-spawn in current place.<br/>- Watch video or use coins to avoid downgrade level.<br/>- Watch video or use coins to spin lucky wheel.<br/>- Watch video or use coins to buy god beans.<br/>- Change main character to fight, unlock super sayan levels<br/>- Easy control<br/><br/>- Share highscore in the facebook, twitter, instagram…<br/>- Amazing 3D pseudo-graphics, great sound provide great gaming experience.<br/><br/>Dragon Shadow Battle 2: Super Hero Warriors - The best action game with many legends. DON’T WAIT ! DOWNLOAD NOW!", "metacritic": null, "released": "2017-07-12", "tba": false, "updated": "2019-07-29T18:16:42", "background_image": "https://media.rawg.io/media/screenshots/176/176243c9fc17295ace391505ab45b665_KqtaNw7.jpg", "website": "http://onegame.mobi", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOBIONE TELECOMMUNICATIONS TECHNOLOGY AND SERVICE CO"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["MOBIONE TELECOMMUNICATIONS TECHNOLOGY AND SERVICE CO"], "esrb_rating": "Everyone 10+"}