{"id": 309221, "slug": "blackjack-21-table", "name": "Blackjack: 21 Table", "name_original": "Blackjack: 21 Table", "description": "Welcome to the blackjack tables from all around the globe! Enjoy blackjack in a fun and relaxing environment. Earn coins and gain experience. Can you make it to the Las Vegas table?<br/><br/>FIVE CASINO TABLES<br/>-Sydney<br/>-Macau<br/>-Chicago<br/>-Tokyo<br/>-Las Vegas<br/><br/>Earn daily rewards each day you come back!<br/><br/>Do you have what it takes to beat the dealer?<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/>Queens Membership subscription options<br/><br/>In Solitaire: 300 Levels we offer you the following subscription options:<br/><br/>1. Weekly Blackjack Membership offers a weekly subscription for $7.99 after a 3-day free trial. It includes level up x2 faster, level-up bonus x2, daily bonus x5, auto-refill coins when depleted and removes all ads.<br/><br/>2. Monthly Blackjack Membership offers a monthly subscription for $19.99. It includes level up x2 faster, level-up bonus x2, daily bonus x5, auto-refill coins when depleted and removes all ads.<br/><br/>End of the trial period and subscription renewal-<br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>How to cancel the trial period or subscription-<br/>You can turn off the auto-renew for the subscription whenever you want in the settings if your iTunes account. For more info on canceling a subscription visit https://support.apple.com/HT202039.<br/>When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option.<br/><br/>If you have any questions or comments, feel free to contact us at toolitmedia@gmail.com<br/><br/>This game is available to people of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game<br/><br/>Privacy Policy: https://toolitmedia.com/PrivacyPolicy.php<br/>Terms of Use: https://toolitmedia.com/TermsOfUse.php", "metacritic": null, "released": "2019-03-03", "tba": false, "updated": "2019-10-22T14:37:15", "background_image": "https://media.rawg.io/media/screenshots/63a/63af96d222eedebd6c600df0b747528b_QtEZUuU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Toolit Media"], "genres": [], "publishers": ["Toolit Media"], "esrb_rating": "Teen"}