{"id": 309218, "slug": "tomcat-pop-bubble-shooter", "name": "Tomcat Pop: Bubble Shooter", "name_original": "Tomcat Pop: Bubble Shooter", "description": "Tomcat Pop: Bubble Shooter - A great witch puzzle game by fun game for free on Apple Store. My friends talking about tom cat bubble shooter rescue is great story and very interesting.<br/><br/>You guys are passionate puzzles and love games bubble shooter classic can not be surprised that now in addition to characters like fish, panda is replaced by cat Tom, dog Pulldog muscles, witch cats and mice like Perry in years.<br/><br/>This is a classic shooting game, but you should not compare tom cat pop bubble shooter with panda pop or panda bubble shooter because each games has its own characteristics and new character.<br/><br/>Let's have Tom Cat eat cookie &amp; candy increased strength, before shot up the bubbleshooter so that the Pulldog muscular dog saves the poor Perry mice being trapped by wildcat cats.<br/><br/>The mice Perry are trapped in the ball or bubbles witch and when the ball explodes they will be freed from flying back down to a safe place.<br/><br/>Tomcat bubble shooter is not game online but games of the year on the world because by far the best graphics and sound effects, designed to fit all smartphones and tablets.<br/><br/>With this special game, perhaps the hottest gaming gamers have exclaimed: the game is too fun and too good, you can play games and entertainment whenever you are on the plane, on the train Electricity, cooking or being in the office. All ages, children, adults, workers, gold digger, crocodile can play and feel satisfied.<br/><br/>- Play game anywhere and anytime ! Don't care you have wifi or not because game doesn't require you always online. You can play it on the street, in the subway, in the car or bus on the road, even in a temple, a school. OK? Just simply is offline game.<br/><br/>- Game are made for everybody, all age , boy or girl, children or adult , men or women, under or over 18 age. <br/><br/>You can Match three bubbles to pop them in this magical shooting adventure games. My game Bubble Pop is witch completely free to play.<br/><br/>-------How to Play bubble witch ------<br/><br/>Starting with Tomcat Pop: we have to take on the role-play of cat Tom responsible friend, Shrimp trying to throw the ball to our Pulldog athlete dog, when receiving Pulldog ball immediately actions, The miracle that our dog constantly solves the poor Perry mouse locked in the ball filled with the poison of magic witch cats.<br/><br/>When playing you also need good strategy thinking, you must use the balls of the right color and match 3 bubbles, use free items or you can buy them in the shop to increase the power to complete the task in a way. Easier and faster.<br/><br/>Unlike bubbles shooter games classic, doorways and pass level screens, the Tomcat Bubble has truly evolved with 1000 levels and continuous builds, graphics, sound effects that are incredibly attractive to bring is fresh and interesting for the players. New levels ensure the game's difficulty, appeal and balance, which is expected to be updated from 2017, 2018, 2019 and possibly 2020, and possibly many years on. Later on to serve players around the world.<br/><br/>--------The Functions-------<br/><br/>- Daily gift 20 coins receive ( all week: 2, 3, 4, 5, 6, 7)<br/><br/>- Over 2000 challenges<br/><br/>- Make easy money with pay-per-view videos, the more watch video you make, the more money you will earn.<br/><br/>- All natural wonders in the world are included in the background as 3D.<br/><br/>- Bubble Island for background very nice<br/><br/>- Connect Facebook you are offered 40 coins and more your friends can see you are playing to any level, increase the competitiveness and competition, challenge online. Do not let your friends complain you are a chicken!<br/><br/>- Do not play more than 6 hours a day, spend the rest of 18 hours relaxing, working, exercising, watch football and pets if you want to.<br/><br/>And now don't angry because wait to long. Download &amp; Install on Mobile Tomcat Pop: Bubble Shooter - One of the best shoot bubble deluxe ball game for free, Play to fulfill your mania.", "metacritic": null, "released": "2017-12-18", "tba": false, "updated": "2019-07-29T18:17:43", "background_image": "https://media.rawg.io/media/screenshots/db3/db35e1bbc1f731a604ffb17ca77857ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOBIONE TELECOMMUNICATIONS TECHNOLOGY AND SERVICE CO"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["MOBIONE TELECOMMUNICATIONS TECHNOLOGY AND SERVICE CO"], "esrb_rating": "Everyone 10+"}