{"id": 309236, "slug": "dark-parables-goldilocks-and-fallen-star-full", "name": "Dark Parables: Goldilocks and Fallen Star (Full)", "name_original": "Dark Parables: Goldilocks and Fallen Star (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>Can you come to the rescue to save the kingdom of Barsia? The Queen is desperate, as the citizens are being attacked by strange mechanized beasts. In addition, the discovery of a powerful and mysterious artifact has the kingdom on the brink of war. It looks like you’ll have your hands full with this mythical quest, but be careful, everything is not always as it seems!<br/><br/>• HELP THE PRINCESS WITH THE GOLDEN TOUCH<br/>The beautiful Princess Leda has the ability to turn things, and even people, into gold. Is there something else behind her strange power, and does she hold the key to peace in the realm?<br/><br/>• CAN YOU FIND THE FABLED FALLEN STAR?<br/>Search throughout the land in a world of fantastical hidden object scenes.<br/> <br/>• PIECE TOGETHER THE FRAGMENTS OF A LEGEND<br/>The story unfolds as you solve vivid puzzles and magical mini-games.<br/><br/>• FIND OUT WHY JACK CAME BACK IN THE EXCITING BONUS CHAPTER<br/>Discover the reason for his return and enjoy additional Collector’s Edition exclusives including collectible Snowflakes, morphing objects, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-11-09", "tba": false, "updated": "2019-10-22T14:37:16", "background_image": "https://media.rawg.io/media/screenshots/5b6/5b65d4f5d938fc8d4a4cbf1240f2ec48.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}