{"id": 309340, "slug": "venture-the-void-itch", "name": "Venture the Void (itch)", "name_original": "Venture the Void (itch)", "description": "<p>A space adventure. <br/></p>\n<p>Music by D. Morgan Lapis aka Lapine (https://soundcloud.com/morganlapis)</p>\n<p>⁂\r\n<br/></p>\n<p>This game was an unresolved point for me for a long time, and I'm now so happy to push it back out, imperfect into the imperfect world.</p>\n<p>I built this between 2001 and 2006, and I somehow dreamed it would be a famous and loved game. At that point in my life, I didn't know how to be happy and proud of something created without feeling like it had to earn a bunch of money. What a terrible way to look at the world! I wonder if other game makers feel that too?</p>\n<p>I think another element was that criticism was very harsh at the time toward any game not made to a certain standard. Cave Story came out in 2004 but actually I didn't know anything about that, or other \"indie\" games. I'm not sure if websites like TIGSource were around or busy then; I'm sure that the GameMaker community existed but I also somehow didn't know about that. So I felt compared, and compared mself, to AAA games. Silly, but there wasn't a wide understanding at the time-- or <em>I</em> didn't have that understanding-- that games could be interesting enough to make up for their technical-artistic shortcomings. <br/></p>\n<p>This is a long way of saying: when people ripped into how bad the game looked-- or it's thousand other flaws-- it was fairly devastating.</p>\n<p>The other part of this is just the sheer time and effort, and the awkwardness of the code base by the time it was finished. I didn't know how to manage a project to reduce creative friction, and I didn't know how to manage my life to make sure I wasn't hedging happiness on things out of my control (i.e., whether people like what I make.)</p>\n<p>Shortly after the game came out, I felt it was a failure. A bit after that, I (basically) dropped it.</p>\n<p>⁂</p>\n<p>For most of the time since then I think I've been trying to forget it and move on. That makes some sense, but I've also always told myself that the game really was terrible.</p>\n<p>The thing is, if I'm honest with myself, I realize now: it... <em>isn't?</em><br/></p>\n<p>A few years ago No Man's Sky was becoming The Everything and it made me wonder, perhaps there will be some interest in Venture the Void? It was enough to make me dust it off. I thought there was a chance to kind of ride the wave or something, since the premise is similar. Maybe I could redeem it, or it could redeem itself, or I could redeem myself through it redeeming me.<br/></p>\n<p>And yet, something I couldn't articulate gave me a bad feeling in the pit of my stomach. When I played it, I just couldn't feel good about it. I remember sweating suddenly at some point. (Why?) So even though I had now put some time in and gotten a working build, well, I pretty much dropped it again.</p>\n<p>⁂</p>\n<p>That brings us to now. I think the thing I couldn't articulate is, man, wow: if you make something and want to put it out there, you absolutely should not have to apologize for it. (Mostly not. I do a bit, and I don't apologize for apologizing, here: for instance it's sexist, and has bugs.) You can be proud of something even if it's not important to anyone else.<br/></p>\n<p>And a natural (but not obvious) outflowing of this is that personal expectations for how other people might respond to something you make or how much attention it might get, well-- they are actually unbearable. <br/></p>\n<p>I can't be alone in this.</p>\n<p>Maybe the only way out, and by this I mean the only survivable orientation when it comes to these expectations, is to <em>just have none.</em></p>\n<p>⁂</p>\n<p><strong>Features:</strong></p>\n<ul><li>Explore automatically generated worlds full of a lot of amusing scenarios.</li><li>Land at cities, converse with people, and transact the econiminominies with a text adventure interface. This is actually the best part of the game.</li><li>Shoot things and get cargo and sell it. Elon Musk's vision for humanity's future in space is actually better than this, but I didn't do that one.</li><li>From a period in my life when the internal logic of a thing could become so wrapped up in itself, and me in it, that I couldn't understand how something arbitrary to the point of hilarity would not immediately be felt with gravitas. This is special; I love it when I experience it in other people's games. It's like an FM synth with a feedback channel, the creator wired back into their own wiring. I think to reach this point you must immerse yourself to where you a little bit lose touch with reality; I probably won't do this again, or else, I'm still doing it and just won't realize it until I look back. I don't think it makes for sensible games but it's something more people should put on their feature lists, I think.</li><li>Actually a technical marvel, if ugly.</li><li>A big opaque monstrosity, if you are into that. I will try and make some YT videos of the basics though.</li><li>Full of bugs, but actually most of these are of the bad \"I need to restart the game\" kind and not the amusing kind; I will try and fix them and introduce the other type instead if I can.</li></ul>\n<p>⁂</p>\n<p><strong>Plan for the Future:</strong></p>\n<ul><li>I might do nothing with this, but really why I'm releasing this is I just want to have a project to interactively doodle on. So I am at least <em>hoping </em>to make a bunch of incremential improvements.</li><li>Not sure what else to say here, ultimately I have another megaproject that I am dedicated to completing (Paradise Never) and pushing this out was sort of a planned break from that game, so in reality I might not have energy for any huge improvements, but. Incremential ones, I hope.</li><li>To support the incremential nature of the hoped-for improvements, I've made myself a nice build and release pipeline, which is actually the main amount of work I've done the last month or so getting this ready. I know there are bugs but like, wow, it is just such a relief to know that I can literally fix them and run a single script to push an update to everyone. To that end, I am so grateful to itch.io.</li><li>Incremential aside, I'm hoping to morph the game gradually into something unrecognizable. In particular I want to experiment visually a lot with it. I'll try to keep installers for old versions hanging out on the itch.io page in case anyone grows attached to a previous version.</li><li>In conclusion, I definitely either will or will not make any improvements beyond where it's currently at. Purchase with confidence!</li><li>I always wanted to call the game something other than \"Venture The Void\", but that name felt marketable (!?) to me so I used that instead. I'll rename it to what I originally wanted to call it, at some point, when I feel like it.</li></ul>\n<p>⁂</p>\n<p><strong>System Requirements</strong></p>\n<ul><li>This will run on like a toaster but not that well. Right now it's OpenGL 1.2, that will change to 3.3 at some point which is a big jump. Does your computer do OpenGL 1.2? The answer is: <em>yes. </em></li><li>If you have a really super old computer with integrated graphics (intel HD with three not four digits, aka 450 or something)  it might work but it also might melt your graphics chip while it runs very slowly. If you have any kind of modern computer it will probably run very good.</li><li>It looks better on NVIDIA becuase it uses an incredibly obscure extension called \"combine4\" which was never implemented anywhere else, even to this day, and is used everywhere in the game. So the game looks totally off on AMD cards or integrated intel. I'm sorry, I wish I was making this up. I want to fix it.</li><li>I don't really know how much memory it needs, sorry. Not a specially lot.</li><li>It needs a few gigs of disk space, because it caches generated things.</li></ul>", "metacritic": null, "released": "2019-04-14", "tba": false, "updated": "2019-04-15T03:08:56", "background_image": "https://media.rawg.io/media/screenshots/a48/a4850628b0284b7b5e31e87fa839ea7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kitty Lambda Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}