{"id": 309452, "slug": "pixel-art-witchcrafter", "name": "Pixel Art Witchcrafter", "name_original": "Pixel Art Witchcrafter", "description": "<p><strong>Pixel Art Witchcrafter</strong><em><br/>demo</em></p>\n<p>Estel was found as a newborn in the forest by an old man when stars were falling. He raised him and taught everything about the world and magic. \\n One day brown-skinned monsters breached into their house and kidnapped the old wizard. After the shock, Estel embarked on a journey to find his patron. With his magic crafting skills, willpower and a help from a local folks he managed to reach the mountains, where probably a general of a brown-skinned squad is detaining the old man…<br/></p>\n<p>Dive into the fantasy world when magic crafting skills are used by the gifted protagonist to survive the aggression of the Southern Empire, where a mighty emperor sacrificed his own people's souls to pact with a demon and have one of the greatest army of the brown-skinned killers.</p>\n<p>This encounter is a demo of what I imagine it to be like, prepared specially for <strong>Unofficial Defold Game Jam #1.</strong></p>\n\n<p><strong><em>Controls:</em></strong></p>\r\nKeyFunctionComment[A] [D] or arrowsmovement[space]jumpLMBattack / shearRMBthrow a magic misslewhen holding a swordQconjure a magic trapwhen holding a swordEcast a magic buff on yourselfwhen holding a swordFtake out a Focus boardwhen Elemental Energy is below 0 \r\n\n<p><strong><em>Credits:</em></strong></p>\n<p><strong>Game designed and created by Paweł Jarosz</strong><br/>Art thanks to rvros and ansimuz<br/>Sounds thanks to qubodup<br/>A lot of support from Defold's community: britzl (Monarch and Gooey), Pkeod, sergey.lerg, AGulev, rgrams (Rendercam), TheKing009, sven, selimanac and others &lt;3</p>", "metacritic": null, "released": "2019-04-14", "tba": false, "updated": "2019-08-28T23:17:07", "background_image": "https://media.rawg.io/media/screenshots/018/018ba92c8e8071abd0c33a032e5488d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["paweljarosz"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}