{"id": 3094, "slug": "post-brutal-post-apocalyptic-zombie-action-rpg", "name": "Post Brutal - Post Apocalyptic Zombie Action RPG", "name_original": "Post Brutal - Post Apocalyptic Zombie Action RPG", "description": "POST APOCALYPTIC AND BRUTAL<br/><br/>Post Brutal is a 3D action RPG experience that puts you at the centre of the zombie apocalypse. Enter the quarantine of City Zero and band together with other survivors struggling to survive in the aftermath of The Event, the cataclysm that drove over half the city&amp;#39;s population into a feral frenzy.<br/><br/><br/>PLACE YOURSELF IN THE GAME<br/><br/>• Give your character your own face in the game, with FaceRoom<br/>• Record your own voice for in game conversation, with VoiceRoom<br/><br/><br/>INTENSE, DYNAMIC COMBAT<br/><br/>• Fast paced, gore soaked action<br/>• Use Adrenaline Rush to slow time<br/>• Assemble an arsenal of over 28 diverse weapons (and growing!) <br/>• Switch between ranged and melee combat with ease <br/>• Your choice of armaments allow for tactical, diverse battles<br/><br/><br/>SNEAK, STEAL, STRIKE<br/><br/>• Use stealth to move unseen and elude your enemies<br/>• Silently dispatch unwitting prey with the Assassin skill<br/>• Open new routes and help yourself to loot with lock picking<br/><br/><br/>MEANINGFUL CHARACTER DEVELOPMENT<br/><br/>• 10 Skills to choose from, 30 skill level upgrades<br/>• Tailor your character to your play style<br/>• Skill levels are not just better statistics, but tangible benefits with noticeable differences<br/><br/><br/>BECOME PART OF THE STORY<br/><br/>• A rich setting with an engaging story<br/>• Explore the ruins of City Zero<br/>• Get to know fellow survivors through dialogue<br/>• Discover what is happening in the wider city through emails and journals<br/>• Unravel the mystery behind The Event<br/>• Enter the daily struggle against the bestial Afflicted and the sadistic Raiders<br/>• Your actions decide the fate of other characters<br/>• Multiple campaign story branches and endings<br/><br/><br/>COMPLETE MISSIONS YOUR WAY<br/><br/>• Complete objectives your own way; no one solution is more valid <br/>• Berserk assault, covert operations, or negotiation; it&amp;#39;s your choice<br/><br/><br/>THE STRUGGLE GOES ON<br/><br/>• Renewable Patrol missions mean endless replayability<br/>• Tackle multiple mission types<br/>• Contribute to the cause, gain experience, fill your pockets<br/><br/><br/>A CHALLENGE BEYOND BRUTAL<br/><br/>• Complete over 60 achievements to prove your skill and earn rewards<br/>• Conquer high difficulty modes for all new challenges<br/>• Unlock an exclusive achievement based weapon<br/><br/><br/>CONTROL THE CHAOS<br/><br/>• Position and scale the core Touch controls<br/>• Compatible with joypads<br/><br/><br/>The children of The Event are closing in. The zombies of The Afflicted want your flesh. The Raiders want you to suffer. Your choices will shape the future of the disaster struck city that wants you dead. <br/><br/><br/>=================<br/>PREMIUM UPGRADES<br/>=================<br/><br/><br/>Post Brutal is completely free to download! You can play Patrol missions, access the hub town, level up your character, and unlock almost all weapons and equipment without purchasing any of the premium upgrades! <br/><br/>Player customisation is a premium feature but is temporarily available during the tutorial missions. The core story-based campaigns are also premium. Finally, Post Brutal must be online unless you unlock the &amp;quot;Play Offline Without Ads&amp;quot; IAP.<br/><br/>You can choose to upgrade any of these features whenever you like!<br/><br/><br/>==============<br/>LOCALIZATIONS<br/>==============<br/><br/><br/>English is the only language officially supported. As a convenience to our international players, we have implemented automatic translations in Spanish, Italian, German, French, Portuguese, Russian, Simplified Chinese, Korean and Japanese (powered by Yandex.Translate).<br/><br/><br/>=============<br/>REQUIREMENTS<br/>=============<br/><br/><br/>POST BRUTAL has been designed for iOS devices with at least 1GB of RAM (iPhone5+, iPad 3+, iPad Mini 2+, iPod Touch Gen 6+). Older devices may work but will not be supported.<br/><br/><br/>===========<br/>FOLLOW US!<br/>===========<br/><br/>http://www.helltap.com<br/>http://www.facebook.com/helltapgames/<br/>http://www.twitter.com/helltap", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-10-22T14:28:17", "background_image": "https://media.rawg.io/media/screenshots/4c8/4c8f96c503cd87f39a32bc21d65acfab.jpeg", "website": "http://www.postbrutal.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hell Tap Entertainment"], "genres": ["Action", "RPG"], "publishers": ["HELL TAP ENTERTAINMENT"], "esrb_rating": "Mature"}