{"id": 309512, "slug": "primeum-beta", "name": "Primeum [Beta]", "name_original": "Primeum [Beta]", "description": "<p>Fall into a world of fighting and survival.  Unlimited ammo, 3 lives, 149 waves, no power-ups.  Earn points for killing monsters and after all 3 lives are used up your high score is saved.</p>\n\n<p><strong>CONTROLS</strong></p>\n<ul><li>Movement: WASD</li><li>Aim: Mouse</li><li>Shoot: Mouse Left Click</li></ul>\n\n<p><strong>DESCRIPTION</strong><br/></p>\n<p>This is a game that I started developing on Christmas 2018 because I was bored and had a cool idea.  The last time I really worked on it was in February 2019 because I got busy with school.  I'm getting back into it now because I was inspired by all the creators here on Itch.</p>\n<p>I coded this game from scratch using Python, PyGame (a Python library for making games), and PyInstaller (a Python library for converting Python scripts to Windows executables).<br/></p>\n<p>Itch's definition of prototype fits this game really well.  It's a test and showcase of my abilities and just something fun that I enjoy doing.<br/></p>\n<p>This is the official open Beta. <br/></p>\n\n<p><strong>NOTES</strong></p>\n<ul><li>There's a cut scene that has a blank notebook page that I haven't filled yet.</li><li>The ending is super lame.  I've never reached the end on just the 3 lives, but I wouldn't be surprised if someone else did.  So once you get there don't say I didn't warn you.</li><li>I don't have any credits yet in-game but everything was made by myself.</li><li>V3 has the original graphics made with Adobe Illustrator</li><li>V3-1 has the new (and my favorite) graphics made with JPixel by Emad</li><li>It's the same game otherwise</li><li>After all three lives are used up, different dialogue boxes will appear depending on your progress.  These can be rude but are meant to be comical.  Adjustments will be made based on feedback given, so be sure to give feedback.</li></ul>", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2019-08-28T23:17:06", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c86e9c204871e2805cd23dd42d76570.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aaron"], "genres": [], "publishers": [], "esrb_rating": null}