{"id": 309500, "slug": "storm-warning-pre-alpha-mix-codename-shirley", "name": "Storm Warning Pre-Alpha Mix - Codename: Shirley", "name_original": "Storm Warning Pre-Alpha Mix - Codename: Shirley", "description": "<p>What has five wheels, one leg, a knife for a nose, a shell made of a titanium-mithril alloy, and is spoken of in tall tales by the robots of Oppidia? Cutron McGee, the sole playable character of this one-level proof of concept. The concept being \"I can make games.\"</p>\n<p>This is my first game, it's not much (considering there's no animation), but it's a start of something much bigger.</p>\n<p>If you're good, you can beat it in less than a minute, not counting the credits sequence.</p>\n<p>What's with the name? \"Storm Warning Pre-Alpha Mix - Codename: Shirley\"? Sounds like it's one math away from being a snide Kingdom Hearts parody, doesn't it? Well, my overall project is named Storm Warning, this work is kinda like a Pre-Alpha, the Mix part is an honest homage to Kingdom Hearts' Final Mixes. As for Codename: Shirley? Because I am serious, and don't call me Shirley.</p>\n<p>Curious about all this and where this will lead? Well, follow me on Twitter (@PantaroP) or my secondary Tumblr (@Cutron, I'd link my main account but it's mostly general bloggery). </p>\n<p>The download contains a version of the game for those working with 32-bit Windows and a version of the game for those working with 64-bit Windows. If you're using Mac, you're out of luck. For now anyway.<br/></p>\n<p>80% of the donations will be given to charity.</p>", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2019-04-15T03:51:46", "background_image": "https://media.rawg.io/media/screenshots/ad5/ad5984e66dbfb82644a085685cdf9991.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["David Dalziel"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}