{"id": 309601, "slug": "runaway-burning-sky-games", "name": "Runaway (Burning Sky Games)", "name_original": "Runaway (Burning Sky Games)", "description": "WILL YOU RUNAWAY?\r\n<p><em>With only a can of spray paint and a mix of maneuvers at your disposal, resist your rival gangs battling to control your decaying home in this 2D, punk-rock parkour platform.</em></p>\n<p>Take to the streets of a collapsed metropolis as you battle warring gangs for control of the city. Leap, dive, roll, and climb through the ruins to tag your mark on your once-beautiful home.</p>\n<p><em>Runaway</em> has been in full development-mode since October 2016 with support from Drexel University’s Entrepreneurial Game Studio. Through the Xbox Creators Program, Burning Sky Games plans to release a multiplayer-focused version of <em>Runaway</em> to the Xbox One and Windows digital stores in August 2019 with a larger, narrative-driven version to follow later.</p>\r\nTHE WORLDTHE GANGSAND YOUA city ravished by capitalism and suffering the consequences.Rising to reform, but each believe they are the best, gangs form and war breaks outFed up with the injustice and indifference, you help the Sparks, gang of the people.\r\n\r\nTHE PUNK ROCK OF GAMES\r\n<p><strong>Burning Sky Games</strong> is an independent Philadelphia-based studio engaging players in gritty action and unapologetic narrative—the punk rock of games. <em>Runway</em> is the first game in development by Burning Sky Games. <br/></p>\n<p>For us, punk rock is an identity. It is a community that has embraced us with open arms. A shared love of punk rock is what brought us together, and it’s what inspires us to create. But why games? Video games are a unique medium because they involve their audience. That way, people can engage with the spirit of punk rock instead of just listening to it. Our games resonate with fans of the music like us and allow people to explore and connect with it as they make memories of their own.</p>\r\nFollow our social media\r\n<p>Twitter | Instagram | Facebook</p>", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2019-04-15T04:19:51", "background_image": "https://media.rawg.io/media/screenshots/b45/b45ca3ad31c72eba0a5505ebf5ce817e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Burning Sky Games"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}