{"id": 309667, "slug": "jet-sky", "name": "Jet Sky", "name_original": "Jet Sky", "description": "<p>Pick your plane, grab your friends, and soar through the skies in this retro multiplayer hero shooter!<br/></p>\n<p><strong>THIS GAME IS CURRENTLY IN OPEN ALPHA, AND BUGS AND ISSUES ARE EXPECTED. MORE CONTENT, INCLUDING NEW MAPS AND VEHICLES, IS PLANNED FOR THE FULL RELEASE, WHICH WILL BE A PAID VERSION.<br/></strong></p>\n<p><strong> Please contact us with questions and feedback at  our Feedback Report Form. </strong> <strong>Also, consider </strong><strong>joining the community Discord Channel and watching this Tutorial to connect with other players and to get the most out of your flying experience.</strong><br/><br/>Jet Sky is a singularly retro multiplayer experience - a throwback to the early nineties when pixels ruled the sky. <br/></p>\n<p>Select from 3 different airplanes, all with unique abilities suiting their play style. Fly as the lightning-fast F-6 Viper Interceptor, confuse your enemies as the slippery AH Mojave Helicopter, and heal and resupply your team as the C-37 Duck Strategic Support Plane.</p>\n<p>Conquer the skies with your team in intense 3v3 battles, on several different maps ranging from locales all around the world. Compete for your personal high score while avoiding the deadly missiles and cannons of the enemy.<br/></p>\n<p>Additionally, this game features a peer-to-peer networking model that gives players the freedom to host their own games and connect with their friends. This eliminates the \"game as a service\" model, and prevents the inevitable shutdown of external servers, which means when you buy this game, you <em>own</em> this game in perpetuity. Once purchased, you can play the game with anyone else who owns a copy.</p>", "metacritic": null, "released": "2019-04-12", "tba": false, "updated": "2019-08-28T23:17:05", "background_image": "https://media.rawg.io/media/screenshots/034/034c2b3b16dc3ca525f636c4208e5935.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CptDrunkBear"], "genres": ["Action"], "publishers": [], "esrb_rating": null}