{"id": 3096, "slug": "screambox", "name": "Screambox", "name_original": "Screambox", "description": "Screambox is your destination for horror entertainment, the way it was meant to be consumed: no filters, no restrictions, no distractions. It’s that simple. A destination that celebrates, discusses, and indulges in your nightmares, your worst fears, and terror of the unknown. If you can handle the fear, if you’re not afraid to scream, then you’re one of us. Watch on the big screen with new Screambox PS4™ and PS3™ apps. Only $3.99 after trial, cancel anytime online.<br/><br/>Start your free 14-day trial now at www.screambox.com/signup/PS3 <br/><br/>Screambox Facebook: www.facebook.com/ScreamboxTV<br/><br/>Screambox Twitter: https://twitter.com/SCREAMBOXTV<br/><br/><br/>1 player<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).<br/><br/>Screambox and its suppliers own all rights, title and interest in the Screambox Properties. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Website, the Services, or the Screambox Properties.  During your membership, we grant you a limited, non-exclusive, non-transferable, license to view movies through the Services on a streaming-only basis for that use. Except for the foregoing limited license, no right, title or interest shall be transferred to you. Unless otherwise specified by Screambox in a separate license, your right to use any Screambox Properties is subject to the Terms.", "metacritic": null, "released": "2015-10-30", "tba": false, "updated": "2019-08-02T16:24:38", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Scream Entertainment"], "genres": [], "publishers": [], "esrb_rating": null}