{"id": 309781, "slug": "open-wheel-manager", "name": "Open Wheel Manager", "name_original": "Open Wheel Manager", "description": "Open Wheel Manager - is a tactical manager for the open wheel race fans.<br/>In the game are respected classical for race management genre principle of indirect control - you will not have to press KERS button every second during the race, or open and close DRS. Your main goal as a race manager is to develop the fast car, to hire pilots and to select right race strategy.<br/><br/><strong>KEY FEATURES:</strong><br/><ul><li>12 teams in Championship, 40 pilots, 9 engine suppliers;<br/></li><li>4 types of facilities;<br/></li><li>Car development from project to parts production and installation on the car;<br/></li><li>Contracts with pilots, key staff, sponsors and suppliers;<br/></li><li>Growth of parameters in young pilots and veterans regress;<br/></li><li>Realistic transfers of pilots between teams based on the reputation system;<br/></li><li>2D race engine;<br/></li><li>Game save and load with the opportunity of parallel several careers starting.</li></ul><br/><strong>MODS</strong><br/>The game structure makes it easy to change initial data:<br/><ul><li>Pilot and team names, parameters - all this is easy to edit in SQLite data base format;<br/></li><li>Change team-logoes, tracks and trajectories to them overwriting the svg-images in the game folder;<br/></li><li>Language files could be edited in the simple notepad. New translations from the language folder are loading automatically;<br/></li><li>We add the opportunity to keep several mods simultaneously and select the desired one at the start of the new game.</li></ul><br/><strong>BUGS</strong><br/>We understand that there are can be bugs in the game, that can crash the game. So, we've made the auto-save function, for you don't lose the data in the game.<br/>In case of game crashes, please, leave bug-report in one of our communication channels.", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2023-07-17T05:10:08", "background_image": "https://media.rawg.io/media/screenshots/742/74274968910ff4f182dcbd5b3bdd61c9.jpg", "website": "https://open-wheel-manager.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paprikash.Works", "Paprikash Games"], "genres": ["Strategy", "Sports", "Racing"], "publishers": ["MicroProse", "Paprikash.Works"], "esrb_rating": null}