{"id": 309758, "slug": "in-defense-of-aliens", "name": "In Defense of Aliens", "name_original": "In Defense of Aliens", "description": "JOIN US!Please join our discord for access to our beta builds and help us shape the game: https://discord.me/inDefenseOfAliensOVERVIEWIn Defense of Aliens dares players to be the best they can be in defending allied civilizations from onslaughts of militant aliens all across the galaxy. Success lies at the intersection of strategic tower defense and fast-paced 3rd player combat. With a range of settings to amp up the difficulty, the challenge won’t just come from killing these space invaders, but also how you choose to off them. Get creative with In Defense of Aliens and experience lush battlefields, unique worlds, and 4 character types each with their unique play style and progression systems.BACKGROUNDDevelopment of this game started more than 5 years ago as a way to teach my two sons and my daughter about programming. As a family, we were hooked on Dungeon Defenders and my son was obsessed with drawing alien creatures. We mashed them together with a father's desire to show his kids that they could not only play video games, but they could also learn to create them, and that was the original genesis of our game. Fast-forward to present day and my sons are at college (one studying Computer Science and the other Business with a CS minor) and this game has become a passion project for me and my daughter (still in high school). We've been fortunate to enlist the help of some great indie-friendly artists, animators, developers, sound engineers and an amazingly supportive community on our discord server. <br/><br/><br/>It's been an incredible family journey and we're excited to share our creation with the world!KEY FEATURES<ul><li><strong>MULTIPLE CLASSES:</strong> 4 unique classes each with 3 abilities, 7 towers, and 4 weapons<br/></li><li><strong>TACTICAL CONTROL:</strong> Keyboard+Mouse and FULL game controller support<br/></li><li><strong>PLAY WITH YOUR PALS:</strong> Upto 4 of you and your most heroic buds can team up and play online or just you and your bestie can play on one machine in local coop split screen mode<br/></li><li><strong>SHOW ‘EM WHO’S BEST!:</strong> Get creative with your kills and build up huge combos for points. Show off your skillz on the leaderboard to flaunt your success.<br/></li><li><strong>PLAY IT AGAIN, SAM:</strong> With numerous strategies to employ and weapon/ability/tower combinations to build, killing aliens never gets old. Designed for replayability as you strive to beat your best time with the ultimate meme build<br/></li><li><strong>MULTIPLE WORLDS:</strong> Coming soon ...  3 unique planets under siege plus the final episodes on Earth! NOTE: Only the 1st planet is available in Early Access -- additional worlds and Earth are planned for the full release</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:27", "background_image": "https://media.rawg.io/media/screenshots/679/6798a4bfcfe352a69c60e0424d1381eb.jpg", "website": "http://InDefenseOfAliens.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kicksome Entertainment"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Kicksome Entertainment"], "esrb_rating": null}