{"id": 309818, "slug": "combat-helicopter-vr-surgical-strike", "name": "Combat Helicopter VR - Surgical Strike", "name_original": "Combat Helicopter VR - Surgical Strike", "description": "Combat Helicopter VR - Surgical Strike is an Action-Adventure based game. You are a commander of a region, and you need to perform surgical strikes at Buckta's region in an F198 Helicopter in Virtual Reality. <br/>Our region, Kalta has been destroyed by Enemy Buckta's. Buckta's are having very modern technology equipment and military facilities.<br/>You have to take revenge on behalf of all at Kalta. You are the commander of an F198 Advanced Helicopter of Kalta Region. You have to infiltrate into Buckta's Military base camps and destroy them all. <br/>Kalta's Intelligence has got secret information, Buckta has a strong infrastructure, military facilities, and power plants. There are also several Mechanical auto turret systems, and Buckta Air Defense System where you need to destroy them all, shoot em down and make the world a better place to live. You are given objectives to perform surgical strikes in the game. <br/><br/>This is an Interactive Virtual Reality based game, Interactions are present to control the Helicopter, Use Helicopter Weaponry and external equipment to tackle.  <br/><br/>Help us save Kalta and make the world a better place to live. <br/><strong>\"KALTA NEEDS YOU\"</strong>.<br/><br/>Game Experience<br/><ul><li> This game is equipped with Helicopters, Turrets, Enemies, Army Tanks, Vehicles equipped with Automated Defense Systems, Drones, Military Facilities, etc.<br/></li><li> This game features Helicopter Control Mechanism in Virtual Reality, You can throw grenades on enemies while in a helicopter. Perform Tricks and Have a real like unique experience in the game.<br/></li><li> Game Modes -<br/>a) Day Mode - 4 Enemy Bases<br/>b) NIght Mode - 3 Enemy Bases<br/>c) Sea Shore Mode - 1 Enemy Bases.<br/></li><li> Beautiful Environments to fly around and relax.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:23", "background_image": "https://media.rawg.io/media/screenshots/ef0/ef094fc9345d65c324369bee8b4e3d63.jpg", "website": "https://gaming.skrots.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 530, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harsh Bakshi"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Skrots Game Studios"], "esrb_rating": null}