{"id": 309941, "slug": "crafty-lands", "name": "Crafty Lands", "name_original": "Crafty Lands", "description": "Craft and explore endless vast worlds!<br/><br/>Create and build new lands freely and discover new realms filled with epic block-based constructions and fun characters to interact with! Travel across epic worlds you can mold and build any way you want!<br/><br/>Live thrilling adventures as you explore and discover new places in expansive lands, all full to the brim with incredible creative possibilities! Dive into a whole new crafting universe and build your own adventures and stories, in a game perfect for creative kids!<br/><br/>Craft blocks and build anything you can imagine in expansive and fully explorable sandbox worlds! Build and craft houses, castles, fortresses, villages and even an entire city or your very own crafting realm!<br/><br/><br/>HIGHLIGHTS<br/><br/>• Explore vast worlds filled with epic constructions!<br/>• Fly around worlds and lands freely! There's no building you can't get to the top of!<br/>• Build and Craft ANYTHING!<br/>• Create your own house, castle, village and city. Let your creativity loose!<br/>• Play with a simple interface and craft your dreams easily!<br/>• Interact with fun block characters, and animals and pets!<br/>• Create your own stories and adventures while exploring diverse sandbox worlds!<br/>• Play freely with diverse blocks and place cubes however and wherever you want!<br/>• Explore, create, craft and build with different tools!<br/>• Use your construction skills with simple and fun building mechanics and mine your imagination to create your own lands and realms!<br/>• Enjoy endless hours of fun for kids and all creative and crafty minds!<br/>• Explore all the building possibilities and use your blocks and cubes with free and creative gameplay!<br/><br/><br/>Explore a whole realm of free crafting and building fun and discover every nook and cranny of vast and exotic worlds! Craft your own way to play and have fun flying around incredible lands made of crafting cubes and blocks!<br/><br/>Make the most out of the simple and fun building tools! Start with a small house, then use more blocks and cubes to craft more houses and buildings and soon you'll have your own village or city with residences, public buildings, parks and even a mine!<br/><br/>Have fun playing with different blocks and building tools in a crafting game for kids and anyone else who likes to craft, create and build with a wide variety of cubes! Make worlds with lands crafted to realize your creative vision and fill it with epic castles, humble houses, ancient constructions and whatever else you feel like building!<br/><br/>Kids who like to build, kids who like to craft, or anyone else who feels like creating something awesome and epic: dive into the Crafty Lands right now!", "metacritic": null, "released": "2019-04-11", "tba": false, "updated": "2019-10-22T14:37:19", "background_image": "https://media.rawg.io/media/screenshots/013/0130f00a5f20229a1483eb27b2d3c395_Jsn5D3Z.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayKids"], "genres": ["Adventure", "Simulation"], "publishers": ["Movile Internet Movel"], "esrb_rating": null}