{"id": 309922, "slug": "lophis-roguelike", "name": "Lophis roguelike", "name_original": "Lophis roguelike", "description": "<p>We fused card games and roguelikes together to make the best single player deckbuilder we could. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and Dark Dungeon Survival -Lophis Fate Card Rougelike is a single-player RPG card game.<br />\nThe game incorporates the popular Roguelike game elements and creates rich unknowns and diversity, ensuring that the game experience is different for each time. In the game world, players need to make choices when encounter emergencies, and defeat the enemies in the adventure combat by establishing card group strategies so as to complete the adventure tour of the roles.<br />\n【Independent role story】<br />\nThere are six different careers of roles with different career skills and exclusive cards. Each role has an independent plot and independent battle ending.<br />\n【Different chapters of the plot】<br />\nA total of four chapters are included. Maps and the regional guardians of each chapter are randomly generated. Players need to defeat the final boss to clear the stage.<br />\n【A Large number of emergencies】<br />\nRandom emergencies will occur during the game and different decisions need to be made so the entire adventure may be influenced. Currently more than 60 emergencies have been designed in the game.<br />\n【Brain-burning card group building】<br />\nThe card group building in the game adopts the method of DBG, which means players do not have to choose from a big card pool to build their own card group. There will be a set of initial card groups according to different careers. Players can constantly acquire other cards during the game process and gradually perfect the card groups that are suit them.</p>", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2019-11-11T15:34:25", "background_image": "https://media.rawg.io/media/screenshots/74f/74f749933c0843c0119564dcd453c156.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["DreamSky"], "genres": ["Adventure", "Card"], "publishers": ["Dreamsky Technology Co"], "esrb_rating": "Everyone 10+"}