{"id": 309982, "slug": "truck-parking-drift-car-drive", "name": "Truck Parking: Drift Car Drive", "name_original": "Truck Parking: Drift Car Drive", "description": "Careful driving and parking at right angle is your key to success in this game. Keep your hand on brake while driving and be ready to use it at any moment. Park your truck carefully and do not harm pedestrians or SUVs of other drivers. Our driving simulator will teach you parking at the right angle carefully and stop your SUV in any moment. While driving through the road, be prepared for parking in any moment. Do not have troubles with police and get ready for parking your truck when it is needed. Do not harm pedestrians or SUVs of other drivers, otherwise police will come to you. Driving wisely is your main target so park your truck at right angle in our new parking simulator: Truck Parking: Drift Car Drive.<br/> <br/>In this parking simulator, your main target is to react fast and park your car in any moment. Pedestrians may appear immediately on a crosswalk. Traffic light may change in any moment. And you never know when train will appear on a railway. If you do not want problems with police, park your truck at right angle and stop without touching anything. You also may find other trucks in traffic jam just choose right angle and evade problems with police. Our driving simulator will help you in training your accuracy. Get ready to park your SUV in any moment, while driving. Keep your hand on brake and park your car without harming pedestrians or trucks of other drivers. Share this parking simulator with your friends and find out who will harm fewer trucks. Compete with your friends and prove them that you can always choose the right angle of your way. Drive as accurate as you can in our new parking simulator and do not bump into trains, pedestrians or other SUVs.<br/><br/>Truck Parking: Drift Car Drive is a free to play parking simulator. Drive carefully and prepare yourself to fast parking. Do not harm pedestrians on crosswalks and evade bumping into SUVs of other drivers or trains on the railway. Keep driving carefully and do not have problems with parking. Just choose right angle for impeccable parking when you see pedestrians or other trucks on your way. Prove everyone that your parking is the most accurate. Call your friends and together find out who will create more accidents on the road. Download our free parking simulator and show everyone how careful you are in parking.", "metacritic": null, "released": "2019-01-30", "tba": false, "updated": "2019-10-28T02:58:18", "background_image": "https://media.rawg.io/media/screenshots/fce/fce61bac1d67318685aac5dc0661b378_PQeo272.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Olga Sandakova"], "esrb_rating": null}