{"id": 309984, "slug": "burger-builder-crazy-cooking", "name": "Burger Builder: Crazy Cooking", "name_original": "Burger Builder: Crazy Cooking", "description": "Take part in a cooking battle and create the best and the tastiest burger. Welcome to our kitchen where you will take part in a crazy cooking battle. Create tastiest burgers. Make sure that your burgers are delicious and does not have the taste of buger. On this kitchen, you do not make any pancakes. Take part in this crazy cooking battle and make as many burgers as you can. Create burgers and make sure that they do not have the taste of buger or else you will be sent to make pancakes. Create burgers in our burger builder simulator and become the best in crazy cooking battle. Download our burger builder simulator: Burger Builder: Crazy Cooking.<br/><br/>In this burger builder simulator, you are going to take part in crazy cooking battle on our kitchen. Create tasty burgers like a real chief. In this burger builder simulator to create a tasty burger you will have to put correct ingredients of burger in correct order. Make sure that you have the right order of ingredients, otherwise your burger will have a taste of buger and you will be sent to create pancakes. It is a shame for a burger chief to cook pancakes. So make sure that your burgers does not have the taste of buger. Create the tastiest burgers and become the best in this crazy cooking battle. You are the chief of this kitchen so make the best burgers in our burger builder simulator. Beat everyone in this crazy cooking battle and show your opponents that instead of creating burgers with taste of buger they should cook pancakes.<br/><br/>Burger Builder: Crazy Cooking is a free to play burger builder simulator. Build your burger by putting layers of burger in correct order. Choose only needed ingredients. Help your kitchen win in this crazy cooking battle and become the best burger builder in the game. Cooking pancakes is too easy, so win in this crazy cooking battle to show your opponents that cooking pancakes are their business. Such a professional chief like you just cannot create burgers with a taste of buger. Become the pride of the kitchen and lead it to the top in the crazy cooking battle. Download our burger builder simulator and start cooking tastiest burgers on your kitchen.", "metacritic": null, "released": "2019-03-22", "tba": false, "updated": "2019-10-28T02:58:16", "background_image": "https://media.rawg.io/media/screenshots/b5b/b5b4a0e58a4f0a24f74615de642aa967.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Olga Sandakova"], "esrb_rating": null}