{"id": 309971, "slug": "antistress-relax-cake-on-face", "name": "Antistress Relax: Cake on Face", "name_original": "Antistress Relax: Cake on Face", "description": "Our new antistress game is the best way to get rid of stress. Learn real relaxation while playing our antistress game. If you are angry, just use our imitation and throw squishy cake on face of our dummy. Imagine that our dummy is imitation of person you angry at, it may be your rival or just person you really do not like. So forget about toys and throw a squishy cake on face of our dummy. Feel real relaxation in our new antistress game: Antistress Relax: Cake on Face.<br/><br/>We want to make you sure that our new antistress game is the easiest and funniest at the same time way to reach relaxation. Therefore, we are giving you various cakes, choose one, aim and throw a squishy cake on face of our dummy and feel real relaxation. We give you a chance to have some relaxation. Our antistress game use no toys only real squishy cakes, which will bring you many bright emotions. The only thing you need to start squishy throwing the cake on face of our dummy is your smartphone and your free time. Forget about squishy toys and throw cake on face of imitation of your rivals, use our new antistress game to learn real relaxation.<br/><br/>Antistress Relax: Cake on Face is a free to play antistress game. Choose a squishy cake to throw. Imagine face of your victim and throw a cake on face of our imitation of your rival, cover whole his face with cream, cherry and chocolate. Our new antistress game is created to bring you relaxation and imitation of fun revenge to your rivals. No squishy toys allowed in this simulator so throw a cake on face of our imitation of your rivals. Share this simulator with your friends and help them to learn relaxation in our simulator. Download our antistress game and start throwing squishy cakes. Throwing cake on face of imitation of your rival brings more relaxation than squishy toys.", "metacritic": null, "released": "2019-02-02", "tba": false, "updated": "2019-10-28T02:56:18", "background_image": "https://media.rawg.io/media/screenshots/93e/93ea539f8b4606f9a76a1cbba1e7fdf5_lPt7DdK.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Olga Sandakova"], "esrb_rating": null}