{"id": 309926, "slug": "metal-slug-infinity-idle-rpg", "name": "Metal Slug Infinity: Idle Game", "name_original": "Metal Slug Infinity: Idle Game", "description": "Popular arcade game METAL SLUG is back as an IDLE RPG!<br/>Battles with unique characters and combat vehicles are now at your fingertips!<br/><br/>All the characters and Slugs from the Metal Slug franchise are here!<br/>- MARCO, TARMA, ERI, and FIO from previous Metal Slug games<br/>- Defend against waves of Rebels, Guerrillas, Aliens, Mummies, and Zombies.<br/>- Don't forget about P.O.W, you'll repay you with powerful weapons if you save them!<br/><br/>The original game's sound and visual effects have been faithfully recreated!<br/>- Spray and pray with a heavy machine gun, kill enemies in one shot with a shotgun.<br/>- Cover the skies with AA missiles and attack with aliens' ancient stone tablets.<br/>- Experience magnificent battlefields littered with bullets and bombs.<br/>- You can even catch enemy soldiers slacking off on the sly.<br/>- All these features from the original game are nowhere.<br/><br/>A casual RPG focused on the thrill of growing stronger!<br/>- Enjoy limitless growth and challenges<br/>- Numerous buffs and teleportation systems will assist you in your limitless growth.<br/><br/>Don't forget to check our news and tips from Metal Slug Infinity’s official SNS account and website!<br/>- Facebook: https://www.facebook.com/MetalSlugInfinity/<br/>- Customer support: msi_globalcs@ekkorr.com<br/><br/>[Notice]<br/>- By downloading and installing this app, you are agreeing to ekkorr's Terms of Service.<br/>   (Terms of Service and Privacy Policy: http://policy.ekkorr.com/tos_en.html )<br/>- This game includes in-app purchases that can assist your gameplay experience.<br/>   You can limit this feature from your device's settings menu. <br/><br/><br/><br/><br/>This application is officially licensed by the IP holder.", "metacritic": null, "released": "2019-04-17", "tba": false, "updated": "2023-06-13T11:11:21", "background_image": "https://media.rawg.io/media/screenshots/4f2/4f2090f54bfcb924196211290c5e30db_mWGk3YR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["ekkorr"], "genres": ["RPG", "Arcade", "Casual"], "publishers": ["ekkorr"], "esrb_rating": "Teen"}