{"id": 309975, "slug": "gun-flip-idle-spinny-tycoon", "name": "Gun Flip: Idle Spinny Tycoon", "name_original": "Gun Flip: Idle Spinny Tycoon", "description": "Load up your gun, and prepare yourself to shoot every block in your eyesight! Take out your flippy gun and shoot blocks and diamonds until you destroy them! There is no place for idle tycoon in our new spinny simulator. Flip your gun and shoot the block. Make sure that that block is destroyed and reload your flippy gun to shoot next block. Prove everyone that you have the fastest hand in our spinny simulator and flip your gun each time you have destroyed the block with your gun. Show idle tycoons that they have no business in this new flippy simulator: Gun Flip: Idle Spinny Tycoon. Load your gun and welcome to our shooting range. Destroy every block in our flippy simulator.<br/><br/>In this spinny simulator, your main target is to destroy blocks with your gun. Load your gun and flip it each time you have shot something, like a real cowboy from the wild west. Shoot every block, which you can see and do not forget to flip your gun. Show idle tycoons that this shooting range is not for them and shoot every block on your way. Pass every level in this spinny simulator to show everyone who has the fastest hand in this flippy simulator. Share this simulator with your friends and find out who will destroy more blocks. Flip your gun like a cowboy from the wild west in our new flippy simulator. Become the best block shooter in our simulator of gun flip. Show idle tycoons that they have nothing to do in this flippy simulator.<br/><br/>Gun Flip: Idle Spinny Tycoon is free to play simulator of flippy guns. Shoot the blocks until you destroy them. Flip your gun each time you have destroyed the block to show everyone that your hand is the fastest in our flippy simulator. If you are having troubles with passing the level you can upgrade your gun or buy a new one, more powerful. You earn coins for successful passing of the level. Pass every level in this spinny simulator to become the master of a gun flip. Download our new flippy simulator and shoot the blocks now. Prove that idle tycoons has nothing to do near brave cowboys from the wild west.", "metacritic": null, "released": "2019-03-22", "tba": false, "updated": "2019-10-28T02:57:28", "background_image": "https://media.rawg.io/media/screenshots/744/744ce522960f0610a686d9b88331219d_RabCtCg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Olga Sandakova"], "esrb_rating": null}