{"id": 309966, "slug": "hexagonio-snake-paper-draw", "name": "Hexagon.io Snake: Paper Draw!", "name_original": "Hexagon.io Snake: Paper Draw!", "description": "Draw strings to create a hexagon and add it to your territory! It is time to have a little snake string drawing battle in our new hexagon.io game.  Draw a string of hexagon on paper and get back to your hexagon to capture territory. So compete in our new game, in which your snake will have to own the biggest amount of hexagons on paper territory. You can drop your opponents into the hole only on your hexagons. If you will meet opponent on neutral hexagon you will have to get back to your territory until circuit string of your hexagon vanishes, otherwise you will fall in the hole. Conquer the most part of the paper territory to win. In this hexagon.io game can be only one winner. Draw as fast as you can to become the owner of paper territory in our new game. Control your snake, capture the biggest amount of hexagons and become the best in our new simulator: Hexagon.io Snake: Paper Draw!<br/><br/>In this drawing simulator, your target is to draw strings as fast and as much as possible. Control your snake and conquer the paper territory with your strings. If you will consume player on your territory, he will fall in the hole and you will capture his hexagons. If you will eliminate player and get back before your string vanishes you will survive. If your string vanishes before you reach your territory, you will also fall in the hole. Think fast and become the mightiest in our hexagon.io game. Share this game with your friends and compete, find out whose snake will capture more hexagons. Move forward and conquer paper territory to win. If you will do everything correctly, than owning the biggest amount of hexagons on paper territory will not be a big deal for you. <br/><br/>Hexagon.io Snake: Paper Draw! is a free to play hexagon.io game. Draw as much hexagon strings as possible on paper territory and win the competition. Do not be shy and drop other players into the hole by capturing their hexagons. Make sure that you have time to reach your territory after you have eliminated your opponent. Consume other players to conquer their territory and make it yours. In this hexagon.io game can only be one winner, so show everyone that this place is yours! Call your friends and show them that you will easily eliminate them. Capture territory as fast as possible to leave your friends in the hole of the scoreboard and become the winner. Download our new game and start drawing on paper territory with your colorful snake.", "metacritic": null, "released": "2019-03-01", "tba": false, "updated": "2019-10-28T02:54:59", "background_image": "https://media.rawg.io/media/screenshots/b2b/b2b9c605bb821ee52de904719d702ec0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Olga Sandakova"], "esrb_rating": null}