{"id": 310091, "slug": "beepzz-dogs-car-racing-games", "name": "Beepzz Dogs car racing games", "name_original": "Beepzz Dogs car racing games", "description": "Beep-Beep or should we say Woof-Woof. Get ready for the best new racing game for small kids. Featuring the most cute puppy that you have seen - and they are driving and jumping around both indoor and outdoor places. Our cartoon dog cars are ready to teach you basic motor skills and improve your reflex action. Learn to improve upon your concentration, logical and cognitive skills.<br/>Download this arcade racing game to discover unique dog cars and their adventure in the house, garden, yard, city, park, beach and farm.This is an easy and simple game that will introduce you to a hill climb racing game, but the cars do not burst here.<br/><br/><br/>Features:<br/>Simple racing game for little children – drive the car with an easy finger touch combination, just tap and you will be at the finish line fast.<br/>8 puppy cars are on a mission to collect as many bones as possible and get to the puppy house to collect their bonus (balloon surprise). Choose your rally car: a sports car, jeep, truck and motorcycle - start to jump, flip and roll.<br/>Different difficulty levels with plenty of ramps and obstacles that will make your race a bit more challenging, throughout the game.<br/>You always win - there is no such thing as car burst and ending the race in between. Which means more excitement and an increase in self-esteem and self-confidence in young children.<br/>A child friendly design and animated graphics. Added with a smooth physics simulation and some matching sound effects of the engine. Suspension and maximum speed. These are some of the features that makes this game unique and enjoyable for family.<br/><br/><br/>If you have any feedback and suggestions on how we could further improve the design and interaction of our apps and games, please send us an email at kids@iabuzz.com", "metacritic": null, "released": "2018-03-22", "tba": false, "updated": "2019-10-22T14:37:26", "background_image": "https://media.rawg.io/media/screenshots/f1b/f1b35a18696ad38eb0e715992a2830a3_FMPekzb.jpg", "website": "http://iabuzz.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abuzz"], "genres": ["Adventure", "Sports", "Racing"], "publishers": ["Abuzz"], "esrb_rating": "Everyone 10+"}