{"id": 310093, "slug": "chocolate-eggs-for-kids", "name": "Chocolate eggs for kids", "name_original": "Chocolate eggs for kids", "description": "Egg Toys! We have a new entertaining game for young children and toddlers. Kids win a toy prize with each new chocolate egg. The target is to collect the toy hidden in the egg - thus building your own toys collection. Just tap the cute egg wrapper to remove it and then start eating the chocolate egg with Yum-Yum, a cute animal that will help you collect the chocolate pieces. Then all you have to do is open the plastic egg capsule and see the magical sparkles while your new toy is revealed, which will be a big surprise. This is truly a fun baby game that will bring joy to everyone in the family.<br/><br/>Features:<br/>* Simple and intuitive child-friendly interface.<br/>* Basic one finger tap gameplay for young kids.<br/>* 150 toys to collect, hidden inside the gift-wrapped chocolate eggs. Cars for boys, princess for girls, animals, cartoon characters, superheroes, beautiful monsters and more…<br/>* Creative animations and high-quality chocolate egg images are used to achieve the best kids experience.<br/>* Soothing melodies combined with realistic and hilarious sounds will guarantee lots of laughter and smile.<br/>* Extra balloon game after each finished round of unwrapping of gifts.<br/><br/>If you have any feedback or suggestions on how we can further improve the experience of the children, please write to us at kids@iabuzz.com<br/><br/>Disclaimer: All the toys used in this app are licensed images from stock image websites and if any Brand has an issue with it then you can contact us at kids@iabuzz.com and we can send you the license copy for all. Still, if a Brand feels that any of the toys are too similar to their toys and have an issue with it, please let us know and we will happily remove it.", "metacritic": null, "released": "2018-03-30", "tba": false, "updated": "2019-10-22T14:37:26", "background_image": "https://media.rawg.io/media/screenshots/90c/90ce43d697e6104247e0c3041766a8e2.jpg", "website": "http://iabuzz.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abuzz"], "genres": ["Adventure"], "publishers": ["Abuzz"], "esrb_rating": "Everyone 10+"}