{"id": 310074, "slug": "bulletnwall", "name": "Bullet'nWall", "name_original": "Bullet'nWall", "description": "High-speed shooting game of singing and light and Bulltets.<br/>◇ Bullet'n Wall <br/><br/>[HOW TO PLAY]<br/><br/>◇ Introduction<br/>This game is a side-scrolling shooting game.<br/>While shooting down while avoiding the barrage of enemies by operating your own \"Wall Breaker\", you will proceed to the right side of the screen.<br/><br/>First, hold the iPhone / iPad next to it.<br/>It is recommended to have a way to hold it as if you had a controller for game console.<br/><br/><br/>◇ Title screen<br/>· Tap near the center of the screen to move to your own \"Wall Breaker\" selection screen.<br/><br/>· Tap the high score display area to display the score rankings.<br/>(We use GameCenter provided by Apple)<br/><br/><br/>◇ own selection screen<br/>Tap on your own \"Wall Breaker\" that you want to sort and start the game.<br/>Each aircraft has its own characteristics and personality.<br/>Let's search for an aircraft that is compatible with yourself.<br/>(It is recommended because the white fuselage is easy to use with standard equipment)<br/><br/><br/>◇ Main game screen<br/>Operate with the fingers of the hand that you like like a game controller.<br/><br/>· Move yourself with the left hand swipe.<br/><br/>· There are two buttons on the right hand side.<br/>(1) The button on the bottom right,<br/>\"Weapon change\"<br/>Mainly to shoot your shot and to shoot,<br/>You can switch the movement of the laser.<br/>(There is a difference in function depending on the wall breaker selected)<br/><br/>(2) The button on the upper right,<br/>\"Wall Break\" <br/>It will fire its own special attack \"Wall Break\".<br/>A momentary elimination effect and a powerful laser attack for a certain time are done.<br/><br/>\"Wall break\" is a display of numbers slightly above the center of the screen,<br/>You can use it if the wall gauge is charged 500 or more.<br/><br/>※ Wall gauge,<br/>Defeat the enemy, cross the laser of your opponent and enemy,<br/>You can also raise it by hitting weapon change buttons repeatedly.", "metacritic": null, "released": "2017-12-24", "tba": false, "updated": "2019-10-22T14:37:25", "background_image": "https://media.rawg.io/media/screenshots/0b9/0b9decc41415a4ec2afb695062f5ce96.jpg", "website": "http://quizcatgames.com/bulletnwall/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["koji shimono"], "genres": ["Action", "Arcade"], "publishers": ["koji shimono"], "esrb_rating": "Everyone 10+"}