{"id": 310000, "slug": "bombastic-brothers-top-squad", "name": "Bombastic Brothers – Top Squad", "name_original": "Bombastic Brothers – Top Squad", "description": "“Welcome aboard, kiddo! Name’s Jeff, I’m the captain of this ship. <br/>We’ve got a nasty situation on our hands — all these skittering aliens swarming us, ya know. <br/>So suit up and let’s get ourselves some gun fun!”<br/>Captain Jeff<br/><br/>If nasty alien bugs invade your lovely home planet, the only way to resist is to grab a gun! When all else fails, call on Bombastic Brothers, a semi-legal team of soldiers and agents! Join the Arcade Revolution where oldschool platformer gameplay meets the future. Choose your hero, pick a weapon, obtain and upgrade your spaceship and fight epic bosses!<br/><br/>Bombastic Brothers: Top Squad is inspired by classic platformer hits loved by fans of hardcore games, but it’s totally accessible to players new to the genre as well! <br/><br/>What you’ll get:<br/><br/>- Classical Run’n’gun gameplay<br/>- Featuring base-building and battler mechanics<br/>- Oldschool but not obsolete bosses<br/>- Humorous story and charismatic heroes<br/>- A huge spaceship (free of charge!)<br/>- Worldwide PVP Arena<br/>- Bombastic weapons and fancy equipment<br/>- Fantastic eye catching art style<br/>- Your chance to save the Earth!<br/><br/>Check out the game and share your opinion with the devs! <br/>Join us on Facebook: https://www.facebook.com/bombasticgame/<br/>Discord Channel: https://discord.gg/QkZGhur<br/><br/>Terms of Use - http://legal.my.com/us/games/tou/", "metacritic": null, "released": "2019-04-16", "tba": false, "updated": "2019-07-29T19:26:57", "background_image": "https://media.rawg.io/media/screenshots/a33/a33b49c38373381dfa90748a8d1c4405_7allboi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MY COM"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["My.Com"], "esrb_rating": "Teen"}