{"id": 310067, "slug": "yakari-wild-ride-looking-for-rainbow-discovery", "name": "Yakari Wild Ride - Looking for Rainbow - Discovery", "name_original": "Yakari Wild Ride - Looking for Rainbow - Discovery", "description": "Yakari's friend Rainbow is missing! Help Yakari find her with the help of his animal friends.<br/><br/>Inspired by the famous comic books and cartoon show on the young Native American, the game \"Yakari Wild Ride - Looking for Rainbow\" sends children to an adventure with their favorite hero and many characters from the TV series!<br/><br/>Journey through Yakari's wonderful world in his search for his friend Rainbow. Follow the trail of the animals that will help you in your quest. Travel across all the hostile lands while avoiding obstacles and collecting as many tokens as possible. Play as your favorite character: Yakari the young Native American Sioux. Ride Little Thunder, his steed and closest friend as well as the powerful White Buffalo. And learn about your favorite animals by collecting hints and information hidden in each level.<br/>\"Yakari Wild Ride - Looking for Rainbow\", is a captivating game including several levels to play as your favorite hero, develop your reflexes and discover the wonderful world and wild animals of the Native American Sioux.<br/><br/>• Runner game including 40 levels <br/>• 8 wonderful worlds with beautiful backgrounds of the cartoon to discover<br/>• Play as Yakari, Little Thunder or even White Buffalo<br/>• Meet all your favorite animals and learn more about them<br/>• 2 difficulty levels for each age<br/>• Full audio and text in English, French, German, Italian and Spanish to learn new languages while having fun!\"", "metacritic": null, "released": "2015-07-21", "tba": false, "updated": "2019-10-22T14:37:25", "background_image": "https://media.rawg.io/media/screenshots/fc4/fc48a99a9b6c6d1eaab5e91acf0c138f.jpg", "website": "https://itunes.apple.com/us/artist/kids-mania/id792676003?mt=8", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLURIAD"], "genres": ["Arcade"], "publishers": ["PLURIAD"], "esrb_rating": "Everyone 10+"}