{"id": 310071, "slug": "mill", "name": "Mill", "name_original": "Mill", "description": "You play with the dark tiles against an artificial intelligence.<br/><br/>Goal of the game is to reduce the opponent's tiles from 9 to 2 by building mills or to block the tiles up. A mill consists of three same colored tiles aligned either horizontally or vertically. For each closed mill you are allowed to remove an opponent tile, which is not in a mill.<br/>In a first phase you place your tiles on the board by tapping on a free position. Then you move them around by wiping the pieces horizontally or vertically or, if you have only one adjacent piece, by tapping on a free position. If you only have three tiles left, you can jump to any free position by tapping a piece and then a position or by dragging the piece.<br/><br/>Conventions for a tie:<br/>- 100 draws without closing a mill.<br/>- 3 times the exact same lineup.<br/><br/>Options:<br/>Tap on any light tile to let the artificial intelligence begin.<br/>Set the difficulty level — increasing from one to three — by tapping on the symbol in the top left corner.<br/>Abort the current game by tapping on the cross in the top right corner.<br/><br/>Handling:<br/>You don't have to drag the pieces, but you can.<br/>- Tap a position to place them.<br/>- Wipe them horizontally or vertically.<br/>- Tap a piece and then the new position on the board.<br/><br/><br/>This game is also known as Mills, Nine Men's Morris, Merrill, Merels, and Merelles.", "metacritic": null, "released": "2008-11-20", "tba": false, "updated": "2019-10-22T14:37:25", "background_image": "https://media.rawg.io/media/screenshots/c9e/c9ede2572bd57ef517fb4f9d08b211d1.jpg", "website": "http://mill.oxorr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["oxorr"], "genres": ["Board Games"], "publishers": ["Andris Baumberger"], "esrb_rating": "Everyone 10+"}