{"id": 310010, "slug": "dark-domain", "name": "Dark Domain", "name_original": "Dark Domain", "description": "Finally! The long-awaited “Dark Domain” has been launched!<br/><br/>As a fantasy MMORPG,The game features a dark style theme &amp; provides variety of hero selections. There are many features including gameplay missions, multiple social systems &amp; dungeons waiting for you to explore &amp; defeat. Every map has different visual effects,including functions such as cool profession skills &amp; social systems. Join this journey with your friends &amp; reveal the truth of the storyline. Cool career skills that brings a variety of profession with specific action skills &amp; special relics transfiguration skills so that players can try their own role external professional skills. Skills can be used at the correct timing to achieve critical damage to enemies. Players are able to enhance their abilities by upgrading &amp; developing roles, weapons &amp; gears.<br/><br/>【Crystal Clear Textures】<br/>Dark Domain has adopted various of top quality graphics, creating imposing thus immersive skill effects &amp; characters.<br/><br/>【Strong &amp; Stunning Visual Experience】<br/>The game will totally give you a one of a kind experience of the fantasy world. Immersive, simple &amp; smooth operations gives you a gaming experience beyond PC Gaming. You can now enjoy all of these features in our game.<br/><br/>【Epic Skills】<br/>Epic fantasy style, amazing battle scenes, well-designed character images &amp; various skill combinations will make this game the best MMORPG you can’t miss this year!<br/><br/>Let the exploration &amp; war of Dark Domain begins!<br/><br/>【Reminder】<br/>※ This game contains image of fighting, sexual or attacking that is not bloody, or a slightly terrifying image.<br/>※This game design procures users to have virtual romantic relationship or virtual marriage.<br/>※This game has a top-up store. You are advised to spend wisely according to personal interest and ability.<br/>※Playing game for long hours might affect normal work and rest. You are advised to take rest and exercise appropriately.", "metacritic": null, "released": "2019-05-14", "tba": false, "updated": "2019-07-29T21:39:48", "background_image": "https://media.rawg.io/media/screenshots/250/250df403d9c01c41c15fab58ce7d0f45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EYOU TECHNOLOGY"], "genres": ["RPG"], "publishers": ["EYOU TECHNOLOGY"], "esrb_rating": null}