{"id": 310075, "slug": "bulletntunes", "name": "Bullet'nTunes", "name_original": "Bullet'nTunes", "description": "Bullet'n Tunes | Rythm Shooting Game ver1.102<br/><br/>- Please read before you buy -<br/>Recommended Model: iOS8 or later installed<br/>iPhone5 and later models<br/>* You can use as iPhoneApp the iPad.<br/><br/>--------------------------------------<br/>Shoot the sound!<br/>Rhythm shooter<br/>BULLET'N TUNES<br/><br/>[4 songs Pick four songs MIX !!]<br/>When you start the game will be displayed tune selection screen.<br/>Determine the song you want to play in the selection &amp; Jackets center tap a song by tapping the left and right!<br/>Automatically game will start as determined four songs.<br/>Enjoy the combination of their favorite songs in the DJ sense!<br/><br/><br/>[Tap to match the song! Easy operability]<br/>Enemy aircraft \"Sound enemy\" will have assault from the screen on when you start the game.<br/>The ambush \"Sound enemy\",<br/> The center of the screen in red flashing \"SHOOT RANGE\" tap the screen in the vicinity!<br/>Then shoot down enemy aircraft \"Dungan Laser\" of auto-aim is fired!<br/>Location where you want to tap anywhere on the screen OK!<br/>To the tune of rhythm, one after another tap! Let's shot down in the barrage \"Sound enemy\"!<br/><br/><br/><br/>Add music and game mode by the Update<br/>\"Dungan Tunes of stardust\" is a game App outright buying of free update.<br/>Delivery and additional songs in a future update, we plan to enrich the other game mode.<br/><br/><br/>* IOS Control Center is<br/>If you set to disable access in the App<br/>Can you without any trouble playing in control.<br/><br/>* If you during play, unexpected processing fall and has occurred,<br/>It may cause a shift in the timing of the \"Sound enemy\"<br/>Yes you. please note that.", "metacritic": null, "released": "2015-09-20", "tba": false, "updated": "2021-05-07T04:59:11", "background_image": "https://media.rawg.io/media/screenshots/8ef/8efe586d062b2f7be407a500777940bd.jpg", "website": "https://www.youtube.com/watch?v=6VCJkIgLvW8", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["koji shimono"], "genres": ["Arcade", "Casual"], "publishers": ["koji shimono"], "esrb_rating": null}