{"id": 310104, "slug": "beepzz-kids-hill-racing-game", "name": "Beepzz Kids Hill Racing game", "name_original": "Beepzz Kids Hill Racing game", "description": "After looking at how the existing 10 million children are playing the BEEPZZ car racing apps and the feedback they have given us, we built this new racing game:<br/><br/>Simple play: This is a simple two button touch control we have developed. We have gone away from 3 buttons and so it is easier for the younger kids. No more jumping or tilting the mobile to rotate the car - this is all automated.<br/><br/>Difficulty: There are still levels of difficulty in the game so the child does not get bored and still has to focus. As they progress through the themes and levels, it gets more interesting and each time it is some new surprising obstacle for them to overcome.<br/><br/>Cars: We still have cartoon animal cars and they are cute with expressions and sounds. This is something the children loves as it makes it fun to drive. We have the dolphin as police car, caterpillar as school bus, bee as auto-rickshaw, frog as city car and many more.<br/><br/>Made specially for Children: We have maintained this focus even now with cars not bursting, cartoon animation, cute themes, balloons, sweet music and fun levels. This game is built by multiple parents and children from different age groups.<br/><br/>Learning: Young children will learn multiple skills as this game helps develop their reasoning, reflexes, co-ordination and motor skills. Combining learning with fun is the best way to teach young kids and this is what BEEPZZ is all about.<br/><br/><br/>If you have any feedback or suggestions on how we can further improve the experience of the children, please write to us at kids@iabuzz.com", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-10-22T14:37:27", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee368d4d8f60a95297dd96323f22297e_AeXK4pF.jpg", "website": "http://iabuzz.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abuzz"], "genres": ["Adventure", "Racing"], "publishers": ["Abuzz"], "esrb_rating": "Everyone 10+"}