{"id": 31012, "slug": "wall-street-tycoon", "name": "Wall Street Tycoon", "name_original": "Wall Street Tycoon", "description": "You just created an investment company. Now it’s time to hire some employees! With very limited funds, you must hire the best people to work at your company. Bankruptcy is always a threat and in order to stay profitable you must manage money and create an office that will maximum the performance of your employees.EmployeesEmployee performance varies greatly depending on their work environment. Team dynamics are very important and each department needs to be composed of employees with complementary skills and traits. Information found on applicants resumes hint towards these traits. Aggression and work ethic are two examples that are affected by nearby co-workers. Also productivity and happiness are affected by the office work space. Treat your employees well with office amenities, but not too well or they may become unproductive.OfficeThe office you build has direct relation to your bottom line. The environment shapes how much work your employees will get done, and that determines how much profit the entire company earns. Employees with few amenities and poor work conditions will have low morale and high turnover rates. However, with too many amenities, employees are more likely to be happy and unproductive.", "metacritic": null, "released": "2000-01-01", "tba": false, "updated": "2019-08-28T22:06:31", "background_image": "https://media.rawg.io/media/screenshots/ce1/ce12f9dd971ed03144e77d406e38d880.jpg", "website": "https://redfox.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lumis Studios", "Red Fox Game Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Ubisoft Entertainment", "Red Fox Game Studios"], "esrb_rating": null}