{"id": 3101, "slug": "arcade-archives-ninja-kid-ii", "name": "Arcade Archives Ninja-Kid Ⅱ", "name_original": "Arcade Archives Ninja-Kid Ⅱ", "description": "'Ninja-Kid II' is an action game that was released from the UPL in 1987.<br/>This 'Ninja-Kid II' has been developed in after three years from the 'Ninja-Kid,'. Ninja-kun who got a new action and weapons will aim to overthrow of Ashura.<br/>In this work, the player will be able to move in eight directions, and also can jump in triangle. Enthusiastic fans had been increased, because degree of difficulty went up dramatically.<br/><br/>The 'Arcade Archives' series has faithfully reproduced the masterpieces of classic arcade games on the PS4® system while taking advantage of the additional features the PS4® system offers.<br/>Players can share play screens and video with the SHARE feature, and can also compete with other players online to improve your standing on the online score ranking leaderboard.<br/>Please enjoy the masterpiece that built a generation for video games.<br/><br/>Additional hardware required for Remote Play.<br/><br/>1-2 players<br/>DUALSHOCK®4<br/>Remote Play<br/>1080i HD Video Output<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>Arcade Archives Series Produced by HAMSTER Co. and Nippon Ichi Software, Inc.", "metacritic": null, "released": "2015-10-27", "tba": false, "updated": "2019-08-02T16:24:38", "background_image": "https://media.rawg.io/media/screenshots/83c/83c2d92044b455a13b01049e4e406def.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["HAMSTER"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}