{"id": 310292, "slug": "crumbling-moonlight", "name": "Crumbling Moonlight", "name_original": "Crumbling Moonlight", "description": "<p><strong>There </strong>Once was a mysterious night, when the winds were violent and the oceans were viciously stirred. The moon was bright and brilliant and it began to become so bright that it cracked, and it's light vanished, only to come back moments later Gorgeous as ever.</p>\n<p><strong>On</strong> that night the moon affected several people in an unexplained way.<br/>Their eyes became a bright hue of white and very deadly.<br/>When looking into the eyes of these individuals, people would die only a little while after complaining of extreme fatigue and exhaustion. However, there existed people who could withstand it; but they were very few.</p>\n<p><strong>Ultimately </strong>though it resulted in the vast majority of people killing and hunting the individuals who were affected that night, even if a child was born with white eyes it was killed just a little after birth by the doctor delivering it. often times without the mother's consent. </p>\n<p><strong>After </strong>word got out about this, millions of women started to give birth in secret frightened that their children too might come out with this white-eyed defect and be taken away from them. </p>\n<p><strong>People </strong>with this white-eyed defect were later called SilverMoon on account of they're bright shining eyes. and sadly although they weren't evil, the government made the hunting and killing of them legal.</p>\n<p><strong>In </strong>this game, you're going to experience one household's perspective on a night much like the first one years before it.  depending on how you play this game you'll see different outcomes, good and bad.</p>", "metacritic": null, "released": "2019-04-18", "tba": false, "updated": "2019-04-19T05:21:34", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9ad72b642f304f59be6ab31bddb7b20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["BornstarWish"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}