{"id": 310246, "slug": "the-horror-of-blackthorne-manor", "name": "The Horror of Blackthorne Manor", "name_original": "The Horror of Blackthorne Manor", "description": "<p>After a letter from a distant relative is delivered to you, your life doesn't feel too normal anymore, you are being given a Manor house… But why... Not long after you arrive at Blackthorne Manor, it looks dark and dingy, unloved. But why are you here?</p>\n<p>Blackthorne Manor is a single player dark horror experience that puts you in the boots of Cali, a highly Intelligent and Cunning woman who has just been given the keys to this mysterious Manor house. You play through her first experiences within the house, seeing each room for the first time the same time she does. But things are not as they seem, unknown people, ghosts, and spirits roam freely. It's your job to work out why and uncover a huge secret in the process.</p>\n<p>Some gameplay features include NPC’s that can be spoken too at any point, as well as a trading system. To complement the trading system there is a whole array of different items that can be found throughout the game, including items ranging from Ouija Boards to Music Boxes and even Brains in a Jar. As well as that during your adventure through the house, you can even come across a companion to call your own, this powerful being is a huge help throughout the game. As well as all of these other features we have included accessibility options such as Controller support.</p>\n<p>The Manor itself is populated with many rooms such as a Kitchen and a Wine Cellar, and some more bizarre rooms such as an underground Lake and Science Lab. With as many as 22 rooms to explore spanning over 3 floors there is so much to discover. As well as that there are many room specific events that bring excitement, with as many as 10+ events that can occur it's always a surprise when one of these story driven events happen.</p>\n<p>The rooms within Blackthorne Manor are populated with life like models and textures to extend the realism within the game, as well as that there are various particle systems that simulate rain and dust particles to extend this even more. </p>\n<p>Developers:\r\nJonathan Carter\r\nEdward Goodhew\r\nSamuel Wilson\r\nOliver Neale</p>", "metacritic": null, "released": "2019-04-18", "tba": false, "updated": "2019-04-19T05:08:12", "background_image": "https://media.rawg.io/media/screenshots/8ab/8ab27848b0787f37caf4968dd54d1cb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Samuel Wilson"], "genres": ["Action"], "publishers": [], "esrb_rating": null}