{"id": 310250, "slug": "pistol-shooting-at-the-target-weapon-simulator", "name": "Pistol shooting at the target. Weapon simulator.", "name_original": "Pistol shooting at the target. Weapon simulator.", "description": "<p><strong>The game is a simulator of shooting a pistol Beretta 92.<br/> The main feature of the «Pistol shooting» game that distinguish it from other similar games is a choice of aiming mode with «alignment of a front sight»</strong>.  What is «alignment of a front sight»? In most simulations of fire, when aiming, you just have to combine the sight of the guns weapon with the target and shoot. This pistol sight consists of two parts, front sight and rear sight with a cut. To shoot accurately it is necessary to put the front sight on the center of the cut and its top end is aligned to the top plane of rear sight. This is called alignment of the front sight. Keeping this mutual location of sighting devices it is necessary to combine the guns sight with the target and shoot.<br/> <strong> In game settings you can choose one of the two aiming modes: </strong><br/> 1. The alignment of the sights is disabled:<br/> In this mode, with the joystick combine the sight of the pistol with the target. Releasing the joystick to shot.<br/> 2. The alignment of the sights is enabled:<br/> In this mode, in addition to aiming sight with the joystick you must also align the front sight. Align the front sight by tilting the device. Shooting in this mode is more complex, but this method of aiming is closer to the aiming when shooting from real gun.<br/> <strong> Before shooting you can choose the type of the target. There are 6 types of targets: </strong><br/> - Standard paper target<br/> - Ceramic rotary target<br/> - Cans<br/> - Candles</p>\n<p>-Cowboy<br/>-Fly</p>\n<p> For each sighting and each target the best result of the shooting is stored. Number of hits and time of the shooting are taken into account when determining the best result. Therefore, even if maximum number of points is reached, the result can be improved by reducing time of the shooting.<br/>  This simulation game will help you learn the fundamental principles of aiming pistol and other guns equipped with mechanical iron sights and learn to shoot accurately.</p>", "metacritic": null, "released": "2019-04-18", "tba": false, "updated": "2019-04-19T05:09:38", "background_image": "https://media.rawg.io/media/screenshots/ff5/ff579782f18b6f51bd18c4e01e52e250.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Leonid1964"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}