{"id": 310494, "slug": "saving-iris", "name": "Saving Iris", "name_original": "Saving Iris", "description": "<p>Saving Iris is a third person, adventure game with puzzles and traps!</p>\n<p>Currently under development and in prototyping phase.</p>\n\r\nStory:\r\n<p>The game begins in a magical island called Iris. This island has always been colorful and magical, all thanks to the essences of magic that are spread throughout it.<br/> <br/> One day a big storm strikes Iris deactivating all the essences, leaving the Island without magic and colorless. The player will now control the guardian of Iris, exploring it to find all the essences and activate them. Each one spreading a color throughout the island, when the green essence is activated all that's green in the island will become green leaving everything else black and white.<br/> </p>\n<p> The guardian has laid some traps and puzzles to protect the essences of Iris against the outside world and now it’s him who will have to surpass them and bring Iris to what it once was.</p>\r\n\r\nControls:\r\n<ul><li>Use the WASD keys to move your player (walk fowards, backwards, left and right)</li><li>Use the Shift key to run</li><li>Use the Ctrl key to crouch</li><li>Use the Space bar to jump and double jump</li></ul>\r\n\r\nCheats: \r\n<ul><li>Press the P key to restart the game</li><li>Press the R key to gain the Red essence</li><li>Press the G key to gain the Green essence</li><li>Press the B key to gain the Blue essence</li></ul>\r\n\r\nGame developers: \r\n<ul><li>André Borges </li><li>Gonçalo Peres</li></ul>\r\n\r\nGame artists:\r\n<ul><li>António Miguel</li><li>Henrique Carvalho</li><li>Joana Ribeiro</li><li>Maria Inês Hortênsio</li><li>Maria Mathias</li></ul>", "metacritic": null, "released": "2019-04-16", "tba": false, "updated": "2019-04-19T06:03:10", "background_image": "https://media.rawg.io/media/screenshots/8d1/8d1d99e9e9d955cbbe548a1506f1d13b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["S-B-E"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}