{"id": 310569, "slug": "the-sacred-stone", "name": "The Sacred Stone", "name_original": "The Sacred Stone", "description": "<p> MASSIVE UPDATE NOW RELEASED 4/13/2019. AS YOU CAN SEE FROM THE NEW TRAILER TO THE OLD THAT WE HAVE KEPT UP ON THE STEAM STORE PAGE FOR COMPARISSON. THIS MASS UPDATE INCLUDES NEW A.I, NEW ENEMIES, NEW PLAY PLAY MECHANICS, NEW LEVELS, NEW PLAYER CHARACTER AND MORE. CHECK OUT THE ANNOUNCEMENTS FOR FURTHER DETAILS. THIS GAME HAS BEEN IMPROVED AND UPDATED SO MUCH THAT WE FEEL NONE OF THE REVIEWS EVEN POSITIVE REPRESENT THIS GAME ANYMORE IN THE CURRENT STATE THAT IT IS IN. </p>\n<p>Product<br/><br/>Our downloadable PC game is named The Sacred Stone.. It is our goal to put this on the PS4 platform, and the Nintendo Switch.<br/><br/><br/><br/>Features and Benefits <br/><br/>The Sacred Stone offers a hack and slash action of combat. This includes but not limted to using different weapons, and different styles of combat. This is a high paced action game with a very long story line to work with the new and recent open world style of gameplay. Linear paths are also in the game but only in sections.   Over 30 different enemies to fight including 15 Different Boss fights.<br/><br/><br/><br/>Besides your traditional hack and slash combat we have included a level system, journal, Quest, Interact with characters, a spell system and more.<br/><br/><br/><br/>Story Line<br/><br/>You play as a young girl of the age of 18 years old. The kingdom is ruled by a beautiful Queen. Balance of life surrounds the world due your family protecting The Sacred Stone. Very few even knows that the Stones exists until one day you come home to find your parents dead. The Stone stolen. Chaos quickly consumes the lands of devilish beasts and demons. Shortly after burying your parents the people responsible come back to finish you off. You quickly realizes that you that have more power than what your parents let you believe. As time goes on your strength goes stronger along with learning new abilities about yourself. You will seek revenge for your parents murder not death. Seek to take back the Sacred Stone and restore balance upon the lands. However the Stone is not what you or anyone else thinks it is. Upon your journey explores the lands for clues, to help guide you on your path. <br/><br/><br/> QUEST SYSTEM <br/><br/>The quest system besides the main quest is randomized when interacting with characters you meet through towns, villages, caves, forests and more. Each character you meet may have a quest for you such as kill spiders to achieve spider legs or their venom, pick wild flowers for a potion, Hunt for food, Find things characters have lost, reconnect loved ones. Gain prestige by helping some characters you meet to help explore deeper into the open world. <br/><br/><br/><br/>LEVEL SYSTEM<br/><br/>In order to level up you must hunt and engage into enemy combat. Basically Grinding in a sense. As you level up you will be able to gain new abilities in the spell system, along with change outfits and style of appearance. Your health bar will also increase, along with your MG, and reloading of spell times. You will also gain health for every hit point you make to the player enemy. Some areas are closed off until you have gained enough prestige or level up. <br/><br/><br/><br/>The level up system is designed to double the points needed to gain to the next level every time the player reaches a higher level. Example 1 +1 = 2, 2 + 2 = 4, 4+4=8, 8 + 8 = 16 etc. The player will be able to level up pretty quickly in the beginning of the game, but will have to take on risks and challenges with other enemies to upgrade to higher levels. <br/><br/><br/><br/><br/><br/>Open World <br/><br/>Most of the game has the feature of being able to free roam in the world. You can find new quests, explore the lands of caves, lakes, forests, towns villages, hidden lands, volcanos and much more. Along exploring you will meet new characters, have the ability to take on new quests, fight enemies and more. <br/><br/><br/><br/>As of right now the open world if we would walk from the top of the mountain based on Hinderdale City and to walk to the dead lands would take well over 1 hour just walking. We are constantly adding in more details to the open world, along with quests, enemies, and storyline.<br/><br/><br/><br/>Player Powers, and abilities<br/><br/>The player has unique abilities. Besides the leveling up system when fully unlocked can cast up to ten power spells, has 2 different fighting styles which serve a purpose. The first fighting style is with a spear, very powerful when dealing with a massive amount of enemies. The second is dual wielding swords. Perfect for one on one combat. The player also has the ability instead of dodging to teleport out of harms way for a brief moment if used right. She also has a very power combo moves. One move consists of her jumping into the air and launching herself into the ground creating all enemies within a certain radius that surround her to take a few steps back from the force of the impact. This also has a feature of slow Mo when she impacts into the ground for a more cinematic intense affect.<br/><br/><br/><br/>ENEMIES<br/><br/>Enemies have a level system. When approaching an enemy you will be able to see the enemy's level of strength. It is not recommend for example to approach a level 18 enemy when the player is only a level ten. The higher the enemy level is the harder the enemy will be to kill and the enemy can kill the player more easily. <br/><br/><br/><br/>We have added in a feature with higher level enemies that the enemies can also cast spells to heal themselves of damage at random times. <br/><br/><br/><br/>Some areas will be very long boss fights. The enemy's health is extremely high, and well surrounded by countless ends of low class enemies. The goal is to stay alive at this point, and take the player for a intense battle that will last awhile. <br/><br/><br/><br/>We have focused on this method primarily because we love boss fights. We love the intensity it can bring to the players heart, the sweaty palms at the hand and more. This refers more the to player experience. Expect a lot of boss fights per battle.<br/><br/><br/><br/>When it comes to boss fights each boss will have its own unique animations, special abilities, movement speed and more. For example the Troll swings around a very large wooden nail piece of wood shaped into a bat, but also can cast a powerful wind breaking spell that if the player does not jump or teleport at the right moment will be caught in the wind blast. <br/><br/><br/> Some main enemies include but not limited to:<br/><br/><br/><br/>⦁ Trolls<br/><br/>⦁ Skeleton warriors<br/><br/>⦁ Skeleton Mages<br/><br/>⦁ Spiders<br/><br/>⦁ Rock Monsters<br/><br/>⦁ Dragons<br/><br/>⦁ Grim Repears<br/><br/>⦁ The Devils Advocates<br/><br/>⦁ Humans<br/><br/>⦁ Elf's<br/><br/>⦁ Sorcerer's <br/><br/>⦁ and many more.<br/><br/><br/><br/>Save System<br/><br/>The save system features is easy. You can save at any time during the game. However it is recommended to save fequently. <br/><br/><br/><br/>Voice Acting<br/><br/>We have hired voice actors for certain characters of the game, and have also been working on new enemies not yet shown in game.</p>", "metacritic": null, "released": "2019-04-15", "tba": false, "updated": "2019-04-19T06:21:50", "background_image": "https://media.rawg.io/media/screenshots/baa/baa1ae8c7d8ca307ac0b554fa7431e8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gamerdude"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}