{"id": 310814, "slug": "causa-voices-of-the-dusk", "name": "Causa, Voices of the Dusk", "name_original": "Causa, Voices of the Dusk", "description": "Causa, Voices of the Dusk is a <strong>fast-paced multiplayer collectible card game</strong> in which players assume the role of powerful Leaders struggling to make their faction's ideals prevail in an exotic fantasy world.<strong>ORIGINAL GAMEPLAY WITH UNIQUE GAME MECHANICS</strong>Dedicate (sacrifice) cards to your Cause in order to play increasingly powerful cards. Also, require (draw) cards from those you previously dedicated. But beware; if you do, you’ll lose Points of Cause (which is the in-game resource).<br/><br/><br/><strong>DIFFERENT PATHS TO VICTORY</strong>Destroy your opponents' Resistance by attacking them directly, or indirectly by exhausting their decks.<br/><br/><br/><strong>CHOOSE YOUR ALLEGIANCE AND BUILD YOUR OWN STRATEGY.</strong>Choose between 4 different Powers and multiple playable Leaders to build your own strategies and challenge others in 1vs1 matches.<br/><br/><br/><strong>COLLECT LEADERS, CARDS, AND MORE!</strong>Build your collection of over 250 different cards, 12 playable Leaders, 10 gameplay backgrounds, 10 card backs, multiple banners and titles!  <br/><br/><br/><strong>EXPLORE A VAST NARRATIVE WORLD IN THE STORY MODE</strong>Discover the stories and struggles of multiple Leaders as you overcome and complete different challenges and map-based campaigns.<br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-17T16:43:07", "background_image": "https://media.rawg.io/media/screenshots/6d3/6d3255b425897c96247ab0a7f735f79d.jpg", "website": "http://swww.playcausa.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Niebla Games"], "genres": ["Strategy", "Indie"], "publishers": ["Niebla Games"], "esrb_rating": null}