{"id": 310840, "slug": "gearstorm", "name": "GearStorm", "name_original": "GearStorm", "description": "GearStorm is a detailed military simulator sandbox in which players cooperate and compete to colonize and fortify their positions on a hostile alien planet. GearStorm takes place on an huge, open, procedural, and entirely destructible world. Here players can advance and customize their technology to improve their chances against each other and the Phage – a deadly nano-virus that is decimating human population. GearStorm is a full multiplayer experience but with small communities on private servers, not a impersonal massive multiplayer experience.  Get to know your friends and enemies!<br/><br/><strong>Advanced combat.</strong> GearStorm is not a simple run-and-gun twitch shooter. GearStorm follows the path of the military shooter, simulation game with full prone, crouch and tactically useful cover AND concealment from grass and brush. You can hide, you can sneak, you can snipe people from almost a kilometer away. Damage has consequences but there is (most of the time) be ways to escape and disengage and live to fight another day. GearStorm has armor, shields and finally health to mitigate damage. Cover, concealment and strategy all play a huge role in a typical GearStorm engagement. Damage in GearStorm for players and NPCs has detail and depth, when shot in the arm has different effects than if you are hit in the leg. GearStorm brings much more detail to combat than just a health bar.<br/><br/><strong>Advanced weapons.</strong> Weapons in GearStorm are military style, but we do not just recycle modern day weaponry. GearStorm will have a massive selection of advanced, futuristic weapons. Lasers, flamethrowers, electromagnetic slug-throwers and smart rockets are just a few of the weapons that have been put into the game. All of these will not be cheesy, gimicky weapons, but real-re imagining of what future military weapons might be like based on current trends in military weaponry.<br/><br/><strong>Game Master.</strong> Master your own game on your own server.  Server admins can spawn anything, teleport anyone, teleport themselves, unlimited building, flying, create quests, and alter any stat of any weapon or vehicle in-game, in real-time.  You can create your own experience for your own server.<br/><br/><strong>GEAR!</strong> GearStorm has all kinds of gear the player can have that effects the player’s characteristics. Gadgets and improvements for armor will be very diverse and numerous. These will effect how far you can jump, how fast you can run, how much damage you can take, how accurate you are, how much you can see. We are incorporating this concept as our way for players to quickly reconfigure their armor for a particular role, and lose their gear if they are killed on the field. Gear will persist on players or in containers or in vehicles on server restarts, making GearStorm a persistent world that you can build up a character and horde gear and vehicles in.<br/><br/><strong>Zombies!</strong> GearStorm's story includes a full zombie apocalypse setting, being true to that story, we have incorporated a large-scale zombie AI, allowing hundreds of zombies to be engaged at once, epic battles of zombies verses flamethrowers, lasers, miniguns, explosives and vehicles will be possible! Zombies take consequences for damage, hit them in the leg they will slow down, hit them in the head they will die instantly, hit them in the arms and they can’t attack.<br/><br/><strong>Combined arms.</strong> GearStorm includes a rich population of fully simulated vehicles including wheeled, hover, and air vehicles. All of these vehicles will play a role in combat and transport on our huge maps! Players will own vehicles, when you build one or find one or steal one, you can keep it in your base for safe keeping and lock it up. Vehicles will persist on servers so you can build a stable of them and keep them for missions and combat!  As a true military simulator, GearStorm has depth to vehicle like ammunition, fuel, damage, armor, and consequences to damage like affects to mobilization and weapons, not just a health bar.<br/><br/><strong>Open, fully-destructible worlds with large destructible terrain, rocks and vegetation.</strong> When you make a hole in GearStorm, it persists. You can did a base into the ground or a mountainside. You can mine for materials, make labyrinths, or dig trenches and tunnels for combat.  At the same time, GearStorm’s map is huge (20km x 20km), multiplayer, and saved in real-time for all players.<br/><br/><strong>Building.</strong> You can build almost anything in GearStorm using our extensive library of building materials, bridges, walls, battlements, windows, doors, garages to keep your vehicles. You can build lights, doors and windows that open based on switching commands and a wireless control scheme. Build bases you can fight from, towers to snipe from and garages to horde your vehicles and gear. Bases will be attacked for some reasons, but will have limited destructibility so you can’t just lose the base you have been building for days from one attack.<br/><br/><strong>Quests.</strong> Gearstorm has a rich quest system allows the server gamemaster-admins to create their own missions and spawn vehicles, gear, creatures or enemy combatants based on timing, location and player proximity. This will allow the gamemaster-admins to create a unique set of missions for the players on their servers or just their friends. GearStorm will also come with built-in missions that the gamemaster admin can delete or modify.<br/><br/><strong>Traders.</strong> GearStorm has a trader system with NPC traders that can sell you things or place bounties on other players, items or creatures.10. Gamemaster-admins. pcguyGearStorm will have a gamemaster-admin role for each server that allows the players the server owner designates to teleport, spawn items or vehicles, teleport players to them, god mode and fly. This will let server admins control the experience on their server, help players, create events and create missions. GearStorm will also allow the gamemaster-admin to kick or ban players from their server, set weapon damage and range for their server, or change what vehicles are available and their speed, range and weapons. This role will let a non-technical server admin create a unique experience for players on their server.<br/><br/><strong>Automation.</strong> GearStorm has a full wireless automation system with sensors, switches and machines you can active or deactivate on a switch or sensor. Open/close doors, turn lights on and off, activate elevators, much more to come!<br/><br/><strong>Unreal.</strong> GearStorm is built on the Unreal 4 engine. Capitalizing on the very latest version of the most fully featured, stable, highest performance, and best physics engines in the world. GearStorm is more rock solid, bug-free, and smoother/faster than if it were built on some other engines. Physics work better, and it is easier for us to add more features. We will spend our time on new features and game-play instead of tweaking a proprietary or buggy engine. We capitalize on the deep ecosystem of resources and plugins that will get our players more features faster.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:46:14", "background_image": "https://media.rawg.io/media/screenshots/f71/f71067c18e0e7d829fe775d154903e5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 483, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Iron City Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Iron City Games"], "esrb_rating": null}