{"id": 310944, "slug": "haunted-manor-painted-beauties-a-hidden-objects-my", "name": "Haunted Manor: Painted Beauties - A Hidden Objects Mystery (Full)", "name_original": "Haunted Manor: Painted Beauties - A Hidden Objects Mystery (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>A peaceful day at the park becomes a journey into the surreal when you become the latest victim of a troubled artist’s deal with Death! Now you must escape from his mysterious manor before you become a permanent work of art.<br/><br/>• ESCAPE A DEAL WITH DEATH!<br/>You thought it would be fun to have your portrait painted by handsome young artist Stephan Black. But you didn’t realize you were about to be transported into the dark world of his painting!<br/><br/>• FIND YOUR PORTRAIT WITHIN THE HAUNTED MANOR<br/>You soon discover that the mysterious artist has been filling his gothic manor with souls to fulfill the terms of a deal he made with Death.<br/><br/>• TRAVEL THROUGH A DARK WORLD OF MAGIC<br/>Your adventure starts in an eerie manor full of magic canvases, imprisoned ghosts, and dark secrets! Make your escape by finding useful items in hidden object scenes and solving challenging puzzles and mini-games! <br/><br/>• RETURN TO THE MANOR FOR MORE ADVENTURES IN THE BONUS CHAPTER<br/>Keep your eyes peeled for morphing objects hidden throughout the game! Collect achievements and enjoy wallpapers, a concept art gallery, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2015-11-04", "tba": false, "updated": "2019-10-22T14:37:31", "background_image": "https://media.rawg.io/media/screenshots/1c7/1c7590e8e9a5cacef5d1f755d5f8a654.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}