{"id": 3109, "slug": "rootwork", "name": "Rootwork", "name_original": "Rootwork", "description": "&amp;quot;Rootwork is atmospheric, aesthetically pleasing and full of mystique.&amp;quot; -- Casual Gameplay @ jayisgames.com<br/>&amp;quot;[Rootwork is] an unsettling game, rooted in mysticism and darkness, and the creepiness weaves its way into the mechanics of the thing almost unseen.&amp;quot; - Touch Arcade, 4 Star Review.<br/>&amp;quot;Rootwork is a solidly built, psychologically disturbing, yet strangely inviting game.&amp;quot; - kellogthoughts.com<br/><br/>You are lost. Lost in the woods. But this is no ordinary forest. Malevolent spirits stalk these woods, strange stick sculptures decorate its trees, and something evil hovers at the edge of your vision, unseen and yet powerful. “She” is the dark heart of the woods, and She taunts you as you flee deeper into Her depths.<br/><br/>Use your Talisman cards to escape the Menaces and Evil Spirits that will hound you as you try to seek shelter at a Site and remember your way out. As you defeat the Four Terrors, Ruin, Blight, Snare, and Mourne, voice-acted videos will tell their stories. After the final video in each series, a new mini-game based on the Evil Spriit&amp;#39;s life will unlock. Rootwork contains a total of five card games, all of which can be unlocked strictly by playing the main game.<br/><br/>Rootwork features:<br/><br/>• A Sophisticated Card Game with challenging and fast card play using a matching system with a few surprises designed to make you feel lost in the woods.<br/>• Big, unadorned, beautiful cards filled with original artwork at the highest possible resolution. The ambience of the forest is supplemented with original music.<br/>• Eight different characters, each with a slightly different game play. Four of these characters must be unlocked via achievements.<br/>• Twelve short films fully voice acted that tell the story of the Evil Spirits in the woods, unlocked by achievements, that culminate in a final revelation about She.<br/>• The Hoodoo Man’s notebook, in which he has recorded the Rules to the game and an encyclopedia of cards.<br/>• A full tutorial, taught by the Hoodoo Man&amp;#39;s son Lucas, that shows you how to escape the woods.<br/>• Four card games unlocked by playing the Main Game, each with its own tutorial video:<br/>- Ruin&amp;#39;s Run - Ruin was tortured by the men of her village. Help her flee them to reduce her strength!<br/>- Blight&amp;#39;s Decay - Blight&amp;#39;s cultists want to convert your friends with Slime! Defend them with Honor!<br/>- Snare&amp;#39;s Solution - The soul of Snare&amp;#39;s wife is trapped in the Woods. You can free her by crafting and burning incense!<br/>- Mourne&amp;#39;s Lament - Mourne was forgotten by everyone she loved. Remember her to weaken the grip of She.<br/>• The conundrum of the She card. She is always nearby, ready to “help” you escape. Do not trust Her! Do not let her help you. She will betray you!<br/>• A puzzle mini-game, where you can unlock a powerful card if you’ve been listening.<br/>• An achievement system that lets you unlock helpful cards with unique artwork that make the game easier as you progress.<br/><br/>Rootwork is a Universal app with a simple business model: buy the game, put it on all your devices, and enjoy the game. No points or coins or hearts to buy.<br/><br/>Visit us at www.simulatedculture.com for the Rootwork FAQ, Blog, and the Rules to the game!", "metacritic": null, "released": "2013-05-06", "tba": false, "updated": "2019-10-22T13:57:23", "background_image": "https://media.rawg.io/media/screenshots/144/1447fe5164d0ea407b0ddc95b7a9e2a1.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Simulated Culture"], "genres": ["Board Games", "Card"], "publishers": ["Simulated Culture"], "esrb_rating": "Teen"}