{"id": 310942, "slug": "super-80s-world", "name": "Super 80s World", "name_original": "Super 80s World", "description": "Rewind time to 1980 in this mobile platformer, where you save the decade by collecting old-school memorabilia.<br/><br/>Dr. Noid Wormser hates the '80s and vowed to erase the decade.  Emptying the pop culture of his tortured youth from the recycle bin of history.  Only one man, stuck in the decade forever, has the power to stop him.  That man is Dan Camaro.  Dan. Camaro.<br/><br/>Bounce, flip and slide your way through the decade.  Each year is a different world, from coin-operated arcades to the neon glow of Miami Beach.  Many obstacles stand your way.  Only by rebuilding your massive collection of '80s VHS tapes, cassettes and video games will you be able to save the day.<br/><br/>So pop your collar, fluff your mullet and lace your kicks... It's time for Super 80s World, dude.  Nothing but cool synthwave tunes and tasty waves lie ahead.  Time to see if YOU can outrun the '80s!<br/><br/>Features<br/>* Over 40 levels through five unique worlds<br/>* Six boss battles<br/>* Four old-school arcade mini-games<br/>* Over 1,700 legit collectables from the decade<br/>* Nine unique skills to learn as you progress<br/>* 20+ hours of gameplay<br/>* An amazing Synthwave Soundtrack <br/>* Hundreds of ‘80s easter eggs, references and inside jokes<br/>* Game Center Support<br/>* Eight Leaderboards<br/>* Over 100 fun achievements<br/>* Simple tap controls and fun combination moves<br/><br/>Testimonials<br/>\"Super 80s World is an '80s Nostalgia Bomb\" – Touch Arcade<br/>\"There’s lots of variety in the actions you perform, the pixel artwork is excellent and the level design is a lot less linear than traditional runners.\" – Alpha Beta Gamer<br/>\"Whatever it takes to get him and his collection of '80s action figures out of the basement!\" – Dan Camaro’s mom.", "metacritic": null, "released": "2019-04-18", "tba": false, "updated": "2019-10-22T14:37:31", "background_image": "https://media.rawg.io/media/screenshots/628/6283f2484d2fbba1eb7bf85ec74a2d26_NAQK0e1.jpg", "website": "https://Super80sWorld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tap Tap Good"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Tap Tap Good"], "esrb_rating": null}