{"id": 311, "slug": "sunless-sea", "name": "Sunless Sea", "name_original": "Sunless Sea", "description": "<h3>The help from Kickstarter backers</h3>\n<p>This is a role-playing game with roguelike elements from the independent British studio Failbetter Games. The money was collected on Kickstarter, just 4 271 backers supported the game, and donated a little over a hundred thousand pounds to its development. The game is available for solo completion on PC, Mac, and Linux.</p>\n<h3>Story and setting</h3>\n<p>The player tries on the role of the captain of the ship. Captain&#39;s backstory is fully customizable. The game is a spin-off for the browser game Fallen London from the same developers: the action takes place in the same universe and at the same time. The game mixes the Victorian era and the mystical atmosphere of Lovecraft&#39;s books. The player sails between different islands of the underground sea, facing different dangers. To win, you need to achieve a certain goal: for example, to find a treasure or to gain the title of the most famous seafarer by transporting goods and opening new lands.</p>\n<h3>Key Features</h3>\n<p>Death is permanent in the game - the player starts all over again after each defeat. Developers have added the ability to inherit some of the property or team of the predecessor. The game world is randomly generated, although the location of the main ports and islands remains unchanged.</p>", "metacritic": 81, "released": "2015-02-05", "tba": false, "updated": "2023-12-27T09:16:41", "background_image": "https://media.rawg.io/media/games/c32/c323f9c17ac95c363772bb9ff3693dc6.jpg", "website": "http://www.failbettergames.com/sunless/", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 228, "owned": 1942, "beaten": 56, "toplay": 65, "dropped": 160, "playing": 24}, "playtime": 3, "achievements_count": 54, "ratings_count": 236, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 239, "platforms": ["Linux", "iOS", "PC", "macOS"], "developers": ["Failbetter Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Failbetter Games"], "esrb_rating": "Teen"}