{"id": 311071, "slug": "concentration-cards-matching-game-free-find-pairs-", "name": "Concentration Cards Matching Game FREE: Find Pairs & Train Your Memory Skills if you're preschoolers, schoolchildren, adults or seniors suitable from 2 to 100 years - for iPad and iPhone 3, 4, 5 HD", "name_original": "Concentration Cards Matching Game FREE: Find Pairs & Train Your Memory Skills if you're preschoolers, schoolchildren, adults or seniors suitable from 2 to 100 years - for iPad and iPhone 3, 4, 5 HD", "description": "★ The Number1 game in USA &amp; Germany during its free launch!<br/>★ This game speaks using real human voices in 4 languages!<br/>★ Shipped card sets: Audio Catch, Dog's life, Cartoon Animals, Ocean, Christmas, America Maps and Europe Maps. <br/>★ An addictive and challenging memory match game enjoyed by kids and adults alike! <br/>★ Selected card sets (for example, Ocean) use real human voices to give yet another dimension to the game interaction. <br/>★ A unique system of score calculation enables online sharing of your top scores. You can see both world-wide and national top scores. Will you beat them?<br/><br/>Premium play sets may be played for free but Ads are shown before the game starts.<br/><br/>The Audio Catch card set is a quite different way of exercising brain cells - they are all blind cards only (without any pictures) and you have to associate a sound effect with each card. The various sound effects are also fun for your kids!<br/><br/>Memory Cards is a simple yet extremely amusing (and addicting!) game designed to provide hours of fun while sharpening your mind. The goal is simple: Match as many cards as possible in as little time as possible. You can control the difficulty of the game by selecting boards of different sizes. The bigger the board, the greater the challenge! It’s fun for people of all ages - and parents, don’t be surprised if your kids with those minds that remember everything, give you a run for your money!<br/><br/>★ Memory Cards combines sharp graphics, animation, and fun, unique hand drawn card sets that challenge and amuse your mind! <br/>★ Children will enjoy shuffling the cards using our realistic gravity animations.", "metacritic": null, "released": "2010-12-06", "tba": false, "updated": "2019-10-22T14:37:39", "background_image": "https://media.rawg.io/media/screenshots/a9f/a9ffca508954d8b48826faf48f876f65.jpg", "website": "http://PerfectGamesOnline.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SHARK Intelligence"], "genres": ["Family"], "publishers": ["Shark Intelligence"], "esrb_rating": "Everyone 10+"}