{"id": 311037, "slug": "chakra-balance-puzzle-game", "name": "Chakra Balance Puzzle Game", "name_original": "Chakra Balance Puzzle Game", "description": "How would you like the ability to play and balance your Chakras at the same time?<br/><br/>What if I told you that clearing negative energy was as simple as playing a fun and addicting puzzle game?<br/><br/>Interested?<br/><br/>Introducing Chakra Balance Puzzle Game the most unique and fun way to balance your chakras. <br/><br/>It is said that one of the easiest ways to balance your energy is to concentrate on the specific Chakra color that you want or need to balance and the Chakra Balance Puzzle Game provides that and much more…<br/><br/>The  Chakra Balance Puzzle Game also uses the powerful sound of the Chakra Gong which is a soft wave that has been known for breaking up negative energy which increases the positive flow of your Chakras. Every time you touch a Chakra you release the sound of the Chakra Gong and the clearing effects.<br/><br/>But thats not all…<br/><br/>This fun, new and unique as well as beautiful puzzle game also includes a the sound of the Tibetan Singing Bowl which has been known to help properly balance Chakras and provide the positive effects to experience your true power.<br/><br/>Here is how to play: <br/><br/>This fun, new and unique as well as beautiful puzzle game offers a challenging and stimulating experience as you play, matching up  3 or more like Chakras to build your score..<br/><br/>Puzzles can last 5 minutes or puzzles can last an hour….  You never know what puzzle you are going to encounter each time you grab your Mobile Device... (:<br/><br/>The perfect gift for yourself or any one else looking to get back to source… <br/><br/>It is the season for giving so I am pricing this app 75% off the regular price...<br/><br/>Act now and get it for only $0.99 <br/><br/>FREE UPDATES FOR LIFE!", "metacritic": null, "released": "2012-04-23", "tba": false, "updated": "2019-10-22T14:37:36", "background_image": "https://media.rawg.io/media/screenshots/5a8/5a8cf417fc001abdeb76b66a9e72005e_NRpNl0C.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wayne Hagerty"], "genres": ["Strategy", "Puzzle"], "publishers": ["Wayne Hagerty"], "esrb_rating": "Everyone 10+"}