{"id": 3111, "slug": "wwe-2k16", "name": "WWE 2K16", "name_original": "WWE 2K16", "description": "<p>The authority in WWE video games returns with WWE 2K16!  The newest addition to the flagship WWE video game franchise will deliver fun, authentic and hard-hitting action, including returning fan-favorite features and game modes, new innovations and more!  Play as the greatest WWE Superstars, Divas and Legends of all time. Includes all DLC content!<br />\nKey Features:<br />\nLargest Roster Ever:Offering more than 120 unique playable characters, including cover Superstar Stone Cold Steve Austin alongside Seth Rollins, Daniel Bryan, Dean Ambrose, Bad News Barrett, Paige and Finn Bálor, WWE 2K16 includes the largest roster in WWE video game history.<br />\n2K Showcase: The franchise’s popular story-based mode returns in WWE 2K16, enabling players to relive iconic matches and moments in WWE history. Along the way, they will complete objectives to unlock legendary characters, entrance and ring gear, match types and unlockables.<br />\nWWE Universe: WWE 2K16 makes core improvements to stories, rivals and match card selections. In addition, for the first time, Superstars can be assigned to multiple shows, enabling players to have a broader experience.<br />\nAll DLC Included: WWE 2K16 includes all of the DLC.  Gain access to the following bonus content:<br />\nArnold Schwarzenegger as The Terminator: Play as two playable versions of Arnold Schwarzenegger as the Terminator: T-800 from The Terminator and T-800 from Terminator 2: Judgment Day.<br />\nMyPlayer KickStart: Players will gain instant access to boost created Superstar ratings and attributes in the game’s MyCareer mode.<br />\nAccelerator: Players will gain instant access to all unlockable content available in the game (excluding downloadable content).<br />\nNew Moves Pack: More than 30 new moves, including the Corner Enzuigiri (made popular by WWE Diva Nikki Bella), Avalanche Ram (made popular by WWE Diva Paige), Sidewinder Suplex (made popular by WWE and NXT Superstar Kevin Owens).<br />\nLegends Pack: Playable WWE Legends: Big Boss Man, Dusty Rhodes, Lita, Mr. Perfect, “Rowdy” Roddy Piper and Trish Stratus.<br />\n2015 Hall of Fame Showcase: Playable matches and Superstars include:<br />\n“Macho Man” Randy Savage vs. Jake “The Snake” Roberts<br />\nRikishi vs. The Rock<br />\nAlundra Blayze vs. Paige<br />\nLarry Zbyszko/Arn Anderson vs. Ricky “The Dragon” Steamboat/Dustin Rhodes<br />\nTatsumi Fujinami vs. Ric Flair<br />\nThe Bushwhackers vs. The Natural Disasters<br />\nThe Outsiders vs. Harlem Heat Future Stars Pack: Playable WWE/NXT Superstars:<br />\nSamoa Joe, Diego, Fernando, Blake, and Murphy</p>", "metacritic": 74, "released": "2015-10-27", "tba": false, "updated": "2024-03-09T22:08:29", "background_image": "https://media.rawg.io/media/games/884/884e6a520b60aac011a38f4954303448.jpg", "website": "", "rating": 2.91, "rating_top": 3, "added_by_status": {"yet": 36, "owned": 858, "beaten": 42, "toplay": 3, "dropped": 81, "playing": 1}, "playtime": 4, "achievements_count": 309, "ratings_count": 159, "suggestions_count": 335, "game_series_count": 9, "reviews_count": 159, "platforms": ["Xbox One", "PC", "Xbox 360", "PlayStation 3", "PlayStation 4"], "developers": ["2K", "Visual Concepts", "Yuke's Co"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["2K Games"], "esrb_rating": null}