{"id": 311452, "slug": "there-is-still-snow-in-lapland", "name": "There Is Still Snow in Lapland", "name_original": "There Is Still Snow in Lapland", "description": "Story\r\n<p>You are a snowball in Lapland where there is still snow left. But as spring awakes and the sun is starting to melt you away, you realise you haven't seen anything of the world yet. So you do the one thing left to do: roll on and try to get as far as you can!</p>\r\nHow to play\r\n<p>Use left and right arrow keys to accelerate yourself in the respective direction. Rolling over snowy floor tiles increases your size. The more snow on a tile, the faster you grow.</p>\n<p>You have two opponents in the game. First: the scorching sun. The sun will continuously melt you away. This happens faster the larger your surface is and the slower you move. Your second enemy is the ground beneath you. Crashing into the terrain causes you to lose mass.</p>\n<p>If you lose too much of your precious snow, be it by heat or impact, you die and the game is over.</p>\n<p>You can press escape at any time to quit the game.</p>\r\nInstallation\r\n<p>Just download and extract the archive for your architecture. There's a data package and  single executable - just run that from the command line or from a file browser of your choice and you should be good to go.</p>\r\nNotes\r\n<p>I'm aware that the game's physics can sometimes be quirky. Probably a bug.</p>\n<p>Also the single sound effect in the game can be a bit annoying, so you can toggle audio playback by pressing M.</p>\n<p>Currently when you quit the game there is an error displayed on the console originating from Godot - I honestly don't know if it is my fault or an engine bug. I might investigate later, but I'm too tired right now.</p>\r\nTools used\r\n<p>The game has been developed using open source software only. Namely these:</p>\n<ul><li>Godot</li><li>GIMP</li><li>Darktable</li><li>Linux</li><li>Audacity</li></ul>", "metacritic": null, "released": "2019-04-19", "tba": false, "updated": "2019-04-22T05:02:16", "background_image": "https://media.rawg.io/media/screenshots/ede/edee1cbe5786ed54c0b6ca381533bc5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["GreenBeakCrow"], "genres": [], "publishers": [], "esrb_rating": null}