{"id": 311667, "slug": "risk-system-2", "name": "Risk System", "name_original": "Risk System", "description": "In the distant future, humanity has discovered a method to replicate matter through the use of a Dimensional Gate. Industry is revolutionized overnight and a short period of chaos gives way to all warring factions uniting under a common banner.<br/>\n<br/>\r\nA few years pass and the peace brought about by Gate Technology crumbles once a new threat appears; a race of energy parasites that have crossed through the Dimensional Gate by mimicking the very materials humanity had believed they were replicating. Mankind is quickly overtaken as their technology is turned against them and the energy emitted by the parasites begins to take control of those exposed.<br/>\n<br/>\r\nIn an act of desperation, the experimental RSK9 is constructed, a ship made of Pre-Gate materials and technology with the ability to absorb parasite energy and use it to power its incredible arsenal. Piloting the RSK9 is Alys, an ace pilot previously missing in action that has returned seemingly immune to parasite control. Her skill and resistance to the parasite energies influence make her the only pilot capable of preventing the extinction of mankind.<br/>\n<br/>\r\nGAME PLAY:<br/>\n<br/>\r\n-Increase your B-Meter &amp; firepower quickly by flying as close to enemy fire as possible and absorbing their energy. The closer you fly, the more energy you net!<br/>\n<br/>\r\n-Fire your weapon while flying close to enemy fire and absorbing to perform powerful \"Risk Shots\". Enemies destroyed by these powered up shots will turn into energy to power your shield. The best defense is a risky offense!<br/>\n<br/>\r\n-Fly like an ace pilot and utilize Barrel Rolls to quickly cover vertical space &amp; modify your attack!<br/>\n<br/>\r\n-Unleash the Barrier Breaker once the B-Meter is full to inflict huge damage on everything in sight!<br/>\n<br/>\r\n-Playing for points is fun again as higher scores are awarded for explosive bursts of destruction and taking risks! Destroy multiple enemies at once and utilize \"Risk Shots\" to string together combos and increase your score multiplier!<br/>\n<br/>\r\n-Experience different facets and paths to the story based on your performance and actions taken during missions!", "metacritic": null, "released": "2019-05-14", "tba": false, "updated": "2021-03-05T05:36:41", "background_image": "https://media.rawg.io/media/screenshots/dc8/dc88294cac034bbab5b70ee36ae1e584.jpg", "website": "https://www.newtindustries.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One", "Linux", "PC", "macOS"], "developers": ["Newt Industries"], "genres": ["Action", "Indie"], "publishers": ["Newt Industries"], "esrb_rating": null}