{"id": 311672, "slug": "avocuddle", "name": "AvoCuddle", "name_original": "AvoCuddle", "description": "ًWelcome to AvoCuddle world:AvoRa and Avoln live on AvoPlanet, a peaceful garden planet. They love each other, but sometimes they argue or do stupid things that hurt. The game starts with a peaceful view of the world breaks when we see the two Avos angry at each other.<br/>AvoRa walks stomps away to be alone – and very sad. Then AvoLn  unfortunately gets kidnapped by stranger in spaceship where AvoRa starts his journey to search and free his true love.<br/><br/><br/><br/>\"AvoCuddle\" tells a tale of true love! An emotional action adventure through the galaxy searching and seeking to free your soul mate. Explore beautiful and dangerous planets, fight it's special creature and solve puzzles , through a visually stunning 2D-platformer.Game Features<ul><li>Classic side-scrolling action  emotional 2D-platformer with all the modern parallax effects.<br/></li><li>Tightly tuned 2D controls. jump, dash, jetpack, parachute, swim and shoot your way through even the most deadly adversaries.<br/></li><li>Explore 5 distinct planets throughout the galaxy using your spaceship.<br/></li><li>Meet and battle cute and creepy characters in each unique planet.<br/></li><li>Enjoy using 7 weapons from short range pulse gun to homing missile launcher.<br/></li><li>Kill enemies to collect Limon Currency.<br/></li><li>Operate your mind to solve some puzzles.<br/></li><li>Use Limon currency to buy items or upgrades for your weapons.<br/></li><li>Beautiful painted landscapes, with extravagant parallax, give a unique sense of depth to a side-on world.</li></ul>", "metacritic": null, "released": "2019-07-12", "tba": false, "updated": "2020-12-16T14:38:36", "background_image": "https://media.rawg.io/media/screenshots/df2/df27d1c66939e3e0a1acf96572ea626f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC"], "developers": ["Ramez Al Tabbaa"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Ultimate Games", "FistikTech"], "esrb_rating": "Everyone 10+"}