{"id": 3116, "slug": "hasbro-family-fun-pack", "name": "Hasbro Family Fun Pack", "name_original": "Hasbro Family Fun Pack", "description": "Hasbro Family Fun Pack is a brand-new compilation of endless fun. Family game nights have been reinvented, providing hours of entertainment with four classic titles. With modern twists and exciting new ways to play, your favorite Hasbro games have never been more enjoyable!<br/><br/>GREAT VALUE - Four classic titles in one bundle, providing hours of entertainment!<br/>MONOPOLY Plus - Play the MONOPOLY you know and love set in a beautiful 3D world - watch the board come to life!<br/>RISK - Compete with players from around the world in this classic game of global domination.<br/>TRIVIAL PURSUIT Live! - Featuring unique question formats and diverse rounds - it's never been so fun for everyone.<br/>SCRABBLE - Challenge opponents in person or online, and test your word skills with new game modes!<br/><br/>1-4 players<br/>1080p HD Video Output<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>MONOPOLY, RISK, TRIVIAL PURSUIT and SCRABBLE are trademarks of Hasbro and are used with permission. SCRABBLE, the associated logo, the design of the distinctive SCRABBLE brand game board, and the distinctive letter tile designs are trademarks of Hasbro in the United States and Canada and are used with permission. The MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of board and playing pieces are trademarks of Hasbro for its property trading game and game equipment and are used with permission. © 2015 Hasbro.  All rights reserved. Licensed by Hasbro to Ubisoft Entertainment. Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries. Games software © 2015 Ubisoft Entertainment. All Rights Reserved.", "metacritic": null, "released": "2015-10-20", "tba": false, "updated": "2023-07-25T22:18:14", "background_image": "https://media.rawg.io/media/screenshots/625/625813992758891d0a81aa1e1cc41c34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "beaten": 1, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 35, "ratings_count": 3, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "Xbox One"], "developers": ["Ubisoft"], "genres": [], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Everyone 10+"}