{"id": 311673, "slug": "starfighter-infinity", "name": "Starfighter: Infinity", "name_original": "Starfighter: Infinity", "description": "Starfighter: Infinity is a space based MMORPG with a focus on ‘dogfighting’ style action and exploration.<br/><br/>Features a huge array of imaginitive weapons and ship upgrades and more being added all the time. A large selection of ships that you can unlock as you progress through the game.<br/><br/>Create your own organisations, that have an effect on the in game world by branding stations, and ai ships and choosing weapon loadouts for AI ships. Declare war on other organisations<br/><br/>...or...<br/><br/>Just keep to yourself and pursue your own goals<br/><br/>Craft unique weapons and upgrades by finding their blueprints<br/><br/>Encounter other alien races and loot their unique weaponsCraft, Loot Discover<ul><li>62 playable ships (so far) with different stats and play styles unlocked as you progress. <br/></li><li>550 different items (so far) that you can buy, craft or loot. With a large variety of imagination - not just different numbers, weapons act differently have different effects. See the official website for a full list<br/></li><li>Hunt down and mine precious minerals that can then be crafted into weapons/items</li></ul>Fight<ul><li>Realtime multiplayer PvP and PvE - keyboard or joypad based action involving skill. Action is skill based dogfighting style, with no fixed tactics: use a fast ship and evade, or a slower ship with tactical aids, and lots of shields. How you combine weapons and tactics is up to you.<br/></li><li>Designed so that pretty much any ship in game is a threat - you are not 'the chosen one', you have no special advantage over any other ship except your own cunning and skill...<br/></li><li> Neutral zones, warzones, free for all zones, duels and also jammers, interfering nebula dust all allow for different types of combat and tactics, or no combat at all...</li></ul>Explore<ul><li>12 explorable star systems with different things to discover<br/></li><li>Loads of planets with their own back stories<br/></li><li>Ancient Relics drifting in space - not all are just dormant<br/></li><li>Explore inside space stations, chat to other players while turrets protect you from incoming enemies.</li></ul>Organise<ul><li>Team up with other players to form your own organisation and compete with others<br/></li><li>Organisation run stations: Affect the star system around you - Nearby AI ships will be coloured and branded to your organisation and will have weapons specified by you. Therefore the galaxy is very much influenced by the people playing it.<br/></li><li>Get special ranks and ships for running an organisation with a certain amount of members</li></ul>", "metacritic": null, "released": "2019-06-17", "tba": false, "updated": "2019-08-28T21:46:12", "background_image": "https://media.rawg.io/media/screenshots/46a/46a350759813c6feb4c1a34d9fb62a03.jpg", "website": "http://www.starfighterinfinity.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "dropped": 1}, "playtime": 3, "achievements_count": 29, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ben Olding Games"], "genres": ["RPG", "Massively Multiplayer", "Indie"], "publishers": ["Ben Olding Games"], "esrb_rating": null}