{"id": 311675, "slug": "sometimes-to-deal-with-the-difficulty-of-being-ali", "name": "Sometimes to Deal with the Difficulty of Being Alive, I Need to Believe There Is a Possibility That Life Is Not Real.", "name_original": "Sometimes to Deal with the Difficulty of Being Alive, I Need to Believe There Is a Possibility That Life Is Not Real.", "description": "This software is a simulation, a database of games and narrations, a play, an instrument, a network, two forests, a pond, a conscious slice of pizza having an existential crisis, a chimeric alien reggae band and a modular experience you can send electronically to anywhere in the world. It might not be for everyone. But I made a comprehensive, 136 page guidebook. Click on \"View the manual\" on the right hand of the page to see it.<br/>\n<br/>\r\nEverything revolves around a landscape stage called Polyp’s Pond. There are three protagonists: Smerga, Kaotoa and Skalitir. They are the smartest three remaining AI after a human apocalypse. They are building a machine to generate more living AI. They have computers you can play games on. They are being attacked by swamp creatures. They are sending absurd emails to nowhere and procrastinating and gossiping. You can inhabit the body of one of the Tulpas generated from a previous iteration of their machine and explore Polyp’s Pond. Or you can change the point of view and watch one of the protagonists go about its day of work. You can network computers together and have multiple views going at once. You can talk with other Tulpas and decide if they are AI or other humans who have joined the network. Leave the simulation running all day and see all the different things the protagonists do and make.", "metacritic": null, "released": "2019-05-15", "tba": false, "updated": "2019-08-28T21:46:12", "background_image": "https://media.rawg.io/media/screenshots/4ce/4ce7fcd3000968180fd765d5197f28a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeremy Couillard", "Ireneo Mercado"], "genres": ["Simulation"], "publishers": ["Jeremy Couillard"], "esrb_rating": null}