{"id": 311718, "slug": "sectors-edge", "name": "Sector's Edge", "name_original": "Sector's Edge", "description": "<p>OverviewSector&#39;s Edge is a fast-paced destructive voxel-based first person shooter in which two teams of 8 fight for zone domination across various planets.<br />\nThe environment is composed entirely of voxels (blocks) which can be destroyed or created, resulting in a constantly changing battlefield. You can fully customise your character, weapon loadouts and preset structures for quick building.<br />\nThe game is currently in early access and includes:<br />\n17 weapons<br />\n4 tools<br />\n6 perks<br />\n4 maps<br />\nDomination game mode<br />\n3 character skins<br />\nPlayer level and unlockable rewards<br />\nOptional single player challengesStoryYou play as a mercenary caught in a war over the attainment of Soltrium, a radioactive element forged from the collapse of a distant star. Located at the edge of the known universe where galactic law does not apply, constant conflict ravages the sector.<br />\nThis unstable element has caught the attention of the superpowers Helix and Aegis for its incredible potential for weaponry and energy generation. Ownership of Soltrium is enough for one to reign dominant over the other.<br />\nIn this unknown sector Helix and Aegis rely on mercenaries like you to fight for them. Soltrium shards have erupted from the star onto nearby planets and it is your role to collect it. Shoot enemies, build defences, control zones and be rewarded for your efforts.CommunityOur primary method of communication is our public Discord Server, where you can see behind the scenes footage, apply for pre-alpha testing and talk directly with us.</p>", "metacritic": null, "released": "2020-10-30", "tba": false, "updated": "2020-10-19T01:19:40", "background_image": "https://media.rawg.io/media/screenshots/b85/b85e0bde733093e5508dd879b5fb0beb.jpg", "website": "http://sectorsedge.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "dropped": 2}, "playtime": 0, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Vercidium", "Rocket Skeleton"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Vercidium"], "esrb_rating": null}