{"id": 311733, "slug": "the-red-reactor", "name": "The Red Reactor", "name_original": "The Red Reactor", "description": "INTRODUCTION<br/>Welcome to one man game project, The Red Reactor. In this game, you will witness a different kind of experience of defence game. You are going to build your village and different kind of defences with first person experience. Of course to do that, you are going to need a lot of help of your citizens. You will be encountering various enemies that have only one purpose, and that purpose is to destroy the reactor.GAMEPLAY<br/>You will have nothing but the reactor at the beginning, and slowly, you have to build your village and defences to be able to survive the enemy attacks that will grow after every attack. Your citizens will be helping you, too, if you train them as guards. Also you will be encountering enemy villages, and you should know that they have to be destroyed. You have to be careful about your food stock and your money. Citizens need food, and guards, warriors, defences will require lots of money as long as they exist. Lack of your food and money will directly affect your reactor. So, you need to have good strategies to keep your village alive in harder game modes. You will be able to either increase the size of your village or colonise at a far location with little reactors that you can buy from a trader.BLUE PALM SUGGESTION<br/>If you like defender games, this game might be an interesting experience for you. Of course, you should consider that it is a first person style game. And if you like building with this style, you can try this game because you can choose the difficulty of the game and focus on building a neat village more.", "metacritic": null, "released": "2019-05-10", "tba": false, "updated": "2019-08-28T21:46:08", "background_image": "https://media.rawg.io/media/screenshots/8cf/8cfa007ee891c7a1fc39158a581c3f40.jpg", "website": "http://www.bluepalmstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Blue Palm Studio"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Blue Palm Studio"], "esrb_rating": null}