{"id": 311793, "slug": "art-of-war-3rts-strategy-game", "name": "Art Of War 3:RTS Strategy Game", "name_original": "Art Of War 3:RTS Strategy Game", "description": "А unique classic real-time strategy game with direct control for true commanders who are not afraid to face the enemy in real-time PvP battles! For those who want to feel the thrill of victory over a live opponent! For those who can think like a strategist and act decisively in any battlefield situation! It’s no place for the timid! <br/><br/>Are you ready for the challenge, Commander?<br/><br/>Art of War 3: Global Conflict (AOW) - is a real-time strategy online game in the best tradition of old classic PC RTS games. Command, conquer and defeat your enemy on the battlefield! In this modern warfare game, you have to fight with other players in PvP battles, invent new combat tactics, develop your victorious strategies, and upgrade infantry, assault vehicles, tanks, navy, and air force to achieve supremacy over the enemy in battle.<br/><br/>The action takes place in the near future. The world is engulfed by a global conflict between two warring factions - the Confederation and the Resistance. Choose your side and fight shoulder to shoulder with other commanders to win in this World War. Take the side of the Confederation and protect the world from the red alert. Join the rebels and crush the global domination system.<br/><br/>● Epic real-time PvP and cooperative battles.<br/>● Thousands of players online from all over the world! <br/>● Classical RTS direct control system. You can control each unit directly!<br/>● Stunningly detailed 3D graphics will provide you with full immersion.<br/>● A variety of units and tactical abilities allow you to invent different victorious strategies.<br/>● Two warring factions, each with their own features, unique combat units, strengths, and weaknesses.<br/>● А big number of unit and building upgrades gives you ample opportunities to create your own unique and victorious army.<br/>● Continuous World War in which the clans fight each other for global domination.<br/>● А huge campaign for each faction, including dozens of hours of game time.<br/><br/>This online, real-time (RTS), modern war strategy game gives you the opportunity to feel like a battlefield general. Command, conquer, build your base, train infantry, produce assault tanks and armored vehicles, warplanes, and warships to defeat the enemy. Take part in the World War. Use superweapons and unleash your power! Join a clan with your friends and fight other clans to dominate the world. Bring your enemies to total annihilation!<br/><br/>We need you, general!<br/><br/>Art of War 3: Global Conflict is a multiplayer online game. It requires a constant, stable internet connection.<br/><br/>Facebook page:<br/>https://www.facebook.com/aow3rts<br/><br/>YouTube channel: <br/>https://www.youtube.com/user/GearGamesInc", "metacritic": null, "released": "2017-01-15", "tba": false, "updated": "2019-10-22T14:37:42", "background_image": "https://media.rawg.io/media/screenshots/a09/a09644b2ab766462be644f84126d2fee.jpg", "website": "http://aow3.gear-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Gear Games"], "genres": ["Strategy", "Board Games"], "publishers": ["Gear Games"], "esrb_rating": "Teen"}