{"id": 311750, "slug": "the-tower-the-order-of-xii", "name": "The Tower: The Order of XII", "name_original": "The Tower: The Order of XII", "description": "A long time ago the world was ruled by a powerful evil force called <strong>\"The Void\"</strong>. One day twelve heroes came together and against all odds they were victorious. The void started to fade and the twelve heroes made their promise to the people, they will continue their mission until no signs of that evil remain. <strong>The Order of XII was born</strong>.<br/><br/>Now many years later The Order continue with that oath, fighting creatures born from that evil. And so, <strong>Eleven</strong> arrives to his destination. The distant region of <strong>Kafshir</strong> has been under the attack of ferocious creatures for weeks and the villages in the region start to vanish across the region.<br/><br/>Will you help the people? Will you find out the truth behind these attacks?<br/><br/>Enjoy this narrative puzzle game with the main campaign, learn how the game works and face the challenge mode where all mechanics come together in increasily harder puzzles.<br/><br/><strong>Features:</strong><br/><br/><ul><li> Campaign: first entry in our shared universe divided in 5 levels.</li><li> Challenge Mode: Put the knowledge you got from the campaign to the real test. 25 single puzzles, no checkpoints and if you don't have enough face the challenges plus. 5 more levels with increasing difficulty and each one longer than the previous one. </li><li> Extras Mode: Find the secrets hidden in the campaign and unlock exclusive information about the world of The Order of XII. </li></ul>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2020-02-12T14:36:09", "background_image": "https://media.rawg.io/media/screenshots/020/020e8c033fe780504f20afa4a2233ab7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sword Garden Studios"], "genres": ["Strategy", "Indie", "Puzzle"], "publishers": ["Sword Garden Studios"], "esrb_rating": null}