{"id": 311792, "slug": "prehistoric-fun-park-builder", "name": "Prehistoric Fun Park Builder", "name_original": "Prehistoric Fun Park Builder", "description": "Build an incredible prehistoric theme park and become an amusement tycoon of the Stone Age! Take up the call of the primeval past and enter the world of crazy prehistoric rides, attractions and roller coasters! Turn a boring caveman’s life into a wonderful never-ending holiday!<br/><br/>Note: The game requires iPhone 4S/ iPod Touch 5/ iPad 2/ iPad mini or above.<br/><br/>* You can choose from more than 60 mind boggling attractions and rides: giant wooden swings, trampolines made from mammoth hide, giddy merry-go-rounds, stone slides, extreme roller coasters, water rapids and even dinomotors powered by real huge dinosaurs to make all these rides run!<br/><br/>* Decorate your theme park with exotic trees, unique flowers, pagan totems and stone temples.<br/><br/>* Build snack bars, drinking fountains, balloon stands and restrooms around the park to meet your customers' needs.<br/><br/>* Build cozy rest areas and place benches around for your visitors to feel comfortable in your wonderful park.<br/><br/>* Offer your guests a fruit cocktail, cook them a great kabob and treat them with the first  ice cream ever created.<br/><br/>* Hire workers. They will keep your park running and take care of visitors when you are not in the game.<br/><br/>* Play with your friends and share your achievements! Compete with them to build the best amusement park!<br/><br/>Build the biggest and craziest prehistoric theme park ever! The prehistoric world is waiting for you! PLAY IT NOW FOR FREE!<br/>_________________________________________<br/><br/>LIKE US<br/>http://www.facebook.com/PrehistoricPark<br/><br/>FOLLOW US<br/>https://twitter.com/GearGames<br/><br/>WATCH US<br/>https://www.youtube.com/watch?v=eiDNLlQxirs<br/>_________________________________________<br/><br/>Please note that the game requires internet connection.", "metacritic": null, "released": "2013-11-25", "tba": false, "updated": "2019-10-22T13:55:54", "background_image": "https://media.rawg.io/media/screenshots/7b1/7b181a83361065ede6bfb82ae701ce84_P9voKyC.jpg", "website": "http://prehistoric-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gear Games"], "genres": ["Strategy", "Family"], "publishers": ["Gear Games"], "esrb_rating": "Everyone 10+"}