{"id": 311780, "slug": "hedon", "name": "Hedon", "name_original": "Hedon", "description": "➣ It's an oldschool/boomercore game not by just looks and engine, but by gameplay.<br/><br/>➣ Gory, fast paced shooting, a solid arsenal of weapons and magic items.<br/><br/>➣ Sprawling levels that offer a degree of freedom and don't hold the player's hand. Exploring, hunting secrets, backtracking, patience and having to figure out what to do next is key. Monsters and pickups are hand-placed and vary according to the difficulty you play on.<br/><br/>➣ Original story packed with lots of lore and doubled by a permeating atmosphere.<br/><br/>➣ Original soundtrack ranging from tense to serene ambient, spiced up with bursts of metal. Also, did I mention the legendary Alexander Brandon? If you enjoyed the Unreal and Deus Ex soundtracks, you're in for a treat!<br/><br/>➣ Thousands of hours of work put into an original concept, digitally hand-drawn graphics (textures, sprites, frame by frame animations etc.), scripting, sound effects and level design, all by a one man dev team aiming to create a unique game with a unique atmosphere.<br/><br/>➣ Six to eight hours of good 'ol singleplayer action with five difficulties including Brutalizing, which changes the gameplay to allow interesting second playthroughs (different fights &amp; pick-ups, companions etc.).<br/><br/>➣ It's very light on storage (under 300mb) and well optimized. It's also portable so no DRM and no online ties either - you buy it, it's yours!<br/><br/><br/><br/>My aim is to research classic game design and refresh the valuable bits we've lost in an experience that ultimately rewards the player through learning and investment rather than through mechanically administered gratification.<br/><br/><br/><br/>Hedon is an oldschool game, and that's pretty much enough of a description. You will be dropped in a hostile world that has its own workings, characters and intrigues, and you will be expected to fend for yourself. The build up is slow and steady, the story is consistent, the combat is fast paced and ruthless. You will sometimes find yourself lost in a non linear level design with various aesthetics (forest, caves, forge, barracks, snowy mountain etc.) where exploration and learning by yourself is the key to improve.<br/><br/>You may find that Hedon takes a certain amount of inspiration from games such as Unreal, Blood, Thief, Arx Fatalis, Serious Sam etc. but nonetheless aims to be original at all times.<br/><br/><br/><br/>You play as Zan (any similarity with the creator's username is a pure coincidence), a half Orc - half Demon warrior who wakes up in a caved in tunnel with no memory of how she ended up there. The first episode will focus on our hero's descent into a strange underground world which is threatened by the sudden attack of a massive Cultist force.<br/>There are certain races and factions populating the world of Hedon.<br/><br/><br/><br/><strong>The Iron Division</strong><br/>A faction of amazon-like Orcs and Goblins, the Iron Division are the keepers Hedon's greatest secret - the crystal technology. Various magical crystals sprawl across the underground, providing energy, heat, oxygen and often forming entire biomes around them. Combining this power with crafting and the ancient art of magic, the Iron Division has founded a whole new civilization within their mountain stronghold known as Valc.<br/><br/><strong>The Cultists</strong><br/>Fallen to sin, the raving husks of what were once human now worship various figures of the Underworld. Little can be done to cull their addiction to pain and suffering. Little but a spray of frag fire or an explosive bolt that is...<br/><br/><strong>The Demons</strong><br/>Chaotic Demons dwell in the deepest parts of Hedon, lashing out at the weaker minds of the inhabitants of the Overworld. Along the ages, they have subdued entire towns to become their cultist slaves and feed their endless hunger through pain and suffering. Demons only care about feeding, and they will stop at nothing to do so.<br/><br/><strong>The Earthborn</strong><br/>Ancient dwellers of the underground, Minotaurs and Dwarves have built their own civilizations, ever clenched in warfare with the Demons spawning from below. However, their great cities and heritage were lost hundreds of years after their inevitable defeat in front of Hell's armies, and now they have been scattered and forced to live in small clans and towns.<br/><br/><br/><br/><br/><strong>iamfailtacular</strong> - story collaboration/world building, brainstorming<br/><br/><strong>Akhzul</strong> - Hedon's OST dedicated composer. A one guitar man band.<br/><br/><strong>Alexander Brandon</strong> - The man himself. If you enjoyed the soundtracks of Deus Ex or Unreal, then you're in for a few pleasant surprises. I bought few licenses for some of his personal tracks (and other songs that didn't make it in Deus Ex/Unreal) and fit them into Hedon!<br/><br/><strong>Breathelast</strong> - A band of underground sharks who pitched in with instrumental tracks of their songs. Also one of my favorite bands ever.<br/><br/><strong>Methadone Skies</strong> - Another solid band from the underground, guilty of creating dreamlike musical atmosphere.<br/><br/><strong>Shivaxi &amp; Xenofish</strong> - 5 Michelin Star chef and his cool friend who made an awesome remix for Alexander Brandon's Underworld.<br/><br/><br/><br/><strong>SOFTWARE USED</strong><br/>Engine: GZDoom<br/>Coding/Scripting/Resource Management: SLADE3<br/>Level Design: GZDoom Builder<br/>Graphic Design (Textures, Sprites, Animations etc.): Adobe Photoshop Elements 8, Clip Studio Paint<br/>3D Modelling: Blender<br/>Sound Editing/Recording/Mixing: Audacity", "metacritic": null, "released": "2019-03-21", "tba": false, "updated": "2023-08-28T23:38:28", "background_image": "https://media.rawg.io/media/screenshots/406/406e7d9e086784e6551db2dcbf1388a0.jpg", "website": "", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 277, "beaten": 6, "toplay": 7, "dropped": 6, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 13, "platforms": ["Linux", "PC"], "developers": ["Zan"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Zan"], "esrb_rating": null}