{"id": 311825, "slug": "captain-planet-gaia-guardians", "name": "Captain Planet: Gaia Guardians", "name_original": "Captain Planet: Gaia Guardians", "description": "Harness the powers of the Planeteers and fight eco-villains!<br/><br/>The dastardly eco-villains are polluting the Earth and it’s up to you to stop them. Partner with Captain Planet and his Planeteers on an adventure to clean up the planet. Battle enemies new and old, combine your powers to summon Captain Planet and make a positive impact!<br/><br/>Based on the iconic television series, Captain Planet: Gaia Guardians is and idle clicker arcade game that allows players to save planet Earth by partnering with Captain Planet and his Planeteers. Gather power, unlock new abilities and take the planet back!<br/><br/>The Power is Yours!<br/><br/>•\tDefeat enemies across multiple environments<br/>•\tRestore Hope Island to its natural wonder<br/>•\tEndless play as you grow in power<br/>•\tSummon Captain Planet<br/><br/>By Your Powers Combined, I Am Captain Planet!<br/><br/>•\tSolve environmentally focused trivia<br/>•\tTap and restore trees on Hope Island <br/>•\tFight against eco-villains including Verminous Skumm, Doctor Blight, Sly Sludge and others<br/>•\tPartner with Captain Planet and the Planeteers to defeat Captain Pollution<br/><br/>Our world is in peril. Gaia, spirit of the Earth, can no longer stand the terrible destruction plaguing the planet. She gives five magic rings to five special young people. From Africa, Kwame with the power of earth. From North America, Wheeler with the power of wind. From Russia, Linka with the power of the wind. From Asia, Gi with the power of water and from South America, Ma-Ti with the power of heart. With the five powers combined they summon earth’s greatest champion – Captain Planet!<br/><br/>Only you can help Captain Planet in this epic arcade battle to defend the Earth.<br/><br/>Go, Go Captain Planet!", "metacritic": null, "released": "2019-04-20", "tba": false, "updated": "2019-07-30T04:23:35", "background_image": "https://media.rawg.io/media/screenshots/224/224d9010131b9073b2756174f0bc6813.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Turner Broadcasting System"], "genres": ["Simulation"], "publishers": ["Turner Broadcasting System"], "esrb_rating": null}