{"id": 311865, "slug": "callbreak-kings", "name": "CallBreak Kings", "name_original": "CallBreak Kings", "description": "Game Rules<br/>Callbreak is a trick-taking card game played with a standard 52-card deck between four players. There are five rounds in a game. Players' sitting direction and the first dealer are selected before the first round begins. To randomise player's sitting direction and the first dealer, each player drew a card from the deck and based on the order of the cards, their directions and first dealer are fixed. Dealers are changed successively in an anti-clockwise direction in the following rounds.<br/><br/>Deal<br/>In each round, a dealer starting from their right deals all the cards in an anti-clockwise direction to all the players without revealing any card, making 13 cards per each player.<br/><br/>Bidding<br/>All four players, starting from the player to dealer's right bid a number of tricks that they must win in that round in order to get a positive score, otherwise they will get a negative score.<br/><br/>Play<br/>In Callbreak, Spades are the trump cards.<br/>In each trick, the player must follow the same suit; if unable, the player must play a trump card if eligible to win; if unable, the player can play any card of their choice.<br/>The player must always try to win the trick, in other words (s)he must play higher cards possible.<br/><br/>The first trick in a round is led by the player to dealer's right with any card of any suit. Each player, in turn, plays in an anti-clockwise direction. A trick containing a spade is won by the highest spade played; if no spade is played, the trick is won by the highest card of the same suit. The winner of each trick leads to the next trick.<br/><br/>Scoring<br/>A player that takes at least as many tricks as her bid receives a score equal to her bid. Additional tricks (Over Tricks) are worth an extra 0.1 times one point each. If unable to get the stated bid, the score will be deducted equally to the stated bid. After 4 rounds are completed, scores are summed to help players set a goal for their final round. After the final round, winner and runner-ups of the game are declared.<br/><br/>Features:<br/>- Intuitive drag interface to play a card<br/>- Bots with improved AI in single player mode", "metacritic": null, "released": "2019-02-01", "tba": false, "updated": "2019-08-23T05:21:07", "background_image": "https://media.rawg.io/media/screenshots/373/3736591c5d87b1d1948a485dad1de39a_Jzu9Jnm.jpg", "website": "http://cuzw.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Foes"], "genres": ["Board Games", "Card"], "publishers": ["Foes Media LLP"], "esrb_rating": "Everyone 10+"}