{"id": 311967, "slug": "freecell-halloween", "name": "FreeCell Halloween", "name_original": "FreeCell Halloween", "description": "\"Halloween Freecell\" is a superb card game, set in Halloween, horror theme. The game is addictive and can be played not just on Halloween, but all year long!<br/><br/>If you enjoy card games and like scary, zombie like, horror atmosphere, then this game is designed especially for you. Halloween Free Cell Solitaire will move you to scary world of vampires, witches, cauldrons, magic, bats, spiders, cobwebs and zombies.<br/><br/>The game contains three levels of difficulty:<br/><br/>- Spooky (Easy)<br/>- Creepy (Medium)<br/>- Ominous (Hard)<br/><br/>If you just have a few spare minutes, while treating and tricking your neighbours, then you can play Spooky level. If you're looking for a challenge, then Ominous if for you.<br/><br/>Scary and bloody features:<br/><br/>- Halloween, scary atmospheric graphics<br/>- 3 difficulty modes<br/>- Cool sound effects<br/>- Hints system<br/>- Unlimited Undo<br/>- Awesome looking in Landscape mode<br/>- Random card games<br/>- Tap, drag and drop cards<br/>- fully FREE game<br/>- Auto Move<br/><br/>Be a strategist witch or wizard. Avoid becoming a zombie and use your brain power and logic to conquer this card playing game<br/><br/>Download the app now and start enjoying Halloween Solitaire FreeCell in the cursed world of potions and scary creatures!", "metacritic": null, "released": "2017-10-18", "tba": false, "updated": "2019-10-22T14:37:50", "background_image": "https://media.rawg.io/media/screenshots/a3c/a3ccfa6dbbec853dabfbed50edaa4d8b_vRjrvnt.jpg", "website": "http://www.prog.rizn.pl/posts/35", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ryszard Piotrowski"], "genres": ["Card", "Puzzle"], "publishers": ["Ryszard Piotrowski"], "esrb_rating": "Everyone 10+"}