{"id": 311944, "slug": "valhalla-match-3-might-and-magic-match-3-game", "name": "Valhalla Match 3 - Might And Magic Match 3 Game", "name_original": "Valhalla Match 3 - Might And Magic Match 3 Game", "description": "Valhalla Match 3 - Might And Magic Match 3 Game is a unique game based on well known concept of Match 3 type game, based in a dark fantasy world with role-playing atmosphere.<br/><br/>You're a Valhalla Knight, which goes on a long and dangerous journey, through 5 worlds, filled with mystery, dungeons, dragons, basilisks, potions, magic, dragons and other fantasy creatures.<br/><br/>If you want to try something different, then Valhalla Match 3 might be for you.<br/><br/>Features:<br/>- 5 worlds: Cursed Forest, Hidden Stone Valley, Abandoned Giants House, Dragons Liar, House Of Forgotten Valhalla Kings.<br/>- 100 unique and challenging levels<br/>- boosters in form of potions, magic wands and magic bombs<br/>- different kinds of challenges. Some time based, other with limited number of steps<br/>- items such as tainted heart, spell books, axes, knight shield, mags daggers, etc<br/>- unique atmospheric fantasy graphics<br/>- addictive game play in a strange world of magic<br/>- Valhalla Match 3 - Might And Magic Match 3 Game is totally Free game<br/><br/><br/>How to Play:<br/>- Move and match 3 or more magic items of the same type to destroy and win points<br/>- Collect special artifacts<br/>- Boost your experience with wondrous spells and potions<br/>- Reach high scores and try to get 3 stars on each level", "metacritic": null, "released": "2017-05-31", "tba": false, "updated": "2019-10-22T14:37:49", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8e797b8d630fc77fdf936df319652aa.jpg", "website": "http://www.prog.rizn.pl/posts/26", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ryszard Piotrowski"], "genres": ["RPG", "Puzzle"], "publishers": ["Ryszard Piotrowski"], "esrb_rating": "Everyone 10+"}