{"id": 312094, "slug": "soccer-rocketball-league-championshyperball-games", "name": "Soccer Rocketball League Champions:Hyperball Games", "name_original": "Soccer Rocketball League Champions:Hyperball Games", "description": "<p>Soccer Rocketball League Champions: Hyperball Games Overview: <br/>A vehicular soccer type game but with pool balls and pool table, where the player has to hit the ball and shoot it into the pocket to score. The ball can bounce off the edges and go in the natural direction due to the impact of rocket goal. The player can strike the ball at the desired pocket with intensity by performing a dash move. Are you ready for car fighting games, football car games, Car Wars 3d free Demolition games, and other rocket hyper league ball? Have you ever played any ball football games, football car games, fun mobile games, cars battle arena 2019 games, and other Championship Cup of soccer rocket ball? If no, then this car football new games free is a best chance for you to become the master of soccer free kick games, demolish reckless cars as well as soccer championship games of soccer new free games 2019.<br/>Modes of Soccer Rocketball League Champions: Hyperball Games: <br/>1.\tIn the case of score mode, the player will have set a number between 3, 5, or 7 and score more goals than the number of goals saved by the AI to win. Once the set number of goals has been attempted, the round will finish like rocket soccer games.<br/>2.\tIn the case of timed mode, the player will have to score the most goals compared to the goals saved by the AI within a time limit of 1 minute 30 seconds. <br/>3.\tTeam Mode: The player and two AI players will form a team against another team of three AI players in front of charge balls.<br/><br/>Game Play of Soccer Rocketball League Champions: Hyperball Games: <br/>The player will have to play through a tutorial for the very first time. In this tutorial, there will be an AI competitor present and the player will be taught how to move and shoot via textual pop-ups on screen. Each pop-up will appear after the previous step has been completed. Rocket Car Free Soccer League 2k19 Games is just waiting for you. If you have passion to play cars playing soccer, car soccer game with rocket cars, car demolition derby games, rocket car in the football stadium, shoot soccer ball, Car Wars 2019 game, and other rocket soccer car games, then hold your phones and start playing our s Rocket Car Games Soccer League, free soccer games and other ball football games of car socer games. In this car battle mode, you need to play the role of a destruction driver. Race the weaponized car to knockout, destroy, damage and demolish reckless cars by firing missiles and smashing hits. Knockout the cars out of whirlpool demolition arena by dragging them with your powerful sports cars.<br/><br/>Features of Soccer Rocketball League Champions: Hyperball Games: <br/>Multiple of cars selection like world football app.<br/>2 modes with different objectives for car socer game.<br/>3D effects of Whirlpool demolition new derby games.<br/>Multiple of Pool tables for football car madness.<br/><br/>Progression of Soccer Rocketball League Champions: Hyperball Games: <br/>For each match won, the player will get a certain number of coins and XP. The XP for each match won will be 20 XP. So what are you waiting for other football car games, ball football games, soccer new games 2019, soccer games for free, new ball free games, and other new Whirlpool demolition new derby games? Drive the rocket car in the football stadium and try to score goals by firing missiles on the reckless cars. This car football game will allow you to play both soccer championship games and car demolition free derby games where car crash is going among rival cars. Just download our Soccer Rocketball League Champions: Hyperball Game and challenge your friends who like rocket soccer car games, Car Wars 2019, Car game Soccer League and other fotbal cu masini. <br/><br/>We Value your Feedback: <br/>Please leave a feedback on Soccer Rocketball League Champions: Hyperball Games. We value our user feedback and we’ll update this Car Game Soccer League in future after having your feedback.<br/></p>", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-04-26T04:36:39", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gameseller76"], "genres": ["Sports", "Racing"], "publishers": [], "esrb_rating": null}