{"id": 312050, "slug": "one-drop-bot-itch", "name": "One Drop Bot (itch)", "name_original": "One Drop Bot (itch)", "description": "<p>One Drop Bot is a 3D Puzzle-Platformer where you play as a cute yet somewhat creepy robot, traveling from one room to the next solving challenges, each something different from the last. These challenges will test your skills in a variety of ways. Collecting health throughout the game is key, because when you die, and you will, all health collected up to that point comes back. That means that at respawn, all health ever collected respawns with you as well. The catch, however, is that you have to start over at the very beginning of the game similar to a rogue-like.<br/></p>\n<p>The system of dying and restarting from the beginning may seem daunting at first, but the game is rather short, being sectioned out into three major parts. Also, as you play, you’ll find that while restarting is often frustrating, overcoming it is rewarding in a way that easier games can’t be. This game is meant for those looking for a real challenge, so be wary.</p>\n<p>The inspiration for this game was the simple yet at times frustrating challenge found in retro games of the 8-bit and 16-bit era. ‘One Drop Bot’ attempts to bring this kind of challenge into a 3D environment, providing a refreshing experience that is sure to satisfy someone looking for a new challenge.</p>\n<p>The game is sectioned out into rooms, much like how a retro game would be sectioned out into screens or levels. Each room contains a challenge or two that the player must overcome in order to advance into the next. Unlike many older games however, each challenge is unique from the last, providing you with more new challenges the farther you get.</p>\n<p>‘One Drop Bot’ is a game that is sure to challenge even the most skilled of players. So if you’re looking for a new kind of challenge, this is the game for you. Don’t take my word for it though, play the game yourself, and see what kind of challenges await you.</p>", "metacritic": null, "released": "2019-04-11", "tba": false, "updated": "2019-04-26T04:25:22", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab5be23bc0e320e6dc5e55f11c08d6aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Playing with Color"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}