{"id": 312045, "slug": "humaning-isosymmetric", "name": "Humaning! (Isosymmetric)", "name_original": "Humaning! (Isosymmetric)", "description": "HUMANING!\r\nThe fishing game where you catch humans\r\n\n<p>This game was made for Weekly Game Jam #93. It is my first game in two years, so please be gentle with the feedback :P</p>\r\nWhat to do\r\n<p>You are a fish swimming around in a pond. Your goal is to catch as big a human as possible! You can do this by casting your bait out of the water and onto the land<br/></p>\r\nControls\r\n<p><strong>W, S, A, D:</strong> makes the fishy swim around</p>\n<p><strong>Space: </strong>makes the fishy stop swimming around</p>\n<p><strong>Right click: </strong> (hold and release) casts your bait<br/></p>\r\nEncounters\r\n<p>When you encounter a human biting onto your bait, you will see a flashing screen saying \"ENCOUNTER!\".</p>\n<p>If you click the \"Decline\" button you will go back to the pond and await your next encounter.</p>\n<p>If you click the \"Accept\" button you will attempt to catch the human. This will take you to the Encounter screen.</p>\n<p>On the Encounter screen you need to fill the catching bar by spamming the <strong>Space</strong> key. Follow the prompts at the top, otherwise you might miss out on getting a really nice catch!</p>Thank you<p>Dmitry Timofeev for making the Pixelation Unity Asset<br/></p><p>Public Pool for making the two songs I used in my game:</p><ul><li>Puzzle Town</li><li>Con Límon</li></ul>\r\nFeedback\r\n<p>Any feedback is welcome. Thank you for taking the time to play my stupid game :P<br/></p>", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-04-26T04:23:41", "background_image": "https://media.rawg.io/media/screenshots/22c/22c6e7e6db65dba5bef99e38f5414c4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["isosymmetric"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}