{"id": 312039, "slug": "genus-prime", "name": "Genus Prime", "name_original": "Genus Prime", "description": "<p>Conquer the galaxy by sending ships from your planet to others. Easy peasy isn't it?</p>\n<p>Use your mouse to select planets and target enemy planets to set your ships free. Once the population counter of a planet goes below 0 - it will change ownership.<br/>Owned planets generate Research Points (RP) which you can use to upgrade your tech tree on the knowledge hub.<br/>Ah and you might want to buy some missiles as planetary defense of each planet.<br/><br/>There is a campaign mode (with some more events/elements) and a random (quick start) or skirmish (custom game) mode.<br/><br/>There is NO profile yet, so what campaigns you won is stored in your savegame - use that as progress.<br/><br/>Campaigns are written in plain XML - so you might want to add your own (especially with the ... Solar Support and Rebel features).<br/><br/><br/><br/>Controls: Mouse driven, use right click (or Escape key) to abort/exit a menu/screen. <strong>If the pixel flickering of some elements annoys you</strong> then hit \"c\" once to disable color alternation (I used it rarely but still... who knows). It flickers more the less Hz your screen has). <br/><br/>Use F5 to quicksave and F8 to quickload.</p>\n\n<p><strong>Side note: </strong>The game was written for the \"8 BIT WARS\"-competition at Syntaxbomb.com which took place from January 25th to March 31st 2019.\r\n</p>\n<p>The download version here (v1.0.4) contains some additional fixes, new controls (middle mouse click to scroll the map or keep it down for dragging). It also adds a new experimental audio backend to get rid of some dependencies (especially on Linux).</p><p><strong>Source code: </strong>Genus Prime @ Github<br/></p>", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-08-28T23:16:57", "background_image": "https://media.rawg.io/media/screenshots/35f/35f0f63c8c4c0648be2b23810cf057cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["GWRon"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}