{"id": 312315, "slug": "donut-roll", "name": "Donut Roll", "name_original": "Donut Roll", "description": "<p><strong>Roll, collect, don't crash.</strong> <br/></p>\n<p>Donut Dash is a delectable endless runner and the result of a three-week  full-time in-house placement. In a team of two programmers (including myself), two artists and a designer, I worked on Donut Dash: a 3d endless runner game in Unity. <br/>Outside of personal projects, this was my first time working in Unity (and my second time working in C#), hence the placement required consistent on-the-job learning. <br/>In the first half of the project, I programmed such gameplay elements as the collisions/OnHit events for collectables and randomised colours of the collectables. We programmers used Github for source control, which was my first time using the software (but I picked it up swiftly).</p>\n<p>The latter half of the project consisted of finalising the UI functions and visual polish.</p>\n<p>My other role throughout the whole project was in art integration, not solely for the User Interface art, but also for the majority of the models and textures. Given my prior knowledge of Substance Designer, I was tasked with using it to fix any accidentally inverted normal maps or fuzzy opacity maps.</p>\n<p>In the final week of the second in-house placement (mentioned above), my teammates and I were tasked with fixing and polishing Donut Dash to a standard presentable to the industry professionals the university had invited in. I have posted a link to the correspondently final, playable build below.</p>", "metacritic": null, "released": "2019-04-23", "tba": false, "updated": "2019-04-26T05:31:22", "background_image": "https://media.rawg.io/media/screenshots/d2b/d2b24c4e45c19875ea41a3daf76ab143.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StubbardGreen"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}