{"id": 312487, "slug": "rise-n-brawl", "name": "Rise n' Brawl", "name_original": "Rise n' Brawl", "description": "<p>One small android. One platform. One massive tower. What's at the top?</p>\n<p>You play as Selinger, a small android with big dreams. Specifically, he wishes to find what's at the top of that tower there. It won't be easy. There's a boss to fight on every floor, and many, <em>many</em> bullets to dodge. There's no retries and no healing.</p>\n<p>Oh, and one more thing... Selinger has been built with a bit of a design flaw... He can't move on his own. You need to move his platform up and down using the arrow keys to aim and dodge while he uses the X key to shoot his laser at enemies and the Z key to summon a forcefield that shields him from damage.</p>\n<p>The game comes with five difficulty options: Easy, Normal, Hard, Insane and Impossible. Choose wisely; once Selinger gets down to 0 HP you have to start from the bottom of the tower again! Can you beat all 45 bosses without getting killed?</p>\n<p>Each boss will also get stronger and more complex the further up you go. Some may move and shoot faster, some may teleport or inch towards you, some may shoot bullets in waves, some may throw you off entirely. Don't forget to avoid their attacks (if you can!)</p>\n<p>This game was made for Stencyl Jam 18 in less than ten days. I made all of the art, music and sound for the game. The jam's theme was elevation; and in this game you can only move the player by changing his elevation via moving a platform upwards and downwards.</p><p>So, yeah, up and down keys move your platform up and down, X to shoot and Z to shield. When you open the game, click your difficulty mode. If you already have a game saved, press enter to continue instead. To reset your game, either beat it or get killed.</p>", "metacritic": null, "released": "2019-04-22", "tba": false, "updated": "2019-04-26T06:13:34", "background_image": "https://media.rawg.io/media/screenshots/e09/e09d7ff0241c20535101117476c30ba3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NickamonPoppytail"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}