{"id": 312438, "slug": "cyberpink-flamingo", "name": "CyberPink Flamingo", "name_original": "CyberPink Flamingo", "description": "<p><strong>[L'intégralité des éléments de ce jeu (graphismes, musique...) ont été réalisés durant la Game Jam]</strong></p>\n<p>Salut à tou-te-s !<br/><br/>Bienvenue dans notre jeu fait en 72h pour la GDA Jam dont le thème est \"no signal\"<br/><br/>CyberPink Flamingo vous met dans la peau du-de la maire d'une ville futuriste en pleine ébullition. Les citoyens n'arrêtent pas de bloquer la communication avec différentes Corporations qui vous fournissent en Energie, en Milice, en Argent et en Technos. Pour la libérer il vous faudra intervenir et répondre aux requêtes des habitants. Si vous tardez trop à leur répondre, le quartier est submergé par des émeutes et le contact avec la Corporation bloquée est définitivement perdu.<br/><br/>Tel était notre but. Mais aléas de GameJam oblige, notre objectif n'est pas complètement atteint. Nous nous sommes concentré-es sur l'aspect visuel et sommes très fièr-e-s de notre rendu, d'autant plus qu'il s'agit de notre premier contact avec la modélisation 3D. Vous verrez tout de même un début de gameplay, la preuve, les chiffres en bas de l'écran bougent !<br/><br/>Merci à tous ceux et toutes celles qui prendront le temps de le tester. Un commentaire est toujours apprécié, n'hésitez pas à nous laisser votre avis !<br/></p>", "metacritic": null, "released": "2019-04-22", "tba": false, "updated": "2019-04-26T06:02:09", "background_image": "https://media.rawg.io/media/screenshots/58c/58cece963810d97bb76921c0ccf83b6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Magic Ball's Knights"], "genres": [], "publishers": [], "esrb_rating": null}