{"id": 312443, "slug": "keyflex", "name": "Keyflex", "name_original": "Keyflex", "description": "<p>Keyflex is a game made in less than 12 hours, so it isn't full of content. Keyflex is a low-resolution reflex game, played with the keyboard. A lot of the features are inspired by osu, like the draining health and score multipliers.<br/>To play, all you need to do is hit the keys before your health drains out. The drain of your health keeps ketting faster, based on your difficulty setting.<br/><br/>Keyflex has multipliers that have an effect on the game, making it harder to play. In return for using them you get more points. Here's the details:<br/><br/><strong>Random Locations:</strong> Simply put, the keys do not only show up in the middle of the screen, and you can't simply focus on the middle to easily see them.<br/>- 1.05x Score<br/><br/><strong>Dissappearing Letters: </strong>Letters dissappear right after showing up, giving you less time to spot them. Pair this with random locations, and you have yourself a challenge.<br/>- 1.1x Score<br/><br/><strong>Sudden Death: </strong>Miss a note? <em>Death.</em> <em>Enter eternal pain and suffering, as you walk through the gates of hell.</em> This is for the most accurate of players.<br/>- 1.3x Score<br/><br/><strong>Half Time: </strong>Half a bar of health, that's all. It drains just as quick, but it only ever fills half the way. <em>Have fun with that.</em><br/>- 1.25x Score<br/><br/>Your difficulty also has an effect on how big your score is. Easy mode isn't for competitive play, unless you're planning on activating as many multipliers as possible. Easy mode reduces your score multiplier to 0.75x, and it's only really meant for the people who don't know the keyboard that well, or are just generally casual players.<br/><br/>Remember to check out the in-game leaderboard, located in the options menu.  Compete with people from all around the world.<br/></p>", "metacritic": null, "released": "2019-04-22", "tba": false, "updated": "2019-08-28T23:16:55", "background_image": "https://media.rawg.io/media/screenshots/5ae/5aea96f73207567bb56fb3fb82d88932.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Colorics"], "genres": [], "publishers": [], "esrb_rating": null}