{"id": 312456, "slug": "die-again", "name": "Die Again (itch)", "name_original": "Die Again (itch)", "description": "Die Again is a brutal and innovative shooter where you can kill your enemies either by shooting or dying. <br/>If you die due to being shot, an explosion or by committing suicide, you can possess the body of an enemy nearby and keep playing!<br/>On the other hand, if there is no one around when you are about to die, it will be game over. But be careful, enemies can also go inside your body if they die and take your own life.<br/>Defeat your enemies by shooting, committing suicide, dying and killing them!<br/><br/><br/><br/><strong>Innovative &amp; Brutal Combat:</strong> Die Again features a fast-paced combat with an innovative element which creates a unique experience among all action games. You can make use of a large variety of weapons such as a precise automatic rifle, a deadly shotgun, a discrete knife or a sniper rifle which allows you to shoot through walls. Choose the playing style you prefer and survive in a game where dying doesn’t represent the end.<br/><br/><strong>Confront dozens of enemies: </strong> Face enemies you have never encountered before, some will prefer to attack you from the distance, others which will try to come closer you and take their own life in order to possess your body, fierce and fast dogs, snipers who will shoot you through any wall or slaves, armless enemies which seem harmless at first sight but, if you end up in one of their bodies, you won’t be able to use any weapon, however, you will still be alive and with a strong desire to end up in a better body.<br/><br/><br/><br/><strong>15 Action Packed Levels: </strong> Fight in more than a dozen levels, each one totally different from the others, such as a chaotic city at war, a terrifying ghost ship, enigmatic laboratories or factories devastated by war. <br/><br/><strong>Deep &amp; Surprising Story: </strong> Immerse yourself into a story where you will travel in an unrecognizable planet Earth trying to find the origin of the Blue Blood, an event occurred a thousand years ago which changed everything we knew. Meet charismatic characters and be careful with the decisions taken, their future is in your hands!<br/><br/> <br/><br/><strong>Stupendous Soundtrack: </strong> A diverse and exciting techno soundtrack will accompany you throughout the whole level, adapting to the importance of the situation.<br/><br/>A game made by one person", "metacritic": null, "released": "2019-04-22", "tba": false, "updated": "2020-09-18T02:00:29", "background_image": "https://media.rawg.io/media/screenshots/32c/32ca13ec2e341fc48a6deedd485be6bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Gamer4ever", "VarnGameDev"], "genres": ["Action", "Indie", "Puzzle", "Platformer"], "publishers": ["VarnGameDev"], "esrb_rating": null}