{"id": 312636, "slug": "digital-paintball-redux", "name": "Digital Paintball Redux", "name_original": "Digital Paintball Redux", "description": "Digital Paintball Redux is an online Multiplayer paintball game setup to give players the most realistic online experience on the market. This first person shooter consists of maps of all kinds from woodsball, speedball, airball, and hyperball. The game is setup as a first person shooter and brings constant action and an easy learning curve for players coming from any game background.<br/>\n<br/>\r\nDigital Paintball Redux focuses to pick up where Digital Paintball 2.1 left off. With the constant rise and decline of Real-Life paintball players. The online communities for Digital Paintball felt the same effects. Digital Paintball strived from there with community members having a love of paintball and gaming banding together and pushing for Digital Paintball's first Beta released September 20th 2002. Digital Paintball had a vision to bring the most “realistic” paintball experience to online gaming. With backing from an outstanding community from all walks of life. From Players who have never played paintball in real-life, looking to seek how the game is played before braving their local fields. To seasoned professional tournament players mentoring other community members. It was a family.<br/>\n<br/>\r\nDigital Paintball: Source Alpha released March 25th 2007 with innovative features never before seen in other paintball games. Alpha 2 released later in 2007. And it was about this time the team began falling out. The community got older. Life commitments and families became priority. The Digital Paintball community since 2007 has had spurts of players keeping Digital Paintball 2.1 alive. Semi-consistent releases of new maps and markers to feed the hunger for something new from the community. Now here we are here! With the gracious help of past Digital Paintball members and well known community players. Digital Paintball Redux is picking up where DPB 2.1 left off. With a complete overhaul on bringing Digital Paintball up to todays standards of gear and visuals, and Steam compatability! We look forward to bringing the go-to online paintball experience to your PC. It's older tech but still holds it’s own against even today’s releases. <br/>\n<br/>\r\nThanks for stopping by. And please be sure to join our Discord and Facebook groups to stay up to speed and share your experiences with other players with a passion for paintball.", "metacritic": null, "released": "2019-06-07", "tba": false, "updated": "2019-08-23T12:11:02", "background_image": "https://media.rawg.io/media/screenshots/1a7/1a7164c4acfab877fea8af3e80bc25ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["DPB Redux Dev Team"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["DPB Redux Dev Team"], "esrb_rating": null}