{"id": 312694, "slug": "knights-of-the-silver-table", "name": "Knights of the Silver Table", "name_original": "Knights of the Silver Table", "description": "<p>Knights of the Silver Table get&#39;s it&#39;s inspiration from 8-Bit and 16-Bit games during the 90&#39;s.</p>\n<p>A long time ago.</p>\n<p>There was a battle so fierce, it was like nothing Bartlesville had ever seen.</p>\n<p>It was a battle between the Legendary Hero and the Shadow Knight.</p>\n<p>Story</p>\n<p>The Knights are approached by Kaga the wise elder about a &quot;Mysterious Power&quot; and sends them out on a quest to find out what, or who is behind it and find out what has happened to the lands Legendary Hero.</p>\n<p>In the game you play as Takoda. The leader of the Knights of the Silver Table as you journey through various kingdoms where each king will test your strength.<br />\nNavigate an area based world and find hidden secrets, fight Mini Bosses and World Bosses.</p>\n<p>Although, the game has a serious tone, there is humorous and engaging dialogs.</p>\n<p>This is the &quot;first&quot; installment of the series (if you would call it first) ahem... Many more sequels are planned and even in development!</p>\n<p>Game Theorists welcome to theorize where the games will go next!</p>\n<p>Gameplay</p>\n<p>1-4 Player Co-op<br />\n4 Modes<br />\n10 Kingdoms<br />\nEngaging &amp; Humorous Dialog<br />\nEngaging Story with twists and Turns</p>\n<p>You can play with up to 4 friends Co-op locally through the Story Mode and will feature a Battle Mode and Boss Rush for up to 4 Players locally.</p>\n<p>The officially supported controller is the Xbox One Controller. And of course, you can use the keyboard as well. But only Player 1.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2021-08-04T23:42:19", "background_image": "https://media.rawg.io/media/screenshots/d6f/d6f6fbf07d921a0d7293d41f3eb4743a.jpg", "website": "https://cenokga.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cenokga"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Cenokga"], "esrb_rating": "Everyone 10+"}