{"id": 312746, "slug": "light-of-praise-glory", "name": "Light of Praise: Glory", "name_original": "Light of Praise: Glory", "description": "Enjoy the world of \"Light of Praise: Glory\" fantasy game with millions of players from all over the world! You respond to the call of the church in Lorraine, and equip the armor and weapons at the peak of the hero. You, this great warrior, will defeat the evil lord with other heroes. For Lorraine, Lorraine’s destiny is in your hands!<br/><br/>[game features]<br/>*** High quality graphics and HD audio ***<br/>High-quality graphics, stunning scenes and combat effects will immerse you in the 3D fantasy world! 3D sound effects and high-quality audio with 7.1 surround sound make you immersive.<br/><br/>*** happy everyday, happy interaction ***<br/>Give each other flowers, heterosexual dating, national war gods, guild wars, enrich the daily life, and friends interact non-stop! Different worlds, different mobile games!<br/><br/>*** dazzling effect ***<br/> Breathtaking exquisite audiovisual effects will give you the feeling of surpassing reality!<br/><br/> *** fashion clothing, mysterious wings ***<br/>Rich and gorgeous costumes are at your fingertips, making it easy for you to show your personality in the game!<br/>The wings in the game are both decorative and functional. With them, you can fly to wherever you want!<br/><br/> *** Guild Wars, Diverse PvP ***<br/>Cross-service help, single-player PK, challenge leaderboards, let you enjoy the pleasure of PK! . From cross-server PvP, Clan War to battle royale, the arena became famous on the battlefield, burning blood, only for PK!<br/><br/><br/>Start your adventure with the game world of \"Light of Praise: Glory\"!", "metacritic": null, "released": "2018-12-07", "tba": false, "updated": "2019-10-22T14:37:53", "background_image": "https://media.rawg.io/media/screenshots/ac9/ac9249f30c13faa6c890d7e81dca5647_Izny5md.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cloud Games"], "genres": ["Action", "RPG"], "publishers": ["Lianyungang Jinmingge Information Technology Co"], "esrb_rating": "Everyone 10+"}