{"id": 312753, "slug": "medieval-clicker-blacksmith", "name": "Medieval Clicker Blacksmith", "name_original": "Medieval Clicker Blacksmith", "description": "Medieval themed clicker game, idle game where you will forge epic weapons with the great blacksmith Talkor and his legendary hammer! <br/><br/>Welcome to the first Medieval Clicker adventure, where you’ll be able to use your legendary hammer to forge the most epic fantasy weapons ever as a talented blacksmith in your anvil!<br/><br/>Best fantasy rpg clicker game!<br/><br/>Wield the Legendary Hammer and join Talkor in his adventure forging the most rare materials and therefore, crafting amazing medieval weapons.<br/><br/>Click and tap! That will be the only way your blacksmith will be able to forge epic medieval weapons in your anvil, combining the best elements of rpg and clicker games!<br/>Use Time Vortex stones to boost your game with our prestige system!<br/><br/>Discover fragments of the story in each mission your blacksmith takes in his adventure through the kingdom. They will take you to an amazing medieval fantasy world.<br/><br/>Each level, ingots on your anvil will be tougher to craft, but your blacksmith will be able to produce more complex and rare weapons. Prestige will help you have a faster progress. Don’t forget to forge the most epic legendary weapons in this kingdom!<br/><br/>FEATURES<br/>● This game is a rpg clicker game and it is based in a single input. Click with one finger, two or as many as you need so your blacksmith can forge weapons as fast as he can!<br/>● Prestige system to accelerate the progress.<br/>● Multiple materials to forge in your anvil, tons of epic medieval weapons to discover<br/>● 6 new weapons per material, including legendary weapons! (Legendary weapons take some time to get discovered, so don’t be discouraged, you will eventually forge them!)<br/>● An amazing gallery, so you can enjoy all the weapons you forge through the adventure whenever you want.<br/>● Epic story that will make you feel inside this medieval fantasy world and make this adventure more real!<br/>● Tons of upgrades for your blacksmith hammer, materials, etc to make your game experience even better!<br/>● Loads of achievements to be completed during your adventure in the kingdom.<br/><br/>Different than other clicker games.<br/><br/>Clicker games:<br/>Clicker games are one of the most easy path learning games. These kind of games are very addicting, so prepare yourselves to tap the screen of your device hundreds of times!<br/><br/>In this particular game, the faster you tap, the faster your hammer will hit ingots on your anvil and make medieval weapons to earn money faster. That way, you will increase the abilities of your blacksmith’s hammer and progress in your adventure. Plus prestige system will allow you get stronger!<br/>Become the most epic and legendary blacksmith in this fantasy rpg clicker adventure game! You are a vital part of the kingdom!<br/><br/>Follow us in our social media for insight on future releases!<br/><br/>Twitter: @NoxfallStudios<br/>Facebook: https://www.facebook.com/NoxfallStudios<br/>Instagram: https://www.instagram.com/noxfallstudios", "metacritic": null, "released": "2017-07-10", "tba": false, "updated": "2019-10-22T14:37:54", "background_image": "https://media.rawg.io/media/screenshots/3ac/3ace890a4346f96e27d3d547993c6388_05Mj0WH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Noxfall Studios"], "genres": ["Adventure", "Simulation"], "publishers": ["Noxfall Studios"], "esrb_rating": null}