{"id": 312763, "slug": "chimeras-the-signs-of-prophecy-a-hidden-object-adv", "name": "Chimeras: The Signs of Prophecy - A Hidden Object Adventure (Full)", "name_original": "Chimeras: The Signs of Prophecy - A Hidden Object Adventure (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>A strange solar eclipse has left the town of Munich in total disarray. Not only has a dark shadow descended on the city, but bizarre supernatural events and shocking murders have also followed. You’ve been called in to help solve these crimes, but to stop the true threat you must dive deep into the heart of an ancient mystery. <br/><br/>• CAN YOU STOP THE COMING APOCALYPSE?<br/>A fortune teller warned of a mysterious wanderer who holds the key to the fate of the world. Are you the one destined to guide him along the path? And can you steer him towards creation, rather than destruction?<br/><br/>• FULFILL A MAGICAL PROPHECY<br/>Reveal your true potential through ominous hidden object scenes.<br/> <br/>• USE YOUR TALISMAN TO DEFEAT THE CHIMERA!<br/>The power of this artifact will help you solve cryptic puzzles and mystifying mini-games.<br/><br/>• CATCH A MURDERER IN THE BONUS CHAPTER<br/>Protect the Secret Society and enjoy additional Collector’s Edition exclusives including collectible Chimeras and Tarot Cards, morphing objects, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-06-08", "tba": false, "updated": "2020-10-26T03:08:53", "background_image": "https://media.rawg.io/media/screenshots/df0/df01ef8567bc84e3c20a1256631bc2d2_2gAepPX.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}