{"id": 312768, "slug": "rugby-league-19", "name": "Rugby League 19", "name_original": "Rugby League 19", "description": "Get ready to take on the might of the World’s best Rugby League teams, with the store’s most complete Rugby League sim.<br/><br/>Rugby League 19 is your go-to game that delivers the power, speed and intensity of one of the World’s most enthralling sports.<br/><br/>Featuring fully updated teams, a redesigned challenge mode and a range of gameplay improvements - along with the stunning 3D visuals, fingertip controls and five exciting tournaments you’ve come to expect - this is the most complete Rugby League game you can get on your phone or tablet.<br/><br/>Download for FREE today.<br/><br/>NEW CHALLENGE MODE<br/>Are you able to take control of a match at a defining moment, turn it around, and lead the team to victory? With 32 brand new challenges across Southern and Northern Hemisphere – with more coming soon - you’ll be entertained the whole season long.<br/><br/>SHAPE YOUR CAREER<br/>Expectations are high, as you aim to become a legend in the world of rugby league with an in-depth CAREER MODE spanning multiple seasons. Create your player and experience rugby at grassroots level and work your way up through the ranks to play for some of the giants in World rugby, with your eyes set firmly on the prize...international glory! Your performance on the field will determine how quickly your career develops and which teams offer you contracts! Do you have what it takes to perform on rugby’s biggest stage?<br/><br/>LIVE GAMES<br/>Join others and compete in regular LIVE GAMES. Earn points for your team and lead them to victory. Can you climb to the top of the influencers leaderboard?<br/><br/>FINGERTIP CONTROLS<br/>Whether you are a seasoned rugby pro or just getting started, show off your rugby skills with intuitive controls. Use the on-screen virtual buttons to guide your players around the field. For that extra bit of rugby flair, use swipe gestures to sidestep the oncoming defenders.<br/><br/>REPRESENT YOUR STATE<br/>Show your true colours and choose between New South Wales or Queensland and take part in the South Hemisphere's premier rugby league event, The State Series! Battle it out in a best of three rivalry to see who takes home the bragging rights!<br/><br/>FEATURES<br/>Over 160 teams at club and international level.<br/>5 exciting tournaments.<br/>Play Now<br/>New Challenges<br/>Live Games.<br/>Intuitive controls.<br/>Motion captured animations.<br/><br/>FIND US<br/>WEB: www.distinctivegames.com<br/>FACEBOOK: facebook.com/distinctivegames<br/>TWITTER: twitter.com/distinctivegame<br/>YOUTUBE: youtube.com/distinctivegame", "metacritic": null, "released": "2019-03-27", "tba": false, "updated": "2019-07-30T14:16:09", "background_image": "https://media.rawg.io/media/screenshots/21e/21e9bcd5c59b638b22359c732c867b3b_sJfGYj3.jpg", "website": "http://www.distinctivegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Distinctive Games"], "genres": ["Action", "Sports"], "publishers": ["Distinctive Developments"], "esrb_rating": "Everyone 10+"}