{"id": 312704, "slug": "ugly-dolls-an-imperfect-adventure", "name": "Ugly Dolls: An Imperfect Adventure", "name_original": "Ugly Dolls: An Imperfect Adventure", "description": "Robots are cool when they’re blinking lights and zooming by with their sleek metallic finish. In UglyDolls: An Imperfect Adventure, a whole horde of robots are on the loose and taking over Uglyville trying to make it “perfect!”.  <br/>On the plus side, you play as Moxy, the energetic UglyDoll who’s got a lot of “moxy”! Prefer Ox? Pick him. And you’re about to team up with your friends from the UglyDolls movie, explore Uglyville, and work together to lure, trap, and send those uptight robots back to where they came from. Do you have the courage not to run away? No? Don’t worry. Moxy (or Ox) will run away with you. <br/><br/>CONTROL MOXY OR OX and team up with fellow UglyDolls: Babo, Ice Bat, Wage and Ugly Dog<br/>EXPLORE UGLYVILLE with procedurally generated streets that make every game different<br/>LURE AND TRAP a horde of relentless robots and send them out of Uglyville!<br/>FIND YOUR UGLYDOLL FRIENDS to unlock new areas of Uglyville to explore<br/>PLAY TOGETHER in 2-player local cooperative mode<br/><br/><br/>3D Display with compatible 3D glasses (sold separately) required for 3D features.<br/><br/>1-2 players<br/>DUALSHOCK®4<br/>3D Game<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>TM &amp; © 2019 Ugly Industries Holdings, LLC. All Rights Reserved Published by Outright  Games  Limited.  Software  ©  2019  Outright  Games  Limited.  Developed by Well Played  Ltd.", "metacritic": null, "released": "2019-04-26", "tba": false, "updated": "2019-08-02T16:19:26", "background_image": "https://media.rawg.io/media/screenshots/f64/f6438d0d0eedd3922c2dfe1f93815df3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Outright Games"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}