{"id": 312765, "slug": "paladins-strike", "name": "Paladins Strike", "name_original": "Paladins Strike", "description": "Take Paladins on the go with Paladins Strike! More than 20 Champions are in the palm of your hand in this hero shooter. Paladins Strike is built for mobile, featuring real-time 5v5 battles from a top-down view against players from around the world. Choose from multiple game modes and defeat your enemies through superior team tactics. Where will YOU strike?\t<br/><br/>\tTHE HERO SHOOTER GOES MOBILE<br/><br/>\tFans of Paladins: Champions of the Realm and new players alike will enjoy the MOBA-style gameplay and exciting fantasy world.<br/><br/>\tSELECT YOUR CHAMPION<br/><br/>\tChoose from more than 20 familiar Paladins characters, each with their own weapon and special abilities. Take control of the Realm with your favorite Champion!<br/><br/>\tGO TO WAR IN STYLE<br/><br/>\tPirates, rock stars, and witch doctors: we have the look you crave! Show off your unique style with an assortment of skins available in the in-game store.<br/><br/>\tDISCOVER MULTIPLE MODES<br/><br/>\tNo matter what you enjoy, there is a place for you in the Realm. Escort the payload in Siege, or call upon a powerful Juggernaut in Summons.<br/><br/>        BATTLE FRIENDS IN REAL TIME<br/><br/>\tBring your friends or meet someone new with real-time 5v5 multiplayer combat. Great teamwork is key to a successful Strike!<br/><br/>        BECOME A PRO GAMER<br/><br/>\tWill you become a Champion of the Realm? Join other players on the front lines of mobile esports and compete on a global stage!<br/><br/>By clicking GET, you are agreeing to be bound by EACH OF the EULA, TERMS &amp; CONDITIONS and Privacy Policy referenced BELOW. <br/><br/>To ensure your familiarity with Hi-Rez’s policies regarding these items, please take a moment to review Paladins Strike’s End User License Agreement (or “EULA”) ( https://web2.hirez.com/hirez-studios//wp-content/uploads/2015/11/PaladinsStrikeEndUserAgreement-2017-08-22.pdf), as well as our Online Terms of Service and Use Agreement (or “Terms &amp; Conditions”) (https://web2.hirez.com/hirez-studios//wp-content/uploads/2015/11/Hi-Rez-Studios-Online-Terms-of-Service-and-Use-Agreement-Last-updated-Aug.-24-2017.pdf) and Online Privacy Policy (or “Privacy Policy”) (https://web2.hirez.com/hirez-studios//wp-content/uploads/2015/11/Hi-Rez-Studios-Online-Privacy-Policy-Last-updated-Aug.-24-2017.pdf). The EULA, Terms &amp; Conditions and Privacy Policy contain information relating to user conduct, Hi-Rez’s use of cookies, interaction with Third Party Web Sites (such as the online store from which you downloaded the game’s software) and a variety of other terms and conditions. Be sure to check in frequently, as each of the EULA, Terms &amp; Conditions and Privacy Policy will be updated by Hi-Rez from time to time as our practices evolve.  If you have any questions, complaints, or comments regarding our EULA, Terms &amp; Conditions, or Privacy Policy or the use of your information, please contact our legal department at legal@hirezstudios.com.", "metacritic": null, "released": "2018-04-25", "tba": false, "updated": "2019-10-22T14:37:54", "background_image": "https://media.rawg.io/media/screenshots/150/15013d6783b98dd831356994dd715fb7.jpg", "website": "https://www.paladinsstrike.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hi-Rez Studios"], "genres": ["Action", "Strategy"], "publishers": ["Hi-Rez Studios"], "esrb_rating": null}