{"id": 312754, "slug": "medieval-clicker-alchemy", "name": "Medieval Clicker Alchemy", "name_original": "Medieval Clicker Alchemy", "description": "Medieval Clicker Alchemy – Fantasy clicker / tap game / incremental game<br/> <br/>Welcome to the second Medieval Clicker adventure!  Some time ago we discovered the epic adventures of Talkor and Vala, amazing blacksmiths forging the most epic legendary weapons. This time we will focus on incredible world of Alchemy! It is a game where you’ll be able to craft the most epic fantasy potions ever as a talented alchemist! This will be a great achievement to accomplish!<br/><br/>There are multiple alchemists you can choose from to brew epic potions using tons of different ingredients you will discover along your adventure. One of the features of this game is that Medieval Clicker Alchemy and Medieval Clicker stories are connected! So you will discover some materials you used in Medieval Clicker 1 as Talkor the blacksmith such as Nekross or Moonstone and many more!<br/><br/>Click click click, tap tap tap! That will be the only way your alchemist will be able to brew epic medieval potions nonstop! This game can be also played as an idle game or idle clicker. Medieval Clicker Alchemy is an incremental game.<br/><br/>Discover fragments of the story in each phase your alchemist takes in this adventure, they will take you to an amazing medieval fantasy world. There are loads of new levels that will make you feel like you were living in Aventra, our medieval fantasy world. There are also many achievement to complete.<br/><br/>Each level, potions will be tougher to craft, but your alchemist will be able to produce more complex and rare concoctions. Don’t forget to brew the most epic legendary potions!<br/><br/>FEATURES<br/>● This game is a clicker game and it is based in a single input. Click with one finger, two or as many as you need so your alchemist can craft  epic medieval potions as fast as they can!<br/>● This game can also be played as an idle game or an idle clicker. Many upgrades can be achieved idle mode.<br/>● This game an incremental game, this means it will become tougher as you progress in the adventure, but much more fun!<br/>● Prestige system to accelerate the progress of the clicker game with Time Vortex Stones<br/>● Multiple ingredients to discover, tons of epic medieval potions to craft<br/>● Loads of different ingredientes: You will discover 1 new ingredient per phase, and that will unlock 1, 2, 3 or 4 new potion recipes to craft depending on how far you got in your adventure!<br/>● An amazing gallery in the form of a recipe book, so you can enjoy all the potions you craft through the adventure whenever you want.<br/>● Epic story that will make you feel inside this medieval fantasy world and make this adventure more real!<br/>● Dozens of upgrades for your alchemist, ingredients and potions to make your game experience even better!<br/>● Loads of achievement to be completed<br/><br/> <br/>Clicker games:<br/>Clicker games are one of the most easy path learning games. These kind of games are very addicting, so prepare yourselves to tap the screen of your device hundreds of times!<br/>In this particular game, the faster you tap, the faster you will craft medieval potions ,and earn money faster. That way, you will increase the abilities of your alchemist and progress in your adventure. So remember! Click click click, tap tap tap! That is the anthem of Medieval Clicker Alchemy Game!<br/> <br/>Become the most epic and legendary alchemist in this fantasy clicker adventure game!", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-10-22T14:37:54", "background_image": "https://media.rawg.io/media/screenshots/3dc/3dc55cfe48596195f0fbbaee4ccfa5a9_mnAyNFR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Noxfall Studios"], "genres": ["RPG", "Simulation"], "publishers": ["Noxfall Studios"], "esrb_rating": null}