{"id": 312749, "slug": "rise-of-heroes-roh", "name": "Rise of Heroes - RoH", "name_original": "Rise of Heroes - RoH", "description": "Explore this fantasy strategy RPG game and battle your way through!<br/><br/>The most powerful ancient necromancer awakened from the pyramid, hiding behind him is unimaginable evil! The whole world is hanging by a thread.<br/>To save the world, you will summon over 200 Heroes with various abilities from different factions. You must train them to fight together, mold them into living weapons, and assemble the greatest adventure team ever seen for strategic victories.<br/><br/>Download now to join the fight!<br/><br/>▶Features<br/><br/> - Build up Your Team with Various Heroes! <br/>Meet over 200 Heroes from 5 different factions, each with different appearances, figures, and skills. Collect as many Heroes as you can and assemble the greatest adventure team!<br/><br/> - Ever-changing Strategic Gameplay<br/>Witness the dazzling display of each Hero's unique skills!<br/>15 different attributes of Gem sets to pick and choose, to give additional abilities for your heroes! <br/>Come up with the best strategy to win battles!<br/><br/> - Epic Boss Fight <br/>Challenge dozens of ancient monsters or mythological creatures with your elite team. Then go farm them for plentiful rewards.<br/><br/> - Amazing PVP Battle Arena <br/>Enjoy a real-time battle with players worldwide!<br/>Go toe-to-toe with other players to climb the rankings in intense arena battles. Two teams go in – only one comes out.<br/>Reveal your unique strategy to the world!<br/><br/>- Massive PVE campaign MAP<br/>Experience the epic fantasy world through 12 spectacular locations spread over a sprawling story campaign.<br/><br/>- Visceral 3D artwork <br/>Beautiful, fully-rendered 3D heroes offer stunning details down to the cracks in their armor. Watch them battle through vivid environments with thousands of unique skills and attack animations.<br/><br/>- Rich Social Experience <br/>Collaborate, battle and form alliances with players from all over the world, combining voice chat to make your adventure journey no longer lonely.<br/><br/>- Hassle-free Autoplay <br/>Autoplay levels to spend less time grinding and more time exploring the epic fantasy world.<br/><br/>-------------------------<br/> Follow Us Here: <br/>Facebook: https://www.facebook.com/RiseofHeroesGame/ <br/>Twitter: https://twitter.com/RoH_Game<br/>Instagram: https://www.instagram.com/riseofheroesroh/<br/>YouTube: https://www.youtube.com/channel/UCTIPMqYoawMQbrISNJMHGqA<br/>Reddit (unaffiliated players moderated): https://www.reddit.com/r/RiseOfHeroesRoH/", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-10-22T14:37:53", "background_image": "https://media.rawg.io/media/screenshots/56d/56dab28ed13cea6f3622cd5805d0c69c_fGAPObm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WingJoy"], "genres": ["RPG", "Strategy"], "publishers": ["WingJoy"], "esrb_rating": "Everyone 10+"}