{"id": 312854, "slug": "real-weapon-enemy-destruction-rpg-and-machine-gun", "name": "Real Weapon Enemy Destruction: RPG and Machine Gun", "name_original": "Real Weapon Enemy Destruction: RPG and Machine Gun", "description": "Welcome to top first individual commando shooting game and experience first individual shooting with present day battle field. A practical adversary strike activity based game. Play this stunning shooting game and turn into an impeccable head-shot executioner with ultra-sharpshooter shooting aptitudes, and most overcome warrior in armed force troops through any weapon utilized for a survivor. You are a genuine trooper on the cutting edge of the war zones against fear based oppressor adversaries. Heat up your blood, Hold your breath, and draw the trigger of your rifle and let the projectiles fly. <br/><br/>In this Real Weapon Enemy Destruction: RPG and Machine Gun game fear based oppressor foes are touched base in your nation and make violations. They worked there bases in your nation. The nation armed force powers neglected to stop them and nation armed force call for best counter executioner in world for complete these fear based oppression and their bases. You are a best shooter of the world to battle against this fear mongering. So your obligation is handle this circumstance and complete all psychological oppression to spare your nation. Pick your cutting edge weapons, Show no-leniency, shoot and annihilate all psychological oppressor bases and spare your nation. Your commando is furnished with present day weapons, attack rifles, automatic weapons, sharpshooter firearm and numerous more deadly contraptions. It is a current war battled by small time commando armed force. Demise and peril is on each stride so assault deliberately. Protect yourself and slaughter all fear monger foes and finish your main goal. Construct your own procedure and handle every difficult level, all levels requires distinctive methodology so hold your nerves and battle till to death. <br/><br/>As a bravo commando demonstrate no kindness and get the headshot of each fear based oppressor and complete off their dread from your nation. Utilize your exact shooting target abilities and attempt to get most extreme headshot. In the event that you ready to get head-shot you will execute adversary straightforwardly and going for the go to murder them with no discharging squad and protect your ammunition. Lead the charge of annihilate psychological militant. Guard yourself by with strategic procedure and you can battle against adversaries in a few great fight maps; like blanketed, forsake and city field. Game additionally gives you extremely practical battle environment, brimming with exceptional fight scenes and extremely smooth control of the interface. Download now this astounding FPS shooting game and experience shooting in various undertakings. Demonstrate no benevolence and fatal assault on fierce psychological oppressor foes and appreciate hot shooting for a few hours.<br/><br/>How to play Real Weapon Enemy Destruction: RPG and Machine Gun<br/>Start the game<br/>Select level from the map<br/>Press shoot button to shoot enemy<br/>Press Reload for Reload gun<br/>press scope for close in scope<br/>press Switch button to change gun<br/>Press jump button for jumping <br/>Press sit for sit or down<br/><br/>Real Weapon Enemy Destruction: RPG and Machine Gun Game Features;<br/><br/>Realistic modern gun simulation and animation<br/>Very smooth control of guns<br/>Thrilling sound effects<br/>Realistic 3D graphics and amazing killing effects<br/>Full of thrilling action packed game<br/>Real deadly combat environment<br/>Lots of challenging missions for your enjoyment<br/>Play anywhere, doesn't require an internet connection<br/>Very easy to download and play<br/>Free to install and play", "metacritic": null, "released": "2017-02-16", "tba": false, "updated": "2019-10-22T14:37:59", "background_image": "https://media.rawg.io/media/screenshots/936/9364b7bba7c8fa0bcd7d045719d7bb52_RC0oXFR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ashraf Masood"], "genres": ["Action", "Strategy"], "publishers": ["Ashraf Masood"], "esrb_rating": "Mature"}