{"id": 312843, "slug": "exotic-car-traffic-chase-pagani-zonda-free-drive", "name": "Exotic Car Traffic Chase: Pagani Zonda Free Drive", "name_original": "Exotic Car Traffic Chase: Pagani Zonda Free Drive", "description": "Is it true that you are prepared for another and stunning 3D auto dashing game called Exotic Car Traffic Chase: Pagani Zonda Free Drive? Wander around the city with the best racer autos this game has given you, drive through midways with your best dashing auto and utilize your hustling ability for brisk hustling auto racer cars and the approaching traffics which you could confront while moving with a fast pace on the road with other cars. Race around the Endless tracks of the arcade hustling game, which is reclassified with the best autos-vehicles from all around the globe in this game. <br/>Exotic Car Traffic Chase: Pagani Zonda Free Drive is the best 3D versatile racing game for which the in-your-face enthusiasts of dashing auto would have been searching for till date. You can drive the dashing autos through the drivers view and race around the city with the approaching traffics while driving the unending street and the phenomenal and immersive environment. Tilt your gadget to control your hustling autos, overwhelm on the approaching activity, and acquire coins from avoiding the movement and colliding with rivals auto and purchase new autos from the coins which you have earned. You have been given the ideal environment of approaching movement with the best autos for experiencing this race strikingly; you were purposefully placed in the middle of the activity to race in the risky zones among the various racers and attempt to win this troublesome race which is not regularly simple for everybody aside from the no-nonsense fanatic of dashing games. In any case, this is the game which each no-nonsense devotee of hustling needs to play and wishes to race all the astounding autos which this game gives.<br/>We are making you to drive with the astonishing dashing autos unending onto the approaching movement. Playing the activity dashing in 3D auto once I promise you that you will disregard such different games which makes you race among the movement, for example, movement racer, Rush rider, police pursuing auto dashing games, Car extraordinary race, bike hustling, moto GP, Heavy bicycles race, Super autos dashing games. As a part of the young, you have the correct energy to play this game, as you are speedy, you are overflowing with essentials and you can manage this road action keeping away from the approaching activity by playing the best development control game. Endeavor your best to play it with all your thought and get more coins by taking sharp cuts by the passing development and attempting to maintain a strategic distance from the approaching activity and increasing more scores. <br/><br/>The Exotic Car Traffic Chase: Pagani Zonda Free Drive game is genuinely greatly simple to watch in recordings, in any case it is difficult to play as you have to take an OK control of your auto on the off chance that you are not a genuine racer from past. You ought to just enter your hustling auto, and secure yourself by attaching seat straps, since you don't have the idea in regards to the speed of these dashing autos yet. When you have started to drive the autos you will see that how quick they really are, by the quickening and also by the top speed of the hustling autos, while the autos rigging would move so quick that you would not see anything and would fly like a shot out and about against the approaching activity. <br/><br/>Features of the game:<br/>3D simulation car driving experience<br/>Heavy police cop cars <br/>Police chasing robbers with shooting in sight<br/>Realistic sound effects and shooting sounds<br/>Extreme racing and drifting game<br/>Get extra points on shooting and drifting at the same time<br/>Fast responsive intuitive GUI<br/>Real physics car chasing<br/>FREE to install<br/>Big city environment<br/>Upgrade with scoring more points<br/>Multiple addictive levels", "metacritic": null, "released": "2017-02-08", "tba": false, "updated": "2019-10-22T14:37:58", "background_image": "https://media.rawg.io/media/screenshots/d6c/d6cd842021cb7f26e0c346c13ca2fc5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ashraf Masood"], "genres": ["Adventure", "Arcade"], "publishers": ["Ashraf Masood"], "esrb_rating": "Everyone 10+"}