{"id": 312884, "slug": "zombies-silent-battle-lifeless-town", "name": "Zombies Silent Battle: Lifeless Town", "name_original": "Zombies Silent Battle: Lifeless Town", "description": "This is the new month of zombie strike, they are growing in number, everyday there is a whole lot created by these zombies, they are gathering their force into this field and at the end the strike is not in the action, you have to be careful about their counter attack and they can be anywhere, look around, zombie attack, human age is going to an end. Battle of zombies and live walking humans is the theme of this The Lifeless Town: Zombies Salient Battle game. Try to be quick, because zombies will take a short time to attack and they are going to transform the normal human into one of them. This is an island of zombie war and walking dead species are there for you. Be cautious about them.<br/><br/>The Lifeless Town: Zombies Salient Battle is a shooting game, full of thrill, action and fear. You need to be brave and check all the areas around you, to make sure you are not getting attacked by any zombie, because, they can smell your flesh and take all your blood as their dinner. Play smart, play easy and get yourself saved from this fiery town full of undead, creepy, crawling creatures. <br/>Features of The Lifeless Town: Zombies Salient Battle include:<br/>•\tCity based 3D environment in zombies<br/>•\tShooting and zombie hunting game<br/>•\tIntuitive gameplay with addictive realistic graphics<br/>•\tEasy and one touch controls making gameplay more interesting<br/>•\tHold your guns to target the zombie empire<br/>•\tMulti-level game with amazing sound effects", "metacritic": null, "released": "2017-08-23", "tba": false, "updated": "2019-10-22T14:38:01", "background_image": "https://media.rawg.io/media/screenshots/5b1/5b160adac3a9b1dd5309b930a13213f5_jgff9RH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ashraf Masood"], "genres": ["Action", "Adventure"], "publishers": ["Ashraf Masood"], "esrb_rating": "Mature"}