{"id": 312845, "slug": "real-boxing-champ-legend-of-fight-club-games", "name": "Real Boxing Champ: Legend Of Fight Club Games", "name_original": "Real Boxing Champ: Legend Of Fight Club Games", "description": "Do you really want to play real men, solid and metal challenging game? because Real Boxing Champ: Legend Of Fight Club Games is brining you the most amazing and pleasant real steeling championship. This is a boxing game full of fight, rocky solid tricks, jaw hitting, belly knock- boxeo and some stunts from the thai fighting. The world championship is coming through, you have to prove your skills here, in the initial challenges, these are the trials, and they are judging your actual skills to combat in the real fight against tough guys.<br/><br/>If it not just a fight, but this is a complete tournament that is coming specially in your area, selecting tough and challenging guys from across the world, there you go, capture the thrill. Champions aren't born, they are made! Punch Boxing is the world's #1 combat sports game available on your smart phone.<br/>Punch Boxing offers fighting game fans an adrenaline pumping world of boxing action. Polished animation and stunning 3D graphics bring the real boxing experience to your hand, while intuitive touch screen controls make jab, hook, and uppercut feel natural and fun. Go toe-to-toe against 30+ bone crushing boxers from America, India, San Francisco, Montreal and Washington. Use quick reflexes and special moves, unleash fierce punches and combos, beat all opponents and become the king of boxing now!<br/><br/>Collect your belt of world heavy weight champion and most time reign and sustaining belt holder as the best boxer. Realistic scene in this game including boxing ring, boxing timer, boxing bell and boxing clock, makes you feel that as you are watching real boxing live stream just in the boxing match.<br/>Easy to control, attacks and fight back , Defense and Movements. Make quick movements, do not panic, wait for your opponent to get annoyed and then you make that fast, tricky quick move that is able to knock out the most known world champions of all times. Real Boxing Champ: Legend Of Fight Club Games is a fun packed realistic and addictive game. It is like a killer boxing, the street boxing trend.<br/><br/>Real Boxing Champ: Legend Of Fight Club Games game features are:<br/><br/>Features:<br/>•\tAll the devices are free of charge<br/>•\tVivid and living 3D HD graphics<br/>•\tConvenient and easy operation interface<br/>•\tReal-time report<br/>•\tAstonishing sound effects<br/>•\tMultitude of boxing skills needed to learn<br/>•\tVarious legendary boxing fighters<br/>•\tEndless levels and challenging opponents<br/><br/><br/>Are you fascinated by this game? Wanna meet prestigious and legendary box fighter? Wanna acknowledge all kinds of practical boxing fighting skills? Come and join in Boxing: Rise of Champion!", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2019-10-22T14:37:58", "background_image": "https://media.rawg.io/media/screenshots/40d/40d4c30e96657a358e8799a0b50bdc3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ashraf Masood"], "genres": ["Action"], "publishers": ["Ashraf Masood"], "esrb_rating": "Everyone 10+"}