{"id": 3129, "slug": "grand-ages-medieval", "name": "Grand Ages: Medieval", "name_original": "Grand Ages: Medieval", "description": "What is Grand Ages: Medieval?<br/><strong>\"Grand Ages: Medieval\" is an entry in Kalypso's \"Grand Ages\" series of finely-crafted strategy games of different genres developed by different studios. This game is not a sequel to the 2009 title \"Grand Ages: Rome\", a classic RTS with a focus on city building. \"Grand Ages: Medieval\" is a larger scale, real-time empire simulation game combining elements of trade, expansion and exploration with a heavy focus on economical domination.</strong>Features:<br/><ul><li>Explore a <strong>gigantic game world</strong> of over 20 million square kilometres, plot strategically where to found important cities and defend your kingdom against foreign powers<br/></li><li>Produce and trade <strong>20 different goods</strong> to meet the demands of your citizens and soldiers: such as coal, fruits and pottery<br/></li><li>Research and utilise <strong>50 major technological advancement</strong> of the Middle Ages: including the three-field crop rotation, the low warp loom or the longbow<br/></li><li>Raise an army and fight your opponents with <strong>knights, archers and cavalry</strong><br/></li><li>Face devastating natural disasters like storms, fires, volcanoes, droughts, earthquakes… or even the Black Death<br/></li><li>Challenging <strong>Multiplayer Mode</strong> for up to 8 players</li></ul><br/>It is the year 1050 AD. At the beginning of the High Middle Ages development in Europe has seen an unprecedented level of progress and a rapidly growing population spreads across the length and breadth of the continent. New frontiers are explored, settlements founded and vast trading routes established. As the head of one of these small settlements, it falls upon you to lead your people towards greatness. Explore a vast world, gather resources, encounter other societies and use your trading expertise to expand and make your fortune. Found new cities, progress your nation with inventive technology and protect your trade routes against barbarian attacks until you are powerful enough to begin your conquest over Europe and forge a bold new empire.<br/><br/>Grand Ages: Medieval is a real-time strategy game from Gaming Minds. Lead your people and advance through the decades by utilising construction, research, expansion and conquest in an area extending from Scandinavia and North Africa; to Portugal, the Caucasus and the Middle East. Rise from the humble role of a simple mayor governing a small settlement and rule over all of Europe. Experience an exciting campaign with elaborately designed cut-scenes, play by your own rules in free play or test your skills in multiplayer against up to 8 players!", "metacritic": 63, "released": "2015-09-24", "tba": false, "updated": "2024-03-09T10:40:47", "background_image": "https://media.rawg.io/media/screenshots/936/936fb3bc45c61b713dd5b646ddb91aa5.jpg", "website": "http://www.grandages.com", "rating": 2.83, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 189, "beaten": 2, "toplay": 4, "dropped": 8}, "playtime": 4, "achievements_count": 144, "ratings_count": 18, "suggestions_count": 515, "game_series_count": 0, "reviews_count": 18, "platforms": ["macOS", "PlayStation 4", "iOS", "PC", "Linux"], "developers": ["Kalypso Media", "Gaming Minds Studios"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": ["Kalypso Media"], "esrb_rating": "Teen"}