{"id": 313001, "slug": "rashness", "name": "Rashness", "name_original": "Rashness", "description": "<p><strong>RASHNESS</strong> is a boss battle game, where you will have to defeat only <em>one</em> enemy. Be ready though, he is tough and he won't go easy on you. Killing it with the basic attacks is hard and very long, so what you can do (and probably should !) is sacrifice some of your health in exchange of different interesting upgrades. It's up to you to find the way you like to play, or to find the most efficient powerups combination !</p>\n\n\n\r\nCONTROLS\r\n<p><strong>Move</strong> with <em>WASD / ZQSD</em> (for French keyboards)</p>\n<p><strong>Fire</strong> with <em>Mouse Left click</em></p>\n<p><strong>Dash</strong> with <em>Space</em> (if you choose the upgrade!)</p>\n\r\nThe game is meant to be hard, so do not worry if you die many times before finding a good strategy, it is perfectly normal, and it is in part due to the fact that I made the game in 48 hours, so I didn't have much time to balance it ! \r\n\n<p>This is my 4th participation to the<strong> Ludum Dare</strong>, but above all the first time I hit the <em>compo submission</em>. It was a really interesting experience, but I think I could have done a more complete game, maybe I was a bit too afraid of the short amount of time I had working alone. I'll keep that in mind for the next time if I go for a solo game jam again, but I think I'd rather work with a team !</p>\n\n\n<strong>Follow me on Twitter !</strong>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-08-28T23:16:53", "background_image": "https://media.rawg.io/media/screenshots/d02/d02bdeb18e871dd0e049ebc4c5672688.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Robin Six - Saering"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}