{"id": 313075, "slug": "a-day-at-the-farm", "name": "A day at the farm", "name_original": "A day at the farm", "description": "<p>This is a game made for Ludum Dare 44, the team was “Your live is currency”. So I made a farming/survival game where you have to buy seeds and upgrades with your blood.</p>\n<p>Game Info:</p>\n<p>A day at the farm is a survivor farming game, you are farming Blood Flowers, the only way to get seed for this flower is to buy it for your local vampire shop. You guest is they only let you pay with blood, but you eating Blood Flower gives you blood back.</p>\n<p>The ground in this area is very bad, so you have to fertilize the ground before you can plant, once a plot has been fertilized in can support a few plants before you have to do it again.</p>\n<p>When a flower is fully grown it will pop off the ground, Blood Flowers are very delicate, so pick the up quickly before they vanish</p>\n<p>You will get attacked by monsters, when a monster hits you you lose blood. Be careful so you don’t bleed out. You can see your blood and seed count in the top left corner.</p>\n<p>The vampire shop don’t only sell seeds, it also has a few upgrades and if you get enough blood you can buy your freedom.</p>\n<p>Keep in mind, your body can only have so much blood inside it, luckily the vampire shop is also your local blood bank, so deposit some blood if you are near your max. When you buy something the price will first be subtracted from your blood bank account.</p>\n<p>Controls:</p>\n<ul><li>Move - WASD</li><li>Plant/Fertilize - E</li><li>Attack - Left Mouse</li><li>Pause - Esc</li></ul>\n<p>This is not my greatest game and sadly I didn’t have a lot of time for balancing, but I had fun and learned a lot, hope at least some of you have some fun playing it hehe.</p>\n<p>If you enjoyed the game, why don't jump over to the Ludum Dare page and give it a rating :) </p>", "metacritic": null, "released": "2019-04-28", "tba": false, "updated": "2019-08-28T23:16:53", "background_image": "https://media.rawg.io/media/screenshots/4eb/4eb3336eba0479327bf228bc4b080186.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ZenriS"], "genres": [], "publishers": [], "esrb_rating": null}