{"id": 313166, "slug": "oh-no-my-coins-2", "name": "Oh No! My Coins!", "name_original": "Oh No! My Coins!", "description": "<p><strong>Welcome on my first Game Jam result! </strong></p>\n<p>For the curious, here is my journey through my first Ludum Dare Game Jam (and for my first fully finished game!): </p>\n<p><em>Saturday morning:</em><br/>Up at 5:30, I don't really want to wake up but I can't resist to take a look at the theme. Life is currency. I think it's the one I found the worst. I think about it trying to fall asleep but it's too late. I need to start and write some ideas. By reading posts on the Ludum Dare website, inspiration begins to thrive and I finally found a idea that I like and respecting the theme. I remember a Unity tutorial covering all the the basic features I need (the 2D Roguelike project)  so I spend the whole morning following the tutorial to get a first prototype for my game. <br/></p>\n<p><em>Saturday afternoon: </em><br/>It's time to do some graphics! With my idea, pixel art seems perfect and easy enough to do some good-looking programer art ;) I have hard time to find inspiration on the web but I end up pretty happy with my main character after a few hours of work.  I continue with walls and floor.<br/>I add some features in the game like jumping and going through walls. Using my boyfriend as a beta-tester, I tweak them until he likes them. I end my day by searching music and sound effects on Open Game Art.</p>\n<p><em>Sunday morning: </em><br/>I begin my day with more graphics. I finish all I need to have a prototype of the game with my own graphics. Then, I start a new feature: adding cops that follow the player and trapdoor to hide from them. For that, I used an A* star algorithm found on Github and it saved me so much time! I end my morning with this feature complete (at least on the programming side).</p>\n<p><em>Sunday afternoon: </em><br/>I go back to graphics for the cop. Then, I add sound effects and music background. I polish the game by adding a start screen and a game over screen. I also take a long break after all this work! And back to it, it's time to add levels! <br/>When I finish almost all the levels, I do some beta-testing again. I tweak some levels and add more. I also play with the different parameters of the game to make it not too hard and not too easy. </p>\n<p>And voilà! My game is here, ready to be played. </p>\n<p>I'm very exciting about all I did this weekend. I'd never thought to make a game so polished at the end of this game jam. I wasn't even sure to have something to post at the end when I began. </p>\n<p>I hope you'll like it! And congratulations to everybody that go through this game jam :)</p>", "metacritic": null, "released": "2019-04-28", "tba": false, "updated": "2019-08-28T23:16:52", "background_image": "https://media.rawg.io/media/screenshots/0fc/0fc10128d68636a4722d2a4b85e6eb9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["malya"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}