{"id": 3133, "slug": "the-jackbox-party-pack-2", "name": "The Jackbox Party Pack 2", "name_original": "The Jackbox Party Pack 2", "description": "<p>The sequel to the party game phenomenon The Jackbox Party Pack, featuring FIVE fresh, rib-tickling party games! Games include:Fibbage 2 (2-8 players)The runaway hit bluffing game with over 500 brand-new questions, more than 2x the original! Plus new features, like the deFIBrillator!Earwax (3-8 players)The hear-larious sound-effects game that will leave you up to your ears in laughter!<br />\nCow moo? Huge explosion? Or tiny fart? Which to choose?Bidiots (3-6 players)The absurd art auction game where you draw right there on your phone or tablet. Outbid your opponents for weird art pieces – drawn by players themselves – and win this strangely competitive auction game! Don’t be a bidiot!Quiplash XL (3-8 players)The say-anything, gut-busting Quiplash XL, which includes everything in Quiplash, Quip Pack 1, AND over 100 brand-new prompts!Bomb Corp. (1-4 players)The bomb-defusing nailbiter of a party game! As interns at Bomb Corp., you must defuse random bombs in the office in order to keep your jobs. You’ll probably die, but it’ll be good work experience!<br />\nPlayers play using their phones, tablets, or even computers as controllers – making it the perfect easy-to-join party starter. No extra controllers needed! And, spectators can join and affect some games by playing as Audience members!<br />\nNOTE: This game is local play, but can be enjoyed over streams with remote players.<br />\nNOTE: These games are in English only.<br />\nIt’s a game-night riot in a box… without the box!</p>", "metacritic": 76, "released": "2015-10-13", "tba": false, "updated": "2023-12-09T15:02:03", "background_image": "https://media.rawg.io/media/games/c93/c937ca05b295dceab6de72f69e329ba2.jpg", "website": "http://www.jackboxgames.com", "rating": 4.05, "rating_top": 4, "added_by_status": {"yet": 52, "owned": 1380, "beaten": 95, "toplay": 12, "dropped": 81, "playing": 32}, "playtime": 3, "achievements_count": 116, "ratings_count": 202, "suggestions_count": 168, "game_series_count": 8, "reviews_count": 205, "platforms": ["Nintendo Switch", "Xbox One", "PlayStation 4", "PlayStation 3", "PC", "macOS"], "developers": ["Jackbox Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Jackbox Games"], "esrb_rating": "Teen"}