{"id": 313431, "slug": "waiting-for-good-dot", "name": "Waiting for Good Dot", "name_original": "Waiting for Good Dot", "description": "<p><strong>WAITING FOR GOOD DOT<br/></strong>Controls: Arrows. Get to the highest level you can before you run out of shoes.<br/>____________________________________<br/><strong>HISTORY</strong></p>\n<p>Okay, let us travel back to ... 1980!</p>\n<p>Our family got an Apple ][+ on June 9th, 1980. I LIVED on that computer all summer. Making text adventures, graphics demos...</p>\n<p>One of the first games I made was WALK INTO THE DOT. It was in Apple ][+ lo-res graphics. There are BAD DOTS. Do not walk into them. There is a GOOD DOT. Walk into it to win the level! Get to the highest level you can! </p>\n<p>It wasn't great, BUT it did bring up some subtle game design ideas, and was part of me learning, 39 years ago, how to design games.</p>\n<p>But how to re-make it now? Make it with cool graphics? NO. I would make it like it was. Crappy, primitive, but hiding some interesting lessons.</p>\n<p>So, I programmed the old Applesoft lo-res commands of PLOT, HLIN, and VLIN and re-made this crappy old game.</p>\n<p>HOWEVER, there is something about it! As you get above level 10, level 20, you start feeling that \"slot machine\" feeling and \"I almost made it\"! That weird frustration-success feeling is addictive, and is worth study, even in such a primitive game as this! Also, you can learn the secrets of the game's collision: if ANY pixel of your dude touches the good dot (even if other parts touch the bad dots), you win the level! Often you may see you can win when it looked hopeless.</p>\n<p>Caution, this is a quickly done game, BUT it's an interesting study in very raw game design. AND... there is... A CHALLENGE. </p>\n<p><strong>THE WORLD RECORD IS LEVEL 36.</strong> (By my sister... who's in her sixties!) Playing, you will see how hard that is to get!</p>\n<p><strong>CAN YOU GET HIGHER?</strong></p>\n<p>____________________________________<br/></p>\n<p>BONUS! CRT-shader version (If you are aren't in Chrome on a Mac):<br/></p>\n<p>https://thattomhall.itch.io/waiting-for-good-dot-crt<br/></p>", "metacritic": null, "released": "2019-04-27", "tba": false, "updated": "2019-04-29T05:48:18", "background_image": "https://media.rawg.io/media/screenshots/78b/78bd6a820f5b418c5c2143248e89f6e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ThatTomHall"], "genres": ["Action"], "publishers": [], "esrb_rating": null}