{"id": 313538, "slug": "super-undercover-slime-agent-remastered-early-acce", "name": "Super Undercover Slime Agent Remastered (Early Access)", "name_original": "Super Undercover Slime Agent Remastered (Early Access)", "description": "<p><strong>Super Undercover Slime Agent(SUSA) Remaster</strong> is a comedy platformer with a twist! No Jumping.</p>\n<p>To clear gaps and objects you must bounce your way through the difficult and frustrating levels using walls, floors, springs and more. If that's not enough for you then try our Hardcore mode where you only get 1 life to complete the story mode.</p>\n<p>Bored? Left wanting more? Well then build your own levels and share them with your friends to see who breaks their computer first!</p>\n<p><strong>Remaster?</strong><br/></p>\n<p>The game originally launched in 2013 and we were a brand new company at the time. Since then we have released several titles learning along the way. Now we think we can make the best possible version of SUSA that we can and are working hard to achieve this vision.</p>\n\n<p><strong>Early Access?</strong><br/></p>\n<p>The game is currently not finished but features everything from the original and will now work on modern systems. We are improving it patch by patch towards our vision of what we want for the Remastered vision. This includes everything from a full graphics overhaul to up to date systems like controller support, new multiplayer modes and more!</p>\n<p>However we need your support to help fund this through the last stage of development towards getting the final version ready.</p>\n\n<p><strong>Whats new?</strong><br/></p>\n<p>While we are always working on adding content and remastering stage by stage we will give you a brief overview of whats already in:<br/></p>\n<p>-Controller Support</p>\n<p>-Runs on modern hardware(no longer small resolution locks)</p>\n<p>-New multiplayer modes including the long awaited Battle mode.</p>\n<p>-Local profiles and saves</p>\n<p>-Multiplayer mechanics such as multiple bounces on other players now confuse and reverse controls.</p>\n<p>-Level Editor Enhanced controls and layout with new weather and background controls.</p>\n<p>-Graphics revamp(everything from buttons to characters completely done from the ground up)</p>\n<p>-New Zones added to the main story and editor.</p>\n\n<p><strong>Can I help?</strong><br/></p>\n<p>Of course you can. We listen to everyone's feedback and are always making improvements based from your feedback provided.</p>", "metacritic": null, "released": "2019-04-27", "tba": false, "updated": "2019-04-29T06:13:47", "background_image": "https://media.rawg.io/media/screenshots/254/25489274ebc1f6c9907892c349d1d55d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kando Corp"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}