{"id": 313666, "slug": "square-vs-triangles", "name": "Square vs Triangles (itch)", "name_original": "Square vs Triangles (itch)", "description": "<p>Triangles are coming, and only the Square can stop them. Get ready for Square vs Triangles a challenging 2D platformer that brings back the best days of the genre.</p>\r\nImportant\r\n<p>The WebGL version (the one you are playing on the browser) does not support save data. If you want to be able to save your progress please download the standalone windows ver.</p>\n<p>If you have any problem with the camera try playing in full screen and that should fix it.</p>\r\nControls\r\n<p>WASD or Arrow keys - Navigate the menus/move.</p>\n<p>Enter or Return - Select.</p>\n<p>Space bar - Jump.</p>\n<p>X or M - Dash</p>\r\nSummary\r\n<p>Prepare to jump, stop and dash your way through different worlds and enemies, each with its own quirk, face different challenges that will put your coordination, reflexes and all your gaming skills to the test. </p>\n<p>Battle against multiple challenging bosses inspired by the all time classics like Super Mario World and Rayman, and relive those great moments with a fresh spin of modern gaming.</p>\n<p>What are you waiting for? Play it for free while is still in early access. Get ready for some crazy platforming action because remember Triangles are coming.  </p>\r\nOther Details\r\n<p>Please remember Square vs Triangles is currently in early access, so despite my efforts to provide a stable build able to run smoothly on every machine, minor bugs and issues may occur. If you encounter any problem, please don't doubt, contact me and I will do everything in my capacity to solve it.</p>\n<p>The game is been develop actively so follow me for the lastest updates and news, I will post all the progress in a devlog. If you can (and want) support the game.</p>\n<p>Leave me a comment with your thoughts, I've been developing the game alone and any feedback will greatly help me to improve the experience. </p>\n<p>Thanks your for playing and Have fun!!!!</p>", "metacritic": null, "released": "2019-04-26", "tba": false, "updated": "2019-04-29T06:44:05", "background_image": "https://media.rawg.io/media/screenshots/312/31290e1344d57d43c8d4941a73379d33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Tribial G"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}