{"id": 313665, "slug": "outcast-itch", "name": "Outcast (itch)", "name_original": "Outcast (itch)", "description": "<p>Outcast is a open sea game, full of foe and friendly islands, fortified to face the pirate menace.<br/></p>\n<p>Recklessly take on the government navy, collect rogue pirates bounty or pillaging unsuspected islands\r\nUnravel the treasure map and follow the trails to discover the mythical treasure. </p>\n<p>Climb up the pirate ranks and defeat the defending navy admirals to become the Pirate King, or acquire the loyalty of the Pirate Bay.</p>\n\n<p>Features: <br/></p>\n<ul><li>Balance between collecting and selling resources, upgrade for speed, fighting or invest in cargo size</li><li>Explore the sea in search of the right crew - a disguiser could save your day where a triple gunner can not.</li><li>Battle against simple forward looking navy to clusters of patrols to hit-and-run pirates to special battleship bosses</li><li>Test your navigation skills using just a compass pointing to rumors of the mythical treasure island</li><li>Avoid or go head on against fortified islands</li><li>Procedural generation of map, resource allocations</li></ul>\n\n<p>Since we are still in Alpha, we have lots of plans:<br/></p>\n<ul><li>Story mode<ul><li>\"You were a navy Vice Admiral, aspiring for Admiral. While on a pirate hunting expedition, your fellow Vice Admiral betrays you and lets you stranded. In your quest for revenge, you have 3 choices: Take revenge, became governor or find the mythical treasure island\"</li><li>Will slowly introduce you to the game mechanics (we prefer this rather than having a lengthy tutorial)</li><li>It will have progressive levels following a path </li><li>Maps will be significantly smaller than in sandbox mode</li></ul></li><li>Add all endings in sandbox<ul><li>Revenge - take revenge on your betrayal by killing the Admiral</li><li>Governor of the pirate bay - invest into your island</li><li>After completing one of the goals, allow to continue playing to complete all endings, with the benefits of the already achieved goals</li></ul></li><li>Additional crew members<ul><li>Legendary crew - they provide significant benefits but to acquire them, you'll need to first beat them: Siren, Fire Golem</li></ul></li><li>Environmental features<ul><li>Whirlpools, Tornadoes, Whales, Volcanoes</li><li>Wind, Currents</li><li>Biomes</li></ul></li></ul>\n\n<p>The team:</p>\n<ul><li>Sotirakis Lazarou</li><li>Kypros Chrysanthou</li><li>Paris Mesidis</li></ul>\n<p>Special Thanks:</p>\n<ul><li>Kenneys assets: https://www.kenney.nl/assets </li><li>Water vector created by freepik - www.freepik.com</li><li>GWriterStudio</li><li>Our little helpers:<ul><li>Socrates Georgiou</li><li>Eirini Andreou</li><li>Antria Krokou</li><li>Dimitris Michailidis</li></ul></li></ul>", "metacritic": null, "released": "2019-04-26", "tba": false, "updated": "2019-08-28T23:16:50", "background_image": "https://media.rawg.io/media/screenshots/b96/b9617ab387d90a870320eeff1d1f651f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["twelve2two"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}