{"id": 313765, "slug": "weaving-tides", "name": "Weaving Tides", "name_original": "Weaving Tides", "description": "<p>Ride on the backs of carpet dragons and dive into the depths of a vibrant woven world. Explore the textile landscape soaring above and diving below the weave, solve puzzles, challenge quirky creatures and unravel the great mysteries of a long forgotten past in Weaving Tides!Key Features<br />\nUnique weaving gameplay  Stitch and cut your way through the textile landscape. Use the weavers abilities to wrap up your foes and conquer tricky zelda-like dungeons and puzzles. Choose the weaver which fits your playstyle and outfit them with mystic embroideries to further enhance their abilities.Explore a vibrant woven world  Dive into an enchanting, textile landscape and be swept away by the colorful cast of characters with fully hand painted portraits and the captivating musical score.<br />\nUncover hidden mysteries packed in a charming story  Gather eccentric allies on Tass&#39; quest to find his parents, assemble fragments of the past and eventually unveil the long forgotten secrets of the woven world.<br />\nCreative Playground ModeUnlock new, colorful ribbons for your Weavers during the campaign and use them in the playground feature to freely stitch and create your own digital embroidery.</p>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2023-04-08T17:57:22", "background_image": "https://media.rawg.io/media/screenshots/24a/24ab3f230a6f951d12e9efb997b6c461.jpg", "website": "https://www.weavingtides.com/", "rating": 0.0, "rating_top": 4, "added_by_status": {"owned": 32, "beaten": 3, "toplay": 5, "dropped": 3}, "playtime": 1, "achievements_count": 20, "ratings_count": 5, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 5, "platforms": ["Nintendo Switch", "PC", "macOS"], "developers": ["Follow the Feathers"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Follow the Feathers"], "esrb_rating": null}