{"id": 313743, "slug": "overstep-2", "name": "Overstep", "name_original": "Overstep", "description": "A future sport of two 5-robot teams, entertaining the crowd on super-funded arenas. Combine acrobatic tricks with weapon mastery. If you want high octane gameplay, look no further, tear through your enemies and earn the acclaim of the mega-corporations and fans around the world as you enter the arena. With highly mobile characters and weapons to suit all tastes, race through stunts earning Heat and kills to make your mark on the leaderboards.More Details<ul><li>Third Person Shooter<br/></li><li>5v5<br/></li><li>Forever free-to-play<br/></li><li>Fast-paced arena shooter<br/></li><li>Career system</li></ul>LoreSet in the year 2354, when humanity has spread to the stars, the vast, lawless frontier created by the rapid expansion has become uncontrollable. Civil unrest becomes too widespread for the G.S.O.P (Global Syndicate of Planets) to control. Joining forces with the galaxies seven largest corporations, they create a new type of game show called Overstep. A fight to the death, league-based system, Overstep is where the corporations battle to become top of the leader boards.<br/><br/>Using new advancements to artificial intelligence, the combatants in this new show use robots that can contain a human conscious. Called the Turing Automaton, these robots allow for the wars to rage with zero human casualties. Pro Gamers from all over the galaxy are sought to control these new machines and entertain the vast populations scattered across a thousand planets.<br/><br/>And this is where you, the player comes in. Take control of an automaton, choose your corporation (or not) and take center stage in a new sport for the modern citizen.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:01", "background_image": "https://media.rawg.io/media/screenshots/562/562d28d6f2fb0dfb366fb5beab4aba33.jpg", "website": "https://overstepgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamecan"], "genres": ["Action", "Indie"], "publishers": ["Gamecan"], "esrb_rating": null}