{"id": 313754, "slug": "motogp-19", "name": "MotoGP 19", "name_original": "MotoGP 19", "description": "<p>MotoGP™19 celebrates the passion for motorsports!<br />\nThe official videogame of the most popular motorcycle championship in the world is back with a new chapter full of surprises!OFFICIAL 2019 CONTENTAll the adrenaline of the 2019 season right in your hands!<br />\nRace with all the official riders of the MotoGP™, Moto2™, Moto3™, Red Bull MotoGP™ Rookies Cup classes on 19 different tracks.HISTORIC RIDERSAll the passion of the MotoGP™ from the 500 2-strokes to the Modern Era.<br />\nAccess the Historical Challenges mode and relive the most exciting rivalries trough time attacks and specific scenarios to recreate the moments that shaped the history of the MotoGP™.<br />\n- More than 50 legendary riders<br />\n- Over 35 bikes<br />\n- 3 additional historical tracksNEURAL AICompete with a faster, smarter and more accurate AI based on machine learning that will identify your actions and react accordingly. The best racing experience ever is waiting for you!DEDICATED SERVERSThe addition of dedicated servers has made playing online more fun than ever! Challenge your friends in different modes:<br />\n- Public Lobby: create a fully customisable lobby (number of laps, weather, sessions) or scroll through the list of lobbies available and pick your favourite one;<br />\n- Private Lobby: create a custom event and challenge your friends;<br />\n- Race Director: choose the starting grid, give penalties and direct the race!CUSTOMISATION and GRAPHIC EDITORSFree your imagination with new tools and make your rider unique!<br />\nCreate your style by choosing from the most complete selection of accessories and brands ever and have fun with the new graphic editors! Combine fonts and shapes to customise your helmet or download the ones created by other players!CAREERDesigned for all types of players, from rookies to veterans of the series!<br />\nChoose whether to follow Career and climb the leaderboards, right up to MotoGP™ or to focus on the Pro Career and race like a real pro!BIKE DEVELOPMENTImprove your bike&#39;s performance during dedicated tests in Career, working on different technical aspects:<br />\n- Traction Control System;<br />\n- Engine Brake;<br />\n- Anti-Wheelie System;<br />\n- Engine;<br />\n- Chassis.<br />\nPlan your strategy to be the best: just like in a real championship, you have a limited number of new engines and tyres available.</p>", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2024-01-06T23:05:40", "background_image": "https://media.rawg.io/media/games/3dd/3ddf5ce9c9e58b830922a2d026153561.jpg", "website": "http://motogpvideogame.com/", "rating": 3.64, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 61, "beaten": 2, "toplay": 7, "dropped": 5, "playing": 1}, "playtime": 4, "achievements_count": 202, "ratings_count": 11, "suggestions_count": 322, "game_series_count": 14, "reviews_count": 11, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Milestone"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Milestone"], "esrb_rating": null}