{"id": 313841, "slug": "fearmonium", "name": "Fearmonium", "name_original": "Fearmonium", "description": "<p>Fearmonium is a psychedelic action-platformer where suspense intertwines with humor. Start the game as the usual unpleasant memory and reincarnate into a real phobia by breaking through the most hidden corners of consciousness of Jimmy.<br />\nThe whole game will unfold in the inner world of a boy who once saw several clowns at a fair. Their images secured by support of Depression are making their way into the depths of his consciousness through the nightmare, meeting Jimmy’s memories on their way, anxieties and bright images. Will the clowns be able to supplant all objective fears of Jimmy and take the place of his main horror?<br />\n- A huge map of Jimmy’s consciousness, woven from abstract images and half-forgotten memories;<br />\n- Classic and hand-drawn frame-by-frame animation;<br />\n- Dynamic battles with combo attacks and a variety of unique abilities;<br />\n- Information about the process of the formation of new phobias and the nature of human consciousness;<br />\n- Memorable enemies, whose images reflect what Jimmy saw in the real world;<br />\n- The answer to the question: does a phobia always cause irreparable harm, or can its presence change life for better?<br />\nThe game is developed by one person - Slava Gris, inspired by music from Expecte Amour. Fearmonium is a mix of skills of self-taught artist who has received the master&#39;s degree of Psychology.</p>", "metacritic": null, "released": "2021-05-20", "tba": false, "updated": "2023-02-01T10:50:16", "background_image": "https://media.rawg.io/media/screenshots/75e/75e414f211c89b3c74365d170ebe60f8.jpg", "website": "https://twitter.com/rbspade", "rating": 3.43, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 43, "beaten": 4, "toplay": 6, "dropped": 4}, "playtime": 3, "achievements_count": 23, "ratings_count": 6, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "macOS", "Linux"], "developers": ["Redblack Spade"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Redblack Spade"], "esrb_rating": null}