{"id": 313891, "slug": "fairy-doctor-animal-pet-salon", "name": "Fairy Doctor: Animal Pet Salon", "name_original": "Fairy Doctor: Animal Pet Salon", "description": "This tooth fairy is crazy about animals! She loves to take care of her adorable dog and the animals of the kingdom and she dreams of becoming a vet doctor in the future! Let's help her to make her dreams come true in this Pet Salon Simulator for Kids!<br/><br/>Become a real doctor, take care of your favorite pet and help the lovely tooth fairy to complete all the levels of the pet salon simulator game! Caring for animals is an important value for children while they are growing up. Let the kids enjoy this educational pet salon simulator where they will take care of the Tooth Fairy's dog and will learn all about the love for the animals!<br/><br/>Kids will have lots of fun playing with this Tooth Fairy pet salon simulator, as not only will they learn how to take care of the dog and the rest of the animals, but also how to treat them as if they were in a real pet Spa. Brush their hair or wash them! Possibilities are infinite! Change the aspect of this adorable dog and have fun helping the tooth fairy with her tasks!<br/><br/>If you adore to take care of a cute dog and love to help people, this pet salon simulator is the perfect game for you! Come join the tooth fairy and play now!<br/><br/>Features!<br/>- Simple and intuitive simulator game for kids.<br/>- Amazing pet salon atmosphere and sounds.<br/>- Many animals to take care of.<br/>- Learn the values of caring for animals and have hours of fun!<br/>- Take pictures of your pet adventures and share them with family, friends and other kids!<br/><br/>It is time to travel to a magical kingdom where the lovely Tooth Fairy, her dog and many other kids are waiting for you! What are you waiting for? Play now!", "metacritic": null, "released": "2019-06-22", "tba": false, "updated": "2019-10-22T13:52:36", "background_image": "https://media.rawg.io/media/screenshots/9b2/9b27897ad0ae1b2e5cef2a98a3044a0f_uURNMw9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dominic Vargas"], "genres": ["RPG", "Simulation"], "publishers": ["Dominic Vargas"], "esrb_rating": null}