{"id": 313867, "slug": "tales-of-wind", "name": "Tales of Wind", "name_original": "Tales of Wind", "description": "Welcome chosen one,<br/>La Place, the city blessed by divines is under shadow of evils nowadays.<br/>We need your power to find the truth behind and bring the light again. <br/><br/>An action MMO RPG with cute characters and soothing experience <br/>-Customize yourself with tons of outfits<br/>-Capture and travel with cute pets and mounts<br/><br/>Cards of Power<br/>-Defeat powerful monsters and seal them in soul Cards which grant you superior power<br/><br/>Explore a vast world for great loots and precious with your friends<br/>-Real-time PVE gameplay requires good Co-op<br/><br/>Tons of gameplay mode<br/>-Racing, shooting, quiz and more than 20 different gameplay<br/><br/>Meet your romance in your adventure<br/>-Encounters your soul mate in the journey<br/>-Complete the 2-Players tasks via your wisdom and courage<br/>-Promise your love in the church with all your friends<br/>-Manage the farm only for you two<br/> <br/>Value yourself and empower the kingdom<br/>-Complete the kingdom mission with players all over the world to promote the course of history<br/><br/>Pledge yourself to the guild<br/>-Defeat other guild with your strategy and power in several GVG mode<br/>-Party, feast and quiz events, enjoy your guild life<br/><br/>Challenge players around the world, use strategy to defeat your rivals<br/>-Compete for Higher Ranks in real-time PVP  <br/>-Make your own elite team and fighting for ACE<br/><br/>Tales of Wind Subscription Information<br/>1.\tSubscription Price and Cycle<br/>You can use the Subscription Choco Assistant in the game. After the automatic renewal function is enabled, the subscription price is 2.99 USD, the subscription period is 30 days, and the subscription will be automatically renewal upon expiration.<br/>2.\tAbout Subscription Content<br/>Users of the subscription assistant can enjoy the following privileges during the subscription period: I. Farm’s daily Heart outputs is increased by 200%; II. Farm’s daily Heart output is increased by 3000; III. Treasure Hunt is upgrade to automatically dig for treasure.<br/>3.\tAbout Auto Renew<br/>The App Store official subscription feature is an automatic renewal subscription, and your iTunes Account will confirm payment. Users need to manually manage the auto-renew feature in iTunes/Apple ID Settings Management. If the auto-renew features is not turned off within 24 H before the end of the subscription period, the subscription period will continue automatically.<br/>4.\tUser Agreement<br/>User Agreement: https://www.neocraftstudio.com/terms<br/>5.\tPrivacy Policy and Notice<br/>Privacy Statement: https://www.neocrftstudio.com/privacy<br/>6.\tUnsubscribe process<br/>If you want to unsubscribe, go to Settings on your iOS device-&gt;Select iTunes Store &amp; App Store-&gt; Click on Apple ID and select View Apple ID”, go to “Account Settings”, Click “Subscribe”-&gt;”Manage”, and select the subscription corresponding to “ToW”, then you can cancel the subscription", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-10-22T14:02:21", "background_image": "https://media.rawg.io/media/screenshots/171/1716df816fa05cd2a4b81cfcc5c07396.jpg", "website": "https://tow.neocraftstudio.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 5, "toplay": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 5, "platforms": ["Android", "iOS"], "developers": ["NEOCRAFT"], "genres": ["Action", "RPG"], "publishers": ["NEOCRAFT"], "esrb_rating": null}