{"id": 313845, "slug": "the-grandmaster", "name": "The Grandmaster", "name_original": "The Grandmaster", "description": "Martial arts can be used for good and bad, whether it’s siding for justice or getting a free meal without having to pay for it.  The Grand Master of course, follows that latter, and while he isn’t that old or wise, he never pays for his food, even when he eats at the \"not so friendly\" ninja cafe. <br/>\n<br/>\r\nIn this game, you must best the ninjas who want you to pay for your bill.  You know, like a normal person.  But you’re a Grand Master, and you don’t follow those rules. One button is all it takes to beat these pesky ninjas, and the goal is to do this every single day. <br/>\n<br/>\r\nThis is another humble Beat-Fu game which has a lot of playability, and loads of fun.  Follow the journey of the Grand Master, and experience the silly, frustrating and action-packed adventures all in a simple button-tapping game. <br/>\n<br/>\r\nFeatures:<br/>\r\n-\tUnique hand-drawn art <br/>\r\n-\t100 Stages to play and beat<br/>\r\n-\tInfinite Mode and a leaderboard for ranking once you beat it<br/>\r\n-\t6 Ridiculous Challenge Modes to unlock Steam Achievements<br/>\n<br/>\r\nThis is a free and fun game ready to challenge your martial arts reflexes!<br/>\n<br/>\r\nPlus, if you like our work, consider supporting us by purchasing the DLC Packs. While it is a cosmetic DLC, it is a nice little added touch to the game and does motivate the creators as well.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:51", "background_image": "https://media.rawg.io/media/screenshots/3df/3df0122a8b223da5f9b7fedafa5b06dd.jpg", "website": "http://www.beat-fu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beat-Fu Studio"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Beat-Fu Studio"], "esrb_rating": null}