{"id": 313928, "slug": "angry-birds-ar-isle-of-pigs", "name": "Angry Birds AR: Isle of Pigs", "name_original": "Angry Birds AR: Isle of Pigs", "description": "Join Red, Chuck, Bomb and the Blues to save the stolen eggs in Angry Birds AR: Isle of Pigs, a mobile Augmented Reality (AR) adventure! Discover the remote island where the greedy green pigs vacation in over 40 fun-filled levels (with more to come). You can see the incredibly realistic characters, along with the entire game, overlaid onto your actual environment, bringing Angry Birds to life like never before. Make your way up to party city through the island’s jungle, desert and frosty hideout, destroying their structures in the most spectacular way to earn maximum stars and retrieve the stolen eggs. Take the slingshot into your own hands to fire off your favorite Angry Birds at structures that seem like they are in your actual environment, whether it be your home, your office or outside at the park. <br/><br/>With AR, you can physically walk around structures overlaid onto objects in your own environment to find weak elements, identify different angles for the best accuracy, as well as uncover hidden surprises in order to take on the green pigs, earn more points and unlock more content. You can even make the game large or small to fit your space and customize your experience. Start the adventure today!<br/><br/>Need some help? Visit our support pages, or send us a message! https://support.rovio.com/<br/><br/>Terms of Use: https://www.rovio.com/terms-of-service<br/>Privacy Policy: https://www.rovio.com/privacy<br/><br/>This game may include: <br/>- Direct links to social networking websites that are intended for an audience over the age of 13. <br/>- Direct links to the internet that can take players away from the game with the potential to browse any web page. <br/>- Advertising of Rovio products and also products from select partners.<br/>- The option to make in-app purchases. The bill payer should always be consulted beforehand.<br/>- This application may require internet connectivity and subsequent data transfer charges may apply. After the initial download, additional content will be downloaded and this may include data charges.", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2024-03-08T11:29:37", "background_image": "https://media.rawg.io/media/screenshots/57f/57ffdef2dfe442f0d6ca153939f4b9db_wN7dyNS.jpg", "website": "https://www.rovio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 171, "game_series_count": 18, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Rovio Entertainment Oyj"], "genres": ["Simulation"], "publishers": ["Rovio Entertainment Oyj"], "esrb_rating": null}