{"id": 313995, "slug": "kalimba-royal", "name": "Kalimba Royal", "name_original": "Kalimba Royal", "description": "The Kalimba is an African musical instrument consisting of a wooden board (often fitted with a resonator) with attached staggered metal tines, played by holding the instrument in the hands and plucking the tines with the thumbs. The mbira is usually classified as part of the lamellaphone family and part of the idiophone family of musical instruments.<br/><br/>Members of this broad family of instruments are known by a wide variety of names. The kalimba is also known as marímbula and mbria in the Caribbean Islands.<br/><br/>4 Kalimba Simulator (Thumb piano/ an African musical instrument) with real audio, with #, b, adjustable UI, changeable color style:<br/>- Three Treble: 17 keys<br/>- One Alto: 15 keys<br/><br/>More offline and online songs (Kalimba Tabs) for practice<br/><br/>Play simulator or Connect to real Kalimba (play multi-pitch) with mode:<br/>- Melody &amp; Chord<br/>- Melody Only<br/>- Melody (Treble, Treble 1, Treble 2, Alto, Piano Chord)<br/>- Real Time<br/>- Autoplay<br/><br/>Two view mode for beginner and professional<br/><br/>Build my own tabs and export pdf (similar KTabS): build, pre-play and save, open Kalimba tabs<br/><br/>Share your tabs to world. Download tabs from world<br/><br/>Record feature: record, play back and share<br/><br/>Export .wav file for better sound quality than recording by microphone. You can use it as ringtone or share it to your friends<br/><br/>Kalimba Tabs with songs:<br/>- Yesterday once more<br/>- Heart and Soul<br/>- Heal the World<br/>- When you believe<br/>- My love<br/>- You are my sunshine<br/>- Happy birthday<br/>- Kiss the rain<br/>- ...<br/>** Kalimba Tabs is updated regularly", "metacritic": null, "released": "2019-04-28", "tba": false, "updated": "2019-10-22T14:18:28", "background_image": "https://media.rawg.io/media/screenshots/741/741e15f3e02dfb74b044a238c106b282_i3UqTJc.jpg", "website": "https://www.sonoscore.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Son Truong Ngoc", "sonOS"], "genres": ["Simulation"], "publishers": ["Son Truong Ngoc"], "esrb_rating": "Everyone 10+"}