{"id": 314002, "slug": "the-hanoi-towers", "name": "The Hanoi Towers", "name_original": "The Hanoi Towers", "description": "English:<br/><br/>The Hanoi Towers also known as Towers of Hanoi, Tower of Brahma and Lucas' Tower, it's a puzzle with a mathematical solution consisting in three rods with a number of disks of scaled sizes from bigger to smaller, the smallest at the top like a conical shape.<br/><br/>The objective of the game is to move all the disks from the left rod to the right rod in the minimal amount of movements taking in count these 3 rules:<br/><br/>* Only one disk can be moved at a time<br/>* Only the upper disk can be moved to another rod that can be empty or not<br/>* A disk can't be placed over a smaller disk<br/><br/>The game is played by levels, each time all disk are taken to the right rod, the current level is finished and a new one begins, each new level adds a new disk to the left stack on the left rod making every new level more and more complex.<br/><br/>Each time a level is finished an end level dialogue appears with the following information:<br/><br/>* The finished level number<br/>* The elapsed time used to complete it<br/>* A 3 Stars rank for:<br/><br/>1. Minimal Movements,<br/>2. No error or mistakes,<br/>3. Time Record<br/><br/>To win the game the player must complete 7 levels<br/><br/>At the end the game shows a results chart with all the completed levels, it's times, records, number of good and bad movements, the 3 stars raking obtained, and which of the 6 achievements the player got, that are the following:<br/><br/>Achievements:<br/><br/>1. The First 3 Stars: When the player got its first 3 stars rank<br/>2. 3 Impeccable Levels: When the player got 3 stars rank 3 consecutive times<br/>3. 3 Consecutive Time Records: When the player reach 3 level records<br/>4. ¡Unstoppable!: When the player reach 5 level records<br/>5. Game Completed: When the player complete all the levels<br/>6. Best Game Time: The player finished the game with the minimal amount of time<br/><br/>We hope you enjoy this fun mathematical game.", "metacritic": null, "released": "2013-05-18", "tba": false, "updated": "2019-10-22T14:18:31", "background_image": "https://media.rawg.io/media/screenshots/d10/d10b39192038b133be3e617ba0ae1ee9_5aJnOcV.jpg", "website": "https://thehanoitowers.3dlogical.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["3DLogical"], "genres": ["Board Games", "Puzzle"], "publishers": ["JUAN FERNANDO VELEZ M"], "esrb_rating": null}