{"id": 314005, "slug": "sniper-deer-hunt-game-cabela", "name": "Sniper Deer Hunt Game: Cabela", "name_original": "Sniper Deer Hunt Game: Cabela", "description": "Grab your sniper rifle and feel what it is like to be part of the true to life hunting grounds in the Sniper deer hunting 3D. Engage in death-defying hunts in volatile jungles, filled with aggressive and wild beasts hungry for some fresh meat. If you have the eye of the true hunter, only then you can anticipate attacks from every corner and take the shots to score hunt points, on route to becoming the best sniper shooter in the region. It’s Open Season - join the hunt today!<br/><br/>Good collection of wild or feral animals for sport hunting for food and recreation. Only lawfully allowed animals to hunt. Hunt and earn more to unlock next wild levels. We treat hunting as a sport, not a wild killing spree of animals. Hunt feral animals but not the Endangered ones.<br/><br/>Shooting a moving object is always difficult than shoot a fixed object. Improve your sniper shooting skills to hunt walking deer in the safari forest. They become more fury and aggressive when they hear gunfire and blast sound. They can attack you and you have to kill them before they reach to you. Kill and shoot before you are killed.<br/><br/>Game Features:<br/>&gt; Engaging sniper hunting experience in really deep dark jungles <br/>&gt; Superior sniper shooting controls optimised for iPhone and iPad devices <br/>&gt; Realistic deer hunting environments<br/>&gt; Different Seasons<br/>&gt; Sniper and Assault Weapons<br/><br/>Each level of this hunting game provides new environment and new place. This is a unique animal shooting games than other jungle hunting games. This is one the best top free hunting games. You have hunt lot of deer in this game. Sniper rifle and assault rifle are very accurate in aim and target. Sniper provides 99.9% accurate shoot. Use the sniper rifle to kill deer and heavy rifle to shoot and kill big cats like lion tigers and bears. You have to accomplish your mission within given time.<br/><br/>How to Play<br/>1. You are presented with the mission, clear it to play the next level.<br/>2. Swipe in the left center of the screen. take aim, zoom, shoot at a target.<br/>3. navigate in the forest on swiping on the left center of your phone.<br/>4. Keep eye on time.<br/>5. Enjoy deer hunting season.<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- No network connection is required to play this game.", "metacritic": null, "released": "2017-11-01", "tba": false, "updated": "2019-10-22T14:19:24", "background_image": "https://media.rawg.io/media/screenshots/371/37159b8281642af6611f30e1cee59c44_XHyiCGr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bilal Ahmad"], "genres": ["Action", "Simulation"], "publishers": ["Bilal Ahmad"], "esrb_rating": "Teen"}