{"id": 314011, "slug": "last-commando-assassin-attack-sniper-death-shoot", "name": "Last Commando Assassin Attack: Sniper Death Shoot", "name_original": "Last Commando Assassin Attack: Sniper Death Shoot", "description": "Experience the true world of war ridden battlefields with modern day firefights across multiple uniquely built environments in intense combat missions. Unlock new weapons, scenes and challenges on your way to the ultimate supremacy of the battlefield, burdened with the task of retrieving secret Intel and infiltrating enemy bases with maximum security.<br/><br/>Engraved into the minds of true hard boiled gamers, Frontier Sniper Shooter delivers hard impact on your average mobile FPS shooting experience. Smooth controls coupled with breathtaking gameplay in deadly enemy territories to challenge the best in special ops combat.<br/><br/>Game Features:<br/>&gt; Play in various environments including desert, jungle, mountain canyons and sea.<br/>&gt; Each mission comes with a unique set of enemy AI for a serious shooting experience.<br/>&gt; Complete each mission in the best possible time to achieve higher ranks with more bonus points.<br/>&gt; Highly smooth and responsive controls for touch devices.<br/>&gt; 8 challenging missions spread across different zones to provide a challenge of its own.<br/>&gt; Continuous update systems with more challenging and fun missions to be added soon.<br/><br/>Best shooting sniper game for real FPS players. Elite commando Jungle warfare is brand new, realistic action shooting game. You take the role as the sniper based in a sniper's nest, taking out the enemies that are coming to attack you. To complete the level, you must use your sniper rifle to shoot all the enemy soldiers to advance on to the next level. If you don't get all the enemy soldiers before your health is depleted, you will lose. With each level comes more enemy soldiers who will move into position to take you down. Harness you sniper skills and become the greatest sniper to defeat the enemy soldiers.<br/><br/>How to Play<br/>• Choose your mission<br/>• Shoot with fire button<br/>• Move up down jump button", "metacritic": null, "released": "2017-03-19", "tba": false, "updated": "2019-10-22T14:19:25", "background_image": "https://media.rawg.io/media/screenshots/074/074308a1971760a5ed1c6fa15164deb9_XH4rxT0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bilal Ahmad"], "genres": ["Action", "Adventure"], "publishers": ["Bilal Ahmad"], "esrb_rating": "Mature"}