{"id": 314054, "slug": "slimylights", "name": "Slimylights", "name_original": "Slimylights", "description": "<p>SlimyLights is a 3D platformer game in which the player is constantly going down. You have to escape the prison without being defeated by the enemies you will find in your way. The levels are in constant movement and as you progress the velocity increases, making the experience more and more difficult and insane.<br/></p>\n\n<p><strong>JUMP, FALL, SHOOT AND DIE. JUMP BACK AND TRY AGAIN.</strong></p>\n<p>Crazy, addicting and amazing. A simple game with surprisingly easy mechanics that will not take you a long time to master, but not without a steep learning curve that you must dominate.</p>\n<p><strong>INTERESTING DUNGEON PROGRESSION.</strong></p>\n<p>When playing SlimyLights you will traverse many levels that will test your ability while controlling a cute slime. Go falling through different levels, being careful with the enemies and the gravity. A good experience for platform and hardcore players.</p>\n<p><strong>PERFECT AND LIMITED MOVEMENT</strong></p>\n<p>Be careful while playing, don’t jump too high or let yourself fall to the bottom. You must find the right spot and moment to act, or you’ll fail because of the deadly lasers situated on the top and bottom part of the screen. Are your reflexes fast enough?</p>\n<p><strong>UPGRADE YOURSELF</strong></p>\n<p>In each level the player will have the opportunity to upgrade itself with different power ups, making each experience slightly different depending on which option has been chosen.</p>\n<p><strong>REPLAY SCENARIOS TO IMPROVE YOUR SCORE</strong></p>\n<p>Try to collect everything you can in every map to increase your score to the maximum possible. Kill enemies, collect pieces and go fast. Beat yourself or your friends.</p>\n<p><strong>NEON</strong></p>\n<p>The game has a neon art, although it is simple to avoid any distraction to the player, it’s coherent.</p>\n<p><strong>PASS ALL THE CONTROLS</strong></p>\n<p>Each level has three different controls that check how many pieces have you picked along your way through the current level. You must have all the necessaries or you’ll be destroyed in seconds.</p>\n\n<p>FIND US:</p>\n<p>Twitter</p>\n<p>Website</p>", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-05-03T04:22:34", "background_image": "https://media.rawg.io/media/screenshots/3e7/3e71fcc864d982a59098588549554868.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DarkDolphin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}