{"id": 314008, "slug": "gunship-sniper-shooter-helicopter-air-battle", "name": "Gunship Sniper Shooter: Helicopter Air Battle", "name_original": "Gunship Sniper Shooter: Helicopter Air Battle", "description": "Gunship sniper shooter: Engage in a highly realistic and challenging air to ground sniper shooting experience on mobile devices. You play as an army sniper assassin on a mission to lay down heavy fire on the ground enemy forces, who have captured most of your army fortresses. Your job is to shoot down with maximum precision and retrieve the control of these bases back to your army.<br/><br/>Step into the world of black ops combat against the forces of terrorism in this epic modern SNIPER shooter for mobile and tablet devices. Upgrade your ARSENAL , equip modern strike WEAPONS and venture into the most infamous battlefields to test your individual and team sniper games skills.<br/><br/>War is on the horizon, enemies have started occupying bases and expanding their control over the lands, taking out much of the resistance in their path of destruction. You are the one and only resistance left, patrolling the airs on an apache helicopter.<br/><br/>How to Play:<br/>&gt; Swipe the screen to move the aim while being suspended inside a moving aerial helicopter.<br/>&gt; Adjust zoom settings to focus in once the target is tagged.<br/>&gt; Hold down the breath button for that split second time frame for a steady and precise strike.<br/>&gt; Keep an eye out for your health status and enemy fire.<br/><br/>GAMEPLAY<br/>Unique sniper shooting experience in the air to ground fps shooter.<br/>Numerous levels to challenge your skills and clear out bases from enemy threats.<br/>Travel to the remote locations occupied by enemy forces like tundras, death island and desert fortress.<br/>Exquisite sniper shooting experience under tough battle conditions.<br/>Continuous update system to add more challenges and mission sets.", "metacritic": null, "released": "2017-03-21", "tba": false, "updated": "2019-10-22T14:19:25", "background_image": "https://media.rawg.io/media/screenshots/33e/33e644e033e940d99246618bc0218af9_3pEooCA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bilal Ahmad"], "genres": ["Action", "Adventure"], "publishers": ["Bilal Ahmad"], "esrb_rating": "Mature"}