{"id": 314108, "slug": "el-gran-juego-del-jardin", "name": "El gran juego del Jardín", "name_original": "El gran juego del Jardín", "description": "<p>Este videojuego fue realizado por docentes, niños y niñas de las salas de 5 del JIC 2 D.E. 13 (CABA) en el marco de #Credex, una propuesta de acompañamiento a docentes para el desarrollo y documentación pedagógica de experiencias educativas que integran Educación Digital.   </p>\n<p>\"El gran juego del jardín\" invita a recorrer los espacios del jardín para resolver una serie de desafíos. Niños y niñas idearon y realizaron el plano, los personajes, escenarios, música, sonidos e instrucciones. La representación de su espacio cotidiano en un entorno digital permitió que se aproximaran al Pensamiento Computacional. Los espacios curriculares involucrados fueron Matemática, Prácticas del Lenguaje, Indagación del Ambiente Social y Natural, Educación Física, Música, Educación Digital.<br/> <br/>El videojuego que se socializa aquí incluye dos modalidades: la desarrollada por niños y niñas del JIC 2 D.E. 13, y otra que permite a los jugadores crear el mapa de su propio jardín o espacio.  </p>\n<p>Para mas información acerca de la experiencia educativa \"El gran juego del Jardín\"  ingresá al  Campus Virtual de Educación Digital de Intec.</p>", "metacritic": null, "released": "2019-05-02", "tba": false, "updated": "2019-05-03T04:33:15", "background_image": "https://media.rawg.io/media/screenshots/3af/3afcdf8422e6a2743fdad08395b11469.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["campusvirtualintec"], "genres": [], "publishers": [], "esrb_rating": null}