{"id": 314297, "slug": "trizzle", "name": "Trizzle", "name_original": "Trizzle", "description": "Game Description\r\n<p>Trizzle is a first person, physics based puzzle game with over 40 puzzles. Puzzles are split into there own levels and require you to utilize physics and a mesh tool gun in creative ways to get from start to end. </p>\n<p>Your mesh tool gun allows you to make triangles in 3D space, this is the driving mechanic of the game. Throughout the game you unlock more mind bending gun upgrades such as making normal triangles, bouncy triangles and triangles that flip the gravity of anything they touch. </p>\n<p>Trizzle is set in a virtual world with a tron-like aesthetic and has an upbeat soundtrack.  The gameplay time is around 5-10 hours however this varies depending on the player (really it depends on how smart you are).<br/></p>\n\r\nMinimum requirements\r\n<p>I wouldn’t worry about it. This game is extremely efficient and includes many different graphics options allowing you to improve the graphics quality or lower it depending on your needs.</p>\n\r\nGameplay Sample\r\n\r\n<p>Triangle Modes: Normal, Bouncy And Gravity Manipulation         </p>\r\n     \r\n\r\n\r\nFuture Plans\r\n<p>If this game is somewhat successful (500+ downloads) I promise to make a sequel that continues the story where this one ends. I’ll be able to make the next one much longer with a lot more content since I’ve already got all the themes and ideas done. All the revenue produced from this game will go towards making future games.</p>\n\r\nPlease Donate\r\n<p>Right now making games is just a hobby for me but I would love to do this as a full time job so any support is much appreciated. If you download this game and enjoy it please share it with your friends! Thanks.</p>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-05-03T05:25:48", "background_image": "https://media.rawg.io/media/screenshots/f51/f517c9b8c6a27ba2c81654d04335ff5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Stasma"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}