{"id": 314337, "slug": "dreams-of-fire-twistedtwigleg", "name": "Dreams of Fire (TwistedTwigleg)", "name_original": "Dreams of Fire (TwistedTwigleg)", "description": "<p>Dreams of Fire is a puzzle game with a twist: You have to work in both 2D and 3D to solve puzzles!<br/></p>\n<p>\n<br/>\n</p>\n<p>Dreams of Fire is an original game that was inspired by a game made for a game jam.</p>\n<p>You can find the jam version of Dreams of Fire right here, along with the source code for that jam game here. You can play the game that inspired the creation of this game, and even look at the source code to see how the jam/prototype works!</p>\n<p>\n<br/>\n</p>\n<p>Using the jam version as a base, RandomMomentania remade and reworked the idea into a full game that expands and refines the concepts expressed in the jam game. Everything was written from the ground up to provide challenging puzzles that are fun to solve.\r\n    <br/>\n</p>\r\nFeatures:\r\n<ul>\n<li>Dreams of Fire has<strong> 20 carefully crafted levels</strong>. These levels can be played in any order and are <strong>designed to be challenging and fun</strong>.</li>\n<li><strong>A fully featured, powerful level editor is included with Dreams of Fire</strong>, allowing you to make levels just like those in the game. <strong>Our tools are your tools</strong>.</li>\n<li><strong>The controls are fully customizable</strong>, with every key in the game configurable so you can play using whatever layout is ideal for you. The <strong>graphic settings are customizable</strong> too, allowing you to tweak the game so it looks great and runs fast.\r\n        <ul>\n<li><strong>Xbox 360 and Xbox One </strong>controllers are supported when playing levels. A mouse is still needed for navigating the UI however.</li>\n</ul>\n</li>\n<li><strong>Share levels with others across different devices easily.</strong> Levels in Dreams of Fire are stored within a single file, so sharing levels with friends is as simple as attaching it in an email. Create your puzzles and share them with the world!</li>\n<li><strong>Runs on all major desktop platforms</strong>: Windows, MacOS, and Linux.</li>\n<li>(<em>COMING SOON!</em>) You can also find <strong>Dreams of Fire on iOS</strong>. <strong>Nothing is removed from the iOS version</strong>. It is the full Dreams of Fire experience, including the powerful level editor.</li>\n</ul>\r\nChange log\r\n<p>You can find a change log for Dreams of Fire right here on RandomMomentania.</p>\r\nCredits and Special Thanks\r\n<p>Dreams of Fire was developed solely by Noah \"TwistedTwigleg\" Beard. Listed below are all of the assets created by others used in the creation of Dreams of Fire.</p>\n<p>Unless otherwise noted, everything else within the game was created by RandomMomentania.<br/>\n</p>\r\nCredits for assets used are as follows:\r\n<ul>\n<li>Syferfontein HDRI 1D Clear by HDRI Haven</li>\n<li>New Age O Smoother, New Age N Mysterion, and New Age Q Glitter are public domain and were found on GameSounds.xyz</li>\n<li>Sound effects are from the Sonniss.com GDC Game Audio bundles across several years (license), and from Kenney Assets (CC0 1.0 Universal).</li>\n<li>Icons on UI elements in the game were created by Kenney Assets (CC0 1.0 Universal)</li>\n<li>Made with Unity3D, Blender, Audacity, and Gimp.</li>\n</ul>\n<p><strong>NOTE</strong>: None of the companies, websites, and/or programs listed above have sponsored or endorsed Dreams of Fire in any way, shape, or form.</p>\r\nSpecial thanks\r\n<p>Thanks to the following people for helping make Dreams of Fire a reality (in no particular order):</p>\n<ul>\n<li>Base Camp Trenton (link)</li>\n<li>Bucks County Academy of Fencing (link)</li><li>CodeJobler for publishing the iOS version</li><li>Laura Beard Art (link)</li>\n<li>Everyone who has helped with the Godot Game Engine (link)</li>\n<li>Everyone that has helped with the Unity3D Game Engine (link)</li>\n<li>Everyone on the Godot community forums (link)</li>\n<li>Those running the Godot jam that inspired the original game concept</li>\n<li>Friends, Family, and anyone I forgot to mention. <strong>Thanks! I couldn't have gotten here without your support!</strong></li>\n</ul>\n<p><strong>NOTE</strong>: None of the companies, websites, and/or programs listed above have sponsored or endorsed Dreams of Fire in any way, shape, or form.\r\n    <br/>\n</p>\n<p>\n<br/>\n</p>\n<p>Check out RandomMomentania.com where I post game development tutorials, games, and more! You can also follow me on Twitter if you to follow along and see what I'm working on next.\r\n    <br/>\n</p>\n<p>You can find more games I have made on Gamejolt, and here on Itch.IO. You can also find the game page for Dreams of Fire on RandomMomentania right here!\r\n    <br/>\n</p>\r\n\r\nLEGAL STUFF:\r\n<p><strong>The license agreement for Dreams of Fire is included in a separate page on RandomMomentania, which you can find HERE. </strong>The agreement is also included in the <em>README.PDF</em> file, which is included with all downloads of the game.\r\n    \n<br/>\n</p>\n<p>Using an agreement helps protect both of us legally and allows RandomMomentania to continue to grow.  Thanks!\r\n    <br/>\n</p>\n<p><em><strong>NOTE:</strong> Also, it should be noted that we do not have much experience in regards to this kind of thing, so there may be mistakes here and there. We are game developer, not lawyers.</em><em> Thanks 🙂</em>\n<br/>\n</p>\r\nThanks for reading! I hope you enjoy the game!", "metacritic": null, "released": "2019-05-01", "tba": false, "updated": "2019-05-03T05:36:23", "background_image": "https://media.rawg.io/media/screenshots/a05/a053cfc83afe8e52bd964ea9662b9dc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TwistedTwigleg"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}