{"id": 314328, "slug": "foggy-raft", "name": "foggy raft", "name_original": "foggy raft", "description": "<p>he sun is rising. Waken up from a deep sleep, you found yourself on a lonely, deserted island. The ocean around you is covered with mists, and though it was calm, you feel something unspeakable that seems to lurk in the mist.</p>\n<p> Game goal: Gather 3 treasure boxes and defeat the monster in the heavy fog, before all the treasure boxes are assembled, please avoid the monster as far as possible.</p>\n<p>Building your own raft You have 80 pieces of wood at beginning, you can use them on the island optionally to extend your raft or to make tools.</p>\n<p>Navigation To sail alone on the foggy sea, enter navigation mode through the bottom left button. Moving on the chart by burning your deck, the more decks consumed, the farther you sailed.</p>\n<p>Searching for the treasure There’re all kinds of treasure in the sea, and your compass will point to the nearest treasure — if it still works.</p>\n<p>Islands You can get wood on the islands.</p>\n<p>Sunken ships You can find tools or wood on the sunken ship. The explored islands will continue to provide light sources.</p>\n<p>To escape It’s impossible to defeat the monster with the power of a mortal. If you are caught before assembled all the treasure boxes, run away as quickly as you can! Use ↑↓←→ to move, space to cut down the deck. To throw the wood into the smelter will make you run faster. If you are caught by the monster, you’ll die. After successfully escaping from the battle, you’ll get a quick sailing chance.</p>\n<p>Decisive battle After assembled all the 3 treasure boxed, the monster will start to evade you. Chase it and win!</p>\n<p>1.1：fix bug</p>\n<p>Repaired:<br/>- the problem of displaying HELP page after clicking around the compass<br/>- the problem of unable to open the credits page</p>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-05-03T05:33:57", "background_image": "https://media.rawg.io/media/screenshots/192/1922e0e4154132939a8a0b1c4e5918b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["dimlight07"], "genres": [], "publishers": [], "esrb_rating": null}