{"id": 314301, "slug": "thunderbeam-development-access-mac", "name": "Thunderbeam Development Access (Mac)", "name_original": "Thunderbeam Development Access (Mac)", "description": "<p>Thunderbeam is a point-and-click adventure set in a universe that diverged from our own in the past. </p>\n<p>This  version of the game is user-scriptable, which allows players to experiment with writing their own adventures using the game's engine. For more information view our scripting documentation pages.</p>\n\n<p>FAQ:</p>\n<p><strong>Why is this only available for Mac?</strong></p>\n<p>We're developing the game for the iPad as a first target and there's also a Mac build as a result. Apple doesn't allow the sale of beta versions of iOS apps, so we are focusing on the Mac build here, which includes modding access not available on iOS. If you are interested in beta testing the iPad version as well, drop us a line at info@karakasagames.com</p>\n<p><strong>Who is making this?</strong><br/></p>\n<p>Right now it's three people with kinda stressful fulltime dayjobs/university programs. We've been working on this in our spare time for a few years now, and we hope if the game gets a few interested players we can devote more time to it. If you purchase the game now, you get it at a reduced price, and you'll have access to all future versions and extra content. </p>\n<p><strong>I kickstarted this! Where's my copy!</strong></p>\n<p>Thanks! Check your email! You'll also get access to all future versions as well.</p>\n<p><strong>How do I get off the spaceship?</strong><br/></p>\n<p>This first alpha milestone version is limited to episode one. The next version will unlock episode two, which is mostly set on Othvia. </p>\n<p>More questions or suggestions? feel free to contact us on twitter, @karakasagames or at info@karakasagames.com</p>", "metacritic": null, "released": "2019-05-01", "tba": false, "updated": "2019-05-03T05:27:03", "background_image": "https://media.rawg.io/media/screenshots/9b6/9b63cc9b9808e2933b6912f0e3d21a3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Rusty Moyher", "Wiley Wiggins", "Karakasa Games", "jamesrc"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}