{"id": 314416, "slug": "s2019-work-is-a-nightmare-group-1", "name": "S2019 Work Is A Nightmare (Group 1)", "name_original": "S2019 Work Is A Nightmare (Group 1)", "description": "<p>Ryan the temp has had a long career filled with more than his fair share of unruly clients. One night, after an unusually rough day of fixing office computers, he finds himself in stuck in nightmarish versions of his former places of work. Haunted by terrifying versions of his least favorite clients, Ryan must face his fears to escape with his life.</p>\n<p>This game is an action-horror orthographic shooting game with unique enemy and scoring mechanics. Each level will have a target score in the top right. Killing enemies will grant you points. The more times you hit an enemy with their buffing attack, the more powerful they will become, but the more points they will give you when killed. Reaching the point goal will advance you to the next level, but killing all the enemies before doing so—or losing all of your health—will cause you to fail the level.</p>\n<p>Traverse each level, avoiding the attacks of your advancing foes while fighting back with the objects they hate most. Each of the four enemy types will be damaged by one attack type—but be careful, because each enemy type will also become more powerful when hit with one attack type. </p>\n<p><strong>Controls: </strong>\n<br/>Movement: WASD\r\n<br/>Aim: Mouse Pointer\r\n<br/>Attacks: Q/1, E/2, LMB/3, and RMB/4</p>", "metacritic": null, "released": "2019-05-01", "tba": false, "updated": "2019-05-03T06:02:07", "background_image": "https://media.rawg.io/media/screenshots/15b/15b0ccfdc0cf84e1e15316a8d9f9f25f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Case Western Reserve Univ. EECS 290"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}