{"id": 314543, "slug": "the-value-of-your-life", "name": "The value of your life?", "name_original": "The value of your life?", "description": "<p>Who really knows how much a life is worth but when Shiro tried to sell his to Dark the demon. He has been tasked to find out and to amuse the demon at the same time... but surely this is going to be a one sided massacre? well that is why the demon gave Shiro two guns, he forgot to mention that they take HP to use!</p>\n<p>well now I wonder how long can Shiro last with just a pair of guns and his wits...</p>\n\n<p>Basic controls<br/>Arrow keys/WASD move the player click to progress through the tutorial<br/>you will shoot into the center of the screen as the camera tracks the mouse to help you aim<br/>left click shoots your weak gun, but costs 5% current HP per shot!<br/>right click shoots your strong gun, but costs 15% total HP per shot<br/>some enemies drop bags that contain health kits, however these can be converted into bombs by using 2 at once.</p>\n<p>Gameplay:\r\n\r\n</p>\n\n<p>The project<br/>This was my second attempt at a game Jam and figured I'd give it a shot. The theme really didn't suit me however that didn't stop me from trying to make a game. I did all of this solo again so of course I used some free assets for the auido and 2D sprites, all 3D objects in the level I created myself.</p>\n<p>Engine - Unity <br/>Coding- C# <br/>Assets- Photoshop, 3Ds max <br/>Delivery platform-PC</p>\n<p>I decided to try and make a nice minigame that has some deeper mechanics behind it, hence the bombs but that was my mates Idea.Credits: Assets used for power ups supplied by GameDevMarket Assets used for title screen supplied by free to re-use google images Assets used for sprites and floor tiles supplied by RPGMaker, 3D models created in 3Ds max<br/></p>\n<p>Background music supplied by GameDevMarket</p>\n<p>Coded by Edwyn Mckie, Story and game development by Edwyn Mckie. <br/>Idea developed by Edwyn &amp; Cid.<br/>Thanks for checking it out</p>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-05-03T06:37:43", "background_image": "https://media.rawg.io/media/screenshots/e65/e652c0d5f172db27c4f127eb2b1a2065.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DarkShinobi100"], "genres": ["Action"], "publishers": [], "esrb_rating": null}