{"id": 31454, "slug": "chasm-the-rift", "name": "Chasm: The Rift", "name_original": "Chasm: The Rift", "description": "Having its roots in 1997 and developed in Ukraine, Chasm: The Rift is one of the most thrilling and innovative FPS from this era and the first Eastern European boomer shooter ever made.<h3>THE STORY</h3><br/>Feeling you are no longer alone, you turn, with just enough time to shoot, killing the mutation charging mercilessly toward you. You begin to sense an eerie feeling of fear in the air, but your skin crawls as you realize it's your own...What was that thing?<br/><br/>Again and again you shoot, battling more strange beasts; all grotesque mutations of creatures you once knew. Suddenly the inexplicable becomes clear. Time channels have formed in the Earth's atmosphere, turning once normal life forms into something they were never meant to be. As part of a special commando unit, you must not only ward off and eradicate the beasts, but destroy the time channels to finally rid the Earth of these deadly mutations.<h3>GAMEPLAY</h3><br/>Along with a heart-pounding adventure through the Corridors of Time and the satisfaction of ripping limbs from hideous monsters with the iconic BladeGun, and an innovative weather system, the player will now be able to enjoy this late 90’s FPS classic with the comfort of modern PCs, now with full 4K support, improved sound design, achievements, and localised into twelve languages.<h3>GAME FEATURES</h3><br/>- Blow off monsters' limbs even as they continue to attack with remaining appendages<br/>- Different effects including water, rain, snow, wind, smoke, dust, sparks, explosions and distant fades<br/>- Awesome array of weapons, including unique Blade Gun<br/>- Enhanced graphics with full 4K support<br/>- Improved sound design<h3>BONUS</h3><br/>The original Chasm: The Rift version powered by DOSBox is included as a bonus.", "metacritic": null, "released": "1997-09-30", "tba": false, "updated": "2023-11-17T19:04:23", "background_image": "https://media.rawg.io/media/screenshots/e3f/e3fc7474f68ae40d0b29864800787fc1.jpg", "website": "", "rating": 3.63, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 48, "beaten": 14, "toplay": 10, "dropped": 9}, "playtime": 2, "achievements_count": 26, "ratings_count": 19, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["General Arcade", "Action Forms", "WizardWorks"], "genres": ["Action", "Shooter"], "publishers": ["GT Interactive Software", "SNEG"], "esrb_rating": null}