{"id": 314653, "slug": "tech-demo-diver-engine", "name": "Tech Demo: Diver Engine", "name_original": "Tech Demo: Diver Engine", "description": "<p>An engine test for a potential future project. Use Z to interact, Z/X to use items, and C or Enter to open the menu.</p>\n<p>I wanted to make a game about exploration and discovery. How do you do that in Pico-8, which is super limited on space?</p>\n<p>My first idea was to draw the tilemap at double size. That'd allow storing twice as much space, and make for twice as big an adventure, right?! This way, each screen only takes up 8x7 tiles of map space! The entire map of the game as implemented takes up about 1/8th of the dedicated map space (and 1/16th if I'm willing to dip into the shared-memory lower half of the map).</p>\n<p>All the areas are made up of the same tiles, too, and it applies palette and appropriate tile weather effects (dust, footsteps, etc) on the fly. (Right now, that takes up about 10% CPU, and I'm not sure whether that's worth it. Depends how much CPU enemies and the like end up taking...) That does mean there's still a TON of tileset room for stuff like enemy animation frames and big chonky bosses.</p>\n<p>I'm still figuring out how to implement things like NPCs and other entities. It's technically possible to talk with the three people in the cafe, but it's implemented as static events tied to those tiles, and the tiles just draw as flat paintings on the ground right now.</p>\n<p>Overall, it's been a cool technical experiment. I'm not 100% sure if I could squeeze a satisfying adventure game into this space, but it was a neat challenge.</p><p>(For reference, the music tracks are Hills of Radiant Wind from NieR, Lisa Frank 420 by Macintosh Plus, and Esperanto from Mega Man Zero 4.)</p>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-05-03T07:05:33", "background_image": "https://media.rawg.io/media/screenshots/961/96199a1b9554905fd65a399f240d20d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nowthatsstrategy"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}