{"id": 314767, "slug": "necroxeon", "name": "Necroxeon", "name_original": "Necroxeon", "description": "How to play\r\n\n<p><em>Use WASD to move, Mouse scrollwheel or 1,2,3,4 to select your spell, Left mouse button to cast the spell, and use Right mouse button to make the enemies’ bodies turn into spirits that help you.</em></p>\n<p><em>1.Fire spell: Does medium damage to enemies and sets them on fire .</em></p>\n<p><em>2.Beam spell: Does large damage to enemies, also hurts you, so use it wisely! </em></p>\n<p><em>3.Life drain: Drains life from bodies to heal you.</em></p>\n<p><em>4.Spikes: Spikes appear, killing all enemies they touch.</em></p>\n\r\nStory\r\n\n<p><em>Suddenly you die from a long sword in your chest while being robbed! As you open your eyes you encounter yourself with the underworld god and he offers you to come back to life but only if you act as a his servant. You accept the offer and obscure powers and a new body are given to you. Your new task is to kill as many people as possible to comply with the underworld god's plans.</em><br/></p>\n<p><em>A curse is cast upon you to fulfill this task and that's that every second that passes your life will drain out and the only way to regain it is by killing people. After this, you are transported to a temple in the realm of the living where you have no choice other than to kill every villager that is praying there. You kill them all except for a child who returns to the village and warns everyone.</em></p>\n<p><em>You suddenly hear hundreds people approaching. This is your last stand! Make no mistake! Don't let anyone live!</em></p>\n\n\r\nDevelopers:\r\n\n<ul><li><strong>Programming:  <em>Lyrcaxis,  wiekafe, </em><em>Sirus</em></strong></li><li><strong>Art: <em>wiekafe, melenios, <strong>nagi</strong></em></strong></li><li><strong>Music: <em>Apocalyptic Universe</em></strong></li><li><strong>Sound Effects: <em>snds_gd</em></strong></li><li><strong>Game Design: <em>Everyone played a part in it.</em></strong></li></ul>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-08-28T23:16:45", "background_image": "https://media.rawg.io/media/screenshots/e11/e1196662198ee24aca17ebba289a4b8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Lyrcaxis", "world_creator", "wiekafe1"], "genres": [], "publishers": [], "esrb_rating": null}