{"id": 315084, "slug": "night-of-the-vampirate", "name": "Night of the Vampirate", "name_original": "Night of the Vampirate", "description": "The Story\r\n<p>You play a young novice who tries to find his luck at sea. After months of battle, slaughter and piracy you still have not earned what you deserve for your service. You forge a plan with a second novice on board and both of you break into the treasure chamber.</p>\n<p>But what’s that? In the treasure bag is no booty, but a pale bloodthirsty vampire awakes from his everlasting sleep! You stab him in the chest, but with his last dying breath the vampire bites you.</p>\n<p>And now, bloodthirsty as you are, you are hunting the crew.</p>\n<p>The Controls</p>\n<p>You play the game completely with your keyboard. AWSD to move around, F to interact, Spacebar and 1-9 during dialogue.</p>\n<p>There is no combat, you simply try to trick your crew mates away from each. Be careful though to not get caught or it is Game Over. Find the right path and be smarter than the rest of the pirates.<br/></p>\n<p>The other stuff</p>\n<p>This game was created as part of the Ludum Dare 44 by a group of 4 media technology students.</p>\n<p>Elekris - Coding</p>\n<p>Mythr1der - Art and Coding</p>\n<p>Anakin - Game Design</p>\n<p>TomCat - Art</p>\n<p>Our tools of choice were Unity, Aseprite and Photoshop. Also some good old fashioned pen and paper. And a whiteboard!</p>\n<p>For most of us this was our first game jam and one of our first game projects in general. We would love to receive feedback to learn and grow from this experience and hopefully create an even better product in the future!</p>\n\n<p>The game is not finished and a lot of things are missing. This is by all means a demo at most. Thank you still for taking a look, we appreciate it &lt;3<br/></p>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-08-28T23:16:41", "background_image": "https://media.rawg.io/media/screenshots/19f/19f78bd0509b64f68d9eadd781d6646c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["TomCatBlep", "Elekris", "mythr1der", "anakin98"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}