{"id": 315109, "slug": "ldjam44", "name": "LDJam44", "name_original": "LDJam44", "description": "<p>Drag cards from your hand to the left of the screen to heal yourself, or to the right of the screen to attack.</p>\n<p>When you've used all the cards in your hand... That's it, it's the end of the day you'll need to rest in order to draw a new hand</p>\n<p>In the shop drag cards to your hand to exchange for health</p>\n<p>Each day you receive 5 cards. Once you've played your cards you need to go to town and rest to deal a new hand, unless you defeat a monster in which case you can rest before proceeding through the dungeon</p>\n<p><strong>What is a deck building game?</strong></p>\n<p>The game has an off screen deck of cards; you start with 3 bread and 3 knives. Every day (turn) you draw the top 5 cards from the deck and play your cards 1 by 1 discarding them into an off screen discard pile. When your deck is empty your discard pile is shuffled and becomes your new deck.</p>\n<p>When you buy items in the shop or receive them from killing monsters the items are placed in your discard pile and do not show up in your hand immediately.</p>\n<p><strong>Tips</strong><br/></p>\n<ol><li>You'll need to beat all 3 dungeon monsters to have a chance to beat the boss</li><li>You can return to town at any time to exchange health for items in the shop</li><li>If you leave a dungeon room below the rat room you cannot return until the following day</li></ol>\n<p><strong>Card Effects</strong></p>\n<ul><li>Stagger - next attack does double damage</li><li>Guard - block all physical damage from the next attack and deal 1 damage in return if you're attacked</li><li>Silver Sword - disables all health restoring effects</li></ul>", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-05-03T08:58:47", "background_image": "https://media.rawg.io/media/screenshots/759/7593a84a5783e8c6e865c7987f4dc8d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["copito"], "genres": [], "publishers": [], "esrb_rating": null}