{"id": 315205, "slug": "pricelist", "name": "Pricelist", "name_original": "Pricelist", "description": "<p>You're in a middle of a war. No one remembers why it started. No one knows when it will end. Human lives are just another expendable resource here. Your goal is to win by capturing all important points before the enemy no matter what.</p>\n<p>All art is done by Esus and all music is done by Cyber Night both of whom agreed to participate with me in Ludum Dare but don't have LD accounts.</p>\n<p>Your goal is to capture all 4 points on the map. To capture points end your turn while your soldiers are near the flag. The more soldiers you have on the point the faster it will be captured. Every turn each captured point gives you money. All units also drop money on death. You can spend money to hire new units.</p>\n<p>Camera is moved by A/D keys.</p>\n<p>Summary of all units in order of their appearence in the shop in the bottom left corner of the screen:</p>\n<ol><li>Heavy - has most health. Unlike other characters can shoot multiple times on one turn but has to sacrifice his mobility until the end of the turn in order to do so.</li><li>Good Boy - quickest unit in the game. Can bite enemies causing them to bleed until they are healed by medic or blow up explosives on it’s back to destroy everything aroung including covers and walls. Doesn’t count when capturing points.</li><li>Sniper - more accurate on bigger distances. Can deal massive amounts of damage and gains even higher accuracy and damage when passes a turn without moving or shooting.</li><li>Trooper - cheapest and weakest minion. Beats enemies with quantity, not quality.</li><li>Engineer - can build extra defences for the point with his mines, covers and walls. His second ability is a hit with a wrench that can stun opponents causing them to skip next turn.</li><li>Medic - heals units and cures their bleeding. Also has a pistol that can be used on short distances for offence.</li></ol>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-05-03T09:22:17", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lamossus"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}