{"id": 315350, "slug": "demons-disciple", "name": "Demon's Disciple", "name_original": "Demon's Disciple", "description": "<p>Made for Ludum Dare 44: Your life is currency!</p>\n<p>You have sold your soul to obtain victory and now are cursed to find sacrifices to bring to the Unspoken One.</p>\n<p>Finding a good subject gives great rewards... but be warned that time spent in spirit form slowly drains your soul's energy. Furthermore, subjects tend to... not take kindly towards the appearance of the Unspoken One, and when subjects are possessed by His servants they tend to go a bit mad.</p>\n<p>Explore the castle and serve the Unspoken One's will before your own spirit breaks!</p>\r\nGameplay\r\n<p>The game itself is quite simple: You have a \"spirit\" meter which drains as you wander about in spirit form. You possess subjects by bumping into them, and you must bring them to the Unspoken One.</p>\n<p>However, as subjects realize they don't have control over their body, their sanity slowly drains. Once a subject loses all their sanity, they lose their mind and can't be possessed anymore.</p>\n<p>Successfully bringing subjects to the Unspoken One gives you a boost to your own spiritual energy as well as a score based on the subject's willpower and the amount of sanity the subject has remaining. Explore the castle to find the best subjects, and bring them back to get the best score possible!</p>\r\nFuture work\r\n<ul><li>An inventory system where you sacrificed some of your spirit to gain bonuses was planned but never implemented.</li><li>AI is very simple \"point-to-point\" movement right now; ideally this would be a Hitman-esque system where characters perform various tasks and will get suspicious if weird things start happening around them. The gameplay is very simple without it, so more complex AI would add another layer of depth.</li><li>Unspoken One is a demon due to time; ideally I'd like him to be some Cthulhu-esque entity.</li></ul>\n<p>Created in Unreal Engine 4.</p>\n<ul><li>Art from the Polygon Adventure Pack, Simple Dungeons, and Simple Temples. </li><li>Post-Process is the Unreal Advanced Cel Shader. </li><li>Unspoken One's model by Quaternius.</li><li>Animations taken from Mixamo and the Unreal Engine 4 third person example project.</li></ul>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-05-03T10:01:05", "background_image": "https://media.rawg.io/media/screenshots/eaa/eaa5966542142760acb6d396bff57095.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Jay2645"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}