{"id": 315323, "slug": "teller-me-more", "name": "Teller me more", "name_original": "Teller me more", "description": "<p><strong>Welcome to the first day of the rest of your life!</strong><br/></p>\n<p>You work for the man, the machine, the money, you know; you work so you can live.<br/>Except you are at your desk 23h a day - the extra hour is your performance daily review - so keep up with the queue, the customers and their boring *alive* conversations, and don't fuck up the change or their Yhellp review is gonna be as bad as your next day.</p>\n<p>Teller Me More is a time management game, where you struggle with the daily task of handling a bank counter - make accounts, give and receive the *right* amount of money while keeping your highly annoying and varied clients entertained.<br/>Not an easy task when you are the last human teller on this downtown busy bank - downright animalistic working conditions.<br/></p>\n<p><strong>TUTORIAL<br/></strong><br/>Controls</p>\n<p>LeftClick<br/>Hold, Drag &amp; Release<br/>Press Space bar to continue Dialogue<br/>Type to type</p>\n<p>Clients start to queue<br/>Interact with the clients<br/>- Pay attention to info: what they want, amount, account number, client data Tip: it's on the post-it on your desk<br/>- Write the info in the appropriate fields<br/>- Keep the client entertained by responding appropriately to their conversation - Take too long or offend them and your performance rating will decrease</p>\n<p>Withdraw:<br/>- Type the requested Amount<br/>- Type all the client Info<br/>- Press Withdraw - to withdraw from their account<br/>- Press Dispense<br/>- Throw the money at the client<br/>Deposit:<br/>- Type the requested amount<br/>- Type all the client info<br/>- Press Deposit - to deposit on their account<br/>- Throw the money on the dispensary on the left</p>\n<p>Survive the day...</p>\n<p><strong>Credits go to our amazingly fun team:</strong><br/>- Benedikt Kirchmeier<br/>- Diana Alves<br/>- Ingelis Wipfelder<br/>- Mathew Varkki @rayvshimself<br/>- Patricia Cotrim<br/>- Sam Bäumer<br/>- Vivien Baguio @hollowspecter</p>\n<p>**Yarn**<br/></p>\n<p>**Yarn Spinner**<br/></p>\n<p>**Music**<br/>\"Lobby Time\" Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p>**Sounds** From Soniss and freesfx.co.uk</p>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-05-03T09:54:48", "background_image": "https://media.rawg.io/media/screenshots/0a9/0a9493f47b86a5ed7b51e19c351ad79e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["hollowspecter", "rayvshimself", "schplorg", "Hakaysha"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}