{"id": 315699, "slug": "boxes-rush", "name": "Boxes Rush", "name_original": "Boxes Rush", "description": "<p>In this game you need to collect coins to complete the game. Total you have 5 minutes and in 5 minutes you need to collect 100 coins to win the game. But there are also some red enemies. In fact red enemies mean's coins strollers. When you touch the red enemy or red enemy touch you then your coins will be reset to 0  (For example you have 5 coins and if you touch the red enemy then your coins will become 0 and one more enemy will be spawn in the game but if first time you have 5 coins and you touch the red enemy then 5 enemies will be spawned. </p>\n<p><strong>Features</strong></p>\n<p>You can view left and right side by moving your mouse or your finger on the touch pad.</p>\n<p>Red enemies only follow the nearest coins. And all the red enemies make a group and follow a coin alltogether.</p>\n<p>Red enemies only jump when they are near the wall to ignore the wall. But you can jump any time any where by just clicking Space button. This will also help you in game to run fast.</p>\n<p>Red enemies are stupid in the game so they are hang on the wall some time.</p>\n<p><strong>Facts</strong></p>\n<p>You can pause the game by clicking ESC button but game will not be paused because this is a bug that i make for you and only for you.</p>\n<p>This game is designed and developed by a 14 years old boy in 48 hours.</p>\n\n<p><strong>Support Me And This Game</strong></p>\n<p>Checkout my YouTube channel by clicking here to learn more about game development. I give you many tips on game development on my YouTube channel.</p>\n<p>If you like this game and me then please donate me here in itch.io.</p>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-05-03T11:23:15", "background_image": "https://media.rawg.io/media/screenshots/6f6/6f609dfd8d6ea5617a7e73bc481b1465.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["miadevs"], "genres": [], "publishers": [], "esrb_rating": null}