{"id": 315752, "slug": "life-of-a-hoarder", "name": "Life of a Hoarder", "name_original": "Life of a Hoarder", "description": "<p>This is a LD44 COMPO submission. I was too slow to really complete and polish the game, it even does not have any sounds.</p>\n<p><strong>Development details:</strong></p><p>Source on Gitlab</p>\n<ul><li>Coded with Pixi.js</li><li>Drawn everything with pencil on paper.</li><li>Font created from my handwriting with Calligraphr.</li></ul>\n<p>Theme is \"Your life is currency\" and I tried to not make just another game where you pay for stuff with your life — that would be too much like LD43 theme. So i tried to do something different:</p>\n<p><strong>Game idea/narrative:</strong></p>\n<p>Dragons are theoretically immortal. But it comes with a price: they buy eternal life from Demon of Greed with valuables stolen from lesser folks. This is why they are such hoarders! And Demon of Greed is a farseeing investor, he assesses market value of what dragons have to offer. So in this game, playing as a dragon, you’ll need to plunder towns of the Land to keep your gold income steady, but also keep track of currency rates to make sure that Demon is going to reward you with more life!</p>\n<p><strong>How to play:</strong></p>\n<p>You are a dragon. Your life is currency: you are immortal, but only as long as you pay to Demon of Greed. So when your hoard runs out you are dead.</p>\n<p>To collect more money you have to plunder towns of the Land. Click on a town to attack it; with each raid you collect some money, and when you go back to your lair it is added to the hoard. </p>\n<p>Each town has it's own currency, and time you can buy with this money depends on currency rates. Towns occasionally send caravans to trade with each other, and this trading benefits economy so that currency rate of a town where a caravan comes to increases. Your raids on the other hand worsen the investment climate so that currency rate of plundered town drops.</p><p>Your goal is to live as long as possible choosing wisely which town to plunder and when.</p>\n<p>On left side of your screen you can see how much money approximately you have in each currency, rates of currencies and how much time each will buy you.</p>\n<p>On right side of your screen you can see your hoard, how many years you lived and how many more years your hoard will claim you at current rates.</p>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-05-03T11:35:45", "background_image": "https://media.rawg.io/media/screenshots/a88/a887c45c97cea9228c2fcd76ef8bc2c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["spidamoo"], "genres": [], "publishers": [], "esrb_rating": null}