{"id": 315709, "slug": "the-lost-knight", "name": "The Lost Knight", "name_original": "The Lost Knight", "description": "<p><em>You awaken in a strange cell with no knowledge of the last few days that you spent unconcious. Cold. There is music playing yet there are no musicians present. It appears the melody is coming from the ceiling. Must be foul magic. Thankfully, you still have your suit of armour that was bestowed upon you by your queen. You have only one thing on your mind; y</em><em>ou must find a way out and return to your kingdom. You grip your sword tight and begin walking towards the opening of the cell.</em><br/></p><p><strong>In The Lost Knight you play as a knight, who has found him/herself in a cell with no memory of what previously happened. You get up slowly and start exploring your environment. While exploring you'll discover enemies that you must battle and puzzles you must solve to progress forward.</strong></p>\n<p>This is a difficult action platformer game. Dying will result in starting at the beginning again. Tread carefully. There is no dialogue in game but there is a story which will be told visually. We hope you enjoy playing!</p>\n<p><em>We are games programming students and we made this game for our final assignment of first year. We're not entirely skilled in music production or art which is why our game's visuals can look a little off at times. Please give us criticisms and feedback about our first game so we can hope to improve further.</em><br/></p>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-08-28T23:16:38", "background_image": "https://media.rawg.io/media/screenshots/32c/32c951efdc845a7109d360510318d706.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jekplex", "Arys"], "genres": ["Action", "Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}