{"id": 315707, "slug": "sinespace", "name": "Sinespace", "name_original": "Sinespace", "description": "<p>Sinespace is a virtual platform made for users and developers; build your own content and add it to Sinespace, or just jump in-world and start chatting to friends. It's a diverse and immersive world with lots of features, including race tracks, FPS games and quests. </p>\r\nKey features for creators\r\n<ul><li>The most powerful virtual world platform, ever. Design and build using everything you're used to - and assemble it together with the powerful Unity Editor.</li><li>Hundreds of built in components for creating multi-player games, social regions, vehicles, costumes and avatar customisation and so much more. </li><li>Upload clothing, characters, creatures and critters for players to wear with our powerful Character System.</li><li>MMO-style quest designer tools for building narrative structures quickly.</li><li>Fast &amp; powerful runtime &amp; server scripting through Lua.</li><li>Keeps current with Unity - upgrades to the latest Unity features as soon as they're stable</li><li>Continuously developed - new features constantly being developed and added. </li><li>Robust intellectual property policies.</li><li>Supported on Windows, Mac and Linux platforms, with more in beta.</li></ul>\n\r\nKey features for users\r\n<ul><li>Jump straight in-world and start chatting to friends!</li><li>Create your avatar using content from our marketplace; you can customise different outfits to create unique looking avatars.</li><li>Drive or fly through our wide selection of regions!</li><li>Have your own home region which you can decorate and edit to suit your style.</li><li>Start a shoot out with clowns, killer bunnies or sci-fi soliders in our FPS games!</li><li>Speed through our different race tracks to win 1st place!</li><li>Attend lots of different events such as music nights, dance nights or even join a Greedy Greedy Tournament!</li></ul>\n\r\nSystem requirements\r\nMinimum requirements\r\n<p>The minimum requirements for sinespace are fairly low, however some regions and locations may require more modern hardware.</p>\n<ul><li>Operating System: Windows XP SP2+ or newer1, macOS 10.92 or newer, Ubuntu 12.04+ (other distributions have reported to work or SteamOS</li><li>Graphics Card: DirectX 9 capable GPU (Supports Shader Model 3.0 or higher)</li><li>Memory: 2GB or more</li><li>CPU: Supports SSE2 Instructions</li></ul>\n<p>1. After January 2018, some Windows XP computers will no longer be supported. Read about it in our forums.</p>\n<p>2. Some features may not work in macOS clients older than OSX 10.11, we recommend updating to 10.12 or 10.13 if possible.</p>\n<p>3. If you have Mac OS, you can download Sinespace from here. </p>\n<p>3. If you have Linux OS, you can download Sinespace from here.  </p>\r\nRecommended requirements\r\n<p>The optimal experience will be seen by people with the following computer specifications</p>\n<ul><li>Operating System: Windows 7 or newer, macOS 10.12 or newer, Ubuntu 12.04+ (other distributions have reported to work) or SteamOS</li><li>Graphics Card: nVidia GeForce 760 or ATI Radeon R9 280X</li><li>Memory: 4GB or more</li><li>CPU: Quad-core i5 Intel CPU</li></ul>\r\n\r\nHelp and support\r\n<p>For more information on Sinespace, please visit our website.</p>\n<p>If you want to become a creator for Sinespace, see our Creator page. </p>\n<p>For any support or questions, feel free to contact us via our Discord channel. </p>\n<p>You can also check out our social media:</p>\n<p> Twitter  Facebook  Blog  Forum</p>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2019-05-03T11:25:25", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa4620f5a75bfe6b081948c4996691d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sinespace"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}