{"id": 315960, "slug": "touhou-dark-echoes", "name": "Touhou Dark Echoes", "name_original": "Touhou Dark Echoes", "description": "Investigate the mystery behind the unusual incident troubling Gensokyo. As the main character, Sumireko Usami, you get to travel all across the Gensokyo solving environmental puzzles using your unique ability to switch between the two realms.<br/> <br/><br/><br/>Mysterious dark echoes are swarming around the Youkai Mountain and both Gensokyo and the Outside World are in danger. As the story unveils you find out that Sumireko’s involvement in this incident is greater than anyone ever thought.<br/> <br/><br/><br/>The fast-paced snappy dialogues with classical Touhou whimsicality drive the story of this game. Sumireko has always something witty and sarcastic to reply to whoever she encounters on her journey.<br/> <br/>Because the game is made in Eastern Europe, its art style is very unique and never seen before in a Touhou derivative work. Both Gensokyo and the Outside World also have distinctive looks of their own and all the characters are absolute cuteness overload.<br/><br/><br/><br/> <br/>From each boss-fight you learn new ability that deepens the puzzles. But the puzzle-solving gets even more complex and difficult after Sumireko acquires the power of summoning earth elements.<br/> <br/><br/><br/><br/>Enjoy this Touhou derivative work developed in Eastern Europe with a unique art style that slows the pace down (a bit) and puts more focus on the story and the puzzles.<br/><br/>FEATURES<strong>Narrative platformer:</strong> Run, jump, switch or fireball your way through Gensokyo and the Outside World all the way up to the top of the Youkai Mountain as the snappy fast-paced whimsical dialogues reveal the story.<br/><br/><strong>Puzzle-solving:</strong> As you gain more abilities the puzzles get more and more complex. Simple switching between the worlds will only get you so far in this game. The smart use of Sumireko’s elemental powers in combination with thought through platforming and switching becomes an absolute necessity as you progress.<br/><br/><strong>Boss fights: </strong> Each boss fight is a puzzle of its own. You need to discover a weakness of each boss and exploit it in order to win and learn new ability.<br/><br/><strong>Story and Personality: </strong>In the classic Touhou Project style there is a lot of whimsicality, humor and fun as to the story, dialogues and the character personalities.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:47", "background_image": "https://media.rawg.io/media/screenshots/7ea/7ea2dd74f3163397d4d14e4ac517e5af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vaka Game Magazine", "Ministry of Broadcast"], "genres": ["Casual", "Indie"], "publishers": ["AGM PLAYISM", "Vaka Game Magazine"], "esrb_rating": null}