{"id": 315954, "slug": "zero-strain", "name": "Zero Strain", "name_original": "Zero Strain", "description": "GameplayZero Strain is a fast-paced top-down shooter that focuses on intricate mechanics and spectacular visual effects. You'll need to master many things: your movement to expertly aim shots and dodge enemy attacks, your energy to keep up the assault, and your shields to stay alive. All while looking for opportunities to unleash powerful weapons to dish out massive damage. This is not an easy game, but those who persevere will find a unique shooter experience not found anywhere else.Features<ul><li> Multiple ships to master, each with their own unique weapons and abilities.<br/></li><li> Challenging bosses that reward careful planning and quick reactions.<br/></li><li> Fast gameplay. No cooldowns. The only limit is your own skill.</li></ul>Note from the DeveloperI created this game from my ironic passion for shoot em up games (STG games). I say ironic because while I really like the idea of STG games, I'm not particularly good at them. Or rather, I find a lot of their mechanics kinda hard to get into. Zero Strain is my idea of an STG game, without being an STG game. Put another way, all the fun of an STG game without using traditional STG game mechanics. I hope you'll give this weird little game a chance, and I hope even more that you'll find it fun :)<br/><br/><br/>A controller is highly recommended for this game.", "metacritic": null, "released": "2019-06-20", "tba": false, "updated": "2023-08-01T16:43:24", "background_image": "https://media.rawg.io/media/screenshots/545/545577b18cbe02cfb0c2d34bc85cf3c0.jpg", "website": "https://www.kaiomeris.com/zerostrain", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "beaten": 1}, "playtime": 0, "achievements_count": 113, "ratings_count": 1, "suggestions_count": 468, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Kaio Meris"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Kaio Meris"], "esrb_rating": null}