{"id": 316060, "slug": "color-pin-original", "name": "Color Pin - Original", "name_original": "Color Pin - Original", "description": "You’ll love playing Color Pin! It's fun and cool for everyone - boys, girls, kids and adults.<br/><br/>Whether you wish to fight off boredom, or have some fun, the cool logic game Color Pin is ready to download for free. On your phone or tablet, this fun logic game will be with you wherever you go. Its 360 standard and 80 bonus levels are aimed at strengthening your perception skills, with increasing intensity and increasingly harder obstacles. Play against friends online in the endless mode, and see who achieves the highest score.  <br/>The task is simple. Shoot colored balls into the rotating wheel. Prepare yourself for color combinations, changes in rotation, and other changes in the gameplay that gradually emerge. Timing and perception are key, so be careful as you will need to pay attention to the variety of colors and not hit the other balls. <br/><br/>Features<br/>- dozens of levels<br/>- endless mode<br/>- simple and addictive gameplay<br/>- minimalist and transparent graphics<br/>- support charts<br/><br/>Do you want more games for absolutely free? Check the catalog of games from the Slovak company Inlogic Games and download a whole bunch of jumping, logic, and sports, but mostly fun and addictive games. Whether you want to play online (via Wi-Fi) or offline, games from Inlogic Games will help you end your boredom, fill up a free moment, and give you addictive gameplay on your phone or tablet, and all for free!", "metacritic": null, "released": "2016-07-11", "tba": false, "updated": "2019-10-22T14:38:06", "background_image": "https://media.rawg.io/media/screenshots/f21/f21b92dde04ffcf9db527cf10d0f6832_AiPLw6V.jpg", "website": "http://www.inlogic.sk/services.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Inlogic Software"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Inlogic software s.r.o"], "esrb_rating": null}