{"id": 316097, "slug": "monster-tamer-hd", "name": "Monster Tamer HD", "name_original": "Monster Tamer HD", "description": "Chaos spreads over the earth. Savage monsters run wild. A once peaceful village collapses under the turmoil. All hope is lost… But wait…a brave young monster tamer survives. Those he cannot tame, he must destroy. He is a monster's worst enemy, and the world's only hope... Let the adventure begin! <br/><br/>Control the tamer through mystical zones and face off with many monsters in battle adventures.During battle, monsters you don’t slaughter can be captured to become the tamer’s personal attack force. Capture as many types of monsters as possible for a complete collection! <br/><br/>Tame,breed,raise,or exterminate monsters. You decide. Don't miss this realtime battle strategy game <br/><br/>Features: <br/>• Almost 50 previously unseen monsters to capture or kill. You decide! <br/>• Bring captured monsters back to the ranch for taming and training. Then bring them back into battle with the Tamer! <br/>• Collect flesh and bones of slain monsters to feed your captured monsters. <br/>• Each unique monster has different different skills. Select up to 3 monsters to accompany you into battle. <br/>• Many unique battle zones guarantee you a new adventure each time. <br/>• Each set of battle zones is protected by its own giant monster boss. <br/>• Richly detailed scrolling environments for immersive battle and game play. <br/>• Supports Bluetooth and Game Center connections methods for creating powerful monster breeds and friendship badges. <br/>• Spectacular graphics bring your retina display to life!<br/><br/>Game Video: http://goo.gl/OiPQ3", "metacritic": null, "released": "2012-03-22", "tba": false, "updated": "2019-10-22T14:38:08", "background_image": "https://media.rawg.io/media/screenshots/899/8990d774809ac3bcbad2c66a9dc8e6cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crazy Carpenter"], "genres": ["Action", "Strategy"], "publishers": ["Hsieh Jason"], "esrb_rating": "Everyone 10+"}