{"id": 316081, "slug": "operation-firestorm", "name": "Operation FireStorm", "name_original": "Operation FireStorm", "description": "Operation FireStorm is a fast paced action, level based, 3D game in which the objective of the player would be to rescue the imprisoned squad members, inside the enemy territory and Defeat  the commander of the enemy.<br/><br/>The Squad sent for operation in the hostile area gets captured and imprisoned by the hostiles , in order to retrieve the soldiers Operation FireStorm is initiated .As per the instructions of  Operation FireStorm, A Humvee (Military Armoured Hummer)  equipped with HMG and Mounted RPG is sent to the Hostile area to rescue the soldiers and Evacuate them on to the Chopper and the Evac. Point And further to End the Mission That was to be Accomplished by the rescued Squad.<br/><br/>Gameplay<br/>- Phase 1: Humvee is the Dropped into the Hostile area via transport Helicopter. After that the Player have to Control the Humvee and take it to the various prisons in the field to rescue the Soldiers by destroying the walls of the prison. In the way the player have to deal with the enemy characters (Soldiers , Tanks ,Turrets, Choppers ,Boats and planes). <br/><br/>- Phase 2: After rescuing the Soldiers the Humvee must taken to the Evacuation Point where the ally Chopper is waiting . <br/><br/>- Phase 3:After the evacuation of the soldiers ,the player must complete the mission which the rescued squad left undone.This Phase is the Boss Fight and varies from Level to Level.<br/><br/>PowerUps<br/>\t Support Class Soldier : On rescuing a Support Class Soldier , the Humvee gains extra FirePower Allowing it to Launch RPG on place of default Grenades. The number of Support Class stacks up to 3 . The more Pickups the more Area of Effect.<br/> <br/>Engineer Class Soldier : On rescuing a Engineer Class Soldier , The Humvee is repaired<br/><br/>PlayerControl<br/>\tOn The Humvee can be controlled via Virtual joystick on the bottom left corner on  device screen and 2 fire buttons ,Primary(Heavy Machine Gun)  and  Secondary (Grenade Launcher /RPG) Fire.", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-10-22T14:38:08", "background_image": "https://media.rawg.io/media/screenshots/2c4/2c41ee3e5eb866c054b425ee54addf9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Seasia Infotech"], "genres": ["Action"], "publishers": ["Seasia Infotech Pvt"], "esrb_rating": null}