{"id": 316069, "slug": "jackies-eco-park-match-3-game", "name": "Jackie’s Eco Park Match 3 Game", "name_original": "Jackie’s Eco Park Match 3 Game", "description": "Let's change the world for the better!<br/>We are very happy to present a new match 3 game with an ecological perspective: “Jackie’s Eco Park”. Build your own wonderful ECO Park!<br/><br/>“Jackie’s Eco Park” - a colourful green puzzle game for children and adults. Enjoy hundreds of interesting and challenging levels, solve puzzles and rescue animals.<br/>Collect juicy fruits three in a row, blow up bonuses and complete tasks. Earn coins for completing levels and use them to buy decorations for your parks. <br/>Decorate parks to your liking and populate them with animals together with Jackie. Help the animals find a new home!<br/><br/>The game is released with the support of the World Wildlife Fund (WWF). Playing the game, you are making our planet better!<br/><br/>Have you ever wanted to change this world for the better? <br/>Take on the challenge, save the world’s ecology and make the abandoned lands blossom again!<br/><br/>Game features:<br/>- many unique and dynamic match-3 levels<br/>- juicy explosive bonuses!<br/>- plant trees and flowers, make the planet green and cozy again<br/>- hundreds of Eco decorations for parks<br/>- create new green homes for the animals you save<br/><br/>The bright green world of Jackie’s Eco Park, populated with interesting characters, will not leave anyone indifferent!<br/><br/>Send questions, comments and suggestions to support@ninjapublishing.com", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-10-22T14:38:07", "background_image": "https://media.rawg.io/media/screenshots/643/6433d3a22754c2e0b09cae480ecc3fdb.jpg", "website": "https://www.facebook.com/ninjapublishing/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ninja Publishing"], "genres": ["Simulation", "Puzzle"], "publishers": ["Qmobi"], "esrb_rating": "Everyone 10+"}