{"id": 316061, "slug": "dead-orbit", "name": "Dead Orbit", "name_original": "Dead Orbit", "description": "New shoot 'em up classic arcade shooter located in deep and dark space. Defeat the evil sky forces!<br/>Hop into the spaceship and fly through a chaotic barrage of meteorites, bullets and sky forces! Upgrade your space fighter and put an end to the evil Kraathu Empire. Why? Because only you can restore peace in the galaxy! Shoot 'em up!<br/><br/>SHOOT AND EVADE TO SURVIVE<br/>Take your space fighter to the battlefield armed with an arsenal of cannons and missiles. Taking enough ammo to bring punishment to your enemy. Use your agility to fly through deadly enemy territory in this explosive 3D dark space shooter action arcade game.<br/><br/><br/>UPGRADE TO GET STRONGER<br/>Foes are getting stronger in each stage, so in order to blast 'em from each sector of the galaxy you need to upgrade your arsenal of weapons and defences. To protect yourself against their deadly projectiles the hangar is full of upgrades for your vessel of ultimate destruction.<br/><br/>REACH THE STARS<br/>Fly your spaceship through the cosmos and galactic hexagon cities where enemy aviators and skyrockets await. Game on! Use your sky force and reloaded weapons to defeat the enemy since 2014!<br/><br/>There are many scrolling shooters but none of them is like Dead Orbit. This stunning shoot ‘em up game combines the classic arcade elements with the new possibilities offered by current technology. The new installment just came out in a spectacular dark style. <br/><br/>FEATURES<br/>- intensive arcade like arcade shoot 'em up gameplay<br/>- vast variety of levels await<br/>- extreme boss battles<br/>- upgrade your shields, guns, missiles, lasers and magnets<br/>- stunning game visuals and skins<br/>- accessible to casual gamers, as well as die-hard shooter addicts<br/>- incredible electronic soundtrack", "metacritic": null, "released": "2017-03-13", "tba": false, "updated": "2019-10-22T14:38:07", "background_image": "https://media.rawg.io/media/screenshots/20b/20b7b6745d54abe4f719e34d83462919_EfcgdSF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Inlogic Software"], "genres": ["Action"], "publishers": ["Inlogic software s.r.o"], "esrb_rating": null}