{"id": 316131, "slug": "cows-leopards-by-bubbajoe", "name": "Cows & Leopards by BubbaJoe", "name_original": "Cows & Leopards by BubbaJoe", "description": "A herd of cows try to trap two leopards without getting gobbled up.  This is an ancient strategy/puzzle game from southeast Asia, primarily India and Sri Lanka.<br/><br/>How To Play<br/>----------------<br/>The game is played on a subset of a 9x9 grid, 49 spots in total, with 2 Leopards and 24 Cows.  The goal of the Leopards is to eat 8 Cows.  The goal of the Cows is to trap the Leopards so they can't move.  The game starts with 8 of the cows on the board, surrounding the central square.  The leopards always get the first move.  Hint: the central square is best.<br/><br/>Each player must bring in a piece each turn until all of their pieces have been played.  Only then can they move pieces around the board.<br/><br/>On the leopards turn, after both are in play, they can move to any adjacent square along a line or jump over and eat a cow.  On the cows turn, after all are in play, they may move to any adjacent square along a line.  Hint: you may need to sacrifice some cows in order to trap the leopards.<br/><br/>The leopards win if they eat 8 cows.  The cows win if the leopards can't move.<br/><br/>When it is your turn, your player icon will light up in green.  When it is your opponents turn, their icon will light up in red.<br/><br/>You can resign the current game and start a new game at any time by clicking on the restart button.<br/><br/>There is no limit to the number of moves in the game, so multi-player modes will require some sportsman-like conduct.<br/><br/>In single player mode, the difficulty level will automatically increase or decrease as you win or lose.  You can also manually adjust the difficulty level and then lock it into place to prevent it from automatically adjusting.<br/><br/><br/><br/>Notes and acknowledgements<br/>------------------------------<br/>Because the board size is so large and the pieces so small, this game works best on an iPad, but is usable on an iPod Touch or iPhone if you have small fingers and don't mind squinting.<br/><br/>I found a variety of different rules for this game during my research.  Some questions raised:<br/>Should the leopards be forced to jump when possible?<br/>Can the leopards do multiple jumps per turn?<br/>How many cows must be removed before the leopards win?<br/>What are the starting positions of the players?  In some, they all start off the board.<br/>What is the exact configuration of the board?<br/>Are you allowed to repeat the same position multiple times?<br/>I went with the set of rules that provided the most enjoyment during my testing.  I hope you approve.<br/>Unfortunately, I was unable to get the AI strong enough to play as the cows, so single player mode forces the human player to play as them.  This turns the game into more of a puzzle than a strategy game.  In theory, the cows should always win, but good luck with that!<br/><br/>Artwork:<br/>The playing pieces were created by my nephew Joey.<br/>The Single Player, Two Player, and Match buttons on the main screen were created by my nephew Eddie.<br/><br/>Sources of information:<br/>Books:<br/>Board and Table Games from Many Civilizations by R.C. Bell<br/>http://www.amazon.com/dp/0486238555<br/>Websites (hopefully these links stay valid):<br/>http://kreedaakaushalya.blogspot.com/2012/12/rules-to-play-cows-and-leopards.html<br/>http://www.boardgamegeek.com/boardgame/13755/cows-and-leopards<br/>http://www.1st-thatcham.org.uk/joomla_new/images/stories/scouts/resources/CowsAndLeopards.pdf<br/>http://www.arts.rpi.edu/public_html/lynchm2/Documents/HowToPlayCowsAndLeopards.htm<br/><br/>-------------------<br/><br/>This game is supported by iAds.  If you would prefer an ad-free experience, please search the App Store and purchase<br/>       Ancient Games by BubbaJoe<br/>which is a collection of all my board games.", "metacritic": null, "released": "2013-11-22", "tba": false, "updated": "2019-10-22T14:38:10", "background_image": "https://media.rawg.io/media/screenshots/301/301e4ebf45f4daea75d8c55d03ab26b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BubbaJoe"], "genres": ["Strategy", "Puzzle"], "publishers": ["David Rhoadarmer"], "esrb_rating": "Everyone 10+"}