{"id": 316179, "slug": "ultimate-horse-race-champion", "name": "Ultimate Horse Race Champion", "name_original": "Ultimate Horse Race Champion", "description": "saddle up your stud and take your pedigree racehorse for a gallop on the turf in the sport of king’s favorite equestrian sport! Play as a perfect jockey taking full control of your racing horse on the surface of the grand racecourse in this new released horse racing games of horse derby racing category. Ultimate Horse Race Champion is actually going to vim up your inner jockey to show your passion required in horse derby games.<br/>Ultimate Horse Race Champion ecstasy begins with picking out the horse with jockey that is suited for you. You have choice of  different looking horses to choose from selection menu. So go ahead and race your horse to the finish line and became a great horse racing champion. Compete your horse in different horse racing events. Pick the maximal energy booster to speed up your horse. Being a perfect jockey you need to manage the speed and stamina of your horse in order to win the race. Keep following the race track and remember not to lower your speed. Derby horse racing adventure is an exciting and challenging game particularly for youngsters who want to improve their horse racing skills and have the chance to enter a world full of horse racing events. So play something different from a simple horse simulator. Your horse is professionally trained and same is for you so let’s ride.<br/><br/><br/>Ultimate Horse Race Champion: Features:<br/><br/> Amazing 3D graphics and virtual 3D sound system<br/> Cool animations<br/> 3d Racing environment<br/> Interesting and challenging missions<br/> Intuitive tile or touch controls to steer your horse", "metacritic": null, "released": "2018-01-05", "tba": false, "updated": "2019-10-22T14:38:12", "background_image": "https://media.rawg.io/media/screenshots/aac/aacba61815360841efe00d61946bfac3_Ank7x4S.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yasir Majeed"], "genres": ["Racing", "Arcade"], "publishers": ["Yasir Majeed"], "esrb_rating": "Everyone 10+"}