{"id": 316208, "slug": "rickshaw-cargo-transport", "name": "Rickshaw Cargo Transport", "name_original": "Rickshaw Cargo Transport", "description": "This tuk tuk  rickshaw designed with the favorable and most beautiful designs. This is now your chance to drive not only one but two modern and decorative  rickshaw trolley or cargo rickshaw. This rickshaw simulator comes with smooth and steady multiple controls like; tilt controls and left-right controls to bring out the most favour out of the game for you. In a beautifully designed environment in which the game play is set you play your role as a  rickshaw driver. In the  rickshaw transporter you drive two types of rickshaw; one that transports people, second that transports cargo. The game play improves your reflexes and driving instincts.<br/>In the game you are to face multiple very exciting challenges. You have to pick the cargo from one place and drop it off to other places and collect your fare. The more money you make the more points you score. You also have to transport cargo from one city to another place or from one place to another. The missions seems pretty simple but aren’t. You have to constantly watch out for time clock. If the time runs out and counts down to zero your mission fails, if you don’t drop off locals and tourists on time your mission fails again. Drive faster but watch out for city traffic because if you bump into any car or building your life reduces and ultimately your mission fails. Thrilling enough? It’s time now to put your driving skills to test.<br/><br/><br/>Features :<br/><br/><br/>10 challenging levels<br/>Three Different Controls.<br/>Real Traffic.<br/>Brilliant driving experience of  Tuk Tuk rickshaw.<br/>Having Rainy Days And Nights.<br/>Auto Day and Night Modes.", "metacritic": null, "released": "2018-01-12", "tba": false, "updated": "2019-10-22T14:38:13", "background_image": "https://media.rawg.io/media/screenshots/252/252e3019dfc608c1738f924f57091595_TCo50Hh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yasir Majeed"], "genres": ["Adventure", "Simulation"], "publishers": ["Yasir Majeed"], "esrb_rating": "Everyone 10+"}