{"id": 316386, "slug": "knight-witch-demo-day-26", "name": "Knight & Witch - Demo Day 26", "name_original": "Knight & Witch - Demo Day 26", "description": "<p>It's been quite a while since the last demo, and for a good reason (or was it? I'll let you decide). The last demo, which I released back in September last year, was not good. Period. It was very buggy because I rushed it out with no playtesting, and most of all it didn't feel fun to play.</p>\n<p>I spent a lot of time trying to understand what didn't work and how to make it better and, while I know I'm not there yet, I think I might be getting close to something good.</p>\n<p>So please let me welcome you back in<strong> the world of th</strong><strong>e Knight and the Witch</strong>.</p>\n<p>Take control of the two characters and explore the grassy land, defeating enemies and solving simple puzzles (I had no time to plan more complex stuff, but that will change hopefully in the final game), taking advantage of each character's specific traits. </p>\n<ul><li>The Witch can use different types of magic to shoot down her enemies or use her warping ability to dodge attacks and traps completely. But be careful, every action consumes some mana, and you will need to recharge it when you run out, otherwise you'll become completely vulnerable!</li><li>The Knight can <em>finally</em> use his shield! This way you can protect yourself from incoming attacks. You can also roll on the ground to move faster.</li></ul>\n<p>I won't go on and on about all the things I added because most of them are backend stuff you won't notice. Anyway, I hope you have fun with this demo and look forward to the  full game.</p>\n<p>Of course, if you run into issues or bugs, be sure to let me know! I'm sure I forgot to test every possible scenario even in the small play area that is in this demo.</p>", "metacritic": null, "released": "2019-05-05", "tba": false, "updated": "2019-05-06T04:18:12", "background_image": "https://media.rawg.io/media/screenshots/a43/a4370c2ea678cc2a6fa8801aa940e389.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SquareDev"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}