{"id": 31641, "slug": "vip", "name": "VIP", "name_original": "VIP", "description": "<p>TVshow&#39;s followup with quicktime events, shooting, face puzzles.</p>\n<p>Vallery Irons is a small town girl who accidentally saves a major celebrity’s life and gets the attention of the media. A competent but unknown security firm then hires her in order to exploit her fame. She should be just a figure head for the firm, and has been told that she&#39;ll &quot;probably never even leave the office” while others do the dirty work, but somehow Vallery gets caught up in the wacky action as well.</p>\n<p>Characters:<br />\nVallery Irons<br />\n_ Vallery loves expensive clothes, shopping and celebrities. She has no bodyguard training at all and fights poorly. However, she is unusually lucky, which is played for laughs in V.I.P..</p>\n<p>Tasha Dexter<br />\n- Tasha is an ex-agent excels in tactical thinking and espionage operations. She is a skilful and serious bodyguard who finders herself at odds with the playful Vallery Irons from time to time.</p>\n<p>Nikki Franco<br />\n- Nikki is a hot headed weapons and explosives expert who really likes to blow stuff up. This street smart woman can also handle the fast cars around with unmatched precision.</p>\n<p>Kay Simmons<br />\n- Kay is a computer wizard and all-around geek. She takes care of communications and logistics for the </p>\n<p>Quick Williams<br />\n- Quick is a hand to hand combat expert and a cool guy. He also has experience in forensics work.</p>\n<p>Johnny Loh<br />\n- Johnny is an athletic martial arts expert who brings some zen-balance to the crew.</p>", "metacritic": null, "released": "2001-04-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b38f4702adda6b60827c5d2daa761da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "beaten": 2, "toplay": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation", "Game Boy Advance", "PlayStation 2"], "developers": ["Ubisoft Shanghai", "Kalisto Entertainment"], "genres": ["Arcade"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}