{"id": 316447, "slug": "lovesick-darlings-preview-demo-ver", "name": "LoveSick Darlings - Preview Demo Ver.", "name_original": "LoveSick Darlings - Preview Demo Ver.", "description": "<p>Hello! Welcome to the official page for <em>LoveSick Darlings</em>!<br/><br/><strong>What is LoveSick Darlings?</strong></p>\n<p><em>LoveSick Darlings</em> is a visual novel focused on creating and testing the limits of teenage relationships. It explores friendship, high school life, love, and everything in between. The game plays with tropes and expectations found in romance visual novels and dating sims by undercutting this often-romanticized period of everyone's lives with a realistic edge.</p>\n<p><em>Syd</em>, our protagonist, moved into town at the start of this year. He’s become best friends with a girl called <em>Maisy</em> who lives on the same street with him – and by extension, her friends too. Over time he has become a natural part of this diverse group of friends. The school year is growing closer to its end, and Syd’s friends are pressuring him into asking his crush out to the formal at the end of the year. Will he be able to do it? How will his friendships hold up around him as he makes these big decisions towards the end of this high school year? And what if someone in his own group of friends sees him as more than... <em>\"</em><em>just a friend\"</em>? It's up to <em>you</em> to make these hard decisions and deal with these situations as Syd to decide the fate of him and all of his friends.</p>\n<p><em>And that is where our story begins.</em></p>\n\n<p><strong>What do you do in the game?</strong></p>\n<p>Get immersed in the setting of Foster Hills High as you spend Syd's days hanging out with his friends at school and choose who you spend time with after school. Watch as everyone's daily lives and struggles play out and decide how Syd and his friends react to what is going around him. Gameplay features include free time events (inspired by the <em>Persona</em> and <em>Danganronpa</em> franchises), and a branching story with dozens of paths and outcomes that flow seamlessly between each other. Every choice you make and everything you say as Syd matters. Explore the bonds Syd has with the many \"group conversations\" he and his friends engage with, then put your social skills and decision making to the test in in-game events known as \"Social Events\" where you spend time with the cast as a group and get to know them better. Build relationships with the main three girls by spending \"free time\" with who you like best! But watch out, as how and who you spend your time with can have all kinds of consequences...<br/>But most of all, have fun and enjoy building bonds with the characters in a natural and free way.</p>\n\n<p><strong>How do I play?</strong></p>\n<p>After a lot of hard work by myself and several others I hired, I have readied a \"demo\" or \"preview\" version of the game for the public to enjoy! One run is about 6 hours long depending on reading speed. To see all the possibilities and explore every choice is at least an extra three hours. So, there's a lot of content to start with!</p>\n<p>I would say more about the content of the game, but I feel like the less you know, the better your experience will be. I recommend just diving in and playing it now! The rest of this page is mostly just supplementary information for those interested in the background of this project.</p>\n<p>Click the download button above or at the bottom of the page to play now!</p>\n<p><strong>DISCLAIMERS:</strong><br/>- Not all art assets have been finalized. There are occasionally place-holder images and sprites found in the game.  This can occasionally mean blank backgrounds and silhouettes for sprites of side characters. I apologize for this and hope you enjoy the game despite this.</p>\n<p>- The game intended for mature audiences. There are <strong>no</strong> \"adult\" (18+) scenes in the game, but the game does feature: sexual references, adult themes, and coarse language. All things which you'd typically find in any High School friend-group.<br/></p>\n<p>- Supported systems: Windows, Mac, Linux.</p>\n<p>- If you encounter any bugs or issues at all, let me know ASAP. Contact me over Twitter (@LoveSickDarling) or via itch.io so I can fix them quickly :)</p>\n<p><strong>Trigger warnings (light spoilers for the in-game story):</strong><br/>- A main character is shown to be in an emotionally manipulative/abusive relationship with someone else. There is no physical violence whatsoever. Just emotional manipulation and damage.<br/></p>\n<p>- A different main character is shown to have an abusive parent with hoarding tendencies. There is no physical violence.</p>\n<p>- Light mentions and themes of self-worth and mental health. There is no violence.</p>\n\n<p><strong>How much does this cost?</strong></p>\n<p>This demo is <strong>absolutely 100% free. No cost or payment needed</strong>. Play it. Give it a whirl, have fun, and give me feedback if you'd like!</p>\n<p>If you are so generous as to support this game and its future, donations are welcome. But there is no obligation. 100% of all funds I receive will go to funding this project's future. I cannot thank you enough if you do decide to financially support this project in any way.</p>\n\n<p><strong>Why is this just a \"demo/preview version\"?</strong></p>\n<p><em>LoveSick Darlings</em> is the first game I have ever made. It's been a huge learning process, and frankly, I just want to get what I have so far of the game out there. I'm a creative at heart and just want people to enjoy my content. Let me know what you think of the game, I'd love to hear feedback! (Message me on here, or @LoveSickDarling on Twitter.)</p>\n<p>This demo represents about one quarter of the content in one complete \"run\" of the game. However, once multiple endings and paths are factored in - this demo is more like an eighth of the planned total content that will be found in the full game across multiple</p>\n\n<p><strong>Character Biographies</strong></p>\n<p>Sydney \"Syd\" Ivankovic </p>\n<ul><li>Hair Colour: Light Golden Brown </li><li>Eye Colour: Hazel </li><li>Birthday: June 8th</li><li>Zodiac: Gemini </li><li>Blood Type: A </li><li>Favourite Colour: Green </li><li>Favourite Food: Cheesecake </li><li>Aspires to be: Unknown.</li></ul>\n<p>Syd is a kind mild-mannered boy. He moved into town at the start of the year after some unfortunate circumstances. He's a bit of a dork, and his hobbies include playing video games and watching \"ViewTube\" like most kids his age. He wouldn't consider himself a weaboo or otaku, but he is a casual anime-watcher.</p>\n<p>He is kind but oblivious and often under-estimates how the things he says can affect those around him. He over-thinks everything and often loses himself in his thoughts. He often thinks sarcastic and crude remarks but doesn't say them out-loud. Most of the time, at least. He is also a nervous and anxious person who is prone to being scared. This constant anxiety is what holds him back the most in confessing his feelings for the girl he loves – and it's what his friends are pushing him to do. </p>\n\n<p>Maisy Anderson</p>\n\n<ul><li>Hair Colour: Red (real hair colour? It's a secret she won't tell anyone) </li><li>Eye Colour: Blue </li><li>Birthday: November 9th</li><li>Zodiac: Scorpio </li><li>Blood Type: O </li><li>Favourite Colour: Red </li><li>Favourite Food: Chicken nuggets </li><li>Aspires to be: Nothing in particular</li></ul>\n<p>Maisy is Syd's best friend. When he moved into town at the start of the year, the two of them met by chance because they live on the same street. With Maisy's outgoing and forceful personality, they became fast friends and became invaluable in each other's lives. Maisy is loud, active, and curious. No social barrier or expectation can or will ever stop her from saying what she wants to say. She has recently gotten her first boyfriend (mind you, she did have a girlfriend before she met Syd), and Syd is starting to feel a little conflicted about Maisy's recent relationship that got very serious very quickly... </p>\n<p>Maisy is also the one who pushes Syd out of his comfort zone the most, and bugs him about asking his crush out to the school dance at the end of the year. She's impulsive and unpredictable, so she doesn't have any particular hobbies – she just does whatever she feels like, and likes talking about whatever comes to mind. Despite how crude and forceful she can be, she has a more vulnerable side when it comes to her sick little brother.</p>\n\n<p>Jayda Silvestri <br/></p>\n\n<ul><li>Hair Colour: Pink (Real colour: dark brown) </li><li>Eye Colour: Brown.</li><li>Birthday: January 10th</li><li>Zodiac: Capricorn </li><li>Blood Type: A </li><li>Favourite Colour: Orange </li><li>Favourite Food: Sushi </li><li>Aspires to be: Artist.</li></ul>\n<p>Jayda is Maisy's childhood best friend. Syd got to know her through Maisy, and it wasn't long before Jayda feel head-over-heels for Syd. She's a complete dork and weaboo. She loves anime, video games, and art – and will happily gush about any of these topics to Syd any time. She's nice sweet, and honest to a fault. But that makes her more endearing to her friends. She also has trouble standing up for herself and believing in herself at times. </p>\n<p>Jayda is normally shy and reclusive, but has gotten comfortable with Syd and her friends to the point that she is mostly her unguarded and loud passionate self. She spends her free time drawing and indulging her inner weeb.  </p>\n\n<p>Stephanie \"Steph\" Azoulai </p>\n\n<ul><li>Hair Colour: Chestnut Brown </li><li>Eye Colour: Brown</li><li>Birthday: June 8th</li><li>Zodiac: Gemini </li><li>Blood Type: B </li><li>Favourite Colour: Blue </li><li>Favourite Food: Banana bread </li><li>Aspires to be: Musician </li></ul>\n<p> Steph is the apple of Syd's eye. She's the girl Syd is trying to ask out. Steph is a quiet and gentle girl with an aura of coolness that can't be pierced. However, this coolness does sometimes lead her to be a bit cold or aloof at times. Her personal life is mostly a mystery to Syd and his friends, but the little glimpses Syd sometimes gets of her thoughts and opinions intrigue him every time they speak. </p>\n<p>She is often found with a book in her hands and reading away at whatever books she can get a hold of. When she's not reading, she's practicing on some variety of musical instrument for her classes. She is quiet, but she isn't reclusive. She enjoys the company of others, even if her quiet nature sometimes makes it seem like she doesn't. </p>\n\n<p><strong>What makes <em>LoveSick Darlings</em> different?</strong></p>\n<p>This game is based off the single premise of my frustrations with how romance is often handled in dating sims, RPGs, and games as a whole. The question I’ve always had in dating sims and games with “romance” options and similar character-based interactive experiences is why none of the other potential romance partners or wider cast ever acknowledge or comment on the player’s relationships at all (looking at you <em>Persona</em>). I may just be playing the wrong games, but the only two games to meaningfully have another character reference my character’s romantic partner were <em>The Witcher 3</em> and <em>Dragon Age Origins</em>.  Neither of which are dating sims or even visual novels for that matter.</p>\n<p>Which is why I thought <em>\"what if a visual novel did acknowledge those kinds of things?\"</em> Like, maybe if you start being too nice to one girl - the other gets jealous. Or one gets more and more desperate for your attention if you spend too much time with other girls/characters. And thus, <em>LoveSick Darlings</em> was born.</p>\n<p>The biggest interactive element in <em>LoveSick Darlings</em> is what each of the girls think of your relationships with the other girls.  This is also what I am most proud of in the game, and I hope you feel like your experience was tailored to the choices and decisions you made in-game.</p>\n<p>This might sound like wish fulfillment, but I am trying to emulate high school as best as one can. The forming of romantic relationships within these friend groups around the age of 16 and the ensuing gossip or meddling is a common high school experience - this \"group dynamic\" is what I'm trying my best to realistically recreate in game format.</p>\n<p>This game has a very targeted focus on realistic character relationships and growth in a way that not many visual novels I've encountered have tried. To have your relationship and reputation status with each character be recognized by all of the cast - and to which they react accordingly - is the defining principle that sets <em>LoveSick Darlings</em> apart from other romance visual novels set in high schools. These games hardly ever recognize how powerful a \"group dynamic\" can be in swaying and defining relationships.</p>\n\n<p><strong>Who made this?</strong><br/></p>\n<p>I, Dimitri Adoniou, may be the writer and project lead but this game was made possible with the art and music work I commissioned from distinguished artists like Ippers and PhiPhi  - and original music from Tim Reichert. The list of people who contributed goes on, too. Check them out below. But about me? I am a graduate from the University of Canberra who studied writing with a focus on screenwriting and film in a far-off magical made-up land called Australia. I usually do work in writing articles, film scripts, and trying to get my TV pilots off the ground.<em> LoveSick Darling</em>s is my major creative project at the moment, and has my full attention dedicated towards it. It is also my first game project or visual novel I have ever published.</p>\n\n<p><strong>What is the future of <em>LoveSick Darlings</em>?</strong><br/></p>\n<p>So, now that you've seen all this about the game, you might be wondering:<br/><em>\"If this is a demo, where is the full game?\"</em></p>\n<p>Simply put: the full game is not ready yet. Even a project as seemingly simple as an independently made visual novel needs a lot of time and resources to come together. The only dedicated \"full-time\" member of the \"team\" here at <em>LoveSick Darlings</em> is me. The artists and other creatives I hired to work for me are doing so on a freelance basis - while pursuing their own amazing projects and goals. It's pretty much just me at the center of it all, getting all these moving parts to fit.<br/>The script and the path for the game is mostly outlined in my notes (but admittedly not finalized), and as you will be able to tell when playing the demo, there are still art assets like sprites and backgrounds that still need to be made for the full release.</p>\n<p>But I do have a plan. This plan is to launch a Kickstarter sometime in the next few weeks, which I will add here and to all of the <em>LoveSick Darlings</em> sites and accounts. I can't say what the price is yet, but it will be quite a modest Kickstarter campaign. This is my first game project I've ever worked on, so I'm trying to keep expectations of the game and of a crowdfunding campaign as realistic as possible. This game is not looking to make a huge profit at all. My priorities are: getting money to the talented artists and composer who have worked on this game for the work I plan on getting them to do, to pay fees and licensing to get the game out there with a full release on platforms like Steam, then to maybe give myself a bare minimum wage with whatever is left. Any excess will go towards improving the game an adding more and more features and paying people to do more work for it - that is if I am fortunate enough to receive so much support. Even the bare minimum is fine because, while I have put a lot of love and care into this game, above all else I just want to make this game a reality and share it with the world.</p>\n\n<p><strong>Conclusion</strong></p>\n<p>This is probably a page with too much detail at this stage, but I felt like I owed it to everyone who gave their time to play and give my game a go to explain as much as I could about the project's past, present, and future. I hope you all stay for the ride and see where this project takes us. Follow the official @LoveSickDarling account on Twitter for all updates and news regarding the project, follow the project here on itch.io, and like it on Facebook too (just type <em>LoveSick Darlings</em> - you'll find it). Any and all support is highly appreciated!<br/><br/>Thank you so much for your time and for checking out my game! It really means the world to me :)<br/><br/><br/><br/><br/><br/><br/><br/><strong>Credits:</strong></p>\n<p>These are the people and organizations I have to thank for helping me bring this demo to life.</p>\n<p><strong>Original Character Designer &amp; Sprite Artist:</strong><br/>Ippers (@t_ippers)</p>\n<p><strong>CG Artist:</strong><br/>Phiphi Au Thon</p>\n<p><strong>Title/Icon Design, and artist of \"The Girl and the Beast\":</strong><br/>Madeleine Cooke</p>\n<p><strong>Promotional Artist:</strong><br/>Tommy (@the_kingduke)</p>\n<p><strong>Chibi Character Artist:</strong><br/>Santa (@SantanaelChan)</p>\n<p><strong>Original Main Theme Composer &amp; Additional Music:</strong><br/>Tim Reichert (@FulminisIctus)</p>\n<p><strong>Background Music provided by:</strong><br/>TAM Music Factory</p>\n<p><strong>Photography:</strong><br/>Nicholas Zeylemaker</p>\n<p><strong>Background Locations provided by:</strong><br/>Dickson College &amp; Canberra Technology Park</p>\n<p><strong>Additional Background Photos:</strong><br/>Unsplash</p>", "metacritic": null, "released": "2019-05-04", "tba": false, "updated": "2019-05-06T04:34:58", "background_image": "https://media.rawg.io/media/screenshots/1da/1da182f82da80e8d07cf3742ffac9978.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Dimitri"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}