{"id": 316559, "slug": "cats-with-stats", "name": "Cats With Stats", "name_original": "Cats With Stats", "description": "<p>Cats With Stats tech demo / proof of concept by Mimic Quest</p>\n<p>Use Up/Down or W/S to select Up and Down<br/>Hit Space or Mouse1 to Confirm<br/>Hit Backspace or Mouse2 to Cancel</p>\n<p>Goal: Survive as long as you can! Win by defeating all enemies. </p>\n<p>If all your cats' HP is reduced to zero, you lose!</p>\n<p>When the green bar under the cat's names fills they may act, indicated by the pointer to the right of their name.<br/>To act: press confirm.</p>\n<p>Actions:</p>\n<p>Attack: Attacks an enemy.<br/>Defend: Boosts defense temporarily.<br/>Skill: Offers a skill selection. See details below.<br/>Spell: Not available (yet.)<br/>Item: Also not available (yet.)</p>\n<p>Skills: - Burglars can \"Steal\" from a target. Has no real effect (yet!)<br/>- Brawlers have an accurate magical attack \"South Paw\" which you may target.<br/>- Chieftains have a \"Yowl\" that lowers all enemies' attack strength.<br/>- Fisherman fish. The size of the fish (while not animated... yet) determines the strength of the HP heal. The target is selected before the fish is caught.<br/>- Kingpins draw cards. The better the card, the bigger the heal! Its target is also selected before the draw.<br/>- Ronins cast \"Shadow\" which temporarily boost their evasion. This action must be confirmed by targeting the Ronin.</p>\n<p>The music in the game isn't looping properly just yet. If it bothers you there's an option to turn off the music at the title screen, as well as the SFX.</p>\n<p>For other questions or concerns - or if you'd like to join my discord for updates - contact me on discord: Mimic#2731</p>", "metacritic": null, "released": "2019-05-04", "tba": false, "updated": "2019-05-06T05:03:58", "background_image": "https://media.rawg.io/media/screenshots/7d0/7d0b32eb4b8581ad0cc7542a4b05e18e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["MimicDev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}