{"id": 316690, "slug": "spirit-cavern", "name": "Spirit Cavern", "name_original": "Spirit Cavern", "description": "<p>This game was created as part of Professor Heagney's character design course to show off a character. </p>\n<p>This character was initially created as part of a journal entry for class, where we were asked to find a character out in the world. Using the salt lamp I keep near my bed, I envisioned a small spirit of some kind with a large energy aura surrounding it. This eventually evolved into Hecate, named after a character I've used in rpgs before. When designing the sprites, I chose to make the idle/walk a sort of pulsing shield to hearken back to the original idea of the character having an aura around her. The jump shifts this aura into a pair of flapping wings, indicating that the aura can be used in a variety of ways to help the character navigate her world. Additionally, to avoid stereotypes of female characters, Hecate does not have any anatomy in any way reminiscent of a humanoid, thus preventing sexualization as many female characters often are.</p>\n<p>The environment initially was going to be a forest of some kind where spirits roamed. However, I soon settled instead on a cavern thanks to the image, which struck me as much more fitting for the character to wander through. The blue in the environment spoke to a sense of awe and mystery, which definitely made sense for a world of spirits.</p>\n<p>Image for background found here: https://www.theverge.com/2015/7/2/8876985/new-zealand-glow-worms-michael-joseph</p>", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-05-06T05:38:21", "background_image": "https://media.rawg.io/media/screenshots/229/22927ac9161c0ca5af9731c2d3a4da30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Recovery15"], "genres": [], "publishers": [], "esrb_rating": null}