{"id": 316687, "slug": "storms-sketchbook-digital-character", "name": "Storm's Sketchbook (Digital Character)", "name_original": "Storm's Sketchbook (Digital Character)", "description": "<p>You are Isole, a doodle I made a few weeks back referencing an ice tray. As you progress, you will see the developments I have made as an artist, and a character designer. For the music, I wanted to reflect what I generally listen to when I draw, so I included some Jazz music to ease the soul. My character has a cartoonish jump, as I like the idea of her being this stick/ice girl with an almost comic book sounding effect. To reference readings, I wanted there to be direct communication with the player and the environment to invoke a feeling that they have drawn what is being presented, or experience an immersive feeling of some kind.  To do that, I wanted the jump of the character to make a noise at every player command. With ambient sound, as I stated above, I wanted to immerse the player in an environment that reflects a similar experience with drawing that I feel. As they see the development of my art, the player should feel relaxed and get into the mood to draw. </p>\n<p>With regards to character, each animation has a specific purpose. Originally, there were water drops emitting from her body to give her character some physical dimension, yet it had to be scrapped due to sprite issues. Her idle shows her ghost-like nature with her limbs spacing in and out, the walk animation shows a certain humorous side to the character, as if they are shuffling about, the jump animation reveals that the character has to shrink her body into snow in order to preform an ability, and finally, the punch, illustrates the violent side of the character with a spiky (week 6 shapes) hand club that stems from her hand. </p>\n<p>Isole relates to her environment because like everything else (except the clouds), she was created by me. She is one of the best characters I created in my opinion, and that is why she has life. Even the notebook background has a purpose in creating the image of a doodle, yet manages to be three dimensional despite not being hyper realistic. In regards to color, The only object I wanted colored was the background. Everything else needed to reflect doodles/basic drawings to convey that I am not a professional (yet), but I can still be proud of my work. </p><p>*Note: For some reason my string text did not work on the HTML version of the game, so press q to punch, space to jump, wasd to move. </p>\n<p>To end, I always end my drawing time by looking at memes, so to win this game, you must find the hidden meme!  I hope you enjoy learning about me and Isole! </p>", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-05-06T05:37:22", "background_image": "https://media.rawg.io/media/screenshots/243/243060aa50e3deab9235c77b397615bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["skaffenb"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}