{"id": 316651, "slug": "astrominer-demo", "name": "Astrominer (Demo)", "name_original": "Astrominer (Demo)", "description": "<p>Explore a fractured world and rescue the migs that once protected it. Craft or purchase weapons and tools to help in your journey to defeat the evil blomsters and free all of the migs!</p>\n<strong>\"A crafting system designed for those who don't like crafting.</strong>\"\r\n<p>Don't like spending time gathering every single resources in the game? No problem! You can unlock all recipes and purchase any item in the crafting station using the money you earn from trading in minerals you've collected (some resource gathering still required).</p>\n<p><strong>Features</strong></p>\n<ul><li>Gather resources to craft weapons and tools.</li><li>Mine minerals to trade for money.</li><li>Process dirt and smelt minerals for a better monetary reward.</li><li>Find and rescue the migs who will become your companions.</li><li>Become one with your mig to solve puzzles, fight enemies, and reach otherwise unreachable areas.</li><li>Explore 4 unique biomes with their own uniquely generated mines.</li><li>Hats!</li><li>Gamepad and Keyboard support (<strong>gamepad recommended</strong>)</li></ul>\n<p>This free demo contains <strong>over an hour of gameplay</strong>. Because this is a demo, there are still pieces of the game missing and music is entirely placeholder. Right now there are <strong>4 biomes, 1 boss, and 7 mig puzzles in the game</strong>. The goal is to expand on each of those numbers greatly for the final version of the game.</p>\n\n<p><strong>Joining the  Puddledock Patreon is the best way to support the development of Astrominer and ensure you have a voice in how the game continues to evolve as we work on expanding the full title. </strong></p>\n<p>Devlogs are posted regularly on Patreon and are public to all--no donations required.</p>\n<p><strong>A Rough Dev Roadmap</strong></p>\n<ul><li>Artifact Dungeons - non-mine dungeons with enemies and traps in which the player can find rare loot</li><li>More craftable clothing items/skins for the player beyond just hats</li><li>More variety of mig puzzles</li><li>More biomes (ghost, zombie, etc.)</li><li>More boss fights - one per biome at least</li><li>More potions and buff effects to apply to items</li><li>More migs</li><li>Mig customization</li></ul>\n\n\n\n<p><strong>Have a suggestion to improve Astrominer? Found a bug? Just want to chat? </strong><strong>Join the Puddledock Discord channel </strong>to leave your feedback and stay connected with all things Astrominer!</p>\n<p>You can also leave feedback in the discussion boards below. The choice is yours!</p>", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-05-06T05:25:52", "background_image": "https://media.rawg.io/media/screenshots/888/8889bc5dc8d3a3d94cee4b00875e0f83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["puddledockgames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}