{"id": 316847, "slug": "project-genesis", "name": "Project Genesis", "name_original": "Project Genesis", "description": "<p>Millennia ago, the ancient inhabitants of our tiny planet reached beyond Sol and to the stars only to lose this gift to an unforeseen cataclysm. An unlikely discovery in the 21st century re-introduced humankind to this lost technology, enabling the transmission of perception to both spacecraft and synthetic humanoids. As a result, unbounded colonial expansion followed.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;Project Genesis is a competitive FPS and 3rd person space combat shooter where teams battle each other for prestige, tech, and dominion! Things happen quickly in Project Genesis. You might be launching a hail of missiles into a doomed craft before breaching and boarding a capital ship you’re intent on commandeering. One minute you&#39;re setting an attack ship on fire off the shoulder of Enceladus II, the next you&#39;re rattling through the void in a breech pod and tearing through an enemy bulkhead. Project Genesis aims to hit some of the most dramatic and iconic moments of space opera action in a visceral and evocative way.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;Space flight is played in third-person; steer the ship and freely aim the camera and weapons at targets. The flight model is simple and designed to get you jumping into the fray quickly without complicated flight controls. Weapons are easy to use, targeting and HUD intuitive and clear.&lt;br/&gt;&lt;br/&gt;The First Person Shooter experience is following the standard control scheme common in most FPS combat games. After acquiring a breach point, blast off in your assault pod, tear into the targeted vessel and prepare for the fight of your life in a thrilling first-person combat space. Avatar combat is close quarters, fluid and familiar&lt;br/&gt;&lt;br/&gt;The emphasis in Project Genesis is seamlessly merging these two modes without having to adjust to new control configurations and viewing perspectives.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;Across 3rd person space combat, and FPS modes, the controls use a common paradigm:&lt;br/&gt;&lt;br/&gt;- HP—Hull or Health, the primary damage resource&lt;br/&gt;- Energy (E)—the consumable resource for shields, weapons, and abilities&lt;br/&gt;- Two main weapons—a primary and a secondary&lt;br/&gt;- One passive and two active abilities&lt;br/&gt;&lt;br/&gt;Spacecraft and avatar designs set up familiar relationships—tank, support, dps, etc.—but synergies and solo viability are always in mind. Boost and sprint, shields, recharge and cell capacities, weapon loadouts, countermeasures, abilities, utilities/throwables create a lot of levers. The rest is dominating with weaponized support craft in space.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;The current approach is best-of three-round matches, where later rounds depend on earlier outcomes. To win a round, complete your team objective before the clock runs out. Easy. On the way, take opportunities to gain an advantage for your team, now or in the next round. If neither team gets the upper hand in the first two rounds, a final round is played, wrapping up the match in dramatic fashion.&lt;br/&gt;&lt;br/&gt;Our community has been crucial to every step as we develop our core play and continues to be our focus as mode, mission and map designs progress. There&#39;s so much more fun to be had and we hope you’ll join in the process of getting there with us.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;A season in <em>Project Genesis</em> is structured around a bundle of story, stuff, and features, with a full competitive Circuit. Each season offers limited content to every player, and Battle Passes grant access to season-limited cosmetics and collectibles. In Season One, explore the Project Genesis universe where you&#39;ll battle as mercenaries and radicals and suck-up loyalists.&lt;br/&gt;&lt;br/&gt;Circuit play begins after the deployment and testing of a Season. Matches can be themed and flavored with the current season&#39;s narrative, while the mission particulars and round structure stays centered on well-tested, community approved formats.&lt;br/&gt;&lt;br/&gt;</p>", "metacritic": null, "released": null, "tba": true, "updated": "2019-08-23T12:11:00", "background_image": "https://media.rawg.io/media/screenshots/8b6/8b636de1c4b17d505ffe1e342ef97c3b.jpg", "website": "https://www.projectgenesis.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["8 CIRCUIT STUDIOS"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["8 CIRCUIT STUDIOS"], "esrb_rating": null}