{"id": 316878, "slug": "mobler", "name": "Mobler", "name_original": "Mobler", "description": "This year 2550 we celebrate the 300th birthday of the new earth. Earth has become a better place since we, as a furniture company, have overthrown the governments. We are proud to be the biggest furniture company in the universe. And we would like to thank all citizens of earth for your help accomplishing this!<br/><br/>Birdo, an alien birdlike species hired to deliver our furniture throughout the universe, had to make a crash landing on Uranus. As Birdo crashed, an emergency signal was received by us. We can assure everyone that we will not stop trying to bring Birdo home! We have sent out ships filled with furniture to help Birdo reach the evacuation ships 10km high in the sky.<br/><br/>Due to the crash landing Birdo cannot move on his own. But because we implanted a chip inside his brain, he can be controlled by a certain group of citizens! If you have what it takes, then join us and take control of Birdo. Help him move towards the evacuation spaceship and come home safe.<strong>Do you have what it takes?</strong>If so, then you can:<br/><br/><ul><li>Traverse your way through a huge amount of fast falling, deadly furniture.<br/></li><li>Reach the top of the online leaderboards. Reach impossible heights to get the highest score!</li></ul><br/>Inspired by the arcade best seller Tetris® and created by a team of NHTV students, Möbler gives the well-known old Tetris® formula a big twist, creating a dynamic platform like experience with an incredible amount of gameplay for everyone to enjoy.", "metacritic": null, "released": "2019-02-20", "tba": false, "updated": "2019-08-28T21:45:42", "background_image": "https://media.rawg.io/media/screenshots/d44/d442fc892e0db9c35ece9b9bee6888f2.jpg", "website": "https://moblergame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mobler", "Möbler Development Team"], "genres": ["Platformer"], "publishers": ["Möbler Development Team"], "esrb_rating": null}