{"id": 316823, "slug": "mario-kart-tour", "name": "Mario Kart Tour", "name_original": "Mario Kart Tour", "description": "<p>■Mario Kart takes a world tour!</p>\n<p>Mario and friends go global in this new Mario Kart as they race around courses inspired by real-world cities in addition to classic Mario Kart courses! These destinations will be featured in tours that rotate every two weeks! In addition to courses based on iconic locales, some of your favorite Mario Kart characters will get variations that incorporate the local flavor of cities featured in the game!</p>\n<p>■Endless Mario Kart fun at your fingertips!</p>\n<p>The Mario Kart series known and loved by many is ready to take the world by storm – one smart device at a time! With just one finger, you can steer and drift with ease, sling devastating items as you go for the gold in cups filled with new and classic Mario Kart courses.</p>\n<p>■Nab 1st place with items and Frenzy mode!</p>\n<p>In Mario Kart Tour you have access to an arsenal of powerful items that can mix things up on the racetrack! Turn up the heat by activating the new Frenzy mode, which gives an unlimited supply of a certain item and makes you invincible! Make the most of the ensuing chaos, as Frenzy mode only lasts a short time!</p>\n<p>■Collect drivers, karts, badges, and more!</p>\n<p>Earn Grand Stars by racing or fire off the featured pipe to receive more drivers, karts, and gliders! You can also proudly display badges, earned by completing certain challenges, next to your in-game name!</p>\n<p>■Bonus challenge courses put a twist on traditional races!</p>\n<p>In certain races, 1st place isn&#39;t always the goal. With names like &quot;Vs. Mega Bowser&quot; and &quot;Goomba Takedown,&quot; these bonus challenge courses demand a different approach to gameplay and strategy!</p>\n<p>■Race to increase your online rank!</p>\n<p>Boost with the best of &#39;em! Your high scores will determine how you compare to other players all over the world. Keep practicing and trying out different combinations of drivers, karts, and gliders to increase your score and rise to the top!</p>", "metacritic": 59, "released": "2019-09-25", "tba": false, "updated": "2024-02-24T11:16:48", "background_image": "https://media.rawg.io/media/games/2d5/2d57e7ffa1e3af2fa34229bd1041461d.jpg", "website": "https://mariokarttour.com", "rating": 2.92, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 16, "beaten": 12, "toplay": 7, "dropped": 74, "playing": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 64, "suggestions_count": 111, "game_series_count": 10, "reviews_count": 65, "platforms": ["iOS", "Android"], "developers": ["Nintendo"], "genres": ["Action", "Racing", "Casual"], "publishers": ["Nintendo"], "esrb_rating": null}