{"id": 316882, "slug": "drone-strike-force", "name": "Drone Strike Force", "name_original": "Drone Strike Force", "description": "Drone Strike Force is challenging the standard online shooter with the introduction of the z (vertical) axis in a competitive, skill based environment. Use the Q, E and F keys along with your weapons to dominate your enemies, while ramping up your situational awareness and maneuverability skills to the 3rd Dimension!<br/><br/><br/>Choose among unique Drones to fly into combat! Each Drone can currently have one of three Operating Systems, each functioning similar to a class. As a player, you can progress through these Operating Systems to unlock new capabilities for the compatible Drones!<br/><br/><br/>Drone Strike Force is built for fast-paced aerial combat to showcase the raw power and speed of these cutting-edge machines. Fly and shoot at high velocity while using the environment and your drone’s agile capabilities to outmaneuver enemies and give your team the win.Easy to Learn, Difficult to MasterDrone Strike Force is a glimpse into the future of warfare, with standard controls that should feel intuitive coming from most action shooters.  The sky is the limit however as you seek to turn opposing Drones from all around to shrapnel. Explore the right mix of Drones, loadouts and tactics that work for you and your team to dominate your enemies.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:10:59", "background_image": "https://media.rawg.io/media/screenshots/073/073423ee3c976dfea3da04b877732673.jpg", "website": "https://www.dronestrikeforce.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 33}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 438, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NGD Studios", "Odisi Games", "Globant"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Odisi Games"], "esrb_rating": null}