{"id": 316869, "slug": "dead-monarchy", "name": "Dead Monarchy", "name_original": "Dead Monarchy", "description": "<strong>NOTE: Please be aware that Dead Monarchy is in a constant state of iteration and improvement. Currently there is only an autosave system. Autosaves will be deleted upon starting a new game or player defeat and there is no \"manual\" loading and saving. Autosaves are not guaranteed to work between major updates. Certain combat mechanics may also feel unfair, broken or too \"hardcore\". I'm only one guy and I can only test the game so much through public demos on IndieDB and internally. In order to get real feedback and exposure though, I need to involve the community as a whole and that's why I'm here now in Early Access. I've tried to be as detailed and transparent as possible, if you feel the game is not ready yet based on what I've mentioned below, it would probably be best to hold out and not buy the game yet. For those that do buy it to provide me with feedback and to help support ongoing development, you have my utmost gratitude. I won't sugarcoat things, not everything may be working as intended.</strong><br/><br/>Dead Monarchy is a turn-based, tactical RPG with roguelike elements, inspired by games such as Battle Brothers, XCOM and Jagged Alliance. Equip your warriors with historically inspired weapons and armor and attempt to survive in a dying world overrun by all manner of monsters.<br/><br/>Currently the game consists of two layers. The \"town\" layer where you manage the player base and the \"combat\" layer where you engage enemies in turn-based tactical combat. As it stands, the core gameplay loop is to go out on a mission, gather resources, then spend those resources on upgrading buildings which in turn provide a variety of bonuses to your warriors. As you continue to upgrade your town and go out on expeditions, time will pass and the enemy will grow stronger and then will eventually attack your town. Failing a base assault without being completely wiped out will result in your building upgrades being destroyed. <br/><br/>This weakens the player and makes it harder for the player to achieve victory. To win the game in its current Early Access state, you must defeat all 5 Monarchs, one for each respective biome. This eventually results in a race against the enemy, with the enemy trying to wipe out your town and with the player trying to become strong enough to defeat all 5 Monarchs before getting wiped out.<br/><br/><br/><br/><ul><li>Turn-based, tactical combat where the player can control up to 18 warriors at once. No longer do you have to justify to yourself for playing with a small party of 6 poor souls against the world. Combat is phase based, meaning all units within a faction act before the next faction goes however movement is based on action points allowing movement multiple times in a turn.</li></ul><br/><ul><li>Counter attacks and attacks of opportunity, ranged combat, synergistic abilities, flanking, action point system, positional bonuses and elevation tiles that influence hit chance.</li></ul><br/><ul><li>45 abilities divided into 9 weapon types. Sword, hatchet, mace, claymore, greataxe, warhammer and rapier. There are then 2 ranged weapon types, longbow and crossbow. Each weapon type has 5 unique abilities assigned to it.</li></ul><br/><ul><li>50 unique armor sets currently implemented which make up the 20 tiers of standard armor and 30 rare cultural armor that the player finds out in the world. Standard armors have 6 color variations, cultural armor has 3 color variations. An armor set consists of the helmet and the body armor (torso to legs). Plenty of armor sets to come in the future. </li></ul><br/><ul><li>5 unique biomes to fight in, with each biome containing its own environmental hazards. Combat maps also have partial random map generation. Rocks, trees, environmental hazards and singular elevation tiles are all randomly generated using an algorithm.</li></ul><br/><ul><li>65 monsters of which 60 have unique monster models. Not all unique monster abilities are animated yet, so there could be some confusion when it comes to \"feedback\" during combat.</li></ul><br/><ul><li>Assume leadership over a town. Decide where you want to send an expedition team to scavenge, based on the rewards and resources that the different biomes offer. Use those resources to upgrade your town buildings to prepare your warriors against the eventual town assaults and to give them the necessary support to hunt down the Monarchs.</li></ul><br/><br/><br/>Dead Monarchy Studios is me, I'm just one guy. I'm a solo developer and a gamer who's been chasing a lifelong dream of creating a RPG that I could live in. I was born and raised in Australia and I spent my childhood playing games. Dead Monarchy is my passion project and it has been influenced by games such as Battle Brothers, XCOM and Jagged Alliance. I plan to develop Dead Monarchy for several years, even after release. If I don't, then I'll see you at the stake.<br/><br/>Cheers,<br/>Kevin.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:43", "background_image": "https://media.rawg.io/media/screenshots/36c/36cc87fa66c4514aecc22c5fad72da29.jpg", "website": "https://dead-monarchy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 488, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dead Monarchy Studios"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Dead Monarchy Studios"], "esrb_rating": null}