{"id": 316885, "slug": "avis-rapida-aerobatic-racing", "name": "Avis Rapida - Aerobatic Racing", "name_original": "Avis Rapida - Aerobatic Racing", "description": "Fly as fast as you can and show off on the way!<br/><br/>Avis Rapida is an aerobatic racer for beginners and veterans alike. Learn how to fly and then push yourself and your aircraft to the very limits.<br/><br/><ul><li><strong>Easy to learn, hard to master</strong> - A game that is forgiving on mistakes but rewards good flying. From complete tutorials of the most basic actions to grueling tests of skill!<br/></li><li><strong>Realistic but simplified physics</strong> - Lift, drag and thrust equations based off of NASA models, but boring parts mathematically removed! <strong>(This is NOT a simulator.)</strong><br/></li><li><strong>Super-maneuverability</strong> - Thanks to the wonders of thrust vectoring, do things that a plane was never meant to do! <br/></li><li><strong>No waiting</strong> - Instant retries at the touch of a button. Everything accessible from the pause menu. Minimal loading times after initial load-in.<br/></li><li><strong>Play however you want</strong> - Fully playable on keyboard, controller or flight stick/HOTAS. Support for multiple input sources for individual players (for setups such as HOTAS + pedals). Fully rebindable controls.<br/></li><li><strong>Play with your friends</strong> - Seamless drop-in/drop-out local multiplayer and two exclusive multiplayer modes, Chase and Combat.<br/></li><li><strong>Relive the glory</strong> - Watch included replays to learn the ropes and then save your best runs to rewatch at any time!<br/></li><li><strong>Leaderboards</strong> - See how you stack up against your friends and the best aces in the world!<br/></li><li><strong>Mod support</strong> - Create, share and download skins and stages made by the community!</li></ul><br/><strong>Note:</strong> The stage editor tools are a Unity package. To use them to create new stages, it is necessary to download the Unity editor, which can be acquired and utilized free of charge.<br/>The Unity editor is not necessary for playing such stages.", "metacritic": null, "released": "2019-05-24", "tba": false, "updated": "2019-08-28T21:45:42", "background_image": "https://media.rawg.io/media/screenshots/f22/f228f5c4699e7d458c71553d65141770.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Top Lad Games"], "genres": ["Racing"], "publishers": ["Top Lad Games"], "esrb_rating": null}