{"id": 316897, "slug": "the-islander-landscape-designer", "name": "The Islander: Landscape Designer", "name_original": "The Islander: Landscape Designer", "description": "Escape your stressful and mundane everyday routine and head to exotic Polynesia to become a grand-master landscape designer. Turn this sandy wilderness into a beautiful paradise. The news of your arrival have already reached the inhabitants of nearby lands and they want YOU to design their islands.FEATURES<br/><strong>Design an island using blueprints </strong> and some guidelines given to you by a client. Blueprints provides you with an abstract information, but it's up to you to decide what design elements would make your client satisfied. The better you do, the more money you'll make.<br/><br/><strong>Free mode</strong> allows you to create an island of your own without any design restrictions. There is no one to tell how this island should look it's completely up to your imagination and creativity.<br/><br/><strong>Create your own blueprints</strong> with the in-game blueprint designer and share your creations with the world through Steam Workshop!<br/><br/><strong>Huge catalog of items</strong> ranging from trees, shrubs and flowers to statues, fountains and even houses.<br/><br/><strong>Relaxing atmosphere</strong> to ease your stressed out mind.NOTE<br/>The Islander: Landscape Designer delivers a calm and relaxing experience that embraces your creative side, it's not a game for someone looking for hard as nails challenge.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:41", "background_image": "https://media.rawg.io/media/screenshots/8cb/8cb4865c7ae699e92b6a6fd9f6756c71.jpg", "website": "http://boxheadbros.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 1, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boxhead Bros."], "genres": ["Casual", "Indie"], "publishers": ["Boxhead Bros."], "esrb_rating": null}