{"id": 316884, "slug": "herd-is-coming", "name": "Herd is Coming", "name_original": "Herd is Coming", "description": "Ten years have passed since the outbreak, food has been decayed already. Survivors had to find another way to feed themselves, eventually they did. Desperately, they started eating zombies they killed. As time goes by, they are used to it. Now, the new world is described as the world of mutual cannibalism.<br/><br/>In this ruthless world, Mike has managed to survive by travelling and scavenging continuously. However, Mike has run into less and less people over the years. Mike worries about decreasing number of survivors and he feels he has to do something about it.<br/><br/><strong>FEATURES</strong><br/><br/><strong>* WEAPONS :</strong> Find and equip the weapon of your taste, such as : Hatchet, Baseball Bat, Bow, Combat Knife, Cleaver, Machete, Pipe Wrench. Enhance your weapon with enhancers you find, such as : Weapon Enhancer, Weapon Stat Enhancer, Weapon Extra Stat Enhancer. Hit Critical or Knock-Down based on your weapon's type.<br/><br/><strong>* ARMORS :</strong> Find and equip armors to your chest, leg and arm. Enhance your armors with enhancers you find, such as : Armor Enhancer, Armor Stat Enhancer, Armor Extra Stat Enhancer.<br/><br/><strong>* CHARACTER PROGRESSION :</strong> Kill zombies to gain experience points, gain enough XP to level up. After you level up, spend your stat points on any of eight stats to shape the character as you like.<br/><br/><strong>* LOOT :</strong> Loot environments and dead zombies to collect food, medical items, tools, weapons, armors, enhancers, raw materials, trade items and more.<br/><br/><strong>* OTHER SURVIVORS :</strong> Explore new locations to find other survivors and bring them to your shelter.<br/><br/><strong>* TRADE :</strong> Sell your loot to survivors and buy special or common items from them.<br/><br/><strong>* UPGRADE SHELTER :</strong> Build or upgrade your shelter's door, windows, beds to ensure safety and accommodation for survivors.<br/><br/><strong>* QUESTS :</strong> Unlock new locations, find new survivors, progress through the story by completing main quests. Complete side quests of survivors to gain experience points, various items, stat points, skill points.<br/><br/><strong>* CRAFTING :</strong> Craft tools, medical items, trade items, enhancers, arrows to supply your needs.<br/><br/><strong>* SKILLS :</strong> Earn skill points and unlock skills divided into four categories : Attack, Defense, Survival, Craft.<br/><br/><strong>* ZOMBIE FOOD :</strong> Collect meat, guts and brain from dead zombies. Eat them raw or cook them on the stove to produce Zombie Brain Soup, Zombie Salami and Zombie Kokorech.", "metacritic": null, "released": "2019-06-10", "tba": false, "updated": "2019-08-28T21:45:42", "background_image": "https://media.rawg.io/media/screenshots/98e/98e76b3da4cf1b10f6cd5cb98f3465e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Proximity Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Proximity Games"], "esrb_rating": null}