{"id": 316911, "slug": "red-gate", "name": "Red Gate", "name_original": "Red Gate", "description": "Red Gate is an action adventure game consisting of two parts: another world (exploration) and this world (combat). A story of a soldier who moves back and forth between the two worlds to gain power, defeat powerful enemy forces and save people.Exploration PartThe purpose of the search part is to eat the resident, gain special points and take it to the battle part while avoiding the surveillance robot. The special point is possessed by the walled residents. You can also use the points to buy items, gain skills, and open the gates of hell. There are also friendly animals besides residents, and they can also obtain information of the world from them.Combat PartIn this world, defeat the enemy and save the residents. The enemy is a mighty army. Level up at the points obtained in the search part. If you are likely to lose, you can go back to that world. Since the upper limit of the points obtained in the search part is determined by the number of saved people, save people as much as possible. If you save all the people and beat all the enemies, the door opens ...Features<ul><li> Two worlds: an adventure-like world with various elements, and a world of battle with numerous enemies<br/></li><li> A deep game system that travels back and forth between two interacting worlds.<br/></li><li> Map of handmade 2D dot picture<br/></li><li> A search part that makes full use of various skills and items<br/></li><li> Simple but difficult fighting<br/></li><li> Powerful power obtained by level up</li></ul>", "metacritic": null, "released": "2019-05-25", "tba": false, "updated": "2023-08-23T13:29:20", "background_image": "https://media.rawg.io/media/screenshots/f7d/f7dc9adc3efb515662f7262baf69db24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["uora"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["uora"], "esrb_rating": null}