{"id": 317070, "slug": "tricky-sudoku-test-cross-numbers", "name": "Tricky Sudoku test: Cross Numbers", "name_original": "Tricky Sudoku test: Cross Numbers", "description": "Improve your brain and have a lot of fun by playing \"Cross Numbers\"!<br/>This is a single game, Time spent on this game will activate your brain, enhance your visual memory and improve your concentration and math skills.<br/>This app are designed to train your short-term memory, visual memory and concentration. Mastering these skills is crucial for learning new things as well as in everyday life activity. It also trains your skills in finding, detecting and spotting. These skills are very important in your real life choices, when you need to quickly find best solution. Math Skills is also designed to train your mastery with numbers. These skills are also very handy whenever you want to invest money, take a loan or pay your taxes.<br/>Constant brain training is essential both for kids mind development and for keeping brain active and not aging for adults. This app is suitable for any gender, age and profession. You can train every day and observe your progress via score. In time you will see that your brain performance gradually improves.<br/>Free playing this app might be the best investment you have ever made!<br/><br/>How to play:<br/>Cross Numbers is played in rounds. In each round the game will briefly show you several circles with different numbers. After about five seconds the numbers in circles will disappear and you will be asked find which numbers sum up to given total. If you answer correctly, you will add one score and advance to next round with more circles. If you make a mistake, game will finish and your result will be presented.<br/>There are 2 levels in this game: kid (easy mode), pro (difficult mode). Profession level is very very difficult. So, you should start playing with easy mode, but remember that so hard to get high score with easy mode.", "metacritic": null, "released": "2014-06-29", "tba": false, "updated": "2019-10-22T13:55:58", "background_image": "https://media.rawg.io/media/screenshots/258/258f1a425bbdadc9844bd7ea26a3157d_H90DF9w.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tuan Nguyen Anh"], "genres": [], "publishers": ["Tuan Nguyen Anh"], "esrb_rating": "Everyone 10+"}