{"id": 317059, "slug": "project-zero-origin", "name": "Project Zero: Origin", "name_original": "Project Zero: Origin", "description": "BC 2049, the highly developed human civilization under invasion of vicious aliens. Humanity is imperiled. <br/>Remnant human came together, pooling resources and throwing aside old rivalries for the sake of the greater good. To save the collapsing world, hence Project Zero was born.<br/><br/>[Key Features]<br/>- Endless fun of collecting<br/>Enormous roster of iconic Mercenaries are waiting for recruitment, train, awaken them to unlock numerous unique skills. Assemble your own formidable legion which is one of a kind.<br/><br/>- Time to embrace Brainstorm<br/>Tactical gameplay brings you unexpected experience. Hundreds skills synergy crosses through whole combats, choose wisely and apply perfect formation to counter enemies, master battles and end the war!<br/><br/>- Build your base<br/>We can’t march armies without strong base, do what you can to collect scarce resources and build necessary facilities. <br/><br/>- Take them down and retrieve the places we used to call Home<br/>Are you prepare to embark the contaminated area? Those unknown places are saturated with vicious, filthy monsters and mutants. However tons of treasures and items hidden there alongside with invasion.<br/><br/>- With commanders cross the world<br/>Tire of fighting alone? Forge a guild or join one, great chances to meet more players around the world. Recruit members and fight together, you will never be alone in this game.", "metacritic": null, "released": "2019-01-21", "tba": false, "updated": "2019-10-22T14:38:22", "background_image": "https://media.rawg.io/media/screenshots/dc9/dc91d228fcaa5d48790b255e5320b85a_SvLoyJT.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brandon Smith"], "genres": ["RPG"], "publishers": ["Brandon Smith"], "esrb_rating": "Teen"}