{"id": 317122, "slug": "found-hidden-clue-pro", "name": "Found Hidden Clue Pro", "name_original": "Found Hidden Clue Pro", "description": "Jnik Game has a new challenge for you. We created new types of games that might interest you. From time to time we are trying harder to offer you something new, something that might provoke you, so you wouldn't be bored. We offer you a new game play. The whole story is been led by three characters and five locations. Each character needs help to find few objects that will be put on five different locations. Our player should walk through all the five locations to find all the object that the characters are looking from him.<br/><br/>In todays' case we have three detectives who have lost the evidences, our player has the role of an assistant and has to find out the evidences needed for a notorious criminal to be caught. You have a very important task to finish. What would you feel like if you work as a lawyer or detective, you are included in a very important case with heavy criminals and somehow very important evidences for the investigation go into deep, get lost? Of course, the worst thing is if you would learn that someone actually has stolen your stuff, the documents that could lead you to a victory.<br/><br/>Then, the problem gets even bigger, what if the documents you are missing fall into the enemies hands and they use it against you? In that case, one would do anything possible to find the stealers and take them away. Or maybe, the best thing is to safe everything you have, make copies out of it and have it for the bad times. So, this is how closely the characters, or these serious detectives feel for todays' case. They simply must find the documents if they want to win over the case in the court. You would help them in the mission, won't you?", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-10-22T14:38:28", "background_image": "https://media.rawg.io/media/screenshots/23f/23faeff14d66f8d782ba5ccb37ce033c.jpg", "website": "http://tontoongame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ankur Bavishi"], "genres": ["Adventure", "RPG"], "publishers": ["Ankur Bavishi"], "esrb_rating": "Everyone 10+"}