{"id": 317131, "slug": "hidden-object-riddle-of-the-mountain-pro", "name": "Hidden Object: Riddle of the Mountain Pro", "name_original": "Hidden Object: Riddle of the Mountain Pro", "description": "The golden fever may be officially gone but that doesn't count for the old diggers. Ok, we don't think metaphorically this time, we are just referring to those people who look for gold, who follow maps and stories about hidden treasures.<br/><br/>The mountain North Scottsdale today is turned into wonderful national park but it wasn't like that years ago. This mountain was the main spring of gold in America. Before 100 years numerous gold diggers gather together there with one single aim – searching for the gold that this mountain hides. Some of them came back home with empty hands while others managed to find gold. And since so many years has passed, we can't be sure if those stories are true or it's just about legends but searching again this area might be worth… in any case, we are talking about gold and the gold still keeps its price on the market.<br/><br/>Gloria and Larry in the national park of the North Scottsdale mountain. They have heard that years ago there was some hidden gold. They found this story interesting so they made a little search on that topic. They actually found an interesting riddle, supposedly left by the gold diggers. In case that they manage to solve the riddle, they will get exactly to the place where there is gold, a lot of gold! This would definitely be a great adventure for Gloria and Larry, so let's follow them all way long!", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-10-22T14:38:28", "background_image": "https://media.rawg.io/media/screenshots/d3b/d3b48353ce6dea709b1c8502966bc55e_WJreUYi.jpg", "website": "http://tontoongame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ankur Bavishi"], "genres": ["Adventure", "Puzzle"], "publishers": ["Ankur Bavishi"], "esrb_rating": "Everyone 10+"}