{"id": 317251, "slug": "south-surfers", "name": "South Surfers", "name_original": "South Surfers", "description": "Welcome to South Surfing Park! <br/><br/><br/><br/><br/>This is a real sea! <br/><br/>You can enjoy amazing experiences from the calm waves to those at dizzy height that might flip your mind. Let’s face the sea waves fluctuating up and down so vigorously and enormously breaking. <br/><br/>Enjoy as you as you can in Water Park <br/><br/>The ocean wave pool is gigantic and the wide river run down very fast…You can have them all at the same time. It’s like sea water running in a brook. <br/><br/>Easy control but real surfing <br/><br/>When you turn around a cellular phone, then it Surfing Board also turns around. The gravity sensor of the phone makes you feel like surfing on real waves. <br/>One more thing! Shake (Or Touch) the screen and you will jump up. These two controls are all you need to do. <br/><br/>Go faster and jump higher… be a professional surfer. <br/><br/>You can make a new record by performing 10 aerial turns in a row, eating ice and jumping and surfing skills. There is no limit to records. <br/><br/>Look sharp! <br/><br/>The water gets tougher and the waves push the board faster. <br/>Once absent-minded, the waves invade up to the top of your head instead of yourself. <br/><br/>Real Physics Engine <br/>We are using 3D Physics Engine. For calculate buoyancy and gravity real time! <br/><br/>Listen your own music <br/>You can use your music file to background music! Set BGM OFF and play music (from your phone) something like cool reggae,surfing rock,dance or anything <br/>----------------------------------------", "metacritic": null, "released": "2012-10-02", "tba": false, "updated": "2019-10-22T14:38:38", "background_image": "https://media.rawg.io/media/screenshots/ec0/ec0654b6de35100a0305dd684d1715d9_149ocAG.jpg", "website": "http://moongamessoul.blogspot.kr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MoonGames"], "genres": ["Sports", "Racing"], "publishers": ["MoonGames"], "esrb_rating": null}