{"id": 317253, "slug": "cool-surfers-1-penguin-run-4-finding-marine-subway", "name": "Cool Surfers 1 :Penguin Run 4 Finding Marine Subway 2 Free", "name_original": "Cool Surfers 1 :Penguin Run 4 Finding Marine Subway 2 Free", "description": "ENJOY MADDENING FEELING OF SPEED GOING ALONG COOL WAVES<br/>Tropical sea is waiting for you.Dispel the hot temperature with even faster speed felt!You can play using physical engine with  more fun  than real jet ski.And the game play is provided for free. <br/><br/>THEMAGIC COURSE CHANGING REAL TIME BASIS, FROM WAVE SLIDE ANGLED 80 DEGREE TO BIG WAVE. <br/>Keep yourbalance at the wave slide when you fall from 80 degree angle,you will just fall into the sea if you are off your guard! <br/>Pass over the weltering wave valley by 10-stage turning jump! Jump higher using the big wave! More than thirty 30 courses changes even when you play every time.All courses are linked altogether, stretching out endlessly! <br/><br/>WHICH CHARACTER DO YOU LIKE AMONG PENGUIN,POLAR BEAR,SEA OTTER? <br/>Relaxed penguins, coward polar bear, nimble sea otter, all of them are waiting for your choice. <br/><br/>IF YOU NEED HELP,JUST CALL SEA FRIENDS!<br/>Turtle rescue worker will come to rescue you when you fell in the sea. If you get on a dolphin, you can make 3-stage jump. Half seal will make you run at highest speed. <br/><br/>ANCHOVY, PRAWN, TUNA, AND.. .SHARKS?<br/>In the sea,foods are everywhere. Take your foods and encourage your power. But beware. Somebody at sea thinks of you as a kind of food. It is best for you to escape when sharks appear! <br/><br/>SOMERSAULT 1,2,3,4,5,6,7,8 TURNS! <br/>The more skill you have in somersault, turbo dash time is expanded. <br/><br/>TO THE SEA,HOW FAR HAVE YOU BEEN OUT?<br/>It is stretched out endlessly, and the environment changes every time you break a chapter.Speed gets even higher, and control becomes even more difficult. Go out to the furthest you can, into the endless sea. <br/>You can compete with other players in your record through game center!", "metacritic": null, "released": "2012-11-05", "tba": false, "updated": "2019-10-22T14:38:38", "background_image": "https://media.rawg.io/media/screenshots/88a/88add1af892f9d96b9c6277a2340699a.jpg", "website": "http://youtu.be/6mQS0GUH8eY", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MoonGames"], "genres": ["Sports", "Racing"], "publishers": ["MoonGames"], "esrb_rating": null}