{"id": 317212, "slug": "ninja-vs-bomb", "name": "Ninja VS Bomb", "name_original": "Ninja VS Bomb", "description": "Test your reaction as a ninja jumping and dodging through a dangerous field with lots of explosive bombs.<br/><br/>Survive as long as you can and climb up the leaderboard to become a ninja master.<br/><br/>Will you become the world's best or worst ninja? Let's see.<br/><br/>Highlighted features:<br/><br/>- Unique gameplay!<br/>- Easy to understand, hard to master!<br/>- Funny characters: Ninja Kid, Iron Boy, Cowman, Piggy Sensei, and Panda Sama.<br/>- Ever wonder what your ninja name is in Japanese? Find out in the game ;-)<br/><br/>Yo! Let's go!<br/><br/>***** FUN FACTS ABOUT NINJAS ***<br/><br/>In feudal Japan, a ninja, otherwise known as shinobi, was a covert agent who specialized in sabotage, espionage, infiltration, and, when the situation required it, assassination and combat. While the samurai upheld strict rules of conduct, both morally and in their duels, the ninja fought in the darkness, sneaking into locations without stirring up the attention of their enemies. To train to be a ninja, therefore, you must learn to fight with alacrity as well as strength, slipping in and out of your missions while remaining practically invisible to your foes.<br/><br/>It's important, as a ninja, to have the strength to jump with force, as you'll need this to scale walls and hop between surfaces. When paired with your climbing and running skills, you'll be able evade attacks from your enemy if you ever engage them in combat. You also want to strengthen your legs, as great deal of your physical power will be held within them.", "metacritic": null, "released": "2018-09-11", "tba": false, "updated": "2019-10-22T14:38:34", "background_image": "https://media.rawg.io/media/screenshots/29b/29b91a97bae2789188e53415f8d9592f_8gQPNGi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Athena Studio"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Athena FZE"], "esrb_rating": null}