{"id": 317309, "slug": "zingoplaylite", "name": "ZingoPlayLite", "name_original": "ZingoPlayLite", "description": "ZingoPlayLite takes you into a new dimension of challenge and suspense.  You are playing against a virtual rival (the computer) who dares you to compete in an exciting duel for 6 unpredictable games of ZingoPlayLite…and to win before it does.<br/><br/>The objective is to beat the virtual challenger by matching 5 ZingoPlayLite images in any row, column, or diagonal line on your gameboard thus earning a single point for each game.  When you touch [Go], a random ZingoPlayLite icon will appear on the left side of the game board.  You must carefully identify and touch all images on your game board that match the ZingoPlayLite icon presented.  Five matched images on your board should change to a ‘Z’ in a straight line in order to win a point.<br/><br/>There are 6 games in each session.  You should win 6 games before the virtual challenger does to become the indisputable victor.<br/>Your virtual Rival has an edge in that it automatically matches and changes its images in real time.  You…well, you have to seek them out and change ‘em.  Sorry!  <br/>Good Luck on this mission!<br/><br/>FEATURES:<br/>•\tInstructions in English and Spanish for enthusiastic bilingual players<br/>•\tRandomly presents  ZingoPlayLite icons for greater suspense and fun<br/>•\tIntuitive: easy to understand and play, but quite addicting<br/>•\tImmediate audio feedback as you compete against the virtual rival<br/>•\tResults displayed immediately after each game and the final 6th game<br/>•\t6 exciting games in each session for a thrilling game board experience<br/> <br/>Download this latest version of ZingoPlayLite available at the App Store Now!<br/><br/>Also get the full version, ZingoPlay now.  It comes with 6 game boards to challenge the virtual rival.<br/>Visit www.biznizcamp.com for more educational-entertainment games.<br/><br/>------------------ ESPANOL -----------------<br/><br/>ZingoPlayLite te lleva a una nueva dimensión de desafío y suspenso. Juegas contra un retador virtual que te atreve a competir en un duelo emocionante de 6 juegos impredecibles de ZingoPlayLite…y debes ganar antes de que lo haga.  <br/><br/>El objetivo es vencer al retador virtual colocando 5 imágenes con ‘Z’ en cualquier fila, columna o en diagonal en el tablero para ganar un punto en cada juego. Cuando tocas [Go], aparecerá un icono de ZingoPlayLite al azar en la parte izquierda del tablero de juego. Debes  identificar y tocar cuidadosamente las imágenes en el tablero de juego que coinciden con el icono de ZingoPlayLite. Para ganar un punto, 5 imágenes del juego deben tener la letra ‘Z’ en una línea derecha en el tablero.<br/><br/>Hay 6 juegos en cada sesión. Debes ganar los 6 juegos antes del retador virtual para establecerte como el vencedor indisputable.<br/>El retador virtual tiene una ventaja en que detecta y cambia las imágenes de su tablero en tiempo real.  Tu…pues, tienes que buscarlas y cambiarlas. ¡Lo siento! <br/>Buena suerte con esta misión!<br/> <br/>LAS CARACTERÍSTICAS:<br/>- Diseñada para jugadores entusiastas que hablan inglés y español<br/>- Las imágenes del juego se presentan al azar para mayor entusiasmo y diversión<br/>- Juego intuitivo: fácil de entender y jugar, pero bastante adictivo<br/>- Instrucciones dadas en tiempo real mientras juegas contra el retador virtual<br/>- Resultado mostrado inmediatamente después de cada juego y el sexto juego final<br/>- Cada sesión tiene 6 juegos para una experiencia única de juego de tablero <br/><br/>¡Obtenga su versión más recién de ZingoPlayLite ahora disponible en la App Store!<br/><br/>¡Obtenga también la versión completa, ZingoPlay. Ofrece 6 tableros de juego para desafiar al retador virtual.<br/>Visite www.biznizcamp.com para más juegos de diversión educativa.<br/><br/>-------------------------------------------------", "metacritic": null, "released": "2011-10-28", "tba": false, "updated": "2019-10-22T14:38:41", "background_image": "https://media.rawg.io/media/screenshots/264/2646bd537187087ec3dc5cee180a6a4e.jpg", "website": "http://www.biznizcamp.com/support/mobileapps.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Keith Thomas"], "genres": ["Strategy", "Board Games"], "publishers": ["Keith Thomas"], "esrb_rating": null}