{"id": 317560, "slug": "creating-a-universe", "name": "Creating a Universe", "name_original": "Creating a Universe", "description": "<p>Welcome to the beginning of the universe! You are a being of light, and in front of you is a box\r\nthat is also brimming with light, and it's about to burst. Around you is the infinite black void.\r\n</p>\n<p>In this surreal interactive fiction game, you are the creator of your own universe, and you have\r\npower to create anything you want! Set it off with a big bang, and embark on an adventure with\r\nyour choice of interacting with multiple universes, or creating yourself some friends to populate\r\nyour universe. But with great power comes great responsibility; you must protect your fragile\r\ncreation. From jealous foes to greedy foreign invaders, it is your duty to restore equilibrium to\r\nyour universe against powerful opposing forces while causing the least amount of destruction\r\npossible.\r\n</p>\n<p>With two completely different adventures full of crucial choices to make, how will you defend\r\nyour beautiful creation from total destruction? Explore the cosmology of your own creation story\r\nas you set a moral example for the greater good of the universe. <br/></p>\n<p>_________________________________________________________<br/></p>\n<p>This game has two separate timelines, and within each timeline, there is only one way to win, and 6 ways to lose in one timeline, and 8 ways to lose in the other. Play through <em>Creating a Universe </em>multiple times to win in both timelines!</p>\n<p>You know if you won if you see a ★ at the end of the passage. <br/>If you lose, you will see a ✖ symbol. <br/><br/>This game is a project created by Lauren Smith for IMS 445. Twine was used to create this interactive fiction game. <br/></p>", "metacritic": null, "released": "2019-05-09", "tba": false, "updated": "2019-05-10T06:27:49", "background_image": "https://media.rawg.io/media/screenshots/ade/adeb4d3fb4919698a1b09efb0e5ed395.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lauren Smith"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}