{"id": 317567, "slug": "spaceman-chie-hsi-jasmy", "name": "SpaceMan (Chie Hsi Jasmy)", "name_original": "SpaceMan (Chie Hsi Jasmy)", "description": "<p>Hey you!</p>\n<p>Yes you!</p>\n<p>This astronaut is lost in outer space and needs some help to find the rocket. Can you help ?<br/></p>\n<p><strong>Game Overview</strong></p>\n<p>The design of the game is based on the challenge of accomplishing a simple task with unconventional gaming techniques. Rather than following the usual game design the use of exploration in an open space without a map forces the players to think about the movements before reacting. Each level is built to teach the player a skill or add information about an element, as the level progress so does the difficulty.  </p>\n<p><strong>Core Gameplay Mechanics</strong></p>\n<ul><li>Movable Objects -  Included in various levels to aid the player in gaining height to climb over obstacles. The player can push these objects to the location they desire in order to fulfill the objective. \r\n  </li><li>Exploration of Terrain – The number of possible ways to reach the goals are unlimited and some of the possible ways may not obvious which is the best. This game also includes various shortcuts and hidden movements.\r\n  </li><li>Jumping – Combined with gravity, the player must jump to move from platform to platform avoiding the gaps.</li></ul>\n<p><strong>Credits</strong></p>\n<p>All art assets are created by Chie Hsi Jasmy Liu</p>\n<p>Special thanks to Professor Cohen and Alex Iveroth</p>", "metacritic": null, "released": "2019-05-09", "tba": false, "updated": "2019-05-10T06:29:34", "background_image": "https://media.rawg.io/media/screenshots/43b/43bf3d426ceeda4a95d3f668f1542c80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Chie Hsi Jasmy"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}