{"id": 317881, "slug": "terror-in-the-house-of-everchanging", "name": "Terror in the House of Everchanging", "name_original": "Terror in the House of Everchanging", "description": "<p>What if every decision you’ve ever made caused a timeline to split in two? Worlds that only exist because of your decision. Something as whimsical as taking the long way home or cutting through the alley shortcut could ultimately be the difference of life or death, but what if both possibilities exist? Separate, yet entwined. Joined, even. Coffee, or Tea? Sleep, or wake? Flip a coin, let fate decide. But what if it wasn’t fate? What if it was you all along? Splitting the timeline, and dooming the other in favor of one you believe you chose. These are the nonsensical terrors awaiting you in the House of Ever Changing, where the garbage remnants of trash left behind by time congregate and become true. Where the line between choices is thin, yet immeasurably large. Your path may lie within this place where time pools like a puddle, but you never had a choice to begin with, did you? This place was made by you. For you.<br/></p>\n\n<p>CONTROLS:</p>\n<p>W,A,S,D = Movement</p>\n<p>E = Interact</p>\n<p>F = Flip a coin, change your path</p>\n\n<p>Inspired by Junji Ito's \"Town Without Streets.\"</p>\n\n<p>This is my second game ever fully packaged and finished. This is specifically for the Unreal Engine Spring Game Jam 2019, \"Marketplace Takeover.\" So most of it was built with asset packs that were free for the month of May (\"HQ Residential House,\" \"Urban Materials Pack,\" and \"Chameleon.\") All the sound effects and music were recorded by myself at 4am on Tuesday with my cellphone because I was too tired to dig out my laptop and microphones and such. Font used is from 1001fonts.com. </p>\n\n<p>Links to Marketplace Assets Used:</p>\n\n<p>\"Urban Material Pack\" by Plan B Studios</p>\n<p>https://www.unrealengine.com/marketplace/en-US/slug/urban-material-pack<br/></p>\n<p>\"HQ Residential House\" by NOTLonely </p>\n<p>https://www.unrealengine.com/marketplace/en-US/slug/hq-residential-house</p>\n<p>\"Chameleon\" by SUMFX<br/></p>\n<p>https://www.unrealengine.com/marketplace/en-US/slug/chameleon</p>\n\n<p>Even if these packs are no longer free, I would HIGHLY recommend them, especially Chameleon. <br/></p>", "metacritic": null, "released": "2019-05-07", "tba": false, "updated": "2019-05-10T07:54:54", "background_image": "https://media.rawg.io/media/screenshots/e16/e16e1900ace1f3a85354596e584c16af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bjorntuga"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}