{"id": 317868, "slug": "learning-to-fly", "name": "Learning to Fly", "name_original": "Learning to Fly", "description": "<p>A bird in a city struggles to fly. Their bread is on the other side, and they MUST get there. All while, learning to fly! \r\n</p>\n<p>Hello, my name is Natalie, and this is my first complete game. I'd like to thank my Professor, Mr. David D.S. Cohen, and my TA Alex Iveroth for teaching me all I know. The art assets are from by KVAZI + Henry and Software, and the music, \"sneaky cartoon music with bursts of liveliness,\" was created by Shadow Tag. Thanks in advance for viewing my page. I hope you like it. </p>\n\n<p>Here is a more in depth reasoning for this game.</p>\n<p>For this game, I really wanted to create something simple, yet interesting enough for the player to be engaged. As someone who tends not to be the best at video games, I decided to stick with the 2D game. In this game, the player is a bird who ends up flying and moving across a city. At times this bird is able to fly, and at other times the bird is not able to. I think that this adds to the quirkiness of the protagonist. As for what the bird is trying to find, I chose bread. When I think of birds, I think of them wanting bread, so I thought that this would be the best objective for my character to find. This game is structured in a way that has the player mainly progressing horizontally like Super Mario. I structured the game with tall buildings to fit my theme.\r\n  </p>\n<p>The theme I chose for this game is City. I thought using the 2D controls, like being able to jump up buildings, would be perfect for a city theme. As for the aesthetic, I went for a very cute version. This added to my theme being a cute experience for the player. The art assets from the store, were created by KVAZI and Henry Software, and I think that fit perfectly into the game. These assets really added to the overall experience for anyone playing this game. \r\n  </p>\n<p>The player will be using the arrow keys, and their space bar to interact in this game. Of course, towards the beginning it is mainly the player jumping, and walking, but towards the end in comes into a grand culmination of different actions. I really enjoyed using sponges as elevators, and for a way for the player to feel as if they are flying.\r\n  </p>\n<p>Core Gameplay Mechanics:\r\n  </p>\n<ul><li>Jumping using the arrows, and spacebar to climb up buildings. This allows the player to go throughout the entire city.\r\n  </li><li>Jumping on sponges. This allows the player to feel as if they are flying.\r\n  </li><li>Using arrows to move in the way the player would like to go. \r\n  </li></ul>\n<p> \r\n  </p>\n<p>Goals of the Project:\r\n  </p>\n<ul><li>To engage the player in a game that allows the player to learn as the game goes on.\r\n  </li><li>To usually aesthetically pleasing art assets to allow the audience to feel happy. \r\n  </li><li>To complete a game that has an overall concept, and feeling. \r\n  </li></ul><p>Credits:</p><p>The art assets are from by KVAZI + Henry and Software, and the music, \"sneaky cartoon music with bursts of liveliness,\" was created by Shadow Tag. <br/></p>", "metacritic": null, "released": "2019-05-08", "tba": false, "updated": "2019-05-10T07:50:04", "background_image": "https://media.rawg.io/media/screenshots/3b6/3b65a9d9f8a12d5831dbde0e71cec010.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["natcat919"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}