{"id": 317925, "slug": "clash-of-morons", "name": "Clash of Morons", "name_original": "Clash of Morons", "description": "<p><strong>Clash Of Morons</strong> is ranking based arcade first person melee smacking, magic casting, Free For All blood bath with a twist!<br/></p>\n<p>You probably wonder what brought you here.. (Remember that Magic Coin you thrown into a well of wishes? DUH?) And ask yourself this simple question \"What the hell I'm doing here?!\".<br/>Well.. To be completely honest with you.. We don't really know, but..<br/>You have been fortunate enough (or not..) to participate in eternal struggle for dominance, over who is the mightiest of them all.. Over world domination (over one small and dusty keep, really..) and finally THE ABILITY to stay in one body and be the king of them all!! Ruler above all other rulers!! Incarnation of might, wisdom, and most importantly patience... Did we mentioned you will be chained to the throne, for like, all eternity?</p>\n<p>But not all is lost, since there might be at one point, another dude with a coin like that one of yours, dumb enough to make same wish and to take your place instead.. Laughs on him! I’m I right?! But for now, sharpen your swords and axes, prepare you scroll with spells and polish that armor of yours, since you will have to fight between good souls like your own! Equally moronic but good non the less.. Let us see which side is fortune’s favourite! Let the coin decide...</p>\n\n<p><strong>How to play:</strong></p>\n<p>Flip a Coin, and join a side of conflict. Smack the other side on the head till they are like dead! Killing enemies  boosts your special ability - [FLIP THE COIN] - It lets you release your soul from the body to flip a coin again, leaving the damaged corpse behind to pick another volunteer to possess, however which side of the conflict you can join is decided by the COIN. Stay alive as long as possible and compete with other challengers for best score!<br/></p>\n<p>Game created for Epic Spring Game Jam 2019. </p>", "metacritic": null, "released": "2019-05-07", "tba": false, "updated": "2019-08-28T23:16:30", "background_image": "https://media.rawg.io/media/screenshots/28b/28b506dd49383ae5315d8807f151b7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KidsWithSticks"], "genres": ["Action"], "publishers": [], "esrb_rating": null}