{"id": 318077, "slug": "chamber-of-the-greblicks", "name": "Chamber of the Greblicks", "name_original": "Chamber of the Greblicks", "description": "<p>Our brave explorer, Professor Reginald TuftBottom, makes his way through the dastardly underground chamber of the Greblicks. A crafty species that built traps around their ancient treasures. Their most prized possession is the chunk of Balrock purposely displayed in the center of the main chamber. The Greblicks are now extinct and many explorers have attempted to make their way through the chamber in order to collect the prize. Unfortunately, no one has been victorious in this quest….until now!</p>\n<p>### Controls ###</p>\n<p>WASD or Arrow Keys to move around.</p>\n<p>### Us ###</p>\n<p>We are Ivory Crow Games a small game company that strives to make a single game every month. We are very open about our process and would love to get testers to play our games during the month as we create them and give us feedback.</p>\n<p>If that sounds like something you would like to do please drop us a comment or feel free to join our community on discord. https://discord.gg/5DSgHsE/</p>\n<p>If you are curious how we created the game and the process please follow us on Instagram and Twitter for daily updates on what in the world we are building this month.</p>\n<p>https://www.instagram.com/ivorycrowgames/</p>\n<p>https://twitter.com/ivorycrowgames/</p>\n<p>We would really love to hear from you! So let us know what you think about our game and please leave us a review!</p>\n<p>Support us on Patreon</p>\n<p>https://www.patreon.com/ivorycrowgames<br/></p>", "metacritic": null, "released": "2019-05-07", "tba": false, "updated": "2019-05-10T08:49:48", "background_image": "https://media.rawg.io/media/screenshots/089/08988b6ee3e237c801f962417bf4c627.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ivory Crow Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}