{"id": 318203, "slug": "devine-card-battles", "name": "De'Vine: Card Battles", "name_original": "De'Vine: Card Battles", "description": "<p>As enchantments that bind powerful creatures to cards begin to corrode... Hell is breaking loose! Over 300 unique CARDS to collect! Fast paced CARD BATTLE system! NO RNG. NO CARD DRAWS. PURE STRATEGY!<br/></p>\n<br/><br/>\n<p>A strategic CARD battle system with over 300+ unique cards to collect!<br/>Many battles that also include boss battles for extra depth!<br/>Fast paced and challenging!<br/></p>\r\nNOT A TYPICAL CARD GAME. NO RNG. JUST PURE STRATEGY!\r\n<p><strong>WARNING</strong>: Outcome of the battle is determined by your strategy not luck!</p>\n<ul><li>No card draws = No RNG.</li><li>You bring your build of ANY seven cards into battle and try to outwit the <br/>enemies build.</li><li>Many many different battles and strategies needed!</li><li>All unique mechanics. No rip-off mechanics from other Non-De'Vine games.</li><li>If this is too much thinking for you, then this is not your type of game.</li></ul>\n<p><em><strong>Story:</strong></em><br/>Set forty years after the events of the last Dark Hero: Kuan, the world is at peace.<br/>That is until the cards which were used to trap the essences of monsters start losing their <br/>enchantment. Causing the seal to dissipate. Monsters start becoming unhinged and it is <br/>up to a very skilled card master to track down the source of this evil and put an end to it!<br/><br/><br/><strong>Tower of Ascension:</strong> Ever increasing difficulty the higher up the tower<br/>you go. How far up can you make it before you are squashed!?<br/></p>\n\n\n\n\n\n\n\n\n\n<li><em><strong>Tournament!:</strong></em> Face up against 16 other participants to try and make<br/>it in the Hall of Champions!</li><li><em><strong>Boss Battles:</strong></em> Battle against powerful creatures that will take your whole<br/>lineup to destroy!</li><li><em><strong>Over 300 unique cards to collect:</strong></em> Collect cards after each battle or essences<br/>which you can use to buy more cards to add to your collection!</li><li>Endless card setup combinations!</li><li>Auto-Battle to test builds!</li><li>Sixteen playable characters! Find them all!</li><li>Ultra-Bosses pose a big threat and are found in high tower levels!</li><li>Some cards can change the stats of the battlefield or even boost your whole team!</li><li>Story set 40 years after the events of De'Vine: World of Shadows.</li><li>Completely voiced narration as you progress through the story.</li><li>NEW. <em><strong>Card elements:</strong></em>. Each card has an element and properties tied to them:</li>\n\n\n\n\n<ul><li><em>Earth:</em> Immune to negative status effects.</li><li><em>Water:</em> Heals adjacent cards when killed.</li><li><em>Fire:</em> Gets an extra attack when under 50% life.</li><li><em>Air:</em> Gains ability to dodge an attack every other turn.</li><li><em>Unliving:</em> Immune to healing, but comes back to life on it's own.</li><li><em>Angelic:</em> Sacrifices itself to save a fallen card.</li><li><em>Life:</em> Capacity is 1 lower than normal.</li></ul>\n<p><strong>OTHER GAMES by Stapleton!!</strong></p>", "metacritic": null, "released": "2019-05-05", "tba": false, "updated": "2019-05-10T09:21:34", "background_image": "https://media.rawg.io/media/screenshots/14b/14be76a70efa015232d635943e636c94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stapleton"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}