{"id": 318454, "slug": "the-outlived", "name": "The Outlived", "name_original": "The Outlived", "description": "In the darkness, you lived like a dead man, annoyed by the mundane pressures of everyday life, parent’s and Boss’ complain reverberated in your head. Somehow you woke up, found yourself in a deserted wasteland, with weapon in hand you hit the road……<br/>Players, welcome to The Outlived. From this second, all skills and memories you mastered in civilized world are of no use at all, Survival is your only goal.<br/><br/>- Explore the vast wasteland <br/>The whole world is your backyard, Abandoned hospital, Infected prison, Crisis-ridden police station and secret lab built by pre-Apocalypse government, you can now explore around numerous locations in world map to encounter romances and gather valuable resources.   <br/><br/>- Scavenge all valuable resources and craft survival necessities<br/>Craft clean water, food, equipment, Kar 98k or even flamethrower, hone your skills to create either melee or ranged weapons to fight against zombies, offensive survivors, wild animals and unidentified mutant creatures.<br/><br/>- Build your own shelter<br/>You cannot survive without a shelter in the apocalyptic world. Customize your home camp with tons of decorations and defense turrets. Build all kinds of workbench to produce materials for crafting needs, feed a pet to play with or accompany your travel, invite other survivors to your camp to take a break.<br/><br/>- Communicate with other survivors.<br/>You are not the only survivors here, Invite players from all over the world to your self-customized base camp. However, you cannot be sure that they are friends or enemies, add friends discreetly and selectively, build your own clan with trustworthy partners to survive to the end. <br/><br/>- Get rich Loots form Various multi-player events. <br/>More than 40 PVP Events, BOSS Rush, Random map and raid activity are waiting for you to conquer. However, it might be tough to live on your own in these areas, hang out with your clan, be united as one to ride out the storm, and get rich boss loot after the battle. <br/><br/>Now, tell me. To live in the safe pre-apocalypse society like a numb creature, or OUTLIVED here as a real human, which one do you choose?<br/><br/>Don't forget to follow our Facebook Fanpage at:<br/>https://www.facebook.com/theoutlived/<br/><br/>And you can contact us through Custom Service mail:<br/>theoutlived@herogame.com", "metacritic": null, "released": "2019-05-09", "tba": false, "updated": "2019-10-22T14:38:51", "background_image": "https://media.rawg.io/media/screenshots/088/088f1a0a4a666944885cd79daf93a70b_ztE16kf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HK HERO ENTERTAINMENT CO."], "genres": ["Action", "Adventure"], "publishers": ["HK HERO ENTERTAINMENT CO"], "esrb_rating": "Teen"}