{"id": 318419, "slug": "chernomeat-survival-game", "name": "Chernomeat Survival Game", "name_original": "Chernomeat Survival Game", "description": "! The great adventure is about to begin ! <br/>Help Vladi Meat return to its original form, for this you will have to travel the world of ChernoMeat, a place where plagued by enemies who try to stop you at all times. <br/>explores all corners of ChernoMeat and searches for the dungeons that are hidden in the city in order to advance within the history and discover the past of VladiMeat. <br/><br/>! And beware of Rozhok, the mad scientist who tries to capture you no matter what !<br/><br/>! You'll be able to help VladiMeat return to his original form ¡<br/><br/><strong> History of the game </strong><br/><br/>A Young artist named VladiMeat walked through the park, looking for work. There he finds a newspaper, which had a recruitment add for people willing to experience a new vaccine.<br/>For Lack of money VladiMeat decides to go and ask about the job. Upon arrival he meets a scientist named Rozhok tall and with pointed hair. Rozhok talks to VladiMeat about the work and how much he would win, between his talk Rozhok asks VladiMeat if he was willing to take the job immediately, VladiMeat accepts the job.<br/>Rozhok injects a yellow substance, after a while VladiMeat begins to feel dizzy, causing it to become a piece of meat. Seeing that Rozhok was trying to neutralize him with a Taser VladiMeat comes running out of the lab.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:29", "background_image": "https://media.rawg.io/media/screenshots/922/922438136b5ab7022d328f56779b20ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JAV_Studio"], "genres": ["Adventure"], "publishers": ["JAV_Studio"], "esrb_rating": null}