{"id": 318490, "slug": "playpen-2", "name": "PlayPen", "name_original": "PlayPen", "description": "PlayPen contains more than 60 amusing sounds (animal sounds, human sounds, everyday sounds, etc) distributed on several common mini apps with a funny twist such as a notepad, a music mixer, a memory game, a telephone, and many more! <br/><br/>Plus imagine your little ones navigate along the pages of “the green book”, while the sounds transport them to familiar or new places and situations. Some scenes can be edited so your kids can choose whether their want a shark or a squib or an octopus in the Ocean View, or customize how their bedrooms look like at the Bedroom View, and order their favorite meals at the Restaurant View, among others. All the pages of this book can be accessed using VoiceOver, this feature will describe the whole scene while your kid is touching every element of it. <br/><br/>VoiceOver is enabled along all the app (you can activate VoiceOver in Settings/General/Accessibility/VoiceOver). Besides, this app is International, which means VoiceOver can speak all the languages pre existing on your iPhone! Even when your kid doesn’t need to use VoiceOver, you can activate it now and then,  since some hidden surprises can be found and the friendly voice will describe for them the views, objects, animals, food, numbers, in an educative manner. So this is a fun way for them to learn about nature, maths, and places.<br/><br/>This app is perfect to be used with Guided Access as well, (General/ Accessibility/Guided Access). This feature don't let the user leave the app using the Home Button, so you can rest assure your data, pics, etc stay out of reach.<br/><br/>You will see, it is fun and safe to play inside PlayPen!!", "metacritic": null, "released": "2017-11-12", "tba": false, "updated": "2019-10-22T14:38:52", "background_image": "https://media.rawg.io/media/screenshots/725/7253ac37b9eaba860d1092689b1c0e2d_mezIpSZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Magela Michaus Rivero"], "genres": ["Family"], "publishers": ["Magela Michaus Rivero"], "esrb_rating": "Everyone 10+"}