{"id": 318442, "slug": "fgteev-funnel-vision-tv", "name": "FGTeeV & FUNnel Vision TV", "name_original": "FGTeeV & FUNnel Vision TV", "description": "FGTeeV, the Family Gaming team, brings you the premiere YouTube channel for family gamers. Meet FGTeeV Duddy his wife FGTEEV Mom or Moomy, their sons Shawn, Chase &amp; Mike &amp; their daughter Lexi. The hyperactive crew of family gamers invites you to dive first into their world of gaming, sketch comedy, &amp; toy unboxing. Whether it’s the XBOX One, Wii U, Playstation 4 or Nintendo Switch...<br/><br/>FGTeeV has a gameplay for you. FGTeeV has some of the best gameplays from video games like Minecraft, Angry Birds, FNAF, Mario Kart, Super Mario Bros, Amazing Frog, Plants vs Zombies, Hello Neighbor, Slither.io, Roblox, Scribblenauts &amp; more! FGTeeV’s gameplays are part game review &amp; part scripted/improvised comedy sketch videos. On occasion FGTEEV also does creative unboxing videos like Yoshi's Surprise Eggs, Hello Neighbor Toys, Lego Dimensions Build &amp; Play and more!<br/><br/>FUNnel Vision is a family of 6 with 4 kids Lexi, Michael, Chase &amp; the baby brother Shawn! We like to say HAVE A FUNnel Day, like Fun 'Ol Day 'cause that's what we do on this channel! We Post New videos every week! Anything from Food Challenges, House Vlogs, Skits, Fun Road Trips &amp; Vacations, Candy &amp; food (like our Cupcake War!)! Videos with Play Doh, Dressed up in Costumes (SCARECAM VIDEOS!) Holiday videos like Easter, 4th of July, Halloween, Thanksgiving &amp; Christmas.<br/><br/>And that's not all! Watch all of your favorite videos from Doh Much Fun, like videos from Chase's Corner, Shawn's Circle, or even Chase's Kitchen. And for the OG fans, watch every video from the Skylander Boy and Girl channel!<br/><br/>In this app, you will find exclusive videos that you will not find anywhere else on the internet, as well as be able to catch sneak peeks of new videos weeks before the debut on YouTube! You can also buy our merch and connect to our own mobile game. All of the fun, in one place!", "metacritic": null, "released": "2019-04-18", "tba": false, "updated": "2019-10-22T14:38:50", "background_image": "https://media.rawg.io/media/screenshots/d15/d150fa9691534d1a86d3cb27500ebb76.jpg", "website": "https://funnelvisionfam.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Blobbyfish"], "genres": [], "publishers": ["Blobbyfish"], "esrb_rating": null}