{"id": 318513, "slug": "real-city-car-demolition-crash-test-full", "name": "Real City Car Demolition Crash Test Full", "name_original": "Real City Car Demolition Crash Test Full", "description": "Tired of usual parking and driving simulators? Well, maybe you should try something new? Something like crashing the car against the wall and break all bones of dummy inside?<br/>Be ready for an unusual experience you’ve never got playing usual driving games! Cause accidents, perform death-defying motor stunts, create traffic pile-ups of epic scale without any risk to yourself! Destroy cars, trucks, and dummies and destroy everything playing Real City Car Demolition Crash Test!<br/>Now your work is to managing crash tests in the car industry. This time you’ve settled field tests on the big city’s streets! Be ready to break all the dummies and destroy a lot of vehicles! Perform stunts, crash into the obstacles and break all the dummy’s bones to get maximum points! Check this amazing vehicle crash simulator and be ready for ultimate car destruction fun!<br/>Try to dismount different vehicles, various crash test dummies and mannequins and earn points to unlock new ones! Remember, the more damage you cause, the more points you earn, wreck, smash and destroy without mercy!<br/>Show the real power of destruction playing ultimate crash test simulator in 3D! Forget about usual driving games – now your task is to dismount all sorts of cars in this Real City Car Demolition Crash Test game!<br/>Real City Car Demolition Crash Test features:<br/>Ultimate crash test simulator in 3D – now on the streets of the big city<br/>Demolish crash test mannequins and dummies without any risk to yourself<br/>Break all the crash test dummy’s bones to earn more points<br/>Earn points to unlock new cars, vehicles, jumps, stunts and other facilities<br/>It’s time to start a crash test experiment! Many cars and vehicles to crash, many levels to complete, various stunts and jumps to perform – Real City Car Demolition Crash Test is the most unusual experience you’ve ever had!", "metacritic": null, "released": "2016-11-08", "tba": false, "updated": "2019-10-22T14:38:53", "background_image": "https://media.rawg.io/media/screenshots/b96/b96cfccd5c4f18462978c8426cafea1a_wVfZXXA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Racing"], "publishers": ["Tayga Games OOO"], "esrb_rating": null}