{"id": 318634, "slug": "ultra-death-2", "name": "ULTRA DEATH", "name_original": "ULTRA DEATH", "description": "<p>Dive head first into an intense journey through a concept of the future world where the fate lies in hands of heroes to save everyone from a creatue of immense power known simply as \"the big man\".</p>\n<p>Journey with characters you know and love from every corner of fiction you can think of while you battle your way through enemies with martial arts, swords, cat claws or magic!</p>\n<p>Uncover secrets and find routes to complete the game in different ways with multiple unlockable allies and paths to take throughout the game.</p>\n<p>Fight a variety of bosses in intense battles while managing money, resources and money.</p>\n<p>Unveil the rich, deep story with intriquite characters and storylines both apparent and hidden in various elements of the game, all while working towards a clear goal.</p>\n<p>Invite a few friends over for some snacks and movies while you tell stories from \"ULTRA DEATH\" and plan out your next strategies for your next journey in the game, this time with a new character and a new fighting style.</p>\n<p>Unlock achievements by completing hidden content in the game by seeing if you can find something secret and e-mailing it to me so I can tell you if it's an achievement because there's not actually an achievement system in the game.</p>\n\n<p>Be inspired by awesome characters and storylines to go to your local anime convention and cosplay as any of the characters in \"ULTRA DEATH\" and telling everyone you meet about this intriquite character and its story, all while showing off your insane cosplaying skills.</p>\n<p>Take photos with your friends in front of the end screen when you've just beaten the final boss in \"ULTRA DEATH\" it will be a memory for life.</p>\n<p>\"ULTRA DEATH\" promises a gaming experience for life and <em><strong>at least </strong></em>202,3 hours of replayable content for you and your friends and even your mother.</p>\n\n<p>Show your sister the character selection screen.</p>\n<p>All fun times in \"ULTRA DEATH\" it's a game you'll never forget a memorable and unique experience with great soundtrack and gameplay mechanics try it out now for free don't need to buy it cause it's totally free.</p>\n\n<p>ULTRA DEATH by baghdad_</p>", "metacritic": null, "released": "2019-05-12", "tba": false, "updated": "2019-05-13T03:46:11", "background_image": "https://media.rawg.io/media/screenshots/403/40390a850df17e2d736d988a01840b4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["baghdad"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}