{"id": 318754, "slug": "what-the-fox-2", "name": "What the Fox?", "name_original": "What the Fox?", "description": "<p>This game was made for the Abandoned Game Jam #2, by lacaulac (development, game mechanics and sound design) and Lutellia (graphics, level design and general advice).<br/></p>\n<p>You're a wizard looking for the newly discovered power of radiation, abundant in the dungeon you're currently trapped in. Harnessing the power of radiation sources will help you grow in power and make you able to fight against tougher enemies in order to get through the dungeon.<br/>Along the discovery of radioactive power, the mage community also discovered an anomaly, in the form of both alive and dead foxes, known as Srövinger foxes, named after the great mage Srövinger who first discovered them.<br/>They're present in the form of wooden boxes, which you can open to get help from the hopefully alive foxes, the problem being that there's a 50% chance that the fox will be dead when you open the box.<br/>You're able to use two magic spells:<br/>- Fayah, Left-click, 10 Mana Cost, Only deals damages.<br/>- Frizah, Right-click, 20 Mana Cost, greatly reduces the speed of the enemy while dealing some damages.<br/>The usage of radiation sources will grant you an extended amount of HP and/or Mana, as well as more HP and/or Mana regeneration.</p>\n<p>And now, for  something completely different  the controls:<br/>- WASD/ZQSD: Moving around<br/>- LMB/RMB: Using spells<br/>- F: Try to open a Srövinger Fox box<br/>- Alt-F4: Close the game</p>\n<p>Since I didn't have time to make a tutorial, here it is:<br/>The damages are particle based, which means that you need to be kind of close to the enemy for maximum damages (if there's only one and you're not using foxes at that moment).<br/>The green radioactive sources enhance your stats, whereas the red gives you back a part of your HP.<br/>The + and upper arrow icons respectively mean increase in Max value and increase of regeneration rate value. Red stands for health and purple-ish blue stands for Mana.</p>\n<p>I hope you'll enjoy the game at least as much as we enjoyed making it.<br/>Feedback is much appreciated.</p>\n<p>Special thanks for Eannyriel for helping with the conception of the Sroviner fox mechanic.<br/>Also a lot of thanks to the testers: Maxiberdy, Eannyriel (again?), rage against the mouton, HYDRANT, PR3D4, Thelostpig and Jarjar Binks.</p>\n<p>Used resources:<br/>- Main font: 04b-30 https://www.dafont.com/04b-30.font?text=pixel<br/>- Text on map font: MoonCrato https://www.dafont.com/mooncrato.font<br/>- Music: Heroic Demise, by Matthew Pablo http://matthewpablo.com/<br/>- 0x72's dungeon tilesets and sprites: https://0x72.itch.io/16x16-dungeon-tileset https://0x72.itch.io/dungeontileset-ii</p>", "metacritic": null, "released": "2019-05-12", "tba": false, "updated": "2019-08-28T23:16:27", "background_image": "https://media.rawg.io/media/screenshots/5e8/5e8977dd10aa76727511f7a4c13e571b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["lacaulac", "Lutellia"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}