{"id": 318763, "slug": "the-hal-effect", "name": "The HAL Effect", "name_original": "The HAL Effect", "description": "<p>In The HAL\r\nEffect, the player plays as a middle-aged systems engineer, Noland Dent,\r\nwho is charged by his employer, AstroTech Mining, to fix a faulty AI system on\r\none of their remote asteroid mining installations.  That sounds all wonderful and boring until\r\nNoland is informed of the faulty AI that controls the facility’s security\r\nsystem and that the AI is now convinced that every person who steps foot on the\r\nbase is an intruder to be executed on sight, regardless of the status of their\r\ncompany RFID badge.  Wielding a plasma\r\ngun with limited charge and a heavy spanner, Noland must make his way from the\r\nentry airlock through the top level of the facility and into the subterranean\r\nlevel where the security control center is located.  </p><p> To get to the security control center, the player has some strategic choices\r\nregarding how to avoid or neutralize the various security androids and\r\nantipersonnel turrets placed around the installation.  The brute-force “kill-em-all” method provides\r\na simple approach but will require the player to find extra charge packs for\r\ntheir weapon.  A stealthy approach\r\nminimizes the amount of resources the player will need to accumulate through\r\neach level but affords more challenging gameplay.  Once at the control panel, one final\r\nchallenge faces the player.  They must\r\nleverage their puzzle-solving skills to disable the AI without accidentally\r\ntriggering the self-destruct sequence.</p>", "metacritic": null, "released": "2019-05-12", "tba": false, "updated": "2019-05-13T04:17:31", "background_image": "https://media.rawg.io/media/screenshots/277/277051e5c0f4f87c09c7dda9a39704a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["J. Douglas Patterson"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}