{"id": 318818, "slug": "through-the-panels-demo", "name": "Through the Panels [Demo]", "name_original": "Through the Panels [Demo]", "description": "<strong>Mimi Stokes is an ordinary girl who dreams of two things: escaping her sleepy small town, and becoming a comic artist.</strong>\n<p>So when her dad's job uproots her family and lands her in a new school in a new country, Mimi is thrilled -- especially as her new friends (and foes) all seem like characters straight out of her favourite mangas and dramas.</p>\n<p>Struck by inspiration, Mimi starts her first comic series, based on the lives of her school mates. However, drama usually has to be instigated, and before she knows it, Mimi soon finds herself meddling in their personal matters in order to get more ideas for her story.</p>\n<p>But can anyone blame her, really?<em> It's for the sake of her art!</em><br/></p>\n<em>Through the Panels</em> is a comedy/slice-of-life visual novel <strong>currently in development</strong>.\r\n<p> This demo contains the beginning of the game, and provides an introduction to all the main pursuable characters. While it should give you a good idea of what to expect in terms of tone, setting, and character dynamics, things may still be subject to change in the full game, and it's not guaranteed that save files will carry over.</p><p><strong><em>Through the Panels</em> is suitable for ages 13+.</strong> The game contains infrequent uses of strong language, and references to bullying &amp; underage drinking.<br/></p>More information available on the game's <strong>website</strong>.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n    \t\r\n        \r\n    \r\n\r\n\r\n\r\n\r\nFull profiles available on the game's <strong>website</strong>.\r\n\r\n★ Seven Characters, Seven Routes ★\n<p>Choose from 7 different characters to befriend (and interfere in the personal affairs of). Each route has multiple endings, determined through player choice. Replay to your heart's content!</p>\n★ Determine Your Own Personality ★\n<p>In addition to being able to choose a name and appearance for the player character, your choices in the common route shape your character's personality. The personality you have will open up different choices and dialogue options in the individual routes.</p>\n★ Build or Break Relationships ★\n<p>The game's story isn't only about your own friendship with the characters, but also the relationships and dynamics between everyone else. Help sworn enemies put aside their differences and play nice, or even become a matchmaker for some of your classmates!<br/></p>\n★ Creep on Social Media ★\n<p>You'll be able to check your phone at any time to see the latest on your friends' InstaBook profiles. Not only that, you'll sometimes even be able to see what they thought of the choices you made!</p>\nThere will be two versions of Through The Panels available at release: <strong>Free</strong> and <strong>Premium</strong>.\r\n<p>The <strong>Free</strong> version will include the <strong>two full routes</strong> for Sami and Umi.<br/>The <strong>Premium</strong> version will include <strong>all seven full routes</strong>, as well as other additional unlockable content.</p>\n<br/>\n<p><strong>SweetStrawberry</strong><br/>Writing</p>\n<p><strong>PeroxidePrince</strong><br/>Art, Writing, Programming</p>\n<p><strong>Daikon</strong><br/>Chibi Art</p>Full list of contributors &amp; voice cast over at the game's <strong>website</strong>.\r\n\r\n\r\nHave some feedback you'd like to share?\r\n<p>We have set up a survey for players here! All responses are appreciated, and will help us in improving the full product.</p><p>Alternatively, please feel free to leave your comments below!<br/></p>\r\nWant to show your support?\r\n<p>Follow us on Twitter for regular updates! Likes, retweets, and replies are always appreciated.</p><p>If you'd like to do a little more, and get a closer look at our development process, please consider pledging to our Patreon!<br/></p>", "metacritic": null, "released": "2019-05-11", "tba": false, "updated": "2019-05-13T04:30:53", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bdeea10f178ec84276dd59738753970.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["STARDUST★SODA"], "genres": [], "publishers": [], "esrb_rating": null}