{"id": 318919, "slug": "polarity-how-i-learned-to-stop-caring-and-love-m-2", "name": "Polarity: How I Learned to Stop Caring and Love Magnetism (Matt Danielson)", "name_original": "Polarity: How I Learned to Stop Caring and Love Magnetism (Matt Danielson)", "description": "<p>    Polarity, or “How I Learned To Stop Caring And Love Magnetism”, is a simple block puzzle game made using PuzzleScript. The objective of Polarity is to push the colored block objects into their corresponding slots. The hitch being that the player, depending on which color they are, pushes the blocks of the same color a space away, or pulls the blocks of a different color closer to them. The “positive” or “negative” charges of the player <em>and </em>the blocks determines where they will go! On top of this, the blocks will not lock into the goals when pushed or pulled into them- meaning that the player must be aware of their actions at all time to ensure that they can complete the puzzle. Each block must correspond with the right “charge” in order to beat the level! Each puzzle has been designed to make sure that the player is challenged or forced to think in some manner. Polarity’s unique setup means that players will also have to carefully navigate to avoid getting stuck through the power of their own magnetism.</p>\n<strong><em>Game Created by: Matt Danielson and Wilson Russell</em></strong>", "metacritic": null, "released": "2019-05-10", "tba": false, "updated": "2019-05-13T04:58:02", "background_image": "https://media.rawg.io/media/screenshots/24e/24e912123df52b1669b15e48758bc0f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["Matt Danielson"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}