{"id": 3190, "slug": "letter-quest-grimms-journey-remastered", "name": "Letter Quest: Grimm's Journey Remastered", "name_original": "Letter Quest: Grimm's Journey Remastered", "description": "<p>The grim reapers Grimm and Rose need your help to defeat a legion of monsters, ghosts, and evil bunnies using the power of words!<br />\nSpell words to battle monsters, earn gems and use them to purchase upgrades, books, special items, potions, and much more! Letter Quest is a game about using your linguistic skills to survive. It&#39;s a turn-based RPG featuring high-res artwork, clever wordplay, and a great soundtrack.<br />\nLetter Quest, RemasteredNew ENDLESS MODE - choose your favorite background art, music, character, weapon, and letter tiles and see how long you can survive!<br />\n8 more achievements, now 60 in total!<br />\nFully animated enemies and shopkeepers<br />\nA brand new soundtrack in addition to the original music - choose your favorite!<br />\nTooltips during battle<br />\nFully rewritten in Unity, allowing for a smoother experience, better resolution options, higher-quality music and sound effects, and much more!<br />\nWindows, Mac, AND Linux support<br />\n70 quests to complete<br />\nA built-in dictionary of over 192,000 English words that is frequently updated<br />\nKeyboard Support<br />\nAll of the battles in Letter Quest Remastered can be played with a keyboard - no more hunting for letters with the mouse if you don&#39;t want to! Simply type letters to add them to the current word, hit backspace to remove the last letter typed, and much more!<br />\nLetter Quest Remastered also supports setting key bindings for all hot-keys right in the game&#39;s options menu.Touch Support<br />\nEverything in Letter Quest Remastered works great on touchscreen laptops and computers, including Microsoft Surface Pro - you can even swipe to scroll lists and the map!About Bacon Bandit GamesWe&#39;re a two-man Canadian game dev team attempting to make great games. Letter Quest Remastered is a completely rewritten version of our first game, Letter Quest: Grimm&#39;s Journey.<br />\nThe original Letter Quest was written in Flash and limited the platforms that we could release it on, so we spent over 600 hours rewriting it in Unity and are now proud to fully support Windows, Mac, and Linux!More Infohttp://www.facebook.com/baconbanditgames<br />\nhttp://twitter.com/thebaconbandits</p>", "metacritic": null, "released": "2015-08-05", "tba": false, "updated": "2023-10-18T00:38:14", "background_image": "https://media.rawg.io/media/screenshots/ae6/ae66a3c246259aaba3bc1c75463c7b9d.jpg", "website": "http://www.letterquestremastered.com", "rating": 3.2, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 412, "beaten": 8, "toplay": 5, "dropped": 14, "playing": 3}, "playtime": 5, "achievements_count": 120, "ratings_count": 30, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 30, "platforms": ["Xbox One", "PlayStation 4", "macOS", "Linux", "PC"], "developers": ["Bacon Bandit Games"], "genres": ["Casual", "Indie"], "publishers": ["Digerati Distribution"], "esrb_rating": "Everyone"}