{"id": 319027, "slug": "coffee-crisis-itch", "name": "Coffee Crisis (itch)", "name_original": "Coffee Crisis (itch)", "description": "<p><strong>Save the Metal, Save the World, Save the Coffee!</strong></p>\n<p><strong>Coffee Crisis</strong> is a neo-rogue brawler that puts you in the shoes of the only baristas on Earth with enough <strong>heavy metal</strong> in their veins to fend off an <strong>alien assault</strong>. Play solo or join up with a friend to <strong>fight across eight unique locations</strong> ranging from your Coffee House HQ to the far reaches of outer space. Go up against an army of wild <strong>alien enemies</strong>, and the humans they have brainwashed with a <strong>variety of weapons</strong>, special moves, suplexes, and coffee!<br/><br/><strong>The Smurglian</strong> race has come to Earth and they're not leaving until they steal our three most prized commodities: heavy metal, free Wifi, and coffee. Crunch through fistfuls of alien meat as you stop their<strong> invasion</strong>, and enjoy random modifiers to the enemies and action on each playthrough. It's a totally unique cup of beat 'em up action every time you play!</p>\n<p><strong>Features</strong></p>\n<ul><li>Tear off fistfuls of alien meat in Neo Rogue Brawler action!</li><li>Jam out with a pal in Local Co-Op Play!</li><li>Encounter random modifiers that could make you an invincible killing machine or summon a swarm of raging possessed cowgirls! You'll never experience the same cup of cosmic coffee carnage twice!</li><li>Bang your head to an incendiary heavy metal soundtrack!</li><li>Meet heavy metal bands Pyschostick, Lords of the Trident, Nile, and Terrorizer!</li><li>Rock out with retro metal influencers!</li><li>Already averted the crisis? Come back for more in Death Metal Mode, where the difficulty is cranked to 11!</li><li>Twitch/Mixer integration lets you enjoy the game while keeping both hands on your coffee cup!</li></ul>\n<p>So grab a hot mug and <strong>save the world!</strong><br/></p>\n<p><strong>A Game Developed by Mega Cat Studios</strong></p>\n<p>Published by Zerouno Games</p>", "metacritic": null, "released": "2019-05-10", "tba": false, "updated": "2019-08-28T23:16:26", "background_image": "https://media.rawg.io/media/screenshots/9bb/9bbc519acaf3cdb31204cb4f41c5aabd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Zerouno Games"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}