{"id": 319146, "slug": "black-baron", "name": "Black Baron", "name_original": "Black Baron", "description": "Black BaronThe game is a flying boat commander simulator. At the heart of its mechanics are microcontrol of your crew members.Story<strong>Black baron</strong> is the story about young captain who has lost his brother in the fight for his place in the sun. To revenge, you have to follow the tracks of the most dangerous pirate of the flying islands — Black Baron. Only one try, only one life. Can you fulfill your revenge?MechanicsIt is necessary to manage the crew by distributing tasks inside the ship. <br/>Install powerful guns on your ship in order to destroy your enemies. Or take them board them with swords. <br/>Complete quests for buffs and rewards for your crew. <br/>Fight with other ships to collect information about the Black Baron. Find him and avenge your brother. <br/><br/>Only you decide how you will achieve victory.<br/><br/><ul> <li><strong>Three types of ships</strong>: small, medium and big.  <br/></li><li><strong>Unlimited number of sector</strong> combinations: you never know which one you are shooting at. <br/></li><li><strong>Different guns</strong> with special effects: freezing, burning, etc.<br/></li><li><strong>Three clans</strong>:  allow you to gather a unique crew.<br/></li><li><strong>Interesting text quests</strong>: test of your deductive abilities, logic and just a reason to laugh.<br/></li><li><strong>Beautiful soundtrack</strong>:  accompanies player's adventures.</li></ul>", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-08-28T21:45:27", "background_image": "https://media.rawg.io/media/screenshots/f0e/f0e94871f3f582879c49511867df5902.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["toR gaming"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["toR gaming"], "esrb_rating": null}