{"id": 319143, "slug": "killsquad", "name": "Killsquad", "name_original": "Killsquad", "description": "This is not the future you dreamt of. The Galaxy is in chaos, planets go rogue, and mega-corporations assemble Killsquads to raid whatever riches and bounty are left. Welcome to Killsquad: a hardcore action RPG done by hardcore RPG fans. A game that blends the best of the genre and presents a new universe for you to discover. Set up your team, choose your heroes, weapons and gear, and unleash hell on a fast-paced battle through hordes of monsters and deadly bosses.<br/><br/><strong>KEY FEATURES</strong><br/><br/><strong>HIGH INTENSITY GAMEPLAY</strong><br/><br/><br/><br/>Killsquad looks like an RPG but plays like an action game. This creates a unique gameplay style you can enjoy with a keyboard or gamepad. Our focus is on short, adrenaline pumping missions you can enjoy solo or 4 player coop.<br/><br/><br/><strong>CHOOSE AND CUSTOMIZE YOUR HEROES</strong><br/><br/><br/><br/>Play as any of the four unique space bounty hunters, each with a class and a skill tree you unlock as you progress. Each is highly specialized, and has a set of starting skills and passive abilities. Then, on each level up, you get an opportunity to customize your character with new skills to adapt to your play style. <br/> <br/><strong>A COMMUNITY OF BOUNTY HUNTERS</strong><br/><br/><br/>Killsquad is a game designed for the community: contracts are offered in real time for squads to embark on. Sign up for a contract with your squad, or join other bounty hunting squads who need help. Compete with all squads worldwide to earn contract rewards and progress on the game Meta on an ever-evolving universe.<br/><br/><strong>THE PLANET IS YOUR ENEMY</strong><br/><br/><br/><br/>Our planets are built on the fly, so each mission is designed to be highly replayable. And they come with a selection of nasty surprises: from meteor storms, to minefields, from huge bosses to an assault by the Federation Forces, our planets want to make sure you understand you're not welcome here. <br/><br/><strong>A RICH UNIVERSE</strong><br/><br/><br/>The Killsquad universe is rich and expanding: dozens of weapons for you to unlock, alien races you can browse in our encyclopedia, resources you can collect and then use to unlock exclusive perks for your weapons... and more coming soon!", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-28T16:06:53", "background_image": "https://media.rawg.io/media/screenshots/e0e/e0ec4788a286aef109574c324e97d135.jpg", "website": "", "rating": 3.42, "rating_top": 4, "added_by_status": {"yet": 22, "owned": 596, "beaten": 4, "toplay": 2, "dropped": 6, "playing": 1}, "playtime": 4, "achievements_count": 147, "ratings_count": 12, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC"], "developers": ["Novarama"], "genres": ["Action"], "publishers": ["Novarama"], "esrb_rating": null}