{"id": 319215, "slug": "gregor-hills-haunted-hospital", "name": "Gregor Hills Haunted Hospital", "name_original": "Gregor Hills Haunted Hospital", "description": "Gregor Hills Haunted Hospital is a 2D Top Down survival horror game based on the story of one of the most Haunted hospitals located in Gregor Hills.<br/><br/>George, a Paranormal Investigator, arrived at the most haunted hospital of Gregor Hills. This hospital was founded in 1940 and was operating normally. But in the year of 1990, a few sections of the hospital had been abandoned due to the reports of the paranormal activities. Moreover, during the 1970s, there was an epidemic which resulted in the death of lots of patients. There was an incident of murder in the hospital during the 1980s.  In fact, a doctor who was associated with surgery department, was murdered in one of the rooms in the hospital. It is said that the doctor's spirit still haunts the place. At present, only a small portion of the hospital is active. But it has been reported that the shadows, apparitions are still observed by various patients and doctors. Besides, disembodied voices, and whispers can still be heard to this day especially during the evening and midnight hours. Due to the various tragic incidents and Satanic rituals taking place in the abandoned section of the hospital in the past, it has become the hot spot of the paranormal activities.<br/><br/><br/><br/>You play as George who entered the Haunted hospital with various scientific equipment like EVP(Electronic Voice Phenomena) recorder, Ovilus device, SLS(Structured Light Sensor) camera, and multiple night vision cameras to prove the paranormal. Will he be able to collect the evidence of the paranormal and get out of the hospital alive?<br/><br/><strong>Key Features:</strong><br/><ul><li>Explore the Haunted Hospital and face the paranormal.</li></ul><ul><li>Lots of spirits lurking in the shadows.</li></ul><ul><li>Use your scientific equipment to prove the paranormal.</li></ul><ul><li>Explore the basement and morgue for further evidence.</li></ul><ul><li>Nearly Half an hour duration of paranormal investigation.</li></ul><br/><br/><br/><strong>Note: I am a solo indie game developer and I have done graphics, animation, programming, character designing, level design etc except for the music. I hope you will enjoy the game.</strong><br/><br/>", "metacritic": null, "released": "2019-06-07", "tba": false, "updated": "2020-01-24T14:52:14", "background_image": "https://media.rawg.io/media/screenshots/90f/90fac8ae50958a377583818bb559cdb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Anamik Majumdar", "AMAXANG GAMES"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Anamik Majumdar"], "esrb_rating": null}