{"id": 319204, "slug": "wingsuit-gudvangen", "name": "Wingsuit: Gudvangen", "name_original": "Wingsuit: Gudvangen", "description": "Take to the skies in Wingsuit: Gudvangen and pursue the daredevil career of a professional wingsuit pilot with the action turned up to 11. Put on one of the wingsuits at your disposal, choose an exit point, and make Gudvangen your playground. The classical action sports location has been faithfully recreated as an open world for you to explore, so you can fly the same lines you've seen in your wingsuit heroes' recordings, or carve your own way down the mountainside. When you're done blazing sick lines, you can string together high risk trick combos for a new high score on the global leaderboard, test your skill as a camera man, or try your hand at the truly insane Survival Mode, where you have to dodge nasty weather and SAM sites. On top of all this, the world is packed with challenging gaps and collectibles, so there is always something fresh to explore around the corner.Features<ul><li>Six wingsuits, each with its unique flying characteristics.<br/></li><li>Five exit points, with a balloon and an aircraft at your service, in addition to three classic base jumping exits.<br/></li><li>65 square kilometers of open world, created from a high fidelity digital model of Gudvangen, Norway<br/></li><li>Record The Pro challenges, where you get to test your skills as a camera man.<br/></li><li>Survival Mode, where you face daunting odds without a parachute.<br/></li><li>Tricky gaps.<br/></li><li>Global leaderboards.<br/></li><li>Instant Replay.</li></ul>", "metacritic": null, "released": "2019-06-25", "tba": false, "updated": "2019-08-28T21:45:22", "background_image": "https://media.rawg.io/media/screenshots/440/440c14b236c62f48048dfe3802d74b4b.jpg", "website": "http://ninjawhalestudios.com/WingsuitGudvangen", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ninja Whale Studios"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["Ninja Whale Studios"], "esrb_rating": null}