{"id": 319210, "slug": "old-gods-rising", "name": "Old Gods Rising", "name_original": "Old Gods Rising", "description": "Thomas Winston, Professor of Ancient History and recently fired host of the popular TV show “Finding Britain,” has been in hiding for weeks.<br/>\n<br/>\r\nPublicly embarrassed by the revelation that his latest book was largely based on fraudulent evidence, he decides to accept an invitation from maverick film director, Maz Kayfer, to act as a consultant on his new film: “Old Gods Rising.”<br/>\n<br/>\r\nAshgate University, where the filming will take place, seems to be an ideal location, but when Tom arrives, things get very strange, very quickly.  Has he become the unwitting star of Kayfer’s latest film?  Or, has he stumbled into something far more sinister?<br/>\n<br/>\r\nOld Gods Rising is a first-person adventure mystery that puts you in the role of disgraced History Professor, Thomas Winston, as you explore Ashgate University and try to uncover the truth behind the strange events that seem to be unfolding.<br/>\n<br/>\r\nExamine architecture and artifacts to find clues about the university's ancient origins, and use your expertise to decipher long-forgotten languages and cryptic carvings.<br/>\n<br/>\r\nAs you search for answers, solve the puzzles that block your progress and uncover hidden areas that could help you decide what is real and what is not.<br/>\n<br/>\r\nCollect phone numbers, and navigate conversations to help you build a more complete picture of what is actually happening and why.<br/>\n<br/>\r\nAre the Old Gods rising?  It's up to you to decide.", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-22T04:01:35", "background_image": "https://media.rawg.io/media/screenshots/3f3/3f3c5edef8c2eb1b509ba6977dd8e59a.jpg", "website": "https://www.badbloodstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 16, "beaten": 2, "toplay": 1}, "playtime": 4, "achievements_count": 41, "ratings_count": 1, "suggestions_count": 491, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Bad Blood Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Bad Blood Studios"], "esrb_rating": null}