{"id": 319257, "slug": "snake-blast", "name": "Snake Blast!", "name_original": "Snake Blast!", "description": "Guide your snake with a finger swipe and shoot hundreds of balls to break the bricks. <br/>Collect additional balls to enhance your shooting prowess.<br/>Get as big and as far as possible!<br/><br/>It is simply delightful to snake your way through this ball frenzy!<br/><br/>Game Features:<br/>  - 50+ skins to customize your snake<br/>  - Endless fun<br/>  - Intuitive swipe control<br/>  - Thrilling power-ups<br/><br/><br/>VIP PASS<br/><br/>VIP Pass is a weekly subscription after a 3-day free trial. It removes all banner ads and pop-ups. Furthermore, you receive immediately 3 exclusive skins, you will double your earnings, and you will be able to play offline for a better experience.<br/><br/>If you take the subscription, payment will be charged to your Apple ID account at the confirmation of purchase. The subscription automatically renews unless it is canceled at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period, and identify the cost of the renewal. You can manage and cancel your subscriptions by going to your App Store account settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>CANCELING TRIAL OR SUBSCRIPTION<br/><br/>Please check https://support.apple.com/HT202039<br/><br/>Terms of Use:  https://advenworks.com/terms-of-use/?game=Snake%20Blast<br/>Privacy Policy: https://advenworks.com/privacy-policy-sub/?game=Snake%20Blast", "metacritic": null, "released": "2019-03-03", "tba": false, "updated": "2019-12-09T01:50:11", "background_image": "https://media.rawg.io/media/screenshots/bbe/bbe1ecd887d09ba9882ca791cd617cff.jpg", "website": "http://advenworks.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Advenworks"], "genres": ["Action", "Casual"], "publishers": ["Advenworks"], "esrb_rating": null}