{"id": 319462, "slug": "hexa-1010-fill-hexagon-blocks", "name": "Hexa 1010 :Fill Hexagon Blocks", "name_original": "Hexa 1010 :Fill Hexagon Blocks", "description": "Ready for a completely new hexagon puzzle adventure with 5 game modes? Go with Hexa 1010, an addicting brain teaser with simple yet challenging hexa puzzles designed to train your brain. Pick a game mode, use the 3 different shapes and place them on the hexagon jigsaw puzzle. Can you manage to dominate the leaderboards in all 5 game modes? Immediately start having fun with one of the best hexa block games!<br/><br/>ULTIMATE BRAIN TRAINING<br/>Train your brain completely free, fun and challenging hex puzzle game, suitable for the whole family. Develop your logic with this simple game that lets you combine puzzle blocks, build and destroy structures by creating lines. Enjoy addicting brain training exercises with the power of Hexa 1010! <br/><br/>REQUIERS GOOD STRATEGY<br/>Don’t be fooled by its simplicity. While the concept of Hexa 1010 Fill Hexagon Puzzle is dragging the small hexagons, singularly or in groups, onto the main board, the strategy of doing so will be what will challenge you to the fullest.<br/><br/>5 GAME MODES:<br/>Pick between: relax, bomb, time and hard and enjoy countless hours of challenging and entertaining puzzle hex mobile gaming. Remember, no time limit, no color matching, no match 3 repetition! Just fill the grid with shapes to form a line and train your brain with Hexa 1010!<br/><br/>Hexa 1010 FEATURES:<br/><br/>- all new hexa 1010 challenge<br/>- vibrant HD graphics<br/>- sleek polished design and typography<br/>- intuitive UI &amp; gameplay<br/>- 5 game modes<br/>- Global ranking system<br/>------------------------------------<br/>See why we are one of the best hexa block puzzle games of the year.<br/>Get the new hexa challenge for FREE and top the global hex game puzzle rankings!", "metacritic": null, "released": "2017-01-17", "tba": false, "updated": "2019-10-22T14:39:08", "background_image": "https://media.rawg.io/media/screenshots/0fc/0fca555ff78af9f2e40b80517cf03b55.jpg", "website": "http://www.gudogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hoang Vinh Nguyen"], "genres": ["Board Games", "Puzzle"], "publishers": ["Hoang Vinh Nguyen"], "esrb_rating": "Everyone 10+"}