{"id": 319505, "slug": "outlaws-american-racing", "name": "Outlaws - American Racing", "name_original": "Outlaws - American Racing", "description": "Keep the engines running and get ready to endless entertainment in dirt race tracks. This the Stock Car Championship. Get the points from the races, be the champion of the season. Full Season with teams. Upgrade your car with your performance. Build your racing team. Get your racing team to the top. Play all Stock Car season around USA. Best Driving experience. <br/><br/>- Find a Sponsor for your Rookie Season. <br/><br/>- Get the XP points, become the First driver of your team. <br/><br/>- Earn game money after all races.<br/><br/>- You won't be forced to buy any special deals.<br/><br/>- No In-app Purchase that will annoy you.<br/><br/>- No ads.<br/><br/>- all levels unlocked<br/><br/>- Simple controls <br/><br/>- Feels like you are in a sprint car.<br/><br/>- Best 3D graphics.<br/><br/>- 10 challenging tracks.<br/><br/>- Touch to accelerate, tilt to drift the car<br/><br/>- Your car is very powerful and tuned for drifting.<br/><br/>- You can watch your last driving at the end of the game.<br/><br/>- Can control the all racing team features like Sponsor, Payments, Staff, Mechanics.<br/><br/>- Can upgrade your car for better handling. <br/><br/>- This is the best chance of you to improve your driving skills. <br/><br/>- Win the Championship at the end of the Season.<br/><br/>TIPS: Control your top speed on corners for better drifting.<br/><br/>HIGH SPEED DRIVING<br/><br/>Race at high speeds, drive against cars!<br/><br/>Nothing is forbidden in Stock Car Racing, More Danger = More Points!<br/><br/>HIGH QUALITY GRAPHICS<br/><br/>Enjoy the cutting edge 3D graphics with realistically created environments and amazingly detailed cars.<br/><br/>THE CAR OF YOUR DREAMS<br/><br/>Upgrade your car to the limits, customize with Motor, Transmission, Brakes.<br/><br/>Make it better, faster, stronger and prettier.<br/><br/>SLOW MOTION MODE<br/><br/>Don't push your luck in sticky situations, slow time for easier manoeuvres. <br/><br/>It does not last forever but quickly refills.<br/><br/>EXPLORE DIFFERENT THEMES<br/><br/>Take a ride in 10 challenging tracks.<br/><br/>Each environments are realistically created and highly detailed.<br/><br/>DRIVE IT YOUR WAY<br/><br/>Control your car as you like.<br/><br/>Choose Steering Wheel, Buttons, Gyro or even Joystick.<br/><br/>MULTIPLE CAMERA ANGLES<br/><br/>Race through traffic with Top or Back camera, or just dive into the action with Hood camera.<br/><br/>Each camera angle offers a unique driving experience.<br/><br/>We want you to experience pure dirt experience and earn your way to leadership.<br/>Come on download the game , join us and rate us 5 stars to encourage us improve the game continuously.", "metacritic": null, "released": "2019-05-15", "tba": false, "updated": "2019-08-02T05:24:38", "background_image": "https://media.rawg.io/media/screenshots/cf3/cf3158bb92c445500a50d19528a94054.jpg", "website": "https://www.facebook.com/zgamesstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Serdar Akgul", "Z Game Studios"], "genres": ["Sports", "Racing"], "publishers": ["Serdar Akgul"], "esrb_rating": null}