{"id": 319650, "slug": "the-pain-they-cause-devil-gods-free-edition", "name": "The Pain They Cause; Devil Gods -Free Edition", "name_original": "The Pain They Cause; Devil Gods -Free Edition", "description": "<p><strong>Summary</strong><br/></p>\n<p><em>The Highly Anticipated Visual Novel/RPG -3 Years- In the Making is Finally Here! </em><br/></p>\n<p>Set in the UCT (United Countries of Terra). The Pain They Cause; Devil Gods is a visual novel with an enriched story, developed with the help of RPG Maker VX Ace, about three life long friends who come into conflict after a strange phenomenon tears them apart at the seams (literally).</p>\n<p>-Inspired by popular Visual Novels such as <strong><em>Higurashi no Naku Koro ni</em> </strong>and <em><strong>Steins;Gate</strong></em><strong><em>-</em></strong><br/></p>\n<p>In this indie game we ask the question: “Why do creators force their characters to suffer? And how can they really love them?” In a story about trust, betrayal, conflicts of morality and hope vs. reality.<br/></p>\n<p>Made for Windows PC.</p>\n<p><strong>Frequently Asked Questions</strong><br/></p>\n<ul><li><strong>Why RPG Maker VX Ace?</strong><br/>The reason for using RPG Maker VX Ace is that we wanted to give the game an old-timeless feel reminiscent of the MS Dos Visual Novels we know and love. Made new. While including simple RPG elements.</li></ul>\n<ul><li><strong>Free Edition? What does this mean?</strong><br/>Why this is the free version of our little project of course. While we <br/>do have plans for a paid version (currently in development), we wanted \r\nto get our game out to as many people as we possible can. So here it is. The \r\nfree edition! (But you can choose to donate if you like! It would be a big help in furthering the development!)</li></ul>\n<ul><li><strong>Free vs. Paid: What's the Difference?</strong><br/>The differences are somewhat minor. While in the free version you have complete access to the entire game. The plans for the paid version are currently to include minor improvements, while doubling down on the overall plot. Adding a whole new story arc with minor adjustments to the overall presentation. At the moment both versions of the game are exactly the same. (However, we have a few more treats for those of you waiting on the paid version.)</li></ul>\n<p>        <strong>Note:</strong> A \"Paid\" version cannot exist without the proper support, however, as there is no guarantee.</p>\n<ul><li><strong>What Do I Get by Donating?</strong></li>To those of you who chosen to donate. Thank you! You are forever in our gratitude as we are in your debt! We cannot offer anything concrete at the moment. But just know we would like to do something special for you guys-- whatever the amount! Know you played a huge part in the further development of this game. <br/></ul>\n<ul><li><strong>What does \"The Pain They Cause,\" mean? And why/who are the \"Devil Gods?\"</strong>To put it bluntly, The Pain They Cause is the first in a series of games using the label/branding. A list of visual novels which all share the same morale ideology. The Pain They Cause being how we feel towards others and how others make us feel. It's the idea that the \"heart\" cannot exist without interaction between one or more people. The \"Devil Gods\" in the title represent the \"creators,\" who do evil to those they create.  It's the example of conflict in stories and how so many stories simply cannot exist without it. Why do we wish to hurt the very ones (humans) we create?</li></ul>\n\n<ul><li><strong>Can I run it?<br/></strong></li></ul>\n<p>       If you can run RPG Maker VX Ace you can run this game!</p>\n<p>_______________________________________________________________________________________________</p>\n<ul><li>SPECIAL THANKS AND SCRIPTS!</li><li>-RPG Maker VX Ace &amp; RTP-</li><li>Enterbrain</li><li>-Super Simple Mouse Script 1.10-</li><li>Script by: Near Fantastica</li><li>SephirothSpawn</li><li>Amaranth Games</li><li>Shaz</li><li>-Ace Message System v1.05-</li><li>Script by: Yanfly</li><li>-Galge Conversation Script-</li><li>Saba Kan of Petit Rare</li></ul>\n<p>\n</p>\n\n\n<p>_______________________________________________________________________________________________</p>\n<p>Follow the Developer @</p>\n<p>Twitter: https://twitter.com/ChrisSwordPro</p>\n<p>DeviantArt: https://www.deviantart.com/tekajihatake</p>\n<p>Website: https://projectcdev.wordpress.com/<br/></p>\n<p>YouTube: https://www.youtube.com/channel/UCTPJ8j-nUZKgZd0bACEDYGQ<br/></p>\n<p>Please Share!</p>\n<p>Warning: This Games Contains/Alludes to Some Violence and Harsh Profanity.<br/></p>", "metacritic": null, "released": "2019-05-16", "tba": false, "updated": "2019-05-17T05:20:39", "background_image": "https://media.rawg.io/media/screenshots/6d4/6d409317645fa0f0fac07c51b6eb95d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Project C. Dev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}