{"id": 319642, "slug": "moo-lander-demo", "name": "Moo Lander Demo", "name_original": "Moo Lander Demo", "description": "<p>Moo Lander is a 2D <strong>adventure platformer</strong>, where you take control over your people’s last remaining flying saucer to scour varied environments in search for the source of infinite amounts of precious <strong>milk</strong>. Discover hidden <strong>secrets</strong>, solve <strong>puzzles</strong>, fight intelligent <strong>enemies </strong>and tame the <strong>Mighty Cows</strong>!</p>\n\n<p><strong>Milk</strong> - the energy source so pure that it’s rivaled by the brightest hypernovas, has been lost to your people after a long and brutal conflict.<br/>Your mission is to recover ancient device capable of producing infinite amounts of it, from Solar System.<br/>Can you get to the device in time? The fate of the Landers is in your hands!</p>\n\r\nTame the Mighty Cows\r\n<p>Each one of those powerful bosses will pose a considerable threat and is a challenge worth remembering!\r\n</p>\r\nUpgrade your ship\r\n<p>Unlock a set of over 6 unique abilities and meaningful upgrades branching into two separate trees!\r\n</p>\r\nFight a variety of enemies\r\n<p>Over 20 kinds of intelligent enemies are waiting for you to prevent you from fulfilling your goal. Each of them requires a different approach to deal with!\r\n</p>\r\nEngaging single-player campaign\r\n<p>Play through over 5-hour long emotional campaign full of memorable characters and plot twists!\r\n</p>\r\nMultiplayer\r\n<p>Experience the game with your friends in 4 player couch co-op!\r\n</p>\r\n5 unique terrains\r\n<p>Discover beautiful hand-crafted, yet lethal landscapes of the prehistoric Earth.\r\n</p>\r\nChallenge yourself\r\n<p>Save your kind on one of 3 difficulty levels (with a little extra for all of you hardcore Milk Drinkers)\r\n</p>\r\nInteractive environment\r\n<p>Explore and interact with objects around you using your abilities in an unusual way!</p>\n\n<p>The Moo Lander Demo is <strong>now available on Steam!</strong></p>\n<p>Revealing just a little piece from what the final game will be, it will allow you to play the first ~20 minutes of the game featuring a couple of <strong>enemies, puzzles </strong><strong>and of course … A Mighty Cow</strong>!</p>\n<p>After you finish the demo campaign you can keep improving your cow-battle skills in our <strong>couch multiplayer</strong> PvP and coop PvE modes with <strong>up to 4 players</strong>. We have 2 of the 4 planned modes available in the demo.</p>\n<p>We hope you will have fun and we can’t wait to hear your thoughts about it!</p>\n<p>If you like the demo, please consider <strong>Wish-listing us on Steam </strong>- your support would mean a lot for a small studio like ours!</p>", "metacritic": null, "released": "2019-05-16", "tba": false, "updated": "2019-05-17T05:18:32", "background_image": "https://media.rawg.io/media/screenshots/8ec/8ec6ed1dfe44f56c61ddd50377e01bca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Sixth Hammer"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}