{"id": 319691, "slug": "a-completely-normal-test-drive-simulation", "name": "A Completely Normal Test Drive Simulation", "name_original": "A Completely Normal Test Drive Simulation", "description": "<p>Welcome, volunteer! <br/></p>\n<p>On behalf of The Company, thank you for agreeing to test drive the Collision Avoidance Robot. Please familiarise yourself with these instructions before initiating the test.</p>\n<p>The C.A.R. is the latest in self-driving technology. However, we're still calibrating the collision avoidance system - which is where you come in. To set the system, you must collide with a large number of vehicles. If this seems unsound to your non-scientific mind, don't worry about it. You're not being paid to think.</p>\n<p>The test site features 3 automated vehicles to collide with, and because previous tests have shown that volunteers respond positively to \"fun\", The Company has implemented a points system.</p>\n<p>The C.A.R. test will cease if either:</p>\n<p>The allocated time expires, or<br/></p>\n<p>You explode.</p>\n<p>We're all rooting for you!</p>\n<p>nb. Reports that the C.A.R. \"occasionally handles like a pinball\" are being investigated.</p>\n<p>--------------</p>\n<p><strong>PROTOTYPE!!!</strong> </p>\n<p>Win conditions exist but I haven't had time to check that they trigger correctly (when the CALIBRATION METER fills, it should display an 'exit' message and flashing arrow). The exit screen should then display your final score, but, again, I'm not sure if it does. Fail conditions seem to work fine, though.  The C.A.R. may also get stuck in the wall, but this isn't too common.</p>\n<p>Press ESC at any time to quit. Everything by Atomic Toilet, except the cars, which come from an Unlucky Studio free asset pack, and the music, which is by Cardboard Dead Boy (me, actually) and is an existing song called 'Murder! Murder! Murder!'.</p>", "metacritic": null, "released": "2019-05-16", "tba": false, "updated": "2019-05-17T05:32:37", "background_image": "https://media.rawg.io/media/screenshots/c27/c27cf5d924056eae49c23507d297c2d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Toilet"], "genres": ["Action"], "publishers": [], "esrb_rating": null}