{"id": 319688, "slug": "ambassadors-of-the-future", "name": "Ambassadors Of The Future", "name_original": "Ambassadors Of The Future", "description": "Introduction\r\n<p>Join Jaden and his friends as they get the oppurtunity to travel back in time and change the dystopic world they live in. A quest that will be easier said than done. Time will be their greatest enemy, but not their only enemy...</p>\n<p><strong>Ambassadors Of The Future</strong> is a story-driven, strategy and puzzle-based RPG inspired by game franchises such as Dragon Quest and Final Fantasy. <br/></p>\n<p>The project started back in february of 2016 and is in a very late development stage. <br/></p>\n<p>This is the <strong>3.0 Beta Version</strong> of this game. It can be played from start to finish and should take between 25-35 hours to complete.  The gaming experience in the final product of this game might be different from this version.<br/></p>\r\nWhat does this game contain?\r\n<p>Around 25-35 hours of gameplay depending on how much optional content you are willing to take on.</p>\n<p>Party management.</p>\n<p>8 Playable characters with unique playstyles.</p>\n<p>A CTB (charge turn battle) system.</p>\n<p>Both scripted and random encounters (the ability to affect/prevent random encounters completly.)</p>\n<p>Evolve your DNA with EP (Evolve Points) and learn new equipable skills.</p>\n<p>Skill tiers linked to your weapon.  (Similar to FF7 materia system, but simplified). <br/></p>\n<p>Grow and design your character with XP (experience points) from combat. By evolving stats with EP, or by equiping improved gear.</p>\n<p>Mine and hand in minerals to increase stockings of all the blacksmiths in the world.</p>\n<p>Simplistic arena system.</p>\n<p>Optional puzzle dungeons.</p>\n<p>Optional boss fights.</p>\n<p>Design your own ending.</p>\n<p>Mini games such as treasure hunts, slot machines and card games.<br/></p>\n<p>A world map for easier navigation.</p>\n<p>3 types of vehicles that will help you travel across the different continents of Alvectura.<br/></p>\r\nKnown errors/bugs?\r\n<p>I will make a list of known bugs later on, But there shouldn't be any game breaking bugs. In the meantime, please notify me about everything you can find that seems off. (Not so interested in \"grammar errors\", these will be fixed in the final version.)  Feel free to comment any thoughts you have on the project and I hope you will enjoy it. <br/></p>", "metacritic": null, "released": "2019-05-16", "tba": false, "updated": "2019-05-17T05:31:58", "background_image": "https://media.rawg.io/media/screenshots/ced/ced4e026c476f5c8bf9d3c95dd6446e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Existenztim"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}