{"id": 319817, "slug": "castle-assault", "name": "Castle Assault", "name_original": "Castle Assault", "description": "<p>A multiplayer lan tower defense with multiple class. Made in Python and Pyglet</p>\r\nA. How to play ?\r\n<p> An instance of the server must be run on a network machine (any one, even on a player's PC). Then each player starts the client program. Then the connection to the server is done automatically. Once the server has two connections, the game starts and you can play.\r\n  </p>\n\r\nB. Purpose of the Game\r\n\n<p>\r\n Each player has a castle to protect. The goal is to destroy the opponent's castle with monsters that both players send face-to-face. Thus an opposing monster must first fight his monsters before entering the castle. There are six types of monsters including a type already unlock. To train monsters you have to unlock them by paying. Each player has a coin balance in the game. Everyone starts with 150 coins. Once unlocked you still have to pay to make one. During its manufacture a part of the energy bar is emptied and it is necessary to wait until it is full again to be able to form a monster again. The player can train as many monsters as he has room. To win coins you have to either wait or kill enemy monsters. The game ends when the opponent's castle has been destroyed by the monsters or his own has been destroyed by the opposing monsters.\r\n</p>\n\r\nA. Comment jouer ?\r\n<p>Une instance du serveur doit être lancer sur une machine du réseau (n’importe laquelle, même sur un pc de joueur). Ensuite chaque joueur lance le programme client. Ensuite la connexion au server se fait automatiquement. Une fois que le serveur a deux connections, la partie se lance et vous pouvez jouer.\r\n  </p>\r\nB. But du jeu :\r\n<p>Chacun des deux joueurs dispose d’un château à protéger. Le but est de détruire le château adverse grâce à des monstres que les deux joueurs s’envoient en face à face. Ainsi un monstre adverse doit d’abord combattre ses monstres avant d’accéder au château. Il existe six types de monstre dont un type déjà débloquer. Pour former des monstres il faut les débloquer en payant. Chaque joueur à une balance de monnaie dans le jeu. Chacun commence avec 150 pièces. Une fois débloquer il faut encore payer pour en fabriquer un. Lors de sa fabrication une part de la barre d’énergie est vidée et il faut attendre qu’elle soit à nouveau pleine pour pouvoir former un monstre à nouveau. Le joueur peut en former autant de monstres qu’il a de pièce. Pour gagner des pièces il faut soit attendre, soit tuer des monstres adverses. Le jeu se termine lorsque le château adverse a été détruit par les monstres ou que le siens s’est fait détruire par les monstres adverses.\r\n</p>", "metacritic": null, "released": "2019-05-15", "tba": false, "updated": "2019-05-17T06:05:42", "background_image": "https://media.rawg.io/media/screenshots/dca/dcaad0a22657e931fbeec29ed120f58b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kroissan"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}