{"id": 320, "slug": "night-in-the-woods", "name": "Night in the Woods", "name_original": "Night in the Woods", "description": "<p>Night in the Woods is a quest game developed by Infinite Fall.</p>\n<h3>Plot</h3>\n<p>Night in the Woods takes place in a universe of anthropomorphic animals. A cat named May returns back to her hometown of Possum Springs because of a dissociative disorder that does not let her recognize other people something other than rectangular shapes. May had dropped out of college and she does not know what to do with her life yet. She got back into the town to hang out with her old friends or simply walk around the town and meet the people she knew in her childhood, yet this childhood world is no more. The city&#39;s residents start talking about something happening in the nearby forest. May gets her friends together and goes out to figure out what&#39;s going on.</p>\n<p>The game explores the typical teenage problems in a common environment, as stated by the game&#39;s developers.</p>\n<h3>Gameplay</h3>\n<p>The main objective of the game is to explore the in-game world. May can run, jump, and interact with both other characters and the in-game objects. As stated by the developers, the key actions the player should take are to explore, converse, see and touch. The game focuses mostly on its narrative, rather on the gameplay experience. </p>\n<p>While talking to other characters, the players can choose the line for May to reply with. Your replies will affect the game&#39;s story, yet the change will be minor.</p>", "metacritic": 88, "released": "2017-02-21", "tba": false, "updated": "2024-03-31T23:00:05", "background_image": "https://media.rawg.io/media/games/b0a/b0a370527fea0e824225269d4a8797db.jpg", "website": "http://nightinthewoods.com", "rating": 4.24, "rating_top": 5, "added_by_status": {"yet": 282, "owned": 1177, "beaten": 534, "toplay": 322, "dropped": 158, "playing": 82}, "playtime": 6, "achievements_count": 65, "ratings_count": 644, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 658, "platforms": ["Linux", "macOS", "PC", "iOS", "Nintendo Switch", "Xbox One", "PlayStation 4"], "developers": ["Finji", "bombsfall", "InfiniteAmmo", "Infinite Fall"], "genres": ["Adventure"], "publishers": ["Finji"], "esrb_rating": "Teen"}