{"id": 320028, "slug": "bike-rush-supports-vr", "name": "Bike Rush (supports VR)", "name_original": "Bike Rush (supports VR)", "description": "<p><strong>Bike Rush</strong> is an action shooter race with rapid road gunplay. The whole game is like a scene from action movie. You can play in VR to get more realistic game feel! Play using keyboard/gamepad, VR headset + keyboard/gamepad or VR headset + hand motion controllers to get full experience!</p>\n\r\nGameplay\r\n<p>Bike Rush is the first person bike shooter. You should reach the finish as soon as possible, controlling your motorcycle to avoid crashes. Use nitro and ramp jumps to break through the cop blockages! Destroy all the persecutors in the road shootouts!<br/></p>\r\nThe Story\r\n<p>Danbai, the heavenly dreamland of warm wind, sea, sand and the sun. The capital of theft, robbery and murder. Everything was under our control. We were brutal and elusive.<br/><br/>But nothing lasts forever. After the last of our endeavours the governors lost their patience. The police has found the way to push us and brought up special forces to deal with us. Most of our people got arrested. I was able to escape with my partner and the money from our last robbery using a lorry.<br/><br/>When we were leaving the city the police caught up and stopped us. I was able to get on my bike and drive away while my partner was persuading them. Let the pursuit begin!</p>\n\r\nFeatures\r\n<ul><li>Feel yourself as a hero from action movie</li><li>Incredible VR experience</li><li>Non-stop action</li><li>4 types of enemies</li><li>3 game modes</li><li>Fidget spinner for VR</li></ul>", "metacritic": null, "released": "2019-05-14", "tba": false, "updated": "2019-05-17T07:02:43", "background_image": "https://media.rawg.io/media/screenshots/337/3371b0d22fbe6dd9c1bac56d2d81d6c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AndrewFord"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}