{"id": 320256, "slug": "bloodfury", "name": "Bloodfury", "name_original": "Bloodfury", "description": "<p><strong>A Roguelike 2D Platformer where you control dimensions and abilities in endless caverns. You will gain new abilities and discard old ones along the way and fight through monsters and bosses for as long as you can.</strong></p>\r\nBLOOD MAGIC\r\n<p>In this game, using abilities consume your health. Luckily, your attacks have lifesteals, meaning that each attack heals you for a bit. There are 5 abilities in the game, but you can only use 2 of them at once. Picking a new ability will discard the old one, so choose wisely!</p>\r\nRISK-REWARD ATTRIBUTES\r\n<p>Every attribute your character have can be improved using one of four altars in the game, but it comes at a cost. You have to sacrifice some attributes to gain another.</p>\r\nDEATH, AGAIN\r\n<p>Dying in this game results in game over and you have to start all over again, except if you activate a shrine. There are three shrines in the map. When activated, each of them gives you an extra life and a respawn point should you die. That can only happens once per shrine, once it's been used, it is destroyed.</p>\r\nDIMENSIONS MANIPULATION\r\n<p>Dimensions are one of the key features in this game. Some blocks are colored either orange or blue. You can only stand on platforms which are the same as your current character color.</p>\r\nYOUR GOAL\r\n<p>Your objective in this game is to get out! But the door was blocked by the boss somewhere in the map (I won't tell you where!). Pick your ability combo, trade your attributes for something you like, kill some enemies, then head for the boss! Be warned though, the boss can't so easily be defeated. It will put up a good fight, but I'm sure you can do it!</p>\n<p>Oh, and one more thing: there's this thing in the level they called a \"Tower\", which is a platforming challenge not for the faint of heart. If you succeed in climbing the tower, you will earn a bonus to all of your attributes, making the boss significantly easier. Pro tip: you can hit sawblades to bounce on it!</p>\r\nOUR LITTLE TEAM\r\n<p>This little game is a project made in 2.5 months for a showcase. We might continue to develop it later, after we made some tidy-ups. Made by a team of 5 university students: Handerson, Riccosan, Rifqi, Peter, and William. All sprites are drawn manually. Most audios are gathered from free assets in sites like Freesound and OpenGameArt. We are inspired by games like Spelunky, MOBA genres, and especially Hollow Knight.</p>\r\nKnown Bugs:\r\n<ul><li>Enemy can clip through walls</li><li>Health bar jitters white or green</li><li>Jump and downward attack not registered properly</li><li>Sometimes, there are some fps drops</li><li>Boss can get stuck below or above player</li></ul><p>Let us know your thoughts down in comments below!</p>", "metacritic": null, "released": "2019-05-13", "tba": false, "updated": "2019-05-17T08:01:17", "background_image": "https://media.rawg.io/media/screenshots/6c5/6c5718acc8a2c4a831386ce47322cbc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FFaUniHan"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}