{"id": 320201, "slug": "lilypop-rainbow-edition", "name": "LILYPOP: Rainbow Edition", "name_original": "LILYPOP: Rainbow Edition", "description": "PROLOGUE \r\n<p><strong><em>\"</em></strong> Lights on. Candlelight. I delicately blow out the match, place it next to the candle container. I take in a slight breathe, embrace the refreshing scent of Clover-Berries. I giggle, out of the fulfillment of the moment. \r\nI dip my right foot in to test the water. It's safe! It's warm! Without hesitation, I quickly immerse myself inside the bathtub. Bubbles floating all around me. \r\nBig Sister opens the bathroom door, abruptly. She gives me a moment to realize her presence. She shoots me a look.\r\n<br/>- Hey Big ...\r\n<br/>As I roughly express both my excitement and confusion towards my lovely sister, she rushes next to me, swiftly grabs my neck with her both hands and presses me under the bathtub's water. As the back of my head bangs against the bottom surface of the tub, Big Sister strangles my neck with an immense force, like all of her life sufferings is channeling through her. The moment it feels like my head is splitting from my body, I take my last bits of stamina to grab her hand.\r\n<br/>- Lily, Lily, let go of my hand! It hurts! Aah...\r\n<br/>Big Sister's scream slaps me back to life.\r\n<br/>- Big Sister, it was the worst <em>nightmare</em>...<strong><em>\"</em></strong></p>\n\r\nFEATURES\r\n<ul><li>15 hand-crafted arcade levels, in consistent with main game mechanic: shooting splitting-bubbles.</li><li>15 + 2 instrumental and story-telling music tracks. Each is made for individual level. Each tells their own piece of story connecting to the main story line. </li><li>4 chapters carrying different themes, influence the development of art direction, music and story arc. </li><li>Short novel written in text help conveying the story, hence root the audience deeper into the universe, characters and understand why they did what they did. </li><li>Abstract art with vibrant/mystifying colors to explore, imagine and contemplate.</li></ul>\n\r\nIN THIS PACKAGE\r\n<ol><li>Digital Wallpaper: Rainbow Edition (2880 pixels x 1620 pixels) </li><li>LILYPOP (OST) Album: Rainbow (5 tracks), Album art cover, Song list.</li><li>Chapter Rainbow's Flash Cards: A deeper insight into the making of the music tracks of this specific chapter, bringing a more thorough understanding of what-is-what within the game story. </li></ol>", "metacritic": null, "released": "2019-05-08", "tba": false, "updated": "2019-05-17T07:44:51", "background_image": "https://media.rawg.io/media/screenshots/c88/c88e32bcade8d60d66af6b067b2c6bf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stardust 17"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}