{"id": 320319, "slug": "hope-is-in-23-itch", "name": "Hope Is In 23 (itch)", "name_original": "Hope Is In 23 (itch)", "description": "<p><em>Hope Is In 23 is an Early Access type project made by one developer.</em></p>\n<p><em>I'm committed to my project(s) and will be seeing this to the end so</em></p>\n<p><em>Thank you for your continued support!</em></p>\n\n<p><strong>Website</strong>: http://truelegacygames.com/</p>\n<p><strong>Twitter</strong>: https://twitter.com/CStudios15</p>\n\n<p>NOTE:</p>\n<p>You are welcome to leave feedback here on Itch.io  or on steam forums HERE</p>\n<p>I would prefer if you help me build the community around my games here on DISCORD for faster access and quick up to date news thats going on with me at </p>\n<p>True Legacy Games!!</p>\n\n\n\n<p>12 Years ago, a rift opened up that created a doorway to our world, bringing forth monsters that we thought were mere stories and fairytales. Without warning they began killing anything in sight some even having the power to turn humans to slaves burned by fire. A mysterious group from this newly connected dimension granted 23 individuals power to help combat the enemy.No one knows why they were sympathetic towards humanity or why only 23 were granted power, but it helped give humanity a chance, up until the 23 were overrun. Now, the people who survived either are in hiding, or captured and sent to numerous islands around the world, and as for the 23, they are either dead, capture or missing.<br/></p>\n<p>Venture into the island fighting several enemies, and staying away from traps!. it is your job to find out what the enemy knows, where you friends are, and how you, and the rest of the 23 can once again try to save humanity. </p>\n\n\n\n\n<ul><li>Uniquely crafted story that will unravel as you play providing context for why the world is the way it is.</li><li>Simple first person shooter Mechanics with \"supershots\" to deal with enemies permanently.</li><li>Read and listen to audio logs and notes to get a feel for the atmosphere and plight of the humans on the island.</li><li>Explore an artificial cemetery that houses deadly traps, enemies hunting any and everything, and humans trying to survive, looking for hope.</li><li>A Single player focused experience, no microtransactions, no season pass, what you see is what you get.</li><li>Straight forward gunplay all the while fighting waves of enemies as you go deeper in the cemetery.</li></ul>", "metacritic": null, "released": "2019-05-10", "tba": false, "updated": "2019-05-17T08:15:19", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7e1691b0a72c318c7fa7e64dbca66bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["True Legacy Games"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}