{"id": 320394, "slug": "quantum-league", "name": "Quantum League", "name_original": "Quantum League", "description": "<p>It’s an alternate universe where time travel manipulation has changed the face of professional sports as we know it. Quantum League, a heavily weaponized team-based shooting sport, dominates the globe.<br />\nAs a Quantum Athlete, compete in 1v1 and 2v2 matches in specially designed arenas with a time loop feature that rewinds and revives you, allowing you to tactically team up with yourself. Your goal is to dominate the sport’s rankings, chasing superstar status with rewards of great fame and wealth as you progress. But agility, speed and skill are not enough to rise to the top. The ability to tactically play with yourself is important too!Features Unique Time Loop Game Mechanic - Dominate each round by taking advantage of the cloning time-loop in each arena to outmaneuver your opponent. Consider where you were and where you want to be to make that final winning shot, turning the tide of battle in an instant.<br />\nMultiple Options for Combat - play solo against an online opponent in 1v1 battles or dial up to the power of 2 in 2v2 multiplayer matches. Chase the top of the competitive leaderboard for global recognition!<br />\nPlay 4 different game modes - including death match and capture point across 9 different arenas.<br />\nChoose from 6 different characters to play and level up as you progress unlocking new outfits and styles as you evolve.<br />\nSelect from 8 different weapons and head into the Quantum Arena!</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-10-17T15:28:09", "background_image": "https://media.rawg.io/media/screenshots/a81/a8169a30972a2377803f72354c0d7172.jpg", "website": "http://www.quantum-league.com", "rating": 2.64, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 279, "beaten": 3, "toplay": 2, "dropped": 5, "playing": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 14, "platforms": ["Nintendo Switch", "PC"], "developers": ["NGD Studios"], "genres": ["Action", "Strategy", "Sports"], "publishers": ["NGD Studios"], "esrb_rating": null}