{"id": 320311, "slug": "game-a-week-1-damage-zone", "name": "Game A Week 1 - Damage Zone", "name_original": "Game A Week 1 - Damage Zone", "description": "<p>I was doubting about putting this first project online. I didn't realize how scared I was about uploading the game until I put an end to it, I mean, probably no-one is reading this cause there too many games uploaded to Itch.io every day, but for the one person reading:</p>\n<p>Game A Week is a weekly challenge about (as the name says) making a game per week, I found out a couple of week's ago after reading a Rami Ismail post on Gamasutra, I thought It was a fun challenge and I decided to give it a try, so here I am.</p>\n<p>Beard in mind that I started to play with Unity a pair of weeks ago, I don't know much about programming, and my pixel art it's not polished (by that I mean it sucks), so please don't be too harsh with your critics. (Also, English is not my first language, I'm sorry If your eyes hurt after reading these posts)</p>\n<p><strong>Idea</strong></p>\n<p>The idea came from playing Metal Gear 2, the MSX2 game. While I was playing I couldn't stop thinking how slow the game was (even for a stealth game). I love the way the game looks, it is top-down, but without that chibi style that top-down games carry these days. I started to picture a game that looked the same,  with an Item system just like Metal Gear 2 an with a great story. All this was before reading about GameAWeek, so after knowing about the challenge I thought about recycling the idea.</p>\n<p>I did a quick sketch and started working on it, It looked fine but I also thought the idea was too basic, so I came up with the mechanic of \"if you take health you'll lose bullets, and if you take damage you'll get bullets\" this made it more exciting when going thru the rooms. </p>\n<p>I use sprites from Final Fantasy 6, Metal Gear 2: Solid Snake, TLoZ: Link's Awakening, Super Metroid and Super Mario Sunshine. <br/>For the audio, I used things from the original Castlevania for NES and the original Ninja Gaiden.</p>\n<p><strong>What went right</strong></p>\n<p> I think by adding the shake to the screen when you shot and take damage makes it more exciting, it gives power to the bullets. I also think the main mechanic of the game is kind of interesting, I still have some ideas for the game that I would have loved to add. I like the way the UI works, It's really big so the player is aware of how much life and bullets he has left so he can think about how he wants to move. </p>\n<p><strong>What went wrong</strong></p>\n<p>Oh man, a lot. I think the main problem is that I couldn't solve the bugs, some times if you hit an enemy It won't give you recharge your bullets, and you can also get a recharge without getting hit (there are a couple other bugs) , I also don't like the layout of the rooms, they feel kind of empty; I would have liked to put another type of enemy but making the Metroids work took me too much time. I wasted the first two days playing with the graphics,  the sprites, not only that but, I also stuck into problems that I didn't need to solve in order to make the game work such as, trying to create an Item system so the player could choose when to heal.   I think if I had concentrated on making the game run instead of making it look good, I would have had better time management.</p>\n<p>My scripts are a mess, and some of the colliders are not perfectly working, for instance, there are some places where the player should be able to walk but because the collider takes too much space he can't. However, the most important one is that I think the main mechanic is unbalanced, so indeed, the rooms can be I little bit unfair. </p>\n<p><strong>What I Learn</strong></p>\n<p>I shouldn't get stuck in problems for too long, if the game can run without what  I'm' trying to implement then I should move on. <br/>I think I need to organize my ideas before opening Unity, I kind of did this but I want to be more specific in the sketch. <br/>I learn a lot of useful programming tools; I think programming is my biggest drawback right now.</p>\n<p><strong>Controls</strong><br/>Move: AWSD<br/>Shoot: N <br/><em>*If you die the game has an auto-restart*</em></p>", "metacritic": null, "released": "2019-05-11", "tba": false, "updated": "2019-08-28T23:16:22", "background_image": "https://media.rawg.io/media/screenshots/b1d/b1de9a459f95e1da1d86d22d8927c2f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nandoww"], "genres": ["Action"], "publishers": [], "esrb_rating": null}