{"id": 320417, "slug": "breach-point", "name": "Breach Point", "name_original": "Breach Point", "description": "This is an early access release of Breach Point which will become an 8 part story set throughout human history; covering slightly different game genres with each episode.<br/><br/><strong>What to expect in this early access version:</strong><br/><br/><ul><li>You will find yourself in 1950 Colombia, at the start of our story, in which Ronnie and Harriet uncover Muisca Gold from one of Colombia's lost cities.<br/></li><li>Although things seem normal at first, the Colombian heavies are sent in to stop our characters from leaving with the gold.<br/></li><li>Find a table with an arsenal of weapons in which to defend yourself.</li></ul><br/><strong>What we would like to know from this early access version:</strong><br/><br/><ul><li>We would love your constructive feedback on game mechanics such as moving around and using weapons and how performs on your machine.</li></ul><br/><strong>What to expect moving forwards:</strong><br/><br/><ul><li>We will use your feedback to guide how the game play mechanics progress going forwards.<br/></li><li>Episode 1 will begin to tell the story in which our protagonists embark on an action filled adventure, fighting many creatures and enemies along the way.<br/></li><li>You will be able to choose from 1 of 2 characters to play the game, Episode 1 travels from the jungle of Colombia into the uncovered mystical tomb's of Egypt, at the end of Egypt the sci-fi element of the story is unleashed.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:16", "background_image": "https://media.rawg.io/media/screenshots/6e0/6e0d99a58c9d1959132b0bc389057cac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Dragon Productions"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Black Dragon Productions"], "esrb_rating": null}