{"id": 320401, "slug": "lust-selection-episode-one", "name": "Lust Selection: Episode One", "name_original": "Lust Selection: Episode One", "description": "An episodic visual novel that spans 10 episodes, Lust Selection was designed from the ground up as an Original English Language Visual Novel that strives to break the conventional visual novel settings such as magical fantasies, Sci-Fi, anime style, etc. and instead focusing towards a more realistic approach. The modern-day corporate office drama.<br/><br/>Make choices that change the dynamics of the story, with branching routes, each choice the player makes will craft the game flow and eventual ending.<br/><br/>How far would you go to clinch a deal worth millions? What dirty deals would you stain your hands with or would you abide by your moral compass and stand to lose everything? When you are so close to reaching your goal, do you give it all up for that tender touch of a woman's embrace?<br/><br/>Join James as he delves deep into the world of politics, corruption, blackmail and dirty secrets of the adult corporate industry.<strong>Episode One</strong>The story begins with the main protagonist James coming on-board the company as a senior project manager. This new workplace has its fair share of hot and attractive office ladies, however, what may appear on the surface as a completely normal and friendly office environment is actually just a facade for what really lies beneath.<br/>In episode one, James is first tasked to manage a team of misfits, each with their own personal issues. <br/>In order to shape up the team for competition, he first needs to solve each of their personal problems.<br/>First on the list is Sandy. Will James help Sandy with her ex-boyfriend's harassment by hatching a plot so perfectly executed that it positions him as the perfect white knight? <br/>Or will James, try to take advantage of her situation to satisfy his lust with her body?<br/>The office Ice Queen Sylvia, who is she really? Is she really this cold to everyone or is there another side of her she does not want to reveal, especially after witnessing that… compromising situation of hers?<br/><br/>This is where your adventure in the office begins.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:17", "background_image": "https://media.rawg.io/media/screenshots/c26/c269985ce5307b1866ac926dae06286d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Select Gameworks"], "genres": ["Casual", "Indie"], "publishers": ["Select Gameworks"], "esrb_rating": null}