{"id": 320495, "slug": "crazy-car-fury-racing-fever", "name": "Crazy Car Fury Racing Fever", "name_original": "Crazy Car Fury Racing Fever", "description": "Let’s start the extreme racing with your tuned and modified cars. Design your cars and tune them as you desire. Make your ultimate fury cars more powerful and win the mad fury car racing challenge now. Drive through different fury road environment at the maximum speed to reach to the finish line in the shortest possible time. Enjoy the thrilling racing tracks in your modified fury cars. Do some car drifting now on the off roads on the epic mountainous area. Enjoy the extreme racing adventure and win the championship. Use your incredible driving skills and drive your favorite modified cars on the breadth taking view of the desert sandy road.<br/><br/>Get addicted and feel the heat on the furious road of the sandy environment. This is the time to show that you are the real fury car racing driver. Get into the modified mad car and indulge into the madness of the furious racing challenge. Avoid the obstacles and get through the finish line in the shortest time possible. The ultimate extreme mad racing has just been started. Just get yourself ready to cross the obstacles on the extreme off road mountain area. This is the furious racing on the mad cars. Speed up your modified cars now and win the ultimate driving racer challenge. <br/><br/>Enjoy the epic car drift racing mad racing. Be the extreme mad car racer and make your way on the multiple environments. Drive safe with the full speed of the mad fury desert. Do some car stunts. Get ready for the extreme mad racing. Do some thrilling stunts with huge jumps on the roads with your luxuries fury car. There will be dangerous obstacles that you have to face in the insane death racing game. So fasten up your seat belt and get the most points without the collision of the other city car.<br/><br/>This is your last chance, so avail the opportunity now! Experience the real racing challenge. Select your favorite furious cars and get ready for the ultimate fury car drift racer. Do some stunts and drifts to earn more points. The most thrilling mad stunt racing is now here. <br/><br/>. Incredible camera view and the ultimate sound system<br/>. Exciting levels to complete the traffic racing<br/>. Different realistic racing tracks environments<br/>. Easy to handle  <br/>. Best physics engine with real crashing<br/>. Best modified sports mad car to choose", "metacritic": null, "released": "2018-12-20", "tba": false, "updated": "2019-07-29T12:03:57", "background_image": "https://media.rawg.io/media/screenshots/ed0/ed04b3675ce9fc21edfbd3012fcd8338_43aiMuI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arslan Tanveer"], "genres": ["Adventure", "Racing"], "publishers": ["Arslan Tanveer"], "esrb_rating": null}