{"id": 320537, "slug": "evolution-2-battle-for-utopia", "name": "Evolution 2: Battle for Utopia", "name_original": "Evolution 2: Battle for Utopia", "description": "<p>Evolution shall go on: the cult sci-fi hit now has the long-awaited sequel! The history that reveals the Universe of Utopia from a new point of view awaits you.<br />\nThe second episode still boasts the unique atmosphere of the Evolution that won over millions of players. The gameplay also underwent a revolutionary change: Evolution 2 is an explosive mix of top-down third-party shooter, action, strategy and RPG!<br />\nGet ready for the breathtaking storyline with unexpected twists!<br />\nThe story unfolds on Planet Utopia. It was once a galaxy resort for billionaires. And now it is pure hell full of ruthless looters, monsters and fighting robots. A merciless war of all against all is raging here.<br />\nYou will be immersed in the world of never-ending battles where you will use the mightiest weapons and the psi-force - the power of the main character of the game, Captain Blake. He got his superpowers as a result of a dangerous experiment, and he is prepared to use them to destroy any opponent of your choice.<br />\n- Original sci-fi setting. Space shooter, post-apocalypse and biopunk on a distant planet.<br />\n- Unique balance of genres. A mix of strategy, RPG and action top-down shooter with the original battle system.<br />\n- Tactical gameplay. Level up your character and their partner, select the most effective weapons and use the weaknesses of your enemy to your advantage.<br />\n- Thrilling PvE campaign. A multitude of missions and epic bosses. The enemy becomes stronger with every battle.<br />\n- Cooperative mode. Call on the help of faithful allies and complete the missions shoulder to shoulder with other players.<br />\n- Synchronous online fights. Battle in full online multiplayer. Fight your way to the top of the rankings and earn unique bonuses for victories.<br />\n- Arsenal of the future. Fantastic weapons with unique features and level-up system! You will get to have fun not only with good old firearms, but also with energy, acid and bionic guns.<br />\n- Grow the base: open new rooms and learn more about the technology of the future. Evolution has no limits!<br />\n- Interactive arenas and realistic 3D animation will help you fully immerse yourself in the game!<br />\nYour base is ready - you can start the battle. It is time to deal with this Utopia, Captain!</p>", "metacritic": null, "released": "2019-05-15", "tba": false, "updated": "2023-02-09T02:32:07", "background_image": "https://media.rawg.io/media/screenshots/93f/93f61d75c3d06a2cec23f7aaeaaa96c1_LvKZdAo.jpg", "website": "https://evo2.my.com/en", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["MY COM"], "genres": ["Action", "Casual"], "publishers": ["My.Com"], "esrb_rating": null}