{"id": 320585, "slug": "it-happened-in-outer-space", "name": "It Happened In Outer Space", "name_original": "It Happened In Outer Space", "description": "IT HAPPENED IN OUTER SPACE is a cosmic obstacle course with a retro science fiction theme. In this side-scrolling infinite runner, you must progress through a series of random obstacles that become increasingly more challenging the longer you play. Avoid crashing into floating buildings and alien spacecraft while attempting to achieve goals to unlock new levels. <br/><br/>• 7 LEVELS TO NAVIGATE: Each level is unique with its own collection of obstacles set in a distinctive environment.<br/>• OVER 50 SHIPS TO FLY: Collect coins to unlock additional playable ships. Collect enough ships to unlock extra Bonus Levels. <br/>• HELPFUL POWER-UPS: Use Shields, Double Points and Extended Life power-ups to help you on your journey. <br/>• CHALLENGING GAMEPLAY: Levels are more challenging the longer you play. Obstacles gradually become more numerous with tighter spaces.<br/>• AVOID ALIEN SHIPS: Be careful not to collide with oncoming rockets and saucers. Avoid enough alien ships to earn extra bonuses.<br/>• REVIEW GAME STATS: See each level’s top scores, total games played, power-ups collected, total taps, and more.<br/>• FUN FOR ALL AGES: This is a cosmic adventure designed to be enjoyed by all, young and old.<br/><br/>Have any questions, comments or suggestions? Please reach out to us at orzepowskiapps@gmail.com.", "metacritic": null, "released": "2019-05-16", "tba": false, "updated": "2021-05-03T03:11:14", "background_image": "https://media.rawg.io/media/screenshots/aaf/aafe3127785e14716e3d1e6eedabc454.jpg", "website": "https://ithappenedinouterspace.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["Glenn Orzepowski"], "genres": ["Action", "Casual"], "publishers": ["Glenn Orzepowski"], "esrb_rating": "Everyone 10+"}