{"id": 320596, "slug": "flight-simulator-plane-pilot", "name": "Flight Simulator: Plane Pilot", "name_original": "Flight Simulator: Plane Pilot", "description": "Welcome Pilot! Fly, do contracts, earn money, buy planes, houses, enjoy flight!<br/><br/>--------------------------------<br/><br/>Flight Simulator : Plane Pilot<br/><br/>Game is created to bring realistic flight 3D experience on mobile devices. Simulator comes with 7 different airplanes, true physics, professional plane control system!<br/><br/>Environment is a big ocean, with many islands and airports. As a plane pilot you will fly from island to island, get contracts (transporting passengers, goods…). Each contract will bring you money which can be spent on 2 important things:<br/>1.Buying new plane<br/>\tBetter planes bring more money on contracts, they are faster and better<br/>2.Buying home<br/>\tIf you buy home in any of islands, you can always go there and save the game<br/><br/>Flight simulator lovers will appreciate the game realistic physics which lets you to feel real plane pilot feelings. There are 4 possible camera views to make simulation perfect:<br/>•\tView with the following camera<br/>•\tCabin view – what real pilot see during flight<br/>•\tPlane’s bottom camera to see what is happening under the plane<br/>•\tBack view camera<br/><br/>Next important thing is that all planes have moving parts – ailerons, flaps, rudder, steering wheels, landing gears and you can control everything during flight with interface which designed to be easy and functional. <br/><br/>Enjoy this free flight simulator, have nice takeoffs and soft landings, feel yourself a real pilot.", "metacritic": null, "released": "2015-04-04", "tba": false, "updated": "2019-10-22T14:39:17", "background_image": "https://media.rawg.io/media/screenshots/cc3/cc3218d96c4c441fc65314865b9b8bc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vahagn Sargsyan"], "genres": ["RPG", "Simulation"], "publishers": ["Vahagn Sargsyan"], "esrb_rating": "Everyone 10+"}