{"id": 320591, "slug": "real-offroad-simulator-3d", "name": "Real Offroad Simulator 3D", "name_original": "Real Offroad Simulator 3D", "description": "We have made a simulator where you can turn on and off every single lights on the car, open the hood, trunk and doors, see the real working transmission, see engine with all its details, color your car like you want.<br/><br/>But the most important things to enjoy offroad car simulation are physics, transmission, engine and suspension system.<br/><br/>And here you will find the most realistic suspension system in the store, made exactly for offroad driving and the most true physics ever built for mobile devices!<br/><br/>Desert – dead rocky desert to experience driving on sands<br/>Safari – limitless safari simulation<br/>Cliffs – drive on rocks<br/>Rally – rally car simulator<br/>Mountain – hill climbing – drive to the top of the mountain<br/>Swamp – drive your car in swampy environment<br/>Thistle – interesting scene to explore and show your car driving skills<br/>Village – time to drive your car in the village<br/>Dried Lake – scene for open space driving<br/>Canyon - enjoy hill climbing simulation on both sides of canyon<br/>Winter - for driving simulation on the snow<br/><br/>PLUS - DAY and NIGHT driving simulation! Select day or night mode for each world!<br/><br/>There are contract positions where you can enter buy goods and transport them to earn money. You can transport different good also using car trailer. Driving car with trailer is harder but brings more money!<br/><br/>Go ahead! Check your driving skills and enjoy offroad car simulation!", "metacritic": null, "released": "2019-02-09", "tba": false, "updated": "2019-11-11T02:16:45", "background_image": "https://media.rawg.io/media/screenshots/f41/f41656883db10557e58dd49db19b5490_De6BCgS.jpg", "website": "http://www.evigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vahagn Sargsyan"], "genres": ["Simulation", "Racing"], "publishers": ["Vahagn Sargsyan"], "esrb_rating": null}