{"id": 320688, "slug": "mentalmorphosis", "name": "Mentalmorphosis", "name_original": "Mentalmorphosis", "description": "<p>[EN]<br/>Mentalmorphosis is a typing game created during the POT-AU-JEU gamejam, challenged  by At0mium. The theme was : Metamorphosis.</p>\n<p>In Mentalmorphosis, you play as a woman walking along a park during sunset, when thoughts of your own and what people say to you ring in your head.</p>\n<p>You have to react to both negative and positive thoughts in order to maintain your self confidence in different fields (love, worth, intelligence, appeal and bravery).</p>\n<p>Try to remember you're doing everything you can, you're doing your best, don't let negative thoughts overwhelm you !</p>\n\n<p>[FR]<br/>Mentalmorphosis est un typing game créé pendant la gamejam POT-AU-FEU proposée par At0mium. Le thème était : métamorphose.</p>\n<p>Dans Mentalmorphosis, vous jouez une femme qui se balade le long d'un parc au coucher de soleil. Des pensées et des souvenirs de ce que les gens vous ont dit résonnent dans votre tête.</p>\n<p>Vous devez réagir face aux pensées positives comme négatives afin de maintenir votre confiance en vous dans différents domaines (amour, valeur, intelligence, charme et courage).</p>\n<p>Essayez de vous souvenir que vous faites tout ce que vous pouvez, vous faites de votre mieux, ne laissez pas les pensées négatives vous submerger !</p>", "metacritic": null, "released": "2019-05-19", "tba": false, "updated": "2019-05-20T04:07:47", "background_image": "https://media.rawg.io/media/screenshots/e9f/e9f7e4df53612a4d80672e1d4ea819ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["erfegon", "SheeroChana"], "genres": [], "publishers": [], "esrb_rating": null}