{"id": 320830, "slug": "macro-propene", "name": "Macro Propene", "name_original": "Macro Propene", "description": "<p><strong>Game:</strong></p>\n<p>Inspired by Micro Machines, comes the NES-styled game Macro Propene!</p>\n<p>Blast away the enemies making use of your almighty rear laser! Clear multiple stages and achieve new hi-scores in this exciting top-down tank game.</p>\n<p><em>Made for JamDNA 14.</em></p>\n<p><strong>Controls:</strong></p>\n<p><em><em>Use UP and DOWN to move forward and backward respectively.</em></em></p>\n<p><em>Use LEFT and RIGHT to turn directions.</em></p>\n<p><em>Press Z or SPACE to dash, releasing a beam.</em></p>\n<p><em>Hold SHIFT to aim. This restricts your movement and makes your turning speed slower, making it easier to attack. Highly recommended.</em></p>\n<p><em>Using SHIFT also displays the current hi-score of the stage on the top-right corner.</em></p>\n<p><em>If stuck, press R to start from the beginning of the stage.</em></p><p><em>Press F to pay respects to go fullscreen.</em></p>\n<p><strong>Criteria:</strong></p>\n<p><strong><em>Retro:</em></strong></p>\n<p><em>The game is styled after the NES console, even limiting its colors to each tile to give a more authentic feel. It also features chiptune music and sound effects adhering to the sound limitations the console had. Despite all this, the game uses smooth movement and animations to give it a fresh spin.</em></p>\n<p><strong><em>Laser Beam:</em></strong></p>\n<p><em>The laser beam is combined with the dash mechanic to make a powerful attack. This attack is hard to handle and therefore makes the player think more about the consequences of their attacks. This produces an aiming-heavy experience giving the laser beam more importance.</em></p>\n<p><em><strong>Dash:</strong> </em></p>\n<p><em>Dashing not only helps with your movement but it allows the player to move along conveyor belts. Both of these facts are used in later stages where dashing is used to make precise stages where the player must time their dashes.</em></p>\n<p><em><strong>Arpeggio:</strong></em></p>\n<p><em>Most sound effects including jingles, hits and even the laser themselves were composed using arpeggios, making use of the NES aesthetic and its limitations to its advantage. The music also features arpeggios throughout the whole track.</em></p>\n<p><strong>Credits:</strong></p>\n<p><em>Everything including art, sound and programming was made by me during the Jam period.</em></p>", "metacritic": null, "released": "2019-05-19", "tba": false, "updated": "2019-05-20T04:39:21", "background_image": "https://media.rawg.io/media/screenshots/3be/3be2a0521bbdfa30202bf58980b302ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ThanielPIN"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}