{"id": 320804, "slug": "red-sand", "name": "Red Sand", "name_original": "Red Sand", "description": "<p>You step out into the arena. the roar of the bloodthirsty crowd fills your ears. Your life is now their entertainment. The fine white sand is cool beneath your feet, but you know that soon it will be stained red with blood, yours, or that of your enemy.</p>\r\nHow to play:\r\n<p>Thank you for choosing to play <strong>Red Sand</strong>! The game has an in game tutorial, but here is all of the information in case you miss it:</p>\n<ul><li><strong>Movement </strong>- You can move left and right using A and D, or the left and right arrow keys on your keyboard. You can also use the left thumb stick if you prefer a game pad.</li><li><strong>Pick-up</strong> - Press E or Enter on the keyboard, or B on the game pad to pick up items. Items are highlighted blue when you are near enough to pick them up. </li><li><strong>Attacking </strong>- Press Ctrl on the keyboard or X on the game pad to attack. You can experiment with timing to pull off different combos.</li><li><strong>Blocking and Parrying</strong> - Press and hold the space bar, or A on your controller to block incoming attacks. Whilst blocking, you can press the attack button to parry. If you time it right, your opponent will be momentarily stunned, allowing you to quickly follow up with a combo.</li><li><strong>Diving and Sliding</strong> - Whilst you are moving, tap the block button to perform an evasive  dive and slide. At the end of your slide, tap the attack button to perform a quick attack. This is useful for breaking up large groups of enemies.</li><li><strong>Audience Favour </strong>- The blinking eyes in the background are the audience. If you can win them over, they will throw you health bottles, armour upgrades, and new weapons. The audience like frequent kills and varied combos. If you get hit or go long periods without a kill, the audience will get bored and stop supporting you. You can tell if an audience member favours you by their eye colour. Blue means they side with you, red means they favour you enemies.</li></ul>\n<p>This is you. You must keep fighting to stay alive.</p>\n<p>  <br/></p>\n<p>This is your health bar. Red is your remaining health, grey is your current level of armour.</p>\r\nPick-Ups\r\n<p>This is a health bottle. It will restore about half your health.</p>\n<p>This is an armour piece. It will raise you armour level a little. You can collect up to four of these, one for each limb.</p>\n<p>This is a helmet. It will raise your armour level a moderate amount.</p>\n<p>This is a chest plate. It will raise your armour level a lot.</p>\r\nWeapons\r\n<p>This is your sword. It is a fast weapon that does moderate damage.</p>\n<p>This is the Hammer. It is the strongest weapon, but also the slowest.</p>\n<p>This is the trident. It is fast, and has an extremely long reach.</p>\r\nEnemies\r\n<p>This is the Centurion. He is the fastest and most common enemy. He likes to show off with extravagant combos. Use this to your advantage.</p>\n<p>This is the Gladiator. He is tough and can take a lot of damage. Watch out for his relentless charging attack.</p>\n<p>This is the Cyclops. He is the biggest, most dangerous foe you will face in the game. You will need to bring him down to his knees in order to damage him. His legs are armoured at the front, so attack from behind. The Cyclops is a mindless beast, and won't hesitate to hit smaller enemies if they get in his way. Use this to your advantage.<br/></p>", "metacritic": null, "released": "2019-05-19", "tba": false, "updated": "2019-05-20T04:33:06", "background_image": "https://media.rawg.io/media/screenshots/151/151f27b1a10096562a3a47e54e04f1af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lake Inn Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}