{"id": 321069, "slug": "gobs-game-of-battle-simulation", "name": "GOBS - Game Of Battle Simulation", "name_original": "GOBS - Game Of Battle Simulation", "description": "<strong>GOBS is the battle simulator for creative battle builders</strong><br/><br/>GOBS is a game where you can build your own map from each bit of wall to the paths below.<br/>Then fill them with your own custom battle.<br/>Either it be creating historical battles or just making the most outrageous battles it's all down to you the player.<br/>There are a variety of different units to start with and each have their own cost, damage and health stats.<br/><br/>If you see a battle in a movie and want to create it, well GOBS is the 2D place for you to create custom maps and build massive battles in the formations that you want.<br/>In GOBS you can simply paint your own map, save and share it with others. Once you share it it becomes a new playground for others to build upon. <br/><br/>Not only are the maps shareable but you can fill them with units and share it as a battle. So if you placed 2000 units and want to share it, do it!<br/><br/>I have big plans for this game, at the moment it is very very early development and only has a few units/building parts to play with but the foundations are set in stone.<br/><br/>Do you want to make a battle where your units defend a wall, castle or just stand in a line? Well GOBS allows you to set each unit to either attack straight from the get go, or you can set them to defend so they will stand in line until enemys get up close.<br/><br/>Think your walls are safe? No each unit has the ability to damage walls and so they will break over time if you let the enemy get too close.<h3>Features:</h3><ul><li>Level creater<br/></li><li>Multiple unit types<br/></li><li>Campaign mode<br/></li><li>Map sharing<br/></li><li>Ability to set units to attack or defend<br/></li><li>Multiple sandbox maps<br/></li><li>Building tools<br/></li><li>Battle sharing</li></ul>", "metacritic": null, "released": "2019-05-17", "tba": false, "updated": "2020-04-13T07:50:46", "background_image": "https://media.rawg.io/media/screenshots/3df/3dfe0d6478ec2764e6ee8c55f2af847a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RFGames", "RF Games"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["RF Games"], "esrb_rating": null}