{"id": 32110, "slug": "biing-sex-intrigue-and-scalpels", "name": "Biing!: Sex, Intrigue and Scalpels", "name_original": "Biing!: Sex, Intrigue and Scalpels", "description": "<p>Mature content notice: Biing!: Sex, Intrigue and Scalpels contains explicit language, strong sexual themes, nudity and is intended for mature audiences.</p>\n<br/>\n<p>The sequel: Biing! 2 is included with the game as a bonus goodie. Available only in German.</p>\n<br/><br/>\nWhacky, graphically brilliant, extremely funny and incredibly entertaining, that was the judgement of the specialized press about BIING!. Of course you, as the manager of “Brainworm Memorial” should know exactly what’s important in modern medicine nowadays!<br/>\n<br/>\nSpecialists with a golf handicap under 50? <br/>\nDefinitely qualified!<br/>\n<br/>\nNurses with an education level below 3 and a bust less than 100?<br/>\nHighly unqualified.<br/>\n<br/>\nAfter all, you have to offer something to your patients. Only a satisfied customer pays the steep bill with a dreamy smile and returns. And only a healthy bank account allows you to buy the necessary medical hardware, like an ambulance and the operating theater. Well - the golf course could also use a renovation. <br/>\n<br/>\nLet’s hope you will never be admitted to this hospital. After all, we don’t take responsibility for your physical and mental integrity.<br/>\nIn case of risks and side effects, please take your doctor to the pharmacist and not to us!<br/>", "metacritic": null, "released": "1994-12-31", "tba": false, "updated": "2023-02-27T18:11:32", "background_image": "https://media.rawg.io/media/screenshots/570/570169303a24f0284e231a36110fe1bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 28, "owned": 213, "toplay": 1, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "Linux", "PC"], "developers": ["reLINE Software"], "genres": ["Strategy"], "publishers": ["Magic Bytes", "Biing-Fansite"], "esrb_rating": null}