{"id": 321195, "slug": "another-titanic", "name": "ANOTHER TITANIC", "name_original": "ANOTHER TITANIC", "description": "<p>It's another Titanic!!!!</p>\n<p>This game imagines an alternate timeline in which Robert Ballard, discoverer of the wreck of the Titanic, never finds the ship. Driven to despair, he leads his family to ruin, but before he dies he speaks these final words to his daughter Emily: “if we can’t find the damned thing... we’ll MAKE it!”</p>\n<p>One billion trillion years later, on the rim of a gaseous planetoid called Phera Nera Nott, Robert Ballard’s last blood descendant, Ira Salphira, finally succeeds in constructing the late oceanographer’s dream ship. You can look around it, and explore its innards. There are items to collect, and there are lots of persons to talk to. Persons love talking to their fellow persons...</p>\n<p>----------------------------</p>\n<p>This game was made for Porpentine's divination jam.</p>\n<p>--The entire Titanic was generated via a ship generation system I devised for the jam. It uses a deck of cards. All the ship's rooms and entrances were created via this process.</p>\n<p>--The color palettes for each room were randomly selected from a page of color patterns I found in Carole Thomerson's book <em>The Complete Upholstery</em>.</p>\n<p>--The items you can collect in the game were inspired by randomly selected pages of a September 1926 issue of the <em>American Builder</em> catalog.</p>\n<p>--The mood of each room was selected from a list of fifty-two different emotions that I compiled.</p>\n\n<p><em>^^^The deck of cards I used</em></p>\n<p>If you're interested in the intricacies of the generation process, I've uploaded a .zip folder which contains an in-depth explanation of how I generated the ship (although the way it's written is way too obtuse -- more of a \"gaze into the process\" than something you could use to generate your own ship, for now at least). There's also a spreadsheet containing all the room types and emotions I compiled, as well as a small photo album. This was super fun btw :0</p>", "metacritic": null, "released": "2019-05-17", "tba": false, "updated": "2019-05-20T06:13:08", "background_image": "https://media.rawg.io/media/screenshots/8ed/8ed1ef1f12bd924cadec28e37794662e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rowen-conry"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}