{"id": 32112, "slug": "dark-rift", "name": "Dark Rift", "name_original": "Dark Rift", "description": "Dark Rift - The Secret of The Prime Element<br/>\n<br/>\r\nAccording to Legend, When this Universe Was Created, A Master Key was Forged to Lock Away All Ancient Secrets and Infinite Powers The Cosmos Had to Offer.<br/>\n<br/>\r\nThe Key was then divided and cast into different circles of reality for safe keeping. These realities are joined together by one-way portals, or Dark Rifts, and only the individual who possesses a piece of the Master Key may cross the threshold into the next dimension. Upon crossing, the Dark Rift will seal itself and disappear.<br/>\n<br/>\r\nIt is said that when the pieces of the Master Key are reunited, the dimensions will converge to reveal the true center of the universe. The point of convergence is known as the Vortex. However, only the holder of the entire, re-forged Master Key may enter the Vortex and claim its immeasurable power.<br/>\n<br/>\r\nSTORY<br/>\n<br/>\r\nWhen the Hyperions accidentally acquired a piece of the Master Key, now named the Core Prime Element, they abused its power and proclaimed themselves the Chosen Ones. After many years of tyrannical rule, their society became morally destitute and internally corrupt. In the midst of this political and social chaos, Sonork Nezom arose as the Chosen One's demented Emperor. With the help of his sordid followers, Sonork enslaved the mass populace, murdered any possible opposition, and claimed the Core Primer Element as his own.<br/>\n<br/>\r\nFor many years, the Chosen Ones' malevolent rule was noted throughout the universe, and while many desired the Core Prime Element, only one entity sought the prize with vitilant fervor. Demitron, the Lord Demon of the Dark Dimension, waited until the time was right to demand the invaluable prize from the envied Chosen Ones. When Snork Nezom came into power, Demitron knew his chance had come.<br/>\n<br/>\r\nIn an effort to retrieve the Core Prime Element and assassinate Sonork, Demitron sent his most hideous servant, Demonica Gkroux, through the dimensional portal to do his bidding. When the Arch Demon Demonica failed her mission to murder Sonork, she unhesitatingly exchanged secret information for her life. She told Sonork that, aside from his Core Prime Element, there were at least two other known pieces of the Master Key. Demonica also revealed that while the Light Prime Element's Location had never been discovered, the Dark Prime Element was embedded in her lord master's head.<br/>\n<br/>\r\nAfter listening to Demonica's tale, Sonork resolved to procure the Light Prime Element and combine its powers with the Core Prime Element already in his possession. Hereasoned that if he had two pieces of Master Key, his powers would be so ominous that he would be able to seize Demitron's Dark Prime Element effortlessly.<br/>\n<br/>\r\nTHE TOURNAMENT<br/>\n<br/>\r\nBecause warriors from around the universe have continuously failed in their attempt to obtain the Core Prime Element and usurp Sonork, he is confident that there is no being who can overpower him in his dimension. With this belief, Sonork has created the most lethal and prestigious battle, The Tournament. Using his piece of the Master Key as the ultimate prize, Sonork is confident that the holder of the Prime Light Element will be lured to his realm. When he battles the desired holder and secures the Light Prime Element, Sonork plans to challenge the formidable Demitron and ascend to absolute and universal supremacy.<br/>\n<br/>\n<br/>\r\nGame Features -<br/>\n<br/>\r\n• Classic 3D Graphics<br/>\r\n• Story Mode <br/>\r\n• VS Mode<br/>\r\n• Training Mode<br/>\r\n• Combos<br/>\n<br/>\r\nDark Rift is a classic 1V1 Fighting game in a 3D environment. Players can choose between 8 different characters to play as your favorite. The game features combos, special moves, and enemy artificial intelligence which learns and counter attacks your moves. You can play in story mode or you can play VS locally.", "metacritic": null, "released": "1997-07-01", "tba": false, "updated": "2023-06-09T04:50:19", "background_image": "https://media.rawg.io/media/screenshots/dbd/dbdb7615d3e78d85332829cc45d97272.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Nintendo 64"], "developers": ["Kronos Digital Entertainment"], "genres": ["Action", "Arcade", "Fighting"], "publishers": ["Piko Interactive", "Vic Tokai", "Tokai Communications", "Bleem.Net"], "esrb_rating": null}