{"id": 321270, "slug": "yoomurjaks-ring", "name": "YOOMURJAK'S RING", "name_original": "YOOMURJAK'S RING", "description": "Jonathan Hunt, a journalist from New York, arrives in the city of Eger in Hungary for a break. He has local ancestry and speaks the language, but this is not the only motive for his visit. In the heritage of his great-grandfather, the globetrotter professor Samuel Hunt, he found two letters dated back in 1898. The letters were written by a professor Ábray, an apparently lunatic Hungarian scientist, about a time machine he claimed to have been working on. The references point to Eger, and Hunt wants to find out what happened to the man’s preposterous invention. But he soon realizes that someone is desperately trying to stop him...<br/><br/><strong>Think!</strong><br/>Look for realistic solutions. What would be a good idea in a given situation?<br/><br/><strong>Ask questions</strong><br/>Try to talk to everyone and exhaust all conversation topics. You can get stuck if you miss a clue.<br/><br/><strong>Look around carefully</strong><br/>Explore every location; check if anything can be examined. It may happen that an object becomes active only later in the game. If an object would come in useful but it was inactive earlier, it is worth trying again.<br/><br/><strong>Zoom and read</strong><br/>Enlarge objects and make documents readable by clicking their thumbnail in the inventory. Watch out for further possible actions in close-ups. Documents may have multiple pages!<br/><br/><strong>Combine objects</strong><br/>You can sometimes combine objects in the inventory to get a new object.<br/><br/><strong>Make notes</strong><br/>You may find it useful to make notes, just like Jonathan does. This is especially advisable later in the game when the investigation runs on multiple lines. Proceed systematically; try to focus on one subject at a time.", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2019-08-28T21:45:10", "background_image": "https://media.rawg.io/media/screenshots/41c/41c9d5e7248156c890440b8d24371d09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 19, "dropped": 2}, "playtime": 11, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Private Moon Studios"], "genres": ["Adventure"], "publishers": ["Microids Indie"], "esrb_rating": null}