{"id": 321371, "slug": "poker-night-in-america", "name": "Poker Night in America", "name_original": "Poker Night in America", "description": "PLAY NOW and win a chance to play poker on NATIONAL TV! This is the official social poker app published by the hit TV series Poker Night In America! Play FREE Texas Hold’em Poker against millions of other players, invite your friends, and have your very own Poker Night. Our weekly sweepstakes lets you win REAL WORLD PRIZES, including a chance to live your poker dream and PLAY AGAINST POKER CELEBRITIES on national television!<br/><br/>Game features:<br/>● FREE CHIPS – Play the game every day to get free chips!<br/>● REAL WORLD PRIZES – Play to enter a sweepstakes for chances to win amazing prizes including Poker Night in America gear, meeting famous poker pros, or the ultimate prize - to be able to play poker on TV against REAL POKER CELEBRITIES! Each taping is also streamed on Twitch with LIVE CARD GRAPHICS!<br/>● TOURNAMENTS – Master your poker skills! Participate in WEEKLY Sit n' Go and Shootout tournaments where you can WIN unique Trophies and top our Leaderboard.<br/>● GET REWARDS – GET REWARDS – Up the stakes, win hands, go all-in and unlock achievements. Bet Big to Win!<br/>● PARTY MODES – Mix up your Texas hold'em poker game with unique game modes and get amazing combinations!<br/>● BOOST POKER MODE – The biggest \"winner takes all\" weekly tournament, where you spin the reel for a chance to win 5 billion chips! Boost your balance with this incredibly exciting game!<br/>● MULTI-TABLE TOURNAMENTS (MTT) – The most popular offline tournaments are now available online! Play at several tables with lots of worthy competitors and reach the final table!<br/>● QUESTS - Complete daily quests to get free chips!<br/>● YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many poker tournaments you've won and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!<br/>● CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other Texas hold'em players.<br/>● FAIR HAND DEALING GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest Texas hold'em experience!<br/>● LEARN TO PLAY – Are you new to poker but always wanted to try it? Our simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about poker, from the rules of the game to winning combinations.<br/>● NO REGISTRATION – Get straight into the action. Choose guest mode to use our poker app without registering.<br/>● SINGLE ACCOUNT – Start playing free Texas hold'em poker on your smartphone, then continue on your tablet without losing progress.<br/><br/>Follow us on Twitter, Twitch, YouTube, and Facebook!<br/><br/>twitter.com/PokerNightTV<br/><br/>twitch.tv/PokerNightTV<br/><br/>youtube.com/PokerNight<br/><br/>facebook.com/PokerNightInAmerica<br/>Apple is not affiliated with, and does not sponsor or endorse, this promotion in any way. This game is only available to people of legal age. Success in playing this game does not imply your success in a similar real-money casino game.", "metacritic": null, "released": "2017-06-01", "tba": false, "updated": "2019-10-22T14:39:23", "background_image": "https://media.rawg.io/media/screenshots/53f/53f3faaf6d206298cabeb112ba4c27cf_hKCkLH3.jpg", "website": "http://pokernight.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rush Street Productions"], "genres": ["Card"], "publishers": ["Rush Street Productions"], "esrb_rating": "Mature"}