{"id": 321317, "slug": "yu-no", "name": "YU-NO: A Girl Who Chants Love at the Bound of this World", "name_original": "YU-NO: A Girl Who Chants Love at the Bound of this World", "description": "<p>Your Love Awaits Beyond This World.<br />\nDuring his vacation from Sakaimachi Academy, Takuya Arima receives a package from his supposedly deceased father. It contains the mysterious Reflector Device which allows the user to travel between parallel worlds.<br />\nWith help from his friends, teachers, and lovers, Takuya must unearth the mystery of his father&#39;s legacy to prevent a calamity threatening to envelop reality itself.<br />\nKey Features<br />\nThe Power of the Reflector - Explore multiple timelines and revisit events through the unique gaming mechanic of the Reflector Device. This allows you to explore every timeline in detail. Activate the Reflector Device’s Auto Divergence Map System to return to an event with more knowledge and new items.<br />\nYour Father&#39;s Clues - Solve all the mysteries of Sakaimachi to uncover the real secrets lying beneath Sword Cape. Collect items from one timeline and use them in the next to unlock Sword Cape&#39;s hidden truth.<br />\nLove Beyond Worlds - Can you find the hidden world waiting beyond Sakaimachi? Fall in love with every character to reach the true ending to this 40+ hour visual novel.</p>", "metacritic": 64, "released": "1997-12-04", "tba": false, "updated": "2024-04-13T15:25:35", "background_image": "https://media.rawg.io/media/games/a64/a64a6d8d5d6d795786b802070e4d510d.jpg", "website": "http://spike-chunsoft.com/YU-NO/", "rating": 2.86, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 41, "beaten": 6, "toplay": 4, "dropped": 1}, "playtime": 15, "achievements_count": 4, "ratings_count": 7, "suggestions_count": 516, "game_series_count": 1, "reviews_count": 7, "platforms": ["PlayStation 4", "Nintendo Switch", "PC", "SEGA Saturn", "PS Vita"], "developers": ["MAGES", "5pb.", "ELF"], "genres": ["Adventure"], "publishers": ["Spike Chunsoft Co", "ELF", "5pb Games", "Spike Chunsoft US"], "esrb_rating": "Mature"}