{"id": 321415, "slug": "frozen-bridges-free-bridge-construction-simulator", "name": "Frozen bridges free: bridge-construction simulator", "name_original": "Frozen bridges free: bridge-construction simulator", "description": "This is an interesting puzzle game suitable for those who love construction and design. The essence of the game is very simple and straightforward, even a child - you have to build a bridge, traveling in which a vehicle that you have selected will get to the next level.<br/>Build need a reliable bridge, using a variety of designs: the roadbed, ropes and props. If you did everything correctly, your car will rush on through the drifts and ice barriers.<br/>The construction of the bridge - it is responsible, and without the knowledge of the physical laws can not do here. Complexity increases from level to level, passing each of which opens the player access to new transport.<br/>The full version of the game contains 46 levels and 5 different machines. Each of them has its landscape, its road and its bridge, which you need to build in order to pave the way to your rover forward towards new adventures.<br/>Try to pass the first level, and you will understand that that's not enough, and all the fun is waiting for you ahead.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not soon? Pick yourself up a great game puzzle. Building bridges can carry away into the wonderful world of gaming. New levels are waiting for you.<br/>Is free!<br/>Download Now!<br/>Play anytime and anywhere!<br/>Enjoy!<br/>Thanks for the good ratings and reviews!", "metacritic": null, "released": "2015-10-26", "tba": false, "updated": "2019-10-22T14:39:26", "background_image": "https://media.rawg.io/media/screenshots/888/888fb4dff76650f9fd31e096ff1ad2ff_nVRI7mc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Strategy", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}