{"id": 321424, "slug": "connect-colored-lines", "name": "Connect colored lines", "name_original": "Connect colored lines", "description": "We present you a puzzle game in the genre of casual games - arcade \"Joining the color line.\" This game is gaining in popularity and is waiting for its fans.<br/>Joining colored lines - a simple puzzle from which you have a wonderful time. The game begins with a varied and simple level, and then become more difficult with each successive level. It will help you to have a good time, relax and unwind from the brain.<br/>In this game simple control Touch one finger. The game interface is simple and intuitive for both children and adults. Beautiful, bright colors sure to please you. Connects the dots of the same color to get the colored line, using all of the cells of the playing field, for this you will get the maximum points. The essence of the game is to connect the line color matching to create the road. Connect all colors to color lines occupy the whole plane of the playing field, to go through all the levels of the puzzle game \"Joining the color line.\" But beware, the lines may break at the intersection or superimposed on each other!<br/>Before you open hundreds of levels, pass them all.<br/>This game is for everyone who likes the game to train your brain activity, logical and mathematical games, as well as other games of this genre, such as building bridges, connecting the pipe to roll the ball through the maze, you will be constantly connecting colored lines for several hours !<br/>The game will entice and boys and girls. Parents themselves can play and compete with children who will connect all the threads of colored lines, who earn more points or who will pass more levels. championship Spirit is waiting for you in our new game.<br/>If you like to play the classic games on the construction of colored threads, lines, routes, mazes of pipes or road you will enjoy the game \"Colored Lines Connection\"!<br/>Try to start the game, and you will see that this is not enough, you will want to continually build a path of colored lines, but it is more complicated than it seems.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not be in the near future? Take a fascinating game. The flow of colored lines will take you to the wonderful world of games. Colored lines are waiting for you.<br/><br/>Download now!<br/><br/>Play anytime and anywhere!<br/><br/>Enjoy!<br/><br/>Thanks for the good ratings and reviews!", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2019-10-22T14:39:26", "background_image": "https://media.rawg.io/media/screenshots/163/1632d40ec173fdc6a699e0ed16ebc60d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Casual", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}