{"id": 321429, "slug": "remove-color-blocks", "name": "Remove color blocks", "name_original": "Remove color blocks", "description": "We present you the game in the genre of puzzle Match-3 \"Remove the colored blocks.\" The game \"Remove colored blocks\" is gaining popularity and is waiting for his new fans.<br/>Removal of colored blocks - this is a simple form of the game. It will help you to have a good time, relax and unwind from the brain.<br/>In this game, a simple one-touch control. The game interface is simple and intuitive for both children and adults. Calm pastel colors Tons will be pleasing to the eye and your vision will be fine. Clean the screen thoroughly and get maximum points. The essence of the game is to pop the squares of the same color that are close by. One touch of a finger, will remove the colored blocks in an amount of 3 pieces. These boxes will be removed and other blocks will fall. You need to remove all the blocks from the field!<br/>This game is suitable and for those who like games to train brain activity, logical and mathematical games, as well as other games of this genre, you will constantly play the colored blocks in a few hours!<br/>The game will entice and boys and girls. Parents themselves can play and compete with children who are more remove the colored squares and who earn more points.<br/>If you like to play the classic game to remove colored blocks, squares, balls, gems or bubbles you will enjoy the game, \"Remove the colored blocks!\"<br/>Try to start the game, and you will see that this is not enough, you want to clear the screen, but it is more complicated than it seems.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not be in the near future? Take a fascinating game. Game Match 3: ColorBlocks will take you to the wonderful world of games. Colored blocks are waiting for you.<br/><br/>Download now!<br/><br/>Play anytime and anywhere!<br/><br/>Enjoy!<br/><br/>Thanks for the good ratings and reviews!", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-10-22T14:39:26", "background_image": "https://media.rawg.io/media/screenshots/114/1147525b4e8ef3d3ab4105a0cc795488.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Casual", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}