{"id": 321453, "slug": "christmas-slingshot", "name": "Christmas slingshot", "name_original": "Christmas slingshot", "description": "Physical game Christmas slingshot is waiting for you. Fans of shooting a slingshot will have a lot of fun. Interesting levels, the physical world, and, of course, the Christmas spirit will carry you away for a long time.<br/>The game will entice and boys and girls. Adults can also play and compete with your children, who will pass more levels.<br/>The game is easy to operate, with an easy and intuitive interface, you will understand at once what to do. Defeat the enemy is easier than it seems at first glance. Fearless Ninja eager for the fight. They themselves jumping into the slingshot. You just have to set the trajectory and force of impact. Point ninja in the right direction, then he will do everything himself. Everyone has their own abilities, use them correctly.<br/>Slingshot is a fun physical game, which is filled with the spirit of Christmas. Immerse yourself in the fabulous world and enjoy the game.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not soon? Take an interesting game. Christmas slingshot can carry out in the wonderful world of gaming. New levels are waiting for you.<br/><br/>Play anytime and anywhere!<br/><br/>Enjoy!<br/><br/>Download now and share with your friends!<br/><br/>Thank you for the good reviews)", "metacritic": null, "released": "2016-05-12", "tba": false, "updated": "2019-10-22T14:39:28", "background_image": "https://media.rawg.io/media/screenshots/562/562ebb33bd08475211d56eaa42bb9d45_LZJC4LY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Casual", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}