{"id": 321469, "slug": "slice-puzzle-2d", "name": "Slice puzzle 2d", "name_original": "Slice puzzle 2d", "description": "Slice 2D puzzle - a physical game in which you need to cut the box to clear the field! This is one of the best games to have a good time.<br/>Slice 2D puzzle - an exciting game and an interesting puzzle. Cut objects to clear the field, a smaller number of moves to get the highest score.<br/>The game uses physics engine as close as possible to the real world.<br/>So far, the game contains 20 levels.<br/>This game is suitable and for those who like games to train brain activity, logical and mathematical games, as well as other games of this genre, you will constantly play the slice for a few hours to improve your score!<br/>The game will entice and boys and girls. Parents themselves can play and compete with your children, who will pass more levels with the maximum number of stars.<br/>If you like to play the classic game of cutting blocks, boxes, balls or fruit you will enjoy the game \"Slice\"!<br/>Try to start the game, and you will see that this is not enough, you will want to go through the game completely, but it is more complicated than it seems.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not be in the near future? Take a fascinating game. Game Slice 2D puzzle game takes you into the wonderful world of games. New levels are waiting for you.<br/><br/>Download now!<br/><br/>Play anytime and anywhere!<br/><br/>Enjoy!<br/><br/>Thanks for the good ratings and reviews!", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-10-22T14:39:28", "background_image": "https://media.rawg.io/media/screenshots/7c8/7c8b7732a9988cd89f3201c4dd4028e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Strategy", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}