{"id": 321419, "slug": "pipe-constructor-puzzle-game", "name": "Pipe constructor - puzzle game", "name_original": "Pipe constructor - puzzle game", "description": "We present you a puzzle game in the genre of casual games - arcade game \"Pipe Design\". This game is gaining in popularity and is waiting for its fans.<br/>Joining pipe - is a simple puzzle from which you have a wonderful time. The game begins with a varied and simple level, and then become more difficult with each successive level. Designing the pipe will help you to have a good time, relax and unwind.<br/>In this game simple control Touch one finger. The game interface is simple and intuitive for both children and adults. Connect the pipes to build a solid water, be sure to go through the metering devices. The essence of the game is to connect the tube and create a flow of water therein. Connect the pipe so that water flow was the instrument on the playing field, it will help you pass all the levels of the puzzle game \"Pipe Design\". Before you open to 2048 levels, go through them all.<br/>This game is for everyone who likes the game to train your brain activity, logical and mathematical games, as well as other games of this genre, such as building bridges, connecting colored lines, to roll a ball through a maze, you will continually build a pipe within a few hours !<br/>The game will entice and boys and girls. Parents themselves can play and compete with children who will build the water flows, or who pass more levels. championship Spirit is waiting for you in our new game.<br/>If you like to play the classic games on the construction of colored threads, lines, routes, mazes of pipes or road you will enjoy the game \"designer pipe!\"<br/>Try to start the game, and you will see that this is not enough, you will want to continually build the pipe, but it is more complicated than it seems.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not be in the near future? Take a fascinating game. Designer Tube will take you to the wonderful world of games. Water is waiting for you.<br/><br/>Download now!<br/><br/>Play anytime and anywhere!<br/><br/>Enjoy!<br/><br/>Thanks for the good ratings and reviews!", "metacritic": null, "released": "2017-02-20", "tba": false, "updated": "2019-10-22T14:39:26", "background_image": "https://media.rawg.io/media/screenshots/035/035a711ce103fb635c86f792315963cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Casual", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}