{"id": 3214, "slug": "ziggurat", "name": "Ziggurat", "name_original": "Ziggurat", "description": "<p>Ziggurat is an indie first-person adventure dungeon crawling game developed by Milkstone Studios.</p>\n<h3>Gameplay</h3>\n<p>The game was heavily inspired by Heretic and Hexen, which are considered classic first-person shooters. You play as a sorcerer who seeks fame. He enters a mysterious labyrinth and faces all the dangers of an ancient dungeon. </p>\n<p>The game revolves around fast-paced and action-packed first-person shooting classical mechanics. Several roguelike elements were also added into the mix which resulted in a completely different addition to the genre. The levels are procedurally generated so that every playthrough will be different. Leveling up and improving your skills is a must in order to survive countless enemy encounters. </p>\n<p>A perk system is also present in the game. Most of the perks featured in the game are designed for the players to create their own play style. The choice between the perks was purposely made simple. For example, the players have to choose between increased movement speed at the expanse of lower health or mana regeneration. </p>\n<p>There is no inventory present in the game as it was streamlined in order to increase the gameplay speed. Instead of that, all the players have to manage is the comparison of several items, weapon selection, and the amount of mana and health.</p>", "metacritic": 75, "released": "2014-10-22", "tba": false, "updated": "2024-03-15T13:02:42", "background_image": "https://media.rawg.io/media/screenshots/929/92962e1c3902b9a89b91c09c8f1a17b2.jpg", "website": "http://www.milkstonestudios.com/games/ziggurat/", "rating": 3.02, "rating_top": 3, "added_by_status": {"yet": 132, "owned": 1804, "beaten": 37, "toplay": 18, "dropped": 99, "playing": 9}, "playtime": 4, "achievements_count": 273, "ratings_count": 200, "suggestions_count": 675, "game_series_count": 1, "reviews_count": 203, "platforms": ["Xbox One", "macOS", "Wii U", "PlayStation 4", "Nintendo Switch", "PC", "Linux"], "developers": ["Milkstone Studios"], "genres": ["Action", "Shooter", "RPG", "Indie"], "publishers": ["Milkstone Studios"], "esrb_rating": null}