{"id": 321435, "slug": "railway-bridge-2-bridge-construction-simulator", "name": "Railway bridge 2 - Bridge construction simulator", "name_original": "Railway bridge 2 - Bridge construction simulator", "description": "A new addictive puzzle game \"Railway Bridge 2\" was published in a new format.<br/><br/>In the new game the construction of bridges has become more realistic. For those who like to build and design the puzzle game \"Railway Bridge 2\" will be enjoyed. Build bridges - responsible business. Knowledge of the physical properties of different materials and pavement useful our builders. The reliability of the constructed bridge depends on whether you pass the entire route. At this time, we will offer you a variety of different scenic spots: different cities, mountains, deserts and more. You will be an exciting journey and a new approach to building bridges that will absorb you for a long time.<br/><br/>New features, more building materials, more stable compounds, the ability to install a static player foothold. There is no limit on the materials. There is a certain budget. Do you have a fixed amount of virtual money on the game. In each level the player has deducted the cost of materials. The smaller the structures used in the construction of the bridge, the lower the costs you will incur. If the budget has become very limited, you can try to pass some previous level again, but with fewer materials. Then, the difference is returned to you in a purse and plus you get an additional 30%.<br/><br/>The game will entice and boys and girls. Parents themselves can play, compete with the children, who will pass more levels.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not soon? Pick yourself up a great game. Railway bridge 2 is able to carry away to the wonderful world of gaming. New levels are waiting for you.<br/>Download Now!<br/>Play anytime and anywhere!<br/>Enjoy!<br/>Thanks for the good ratings and reviews!<br/><br/>Good luck and good mood.", "metacritic": null, "released": "2016-04-26", "tba": false, "updated": "2019-10-22T14:39:27", "background_image": "https://media.rawg.io/media/screenshots/2f5/2f5df3ba56245ecacdddd930666fec84_bddKpux.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Strategy", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}