{"id": 321431, "slug": "frozen-bridges-bridge-construction-simulator", "name": "Frozen bridges - Bridge construction simulator", "name_original": "Frozen bridges - Bridge construction simulator", "description": "We present to your attention a series of games dedicated to the construction of bridges. Popular game \"Railway bridge\" has its continuation in a new physical game \"Frozen bridges\".<br/>Action games \"Frozen bridges\" occurring in the Arctic. We tried to create in-game themed atmosphere. The game combines graphics and music corresponding to a given topic.<br/>Building bridges in the permafrost - not an easy task. The icy snowdrifts prevent builders. But for those who like to build and design a puzzle game \"Frozen bridges\" like.<br/>Build bridges - responsible business. Knowledge of the physical properties of different materials and pavements will be useful for our builders even in the Far North. The reliability of the constructed bridge depends on whether you pass the entire route. You will find a lot of dangers on the road, as well as an exciting journey that will absorb you for a long time.<br/>In this puzzle game simple operation. The simple interface is understandable for children and adults. The game contains 47 levels and 5 different machines. Several different locations diversify your way, find your way and build a bridge that will help pave the way forward to new adventures.<br/>Try to get past the first level, and you will see that this is not enough, and all the fun is waiting for you ahead.<br/>The game will entice and boys and girls. Parents themselves can play, compete with the children, who will pass more levels.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not be in the near future? Take a fascinating game. Frozen bridges will carry you into the wonderful world of games. New levels are waiting for you.<br/><br/>Download now!<br/><br/>Play anytime and anywhere!<br/><br/>Enjoy!<br/><br/>Thanks for the good ratings and reviews!<br/><br/>Conquer the Arctic.", "metacritic": null, "released": "2015-06-04", "tba": false, "updated": "2019-10-22T14:39:26", "background_image": "https://media.rawg.io/media/screenshots/dfc/dfc58414bd55df7323395eb009d8d392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Strategy", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}