{"id": 321461, "slug": "a-maze-puzzle-2d", "name": "A maze puzzle 2D", "name_original": "A maze puzzle 2D", "description": "New exciting 2D maze is a puzzle game from the makers of railway bridges. This game is designed for all age groups. Walk through the maze of color control points. Every next level more difficult, and the playing field more and more. Do not miss the color control points that the ball came to the finish line. It is important that the ball went through all the control points, otherwise the level will not be counted.<br/>In our game easy operation and simple interface. Nice colors and anything extra that can distract you from the game. To control the ball, only a light touch and hold your finger on it in the right direction field. The ball easily slides into the maze and passes control points. Levels quite a lot, for a long time to plunge into the game world of amazing puzzles.<br/>Puzzle game suitable for both children and adults. Developing game teaches children of all ages to look for a solution that will lead the ball to the finish line. The game will entice and boys and girls. Parents themselves can play, compete with the children, who will pass more levels.<br/>Do you want to have fun - take the exit in the maze)) do not give up ... The game develops great reaction, memory, fine motor skills of hands, logical thinking. Be careful, be first, be the best. A fascinating and amazing maze will teach you to find your way in any situation.<br/>Bored on the way to school or work? Are you waiting for friends who are late? Maybe you're stuck in a \"traffic jam\"? Or, your turn will not soon? Pick yourself up a great game puzzle. Maze puzzle is able to carry away to the wonderful world of gaming. New levels are waiting for you.<br/>Download Now!<br/>Play anytime and anywhere!<br/>Enjoy!<br/>Thanks for the good ratings and reviews!", "metacritic": null, "released": "2016-05-07", "tba": false, "updated": "2019-10-22T14:39:28", "background_image": "https://media.rawg.io/media/screenshots/27e/27e51bac0e37301bc4b815d6b93c4260.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikolay Kunin"], "genres": ["Casual", "Puzzle"], "publishers": ["Nikolay Kunin"], "esrb_rating": "Everyone 10+"}