{"id": 321734, "slug": "gardeners-of-the-galaxy", "name": "Gardeners of the Galaxy", "name_original": "Gardeners of the Galaxy", "description": "<p>This is my entry for the Weekly Game Jam 97. The theme is \"Strange Garden\", and I think is a pretty strange take on the gardening game sim! Hope you enjoy!</p>\n<p>This game has only been tested on Windows 10 and is assumed to only work on that platform. Please let me know if it doesn't work for you if you are using that platform.</p><p>You can also download the source code for the game from my GitHub here: https://github.com/s0lly/Gardeners-of-the-Galaxy</p>\n<p>Game Premise:</p>\n<p>You have been assigned to an off-world farm to provide food for the ever-growing, ever hungry population of your home planet.<br/>You need to forage food, but be careful, as you have limited time and energy. If you fail in your mission, the Food Police will be knocking on your door (or dome, really).<br/>You will start off with one type of crop. If you prove yourself to your overlords, they will provide more crop types which produce more food.<br/>Caution is required however, as some crops don't just provide benefits...<br/>And sleep often, as you move slower when you are more tired! If you stop moving, well, you stop gamin'!</p>\n<p>Controls:<br/>    <br/>Movement  W A S D</p>\n<p>Select between different seeds  Q E  </p>\n<p>Plant crops    SPACE </p>\n<p>Chop down crops CONTROL</p>\n<p>Enter house to sleep ENTER</p>\n<p>Access the pause menu      ESC  </p>\n<p>Leave the pause menu      ESC  </p>\n<p>Select menu items SPACE / ENTER</p>\n<p>Tips:</p>\n<p>You need to be very close to the center of the door of your hut to enter the hut (by pressing ENTER) to sleep.<br/>Planting by your hut will hide plants behind the hut. This will lead to drama. Don't do it.<br/>Gravity is low. You can go into a stable orbit. It's fun.<br/>If you spin around your dome too fast, you will be released into the void of space. Oddly, this does not help you win the game.<br/>I suck at art, hence no art in this game. Or maybe I'm a harbringer of some new-age kind of art. That's on you to decide.<br/>Most importantly, I hope you have fun!</p>\n<p>Acknowledgements:</p>\n<p>This was made using the Chili Framework: https://wiki.planetchili.net - thanks Chili!</p>\n<p>Music by Eric Skiff, song \"All of Us\" for the intro scene and the following tunes for in game music:<br/>\"HHavok-intro\"<br/>\"We're the Resistors\"<br/>\"Arpanauts\"<br/>\"Prologue\"<br/>(All available at http://EricSkiff.com/music - the Creative Commons Attribution 4.0 (CC-BY) license can be found here: https://creativecommons.org/licenses/by/4.0/)</p>\n<p>by s0lly<br/>https://www.youtube.com/c/s0lly<br/>https://www.instagram.com/s0lly.gaming/<br/>https://twitter.com/s0lly</p>", "metacritic": null, "released": "2019-05-23", "tba": false, "updated": "2019-05-24T05:51:48", "background_image": "https://media.rawg.io/media/screenshots/850/850ed9fd7cf13c96fb66e3ccc5f35d3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["s0lly"], "genres": [], "publishers": [], "esrb_rating": null}