{"id": 321863, "slug": "movie-trap", "name": "Movie Trap", "name_original": "Movie Trap", "description": "¿Que es?:\r\n<p>Movie Trap es un videojuego de puzzle plataformas basado en películas clásicas de la cultura popular en el cual el jugador se moverá en estos niveles para conseguir el objetivo de salir de las películas sin modificar la trama de estas recolectando los tickets especiales que abrirán la puerta salida de la película.</p>\r\nHistoria:\r\n<p>En un día normal, el protagonista descubre que su vecino es un científico loco, este con el plan de dominar el mundo con su nuevo invento, una máquina que le permitirá moverse y robar objetos poderosos de las películas, estos para llevar a cabo su plan de conquista mundial. El héroe decide destruir el plan malévolo de su vecino, pero este le tiende una trampa, ahora nuestro héroe debe escapar del mundo de las películas en el cual está atrapado lo antes posible, para detener los planes del científico loco.</p>\r\nControles:\r\n<p>El juego al ser desarrollado para plataformas móviles cuenta con controles sencillos, el jugador es incapaz de saltar dentro del juego lo cual es un reto mas para pasar los obstáculos en el tiempo indicado, trata de acostumbrarte a ellos para pasar los niveles rápidamente!.</p>\n\r\nDevelopers:\r\n<p>\n</p>\r\nContactos:\r\n<p>¿Te interesa nuestro juego? visita las redes sociales de los desarrolladores, mándanos un mensaje o mira  nuestros portafolios y trabajos de otros proyectos.</p>\n<p><strong>Carlos: Facebook </strong></p>\n<p><strong>Karla: Portafolio</strong></p>\n<p><strong>Marco: Portafolio, Twitter.</strong></p>", "metacritic": null, "released": "2019-05-22", "tba": false, "updated": "2019-05-24T07:18:50", "background_image": "https://media.rawg.io/media/screenshots/85a/85a4de27921ce9377567072db84ad288.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Matov"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}