{"id": 321949, "slug": "la-boussole-des-brumes", "name": "La Boussole des Brumes", "name_original": "La Boussole des Brumes", "description": "<p>Incarnez Quentin et découvrez ce qui se cache au-delà de cette bien étrange librairie, apparue en une nuit, sur le chemin du collège. Un peu de rêve et beaucoup de cauchemars au rendez-vous !</p>\n<p>La Boussole des Brumes est un jeu textuel, un croisement entre un rogue-like et un livre dont vous êtes le héros. Gestion d’inventaire et d’équipement, personnalisation des capacités du personnage, combats tactiques au tour par tour, situations à choix multiples, plusieurs modes de difficulté, voilà ce que propose le jeu. Il dispose également de plusieurs fins très différentes. Si vous voulez toutes les trouver, vous en aurez probablement pour quelques dizaines d’heures.</p>\n<p>Ce jeu est mon 3ème projet, mais le premier que je mène en groupe. Réalisé dans un cadre bénévole, il a été conçu afin d’être accessible aux lecteurs d’écran, donc aux déficients visuels, sans pour autant leur être réservé. Ce n’est pas un jeu à but pédagogique, c’est juste un jeu fait pour que des voyants et non voyants puissent tous passer un agréable moment.</p>\n<p>Voici un montage réalisé par Tycobb, notre principal musicien, qui expose son travail et celui de nos illustrateurs :<br/></p>\n\n<p>Sur mon site, vous trouverez une version de la Boussole des Brumes jouable en ligne, ainsi que mes autres projets, largement plus modestes et tout aussi gratuits.<br/>http://www.leniddecorax.fr/</p>\n<p>Si vous appréciez notre travail, faites-nous un peu de pub, on appréciera.</p>", "metacritic": null, "released": "2019-05-22", "tba": false, "updated": "2019-05-24T07:34:06", "background_image": "https://media.rawg.io/media/screenshots/d8e/d8e329cbba78b640d5388645a6d0780f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Le Nid de Corax"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}