{"id": 322013, "slug": "action-priest", "name": "Action Priest", "name_original": "Action Priest", "description": "<p><strong>What Is Action Priest?</strong></p>\n<p>Action priest is a First-person action adventure game based around one priest who starts a long bloodline of priests which all portray the mannerisms of classic 80s action heroes, where demons rule the land and your bloodline must ‘finish what Jesus started’ (the main motto) which means to cleanse the land of demons. <br/></p>\n\n<p>Originally Action Priest started as a final project at University for 2 of our members. After graduation we grouped together with 4 other postgraduate students to create Buccanerds. Since then we have been developing our ideas to have a solid foundation before we start full development which will start during July 2019. Our team consists of the following; Game Designer, Programmer, Level Designer/Producer, Enviromental Artist/Visual Designer, Technical Sound Designer, Prop/Concept Artist.</p>\n\n<p><strong>Current Build</strong><br/></p>\n<p>Currently we have a very early prototype that has 1 playable level along with 2 weapons, 3 enemy types and a boss. Additionally we have some test scenes created aimed towards setting the mood and the art-style that we will be going for once we fully go into development as we are on hold until the end of June. </p>\n<p><strong>Current Build Visuals</strong><br/></p>\n\n<p><strong>Test Scene Visuals</strong></p>\n\n<p><strong>The Plan</strong></p>\n<p>The plot and plan for Action priest, is to involve different time periods with different bloodlines of Action priest. This will give more environment and story opportunities whilst also giving more chapter potentials. The idea is a long scale story of a never-ending battle against demons, where the whole bloodline of action priest is involved trying to stop the source of the demons. We aim to achieve a story-line where we can take the player on a adventure through different time periods with a variety of different protagonists whilst really emphasising the development of these time periods and what defined them.</p>\n<p><strong>The Story</strong></p>\n<p>During a demonic outbreak in the year 1350 Priests formed The Order and were trained for combat against the forces of Hell. But there was one priest who needed no training; naturally gifted he possessed the skills and adaptability to overcome any amount of force thrown his way by the forces of hell. </p>\n<p>During this Demonic Plague The Order found the source of the hellish invasion. A portal hidden under the town of Prheirbridge(WIP), it had been discovered by a missionary sent originally to spread word of the demonic epidemic but all they found were the remnants of a once bustling town succumb to death and infernal destruction.</p>\n<p> Exploring the remains of the town the missionary discovered the source of the recent hellish plague infecting the land. Under the city’s once busy streets a sacrificial cult planned and succeeded in bringing a hellgate to fruition. Knowing they wouldn’t be able to stop the gate themselves they ran. Returning to the Order with news about the destruction of Prhier, the Hellgate and its origins. </p>\n<p> To resolve the demonic outbreak once and for all a small group of priests were sent into the ruins of Prheir to destroy the Hellgate and end the demonic invasion. Sensing the impending doom of their only gateway into the human world, the demons of Hell made one last push through the portal as a last endeavor to stop the group of priests honing in. Amongst them was the destined one, a priest chosen by God to be the final stand between demons and humankind. </p>\n<p> As they moved through the town fighting through hordes of demons the group of priests quickly diminished until only the destined one remained. He fought heroically by himself filled with determination he reached the portal where Malphas one of the Great Prince's of Hell awaited. They battled at the foot of the Hellgate valiantly fighting with courage and determination. The priest although fatally wounded by the Great Prince, struck the finishing blow to the demon. With his final breaths the priest knelt down in front of the Hellgate covered in the remnants of the fight he had won and prayed. </p>\n\n<p> He prayed to his God for the demonic portal to be closed, for it to be destroyed and locked away for eternity. Showing his dedication and willpower towards his goals God knew that the priest they had chosen was right person to be the saving guardian, not just for mankind but for heaven too. Drawing his final breath the priest continued to pray, impressed by his devotion God acted through the priest fulfilling his prayers God destroyed the portal and created a holy barrier around the underground of the town to keep cultists away from the remnants of the Hellgate.</p>\n<p> In his final moments with the priest his God made a request, for the priest had completed his purpose in life yet the mission he had been designated by God was eternal. His God told him that in exchange for his bloodline and heritage the priest would transcend and take on his true name in heaven as Seraphim, highest of the hierarchy of angels he would become his God's right hand. The priest accepted and everything fell silent. For the priest the world became nothingness, a body left kneeling under a ravaged town left for eternity. His soul however became immortal, awaiting its call once again to his homeland, to his bloodline and to his destiny...</p>\n<p><strong>Social Media</strong></p>\n<p>Twitter: https://twitter.com/buccanerds</p>\n<p>Instagram: https://www.instagram.com/buccanerds/</p>\n<p>DiscordGroup: https://discord.io/ActionPriest<br/></p>\n<p>Youtube: https://www.youtube.com/watch?v=PkZ8SB4TNCI&amp;t=4s</p>", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2019-05-24T07:42:47", "background_image": "https://media.rawg.io/media/screenshots/652/65244c4250f0615eace66bc8c765d60e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Buccanerds"], "genres": ["Action"], "publishers": [], "esrb_rating": null}