{"id": 322026, "slug": "ntivirus", "name": "@ntivirus", "name_original": "@ntivirus", "description": "<p>In a distant planet, pacific forms of life called &quot;The System&quot; are invaded by parasites named &quot;Virus&quot;. Constituted by beings too weak and slow to fight, The System created a powerful @v@t@r and sent a desesperate signal in the space to find valiant beings that could help.<br />\nThat signal is the application &quot;@ntivirus.exe&quot; which allows you with your computer to command the @v@t@r and fight the infection.</p>\n<p>EXPERIENCES: The controls and the camera are very free in order to create a feeling of sensorial freedom close to extreme sports. The player, like a space martial artist, fights the viruses with his bare hands.<br />\nImmersion is also an important matter. Unpredictible and systemic situations are common. Graphisms and sounds are random and in a constant evolution to make the player want to explore the universe and understand it. The narration is mostly environmental, the scenery recounts to the player the story of the System and the path the @ntivirus should take to achieve his objectives.<br />\nThe player alternate frequently between frenzy and observation.</p>\n<p>CONTROLS: Jumps are vertical and high, the player can turn the camera 360° in every axis while in the air. Aerial phases are frequent and assisted by the capacity to bounce or stick on any surface.<br />\n3 power up (1 at a time) can reinforce the player and change his perception of the levels: the Slowmotion, the Dash and the Gravity Inversion. A test level is available in the Option Menu to freely test the various controls and powers of the @v@t@r.</p>\n<p>LEVEL DESIGN: Levels are wide and will challenge your 3D perception, they have infinite ways to get solved and are full of easter eggs and secret bonuses.</p>\n<p>GAME MODES: 2 modes are currently available.<br />\n&quot;@dventure&quot; the story mode, starting with the tutorials.<br />\n&quot;@rena&quot; fight focused levels with statistics and goals to achieve.</p>\n<p>PROGRESSION: Many paths and endings are possible in the &quot;@dventure mode&quot;. In his travel, the player will gain &quot;@rgent&quot; that he can exchange in the Update Menu to buy new Options that are more or less estheticals and comparables to RPG skills. The Options will facilitate his exploration and personalise the universe.</p>", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2021-05-17T14:41:10", "background_image": "https://media.rawg.io/media/screenshots/292/292328dd06949825106b28743d3e5551.jpg", "website": "https://elvago.itch.io/antivirus", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ElVago"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": [], "esrb_rating": "Everyone"}