{"id": 322047, "slug": "le-graal-en-doom-like", "name": "Le Graal en Doom-like", "name_original": "Le Graal en Doom-like", "description": "<p><em>Le Graal en Doom-like</em> est le second volet du jeu vidéo <em>Yvain!</em>, imaginé par l'artiste plasticien Éric Giraudet de Boudemange et le créateur de jeux vidéo Tomavatars, produit par La Criée centre d'art contemporain. Il a été réalisé dans le cadre d'une résidence au collège de la Binquenais avec deux classes de 5e et de 3e en décembre 2018 et février 2019.\r\n   \r\n  \r\n</p>\n<p>Ce jeu d'aventure expérimental à la première personne est librement inspiré du jeu <em>Doom</em> et du roman inachevé <em>Perceval ou le Conte du Graal </em>écrit au XIIe siècle par Chrétien de Troyes. L'ouvrage raconte les aventures d'un jeune gallois naïf, ignorant jusqu'à son nom, quittant le confort de la demeure familiale pour accomplir son destin : partir en quête du Graal.    \r\n  </p>\n<p>Dans cette interprétation contemporaine, nous découvrons une salle de classe à partir de laquelle le joueur peut accéder à cinq portes. Chacune d'elle s'ouvre sur un chapitre où univers médiéval et contemporain s'entremêlent.    \r\n  </p>\n<p>Le joueur guide Perceval à travers différents décors imaginés par les élèves : des châteaux, un lac rouge, une forêt de barbe-à-papa, des labyrinthes… Une partie des éléments de décor et des personnages sont extraits d'enluminures médiévales, conservées à la BnF et numérisées sur le site Gallica. <br/></p>\n<p>La quête de Perceval se mêle aux histoires des collégiens situées au cœur de fêtes foraines, créant l'effet d'un joyeux cadavre-exquis, où Merlin l'Enchanteur croise Kylian Mbappé, Leonardo Di Caprio, etc.   </p>\n<p>plus d'informations : www.la-criee.org<br/>http://ericgiraudet.com/<br/>www.concretegames.xyz</p>\n<p>___________</p>\n<p> <em>The Grail in Doom-like</em> is the second part of the video game <em>Yvain!</em>, imagined by the artist Éric Giraudet de Boudemange and the video game creator Tomavatars, producted by La Criée center for contemporary art. It was made during an art residency at the middle school of La Binquenais with two classes of 7th and 9th grade in december 2018 and february 2019.\r\n   \r\n  </p>\n<p>This experimental adventure game at first person is freely inspired  by the video game Doom and the unachieved novel <em>Perceval or the Grail's Tale </em>by Chrétien de Troyes, written in the 12th century. The book tells the adventures of a naive young Welsh, ignoring his own name, leaving comfort of the family home to fulfil his destiny : go on a quest for the Grail.    \r\n  </p>\n<p>In this contemporary interpretation, we discover a classroom from where the player can access five doors. Each one opens on a chapter where medieval and contemporary universes intertwine.\r\n   \r\n  </p>\n<p>The player guides Perceval through different sets imagined by the students: castles, a red lake, a forest of cotton candy, mazes… Part of the setting elements and the characters are extracted from medieval illuminations, preserved at the BnF and digitalised on the website Gallica.\r\n  </p>\n<p>The quest of Perceval mingles with the secondary students' stories taking place in the middle of fairgrounds; creating the effect of a joyful Exquisite Corpse game, where Merlin the Enchanter meets Kylian Mbappé, Leonardo Di Caprio, etc.\r\n  </p>\n<p>more information : www.la-criee.org<br/>http://ericgiraudet.com/<br/>www.concretegames.xyz</p>", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2019-05-24T07:51:26", "background_image": "https://media.rawg.io/media/screenshots/540/54069d78f57524faabfd14e107d83395.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["La Criée centre d'art contemporain"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}