{"id": 322182, "slug": "messenger-royale-battle-royale-endless-runner", "name": "Messenger Royale - Battle Royale Endless Runner", "name_original": "Messenger Royale - Battle Royale Endless Runner", "description": "<p><strong><em>###NEW FEATURES###</em></strong><br/>• <strong>CHALLENGE MODE</strong> - Challenge mode is finally here! Battle highly trained artificial intelligence in an endless battle!</p>\n<p>• <strong>NEW BOSS</strong> - A new boss battle is available! Fight the Cypher Boss while dodging the blocks it drops on the track!</p>\n<p>• <strong>NEW CHARACTER</strong> - A new robot character is available in the store!</p>\n<p>###COMING SOON###</p>\n<p>• <strong>TOWERS</strong> - Towers of the Void will soon block your path as you travel through the lane! Use your gun to defeat them!</p>\n<p>• <strong>NEW TRACKS</strong> - Tracks will start to rotate and change direction making it harder to travel to each lane!</p>\n<p>• <strong>MEDIA PLAYER</strong> - Dash through the Hyperlane in style with a new music player!</p>\n<p>Underneath your screen sits an extraordinary network, vast and unexplored.</p>\n<p>A network containing endless archives that house some of the most wonderful treasures humanity can offer. A world where crafts are not made of cedar, but of magic. A world where shipwrecks and robberies were nothing but a tale.</p>\n<p>But, there is something dark lurking within the depths of the network. Creatures that surf the wave of the Hyperlane, feeding on any unfortunate enough to come within its path. <br/>Our survivors are hanging on by a strand. The builders who once drew the lane by hand, have been lost forever.</p>\n<p>Join A.N.N.O. and his squadron of Hyperlane Runners and join humanities defense in a  lane styled endless runner! <br/>Enter the Temple of Doom, a procedural Hyperlane that never ends! Dash to each lane, avoiding treacherous obstacles with the reflexes of a cat in an online rush to reach the top of the leaderboards! <br/>Collect unique pick-ups and abilities, and explore each lane in an endless runner to discover the truth behind the Void!</p>\n<p>Watch each lane unfold beneath as you and your runner dash through a gorgeous sci-fi endless runner!</p>\n<p>Dash through each lane, slide under obstacles like a ninja, transform into magnificent variations of your runner, unlock unique characters, and collect messages – all while you defend humanity from the terrors of the Void.</p>\n<p><strong><em>FEATURES:</em></strong></p>\n<p><strong>• TRANSFORM -</strong> Defy gravity with a transforming flying machine! Ride the waves of the Hyperlane as if they were roller coasters!</p>\n<p><strong>• UPGRADE - </strong>Upgrade your characters abilities in a sci-fi endless runner! <br/>• MAGNET - Magnetize your runner and draw nearby messages to you!</p>\n<p><strong>• LAUNCHER - </strong>Launch yourself into the skies to collect as many messages, coins, and ammo as possible!</p>\n<p><strong>• HEELIES 2.0 -</strong> Jump over obstacles with a pair of brand new super boots!</p>\n<p><strong>• INVULNERABILITY -</strong> Blast through obstacles with a supercharged invulnerability field!</p>\n<p><strong>• CHALLENGES - </strong>Endless runners are fun, but an endless runner with an objective is always better! Challenge mode will feature scalable challenges ranging from collecting pickups to surviving unique encounters!</p>\n<p><strong>• BOSSES - </strong>Some great adventures must come to an end, but this endless runner will always feature a series of terrifying bosses to duel as you travel each lane!</p>\n<p><strong>• SWORDS - </strong>Dash and attack as you travel through every lane and fight your way to the top of the Leaderboard!</p>\n<p><strong>• GUNS - </strong>Blast your way through obstacles as turrets and infected blocks clutter the lane and prevent you from progressing!</p>\n<p><strong>• THEMES - </strong>Change the colors of your roads and background to match your style!</p>\n<p><strong>• CUSTOMIZE YOUR CHARACTER - </strong>Change your color and upgrade your abilities to collect as many coins as possible!</p>\n<p><strong>• LEADERBOARDS - </strong>Challenge your friends in an online adventure while you dash through the Hyperlane!</p>\n<p><strong>• ACHIEVEMENTS - </strong>Collect all of the achievements by collecting pickups, competing in unique challenges, or competing in endless runner style gameplay!</p>\n<p>Check the trello for progress on updates!<br/>https://trello.com/b/Yk9c9zuS/hyperlane-runner</p>\n<p>See more of my games at https://www.fractuminnovations.com/the-oculus</p>\n<p>https://play.google.com/store/apps/dev?id=7634157798081145849&amp;hl=en_US</p>\n<p>and <br/>https://entropikz.itch.io!</p>", "metacritic": null, "released": "2019-05-20", "tba": false, "updated": "2019-05-24T08:39:35", "background_image": "https://media.rawg.io/media/screenshots/6ad/6ade3f03f1a86fce3e0055be598dc939.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["entropikz"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}