{"id": 322200, "slug": "morphall", "name": "MorphAll", "name_original": "MorphAll", "description": "<p>OPTIMISE POUR GOOGLE CHROME, fonctionne aussi sous FireFox.</p>\n<p>/!\\ FAIRE F5 SI LE JEU NE SE LANCE PAS DU PREMIER COUP (firefox) /!\\</p>\n<p>Polymorphe perdu dans une station spatiale où pullulent des entités plus hostiles les unes que les autres, vous n'avez comme chance de survie que de vous MÉTAMORPHOSER en vos ennemis pour vous nourrir de leurs vitalité et utiliser leurs habilités. Ainsi une puissance de feu incomparable s'offre à vous pour tenter de terrasser la reine des entités monstrueuses Mother of Crystal Spike et atteindre votre prochaine planète hôte !</p>\n<p>Contrôles :<br/>-Fléches directionnelles : déplacements<br/>-Espace : tirer<br/>-Alt-Gr : retour à la forme primaire</p>\n<p>Vous commencez par deplacer le polymorphe sous sa forme primaire dont l'energie (barre verte) diminue avec le temps.<br/>Pour survivre vous devez vous MÉTAMORPHOSER en un ennemi choisi au depourvu ou par strategie.</p>\n<p>Lorsque vous êtes métamorphosé, la vie (barre rouge) diminue.<br/>Les dégats la font baisser encore plus vite.<br/>Lorsqu'elle est vide vous reprenez votre forme primaire (boule verte).</p>\n<p>La barre verte symbolise l'energie sous forme primaire.<br/>Lorsqu’elle tombe a Zéro c'est le GAME OVER<br/>Tirer sur vos enemis pour augmenter votre barre d'energie (barre verte) afin de vous permettre de survivre plus longtemps sous la forme primaire.</p>\n<p>*<strong>La forme primaire</strong> qui ne peut pas tirer est insensible aux degats mais consomme de la barre d'energie (barre verte).<br/>Si cette barre tombe à zero c'est le Game Over.</p>\n<p>*<strong>La forme Métamorphosée</strong> (vaisseau) consomme de la barre de vie (barre rouge) et est sensible aux dégâts mais peut tirer.<br/>Si la vie (barre rouge) tombe à zero vous reprenez votre forme primaire. </p>\n<p>GRAPHISTE - FEEVER &amp; ICE CREAM<br/>GAME DESIGNER CAPTAINCODEX/FEEVER/UNREAL99<br/>DEV : UNREAL99</p>\n<p>MUSIQUE NON RÉALISÉE DURANT LA JAM:</p>\n<p>source VISAGER:<br/>https://visager.bandcamp.com/album/songs-from-an-unmade-world-2</p>", "metacritic": null, "released": "2019-05-20", "tba": false, "updated": "2019-05-24T08:42:59", "background_image": "https://media.rawg.io/media/screenshots/f94/f9421312e8d76d38d0085c13fc1c90e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CaptainCodex"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}