{"id": 322395, "slug": "gooberries", "name": "Gooberries", "name_original": "Gooberries", "description": "Welcome to your  farm of the future. Made possible by the Gooberries foundation. As a franchise owner your job, with the help of your incredibly efficient team of robot helpers, is to produce a steady supply of the foundations well sought after produce brand that can be sold to hungry customers back on Earth. The distant plot planet you have been assigned is a self contained ecosystem with everything you need to get started on your farming journey including:<br/><br/><ul><li>A variety of seasons that will meet the needs of all the different types of plants and critters you will raise.<br/></li><li>Self contained soil patches and plenty of open space for roaming critters.<br/></li><li>The plot is fully plumbed with purified water and a handy fill up station.<br/></li><li>A handy robot station that will allow you to build your bots to suit your specific needs.</li></ul>Plants For All SeasonsGrowing plants is what your experience is all about. That is how you will produce berries that you can sell back to the foundation for coins that will help you invest back into to your plot and in turn produce even more desirable inventory. Try your hand at one of the few starter berries available in the market and unlock more varieties as you earn experience.Self Sufficient Critter RaisingCritters are an important part of the Gooberries growing process. They will produce items that are helpful in growing your crops but in turn they need to bed a specific diet of berries. Make sure you grow enough plants to meet the needs of the critters you choose to allow to roam your plot planet and store enough produce to feed your critters during the winter season when berries can't be grown.Customizable Robot HelpersThe foundations goal is to produce an efficient and relaxing experience for all new franchise owners. That is why you will have access to all the parts necessary to assemble your team of bots. These helper bots are the way we make it possible for you to manage your plot without the need of pesky human energy.Build Your InfrastructureYour starter plot planet with come with the basics but you'll be required to acquire and build other helpful items such as storage silos, greenhouses, and many other things to make your experience more comfortable. <br/><br/><br/><br/>We are glad that you have decided to become a part of the team! Now get to work and don't forget to have a little fun.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:45:02", "background_image": "https://media.rawg.io/media/screenshots/d87/d879623f4a2a2fa94ef69b1f2d743c76.jpg", "website": "https://gooberries.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mash Patch"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Mash Patch"], "esrb_rating": null}