{"id": 322378, "slug": "creation-and-conquestthe-future-war", "name": "Creation and Conquest：The Future War", "name_original": "Creation and Conquest：The Future War", "description": "     In the near future, human beings have developed medium and low energy heavy ions, which can effectively prevent nuclear reactions within the scope of nuclear weapons. It was supposed to be the beginning of peace, but on the contrary, conventional warfare for resources would start again without the restriction of nuclear weapons. Players play the role of commander in the game, build their own bases, develop and create different arms and weapons, and ultimately defeat their opponents.<br/><br/><br/><br/>     Players need to design their own DIY Infantrys, Vehicles, and even Aircraft. In the game through DIY  It can create hundreds and thousands type of combat units, according to the opponent's tactics, research and development of restraint of the opponent's weapons is the key to victory.<br/><br/><br/><br/><br/>Unlike ordinary RTS, commanders here only need to tell soldiers what area they need to take, or what area they need to garrison, and the rest can be handed over to soldiers. Let the player play the real commander instead of the captain. But for vehicles, commanders need to operate them in detail. <br/><br/><br/><br/>     And in the game, players can turn on assistant functions to assist players to build, produce, upgrade, assign and other functions, so that players can put the greatest effort on the overall control of the battle situation.", "metacritic": null, "released": "2019-06-07", "tba": false, "updated": "2019-08-28T21:45:04", "background_image": "https://media.rawg.io/media/screenshots/319/3195e42c1cf7f9643f513d1db31c2fb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noelone"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Noelone"], "esrb_rating": null}