{"id": 322468, "slug": "bouncy-climbers", "name": "Bouncy Climbers", "name_original": "Bouncy Climbers", "description": "Bouncy Climbers is a surprisingly cute and fun-filled game about climbing mountains and collecting treasures! <br/><br/>Life is but a steep climb. Climb for survival, climb for fun, climb for treasure... and when you slip, be ready to bounce back! Perils, hazards and hazardous perils will stand in the path of any climber who dares bounce alone! Maybe you've bounced on your friends before, then it is time to bounce into action and get them back!<br/><br/>Bounce an eccentring cast of climbing weirdos way up the Brickblock Peaks in a mad dash to find treasure, rescue your friends and uncover the secrets of the mountain in a springy arcade adventure that will have you jumping for joy (and treasure!). Welcome to Bouncy Climbers.<br/><br/>Bounce by me! The first lesson in mountain climbing is to never do it alone! Friendship will get you higher than any fancy gear. Save other bouncy climbers stuck in the heights and have them join your endeavor!<br/><br/>Alpine panic! Climbing isn't easy, even when you're ready to bounce away your troubles. Monsters, spikes and real bad vibes might bounce your cheques, but you can't let them get you down. Bounce it off and get back to it!<br/><br/>The heights of curiosity! You're not just climbing for the sake of it. Tons of treasures are waiting to be found! And if you're not into riches and wealth, perhaps you're more interested in discovering the truth behind life's mysteries. These mountains are filled with secrets only the bounciest climbers will ever uncover!", "metacritic": null, "released": "2019-06-20", "tba": false, "updated": "2019-10-22T14:07:45", "background_image": "https://media.rawg.io/media/screenshots/47e/47ed8ca9a8ee74d43ca4c0acd2590351.jpg", "website": "https://hyperbeard.com/game/flipflop/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HyperBeard Games"], "genres": ["Casual", "Family"], "publishers": ["HyperBeard Games"], "esrb_rating": "Everyone 10+"}