{"id": 322413, "slug": "them-bombs-2", "name": "Them Bombs", "name_original": "Them Bombs", "description": "A text message from Dr TiNT leads you to a ticking bomb. Tic-toc! Tic-toc! Every second counts. Which wire to cut – the blue or the red one? Tic-toc! Tic-toc! How to set the control knobs? Tic-toc! Tic-toc! Only two minutes left… Your flashlight battery runs out. The adrenaline kicks in. Will you keep a cool head and manage to defuse the bomb?<br/>---------------------------------------------<br/><br/>Them Bombs! is a cooperative game for 2-4 players inspired by Keep Talking and Nobody Explodes.<br/><br/><br/><br/>One of the players takes on the role of the Unexpected Hero, who finds a bomb and tries to defuse it. The hero is the only player who uses the PC. The other players become the Expert Team and they have access to the bomb defusal manual. They cannot see what the Hero sees on the screen, and the hero cannot see the content of the manual.<br/>Players can only use verbal communication, just as if the Expert Team and the Hero were talking through a radio.FEATURES<ul><li>Work together with your Expert Team and see how many people you can save<br/></li><li>Describe what you see using just words so that others understand<br/></li><li>Let your Expert Team talk you through the bomb defusal<br/></li><li>Put your communication skills to the test</li></ul>WARNING!!!Time pressure and adrenaline rush may lead to shouting, swearing, and misunderstandings, which can cause temporary resentment between friends or silent treatment from a spouse…", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:18", "background_image": "https://media.rawg.io/media/screenshots/675/675a292f2d1f03a11229b4ed40082b3e.jpg", "website": "https://thembombs.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Yellow Dot"], "genres": ["Casual", "Indie"], "publishers": ["Yellow Dot"], "esrb_rating": "Everyone 10+"}