{"id": 322545, "slug": "transport-general", "name": "Transport General", "name_original": "Transport General", "description": "Establish your own transport company! Construct transportation routes, play by yourself, or force your rivals out of the market, and get rich as swiftly as possible! <br/><br/>The objective of the game is to establish a multitude of road networks, by the use of which all raw materials, products, people may be transported to the proper location in the appropriate time and in the most efficient way possible. Use trains, buses, airplanes, helicopters, or ships, to be able to satisfy the expected demand! Modernize your vehicles in a timely fashion, to be able to keep up with technological advancement, and pay attention to changes of demand! <br/><br/>As the result of the free scope of action, the opportunity for free decisions and continuously arriving innovations the game becomes impossible to get bored of since it provides players with newer and yet newer exciting missions, so they may further increase their capabilities, which they may even compare with other players. <br/><br/>The easy, fluid, handling method, the user’s guide built in the game, the excellent graphical feats, the well thought-through economic mechanisms and the constantly changing challenges make this splendid economic game truly pleasurable, for beginner and advanced strategists alike. <br/><br/>So, don’t delay, go for the foundation of your company, and be the most successful transportation entrepreneur! <br/><br/><br/>The main characteristics of the game: <br/><br/>- Continuously arriving free updates<br/>- Built-in interactive instruction mode and an encyclopaedia, which assists throughout the course of the game <br/>- More than 50 different vehicles <br/>- 3D internal view <br/>- Random global maps, as the result of which there are no two identical games <br/>- Continuously arriving missions and new challenges <br/>- The changes, which have taken place in transportation can be tracked from the 1950s till today", "metacritic": null, "released": "2013-08-20", "tba": false, "updated": "2019-10-22T14:16:43", "background_image": "https://media.rawg.io/media/screenshots/fcf/fcf5dbd4b20809fd9168f4fa3438c390.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Navigation-Info Kft."], "genres": ["Strategy", "Simulation"], "publishers": ["Navigation-Info Kft."], "esrb_rating": null}