{"id": 322566, "slug": "supermarket-register-cashier", "name": "Supermarket Register Cashier", "name_original": "Supermarket Register Cashier", "description": "Marco is the cash register manager in the city supermarket where people come for all sorts of grocery shopping and his job is to make sure customers can easily pay the due cash for their shopping. He must serve customers as quickly as possible which requires mental math and high level time management. He strives to be the top supermarket cashier in all cash register games.<br/><br/>OXO Games Studio brings a fun and challenging experience with this virtual time management game in the casual games, cash register games and store games category. Manage your customers and complete their orders in time but if you run out of time use the magic candy to retry or you can use the helper robot to autocomplete the order. Play now and become the supermarket cashier in this role play game.<br/> <br/>FEATURES:<br/>- A fun and challenging time management game<br/>- Complete each order within the time limit<br/>- Use magic candy to retry if you fail to fulfill a customer’s order<br/>- Use autocomplete robot to fulfil an order quickly<br/>- Complete orders in time to win exciting rewards<br/>- Amazing HD Graphics<br/>- Easy to play<br/>- Free to play forever<br/>- No Wi-Fi required<br/>and much more…<br/> <br/>JOIN US ON SOCIAL NETWORKS:<br/>OXO Apps Website: http://oxoapps.com<br/>Join our Facebook Page: https://www.facebook.com/oxoapps<br/> <br/>WE LOVE TO HEAR:<br/>*If you like this Virtual Supermarket Cashier: Cash Register Manager game, then Rate and Review and if something went wicked or you have any recommendation then please give your valued feedback at hello@oxoapps.com.<br/><br/>IMPORTANT MESSAGE FOR CUSTOMERS:<br/>* This is free game especially for Cash Register games, Casual games, Store Manager games and Management games lovers but it contains third party ads.", "metacritic": null, "released": "2018-02-22", "tba": false, "updated": "2019-07-12T03:01:57", "background_image": "https://media.rawg.io/media/screenshots/055/05563e27cb16da71091456f3c73da46f_ZsZVcVY.jpg", "website": "https://www.facebook.com/oxoapps/timeline", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Pitafi"], "genres": ["RPG", "Simulation"], "publishers": ["Waqas Pitafi"], "esrb_rating": null}