{"id": 322555, "slug": "flower-garden-bubble-dots-match-threes-across-the-", "name": "Flower Garden Bubble Dots: Match Threes Across The Board", "name_original": "Flower Garden Bubble Dots: Match Threes Across The Board", "description": "Are you addicted to fun, original puzzle games? Looking for a game that's good for everyone in the family? <br/><br/>If you can't get enough of these brain busters then you'll love this game, the highly fun and engaging game that can keep you occupied for hours. Be careful, though: You might never want to turn off this popular iPhone app!<br/><br/>An exciting Tap n Match puzzle game, here you'll switch and drop shapes to form vertical, horizontal, or diagonal lines of 3 or more of the same set of flowers. You must do it before time runs out, though, and the clock is ticking! You want to see as many sets vaporize as you can!<br/><br/>The more sets you make, the greater rewards you get. If you gather enough points, you can unlock game-changing power-ups. Special bonus items will let you multiply your high scores to collect more points. <br/><br/>Players can chose between fun, catchy background music or effects music. The game also has touch-screen optimized control and is suitable for all ages so even the youngest gamer can get in on the fun! With three modes (easy, medium, and hard) there's a setting for everyone to play and enjoy the excitement. <br/><br/>Features: <br/>* Great for all ages<br/>* Amazing graphics<br/>* Universal app supports iPhone / iPad / iPod Touch<br/>* Addictive Gaming <br/><br/>Download right now!", "metacritic": null, "released": "2014-08-03", "tba": false, "updated": "2019-07-05T02:55:39", "background_image": "https://media.rawg.io/media/screenshots/485/4857fc67956e99279eab346b02fcef2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netsummit Marketing"], "genres": ["Strategy", "Puzzle"], "publishers": ["Netsummit Marketing"], "esrb_rating": null}