{"id": 322618, "slug": "tap-tap-train-racing-club", "name": "Tap Tap Train Racing Club", "name_original": "Tap Tap Train Racing Club", "description": "Get, Set, Cho Cho, Go! Don’t stop tapping before reaching the finish line on the train tracks and keep your racer locomotive ahead of your rivals to become the top engine master in the racing town. Keep an eye on your opponent and if he gets too close press the boost button to claim victory and move on to the next race track. Become the racing champion of the train racing competition held in old railway valley also known as abandoned railroads.<br/><br/>OXO Games Studio brings you a tap challenge with this tap race game in the racing games, idle games and addictive games category. Be an engine master of the racing train and win the championship against all your train rivals.<br/> <br/>FEATURES:<br/>- Blow the train whistle to indicate race start<br/>- Keep your tap tap game at the top level<br/>- Boost ahead of your train rivals<br/>- Win the championship of the old railway valley race tracks<br/>- Amazing HD Graphics<br/>- Free to play forever<br/>- Racing music and sound effects<br/>- No In-App Purchases<br/>- No Wi-Fi required<br/>and much more…<br/> <br/>JOIN US ON SOCIAL NETWORKS:<br/>- OXO 3D Studio Website: http://oxoapps.com<br/>- Join our Facebook Page: https://www.facebook.com/oxo3d<br/>- OXO 3D Studio on Twitter: @Oxo3d<br/><br/>WE LOVE TO HEAR:<br/>* If you like this Tap Tap Train Racing Club game, then Rate and Review and if something went wicked or you have any recommendation then please give your valued feedback at mailto:3d@oxoapps.com.<br/><br/>IMPORTANT MESSAGE FOR CUSTOMERS:<br/>* This is free game especially for Sports games, Racing games, Idle games, Train games and Simulation games lovers but it contains third party ads.", "metacritic": null, "released": "2018-02-17", "tba": false, "updated": "2019-07-12T03:03:49", "background_image": "https://media.rawg.io/media/screenshots/f5c/f5cdcffa517fd76be4da47eb00593bde_sLLmpEh.jpg", "website": "https://www.facebook.com/oxoapps/timeline", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Pitafi"], "genres": ["Simulation", "Racing"], "publishers": ["Waqas Pitafi"], "esrb_rating": null}