{"id": 322623, "slug": "scurvy-seadogs", "name": "Scurvy Seadogs", "name_original": "Scurvy Seadogs", "description": "Set in the Caribbean in the late 1600s, Scurvy Seadogs casts you as Captain of a galleon full of nomadic pirates, roaming the high seas in search of action, adventure, and unimaginable bounties of treasure! The gameplay is loosely based on the classic board game Checkers, re-imagined as humorous battles between nomadic clans of bloodthirsty pirates. The aim is to simply eradicate all of the enemy pirates by strategically moving your pirates around the cargo net.<br/><br/><br/>GAMEPLAY<br/>The aim of the game is to eradicate all of the enemy pirates. Each player takes turns moving their pirates around the net. During each turn, you can either deploy pirates from portholes OR move your pirates by choosing a direction on the compass (all deployed pirates will move one square in the direction the compass is pointing).<br/><br/>Moving a pirate into a square occupied by an enemy pirate will remove the enemy pirate from play. Moving a pirate into an enemy porthole will remove all remaining enemy pirates in that porthole from play (the successful pirate will be reincarnated in the porthole from which he originated).<br/><br/>In a game of wits, cunning, and tactics, it may sometimes be advantageous for players not to move or deploy any pirates. At the start of each turn you can therefore skip your (up to a maximum of three times per stage) by clicking on the relevant icon.<br/><br/>For more information, please refer to the How to Play screens within the app.<br/><br/><br/>PLAYING MODES<br/>Scurvy Seadogs includes two different Playing Modes:<br/><br/>1. Quick Play Mode allows players to quickly jump into a 1-on-1 battle against a computer-controlled pirate (ideal for a quick plunder!).<br/><br/>2. Multiplayer Mode allows players to indulge in 1-on-1 games locally on the same device, just like a traditional board game.<br/><br/><br/>FEATURES<br/>* A strategic swashbuckling seaborne saga for players of all ages!<br/>* Instantly accessible pick-up-and-play gameplay!<br/>* Intuitive touch-screen controls!<br/>* Multiple pirate captains to choose from!<br/>* Multiple Playing Modes, including Quick Play and Multi Player!<br/>* Adjustable difficulty settings to suit players of any skill!<br/>* Beautifully realized 3D environments and characters!", "metacritic": null, "released": "2016-08-03", "tba": false, "updated": "2019-10-22T14:21:26", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a00c8879c81a732a0429d8105bf2be0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PENDYLUM"], "genres": ["Strategy", "Casual"], "publishers": ["PENDYLUM"], "esrb_rating": "Mature"}