{"id": 322791, "slug": "flip-out-ianjsikes", "name": "FLIP OUT (ianjsikes)", "name_original": "FLIP OUT (ianjsikes)", "description": "<p>A clone of <strong>Voltorb Flip</strong>, a minigame from Pokémon Gen IV.</p>\n<p>Flip tiles to multiply your score, but don't hit a bomb and FLIP OUT.</p>\r\nControls\r\n<p>Use the arrow keys to move the cursor. Press \"Z\" to flip or flag the selected tile. Press \"X\" to cycle through actions. The indicator on the right shows what action you have selected (\"Flip\" or \"Flag\").</p>\n<p>You can also use your mouse to play. Left-click on a tile to flip it. Left-click on the flag buttons on the right side of the screen to flag the selected tile.<br/></p>\r\nGuide\r\n<p>Each level, you will see a 5x5 grid of tiles. Each row and column has two numbers associated with it. The yellow number is the <em>sum</em> of all the <strong>points</strong> in that row/column. The red number is the number of <strong>bombs</strong> in that row/column.</p>\n<p><strong>Example</strong>:</p>\n\n<p>This row has 3 bombs in it, and the rest of the tiles add up to 4 points. It could be two \"2\"s, or a \"3\" and a \"1\".</p>\n<p>Cross-reference the row and column numbers to flip over the tiles you think do not have bombs. Each non-bomb tile multiplies your current score.  When you have flipped over all the \"2\"s and \"3\"s, the level ends and you advance to the next level. Can you make it all the way to level 8?</p>\r\nFlagging\r\n<p>Like Minesweeper, you can flag tiles to keep track of what <em>might</em> be under them.</p>\n<p><strong>Example:</strong></p>\n\n<p>Here, I've marked every tile in this row with a bomb and a \"1\". Because the points and bombs for this row add up to 5, there can be no \"2\"s or \"3\"s. As you go through each row and column, you will be able to narrow down the options until you can decide which tiles to flip.</p>\r\nCredits\r\n<ul><li>Game Freak and Nintendo for the game concept.</li><li>Discord user Junko#4218 for the amazing transcription of the original Voltorb Flip music to PICO-8</li><li>@sighack for the bomb sprite from pico8.io</li><li>@lexaloffle for creating PICO-8</li></ul>", "metacritic": null, "released": "2019-05-26", "tba": false, "updated": "2019-08-28T23:16:15", "background_image": "https://media.rawg.io/media/screenshots/64b/64b358332d60786d4f6aa6064a9b46a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["ianjsikes"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}