{"id": 322807, "slug": "gauss-zerocooldev", "name": "Gauss (ZeroCoolDev)", "name_original": "Gauss (ZeroCoolDev)", "description": "<p><em>Humanity took to space in a desperate attempt to find a new home,  only to find that aliens have long before called the black abyss their  domain and don't take kindly to outsiders.</em><br/><br/><em>Years later humans ride the line of extinction moving about in the  galaxy as intergalactic nomads...unable to settle for too long before  the Hunters, as humans have deemed them, discover their location...  </em><br/><br/><em>The only reason humanity isn't completely annihilated is due to their  protectors, a courageous and fearsome group of pilots known as the  Gaussian Fleet.</em><br/><br/><em>These brave pilots fight to delay humanity's extinction as scientists search desperately to find a way to transport the remaining human race far enough away that they can begin rebuilding civilization in peace... But with each passing day the Hunters grow more aggressive and the light at the end of the tunnel grows dimmer...</em><br/><br/><em>We must find the answer...</em><br/></p>\n\n<p>Humanity wants <strong>you </strong>to join the Royal Gaussian Fleet!</p>\n<ul><li>Pilot of a Gauss - one of the most powerful space crafts in existence </li><li>Become a protector of humanity from the bloodthirsty Hunters of the insidious abyss who would otherwise see humans wiped off the face of this universe.</li><li>Unleash hell with your magnetically powered war machine armed with an electro magnetic laser, deflector shield, and the powerful Magnetic Acceleration Cannon!</li><li>Harness the power of Upgrades, Powerups, and Items as they appear in the world to add extra fire power, support your health, or turn your ship into a giant magnetic saw!</li><li>Choose your favourite Gauss by selecting one of 12 unique ship skins!</li></ul>\r\nGauss consists of 3 modes of play\r\n<ul><li><strong>The Campaign</strong><ul><li>Intended to be a serious, story driven action adventure as you assume the role of one of the pilots in the Gaussian Fleet as humanity teeters on the edge of complete annihilation </li><li>The current version of Gauss only has 1 vertical slice of a mission from the campaign. The intention is to finish the campaign in the future. </li></ul></li></ul>\n\n<ul><li><strong>Infinite Invasion</strong><ul><li>Done with the stress of saving humanity? Infinite Invasion is an endless space shooter in which the player gains XP and levels up by killing the invading aliens.</li><li>The more you level up, the stronger you become - increasing stats like damage output, health, shield capacity, and number of laster??<ul><li>But beware, as the player gets stronger so does the enemies!</li><li>As the advances, the enemies get stronger, more aware, more abundant, and more deadly!</li></ul></li></ul><ul><li>Local Leaderboards track each game so you can compete against friends - or yourself - to be the very best at the top of the charts!</li></ul></li></ul>\n\n\n<ul><li><strong>Cosmos</strong><ul><li>Cosmos takes the structure of Infinite Invasion and adds an exciting\r\ntwist by adding Anomolies who will mutate the game as time \r\nprogresses like altering controls, speed, boundaries, and more whether you like it or not!</li><li>Damage taken is halved, but the percentage of insanity is greatly increased.</li><li> Local leaderboards are independent of Infinite Invasion so try and be the \r\nvery best at both!</li></ul></li></ul>\n\n\n<p>Enlist in the <strong>Royal Gaussian Fleet</strong> today!</p>", "metacritic": null, "released": "2019-05-25", "tba": false, "updated": "2019-05-27T04:35:55", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZeroCoolDev"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}