{"id": 322962, "slug": "im-just-popping-down-the-dungeon-does-anybody-want", "name": "I'm Just Popping Down The Dungeon, Does Anybody Want Anything?", "name_original": "I'm Just Popping Down The Dungeon, Does Anybody Want Anything?", "description": "<p><strong>This is in Beta - let me know if you hit problems<br/></strong></p>\r\nPlatforms\r\n<p>It's designed to run on browsers on PC's. It will run on mobiles/tablets but it might be slow, hard to read, and just less good, and for some reason the sound doesn't work yet. If you turn on Mobile mode in the setting menu it adds a couple of mobile affordances.</p>\n<p>Note that while there is an auto-scaling option in the settings menu, if you're on a PC scaling the browser page usually looks nicer (ctrl + mousewheel).<br/></p>\r\nInstructions\r\n<p>On the main screen:<br/></p>\n<ul><li>Choose a treasure to try and retrieve; the deeper the deadlier, but the more valuable.</li><li>Select up to 3 'heroes' to delve into the dungeon.</li></ul>\n<p>In dungeon:</p>\n<ul><li>For each character in turn a selection of moves will be shown - choose with the mouse/touch.</li><li>Find the treasure - it's usually deep in the dungeon. There may be clues.</li><li>Then get out, and get paid.</li></ul>\r\nSaving\r\n<p>The game automatically saves to the browser storage - so won't be available if you use a different browser or clear storage.</p>\n<p>At the moment there are no external saves - although you can find plugins to capture/restore local browser storage.</p>\r\nFAQ\r\n<ul><li><strong>Hey, the game said a rude word?</strong> Sorry, most of the names are randomly generated and might sometimes swear.</li><li><strong>Why does the Dwarven Goddess have a beard? </strong>You answered your own question there.</li><li><strong>Hey, I found a dungeon where you can't reach the treasure.</strong> There are several methods of bypassing walls, but they are not always practical, so I have tried to avoid generating that sort of dungeon. Press 'D' while you are in the dungeon and write down the number and let me know.</li></ul>", "metacritic": null, "released": "2019-05-24", "tba": false, "updated": "2019-08-28T23:16:14", "background_image": "https://media.rawg.io/media/screenshots/642/6428054c2a8dacd2053d768cb4d5b8b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 2, "platforms": ["Web", "PC"], "developers": ["cephalopodunk"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}