{"id": 323089, "slug": "night-of-the-scarecrows", "name": "Night of the Scarecrows", "name_original": "Night of the Scarecrows", "description": "Classic first person arena shooter without player classes, tutorials, cases and social networks. Welcome back to 1999: no regenerating health, no screen hints, no radars, no assisted navigation. All you need is to escape the scarecrows, shoot them and avoid the impact of your own rockets.<br/><br/>Features:<br/><br/><ul><li><strong>\"Quick Death\"</strong> game mode: first person shooter chess. Ammo is limited, so you have to avoid enemies, waiting for a chance to blast at least two of them with single shot.<br/></li><li><strong>\"Barn Massacre\"</strong> game mode: ammo is unlimited and  you are locked in a small barn. Enjoy the music of falling enemies and the rain of their guts.<br/></li><li><strong>\"Silo Tower Defence\"</strong> game mode: yes, that's tower defence. With sniper rifles. Given to you by Mother Mary. After diligent prayers.<br/></li><li>Challenging enemies: scarecrows moves erratically, runs fast and attacks with no sound.<br/></li><li>Atmospheric retro setting of desolated East-European countryside.<br/></li><li>Scarecrows decomposition system -- shooting limbs off rarely stops them.<br/></li><li>Global leader tables.<br/></li><li>Absolute stylistic integrity --  99% of all game assets created by single person, map artist Zihaben.<br/></li><li>Latest stable release of Unity Engine ensures that game will run with no problem.<br/></li><li>Build heavily optimised using texure atlases so framecount won't suffer on older computers.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:59", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a77b04dd6de970596be7764c4af338c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StarCo Interactive"], "genres": ["Action", "Indie"], "publishers": ["StarCo Interactive"], "esrb_rating": null}