{"id": 323074, "slug": "orangeblood", "name": "Orangeblood", "name_original": "Orangeblood", "description": "199X, New KozaIt's the end of the 20th century, on a historic timeline different from that which we know.<br/>A manmade island off the coast of Okinawa is humming with a dirty, exotic vibe - and it's awesome!<br/>Rust and faded concrete glisten in the morning sun and the late-night neon, showing off the various faces of the island.<br/>Amazing SoundtrackLet yourself go to the subtropical sun, the sound of the waves, and the scent of dank weed, and let some real deep cuts and unknown classics of 1990s hiphop take you away.<br/>It doesn't matter whether you're chilling on a couch on a rooftop, having a drink at the bar, or capping fools in a firefight in some sketchy alleyway - these dope-ass tracks are gonna get you moving!<br/>Four \"Kawaii\" SoldiersHey you! Do you like hardcore adventures where you take on the role of an even harder-core badass tasked with beating the crap out of a bunch of demons?<br/>Well, so do I, but sometimes it's fun to try out something a little different, you know?<br/>These four cute Asian girls coukdh't care less about little photo stickers... They'd rather play with some 7.62x39mm rifles and filthy, filthy cash!<br/>Simple-yet-deep Turn-based GunfightingUse simple controls to take down evil gang members and killer robots!<br/>In New Koza, you can purchase randomly-generated and extremely powerful guns, 24/7.<br/>Load up a shotgun so powerful you'd burn yourself to toast if the gas leaked and some brand-new fireproof sneakers, find a group of psychotic yakuza thugs, and personally deliver a handwritten invitation to BEATDOWN TOWN!<br/>There's a Dog, Too! Ruff!", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-02T02:32:22", "background_image": "https://media.rawg.io/media/screenshots/25f/25f8e4df74860d07eabf9c308a74b531.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 18, "toplay": 5}, "playtime": 1, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "PC"], "developers": ["Grayfax Software"], "genres": ["RPG", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}