{"id": 323046, "slug": "emergency-tycoon", "name": "Rescue HQ - The Tycoon", "name_original": "Rescue HQ - The Tycoon", "description": "<p>Build up your headquarters from scratch and design your own masterpiece. In Rescue HQ you build, organize and manage a joint station for the three emergency departments fire brigade, police and ambulance. With limited budget you will be facing tough decisions and extensive emergencies that will need your immediate attention. During all of that you will further develop your HQ, hire new crew members and provide them with all the vehicles and equipment they need. Can you keep cool in heated up situations and will you do whatever it takes to keep your city safe? </p>\n<p>You are the police – Send appropriate forces with specific vehicles (from patrol car to SWAT unit) to dangerous emergency missions to keep your city safe. Provide them with the right gear from snipers to tracker dogs, bomb defusal kits and much more…</p>\n<p>Bring back prisoners and evidence from the crime scenes, interrogate them and process the files to earn money. You will need the funds to set up for big events like the trial of a mafia boss or preparations for the football championship ending up in major riots in your city.</p>\n<p>You are the fire brigade – Get ready for the rush of incoming emergencies and make sure your team has the right vehicles and resources to handle them. Train your firefighters to develop unique skills allowing them to become experts for specific mission types. Assign them to different shifts based on their skills and supply them with special gear from air tanks to hazmat suits for chemical emergencies. </p>\n<p>You are the ambulance – Look after your patients in the medical station of your HQ and expand it with the latest technologies from radiology stations to 3D printers. It’s your responsibility to keep all your patients safe and provide your medic team with the needed items from crash cart to contamination suits and medical kits.</p>\n<p>As the manager of your HQ it’s your job to always keep track of everything. In times of resource and time scarcity, good planning and well-considered compromises are demanded. </p>\n<p>Show that you got what it takes to successfully complete multidisciplinary emergencies involving all three departments while keeping your crew happy and healthy. Make use of more than 20 vehicles including helicopters, tons of different equipment, skills and items to set up your rescue masterpiece. </p>\n<p>Can you keep cool and stay on top of the situation, despite three departments, numerous missions, and scarce resources demanding your attention? Prove your skills, your city counts on you!</p>", "metacritic": null, "released": "2019-05-27", "tba": false, "updated": "2021-10-18T03:08:53", "background_image": "https://media.rawg.io/media/screenshots/ada/adab05d6a9221d223b15d12ca3b8ea09.jpg", "website": "https://rescue-hq.aerosoft.com/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 33, "toplay": 3, "dropped": 3}, "playtime": 3, "achievements_count": 21, "ratings_count": 5, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "Xbox One"], "developers": ["stillalive studios"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Aerosoft"], "esrb_rating": null}