{"id": 3230, "slug": "aeternoblade", "name": "AeternoBlade", "name_original": "AeternoBlade", "description": "Long ago, when the world was ruled by darkness. Alwesia region, a cruel continent where humans must fight and struggle in order to survive,<br/>stood Beladim, Lord of the Mist, Commander of the Army of Darkness. It has been said that Beladim cannot be killed by any means. Those who oppose and challenge this immortal all become a feast for him and his heartless army. He has razed and destroyed everything he set foot upon.<br/><br/>Freyja, the girl who had her village, Ridgerode destroyed, travels with an unknown weapon called the 'AeternoBlade'. Freyja looks to take revenge on Beladim. Her vengeance is aided by Vernia, a mysterious witch. Vernia taught Freya about the potential of the AeternoBlade. Freyja obtained the true power of the AeternoBlade with the advice of \"Bernard\", the man who had been imprisoned in the Everlasting Void. With that, she can travel back in time before Beladim destroyed her village to save it and have her vengeance once and for all. <br/><br/>What is AeternoBlade? How can Freya take revenge on Beladim? Solve tons of mysteries in her adventure together!<br/><br/>Use time-manipulation ability to solve puzzles and to survive in battle. Featuring with world exploration and RPG elements.<br/><br/>AeternoBlade of Past's ability<br/><br/>Time Travel: Everything except Freyja will be played back. Some green flashing objects called timeless objects, however, cannot be played back by this ability.<br/><br/>Time Warp: Place the marker at Freyja's current position, After that, when pressing the button again Freya will be warped back to the marker to solve the puzzles and avoid the attack in battle.<br/><br/>Time Reverse: Everything played back if you die.<br/><br/>Status upgrade<br/><br/>This is the most basic upgrade for Freyja. In exchange for yellow orbs, the player can enhance Freyja's basic stat. They can upgrade her Health, Mana, Attack damage or increase her Mind (which increased the speed her ultimate gauge fill up).<br/><br/>Upgrade and Relics<br/><br/>On her epic adventure, Freyja will encounter powerful enemies, each one stronger than the one before. In order to defeat them, Freyja too must become stronger. We will explain how the upgrade systems work in AeternoBlade.<br/><br/>Master your art! The Move list<br/>A power’s hidden deep within all of us. We only have to unlock it with yellow orbs! Freyja can upgrade her basic attack into a more deadly attack. Each move can be upgraded twice until it was maxing out.<br/><br/>Each upgraded move will not only provide more damaging attack but it opens an alternate option to an extended combo that wasn’t available before.", "metacritic": null, "released": "2014-02-18", "tba": false, "updated": "2020-04-17T05:59:38", "background_image": "https://media.rawg.io/media/screenshots/550/55073cf61b00897826795ce492a14502.jpg", "website": "http://www.aeternoblade.com", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 24, "toplay": 3, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 48, "ratings_count": 6, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 6, "platforms": ["Xbox One", "Nintendo 3DS", "PlayStation 4", "PS Vita", "Nintendo Switch", "PC"], "developers": ["CORECELL TECHNOLOGY"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Corecell Technology"], "esrb_rating": "Everyone 10+"}