{"id": 323167, "slug": "forged-of-blood", "name": "Forged of Blood", "name_original": "Forged of Blood", "description": "Forged of Blood is pushing the boundaries of depth and mechanical complexity for the modern turn-based tactical RPG. Classless character building, strategic management, and small unit tactical gameplay combine to create a multi-layered experience that puts players in the middle of a civil war in a morally grey fantasy world.<br/><br/>A game of hard decisions and harsher consequences, Forged of Blood will challenge players to make decisions across every layer of the game. On the battlefield, character builds, turn-order efficiency, and positioning will be key to victory. While off the battlefield, your choices on the world map will determine the fate of your kingdom and future of your people.Key Features:<br/><ul><li>Tactical Fantasy: Take to the field with sword and shield or cast powerful spells in deep turn-based tactical combat against monsters and men.<br/></li><li>Classless Warfare: With 9 unique weapons and a vast magic system, Forged of Blood lets you build your characters any way you want – without being constrained by the typical tank/DPS/healer roles.<br/></li><li>Science in Magic: Explore the freedom and mysteries of one of the most complex and unique magic systems ever attempted in video games.<br/></li><li>Kingdom at War: Command up to three parties of heroic characters on the strategic layer in your fight to reclaim the empire you lost.<br/></li><li>Meaningful Choice: Your choices matter. From character building to your choices in the game narrative, your decisions will reverberate across the Strategic and Tactical layers of the game.<br/></li><li>Your ends; your means: In a world of grays and unique perspectives, it is up to you to decide what is “right” and “wrong” for the future of Attiras. Forged of Blood will introduce a new Tri-axis Personality Plot (TAPP) system in lieu of the traditional Good vs. Evil scale common in most RPG settings.</li></ul><br/>Tactical fantasy, unbound.Building your own character has rarely been so liberating with 9 weapon types – each with its own ability trees - along with 6 general ability trees. Going into battle, players will be able to take customized parties of up to five characters, each with two weapon sets and abilities to respond to any tactical situation.Spellcrafting, as it should be.Few systems will match the freedom of our Magurite Spellcrafting mechanics. Forged of Blood puts players in direct control of the powerful magical forces they can wield in battle, allowing the creation of spells from 6 different “Primordials” each with 8 Effect Classes, that can be individually modified with 12 Effect Modifiers. The spell is then shaped and tuned through 12 unique Global Modifiers. This is spellcrafting the way it should be.Philosophy in War.Focusing on player choice, Forged of Blood accentuates the morally grey world of Attiras with a personality trait system that follows the player’s actions on a Tri-Axis Personality Index. With no light or dark, good or bad, right or wrong – actions are judged by three philosophies: Altruism, Rationalism, and Hedonism.Small Unit Tactics on a World Scale.Your forces are few, but the world is large. Forged of Blood is a game that will be won on and off the field of battle as players manage 3 parties across the great continent of Attiras. Striking the balance between outright conquest, appeasing conquered territories, and managing your own character's growth will prove that while tactics may win the battle, strategy will win the war.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:56", "background_image": "https://media.rawg.io/media/screenshots/7c3/7c3b4ec1f642783f50d2f8949dbe4e0d.jpg", "website": "http://forgedofblood.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 9, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 85, "ratings_count": 2, "suggestions_count": 438, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Critical Forge"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Critical Forge"], "esrb_rating": null}