{"id": 323187, "slug": "swords-of-gurrah", "name": "Swords of Gurrah", "name_original": "Swords of Gurrah", "description": "Fight in front of a blood thirsty crowd as a Sci-Fi Gladiator in Swords of Gurrah. Swords of Gurrah is a virtual reality game focused around hand-to-hand combat weapons. Fighters come from all over of their own free will to risk their lives against man or beast!!!! Fight to the death all to experience the thrill of victory - and if defeated to die for glory! <br/><br/>Gurrah is a single player and multiplayer online game. It takes skill beyond typical gaming to keep up: swing, slice, slash, dodge, duck, and destroy. VR does amazing things to bring life-like hand-to-hand combat into your home.<br/><br/><strong>The Weapons:</strong><br/>These high-tech weapons were forged using nano chip technology. The weapons are designed with the illusion of light weight but actually have the momentum and weight of their ancestor's. Gurrah has a wide selection of weapons: one hand swords, shields, glaives, spears, axes, heavy-class swords, double-sided sabers, daggers, and throwing stars. Select and train, the choice is yours! <br/><br/><br/><strong>The Beasts:</strong><br/>The arena presents many threats to keep gladiators on their toes. Fully armored bulls, tigers, hydras and more are ready for battle. Bred and bio-engineered to fight with ferocity.  Each beast presents a new challenge, testing the ability of a warrior to adjust on the fly. The crowd must be entertained!", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-12T01:23:44", "background_image": "https://media.rawg.io/media/screenshots/699/699970e7d6a5e111989e5bf432813383.jpg", "website": "https://devstergames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 152}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Devster"], "genres": ["Action"], "publishers": ["Devster"], "esrb_rating": null}