{"id": 323181, "slug": "project-zero-deaths-2", "name": "Project Zero Deaths", "name_original": "Project Zero Deaths", "description": "Project Zero Deaths is free-to-play action-filled 2D online platform shooter.<br/><br/>Grab your friends and jump into fast-paced action of Project Zero Deaths! Choose a character that fits your play-style and shoot for the stars! Upgrade &amp; customize every aspect of your character and armory to become the ultimate fighting machine. Test your skills on a range of competitive multiplayer team versus team game modes with overwhelming amount of maps. It's time to gear up and jump into adrenaline filled brawls!<br/><br/><strong>Action-packed online multiplayer:</strong><br/>Fight other players in quick online matches by either going alone or inviting friends to join forces and fight other players together!<br/><br/><strong>Physics-based environment:</strong><br/>Bounce grenades off the walls into your enemy faces, destroy bridges under their feet, pull everyone into a black hole or simply block their way with various physical objects. Use physics to your advantage!<br/><br/><strong>Distinct characters:</strong><br/>5 distinct characters with their own play-styles and more coming later! If you like stealth - go invisible and sneaky with Grouch! If you want to be fast - Rookie is the best choice! Want to cause mayhem? B-Man is for you!<br/><br/><strong>Armory filled with insane weapons:</strong><br/>Ranging from simple plasma guns to portable black hole launchers or explosive spears, there's no doubt that armory is filled with some insane examples that will satisfy any type of player!<br/><br/><strong>Competitive game modes and huge amount of maps:</strong><br/>4 competitive team-versus-team game modes, including such classics like Capture the Flag and Payload. Each game mode having their own set of distinct maps with combined amount of over 25 maps!<br/><br/><strong>Constantly upgradable with new content:</strong><br/>The game is constantly evolving and updating with new content like characters, weapons, maps and game modes!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:10:57", "background_image": "https://media.rawg.io/media/screenshots/bee/bee4706e1992a9c81aa4aea1322a17de.jpg", "website": "https://www.projectzerodeaths.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["UAB Detis"], "genres": ["Action"], "publishers": ["UAB Detis"], "esrb_rating": null}