{"id": 323139, "slug": "blood-and-mead", "name": "Blood And Mead", "name_original": "Blood And Mead", "description": "<strong>\"Better to fight and fall than to live without mead.\" - Ragnar the Bold, 100AD.</strong><br/><br/>A scoundrel Viking, banished for his godlike thirst becomes an unlikely hero as he is called on to solve the mystery of a mead drought threatening his Norse homeland. <br/><br/>Join Olaf the Drunk on a quest that sets him off to explore the beautiful realm of Midgard and the uncharted lands beyond the Great Sea; the far off ancient wonders of feudal Asia, the Silk Road and Pharaoh’s Egypt! <br/><br/>Blood And Mead was crafted meticulously by solo indie developer John Stejskal over the course of four years.<br/><br/><br/><br/><br/><br/><ul><li>A design philosophy inspired by Nintendo’s Shigeru Miyamoto.<br/></li><li>Explore a vast ancient landscape, from the mythological Viking homeland of Midgard to the Silk Road and Pharaoh's Egypt.<br/></li><li>Craft forbidden God’s Blend mead recipes that bestow the drinker with the powers of the ancient Norse gods. <br/></li><li>Tight combat utilizing multiple weapons, shields and mead... lots and lots of mead.<br/></li><li>Go head-to-head with the gods themselves, in epic boss battles.<br/></li><li>Ride a pig naked though a burning village.<br/></li><li>Upgrade armor and weapons to become a true Viking warrior.<br/></li><li>Sail to the mysterious exotic lands beyond the Great Sea.<br/></li><li>Enjoy a captivating sound track with a delightful medieval flair. </li></ul>", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2019-08-28T21:44:57", "background_image": "https://media.rawg.io/media/screenshots/c3c/c3cd2a08724a01a4bbb11fa2d0afe63c.jpg", "website": "http://www.bloodandmead.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Lost Relic Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Lost Relic Games"], "esrb_rating": null}