{"id": 323157, "slug": "the-expression-amrilato", "name": "The Expression Amrilato", "name_original": "The Expression Amrilato", "description": "Yuri Visual NovelThe Expression Amrilato is a girl meets girl yuri visual novel.<br/><br/><br/>This visual novel is for people who like:<br/>- Subtle love-like feelings between girls.<br/>- Just watching cute girls having fun.<br/>- A touching story that will make you cry.StoryRin was just buying a snack in her hometown’s shopping district — but she gets a shock when her surroundings suddenly transform. <br/><br/><br/>\"...Why is the sky pink...?\"<br/><br/>She should know this area well, but the unreadable letters on the signs and the strange language the people are speaking have made things unrecognizable.<br/><br/>...Just then, Ruka, a girl so cute she could be an idol, appears and extends a helping hand.<br/><br/>Rin, who exudes positivity in spades, and Ruka, a supportive girl who speaks only a smattering of Japanese.<br/><br/>This is the story, pure and sometimes frustrating, of two girls intertwined through their fumbling efforts to communicate.In-depth Alternate World LanguageIn \"The Expression Amrilato\", the main character is lost in an alternate world where Juliamo (which in the real world is Esperanto, an existing constructed language.) is the official spoken language. <br/><br/><br/>Therefore, while enjoying a story between cute girls, you can also learn the Esperanto language!<br/><br/>The text in this game has been officially supervised by the National Esperanto Association in Japan.<br/><br/>You additionally might be able to learn Japanese in the Japanese version included in the package, as well as Chinese in the Chinese version planned in the near future!?Game System- Study Esperanto through the quiz-oriented Study Mode.<br/><br/>- The Study Mode can be played on its own as a review.<br/>- If you want to prioritize the story, you can just set the quizzes as \"Homework\"<br/>- After clearing the game, you can select if you want to display the Esperanto translation as subtitles or not.", "metacritic": null, "released": "2019-06-13", "tba": false, "updated": "2019-08-28T21:44:57", "background_image": "https://media.rawg.io/media/screenshots/d13/d13feeb5dd3714bd620f7af6b2122068.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 12, "toplay": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["SukeraSparo"], "genres": ["Adventure", "Indie"], "publishers": ["MangaGamer"], "esrb_rating": null}