{"id": 3231, "slug": "boggle", "name": "Boggle", "name_original": "Boggle", "description": "<p>New rules and modifiers will change the way you play Boggle! Bonus Dice allows you to score bigger points with multipliers, but be quick because they won&#39;t stay in the same place for long. Time Attack lets you race against the clock! Add more time by adding more words. Word Find gives you words to search for, all you have to do is find them. Banned Letter makes random letters unusable for brief periods of time, and watch out the for the bomb in Minefield which re-rolls all adjacent dice when it explodes!<br />\nPlay Boggle against a friend side by side in a local game, or take your skills online and face up to 3 opponents at once! Boggle supports competitive and cooperative play.<br />\nThanks to the Hasbro Game Channel, you have access to missions, achievements and rewards. Share your trophies and rise up the leader-board in the online community!<br />\n1-4 players<br />\n1080p HD Video Output<br />\nOffline Play Enabled<br />\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />\nBOGGLE is a trademark of Hasbro and is used with permission. © 2015 Hasbro. All Rights Reserved. Licensed by Hasbro to Ubisoft Entertainment. Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries. Games software © 2015 Ubisoft Entertainment. All Rights Reserved.</p>", "metacritic": null, "released": "2015-08-04", "tba": false, "updated": "2020-04-24T01:58:06", "background_image": "https://media.rawg.io/media/screenshots/d67/d67b97867f84348297d10307500f3683.jpg", "website": "", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 53, "beaten": 3, "toplay": 2, "dropped": 2}, "playtime": 0, "achievements_count": 60, "ratings_count": 6, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 6, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Ubisoft", "Third-i Productions", "PCA"], "genres": ["Board Games"], "publishers": ["Ubisoft Entertainment", "Hasbro Interactive"], "esrb_rating": "Everyone"}