{"id": 323173, "slug": "escape-first-2", "name": "Escape First 2", "name_original": "Escape First 2", "description": "\"Escape First 2\" is the second installment of a multiplayer escape room puzzle game for virtual reality or desktop PC! It includes <strong>3 different escape rooms</strong>  to choose from and can be played competitively, co-op or solo.MultiplayerGather up to <strong>6 people </strong>and play as one team that tries to solve the puzzles or try the \"<strong>Versus</strong>\" mode, where each player is locked alone and tries to escape the room before the others do!Virtual RealityThe game supports full roomscale/standing tracking with motion controllers on both the <strong>HTC Vive</strong> and <strong>Oculus Rift</strong>.<br/>VR is not necessary, you can play with a <strong>Desktop</strong> using keyboard &amp; mouse / gamepad.The Rooms<br/><strong>Psycho Circus Cont.</strong><br/>You managed to escape the clown’s quarters, but you are not free yet. Did you think it would be this easy to escape? The show must go on and you are the exhibit! Think and act fast in order to escape the circus, we all know that clowns don’t like other people touching their stuff! <br/><br/><strong>The Torture Chamber</strong><br/>A medieval dungeon, filled with torture devices, prison cages and not many prisoners left. Hearing screams from the room next door, you know you don’t have much time left until the guards come for you. The doors are locked, is there another way out?<br/><br/><strong>Behind the Scenes</strong><br/>While visiting an Escape Room Factory, you black out and wake up in the bathroom. However, there is one thing about this room that does not seem right, it has no doors or windows! How did you get here and more importantly, how will you ever get out?Help us improvePlease give us your thoughts and ideas on the game, we are here to improve and we need your help to keep doing what we love! Want more Escape Rooms?  Challenge your friends on \"Escape First\"<br/>Check \"Tales of Escape\" out for free!", "metacritic": null, "released": "2019-06-12", "tba": false, "updated": "2023-05-27T01:09:26", "background_image": "https://media.rawg.io/media/screenshots/b5c/b5c126d82c7af1aba435284f7ec030e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "beaten": 3, "dropped": 2}, "playtime": 5, "achievements_count": 19, "ratings_count": 3, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["OnSkull Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["OnSkull Games"], "esrb_rating": null}