{"id": 323192, "slug": "die-auslanders-collection-x-com", "name": "Die Auslanders - Collection X-Com", "name_original": "Die Auslanders - Collection X-Com", "description": "<p>\n\nLes langues, les fonctionnalités et les configurations requises peuvent varier selon les jeux : consultez les pages des produits pour plus de détails. Si vous possédez déjà certains des jeux inclus dans la collection, vous recevrez automatiquement par e-mail un code promo que vous pourrez partager avec un ami. Ce code expirera un an après sa date d'achat.</p>\n\nIls arrivent des tréfonds de l'espace pour conquérir toutes les scènes de notre planète. Pour le Festival des Soldes d'été, ils vont vous rejouer l'ensemble de leurs plus grands classiques : UFO Defense, Terror from the Deep, Apocalypse, Interceptor et Enforcer. Laissez-vous emporter par ces titres interstellaires !\n\n\n\n\n<br/>\n\n\n\n\n\n\n\n\n\nX-Com: UFO Defense\n Vous êtes aux commandes du X-COM : une organisation créée pour combattre l'invasion extra-terrestre. Commandez le bataillon qui va devoir se rendre sur les lieux du crash de l'appareil et ne laissez aucune chance aux aliens. Une fois leur technologie maîtrisée, vous pourrez l'appliquer à des fins industrielles et militaires. Il est primordial de faire les bons choix aux bons moments pour combattre les aliens. Il ne faut pas pour autant oublier la situation politique intérieure. Certains gouvernements pourraient jouer contre vous...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nX-Com: Terror from the Deep\n Ce jeu culte vous emmène sur un champ de bataille galactique. Souhaitant prendre l'avantage sur une Terre affaiblie, les ennemis aliens changent de stratégie de manière inattendue et lancent une deuxième offensive contre votre planète. Dans les profondeurs sombres des vastes océans, les forces dormantes sont réveillées par des signaux galactiques emis par leurs frères et sœurs interstellaires. Lentement mais surement, une armée de créatures aliens en hibernation se réveille…\n\n\n\n\n\n\n\n\n\n\n\n\nX-Com: Apocalypse\n Il va se passer des choses terribles en ville ce soir... La terre a été ravagée par les excès des humains, les conflits incessants et une invasion extra-terrestre. La population mondiale a été rassemblée dans d'immenses cités. Mega Primus est la plus importante de ces dernières. En plus des conflits sociaux et d'une guerre civile rampante, une invasion extra-terrestre assiège la mégalopole. Votre mission, en tant que commandant X-com est de combattre les aliens et de découvrir leurs intentions. Les aliens ne sont pas le seul danger : les gangs, les sectes... même la police peut se montrer dangereuse !\n\n\n\n\n\n\n\n\n\n\n\n\nX-Com: Interceptor\n Ils sont de retour... pour détruire la terre. En tant que commandant X-COM, il est de votre devoir de protéger l'humanité et les ressources minières de l'espace. \n\n\n\n\n\n\n\n\n\n\n\n\nX-Com: Enforcer\n Les forces extra-terrestres ont envahi la terre et terrorisent la population. Pour les combattre les scientifiques de la X-com ont créé l'Enforcer, une machine de combat basée sur une technologie extra-terrestre. Armé de l'Enforcer plongez au cœur de la bataille : dans les rues, sur les toits, dans les égouts. X-COM ENFORCER vous met en ligne de front de la lutte contre les extra-terrestre.", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-05-31T03:00:27", "background_image": "https://media.rawg.io/media/screenshots/aa8/aa83b829ddba2c94516634de15e819bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MicroProse Software"], "genres": [], "publishers": ["2K Games"], "esrb_rating": null}