{"id": 323231, "slug": "ballio-beach-mayhem", "name": "Ball.io: Beach Mayhem", "name_original": "Ball.io: Beach Mayhem", "description": "One of the most superior sports of the world “Rugby” is now at your fingertips! This game is something that you need to be fired up to play and prove your ability.<br/><br/>It is said that \"If you don't see yourself as a winner then you cannot perform as a winner\"! All you have to do here is, “Run Faster”, “Fight Harder, “Grab the Ball”, and reach to the “Goal-Line”! <br/><br/>Bored-off with the routine work life? Not to worry! We are providing you this beach rugby with an attractive User Interface that gives the feel of a beach environment just like you feel it on the beach during the summer holidays!<br/><br/>How to play this “ RugbyBash: Mayhem for Rugby Fanatics!”?<br/><br/>&gt;&gt; Download and open this game<br/>&gt;&gt; Just start this mayhem game by a single tap<br/>&gt;&gt; Snatch the ball and drag touchdown hero in the direction of a goal-line<br/>&gt;&gt; That’s it! Now enjoy the Rugby league!<br/><br/>You can get the most fastest and electrifying form of playground games. The football games were never so addictive and interesting before entering in this world of Rugby games!<br/><br/>Why to choose this RugbyBash: Mayhem for Rugby Fanatics?<br/><br/>~&gt; Just one tap to start &amp; easy to play!<br/><br/>Whether you are a seasoned American Football game player or just a beginner, just show off your rugby skills with intuitive controls. Use swipe gestures to sidestep the defenders. Help your ball boy to grab the ball, run towards the goal point &amp; make a victory!<br/><br/>~&gt; Attractive UI with beautiful beach environment!<br/><br/>You’ll get realistic bouncing rugby balls all over your mobile screen. Feel the beach environment and experience the realistic Rugby Football game!<br/><br/>~&gt; Changeable player’s look, clothes’ color, as well as ball style!<br/><br/>Play more mayhem match and unlock some amazing features! Getting bored by seeing same clothes’ color, ball style and look of a ball boy? You have a choice to change it from a wide range of options given!<br/><br/>~&gt; Track player’s performance stats!<br/><br/>Your touchdown hero’s performance is tracked through the career stats! Here you will get different figures such as, total match that you have played, your won matches, winning percentage, best win streak, total touchdowns, and so on!<br/><br/>This amazing American Football game with all these above-mentioned features is available at ZERO cost, i.e. absolutely FREE!<br/><br/>It's a great bit of fun to relax in your busy work schedule or while you are waiting for the live match to start! Tackle the speed, power and intensity of Rugby Championship on mobile with the “ RugbyBash: Mayhem for Rugby Fanatics!”<br/><br/>Prove your skills in this must-have game for any football games fan! Play this beach rugby league game and lead your team to victory against opponent!<br/><br/>Download this “ RugbyBash: Mayhem for Rugby Fanatics” now!<br/><br/>It’s a rugby season again, so pull up your socks, and try to make as many goals as you want and become a winner!", "metacritic": null, "released": "2019-03-09", "tba": false, "updated": "2019-10-22T14:33:32", "background_image": "https://media.rawg.io/media/screenshots/6c3/6c31a2b6c1db269c2ff56c69f032f8c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["xR Studio LLP"], "genres": ["Sports", "Casual"], "publishers": ["xR Studio LLP"], "esrb_rating": "Teen"}