{"id": 323272, "slug": "bounce-air", "name": "Bounce Air", "name_original": "Bounce Air", "description": "Monthly Subscription is renewed every month and costs $9.99 per month.<br/>3 Monthly Subscription starts with a 3-day free trial and is renewed every 3 months and costs $19.99 per 3 months.<br/>Annual Subscription is renewed every year and costs $29.99 per year.<br/><br/>Payment will be charged to your iTunes account at confirmation of purchase.<br/>It automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>The account will be charged for renewal within 24-hours of the end of the current period, and the cost of the renewal will be provided.<br/>Subscriptions may be managed by the user. Auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase.<br/>Any unused portion of a free trial, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/>You can turn off the auto-renew functionality whenever you want through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to play the game.<br/>Terms and Conditions: http://brobabil.com/term-of-use.html<br/>Privacy Policy : http://brobabil.com/privacy-policy.html", "metacritic": null, "released": "2018-12-06", "tba": false, "updated": "2019-07-29T23:14:55", "background_image": "https://media.rawg.io/media/screenshots/347/347508306fe26ac9158d10f73a2506d9_LI7RD2q.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Babil Studios"], "genres": ["Casual"], "publishers": ["BROBABIL IC VE DIS TICARET LTD STI"], "esrb_rating": null}