{"id": 323255, "slug": "overhit", "name": "OVERHIT", "name_original": "OVERHIT", "description": "A Visual Masterpiece of Epic Battle!<br/><br/>Witness unforgettable characters and locations, all rendered in full 3D with the power of Unreal Engine 4!<br/>Welcome to OVERHIT, a universe where unique civilizations co-exist across time and space!<br/>Download incredible turn-based RPG action right into you palm of your hand!<br/><br/>■ The Ultimate Team<br/>More than 120 Heroes with unique characteristics and abilities!<br/>Jump into complex battles where synergy and formation are the keys to victory!<br/><br/>■ Next-Level Graphics<br/>A visual masterpiece!<br/>Epic action that will get your blood pumping!<br/>Immerse yourself in raging battles and awe-inspiring skills unlike anything you've ever seen before!<br/>Unleash spectacular Overhit skills to see what Hero combinations can really do!<br/><br/>■ Strategic Gameplay<br/>An intuitive battle system where every skill is just a tap away!<br/>But simple doesn't mean easy! Well-timed attacks and a balanced party can mean the difference between victory and defeat!<br/>Take on a variety of tactical encounters where only the quick and the smart will survive!<br/><br/>■ Collaborative Guilds<br/>Gather together with friends and guild members to embark on thrilling expeditions against unique bosses!<br/>It's guild vs guild! Jump into a tournament and teach the world not to mess with your crew!<br/><br/>■ Tons of Extra Content<br/>Special Dungeons, Explorations, Daily Dungeons, Arena, Guild Raids, and more!<br/>Have a blast and earn rewards no matter how you play!<br/><br/>■ All-Star Cast of Japanese Voiceover Legends<br/><br/>An immersive story brought to life by voiced characters!<br/>Listen in for a truly cinematic experience!<br/><br/>Ash (CV Ishikawa Kaito), the Blackwings' latest recruit.<br/>Sophia (CV Uchida Aya), the Maiden of the Sun.<br/>Ren (CV Ishikawa Yui), a ninja who is not only Sophia's bodyguard, but her friend.<br/>Malpion (CV Morikawa Toiyuki), an assassin from the Onyx Court of the Forest of the Elves.<br/>Colette (CV Iguichi Yuka), the \"Heretic Witch\" with a body blessed by eternal youth.<br/><br/>▶ Recommended Specifications<br/>The game is optimized for devices with OS 9.3 / iPhone 6s or newer. <br/>Devices with older specs could experience performance issues. Network connection required.<br/><br/>■ Visit Here to Learn More About OVERHIT <br/>Official Website : https://overhitglobal.nexon.com<br/>Facebook : https://facebook.com/OverhitGlobal<br/><br/>▶ App Permissions Info<br/>In order to provide the following services, we are requesting certain permissions.<br/><br/>[Optional Permissions]<br/>- Optional permissions do not affect gameplay.<br/>Camera: Take photos or record videos for upload.<br/>Photos: Save and upload photos/videos.<br/><br/>▶ Permission Management<br/>* Settings &gt; Privacy &gt; Select App &gt; Permissions<br/><br/>Terms of Service: http://m.nexon.com/terms/304<br/>Privacy Policy: http://m.nexon.com/terms/305", "metacritic": null, "released": "2019-05-30", "tba": false, "updated": "2019-07-31T00:36:13", "background_image": "https://media.rawg.io/media/screenshots/62c/62c2f03c606734a6eb946ffd455d3514.jpg", "website": "https://facebook.com/OverhitGlobal", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["NEXON Company"], "genres": ["Adventure", "RPG"], "publishers": ["NEXON KOREA"], "esrb_rating": null}