{"id": 323201, "slug": "cowboy", "name": "Cowboy!", "name_original": "Cowboy!", "description": "Well grab your boots and saddle up, Pardner, because you are in for the ride of your life.<br/> <br/>COWBOY! lets you live your best lasso life without the annoying dusty chaps. The latest release from Lion Studios puts YOU in the saddle as the ropin’est hand this side of Tombstone.<br/> <br/>With your trusty lariat and a myriad of steeds (Ever wanted to ride a panda? A gorilla? A pink and black unicorn??), your one job is to collect as many animals as you can in the Wild West.<br/> <br/>Simple, right? WRONG.<br/> <br/>What takes seconds to learn will take forever to master. The more animals you bring in, the more upgrades are available to you: rope more creatures each throw, earn more coins, and, most importantly, extend your lasso’s length. You will need every foot you can get as you chase down increasingly more exotic, and sometimes even fictional, animals for your collection. Start by rustling cattle and goats, horses and alpacas. But wait, what’s that down the path? Zebras, kangaroos, squirrels; you’ll need a precise and quick finger to catch those rascally…. dinosaurs???<br/><br/>Game Features:<br/><br/>1. Tons of Secret Beasts<br/><br/>Gotta lasso them all! There are so many animals in the game for you to catch and collect. Don't miss out on opportunities to catch these ultra-rare beasts.<br/><br/>2. Show off with your Trophy Room<br/><br/>Display your trophies like a true cowboy legend and track your accomplishments. Can you catch enough rare animals to fill a zoo? Only !<br/><br/>3. Level up your lasso<br/><br/>The more you catch, the more money you make. The more you earn, the better your equipment becomes. And thanks to the addition of idle earnings, you can have a ton of cash waiting for you when you return to the game! <br/><br/>4. Free to play with no WIFI needed!<br/><br/>Play endlessly, anytime and anywhere, for free! No internet connection is required!<br/><br/>5. New skins, animals, and worlds to unlock!<br/><br/>Traverse dozens of levels in our constantly expanding world that is much wilder than the West ever was! Stop living like a city slicker and get up on that high horse (or unicorn) you always dreamed of riding. <br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level, or have any awesome ideas you would like to see in the game!<br/><br/>Follow us to get news and updates on our other award-winning titles:<br/><br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": "2018-11-17", "tba": false, "updated": "2019-07-30T18:51:47", "background_image": "https://media.rawg.io/media/screenshots/288/288fba4be621f16c5b89a2d39c532b25.jpg", "website": "https://lionstudios.cc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Lion Studios"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Lion Studios"], "esrb_rating": "Everyone"}