{"id": 323251, "slug": "2019-dinosaur-simulator-world", "name": "2019 Dinosaur Simulator World", "name_original": "2019 Dinosaur Simulator World", "description": "Hey! What happened in the city? Iguanodon, T- rex, velociraptors, diplodocus, dino birds and dino rodents. All of them are invading the city streets and scaring all the citizens. This is the Jurassic... in the modern era! You will have a lot of fun! Trust us!<br/><br/>In this realistic super fun simulator game, you will have to explore the maps and survive in this endless world full of adventures and missions to accomplish, like feeding yourself of fresh new creatures. Why to get this missions done? Because this way you will get coins, which eventually will allow you to personalize your dinosaur in a prehistoric store, be another dinosaur like a velociraptor or the fearful T-Rex and, of course, evolve into different levels.<br/><br/>But it’s not all and you can come totally crazy. Because in this amazing prehistoric beasts’ simulator game, you can cause destruction in a super cool “destroyer mode”. Here, you can break everything, mess, wreck, demolish, ram, smash everything you can see in this modern city! Explode the cars, knock down everything in your path and scare the humanity with your strenght and size!<br/><br/>Considered one of the best dinosaur simulator ever created, with this game you will have unlimited hours of really fun entertainment, by exploring the city streets around you. At the same time, you will learn a lot about this amazing period of our history, about how different dinosaurs beheld with each other. From the super fierce T-Rex to the mega fast silence velociraptor. All the most important historical dinosaurs are part of this great simulator and adventure game.<br/><br/>Come on! Become a dino and let’s have some Jurassic fun!", "metacritic": null, "released": "2019-06-21", "tba": false, "updated": "2019-07-29T21:57:18", "background_image": "https://media.rawg.io/media/screenshots/5f4/5f4ad408e1f4d563bdd92e0d1dce567a_09u9YYB.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Epic Win Games"], "genres": ["RPG", "Simulation"], "publishers": ["ALM GESTION EMPRESARIAL SOCIEDAD LIMITADA"], "esrb_rating": null}