{"id": 323390, "slug": "african-safari-hunting-simulator-3d-full", "name": "African Safari Hunting Simulator 3D Full", "name_original": "African Safari Hunting Simulator 3D Full", "description": "Do you love hunt simulators? This time, you should chase your prey on your off-road jeep across the African savannah! <br/>Load your gun, aim carefully and shoot right in vital point! Feel as a pro hunter participating Big Game with African Safari Hunting Simulator 3D!<br/><br/>Chase different desert animals - giraffes, elephants, warthogs, hyenas, lions – herbivores and predators alike, aim carefully, as a real sniper and try to kill your target as fast as you can! Beware the wounded predators and don’t become a victim yourself!<br/><br/>Use all your hunting skills, earn coins to buy new ammo for your gun or to buy a new one! Complete different mission to unlock all achievements and prove yourself as a real hunt master! Try more powerful weapons to raise up your effectiveness! Get the most impressive trophy with African Safari Hunting Simulator 3D!<br/><br/>Use the special radar to find animals, keep yourself alert, seek for your prey accurately and pull the trigger without any doubts! Collect different trophies with African Safari Hunting Simulator 3D!<br/><br/>African Safari Hunting Simulator 3D features:<br/>Enjoy the beautiful views of real African savannah<br/>Chase different species of African fauna as your prey!<br/>Buy varies weapons - try to unlock all of them!<br/>Check this Ultimate hunting simulator<br/><br/>Be ready for the Big Game Hunting! Try African Safari Hunting Simulator 3D and prove your worth as a real hunter!", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-10-22T14:35:28", "background_image": "https://media.rawg.io/media/screenshots/1e1/1e19fa6e7791385d30c0c589d10453b2_qlsfMA8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Action", "Sports"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}