{"id": 3234, "slug": "sparkle-unleashed", "name": "Sparkle Unleashed", "name_original": "Sparkle Unleashed", "description": "<p>Experience the fabled Sparkle brand action puzzle like never before! Make your way through a secluded world of mystery, light magical braziers and discover a way to banish the darkness once and for all.<br />\nSparkle Unleashed features superbly polished action puzzle gameplay. Match three or more like colored orbs to make them disappear. Chain three matches to earn a potent powerup.<br />\nOvercome Chained Orbs, Rock Orbs, Survival levels and other exciting challenges. For the first time in a Sparkle series game, the Orb Slinger floats along the bottom of the screen providing a fresh way to experience the beloved Sparkle gameplay.<br />\nUnlock great powerups such as Frost Ray, Purple Flame, and Color Wipe and select to use the ones you like the most.<br />\nTravel through a secluded world of mystery, light magical braziers and carve a path of light through the darkness as you conquer 108 increasingly challenging levels. Two additional levels of challenge provide an incredible challenge for those who yearn it.<br />\nUltra-polished match-three marble shooter gameplay<br />\nChained Orbs, Rock Orbs and more all new challenges<br />\nAn arsenal of 18 potent powerups to choose from<br />\nImmersive soundtrack by award-winning composer Jonathan Geer<br />\n108 challenging levels, Survival mode and three difficulty settings</p>", "metacritic": 65, "released": "2014-04-16", "tba": false, "updated": "2023-02-22T16:32:41", "background_image": "https://media.rawg.io/media/screenshots/b1a/b1abe6dc88f1526c2222b29285ce20bb.jpg", "website": "http://www.10tons.com/Game/sparkle_unleashed.html", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 113, "beaten": 3, "toplay": 2}, "playtime": 3, "achievements_count": 60, "ratings_count": 5, "suggestions_count": 238, "game_series_count": 4, "reviews_count": 5, "platforms": ["Android", "PS Vita", "PlayStation 4", "PlayStation 3", "macOS", "PC", "iOS", "Xbox One", "Nintendo Switch"], "developers": ["10tons"], "genres": ["Action", "Casual", "Indie", "Puzzle"], "publishers": ["10tons"], "esrb_rating": "Everyone"}