{"id": 323608, "slug": "escape-the-cutout", "name": "Escape The Cutout", "name_original": "Escape The Cutout", "description": "<p>Escape the Cutout is a game designed to bridge the gap between physical activities and video game challenges. Intended as a party game, Escape the Cutout derives inspiration from the acclaimed Japanese game show, Nōkabe, where players must physically pose in response to a number of increasingly difficult forms coming towards them.<br/></p>\n<p>In Escape the Cutout, the player must control the character on the screen using nothing but their body. They must maneuver the character into the oncoming cutouts in order to avoid being pushed off the platform. Combined with a strong, yet simple narrative, users never feel overwhelmed or overburdened with the concept of the mechanics, allowing them to focus on the challenge itself. The unique control system is its own on-boarding tool, allowing users to get comfortable with playing, without realizing it. By using this ‘body as the controller’ method as well as the balanced cutout challenges and level progression, the game has a very high retention rate, as well as replayability. When a player is so physically engaged with something, winning or losing feels far more personal as they progress.</p>\n<p>Stemming from a desire to develop a more physical work portfolio, Escape the Cutout combines a number of novel technologies inside industry-standard software to build an experience that connects the digital game world, art and narrative to the users real-world actions and position. Normally, video-games are reserved for private time or solo adventure, but Escape the Cutout changes that dynamic by encouraging and benefitting from social gameplay and audience interaction. The goal is that the player becomes the main focus, rather than the on-screen content. The majority of users won’t even think of it as a conventional video game, but will leave with very positive emotional experiences to the space and gameplay.</p>", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-05-31T05:14:08", "background_image": "https://media.rawg.io/media/screenshots/d34/d34ceb88067ed8d74a9ccc54edbe029b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["x21357"], "genres": [], "publishers": [], "esrb_rating": null}