{"id": 323633, "slug": "even-in-arcadia", "name": "Even in Arcadia", "name_original": "Even in Arcadia", "description": "<p>STORY:<br/></p>\n<p>In a distant future in which capitalism and consumerism have continued to run rampant, corporations have replaced all government, and planet Earth has long been relegated to legend, society constantly moves to new planets and throws away the old ones like last year's model of smartphone.<br/></p>\n<p>You are a guest at the launch party for the most recently developed planet: Arcadia. The party takes place at the planet's premiere attraction, the Arcadia Botanical Gardens. As a guest, you may wander the Gardens' various rooms and eavesdrop on the other distinguished guests whose stories and dramas play out in a repeating cycle over the course of the evening.</p>\n<p>The Gardens claim to recreate the natural world of \"prelaunch\" Earth, a world no one has experienced in thousands of years. The game explores humanity's relationship to nature under capitalism, speculating on what \"nature\" would look when completely constructed by humans, and prompting the question of how close we may already be to such a reality.</p>\n<p>GAMEPLAY:<br/></p>\n<p>Throughout the game's duration, characters will move about and speak to one another. You can follow them around, listen to their conversations, and witness their dramas as they unfold throughout the evening. These events are repeated, the number of repetitions counted by the Cycle # in the top right corner of your HUD. So if you miss part of a conversation, you'll always have another chance to catch it during the next cycle. One cycle lasts approximately half an hour.</p>\n<p>You can also explore the Gardens at your own pace, take in the various scenes, and engage with the interactive elements you encounter. When you are close to an interactive element, a text prompt on screen will instruct you on how to interact with it (usually by pressing E).</p>\n<p>THEORY:</p>\n<p>I studied media studies (MEDS) at Vassar College, class of 2018. In the MEDS department, students elect to create either a written thesis or a project with a written component. This game was my project. In line with the department's emphasis on critical theory, my game draws on many scholars of media theory, narrative theory, and environmental theory, as well as taking inspiration from immersive theater and of course other video games. Among many others, my influences include Guy Debord &amp; the Situationist International, Henry Jenkins, Beatriz Colomina, T. J. Demos, and the work of Punchdrunk and Fullbright. </p>\n<p>You can learn more about the theory behind Even in Arcadia in my thesis's written component. Please contact me at phoebeshalloway@gmail.com for a copy or download it from my website: https://girldebordgames.myportfolio.com/even-in-arcadia</p>", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-05-31T05:19:48", "background_image": "https://media.rawg.io/media/screenshots/b88/b88e24238f10aea35090d2b7ff905130.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["phoebeshalloway"], "genres": [], "publishers": [], "esrb_rating": null}