{"id": 323675, "slug": "born-of-fire-itch", "name": "Born of Fire (itch)", "name_original": "Born of Fire (itch)", "description": "<p>Born of Fire is a strategy card game that combines the gameplay of Roguelike and Deck-building games. In addition to the classic tower mode, you can meticulously build your deck to battle players from around the world. </p>\n<p>The name Born of Fire comes from an important part of the game’s plot. Your hero enters a divine world, challenging the legendary Tower of Phoenix. When you are defeated, you will be reborn in the Flames of Phoenix. You will become stronger every time you lose. Eventually, you will be strong enough to beat the Phoenix to reach the top of the tower and become the god of a new generation.</p>\n<p>There are many heroes to choose from in the game. Every hero has a different battle position. Commanders that are adept defenders and can command the battle. Mages with explosive spells that affect a wide range. Also, you can put allies with different features into your deck to fight alongside you.\r\n  </p>\n<p>Game Features:\r\n  </p>\n<ul><li>Innovative time sequence battles for faster pace battles and more excitement. \r\n  </li><li>You aren’t alone. Place allies with different abilities in your deck to fight alongside you.\r\n  </li><li>Arrange your defenders and attackers to open the door to victory.\r\n  </li><li>You will never know what traps your opponent has set for you with their special “Counter” cards.\r\n  </li><li>Heroes have exclusive rage spells that can turn the battle around.\r\n  </li></ul>\n<p>Exciting Content:<br/></p>\n<ul><li>There are two classes with more to come.\r\n  </li><li>The classic Roguelike mode has random enemies, missions, and rewards.\r\n  </li><li>You can upgrade your cards. Every battle will make you stronger.\r\n  </li><li>Collect cards to make a unique deck and battle players from around the world in Duel mode.\r\n  </li><li>New gameplay or classes will be introduced every month such as the Two-headed Giant mode (2v2) and Ladder mode.\r\n</li></ul>\n<p>Please join the Born of Fire Discord to learn more!</p>", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-05-31T05:29:26", "background_image": "https://media.rawg.io/media/screenshots/0ae/0aeb61d7507a78146712dff4b96d9a4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Leaf Boat Studio"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}