{"id": 323753, "slug": "un-cabron-en-transmilenio", "name": "Un Cabron en Transmilenio", "name_original": "Un Cabron en Transmilenio", "description": "<p>Un cabrón en Transmilenio es un juego sencillo de acción en el que debes abrirte paso entre los pasajeros del sistema de transporte público más usado en Bogotá para poder bajarte en tu estación de destino antes de que las puertas se cierren y el bus siga su camino. Tendrás que empujar a las vacas y evitar a los casi inamovibles cerdos si quieres ver a una cabra feliz.</p>\n<p>El juego fue desarrollado en 16 horas para el Game Challenge 2019, un game jam en el que se buscaba una solución a un problema de movilidad en la ciudad, en específico, al de Transmilenio. Nuestro juego, más que proponer una solución, es una crítica a la forma en como un sistema de transporte público de mala calidad en una ciudad con muchos habitantes convierte a sus pasajeros en animales cuya única preocupación es llegar a tiempo a su destino.</p>\n\n\n\n<p>Un cabrón en Transmilenio is a game where you are a user of the most used public transportation system in Bogota. You will get through the blocking passengers to be able to get off the bus at your final destination before the doors are closed and the vehicle continues with its path. You’ll have to ram against the cows and avoid the immovable pigs if you want to be a happy goat. </p>\n<p>The game was developed in 16 hours for the Game Challenge 2019, a game jam aimed to find a solution for the city’s traffic mobility problems, of Transmilenio specifically. Instead of proposing a solution, it illustrates how deficient public transportation affects the life quality of a highly populated city. It makes its users behave like cattle worried exclusively about getting to their destination on time.<br/></p>\n\n<p><strong>WEB / Escritorio:</strong> Oprime las teclas de dirección ↑→↓← (o WASD) para guiar a la cabra hasta la salida.</p>\n<p><strong>Móvil</strong>: Haz tap en el lugar hacia el que quieres que se dirija la cabra y guíala a la salida.</p>\n<p>Tendrás que empujar a otros animales para abrirte paso. Oprimir las teclas, o hacer tap, repetida y rápidamente permitirá a la cabra pasar entre dos animales.</p>\n\n<br/>\n<p><strong>WEB / PC:</strong> Press the arrow keys ↑ → ↓ ← (or WASD) to guide the goat to the exit.</p>\n<p><strong>Mobile:</strong> Tap on the direction you want the goat to go and guide it to the exit.</p>\n<p>You’ll have to push through other animals to get to an exit. Pressing the keys or tapping repeatedly will allow you to go through animals easier.</p>\n\n\n<p>Este es un proyecto aún en desarrollo y tenemos algunas ideas para mejorarlo:</p>\n<ul><li>Más estaciones con distintos niveles de dificultad.</li><li>Viajes más largos.</li><li>Más tipos de pasajero como: el toro, que te empujará si lo empujas; la rata, que te robará algo; el canario, que cantará y recorrerá el bus en busca de una recompensa por su interpretación.</li><li>Pasajeros que entran y salen en cada estación.</li><li>Globos de texto con las reacciones de los pasajeros cuando son empujados y sus conversaciones.</li><li>Un perro conductor que será un poco más amable que el actual gato conductor.</li><li>El movimiento del bus y el caos que genera la cantidad de huecos en las vías de la ciudad.</li><li>Logros adicionales en caso de que el reto de salir del bus no sea suficientemente entretenido.</li><li>¡Brazos para los pasajeros! Que realmente no afectarán la jugabilidad pero sí harán que todo sea más divertido.</li></ul>\n<p>         Hecho con:    </p><p>This a project on development and we have some ideas to improve the game:</p>\n<ul><li>More bus stations with different difficulty levels.</li><li>Longer trips.</li><li>More passenger types such as: </li><ul><li>The Bull: Will push back at you.</li><li>The Rat: Will steal stuff from you.</li><li>The Bird: Will sing and go through the bus asking remuneration for its performance.</li></ul><li>Passengers that get on and off the bus.</li><li>Text popups showing the reaction of passengers being pushed and their casual conversations.</li><li>A dog driver that will be a bit more gentle than the actual cat driver.</li><li>Additional goals in case that getting off the bus isn’t challenging enough.</li><li>¡Arms for the passengers! They won’t really affect gameplay but will make everything more fun.</li></ul>\n\n<p><strong>¿Qué es Transmilenio?</strong></p>\n<ul><li>Es el sistema de transporte público más usado en Bogotá no por su buena calidad de servicio sino porque no hay muchas más opciones y hay mucho dinero detrás.</li></ul>\n<p><strong>¿Por qué una cabra?</strong></p>\n<ul><li>Porque son animales que saltan y empujan, acciones efectuadas con recurrencia por los usuarios de Transmilenio en cada viaje. -- algunos de ellos se vuelven unos verdaderos <strong>cabrones</strong> --</li></ul>\n<p><strong>¿Por qué vacas y cerdos?</strong></p>\n<ul><li>Porque son una excelente metáfora al tipo de pasajeros que pulula en este sistema de transporte público. Realmente son personas de bien que se transforman tan pronto ponen un pie dentro de la estación.</li></ul>\n\n\n<p><strong>¿What is Transmilenio?</strong></p>\n<ul><li>It is the most used public transportation in Bogota, not because of it’s quality service but for lacking better options. There’s a lot of money involved in this issue.</li></ul>\n<p><strong>¿Why a goat?</strong></p>\n<ul><li>Because they are animals that enjoy jumping and ramming, actions frequently seen on the system users on every trip. Some of those users become real “Cabrones”.</li></ul>\n<p><strong>¿Why cows and pigs?</strong></p>\n<ul><li>Because we saw an excellent metaphor for the type of passengers that propagate throughout the transportation system. They are good people that transform at the moment they set a foot into a bus station.</li></ul>\n\n\r\n            \r\n\n<p>           </p>", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-05-31T05:47:43", "background_image": "https://media.rawg.io/media/screenshots/82a/82ad5093da8461b42889b77d4c70fa5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["mapedorr", "Black Mamba Studio", "prinfrexita"], "genres": ["Action"], "publishers": [], "esrb_rating": null}