{"id": 323704, "slug": "space-survival-nom-temporaire", "name": "Space survival (nom temporaire)", "name_original": "Space survival (nom temporaire)", "description": "<p>Space Survival (le nom changera sans doute dans le futur) est un jeu de survie sur une planète sans atmosphère. </p>\n<p>Suite au crash de votre vaisseau sur cette planète inconnue, 2 solutions s'offrent à vous : en construire un nouveau et rentrer chez vous, ou faire de cette planète inhabitée votre nouvelle maison. Qu'importe l'objectif que vous vous fixerez, l'équipement de pointe qui se trouve à bord de votre navette, désormais clouée au sol, sera insuffisant pour l'atteindre dans l'immédiat.</p>\n<p>Votre premier objectif sera de trouver un moyen de survivre plus longtemps que les quelques heures d'oxygène qu'il vous reste à bord du vaisseau. L'exploration de cette planète à l'environnement hostile sera nécessaire pour espérer trouver les ressources indispensables à votre survie et à l'installation d'un premier avant-poste. </p>\n\n<p>Rendez-vous dans les Development logs (en dessous de téléchargement) pour en savoir plus sur l'avancée du développement et les fonctionnalités déjà implémentées.</p>\n<p>Suivez nous sur Facebook ou Twitter, on y poste des captures du jeu en développement et des news.</p>\n<p>Si vous voulez soutenir ce projet et les futurs, c'est par ici ❤.</p>", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-05-31T05:35:59", "background_image": "https://media.rawg.io/media/screenshots/053/05382825a40dc28eb759286b729a6138.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio de la Pie"], "genres": [], "publishers": [], "esrb_rating": null}