{"id": 323874, "slug": "the-scavenger", "name": "The Scavenger", "name_original": "The Scavenger", "description": "<p>Hi, i'm Sidnei and this is <strong>The Scavenger. </strong></p>\n\n<p>This is the first game that i'm developing on my on. I have only the first stage at the moment, but i'm working to make more stages on the game. </p>\n<p>This idea came with the goal to train my skills and having a complete game in my portfolio. </p>\n<p>The game is simple and have the base machanics of any shooter 2d.  There's one thing in this Project that i admit: i really like to write about the Scavenger conversations and the Orion onborad computer, it's funny how they treat each other.<br/></p>\n<p>This is the 1.0 version of the game, so there are still many things to do. I'm developing more things and i'm going to upload these things here gradually.</p>\n<p>If you are interested, follow the page and when the game has an update, you will know.</p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>Unzip the file and run the Space Conqueror aplication. </p>\n<p><strong>Commands:</strong></p>\n<p>Use the arrow keys or w/a/s/d to move the ship around the scene.</p>\n<p>Space to shoot. </p>\n<p><strong>PS: There's no limit screen yet, so be carefull to not go outside the câmera view!</strong></p><p><strong>PS2: I've don't add any sound yet to this Project :(</strong></p>\n<p>Comment on what you thing of the game or report a bug . </p>\n<p>:D </p>", "metacritic": null, "released": "2019-05-30", "tba": false, "updated": "2019-05-31T06:20:06", "background_image": "https://media.rawg.io/media/screenshots/a6b/a6bb6e562284cd94aa9bdd4b55bd044c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sidnei"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}