{"id": 324173, "slug": "disc-creatures", "name": "Disc Creatures", "name_original": "Disc Creatures", "description": "<p>Disc Creatures is a tribute to classic monster catching RPGs from the golden days of portable gaming. Choose your three starter creatures and set off as a licensed Disc Ranger (a DiscR!) to tame the greatest of creatures and bring peace to the land!<br />\nDisc Creatures is set in a world where humans live alongside a wildly varied cast of creatures, all with different personalities, abilities, and moral codes. Travel across a quaint, quirky landscape, taming creatures and helping those in need! Mysteries fill the land of Disc Creatures, and some are darker and more formidable than one might expect...</p>\n<p>A monster collecting RPG inspired by the classics and hand-crafted with a precise attention to detail and respect to elements that built up the entire genre.<br />\n200 creatures to collect and command in battle!<br />\nA huge cast of charming characters<br />\nEach creature has a unique skill tree containing moves that can be unlocked through growth and items!<br />\n20+ hours of gameplay!<br />\nA heart-warming chiptune soundtrack perfect for a trip down memory lane<br />\nLovingly designed all by a single Japanese indie creator, SATTO!<br />\nWhen I was a kid, I was really into games that had a lot of unique monsters. Monster-themed games came out one after another, and among these titles, a variety of interesting monsters were born. I was influenced by this and used to show off the monsters I thought up and drew on the edge of my notebook to my friends. Disc Creatures is a game I’ve made without forgetting the monsters that were born on the edge of that notebook. While searching for memories of games at that time, I made this game with a feeling of nostalgia myself. If you consider this is nostalgic as well, I ask you to play the game remembering a little about the old days.<br />\n-SATTO<br />\nHi all, this is Dan Stern of DANGEN Entertainment! I&#39;m happy to be helping PICORINNE SOFT release Disc Creatures on Steam. I have fond memories of playing games like it when I was younger. SATTO made the whole game solo, which is just astounding to me. Considering the amount of work that goes into making an RPG like this even if you have a whole team, it feels really great to see SATTO get this out to western fans. We&#39;re sure you&#39;ll love the game and the care that&#39;s gone into localizing it. Cheers!</p>", "metacritic": null, "released": "2019-10-17", "tba": false, "updated": "2020-02-07T21:22:30", "background_image": "https://media.rawg.io/media/screenshots/400/4009eb91cea2ecb1580f4a2d47471d6d.jpg", "website": "http://dangenentertainment.com/games/disc-creatures", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 33, "beaten": 2, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Picorinne Soft"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["DANGEN Entertainment"], "esrb_rating": null}