{"id": 324191, "slug": "time-travelling-navy-seal-ninja-warrior", "name": "Time Travelling Navy Seal Ninja Warrior", "name_original": "Time Travelling Navy Seal Ninja Warrior", "description": "Using the skills of a Navy Seal and the grace of a Ninja Warrior, travel through time to different eras to defeat the forces of evil! Unlock new weapons by being sneaky and merciful to avoid damaging the space time continuum. Or ignore that and kill everyone! You are free to progress through levels in anyway you want.<br/><br/>What to expect<br/>-Everything you see in the game is climbable. Use this to your advantage to find a good spot to survey the area, or get the drop on unsuspecting enemies below.<br/>-Complete a level with all enemies dead, or with just the targets dead to unlock a new weapon.<br/>-Brutally fair. When you die, you will have no one to blame but yourself.<br/>-A sense of humor. This game doesn't take itself too seriously.<br/>-An introduction to in-game movement. If you want to try more intense VR games, but suffer from motion sickness, this is a good place to start. The low poly art style, intuitive controls and short levels offer an ideal environment to get used to intense games.<br/><br/>At release, the game has 6 time periods + a tutorial level. More levels will be added for FREE after release.<br/><br/>To find out more, join the discord server and talk to other players and myself. https://discord.gg/qj5wFja", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:53", "background_image": "https://media.rawg.io/media/screenshots/f49/f49ed377771ab4598136230a1e2c13a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fletcher St-Germain"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Fletcher St-Germain"], "esrb_rating": null}