{"id": 324174, "slug": "smelter", "name": "Smelter", "name_original": "Smelter", "description": "<p>After the destruction of the Garden, Eve finds herself in an unfamiliar world and her beloved Adam is nowhere to be found. On her search for Adam, she encounters Smelter, an unusually over-confident, winged creature with the powerful ability to “Flootipoo” with others, giving them incredible powers.<br />\nOffering his apparently “invaluable” assistance, Smelter flootipoos with Eve and they depart on a journey to the treacherous Rumbly Lands to expand Smelter’s territory, allowing them to reach further into the various domains to find out what happened to her Adam, hoping to find him in one piece and find a way back home.<br />\nSmelter is a strategy, action-platformer combo inspired by some of the classics. On top of platformer with a variety of skills allowing players to combat against foes in their preferred style and adapt to situations, players can also enjoy top-down strategic gameplay complete with base building, unique events, exploration and upgrades.Key FeaturesUnique gameplay that combines side-scrolling platforming with top-down strategic gameplay.<br />\nIncredible, diverse worlds ranging from hellish to beautiful to unstable landscapes.<br />\nThree skill sets, complete with upgrades obtainable through multiple challenges, allowing for varied combat, movement and defense abilities.<br />\nThe “Smelt” ability which can be used both in combat and on objects to navigate through difficult terrain.<br />\nA variety of building types, upgrades, exciting events allowing players to take on an onslaught of enemies trying to overrun Smelter’s base.<br />\nHand-crafted, high quality pixel art.<br />\nMultiple bosses with their own back stores, large variety of enemies and challenging levels.<br />\nMeet characters ranging from eccentric to completely ridiculous.</p>", "metacritic": 74, "released": "2021-04-22", "tba": false, "updated": "2023-11-19T15:28:51", "background_image": "https://media.rawg.io/media/screenshots/80b/80bbd7e4c15e186771579fb1b4ce124a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 22, "beaten": 1, "toplay": 5}, "playtime": 1, "achievements_count": 109, "ratings_count": 1, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC"], "developers": ["X PLUS"], "genres": ["Action", "Adventure", "Strategy", "Simulation"], "publishers": ["DANGEN Entertainment"], "esrb_rating": null}