{"id": 324135, "slug": "stellar-survivor", "name": "Stellar Survivor", "name_original": "Stellar Survivor", "description": "<strong>Early Access note</strong><br/>Stellar Survivor is currently in early access which means frequent issues are to be expected. The game might contain bugs, work in progress art, or features not fully developed or balanced. As the development of Stellar Survivor continues we will address these issues and polish the game. <br/><br/><strong>What is this game about:</strong><br/>Build huge bases with traps like mines (to explode aliens), spike traps (to impale aliens), Tesla towers (to electrocute aliens), and many more. Freely place walls throughout the world to guide the enemies into those traps, but be careful, if the aliens don’t manage to get near you they will destroy everything you have build!<br/><br/>You can’t just sit back and relax after a few waves, you have to use the variety of weapons to manage enemies: headshot the weak ones, push back strong ones, explode others. Play together with your friends to increase your chances of surviving longer. But with more players come more enemies… How long can you survive?<br/><br/><strong>Key features:</strong><br/><ul><li>Explore the open world! <br/></li><li>Play with friends with drop-in drop-out multiplayer!<br/></li><li>Gather resources and build defences to prepare yourself for the waves of enemies that want you off their land!<br/></li><li>Fight 7 alien types each with their own behaviour including one extra bulky alien!<br/></li><li>5 different types of traps, turrets, and defensive structures. Place them strategically to kill as many aliens as possible!<br/></li><li>Realistic exoplanet environment!<br/></li><li>Destroy the enemies with 3 different weapons which all have their own advantages. Do you prefer blasting aliens with a  shotgun or pierce through multiple aliens with a sniper rifle?<br/><br/>At the end of June 2019, Stellar Survivor will fully release. Until then, you can enjoy Stellar Survivor while it's still in Early Access.<br/><br/>We hope you like what we have made thus far and we would love to know what you think!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:55", "background_image": "https://media.rawg.io/media/screenshots/69a/69aa78bd89213a1acc11d90bcbd452e5.jpg", "website": "https://stellarsurvivor.weebly.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sticks & Stones"], "genres": ["Action", "Strategy"], "publishers": ["Breda University of Applied Sciences", "Sticks & Stones"], "esrb_rating": null}