{"id": 324272, "slug": "stick-cricket-2", "name": "Stick Cricket 2", "name_original": "Stick Cricket 2", "description": "Hit out or get out in the follow-up to the world's most popular cricket game, Stick Cricket! <br/><br/>Easy to play yet hard to master, Stick Cricket 2 offers you the chance to:<br/><br/>LAUNCH YOUR CAREER<br/>From humble Origins in a local park, make a name for yourself on the club cricket circuit. Can you impress the selectors?<br/><br/>REPRESENT YOUR COUNTRY<br/>Live the dream! Travel the world playing International cricket for your country, facing the best bowlers on the planet. <br/><br/>DOMINATE THE WORLD<br/>Do you have what it takes to dominate the world? There's 30 trophies up for grabs in World Domination, with both red and white ball challenges for you to conquer. <br/><br/>PLAY INSANE SHOTS<br/>Thrill the paying - and baying - crowd with a raft of unorthodox strokeplay, including the Scoop, Ramp, Switch Hit and Helicopter shots. <br/><br/>CONQUER 90 LEVELS<br/>Overcome a raft of challenging new level types, including: Six Derby, Last Man Standing, No Dots, Survival, Time Attack and Consecutive Boundaries.<br/><br/>EARN GEAR &amp; OUTFITS<br/>Unlock a huge range of the latest and greatest bats, gloves and shoes to boost your performance. Alternatively, distract the bowler by donning one of ten novelty outfits.<br/><br/>TRACK YOUR STATS<br/>Look back at all the carnage you’ve caused! Log in to sync your stats, progress and unlocked items across multiple devices.<br/><br/>---<br/><br/>The sequel to a \"legendary\" title (Pocket-Lint), Stick Cricket 2 is truly a next-generation six-smashing experience - boasting 24 stadiums, 22 teams and more of the “hellishly addictive” gameplay (Gizmodo) millions have come to know and love.<br/><br/>Important message: This game includes In-App Purchases.", "metacritic": null, "released": "2015-03-11", "tba": false, "updated": "2019-10-22T14:32:11", "background_image": "https://media.rawg.io/media/screenshots/ae2/ae2a21930195c869e366fb9f3f51dc2f_FhW6i0C.jpg", "website": "http://www.sticksports.com/mobile/stick-cricket-2.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stick Sports"], "genres": ["Simulation", "Sports"], "publishers": ["Stick Sports"], "esrb_rating": "Everyone 10+"}