{"id": 324242, "slug": "casino-sportsbook", "name": "Casino & Sportsbook", "name_original": "Casino & Sportsbook", "description": "Are you tired of Casino apps that make you buy your chips via in-app purchase?  Quit spending your hard-earned money on fake chips.  31-in-1 Casino and Sportsbook gives you unlimited Casino chips without needing to buy more if you lose them all!<br/><br/>gApp Technology is proud to bring you the latest update for their flagship Casino app for the iPhone.  31-in-1 Casino and Sportsbook now has a brand new interface and a great new slot game.  <br/><br/>Use Your iPhone or iPod Touch to experience all the fun &amp; excitement of 31 classic Las Vegas casino games without ever losing a cent!   31-in-1 Casino offers authentic casino sounds, life-like animations, and a full cashier where you can control your chip count. <br/><br/>Try your luck, hone your skills and become an expert at the following action-packed casino games:<br/><br/><br/>Blackjack <br/>Faceup Blackjack <br/>Count Blackjack <br/>Plus Blackjack<br/>Perfect Pair Blackjack<br/>Roulette <br/>Craps <br/>Fishing Slots<br/>Baseball Slots<br/>Wild Slots<br/>Or Nothing Slots<br/>Lucky Spin Slots<br/>Sports Slots (5 Reel)<br/>Gold Rush Slots (5 Reel)<br/>Baccarat <br/>Jacks or Better Video Poker <br/>Deuces Wild Video Poker <br/>Jokers Wild Video Poker <br/>Tens or Better Video Poker<br/>Acey Deucey Video Poker<br/>Going For Fours Video Poker<br/>Caribbean Poker <br/>Texas Poker<br/>Sportsbook<br/>Keno<br/>Red Dog Poker<br/>Slot Farmer Slots<br/>Grocery Shopper Slots<br/>Casino Gold Slots<br/>Kitchen Heat Slots<br/>Rockin' &amp; Rollin' Slots<br/><br/>Immerse yourself in the atmosphere of a miniature Las Vegas casino without ever leaving your home or office with 29-in-1 Casino!", "metacritic": null, "released": "2008-09-27", "tba": false, "updated": "2019-10-22T14:31:42", "background_image": "https://media.rawg.io/media/screenshots/b47/b47eb5d07ac1720de48cc43c41845aa9.jpg", "website": "http://www.tljtek.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["gApp Technology"], "genres": ["Sports", "Card"], "publishers": ["gApp Technology"], "esrb_rating": "Teen"}