{"id": 324214, "slug": "slots-of-treasure", "name": "Slots of Treasure", "name_original": "Slots of Treasure", "description": "Get ready for the slots adventure of your life with this slot machine! Spin your way around the world in Slots of Treasure for free! There’s the perfect game for anyone—sail to riches in the Caribbean, take a safari to the African savannah, go deep into the jungle for a jackpot, or dive for deep sea riches! Don’t wait for hourly bonuses, reload whenever you want! Play today! <br/><br/>Check out the hottest slots action now:<br/><br/>- FREE INSTANT RELOADS: No need to wait for your free bonuses! Get more credits anytime for FREE!<br/>-FREE SPINS: Sit back and win big! Score the free spin bonus and let the winnings pile on!<br/>-Bonus Games: Use the scatters to unlock any of our 5 special bonus rounds!. <br/>-Locking Columns: Take control of your luck! Spend coins to lock a column if you like what you see.<br/>-Win Boosters: Add a multiplier to your win total Get boosters from our store or spin to win them!<br/>-Tournaments: Compete with friends for bragging rights! Spin the reels and win today!<br/>-Progressive Jackpots: Go for that mega win! Hit the Progressive Jackpot and be a slots god!<br/>-Game Center Leaderboards: Find out how you stack up against your friends, family, and the world!<br/>-Level up for even more fun! Unlock bigger bets, wins and jackpot multipliers<br/>-Check out our other casino apps, including blackjack, roulette, craps and poker.<br/>- One of the best Slot Machines in the App Store!<br/><br/>The FREE Fun Vegas Casino Experience on the go!  Don't forget to check our Slots and Slot Machine apps.", "metacritic": null, "released": "2014-07-25", "tba": false, "updated": "2019-10-22T14:31:25", "background_image": "https://media.rawg.io/media/screenshots/689/689746f0650af662aa7a3b04e9712e91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Avalinx"], "genres": [], "publishers": ["Avalinx"], "esrb_rating": "Teen"}