{"id": 324622, "slug": "renegade-escape-demo", "name": "Renegade Escape Demo", "name_original": "Renegade Escape Demo", "description": "<p>In the year 2068, while exploring a new planet, humanity discovered Luraden. Luminescent Radiographic Energy is a crystal that transmits energy wirelessly. After that discovery, humanity celebrated and revelled in it's own magnificence while we build our entire society around Luraden. For a little over a hundred years, all went well and humanity blossomed into a Type 1 civilisation. But the crystals didn't last forever, we knew they depleted, but we also knew that we had an entire planet full of them to use. What we didn't know was that we would use them all up so fast.</p>\n<p>Eventually Luraden became so scarce that we had to explore further into space to find new sources of Luraden. Luckily we found another planet with a similar crystal soon enough. 50 men and women were put aboard a spaceship and sent toward the planet we call Sikarra. Unfortunately, shortly after the crew went into hypersleep, the ship was attacked by an alien force trying to prevent humanity from reaching Sikarra. The aliens took over control of the ship and reprogrammed all MechDroids to do their bidding. Except for one, MonoTron, the little universal MechDroid. MonoTron was hit on the head during the jump to hyperspace and damaged his receiver. He is the only MechDroid on the ship that isn't under the aliens' control.</p>\n\n<p>You are MonoTron. You have to navigate your way through ship to get to the hypersleep room and wake up your captain, Edanor, from his sleep.</p>", "metacritic": null, "released": "2019-06-01", "tba": false, "updated": "2019-06-03T04:35:32", "background_image": "https://media.rawg.io/media/screenshots/d16/d163f1f216e5a65594a51f72844818bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Attic28"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}