{"id": 324772, "slug": "the-devils-womb-rpg-mv-horror-game", "name": "The Devil's Womb - RPG MV Horror Game", "name_original": "The Devil's Womb - RPG MV Horror Game", "description": "<p><strong>-ENGLISH:</strong></p>\n<p>First chapter of the saga, The Devil's Womb is a free \"Made in Italy\" classic puzzle adventure-horror title produced by Insane Kat Studio and made with RPG Maker MV.</p>\n<p>Part of the story is set during the World War ll, more precisely in Krakow.</p>\n<p>The protagonist, a girl named Franciszka Jung, is about to undergo the last psychiatric session before discharge. She suffered from various psychotic disorders in the past that led her parents to hospitalize her.<br/>After years of prayers and treatment, that day was the last day for Franciszka: the day before her death.</p>\n<p>Franciszka will completely lose the memories of what happened in those last days.</p>\n<p>In the meantime, a sweet demon without memories and without a past, named Luna, will wake up in a dark place before an ancient and abysmal evil.</p>\n<p>How did Luna end up there? Is there any way to get out?<br/>What mysteries are hidden among the inhabitants of that dark place?<br/>What does the mark that Luna bears on her forehead even mean?</p>\n<p>● Classic puzzle/RPG gameplay with a focus on the Horror genre, flavored with literature, poetry, friendship and tenderness.</p>\n<p>● Puzzles and challenging puzzles will test your logic and deduction skills.</p>\n<p>● 4 possible endings: Bad Ending, Neutral Ending, Good Ending and Secret Ending.</p>\n<p>● Full of digital computer-made illustrations by various Italian artists.<br/></p>\n<p><strong>The videogame developer activity is very hard, so if despite the periodical game-tests I've made, you'll find equally some bug, please report immediately to me: </strong><em>insanekatcompany@gmail.com<br/></em><br/>PLEASE REPORT ENGLISH TRANSLATION MISTAKES TOO!</p>\n<p><strong>-ITALIANO:</strong></p>\n<p>Primo capitolo della saga, The Devil's Womb è una classica avventura puzzle-horror \"Made in italy\" GRATIS</p>\n<p>prodotta dalla Insane Kat Studio e realizzata con RPG Maker MV.</p>\n<p>Parte storia si ambienta durante la Seconda Guerra mondiale, più precisamente a Cracovia.<br/>La protagonista, una bambina di nome Franciszka Jung, sta per essere sottoposta all'ultima seduta psichiatrica prima<br/>della dimissione. In passato ella aveva sofferto di diversi disturbi psicotici che spinsero i genitori a ricoverarla.</p>\n<p>Dopo anni di preghiere e cure, quel giorno fu l'ultimo giorno per Francizska, il giorno prima della sua morte.</p>\n<p>Franciszka perderà totalmente i ricordi di ciò che avvenne in quegli ultimi suoi giorni.<br/>Nel frattempo, non si sa dove, non si sa quando... Luna, una dolce demonietta senza passato e senza identità<br/>si sveglierà in un posto oscuro in cui vi alberga un male antico e abissale.</p>\n<p>● Classico gameplay da RPG puzzle-game a tematica Horror, condito da letteratura, poesia, amicizia e tenerezza.</p>\n<p>● Puzzle ed enigmi impegnativi metteranno alla prova le vostre capacità di logica e deduzione.</p>\n<p>● 4 finali possibili: Cattivo, Neutrale, Buono e Segreto.</p>\n<p>● Ricco di illustrazioni digitali fatte al computer da vari artisti italiani</p>\n<p><strong>Il lavoro dello sviluppatore è duro, perciò nel caso in cui ci fosse sfuggito qualche bug, segnalatecelo immediatamente:</strong> insanekatcompany@gmail.com<br/></p>", "metacritic": null, "released": "2019-06-01", "tba": false, "updated": "2019-06-03T05:12:04", "background_image": "https://media.rawg.io/media/screenshots/859/859698645d121dbde2db9aa68b4eee48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Insane Kat Games"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}