{"id": 32484, "slug": "the-sims-3-seasons", "name": "The Sims 3: Seasons", "name_original": "The Sims 3: Seasons", "description": "<p>Let your Sims swim in the ocean on a hot summer day, bob for apples in the autumn leaves, test their snowboarding skill on the half pipe, or welcome spring showers with a walk in the rain and a colorful umbrella. All-new activities, like soccer, and big seasonal festivals and celebrations bring the spirit of each season to life. Your Sims can pucker up at the kissing booth at the spring festival, or see what Halloween surprises await in the haunted house. Dress for the weather with seasonal fashions from wetsuits to raincoats and snow gear. With new foods, décor and weather effects, your Sims can enjoy the bounty and beauty of the ever-changing seasons and play with life like never before!<br />\nKey Features<br />\nDelight your Sims with new activities for every season: Whether building an intimate igloo, carving a scary Jack o’ lantern, taking a plunge off the diving board, or setting off all-new fireworks, your Sim can always find new things to do throughout the year.<br />\nJoin the fun with seasonal festivals: Sims can get in a snowball fight at the annual winter festival, get their faces painted at the summer festival, whoop it up at the spring dance, or bob for apples during the fall festival.<br />\nExperience the joy and challenge of changing weather: New weather effects and Sim reactions capture the power and beauty of nature! Sims can get a tan, be struck by lightning, or catch a cold!<br />\nBring the outdoors inside: Your Sim can now learn the recipe for pumpkin pie or style their home with new furniture and décor. There are a host of new items to ring in each season. Get a tanning booth in time for summer, or ring in the holiday spirit with house lights and decorations.<br />\nDress for the weather: Outfit your Sim in new styles for the season, including snow gear, wetsuits, raincoats and umbrellas, and new Halloween costumes!<br />\nWelcome mysterious visitors: New weather patterns aren’t the only things appearing in the sky! Befriend an alien visitor and use their UFO to abduct a neighbor, invade a community lot, or travel to the stars.<br />\nOnline Disclaimer<br />\nACCEPTANCE OF END USER LICENSE AGREEMENT AND LATEST THE SIMS 3 PATCH UPDATE REQUIRED TO PLAY. ACCESS TO ONLINE FEATURES AND/OR SERVICES INCLUDING SIMPOINTS AND DOWNLOADS REQUIRES AN INTERNET CONNECTION, EA ONLINE ACCOUNT AND GAME REGISTRATION WITH THE ENCLOSED SINGLE-USE SERIAL CODE. REGISTRATION IS LIMITED TO ONE EA ACCOUNT PER SERIAL CODE AND IS NON-TRANSFERABLE. EA ONLINE PRIVACY POLICY, TERMS OF SERVICE, AND FEATURE UPDATES CAN BE FOUND AT WWW.EA.COM. YOU MUST BE 13+ TO REGISTER FOR AN EA ACCOUNT. MAC USERS MUST UPDATE TO THE LATEST VERSION OF THE SIMS 3 LAUNCHER TO ACCESS ONLINE SERVICES, INCLUDING SIMPOINTS AND DOWNLOADS. INCLUDES SOFTWARE THAT COLLECTS DATA ONLINE NECESSARY TO PROVIDE AND ACTIVATE IN-GAME ADVERTISING FOR ALL THE SIMS 3 PRODUCTS PREVIOUSLY OR HEREAFTER INSTALLED. EA MAY RETIRE ONLINE SERVICES AFTER 30 DAYS NOTICE POSTED ON WWW.EA.COM/2/SERVICE-UPDATES. FACEBOOK FEATURE CAN BE DISCONTINUED AT ANY TIME WITH OR WITHOUT NOTICE.</p>", "metacritic": 73, "released": "2012-11-13", "tba": false, "updated": "2023-12-08T06:50:04", "background_image": "https://media.rawg.io/media/games/97f/97f0fe5c0619738420c9a455fc66c533.jpg", "website": "http://thesims.com/seasons/", "rating": 4.27, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 11, "beaten": 15, "toplay": 1, "dropped": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 15, "platforms": ["PC", "macOS"], "developers": ["The Sims Studio"], "genres": ["Strategy"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}