{"id": 324942, "slug": "skatebork", "name": "Skatebork", "name_original": "Skatebork", "description": "<p><strong><em>(Download links below!)</em></strong><br/></p>\r\nSKATEBOARDING DOG!\r\n<p>Do I have your attention? Good. Because in this game, YOU play as a skateboarding dog. You can roll about, perform sick flips after bouncing off of enemies, and play fetch by lobbing projectiles for miles to come. But most importantly, you have the power to be a VERY GOOD BOY.</p>\n\r\nYour Opponents\r\n<p>The boss of the local supermarket is up to some crazy and diabolical financial schemes, and you're the only one righteous and gnarly enough to take him down.</p>\n<p>He's not alone, though, <em><strong>Mr. Pigpen</strong></em> is sitting pretty on the rooftop and commanding his army of <em><strong>Trolley Boys</strong></em> to take you down from afar. They'll keep spawning in, and if you're not careful, they can overwhelm and surround you. Keep an eye on that minimap to cover your bases.</p>\n<p>Skateboards aren't good for climbing buildings, so you're going to have to turn this into a FURd person shooter and collect some ammo to toss up top. Maybe you can persuade the Trolley Boys for some free samples?</p>\n<p> <br/></p>\r\nKey Features\r\n<ul><li><em>Skate around,</em> make the MUTTst of your newfound mobility!</li><li>Throw food with your <em>PAWerful jaw!</em></li><li><em>Spin around in the air!</em> You'll be able to SHIBA whole parking lot from up there!</li><li>Make those pesky Trolley Boys <em>ROLL OVER!</em></li><li><em>RUFF up the competition</em> in this deeply un-pretentious metaphor for capitalism and corrupt CORGInisations!</li></ul>\n<p>You can do it all when you <em>live the PUG life </em>and can<em> unLEASH some sick grinds</em> in this <em>BARKcade game</em><em>!<br/></em></p>\n\r\nNote\r\n<p><strong>At the moment, the game is about 90% complete, but there are some assets missing for the antagonists. The game is still fully functional, however, and can be played to completion.</strong><br/></p>", "metacritic": null, "released": "2019-05-31", "tba": false, "updated": "2019-06-03T05:54:07", "background_image": "https://media.rawg.io/media/screenshots/3bd/3bd971bfc08d02d2d1391f8d220a7d63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["SpritersBlock", "koschei", "Brekkie"], "genres": ["Action"], "publishers": [], "esrb_rating": null}