{"id": 325054, "slug": "subs", "name": "SUBS", "name_original": "SUBS", "description": "SUBMARINES ARE FALLING OUT OF THE SKYLeap from the water, collect ammo and smash helicopters out of the air while front-flipping at 200 RPM. Purchase and equip unique and dangerous upgrades from the shop, and send your enemies some torpedoes (or lasers). Subs are falling from the sky and it’s up to you to destroy them. Put your reflexes to the test, using tight yet simple controls to dodge missiles, collect ammo and rack up kills. Verse a range of enemies and bosses and aim for highscore greatness.UPGRADES AND UNLOCKS GALOREFit your sub with powerful upgrades, causing chaos in the water and sky. With 22+ stackable items to purchase, turn your sub into the ultimate killing machine. Satisfy your grinding needs with 25 levels of unlockable content, featuring plenty of varied submarines, game modes, upgrades, and color palettes.CHUNKY EXPLOSIONS AND GROOVY JAMSThe rhythm and visual/audio feedback have been a major focus. Each explosion packs a bunch of particles and bits flying everywhere, the menus pop and each element on the game feels alive in a way. The original soundtrack dynamically changes between menus and gameplay situations, adding to each quick and rewarding run.2 PLAYER CO-OP ACTIONGrab a controller and put your teamwork to the test. With the entire game playable with a friend in drop-in, drop-out co-op, work together to level up and make debris of the enemy. Twice the players, twice the chance of being completely lost in all the carnage.ALL THE THINGS:<ul><li>23 distinctive and stackable upgrades from the shop to purchase and equip throughout your run</li></ul><ul><li>26 unlockable color palettes</li></ul><ul><li>6 unlockable and playable subs, each offering a different play-style</li></ul><ul><li>5 modes (regular, hard, support only, combo rush, and frenzy)</li></ul><ul><li>3 Randomized bosses, all really big and really angry</li></ul><ul><li>Controller support (keyboard and mouse recommended)</li></ul><ul><li>Local drop-in co-op to test all relationships</li></ul><ul><li>An original groovy retro soundtrack</li></ul><ul><li>UFOs?</li></ul><ul><li>Murder Noah on his Ark</li></ul><ul><li>An acceptable framerate</li></ul><ul><li>Mad flips</li></ul><ul><li>Graphics that will push your system to its limits</li></ul><br/>A game by Harrison de Voil, Steam artwork by Lauren Nevard<br/><br/>", "metacritic": null, "released": "2019-06-28", "tba": false, "updated": "2019-08-28T21:44:50", "background_image": "https://media.rawg.io/media/screenshots/f4f/f4f8e3f5604b6d3831daea71424c5363.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tropycl Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Tropycl Games"], "esrb_rating": null}