{"id": 325051, "slug": "code2040", "name": "CODE2040", "name_original": "CODE2040", "description": "<strong>A natural disaster took place at the 13-Layer Remains had unveiled the realm, namely The Outside, where abundant resources were at but  brimmed with uncertainties. You will act as a hired convict by R.D. company to eliminate all threats during the realm exploring operation. Reach the Inspection Tower in time, activate the Emergency Shuttle and fulfill your objectives.</strong><br/><br/>SOMA Ball, your best exploration partnerThe new mineral SOMA offers many battle aiding functions such as Shield for tanks, Scan for assassins and Medic for healers. Bringing you desired type of SOMA Ball decides your role in the team, allowing diversified combinations of strategies.<br/><br/><br/>Monsters in rampage, it is time to challenge your limit and show your gutsIt is not a rumor that people who had gone missing were taken away by monsters.<br/>You will encounter them while exploring The Outside. Do not hesitate, just load your weapons and fire at will! After killing them, you might also acquire...<br/><br/><br/>N.R.S.S counting down, every second matters for your survialThere will be no escape, N.R.S.S is installed on the neck of everyone. May you fail to reach your destination in time...5..4..3..2..1, BOOM! GAME OVER! Try putting in your best effort into completing your mission before the countdown ends!<br/><br/><br/>Emergency Shuttle, the only method of escapingThe final objective is to successfully escape The Outside realm, the monstrous killing is merely a measure in reaching your goal. You can eliminate all others and leave with the Emergency Shuttle at ease, or take the chance to launch the Shuttle while everyone else is busy killing each other, leaving them to die with full tragic faces.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:10:56", "background_image": "https://media.rawg.io/media/screenshots/31d/31d657b94f850cbd820ed5ed61a618f1.jpg", "website": "https://code2040.jfigames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JFI GAMES", "Team Weaver"], "genres": ["Massively Multiplayer"], "publishers": ["JFI GAMES"], "esrb_rating": null}