{"id": 325033, "slug": "wo-men-de-fang-wu-our-house", "name": "我们的房屋 OUR HOUSE", "name_original": "我们的房屋 OUR HOUSE", "description": "Battle <br/><strong> Players and Characters </strong><br/><br/>Players can control five roles in the same battlefield. Initially in our house, the first role uses pistols, the second role uses rifles, the third role uses submachine guns, the fourth role uses shotguns, and the fifth role uses sniper guns. You can assign the positions of each role. When the enemy attacked, you can switch roles, shoot at each corner. Colour can use grenades, close weapon daggers, as the battle escalates, you can choose five roles freely, with your favorite weapon role, occupy a good shooting position, to attack the enemy.In OUR HOUSE, we have radars, we can locate the enemy before it enters the field of vision, and we can use radio-controlled UAVs to shoot bomber guns or tanks to shoot bomber guns.<br/><br/><strong> Victory conditions </strong><br/><br/>In OUR HOUSE, use all available weapons in the battlefield to survive and destroy all enemies. The enemy's goal is to destroy your defense barrier. You must destroy the enemy in front of you as soon as possible to protect the defense barrier.<br/><strong> Battlefield </strong><br/><br/>In OUR HOUSE, you can fight in closed huts, in tight trenches, in ruins, in the basement of a magnificent military base, in the underground city, in the dense jungle, in the mysterious sea floor, and in the vast sky. In the battlefield, there are all kinds of supplies, you can supply medical treatment, or enhance personal ability.<br/><br/><strong> Enemy </strong><br/><br/>In OUR HOUSE, the enemy's army can be a shoulder-to-shoulder soldier, a steel monster tank, an air Iron Eagle aircraft, a naval fortress, a whale submarine, or a missile into the earth. Weapons <br/><strong> Firearms </strong><br/><br/>In OUR HOUSE, there are many weapons. Players can choose pistols with fast firing speed and small recoil, powerful automatic rifles, shotguns with large firing range, accurate sniper guns, machine guns with many bullets, and submachine guns with fast changing speed.<br/><br/><strong> Artillery </strong><br/><br/>In OUR HOUSE, there are many kinds of artillery weapons. Players can use penetrating rockets, long-range anti-aircraft guns, howitzers that easily bypass obstacles, chamber killers'sprayers, flashing signal bombs, and throwing grenades, smoke bombs, flashing bombs, as well as placeable mines, explosives.<br/><br/><strong> Close-in weapons </strong><br/><br/>In OUR HOUSE, anything can be a close weapon, daggers, clubs, wrenches, crowbars, axes, hammers, forks, batons, golf clubs, baseball bats, chainsaws can be seen everywhere.<br/><br/><strong> Driver </strong><br/><br/>In OUR HOUSE, there are vehicles for driving: military trucks, tanks, military cars, military motorcycles, unmanned aerial vehicle, ships, warships, submarines, missiles; and fixed tools: machine guns, mortars, turrets, bow and arrow towers.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:51", "background_image": "https://media.rawg.io/media/screenshots/513/513a283b2299b5d166b9eca25f65357c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OUR GAME"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["OUR GAME"], "esrb_rating": null}