{"id": 325008, "slug": "catch-the-head", "name": "Catch the Head", "name_original": "Catch the Head", "description": "Smithston town is on fire as new season is about to start and over the next six months your team will be part of it. Eight famous celebrities of the Underworld have meticulously crafted the stages you are about to explore. Activate the sigils to summon them, then hunt them down and catch them! Or what’s left of them as these talking heads have no bodies.<br/><ul><li>Action-platformer with puzzle elements.</li></ul>Combine your team's skills to fight enemies, pass deadly traps and solve riddles.<br/><ul><li>17 contestants.</li></ul>Pick three from a roster of seventeen participants. Each one represents the class of Brawlers, Rangers or Supporters.<br/><ul><li>24 diverse stages</li></ul>Throw your team in the rich world of the underworld. From factories, volcanoes and haunted buildings to medieval castles, ships and the skies above.<br/><ul><li>Three camera views.</li></ul>Third-Person, Top-Down or Sidescrolling, hunt the heads with style as our cameramen switch the view on every episode.<br/><ul><li>Over two hours of dialogues.</li></ul>Take a break between episodes.Explore the lore of the underworld by watching contestants speak to each other. Gossip, rumors and romance takes place as the game progresses.<br/><ul><li>Original soundtrack.</li></ul>Over two hours of music including tracks from the bands Red-Line, Mobthrow and 4 jazz songs featuring singer Emily Coy.", "metacritic": null, "released": "2019-08-30", "tba": false, "updated": "2019-08-28T21:44:52", "background_image": "https://media.rawg.io/media/screenshots/51b/51b32048e0e76e8ad57aeaf2f142d1e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Horos Interactive"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["IGE"], "esrb_rating": null}