{"id": 325110, "slug": "merge-fish-idle-tycoon-game", "name": "Merge Fish - Idle Tycoon Game", "name_original": "Merge Fish - Idle Tycoon Game", "description": "Click, Tap and Drag to Merge Fish. Upgrade Fish to Earn More Coins and Unlock New Fishes! Build your own fish island! Be a Merger Master! Be an Idle Fishing Tycoon! Be a Fish Expert!<br/><br/>Love fishes or a fish hobbyist already?<br/>Do you want to learn more fishes? <br/>Are you dreaming of being a Fishing Tycoon? <br/><br/>Don’t wait! Download the Merge Fish now! <br/>Start merging fish, become a Merger Master now!<br/>Will you be the next Idle Tycoon of fish merging!<br/><br/>Features:<br/>* Tap and drag to merge fishes, Merge Fishes will unlock new fish<br/>* Buy, Merge, and Manage your fishes to make them earn coins for you<br/>* Get Idle Money, Even when you are OFFLINE!<br/>* More than 30 different kinds of AMAZING fishes!<br/>* Various boosts to increase your profits! <br/>* EASY to play: Click, Tap, Drag, Merge and Earn coins!<br/>* Addictive and Stunning graphics<br/>* No WIFI needed!<br/><br/>Tips and Skills:<br/>* Keep merging fishes to unlock new fishes <br/>* New fish earns more coins<br/>* Don’t miss any chance to get free fishes <br/>* Use the boosts to increase your profits<br/>* Buy more fishes, merge more fishes, and product more coins!<br/><br/>Like Merge Fish - Tap Click Idle Tycoon on Facebook!<br/>https://www.facebook.com/MergeFishTycoon/<br/><br/>Have any questions or suggestions? Please feel free to contact us:<br/>dragonplusgames@gmail.com<br/><br/>With so much fun, Download Merge Fish right now! Become the BEST Fish Merger Tycoon Ever!<br/><br/>Notes:<br/>* Merge Fish supports various mobile devices<br/>* Merge Fish contains banner, interstitial, reward video ads<br/>* Merge Fish is free to play. But you can purchase virtual coins by IAP<br/><br/>Don’t forget to let us know if you can recognize ALL the fishes in Merge Fish.", "metacritic": null, "released": "2018-12-22", "tba": false, "updated": "2019-10-22T14:38:15", "background_image": "https://media.rawg.io/media/screenshots/054/05437231bcd0700ec9adeb9f5b259184.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DragonPlus"], "genres": ["Simulation"], "publishers": ["DragonPlus Game"], "esrb_rating": null}