{"id": 325185, "slug": "full-metal-monsters", "name": "FULL METAL MONSTERS", "name_original": "FULL METAL MONSTERS", "description": "Hey everyone!<br/>The game is still under active development. We carefully read all your comments and feedback to make sure every new update counts. Thanks for your support!<br/>FULL METAL MONSTERS is a mobile game like you've never seen before. Battle metal-plated monster dinos in a post-apocalyptic world! A synchronized 5x5 PvP action shooter with different modes! Control beasts on land or in the sky, fully mechanized, augmented or all-natural: the choice is yours!<br/>Tame and command dozens of blood-thirsty metal hunters ready to destroy anything in their paths to win!<br/><br/>Gameplay: <br/><br/>Unique setting! <br/>A harsh new world where only the strongest survive!<br/>Game mechanics galore <br/>Chew through enemies in melee attacks or strike from a distance, sabotage on the sly or hurl headlong into battle!<br/>Tons of different creatures<br/>Metal, all-natural or augmented: take your pick!<br/>Skills, skills, and more skills<br/>Every dino is unique and has its own abilities, including dashes, jumps, splatter stuns, regeneration and more.<br/>Land and air battles<br/>Sky battle fans rejoice! We've got flying dinos and more. Pick your battleground!<br/>A wealth of weapons<br/>Equip your dino with any weapon you want, from traditional guns to next-gen energy blasters!<br/><br/>The game has 3 main dino types, including: <br/><br/>1. Mechanized – AI machines devoid of any biological tissue and mercy. Specially equipped with an energy shield against weapons from the old world.<br/>Tyrannosaurus is at the top of the metal jungle food chain. He can jump from place to place with super speed and stun several enemies at once. Deadly in melee battles. One false move and the enemy is toast.<br/><br/>2. All-natural – Life is evolving in round 2 upon the ruins of the destroyed old world. Now monsters from the Jurassic Era are out to kill, not to live.<br/>Spinosaurus is an insatiable hunter killer. Dino butchers preying on lesser animals, spinosauri can hold their own in melee battle and against enemies with superior strength. Their jumps give them unmatched mobility, and their mighty roar can stun a whole group of enemies, leaving them open to deadly attacks.<br/><br/>3. Augmented – On the border of human and machine, they are the best of both worlds. Human intellect mixed with advanced tech form a deadly combination.<br/>Triceratops – You don't want to get in his way when he's charging. Triceratops are always on the hunt for their next victim. Their razor sharp horns are tough to dodge in melee battle, and these beasts can even restore their own health if they need to.  <br/><br/>FULL METAL MONSTERS is free to download and play, but some in-game elements are available for purchase. The game requires a stable internet connection. Mobile internet will do, but Wi-Fi is best.<br/><br/>Join our community:<br/>https://www.facebook.com/fullmetalmonsters/", "metacritic": null, "released": "2019-06-03", "tba": false, "updated": "2019-07-29T18:05:04", "background_image": "https://media.rawg.io/media/screenshots/926/9263d8d27121cbb5f07ef53e72412bd2.jpg", "website": "http://azurgames.com/en/contacts/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Azur Interactive Games"], "genres": ["Action", "Strategy"], "publishers": ["AZUR INTERACTIVE GAMES"], "esrb_rating": "Everyone 10+"}