{"id": 325174, "slug": "tap-pets-hotel-idle-slicker", "name": "Tap Pets Hotel - Idle Сlicker", "name_original": "Tap Pets Hotel - Idle Сlicker", "description": "Fill your pet hotel with cute creatures!<br/>Invite entertaining guests to stay, earn money and upgrade your hotel!<br/><br/>HERE IS WHY YOU SHOULD PLAY PETS HOTEL!<br/>Love pets? Want to build the most awesome pet hotel? In this idle management game, you will be breaking records in caring for cute animals like cats, dogs, guinea pigs, and racoons! Invite your friends as bloggers to visit your hotel, keep playing to discover more!<br/><br/>7 MORE 'WHYS' TO PLAY PETS HOTEL!<br/>---------------------------------<br/>- SIMPLE &amp; RELAXING - Tap and swipe to care for cute animals and grow your hotel!<br/>- ENDLESS GROWTH - Automate your hotel and earn continuously while you are away!<br/>- UNIQUE DEPARTURE - Take your guests home with a swipe to get their love and bonuses!<br/>- CANDY RAIN - Increase production by bathing pets in candies and amuse them with jukebox songs!<br/>- INVEST WISELY - Prove your strategy with smart decisions on when to upgrade and check out.<br/>- DEVELOPERS LOVE YOU - Mobgams have created their first game with amounts of gentle loving care put into it!<br/>- PLAY EVERYWHERE! - The world’s best idle hotel simulator is free to play regardless you are online or offline!<br/><br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/>We have the following subscription periods in our game:<br/><br/>1. Weekly Gold Membership offers a weekly subscription for $9.99 after a 3-day free trial. It unlocks 4x income speed from quick tapping, 2x idle income, +100% Hearts on departure and 45 crystals each 4 hours.<br/><br/>End of trial and subscription renewal<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes.<br/><br/>Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>Privacy Policy: http://www.mobgams.com/privacypolicy.html<br/>Terms of Service: http://www.mobgams.com/termsofservice.html", "metacritic": null, "released": "2017-12-18", "tba": false, "updated": "2019-10-22T14:38:35", "background_image": "https://media.rawg.io/media/screenshots/aba/aba13ea5903bb099426c7d78377a6c4f_k5PuQwu.jpg", "website": "http://petshotelgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ADQUANTUM"], "genres": ["Strategy", "Simulation"], "publishers": ["ADQUANTUM"], "esrb_rating": "Everyone 10+"}