{"id": 325176, "slug": "game-of-colors-coloring-ar", "name": "Game of Colors: Coloring & AR", "name_original": "Game of Colors: Coloring & AR", "description": "First coloring game with a full-scale AR mode! Paint cats, other animals, patterns, mandalas, flowers and thousands of other images in Ultra HD quality.  Unleash your creative potential with the full spectrum color picker (17+ million colors) and an ultimate set of tools. <br/><br/>What makes Game of Colors special?<br/><br/>- AR mode. Game of Colors is the first coloring app where you can use a full range of painting tools in AR.<br/>- Unparalleled set of tools. Game of Colors is the most advanced coloring app yet – you can utilize a full spectrum of features to make the painting unique.<br/>- Premium experience for free. Quality experience with no ads for every user. The app is free, with additional content available on a monthly subscription basis. And it’s much more affordable than in other coloring apps – just $4.99 a month.<br/>- Art for everyone. The app features image categories for everyone: animals, flowers, food, fashion, kids pictures and many more!<br/><br/>AR MODE<br/>Game of Colors is the first coloring app where all the main tools are available in AR mode. Place your picture on a wall or a table and paint it in AR! And your friends or family can join you to paint and color together!<br/><br/>ULTIMATE TOOLS<br/>17+ million colors with the full spectrum color picker plus an ultimate set of tools: vertical, horizontal and beautiful radial gradient paint modes, plain color and texture paint mode. <br/><br/>And that’s not all! you can use filters similar to your favorite camera app, add a texture overlay (put your art on a wooden, stone or paper surface etc.) and even launch a jigsaw paint mode where you’ll reveal a picture piece by piece. <br/><br/>TOP QUALITY<br/>App quality is a top priority for us. Long hours were put into streamlining the design and user experience, optimizing the app for the best performance and making sure that each stroke of your paintbrush will be ideal.<br/><br/>IN-APP PURCHASE:<br/>You can be a premium user through an auto-renewing subscription.<br/><br/>Monthly: $4.99<br/>Half-yearly: $19.99<br/><br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period;<br/>- An account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal;<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings;<br/>- No cancellation of the current subscription is allowed during active subscription period;<br/><br/>Enjoy Game of Colors and we are waiting for your feedback.<br/><br/>The privacy policy can be found here: <br/>https://gameofcolors.ru/privacy/policy.txt<br/><br/>FOLLOW US ON SOCIAL NETWORKS:<br/>Instagram: https://www.instagram.com/gameofcolors_ar/<br/>Twitter: https://twitter.com/GameofColors1<br/>Facebook: https://www.facebook.com/gameofcolorsapp/", "metacritic": null, "released": "2019-01-02", "tba": false, "updated": "2019-10-22T14:38:35", "background_image": "https://media.rawg.io/media/screenshots/45d/45d427f9ff8a7e8419172cb05a18f50a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ADQUANTUM"], "genres": ["Board Games", "Family"], "publishers": ["ADQUANTUM"], "esrb_rating": "Everyone 10+"}