{"id": 325170, "slug": "tank-marshal-battle-king", "name": "Tank Marshal: Battle King", "name_original": "Tank Marshal: Battle King", "description": "Tank Marshal: Battle King is a strategy game takes modern warfare as background and tank troop as theme. On this burning battlefield you will hold a armored force and make it to the world's most advanced armor legion gradually. Pioneer territory and defeat enemies with your alliance members to set up a prosperous empire. Invincible panzer corps is ready, let tanks of the muzzle and the buzzing up!<br/><br/>FEATURES:<br/>- Sense of identification.<br/>In the game you should be the military leader to lead the development and distribution of your armor legion, meanwhile you should communicate with other players on the world map and battle with the enemies or find your allies. All the above experiences will help you feel the power of military leader.<br/>- Various developing routes.<br/>In the game the way of improving power is absolutely increase the power of armor legion, by upgrading tanks' levels or equipping them advanced equipments, or by using buffs. All these actions need you develop your base economy, improve resource reserve. Trading and plunder are both your developing routes.<br/>- Totally new game-play.<br/>Various familiar advanced armor legion and in-game music will make the game more easy for you and we will make the game-play more easy to offer you better experience.<br/>- New powerful weapon.<br/>In the game you will not only experience the communication and competition of different empires, but also can take your own resource points and get more benefit. The resources will help you produce more powerful rocket, self-propelled gun and the legendary apocalypse tank.<br/>- Protean strategy.<br/>Simple battle form also need wise command from the leader and different battle array formed by carious weapons, also the various buffs will make you more powerful on the battlefield.", "metacritic": null, "released": "2017-03-06", "tba": false, "updated": "2019-07-29T20:18:32", "background_image": "https://media.rawg.io/media/screenshots/77d/77da3ffd47917c2fc117ad419784e626.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Joyfort"], "genres": ["RPG", "Strategy"], "publishers": ["Joyfort Entertainment"], "esrb_rating": null}