{"id": 325219, "slug": "crime-city-gangster-3d-shooter", "name": "Crime City Gangster 3d shooter", "name_original": "Crime City Gangster 3d shooter", "description": "Rage, excitement, weapons, driving and fighting packed in a great shooting game<br/>Welcome to Crime City Gangster 3d shooter! The versatile 3d shooter that has the features of the best shooting games, fighting games and car racing games. It is a pure combination of makes this world exciting and interesting. <br/>3D SHOOTING WITH MISSIONS<br/>Get ready to become more powerful and capture new areas.  This all start when we are on a dangerous new trip through the city in San Andreas and ready for the street fight! Action, action and action! Show that you can cope with the missions and shooting.<br/>CRAZY AND SCARY STORYLINE<br/>Crime is everywhere on the streets. There are scary gangsters and talks about the darkness and craziness in the town. You go and grab different vehicles and weapons to complete your mission in one of the most exciting 3d shooting games. <br/>FIGHTING GAMES WITH DIFFERENT WEAPONS AND VEHICLES<br/>There is a deficit the cops and run away from the police. A lot of racing and madness on streets, shooting down the gangster of opposite gang. As this is one of those free fighting games with lots of intensity, you need to show your fighting skills and destroy your opponents.<br/>DRIVING MASTER<br/>Besides the need for fighting and shooting, you need to show great car games skills. It is one of those car racing games that will require lots of drifting and car damaging. Just pick your vehicle and conquer the city!<br/>Crime City Gangster 3d shooter GAME FEATURES:<br/>- Combo of a shooting, fighting, racing!<br/>- awesome 3D graphics and touch controls<br/>- Different missions and possibilities <br/>- Many different choice of weapons and vehicles<br/>Show the city who is the master. Use the weapons and vehicles to do that effectively. Become the master in this outstanding action game!", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2019-10-22T14:38:44", "background_image": "https://media.rawg.io/media/screenshots/201/2018a8b0799c61965cbd2f4e9deb3b35_Lj1VcHr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kinner patel"], "genres": ["Action"], "publishers": ["kinner patel"], "esrb_rating": "Mature"}