{"id": 325217, "slug": "physics-flip-diving-stunt-3d", "name": "Physics Flip Diving Stunt 3D", "name_original": "Physics Flip Diving Stunt 3D", "description": "Physics Flip Diving Stunt 3D allows you have feel of diving from top of mountain in water on some isolated water island. The flip diving game is realistic and with amazing physics. You will feel amazing with every second playing it. Just several timely taps and you’ll be able to experience scuba diving games physics right on your phone.<br/>AMAZING DIVING GAME<br/>Our diving game is really fun and entertaining. We made sure the divers have realistic scuba diving games movements and the stunt dive is as real as possible. The stunt dive gave is located around the globe on areas where there is water for skydiving. <br/>EXTREME DIVING<br/>Try to roll out the diver as much as possible. Watch out to nt fall on your back or stomach. Still maintain a good form when doing this extreme diving. It will be hard, but with the right skills you can make some stunning dives. <br/>REALISTIC 3D GRAPHICS<br/>The graphics in the Physics Flip Diving Stunt 3D is one of the best you will ever see for this type of game. The water, the movements, the body and the whole appearance of the diver are just amazing. Just try different divers and environments and you’ll every second of the diving.<br/>PHYSICS FLIP DIVING STUNT 3D FEATURES:<br/>- amazing graphics and diving movements<br/>- realistic physics diving<br/>- upbeat game<br/>- vivid extreme diving conditions<br/>- cliff jumping and diving game<br/>- different difficulty levels<br/>**************************************<br/>Become a diver into one of the most interesting sports games.<br/>Enjoy a diving game with stunning graphics!<br/>Hope you love it download for free and enjoy the game.", "metacritic": null, "released": "2016-10-21", "tba": false, "updated": "2019-10-22T14:38:44", "background_image": "https://media.rawg.io/media/screenshots/310/31002df2a5642d5f532d060cc2b40b1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kinner patel"], "genres": ["Simulation"], "publishers": ["kinner patel"], "esrb_rating": "Everyone 10+"}