{"id": 325223, "slug": "forklift-simulator-warehouse-game", "name": "Forklift Simulator Warehouse Game", "name_original": "Forklift Simulator Warehouse Game", "description": "In a search for forklift games? Try forklift simulator in a real warehouse<br/>Up for a real forklift gaming experience? We worked really hard and thoroughly to enable you great forklift simulator realistic graphics in one of the best forklift games we’ve ever made. We are known for the great truck simulator games, but with forklift truck simulator we wanted to add one for the real warehouse experience. <br/><br/>REAL WAREHOUSE EXPERIENCE<br/>Not only that you need to ride the forklift, you need to manually move boxes like in a real warehouse. Be careful in how you manage the forklift, you can cause different problems in this realistic experience.<br/> <br/>FULL CONTROL<br/>In one of the most trilling warehouse and logistics simulator, you will have full control over the forklift. That is why we can proudly say that this is one of the best forklift games online. All you need to do is show that you have the skills and orientation to ride the forklift.<br/><br/>STUNNING GRAPHICS<br/>The graphics is one of the best things and is making this simulator one of the best forklift truck games. If you are in a search for free forklift games you will rarely find a better and more realistic experience.<br/><br/>ENJOY THE FREE RIDE<br/>We make forklift games free that are practically full-featured and are paid on other developer’s pages. Enjoy the game as one of the best free forklift games available on mobile devices currently. Forklift games loading tracks inspired that are this good are really rare. <br/><br/>FORKLIFT SIMULATOR WAREHOUSE FEATURES:<br/>- realistic forklift simulator<br/>- real warehouse conditions<br/>- amazing HD graphics<br/>- great controls over the vehicle<br/>- 100% free forklift simulator game<br/>See why we are one of the best simulator game developers. Enjoy this real warehouse experience in the stunning forklift!", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-10-22T14:38:45", "background_image": "https://media.rawg.io/media/screenshots/1dd/1dd45e21d0f68ee876763c8bd1c79daf_KqwfuU7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kinner patel"], "genres": ["Simulation"], "publishers": ["kinner patel"], "esrb_rating": "Everyone 10+"}