{"id": 325233, "slug": "new-york-fashion-model", "name": "New York Fashion Model", "name_original": "New York Fashion Model", "description": "Looking for cool and entertaining makeup games inspired by fashion, dress up and makeover? Look no further. Make your girl one of the most trendy and beautiful girls in New York City. <br/>Feel like is to work in the New York fashion industry in one of the most fresh, feature-rich and creative fashion games.<br/>*Complete MAKEOVER*<br/>Take the girls, hair and clothes and do your own fashion makeover. This is more than just girls makeup games for girls. You need to take care of the FULL styling! <br/>You need to do your own makeover and completely adjust the look of the girls in your own style!  Hair change is needed as this is another of the great styling games. Be sure to make complete hair makeover to make the model you select one of the most beautiful!<br/>*Creativity in Makeover NEEDED*<br/>Although it has features of girls makeup games, creativity is needed in all aspects. This is not just a makeup game, but moreover you’ll be able to fully dress the girls! <br/>That is why we’ll say that this is a cool, New York inspired, makeover games for girls.<br/>*Dress UP with STYLE*<br/>We’ve included tons of various colorful wardrobe. You need to pick the ones that suit your style and thinking about how one girl should look like. <br/>With Fashion Girl Dress up New York, Android got another great option for dress up games for girls.<br/>**Fashion Girl Dress up New York FEATURES**<br/>- Great makeup and makeover options<br/>- Lovely dresses and hair styles<br/>- Various different coloring options<br/>- New York Inspired<br/>- One of the most versatile makeover girl games<br/>*Make it as FASHION QUEEN IN NEW YORK*<br/>Show your style and skills. Work for fashion industry in New York. See why this is a great dress up game supporting New York fashion models", "metacritic": null, "released": "2016-09-17", "tba": false, "updated": "2019-10-22T14:38:45", "background_image": "https://media.rawg.io/media/screenshots/735/735909f4f0f56aec93c89b28f959dbc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kinner patel"], "genres": ["Family"], "publishers": ["kinner patel"], "esrb_rating": "Everyone 10+"}