{"id": 325316, "slug": "pitcherstats", "name": "pitcherStats", "name_original": "pitcherStats", "description": "Ask any coach what they look for in a good pitcher and the first thing they always say, \"They must throw strikes.\"  pitcherStats is a training tool that allows coaches and parents the ability to track pitching performance. pitcherStats is the app you need.<br/> <br/>This application was developed because of the increasing importance and popularity of charting pitches. From the Big Leagues to Little League, coaches and parents count the number of pitches thrown during every game and each bullpen session.  Most leagues even have strict pitch counts that each pitcher must adhere to on a game-to-game basis.  While knowing how many pitches your pitcher threw is important, knowing where these pitches are being thrown is vital in measuring your pitchers progress.  This, along with many other features, is what separates this application from all other training tools developed for pitchers.<br/> <br/>Spend more time improving your pitcher's accuracy and consistency and less time recording data. pitcherStats is flexible to facilitate any situation; game or training. It can be used as a training aid from Little League to Big League for softball and baseball.<br/> <br/>pitcherStats is a training aid developed to help pitchers record the location of their pitches during a game and a bullpen/training session. The data compiled will help coaches spot the tendencies of their entire pitching staff along with their strengths and weaknesses in locating up to four pitch types (fastball, change-up, slider and curveball).  pitcherStats also gives parents the ability to record pitches in real time and compare the results with past performances as a way to objectively track the progress of one of the games biggest challenges--throwing strikes!<br/> <br/>Overview:<br/> <br/>Use pitcherStats intuitive user interface to capture pitcher information, total pitches, strikes, balls, pitch type, and the location of each pitch in 12 different zones. The real time stats will help you identify opportunities for improving pitcher performance.<br/> <br/>Endorsements:<br/> <br/>Richard Cronin, Parent of a 12 year old pitcher; \"What I liked most about pitcherStats was that it was easy to use and understand, and it provided objective data in evaluating my son's progress on a lesson-by-lesson basis.  I could look back on three training sessions and see his improvement in locating his fastball and change-up.  In the spring, I will definitely be recording every pitch that he throws in a game.\"<br/> <br/>Features:<br/> <br/>- Customize pitcher name and session information or each situation<br/>- Manage up to 5 pitchers<br/>- Track performance to last 5 sessions for each pitcher<br/>- Record pitches in 12 different zones<br/>- Record 4 pitch types (fastball, curveball, slider, change-up)<br/>- Instant performance feedback after each pitch<br/>- Start where you left off on exit or interruption<br/>- Save each session/screen snapshot to your photo album<br/>- Flexible to facilitate any situation; game or training<br/> <br/>Statistics:<br/> <br/>- Total pitches<br/>- Total strikes<br/>- % strikes<br/>- pitch count/% by zone and pitch type<br/>- pitch count summary by pitch type<br/>- track performance to previous 5 sessions <br/> <br/>User interface:<br/> <br/>- manage pitchers via “Pitchers” tab<br/>- input data via “playBall” tab<br/>- view pitch accuracy &amp; consistency via “Zone” tab<br/>- view pitch performance via “Summary” tab<br/>- customize pitcher info<br/>- customize session comment information<br/>- track all pitches<br/>- audio &amp; visual feedback<br/>- screen capture of stats<br/>- recall last session upon program start<br/>- records current date<br/> <br/>If you need more flexibility or features please look at our Pro version, pitcherStatsPro.<br/> <br/>Background picture courtesy of Dave Nelson at www.flickr.com.<br/> <br/>If you have any ideas that would make this a better tool please contact us at support@irightbraingroup.com.", "metacritic": null, "released": "2010-01-07", "tba": false, "updated": "2019-10-22T14:38:49", "background_image": "https://media.rawg.io/media/screenshots/aaf/aaf752c84ae8cea4510084834644a70e.jpg", "website": "http://irightbraingroup.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Right Brain Group"], "genres": ["Action", "Sports"], "publishers": ["Right Brain Group"], "esrb_rating": "Everyone 10+"}