{"id": 325378, "slug": "dungeon-flipper", "name": "Dungeon Flipper", "name_original": "Dungeon Flipper", "description": "<p><strong>THE PITCH</strong></p>\n<p>Dungeon Flipper is an action packed game that's all about killing monsters, decorating homes, and getting rich. If you enjoy classic dungeon crawler combat or love to decorate spaces and show off your style, then Dungeon Flipper is the game for you.</p>\n<p><strong>THE PLOT</strong></p>\n<p>You are the cheery adventurer, a dungeon crawler and interior decorator renowned for your skill in the kingdom you call home. This kingdom lies on a pleasant but small island, and as its population grows, its people find themselves running out of space. The housing shortage has weighed heavily on the king's mind as of late, and while he has been exploring all manner of potential solutions,  none have served him well. However, in a moment of unconventional brilliance, he has decided to pursue one last desperate course of action: converting the island's many seemingly abandoned ruins into living spaces. The problem? It turns out that in addition to being sparsely but hideously decorated, the ruins aren't so abandoned after all, and are in fact infested with monsters and dangerous traps. This, adventurer, is where you come in...</p>\n<p><strong>THE PROOF</strong></p>\n<ul><li> Explore a variety of dungeons and defeat the monsters within.</li></ul>\n\n<ul><li> Clean up cleared dungeons, decorate them to fit your unique personal style, then sell them on the home market.</li></ul>\n\n<ul><li>Reap the rewards and stop by the shop to pick up gear upgrades and furnishings for the next run.</li></ul>\n<br/>", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2019-06-07T12:54:01", "background_image": "https://media.rawg.io/media/screenshots/114/114c260337ad4df60047a43b9f96e3c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HHS VGDDC"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}