{"id": 325355, "slug": "tales-of-jayvin", "name": "Tales of Jayvin", "name_original": "Tales of Jayvin", "description": "<p>Greetings.</p>\n<p>This game is under the label \"J-Soft Entertainment\".<br/>However, for the purposes of this game, and the fact that I didn't work on this alone, myself and my dear friend came up with the name \"SPAMFASTIC STUDIOS\".</p>\n<p>At the outset we approached the project with the intention of producing a fairly basic Role Playing Game, with the emphasis on defeating various creatures in battle. Now, nearly four years in the making, our game has developed into a far more ambitious RPG/Adventure/Puzzle Solving game and has surpassed our earlier expectations.</p>\n<p>The end product is something quite different to what we first imagined. There are quests to undertake for various individuals that Jayvin will meet in his journey, a leveling system for Jayvin and his creatures, Various skills to use in battles, inventory items, quest book and the list goes on but I don't want to spoil too much, here. Let's just say that it is nothing like when we first started. Oh, and I suppose I should mention... There are two different endings.</p>\r\nThe Story:\r\n<p>Jayvin an unlikely hero, if every there was one, stumbles into a portal and finds himself in the land of Naturnum. Unbeknown to him, his arrival has been expected. Evil forces, commanded by the Dark Lord, Arachemon, are wreaking havoc across the Universe. Only Jayvin has the power to fight these forces and put an end to Arachemon's reign of terror.</p>\r\nControls:\r\n<p>Keyboard or Game-pad.<br/>Game-Pad controls are \"re-definable\" within the game menu.<br/>Keyboard controls, unfortunately, are not \"re-definable\".</p>\n<p>Note:<br/>If you play with a Game-pad and save your game then next time you play you must have the Game-pad connected in order to continue your saved game.<br/>If you try to continue your saved game with no Game-pad the game will crash.<br/>Unfortunately this is something that we could never cure.</p>\r\nCredits:\r\n<p>Vincent Cortese - Game concept and Programming.<br/>RetroJay - All in game art, programming, graphics and sound effects.<br/>Barbwire - Dialogs, stories, poems and additional game ideas.<br/>RetroLee - \"One\" story, additional game ideas and sound effects.<br/>Daniel Kobylarz- All in game music. (except for \"Binocular Room\".)</p>\n<p>\"Tales of Jayvin\" original soundtrack is out now on...<br/>Spotify / Amazon / itunes / Pandora / Tidal / YouTube.</p>\r\nSpecial thanks to:\r\n<p>Chris Jones and Adventure Game Studio.<br/>Edmundo Ruiz - Tween Module<br/>Snarky - Day/Night Cycle<br/>Jerakeen - Particle System Manager<br/>SSH &amp; Dusk - EpicShadow<br/>Steve McCrea - Lake Module<br/>Khris - SmoothScrolling, Keyboard Movement<br/>Wyz - Joystick and game controller plugin</p>\n<p>Binocular room music...<br/>\"Relent\" Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2019-06-07T12:53:17", "background_image": "https://media.rawg.io/media/screenshots/e48/e48f195135a4a4036d991cd97bb1f0dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["J-Soft"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}