{"id": 325436, "slug": "memory-metamorphosis-v20-goty-edition-knuckles", "name": "Memory Metamorphosis v2.0 - GOTY edition & Knuckles", "name_original": "Memory Metamorphosis v2.0 - GOTY edition & Knuckles", "description": "<p>Ceci est un petit projet pour la game jam \"pot-au-jeu\" d'At0mium.</p>\n<p>Le jeu est fait sous GB Studio, donc la rom compatible Game Boy est également fournie.\n</p>\n<p><strong>IMPORTANT :</strong>\n</p>\n<p><em>Continuez de jouer après la \"fin\" qui arrive très rapidement... Enfin, c'est juste un conseil...</em></p>\n<p>La plupart des éléments un poil différents du fond possèdent des éléments d’interaction.<br/></p>\n<p>Par ailleurs, le jeu vous préviendra quand il sera fini, don't worry, be happy, enjoy the game-y (même s'il y a un easter egg post game rien que pour vous &lt;3).</p>\n<p><strong>HISTOIRE :</strong>\n</p>\n<p>Une jeune fille nommée Akari entend parler d'un monde existant au-delà des tréfonds d'un gouffre... Elle décide de s'y aventurer et découvre une dimension de prime-abord normale qui tente d'assimiler Akari et les idées qui façonnent son monde.\r\n</p>\n<p><strong>CONTRÔLES :\r\n</strong></p>\n<p>se déplacer -&gt;   flèches directionnelles\r\n</p>\n<p>Interagir      -&gt;   Z</p>\n<p><strong>Pourquoi pas de musique?</strong></p>\n<p>GB Studio nécessite des fichiers .MOD et les outils de création de musique proposés (openmtl, etc.) sont des outils que je ne sais pas très bien utiliser, surtout au niveau de l'accord des samples entre eux. Il me semble que c'est assez similaire à FamiTracker.</p>\n<p>Pareil pour les sons, je devrais utiliser openmtl, mais là, c'est plus un manque d'inspiration et d'idées...</p>\n<p><strong>\r\nAssets utilisés:</strong></p>\n<p>Les assets tiers utilisés sont les bulles, interface de texte et curseur de choix. Tous ces éléments sont libre de droits et fournis avec l'installation de GB Studio.</p>\n<p>Tous les autres éléments ont été réalisés durant la période de 60h imposée (même si c'était principalement le dimanche parce que j'ai dormi samedi).\r\n</p>\n<p><em>-Deadkat</em></p>", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2019-06-07T13:40:02", "background_image": "https://media.rawg.io/media/screenshots/207/20739a9a03376e691448a1718e547fe4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["deadkat"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}