{"id": 325668, "slug": "protagonest", "name": "ProtagoNest", "name_original": "ProtagoNest", "description": "Controls:\r\n<ul><li>Enter: Press the main button (the one that switches state all the time).</li><li>Up Arrow: Add 5 seconds to time limit (menu only).</li><li>Down Arrow: Subtract 5 seconds from time limit (menu only).</li></ul>\r\nFeatures:\r\n<ul><li><strong>Make judgement calls about</strong> whether people you don't know get to be <strong>video game protagonists</strong> or not.</li><li>Read about A LOT of <strong>different people</strong> that are passing through their info for your judgement (like... we're talking <strong><em>over 90 </em></strong><em><strong>million combinations</strong></em>).</li><li>Use some <strong>seriously broken</strong> and <strong>definitely non-OSHA compliant equipment </strong>to do your job.</li><li><strong>Challenge</strong> yourself to <strong>not get fired</strong>, and <strong>get paid a pitiful amount</strong> even when you manage to keep your job.</li><li><strong>Be a gatekeeper</strong> that I hate with every ounce of my being. <strong>I have a deep hatred for gatekeepers.</strong></li></ul>\r\nDescription:\r\n<p>You are an employee of ProtagoNest.</p>\n<p>ProtagoNest are the kind of employer you would never want to work for, because their fundamental reason for existing is to be as absolutely awful as possible. They have hired you to help them gate-keep who gets to be a video game protagonist. Apparently, they decided people should need to fill out forms saying their name, their desired occupation in their game, and why that occupation's a good fit. Who cares that some may want to add a bit of spice into their life by trying something new? Who cares that paperwork is really easy to mess up in minor ways? Who cares that even when the paperwork <em>is</em> right, sometimes the person in charge of writing up the license requests just decides they're not in the mood to do their job correctly? And who cares about diversity, am I right?</p>\n<p>...ANYWAYS, today you've been given FIFTY people to sort through, for an absolute pittance of pay, considering the stress it induces and the whole \"minimum wage\" thing. Yaaaaay.</p>\n<p>But you see, ProtagoNest's BOUNTIFUL awfulness doesn't even stop there. Oh, no, that'd be too easy. Not only are you getting awful pay to be an awful person, but your equipment is ALSO a heaving pile of... awfulness. The last, now-ex employee to sit at your desk got <em>so</em> overly enthusiastic when denying people that they broke the denial button. Why are they an ex-employee? Because ProtagoNest were SO happy with their work that they got PROMOTED! They went from employ-<strong>ee</strong> to employ-<strong>er</strong>! And did that button get replaced? <strong>NOPE!</strong> It's just been hot-wired to the approval button! Which means that you have ONE button trying to do TWO POLAR-OPPOSITE JOBS! So you need to keep an eye on what state that button is in when you're making your judgements, 'cause do the wrong thing even ONCE and you are very thoroughly fired. The only thing you've got going for you on that front is that it changes states kind of rhythmically.</p>\n<p>But wait, wait, wait! There's <strong>MORE</strong>! Not ONLY are you getting awful pay and awful equipment to do an awful job, but your boss has ALSO enforced a TEN SECOND TIME LIMIT to sort each individual person! WOW! What an AWFUL BOSS! This honestly can't be legal, making you work under such awful conditions. You should file a formal complaint, or start some strike action, or dismantle capitalism, or assassinate your boss, or unionise, or something. Y'know, just spit-balling ideas here...</p>\n<p>Is it obvious I really hate your employer yet? Because I do. With all of my soul, I hate ProtagoNest and everything they stand for. But... I know, I know, you have to do your job right and get paid to be able to put food on the table, and that means putting up with the awful working conditions, and denying people that may not really deserve it. Just... no matter what happens, please don't forget that the people you're sorting are... well, people. Please. This world needs more genuine care in it, and clear as day we can see that the \"care\" isn't going to come from your seriously awful employer. </p>", "metacritic": null, "released": "2019-06-04", "tba": false, "updated": "2019-08-28T23:16:04", "background_image": "https://media.rawg.io/media/screenshots/61a/61a31ede9e807aeafc936b316d8f06a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jordan Han"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}