{"id": 325636, "slug": "highway-hot-pursuit-3", "name": "Highway Hot Pursuit 3", "name_original": "Highway Hot Pursuit 3", "description": "How to play\r\n<p>Use <strong>WASD</strong> or the <strong>Arrow Keys</strong> to move your car around.</p>\n<p>The speed at which the car moves towards each direction depends on the car you choose at the start screen.</p>\n<p>Pick up gas cans and tool boxes while avoiding hitting other cars.</p>\n<p>Gas cans increase your score and the gas gauge. Keep the gas gauge from getting empty.</p>\n<p>Tool boxes increase your score and decrease your car damage. Don't let the damage gauge get full.</p>\n<p>Your score also increases over time. Reach the level's maximum score to move to the next level.<br/></p>\r\nRequirements\r\n<p>Your web browser must support <strong>WebGL</strong> and <strong>WebAssembly</strong>.</p>\n<p>Be sure that your browser is up-to-date.</p>\r\nScreenshots\r\n\r\nA bit of history\r\n<p>You may have noticed that there's a \"3\" in the game's title. So, where's the other 2?</p>\n<p>Well, Highway Hot Pursuit 1 was an Adobe Flash game made more than 10 years ago, in 2008. It was ok, but I never felt like publishing it.</p>\n<p>A few years back, late 2017 I think, I heard of the <strong>Godot Game Engine</strong>. At the time, I wasn't interested enough to check it out, but left a note on my desktop to take a look later. So, this year I finally decided to try it out, by remaking Highway Hot Pursuit on it. And that was how HHP2 was born.</p>\n<p>Both games were \"endless runners\" though. But, after a friend suggestion, I decided to add levels to the game and a ending. I, then, added the option to pick a car as well. And that became HHP3.</p>\n<p>As you can see, this game's concept is a bit old, but I hope you can enjoy it anyway.</p>\n<p>Thanks for checking my game out and reading all this! :)<br/></p>", "metacritic": null, "released": "2019-06-05", "tba": false, "updated": "2019-06-07T16:07:38", "background_image": "https://media.rawg.io/media/screenshots/a50/a503a9346d86aedebc14ce3d6bb3bdd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Olive Tree Oil"], "genres": [], "publishers": [], "esrb_rating": null}