{"id": 325727, "slug": "botanica", "name": "Botanica", "name_original": "Botanica", "description": "<strong>Welcome to Botanica</strong>\n<p>Hi everyone! Thank you for having a look at this prototype of a game. Please, play it and write a comment: </p>\n<ul><li>what would you change?</li><li>what needs to be removed?</li><li>what feature would make this game great? </li></ul>\n<p>I am a newbie wannabe game developer, so any help is welcomed!</p>\r\nShort Description\r\n<p>Botanica is a game about wandering around in a world full of nature and old knowledge. You play as an apprentice, learning about the usage of plants to create potions. See how the different species grow, collect them and use them to create potions in your laboratory.</p>\n<strong>Controls</strong>\n<ul><li>Use [WASD] to move</li><li>Use [E] to pick up plants with flower</li><li>Use [I] to open/close your inventory</li><li>Use [AD] to navigate the inventory</li><li>Use [E] to clear the inventory pocket (if the inventory is open)</li><li>Use [Q] to throw a explosive potion (transforming a flower from your currently selected inventory pocket into the potion, if the selected pocket is empty, no potion would be created)</li><li>Use [G] to save the game</li></ul>\n<strong>More info</strong>\n<p>The story is still at draft status, so I think is better to just say that you get to a town near the forest to learn about nature and what you could call \"alchemy\".</p>\n<p>I have no experience developing games, and I am conceptually and artistically creating this one, apart from writing the code, so I have a lot of ideas that I do not know if I could even implement. So, what can you find now in the game?</p>\n<ul><li>Move around in a sandbox (so far almost empty) map</li><li>Pick up flowers</li><li>Transform your flowers into exposive potions that kill other flowers!</li><li>Visit your house</li><li>See how the plants grow and reproduce around the water points</li></ul>\n<p>Things that I will probably work in (not sorted in any fashion)</p>\n<ul><li>Additional inventory to carry potions</li><li>Alchemy bench to transform picked up flowers into potions</li><li>Alchemy system: combine different flowers to create different potions</li><li>Animals with behaviour</li><li>More visual assets (NPCs, Town modules, animals, flowers)</li><li>Rivers (No idea how to do this right now)</li><li>Animations? (still thinking about this, not sure if I will animate movement or things)</li></ul>\n<p>What am I using to develop this game?</p>\n<p>This is part of a self imposed challenge to improve my code skills, so the engine I am using is pyglet a library for python.</p>\n<p>For the visual part, I use aseprite, which is great and I strongly recommend it if you are into pixel art, even more if you plan to animate. </p>", "metacritic": null, "released": "2019-06-04", "tba": false, "updated": "2019-08-28T23:16:03", "background_image": "https://media.rawg.io/media/screenshots/87d/87d8d3d9e3efa982570f80385efc55b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Outquisition"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}