{"id": 325720, "slug": "mrbubbles-in-magical-international-assassin", "name": "Mr.Bubbles in: M.agical International .Assassin", "name_original": "Mr.Bubbles in: M.agical International .Assassin", "description": "Controls:\r\n  \r\n<ul><li>Left-Click; Shoot, pause time (while bullet is in the air) </li><li> Mouse; controls direction of bullet\r\n  </li></ul>\r\nPlot Synopsis:\r\n  \r\n<p>You play as Mr. Bubbles; A otherworldly assassin who can use his powers to control time and bullets. He has been in the business for as long as time itself, with his “accidental” manifestation into our world, and has been bloodthirsty since. Wielding a custom-build Barrett M4G1C sniper rifle, his services are available for the small price of some lucky charms and LSD, which is used to manufacture the magic-infused bullets. The hunt has started, and if you are marked, 10 seconds is all it takes....</p>\r\nGameplay:   \r\n<p>Using Mr. Bubbles’ magic-infused bullets and time slowing powers, you will weave bullets through impossible angles to take out assigned targets. However, the magical connection is lost after 10 seconds, so put your powers to good use!\r\n</p>\n\r\nDISCLAIMER!\r\n<p>The audio in MIA may be completely out-of-wack due to...you know....reasons. So don't come crying if you go deaf. You have been warned!<br/></p>\r\n\r\nMouse123 productions does not take liability for any injuries cause by our products\r\nIf this game does injure you, please let us know. We need some new comedy material.", "metacritic": null, "released": "2019-06-04", "tba": false, "updated": "2019-08-28T23:16:03", "background_image": "https://media.rawg.io/media/screenshots/8b7/8b7eae6729fbee1f06b31782df850543.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mouse123"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}