{"id": 3257, "slug": "squares", "name": "Squares", "name_original": "Squares", "description": "When me and my sister were young, we would play this game to pass the time. We stopped playing because nether of us wanted to draw the dots for the game board. This is actually my second version of the game I have made using Game Maker, the first one was lost to time, however it was much less player friendly to play and required much more trust between players. \r\n\r\nWith this new version I was able to  increase the max number of possible players to 8.\r\n\r\nThis is a relaxed multi player game with out any combat and can be played by anyone of any age... meant for 2 or more players\r\n\r\n- setting up a game\r\n\r\nto set up a game, use the middle mouse wheel, or the arrow keys to select the number of players, then press the enter button on your keyboard when everyone is ready to play\r\n\r\n- game play\r\n\r\ntake turns using the mouse, left clicking between dots to create lines. You get to create an additional line for every square you make in your turn.\r\n\r\n*note: there is some wiggle room in where you click and still be able to create a line at the desired location.\r\n\r\n*note: both turns and points are done automatically\r\n\r\n- resetting the game board\r\n\r\nto reset the game board, press the enter button on they keyboard any time during game play, this will reset everything back to start. You can change the number of players or press enter again to start playing a new round.", "metacritic": null, "released": "2015-07-21", "tba": false, "updated": "2023-11-04T23:07:48", "background_image": "https://media.rawg.io/media/screenshots/c26/c263e2f80d0095757b82084d69242308.jpg", "website": "", "rating": 2.3, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 134, "beaten": 2, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 303, "ratings_count": 10, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "PS Vita", "macOS"], "developers": ["Mikhail Melnikov", "LEAP SAC", "Advanced Gaming", "Jason Swisher"], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Mikhail Melnikov", "Advanced Gaming", "Jason Swisher"], "esrb_rating": "Everyone 10+"}