{"id": 325790, "slug": "bath-time", "name": "Bath Time", "name_original": "Bath Time", "description": "<p><strong>Bath Time v1.08<br/>by DDRKirby(ISQ) and Kat Jia<br/>Released under the Cocoa Moss label</strong></p>\n<p><strong>Please be patient as the game loads! You may have to click to give it focus.<br/></strong><strong>Soundtrack download</strong></p>\n<p>Bath Time was made in 72 hours for round 42 of Ludum Dare. The theme was \"Running out of space\", and we ended up making a physics-based game about washing cats.</p>\n<p>Download Bath Time for your phone:<br/>App Store (iOS)<br/>Google Play (Android)\r\n</p>\n<p><strong>Awards (out of 2015 jam entries):</strong></p>\n<ul><li>#6 in Audio</li></ul>\n<p>Post-mortem writeup</p>\n<p>Ludum Dare submission page</p>\n<p>Original compo version submitted to Ludum Dare</p>\n<p>Changelog &gt;&gt;</p>\r\n\r\nv1.08\r\n- Update to Unity 2019 and WebAssembly, update sitelock code\r\nv1.07\r\n- Fixed an annoying bug with multiple touches that caused the scrubber to disappear when using fast movements on some touchscreens\r\nv1.06\r\n- First mobile release!\r\n- Fix wrong icon for deep cleanser during cooldown\r\n- Make level 10 slightly easier\r\n- Fixed first part of all sfx being played incorrectly\r\nv1.05\r\n- Add DPI tracking to make the game a bit easier on large screens (e.g. tablets)\r\n- Replace music with new soothing lullaby-like tunes\r\n- Add deep cleanser soap, used specifically for extra-dirty meowmies\r\n- Extra-dirty meowmies are now very difficult to clean without deep cleanser\r\n- Rework dirty meowmie visuals to make it more obvious when meowmies are dirty vs. clean\r\n- Rework levels and difficulty again\r\n- Add another tutorial with a tip to use larger circular motions\r\n- Make soap tutorial wait until you manage to actually get a good current going\r\n- Add a visual effect when soap cooldown is done\r\n- More performance enhancements\r\n- Fixed saved progress going backwards when you replay earlier levels (oops)\r\n- Added an ending screen once you beat level 10\r\n- Reduced the awkward delay before fading to the gameover screen\r\n- Slightly increase the circle radius for the washing/scrubbing tutorial\r\n- Slightly tweak when the background water swirls (requires a circular motion now)\r\n- Slightly reduce volume of meowmie swipe meow sounds\r\n- Change menu confirmation sound to a softer woodblock sound\r\nv1.04\r\n- Reworked the tutorial to make some concepts more clear\r\n- Game over now triggers when meowmie count &gt; 30, instead of being based on a timer\r\n- Reworked levels and tuned difficulty, taking the new game over condition into account\r\n- Made soap swirling require less motion (especially for large touchscreens)\r\n- Improved swipe handling (should lead to less missed meowmies when swiping)\r\n- Added a credits screen\r\n- Added a pause button and pause screen (allows you to quit mid-game)\r\n- Fixed level 4 button taking you back to the main menu\r\n- Fixed most sound effects having a slight delay at the beginning\r\n- Replace cheesy \"bling\" sound for drying finished with nicer pitched bell sounds\r\n- Small performance improvements\r\nv1.03\r\n- Adjusted difficulty of later levels to be a bit easier\r\nv1.02\r\n- Many more performance improvements\r\n- Fix meowmies being affected by soap even before dropping\r\n- Fix meowmie limb glitching sometimes during gameover\r\nv1.01\r\n- Fix some serious performance issues with the soap particles\r\n- Fix music not looping properly\r\n- Fix some slight text color mistakes\r\n- Add version number on the title screen\r\nv1.00\r\n- First release", "metacritic": null, "released": "2019-06-04", "tba": false, "updated": "2019-06-07T17:54:21", "background_image": "https://media.rawg.io/media/screenshots/b46/b4646d29e1d2ca28973a60546143a001.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 1, "platforms": ["Web"], "developers": ["DDRKirby(ISQ)"], "genres": [], "publishers": [], "esrb_rating": null}