{"id": 325847, "slug": "ame-youta-the-red-thread", "name": "Ame-Youta & The Red Thread", "name_original": "Ame-Youta & The Red Thread", "description": "<p>In the quiet village of Sora no Kokoro, the people live harmoniously with the gods of the Sun and the Sky. Here, the gods can walk among the people of the village as family or old friends and learn what it means to be human. In return for the generosity and honesty of the people, the gods bestow gifts from time to time. Sometimes the gifts are a strong harvest, occasionally villagers are gifted with true love in the form of a red cord to help guide their hearts and minds. Once in a generation, the connection between a pair can become so strong the red cord intertwining their fates becomes tangible. This is an omen, signifying a great challenge waiting for the pair. </p>\n<p> \r\nOne season, the gods bestowed their greatest gifts upon the village. The first, a girl so radiant in beauty and kindness that she made the gods of the sky weep with joy. She was named was Ame after the rain. The rainfall continued on for three days until the second gift was revealed. On that day the god of the sun beamed with a sense pride strong enough to clear the sky, as he presented a boy, strong in both heart and mind. The boy was thus named Youta in honor of the sun.</p>\n<p>The children knew only of the joys of a peaceful youth. As they grew older the Man under the Moon started to ask. “Is it enough that they only know joy?” He’d pose to the other gods. “They are our greatest gifts, we love them as our own” The other gods agreed, “Both are beautiful and radiant in every way but without challenge, the craftsmanship of their hearts and minds cannot fully shine.”  \r\n</p>\n<p>\tSo, it was decided that the gods would devise a series of challenges for the youths. To help them in their endeavors, the Man under the Moon connected them in body and spirit with his most hearty, brilliant, red thread. To overcome their trials they must use all of their gifts given by the gods and fostered by the village, to honor their blessings. If they fail to navigate the temple they perish and leave an age of cold and darkness in their absence as even the gods mourn.  </p>\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n\n\n\n\n\n<p><strong>Brothergoro | Anthony Kooistra </strong>(Design)<br/></p>\n<p><strong>John Montoya</strong> (Composer)</p>\n<p><strong>Luxiere</strong> (Programming)</p>\n<p><strong>Soul </strong>(Programming)</p>\n<p>\n</p>\n<p><strong>tacocat | Tran</strong> (Art)<br/></p>\n<p><strong>TheSageofSteel | Erik Stager</strong> (Design/ Story/Secondary SFX)</p>\n\n\n<p>Special thanks to Dymewiz &amp; Pinvoc for sound effects.</p>\n\n\n<p><em>This game was created during the <strong>Extra Credits Jam #4</strong></em><em>.</em></p>\n<p><em>Extra Credit challenge: Extra Remix.</em></p>", "metacritic": null, "released": "2019-06-04", "tba": false, "updated": "2019-06-07T18:19:23", "background_image": "https://media.rawg.io/media/screenshots/453/453e20e286b78e61dc80dcec08b38143.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Soul", "tacocat"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}