{"id": 325926, "slug": "entangled-itch-stuntmantan", "name": "Entangled (itch) (stuntmantan)", "name_original": "Entangled (itch) (stuntmantan)", "description": "<p><em>Salutations! You don’t know me, but I seem to be in a bit of a sticky situation, and I may have accidentally gotten your dimension involved in an unfortunate manner. On my Earth, I was experimenting with the quantum tunneling of very specific subatomic particles, and through absolutely no fault of my own, the strings destabilized and vibrated their way into your alternate Earth! There is a non-zero chance that if left to their own devices, they may or may not end up stabilizing into particulates of strange matter, which then may or may not end up turning your entire universe into a big pile of black goo. But worry not! I have developed a visualizer that allows you to locate and identify the quantum pairs. All you have to do is match each string to its linked twin, and they’ll harmlessly dissipate into energy. It does raise a small risk of accelerating the heat-death of your universe, but only by a few billion years.</em><br/></p>\n<p><em>Thank you for understanding, <br/></em><em>Dr. Sandwise Jay Klingonberg</em></p>\n<p><strong>Entangled, </strong><em>a game about bringing strings together by Team Luigi</em></p>\n<p><em>How to Play<br/></em>After selecting a difficulty level, click on one of the strings to select it, indicated by its yellow color. Then click another string to attempt a match; on a correct match the two strings will disappear from the field. After 3 incorrect match attempts, the game will end.</p>", "metacritic": null, "released": "2019-06-03", "tba": false, "updated": "2019-06-07T19:06:00", "background_image": "https://media.rawg.io/media/screenshots/a0a/a0a2c0b30d51da91af3d2fa81669bbc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["stuntmantan"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}