{"id": 32615, "slug": "raycrisis", "name": "RayCrisis", "name_original": "RayCrisis", "description": "<p>RAYCRISIS, the final installment in TAITO’s classic RAY series of arcade shooting games, locks on to iPhone!<br />\nTAITO is famous for arcade shooting games, and the RAY trilogy is one of its most beloved series! Its final work, the evolutionary evolution and the popularity of graphic RAYCRISIS appeared at iPhone / iPad / AppleTV application finally!! Arranged BGM is also recorded!<br />\n<em>The most beautiful Ray Crysis!! Boss Pre-War loading is unnecessary!<br />\nRealize much finer graphics than those ported in the past! Also, in the past work loading entered before the boss war, but in this app comfortable play without loading! The HP gauge of the boss has also been reproduced!<br />\n</em>Two Game Modes: Remix Mode and Arcade Mode!<br />\n-REMIX MODE is a special mode which adjusts the difficulty level according to the smartphone, plus its own arrangement on the map and sound! It is also possible to play only one designated stage for short play in the gap time!<br />\n-ARCADE MODE fully reproduces the excitement of the arcade! Completely captures the legendary arcade version original BGM! Although you can not stage select at first, if you satisfy the condition, you can choose your favorite stage composition from 42 combinations!<br />\nThe conditions to reach final enemy and good Ending also conform to the setting of the arcade cabinet!<br />\n<em>Two Shooting Methods: Auto and Manual!<br />\nAuto mode gives you play with auto shot and auto lock on laser! You can operate easily and comfortably with a single finger.<br />\n-When impacted with special Attack gauge accumulated, Round-Divider activated by auto! You can avoid the shot of your aircraft!<br />\nManual Mode is possible to switch on / off auto shot on / off. You can also control the launch timing of the lock on laser yourself, and you can aim for a high score as well as an arcade.<br />\n</em>Support MFi Bluetooth controllers!!<br />\nKey configuration is also possible! You can place &#39;Shot&#39;, &#39;Laser&#39; and &#39;Special attack&#39; on your easy-to-operate button!<br />\n-Possible to select auto shot when using controller!<br />\n-When using the controller, you can change the speed of your own machine in Remix Mode from &#39;Move Ratio&#39; of &#39;OPTION&#39;.<br />\n<em>Choose between three ships: the WR-01R,WR-02R and WR-03!<br />\nYou can select and play your favorite aircraft from 3 types with different airframe performance.<br />\nWR-01R with high power of normal shots, WR-02R with many simultaneous lock ons, WR-03 with homing bullets, which aircraft to play with is up to you!<br />\n</em>Fantastic BGM and SE are fully reproduced!<br />\nOne of the highlights of the original RAYCRISIS experience was its sound design, perfectly replicated here under the supervision of TAITO&#39;s ZUNTATA sound team. In addition to the classic soundtrack, this edition includes arrange BGM recorded in 2000 by TAMAYO!<br />\n<em>Added a arranged BGM by YU SHIMODA(ZUNTATA) to ARCADE MODE! Enjoy the cutting edge ZUNTATA sound!<br />\nUsing Option setting, you can choose Original BGM or Arranged BGM.<br />\n-Currently, you can listen surely by choosing the FUNCTION PART or INTELLIGENCE PART in the stage selection of ARCADE MODE. If it is from &#39;ALL&#39;, you may not be able to listen while the stage is randomly set.<br />\n</em>Vibration function compatible!<br />\nBy turning on VIBRATION in OPTION setting, you can enjoy with vibration.<br />\n<em>Difficulty Modes Added!<br />\nA total of 8 difficulty modes are now available, ranging from Very Easy to Very Hard.<br />\nHigh difficulty can aim high scores!<br />\n</em>Don&#39;t miss the three endings and true bosses!<br />\n*Game Center Compatibility!<br />\nIndividual rankings have been prepared for each ships and for each game mode.<br />\n<strong>Nortification</strong><br />\nThis app is intended for the iPhone 5 or newer,iPad mounted VRAM 1G or more,and running iOS version 8 or newer.<br />\nIf the problem persists, please contact our customer support address:<br />\nappsupport@taito.co.jp</p>", "metacritic": null, "released": "2002-03-01", "tba": false, "updated": "2023-03-09T18:07:59", "background_image": "https://media.rawg.io/media/screenshots/62f/62f568c6ace387e5b9647f2afa809258.jpg", "website": "https://www.taito.co.jp/classics", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 565, "game_series_count": 1, "reviews_count": 0, "platforms": ["Android", "PC", "iOS", "PlayStation"], "developers": ["Taito", "CyberFront"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Taito"], "esrb_rating": "Everyone 10+"}