{"id": 326169, "slug": "farewell-to-the-9-to-5-new-start-sad-feeling-sense", "name": "(['farewell-to-the-9-to-5', 'new-start', 'sad-feeling', 'sense-of-excitement']) 2019-06-03 08:00:31.578976", "name_original": "(['farewell-to-the-9-to-5', 'new-start', 'sad-feeling', 'sense-of-excitement']) 2019-06-03 08:00:31.578976", "description": "<p>An abstract autogenerated Bitsy philosophising about taking a break from the 9 to 5.</p>\n<p>Today is my first day of taking a break from the 9-to-5, so I wanted to see what my auto-generated Bitsy tool would think about that. :)</p>\n<p>Disclaimer: This was auto-generated and does not reflect my own personal views!</p>\n<p>There are some fun auto-generated tiles combos - I particularly like the bot with glasses, &amp; the walrus 'tache character.</p>\n<p>Even though the random auto-generated dialog is quite limited and common themes will crop up until I add more to that part of the system, it's interesting how it gives a spin on the text I enter as the characters/objects etc. In this case that text was:</p>\n<ul><li>farewell-to-the-9-to-5</li><li>new-start</li><li>sad-feeling</li><li>sense-of-excitement</li></ul>\n<p>It actually made me think about stuff... did I agree with what this Bitsy has to say about this situation? There were a couple of unexpected sentences it generated that made me think \"Actually I'd not thought of that, but it's true.\"</p>\n<p>Because of the way I've set up the auto-generation tool I like the way the Bitsys loop through rooms and some of the dialog. There is never an actual end at the moment in any of these Bitsys.</p>\n<p>I also like the fact that the characters (defined as sprites) will always exist, but as the bulk of the narrative is told through the items, once you've collected an item that piece of narrative is vaporised and you can't re-visit it... so it feels almost like the tale is told and you're left with just the characters getting on with the rest of their lives!</p>\n<p>This Bitsy was generated with v3_5 of the tool.<br/></p>", "metacritic": null, "released": "2019-06-03", "tba": false, "updated": "2019-06-07T21:09:59", "background_image": "https://media.rawg.io/media/screenshots/224/224cdb9ca50539b0bb7efd1108cdba2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Auto Generated Bitsys"], "genres": [], "publishers": [], "esrb_rating": null}