{"id": 326221, "slug": "roki", "name": "Röki", "name_original": "Röki", "description": "<p>Röki is an adventure game inspired by Scandinavian folklore; a dark contemporary fairy tale underpinned by a touching narrative, alluring art style, ancient puzzles and atmospheric exploration.</p>\n<p>We join Tove on a fantastical journey to save her family. A journey that takes her deep into a hidden and long forgotten world of lost folklore filled with strange locations and even stranger creatures.</p>\n<p>Explore the ancient wilderness, solve its mysteries, save your family in this modern adventure game for all.</p>\n<p>· “EXPLORE a Living Fairy Tale Forest”<br />\nJoin Tove to Explore a rich and beguiling world of wintry Scandinavian folklore, a world alive with detail and life crafted in Röki’s signature graphical art style.</p>\n<p>· “Make Friends WIth MONSTERS”<br />\nSeek out the ancient and magical creatures of the Scandinavian wilderness, some are friendly, some not so much!. Röki has a rich cast of unique ‘creepy-but-cute’ characters to discover our own take on Nordic folklore. </p>\n<p>· “SEARCH for Long Forgotten Items”<br />\nThe ancient wilderness holds many secrets. Seek out long forgotten items to aid you on your adventure.<br />\n“SOLVE the Riddles of the Wilderness”<br />\nRöki is a game of brains not brawn. Can you unlock ancient pathways and solve the riddles of the ancients.</p>\n<p>· “CHART your Journey”<br />\nTove charts her progress in her trusty journal, it’s her grail diary. Map uncharted regions, delve deeper into the rich lore of Scandinavian folklore, collect loot and earn unique ‘wilderness explorer’ badges.</p>\n<p>· “An ADVENTURE For ALL”<br />\nRöki is an adventure game for ALL gamers. With its non-violent gameplay, accessible controls and universal themes it is a journey to delight all gamers. The game is designed uniquely to pose a challenge but to also offer a helping hand when adventurers need it meaning it can be enjoyed by all. A truly modern take on the Adventure game genre.</p>", "metacritic": 79, "released": "2020-07-23", "tba": false, "updated": "2024-01-31T20:09:12", "background_image": "https://media.rawg.io/media/games/8ea/8eafa15945b94ce0f4e90f5db6fda419.jpg", "website": "https://www.polygon-treehouse.com/", "rating": 4.15, "rating_top": 4, "added_by_status": {"yet": 77, "owned": 748, "beaten": 49, "toplay": 81, "dropped": 6, "playing": 4}, "playtime": 4, "achievements_count": 65, "ratings_count": 52, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 53, "platforms": ["Xbox Series S/X", "PlayStation 5", "PC", "macOS", "Nintendo Switch"], "developers": ["Polygon Treehouse"], "genres": ["Adventure", "Indie"], "publishers": ["CI Games", "United Label"], "esrb_rating": null}