{"id": 326271, "slug": "lemnis-gate", "name": "LEMNIS GATE", "name_original": "LEMNIS GATE", "description": "<p>game of LEMNIS GATE takes place within a 25 second repeating time loop. Players take turns to add new characters into the loop. Each hero is forever stuck, replaying their actions over and over.<br />\nSuperior aim and faster reflexes are not the only contributors towards victory or defeat. Players have to think creatively, using causality and their team to surprise and outsmart their opponents inside the time loop.<br />\nRELIVE THE PAST TO CHANGE THE FUTURE!LEMNIS GATE is about skill, strategy, and time-traveling. It incorporates the traits already known by First-Person Shooter veterans with a quirky twist. While preserving the familiar feel of the genre, the time loop mechanic aims to add creative thinking into the mix, laying the foundation for highly competitive matches.SEVEN HEROES, INFINITE POSSIBILITIESWith a roster of seven unique characters, players have to strategize their way to victory. Every hero possesses a distinctive loadout and special ability that will prove decisive in the battlefield. In this ground-breaking new FPS, characters from the past, present and future play together as a team in order to defeat their opponents.<br />\nPLAY A TEAM GAME BY YOURSELFLEMNIS GATE is a turn-based FPS where each character on your team is controlled by you. Experience deep, tactical teamplay like never before. No need for AI or other players, you can cooperate with yourself! We call this AUTO-COOP.</p>", "metacritic": 77, "released": "2021-09-28", "tba": false, "updated": "2024-01-19T09:47:15", "background_image": "https://media.rawg.io/media/screenshots/bb5/bb5584f15785547db2252b7e655cfe8b.jpg", "website": "http://www.lemnisgategame.com", "rating": 3.13, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 130, "beaten": 2, "toplay": 21, "dropped": 10}, "playtime": 3, "achievements_count": 62, "ratings_count": 14, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 15, "platforms": ["Xbox Series S/X", "Xbox One", "PlayStation 4", "PC", "PlayStation 5"], "developers": ["Ratloop Games Canada"], "genres": ["Action", "Shooter", "Strategy", "Indie"], "publishers": ["Ratloop Games Canada"], "esrb_rating": null}