{"id": 326292, "slug": "fall-guys", "name": "Fall Guys: Ultimate Knockout", "name_original": "Fall Guys: Ultimate Knockout", "description": "<p>Fall Guys: Ultimate Knockout flings hordes of contestants together online in a mad dash through round after round of escalating chaos until one victor remains! Battle bizarre obstacles, shove through unruly competitors, and overcome the unbending laws of physics to avoid both humiliation and elimination. Leave your dignity at the door and prepare for hilarious failure in your quest for the crown!<br />\nMassive Online Pandemonium: Dive into a series of ridiculous challenges and wild obstacle courses with 100 competitors online, all with the hopes of making the cut and advancing to the next round of mayhem.<br />\nCompetitive &amp; Cooperative: Shift between brutally competitive free-for-alls and cooperative challenges where only the winning team advance to the next round!<br />\nComically Physical: Watch in delight as your fellow competitors bend, bounce, and bash their way to hilarious, physics-based failure!<br />\nDelightfully Customizable: Fail in style with everything from fashionable pineapple couture to the latest in bunny hats available to customize your look in Fall Guys.</p>", "metacritic": 80, "released": "2020-08-04", "tba": false, "updated": "2024-04-20T06:52:16", "background_image": "https://media.rawg.io/media/games/5eb/5eb49eb2fa0738fdb5bacea557b1bc57.jpg", "website": "https://fallguys.com/", "rating": 3.74, "rating_top": 4, "added_by_status": {"yet": 105, "owned": 6567, "beaten": 411, "toplay": 111, "dropped": 1020, "playing": 278}, "playtime": 6, "achievements_count": 173, "ratings_count": 1280, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 1305, "platforms": ["Xbox One", "PlayStation 4", "PC", "Nintendo Switch", "Xbox Series S/X"], "developers": ["Mediatonic"], "genres": ["Action", "Sports", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Devolver Digital"], "esrb_rating": "Everyone"}