{"id": 326297, "slug": "immortal-realms-vampire-wars", "name": "Immortal Realms: Vampire Wars", "name_original": "Immortal Realms: Vampire Wars", "description": "For as long as historians can remember, the ancient Dracul bloodline has ruled over the mysterious lands of Warmont – Realm of the Bloodthrone. Inside the secluded borders of this land, an unholy court of vampires feast on the blood of their human subjects. And, as long as they give it willingly, a vicious peace between mortal and immortal is kept alive under the watchful eye of the vampiric rulers - Vlad and Cecilia Dracul, forever bound by eternal love.<br/><br/><br/><br/>To the east, a cold wind blows over the desolate planes of Mourterra – The Land of the Dead. No humans live on this barren and cursed soil, and yet the land is far from deserted. Horrifying remnants of the ancient and corrupt Nosfernus bloodline stalk here in silence, patiently waiting for their chance to once again plague the lands of the living. <br/><br/><br/><br/>Meanwhile, in Esain - The Frozen North, another bloodline of vampires resides in solitude and isolation from the world. For the mystical clan of the Moroia, magic is blood, and blood is magic... and it runs thick in their cold, blue veins. No being – living or dead – dares interrupt their dark rituals and bloody soirées.<br/><br/><br/><br/>Tonight, the smell of blood is strong on the wind, and a red moon lights up the dark sky. A new vampire war is imminent, and none will be spared from the coming horrors.<br/><br/><br/><strong>Immortal Realms: Vampire Wars</strong> is an engaging strategy game set in a dark vampire world in turmoil, that combines empire management and turn-based combat with unique card-game elements. Descend into a mythical world filled with horrors and legends – and hurl yourself into a compelling gothic epos paired with a challenging game experience.<br/><br/><strong>Total War meets turn-based meets Vampires!</strong>", "metacritic": null, "released": "2020-08-27", "tba": false, "updated": "2023-01-29T16:58:59", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4ef36ba607fb8a2493526c94d6e450e.jpg", "website": "", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 45, "toplay": 17, "dropped": 6}, "playtime": 3, "achievements_count": 101, "ratings_count": 8, "suggestions_count": 500, "game_series_count": 0, "reviews_count": 8, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Palindrome Interactive"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["Kalypso Media"], "esrb_rating": null}