{"id": 326284, "slug": "tower-ascend", "name": "Tower Ascend", "name_original": "Tower Ascend", "description": "Your castle is falling apart!<br/>Dash, wall-jump, and use power-ups to escape your imminent doom with up to four players in this infinitely scrolling platformer.<br/><br/><strong>Gameplay</strong><br/>The game is played in two modes, singleplayer and multiplayer.<br/>In singleplayer, your ultimate goal is to survive for as long as possible.<br/>In multiplayer, your goal is to compete against your friend/s to become the last man standing.<br/>Pick up power-ups along the way for an extra powerful dash, a double jump, or a second chance against any threat.<br/><br/>There are two levels thus far, The Knight's Tower and The Necromancers Tower.<br/>Level is chosen at random for each match.<br/>More levels are planned to be added later, like The Mines and The Ruins.<br/><br/><strong>Controls</strong><br/>Jump with W or Arrow Up on keyboard, and with A on controller.<br/>Walk left or right with A/D or Left Arrow/Right Arrow on keyboard, and with D-Pad or Left Stick on controller.<br/>Dash by double-tapping A/D or Left Arrow/Right Arrow on keyboard, and with D-Pad on controller.<br/>Controller is recommended.<br/><br/>NOTE:<br/>Each and every player is required their own controller in multiplayer, even player 1. It is not possible to combine keyboard and controllers.<br/><br/>I only have access to one desktop during development. I therefore do not know the system minimum for running the game.<br/>If you encounter any performance problems or other bugs, let me know through my email or a message on Steam. I will respond as quickly as possible.", "metacritic": null, "released": "2019-06-19", "tba": false, "updated": "2019-08-28T21:44:46", "background_image": "https://media.rawg.io/media/screenshots/306/3065fbd4127a3379dcf061fca326da9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jonas Dall"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Jonas Dall"], "esrb_rating": null}