{"id": 326299, "slug": "last-day-of-rome", "name": "Last Day of Rome", "name_original": "Last Day of Rome", "description": "Rome for centuries robbed and killed millions of people who were not lucky to live near the borders of the empire. They took everything, but even that was not enough for them. The Romans invented to turn people into slavery. For centuries, neighboring nations have tolerated this, but patience sooner or later comes to an end. Rome must be destroyed!<br/>\r\nTake command of one of the peoples at the borders of Rome. In addition to tactics and strategy, you will have to use diplomacy. Achieve respect among your fellows and organize crushing campaigns against the millennial city.<br/>\r\nReasonably combine an army of infantry, archers, and cavalry to create an invincible armada that will sweep everything in its path.<br/>\r\nDo not forget about urban development. We are not barbarians - we are just a new force that will build a new world without slavery, racism, and oppression!<br/>\n<br/>\r\nYou control one of the \"barbarous\" countries of Europe at the beginning of the fourth century AD. You construct buildings and infrastructure in your regions, develop your capital. Conduct research on new technologies. You train the army, decide how to strengthen your troops. You hire generals, learn their special skills. Fight with neighboring countries, seize their cities and provinces. Battles take place in the form of card battles, which adds more dynamics to the game.<br/>\r\nGame includes:<br/>\r\n- 10 playable barbarian fractions<br/>\r\n- 2 roman fractions<br/>\r\n- 800 regions on a map of Europe and North Africa<br/>\r\n- 20 types of capital and city buildings<br/>\r\n- 34 types of resources<br/>\r\n- 100+ types of units of barbarians and Romans<br/>\r\n- 30 types of skills for Generals<br/>\r\n- 140 types of researches in science", "metacritic": null, "released": "2019-06-21", "tba": false, "updated": "2019-09-10T14:18:29", "background_image": "https://media.rawg.io/media/screenshots/2a2/2a264e557fe5496d275e5738d109b071.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 16, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 58, "ratings_count": 2, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Hamsters Gaming"], "genres": ["Strategy", "Indie"], "publishers": ["Hamsters Gaming"], "esrb_rating": null}