{"id": 326357, "slug": "4towers-onslaught-lite", "name": "4Towers Onslaught: Lite", "name_original": "4Towers Onslaught: Lite", "description": "*** PRESS QUOTES ***<br/><br/>\"An interesting story to go along with deep, customizable gameplay.\" - jayisgames.com<br/><br/>\"A solid tower defence game which rewards intelligent play, has a lot of depth\" - Toucharcade.com<br/><br/>\"The game sports a unique visual style and atmosphere\" - Appspy.com<br/><br/>\"Brigt and Shiny\" - 148apps.com<br/><br/>****** <br/><br/>Start with just 4 simple towers and combine them in different ways to access many many more abilities and effects! Find the right tower combinations to fend off the alien swarms as they get bigger, faster and stealthier. <br/><br/>------------ <br/>Key Features <br/>------------ <br/><br/>COMBO CARNAGE: Start with just 4 basic towers and combine them in 18 different ways to unleash worlds of pain! <br/><br/>TACTICAL TENSION: Stack or stagger? Mix or match? Upgrade your towers to maximize your massacres or recycle them for their full value back! Speed up the waves or pause and redeploy at will! <br/><br/>FEAR THE SWARM: Defend against 15 different creep types and bosses (and their combinations of course!) as they flood your screen – up to 200 at a time, giving you over 20 hours of gameplay across 3 difficulties! <br/><br/>LOOT AND PLUNDER: Collect alien BIOMATTER and pick up trinkets and equipment to boost your tower stats! <br/><br/>FIND YOUR PLAY-STYLE: More customization when you form your insignia! Choose your upgrade path to access Long Ranged Cannons, High Speed Snipers and much more! Theres more than one way to skin a creep! <br/><br/>Join us on Facebook to get the latest news: <br/>www.lambdamugames.com/facebook", "metacritic": null, "released": "2011-10-18", "tba": false, "updated": "2019-08-16T04:56:27", "background_image": "https://media.rawg.io/media/screenshots/56b/56ba39f24cc0fd385473e252eec0bffe.jpg", "website": "http://www.lambdamugames.com/games/4towers", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lamb Damu Pte"], "genres": ["Action", "Strategy"], "publishers": ["Lamb Damu Pte"], "esrb_rating": null}