{"id": 326376, "slug": "737-flight-simulator", "name": "737 Flight Simulator", "name_original": "737 Flight Simulator", "description": "- Top #26 game in UK!<br/>- Top #10 game in 32 countries (entertainment)<br/>- Featured by Apple in over 913 places in iTunes<br/><br/>Enjoy a fully featured 737 flight simulator. We give you a fantastic opportunity to see what real pilots encounter in critical situations. There are 6 different regions to explore each having different real life scenarios that happened in the past. Do you remember famous president crash in Smolensk, Captain Wrona landing in Warsaw or the Hudson River emergency landing? Try these missions yourself and see if you can save the plane!<br/><br/>Features:<br/>- realistic plane crash simulations<br/>- real life missions<br/>- real indicators<br/>- time and weather conditions<br/>- tutorial missions<br/>- new FREE missions with each update<br/>- 3D and side view cameras<br/>- great music<br/>- Apple Watch support!<br/>- and much more...<br/><br/>We would like to hear your opinion, please rate and send your feedback to skalamandra@gmail.com<br/><br/>And one more thing: WE ARE PASSIONATE ABOUT FLYING AND WE LOVE THIS GAME!<br/><br/>Facebook: https://www.facebook.com/737flightsimulator<br/><br/>We dedicate this game to all who lost their lives or suffered injuries in airplane crashes.<br/><br/>Attribution:<br/><br/><br/>Please note that this is just a game. Airplanes are still the most safe mean of transport. Any similarity between planes used in this game and real airliners is accidental. Our intention is not to show any airline in a bad light.", "metacritic": null, "released": "2013-11-15", "tba": false, "updated": "2019-10-22T14:39:41", "background_image": "https://media.rawg.io/media/screenshots/783/7830e248aaec0492b230e3ba589e5837_YzFj0rs.jpg", "website": "http://easyflightsim.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Justyna Zablocka"], "genres": ["Action", "Simulation"], "publishers": ["Justyna Zablocka"], "esrb_rating": "Everyone 10+"}