{"id": 326477, "slug": "gunship-battle-heli-air-attack", "name": "Gunship Battle Heli Air Attack", "name_original": "Gunship Battle Heli Air Attack", "description": "Gunship battle is the heli battle of powerful machine guns to fire strategically. This flying war is the right choice for you to attack on enemy camp. Start this combat air attack on your fingers. Heli chopper is full with the verity of equipment and modern weapons. Challenge your opponent through this flying battle air attack. Choose your gunship helicopter to pull an immersive attack to compete their gangster camps. Combat gunship mission is fight of gunship fighter to destroy enemy mission and secure your country from these enemies. Enjoy the decisive battle to win the best heli shooting game while bursting your enemies. It’s time to aim high and shoot through heavy gunner machine. <br/>You are the trained gunship air fighter so you have one chance to defeat your enemy camp. Enemies also have heavy gunner missile machine to attack your army helicopter. You have modern guns and missile machine in your fighter jet. Enjoy the immunization of gunship diversion. You have your own fighting helicopter so ready to attack on your challenger. Just predict your opposition and enjoy the war of gunship air battle. That is one of the best helicopter so fly it take aim and shoot on the rivals that are behind the mountain as well as making plan from Island. Your enemies striker have the shooting gun, tanker, soldiers and base camp.<br/>Survive from the toughest moments and enjoy the mountain island air mission. Start your mission and attack through this gunner. Eliminate your enemies with missile gunner and bullets fire to eliminate your opponents. Focus on your territory and their weapon stores how they dangerous are? Go and enter into the war to defeat to unlock next mission that is more powerful and interesting then previous. It’s a challenge for you to control your helicopter and attack with a clear aim. Kill the military soldiers of opponent nation and enjoy this remarkable war attack of shooting choppers.<br/>Adjust your helicopter, aim and shoot from loaded guns and missile attack. Give attention on the enemies and be the prominent army pilot as flying air helicopter and fighting like an army soldier with accurate aim and shooting their base camp and tower. Save your helicopter and complete the mission on time. Focus on opponent responds and their attack otherwise your gunship craft will be destroy.", "metacritic": null, "released": "2018-10-21", "tba": false, "updated": "2019-10-22T14:39:47", "background_image": "https://media.rawg.io/media/screenshots/22b/22bb5c8fdffc5996a4381a4b863415e0_6MuZ1Gv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action", "Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}