{"id": 326496, "slug": "real-speed-car-racing-thriller", "name": "Real Speed Car Racing Thriller", "name_original": "Real Speed Car Racing Thriller", "description": "Bring fast driving experience on a real speed car. Enjoy the thrilling driving in the city, desert, forest jungle and snow environment. Beat the multi racing car on the roads. Enjoy the best and easy control in a great car driving location. Chase the world best cars driving in front of you. Various speed cars made by top manufacturers of the world. Select your sports car thrilling racer pick up all your speed force, chase on the road with your opponents. Crash! Drift! Roll! Gallop! Overtake! Challenge the players from all over the world. Be the top racing driver. Crazy for Speed will give you and parallel &amp; unparalleled racing experience.<br/>The ultimate fast paced intense arcade car racing game set in city streets cars, desert car, jungle car and snowy car race specifically designed for a high racing rush is finally here! Car racing real speed thriller will challenge even the most skilled racing fans. Perform a high racing car speed and enjoy the racing feelings. Become the king of highway racing roads with best thrilling adventure game player and high hd graphics smooth control for mobile devices game. Complete missions to earn game coins. City Speed Car Racing Thriller 2019 has many impressive cars environment to choose from each environment that is addictive and more attractive than the previous one.<br/>Drive realistic speed up cars in the newest race car game &amp; compete against other racing eager racers in fast pacer race, drift around racing tracks and beat the clock to get the fastest lap time in this awesome race car game! Experience realistic car driving in the new racing simulation game, speed up your car to chase other race vehicles. Flip and wreck your real race car with vehicle damage, see each scratch and dent with each car crash and collision. Car racing simulators have never been this fun, with incredible action-packed racing, become the ultimate race car driver in one of the best car driving games!", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-10-22T14:39:48", "background_image": "https://media.rawg.io/media/screenshots/0fd/0fdbbf9086ecef651d0a0c8dbb660a70_TNlaihd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Simulation", "Racing"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Teen"}