{"id": 326418, "slug": "fashion-model-spamakeoverdressup-free-girls-games", "name": "Fashion Model spa,Makeover,Dressup free girls games.", "name_original": "Fashion Model spa,Makeover,Dressup free girls games.", "description": "Create 1000's of different looks from classy to Beautifule and awesome!<br/><br/>Here girl wanted to be a model all her life, but she is very unsure of her look. But she decided to try out for American Next Top Model, a show that tries to teach young models how to make it in the industry. She was accepted and she even made it to the makeover episode, where all the girls are given a facial beauty treatment and a complete makeover, in order to get that supermodel look. The skin is an important asset of any model, so of course it has to be flawless. In order to achieve this, she has to apply a cleanser to remove all the impurities, a scrub to give the face a clean and fresh look, a face mask with delicate flower that will hydrate the skin, a refreshing eye lotion that will remove the dark circles under the eyes and finally she’ll have to use a pair of tweezers to give the eyebrows a beautiful shape that will frame the face. Then they will get her a new hairstyle, more glamorous and fun than what she is used to, one that will give her a way in the high fashion world. They will apply a gorgeous make up that will emphasize all her best features and they will dress her up in some trendy outfits. Have a great time playing American Next Top Model!<br/><br/>Here are 4 Different girls going to Model.<br/><br/>1) Spa<br/>2) Makeover<br/>3) Dress up<br/>4) Photo Shoot<br/><br/><br/>Hurry Up Download this awesome game.<br/><br/>Don't Miss Amazing Update.", "metacritic": null, "released": "2014-03-21", "tba": false, "updated": "2019-10-22T14:39:44", "background_image": "https://media.rawg.io/media/screenshots/bec/bec9bcee8bee4a4c0e35786e1fb5b607.jpg", "website": "http://creativeigames.com/support.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lalit Kharadi"], "genres": ["Family"], "publishers": ["Lalit Kharadi"], "esrb_rating": "Everyone 10+"}