{"id": 326475, "slug": "crazy-chickens-shooting-action", "name": "Crazy Chickens Shooting Action", "name_original": "Crazy Chickens Shooting Action", "description": "Crazy Chickens Shooting Action is the best hunting game to hunt the chicken to survive yourself with crazy chicken. Load the gun and aim at the chicken to shoot the crazy chicken and show your professional shooting skills. You are the professional hunter and hunt the chicken with in fixed time before the chicken attacked at you. Just aim the biggest chicken that harm you. Pull the trigger and target the chicken before they get fat and start running and blast. This is the most excited time with real shooting physics enjoy the chicken shooting game and improve the hunting skills in the beautiful environment. The big chicken are rushing in the ground get your pistol load and fire at the chicken before they get running fast and enjoy the beautiful hunting animation. You just shoot the chicken as like in the commando shooting games. The game is full of action and craziness. The most amazing and physics based hunting game will enjoy you and take to the best wilderness environment what you like and this classic crazy chickens shooting action is the most wanted, popular and impossible game around the world so refill your gun and rifle and move to the wilds of forest and jungles, mounted areas, desert and snow fall world. It’s time to become legend hunter and improve your hunting skills in beautiful multi environment. This advance crazy farm chicken gun shooter 3d shooting game will enhance your aiming and shooting skills. There are multiple thrilling hen shooting missions in this game. It’s a multilevel chicken shooter mission game. Where there are many challenging levels and each level has a set number of shooting targets for you. Chickens will be flapping their wings and screaming in a crazy way in this crazy farm chicken simulator.<br/>This is the only action and adventurous crazy hunting game which is based on 3D physics and chicken hunting, you all play many hunting games but games feature make you love to play hunting and chicken hunting make game completely change. Aim precisely &amp; pull controls of sniper gun to shot your target also you can change, upgrade your sniper rifle. Your one of the best sniper game to hunt in this challenging chicken shoot game. Shoot like a professional Hunter, hunt with an eagle eye or you will lose your hunting level. This Chicken Hunting Farming Game is amazing in every aspect of likelihood in the hunting games. If you want to become a professional chicken target hunter so this game gives you a chance to shoot &amp; hunt the clever chickens in the safari forest farm. Crazy chickens shooting action challenge 3D is all about the accurate hunt of running and idle chickens, aim and shoot chickens at the right time and within given time and arrows. You can improve your sniper chicken hunting skills with sniper chicken hunt as a professional chicken lover. This chicken attack game is really amazing and unique animal hunting game where you will be aiming running, walking, eating grains and quietly sitting hens and chicks. Take down all the chickens with your shooting skills in this amazing wild chicken shooting game. This is the most realistic shooting simulation ever.<br/>Features:- <br/>- Smooth controls of weapons &amp;&amp; adjustable sensitivity.<br/>- Hunt the chickens with different guns and sniper.<br/>- Full with action thrilled mission in chicken hunt 3D.<br/>- Paid game available on app store.<br/>- Deadly farm chicken shoot in a light mode and manner.", "metacritic": null, "released": "2018-11-17", "tba": false, "updated": "2019-10-22T14:39:47", "background_image": "https://media.rawg.io/media/screenshots/dba/dba5d6b1d4741075c13a6fd425f3317b_OfYC8R2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action", "Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}