{"id": 326471, "slug": "real-desert-car-snow-drifting", "name": "Real Desert Car Snow Drifting", "name_original": "Real Desert Car Snow Drifting", "description": "City desert car racing is 3d drifting game. Best action race drift game and driving simulation. Pick your favorite car snow drifting game. Burn up the wheel for drift and enjoy fastest and fast racing today. Desert car race is the fast racing game with awesome game play and drifting.<br/>Snow driving is tough driving is another way of enjoying it to drive in the desert. Chances of drifting &amp; accident are also higher in snowy tracks then desert game which is on small mountain tracks and enjoy to taste this double taste. With its realistic driving style racing and real snow car drive ice model vehicle you will never forget this game.<br/>Experience drive in the desert of world’s most beautiful desert. Try your luck with the stunning Arabic guys driving crazy through the desert tracks chase them and enter your name in Victorians list. Select your luxurious jeep from the list of various monsters and drift around the amazing arenas. Fly the dirt in the eyes of crazy drivers. Chase the ups and downs of the lovely Sahara desert in the hearts of Dubai. So get ready for your 4x4 monster jeep in action.<br/>Enjoy the drift car dragging game and get ready to do fast and drag &amp; drift car on dangerous snowing tracks. Now you can drive speedy drive stunts to tackle other drifty snow sliding racers cars drivers all these and many more driving stunts challenge with real snow drift car racers. Drive your ultimate drift simulation car on steeps on deserts wait for the night mode it is most beautiful under open sky. Not so easy as we see drift is a class skills of legendary jeep drivers. Real Desert Car Drifting havoc drive is not about street racing it’s all about drift and race by driving a special drifting car race skills in desert valley where everyone take their jeeps and powerful engine cars for drifting in safari.<br/>Desert &amp; Snow Drift Racer gives you an exotic feel of real racing snow master as well as drifting in desert. Amazing thrilling snow season car drifting extreme race 3d and racing snow tracks drift and dragging on dangerous tracks. Drive your powerful car through ice mountain drift age.<br/><br/>This wonderful Dubai desert game have two type mode every mode is more interested and enjoyable. First mode is desert mode you can enjoy your driving on real Dubai desert drifting with other jeeps. Second mode is snow drift you have to clear snow race where you have to beat other drift racers of world class drivers.<br/>This 3D snow champion tracks race is a racing car dragging drizzly game just download and playing this 3D nice fantastic winter racing game. Now you can become a true champion of racing. This amazing racing game lets you drive fast cars and winning championships at high speeds. Variety of sports and off road car models with modern modifications are available to bring a havoc in the desert or snow tracks.<br/>Only the real cruiser driver can handle this challenge and there will be so much thrill and excitement in driving through the dry hilly desert areas of the desert. The adventures of the desert trip have its own fun. Drive Impossible off road jeep on tough tracks is too difficult for those who have less experience of race in desert area.", "metacritic": null, "released": "2018-11-04", "tba": false, "updated": "2019-10-22T14:39:47", "background_image": "https://media.rawg.io/media/screenshots/ca0/ca069a29789362e757fb610f9557582b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Adventure", "Simulation"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Teen"}