{"id": 326498, "slug": "real-billiard-pool-master-club", "name": "Real Billiard Pool Master Club", "name_original": "Real Billiard Pool Master Club", "description": "Real billiard is one of the most realistic and playable billiards and eight ball pool games available for you. Enjoy the realistic snooker physics and control to feel joy. Best addictive game to play ball.<br/>The simple click and play interface allows you to pick up and play the game quickly. Play alternatively for the more serious players the game includes cue ball 8 control allowing you to perform more advanced. Feel that you are standing in the billiard arena. 8 Ball Pool’s level system means you’re always facing a challenge.<br/>The people those are tired of from typical snooker billiard pool then they are at right place. This game is very simple for every type of player to be the master of it but don’t forget it is intricate enough. The graphical user interface of the Real Billiard Pro Pool Master Club allows you to simply click and play. Complete with precision aiming capabilities that easily improve your aim and accuracy. Take full control over your snooker shots even while in motion. How about a nice little pool game of ball?<br/>This game contains two playing mode one is practice mode and the second one is two player mode. In practice mode you can learn and play game as a single player and you can play complete game and handle is completely. In two player mode you can play against your friend which you select.", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-10-22T14:39:48", "background_image": "https://media.rawg.io/media/screenshots/4c7/4c70c6068daa1eb54724a3d352e4d86f_UaNlEKl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Sports", "Casual"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Everyone 10+"}