{"id": 326468, "slug": "extreme-cars-drive-train-cargo", "name": "Extreme Cars Drive Train Cargo", "name_original": "Extreme Cars Drive Train Cargo", "description": "Welcome to play the latest car parking game. Car Parker train cargo lover will park the car into the train. Driving car and parking on towards railway station. A better chance to be a good double driver to control a car and also controlling &amp; driving train to the destination. Just highlight your driving skills and enjoy the amazing journey of this train car parking game. Drive your car on road is not a much tough game but driving on train station and parking into the train on time much different and a crazy fun challenge. A lot of road barrier, people rush and luggage bad will challenge your drive so avoid from them and have a safe journey. Just jump your jumping car into the train and drive fast to secure your time. Racing &amp; parking in new train game.<br/>In Extreme Cars Drive Train Cargo control on your steering and start the car engine to start your task otherwise will be miss your train. Boost up your car when you are going to be missed the train. This train in complete cargo car transporter train. Crazy path are located for the best car driver of this world to practice and improve his driving skills. Offroad best drive challenge is for you to drive fast as you want and go towards luggage train and any path you choose it doesn’t matter. Metro station roads system are also dense. Drive the car in an advance train &amp; car moving games. Enjoy the amazing different location while the journey of train. Drive Indian car in a cargo train transporter game and become the double driver &amp; most successful car train driver.<br/>Explore the largest collection of car onto the moving fast train movers on a fast tracks. Play the modern train transporter game and the driving as you are the professional driver of this modern era. Explore your train driver skills the view from inside or simply watch the view from the ground as it comes towards you. Most exciting riding train is a new experience to drive your car and park into the rails. This modern rails driving game provide you the double experience of driving simple &amp; small vehicle as well as big &amp; large train. Fast subway game provide you to drive your train and transport from one country to another nation and be secure until you complete your challenge/mission to car go transport. Blazing start with extra ordinary beautiful city visit. Tricky driver without conductor for the car or for this fast train. Enjoy to get pick up &amp; drop services of your car in this train car drive cargo game. Cargo transporter is a challenge with big responsibility.", "metacritic": null, "released": "2018-11-02", "tba": false, "updated": "2019-10-22T14:39:46", "background_image": "https://media.rawg.io/media/screenshots/b20/b20b0cdb70a8b9d9f3559b7efb7e4995_GESBlqH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Simulation", "Racing"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Teen"}