{"id": 326476, "slug": "air-jet-fighter-missile-attack", "name": "Air Jet Fighter Missile Attack", "name_original": "Air Jet Fighter Missile Attack", "description": "Plan your jet to fight for this dogfight war. Start your challenge through jet missile attack and blast enemy upcoming fighter jet and airplanes. Fight against air combat flying fighter craft. An adventurous fighting game. Be strong and encourage you for this dangerous air fight of deadly jet missile warrior. Jet fight flying simulation game is now for you to attack, fire and blast the enemy’s craft. Ready to attack the planes in this action pack dogfighting game. You can also shoot missile in this jet missile attack game. Double duty for you to control air jet flight and shoot missile on target. <br/>Air Jet Fighter Missile is a realisticical war simulation. Destroy their craft and weapons to make them loser. Lead your fighting jet and burst before they enter into your nation’s border. Save your border from the enemy warrior. Just play and feel yourself into this amazing craft war simulation game. A classic tactical mission in which aircraft fight and shoot enemies plan, jet and drones that are coming towards you. Fly into the sky and enjoy this modern dog fight. You are a combat soldier of your air force. Take perfect shoot to win this dogfight battle. You are the best air force soldier and now it’s your test how you play your duty as a pilot and how you fight like a soldier.<br/>Advanced mobile fighting game to defend your nation also move your craft to take clear view of the enemies. Launch missile from the air jet missile shooter simulator. Make best strategy while choosing missile instead of jet gunner machine. Jet to Jet is monster battle and dangerous than other shooting jungle game or grounded war games. You have a creative mind while playing these type of games because you have to take flight of your jet machine and fight like an air force soldier.", "metacritic": null, "released": "2018-11-10", "tba": false, "updated": "2019-10-22T14:39:47", "background_image": "https://media.rawg.io/media/screenshots/ccd/ccd57bdd9680ea09967e881b4f43db9f_KEEFvRx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action", "Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}