{"id": 326483, "slug": "the-king-shots", "name": "The King Shots", "name_original": "The King Shots", "description": "Make as many basketball shots as you can. Just like LeBron, be the leader! LeBron James has broken many records in the NBA and has solidified his mark in the NBA. He's broken so many basketball records that many consider him to be better than even Michael Jordan. There is still so much controversy to be had about this kind of discussion, however, there is no denying that LeBron is a top caliber player in the NBA, and LeBron James will continue to be that as long as he keeps playing basketball at the level he's playing at now.<br/><br/>It seems that every team LeBron plays for ends up going to the NBA Finals. He was able to set the score even between the Golden State Warriors in a rematch between them and LeBron Jame's team, The Cleveland Cavaliers. The Golden State warriors were up 3-1 in the finals, but with a little bit of effort between Kylie Irving and LeBron James, the Cleveland Cavaliers prevailed and became the NBA Finals Champs, dethroning the Golden State Warriors and Stephen Curry.<br/><br/>So, In dedication to the level of play that LeBron displays, and the mark he has on basketball, this game is dedicated to that same kind of basketball greatness. In this game you are trying to make as many basketball shots as you can. The more you make the more balls you get, the more shots you make the closer you will be to being the best in the game, and have your name featured on the LeBron Shots High Score list and show off how good you are at shooting a basketball. Strive for greatness, and try to be as good as King James himself.<br/><br/>Before LeBron James had completed his sophomore year of high school, basketball scouts were discussing his chances of playing for the National Basketball Association (NBA). Before playing his first regulation game for the NBA, James had signed deals with Nike and other corporations for multimillion-dollar product endorsements. Before he completed his rookie season in the NBA, sportswriters were discussing his chances of joining the most elite players in history in the Basketball Hall of Fame. Comparisons to NBA superstar Michael Jordan (1963–) became common, and some sportswriters began calling James \"The Chosen One,\" indicating the hope that the rookie phenomenon would revive interest in the NBA that had declined since Jordan's retirement. LeBron James, by age eighteen, knew a thing or two about dealing with pressure. James's ability to cope with that pressure has proven to be a critical factor in his success. Sportswriters and his coaches agreed that James has shown uncommon maturity for a player his age, handling his newfound fame and the extraordinary expectations of others with grace.<br/><br/>Few high school basketball players attract notice outside their home state, but by his junior year, James had caught the attention of basketball fans across the country and earned the intense devotion of fans throughout Ohio. The St. Vincent–St. Mary team won the Division III state championship three of the four years that James attended the school, and in 2002, USA Today named the team number one in the country. James was named High School Boys Basketball Player of the Year by Parade magazine after both his junior year and his senior year; in forty-seven years of giving out this award, Parade has never chosen the same player two years in a row. Sports Illustrated put James on the magazine's cover in 2002, only the eighth high school basketball player to be on the cover in forty-eight years. Once word got out about James's extraordinary ability, home games were moved", "metacritic": null, "released": "2016-09-08", "tba": false, "updated": "2019-10-22T14:39:47", "background_image": "https://media.rawg.io/media/screenshots/6a4/6a481efb0cbedfad864b9e0cde9f3086.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Faycal Falaky"], "genres": ["Sports"], "publishers": ["Faycal Falaky"], "esrb_rating": "Everyone 10+"}