{"id": 326592, "slug": "barbarian-blood-glory", "name": "BARBARIAN: BLOOD & GLORY", "name_original": "BARBARIAN: BLOOD & GLORY", "description": "<p>Go on the greatest adventure of your life!</p>\n<p>You have to go through fire and water! Conquer the peaks of the highest mountains and descend into deep dungeons straight to the devil!<br/>Barbarian world is a world where you will determine your own destiny! </p>\n<p>This world is about to change. Maybe he will fall under the onslaught of dark forces. Or the light side wins. And whose side is the truth? No one can know that.<br/>Play a crucial role in the story! And you have a choice!</p>\n<p>The project “the Barbarian” is unique. Here you will not find the usual and boring rules of the game.<br/>The game challenges the player and has a fairly high complexity in the development and in the passage. But in return you get freedom and a new world in which life you can influence for real!<br/>This is a cruel and dangerous world. Be prepared for deceit and betrayal. Some characters may try to use you. You can be trapped, deceived, or simply killed and robbed.</p>\n<p>LIVING WORLD<br/>On your mobile device and with high performance!<br/>This world has no additional loading locations! <br/>Advanced artificial intelligence!<br/>Computer characters live their lives even when you don't see them!<br/>For example, they need to eat and sleep. Satisfaction of needs depends on the surrounding situation.</p>\n<p>COMBAT SYSTEM<br/>Melee is represented by dozens of different clubs, swords, axes, shields. There are two-handed and one-handed weapons.</p>\n<p>Far battle are bows and crossbows.</p>\n<p>The characteristics of the characters and weapons will certainly affect the course of the battle. But the most important thing is the player's skill. You need to do the right thing and try to make the enemy make a mistake. Constantly pressing the attack button will be a bad tactic.</p>\n<p>CHARACTER DEVELOPMENT<br/>The character can be dressed in more powerful armor.<br/>Train your character can be other characters who agree to teach you. But first you will need to gain experience</p>\n<p>CHARACTERS<br/>Many people, animals and monsters inhabit this world.<br/>Someone can give you a job. And someone better to fear.<br/>Trade and fight! Follow the instructions and build relationships!</p>\n<p>IN ADDITION<br/>You can swim! Jump! And climb mountains!<br/>All this will make moving around the world more interesting.<br/>You will immerse yourself in its study for many hours!</p>\n<p>Create your own adventure!</p>", "metacritic": null, "released": "2019-06-08", "tba": false, "updated": "2019-06-10T03:58:30", "background_image": "https://media.rawg.io/media/screenshots/476/476c918ef2d4f49f80db6f051ce3fbca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DmitriyZ"], "genres": ["Action"], "publishers": [], "esrb_rating": null}