{"id": 326500, "slug": "silver-screen-story", "name": "Silver Screen Story", "name_original": "Silver Screen Story", "description": "Movie Studio Management Simulation Produce blockbusters and earn world-wide fame<br/><br/>Become the boss of film studios and lead them to world-wide fame, supervising production of blockbusters!<br/><br/>Customize your studios with facilities such as a CG or sound studio, staff cafeteria or acting school.<br/><br/>Having talented directors is key, but it's up to you to train them up, bring out their full potential, and offer them guidance when they get stuck.<br/><br/>Hire actors, or have famous pop icons, dancers, or comedians star in your films.<br/><br/>Have fun with tons of possibilities picking the genre, themes, and filming location for your movies!<br/><br/>Produce smash hits to win fans all over the world and break all box office records!<br/><br/>▼Game Flow<br/>Set up your studio, hire a director and staff, and you'll be able to start filming. Try to pick themes which go well together and appeal to a wide audience.<br/>As you start making money, invest in deals with movie theaters, add new facilities to your studios, get new filming locations, and produce even more new films.<br/><br/>▼Movie Stats<br/>Quality: goes up when staff working on the movie is highly skilled.<br/>Popularity and Hype: increase the odds of events taking place and your chances of success, as well as how many people will come to see your movies. These are affected by the popularity of the cast and director.<br/><br/><br/>Try searching for \"Kairosoft\" to see all of our games!!<br/><br/>Developer Homepages. Feel free to follow me♪", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2023-05-19T02:43:46", "background_image": "https://media.rawg.io/media/screenshots/c16/c165960b70cabd03484e7b8f5fc184e4.jpg", "website": "https://kairosoft.net/game/appli/filmstudio.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS", "Android"], "developers": ["Kairosoft"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Kairosoft"], "esrb_rating": null}