{"id": 32684, "slug": "darts", "name": "Darts", "name_original": "Darts", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Pick up your darts and take a shot in this incredibly realistic fun and easy to play darts simulation game anytime.<br/><br/>Darts is based on the classic 501 dart game, starting with a score of 501 your goal is to 0 with the minimum number of dart throws and just like the classic game you can score doubles and triples.<br/><br/>There are 15 rounds and in each round you throw 3 darts, the player to either reach 0 or has the lowest score wins the game. <br/><br/>Play against family and friends or play against the computer’s smart artificial intelligence (AI) player, either way, winning won’t come easy. <br/><br/>Customise your dart board and darts with over a 100 different combinations to chose from.<br/><br/><br/>Offline multiplayer (2 players)<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2001-01-01", "tba": false, "updated": "2020-12-16T14:38:58", "background_image": "https://media.rawg.io/media/screenshots/12d/12d5e14db64b7b1e0ab2818e999e2c40.jpg", "website": "http://phxgs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4", "Nintendo Switch"], "developers": ["KOCH Media", "darts dev"], "genres": ["Strategy", "Sports", "Arcade"], "publishers": ["Koch Media", "Sabec", "darts dev"], "esrb_rating": "Everyone"}