{"id": 326808, "slug": "march-on-the-hive", "name": "March On The Hive", "name_original": "March On The Hive", "description": "<p>A Tower Defense game where you place down Bees to defend your hive from the attacking Ants. Bees cost honey to place and upgrade, which is gained over time. Bees also have health and can be killed by ants (including while you are holding them) and can be upgraded to be more useful.</p>\n<p>Simply extract the .rar file and run the 'March on the Hive' executable.</p>\n<p>There is currently no tutorial, I do have plans to add one in the future. However, the game is mostly just clicking so it should be pretty easy to figure out without one.</p>\n<p>I do also have plans to update the art and sound effects, and add more levels, bees, and ants. The game is also default in my resolution (1600 x 900), other resolutions have not been tested, if you wish to do so though, be my guest, and any information you'd like to provide about doing so would be appreciated.</p><p>Please provide your feedback and share any bugs you encounter. I'd love to hear from you!</p>\n<p>There are currently 3 Bees and a Honeycomb to place:</p>\n<p>-Bumblebee: Shoots Stingers at the target.</p>\n<p>-Honeybee: Has an area of effect that slows nearby targets.</p>\n<p>-Honeycomb: Provides additional honey every few seconds, provides more honey for every bee touching it, and can be upgraded to increase maximum honey.</p>\n<p>-Wasp: Shoots out a bomb that explodes for high damage in an area of effect.</p>", "metacritic": null, "released": "2019-06-08", "tba": false, "updated": "2019-06-10T04:41:56", "background_image": "https://media.rawg.io/media/screenshots/3ce/3cee770c4148cd259eaec96842e8c01b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PsychoticHollow"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}