{"id": 326815, "slug": "dungeon-shuffle-agentaero", "name": "Dungeon Shuffle (AgentAero)", "name_original": "Dungeon Shuffle (AgentAero)", "description": "<p>Welcome to the official page of <em>Dungeon Shuffle</em>!</p>\n<p><em>Dungeon Shuffle</em> is an endless arcade game where the player must move left, right, up, or down in order to avoid fireballs being shot from all sides of the dungeon. It's single-player and requires no previous knowledge to play. Score is based on how many fireballs you dodge before you get hit. Try to rack up the highest score possible! (I would love to see some screenshots in the comment section!) The speed of the fireball increases as your score increases, so you'll need to stay on your toes! You lose when the knight gets charred by the fireball 3 times. </p>\n<p>Controls:</p>\n<p>W or Up Arrow - Move Up</p>\n<p>A or Left Arrow - Move Left</p>\n<p>S or Down Arrow - Move Down</p>\n<p>D or Right Arrow - Move Right</p>\n<p>Escape Key - Pause game</p>\n<p>My background:</p>\n<p>I've been learning C# through Visual Studio at school for the past year, and our final assessment was to create a game. That's where <em>Dungeon Shuffle </em>came from. I had to figure out how I could make a fun, unique game with the limited tools available on a Windows Form. I'm still hoping to add more to the game in the form of new levels and power-ups, but I'd love to hear any additional feedback that could help me make the game even better.  Again, don't expect anything amazing because this is the first real game I've created from scratch. Aside from that, have fun! I wish you good luck in the dungeon!</p>\n<p>**All art in the game (excluding the keys in the controls menu and the hearts that show  lives left) is originally created by me. Most things were drawn with reference but I still want to count that as original :)</p>", "metacritic": null, "released": "2019-06-08", "tba": false, "updated": "2019-06-10T04:43:22", "background_image": "https://media.rawg.io/media/screenshots/f49/f4948b001bf8a43451da649d1f14d6bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AgentAero"], "genres": ["Action"], "publishers": [], "esrb_rating": null}