{"id": 326911, "slug": "mugen-infinity", "name": "M.U.G.E.N Infinity", "name_original": "M.U.G.E.N Infinity", "description": "<ul><li><strong>This Game is based on the Mugen Engine [ In reality it's a total reconstruction based of the LEGACY 1.1 Screenpack] </strong></li></ul>\n<ul><li>What is mugen ? Mugen is a free to play Open source 2D fighting game developed in the 1999 by the Elecbyte with  unlimited possibility of editing and coding, For example you can add or create custom characters to your roster, using apposite programs like Fighter Factory, create or download from internet stages, Screenpacks, musics, characters, and game modes.</li></ul>\n<p><em><strong>This mugen edit it's a new definitive base where you can start from making mugen games, it includes the most of the Mugen archive and mugen Tournament Chars and Stages.</strong></em></p>\n<p><strong>In this page are availables two different edits : The EvE [2017 edition] and the new Infinity Mugen, with 1045 chars.</strong></p>\n<p><strong>They're both two complete games.</strong></p>\n<p><strong><em>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </em></strong></p>\n<p>Info : </p>\n<p>Freely Moddable Open Source Game [You can basically change everything] </p>\n<p>𝘤𝘩𝘢𝘳𝘴 : 1045 +</p>\n<p>𝘴𝘵𝘢𝘨𝘦𝘴 : 262 +</p>\n<p>𝘏𝘋 𝘎𝘳𝘢𝘱𝘩𝘪𝘤 : 𝘺𝘦𝘴</p>\n<p>𝘙𝘦𝘚𝘩𝘢𝘥𝘦 𝘍𝘪𝘭𝘵𝘦𝘳𝘴 [with unlimited editing] : 𝘺𝘦𝘴</p>\n<p>𝘤𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘢𝘯𝘥 𝘴𝘵𝘢𝘨𝘦𝘴 𝘗𝘪𝘹𝘦𝘭𝘢𝘵𝘦𝘥 𝘦𝘧𝘧𝘦𝘤𝘵 : 𝘍𝘪𝘹𝘦𝘥</p>\n<p>Key binding : Free key binding and Ps3 - ps4 - Xbox 360 - keyboard support ( even for the most of the other non brand Pads)</p>\n<p>If you want to add more characters you must use Vselect , a separate program</p>\n<p>which you can find here :  [https://gamebanana.com/tools/6090].</p>\n<p>There isn't any kind of limit about the editing you can do about this game : totally open source.</p>\n<p><strong><em>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </em></strong><br/></p>\n<p><em><strong>The Lore </strong>:  \" The excessive use of the Infinity gauntlet created a glitch inside the multiverse, creating the caos inside The Orderer of the realities, The evil and the good nature of the universe are collapsed recreating the primordial entity : Demiurge. Demiurge is the fusion of all the good and all the negative energy from all the multiverse  ; this caused  inevitably the splitting of the consciousness of demiurge, generating a god devoted to the destruction of universes. Demiurge  has only one intention ; to Destroy the creation of the multiverse, making to return everything to the nothing.</em></p>\n<p><em>Meanwhile, in the macrocosmic  reign of Hyperuranion, that contains all the universes createds by the imagination of all the abstract concepts and ideas createds by the mankind collective unconscious into the history, is becoming a weak structure :  the other universes can be invadeds by characters of other parallel universes, without limits. :  all the characters from all the universes of the collective imagination of mankind, are gathereds into an unique universe, where they will face together, and be all part of the Final cosmic  Tournament : The  M.U.G.E.N  Tournament, for arrive to defeat the final Boss : </em></p><p>: they must defeat the Master of  MUGEN : Demiurge-, and save the Hyperuranion, so all the fantasy of mankind imagination.</p>\n<p>Will be Everything vs everything,.. </p>\n<p>literally.</p>\r\nInfinity - Gameplay Showcase  :\r\n\n<p>In This Edited Alpha Build (Based on Mugen 1.1) , entirely modified By me [Starting from The Legacy screenpack by Noz ( v1.1) ] , you can choose between 1046 accurately selectable characters inside a themed roster with a chronological and skill order between one char and the other, there are 262 Stages , and a custom edited screenpack</p>\n<p><strong>You can have access to new chars, rare chars and unique chars, all collecteds inside this screenpack :</strong> custom and customizable musics ,custom and customizable Selection screen, customized and customizables functions.</p>\n<p>There are various different Game modes Plus some extra bonus stages [Nazi Zombies ,Resident Evil outbreak, alien invasion, karate Guys,clowns invasion survival,Apocalypse sentinels invasion]  and in the next release many others .</p>\n<p>Official Game Modes :</p>\n<p><strong>    1.Arcade</strong></p>\n<p><strong>    2. Versus</strong></p>\n<p><strong>    3. Team arcade </strong></p>\n<p><strong>    4. Team-versus</strong></p>\n<p><strong>    5. Team-co op</strong></p>\n<p><strong>    6. Survival</strong></p>\n<p><strong>    7. Survival Coop</strong></p>\n<p><strong>    8. Training</strong></p>\n<p><strong>    9. Watch</strong></p>\n<p>   [ 10.Parsec Multiplayer Co-op Mode]</p>\n<p> </p>\n<p><strong>[Options] </strong></p>\n<p>Keys : W,a,s,d movement,  Numpad menu selection and attack during the fights.</p>\n<p><strong>- Will you be capable to reach \"Demiurge\" The  Mugen Master  ?</strong></p>\n<p>Fight into the Arcade mode against 100 chars, and meet at the end the true Demiurgical Entity that created \" The MugenVerse\".</p>\n<p>Characteristics :</p>\n<ul><li>2d Marvel vs Capcom Style Game, with 8 bit characters, 16 bit characters,  and 32 bit characters.</li></ul>\n<ul><li>Roster of 1045 Characters and 262 Stages, free to be edited as you want (use Vselect for add chars!).</li></ul>\n<ul><li>Pixelate graphic issue Fixed and sharpened with the Free built in Reshade Plugins  for edit the game graphic as you want.</li></ul>\n<p>[You can add and create infinite shaders and filters for your game]</p>\n<ul><li> Stages from various games and themes, and exception fors some characters like the Mortal Kombat chars that have their own style, graphic and movesets.</li></ul>\n<ul><li>Infinite editing and infinite possibilities of modifying the game as you want.</li></ul>\n<ul><li>Free to modify it as you want ( you can partecipate to this project, and implement whatever kind of modify to the game, [must be approved by the creator for being inserted in the official future releases] nonetheless, you can apport modifies to your custom mugen game and maintain yours the ones not accepteds into the final builds of this serie.</li></ul>\n<p>The famous 2D Fighting game engine is Back ; This time totally recreated and optimized : there is  Literally Everything versus Everything. </p>\n<p>The characters are from various universes, as :</p>\n<p>Comics [All the MARVEL Universe] All the DC Universe, Some  Cartoon characters, Video Games, Anime,  Manga,  Movies, Fiction and POP culture,and even Memes, Internet Culture and religious Themes, Like the hierarchy of Angels and Some Gods as Bosses, from the Myths of different Cultures.</p>\n<p><strong>Mortal Kombat Team Vs Tekken Team </strong>[<strong>4</strong>vs<strong>4</strong> <strong>M</strong>ode] <strong>:</strong></p>\n<p> This is the definitive Experience with the Retro 2D fighting games like Marvel Vs Capocom or Mortal Kombat .</p>\n<p> and this time .. even with a weak possibility to avoid the single player mode, and playing with a multiplayer experience, using programs like Parsec.</p>\n<p> Will you be so much Lucky to finish the Arcade Mode and defeat 100 chars into  one single  Run ?  You can discovert this, Only Playing it, and exploring every, single character, from the most weak to the most Cheap, from the kids characters, to the gods of the Religions.</p>\n<p>In the Game There isn't a real end :  It's simply everything vs Everything ; <br/>have fun,  MUGEN is always unlimited and you can in future add whatever char you want</p>\n<p>edit as you want, and edit it be however you want it.</p>\n<p>[Edit] : Use this for Salty bets, or Online Tournaments.</p>\n<p>[Edit] Story Mode is thought to be in Development.</p>\n<p>[Edit] External Help and Collaboration for the IKEMEN Implementation for a better multiplayer Experience, Is accepted and i have the arms opens for anyone wants to help me with the coding of a real Multiplayer Mode implementation.</p>\r\nEvE Old Edition :", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2019-08-28T23:15:58", "background_image": "https://media.rawg.io/media/screenshots/469/469c73988be9af06094c4028f159c396.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shaxer"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}