{"id": 326924, "slug": "chesslike", "name": "ChessLike", "name_original": "ChessLike", "description": "READ THIS BEFORE PLAYING THE GAME...\r\n\r\nGameplay :\r\n<p>This game has 5x5 grid, each tile in the grid has a Chess icon attached to it.<br/></p>\n<p>\n</p>\n<p>The player/enemy character stands on any particular tile will follow the rules of that particular chess piece.</p>\n<p>\n</p>\n<p>So, the player/enemy character will keep change itself to different chess pieces whenever it takes a step on to a different tile on the grid.</p>\n<p>\n</p>\n<p>\n</p>\r\nIt’s a turn based game. The player has 2 moves per turn. And the enemies has 1 move per turn. \r\n The red spot on the grid represents the danger spots where an enemy can attack the player. So, you need to avoid the red spot when your turn is over.\r\n\r\n\r\nStanding onto enemies will kill them and by killing them you will earn Kill credits.\r\n\r\n\r\nYou can use this “Kill Credits” to capture tiles which has “Star” icon on it. \r\n\r\n\r\nThis game has 8 rooms and each room has some tiles to be captured. Capturing all the available tiles from the room will take you to the next room.\r\n\r\n\r\nCapturing all the 25 tiles in the Grid is the moment you win the game. \r\n<p>\n</p>\n<p>During the game, you can collect coins from the grid. And which can be used for power ups.</p>\r\nPower ups :\r\n<p>\n</p>\n<ul>\n<li>Skip a turn (Costs you 1 coin)</li>\n<li>Freeze an enemy (Costs you 2 coins)</li>\n<li>+1 Move (Costs you 3 coins)</li></ul>\r\nControls :\r\n<p>Mouse Supported ;</p>\r\n\r\nUse your strategy to kill enemies, capture tiles, collect coins, use power-ups and break the game without getting killed.", "metacritic": null, "released": "2019-06-07", "tba": false, "updated": "2019-06-10T05:11:17", "background_image": "https://media.rawg.io/media/screenshots/5ac/5ac483938eb8980c44c1f34fe30b46ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jambav"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}