{"id": 327026, "slug": "water-slide-sim-games-2018", "name": "Water Slide Sim Games 2018", "name_original": "Water Slide Sim Games 2018", "description": "Welcome to the water slide games or water amusement park games with mega ramp water slider tracks. In this mega ramp water slider 2018 join water slider racing on the vertical mega ramp and join your friends in water slider adventure 3D in water slider game.  Mark full stop on the other rest of roller coaster rides, amusement park of impossible tracks and water slider rush and join fantasy fun land adventure games of water slide on mega ramp tracks. Mega ramp water slider 2018 or water amusement rush is the best waterslide 3D simulator game. Experience all the thrills &amp; entertainment of 3D aqua water adventure in the water park and feel the real water slider downhill adventure on your mobile without leaving the comfort of your home. Water Park racing game, Water slider adventure is the best 3D water slide simulator game where you can enjoy dozens of loops, incredible speeds and exhilarating drops whether you're on a water boat, or your bare skin on mega ramp water slide games. <br/><br/>Prepare yourself for a Mega Ramp Water Slide Games or water splashing season of water par racing games.  Add some real water slider fun with mega ramp slider track games and enter to the new word of water slider adventure. Experience a lot of fun and feel a crazy water slide entertainment urge in this water slide pool games or best water sliding adventure game. Have slide in Water Park or water slide extreme adventure stunt as long as you can perform crazy water stunts on beautiful 3d water slides and run through your way in sliding paths of this amazing water slide games. Experience endless fun of sliding racing adventure and do impossible water stunts in the water park. Feel the rush of sliding in your blood as your race is started, with fun and high scores. <br/><br/>Just play best water park games or water slider downhill adventure to have the amazing time in the water park. Get on the water park slide on the simulated water to experience the unseen fun as water slide ride 3d is full of fun and happiness all you want. The free water park slide 2018 or impossible water slide or mega ramp water slider is among free water fun games where you witness real water slide race all at one place. The water park game is packed with free sliding fun, which has all the flavors of best simulation games. Don’t miss the chance of becoming the water park stuntman by winning this water slide ride in pool. <br/><br/><br/>Features:<br/>-\tSuper water sliding adventure environment<br/>-\tExtreme water slide racing stunt adventures<br/>-\tChallenging and amazing mega ramp track slides<br/>-\tBest water slider downhill adventure<br/>-\tHigh quality graphics with super sound effects<br/><br/>Download Fun For Free!", "metacritic": null, "released": "2018-05-26", "tba": false, "updated": "2019-10-22T14:39:55", "background_image": "https://media.rawg.io/media/screenshots/58e/58e7b92631551650e807e026dc38afef.jpg", "website": "https://www.facebook.com/gillugames/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Farrukh Liaqat"], "genres": ["Adventure", "Simulation"], "publishers": ["Farrukh Liaqat"], "esrb_rating": "Everyone 10+"}