{"id": 327018, "slug": "6-poker", "name": "6+ Poker", "name_original": "6+ Poker", "description": "Texas Hold'em is the top best casino poker game in the world. 6 Plus hold'em (or Short Deck) is a new hot and popular live multiplayer card iphone app for mobile player from Pokaa Entertainment. Your take free chips, share a VIP poker table, join Tour and fight in the deluxe League Seasons with global online or offline friends, and become the king fighter of wars. It's cool and all for FREE. Let's go to play!<br/><br/>=== AMAZING FEATURES ===<br/><br/>● Funny Texas Hold'em<br/><br/>6+ porker rules are simple with less cards. It booster the fun of cosio slot or blackjack21, while retaining the full skills of Hold'em or Gin Rummy. It's friendly to both begginer and master Texas players. Even if you don’t know how to play poke before, you can still get started easily. This is what you can't play in Las Vegas.<br/><br/><br/>● More Chips<br/><br/>6 people use short deck games, which greatly accelerates the rhythm of the game and improves the excitement of the ganes. You can win more chips at the same time.<br/><br/><br/>● League Season<br/><br/>Free to join the daily tournament in different stakes. because you can join or leave at any time.Take part in the weekly exciting season, earn points and earn your rank honor.<br/><br/><br/>● Big bonus<br/><br/>Rich bonus and rewards, you can get free porker golden coins every 4 hours and everyday, and get rewards for level up or rank up and so on. The more you play, the more chips you get.<br/><br/><br/>● Interesting interactions<br/><br/>You can watch other people's games and send them interesting interactive expressions or emoji face.<br/><br/><br/><br/>=== THE DIFFERENCE ===<br/><br/>The difference between 6+ Texas Holde'em and stand Texas Hold’em:<br/><br/>● The deck if from \"6\" to \"A\". It take out the 2’s, the 3’s the 4’s and the 5’s.<br/><br/>● Ace can be 5 as lowest ranking card.<br/><br/>● Each round is begin from next seat of Dealer(even if in proflop rounds).<br/><br/>● No Small Blind an Big Blind, but has Ante<br/><br/>● Hand rankings :Straight Flush &gt; Quads &gt; Flush &gt; Full House &gt; Straight &gt; Three of a Kind &gt; Two Pair &gt; One Pair &gt; High Card<br/><br/><br/><br/>=== CONNECT US ===<br/><br/>Play 6-Plus Hold’em for free TODAY and join the new poker app out there!<br/><br/>Connect with us on Facebook (https://www.facebook.com/6pluspoker)<br/><br/><br/><br/>=== ATTENTION ===<br/><br/>This product is intended for an adult audience. This product does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.", "metacritic": null, "released": "2018-09-01", "tba": false, "updated": "2019-10-22T14:39:54", "background_image": "https://media.rawg.io/media/screenshots/c8e/c8ee7b58ea79187771f4c13118d92b94.jpg", "website": "https://www.facebook.com/6pluspoker", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pokaa Studio"], "genres": ["Card"], "publishers": ["Pokaa Studio"], "esrb_rating": "Teen"}