{"id": 327099, "slug": "slipslop-itch", "name": "SlipSlop (itch)", "name_original": "SlipSlop (itch)", "description": "<p><strong>SlipSlop is a minimalistic one button platformer</strong> game where all you can do is jump and your goal is to go from platform to platform till you reach the top in as short of a time as possible. </p>\n<p>It sounds simple, but all the platforms behave differently and add a lot of variety and puzzle elements, and can make the game difficulty be all over the place making it<strong> one of the hardest platformer games you will ever play.</strong></p>\n<p>There are 3 main types of platform material: platforms with little friction; frictionless; and sticky (100% friction) platforms.<br/>The said platforms can have multiple behaviours: they can move both ways or one way or be static; they can disappear; destroy on touch; and they can be accelerator platforms.<br/>The speed, size and range of the platforms is also a put in the equation.</p>\n<p>All these variables can not only make each level a completely different puzzle from the previous one, but each level can be completed in several different ways which can make the game quite challenging if you are after the high score.</p>\n<p>Also, the start menu is an infinite level to help you warm up and practice :)</p>\n<p><strong>Because the levels can have all sorts of variety and difficulty I would greatly appreciate it if you gave me some feedback about what kind of levels you prefer.</strong></p>", "metacritic": null, "released": "2019-06-10", "tba": false, "updated": "2019-06-10T13:28:59", "background_image": "https://media.rawg.io/media/screenshots/04b/04b4a3d122a897f17646ee4fff3833b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["0taste"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}