{"id": 327051, "slug": "dress-up-ice-princess-dress-up-games-for-kids-prem", "name": "Dress Up Ice Princess - Dress up games for kids - PREMIUM", "name_original": "Dress Up Ice Princess - Dress up games for kids - PREMIUM", "description": "version without advertisements .Pretty up these beautiful frozen princesses from today by choosing different looks and fashion accessories. Download the app for free; it is the perfect game for every girl. Become the fashion designer and personal shopper of these pretty girls. Fun and amusement are guaranteed! The best game for girls! <br/>•\tBegin the hairdressing session and pick a hairstyle from the different possibilities (updos and long or short hair). <br/>•\tDecide whether you prefer her blonde, brunette or redhead. <br/>•\tStart the makeover, we offer you many forms and colors of mouth and eyes.<br/>•\tDress her up. Choose between different clothing styles and designs for every event.<br/>•\tThere are garments such as tops, skirts and trousers or dresses. You can also pick the shoes you like the most. <br/>•\tChoose the most suitable accessory.<br/>•\tApp perfect for mobile and tablet. It has a simple design, so girls from every age can use it: from girls at nursery school to teenagers. <br/>You can save the image at your image gallery and share it via any social network or any other program that you have on your phone. If you liked the app, vote it, please, because it helps us to improve them. Thank you!", "metacritic": null, "released": "2015-05-10", "tba": false, "updated": "2019-10-22T14:39:57", "background_image": "https://media.rawg.io/media/screenshots/d19/d1979e7c69262148d289724aa68ff905_7FBwyBu.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["intelectiva"], "genres": ["Family"], "publishers": ["Intelectiva Soluciones Innovadoras Sociedad Limitada"], "esrb_rating": "Everyone 10+"}