{"id": 327102, "slug": "deadly-kawaii-arena", "name": "Deadly Kawaii Arena", "name_original": "Deadly Kawaii Arena", "description": "<p>D.K.A is an Ultra-Fast FPS Game, in Arena.<br/></p>\n<p>Your goal is to kill the other players by using the differents traps displayed in the arena, yet, you can only repulse or attract what's in front of you know. To help you on your killing spree, you'll have lot of movements mechanics such as air controls, rocket jump, and an unique feature : the gravichange. You can change your gravity by just walking towards another wall and then have a totally new perception of the Arena!<br/>To win the game, you'll have to move around, push your opponents and be the most aggressive possible to stock points. Then, kill someone to validate your points. The first to 300 validated points wins the game!<br/><br/>Right now D.K.A is a Multiplayer game, but only in LAN. If you want to play with your friend, you'll need to be on the same connexion.<br/><br/>We've made this game on Unreal Engine and we wanted to make a Quake-Like, a type of a game who have kinda faded away. We also wanted to make \"The Rocket League\" of the FPS, but even more agressive, fast and funny to play. We really hope you'll love our game and have a great time playing it! <br/><br/>You can check our trailer here :<br/>https://www.youtube.com/watch?v=-SM0kq8tS90<br/>You can find us on facebook : <br/>https://www.facebook.com/DKATheGame<br/><br/>Deadly Kawaii Arena is a game created by 5 students at the IIM, in France :<br/>Louis Guillon - Artistic Director &amp; Graphic Designer<br/>Naël Evain - Game Designer<br/>Charles Mainka - Developer<br/>Werner Frenoy - Integrator<br/>Matthieu Mignon - Executive Producer &amp; Marketing<br/></p>\n<p>You can contact us here for more professionals questions :<br/>deadlykawaiiarena@gmail.com</p>", "metacritic": null, "released": "2019-06-10", "tba": false, "updated": "2019-06-10T13:29:54", "background_image": "https://media.rawg.io/media/screenshots/39c/39ce22e7e4230ebcd1336f27f9e32948.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deadly Kawaii Arena"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}