{"id": 327238, "slug": "empire-of-sin", "name": "Empire of Sin", "name_original": "Empire of Sin", "description": "<p>Empire of Sin, the strategy game from Romero Games and Paradox Interactive, puts you at the heart of the ruthless criminal underworld of 1920s Prohibition-era Chicago. It’s up to you to hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. This character-driven, noir-inspired game puts players smack dab in the glitz and glamor of the roaring 20s, all while working behind the scenes in the gritty underbelly of organized crime.</p>\n<p>Build A Crime Empire: Raise your criminal empire from the ground up by selecting your racket of choice (be it speakeasies, union protection, or casinos) and building a team of loyal mobsters to make your mark on the streets. Once you make a name for yourself, expand your influence by taking over rival territory and add more endeavors to your repertoire.</p>\n<p>Defend and Expand Territory: If it comes to blows, hypothetically of course, and your posse needs to send a message, face off in brutal turn-based combat. Strategically recruit your goons and build a strong chemistry within your crew to maximize combat damage and help secure your hold on the city. </p>\n<p>Living, Breathing World: Explore the streets of vibrant 1920s Chicago and interact with a full cast of living, breathing characters each with lives of their own that inform how they react to what you do (or don’t do). Schmooze, coerce, seduce, threaten, or kill them to get your way.</p>\n<p>Wield Your Influence: Make and break alliances, bribe cops, and trade on the black market to raise your faction rating and expand your crime family. But always keep your enemies close and ensure you have a mole on the inside and eyes everywhere.</p>\n<p>Multiple Victory Strategies: Whether you make it to the top with violence, social influence, or city-wide notoriety, there are a number of ways to become King or Queen of Chicago. With various starting conditions and constantly changing crew dynamics, no two playthroughs will ever be the same.</p>", "metacritic": 56, "released": "2020-12-01", "tba": false, "updated": "2023-12-24T06:23:36", "background_image": "https://media.rawg.io/media/games/7a5/7a578aecba92b011053b66ac79e73703.jpg", "website": "https://www.paradoxplaza.com/empire-of-sin/ESES01GSK0000001-MASTER.html", "rating": 2.78, "rating_top": 3, "added_by_status": {"yet": 47, "owned": 380, "beaten": 13, "toplay": 92, "dropped": 40, "playing": 2}, "playtime": 6, "achievements_count": 199, "ratings_count": 54, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 54, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC", "macOS"], "developers": ["Romero Games"], "genres": ["RPG", "Strategy"], "publishers": ["Paradox Interactive", "ParadoxInteractive"], "esrb_rating": "Mature"}