{"id": 327278, "slug": "1945-air-force", "name": "1945 Air Force", "name_original": "1945 Air Force", "description": "The classic, long-run shooting game from the 90s like 1941, 1942, 1943, 1944, 19xx has been perfectly remade for smartphones. With its simple concept and endless fun, 1945 Air Forces is now available on your mobile devices to enjoy again.\t<br/><br/>1945 Air Forces - is a masterpiece remake of the classic arcade experience! The controls are easy to learn and use, which recalls the exact feeling of playing in an arcade.\t<br/>16 famous WWII combat planes are available for military fans to choose from. Competitive Leaderboard and Achievements. <br/>Supports all kinds of devices, includes phones with low specifications and tablets.\t<br/><br/>Features<br/>- Perfect Shoot ‘em up: Lots of fighter jets, battle companions, ammunition and guns, and devices to choose from: your personal armory is packed with hi tech! And you can play game offline.\t<br/>- Exciting campaign: more than 100 levels full of enemies and breathtaking action!\t<br/>- Additional modes: Bombarding, Bosses and Protect, each of them radically changes the gameplay!\t<br/>- Huge bosses: battle and defeat enemies that are so big they don't even fit the screen! And wipe out swarms of their minions! Find pieces of the Danmaku barrage of bullets.\t<br/>- Great visuals: Tired of space shooter and lasers? Try out flying! Shoot 'em up has never been better. Epic sky wars are full of excitement. Choose your airplanes and free the country from invaders. The symphony of air war and heroes' charisma are unforgettable!\t<br/>- Retro modernized: Played Shmup (STG) games before? This top-down shooter will make you say «wow», and revive the best nostagic arcade experience. No matter if you are a fan of Strikers, Tyrian, Ace Squad, Razor or Airborn, or participated in battle actions in Sky Force. You will become the fan of our series 1945 Air Force\t<br/>- Future update: PvP, Co-op, Friends….\t<br/><br/>Make your choice - take your airplanes to victory. Feel the bullet force!", "metacritic": null, "released": "2019-05-28", "tba": false, "updated": "2023-02-01T16:51:32", "background_image": "https://media.rawg.io/media/screenshots/dcb/dcb05ed0691250b9b8b2a0b14332f142.jpg", "website": "https://www.facebook.com/1945ClassicArcade/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["ONESOFT GLOBAL PTE"], "genres": ["Action"], "publishers": ["ONESOFT GLOBAL PTE"], "esrb_rating": null}