{"id": 327256, "slug": "supermarket-shriek", "name": "Supermarket Shriek", "name_original": "Supermarket Shriek", "description": "Join man and goat in this chaotic, award-winning couch-co-op adventure! Tackle outlandish obstacle courses, complete rewarding challenges and dodge deadly obstacles in a hectic race to the checkout! Packed with a frantic 38 stage campaign and 4 hilariously fun PvP party modes for 2-8 players. <br/><br/>Scream like a man! Scream like a goat! Scream together! <br/><br/><h3>A Couch Co-op Experience Like No Other</h3>Propel our two heroes through supermarkets, shops and boutiques using their wild, incomprehensible screams!<br/><br/>Goat Screams: Kart Turns right!<br/>Man Screams: Kart turns left!<br/>Scream Together: Kart powers forward!<br/><br/>Use your controller triggers to make each of the duo scream - or hook up two mics and *literally* shriek your way to victory!<br/><br/><h3>4 PvP Party Modes for 2-8 Players</h3>Collect all the items in the fastest time in <strong>\"Shopping List\"</strong>, dominate the arena in an epic clash of man, goat and trolley in <strong>\"Sumo\"</strong>, scream as though your life (or indeed, some points) depended on it in a <strong>\"Race\"</strong>, and finally just survive as long as you possibly can in <strong>\"Elimination\"</strong>. <br/><h3>Action-Packed Story Mode</h3>The 38 stages include outlandish obstacle courses, rewarding challenges, time-limited collectathons and not forgetting the-mode-where-you-knock-over-the-tins-of-beans. <br/><br/><h3>A World of Insane Obstacles</h3>Behind each shopfront, expect a relentless stream of obstacles blocking your way to the checkout! From the mundane (conveyor belts, spillages) to the absurd (fire pits, swinging axes, sumo wrestlers &amp; more!).<br/><br/><h3>Experience \"Duet\" Co-Op Mode</h3>Yes, you and a friend can *literally* shriek your way to glory by controlling the action using a mic. A mode that will certainly have your neighbours talking!<br/><h3>Dress to Impress</h3>Customise the appearance of your characters with over 50 customisation options!  Choose from a range of excellent shirt &amp; tie combos, as well as some outlandish headgear!<br/>", "metacritic": null, "released": "2019-09-06", "tba": false, "updated": "2023-11-04T22:04:17", "background_image": "https://media.rawg.io/media/screenshots/1a9/1a978036ca14a26c041bb7d5fe50b67a.jpg", "website": "http://www.supermarketshriek.com", "rating": 2.83, "rating_top": 3, "added_by_status": {"yet": 9, "owned": 218, "beaten": 2, "toplay": 5, "dropped": 40, "playing": 4}, "playtime": 1, "achievements_count": 82, "ratings_count": 46, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 46, "platforms": ["PC", "Xbox One", "Nintendo Switch", "PlayStation 4"], "developers": ["Billy Goat Entertainment"], "genres": ["Adventure", "Racing", "Arcade", "Casual", "Indie"], "publishers": ["PQube"], "esrb_rating": null}