{"id": 327325, "slug": "foodie-tower-idle-shop-tycoon", "name": "Foodie Tower: Idle Shop Tycoon", "name_original": "Foodie Tower: Idle Shop Tycoon", "description": "I’m often out of place because I look different from others. Facing their mockery, as a person who has nothing but a good appetite, I will change the world with gourmet. No, I will conquer the universe with gourmet!<br/>                                                  ——A message from Prince Poppy<br/><br/>Foodie Tower is an idle shop operation game developed by Corn Game Studio. In this game, you will run a number of food shops and create a tasty tower of your own! Earn huge profits, unlock more planets and conquer the universe with tasty food! Or recruit assistants and build a league of shop managers! Each type of food corresponds to a distinctive R&amp;D system, which will challenge your cooking skill!<br/><br/>[Game Features]<br/>- Easily tap and play to expand your tasty tower.<br/>- Recruit all kinds of shop managers, match them in dozens of ways to assist you to accomplish your great course of food empire.<br/>- Various unique food R&amp;D system, hundreds of delicious food waiting for you.<br/>- Stock market simulation. Invest properly and make a fortune!<br/><br/>The foodie prince builds a food empire from scratch!<br/>Tap and play to become a billionaire easily!<br/>Build a tasty tower and conquer the universe with delicious food!<br/>Recruit assistants and build a league of shop managers!", "metacritic": null, "released": "2019-01-17", "tba": false, "updated": "2019-08-19T03:34:32", "background_image": "https://media.rawg.io/media/screenshots/386/386d9da745559f9b63a72d897954ce9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beijing Corn Network Technology Co.,Ltd."], "genres": ["Strategy", "Simulation"], "publishers": ["Beijing Corn Network Technology Co"], "esrb_rating": null}