{"id": 327337, "slug": "vacation-adventures-park-ranger-hidden-object-adve", "name": "Vacation Adventures: Park Ranger - Hidden Object Adventure Game", "name_original": "Vacation Adventures: Park Ranger - Hidden Object Adventure Game", "description": "Spend a glorious summer working as a Park Ranger searching for hidden objects in a stunning National Park.  Visit areas of outstanding natural beauty including gorgeous forests, idyllic lakes, cool woodland trails and awesome mountain vistas.<br/><br/>Search for carefully hidden objects in beautifully scenic levels and solve challenging mini puzzle games set in the great American outdoors.  Clean up the park in this unique HOG game and do your bit for the environment by collecting all the bonus trash items to recycle.  Earn extra bonuses for finding all the lost and found items which careless tourists have left strewn around the park. Can you find all the bonus objects without using any hints? A fantastic hidden object game for all generations of the family.<br/><br/>Features include:<br/>•Play trial levels for free to see just how great the game is<br/>•Beautifully themed hidden object scenes<br/>•Stacks of challenging puzzle games<br/>•Multiple game modes with progressive difficulty - great for all ages from kids to grandparents<br/>•Wonderful sound track<br/>•Play as one of two characters<br/>•Optimized for your mobile device<br/>•A true gem of the HOG game genre<br/>•The first hit HOG game in a great successful series<br/><br/>If you enjoy hidden object games that relax and sooth away the stresses of the day, then this is the HOG game for you and all ages of your family. No eye strain here, just gorgeous pictures of national park locations interspersed with challenging puzzle games to train your brain.<br/><br/>Enjoy time with your friends and family, young and old, exploring Pine Creek Hills National Park and don't forget, you get to play this gorgeous HOG game for free to see if you enjoy before you pay for it, which we know you will! Please note this is not a free game, but it does include free levels for you to try before you buy", "metacritic": null, "released": "2015-11-03", "tba": false, "updated": "2019-06-14T02:27:32", "background_image": "https://media.rawg.io/media/screenshots/a61/a61eb817c217fe886357892167bd5f16.jpg", "website": "http://www.casual-arts.com/va_parkRanger/va_parkRanger.shtm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["CasualArts"], "genres": ["Adventure", "Family"], "publishers": ["Filematch"], "esrb_rating": "Everyone 10+"}