{"id": 327402, "slug": "epic7706", "name": "EPIC#7706", "name_original": "EPIC#7706", "description": "<p>This game is a school project, made in our second semester.  This game was made over a period of six weeks, and is a very early prototype of the game that we really want to make. </p>\r\nStory\r\n<p>The year is 2254 and sightseeing has gone beyond the borders of the Milky way for the richest in society. Huge cruise ships fly at a monthly basis from earth and to a never before explored planet chosen in a lottery of the remaining unexplored planets within reach. Allowing the people onboard to be the first to set foot and name the planet. Now at this point no life except for that of humans from earth has been explored. However for safety measures, each of the cruise ships has an Extreme Planetary Investigation Cyborg or EPI-C. These were made to survive the harshest of conditions that space had to offer as well as the most prolific combat AI available at the time. This is a story that takes place June 27th 2254 on the cruise ship “Faraway Utopia”. After spending two weeks on a new planet further away than any ship had gone thus far and on its way home, a passenger who had come to lay sick 2 days prior suddenly began a horrific transmutation in the privacy of his cabins bed. He would expand to a size larger than the cabins bedroom and living room combined. Unrecognizable shortly after this process began, he would start letting out a hideous oder that slipped through the air vents of the ship. Before long many more would fall sick. But this time, the sickly transformed into human sized monstrosities that began attacking the ship and its residents. It was not long before the majority of the ship had either turned or locked themselves in the bridge of the ship. The captain, Arco Bloomwood, was left with no choice. He could not return the ship any further with this infectious air, since the consequences could be far too dire should this be let out onto earth. He had one option left. He went to the emergency room of the bridge and started booting up EPI-C#7706, nervous since this would be his first encounter with this machine he took a few steps back. As the pod the cyborg had been stored in opened and he stepped out, Arco looked it in the eyes and said “Hi, i am the captain of this ship. We are currently under attack by an unknown enemy. We can’t return back to earth before this situation has been defused… EPI-C#7706 every last living soul on this ship is counting on you, we won’t make it out of here without you... weapons... and the extermination of every single last one of those fuckers”</p>\n\r\nCharacters\r\n<p> Arco Bloomwood: At a young age Arco ran away from home, his parents both drinking alcoholics. But as the years have come to pass Arco can’t really remember exactly how old he was when he made his escape. After his escape, and with nowhere to go, Arco had to try and make a living begging for money around the docking bay for the cruise shuttles as mostly rich people and crew members of the ships would traverse these parts of the city. One day however, the ship “Faraway Utopia” got a new young captain as the old one had passed away. This young man took notice to Arco a couple of months after becoming the captain. Taking pity on the child, he offered Arco a job on the ship to help around the kitchen and cleaning duty. But as he grew older, Arco would get task requiring higher amounts of responsibility. Until one day, the now older captain would offer Arco the honor of being this ships new captain, as he himself would retire from spacefaring. Arco did not hesitate to take the offer. Now, a capable captain and many years older Arco had a reputation as one of the best captains in the city. Arco is pretty tall, with short blond hair, and pretty subtle beard stubs. He’s pretty well build and would be almost impossible to spot without a smile on his face. As a person he is quick to make decisions, and stand by what he has done. For the most part he remains calm and in control, to spread a sense of calm to the crew no matter how tense the situation may be. But if pushed to far, even Arco can lose his calm, witch mostly results in a nervous stutter and less decisiveness. </p>\r\n\r\nDuring the game\r\n<p>As you, EPI-C#7706, make your way to the bridge after preparing yourself in the emergency room, Arco is waiting for you with a worried look on his face. “It’s good that you’re ready to help. Currently we have no control over any parts of this ship safe for this room and the airlock leading to the hallway. The first thing we need to do is work our way to the kitchen and secure food for the remaining survivors. That would require control of the bridges hallway. So that is where you will start. Oh, and by the way, take care, we don’t really have any intel on the enemy or what they are capable of.” You will then make your way to the Bridge hallways, where the first mission will take place. This will be an area of mostly corridors with a few connecting rooms, forcing you to take on the enemies head on with a hope to teach combat. </p>", "metacritic": null, "released": "2019-06-13", "tba": false, "updated": "2019-06-14T02:56:17", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b861a0d710658a10b9ff7a3f1d7828b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mamokaj"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}