{"id": 327413, "slug": "puyo-puyo-for-trans-pride", "name": "Puyo Puyo For Trans Pride", "name_original": "Puyo Puyo For Trans Pride", "description": "<p>CONTROLS:</p>\n<p>Arrow keys for movement,</p>\n<p>Z and X for rotation<br/></p>\n<p>If you're relatively good at puyo this game will be <em>way too easy</em> because there's only three colors on the trans flag.  It makes a decent trainer for learning to do the easier combos like stair stacking.<br/></p>\n<p>The backstory:  I came out as trans this year, so i figured I should take part in Pride this year as well.  But I don't live near a parade, so what's a girl to do?  A friend had an icon on steam or something that said \"DRACO IS TRANS\" and I was like \"yeah that makes sense to me\" so I decided this is what I was going to do for Pride this year.  I started with the cute puyos because I wanted to get back into pixel art after a small break and it kind of snowballed from there. <br/><br/></p>\n<p>There are some bugs in this project that still exist because I wanted to get this out for Pride 2019.  <br/></p>\n<p>Specifically: Sometimes you can phase through puyos by rotating at the right time.  It can replace puyos you already placed so lets just call it an advanced tech.  Also, sometimes the gravity step will get skipped somehow and you'll end up with a floating puyo.  Not sure what the deal with either of those bugs is.</p><p>Also, scoring isn't exactly the same as in the original puyo games.  If anyone knows how the group bonus is supposed to be counted I could add it eventually.<br/></p>", "metacritic": null, "released": "2019-06-13", "tba": false, "updated": "2019-08-28T23:15:56", "background_image": "https://media.rawg.io/media/screenshots/6c1/6c1aa2ee611151a92774706eda96fd8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grace"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}