{"id": 327588, "slug": "virus-hunter-reborn", "name": "Virus Hunter Reborn", "name_original": "Virus Hunter Reborn", "description": "<p>(Uploaded for historical purposes, see below.) †<br/></p>\n<p>You must destroy all the viruses before they infect you. Shoot to kill!</p>\n<p>This game is fairly easy and gets progressively harder as you get past each wave of viruses. You start off in the safe zone where no viruses can infect you. Right when you leave the room, be ready to kill them all!</p>\n<p>Controls:<br/>- Arrow keys to move <br/>- Left click to shoot<br/>- F3 to input a cheat code (I don't remember what any of the codes are)<br/></p>\n<p>Known bugs:<br/>- When shooting, the bullet travels very off-center of towards the reticle. This is due to the reticle sprite not being properly centered.</p>\n\n<p>† This was the first game I ever made, way back in August of 2009. I was 13 years old. It was made using Game Maker 8.0. I'm uploading the game here for historical purposes and because this game holds a place in my game designer heart. Here is the original Game Maker Community post where I first published the game:<br/>http://gmc.yoyogames.com/index.php?showtopic=445856&amp;hl=%2Bvirus+%2Bhunter<br/><br/>Please feel free to leave a comment below about the game, or tell me about the first game you ever made and what it means to you. I appreciate all feedback.</p>\n<p>Obviously, this game will not be receiving updates or bugfixes.<br/><br/></p>", "metacritic": null, "released": "2019-06-12", "tba": false, "updated": "2019-06-14T03:44:37", "background_image": "https://media.rawg.io/media/screenshots/8ab/8abac79d6f6dffac407d304fb320791f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HoofedEar"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}