{"id": 327511, "slug": "starship-rubicon-itch", "name": "Starship Rubicon (itch)", "name_original": "Starship Rubicon (itch)", "description": "<p>Starship Rubicon is a modern take on the classic space shooter genre. It's a smart and challenging rogue-lite that features a unique control scheme, pixel art remixed with real NASA photographs, and an existential crisis about who is REALLY the monster.</p>\n<p>In Starship Rubicon, Earth has been casually destroyed by a mysterious race of space-faring invertebrates. You are a fighter pilot whose cryopod has been collected by a possibly-insane AI, who has placed you in the unenviable position of being humanity's savior. Shanghaied and alone, you must gather the remaining human survivors and traverse the surprising biodiversity of deep space to find a new home.</p>\n<p>Key Features</p>\n<ul>\n<li>Quick Gameplay - Pilot your ship in fast-paced shoot-em-up, featuring a unique approach to arcade physics and controls.</li><li>Customize Your Ship - Upgrade your ship with a Tetris-styled hangar bay as you find weapons and items on your quest.</li><li>Randomized Universe - Make your way through a diverse galaxy as you encounter interesting new lifeforms. Each play session generates a new path of enemies, allies, and items.</li><li>Casual Roguelike - When your ship blows up, that's the end of the line for that game. However, if you collect enough crystal shards by the end of a sector you can save your ship to re-launch it on another level.</li><li>A Fleet Of Ships To Play - Do you prefer fast ships for run and gun? Do you like something that takes a punch but isn't as agile? Start the game with 3 different ships and spend shards to unlock more ships with unique abilities!</li><li>Mod-friendly - Since ships and weapons are exposed in simple external .lua scripts, modding and creating your own content only requires a text editor!</li></ul>\n<p>Vote for us on Steam Greenlight, get a Steam key here when we make it:</p>\n<p>http://steamcommunity.com/sharedfiles/filedetails/?id=331311253<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-06-14T03:24:28", "background_image": "https://media.rawg.io/media/screenshots/72a/72a9bbf57a0fd14d12ac768a2defa6f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["wick"], "genres": ["Action"], "publishers": [], "esrb_rating": null}