{"id": 327605, "slug": "requiem-for-a-puppet", "name": "Requiem for a Puppet", "name_original": "Requiem for a Puppet", "description": "<p>Synopsis:</p><p><em>Cold, alone, the Puppet awakens in the darkness of an abandoned theatre, with no memory of who it was, or is. Guided by the radiant light of a spirit with unknown intentions, the Puppet is drawn into a shambolic performance of sleeping beauty, where the cast are clueless, and the dragons deadly.<br/></em></p>\n<p><em>Manipulating the eerie music that echoes through the theatre as it's guide, the Puppet must make it's way towards the performances climax, and discover the true nature of it's existence.</em></p><p>----------------------------------------------------------------------------------------------------------</p>\n<p>Developed as a Rhythm Mechanic prototype for a Masters Course in game design, Requiem for a Puppet is a short Rhythm based platformer taking place in a subversive performance of sleeping beauty. Players take control of the Puppet, a faceless, lost soul who must make his way through the perils of the stage in an attempt to reclaim his memories.</p>\n<p>Using a unique <strong>BPM system</strong>, players must jump, dodge and fight in time with the music echoing through the stage to enhance their actions. </p>\n\n<p>Other performers will be present on the journey, and the puppet can take control of these vessels to solve simple puzzles and further it's own progression.</p>\n\n<p>At the end the puppet will face off against a terrifying foe in the grand finale, and finally discover the meaning of its existence.</p>\n\n<p>This game was developed purely as a prototype and will likely not be taken further, but I hope you enjoy the short experience! There are likely a few bugs so please be patient.</p>", "metacritic": null, "released": "2019-06-12", "tba": false, "updated": "2019-06-14T03:50:14", "background_image": "https://media.rawg.io/media/screenshots/a4e/a4ef2ebf7a8e47d5ca6a8ebad5346ec3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MegaSloth"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}