{"id": 327793, "slug": "gourmet-legacy-demo", "name": "Gourmet Legacy - Demo", "name_original": "Gourmet Legacy - Demo", "description": "<p><strong>This game is in an early stage of development - so everything you see here is in a super early pre-alpha stage</strong>.<br/></p>\n\r\nWhat is Gourmet Legacy?\r\n<p>“<strong>Gourmet Legacy</strong>” is a <strong>Roguelite/ Hack-n-Slash RPG</strong> with<strong> cookery </strong>simulation-styled<strong> mini games </strong>and<strong> restaurant management</strong> in <strong>3D bird-eye view</strong>. </p>\n<p>In 10 words: </p>\n<p>“Hunt ingredients and cook them all in the family restaurant.”</p>\n<p>There are 4 distinct elements that take part in the gameplay and they are:</p>\n<p>- Wonder  Chef's have to<strong> hunt fantastic beasts</strong> (called<strong> Ingredibeast</strong>), <strong>harvest improbable flora</strong> (called <strong>Veggiemals</strong>) as part of your <strong>ingredient collection</strong>  -</p>\n<p>- Find the<strong> real value of every ingredient</strong> by<strong> preparing</strong> yourself<strong> custom recipes </strong>to insert in your<strong> restaurant's menu</strong> and increase your gourmet value - </p>\n<p>- <strong>Expand </strong><strong>your traveling restaurant </strong>with bigger and cooler rare beasts of burden, fancy furnishings and high quality courses -</p>\n<p>- <strong>Death as a part of the game</strong>: genetic traits, equipment and the restaurant itself passed on as an inheritance, gameplay after gameplay, to your heir  -</p>\n<br/>\n\n<p> Cool, but how's the combat work?...</p>\n<p>Each attack will hit the target based on the actual collision, but critical hits, damage and evasion will be calculated using attributes and game-stats of both the attacker and the defender.<br/></p>\n<p>Each character is assigned 3 random abilities form a pool of 6 Class Abilities , while 2 additional non class-bound abilities can be selected by the player from a pool of 20 non class-bound abilities.</p>\n\r\n.... ok, but what about the restaurant?\r\n\n<p>Each beast when defeated will disappear and drop their respective ingredient: collect them all and create new recipes by exploiting the virtually infinite combinations of ingredients and cooking methods! Your ability in doing so will determine the success of your activity and the possibility to evolve both your character and  your traveling restaurant (called Wagoon)!<br/></p>\n\n<br/>\n\n<p>If you like the game so far, please consider: </p>\n<p>Stay in touch with us on Discord</p>\n<p>Follow us on Twitter, Instagram and Facebook</p>\n<p>Take a look at our Indie DB and our website</p>\n\n\n<p><strong>Feel free to stream or record videos of this game.</strong></p>", "metacritic": null, "released": "2019-06-11", "tba": false, "updated": "2019-06-14T04:43:38", "background_image": "https://media.rawg.io/media/screenshots/117/1172b408c9b132c7c8015ce43a860b00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Koi Box"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}