{"id": 3278, "slug": "red-goddess-inner-world", "name": "Red Goddess: Inner World", "name_original": "Red Goddess: Inner World", "description": "Red Goddess is a <strong>nonlinear side-scroller platformer</strong> with combat situations in an adventure to explore the inner-mind of a young goddess with the objective of remembering and recovering her own powers. <br/><br/>-Explore the mind of a young goddess.<br/>-Fight against the “dark thoughts” and an invisible enemy “The Narrator”.<br/>-Possess and move elements of the planet to uncover the mysteries from the past of the main character.<br/>-Combination of brawl and platform action in an epic and compelling story.<br/><br/>Gameplay:<br/>Control 3 playable characters with their own unique skills and abilities in a non-linear platform/adventure game.<br/>You can play the game with Divine, the main character, to jump, double jump, talk and interact, and also some psyche power like telekinesis.<br/>You can also select and play as a “mask” of the main character (either Rage or Fear persona).<br/>Once you play as a mask, you can unleash deadly melee combos, useful for combat situations. But the other mask appears following you everywhere in the game, and could turn against if you activate certain traps.<br/>Unlock Powers. You will have to find and collect pieces of an ancient armor to unlock new skills and enter new zones.<br/>Possess and move elements of the planet to uncover mysteries from the past of the main character. You also can possess the minds of enemies to use them in combat.<br/><br/> <br/><br/><strong>What’s Red Goddess’s Story? </strong><br/>The story resolves around a young goddess named Divine who is haunted by her own subconscious. Something unknown is tearing her apart from the inside out, destroying her mind and her soul. Deciding to right this wrong, she enters into her own subconscious and discovers a planet within her own mind. Filled with trees, mountains, and caves, she will journey this world and discover what her true connection to it is. And more importantly, who she is.<br/><br/>…..but soon you will realize that there is more to this adventure than what we first thought. Explore a mysterious Planet driven by the subconscious mind of the main character: Divine.<br/><br/> <br/><br/><strong>Who are the main characters?</strong><br/>Divine: The primary playable character and a goddess as young as the world she watches over. She is very useful to jump, double jump, speak, and interract with elements of the planet. But her main skill is to move objects with her telekinesis power to reach new zones. With these unique skills,  she will be able to discover her connection with the world she loves.<br/><br/>Rage: The first mask of Divine is a being of anger and muscle. Able to overpower red enemies with brute strength alone<br/><br/>Fear: The second mask of Divine is a being of almost ghostly fright. Swift and cold she is perfect against blue enemies.<br/><br/>Narrator: A nameless narrator that lurks the world of the young Divine. Though unsure of his true form, he can’t hide his malicious intent to Divine. He’s responsible for provoking the “Dark Thoughts”, blocking Divine from other zones of the world, and even make the world itself go against her. He can also make Divine and her sides dought themselves and attack each other. Can a monster truly be above a god?<br/><br/>Negative Thoughts: The primary enemies of Divine as she explores her world. With every zone infested with these things, they have adapted with the land to go against Divine. Leaving them alone will only cause the world to corrupt. <br/><br/>The dark tunnels hide horrible creatures, followers of Divine´s negative thoughts. Little by little, they are corrupting every part of the planet.<br/>And many more dangerous creatures lie in wait for Divine...<br/><br/><strong>What is the Genre and Inspirations?</strong><br/>Yanim Studio Team is fan of Action/Adventure/Exploration, our inspirations are some of the great non-linear Side-Scroller games as: Guacamelee,  Outland, SuperMetroid, Dust: An Elysian Tail.", "metacritic": 53, "released": "2015-06-30", "tba": false, "updated": "2022-10-19T06:44:55", "background_image": "https://media.rawg.io/media/screenshots/f89/f89abc588aa37c1541edbaa07217b032.jpg", "website": "https://www.redgoddessgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 33, "beaten": 2, "toplay": 1}, "playtime": 1, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "PC"], "developers": ["Yanim Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Yanim Studio"], "esrb_rating": "Everyone 10+"}