{"id": 328085, "slug": "dominoes-classic-dominos-game", "name": "Dominoes: Classic Dominos Game", "name_original": "Dominoes: Classic Dominos Game", "description": "Play the classic Dominos game, you can play in individual or duo mode. Whoever finishes with the pieces of your own hand first, wins! In each round, the player must place a piece on the board in order to match the numbers on one of the edges.<br/><br/>Over the years several versions have been created: All Fives, Draw Dominoes and Block Dominoes. This board game is also called muggins, domino, dominos game. The tiles or pieces are sometimes referred to as bones.<br/><br/>The rules here are a bit different, the game consists of 4 players, each starting with 7 pieces, which means that there are no remaining. All tiles will be present on the table, creating a new range of strategy.<br/><br/>When a player finishes with his pieces, he wins the round and the values of all the tiles in his opponents hands are added to his score.<br/><br/>In individual mode, the first player to get 100 points or more, wins. And in duo Mode, the first duo to get 150 points or more, wins.<br/><br/>Features<br/>• Dominos Game does not require internet connection, ou can play anywhere you want!<br/>• This app is optimized so that the pieces are comfortable in size for viewing, but if you need to, you can zoom in and move the board in any direction.<br/>• Customize your game with various themes of tables and dominoes.", "metacritic": null, "released": "2018-08-31", "tba": false, "updated": "2019-10-14T03:03:59", "background_image": "https://media.rawg.io/media/screenshots/56d/56df7526c64db0bfa3b72c434ed94799.jpg", "website": "https://roghangames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Roghan Games"], "genres": ["Strategy", "Board Games"], "publishers": ["Roghan Games Ltda EPP"], "esrb_rating": null}