{"id": 328005, "slug": "dragon-star-varnir", "name": "Dragon Star Varnir", "name_original": "Dragon Star Varnir", "description": "<p>3 Tiers to Fear – In this unique take on the classic turn-based battle system, players take flight and charge at dragons in three vertically-oriented tiers. Position your party members careful and claim victory! Giant dragons can swipe through all three tiers, so be careful!<br />\nAwaken Your Inner Dragon – When attacking an enemy during battle, players fill up their Dragon Gauge. Once maxed, they can transform and harness the power of dragons, drastically increasing their armor and unlocking abilities!<br />\nDevour Hour – Once an enemy dragon is weakened, players can utilize the Devour skill to obtain a skill tree unique to that dragon. Players can explore different dragon skill trees and combinations!<br />\nMadness or Riches? – Three witches depend on you to bring them dragon’s blood as food. Starve them, and they go mad. Overfeed them, and they become a dragon! Will you keep them alive or sacrifice them to obtain rare items? Be wary, each choice you make can change your ending.<br />\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br />\n1 player<br />\nDUALSHOCK®4<br />\nRemote Play<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />", "metacritic": 70, "released": "2018-10-11", "tba": false, "updated": "2023-08-01T16:43:46", "background_image": "https://media.rawg.io/media/games/175/175f690a34aa54104daa7be83f07e323.jpg", "website": "", "rating": 2.9, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 85, "beaten": 3, "toplay": 8, "dropped": 1, "playing": 1}, "playtime": 4, "achievements_count": 49, "ratings_count": 10, "suggestions_count": 779, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "PlayStation 4", "Nintendo Switch"], "developers": ["Idea Factory", "Compile Heart"], "genres": ["Adventure", "RPG"], "publishers": ["Idea Factory"], "esrb_rating": "Teen"}