{"id": 328070, "slug": "nonstop-knight-2", "name": "Nonstop Knight 2", "name_original": "Nonstop Knight 2", "description": "<p>The action RPG Nonstop Knight 2 is finally here! Take your knight into battle and explore exciting dungeons full of monsters and bosses. Download for free now!<br />\nNonstop Knight 2 leads the way in a new era of action RPG, bringing you the full RPG experience onto mobile.<br />\nNew in Nonstop Knight 2 – Action RPG:<br />\n- Item Sets: Like classic roleplaying games you can now collect armor sets<br />\n- Extended Equipment: Equip your knight with helmet, gloves, chest armor, boots and cloak or shield<br />\n- Ranged and melee weapons<br />\n- Skills: Your primary, secondary and ultimate skills are either fire or ice skills<br />\n- Competitive game mode: Play the Badlands and climb the leaderboard<br />\n- Coop: Join a guild and pick friends to take along into battle<br />\nExperience different game modes:<br />\n- Nightmare, Resource Farms, Survival, Paranormal and Companion<br />\n- Diverse dungeons: Play your knight in different dungeons<br />\n- Play with friends: Choose a companion to fight by your side, be chosen while you are offline for great rewards<br />\n- Battle against time: Enter shard portals, defeat enemies and collect as many shards from them as possible<br />\nIn the mobile RPG Nonstop Knight 2 you don’t ascent your knight anymore, the progress is endless. This action rpg game gives you the experience from classic RPG games you used to play in the past. Play anytime, anywhere, log in for short sessions or take some time for epic dungeon grinding.<br />\nBy accessing or using a flaregames product, you&#39;re agreeing to our Terms of Service (www.flaregames.com/terms-service/).<br />\nNonstop Knight 2 - Action RPG is free to download and play, however some game items can also be purchased for real money. If you don’t want to use these features, please disable in-app purchases in your device settings. According to our Terms of Service, Nonstop Knight 2 is allowed for download and play only for persons 16 years or more of age, or with explicit parental consent. You can read more here: http://www.flaregames.com/parents-guide/</p>", "metacritic": null, "released": "2019-06-13", "tba": false, "updated": "2019-07-31T04:18:56", "background_image": "https://media.rawg.io/media/screenshots/bda/bdac6f044e90196759e542f071113069.jpg", "website": "https://www.flaregames.com/games/nonstop-knight-2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 118, "game_series_count": 1, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["flaregames"], "genres": ["Action", "RPG"], "publishers": ["Flaregames"], "esrb_rating": "Everyone 10+"}