{"id": 328198, "slug": "ms-gelee", "name": "Ms. Gelee", "name_original": "Ms. Gelee", "description": "<p><strong>Controls:</strong></p>\n<p>Z - Start</p>\n<p>X - Jump</p>\n<p>C - Shoot</p>\n<p>Left Arrow Key - Move Left</p>\n<p>Right Arrow Key - Move Right</p>\n<p>It's supposed to have game pad controllers, but I couldn't get consistent performance so I'll just leave this as an \"undocumented feature\".</p>\n<p><strong>What is Ms. Gelee?</strong><br/></p>\n<p>Ms. Gelee is a 2d pixel-art action-adventure platform.  It was inspired by Kirby's Dream Land, Mr. Gimmick, and Mega Man X2.  My goal for this project was to make a deceptively easy adventure platformer with extra content unlocked by expert players (like Mr. Gimmick).  It has an attack mechanic used for exploring (from Mega Man X2) and a short any% completion (like Kirby's Dreamland).  It was intended to have four or five regular stages and 1 hidden stage unlocked by collecting all honeycombs.</p>\n<p>I also drew some lesser inspiration from other games.  In stage 1, I really liked this stage in Donkey Kong Country 3 called Krack Shot Kroc, so I designed the chasing reticle as the boss trying to snipe you from afar.  In stage 2, I wanted to design a rotating tower like in Butter Building from Kirby's Adventure or the final stage of Battletoads, but I didn't have any success coding it.  </p>\n<p>I would give it's current state to be about 40% done. </p>\n<p><strong>Why did production stop?</strong></p>\n<p>Part of it is programming language choice, part of it is lack of motivation.</p>\n<p>So when I started this project, I went with Javascript since it was what I worked with the most.  However, as the project progressed, I ran into issues with consistent controller behavior with joypad APIs and game deployment through Electron and NW.  The big picture is trying to make Javascript into something other than a behavior modifier for webpages.  </p>\n<p>Motivation died out when the games stopped being exciting and people stopped streaming them on Twitch.  I used to watch speedrunners from these games and they were cool to watch when developing the game.  I used to watch CalebHart42, Hettfield and Tokyo for X2.  I used to watch Becored, Aquas, and cyghfer for Mr. Gimmick.  I also had the usual game development burnout and never recovered from it.</p>\n<p><strong>Credits:</strong></p>\n<p>I did everything but the music, so I want to credit them here:</p>\n<p>I realize some tunes have a noncommercial license so if I were to release it I'd change those songs.</p>\n\r\n\r\n\r\nTitle ScreenPrincess Theme by Abstraction (https://abstractionmusic.bandcamp.com/track/princess-quest)\r\n\r\nStage 1Sanctuary by Abstraction (https://abstractionmusic.bandcamp.com/track/sanctuary)\r\nBoss themePixel War 1 by Abstraction (https://abstractionmusic.bandcamp.com/track/pixel-war-1)\r\nStage 2Day 70 by Mark Sparling (https://www.reddit.com/r/gamedev/comments/362c72/i_made_a_bunch_of_music_feel_free_to_use_it_in/)\r\nPlanned Stage 3 themeKnife Woman by Cosmic Gem (https://www.youtube.com/watch?v=hXJC9FXqxKI) \r\n\r\n<p>Source code is at https://github.com/olindgallet/msgelee. </p>", "metacritic": null, "released": "2019-06-16", "tba": false, "updated": "2019-08-28T23:15:52", "background_image": "https://media.rawg.io/media/screenshots/233/23336b9a4aac5f8ddfb4e550ba20e9e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["olingallet"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}