{"id": 328225, "slug": "midnight-cookie-run-darksylvok", "name": "Midnight COOKIE Run (Darksylvok)", "name_original": "Midnight COOKIE Run (Darksylvok)", "description": "Nigromancia y Galletas \r\n ¿Que puede salir mal?\r\n\r\n\r\nEl solo quería comerse unas galletas......\r\n\n<p>Encarnas el papel de un joven aprendiz de nigromante al que su estómago le manda una señal GALLETAS , y por supuesto ¡ A quien le importa el toque de queda ! escamotear comida de la cocina a medianoche es una estupenda idea.</p>\n<p>No lo culpo, ya sabéis lo mal que se come en las escuelas de nigromancia, lo de levantar cadáveres de sus tumbas y crear monstruos aberrantes se les da muy bien, ahora,  ofrecer un menú variado y sano a los estudiantes ya no tanto.</p>\n<p>Así que para completar la noble misión de comerte unas deliciosas galletas, tendrás que conseguir cumplir con las exigencias del Guardián del Sagrado tarro de galletas sin fondo, hacer tratos con arañas hambrientas, huir de los vigilantes de pasillos y hacer MUCHA NIGROMANCIA</p>\r\n\r\n¿ De donde sale la idea?\r\n<p>Esta pequeña historia nació de una JAM organizada por Gametopia en combinación con la hambruna de un desarrollador a dieta.</p>\n\r\n¿Por que usar GameMaker?\r\n<p>Nuestro equipo está formado por tres desarrolladores y cada uno dominamos un lenguaje diferente y preferimos un motor distinto...así que decidimos usar el único en el que al menos las dos otras personas del equipo habían tocado algo (y el soborno con gominolas también ayudó)<br/></p>\n\r\n¿Pero que se supone que debo hacer?\r\n<p>Tienes que conseguir las galletas y para ello necesitarás encontrar los libros correctos de la biblioteca que contienen los hechizos necesarios. Cuidado con los vigilantes de pasillos y nadie dijo que la nigromancia fuera una ciencia exacta digamos que los muertos nunca resucitan como se planea</p>\n\r\n¿Hareis mas niveles?\r\n<p>Por falta de tiempo (48h Jam you Know) solo hemos podido implementar un par de niveles, pero nuestra intención es afinar las mecanicas y añadir más niveles.  Nadie dijo que robar unas galletas en una escuela de Nigromancia fuera fácil pero el premio merece la pena</p>\n<br/>\r\nBadalianos", "metacritic": null, "released": "2019-06-16", "tba": false, "updated": "2019-08-28T23:15:52", "background_image": "https://media.rawg.io/media/screenshots/f40/f40531e4f3eb64da0bd1ac3de18f32b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Darksylvok"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}