{"id": 328229, "slug": "peoplemon", "name": "Peoplemon", "name_original": "Peoplemon", "description": "<strong>Ever feel like you're going crazy...</strong>\r\n...or rather, that everyone else is?\r\n<p><em>Awaken in the world of PEOPLEMON, where everybody wants to catch PEOPLE and make them fight!</em></p>\n<p><em>Professor Woke takes you under her wing you as you discover the exciting future of the economy. Catch wild PEOPLE, challenge fellow PEOPLE catchers, and face off against the chief executive of Ditfy, Inc.—and president-elect of the PEOPLE!</em></p>\n<p><em>By the end of this blackly comedic adventure, your destiny will be clear as day. And what more could a PERSON want?</em></p>\n<p>A short, grim, yet affectionate parody of a global sensation from the creator's childhood. Join him for chuckles in a time-warp to some version of 1998. And if you never played the original in monochrome, then keep reading.</p>\r\n\r\nHOW TO PLAY\r\n<p>Press the <strong>Z key</strong> to advance dialogue and narration. You will be pressing the hell out of the <strong>Z key</strong> throughout the game<strong>.</strong><br/></p>\n<p><strong>Make your avatar walk around</strong> with the <strong>arrow keys</strong>.</p>\n<p>When your avatar is next to something interesting, like another character, face that thing and press the <strong>Z key</strong> to <strong>inspect it</strong>—in the case of another character, <strong>he or she will speak to you</strong>. Somebody, somewhere, will have some vital clue for you.</p>\n<p>In some places, you will be attacked. The <strong>field screen</strong> will disappear and be replaced with the <strong>battle screen</strong>. You will automatically deploy <strong>the PERSON at the top of your roster</strong> to fight the attacking PERSON.</p>\n<p>The PEOPLE politely fight by <strong>taking turns</strong>. In each turn, you can take one of four actions: \"<strong>FIGHT</strong>\" brings up a menu of commands to give your PERSON; \"<strong>ITEM</strong>\" brings up an inventory of supplies for you to use; \"<strong>PPL</strong>\" brings up your roster of PEOPLE to deploy in place of your current PERSON; and \"<strong>RUN</strong>\" will make you flee the battle. Press the <strong>Z key</strong> to <strong>confirm</strong> selected menu commands; press the <strong>X key</strong> to <strong>cancel</strong> them and return to a previous menu.</p>\n<p>Each PERSON has a limited number of <strong>health points</strong>; when these run out <strong>the</strong> <strong>PERSON is dead and gone forever!</strong> Some <strong>items</strong> can recover health points before that happens.</p>\n<p>You can use such items in the <strong>field screen</strong> by pressing the <strong>Enter key</strong> or<strong> Return key</strong> to bring up the main menu. From there you can also <strong>see the status</strong> of your PEOPLE, <strong>switch their order</strong> in the roster, and <strong>view a summary of your avatar</strong>.</p>\r\n\r\nACKNOWLEDGEMENTS\r\n<p>I tried to write this game program a number of times. In the end, the only natural way to do it was writing it in Haskell using the Glasgow Haskell Compiler. Among many other benefits, this allowed me to express much of the game in the embedded language Yampa, created by <strong>Henrik Nilsson</strong> and <strong>Antony Courtney</strong>, and maintained by <strong>Ivan Perez</strong>.</p>\n<p>Linkage to your system's audio and video subsystems appears courtesy of Simple DirectMedia Layer by <strong>Sam Latinga</strong> and colleagues. Two ancillary projects do some further heavy lifting: SDL_mixer by Latinga, <strong>Stephane Peter</strong>, and <strong>Ryan Gordon</strong>; and SDL_image by Latinga and <strong>Mattias Engdegård</strong>.</p>\n<p>The Haskell bindings to SDL are by <strong>Gabríel Arthúr Pétursson</strong> and <strong>Oliver Charles</strong>; the bindings to SDL_mixer are by <strong>Vladimir Semyonov</strong> and <strong>Siniša Biđin</strong>; the bindings to SDL_image are by <strong>Cai Lei</strong> and Biđin. My personal thanks go to both Ollie and Siniša for their support.</p>\n<p> Most of the Game-Boy-like sounds came out of Papu and RP2A03, created by Socalabs. The drum samples in the title screen music come from Game Boy Drum Kit, created by Bedroom Producers Blog and SzcZ.</p>\n<p>The gracious suffering of alpha testers <strong>Michael Risse</strong> and <strong>Scott MacDonald</strong> helped me make significant improvements to this game.</p>\n<p>And finally, (again!) this work was made possible by <strong>Gina Vasiloff</strong> and her enduring support.<br/></p>", "metacritic": null, "released": "2019-06-16", "tba": false, "updated": "2019-06-17T03:18:39", "background_image": "https://media.rawg.io/media/screenshots/b74/b74259f8ad78bebd61e5e5b6f5cfaba1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Alex Stuart"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}