{"id": 328349, "slug": "matchday-heroes-football-manager", "name": "Matchday Heroes Football Manager", "name_original": "Matchday Heroes Football Manager", "description": "<p>Matchday Heroes is a football (soccer) management game with one goal - to become the ultimate football manager. </p>\n<p>Can you discover the players and tactics to win ?\r\nScore goals, win games, earn huge coin bonuses ! Buy,sell and loan football players while increasing your management reputation... can you build the best football team in the world and conquer the top-flight ? Can you win the gold league championship as a football manager ?\r\nKick off and enter your own football team names ! Add your favourite football player names !<br/></p>\n<p>Enter a fun fantasy football world and sculpt your own game with a fully included team and player name editor !\r\nThe chairman will present you with your first football squad. You can then scout the squad, selecting your own goalkeeper, defenders, midfielders and attackers. Only then can you begin your epic football manager journey, using your football manager skills to climb out of non league.\r\nYou start at the bottom playing your soccer matches in the local park. Championship football and the electric atmosphere of a packed out super-stadium is all but a distant dream. It's your job as football manager to loan, buy and sell your way to fame and glory, creating football heroes along the way. Shoot for the top with 6 challenging leagues to climb and 2 cups to conquer.\r\nAre you a tactical football management master ? Have you got what it takes to reach the pinnacle of football management and dominate the Gold league championship ? Are you the Ultimate football manager ?\r\nPlay today and test your football manager skills.... </p>\n<p>Game Features : </p>\n<p>- Immerse yourself into a fun fantasy football manager world. </p>\n<p>- Creative freedom. Full In-game team and player editors included. </p>\n<p>- Build the perfect soccer squad. Manage your players with a blend of age, ability and personality. </p>\n<p>- Unique football player generator. Millions of different in-game players to choose from.\r\n- In depth player profiles, with detailed stats and records. </p>\n<p>- Colourful player personalities.\r\n- Football player form ratings. keep track of your best players. </p>\n<p>- Special ' Hero Profiles ' for the greatest football players, with shirt sales and fan popularity stats. </p>\n<p>- Tactical freedom - Create your own formations easily. </p>\n<p>- 35 advanced tactics to unlock. </p>\n<p>- Mid Season Loan opportunities - Perfect for a squad strength boost. </p>\n<p>- Transfer window - Buy and sell your way to success. </p>\n<p>- Youth development - Can you discover the next superstar? </p>\n<p>- Bargain Veterans - Bring in valuable experience at minimal cost. </p>\n<p>- Real time, highly detailed football match commentary. </p>\n<p>- Adjustable match speed - From in-depth to quick play.\r\n- Endless Gameplay with a huge range of bonuses to unlock. </p>\n<p>- Starting a new game provides a brand new experience every time. </p>\n<p>- Collect all of the cups and show them off in your trophy room. </p>\n<p>- Built in help console with game instructions. </p>\n<p>- No adverts. No IAPs. Just Football. </p>\n\n<p>Matchday Heroes is a fresh new approach to football manager games. Easy to pick up and play, the game has many hours worth of gameplay as you build and shape your soccer squad, progressing through the 6 challenging leagues. Full of stats and depth, there's always plenty to do and with the unique player generator, there are always new in-game football players turning up. Finding yourself an experienced veteran player or discovering the next wonderkid is tremendous addictive fun as you try to climb the leagues.</p>", "metacritic": null, "released": "2019-06-16", "tba": false, "updated": "2019-06-17T03:53:35", "background_image": "https://media.rawg.io/media/screenshots/09e/09e875bdeee9e488c06ae0064e1e6081.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CALEGA Games"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}