{"id": 328314, "slug": "adventure-of-nekoda-3d", "name": "Adventure of NeKoda 3D", "name_original": "Adventure of NeKoda 3D", "description": "<p># Adventure of NeKoda 3D</p>\n<p>A thesis game that provides logical thinking and programming syntax about basic of java control structures in a fun way. </p>\n<p>Inspired by the CODE.ORG games <br/># Won a Gold Medal for Best Thesis 2019 in our school.</p>\n<p>## Short Story:<br/>A villages that runs by the power of Cato Core, it was damaged by a large thunder strike causing the Cato Core to be broken and making all the bridges to falls down, that connects the entire village only Nekoda and his companion Nord can fix all the bridges, every village has their own Cato Rings to replace it on Cato Core so follow your instinct by controlling Nekoda.</p>\n<p>## Game Features:<br/>Small open world game.<br/>Automatic saved game by finishing the level.<br/>Lowpoly 3d art style (lowpoly trees and grass are from kenney assets)<br/>drag and drop code of blocks with runtime debugging of blocks</p>\n<p>## Game Objective: <br/>You need to find all the three cato rings in the end of each village, you progress by finding all bridge of blocks gathered around the village you can use it to build a bridge to move to another village and at last when you find all the cato rings fixing the Cato Core will end the game.</p>\n<p>##Controls:<br/>W A S D Key - Player Movement<br/>Left Shift Key -   Walk<br/>Escape Key -   Pause Menu<br/>Mouse Drag &amp; Drop - To drag and drop code bricks<br/>Mouse Scroll Up &amp; Down - To zoom out and zoom in camera &amp; scroll content</p>\n<p>follow me on my twitter : https://twitter.com/novcrafts</p>", "metacritic": null, "released": "2019-06-16", "tba": false, "updated": "2019-06-17T03:42:12", "background_image": "https://media.rawg.io/media/screenshots/f4a/f4ad27d0eb4780e0db3c63e3e014213d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Novi Rañoja"], "genres": ["Action", "Adventure", "Strategy"], "publishers": [], "esrb_rating": null}