{"id": 328311, "slug": "keree-engineer-20", "name": "Keree Engineer 20", "name_original": "Keree Engineer 20", "description": "<p> We have decided to disable the comments on itch.io because we receive them a few days late, so that's why you can contact us or leave comments on our site about Keree engineer 20 - Early access!</p><p>Keree engineer allows you to create car building and repairing projects.  You can make your own designs, engines,wheels,suspension JUST for fun, and take it out for a spin on the race track, there are way more features yet to come in future updates! Keree engineer is also free! We hope you will enjoy playing Keree engineer, we know we haven't published in a while but hey were back and there is a lot more to come in OCTOBER!<br/></p><p>P.S We haven't forgotten about Death Wave as well. Follow us here or on our site to stay up to date :) #october / August. <br/><br/></p><p>site: http://tbmgames.ml/</p><p>Some features:<br/></p><p>- Physical system depending on installed parts<br/>- Realistic dynamic suspension<br/>- Advanced car paint system <br/>- Car change system<br/>- Spare parts shop system <br/>- Calculation car mass according to installed parts<br/>- Engine, suspension and body tuning: tuned engine parts increase engine power, tuned suspension parts improve handling<br/>- Tuning body parts: bumpers, hood, spoiler, etc<br/>- Openable doors, hood, trunk<br/>- Spinning engine parts</p>", "metacritic": null, "released": "2019-06-16", "tba": false, "updated": "2019-06-17T03:41:08", "background_image": "https://media.rawg.io/media/screenshots/4da/4dae0d7206cc62acf5ee9940c139ac32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["TBMgames"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}