{"id": 328444, "slug": "time-spiders", "name": "Time Spiders", "name_original": "Time Spiders", "description": "<p><strong>Space, Time, and Bright Colorful Spiders</strong><br/></p>\n<p>They live, work, and die on a time machine they didn't invent and can't control.  You are their Overlord. Help them learn, grow, and thrive.<br/></p>\n<p><strong>The Claw</strong><br/></p>\n<p>Use the Claw Tool to assign each spider a work area, or send them away to obtain food and building materials. Balance risk and reward by expanding your population or conserving critical resources. In Time Spiders, every task must be accomplished using tools and resources actually placed on the map. If you over-extend yourself, your spiders will suffer and perish.</p>\n<p><strong>The Journey<br/></strong></p>\n<p>The time spiders encounter different opportunities, and dangers, in each time zone they visit. The Rust zone, for example, represents a time when plants first began producing oxygen, causing any free iron to rust away. The Shade zone represents a time far in the future after the stars have burned out and nothing remains but darkness and terror.<br/></p>\n<p><strong>Where We Came From</strong><br/></p>\n<p>Time Spiders was inspired by both the early \"sim\" games like SimEarth and SimAnt, as well as modern building games like Minecraft and Space Engineers. But most people will probably recognize it as a management game in the vein of Rimworld or Factorio.<br/></p>\n<p><strong>Where We're Going</strong><br/></p>\n<p>The next version of Time Spiders will include:</p>\n<ol><li>A larger map size</li><li>Player-buildable ships that travel around the map</li><li>More monsters tailored to the different environments</li></ol>\n<p>This is the first published technical demo. To keep up with the latest updates, follow me here on itch.io, or twitter<strong>.</strong></p>", "metacritic": null, "released": "2019-06-15", "tba": false, "updated": "2019-06-17T04:18:58", "background_image": "https://media.rawg.io/media/screenshots/0d2/0d20fa9a36bba6d5ed62d7daf3c0fcab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["anachronidia"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}