{"id": 32851, "slug": "ascendancy", "name": "Ascendancy", "name_original": "Ascendancy", "description": "<p>Ascendancy, the debut game from The Logic Factory, is a game of galactic exploration and encounter. In Ascendancy, you develop your home planet, research new technologies, build ships to traverse the stars, encounter aliens, and colonize new worlds as you expand your presence throughout the galaxy.</p>\n<p>You begin the game by choosing to be one out of 21 possible species. Then, choose the size of the galaxy, the number of species in the game ranging from 3 to 7, and whether you want to play in a peaceful, neutral, or hostile atmosphere.</p>\n<p>Play begins on your home world where you begin building structures for the purposes of increasing your research,industry and prosperity. As you build these structures you also begin doing research. Eventually your research allows you to build ships for the purpose of space travel. You can equip your ship with a variety of hi-tech gizmos including weapons, shields, engines, power generators, and special function devices. The more your research advances, the more various and powerful your selection of gizmos becomes.</p>\n<p>As you travel to other solar systems you will encounter alien lifeforms,some friendly, some hostile. You can conduct diplomatic relations with them, exchange knowledge, make alliances or declare war.</p>\n<p>You expand your empire by either colonizing unoccupied planets or invading planets belonging to your enemies. Finding a peaceful or violent solution to conflict is left up to you. There are several ways to achieve Ascendancy as you will discover on your own.</p>", "metacritic": null, "released": "1995-01-02", "tba": false, "updated": "2021-11-27T20:38:20", "background_image": "https://media.rawg.io/media/screenshots/a43/a4371cb5008abc07805f7c5015165360.jpg", "website": "http://www.logicfactory.com/games_ascendancy.htm", "rating": 4.5, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 7, "beaten": 3, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "iOS"], "developers": ["The Logic Factory"], "genres": ["Strategy"], "publishers": ["Virgin Interactive", "Virgin Interactive Entertainment", "Softgold Computerspiele", "Funsoft", "SoftGold"], "esrb_rating": null}