{"id": 328504, "slug": "naldiied-school-and-learning-and-math-and-7-keys", "name": "Naldiied School and Learning and Math and 7 Keys", "name_original": "Naldiied School and Learning and Math and 7 Keys", "description": "<p>Naldiied School and Learning and Math and 7 Keys<br/></p>\n<p>This game you only have 1 life this game is hard no saving.</p>\n<p>This get you need to get 7 keys to win if you don't get 7 keys you lost and restart the all over again and you have you start a new game.</p>\n<p>Collect 7 keys to win.</p>\n<p>This game you need to go and get and stop bad guys.</p>\n<p>This game looks like DOOM or other games like this game takes place in 1999 a guy named Naldiied is at school looking for kids and the guy is a kid who plays video games when he was 4 he got his first personal computer in his life in 1989 he had a video game console called the Nintendo Entertainment System and he really liked the system back then the graphics looks really good and many people like to play that game because back then it was so popular at that time.</p>\n<p>I'm Naldiied welcome to my math room that's me!</p>\n<p>Games like the 90s like Sonic SchoolHouse and</p>\n<p>And this game is like Doom a little bit.</p>\n<p>This game was made for a game jam in few days.</p>\n<p><strong>This was made for Weekly Game Jam - Week  101</strong></p>\n<p>And you need to escape from Naldiied</p>\n\r\nCredits\r\n<p>MrScottyPieey is the of the game Creator and some of the sprites or assets it's not my.</p>\n<p>Ball Time is Luvie from YouTube sorry.</p>\n\n\n<p>Tools  and software used:</p>\n<ul><li>Audacity</li><li>Paint3D</li><li>MS Paint</li><li>FL Studio</li><li>Autodesk Maya</li><li>Photoshop</li><li>Unity</li><li>Gimp</li><li>Photoshop</li><li>Blender</li><li>MS-Paint</li></ul>\n\n\n<p>Merch Merch Merch!!!<br/></p>\n\r\nWarning\r\n<p>This game won't work on old machines and 32 bit operating systems.</p>\n<p>This game will only work on 64 bit operating systems.</p>\n<p>If there is any bugs or glitches I will fix them please email me </p>\n<p>This game is not a Education game it's a horror game.</p>\n<p>How to play</p>\n<p>Controls</p>\n<p>WASD keys is to move</p>\n<p>Mouse is to look around</p>\n<p>Cilck Button is left click</p>\n\r\nControls\r\n<p>Use the WASD key to move or the arrow key to move press the space bar to look back. The mouse button is to look move the mouse to look at things press left click to click press the ESC key to pause the game.</p>\n<p>Space is to look font. Press the key to V is to look back.</p>\n\n\n<p>Minimum system requirements<br/></p>\n\n\n\r\nWhat's this game is about\r\n<p>Warning this is not an Education game is a horror game so this game is not met for little kids this game is met for kids who are 8 years or older if your not 8 years or older you can't play this game is game is about in the 90s where like old school games like Sonics Schoolhouse and little bit like doom and this game won't work on old machines like MS-DOS or older systems that's it if you downloaded this game from Itch.io or Gamejolt and its not a Sonic SchoolHouse clone or Baldi's Basics this game is set in 1999 where a guy named Naldiiied is the boss of the School of Madness and Ball Time is a female character she likes cartoons and SpongeBob SquarePants this game is in first person view and games like Fortnite or PUBG or other or This game is using the Unity Engine and this game was made for This was made for Weekly Game Jam - Week 98 and who ever played this game sucks and I made it in a few days this game scare little kids and little kids cry so hard and some times to break there gaming pc and they love to play Roblox Minecraft Fortnite or FPS games and Unreal Engine and you need to get 7 keys this game supports DirectX 12 OpenGL Vulkan Directx 11 I think many YouTubers play this game so it can be popular this game won't work on Windows XP or Older. This game is pre-rendered sprites like games like Chex Quest or Doom or MS-DOS old school games. So many people find bugs in this game but I will fix the bugs and kill them if they come back again sometimes jump scare scare kids and it's very dangerous not safe for kids and there is bosses this game.</p>\n\n\n\n\n\r\nInstall instructions\r\n\n<p>Press and download Zip Windows macOS or Linux or platfrom any please download the  latest  version of the game so it can work well. some features can be missing for a newer version and they can be bugs or glitches and some times this game will crash</p>\n<p>This game may not work because this game won't work on low end PCS and slow computers this game is met for mid rage PC or high-end rig if your computer is to old or to weak this game may not work if your using a older version of Windows or any  operating system this game will not work on your machine.</p>\n<p>And you have to extract the zip file press extract all the files then it will work and you press the .EXE then press play.</p>\n<p>Linux users: you may have to access the game files permission file and press it allow program to run game then the game will work for you.</p>\n\n\n<p>Support</p>\n<p>Minecraftgamerpc64@gmail.com</p>", "metacritic": null, "released": "2019-06-15", "tba": false, "updated": "2019-08-28T23:15:49", "background_image": "https://media.rawg.io/media/screenshots/95a/95a0edddfb2727671a587345501f152d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MrScottyPieey"], "genres": [], "publishers": [], "esrb_rating": null}