{"id": 328546, "slug": "the-lost-smile", "name": "The Lost Smile", "name_original": "The Lost Smile", "description": "<p>The Lost Smile (original title \"La Sonrisa Extraviada\", \"LSE\" for short), tells a story typical in noir cinema or literature; a woman disappears, a detective tries to find her. However, I've tried to avoid the typical stereotypes of the genre, maintaining the essence: that portrayal of the dark side of human nature that unsettles us because we don't want to recognize ourselves in that cold, amoral glance that the mirror reflects back.<br/></p>\n<p>The protagonist also does not abide by the canons of the genre, mainly because they are almost all taken. Instead, detective Belmonte, as far as I know, introduces a new category that I don't think anyone will ever think of copying. He's a detective-philosopher. Or a detective-artist. Or a philosopher-artist who investigates.</p>\n<p>Help him to uncover some terrible secrets... And be careful out there.</p>\n\n\n\n\n\n\n<p><strong>3D illustrations</strong></p>\n<p>Heavily processed 3D art to give it a raw visual style that suits the genre/theme. It has no sprites or backgrounds, every illustration is unique. Think in a panel from a comic or a frame from a movie.</p>\n\n<p><strong>Comic style dialogue</strong></p>\n<p>Comic bubble style textboxes for showing the narration and the dialogue with no names shown since the bubble points to the character making easy to follow the narration.</p>\n\n<p><strong>A clues/deductions interactive system</strong></p>\n<p>Through the game, depending on the options you choose, you'll find different clues about the case. You'll have to combine them to get deductions in order to solve the case. The deductions can be irrelevant or misleading, though. You'll need to find the right ones in order to get the \"true\" ending.</p>\n\n<p><strong>6 endings depending on the deductions you make</strong></p>\n<p>The story has 1 \"true\" ending and 5 alternative ones (including a generic one where the player fails to make any meaningful deduction). Better not think about them in terms of \"good\" or \"bad\" endings, though.</p>\n\n<p><strong>A cool vinyl jukebox</strong></p>\n<p>Music room with all available tracks. Mostly piano only music composed and performed by a very talented guy. You can chose any song from the soundtrack to be the music for the main menu.</p>\n\n\n<p>It combines 2 distinct styles. The narrator (the detective himself, close to solve the case, telling the story through flashbacks) use a lyrical and philosophical language, reflecting on the facts he discovered and the path he took. The dialogues, though, are most in line with the classic style of dialogue of classic noir literature or movies: sharp, quick, witty and spicy.</p>\n<p>The original language of the game is spanish, but I'm confident that the english version is solid and can be played and enjoyed even by native speakers. It has been adapted and edited by an outstanding professional (see credits below) and the outcome, I think, is really good. However, if you are fluent in spanish, I'd recommend to choose the spanish version, as is the original one.</p>\n\n<p><strong>Writing, illustrations, coding and GUI design:</strong><br/>Mario Matalla</p>\n<p><strong>Music:</strong><br/>Jose Serrano, Watercandle</p>\n<p><strong>Coding of the clues/deductions system:</strong><br/>Philat</p>\n<p><strong>English translation:</strong><br/>Mario Matalla</p>\n<p><strong>Consultant for the english version:</strong><br/>Ende (Contact)</p>\n<p><strong>Background of the ending summary screens:</strong><br/>Farrin N. Abbott, CopyCatFilms</p>\n<p><strong>Beta-testing:</strong><br/>Decadenttia, Stawberry, Forrocabeza, Padrecito, el Pers</p>\n\n<p>The stoy has references to sex and some partial nuddity, although not shown in an explicit or obscene way (ie. not even a tit shown), there's also some violence and strong language, and people occasionally drink or go to places where minors are not allowed. I don't think it reaches the level of \"not suited for minors\", but it's definitely not for children. Be advised.<br/></p>\n\n<p>I provide a Linux version, but I have no means to test it or fix it. Not that I'd be able to offer extensive support for the Windows version either, but at least I can test any reported bug and try to fix it.</p>\n<p>However, I have to be honest, I'm not any kind of tech expert and I won't be able to help with any problem related to hardware configurations, drivers and such things. I can, to some extent, fix my own mistakes, not other people's mistakes.</p>\n<p>The game should run fine in any non ancient computer. It certainly does on my on my low-end laptop, where I developed it. Again, I can't offer any specific requirements, but if you can play any visual novel kind of game on your computer, you shouldn't have any problem with this.</p>\n<p>Note: for some reason, AVG antivirus doesn't get along very well with Ren'Py generated files and will probably try to quarantine the program for a deep scan the first time is run (hint: it will find nothing). You can safely choose to go ahead with it, but be aware that sound and maybe something else won't function well until it finishes. I'd recommend to wait for the scan, close the program and run it again.</p>", "metacritic": null, "released": "2019-06-14", "tba": false, "updated": "2019-06-17T04:46:00", "background_image": "https://media.rawg.io/media/screenshots/e3e/e3e62b7c8f73543c5a99a605cf60cf0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Matalla Interactive"], "genres": [], "publishers": [], "esrb_rating": null}