{"id": 328761, "slug": "impossible-tracks", "name": "Impossible Tracks", "name_original": "Impossible Tracks", "description": "Welcome to the world of extreme Impossible Tracks car racing games. Enjoy the real impossible track race on the endless extreme impossible tracks in the sky highs. Amazing cars are waiting to be driven around for a talented driver. Are you will to take up the ultimate racing challenge? If you are a fast speed racer and have a passion for car racing games then be ready to experience the real car rally in the mid of sky with no limits. Drive safely on curvy and dangerous hilly roads.<br/>Rush like a crazy car stunts master while riding the beautifully designed huge impossible tracks and beat the rival racers in this breathtaking adventure. Perform the extreme car driving drifts and insane acrobatic mid-air flips on the impossible track 3D and rush like a real car drifter. Be a furious driver of sports-car and do drifting and crashing in this action packed game. Unlike the other car stunt games, this off road car rally is going to be a real fun and adventure. Don’t get addicted to this insane car racer game. . Be the best car driver in the world and become the king of the road! Complete all the missions given to you in time. Choose from a variety of sports cars to zoom on these speeding paths. <br/><br/>Are you willing to play the world no. 1 drift car racing game and enjoy the crazy and insane impossible tracks simulator in most realistic manner.<br/>Play track race and boost your car parking and car control skills by providing you the most realistic simulation view. Perform amazing aerial flips and tricks, drift, crash, boost, and slide all around the sky tracks. Avoid impossible-fall to become the legend of biking by completing all the challenging and thrilling missions on sky. You are free in a world that you can do what you want. Use the nitro boost to cross the difficult hurdles and obstacles in this car stunt games 2k18. Fly over the ramps and dust off the rusty containers with your stunts and don’t lose the control of your stunt car.<br/><br/>Impossible Tracks Features:<br/>- Mid-air stunts and sky high driving tracks<br/>- Extreme car stunts and realistic car driving simulation <br/>- Mid-air stunts and sky high driving tracks<br/>- Sharp and narrow impossible racing tracks to ride.<br/>- Marvelous 3D game graphics and hill views.<br/>- Steering and touch controls and easy gameplay.", "metacritic": null, "released": "2018-12-23", "tba": false, "updated": "2019-07-29T20:21:27", "background_image": "https://media.rawg.io/media/screenshots/1f2/1f233f85cc611316a2dfc70c0873cedd_Sdf01aF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["eitezaz ahmad"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["eitezaz ahmad"], "esrb_rating": null}