{"id": 328757, "slug": "taxi-driver-crazy-driver", "name": "Taxi Driver: Crazy Driver", "name_original": "Taxi Driver: Crazy Driver", "description": "Drive crazy and build your empire. Race through the city in the most famous taxis to deliver passengers on-time. -- the crazier you drive the higher your rewards! And Don’t wreck your Taxi. Your car, your rules - speed, drift, whip around corners, weave through traffic, up ramps and into the air to race the clock. Drive the yellow New York Taxi, experience the right-hand side driving with yellow Cab, take the German cars for a ride! Many cities are also waiting to be explored: London, Frankfurt, Moscow, Lahore, etc. Build and fully customize a fun collection of modern and classic cabs ready to race. Drive your car and passengers crazy across a huge and expanding 3D city: downtown, uptown, on the beach, and more. Ready! get set go Its Classic Wreckfast of Destruction overloaded and Demolition of Derby cars and wreckage<br/>Features<br/>- Full 3D open world and HD offroad environment.<br/>- Cab driving simulator<br/>- Different Vehicles (Classic cars , muscle cars, SUV, Sports etc)<br/>- Special missions, challenges and achievements.<br/>- Ultra realistic graphics.<br/>- Smooth and realistic car handling<br/>- Lots of taxis from around the world<br/>- Free Ride mode<br/>- Realistic damage system<br/>- Realistic car physics.<br/>- Biggest impossible Ramp ever<br/>- Latest Mega Ramp game series<br/>- Monster Trucks on air<br/>- Crazy unsafe tracks in the sky<br/>- Tilt steering, buttons and touch steering wheel<br/>- Real engine sounds<br/>- Futuristic City View<br/>- Request new maps and vehicles on our social media pages!<br/>Fasten your seat belts and get ready for a thrilling drive as a fearless Taxi Driver!!", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-07-29T20:18:32", "background_image": "https://media.rawg.io/media/screenshots/a28/a283c6b90f46055fe0d1ce4359efffbb_ws1Wsn4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["eitezaz ahmad"], "genres": ["RPG", "Simulation"], "publishers": ["eitezaz ahmad"], "esrb_rating": null}