{"id": 328717, "slug": "mahjong-solitaire-match-tiles", "name": "Mahjong Solitaire: Match Tiles", "name_original": "Mahjong Solitaire: Match Tiles", "description": "Mahjong Solitaire is a free mahjong tiles matching game - the best choice of Mahjong Puzzle riddle game. <br/>It’s FREE and EASY to play! <br/>Can you solve every Mahjong puzzle?<br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>MAHJONG SOLIRAIRE QUEST GAME FEATURES<br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>* Over 900 Mahjong free boards and challenging daily mahjong quests<br/>* Beautiful free mahjong tiles faces and backgrounds for you to choose from<br/>* Incredible hints and shuffles<br/>* Unlimited Undo<br/>* 4+ backgrounds: more backgrounds to come especially TATOO!<br/>* Traditional &amp; unique tile sets<br/>* Stunning simple graphics and unique mahjong gameplay<br/>* Available to play on mobile and tablet devices <br/>* Supports Achievements and Leaderboards<br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>LEARN MORE ABOUT FREE MAHJONG SOLITARIE GAME<br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>* Mahjong solitaire become one of the most popular free board game all over the world. This free board mahjong matching game is also known as Mah-Jong, Majong and Top Mahjong. <br/>* Mahjong tiles game is well known as Taipei Mahjong and Shanghai Mahjong<br/>* The innovative new version of classic Mahjong Solitaire with simple rules and addictive gameplay: Match pairs of identical mahjong tiles (connect the same mahjong block), clear all the mahjong, WIN! Make a blast in Classic Mahjong Solitaire tile matching game! <br/>* Mahjong classic solitary quest game has no time limit. Just take your time and enjoy your mahjong quests journey and blast it all! Mahjong challenges await you in this magical mahjong solitaire journey game.<br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>A GIFT FOR PUZZLE GAMES LOVER<br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>If you love puzzle, strategy, memory, and brain training challenges games you’ll love Mah-jong! Tri-peaks, solitaire, jigsaw puzzles fans, word scrabbles friends, and other smart games friends will love Mahjong Solitaire too! Challenge your brain by strategy and logic with this amazing brain puzzle game! Develop your mind and patience and strategy skills! Mahjong tiles matching game is free for kids and family.<br/>Download the best free Mahjong Classic Solitaire tiles matching game NOW！<br/><br/>For your information: some functions of Mahjong require internet service", "metacritic": null, "released": "2019-06-12", "tba": false, "updated": "2019-07-29T14:40:03", "background_image": "https://media.rawg.io/media/screenshots/80b/80bdb6961b5ee891aa04303d5957010b_C1CnD3A.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alpaca Silver"], "genres": ["Board Games", "Puzzle"], "publishers": ["Alpaca Silver"], "esrb_rating": null}