{"id": 328724, "slug": "watergunio", "name": "Watergun.io", "name_original": "Watergun.io", "description": "Spray players off the stage with your watergun!<br/><br/>Knock them off to become bigger and stronger!<br/><br/>Be the last on the map to win!<br/><br/>New game modes!<br/><br/>The most addictive .io game!<br/><br/>A real challenge! What level can you reach?<br/><br/>AUTO RENEWABLE SUBSCRIPTION *** Subscription options *** We have the following subscription option in our game: Weekly Diamond Membership offers a weekly subscription for £3.99 after a 3-day free trial. It removes all ads for the subscription period. The subscription also provides unlimited boosters and unlocking all skins. *** End of trial and subscription renewal *** This price is for United Kingdom customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence. Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. *** Canceling trial or subscription *** You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option. If you have any questions or comments, feel free to contact us at info@oak.technology<br/><br/>https://acorn.gs/privacy-policy/<br/>https://acorn.gs/terms-of-use/", "metacritic": null, "released": "2019-02-12", "tba": false, "updated": "2019-06-21T02:03:02", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1d111053e4551d79a3493686714843a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Acorn Games"], "genres": ["Action", "Sports", "Casual"], "publishers": ["Acorn Games"], "esrb_rating": "Everyone 10+"}