{"id": 328716, "slug": "doodle-color-coloring-book", "name": "Doodle Color - Coloring Book", "name_original": "Doodle Color - Coloring Book", "description": "Feel bored or stressed? Now, you can release stress with beautiful colors and masterpieces! <br/>Even if you don't have any art skills, you can easily learn how to paint an image based on \"color by number\".<br/><br/>Doodle Color - Coloring Book is a CREATIVE &amp; BEAUTIFUL artwork book with a UNIQUE DOODLE STYLE. You can easily &amp; quickly color various doodle images(like characters, animals, flowers, unicorn, mandalas, and landscapes, etc.) in your hands.<br/><br/><br/>KEY FEATURES<br/><br/>- Doodle Style Images<br/>Based on the method of \"color by number\", you can create your own artworks with a unique doodle style which you've never experience before.<br/><br/>- Editors‘ Choice<br/>One selected image will be shown on the top banner of the home page every day. And it saves your time for picking or finding images in the app.<br/><br/>- Daily Updates<br/>You can get FREE daily updated images to color, save the \"playback video\" of the coloring process and share your colored masterpieces with friends or family members at any time.<br/><br/>- Handy Tools<br/>Tools like \"Hint\", \"Paint All\" and \"Panorama Mode\" will help you to color your masterpieces in an efficient way. More tools will be added later.<br/><br/>- Great Masterpieces<br/>Besides discovering and painting your own artworks in the presented categories, you can also get great masterpieces by making the subscriptions in the app.<br/><br/><br/>SUBSCRIPTION INFO<br/><br/>By subscribing, ​you get unlimited access to all coloring books, remove-ads and ultimate hints in the app.<br/>- You can subscribe to an anually plan (starting at $49.99, billed once a year), a monthly plan (starting at $7.99, billed once a month) or a weekly plan (starting at $2.99, billed once a week). Availability and pricing of subscription plans may vary.<br/>- The payment will be charged to your iTunes Account when you confirm the purchase.<br/>- The subscription automatically renews for the same price and duration period as the original one weekly/monthly/annually plan unless canceled at least 24-hours before the end of the current period.<br/>- Any unused portion of a free trial period will be forfeited when the user purchases a subscription.<br/><br/>Terms of Service: https://sites.google.com/site/doodlecolorterms/<br/>Privacy Policy: https://sites.google.com/site/talefunprivacypolicy/<br/><br/><br/>CONTACT US<br/>support@colorbynumber.freshdesk.com<br/><br/><br/>Coloring has never been so easy for you! You can open this digital coloring book and paint your favorite coloring pages with the marked numbers. <br/>It allows you to enjoy the relaxation moment at any time and anywhere. (No paper nor pencils are needed.) Don't hesitate to download this coloring game app and start discovering the joy of art NOW!", "metacritic": null, "released": "2019-05-26", "tba": false, "updated": "2019-07-29T07:16:34", "background_image": "https://media.rawg.io/media/screenshots/005/005b46d95cecf0f1987fd58ca2220c57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Talefun"], "genres": ["Board Games", "Puzzle"], "publishers": ["Talefun Technologies"], "esrb_rating": null}