{"id": 328983, "slug": "project-extinction", "name": "Project Extinction", "name_original": "Project Extinction", "description": "<p><strong>Project Extinction (name is placeholder) </strong>is an hybrid singleplayer game between First Person Shooter, RPG, and Visual Novel genres. <br/>In your way you will face countless personalities, abstract landscapes, and lethal artifacts/weaponry.</p>\n\r\nGAMEPLAY\r\n<p>The game takes inspiration from early 90's shooters where exploration and distinctive enemies made up the perfect chemistry. The game combines this aura with a modernized approach to give the player an unique experience.</p>\n\n<p>Guns blazing in the day, and lights out at night. The game jumps from being like an action movie to become an horror movie by changing rapidly the mood and context.</p>\n\n<p>This game returns to the ideology that the player is smart enough to figure things out. Sometimes you'll face a puzzle and you'll have to solve it with just one or two subtle hints. Sometimes you will not be given a map and you'll have to figure your way out without any sort of guidance.<br/></p>\n<br/>\n\r\nKey aspects:\r\n<p>•Over 50 *different* weapons and variations, ranging from melee, to pistols, shotguns, sniper rifles and laser/plasma weapons. Inspired from real life counterparts and even some that are a completely original creation. You name it. Each one is balanced with unique abilities and patterns that are easy to pick up but hard to master.</p>\n\n<p>•Weapon customization. Suppressors and holographic sights/scopes are here to make your weapons tacticool, while also helping you in combat and boosting their stats.</p>\n\n<p>•Inventory system. Collect items to aid you on your journey, but don't spend precious minutes managing them. The inventory offers a simple, intuitive and straight-forward design for that purpose.<br/></p>\n\n<p>•Interact and talk with anyone and anything! Why make enemies when you can be best friends?<br/></p>\n\n\n<p>•Character perks. Deal more damage, or sprint faster. Character perks that can be chosen and upgraded each run will ensure replayability for the players that want to try different playstyles.</p>\n<p>•Exploration is key. Maps have secrets and collectibles while also offering different approaches for enemy encounters.</p>\n\n<p>•Many many more things that are hard to describe in such a small description!<br/></p>\r\nContact:\r\n<p>Be sure to follow my twitter, and to join the official game's discord!</p>\n<p>Twitter<br/></p>\n<p>Official Discord</p>", "metacritic": null, "released": "2019-06-20", "tba": false, "updated": "2019-06-21T03:44:50", "background_image": "https://media.rawg.io/media/screenshots/889/88907d52f5d577c09cd2cc2dd261fae5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["amuwaru"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}