{"id": 329097, "slug": "kid-e-cats-doctor", "name": "Kid-e-Cats Doctor", "name_original": "Kid-e-Cats Doctor", "description": "<p>Kid-e-Cats are wearing white hats, it means that someone needs help!<br/>Join new adventures of the cats and help them treat their friends!</p>\n<p>Alarm! You received an emergency call from a cat - he needs your help. Here is what you gonna do:<br/>1. Receive calls from different cats - they all need to be treated but you choose who will be the first.<br/>2. Pack medicine in your box - take not only meds but also something sweet for your patients.<br/>3. Get to the house of your patient - avoid puddles and trees to get there quickly and don't catch a cold.<br/>4. Do the treatment - use tools and medicine from your box and don't forget to make a sweet tea or milkshake in the end.</p>\n<p>The treatment is done! The cat is well! However, you have more patients. Check new emergency calls and go on a new visit.<br/>You will have:<br/>- 5 characters to treat<br/>- 6 types of sickness (treat a toothache, a running nose, etc.) Diagnose and vaccinate!</p>\n<p>Although doctor is a complicated job, this game will be easy to play even for the youngest! The app will tell about different types sickness, tools and medicine and other medical things that are usefull for all to know. This is not only a fun game but a way of education! Download it!</p>\n<p>If you like games with \"Kid-e-Cats\", you should look at our other games:<br/>Kid-e-Cats Picnic<br/>Kid-e-Cats Shop<br/>Kid-e-Cats Musical Coloring<br/>Kid-E-Cats Cooking Show<br/>Kid-E-Cats Sea Adventure</p>\n<p>Contact us: support@devgameou.com<br/>Stay tuned: https://www.facebook.com/DEVGAME.Kids<br/>Our website: https://devgameou.com/</p>", "metacritic": null, "released": "2019-06-19", "tba": false, "updated": "2019-06-21T04:16:33", "background_image": "https://media.rawg.io/media/screenshots/7f0/7f0ea064af6823aa24c0cec8c43ad5d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DEVGAME_OU"], "genres": ["RPG", "Educational"], "publishers": [], "esrb_rating": null}