{"id": 329065, "slug": "what-the-fuck-is-that-game", "name": "What the fuck is that game ?", "name_original": "What the fuck is that game ?", "description": "<p>Bonjour voici mon jeu pour la gamecodeur GameJam #20 : Bounces &amp; Collisions , il est encore en cours de développement mais il est </p>\n<p>Ce jeu est fortement inspiré de BBTAN (https://play.google.com/store/apps/details?id=com.crater.bbtan&amp;hl=fr) mais j'ai essayé de le tourner à ma sauce.</p>\n<p>Comment jouer : La souris sert à viser, clic gauche pour tirer (vous ne pouvez pas bouger le launcher tant qu'il est en train de tirer et vous ne pouvez pas tirer tant que toutes les balles ne sont pas retombés), les flèches directionnelles pour déplacer le tamtam (oui oui le tamtam ^^). Le but est d'aller le plus loin possible sans que les blocs ne vous atteignent. Lorsqu'un bloc est cassé il y a une certaine chance qu'il lâche une bille bonus, si vous l'attrapez avec le tamtam pour pouvez tirer une bille supplémentaire au stage suivant. De plus pour l'instant ça ne sert à rien de ramasser les billes classiques avec le tamtam ;)</p>\n<p>- Elève Premium de Gamecodeur : depuis le 29/10/2017 mais j'ai pas été un élève très sérieux ^^</p>\n<p>- Langage et Framework utilisé : Lua/Love2D</p>\n<p>- Code par AoToten (Moi)</p>\n<p>- Graphismes : j'ai pris des images qui m'intéressées et je les ai modifiées afin qu'elle correspondent à ce que je voulais.</p>\n<p>- Musique prise ici : https://www.youtube.com/watch?v=PizibOn627g</p>\n<p>- Son fait avec ma bouche + Corsair Void Pro (casque) + Audacity x)</p>\n<p>- Utilisation de librairies et codes externes : Non</p>\n<p>- Temps passé : Environ 8h pour l'instant (pas mal de problèmes avec les collisions)</p>\n<p>- Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...) : Mon code pour l'instant n'est pas propre du tout (n'allez pas le regarder pour l'instant c'est mieux pour vous ^^), je compte refactoriser le tout avant la date limite mais sinon ce qui m'a fait le plus galérer c'est pour faire des collisions cohérentes mais je pense m'être pas mal débrouiller grâce aux forums sur Internet. Ceci dit pour les graphismes ça n'a aucun sens, y'a un canon avec un tam tam, et des blocs dans l'espace xD mais ça me fait bien rire. Je suis plutôt content pour les blocs qui change de couleur suivant la vie qu'ils ont et les explosions de particules, sachant que tout ça est fait par le code, le bloc en lui même est blanc de base et les particules sont juste plein de rectangle balancés dans tous les sens xD. Finalement je pense respecter à la perfection le thème de \"Bounces &amp; Collisions\"</p>", "metacritic": null, "released": "2019-06-19", "tba": false, "updated": "2019-06-21T04:07:26", "background_image": "https://media.rawg.io/media/screenshots/1de/1de4f565e9e4b45b5260b269351c4cc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AoToten"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}