{"id": 3291, "slug": "shantae-riskys-revenge-directors-cut", "name": "Shantae: Risky's Revenge - Director's Cut", "name_original": "Shantae: Risky's Revenge - Director's Cut", "description": "By popular demand, <strong>Shantae: Risky’s Revenge – Director’s Cut</strong> is now available on Steam for Windows PC!  This brand new version combines all of the award-winning content from previous releases – and adds even more!  The pixel-based masterpiece remains intact, newly augmented with HD portrait artwork and extra challenge.  New illustrations, Steam Trading Cards, Achievements, Emoticons, Controller Support, fully configurable controls, and an unlockable Magic Mode with alternate costume round out the package.  This Director’s Cut also introduces a re-imagined Warp System, perfect for speed runners and returning players alike!  Play one of the most critically acclaimed handheld series of all time, now on your PC!   <br/> <br/><strong>Shantae: Risky’s Revenge – Director’s Cut</strong> is a powder keg of high octane, hair-whipping, hip shaking action, now available on Steam!  Features thousands of frames of animation, huge multi-sprite bosses, and a quest so big it’s bursting at the seams. Guide “half-genie” Shantae through haunted wastes, burning deserts, enchanted forests, dripping caverns and deadly labyrinths. Discover magical attacks, brew zombie coffee, save golden babies, and master the art of belly-dancing to transform Shantae into more powerful creatures. Use your powers to foil the lady pirate Risky Boots and save Sequin Land from certain doom! With its infectious characters, flirtatious humor and deliciously outlandish action, Shantae: Risky’s Revenge offers up all the hair-whipping, belly-dancing action you can handle!<br/><br/>Awards:<br/><ul><li>MetaCritic: Highest Rated Portable Game of the Year*<br/></li><li>IGN Editor’s Choice<br/></li><li>IGN Best Visuals*<br/></li><li>IGN Best Game of the Year*<br/></li><li>Nintendo Power Game of the Year*<br/></li><li>Nintendo Power Best Graphics*<br/></li><li>Nintendojo Editors' Choice<br/></li><li>iTunes Editor’s Choice</li></ul>*(awards for various platforms)", "metacritic": null, "released": "2014-07-14", "tba": false, "updated": "2023-12-12T15:53:19", "background_image": "https://media.rawg.io/media/screenshots/d0b/d0bd38b1d03f28c65c9b0e242e408214.jpg", "website": "https://wayforward.com/games/shantae-riskys-revenge/", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 61, "owned": 818, "beaten": 56, "toplay": 21, "dropped": 18, "playing": 4}, "playtime": 6, "achievements_count": 78, "ratings_count": 77, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 79, "platforms": ["Wii U", "PlayStation 4", "Xbox One", "PC"], "developers": ["WayForward Technologies"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["WayForward", "Wayforward Technologies"], "esrb_rating": "Everyone 10+"}