{"id": 329267, "slug": "muscle-magic-itch", "name": "Muscle Magic (itch)", "name_original": "Muscle Magic (itch)", "description": "<p><strong>Muscle Magic is a fresh new take on the old <em>Warlock</em> sub-genre, but with an added twist of muscly mages!</strong><br/><br/>Muscle Magic is a local multiplayer brawler in which you play as powerful, muscular wizards and barrage your opponents with a variety of wacky spells. Grab up to 3 of your friends and duke it out to see who is truly the fittest mage of them all!</p>\r\nFeatures\r\n<ul><li><strong>Local couch co-op </strong>which allows fun free-for-alls, to tactical team matches, to intense 1v1's.</li><li><strong>Challenging gameplay</strong> which is easy to get into, but difficult for those who want to master their skills.</li><li><strong>17 spells</strong> to use to KO your opponents in every exhilarating brawl.</li><li><strong>Pick a wizard</strong> you can choose from 5 different brawlers, so you decide who represents your power!</li></ul>\n\r\nFuture Plans\r\n<p>Muscle Magic is a 3rd year student project from students at Breda University of Applied Sciences. The game is still in active development, and we will continue to update it regularly until the beginning of July 2019 with additional content and tweaks. <br/><br/>If you want to give us any feedback on the game for how we can improve it throughout this development period, consider leaving a review or sharing your feedback on our social media platforms!</p>\n<p>Discord<br/>Twitter<br/>Instagram<br/>Facebook</p>\n<br/>How to play", "metacritic": null, "released": "2019-06-18", "tba": false, "updated": "2019-06-21T05:04:30", "background_image": "https://media.rawg.io/media/screenshots/fbd/fbdeb3c4028714c981225bdb896ed4ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IGAD Breda University of Applied Science"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}