{"id": 329298, "slug": "crescent-falls", "name": "Crescent Falls", "name_original": "Crescent Falls", "description": "<p><strong>Crescent Falls is a Graduation Video Game Prototype - June, 2019</strong><br/><br/></p>\n<p><strong>Pitch :  </strong><br/>Crescent Falls is an action reflexion game in where you play Heather Martin, a young witch that can travel between two dimensions. This powerful tool will be used to solve puzzles and explore the forest around Crescent Falls, with a strong aspect of time trial.  <br/></p>\n<p> <br/><strong>Synopsis :</strong><br/>Our game is based on action and reflection. We play Heather Martin, a young American student who lives in the small town of Crescent Falls, in the state of Oregon, Northern USA. She developed magical powers as she grew up, and since acquiring them, the girl had the intuition that they could one day be usefull.  <br/>This intuition proved true when a rift appeared in the sky, liberating a massive creature, which came with the intent to destroy her world.  <br/>With the help of her supernatural abilities, allowing her to change dimensions and make certain elements corrupted by the beast, move from one dimension to the other. Heather will have to progress in the forest to be able to recover two magical artifacts, some kind of ancient relics with spiritual power. Your goal will be to retrieve these in a timely manner, in order to bannish the creature and send it back to its world, and thus save Crescent Falls. You will have magic crystals which saves you a little extra time by slowing down the progression of the immense creature.  <br/> <br/><strong>Details</strong><br/>Developer : Hex Studios (student project) ArtFX school – Montpellier (France)<br/>Release : June 2019<br/>Game plateform : PC<br/>Genre : Action, Reflexion, Exploration<br/>Language : English<br/>Classification : PEGI 7 (not officially rated)  <br/>   <br/><strong>Credits</strong><br/>Core Team:  <br/>Sofie CHABROL - Artistic Direction, Concept Artist, 2D Artist<br/>Lorene HUE - Game Design, Level Design, Narrative Design<br/>Gaspard EICHER - Character Modelling, Animation, VFX Artist<br/>Stève SIMON - Level Design, UE4 Scriptor<br/>Trystan SARRADE - Environment Artist, Texture Artist, Technical Artist<br/>Specialist student : Antoine FOURNIER - Producer<br/></p>", "metacritic": null, "released": "2019-06-18", "tba": false, "updated": "2019-06-21T05:13:07", "background_image": "https://media.rawg.io/media/screenshots/ea4/ea48799c0831b7c1d68666fea87baf01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ArtFX School"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}