{"id": 329274, "slug": "chronotura", "name": "Chronotura", "name_original": "Chronotura", "description": "[EN]\r\n\n<p>Chronotura, it’s about solving puzzle using a watch that allow you to travel through time in order to solve this puzzles. Inspire by the saga of portal, its playability is completely different since its perspective is isometric. It’s completely free and you can also contribute to development of the game by leaving a comment with your opinion.</p>\n<p>Visually it looks unpolish right now, that's because it's in beta, I'll be adding features and polishing gameplay and visuals, here is a link with all the features that will be added.</p>\n<p>FEEDBACK, I need a lot of feedback, I want to hear and read about the bad, the good, the awful, what you like and what you don’t like in this game, so it can be more enjoyable.</p>\r\nControls\r\n<p>\r\nW, A, S, D: Move<br/>\r\nE: Interact<br/>\r\nSpace: Jump<br/>\r\nLeft Shift: Sprint<br/>\r\n1, 2, 3: Time travel (Past, Present, Future)<br/>\n</p>\n\r\n\r\n[ES]\r\n<p>Chronotura, es un juego de puzles en el que usas un reloj para viajar en el tiempo que te permite resolver estos puzles. Inspirado por la saga de portal, su jugabilidad es completamente diferente ya que tiene una perspectiva isométrica. Es completamente gratis y también puedes contribuir al desarrollo del juego dejando un comentario con tu opinión.</p>\n<p>Visualmente se ve poco pulido, y eso se debe a que esta en beta, estaré agregando nuevas funcionalidades y puliendo el gameplay y su apartado visual, aquí hay un link con todas las funcionalidades que serán agregadas.</p>\n<p>FEEDBACK, necesito muchísimo feedback, quiero escuchar y leer acerca de lo malo, lo bueno, lo feo, lo que te gusto y lo que no del juego, para hacerlo más disfrutable.</p>\r\nControles\r\n<p>\r\nW, A, S, D: Moverse<br/>\r\nE: Interactuar<br/>\r\nEspacio: Saltar<br/>\r\nShift Izq: Correr<br/>\r\n1, 2, 3: Viajar en el Tiempo (Pasado, Presente, Futuro)<br/>\n</p>", "metacritic": null, "released": "2019-06-17", "tba": false, "updated": "2019-06-21T05:06:21", "background_image": "https://media.rawg.io/media/screenshots/d96/d96980a05309d582fda35d1d20f82e68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["RFuchs"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}