{"id": 329252, "slug": "mega-man-space", "name": "Mega Man Space", "name_original": "Mega Man Space", "description": "Wait, Mega Man?!?! What is this?!\r\n<p>This is Mega Man Space, a retro space shooter based in the blue bomber. The gameplay is quite different from the original games but the essence is still the same.</p>\r\nOk, and... What is going on this time?\r\n<p>So as allways, Dr. Wily is going to do something bad and you have to stop him bla bla bla. This time is different.  Dr. Wily has made some spaceships for his old robot masters: the masterships. They are controlled by a robot master each. He is planning on conquering the space! He just made a spaceship fore everyone of his six original robot masters to test how well they do. Those are Cut Man, Guts Man, Ice Man, Bomb Man, Fire Man and Elec Man.</p>\n<p>In response, Dr. Light has created the Megaship and has sent Mega Man into Space in order to protect the world from evil Dr. Wily!</p>\n\r\nNow... What am I waiting to play this mastergame? Get it? Mastership, mastergame... :P\r\n<p>Nice joke... I guess. I don't know, maybe you have a slow Internet connection and that's why it's taking you so long to play it!</p>\n<p>I would love to hear your comments about this game (or not about this game, maybe it's also a great comment). Also, tell me what time does it take you to finish it (it shows right at the end).</p>\n<p>I hope you have a good time saving the world in Mega Man Space! Please, enjoy!</p>\n<p>By the way, a nice little hint: you can see a timer while playing if you hold the change weapon buttons (O + P in a keyborad, L + R on a controller or in a smartphone) instead of just pressing it at the tilte screen!</p>\n<br/>", "metacritic": null, "released": "2019-06-18", "tba": false, "updated": "2023-04-28T10:34:20", "background_image": "https://media.rawg.io/media/screenshots/e05/e053739a5dcb04115aedb321ef90a3c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android"], "developers": ["Gaspi"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}