{"id": 329413, "slug": "hechizos-literarios", "name": "Hechizos Literarios", "name_original": "Hechizos Literarios", "description": "<p>🎥 Ver introducción</p>\n<p>\"Había una vez...\"</p>\n<p>Así es como se muestran todas las historias con una final feliz pero, ¿Hechizos literarios tendrán el mismo final?</p>\n<p>Esta es la historia de Danae, una joven hechicera heredera al trono. Ella es la hija del gran rey Akil, el sabio superior del reino.</p>\n<p>Todos eran felices bajo la soberanía de Akil. Resplandecía la bondad y la luz por doquier. Sin embargo, no hay nada mejor que envidiar al Rey: Su hermano menor, Agnor.</p>\n<p>Un día, Agnor lanzó un poderoso rayo sobre el reino, desatando así la furia de Akil. Ambos hermanos desataron una batalla mortal por el poder de la corona, hasta que finalmente triunfó el mal: Agnor fue coronado como el nuevo rey y el señor.</p>\n<p>Danae, con el corazón roto, jurado de la memoria de su padre que retomaría la paz y enfrentarse a su cruel tío. Para lograr su objetivo, el antiguo conjuro Bonum, el único libro de un corazón puro era capaz de extinguir con el mal para siempre.</p>\n<p>Para obtener este hechizo, necesita llegar hasta el último piso de la biblioteca real, donde se encuentra el libro mágico con el hechizo secreto.</p>\n<p>Agnor, sabiendo que su sobrina iba a ser una venganza, hechizó todo el edificio. Con su maleficio \"Vitae Liber\", consiguió dar vida a los libros de la biblioteca y les dio un objetivo: Danae.</p>\n<p>¿Puede Danae obtener el hechizo mágico para acabar con el mal que acecha el reino?</p>\n<p>Juego enteramente realizado para la GameJamTopia organizada por Gametopia </p>", "metacritic": null, "released": "2019-06-17", "tba": false, "updated": "2019-06-21T05:45:48", "background_image": "https://media.rawg.io/media/screenshots/ee5/ee515e983bb951deaa2ebed5e996d944.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Games Relámpago"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}