{"id": 329524, "slug": "innkeeper", "name": "InnKeeper", "name_original": "InnKeeper", "description": "<p><strong>Inn Keeper</strong><br/></p><p>The goal in this game is to survive each day's events.<br/>To do so, you will have to rely on your ability to manage the resources at your disposal.</p>\n<p>The two most important resources are money and renown.</p>\n<p>1) Money, as you can imagine, allows you to purchase improvements for your tavern.</p>\n<p>It's also the means to convince adventurers to work under your name.</p>\n<p>2) Renown resembles reputation.</p>\n<p>Do good deeds and you will increase your renown.</p>\n<p>Throughout the day, there's a number of events that may take place, such as:</p>\n<ul><li>People coming to the tavern for drinks or for a room.</li><li>Adventurers offering their services.</li></ul>\n<p>You will also have the ability to improve your tavern by adding more tables and rooms.\r\nThat way, more people may find their way in, as well as their money.</p>\n<p>Your resources will suffer losses due to different predetermined situations.</p>\n<p>At the end of each day, you need to pay for the services you hired.\r\nAt the end of each week, the King's collectors will require the weekly tax payment.</p>\n<p>Additionally, there's a save system implemented so you can continue your playthrough whenever you like it.</p>\n\n<p>If you find any bugs or feel like giving some feedback, feel free to comment.</p>\n\n<p>Thanks for reading all this! And I hope you enjoy this game.</p>\n\n<p>Important note:  if you get an error that says \"unable to get property ‘getParameter’ of undefined or null reference\" and you are using Microsoft Edge, it's a problem with the game engine I used. It works fine with Firefox or Chrome, and I haven't tried other browsers. Sorry!<br/></p>", "metacritic": null, "released": "2019-06-17", "tba": false, "updated": "2019-06-21T06:17:29", "background_image": "https://media.rawg.io/media/screenshots/73a/73ab0d6906841c47da0b0b9cdb08c517.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["anzorein"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}