{"id": 329567, "slug": "galaxy-strike-space-shooting-squadron", "name": "Galaxy Strike: Space Shooting Squadron", "name_original": "Galaxy Strike: Space Shooting Squadron", "description": "Other planets in Solar System had fallen by the invaders. Pluto was on the edge of danger. In the situation, Pluto’s defense squad had made a decision to destroy the enemies &amp; bring peace back to the universe. Heading to the evil lair layed on Sun, the squad took off from Pluto &amp; shot enemies down on their way.<br/>Get ready to against the enemy's attack anywhere, anytime.<br/><br/>HOW TO PLAY:<br/>Galaxy Strike is a third person action game (Particular: Vertical Shoot them up), you role in the spaceship, your mission is fighting against the invaders and protecting the universe.<br/>Just need one finger to drag your spaceship &amp; auto-fire (minimize control operation while playing so the player only needs to focus on attacking and avoiding enemies).<br/>Moreover, Auto-fired combined with unlimited bullets (enjoy shooting without worrying about bullets).<br/><br/>FEATURES:<br/>- Simple controls with one finger that doesn’t need a tutorial<br/>- 03 game modes to explore: Classic, Endless &amp; PvP<br/>- Over 40+ levels to complete<br/>- Various spaceship with their own unique bullets &amp; special skills<br/>- Different epic bosses with their bullet hell<br/>- Amazing lighting and special effects<br/>- Thrilling fun maximizing the shoot them up game feeling<br/>- Numerous reward resources<br/>- High-quality graphics &amp; sounds<br/>- Playable OFFLINE <br/><br/>SUPPORT:<br/>If you’re having any problems with this game, feel free to contact us at: info@gemmob.com<br/>We’re looking forward to hearing your feedback!<br/><br/>ARE YOU READY TO STRIKE in GALAXY STRIKE? DOWNLOAD NOW FOR FREE!", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2019-06-24T01:44:04", "background_image": "https://media.rawg.io/media/screenshots/d33/d33c561cf9876bde0b2fa5f692f2197a.jpg", "website": "http://gemmob.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GEM MOBILE SOFTWARE COMPANY"], "genres": ["Action", "Casual"], "publishers": ["GEM MOBILE SOFTWARE COMPANY"], "esrb_rating": "Everyone 10+"}