{"id": 329699, "slug": "trudny-wybor", "name": "Trudny Wybór", "name_original": "Trudny Wybór", "description": "Co wolisz: zjeść zepsute mięso, czy wypić dwutygodniowe mleko? Przetrwać inwazję obcych, czy epidemię zombie? Mieć pięknego partnera, który Cię zdradza, czy brzydkiego, który jest Ci wierny?<br/><br/>Jeżeli kiedykolwiek podobne dylematy zawracały Twoją głowę, mamy dla Ciebie idealne rozwiązanie – naszą grę Trudny Wybór!<br/><br/>Od teraz cała masa głupich, zaskakujących, irracjonalnych, ale także (czasami) dających poważnie do myślenia diabelskich propozycji czeka na Twoją decyzję – co wybierasz?<br/><br/>Głosuj na pytania wysyłane przez graczy z całej Polski, dokonuj trudnych wyborów i sprawdź, czy podobnie myślą inni gracze! <br/><br/>Wysyłaj znajomym najciekawsze diabelskie propozycje za pośrednictwem aplikacji Messenger<br/><br/>Ty też możesz zostać współtwórcą gry - dodawaj własne pomysły! Jeżeli nie będzie ona ukrytym przepisem na słodkie rogaliki, wyląduje w Poczekalni. Stąd już prosta droga na główną!<br/><br/>Idealne na wieczór panieński, ognisko, zakrapianą imprezę, spotkania na herbatce u dziadków, czy do poczytania na toalecie. Polecane także jako środek rozweselający po nieudanym sprawdzianie czy egzaminie lub wakacyjne nudy.<br/><br/>Prosto od Simplicity Games. Tych od „Czółka”. I „Przyznaj się”. I od „Co jest grane?”. W sumie od „Zgadnij co to?” też. I od „O… - jeszcze nie wyszło, ciiii…", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2019-06-24T02:54:11", "background_image": "https://media.rawg.io/media/screenshots/ffa/ffa78fbc188eb118cac17b3081d5bfc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tomasz Dyrak"], "genres": ["Family"], "publishers": ["Tomasz Dyrak"], "esrb_rating": "Mature"}