{"id": 329681, "slug": "hair-salon-story-haircut-game", "name": "Hair Salon Story: Haircut Game", "name_original": "Hair Salon Story: Haircut Game", "description": "Have you ever dreamed of running your own barber shop or hair salon? Then here’s a hair cutting salon for you. Provide the best hair cutting services to your customers and become the best hairdresser in the city!<br/> <br/>Hair Salon Story is a fun 2D game, where you are a virtual hairdresser. There are a lot of customers in your barbershop, and all they want a stylish haircut. Only you can take care of their hair and make them look amazing. So grab your tools and give your first haircut!<br/> <br/>Hair cutting in this game helps you improve your dexterity, accuracy, and concentration. When you cut your customer’s hair, you need to stop the moving slide at the right spot several times to complete the haircut. If you stop in the green area, it means you cut your customer’s hair wonderfully. The yellow area means your cut is satisfactory. It doesn’t seem too challenging at first sight . . . but it is! One false move during the hair cutting and your customers will be fuming!<br/> <br/>Imagine you’re working in the most popular hair cutting salon in the city. You never know when a celebrity might pop in for a new haircut before the award ceremony. It will be easy for you to know if they are happy with the haircut or not. Just follow their emotions. If a completed haircut makes your VIP customers furious, you won’t be paid and they won’t come anymore.<br/> <br/>Once your customer is super happy with their haircut, you receive money and beat the level. The more money you earn, the more you can buy:<br/>New tools. Scissors, brushes, hairdryers – all these will help you to create perfect hairdos for your customers.<br/>New modern, furnished rooms for your hair salon. The more luxurious your barbershop is, the more often VIP customers will come there.<br/> <br/>What are you waiting for? Start your business now and become a famous hairdresser with this funny game.<br/> <br/>Don’t forget to give us feedback – it will help us invite more celebrities and make the game even better. Have fun!", "metacritic": null, "released": "2019-06-19", "tba": false, "updated": "2019-08-05T06:18:40", "background_image": "https://media.rawg.io/media/screenshots/056/05673aa312102f674accf128d1c76739.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ascella Apps"], "genres": ["Casual"], "publishers": ["Ascella Mobile"], "esrb_rating": null}