{"id": 329624, "slug": "shoot-goal-multiplayer-pvp", "name": "Shoot Goal - Multiplayer PvP", "name_original": "Shoot Goal - Multiplayer PvP", "description": "Play the Multiplayer Soccer Cup! Fight for the Victory of your country, score the winning goal with the hero of your national team, challenge your rivals around the world and win the Multiplayer Soccer Cup 2019!<br/> <br/>You have never seen a Soccer game like that. Compete against rivals from all over the world and play soccer with your friends, fight for your country to win the cup and get unique and exclusive REWARDS! In this soccer game we premiere NEW shooting mode, paint with your finger the shot of free kick or penalty, and you will see a SPECTACULAR shot on goal, with exclusive soccer animations of REAL soccer shots. If you are precise scoring free-kicks and penalties ... you will be the winner of the Multiplayer Soccer Cup!<br/> <br/>With an easy, simple and addictive football game mechanic, Shoot 2 Goal Multiplayer Soccer Cup 2019 offers you infinite fun and a feeling of authentic competitive football!<br/> <br/>In this soccer game, you will have 3 available modes:<br/> <br/>- Online Soccer Cup Mode: This is the new completely revolution football mode where the champions have to show their skills. Challenge players from all over the world and win cups with fouls and penalties, with all kinds of multipliers and incredible effects in which you will have to get more points than your opponent to win the football game. Fight for your country every season and get INCREDIBLE football rewards, make your country win the world multiplayer cup and you will be rewarded with unique SKINS, which you can show your rivals and FEEL UNIQUE. Who would not like to play a real football game being a super saiyan?<br/><br/>Beat the Score of your league to earn incredible rewards in the new Online Mode, real multiplayer fast-peaced action scoring amazing goals!<br/> <br/>- Offline Soccer Cup Mode: If you prefer to play against the AI, we have prepared a spectacular football world, where you can play with your favorite soccer team and win the world multiplayer cup by free kicks and penalties, with all the stages in the Multiplayer Soccer Cup 2019; Group stage, eliminatory, a spectacular final ... Get exclusive REWARDS with your favorite country.<br/> <br/>- Classic mode: Go through all the soccer fields of the world in search of fame, become the best soccer player in the world and manage to overcome all the challenges available in this way. More than 150 soccer challenges to prove that you are the best soccer player in the world.<br/> <br/> <br/>Shoot to goal and get the highest score to be the champion and win the best soccer rewards!<br/><br/>-<br/><br/>Bambo Studio 2018 - The best mobile soccer games<br/>Web: www.bambostudio.com<br/>Facebook: facebook.com/bambostudio<br/>Twitter: @bambostu", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2019-06-24T02:19:20", "background_image": "https://media.rawg.io/media/screenshots/540/540db8e05dcec8ceb8b9088aa060254f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bambo Studio"], "genres": ["Simulation", "Sports"], "publishers": ["Bambosoft"], "esrb_rating": "Everyone 10+"}