{"id": 329697, "slug": "drink-master-party-game", "name": "Drink Master - Party Game", "name_original": "Drink Master - Party Game", "description": "Have you always dreamt of working as a bartender?<br/>Do you consider perfectly poured cocktails and drinks to be your life goal?<br/>Do you always pour beer perfectly into a glass?<br/><br/>Then Drink Master is the game for you!<br/><br/>Become a Drink Master. Pour the liquor and show everyone that you can create the perfect cocktail! <br/>Don't forget to add an ice cube.<br/><br/>This extremely simple (yet addictive!) game allows you to mix different colourful drinks into extremely refreshing compositions! Give your fantasy free rein – mixing beer with beer? No problem! <br/>Your task is to mix drinks perfectly, up to the set limit!<br/><br/>While pouring drinks will be very easy at the beginning, over time (it's a time trial game after all) it may not be possible to match the ideal proportions of a cocktail and nobody will want to drink it.<br/><br/>We have many different types of drinks, liquors, beautiful bottles, glasses, ice cubes, as well as cool decorations in store for you, to make your drinks and cocktails look amazing!<br/>And you don’t even need a shaker! All you need is your dexterity!<br/><br/>Every cocktail and bottle featured in the game was inspired by real life – and like every bartender. you will be able to check whether pouring cocktails will be easy for you and the guests will want to drink them, or if you will find it impossible and flip out of frustration.<br/><br/>We have prepared a lot of levels, and in each of them you will mix great cocktails, and their level of difficulty will be constantly increasing! <br/>The right mix of beverages poured from colourful bottles with ice cubes will make you a real drink master (and not just some common bartender).<br/><br/>This simple time trial game, which allows you to pour drinks into beautiful glasses, was made for you by Simplicity Games, the most unconventional game developers and authors of the Ski Jump Challenge.", "metacritic": null, "released": "2018-09-17", "tba": false, "updated": "2019-06-24T02:52:58", "background_image": "https://media.rawg.io/media/screenshots/e6e/e6e2972ddb6461849a3140d3422a4fe4_Bv3HGXX.jpg", "website": "http://facebook.com/SimplicityGame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tomasz Dyrak"], "genres": ["Casual", "Puzzle"], "publishers": ["Tomasz Dyrak"], "esrb_rating": "Mature"}