{"id": 329692, "slug": "panstwa-miasta", "name": "Państwa Miasta", "name_original": "Państwa Miasta", "description": "Państwo i miasto na F zapewne znasz. A dinozaura, albo klub piłkarski?<br/><br/>Zagraj w legendarną grę, od pokoleń umilającą czas znudzonym uczniom, którym zbrzydła szkoła, uziemionym w domu na czas ferii rodzeństwom, studentom na salach wykładowych, a także prawdopodobnie każdemu kogo poznałeś.<br/><br/>Od teraz możesz zapomnieć o organizowaniu stosów papieru, tuzina długopisów, rysowaniu rozbudowanych tabel i podliczaniu punktów. Wszystko zrobi za Ciebie nasza aplikacja!<br/><br/>Słowa musisz zgadywać w ponad 30 kategoriach, które dzięki waszej pomocy ciągle będziemy ulepszać! Są wśród nich zarówno typowe dziedziny jak nazwy państw, miast, rzek, czy stolic, jak i tytuły filmów, seriali oraz gier.<br/>Zdobywaj punkty i monety, które możesz wykorzystać na podpowiedzi w kryzysowych momentach.<br/><br/>Przemierzaj kolejne kraje zmagając się z różnej klasy przeciwnikami, odkrywaj lokalne zabytki i poszukuj inspiracji do kolejnych słów!<br/>Zagraj z przyjaciółmi na wielu telefonach korzystając z opcji gry w pobliżu, która pozwala tworzyć pokoje widoczne dla graczy w najbliższym otoczeniu. To świetna opcja do na przykład gry na 2 osoby, albo gry na przerwę! <br/>Pamiętaj, aby włączyć nadajnik GPS! Tylko wtedy będziecie mogli rozegrać dwuosobowe gry, albo nawet większe.<br/><br/>Impreza dopiero się zaczyna!<br/>Gdy nie masz nikogo pod ręką, możesz zmierzyć się z graczami z całego kraju w grze online!<br/><br/>A wszystko jak zwykle w starannie przygotowanej oprawie graficznej i dźwiękowej.<br/>Gra dla dziewczyn i chłopaków, małych i dużych!<br/>Gwarancja jakości twórców Czółka i Zgadnij co to?", "metacritic": null, "released": "2018-01-13", "tba": false, "updated": "2019-06-24T02:50:09", "background_image": "https://media.rawg.io/media/screenshots/b6a/b6ac509234bc0d00be808dac502e54c4.jpg", "website": "https://www.facebook.com/SimplicityGame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tomasz Dyrak"], "genres": [], "publishers": ["Tomasz Dyrak"], "esrb_rating": "Everyone 10+"}