{"id": 329625, "slug": "anthem-of-heroes", "name": "Anthem of Heroes", "name_original": "Anthem of Heroes", "description": "Thought long gone, the Dominators are back and their venomous tendrils are spreading fear across the Universe. As more malevolent villains join their army, the Dominators prepare to ‘cleanse’ the Universe of all they consider inferior, Doomsday is coming! <br/><br/>In the name of justice, of the innocent, and of freedom, you must reawaken fearless heroes and unite them to battle the evil. You are the last hope, don’t let the darkness descend!  <br/><br/>#FEATURES#<br/>\t•\tA truly epic and engrossing narrative RPG experience with breath-taking visuals. <br/>\t•\tOver 100 different heroes &amp; cards to collect, upgrade and combine!<br/>\t•\tForge your heroes each with their own unique legendary weapons and special abilities.<br/>\t•\tMaster your deck, taking control during visceral battles.<br/>\t•\tSet to auto battle and watch your heroes take on the Dominators in heated combat.<br/>\t•\tTake charge and control the battle or use Auto-play and employ stunning tactics even when offline.<br/>\t•\tParticipate in daily events and compete world-wide in the epic arena league.<br/>\t•\tExplore the game hub, enter trials, visit the tavern or enter the dungeons for heroic challenges.<br/>\t•\tForge new heroes with unique Auras in the Creator Hall.  <br/>\t•\tVisit the Blacksmiths to forge powerful new weapons or mystical runes.<br/> <br/>#SUBSCRIPTION<br/>Anthem of Heroes offers a monthly subscription. VIP players are entitle to some great game features.<br/><br/>Gold Pass ($9.99/30 Days)<br/>-Increases Role EXP: +50%<br/>-Increases Hero EXP: +50%<br/>-Increases Gold: +50%<br/><br/>Price may vary by location. <br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>Privacy Policy: http://www.tangram-games.com/TangramPP.html<br/>Terms of Service: http://www.tangram-games.com/TangramTS.html<br/><br/>Contact us: <br/>support@tangram-games.com", "metacritic": null, "released": "2019-05-08", "tba": false, "updated": "2019-06-24T02:19:44", "background_image": "https://media.rawg.io/media/screenshots/1c1/1c159c76a982b6cf3f636c70911b658d_rquvsKH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tangram Interactive"], "genres": ["RPG", "Strategy"], "publishers": ["Tangram Interactive"], "esrb_rating": "Everyone 10+"}