{"id": 329718, "slug": "birzzle-pandora-hd", "name": "Birzzle Pandora HD", "name_original": "Birzzle Pandora HD", "description": "***** Korean Mobile App Award 2011 <br/>***** The most popular application (1st place) in Asia appstore - Distimo, TechCrunch <br/><br/><br/>※ Description <br/><br/>A new brand of Drag n Drop block puzzle game lining up the same type of birds and making it disappear by the use of fingertip. Provides optimized system which sustains better flexibility and simplicity of movements in touch control than prior puzzle games on the market; in return, provides a quick action arcade puzzle anyone can enjoy. <br/><br/>Just move the birds freely. That’s all. <br/>Move your fingers really fast. Then, you could be the number one. <br/><br/>1. Classic Mode : A speedy free action puzzle game. <br/>2. Pandora Mode : The goal of Pandora mode is to match birds and collect the letters in order to get the highest score possible in two minutes. <br/>3. Ice Break Mode : Tense and thrilling mode within a set time while breaking the ice. <br/><br/><br/>※ Game specific features <br/><br/>1. A game people of all ages can enjoy. <br/>2. Touch-screen optimized control <br/>3. Offer 3 different game modes <br/>4. Support for Game Center. Share your rankings with your friends! <br/>5. Play with your Facebook friends all over the world. <br/>6. Stunning visuals that leverage the Retina Display <br/><br/><br/>※ New features of Birzzle Pandora <br/><br/>1. Added a new mode : Pandora Mode (By connecting with Facebook, players can compete with others for a high score on leaderboards) <br/>2. Invite Friends at Fcebook and Get coins. <br/>3. Connect Faccebook account and get 50,000 coins for gift. <br/>4. Get high scores using powerbirds. <br/>5. Newer High quality graphics <br/>6. More rich and addictive high quality sounds. <br/>7. Corrected bugs at Classic mode and Ice Break mode <br/>8. Connection to Official Facebook Fanpage <br/>9. Added Vibration when the powerbird pops, . <br/>10. Optimization Graphic Engine for better performance  <br/><br/><br/>※ Follow and join us! <br/><br/>Website : http://birzzle.com <br/>Facebook : http://www.facebook.com/BirzzleOfficial <br/>Twitter : http://www.twitter.com/enfeelstudio <br/>Contact : contact@enfeel.com", "metacritic": null, "released": "2011-05-04", "tba": false, "updated": "2019-08-12T03:46:27", "background_image": "https://media.rawg.io/media/screenshots/875/87578949370c4003e65ae66df77d2507.jpg", "website": "http://enfeel.com/birzzle/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Enfeel"], "genres": ["Casual", "Puzzle"], "publishers": ["Enfeel"], "esrb_rating": null}