{"id": 329716, "slug": "medal-heroes-arena-battle", "name": "Medal Heroes: Arena Battle", "name_original": "Medal Heroes: Arena Battle", "description": "Summon and awaken the heroes that lay dormant in the medals to defeat the demon army and become the true medallion summoner! The Medallion Kingdom that has fallen into chaos is seeking summoners like you.<br/> <br/> <br/> ◆ Game Introduction ◆<br/> <br/> ▶ Fast and dynamic battles with unpredictable outcome◀<br/> Action packed unpredictable battles played with 5 heroes in constant action! <br/> You can enjoy strategic team plays with simple control by pressing the skill buttons!<br/> <br/> ▶ Summon original heroes unique to Medal Heroes ◀ <br/> Enjoy collecting more than 300 unique heroes!<br/> Check out the heroes who are eagerly waiting to be summoned right now.<br/> <br/> ▶ Easy and fast character development through the Training Camp ◀<br/> Don't worry about probability! Don't worry about efficiency! The heroes develop even when you are not playing the game.<br/> Develop your heroes easily and conveniently through the Training Camp!<br/> <br/> ▶ Never a dull moment through diverse contents ◀<br/> Endless contents through 10 strategic PVE and PVP modes are awaiting your engagement.<br/> <br/> <br/> <br/> Real-time Casual RPG at your fingertips!<br/> Come see Medal Heroes right now!<br/> <br/> <br/> <br/> ◆ Official community of Medal Heroes ◆<br/> https://www.plug.game/medalheroesglobal", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2019-08-12T03:46:25", "background_image": "https://media.rawg.io/media/screenshots/969/969f2f8d3c360a5ff5d4041d0959f349.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Enfeel"], "genres": ["Adventure", "RPG"], "publishers": ["Enfeel"], "esrb_rating": null}