{"id": 329700, "slug": "football-run-soccer-game", "name": "Football Run - Soccer Game", "name_original": "Football Run - Soccer Game", "description": "Piłka nożna, football, soccer – sport o kopaniu piłki ma przeróżne nazwy w różnych częściach świata. Jednak nie nazwa jest najważniejsza – każdy wie, że gdy zbliżają się mistrzostwa świata (choć niektórzy mówią na to mundial) liczy się tylko to co na boisku wyczyniają Lewandowski, Błaszczykowski, Ronaldo, Messi i inne gwiazdy gry w football. A co gdyby na tegoroczne mistrzostwa świata – a więc Mundial Rosja 2018 - zawitała gra platformowa?<br/><br/>Football Run – najnowsza produkcja platformowa Simplicity Games, wprowadzi was w piłkarski klimat jaki w 2018 roku ma zaszczyt serwować dla świata Rosja. <br/>Ta platformówka to dynamiczne poziomy, osadzone w świecie piłki nożnej, mocno inspirowanym  tegorocznym mundialem. Nasza piłkarska gra platformowa, już po włączeniu daje jasno znać że na świecie powinny istnieć jedynie football i soccer – nasi przeciwnicy w grze to ludzie zafascynowani przez ten sport.<br/><br/>Tempo naszej rozgrywki to tempo najlepszych piłkarzy na świecie – nawet w czasie mistrzostw Lewandowski, Ronaldo, a nawet Messi mieliby problemy z dogonieniem naszego zawodnika – gra toczy się bardzo szybko, a twoim zadaniem jest dotrwać do końca i uzbierać wszystkie monety oraz przedmioty na planszy, dla których piłka nożna jest mocną inspiracją!<br/><br/>Nasza platformówka pozwala wcielać się w swoich ulubionych piłkarzy, przechodząc kolejne poziomy – nie wiemy czy twoim ulubionym piłkarzem jest Messi, Ronaldo, czy Lewandowski, a może Błaszczykowski – ale przeglądając dostępne postaci powinieneś móc wybrać kogoś dla siebie. Jeżeli lubiłeś grę z Head, a także Soccer w nazwie, gdzie zawodnicy mieli wielkie głowy, to nasza gra jest o wiele lepsza – frajda i zabawa wylewają się z ekranu wraz z każdym, starannie dopracowanym poziomem.<br/><br/>Polska gola! Kolorowa, pełna życia grafika, oprawa muzyczna w stylu, w którym już w 2018 wybrzmi cała Rosja, a także atrakcyjne i grywalne poziomy, kolekcja piłkarzy do odblokowania i wiele innych niesamowitych rzeczy – to wszystko oferuje wam ta niesamowita gra platformowa o mundialu - platformówka Football Run.<br/><br/>Jeżeli grałeś w nasze poprzednie gry – a więc Ski Jump Challenge (Skoki Narciarskie), Czółko, Co jest grane, Zgadnij co to, Przyznaj się, Państwa miasta, Quiz sportowy – to dobrze wiesz, że czeka na Ciebie mnóstwo dobrej zabawy!<br/><br/>Oby Polska zdobywała w Rosji jak najwięcej goli – niech wynik będzie przynajmniej taki jak na Euro we Francji 2016, a najlepiej jeszcze wyższy!", "metacritic": null, "released": "2018-07-23", "tba": false, "updated": "2019-06-24T02:54:39", "background_image": "https://media.rawg.io/media/screenshots/647/647b39332cc5282cd707faf1d4f886e0.jpg", "website": "https://www.facebook.com/SimplicityGame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tomasz Dyrak"], "genres": ["Action", "Sports"], "publishers": ["Tomasz Dyrak"], "esrb_rating": "Everyone 10+"}