{"id": 330022, "slug": "hammer-defender", "name": "Hammer Defender", "name_original": "Hammer Defender", "description": "<p>Our entry for the JamCraft 3. Think Overcook but single player and with forging weapons instead.</p>\n<p>You have to fulfill enough orders within the time limit to clear the level. There are 3 types of weapons you can craft: sword, axes and shield. Use the forge and iron ingots to craft metal parts, then use the anvil to forge them into shape. Each parts takes a certain amount of time to forge properly. Too much or too little time on the anvil will make the quality of the weapon poorer and yield less points.</p>\n<p>Metal parts cool down after being cast, make sure to forge it soon after or it will be harder and take more time to shape it. If your iron part runs cold, place it in the kiln to warm the iron back up.</p>\n<p>Make wood parts by placing wood on the woodworking bench. Then, when both parts are ready, slot them on the crafting bench and if both parts are present it will create the weapon.</p>\n<p>To submit the order, place the weapon in the delivery elevator.</p>\n<p>Controls:</p>\n<p>Left click: grab objects and interact with stations. click again to drop the object you are holding. Hold and release to throw the object, the longer the hold the farther the throw.<br/></p>\n<p>Right click: Throw the current object at maximum strength.</p>\n<p>Esc: close the game</p>\n<p>R: When the round ends, restart the level</p>\n<p>Credits:</p>\n<p>Programming: Sebastien Hutt, Jacob Stove Lorentzen</p>\n<p>Art: Kristen Malone, Daniel Marseglia<br/></p>", "metacritic": null, "released": "2019-06-22", "tba": false, "updated": "2019-06-24T04:40:25", "background_image": "https://media.rawg.io/media/screenshots/433/433ffe7e87957802d92397cca56fbd7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sigf"], "genres": [], "publishers": [], "esrb_rating": null}