{"id": 330182, "slug": "ehrenfeucht-fraisse-games-on-lauchli-leonard-linea", "name": "Ehrenfeucht-Fraïssé Games on Läuchli-Leonard Linear Orderings", "name_original": "Ehrenfeucht-Fraïssé Games on Läuchli-Leonard Linear Orderings", "description": "<p>Gaze into the infinite with Ehrenfeucht-Fraïssé Games on Läuchli-Leonard Linear Orderings<br/></p>\r\nPlaying\r\n<p>The Ehrenfeucht-Fraïssé Game is a game about first order logic. Players take turns matching up the points of two linear orderings. The two linear orderings are shown above each other in the same window, one in the top half and the other in the bottom half.<br/></p>\n<ol><li>First, Player I (Spoiler) selects a point in <strong>either</strong> linear ordering that has yet to be selected, and colors it a new color.</li><li>Next, Player II (Duplicator) selects a point in the <strong>other</strong> linear ordering that has yet to be selected, and colors it the same color and draws a line between the two points.</li></ol>\n<p>Lines cannot cross, and players cannot select points that have already been picked. The game ends if either player cannot move. Spoiler's (Player I's) goal is to end the game as quickly as possible. Duplicator's (Player II's) goal is to last as long as possible.<br/></p>\r\nControls\r\n<p>Many of the linear orderings in this game are infinite and in order to access all their points, you're going to need to zoom in. The top and bottom linear orderings pan and zoom independently.<br/></p>\n<ul><li>Zoom in or out with the mouse wheel.</li><li>Pan by clicking and dragging.</li><li>Click on a point to move there.</li><li>Arrows will appear on the left and right edges of the linear orderings to indicate that the linear ordering continues in that direction. Click on them to zoom out in that direction.</li></ul>\r\nTurns Remaining\r\n<p>Because the linear orderings are infinite, it's possible for the game to go on forever. There are three possible ways of resolving this:<br/></p>\n<ul><li>Players determine between themselves if the game will go on forever, and if it does, duplicator is declared victor.</li><li>Players agree before starting the game a maximum number of turns. If duplicator can last that number of turns, they win.</li><li>Spoiler decides before starting the game a maximum number of turns. If duplicator can last that number of turns, they win.</li></ul>\n<p>For the later two options, a turn timer is available. Check the \"Show Turns Timer\" box under options.<br/></p>\r\nLinear Order Creator\r\n<p>The linear orderings you can play on are those which appear in the theorem of Läuchli and Leonard, which, in some sense capture the interesting linear orderings to play EF games on. They include some basic linear orderings:<br/></p>\n<ul><li>Finite linear orderings (n): We use numbers to represent the linear ordering with that many points (including 0).</li><li>Omega (ω): An infinite linear ordering that goes off infinitely to the right (the ordering of the positive integers): \r\n</li><li>Omega-Star (ω*): An infinite linear ordering that goes off infinitely to the left (the ordering of the negative integers): \r\n</li><li>Zeta (ζ): An infinite linear ordering that goes off infinitely to the left and right (the ordering of the integers): \r\n</li><li>Eta (η): An infinite linear ordering where between any two points can be found another point (the ordering of the rational numbers, although points have been spread out for clarity): \r\n</li></ul>\n<p>From these basic linear orderings, one can obtain the full collection of Läuchli-Leonard linear orderings by freely applying the following operations:<br/></p>\n<ul><li>Concatenation (+): This operation puts linear orderings next to each other, in the order that they are added.</li><li>Omega Copies (⋅ω): This operation starts with the linear order ω and replaces every point by the linear order being copied, producing infinitely many copies of the original linear ordering going off to the right.</li><li>Omega-Star Copies (⋅ω*): This operation starts with the linear order ω* and replaces every point by the linear order being copied, producing infinitely many copies of the original linear ordering going off to the left.</li><li>Shuffle (σ): This operation takes any number of linear orderings and replaces the points of η in such a way that between every two points of the original η is a copy of each of the linear orderings being shuffled together.</li></ul>", "metacritic": null, "released": "2019-06-21", "tba": false, "updated": "2019-06-24T05:25:44", "background_image": "https://media.rawg.io/media/screenshots/bc8/bc85e7016f721ba66992d6d8f7376086.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["trkern"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}