{"id": 330192, "slug": "monochrome-rpg-demo", "name": "Monochrome RPG (Demo)", "name_original": "Monochrome RPG (Demo)", "description": "<p><strong>Otto Needs Your Help!</strong></p>\n<p>Otto’s beloved city of Vaudeville, has been beset by a force bent on eliminating any form of amusement! The Bleak Barons, and their sourfaced leader, Chairman Fountainhead, are converting innocent creatures into killjoys! The Barons are sending them into Vaudeville to harass the playful and kindhearted citizens!</p>\n<p>Fortunately for the characters of Vaudeville, Otto is a quick-witted, highly talented aspiring hero, with dexterity and comedic instinct. All Otto needs to do is get out of his house and into Vaudeville so he can help his friends and save the day!</p>\n<p><strong>Who is Otto?</strong></p>\n\n<p>Otto is our small part rabbit, soon-to-be hero! After defeating the terrible creature in his basement he’s decided to head to Vaudeville to help protect the citizens from the sinister Bleak Barons.</p>\n<p><strong>Entertain Enemies! Have Them Join Your Audience!</strong></p>\n<p>As Otto journeys throughout the different districts of Vaudeville, he will encounter various enemies. Otto being a fairly talented comedian, is able to entertain his foes and turn them into raving fans who’ll join his audience. After joining Otto’s audience the fans will travel with Otto in order to watch his hilarious hi-jinx!</p>\n\n<p><strong>Art and Music Reminiscent of the Roaring 20s</strong></p>\n\n<p><strong>How You Can Help!</strong></p>\n<p>Even though Otto’s story has been written, he’ll never be able to truly free his city from the Bleak Barons without your talent and vision.</p>\n<p>We’ve written the story of Otto and his travels through his 1920s, monochrome cartoon world. We’ve even built the programming framework required to see the game to completion, however, there are thousands of pieces of art that we'll need to complete the game.</p>\n<p>We’re not asking for your money.</p>\n<p>We’re asking for your talent, your participation, and your vision to make Otto’s story come alive. </p>\n<p>Help us build Otto’s world – and then play the game so you can help Otto save Vaudeville!</p>\n<p>The Monochrome Workshop is a collection of artists, programmers, and storytellers that have signed up to help provide the raw materials required to build the game.</p>\n<p>Twitter</p><p>Help Us Improve the Game! Fill out the Demo Survey after playing!</p>", "metacritic": null, "released": "2019-06-21", "tba": false, "updated": "2019-06-24T05:28:03", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DVNC Tech"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}