{"id": 330243, "slug": "aminoacid", "name": "Aminoacid", "name_original": "Aminoacid", "description": "<p>Aminoacid is a fast paced, physics based, colour matching game inspired by the real life process of protein formation inside our cells.</p>\n<p>Match the Aminoacids with the corresponding Codon in the RNA strand by dragging them into the Ribosome.</p>\n<p>… Or in real words: Match the coloured balls with the coloured rectangle at the bottom by dragging them to the slot.</p>\n<p>Race to the highest score you can, but be careful to avoid mutations and toxins!</p>\n<p><strong>Includes 3 game modes across 4 difficulties:</strong></p>\n<ul><li><strong>Arcade:</strong> Score as high as you can within the time limit.</li></ul>\n<ul><li><strong>Synthesis:</strong> Try complete a chain 100 long without making too many mistakes</li></ul>\n<ul><li><strong>Real Synthesis:</strong> Create the chains of real life proteins, including Insulin and Hemoglobin.</li></ul>\n<p><strong>Some backstory (which you won’t care about):</strong></p>\n<p>Aminoacid started life when I was at college, and was eventually “finished” as part of my internship at ZPX - Interactive Software, being released in September 2014... with little fanfare and no business plan, was played by basically no-one and made no money.</p>\n<p>Since the game has since been dropped from all mobile stores, I’ve decided to port it to PC, make some very much needed improvements, and release it here completely free.</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2019-06-21", "tba": false, "updated": "2019-06-24T05:40:54", "background_image": "https://media.rawg.io/media/screenshots/4dd/4dda11406b137fcc229c3135283f904f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Xocrates"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}