{"id": 3316, "slug": "ultra-street-fighter-iv", "name": "Ultra Street Fighter IV", "name_original": "Ultra Street Fighter IV", "description": "<p>Ultra Street Fighter IV is a multiplatform fighting game developed by Capcom. It is an arcade version of the vanilla Street Fighter IV with minor changes.</p>\n<h3>Setting</h3>\n<p>Ultra Street Fighter IV takes place several months after the events of Street Fighter II and is a prequel to Street Fighter III. After the return of Bison, who was presumed to be killed in the last tournament, a weapon corporation named S.I.N announces a new event to gather all the world&#39;s mightiest fighters for the creation of a powerful weapon of mass destruction. </p>\n<h3>Gameplay</h3>\n<p>All in all, SF IV is a two-dimensional fighting game with post-processed cell-shaded graphics, resembling the art style of Japanese comics.</p>\n<p>The game features the classic six-button control scheme with several additions that were made to refresh the gameplay. The combat system inherits the principles, that were introduced in SF III, such as the enhanced special attacks. Special button combos were added to implement fast movement inside an arena. </p>\n<p>There are two energy bars in the game, one of which is used for Super Combos, special attacks called EX Special Moves, and Focus Cancels. The other one is called the Revenge Gauge and is used for executing ultra-combos.</p>\n<h3>Ultra Edition features</h3>\n<p>The Ultra Street Fighter was initially released on Japanese arcade machines but was later made available to the general public. Apart from the standard balancing changes and updated combat system, it features new characters and arenas.</p>", "metacritic": 80, "released": "2014-06-03", "tba": false, "updated": "2024-04-07T03:06:27", "background_image": "https://media.rawg.io/media/games/f49/f49248982c6e9d6e849d16b9f5d93ae4.jpg", "website": "http://www.streetfighter.com", "rating": 3.85, "rating_top": 4, "added_by_status": {"yet": 49, "owned": 1664, "beaten": 114, "toplay": 15, "dropped": 104, "playing": 7}, "playtime": 4, "achievements_count": 268, "ratings_count": 196, "suggestions_count": 588, "game_series_count": 0, "reviews_count": 197, "platforms": ["PlayStation 3", "PC", "Xbox 360", "PlayStation 4"], "developers": ["Capcom", "Sony Computer Entertainment America"], "genres": ["Action", "Fighting"], "publishers": ["Capcom"], "esrb_rating": "Teen"}