{"id": 331639, "slug": "asphalt-5", "name": "Asphalt 5", "name_original": "Asphalt 5", "description": "<p>Get in, start up and punch it in the fastest dream cars ever created by some of the most prestigious manufacturers in the world.<br />\nEverything you’ve ever dreamed of doing behind the wheel is here on your iPhone/iPod Touch.</p>\n<p>Stop dreaming and get in!</p>\n<hr />\n<p>THE ASPHALT FRANCHISE, A SUCCESSFUL TRACK RECORD<br />\n9/10 IGN.com: “great models, lots of detail, and wonderful color.”<br />\n8/10 PocketGamer: “polished 3D visuals and varied cities to race in.”<br />\nTouchArcade: “the most lavish 3D graphics of any iPhone racer–of any iPhone game, really–in the App Store. “<br />\nSlide To Play: “sophisticated graphics and enjoyable gameplay”</p>\n<hr />\n<p>THERE’S A DREAM CAR FOR YOU<br />\nTake a ride in over 30 of the fastest, most prestigious cars you’ve ever dreamed, from manufacturers like Ferrari, Lamborghini, Audi and Ducati.</p>\n<p>THE WORLD IS YOUR RACETRACK<br />\nHighly polished HD graphics let you see every detail and animation of the track as you speed over snow, mud, dirt and more in 12 beautiful locations around the world including St. Tropez, Aspen and Las Vegas. Discover hidden shortcuts and jump off ramps!</p>\n<p>NEW WAYS TO PLAY<br />\nChallenge yourself to 8 different racing events including Drift Contest, Cop Chase, Time Attack, Duel Mode, Last Man Standing and Escape.</p>\n<p>RIDE WITH THE PACK<br />\nSix-player Bluetooth and Online Multiplayer lets you compete against friends and anyone around the world in tournaments and join the Asphalt Academy on asphalt-5.com. Speed your way to the top of the online leaderboard!</p>\n<p>THE SOUND OF SPEED<br />\nTune your car radio to play your favorite songs stored on your iPhone/iPod Touch during the race and let the music move you.</p>\n<p>UPDATE COMING SOON:<br />\n- Difficulty tuned in Cop Chase mode<br />\n- Minor bugs fixed</p>\n<hr />\n<p>Full list of cars:<br />\nAudi R8, Audi TT-RS, Audi Q7, Lamborghini Gallardo LP 560-4, Lamborghini Murciélago LP 670-4 SV, Lamborghini Reventón, Ferrari 599 XX, Ferrari California, Ferrari F430 16M, Ferrari FXX Evolution, Nissan 370Z, Nissan GT-R R35, Bugatti Veyron 16.4, BMW X6M, Caterham CSR Superlight, 2009 Chevrolet Corvette ZR1, 2010 Chevrolet Camaro SS, Ducati 1198, Ducati Monster 1100s, Ford GT, Ford Shelby GT500, Gumpert Apollo, Kawasaki Z750, Kawasaki ZX6-R, Lotus 2-Eleven, Lotus Evora, Mercedes E Class, Mercedes ML 63 AMG, Mercedes-Benz S65 Black Series, MINI Cooper S, RUF 3400 K, RUF Dakara, RUF Rt 12</p>\n<p>For fans of arcade racing games.</p>\n<p>Become a fan of Gameloft on Facebook: gameloft.com/facebook<br />\nFollow the official Twitter account: @asphaltracing</p>\n<p>Other Gameloft games you may like: Asphalt 4: Elite Racing, Ferrari GT: Evolution, Shrek Kart, Real Soccer 2010, Real Tennis 2009, NFL 2010</p>\n<p>Published and distributed by Gameloft.</p>", "metacritic": 82, "released": "2009-11-03", "tba": false, "updated": "2021-09-06T16:04:56", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dc5fd1f3d946f9a3483862adc155bfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 135, "game_series_count": 15, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Gameloft"], "genres": ["Racing", "Arcade"], "publishers": ["Gameloft"], "esrb_rating": null}