{"id": 331734, "slug": "catacomb-apocalypse", "name": "Catacomb Apocalypse", "name_original": "Catacomb Apocalypse", "description": "<p>As you pass through the gates of the Sanctuary of the Dead, you sense a familiar evil presence...and you don&#39;t like it. You&#39;ve been down here in the Catacombs many times, fighting for your life, fighting for your soul.</p>\n<p>Again you are trapped by your arch-rival - NEMESIS - far below the town you are trying to protect. You have been called upon again to perform feats of magic and courage against the worst living-dead and bio-mechanical monsters Nemesis can bring forth.</p>\n<p>Rumor has it that Nemesis has discovered how to use the TIME GATES. He has brought back new and bizarre high-tech monsters from the distant future and decaying beasts from the ancient past. Control of these Time Gates has also given him a very insidious and twisted weapon against you. At any &#39; time Nemesis can teleport you back and forth through time and space itself, to challenge creatures from the very ends of eternity.</p>\n<p>It&#39;s up to you to avoid capture or death, as you battle your way through the maze of rooms and tunnels leading toward a final showdown with Nemesis. You must traverse 16 levels of the foulest, most evil-dripping catacombs ever. There is no way out except through victory.</p>\n<p>Along the way, you will find keys necessary to unlock doors that may lead you to a new level or lead you to your demise. There is hidden treasure at every turn. Take all you can. These treasures are needed to keep you alive and provide you with magic weapons to give you a fighting chance against overpowering odds.</p>\n<p>You can only imagine what new sights, experiences, and threats await you as you venture from one hideous encounter to the next. Nemesis has brought together an army of vicious creatures bent on your destruction and by the grace of all that is good, you shall prevail.</p>\n<p>This is your ultimate challenge... follow Nemesis&#39; trail of terror and stop his evil ways forever!</p>", "metacritic": null, "released": "1993-04-15", "tba": false, "updated": "2023-02-08T10:44:39", "background_image": "https://media.rawg.io/media/screenshots/09e/09ed24f918ccf94413be9e4be5d7d886.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Softdisk Publishing"], "genres": ["Action", "Shooter"], "publishers": ["Froggman Software"], "esrb_rating": null}