{"id": 332, "slug": "the-elder-scrolls-legends", "name": "The Elder Scrolls: Legends", "name_original": "The Elder Scrolls: Legends", "description": "<p>The Elder Scrolls: Legends is a card-based game set in The Elder Scrolls universe developed by Dire Wolf Digital.</p>\n<h3>Story</h3>\n<p>The game&#39;s story serves as a tutorial for the player. The game takes place during the Great War between the Mid Empire and the Third Aldmer Dominion. The main antagonist of the game is one of the admirals of the Dominion - an altmer named Naarifin who is a Daedric cult adept. He invades the Empire trying to open the gates of Oblivion. The player has to prevent such an event from happening and make difficult choices as these decisions affect the cards the player gets upon completing the story mode.</p>\n<h3>Gameplay</h3>\n<p>The game centers around turn-based card matches between two opponents. Several game modes are available: Duel and Arena. In Duel, the players start with their own hand of cards, while in Arena each player picks the hand out of a limited number of cards.</p>\n<p>The cards are divided into four categories: Creatures, Supports, Actions, and Items. The players decide which Tamriel race they want to play as. This choice affects the additional cards that will be dropped as a reward after leveling up.</p>\n<p>At the beginning of the match, each player starts out with one magic point and three cards. On each turn, one magic point is granted to the players. The first player to get his enemies health to less than 1 wins.</p>", "metacritic": 82, "released": "2017-03-22", "tba": false, "updated": "2024-04-06T13:06:35", "background_image": "https://media.rawg.io/media/games/431/4317e294e88e4c9d77327693b15f499a.jpg", "website": "https://legends.bethesda.net/?locale=en", "rating": 3.2, "rating_top": 3, "added_by_status": {"yet": 62, "owned": 1780, "beaten": 40, "toplay": 21, "dropped": 228, "playing": 15}, "playtime": 2, "achievements_count": 0, "ratings_count": 277, "suggestions_count": 717, "game_series_count": 12, "reviews_count": 279, "platforms": ["Nintendo Switch", "iOS", "PC", "macOS", "Android"], "developers": ["Bethesda Softworks", "Dire Wolf Digital"], "genres": ["Strategy", "Card"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Teen"}