{"id": 332149, "slug": "armored-forces-world-of-war", "name": "Armored Forces: World of War", "name_original": "Armored Forces: World of War", "description": "Armored Forces : World of War is a tank battle game taking place in the distant future of the humanity. Mega corporations are at war with each other for mining and delivery of natural resources from remote planets. For that purpose they recruit private well armed armies.<br/>You start the game as a rookie on a light tank in one of these armies. You will be involved in a variety of battles in which you have to defend your base, protect convoys and also attack enemy bases and convoys. And, of course, be in direct battles with the enemy tanks.<br/><br/>As you complete missions, you will be able to improve some parameters of your tank. Also after completing a few missions you will have at your disposal more powerful tanks.<br/><br/>The the game contains 96 levels and 13 types of tanks.<br/>Alse, the game has several levels of difficulty, so you can choose the one that suits you. <br/><br/>• Game Center Enabled •<br/>Earn GameCenter Achievement points and compare your Leaderboard scores with your friends!<br/><br/>• iCloud Support •<br/>With iCloud enabled, you can back up your save game and all your Achievements and Leaderboard scores, and even continue your game on multiple devices!", "metacritic": null, "released": "2014-12-04", "tba": false, "updated": "2022-04-25T05:22:06", "background_image": "https://media.rawg.io/media/screenshots/573/573174ba9ba86e591c4a3070007b4006.jpg", "website": "https://www.warlockstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Peter Sokolov", "Warlock Studio"], "genres": ["Action", "Casual"], "publishers": ["Peter Sokolov", "Warlock Studio"], "esrb_rating": "Everyone 10+"}