{"id": 332166, "slug": "ashfall", "name": "Ashfall", "name_original": "Ashfall", "description": "<strong><h3>Explore The Unknown Wasteland</h3></strong><br/>Barren deserts, abandoned towns, old world battlefields, bustling survivor settlements... What you are about to see is a tremendous and diverse wasteland world. Integrating unique eastern culture and post-apocalyptic elements, each area displays a different theme and offers a distinctive cultural ambience.<br/><br/><br/><br/>New missions, locations, and contents will become available as you explore and advance.. You will also meet NPCs with distinctive personalities and encounter random events of different natures, all of which will bring much fun to your adventure.<br/><br/><br/><br/><strong><h3>Realistic And Immersive RPG Experience</h3></strong><br/>Ashfall provides many features, including character customization options, a dynamic weather system and authentic feedback of getting hit during combat, in order to give you the ultimate immersion of being in this desolate post-apocalyptic world and trying to survive at all costs.<br/><br/><br/><br/>Your perceptions and feelings of the real world are accurately reproduced in our world through technologies like motion capture and sound capture. You are part of this world, and every single decision and choice you make may affect the whole story. <br/><br/><br/><br/><strong><h3>Epic Combat Experience</h3></strong><br/>In the world of Ashfall, you will encounter many nasty mutated creatures and even nastier people who block your way. Through the combination of elements like the classic shooting-behind-cover function, the phenomenal settings of different instances, hardcore mission challenges and firearms, equipment and buildings with wasteland vibes, we have developed a swift combat system so our players can enjoy the best possible combat experience.<br/><br/><br/><br/><strong><h3>Embark On The Adventure With Your Friends</h3></strong><br/>Ashfall supports both single and multiplayer modes, increasing the game’s playability. You may travel around the world as a lone wolf, or fight alongside your friends to challenge difficult instances and levels. Either way, you will enjoy exploring this wasteland world.<br/><br/><br/><br/>Ashfall’s music will be co-produced by Oscar-winning score composer and music producer Hans Zimmer, Zimmer’s long-term partner and Hollywood music producer Steve Mazzaro, and the music producer of Fallout series, Inon Zur. As players proceed to differnet areas lin the game, they will immerse themselves in the brilliant music and binge on the audio-visual feasts provided by these gurus.", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-19T03:52:30", "background_image": "https://media.rawg.io/media/screenshots/045/045a70825c8edd06f8f83d26918e617e.jpg", "website": "https://www.ashfall-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NetEase Games", "Tomáš Král"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Netease"], "esrb_rating": null}