{"id": 3327, "slug": "final-fantasy-type-0-hd", "name": "FINAL FANTASY TYPE-0 HD", "name_original": "FINAL FANTASY TYPE-0 HD", "description": "<p>FINAL FANTASY TYPE-0 HD is an HD remaster of FINAL FANTASY TYPE-0 developed by Square Enix.</p>\n<h3>Plot</h3>\n<p>FINAL FANTASY TYPE-0 takes place on a fictional continent of Orience, which had been divided by four nations that call themselves the Crystal States. Each nation has a power crystal, which became their national symbols. </p>\n<p>The crystals can mark humans as residents of a specific state. From time to time, some servants of the countries appear. They are blessed with the ability to transform into a crystal and have a prolonged life cycle. These people lose their memories other time, so they are given one specific task to complete. </p>\n<p>The apocalypse is coming. Only several chosen ones can stop it from happening.</p>\n<h3>Gameplay</h3>\n<p>The game features a real-time combat system that somewhat resembles the same system from the previous games by Square Enix. The players control several playable characters at the time, as when the players assume control over one of the characters, the other characters are handled by the AI. </p>\n<p>Each character has their own weapon, unique attacks, and abilities, which can be upgraded further into the game if the player has enough points that are gathered after leveling up the characters.</p>\n<p>The players can focus their attacks on one enemy and execute critical hits on them or get a rare opportunity to one-hit kill the enemy. All the skills of your party can be used together to execute a special combo attack that deals a great amount of damage to the enemy.</p>", "metacritic": 69, "released": "2015-03-17", "tba": false, "updated": "2023-12-11T23:15:21", "background_image": "https://media.rawg.io/media/games/d02/d02c886eb3b04a18bebe4bc4f085053a.jpg", "website": "http://finalfantasytype0.com/", "rating": 3.21, "rating_top": 4, "added_by_status": {"yet": 120, "owned": 982, "beaten": 91, "toplay": 58, "dropped": 115, "playing": 10}, "playtime": 4, "achievements_count": 312, "ratings_count": 186, "suggestions_count": 559, "game_series_count": 27, "reviews_count": 188, "platforms": ["Xbox One", "PlayStation 4", "PC"], "developers": ["Square Enix"], "genres": ["Action", "RPG"], "publishers": ["Square Enix"], "esrb_rating": "Mature"}