{"id": 333608, "slug": "flowerpop-adventures", "name": "Flowerpop Adventures", "name_original": "Flowerpop Adventures", "description": "Pop pegs and score combos in the world's most addictive point-and-shoot puzzle game. A new experience guaranteed each time you play! Plays incredibly on iOS 8, iPhone 6 and iPhone 6 Plus - a must have!!!<br/><br/>Wow, thanks to our hundreds of thousands of players and 5 star ratings! Here are some real reviews:<br/>\"Has everything a game should have!\" - MissBumblebeee - 5 stars!<br/>\"Great graphics and definitely addictive.\" - SteffanyF - 5 stars!<br/>\"Simply delicious ... such a fun experience.\" - blue nyc - 5 stars!<br/><br/>PREPARE TO BE AMAZED – Launch your pal Squirrely out of the magic cannon and pop a variety of beautiful flower pegs plus other special items including beehives, explosive barrels and mystic portals! Everything is displayed in stunning 3D in the vibrant Flowerpop universe.<br/><br/>A STUNNING, LIVELY WORLD TO EXPLORE – Dive right into the game and see stunning levels packed with life! There’s so much to discover and experience in this beautifully designed game: each level plays differently every time you attempt it.<br/><br/>COMBINE AND WIN! – Hit special acorns to create incredible flower combos that change depending on the next flower hit. Want to clear the whole level in one shot? Hit the electric flower after the magic acorn and your wish is fulfilled, as Squirrely turns into a high-speed giant wrecking ball!<br/><br/>DRESS TO IMPRESS – Discover tons of cool costumes to make your avatar look even more awesome. How about a badger onesie, beach gear for the summer weather, or even a suit of armor if you’re feeling feisty?<br/><br/>TEAM UP WITH FRIENDS! – Take a selfie of your avatar in a cool new outfit to show your Facebook friends. Compete with pals to get the highest score on a level leaderboard, or let them help by sending you gifts and boosters!<br/><br/>SECRET BONUS LEVELS AND SPECIAL BOOSTERS – Achieve three stars in every level on an island and unlock a secret Starfall bonus level! Also win plenty of secret booster items in the Dream Machine such as extra shots or an invaluable longer aiming line!<br/><br/>Note: Flowerpop Adventures does not work well on iPhone 4 or below. Special thanks to Daniel Johansson for the music, ‘Skogens djur’.", "metacritic": null, "released": "2014-07-28", "tba": false, "updated": "2019-08-16T04:33:17", "background_image": "https://media.rawg.io/media/screenshots/2d3/2d3cba45be59a1ab3ab081d25af3db63.jpg", "website": "http://www.ayopagames.com/games/flowerpop-adventures", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ayopa Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Ayopa Games"], "esrb_rating": "Everyone 10+"}