{"id": 3339, "slug": "toren", "name": "Toren", "name_original": "Toren", "description": "Experience the mysterious, timeless world of Toren, the first adventure game from Brazilian indie developer Swordtales. You are Moonchild, destined to climb the tower (known as Toren) on a hauntingly solitary journey to find your purpose. You must solve puzzles and face monsters as you struggle to climb to the top of this beautiful, yet treacherous environment, driven by the will to find your freedom. <br/><br/><strong>A Journey of Learning &amp; Fulfilment</strong> - As the story progresses your character will age from a mere infant to grown woman creating new mechanics and challenges for each learning experience and phase of her life. In addition, the Tree of Life within the tower grows as she does, providing access to new areas to explore and new items to find.<br/><br/><strong>Poetry brought to Life</strong> – Toren features dark fantasy storytelling in a universe filled with symbolism. The mysterious, fantastical atmosphere is conveyed through an award-winning art design and original score. As your journey unfolds you will discover scrolls of poetry, which reveal the story and true origins behind Toren and aids the Moonchild in discovering her purpose.<br/><br/><strong>Rich Puzzle Solving</strong> - Every stage of the game features new and progressively more deadly challenges for the player: solving environmental puzzles, how avoid and survive attacks from dangerous creatures, and eventually defeating the end boss.", "metacritic": 57, "released": "2015-05-11", "tba": false, "updated": "2023-08-08T20:26:17", "background_image": "https://media.rawg.io/media/screenshots/8ae/8ae8959d57ce881bcc7b0e14f66b3813.jpg", "website": "http://toren-game.com", "rating": 2.79, "rating_top": 3, "added_by_status": {"yet": 30, "owned": 444, "beaten": 27, "toplay": 6, "dropped": 13}, "playtime": 4, "achievements_count": 60, "ratings_count": 40, "suggestions_count": 591, "game_series_count": 0, "reviews_count": 42, "platforms": ["PlayStation 4", "PC", "macOS"], "developers": ["Versus Evil", "Swordtales"], "genres": ["Adventure", "Indie"], "publishers": ["Versus Evil"], "esrb_rating": null}