{"id": 334867, "slug": "mlb-15-the-show", "name": "MLB 15: The Show", "name_original": "MLB 15: The Show", "description": "<p>The 10th edition of the franchise, MLB 15 The Show is a more immersive and exciting baseball experience than ever before with substantial improvements. New features include:<br />\n• Year-to-Year Saves – Users who purchased MLB 14 The Show will be able to continue their Franchise and Road to the Show progress in MLB 15 The Show.  Saves between the two releases will be forward-compatible, meaning you never have to worry about starting your Franchise or Road to the Show seasons over!<br />\n• Legends – We’re introducing 30 Iconic MLB Alumni into our virtual player card pool, 1 representative for each team. These players span every historic baseball era of the last 70 years. Like all of our Universal Rewards, you have a chance of finding a historic virtual player card to add to your collection and utilize throughout MLB 15 The Show.<br />\n1 player(s)<br />\n100KB Minimum<br />\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.<br />\nMajor League Baseball and Minor League Baseball trademarks and copyrights are used with permission of Major League Baseball Properties, Inc. and MLB Advanced Media, L.P, as applicable. All rights reserved. Visit MLB.com, the Official Site of Major League Baseball and MiLB.com, the Official Site of Minor League Baseball.</p>\n<p>The Baseball Hall of Fame and Museum trademarks and copyrights are used with permission of the National Baseball Hall of Fame and Museum, Inc., as applicable.<br />\nVisit the official website of the Hall of Fame at BaseballHall.org<br />\nOfficially Licensed Product of Major League Baseball Players Association-MLBPA trademarks and copyrighted works, including the MLBPA logo, and other intellectual property rights are owned and/or held by MLBPA and may not be used without MLBPA’s written consent. Visit www.MLBPLAYERS.com, the Players Choice on the web.</p>", "metacritic": 80, "released": "2015-03-31", "tba": false, "updated": "2023-04-25T15:59:57", "background_image": "https://media.rawg.io/media/screenshots/aaa/aaaf92458c2fe0c1c44de34d06e220d4.JPG", "website": "http://www.theshownation.com", "rating": 3.54, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 87, "beaten": 8, "dropped": 8}, "playtime": 0, "achievements_count": 89, "ratings_count": 13, "suggestions_count": 282, "game_series_count": 13, "reviews_count": 13, "platforms": ["PlayStation 3", "PlayStation 4", "PS Vita"], "developers": ["Sony Interactive Entertainment", "SCE Studios San Diego"], "genres": ["Sports"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": null}