{"id": 33624, "slug": "realms", "name": "Realms", "name_original": "Realms", "description": "You are Fortuna, a young guardian who travels from realm to realm in search of a monster that seeks The Die of Chaos and to destroy your universe. The Die of Chaos is the energy source in which this whole dimension is built on. It is always rolling and calculating random events happening across all realms within this dimension. It is also randomly creating new realms influenced by the Primordial Realms. Without it, the dimension will become still and lifeless. Your mentor, Alden, will help you explore the different realms as you fight, explore, solve puzzles and use all your powers for both exploration and combat.<br/>\n<br/>\r\nAs you traverse through the realms you will have your trusty weapon, the Guardian's Gun. This is the only weapon able to channel The Die of Chaos' energy to aid the guardian. The gun however can also equip magic spells. Throughout the realms the player will encounter magic spells that will be needed to traverse through the realms and reach areas that otherwise would be unreachable. You will also have primary abilities mostly focused on environmental usage. These include double jump, dash, perception, and wave blast. Perception is an ability unique to guardians that allows you to see hidden objects and paths throughout the levels. Wave blast is a force that will knock back enemies, push objects, or break down weak structures. <br/>\n<br/>\r\nUse all of these abilities and magic spells to combat enemies and explore these unique realms!", "metacritic": null, "released": "1991-01-01", "tba": false, "updated": "2023-02-08T10:47:02", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4c561a19fca9715165c36d36e5250ff.jpg", "website": "http://www.pomegranateapps.com/realms", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Atari ST", "Commodore / Amiga", "iOS"], "developers": ["Graftgold", "Pomegranate Apps", "Everything's Fine Productions"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Arcade", "Indie"], "publishers": ["Virgin Interactive", "Virgin Games", "Pomegranate Apps", "Everything's Fine Productions"], "esrb_rating": "Teen"}