{"id": 336672, "slug": "wings-of-heroes", "name": "Wings of Heroes", "name_original": "Wings of Heroes", "description": "At attention commander! <br/> <br/>Wings of Heroes is the most faithful WW2 air combat simulator always close at hand, anywhere you go! Engage in epic PvP battles against worldwide opponents. Prove to everyone the quality of your tactics and the velocity of your reflexes!<br/> <br/>Get ready for last-minute maneuvers, breathtaking chases, and complex team strategies to dominate the skies!<br/> <br/>Learn to prevail on the battlefield, improve your arsenal and expand your hangar. Become THE best pilot in the skies of Wings of Heroes!<br/> <br/>Key features of Wings of Heroes:<br/><br/>- Select your planes from the most iconic models of the World War 2 fleet and try yourself in epic 5v5 air combat! You’ll see, that’s much more fun than other airplane games can offer!<br/><br/>- Choose your strategy. Whether you prefer flying a warplane or a bomber, you're not a modern jet pilot. In this World War 2 flight simulator, you’ll have to pilot your plane and take part in sky combat from the last century. So team up and fly with other pilots to become one of the heroes of WW2!<br/><br/>- Airplane games are all about customization and this WW2 flight simulator offers dozens of upgrades! Armor, engine, armaments, fuselage... The list is long and it’s up to you if you want to pilot and fly a slower but unstoppable bomber or a deadly raiding fighter. Remember though - each airplane requires different air combat skills!<br/><br/>- Wings of Heroes is a multiplayer plane game set during World War 2. Become a pilot of the most epic air combat ever seen in airplane games! Team up with other plane pilots and become the most feared ace of the skies and a master of this action flight simulator!<br/><br/>What can you expect from playing Wings of Heroes:<br/><br/>- Plenty of daily rewards awaiting you from the very beginning of the gameplay<br/><br/>- New WW2 airplane models released every month<br/><br/>- Different maps waiting for you to show your air combat skills<br/><br/>- Achievements allowing you to win amazing prizes<br/><br/>Moreover, while playing Wings of Heroes, you will have a chance to try four different game modes:<br/><br/>- Domination -  capture and keep all the control points to win the match<br/><br/>- Ace Mode Domination - a very challenging game mode in which auto-aim is completely disabled and you are rewarded with a higher XP ratio and most epic rewards<br/><br/>- Dogfight -  game mode totally focused on a WW2 dogfight between the opposing team and destroying a certain amount of planes<br/><br/>- Annihilation - destroy all enemy control points to win<br/><br/>Note: For the best gaming experience Wings of Heroes requires a stable internet connection. <br/><br/>Good luck and good hunting!", "metacritic": null, "released": "2014-11-15", "tba": false, "updated": "2022-10-17T08:38:52", "background_image": "https://media.rawg.io/media/screenshots/d6f/d6f1b20465c3b51b02d0accb7cf51f1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RORTOS", "Moony Baboon"], "genres": ["Action", "Simulation", "Arcade"], "publishers": ["Rortos", "Moony Baboon"], "esrb_rating": "Teen"}