{"id": 336889, "slug": "celestial-crusade", "name": "Celestial Crusade", "name_original": "Celestial Crusade", "description": "Celestial Crusade is a unique idle RPG experience. You are summoned to a world of fantasy and wonder, full with endless challenges, massive boss fights, Arena combat, and Legion clashes. Hunt demons, gain loots, increase your rank and save the land from chaos. Choose to become the leader of a Legion, or play by your own. No matter what you decide, in Celestial Crusade, a new adventure awaits. <br/><br/><br/>FEATURES<br/><br/><br/>• NON-STOP progress<br/><br/>Your character and pets will fight for you, even while you are not playing. When you return to the game, the experience and resources will be automatically delivered to you! And you will be able to improve immediately all the characteristics, skills, and power!<br/><br/>• JOIN millions worldwide<br/>Tons of players worldwide join the mighty adventures of Celestial Crusade every day. Enter a multiplayer and coop game mode and together defeat powerful adversaries or fight for territory.<br/><br/>• CUSTOMIZE from head to toe<br/>Customize your character in many ways. Choose your own class, gear, wings, costumes, title, pets, and even your protector Goddess. Forge, enhance, and enchant your own equipment. The gear won't only improve the statistic, but also the style and aspect, on multiple levels. Experiment and find your perfect match!<br/><br/>• COLLECT and improve majestic pets<br/> <br/>Choose your own pets and raise them to make them more powerful than ever! Each one has its own traits, skills, forms, and attacks. Find items to evolve your pets and increase their power. They can offer a huge advantage in battle!", "metacritic": null, "released": "2019-05-07", "tba": false, "updated": "2019-06-28T02:12:57", "background_image": "https://media.rawg.io/media/screenshots/8b5/8b5a7fdfd1d95c4e58af93a2439ee02c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["tainaka yasa"], "genres": ["Action", "RPG"], "publishers": ["tainaka yasa"], "esrb_rating": "Everyone 10+"}