{"id": 337329, "slug": "levelhead-demo", "name": "Levelhead (Demo)", "name_original": "Levelhead (Demo)", "description": "<p>Levelhead is a creative platformer for 1-4 players. Run, jump, and warp up the Levelhead Division corporate ladder in the single-player campaign, research new elements for your very own level-building workshop, then build and publish levels for the rest of the world to play!<br/></p>\r\n\"Levelhead is a spectacularly strange and varied thing... it’s an impulsive and endearing platformer, drip-fed by a genius hoard of masochistic level designers.\"<br/>- <em>Rock Paper Shotgun</em>\n<p><strong>LISTEN UP, NEW EMPLOYEE!</strong> The Bureau of Shipping has a bunch of newly formed delivery robots runnin' around, and someone's gotta teach them the ropes. That someone is YOU. You've got your very own <strong>GR-18</strong> and you'll need to work that little robo through training, then build and share obstacle courses with the other Levelheads so we can start dispatching these little robo buddies across the galaxy!</p>\n<p>Welcome to the Levelhead division!</p>\r\nFEATURES\r\n<ul><li><strong>Master the challenging platforming campaign</strong> - Take control of GR-18, a delivery robot in-training, as you run, jump, and blast your way across a challenging campaign, unlocking new technology for your Workshop all the while.</li><li><strong>Build your own levels</strong> - Hop into the Workshop to create your own levels with dozens of elements including enemies, hazards, paths, switches, secrets, weather fx, and power-ups.</li><li><strong>Share your creations with the world</strong> - Publish your Workshop levels for the world to enjoy and see your Play Time and Attempts stats rack up! With robust search and subscription, Levelhead makes amassing a following and playing nearly infinite content from around the world a breeze.</li><li><strong>Couch Co-op Creativity</strong> - Levelhead lets you play with up to 4 friends on the same couch for some downright hilarious entertainment. And if you want to really reach for those relationship goals, hop into the Workshop with friends and build levels with everyone at once.</li></ul>\n<p>For more game details and to join the community, hop into the Discord or the Subreddit.</p>\r\nWHAT'S IN THE DEMO?\r\n<p>The Demo contains the first 13 levels of the campaign (1.5ish hours of platforming, depending on your skillz) and access to the workshop, so you can experience building your own levels. It does <em>not</em> include any online components, so you are not able to publish your levels or play community levels. However, if you purchase the full game your progress (and builds) from the demo will move right over!</p>", "metacritic": null, "released": "2019-06-25", "tba": false, "updated": "2019-06-28T04:26:24", "background_image": "https://media.rawg.io/media/screenshots/27a/27a0a03dbf152512ccd3296d0da864a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Butterscotch Shenanigans"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}