{"id": 337499, "slug": "synergia-itch", "name": "Synergia (itch)", "name_original": "Synergia (itch)", "description": "<p>Currently In Development - Check Out The Demo For Free Below!</p>\n<p><strong>Official Website</strong>: https://synergia-game.com<br/></p>\n\n\n<em>\n<p><em>Synergia is a yuri thriller visual novel that takes place in a cyberpunk future, wrapped up in a beautifully unique, vibrant neon aesthetic. At the end of the world, sometimes love is the ultimate crime.</em></p>\n<p><strong>Story</strong><br/>Cila, a veteran cop with a sour outlook and anger issues expects nothing more from life besides the smell of ozone, blinding neon lights and the ever-present manhole steam. At least, until a shady friend replaces her broken-down housedroid as a favor. Advanced, more efficient and remarkably perceptive, unit M.A.R.A. begins to penetrate Cila's toughened exterior and possibly even heal her new owner's old wounds – if Cila can decipher the recurring nightmare the process brings. Soon Cila and Mara forge a unique - if sometimes uneasy - bond. Unbeknownst to Cila, just as her life begins to find its new normal, the technological giant Velta Labs gets wind of Mara's existence and takes a mysterious interest in the android. A war unlike any before it is brewing on the horizon, its players are silently being selected and one android's fate may spell the difference between peace, war, the blossoming of a new religion, or a technological singularity beyond comprehension.</p>\n<p><strong>Features</strong></p>\n<ul><li> Nearly 100 combined, unique backgrounds and CGs\r\n</li><li> 20+ characters, all with interesting backgrounds and personalities deeply woven into the narrative\r\n</li><li> An estimated 6-9 hours of gameplay\r\n</li><li> A unique, vibrant art aesthetic that pervades the neon dystopian setting of the game\r\n</li><li> A beautiful, vivid soundtrack that complements the game's aesthetic, composed by one of the composers of <em>Katawa Shoujo</em> and <em>Sense: A Cyberpunk Ghost Story</em>\n</li><li> Choices that deeply affect the protagonist's journey and world around them, with multiple endings</li></ul>\n</em>\n\n<p><strong>Developer:</strong> https://twitter.com/BloodDaughters\r\n</p>\n<p><strong>Publisher: </strong>https://twitter.com/TopHatStudiosEN // https://tophat.studio</p>", "metacritic": null, "released": "2019-06-24", "tba": false, "updated": "2019-06-28T05:18:49", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a3494c98a1725e68f720ee0afa7a7fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Top Hat Studios"], "genres": [], "publishers": [], "esrb_rating": null}