{"id": 337460, "slug": "heavy-sky", "name": "Heavy Sky", "name_original": "Heavy Sky", "description": "<p>Heavy Sky is a mobile game inspired by old-school shoot-em ups. Fight your enemies in two game modes, earn coins and buy upgrades for your aircraft, support drones and power ups.</p>\n<p><strong>Main features:</strong><br/>- Gamemodes: coin hunt and endless mode with 3 difficulty levels.<br/>- A good variety of enemies and bosses to fight against.<br/>- Upgrades that improve your aircraft and support drones. You can upgrade the power ups you get in endless mode.<br/>- Unique graphics, soundtrack and sound effects.</p>\n<p><strong>Game Modes:</strong><br/>- Coin Hunt is a game mode with a set of levels for you to complete. You gain coins after a level completion.<br/>- Endless Mode includes 3 difficulty levels that affects the number of enemies and their health.<br/>- Enemy health and speed depends on the time you spent in Endless mode level.<br/>- You kill enemies, gain coins, spend coins for upgrades.<br/></p>\n<p><strong>Powerups:</strong><br/>- In Endless Mode you gain access to three types of powerups.<br/>- Temporary attack speed powerup that randomly changes the type of your aicraft to one of three crafts. It also gives you temporary and permanent boost of attack speed, so you can last longer in Endless mode.<br/>- Support drone powerup send additional drones that fight on your side.<br/>- Shield powerup gives you invulnerability and ability to ram enemies.</p>\n<p><strong>Upgrades:</strong><br/>- You can spend coins for upgrading your aircraft, support drones and powerups.<br/>- Aircraft upgrades and support drones upgrades improve you attack speed.<br/>- Powerup upgrades improve the duration of powerups that you obtain in Endless mode. Drone powerup lvl 3 also gives you and additional support drone from a special powerup.</p>\n<p><strong>Aircraft:</strong><br/>- There are 3 types of planes that you can use.<br/>- Regular plane shoots the straight line of bullets. It excels against single target.<br/>- A plane with spread gun shoots a huge number of projectiles, but the accuracy is low. It gets good benefits from upgrades.<br/>- The third plane got a slug shots, that penetrate enemies. In addition to that it shoots a machinegun with autoaim. This one is pretty strong, but any plane need support drones to fight on the highest difficulty level.<br/></p>\n<p><strong>Support Drones:</strong><br/>- There are 2 types of support drones - a missile drone and a drone with a burst shot weapon.<br/>- You get a random permanent drone at a start of every round.<br/>- In endless mode there is a pickup that provides you with additional temporary drones.<br/>- If you upgrade the Support Drone pickup to level 3 - an additional temporary drone will come to help you.<br/>- Missile drone shoots shrapnele missiles in small targets and regular guided missiles in big targets and bosses.<br/>- The burst shot drone depends on attack speed upgrade a lot.<br/><strong><br/>Other stuff:</strong><br/>- There are 4 music tracks that i'll upload to bandcamp soon.<br/>- The background gradient changes randomly when you go to another room or menu.<br/>- Also the gradiens changes after you defeat a boss.</p>", "metacritic": null, "released": "2019-06-24", "tba": false, "updated": "2019-06-28T05:07:13", "background_image": "https://media.rawg.io/media/screenshots/39b/39bd033d1aee2b51b5a1be500c51f0f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Karboloid"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}