{"id": 3374, "slug": "stealth-inc-2-game-of-clones", "name": "Stealth Inc 2: A Game of Clones", "name_original": "Stealth Inc 2: A Game of Clones", "description": "<p>A sequel to Stealth Bastard (a.k.a. Stealth, Inc.), in which the player controls a group of identical clones. They are being used as test subjects on a PTi Industries factory. But now one brave clone learned his real purpose and is going to escape to freedom. <br />\nGameplay in Stealth Inc. 2 is centered around stealth action, for which the game was even compared to the Splinter Cell series despite huge stylistic differences. The clone has to move swiftly and silently to avoid security cameras and sentry robots. Its time is limited, however, and the player has to find the balance between speed and safety. Level design in Stealth Inc. 2 reminds of Metroidvania-style platformers. The factory is split into areas, consisting of eight test chambers each, all of them interconnected in the manner called overworld. The player will have to solve puzzles to open new areas. Every area introduces a gadget that should be equipped and is essential to use to move forward. Some of the puzzles are deadly traps that are only solved through trial and error. On the first walkthrough, they will almost inevitably kill the clone and send it back to the checkpoint.</p>", "metacritic": 79, "released": "2014-10-30", "tba": false, "updated": "2023-12-18T17:49:15", "background_image": "https://media.rawg.io/media/screenshots/2ff/2ffe731b3388bd795f94c38e9afed60f.jpg", "website": "http://www.stealthincgame.com", "rating": 2.84, "rating_top": 3, "added_by_status": {"yet": 190, "owned": 2661, "beaten": 24, "toplay": 10, "dropped": 106, "playing": 4}, "playtime": 4, "achievements_count": 60, "ratings_count": 221, "suggestions_count": 294, "game_series_count": 1, "reviews_count": 221, "platforms": ["PlayStation 3", "PlayStation 4", "Xbox One", "PC", "Wii U", "PS Vita", "Android"], "developers": ["NVIDIA Lightspeed Studios", "Curve Digital", "Carbon"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Curve Digital"], "esrb_rating": null}