{"id": 337508, "slug": "make-the-hero", "name": "Make The Hero", "name_original": "Make The Hero", "description": "The Game :\r\n<p><strong>Make the Hero is a VR god game, with RPG and Crafting elemen</strong>ts. The player embodies a god of creation, who must take care of a little hero and help him in his quest to liberate his  world. To do this, he must create objects for him through his divine workshop and guide him on a map until he reaches and faces the boss controlling this world.</p>\n<p><strong>Make the Hero splits into two parts that interact with each other:</strong></p>\n<ul><li><strong>The crafting part,</strong> which concerns only the player. This is the part where the player will evolve in to create objects to help his hero.</li><li><strong>The RPG part</strong>, where the player will have to move his hero on a map and confront him with enemies while keeping him alive.</li></ul>\n<p><strong>During the game you have requests represented ingame by a tooltip above the table, click on them to have more information.  </strong><br/></p>\r\nCredits : \r\n<p><strong><em>Make The Hero </em>was made as a student graduation project by a team of 6 students from Supinfogame Rubika (France).</strong> </p>\n<p>Joaquim Lancesseur - <em>Producer</em></p>\n<p>Loïc Tollinos - <em>Lead Game &amp; Narrative Designer</em></p>\n<p>Simon Delavenne - <em>Technical Game Designer </em></p>\n<p>Steve Delgrange - <em>Programmer</em></p>\n<p>Célia Idri - <em>Lead &amp; Concept Artist</em></p>\n<p>Hugo Kostic - <em>Technical Artist &amp; Animator</em></p>\n<p><strong>We want to thanks all the people who worked with us to make MTH a possibility. </strong></p>\n<p>Irénée Matuszewski - <em>Sound Design</em></p>\n<p>Alexis Boudou - <em>Music compos</em><em>er</em><br/></p>\n<p>jacksepticeye - <em>Grimoire Voice</em></p>\n<p>Lise Marchal - <em>2D Animation ingame<br/></em></p>\n<p>Bubbles Derramas -<em> 2D Animation trailer</em></p>\r\nUseful information :\r\n<p>/!\\ Please note that you need a good PC to run<em> Make The Hero </em><strong>as well as a virtual reality headset  HTC Vive </strong><em>.</em> The current version might be poorly optimized for your PC, or there might be some bugs. We are sorry for any inconvenience you may encounter.  We have no version for oculus or other headset. /!\\ </p>\n<p><strong>To begin the game use the trigger on the tutorial button or drink the no tuto potion.  </strong></p>\n<p><strong>Known issues :</strong></p>\n<p>- if everything goes black foggy, put your head through a wall (ingame), go back into the playable area. </p>\n<p>- don't take the hero at the end of the tutorial, otherwise he disappears. We have no solution but restart the game, but you can use the potion to skip the tutorial. </p>\n<p>- to craft miracles use the light power represented ingame by a lighting.  </p>\n<p><strong>Other information :</strong></p>\n<p>- put 2 ore on the oven during the tutorial </p>\n<p>- during the tutorial when you have your power, active the trigger to use it.</p>\n<p>- give the iron axe to the bridge during the quest not the hero (you can give an axe to the hero but it doesn't unlock the rest of the quest </p>", "metacritic": null, "released": "2019-06-24", "tba": false, "updated": "2019-06-28T05:21:34", "background_image": "https://media.rawg.io/media/screenshots/dfb/dfbb8daf624f9f6b2c94f3894c332463.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yetarse"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}