{"id": 337576, "slug": "born-from-death", "name": "Born From Death", "name_original": "Born From Death", "description": "<p><em>Lam Martin </em>era um comum cidadão da Cidade da Luz que trabalhava como técnico de manutenção eletrônica, na maioria daz vezes consertando telas e equipamentos eletrônicos com defeito dos grandes edifícios da cidade.<br/></p>\n<p>Porém, com o crescente desemprego que afeta a cidade e as grandes despesas causadas por danos a prédios em revoltas populares e brigas de gangues nas ruas, as grandes empresas da cidade começaram a despedir funcionários para cobrir essas despesas. <em>Lam Martin </em>foi um desses funcionários, perdendo seu emprego de mais de 5 anos.</p>\n<p>\tMeses depois, <em>Lam Martin</em> continuava sem emprego, mesmo após procurar por todo esse tempo. A situação da cidade estava cada vez pior, o crime nas ruas já era comum e então o governo decidiu alocar uma grande força policial nas ruas para combater a onda de crimes e assassinatos que se instalou.</p>\n<p>\tAs gangues da cidade decidiram revidar, e estavam a procura de pessoas para aumentar seu contingente de membros. Lam, sem ter para onde recorrer, toma a decisão de entrar para uma dessas gangues</p>\n<p>\tO jogo te deixa jogar com Lam suas missões de execução a mando da Liga em um universo Cyberpunk.</p>\n\n<p><strong>Very Early Access Game! (primeira versão: 1,5 missões funcionando)</strong></p>\n<p><strong>Controles:</strong></p>\n<p><strong>AWSD</strong>  --&gt; Movimentação</p>\n<p><strong>QE</strong> --&gt; Girar Câmera (Horizontal)</p>\n<p><strong>Mouse Scroll </strong>--&gt; Ângulo Vertical da Câmera</p>\n<p><strong>Space/Enter/Mouse Click </strong>--&gt; Passar dialogos</p><p><strong>Team: </strong></p><p>Daniel Quevedo</p><p>Michael Vivaldini</p><p>Tácio Barreto</p>", "metacritic": null, "released": "2019-06-24", "tba": false, "updated": "2019-06-28T05:39:11", "background_image": "https://media.rawg.io/media/screenshots/8b5/8b5b7038ee93389ff9cf599824f081c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michael Vivaldini", "dequevedo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}