{"id": 337509, "slug": "a-classical-kickabout", "name": "A Classical Kickabout", "name_original": "A Classical Kickabout", "description": "<p>The beautiful game just got even more artful. A Classical Kickabout is a local multiplayer football based tug of war taking place within a gallery hosting art from around the world. </p>\n<p>The game features:<br/></p>\n<ul><li>Support for up to eight players.</li><li>Eighty paintings from eight different nations.</li><li>Monty Python-esque animation.</li><li>Support for ten languages (English, French, German, Italian, Spanish, Brazilian Portuguese, Danish, Dutch, Russian and Japanese).</li><li>Custom image support (Windows &amp; MacOS Only).</li></ul>\n<p>Notice any incorrect text in any of the available languages? Please leave a comment on the game's localization sheet!<br/></p>\r\nWindows Custom Images\r\n<p>In order to add your own images to the game, go to the \"StreamingAssets\" folder within the \"A Classical Kickabout_Data\" folder and create a new folder for each collection of images.</p>\r\nMacOS Custom Images\r\n<p>In order to add your own images to the game, \"Show Package Contents\" for the application, go to the \"StreamingAssets\" folder by navigating through the \"Contents\", \"Resources\" and \"Data\" folders and create a new folder for each collection of images. <br/></p>\r\nCustom Image Restrictions\r\n<p>PNG and JPG formats are supported, with image width required to be at least the same as image height and at most four times image height. Every folder with at least one valid image will be included as a gallery in the \"Gameplay options\" screen. If new images are added while the game is playing, restart to add any new images into the game.</p>", "metacritic": null, "released": "2019-06-24", "tba": false, "updated": "2019-06-28T05:21:56", "background_image": "https://media.rawg.io/media/screenshots/5e9/5e95a5aacd32517033317b37c2edec92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Ellis Spice"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}