{"id": 337650, "slug": "colordom", "name": "ColorDom", "name_original": "ColorDom", "description": "ColorDomis a game of collision and color elimination, where you will experience the magic about the elimination of numbers and colors<br/>It contains a variety of gameplay and fascinating game rules!<br/><br/>ColorDom will bring a new gaming experience<br/><br/>Featured way to play:<br/>Hue mode<br/>Move the chaotic squares to the perfect position to match the exact color scale,  as few movements as possible. Immerse yourself in the tranquil world of color and light.<br/><br/>Doku mode<br/>The color of the gradient in the cube is fascinating, and make the blocks are arranged in a gradient of colors. Enjoy the fun.<br/><br/>Link 3 mode<br/>In a limited number of steps, the balls of the same color are connected to remove them, and the corresponding scores are obtained until the scores of the four colors satisfy the points required by the level. A ball with 3 or more identical scores will receive a 10x score. So you need to take a reasonable strategy and get the most points with the fewest steps.<br/><br/>Rings mode<br/>This is an amazing challenge mode that requires you to line up the rings of the same color to destroy them.<br/>Simple and easy to play, but difficult to master...<br/><br/>Laps g mode<br/>The interesting numbers merge and eliminate, the numbers rotate around the circular plate. Every time you make a turn, the chessboard is filled with new numbers.<br/><br/>Combine color numbers together for high scores and upgrades!<br/><br/>Cubes mode<br/>An addictive digital puzzle game with a simple design and unique gameplay. The game is simple but hard to master.<br/><br/>pops mode<br/>A small ball that emits a given number is combined with the same number in the box to obtain a larger number of balls, thereby eliminating the small balls on the screen and obtaining more points. Note that the balls in the screen will gradually increase, so you need to clear them as much as possible before they fall to the lowest end.<br/><br/>Unlock new modes <br/>a variety of numbers to unlock the gameplay, waiting for you to challenge. <br/>- Thank you for supporting our game!<br/>Let's see how many points you can challenge! Share your record!", "metacritic": null, "released": "2018-09-09", "tba": false, "updated": "2019-10-25T03:49:07", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a50324eb91409b007a2dbd134775f83_XtLmDql.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beijing Bojian Culture Media Co"], "genres": ["Puzzle"], "publishers": ["Beijing Bojian Culture Media Co"], "esrb_rating": null}