{"id": 337675, "slug": "aquaparkio-slide-racing-3d", "name": "Aquapark.io: slide Racing 3d", "name_original": "Aquapark.io: slide Racing 3d", "description": "Aquapark.io : Slide Racing 3d - is a racing 3d water game for io players Who love aquapark games.<br/>slide.io waterpark is the most fun game of the coming Diver players summer season.<br/>Are you ready to Slide.io in Aqua waterpark, to be the best io game player ?<br/>Play this waterslide game and enjoy the colorful water park.<br/>This Waterpark game is for the kids who love to slide,run,dive,Avoid The blocks obstacles, and have fun on the blue aqua pool.<br/>Let's Race and splash online in this super amazing hero aqua water park Racing Game.<br/><br/>Summer is Here, Sunny days are comming, So,Rush ,And lets Slide.io in this exciting Water park game.<br/>To win this funny Race Waterpark game , you have to slide , push other io players in the colorful WaterPark Race.<br/>io purple players will try to beat your record , so be ready to become the next winner slider in the aqua waterpark game.<br/><br/>Slide , Jump , this is all about in this amazing Game.<br/><br/>So ARE YOU READY TO beat all others io players without dropping in the water park ?<br/>Lets see if you can  Bump other players during the aquapark race and have fun playing this colorful Waterpark game.<br/><br/>We're lookin forward to get your feedbacks to improve our game !<br/><br/>Good Luck !<br/>Enjoy !<br/>Rate Us For 5 *", "metacritic": null, "released": "2019-06-27", "tba": false, "updated": "2019-07-01T02:11:12", "background_image": "https://media.rawg.io/media/screenshots/abc/abce111a1bd30467540e60d7065b4715.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ammani Ousama"], "genres": ["Adventure", "Racing"], "publishers": ["Ammani Ousama"], "esrb_rating": "Everyone 10+"}