{"id": 337649, "slug": "guide-for-clash-of-clans-coc-free-gem-tips-tricks-", "name": "Guide for Clash of Clans - Coc Free Gem Tips Tricks, Bases layouts", "name_original": "Guide for Clash of Clans - Coc Free Gem Tips Tricks, Bases layouts", "description": "The app Guide for Clash of Clans - Coc Free Gem Tips Tricks, Strategy Base layout player now available on iphone and ipad<br/><br/>The app that will make you win MORE! All you need improve your skills CoC, the Unofficial and Guide for Clash of Clans - Coc Free Gem Tips Tricks, Strategy Base layout!<br/><br/>This app is Best guide for clash of clans, and in this guide you will get tips and trick how to get more gems, gold, elixir etc, you will get more tips about how to defends and attack.<br/><br/>••• CATEGORIES  •••<br/><br/>- ATTACK STRATEGIES: Exclusive walkthroughs explaining how and when to use the best formation!<br/>- BEGINNER'S GUIDE: Everything all Clashers must know, easily explained.<br/>- TIPS AND TRICKS: Tricks and Tips for Clash of Clans.<br/>- BASE LAYOUTS: Collection more layour for you and submit and rate layouts! Base for defense, base for clans war, base for farming all in here.<br/>- STRATEGY GUIDE: Exclusive articles written by Legendary players! How to farming, how to defense, how to keep trophy, ALL IN IT<br/>- STATS: Stats to all troops and buildings.<br/>- MISCELLANEOUS : Best Guide for clash of clans<br/><br/>Disclaimer: \"House of Clashers\" is not an official app or affiliated/endorsed by Supercell. \"Clash of Clans\" and its logos are trademarks of Supercell and this app was made according with Supercell's Fan Content Copyright Policy: supercell.com/en/fan-content-policy/", "metacritic": null, "released": "2016-09-09", "tba": false, "updated": "2019-07-30T04:28:19", "background_image": "https://media.rawg.io/media/screenshots/62e/62e8edc59e3f25d72ac481315a1d8813.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Giang Dinh Van"], "genres": ["Action", "Strategy"], "publishers": ["Giang Dinh Van"], "esrb_rating": null}