{"id": 337645, "slug": "void-tyrant", "name": "Void Tyrant", "name_original": "Void Tyrant", "description": "Choose a hero and venture through an ever-changing galaxy in this hybrid deckbuilder RPG! Duel your enemies in turn-based combat across 6 planets to reach the Chaos Pyramid and restore the Eyes of Chronos to save the galaxy. Using your wits and an upgradable deck of ability cards, battle quirky aliens in strategic Blackjack-like combat encounters, disarm traps, upgrade your spaceport, and more. Do you have what it takes to defeat the sinister Wruut once and for all? <br/><br/><br/><br/><ul><li>Customize a powerful deck from hundreds of cards as you venture across the galaxy as one of four unique classes.<br/></li><li>Collect artifacts and loot from treasure chests and defeated enemies.<br/></li><li>Spend Guldins to upgrade your town for new powers and adventures.<br/></li><li>Strategize to take on challenging bosses in card-based combat.<br/></li><li>Anticipate and disable traps, defeat odd aliens, face surprises, and more.<br/></li><li>Play the game your way with various accessibility improvements made with the PC version of Void Tyrant in mind. These include editable key bindings, the ability to turn off flashing lights and screenshake, and more!</li></ul><br/><br/><br/>Void Tyrant is coming to PC for the very first time as a paid premium experience with all the upgrades and special items of the original. Whether you’ve saved the galaxy before on mobile or you’re entering the Chaos Pyramid for the first time, you’re sure to keep coming back to Void Tyrant’s blend of deckbuilding, strategic risk taking, and roguelike design.", "metacritic": null, "released": "2019-06-28", "tba": false, "updated": "2023-03-21T17:53:29", "background_image": "https://media.rawg.io/media/screenshots/7b3/7b345e50acf936409377b4241eb7d339.jpg", "website": "https://armorgamesstudios.com/games/void-tyrant/", "rating": 2.5, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 10, "beaten": 2, "toplay": 4, "dropped": 3}, "playtime": 5, "achievements_count": 34, "ratings_count": 6, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "PC"], "developers": ["Armor Games", "Quite Fresh Games"], "genres": ["RPG", "Strategy", "Card"], "publishers": ["Armor Games", "Armor Games Studios"], "esrb_rating": null}