{"id": 337639, "slug": "beautify-me-face-makeup", "name": "Beautify Me: Face Makeup", "name_original": "Beautify Me: Face Makeup", "description": "Want to give the best makeup to little princess? Enjoy the face makeover with beautify me – the best makeup salon girl games! And have a relaxing time. Some new makeup features none like before! Do you like giving back spa and beauty tips? With a new fresh feeling and real life feeling this game has some different features from the old salon games. Start with relaxing back spa to relax your model for the most amazing makeover then facial salon, makeup her and dress up her with a lots of surprising features. <br/>The pretty lady is very busy cleaning the house and she had a very exhausting day. Make her forget about all her tensions by giving her the relaxing back spa and then beautify her with your makeup skills in your beauty salon. Prepare the bathing pool by putting some essential oil in it and shampoo her hair. Apply gentle anti moisturizing face wash using facial foams to clean her face. Make the facial skin look better by getting rid of the black eyes and dark spots for our princess and then make facial masks for princess. Stage is set for epic makeup for the model! Choose cosmetics from hundreds of makeup items to give the makeup to pretty princess. Select your suitable model with different skin tones and facial features to give perfect eye shadow and eyebrow shape for her. Now apply lipstick according to makeup.<br/>This beauty app is girl games recommended for all high school girls, college girls, models and party makeup girls! Refresh your memories with playing this girl games and get rid of the shining and luxury coats and high heels. Relive your seventeen again? Beautify me is an old school makeup girl games! Challenge your fashion skill now!<br/>Get ready with selecting skin color of your choice. Then choose light makeup facial colors. Select the most stylist hair styles according to your model’s look. Wear her the astonishing glasses to make her look even better! Then chose your dress and shoes! Do not forget what the most popular style of fashion world is!!<br/>The makeup salon is all set and ready for the princess arrival. Look at so many nice and colorful makeups and dresses, won't you want to try them? Enjoy even more with a lot regular updates. Make your princess the beauty queen of the world. If you want to give your girl the most perfect princess makeup, play face makeup game now and try our Beautify me – the best makeup salon girls games!!<br/><br/>Features: <br/>+ Select the beautiful girl of your choice<br/>+ Pre makeups: shampoo, hair steamer, facial Spa<br/>+ Hundreds of useful cosmetics and stylist items<br/>+ Make colorful combinations and select colorful backgrounds<br/>+ Tons of makeup tools lipsticks, eye shadows, brushes and many more<br/>+ The trending fashions dresses, skirts, shoes<br/>+ Shining jewelries, diamonds, ornaments, tiaras and glasses with many other accessories<br/>+ Once done you done with makeup and dressup take photos and challenge others<br/><br/>Beautify me: face makeup, makeover Salon is a free girls makeup game! <br/>New style with new season. Change your style with the trendy clothes, lady bags and other dresses! Girls need to look pretty all the time! So, Welcome to the beautify me: face makeup, makeover Salon!", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-07-01T01:53:39", "background_image": "https://media.rawg.io/media/screenshots/5e4/5e4ce625acd1db9954102970cdea4cf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coen Schouten"], "genres": ["RPG"], "publishers": ["Coen Schouten"], "esrb_rating": "Everyone 10+"}