{"id": 337614, "slug": "boom-slots-60-vegas-slots", "name": "BOOM SLOTS: 60+ Vegas Slots", "name_original": "BOOM SLOTS: 60+ Vegas Slots", "description": "Get the feel of High Rolling in Vegas, anytime, anywhere, for free with Boom Slots!<br/><br/>Over 50 electrifying slots games await! Watch the reels go wild when you WIN HUGE JACKPOTS!<br/><br/>Get your Signup BONUS and play for FREE today!<br/><br/>BOOM SLOTS FEATURES: <br/><br/>• Over 50 FUN and EXCITING Slots games!<br/>• Spin your way to the top of the community LEADERBOARD!<br/>• Collect your free Daily Spin to win big BOOM BUCKS every day!<br/>• WIN BIG and level up to receive special BADGES &amp; ACHIEVEMENT REWARDS!<br/>• NEW SLOTS GAME ADDITIONS every month!<br/>• Make friends from around the world!<br/>• Connect with Facebook to play on different devices!<br/><br/>WIDE SELECTION OF SLOT GAMES<br/>- With mega-hits Fire Joker, Grim Muerto, Riches Of Ra and many more, you will always be thrilled and entertained with these spectacular slots games!<br/><br/>SPIN YOUR WAY TO NUMBER ONE<br/>- Take on your friends to become the number one Slots Champion on the DAILY LEADERBOARD to win BIG PRIZES!<br/><br/>BOOM SLOTS COMMUNITY<br/>- Receive gifts from friends and compete with other players from around the world for Leaderboard bragging rights!  <br/><br/>PLAY MINI GAMES AS YOU SPIN THE SLOTS!<br/>- DOUBLE your chances to win COLOSSAL JACKPOTS from a selection of ENTERTAINING MINI GAMES like Scratch Cards, Pull Tabs, Slots, Money Wheel, Rapid Bingo and Dice while you play Boom Slots!<br/><br/>CROSS-PLATFORM PLAY<br/>- Connect on any platform with your account, so you can play anytime, anywhere!<br/><br/>LIKE US: www.facebook.com/boomgamingcommunity<br/>FOLLOW US: www.twitter.com/boomgamingnews<br/>WATCH US: www.youtube.com/user/boomgamingvideos<br/><br/>DON’T MISS OUT!<br/>- Don’t miss some of our other FUN and EXCITING BINGO games, from Character Bingo, Bingo Keno, Beach Bingo and more - get them NOW!<br/><br/>The games on this platform are intended for an adult audience and are for entertainment purposes only. The games do not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gambling does not imply future success at real money gambling.", "metacritic": null, "released": "2015-01-06", "tba": false, "updated": "2019-07-01T01:39:31", "background_image": "https://media.rawg.io/media/screenshots/254/254d3176100817285125d2b698bb8e93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boom Digital Media Group"], "genres": ["Card"], "publishers": ["6564194 Canada"], "esrb_rating": "Teen"}