{"id": 337697, "slug": "ninja-assassin-iv", "name": "Ninja Assassin IV", "name_original": "Ninja Assassin IV", "description": "This game contains 13 levels. In this violent 3D action game you play as angry ninja. You have been hired to complete task from ex general of a empire to save the land. Your main mission is to go after murder of the real king of a kingdom. By your journey you will deal with his army. To get him it is not going to be easy. There are awaiting for you many traps, obstacles and enemies on the way.<br/>Aim to collect all stars and climb where is the target showing on your compas to finish a mission. <br/><br/>Warriors will try to crush you with their strong weapons. Every enemy has different abilities. <br/>You will have to chop, kick, punch, slash through them like a hero or just climb away to disappear. Don't get hit if you know how to move in shadows. Be a man and stand against traitor and his army who murdered your king. Use iron  and gold swords, axes, hammers or  bone bow to clear your way. You can buy them in the shop for gold. With super equipment your hero can reach almost immortality. Sneak and wait for good opportunity to hit in right moment.<br/><br/>Finish all levels, defeat all your enemies and become a legend.<br/>You can also pick stealth approach and use your infiltration, sneak, spy skills. <br/>Swim,climb and discover secret entrances to a castles. Use underground tunnels,climb on a bridge and try to be invisible as a real ninja warrior.<br/>Collect magic arrows to make your mission easier to eliminate anything in your way.<br/><br/><br/>- Realistic stealth and combat movements<br/>- wonderful background music<br/>- realistic HD graphics", "metacritic": null, "released": "2019-01-09", "tba": false, "updated": "2019-07-29T09:47:56", "background_image": "https://media.rawg.io/media/screenshots/af0/af0f2e8b3f67ba80e161cd84a714b88a_bdneJS4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HGames-ArtWorks"], "genres": ["Action", "RPG"], "publishers": ["HGames-ArtWorks"], "esrb_rating": null}