{"id": 337790, "slug": "nail-fashion", "name": "Nail Fashion", "name_original": "Nail Fashion", "description": "Is today a special day for you? Or you just chill out with some best friends? Or you just dreamed of having your own nail salon? Anyway, just come over and let’s do this.<br/>You can paint on different skin tones that match you, your girl friends, or your customers. Our large nail color collection allows you to paint whatever color you like. You can also choose from our exclusive collections of crystals, rhinestones, diamonds, gemstones, pearls, doodads, stickers, patterns, jewelries and much more you can’t even think of. Of course, you can choose from suits of gorgeous nail design we have prepared for you. What’s even better? You can DIY each nail separately and create a different suit of nail design and show it to people around the world. <br/>You can rate your nail designs and get bonus prize for your genious work.<br/><br/>Features:<br/>*3 skin tones to choose from<br/>*Large collections of nail colors<br/>*Exclusive collections of crystals, rhinestone, gemstones, pearls to decorate<br/>*Both cute and high-end fimo and resin<br/>*Various backgrounds <br/>*Unique and fabulous patterns and stickers<br/>*Collections of rings to spice up <br/>*Exclusive designed suits of nail fashion <br/>*DIY our designed suits to make it your own<br/>*Design your own suit and share it with your friends on facebook and twitter <br/>*Take photos with your designs and share it over facebook and email<br/>*Rate your own design and get bonus prize<br/>*Share your score and let your friends know how good you are as a nail designer. <br/><br/><br/>Have your own thoughts on nail fashion or just simply some suggestion for us? Feel free to contact us as your satisfaction is always our goal.<br/><br/>Email: magicfantasyltd@hotmail.com<br/>Follow us on twitter: https://twitter.com/MagicFantasyltd<br/>Like us AND friend us on facebook: https://www.facebook.com/MagicFantasycoop", "metacritic": null, "released": "2013-04-15", "tba": false, "updated": "2019-07-01T03:25:18", "background_image": "https://media.rawg.io/media/screenshots/f43/f43937b6adc43bd6ef403eadee991302.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Magic Fantasy Technology Co"], "genres": ["Family"], "publishers": ["Magic Fantasy Technology Co"], "esrb_rating": null}