{"id": 337708, "slug": "gym-flip", "name": "Gym Flip", "name_original": "Gym Flip", "description": "Swing and jump to make fantastic flips through the air! With realistic physics<br/>easy mechanics and gorgeous visuals, play the hottest flip game of the year.<br/><br/>Do you like Gym, Parkour, doing flips? Then this is your game.<br/><br/>Master all the tricky jumps!<br/><br/><br/>Subscription Terms<br/><br/>VIP Membership offers a weekly subscription for $6.99 after a 3-day free trial. After purchasing this subscription, you will immediately unlock: 3 new VIP skins, 200% extra gems from daily reward and bonus stages, and remove all random ads. This is an Auto-renewable subscription. The payment is charged to your iTunes account after confirmation of purchase. Your subscription will be renewed unless you turn it off at least 24 hours before the period ends. Your account will be charged for renewal as well. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. See below links for more information. <br/><br/>Policy - http://rubygamestudio.com/privacypolicy.html<br/><br/><br/>The prices are set for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency.<br/><br/><br/>To cancel your Subscription Please visit: https://support.apple.com/HT202039<br/><br/><br/>Contacting Us<br/>If there are any questions regarding these terms, you may contact us using the information below. <br/><br/>Ruby Games <br/>Turkey <br/>info@rubygamestudio.com", "metacritic": null, "released": "2019-05-11", "tba": false, "updated": "2019-09-27T04:39:29", "background_image": "https://media.rawg.io/media/screenshots/093/0936853bdca1ba2e55149ba18fbf9556.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["RUBY OYUN VE YAZILIM DANISMANLIK SANAYI TICARET LIMITED SIRKETI", "Mert Can Kurum", "Ruby Game Studio"], "genres": ["Action", "Sports"], "publishers": ["RUBY OYUN VE YAZILIM DANISMANLIK SANAYI TICARET LIMITED SIRKETI", "Mert Can Kurum"], "esrb_rating": "Everyone"}