{"id": 337741, "slug": "bouncing-hedgehog-help-the-launch-tiny-baby-hedgeh", "name": "Bouncing Hedgehog! - Help The Launch Tiny Baby Hedgehog To Catch His Food!", "name_original": "Bouncing Hedgehog! - Help The Launch Tiny Baby Hedgehog To Catch His Food!", "description": "Did you know what Hedgehogs Eat? FIND OUT IN THIS GAME AND HELP HIM GET MORE SNACKS AS YOU CAN!<br/><br/>This cute little Hedgehog is here again, and this time he needs your help! He needs to survive the fan travel adventure to this crazy and colorful land of food! Can you take him safely to his destination while getting as many goodies as you can?<br/><br/>Don’t worry, this pal has good friends too! Yes, hedgehogs are friendly and you can ask help from this good hedgehog pals - BIRDS! Catch them when they pass by to boost your speed as you go!<br/><br/>This is a super fan game! Jump, bounce, fly and spin through the air to keep this cute little pal safe as you steer his way to his destination!<br/><br/>This is so easy at start but gets trickier making it super addictive game, that you don’t want to put your phone down!<br/> <br/>This Game Features:<br/>» Beautiful graphics!<br/>» Cool sounds!<br/>» Great app suitable for all ages!<br/>» So many levels!<br/>» Jump, bounce, fly and spin through the air!<br/><br/>Note there are no in app purchases in this app but it is advert supported :) <br/><br/>If you love this game, please support it by leaving a review in the app store. Thanks for your help we really appreciate it!", "metacritic": null, "released": "2013-12-14", "tba": false, "updated": "2019-07-01T02:55:09", "background_image": "https://media.rawg.io/media/screenshots/b9e/b9e1e7300111dffd15cb318d468b9bce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Inthingity"], "genres": ["Casual", "Family"], "publishers": ["Inthingity"], "esrb_rating": "Everyone 10+"}