{"id": 337710, "slug": "linked-number-puzzle", "name": "Linked: Number Puzzle", "name_original": "Linked: Number Puzzle", "description": "2248 Linked! is a simple yet challenging number puzzle game. The aim is to reach the highest tiles and the highest score by combining same numbers or their numerical powers.<br/><br/>Begin from a base number, combine it with the same numbers or twice that number. Create longest possible links to reach highest scores.<br/><br/>It definitely is a casual game but in every move, you must think ahead. Remember, every action you take has its unique consequences!<br/><br/>How to play:<br/><br/>- Begin with tapping and holding a number. <br/><br/>- Firstly connect your number with a same valued tile. You can move up, down, right, left or diagonal; in all possible directions.<br/><br/>- After two same numbers are connected, you can keep linking the same number or begin linking twice value of that number.<br/><br/>- If you are not happy with your current move, you can rewind your moves at any point before releasing the numbers.<br/><br/>- Once you finish linking, the resulting value is calculated according to the total value of linked numbers.<br/><br/>- The ultimate goal is to reach the highest tile value. Beware tough, once the board is full with no possible links, the game is over!<br/><br/>2248 Linked! Features:<br/><br/>* Addicting &amp; endless gameplay<br/>* Different board sizes for various tastes and difficulty<br/>* Easy to play, hard to master<br/>* Cool block colors<br/>* Entertaining and relaxing sounds<br/>* Share your scores and dare your friends to beat your score<br/>* Leaderboards that allows you compete globally<br/><br/>Oak Games Inc.<br/>Contact support@oak.gs", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-30T04:03:26", "background_image": "https://media.rawg.io/media/screenshots/b87/b87a786ff59858ae901f2c5d4bbc0636.jpg", "website": "https://unicostudio.co/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Unico Studio"], "genres": ["Board Games", "Puzzle"], "publishers": ["UNICO STUDIO"], "esrb_rating": null}