{"id": 337728, "slug": "o2jam-music-game", "name": "O2Jam - Music & Game", "name_original": "O2Jam - Music & Game", "description": "The description of O2Jam - Music &amp; Game<br/>Enjoy the new classic rhythm game for everyone!<br/><br/>- Perfect Single Play<br/>We have focused on heightening the most important qualities of music games, by taking into consideration the feedback from game enthusiasts,<br/>from sync to note angles, note size, note and background color, as well as types of categorized judgment criteria.<br/><br/>- Compete Against the Globally Renowned<br/>There is not only a graph which enables you to view the player’s skills in a glance, a social feature which gives you a chance to boast to your friends.<br/><br/>- New Skin System Full of Individuality<br/>A strong customizing system is supported where separate skin patches can be fused or a completed set is available.<br/>Enjoy 'O2Jam - Music &amp; Game' on your own personalized play screen.<br/>Don't miss out the fun changing appearances of each skin type as you level up 'Fever' stages.<br/><br/>- Offline Mode Where You Can Play Anywhere, Anytime<br/>A feature where you can play freely disregarding the network connection has been added.<br/>The best rhythm game available where you can play anywhere, anytime, such as the bus, subway, or even on the airplane.<br/><br/><br/>※ ※ O2Jam - Music &amp; Game Special Features ※ ※<br/>- Original sound best suited for rhythm games<br/>- Level selection of Easy, Normal, Hard, 3Key, 4Key, 5Key play per song<br/>- Short notes and long notes differentiated by light taps and prolonged touches respectively<br/>- Touch &amp; Drag features supported<br/>- Judgment results: Perfect, Great, Good, Bad, Miss<br/>- Combo and 4 level fever system<br/>- Result Rank Levels STAR, SSS, SS, S, A, B, C, D, E<br/>- Multiplay ranking and song ranking available<br/>- Customize the skin according to your taste<br/>- Song sample available depending on user's selection<br/>- Available in multiple languages<br/><br/><br/>@ O2Jam Official Facebook : https://www.facebook.com/O2JAM.global<br/>@ O2Jam Official Twitter : https://twitter.com/o2jam", "metacritic": null, "released": "2019-06-29", "tba": false, "updated": "2019-07-30T11:08:53", "background_image": "https://media.rawg.io/media/screenshots/f06/f06dba38c95522bbfc2fa861d1a3a5cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["O2Jam Company"], "genres": ["Casual"], "publishers": ["O2 Jaem Company Co"], "esrb_rating": null}