{"id": 337745, "slug": "hungry-piggy-help-the-cute-piglet-get-porky-chow", "name": "Hungry Piggy - Help The Cute Piglet Get Porky Chow!", "name_original": "Hungry Piggy - Help The Cute Piglet Get Porky Chow!", "description": "Here comes a hungry little piggy, he is little and soooo cute!<br/><br/>Help this hungry little piggy get the tasty snacks that are waiting for him as you fly through each level! Make sure to get the snacks as you safely guide the little piggy through obstacles. And there is no way to stop the piggy from running and bouncing once he started to chase after food.<br/><br/>The challenge is, can you take him home safe while getting as many snacks as you can?<br/><br/>Jump, bounce and fly far as you can! You can get help from birds too! Try to catch them to boost your speed! <br/><br/>This is super challenging and super fun game! This is so easy at start but gets trickier making it super addictive game, that you don’t want to put your phone down!<br/><br/>Want more fun? Take the challenge now! Help and feed this cute hungry little piggy to enjoy the following GAME FEATURES:<br/><br/>» Beautiful graphics!<br/>» Cool sounds!<br/>» Great app suitable for all ages!<br/>» Jump, bounce, fly and munch as many snacks as you can!<br/><br/>Note there are no in app purchases in this app but it is advert supported :)<br/><br/>If you love this game, please support it by leaving a review in the app store. Thanks for your help we really appreciate it!", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2019-07-01T02:57:46", "background_image": "https://media.rawg.io/media/screenshots/4a4/4a4e68b0931f767f536a96aa455665be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Inthingity"], "genres": ["Casual", "Family"], "publishers": ["Inthingity"], "esrb_rating": "Everyone 10+"}