{"id": 337718, "slug": "mahjong-solitaire-3tiles-pay", "name": "Mahjong solitaire 3tiles pay", "name_original": "Mahjong solitaire 3tiles pay", "description": "Mahjong Solitaire \"Three Takes\" Paid<br/>Mahjong solitaire is a Chinese classic game, it takes 2 pieces of the same tile, but it is a mahjong game which takes 3 pieces of the same tile or 3 consecutive tiles. Please enjoy this new idea game.<br/>Mahjong Solitaire (Shanghai Mahjong, Mahjong Taipei, Mahjong Solitaire) is a kind of Chinese classic game, usually you will find two identical tiles, but this game has three tiles of the same tile or a series of tiles It is a mah-jong game that takes 3 cards. The aim is to remove all the tiles from the board. Different points from ordinary solitaire can be taken even if it is sandwiched. You do not have to find the end one. However, it can not be taken unless you select 3 pieces. Please enjoy this new idea game.<br/>The way to take is the same pattern, such as 123, 234, 456, 567, 789, 111, 555, 999 of the same pattern, middle, middle, starting, etc.<br/>Level 1 has 3 modes, and level 36 has 108 modes.<br/>In addition to the mah-jong tiles, the design prepared pictures of cats etc. You can enjoy from children to adults.<br/>A free version is also available. Please search for the free version 【Mahjong Solitaire \"Three Take\" Free】 This will be up to level 20.<br/><br/>Added bonus game of alphabet design<br/><br/>Compliance matter<br/>Please purchase after trying Mahjong Solitaire \"Three sheets take\" free.<br/>I am making games with hobby after retirement age. I think that I am sorry, I set it to the lowest price 99 yen. I think there are pugs etc. Please understand that point and purchase. (The number of purchasers is about several people, even if bugs etc. are found, it takes time to fix.)", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2019-07-01T02:41:24", "background_image": "https://media.rawg.io/media/screenshots/748/748b2f00b18471f65cb5a7ab3663b858.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["yuzuru hayakawa"], "genres": ["Card", "Puzzle"], "publishers": ["yuzuru hayakawa"], "esrb_rating": "Everyone 10+"}