{"id": 337719, "slug": "furuman", "name": "furuman", "name_original": "furuman", "description": "Lost mahjong fallen game furuman 2<br/><br/>It is a one-person mah-jong game of falling things game formula. This game is one person mahjong, but includes elements of falling games. It corresponds to the gravity sensor and judges the inclination.<br/><br/>It is a one-person mah-jong game of falling things game formula.<br/>This game is one person mahjong, but includes elements of falling games.<br/>It corresponds to the gravity sensor and judges the inclination.<br/>Tiles falling from above will be tiles piled up. Due to the nature of the game, it is always pre-loaded.<br/>Push the tiles you throw away with the falling tiles. If you do not need a tile to come down,<br/>I will drop it on the tile of the back in which it is.<br/><br/>In the case of Ron, please push 'Ron' while putting it in the vacant part on the right<br/><br/>For how to squeeze please push the part surrounded by the black square above, or press \"cry\".<br/>In the case of Pon Chino, the tile to be pushed out becomes the back. In the case of Kang, the tiles that are falling<br/>It becomes a can lump.<br/><br/>Once it gets up, the next cup will be piled on the last time. By that amount, the falling time will be shorter.<br/>The difficulty of the game is four kinds.<br/>easily<br/>Please use it to feel familiar<br/>easy<br/>Familiarity is making it easier<br/>usually<br/>Automatic sorting of front tiles will be done<br/>Difficulty<br/>Sorting of front tiles is not done", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2019-07-01T02:41:42", "background_image": "https://media.rawg.io/media/screenshots/aab/aabbce9f882135f9498c5708fffb868f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["yuzuru hayakawa"], "genres": ["Action", "Card"], "publishers": ["yuzuru hayakawa"], "esrb_rating": "Everyone 10+"}