{"id": 337800, "slug": "100-ways-to-be-famous", "name": "100 Ways To Be Famous", "name_original": "100 Ways To Be Famous", "description": "*** Wanna be Famous? ***<br/><br/>Beware, another ‘out of your f mind’ game by the studio of THE Famous [ 100 Ways to Die ] series is coming right at you!<br/><br/>Turning heads as you walk down the streets? Being asked for autographs? The public life of the famous seems glamorous and desirable for many of us. People want to get famous ALL THE TIME. <br/><br/>You’ll find to learn many ways for you to achieve the goal. While some can get lucky by accident, others may need a little more of your work done. <br/><br/>* Multiple ways of game control: tap, swipe, tilt, shake, or even make some noise, anything may activate a story event.<br/>* Many characters with Many Many stories: for you to experience the excitement of multiple lives.<br/>* Help: you can seek for help with our HINT and SKIP props, however we strongly suggest you think a little more, and try a little harder.<br/>* Hidden endings: not every story ends in just one way, see if you can discover more.<br/>* Cute character design plus colorful scenes: a game for you to enjoy.<br/>* Challenging levels: to figure out how to become famous won’t be easy.<br/><br/>Remember, not all ways to become famous is honorable, neither is fame the ultimate goal in life. This game is more of a tease than textbook. So, Just Smile.<br/><br/>If you have any good ideas on ‘How to be Famous’, we are more than happy to hear from you.<br/>Please contact us by following means:<br/>Write us an email: magicfantasyltd@hotmail.com<br/>Like us on facebook: www.facebook.com/MagicFantasycoop<br/>Follow us on Twitter: www.twitter.com/MagicFantasyltd", "metacritic": null, "released": "2016-01-07", "tba": false, "updated": "2019-07-01T03:27:42", "background_image": "https://media.rawg.io/media/screenshots/346/346b994035d0144a1320f64b9b38a7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Magic Fantasy Technology Co"], "genres": ["RPG", "Puzzle"], "publishers": ["Magic Fantasy Technology Co"], "esrb_rating": "Everyone 10+"}