{"id": 337966, "slug": "elixir-of-life", "name": "Elixir of life.", "name_original": "Elixir of life.", "description": "<p>Jeu réalisé pour la GameCodeur Jam n°20.</p>\n<p>L'humanité est mise en danger à cause d'un virus inconnu. Pour sauver les habitants de la planète, il faut mélanger quatre précieux liquides stockés dans des bouteilles remplies par vos soins.</p>\n<p>Pour remplir ces bouteilles, il faut attraper les balles de la même couleur que la raquette. Celle-ci doit être en position \"pêche\". </p>\n<p>Attention si vous récoltez des balles de couleurs différentes à la raquette, vous augmentez votre compteur de balles loupées et au bout de quelques erreurs, c'est la mort assurée !<br/></p>\n<p>Pour éviter d'attraper de mauvaises balles, il faut retourner la raquette avec la barre d'espace et la retourner à nouveau pour la réception des bonnes balles.</p>\n<p>Les touches fléchées gauche et droite servent à déplacer la raquette.</p>\n<p>Bonne pêche !<br/><br/> Langage utilisé : LUA </p>\n<p>Framework : Love2D </p>\n<p>Code : Bond51 </p>\n<p>Graphismes : Mon fils Bruno<br/></p>\n<p> Sons : tirés du Commodore 64 </p>\n<p>Utilisation de librairies et codes externes : non </p>\n<p>Temps passé : 4 jours environ.</p>\n<p> Petit Postmortem : Le plus gros défi sur ce jeu était de trouver le bon algorithme lors d'une collision de la balle avec les briques de couleur : Détecter une collision, c'est bien, mais savoir où la brique a été touchée, c'est encore mieux : défi réussi.</p>\n<p>J'ai encore quelques bugs au niveau de la raquette : Si une balle de mauvaise couleur touche celle-ci en position \"pêche\", on doit théoriquement enregistrer une erreur de balle. Parfois, le programme en enregistre plusieurs si bien que l'on perd immédiatement... ( je cherche et il faut que je trouve d'où ça vient)<br/></p>", "metacritic": null, "released": "2019-06-30", "tba": false, "updated": "2019-07-01T04:19:24", "background_image": "https://media.rawg.io/media/screenshots/3fb/3fb98971a24af45134cfd89c9ad146dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bond51"], "genres": [], "publishers": [], "esrb_rating": null}