{"id": 338113, "slug": "bradach", "name": "Bradach", "name_original": "Bradach", "description": "<p>Welcome to Bradach! This is a very simple roguelike I made for my June \"One Game a Month\" project. Please see the guide below to help deceipher each of the ASCII characters, and tweet me if you beat the game - we'll name an enemy after you!<br/></p>\n\n<p><strong>GUIDE</strong></p>\n<p> <br/></p>\n<p>This is <strong>you</strong>. You are controlled by using the direction keys to move in each cardinal direction. You can cycle through three classes by pressing X. Alternatively, tap in each direction to move, and tap the centre of the screen to cycle classes.</p>\n<p>Fighter - no range, powerful melee</p>\n<p>Ranger - long range, instant travel time, low damage</p>\n<p>Mage - long range, slow travel time, huge damage</p>\n\n\n<p>This is your <strong>goal</strong>, the fabled exclamation mark of legends old. Reach this to be added to the annals of champions. Also, if you reach this, tweet me at @itsjustaidan and I will be very proud of you.</p>\n\n<p>This is a <strong>staircase</strong>. Use it to descend deeper into the dungeon. But beware, for Mega Monsters lurk below.</p>\n\n<p>This is <strong>loot</strong>. Grab it to power up your champion. Each piece of loot has a random effect. Gather as many as you can to ensure survival.</p>\n\n<p><strong>MONSTERS<br/></strong></p>\n\n\n<p>This is an <strong>orc</strong>. Slow and predictable, the orc will lumber towards you once it catches sight of you.</p>\n\n<p>This is a <strong>ferret</strong>. As is widely known, ferrets are extremely quick and deadly. Once a ferret spots you, it will rush to your location. Be on the lookout.</p>\n\n<p>This is a <strong>spitter</strong>. It cannot move, but if you rest too long in its line of sight, it will spew dangerous acid at you until you move or kill it. Unsurprisingly, its acid cannot pass through fire...</p>\n\n<p>This is a <strong>wasp</strong>. Quick and hyperactive, the wasp will only harm you if you cross its erratic random path. Best dealt with from a distance.</p>\n\n<p>And tales are told of Mega Monsters deep in the caves of Bradach...<br/></p>", "metacritic": null, "released": "2019-06-29", "tba": false, "updated": "2019-07-01T05:00:57", "background_image": "https://media.rawg.io/media/screenshots/9c3/9c338b803fc25a34007f6b332da0e48c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["osis"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}