{"id": 338112, "slug": "alien-flower", "name": "Alien Flower", "name_original": "Alien Flower", "description": "<p>Catch falling drops to keep alien flower watered.<br/>There is a watering meter in the top left corner represented by a blue line.<br/>When it shrinks to a minimum and it's color is white, the game will end.<br/>You can not catch every drop, but catch the first one to start watering and keep your eyes on watering meter. Catch drops to a cup, that floating at the bottom of the screen.<br/>Control it with two buttons under it.<br/>Left button to move cup left, and right button to move it right.<br/>Avoid catching bugs, you don't need them for watering. If you catch one, the game will end. You can use shield to keep bugs away from the cup. It will activate if you'll tap almost anywhere on the screen except of buttons.<br/>It will be active for one second, and then it will recharge in three seconds, so use it wisely.<br/>You'll know that recharging is complete, when the shield meter on top left corner of the screen is full.<br/>Shield meter represented by the green line.<br/>Game graded by levels, new level starts when, you catch a star.<br/>There is ten levels and ten stars in this game.<br/>If you wasn't able to catch the star on any level, just wait when you'll see it again, and catch it this time.<br/>The game is easy, but be careful on the last levels.</p>\n<p>Music by shimtone.</p><p>There's desktop version, if you want to try it.<br/></p>\n<p>Controlls for desktop version:</p><p>Arrows to move cup, Space to activate shield.<br/></p>", "metacritic": null, "released": "2019-06-29", "tba": false, "updated": "2019-07-01T05:00:48", "background_image": "https://media.rawg.io/media/screenshots/d18/d1863237b9e56338aed75d481cff7afd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["HeligearGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}