{"id": 338108, "slug": "bad-cop-no-donut", "name": "Bad Cop No Donut", "name_original": "Bad Cop No Donut", "description": "<p>You are an officer in internal affairs. Your job is to the catch cops who strayed off the righteous path. </p>\n<p>You are good at your job. You are proud of your job. </p>\n<p>There is a small problem however. You see, you may have skeletons in your closet too. Maybe you are aware of them. Maybe you forgot them. And maybe someone remembers them for you.</p>\n<p>This project started as a demo for a board game I designed. I wanted a model I could play test before making things with materials that would cost me an arm and a leg. I decided to add some finishing touches and share it with the world. All criticism is welcomed. Except about the music. I know it's terrible. You can mute it. A board game does not have music so it won't have effect on the final product. You are already complaining about the music aren't you? Okay, it is warranted. Heh. Get it? Warranted? Warrant? Cops? Who use Warrants? There are Warrants in the game. You will see. When you play it. After you mute it.</p>\n<p><strong>FAQ:</strong></p>\n<p><strong>Q:</strong> Did you just made a game out of a subreddit?</p>\n<p><strong>A</strong>:Maybe.</p>\n<p><strong>Instructions:</strong></p>\n<p>In this game, 6 players (you and 5 bots to be specific) take the roles of such officers. One is, indeed, the \"Good Cop\", but the rest of the table needs to cooperate and eliminate evidence against themselves.</p>\n<p>Each cop has 3 evidence against them. At the beginning of a round, one cop is randomly selected to be the good cop by setting aside the cards representing the evidence against them. None of the players will know which cop was chosen.</p>\n<p>The rest of the cards are shuffled together with 6 special actions cards, called \"Warrants\" (Will be explained later). Each cop gets 3 cards, and an additional 3 are put in the center, in the Evidence Room.</p>\n<p>Your objective is, first of all, to understand if you are a \"Bad Cop\" - simply by seeing that one of your evidence is in play (It may be in your starting hand, if you are lucky).</p>\n<p>If that is the case you must help a fellow Bad Cop escape justice: If any cop manages to collect all of their evidence  cards - all Bad Cops win.</p>\n<p>If enough turns go by without you seeing  any of your evidence, and you believe you are indeed the \"Good Cop\", at the start of your turn you can call it, and check the cards that have been put aside. If they are yours, you are the only winner of the round, but if not, then all the other cops (Good or Bad) win, and you are the only loser.</p>\n<p>At the start of your game you will look at the 3 cards you were given and then set them facing down in front of you. During your turn, you will be able to look at them, and perform one of four actions:</p>\n<p>\n</p>\n<p><strong>Ask another cop to show you a </strong><strong>card</strong> - that cop gets to choose which of their card you get to see, and only you can see it. If the card is a \"Warrant\", however, it is reveled for everyone. and that cop will take a card from your hand and give you the Warrant card in its place.</p>\n<p><strong>Swap card with the Evidence Room</strong> - Take a card out of the center cards, and put one from your hand in its place. The order will be maintained. No special effect in case it's a Warrant.</p>\n<p><strong>Declare you are the Good Cop</strong> - Check the cards that were set aside as previously explained.</p>\n<p>\n</p>\n<p><strong>Play a Warrant</strong> - If you have a warrant in your hand you can reveal it to everyone, and pick a cop. You and that cop each pick a card from your hand and those cards are swapped. You may choose to swap the Warrant card itself. Again, the order will be maintained.</p>\n<p>If at either the start or the end of your turn you have all of your cards, you show your hand and all bad cops win, as explained before.</p>\n<p><strong>Cooperation is key. Good Luck.</strong></p>", "metacritic": null, "released": "2019-06-29", "tba": false, "updated": "2019-07-01T04:59:25", "background_image": "https://media.rawg.io/media/screenshots/8ef/8efafce210b568f8b9ee5878757a6002.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tomSh"], "genres": [], "publishers": [], "esrb_rating": null}