{"id": 338306, "slug": "magic-awale-la-memoire-des-racines", "name": "Magic Awalé: La mémoire des racines", "name_original": "Magic Awalé: La mémoire des racines", "description": "<p>Jeu mobile Africain de stratégie et de réflexion basé sur l'awalé<br/>L'awalé est un jeu de réflexion africain, de la famille des jeux de semailles. Il se joue sur un plateau cylindrique, creusé de 12 trous. Les trous sont répartis en deux territoires comprenant chacun 6 cases ou maisons. C'est le plus répandu des jeux de la famille mancala, ensemble de jeux africains de type « compter et capturer » dans lesquels on distribue des cailloux, graines ou coquillages dans des coupelles ou des trous, parfois creusés à même le sol, ce jeu appartient à la grande famille des jeux de semailles africains.<br/><br/>L'univers des significations de ce jeu, sa valeur culturelle et formatrice sont d'une grande richesse. L'awalé est une métaphore des sociétés qui l'ont vu naître. Le plateau du jeu représente des parcelles d'un champ dans lesquelles le joueur sème, puis récolte des graines. Certaines règles du jeu comme la règle de la solidarité, qui oblige de nourrir l’adversaire quand il a faim et interdit d'affamer l'adversaire démontrent l'esprit de partage ayant animé les créateurs de ce jeu de réflexion. Un partage qui ne dispense pas de gagner, puisqu'il s'agit d'un des buts du jeu, gagner plus de graines que l'adversaire, mais gagner sans anéantir l'autre, lui donner toujours les moyens de continuer la partie, puisqu'il n'y a plus de jeu dès l'instant où l'on tue son adversaire. L'existence des notions mathématiques dans l'awalé ne signifie pas qu'il faut savoir ces notions pour en jouer. Ces notions sont enveloppées par la structure ludique du jeu. Elles vivent dans l'awalé à travers les règles du jeu et la construction des stratégies. L'abstraction mathématique se présente sous des aspects ludiques au Joueur.</p>", "metacritic": null, "released": "2019-06-28", "tba": false, "updated": "2019-07-01T05:56:10", "background_image": "https://media.rawg.io/media/screenshots/3ba/3bab45a8b7faef7864de951fc6712112.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bayaola"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}