{"id": 338489, "slug": "climb-car-racing-game", "name": "Climb Car Racing Game", "name_original": "Climb Car Racing Game", "description": "If you love to play car games and you like racing games then this is the right game for you. Enjoy HD graphics, easy gameplay and highly addictive and challenging levels.<br/><br/>Test your mountain car racing skills and see how far you can go controlling your car in many challenging and exciting levels. <br/><br/>Download the mountain racing game now for FREE!<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/>In our game we have the following subscription length:<br/><br/>1. Weekly Diamond Membership for $7.99 offers a weekly subscription after a 7-day free trial, unlocks special features and removes all ads.<br/>2. Monthly Diamond Membership for $19.99 offers a monthly subscription, unlocks special features and removes all ads.<br/>3. Yearly Diamond Membership for $99.99 offers a yearly subscription, unlocks special features and removes all ads. <br/><br/>End of trial and subscription renewal<br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use sticker packs marked as Premium.<br/><br/>If you have any questions or comments, feel free to contact us at 9566710@gmail.com<br/><br/>Privacy Policy and Terms of Use: http://game.applife.info/policy/", "metacritic": null, "released": "2019-03-07", "tba": false, "updated": "2019-07-29T22:27:33", "background_image": "https://media.rawg.io/media/screenshots/4cd/4cdb20e59221c5dd31acff4ed9f17e71_7ZZpEq3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AppLife"], "genres": ["Simulation", "Racing"], "publishers": ["AppLife"], "esrb_rating": null}