{"id": 338552, "slug": "flowering-tree", "name": "Flowering Tree", "name_original": "Flowering Tree", "description": "How often do you use your logical thinking skills in everyday life?  Probably very little or not at all. Well, Greyheadstudio got you covered!  Flowering tree Puzzle Game is a great modern way to challenge those dead brain cells while enjoying beautiful designs and graphics.<br/>It all starts with a beautiful flowering tree that you see on the meadow on a rosy sunrise.  Unfortunately, this lovely plant is the last of its kind due to its secret magic abilities! That’s right! The tree is capable of healing wounds and scars , which is why the tree is secretly called The Tree of Life. And here’s the thing: The whole magic hides in its branches and leafs.<br/>But your help is needed! In order for the tree to remain as beautiful and to flower as rapid, you need to take care of it and heal its broken branches. The goal is to connect as many broken branches as possible and keep the tree healthy and luscious. The more branches you connect, the more points you get. But it isn’t as easy as it seems: The branches are all twisted and mixed up, so it takes brains and requires some thinking to rotate the branches correctly to form a strong and healthy stem. Don’t forget to be quick! You only have a limited amount of time for each level. For more points you can use different bonuses that help you connect more branches in smaller periods of time.<br/>Seems like a lot of responsibility to take care of the magic plant…Don’t worry, you won’t be alone! Meet Blue-your loyal feathery companion who will guide you through the tutorial and stay with you on your mission.  <br/> <br/>So hurry up! Download Flowering Tree, test your intelligence and restore the tree’s magic abilities!", "metacritic": null, "released": "2015-04-11", "tba": false, "updated": "2019-09-06T03:28:21", "background_image": "https://media.rawg.io/media/screenshots/411/41143be9bda92ac819f3fc30ef2e3978.jpg", "website": "http://www.greyheadstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Veronika Medvedeva"], "genres": ["Action", "Puzzle"], "publishers": ["Veronika Medvedeva"], "esrb_rating": null}