{"id": 338694, "slug": "defcon_aliens", "name": "DEFCON_Aliens", "name_original": "DEFCON_Aliens", "description": "<p>I'd first like to start with introduction. Hi! I am Keysky, I am an avid gamer, and now currently a game-developer rookie. This happens to be my very first game that I have ever made. Its pretty rough, but I am proud of what I have accomplished with this. I am looking forward to hone my skills and make better games going forward. Thank you for giving my game your valuable time.<br/></p>\n<p>The game itself is pretty simple. You jump in, kill shit and keep killing as long as you can. Each kill has a chance to drop one of 3 different weapon types: Assault rifle, Shotgun, Sniper rifle (sniper being my favorite) Each kill gives you additional survival time and you will perish when the timer reaches 0.</p>\n<p>___________________________________________________________</p>\n<p>MOVEMENT : W A S D ( or directional Keys)</p>\n<p>LOOK : Mouse movement (Player will always face towards the mouse)</p>\n<p>SHOOT : Left Mouse Click</p>\n<p>___________________________________________________________</p>\n<p>I hope you enjoy, this rather arcade-y game.</p>\n<p>While I have kept the game free for download, any donations towards me would be deeply appreciated, as I make my own 3D assets, textures, and codes and I am trying to turn game developing into my profession, and income does help my life-aspect of things.</p><p>If the game happens to do well and I get enough downloads, I plan on adding more maps as well. But for now just one map.</p>\n<p>I also look forward to see what you think of the mechanics, style or any other things you wanna discuss about the game.<br/><br/>Again, a deep thank you for giving me and my game(s) you time.<br/></p>", "metacritic": null, "released": "2019-07-04", "tba": false, "updated": "2019-07-05T03:55:14", "background_image": "https://media.rawg.io/media/screenshots/feb/febea3aa280f350dfa029c298419ab5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Keysky"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}