{"id": 33884, "slug": "pretty-good-solitaire", "name": "Pretty Good Solitaire", "name_original": "Pretty Good Solitaire", "description": "Pretty Good Solitaire is the premier desktop solitaire game collection with 750 regular games and 100 bonus games, for a total of 850 different solitaire games.<br/><br/>Since 1995, Pretty Good Solitaire has been the choice of millions of solitaire players.<br/><br/>Includes the popular games Klondike, FreeCell, Spider, Yukon, Scorpion, Pyramid, Cruel and more.<br/><br/>Also includes many games invented for Pretty Good Solitaire, such as Demons and Thieves and Aces and Kings.<br/><br/>Features:<br/><br/>- easy to play - drag/drop the cards or use quick click moving.<br/><br/>- undo and redo all moves.<br/><br/>- automatically saves games.<br/><br/>- make the game window any size or even full screen.<br/><br/>- 5 card sizes, including large cards for poor eyes.<br/><br/>- over a dozen different beautiful professionally designed card sets.<br/><br/>- change card backs, or change background image or background color.<br/><br/>- just click on the Rules button to see the rules of each game.<br/><br/>- over 2 billion starting positions for each game.<br/><br/>- submit your statistics and see how you compare to other players. <br/><br/>- statistics for multiple players.<br/><br/>- Climb Mode, where you play from game #1 and play for a cumulative score.<br/><br/>Pretty Good Solitaire is the solitaire game for players who take solitaire seriously.  This is not a converted mobile app, it was designed for large screen desktops/laptops.  Pretty Good Solitaire has been continuously updated for nearly 20 years, with email support from http://www.goodsol.com/contact.html .", "metacritic": null, "released": "1997-01-01", "tba": false, "updated": "2019-07-30T08:20:37", "background_image": "https://media.rawg.io/media/screenshots/6f9/6f956384b1272b784d47d3165965a5ac_rXMKvLl.jpg", "website": "http://www.goodsol.com/ipad", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "iOS"], "developers": ["Goodsol Development"], "genres": ["Card", "Puzzle"], "publishers": ["Goodsol Development"], "esrb_rating": null}