{"id": 338847, "slug": "try-not-to-hold-hands-with-yves", "name": "Try Not To Hold Hands With Yves", "name_original": "Try Not To Hold Hands With Yves", "description": "<p>A completely safe-for-work version of the game Kpopalypse wrote for Pride month and Loona stans, \"Try Not To Have Gay Sex With Yves\".  This new hand-holding version features:</p>\n<p>* All references to gay sex replaced with references to hand-holding<br/>* Most swearing has been replaced with \"gee golly gosh\" and similar<br/>* Some violent scenes made friendlier and even downright cute<br/></p>\n<p>Hopefully this will be enough to please the Loona subreddit mods as well as anyone wishing for some strange reason to play the game at their workplace (which isn't recommended as it's very distracting and you'll probably just get fired).<br/></p>\n<p>This game is completely FREE, however if you actually enjoyed this absolute nonsense, or if you lament the fact that people creating mature content for k-pop fans have to resort to bullshit stunts like this just to get the same amount of airtime as some creepy fan content that encourages overzealous emotional attachment to strangers and mental illness among k-pop fans but would probably get past the moderators of k-pop communities no problem, please consider supporting Kpopalypse on Patreon so I can make even more of this trash, thank you.\r\n</p>\n<p>For context or to leave comments visit www.kpopalypse.com\r\n</p>\n<p><strong>System requirements: </strong>\n</p>\n<p>PC version: any computer made in the last 15 years can run this game on PC, seriously.</p>\n<p>Not available for other operating systems at this stage.\r\n</p>\n<p>Not available for mobile devices.<br/></p>", "metacritic": null, "released": "2019-07-03", "tba": false, "updated": "2019-07-05T04:32:40", "background_image": "https://media.rawg.io/media/screenshots/e52/e523f392b567c1fdaca5632f44942bca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kpopalypse"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}