{"id": 338996, "slug": "foxnapped", "name": "Foxnapped", "name_original": "Foxnapped", "description": "<p>We are a team of 5 people who made this game for our first project after one month of education for game developers (6 months) in Croatia (Novska - PISMO Inkubator). Our team consists of 2 modelers and 3 programmers. </p><p>This short but sweet game was made using Blender and Unity and was the first project to test our knowledge in a one week period we had to make it. It probably won't ever be finished because our education lasts 6 months and we have other projects to work on currently.</p>\n<p>This is a short 2.5D platformer where you play as fox which travels through 4 levels where every level presents one of the seasons (spring, summer, autumn, winter). You travel through the levels avoiding bear traps, collecting a few cosmetic items while fighting chickens using your melee, ranged and AOE attacks which are represented by the claw, egg throw and scream abilities. Don't be suprised if you can't pass through some of the levels because we had no time to balance it. You can use F1-F4 buttons in-game to load the other levels. <br/></p><p>So basically, feel free to criticize or maybe even commend something you find good or bad in this project because we are aware that it's not even remotely polished as we want it to be or long enough to call itself a fully relased game. But please, keep in mind this was made in one week from the start by 5 totally unexperienced people which didn't work physically side-by-side or had all the time in the world.</p><p>Thank you. :)<br/><br/></p>\n<p>Stefan Vedrina - Unity programmer</p>\n<p>Karlo Ovcar - Unity programmer</p>\n<p>Toni Šimurda - Unity programmer</p>\n<p>Ivan Panezic - Blender modeler</p>\n<p>Danijela Kurz - Blender modeler</p>", "metacritic": null, "released": "2019-07-02", "tba": false, "updated": "2019-07-05T05:14:23", "background_image": "https://media.rawg.io/media/screenshots/c91/c919ad3c6b4af3ff1cb9687faccedcb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vedrina"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}