{"id": 339, "slug": "ticket-to-earth", "name": "Ticket to Earth", "name_original": "Ticket to Earth", "description": "Episode Two - Crash has been added in the latest update. Play the next part of the Ticket to Earth saga now!<br/><br/><br/><br/>A distant planet. A dying colony. A deadly conspiracy. <br/><br/>The mining boom has left New Providence to die, and just one Earthbound ship remains. Survivor Rose stands in defiance of a broken system. Rise up with fast-paced RPG tactics, and battle across vibrant fields of color. <br/><br/>Join the fight in Ticket to Earth, a sci-fi tale of betrayal and insurrection.<br/><br/><br/><br/><br/><br/><strong>ORIGINAL GENRE MASH-UP</strong><br/>Introducing a new style of gameplay that blends puzzle and tactics games. Ticket to Earth is the quick-play, mission-based RPG you’ve been waiting for.<br/><br/><strong>SCI-FI EPISODIC NARRATIVE</strong><br/>Join Rose, Wolf, Doc and Seven as they race across New Providence to stop a criminal conspiracy.<br/><br/><strong>FIGHT FOR JUSTICE</strong><br/>Play as melee and ranged Peace Keepers, armed with over one hundred Combat Powers. Fight against a cabal of twisted enemies - desperate criminals, murderous machines and terrifying mutants.<br/><br/><strong>JOIN THE MOVEMENT</strong><br/>The Stellar Consciousness Movement will help you reach your true human potential. Deep RPG character progression - develop your talents and build better heroes! <br/><br/><strong>ENHANCED PC EDITION</strong><br/>This original mobile hit has been brought to PC with a suite of upgrades, including new high-resolution graphics, a stunning new light and shadow engine, customizable controls, multiple save game slots and much more.<br/><br/><br/><br/><br/><br/>Ticket to Earth is a gripping RPG narrative delivered over four big episodes. By purchasing Ticket to Earth, you’ll have access to every episode as they release, automatically added to your game and at no additional cost. <br/><br/>Episode One and Two are available now, and the two remaining episodes will be automatically added as an update to your game as they release.<br/><br/>Episode One - Uprising (Available now)<br/>Episode Two - Crash  (Available now)<br/>Episode Three - Meltdown (Coming soon) <br/>Episode Four - Revolution (Coming soon)<br/><br/><br/><br/><br/><br/>Robot Circus is an independent game studio in Melbourne, Australia. We started the studio in 2011 after working together for many years at a large game studio on console games. Starting Robot Circus allowed us the freedom to pursue our passion for creating innovative experiences and compelling narrative.<br/><br/>Ticket to Earth is the kind of game we formed our studio to make. We can’t wait for you to play it, and are looking forward to revealing all the cool locations and story twists that are coming in the future Episodes.", "metacritic": 84, "released": "2017-03-15", "tba": false, "updated": "2021-07-23T04:16:28", "background_image": "https://media.rawg.io/media/games/bcb/bcbb62cda93ee566ef5b0041b0b03a6d.jpg", "website": "http://www.ticket-to-earth.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 28, "beaten": 1, "toplay": 4, "dropped": 3, "playing": 3}, "playtime": 4, "achievements_count": 45, "ratings_count": 2, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "macOS", "Android", "PC"], "developers": ["Robot Circus"], "genres": ["RPG", "Strategy", "Indie", "Puzzle"], "publishers": ["Robot Circus"], "esrb_rating": null}