{"id": 339020, "slug": "whisper-vr", "name": "Whisper VR", "name_original": "Whisper VR", "description": "<p><strong>Inspiration</strong></p>\n<p>We are inspired by enhancing human connection! </p>\n<p>Our initial intention was to enable voice professionals to connect with audiences in virtual reality through live performance. Voice is 70% of our communication, and verbal intonation is an important input for connecting to others in immersive environments.</p>\n<p><strong> What it does</strong></p>\n<p>Whisper is an experience of self-empowerment and expression; an exercise in expressing and acknowledging growth and positivity. Drawing from connection to nature, we created safe space to practice and visualize feedback and positive self-talk from the environment.<br/>Ideas and intentions become even more real when our positive thoughts become words, our words become visible, and we see the effect on the world around us.</p>\n<p><strong>How we built it</strong></p>\n<p>We experimented, iterated, and pivoted to reach early success, driving towards a deeper engagement. Our team of 4 collaborated well, with developers and producers providing valuable ideas, input and feature suggestions which helped our project blossom.</p>\n<p><strong>Challenges we ran into</strong></p>\n<p>We struggled to establish meaningful connection in the experience between asymmetrical participants given some constraints of the technology (latency from live audio) and the limitations of our demo environment (likely to be noisy), therefore we decided to transition away from a 2-person experience.  <br/>After a few hours of brainstorming how to re-purpose our early accomplishments into an engaging experience, we pivoted mid-afternoon on the second day to a solitary experience which focused more on the human connection with oneself.</p>\n<p><strong> Accomplishments that we're proud of</strong></p>\n<p>We're proud of innovating on accessibility considerations for changing scenes in VR through voice commands. <br/>Tying the user's volume of voice input as a parameter to scene changes, we developed in-game capability for user input in VR to be hands-free. This will encourage later development of accessibility through designs to use voice input to manage navigating through other VR experiences.</p>\n<p>We are proud of our team cohesion, communication, adaptability, and willingness to experiment and pivot with the support of the whole team to create a connective experience.</p>\n<p>Use of ambient light to que suggestions to the user, and the collective learning of how to work with sound in VR as an in-game mechanic for navigating through scenes.</p>\n<p><strong> What we learned </strong></p>\n<p>After completing the technical part of our MVP to bring visualizations based on live sound, and 'music' generated by data sets into VR rather quickly, we realized that the experience didn't have the emotional impact we intended, and that our initial design for an asymmetrical experience didn't have an interactivity that supported our goals for enhancing human connection. </p>\n<p>We learned data in sound, and managing pitch in VR is technically difficult, yet we found ways to operate within this challenge and constraint to being colorization to the waveform of the user's voice in a dynamic way. </p>\n<p><strong> What's next for Whisper<br/></strong>We may pivot further development of Whisper as a toolkit for situational and voice-skills training for all ages, as an immersive environment for users to role-play with the correct pitch, volume, and inflection for a variety of social situations providing real-time feedback.</p>\n<p>To continue this project, there are a few areas of next-steps that we would invest our time and energy into: Machine Learning, user stories, and enhancing narrative crafting. </p>\n<p>Machine Learning Goals: <br/>*Sound recognition of a sound pitch/note, and analysis of audio algorithms. <br/>*Discerning specific sounds from other sounds, and separate them from background noise. <br/>*Accurately detecting note and pitch; our initial research indicates this is much harder that it appears, and would require more time than we have available for this project. </p>\n<p>User Story Goals: <br/>*Develop a deeper variety of user stories to accommodate those who may be more boisterous, or timid in their speech, and to automatically adjust to change in-experience content to support those users.</p>\n<p>Narrative Crafting Goals:<br/>*Deepen the emotional impact, and user experience takeaways.<br/>*Invest time in developing variations of the experience to encourage repeat users, and enhance user value of the experience.</p>", "metacritic": null, "released": "2019-07-02", "tba": false, "updated": "2019-07-05T05:22:42", "background_image": "https://media.rawg.io/media/screenshots/740/74025f7e2c5f600f78a720b17665b86c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ray Soyama"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}