{"id": 339284, "slug": "uhit-softball", "name": "uHIT Softball", "name_original": "uHIT Softball", "description": "Want to have better hitting vision? Start playing uHIT Softball today! <br/><br/>Originally built for MLB players, uHIT Softball takes the best of what’s worked for uHIT Baseball. But now it’s for fast-pitch! <br/><br/>Over a million pitches to improve your vision on. Hundreds of levels to pass as you learn to call balls and strikes better. <br/><br/>Need some practice on Drop Balls outer part of the plate? <br/><br/>Need some work on Rise Balls up and in? <br/><br/>uHIT Softball’s Train modules walk you step-by-step through the skills you need to succeed at the plate. <br/><br/>Want to get custom training programs? Use in-app purchases to reach the next level!<br/><br/>FREE to download, uHIT Softball gets you started with up to 50 pitches for simulated at-bats. Win more Innings as you improve your skills. And get more pitches in return! In-app purchases can help you keep training when you run out. <br/><br/>Check out the app preview images and videos to see how fun and easy it is to play uHIT Softball. <br/><br/>uHIT Softball features:<br/><br/>•\tInstant feedback on correct and incorrect calls<br/>•\tZone Recognition Training to work outer and inner zones, upper and lower zones<br/>•\tReaction Time Training to recognize fast pitches sooner<br/>•\tChange Pitch Settings to play against lefty and righty pitchers<br/>•\tCustomize uHIT Softball to opposing pitchers and train your eyes in Zone Recognition Training<br/><br/>Visit https://decervo.com/uhitsoftball for more and if you need any help!", "metacritic": null, "released": "2019-04-02", "tba": false, "updated": "2021-03-22T03:16:05", "background_image": "https://media.rawg.io/media/screenshots/b98/b98d22b79749db705f776e1228822e54.jpg", "website": "https://uhit.decervo.com/virtual/softball/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["deCervo"], "genres": ["Simulation", "Sports"], "publishers": ["deCervo"], "esrb_rating": null}