{"id": 339229, "slug": "the-girl-who-sees", "name": "The Girl Who Sees (itch)", "name_original": "The Girl Who Sees (itch)", "description": "<p><strong>Are you ready to uncover the legend?</strong><br/></p>\n<p>This 2D point-and-click PC adventure showcases Filipino history and culture amidst the backdrop of Japanese occupation during World War II. </p>\n<p>A young village girl, Quina (pronounced \"KEE-nah\") Laban, helps a dwarf named Edgar translate a mysterious ancient scroll sought by evil creatures, hoping that uncovering this secret will explain why she suddenly gains the power to see Tagalog words everywhere she turns. The player will embark on quests to help the magical forest, fight mythical creatures of the Philippines, and learn some Tagalog vocabulary.  </p>\n<p><strong>Our primary target audience are ages 13-30. </strong>Game content will contain themes of war that may require parental guidance. </p>\n<strong>ADVENTURE </strong>\n<p>Explore the magical forests of Mindanao as you aid local villagers, resolve disputes between magical creatures, and restore balance between the human and magical realm.</p>\n\n<strong>BATTLE MODE </strong>\n<p>Throughout your quests, you will encounter ancient Filipino magical creatures hindering your way forward. Fight with Edgar and craft potions for the Albularya to gain new special attacks. </p>\n\n<p>*Discovery Mode will not be available until the release of The Girl Who Sees Part II.</p>\n<strong>LANGUAGE LEARNING</strong>\n<p>Collect Tagalog words and build your dictionary to translate a mysterious ancient scroll. </p>\n\n\r\n- FAQs - \n<strong>Why am I paying full price for half of the game?</strong>\n<p>When The Girl Who Sees Part II is released later this summer, the new game version will be uploaded as an update to this same project page. So, those who buy Part I will automatically receive Part II upon its release. </p>\r\nWhat will be in The Girl Who Sees Part II?\r\n\n<ul><li>Chapters 3 and 4 of the story</li><li>Discovery Mode</li><li>More mythical creatures to fight</li><li>Mythical creature special attacks</li></ul>\n<p>More questions, concerns, or comments? Visit us at www.girlwhosees.com and fill out our feedback form. We want to hear from you!</p>", "metacritic": null, "released": "2019-06-30", "tba": false, "updated": "2019-07-05T06:17:05", "background_image": "https://media.rawg.io/media/screenshots/03d/03d7b36cc40d3d72d316e81487b71031.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["The Girl Who Sees by InterIntellectus"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}