{"id": 339387, "slug": "pocket-whiteboard", "name": "Pocket Whiteboard", "name_original": "Pocket Whiteboard", "description": "Whiteboards help imagination and innovation take flight, always. That's what we cannot deny. Just imagine, right at this moment, how many great plans, scientific formulas,  mathematics equations, etc., are currently written on all kinds of whiteboards located all over the world. And for sure some of these great plans, formula, equations are there awaiting to be part of the future revolutions, innovations or great discoveries. <br/><br/>Also, how many kids learn, get inspired or even express everyday through whiteboards.<br/><br/>Who knows what's the magic behind. Be it its simplicity, be it the unique reflection on its glossy surface. The fact is, whiteboards just have the power to keep the world moving.<br/><br/>So we want to bring this Pocket Whiteboard to your innovative and revolutionary iPhone. And to bring you simplicity and inspiration.<br/><br/>FEATURES:<br/>- Save drawings for replay<br/>- Stroke by stroke replay of saved drawing<br/>- Realistic marker and eraser sounds<br/>- Partial erase with eraser<br/>- Virtual reflection<br/>- Save raw drawing as image (i.e. save currently displayed drawing without reflection, markers, frames etc)<br/>- Save multiple boards for replay<br/><br/><br/>Note: <br/>- When you draw on Pocket Whiteboard, make sure you are not touching any part of the iPhone/iPod touchscreen except with the finger you do the drawing.<br/><br/>- Sound Effects can be turned On/Off via \"Settings\" application<br/><br/>- Reflection effects can be turned On/Off via \"Settings\" application<br/><br/><br/><br/>====Join the flickr Group:====<br/>http://flickr.com/groups/cdt-drawings/", "metacritic": null, "released": "2008-12-29", "tba": false, "updated": "2019-07-08T02:35:44", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d0730b45851f6fe9d8709d4a8477cb7.jpg", "website": "http://www.oodot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Y Lau"], "genres": ["Board Games"], "publishers": ["Yin Ki Lau"], "esrb_rating": "Everyone 10+"}