{"id": 339340, "slug": "pony-house", "name": "Pony house", "name_original": "Pony house", "description": "Wow! Welcome to fairy and magic house! Four exciting rooms in the house of little pony will give you a sense of adventure! You will be able to try your hand at repairing, cooking, cleaning, making cakes and sweets, sort products, and of course dress up! Wow, that's fun! <br/><br/>DRESS UP<br/><br/>For a start, wear an apron and chef hat! Big collection of colors and styles will appreciate the true fashionistas! Go to the dressing room and choose your favorite clothes for cute pony in the house! <br/><br/>CLEAN UP<br/><br/>Oops, the bathroom seems like a mess. Help little pony to make a perfect cleaning, wash clothes in the washing machine and wash the floor - hurray get a gift for the job! Clean dirty house and rooms with a sponge, soap, rag and mop! This is the most interesting way to learn how to clean! Put the garbage in the kitchen in the bin and put the food in the fridge! Pony is a real cleanup girl!<br/><br/>FIX IT<br/><br/> Does the kitchen seem to have broken dishes? It does not matter, fix it with girl and quickly repair broken things! The stove needs repair, carefully use tools and fix! Use creativity and logic! Become real master of repair! <br/><br/>COOKING<br/><br/>If you like sweets, delicious juices, cocktails , and cake, then this game will be a real find for you! All the most delicious fruits, cookies, cream, chocolate syrup, vanilla mousse and cream are waiting for you in the kitchen! After you collect six gifts you will be able to prepare a birthday cake for happy pony! Cooking game in the kitchen will be a real exciting journey to the bakery! Cook toast in a toaster, juice in a blender of fruit and milk, and of course you will eat delicious dishes!<br/><br/>GIFTS<br/><br/>Unexpected surprises are waiting for you at each level! Put in surprise room the gifts as you collect and find in the room of surprises! How wonderful it is to have so many toys in the nursery! Put each surprise on the shelves and collect a unique collection for happy pony and friends!<br/><br/>Download now doll house game and learn and play at the same time! <br/>Features of the game<br/>- Huge house adventure<br/>- A lot of magic rooms<br/>- Clean up adventures<br/>- Cooking mini games<br/>- Repair and fixing games<br/>- Your favorite heroes<br/>- Surprises and gifts<br/>- Creativity tasks<br/>- Develop your imagination", "metacritic": null, "released": "2018-04-01", "tba": false, "updated": "2019-09-27T04:21:42", "background_image": "https://media.rawg.io/media/screenshots/589/589a14bb85d0427f487d3609cd149e28_7xQEzRc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vagan Avetisian"], "genres": [], "publishers": ["Vagan Avetisian"], "esrb_rating": null}