{"id": 339360, "slug": "pac-laby-3d-ads", "name": "PAC-LABY 3D ADs", "name_original": "PAC-LABY 3D ADs", "description": "This is the free version of PAC-LABY 3D. <br/><br/>(Free version is unlimited with now 45 random levels, Full version have 45 random levels too but with 18 song/tracks and no ADs, Light version is unlimited too, 45 random levels, one song/track and no ADs too). <br/><br/>PAC-LABY 3D is a simple, fun and very addictive game: the goal is to find all pellets in a maze. <br/><br/>The maze is a ramdom construction and composed of 1 to 3 floors. The maze grows at each level, some pellets give options. <br/>You will appreciate the speed of this 3D game and the difficulty of superposed floors. <br/><br/><br/>- 3D<br/>- Relief &amp; Stereo if you have a 3D stereo device compatible, like Hasbro, HMZ-T1, Side by Side 3D TV, Interlace TV or Lenticular TV/Monitor/Filter<br/>- Multiplayer / Gamekit is used to play against another player for free with your local Wifi network or Bluetooth. <br/>- 18 song tracks will rhythm the game<br/>- Compatible with any iPhone, iPad, iPod, iOS 4.1 minimum. <br/>- The machines iPad1/2/3, iPhone 3G, 4, 4S, 5 and iPod equivalent, will support 60 FPS (frame per second = refresh rate). <br/>- use of the accelerometer (with \"helico\" bonus)<br/>- two play modes for beginner or expert<br/><br/><br/>Have fun like me and them ! thank you in advance for your rate and your note.<br/><br/>Futher informations: www.pac-laby3d.com<br/><br/>\"a noteworthy 3D PacMan game: classic gameplay with intense rock music, challenging but not toughest level mode and support for 2x multiple mode ( play against with another with local Wifi network or Bluetooth ), all of these will bring you a new visual experience, and retrieve a memorable childhood time. In addition, the advantage of the classic game is it is fit for all kinds of people, we bet you will spend a happy and warm time if you play it with your family.  \" --- best10app.com", "metacritic": null, "released": "2012-02-03", "tba": false, "updated": "2019-07-08T02:22:30", "background_image": "https://media.rawg.io/media/screenshots/f6a/f6af915c6ce44b783f523c92f6107b19_bCID01w.jpg", "website": "http://www.pac-laby3d.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SPAC PROD"], "genres": ["Casual", "Puzzle"], "publishers": ["SAVY Pierre-Alain"], "esrb_rating": "Everyone 10+"}