{"id": 339342, "slug": "vampirinas-lollipop-factory", "name": "Vampirinas lollipop factory", "name_original": "Vampirinas lollipop factory", "description": "Have you ever been in a factory for the manufacture of candies? This is a real caramel heaven. Today, the little vampire will spend the day with you. Welcome to Vampirina lollipops factory! What wonderful sweets and desserts, cotton candy, popcorn and of course candy! Family of vampires moved to Pennsylvania and opened a sweet factory! In the kitchen you'll be able to try to cook candy to suit your every taste!<br/><br/>     Banana, coconut, lemon, strawberry and different fruit! Take a bowl, pour water and syrup, stir, pour into molds! Ready! Vamparina have a collection of stickers with monsters, Halloween, masks, teeth, scary spiders and more! Stick a favourite sticker on lollipops and create a masterpiece!<br/>If you love to draw, press the button with the paintbrush and draw smileys and emoticons!<br/><br/>    If you love cheerful colors, change the stick of the lollipop, and at the end you will see a sweet explosion! Just find the button with a bomb and step on it. The candies will fall out of lollipops! It's incredibly fun and addictive game with a vampire and monsters, just download and play without a network connection! Spend time productively, learn to make chocolates, and show your friends! Little wee invites you all to the sweet factory! You'll get a lot of emotions and create your own lollipops!<br/> <br/>    Features of candy games:<br/><br/>Making lollipops and use yummy pieces of fruits<br/>Each candy should be frozen<br/>To cook tasty mixture<br/>Open unique and delicious recipes!<br/><br/><br/><br/>Please write a feedback and we will make the game more cool!", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-09-27T04:21:42", "background_image": "https://media.rawg.io/media/screenshots/085/0852a03143b7cf20209440419ef32079.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vagan Avetisian"], "genres": [], "publishers": ["Vagan Avetisian"], "esrb_rating": null}