{"id": 339391, "slug": "football-helmet-3d-design-your-helmet-decals", "name": "Football Helmet 3D - Design your helmet decals", "name_original": "Football Helmet 3D - Design your helmet decals", "description": "\"Football Helmet 3D\" allows you to design the decals of your own 3D football helmets.  You can even use photos from your photo albums to decorate the 3D helmets.<br/><br/>You can design the decals from the side view of the 3D helmet using photos of, e.g, your favorite sports mascots or drawings of your own. \"Football Helmet 3D\" will automatically mirrors your design to the other side of the 3D helmet.  Furthermore, you can assign different color for the helmet mask and top stripe to match your design.<br/><br/>After applying your design to the 3D helmets, you can touch to rotate and pose your 3D helmets so that you can enjoy or export your 3D masterpiece in virtually any perspective.<br/><br/>And don't forget that with the photo insertion feature, you can definitely decorate your 3D football helmet using drawings you created from any other special doodle apps, namely the must have Glow Doodle!<br/><br/><br/>DESIGN MODE FEATURES:<br/>- Insert photo from Photos Album to compose helmet decals<br/>- Rotate, resize and move the inserted photos<br/>- Sketch with different colors and brush sizes<br/>- Smooth drawing engine<br/>- Pick virtually unlimited number of color using the RGB sliders, or use the 6 default color buttons for instant color access<br/>- Eraser that allows you to erase even part of the inserted photos<br/>- Create, save and load multiple sets of helmet designs<br/><br/><br/>3D MODE FEATURES:<br/>- Insert backdrop photo from your Photos Albums<br/>- Touch to rotate and pose your 3D skateboard<br/>- Super detailed 3D model (even each screw is individually modeled)<br/>- Export the 3D scene to Photo Albums to share", "metacritic": null, "released": "2010-11-30", "tba": false, "updated": "2019-07-08T02:37:11", "background_image": "https://media.rawg.io/media/screenshots/e3d/e3d6f0fef92749e9b26475162c3ca2f5.jpg", "website": "http://www.oodot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Y Lau"], "genres": ["Simulation", "Sports"], "publishers": ["Yin Ki Lau"], "esrb_rating": "Everyone 10+"}