{"id": 339363, "slug": "nifty-lifty", "name": "Nifty Lifty", "name_original": "Nifty Lifty", "description": "Retro Style Game<br/><br/>Nifty Lifty is an old game of the 80s revived and brought to iOS<br/><br/>\"This game has a 80s retro look and feel.\"<br/><br/>Controls are simple...<br/>The player is controlled by a simple a tap of the finger either side of the screen to move left or right.<br/><br/>Just like the original game, once \"Nifty\" is moving he continues until he reaches the other side.<br/><br/>The object is simple but achieving your goal is fiendishly hard! All you have to do is navigate your way from the bottom floor of each level to the top floor. You're on foot though because the lifts have security guards that are on the look out.  After all you are a thief and you need to avoid being spotted by a aecurity guard too many times, if you fail to avoid being spotted too many times you will go to jail and it's Game Over.<br/><br/>You'll need to manoeuvre the thief along a series of floors being sure to avoid getting spotted by any of the security guards in the fast moving lifts as they whizz up and down. As the levels get harder so do the lifts, as they speed up as you progress threw the levels.<br/><br/>Every round has 16 levels, after the 16th level you will progress the the next round were all the levels you have just completed start over again but lifts now moving quicker than before.  Every round the game gets quicker and harder to play.<br/><br/>Enjoy the game!", "metacritic": null, "released": "2014-01-09", "tba": false, "updated": "2019-07-08T02:23:26", "background_image": "https://media.rawg.io/media/screenshots/8b4/8b466bdd8fdccb2c3703bbf2030bac30_bQIjjd0.jpg", "website": "http://www.insoft.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Richard Hughes"], "genres": ["Action", "Casual"], "publishers": ["Richard Hughes"], "esrb_rating": "Everyone 10+"}