{"id": 339361, "slug": "starquake-remake-with-ads", "name": "Starquake: Remake with Ads", "name_original": "Starquake: Remake with Ads", "description": "Welcome to this remake of Starquake<br/>Retro 8/16-Bit Style Graphics.<br/><br/>Gameplay...<br/>The player controls BLOB (Bio-Logically Operated Being), whose mission is to penetrate the unstable core of a rogue planet which has appeared from a black hole. If the core is not repaired within the set time limit it will implode causing a chain reaction which will destroy the entire universe. The planet is inhabited by various primitive creatures, all hazardous to the touch, and the remnants of a previous civilisation which provides the items needed to rebuild and stabilise the planet core.<br/><br/>Transportation<br/>Within the game, there are many ways to get around;<br/><br/>-Running is the default.<br/><br/>-Hover platforms can be used to fly. Items can not be picked up while on a hover platform.<br/><br/>-BLOB can build his own short-lived platforms to reach high places.<br/><br/>-There are also multiple teleport booths scattered around the play area, each with its own destination code.<br/><br/><br/>Inventory<br/>BLOB is able to carry up to four items at once, using a FIFO arrangement. Some of the items encountered will be useful to repair the core, while others will need to be exchanged using a Cheops Pyramid for something more useful. There is also an Access card, which can fill in for any of the numbered chips needed to get through some doors, and for using the aforementioned Pyramid.<br/><br/>Play Area<br/>The game features a large and varied play area, with 512 screens. The placement of the objects, and the identities of those needed to fix the core are randomized at the start of the game.", "metacritic": null, "released": "2018-03-10", "tba": false, "updated": "2019-07-08T02:22:50", "background_image": "https://media.rawg.io/media/screenshots/0df/0df0482f46436ca1cfcacdb0fd95195b_HEzO0QA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Richard Hughes"], "genres": ["Adventure", "Casual"], "publishers": ["Richard Hughes"], "esrb_rating": "Everyone 10+"}