{"id": 339424, "slug": "bus-simulator-2017-city-coach-bus-driving-3d", "name": "bus simulator 2017 - city coach bus driving 3d", "name_original": "bus simulator 2017 - city coach bus driving 3d", "description": "City Bus Driving Simulation is an extended game and a real time experience for those gamers who loved to drive heavy vehicles.  City Bus Pro Driving Simulator free 2017 is an expert bus driving practice and gives amazing experience of driving bus in a modern city. City Bus Pro Driving Simulator is an addictive and challenging bus simulation game.<br/>For proving yourself and to be an expert &amp; professional bus driver, alike free simulator games, pick  the city local passengers carefully from the one bus stop, observe the road sides carefully, pedestrians, vehicles like cars, buses, ambulances etc. and drop them to their destinations in the other parts of the modern city. This is the Best and addictive bus driving game to reach from part to another part into big modern city coach stations.<br/>Drive wisely &amp; carefully and park the bus very precisely in specific parking area on bus station for picking the passengers and tourists.<br/>There are two modes in city bus driving simulator game ,Night mode &amp; Day mode. Both modes have realistic and astonishing graphics<br/>City Bus Pro Driving Simulation game is a new &amp; improved concept to city bus, and coach games. Enjoy realistic, crazy and challenging hot paced driving of real city bus in this modern city &amp; coach bus simulator 2017 with a mixture of bus parking games. Real city, traffic and animations of citizens, adventure game &amp; fun game play make this real city bus driver the best city bus simulator game of 2017. Drive our ultra-fine city bus today.<br/><br/>GAME FEATURES:<br/><br/>•\tAdventurous &amp; exciting multiple challenging levels.<br/>•\tExtreme stunts<br/>•\tStunning HD and Amazing 3D Graphics<br/>•\tDay &amp; Night Mode gameplay<br/>•\tRealistic controls over the city environment<br/>•\tEasy and free to use<br/>•\tOffline Play<br/>•\tAmazing camera view to deliver you realistic bus driving experience<br/>•\tFree to play<br/>•\tExplore the beautiful open world environment<br/>•\tiOS Optimization: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices<br/><br/>This is the game you have been waiting for!<br/>We hope you will like our City Bus Driving Simulator and don’t forget to rate us on iTunes store!", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2019-07-08T02:55:25", "background_image": "https://media.rawg.io/media/screenshots/7c3/7c3e8c4d3170cbe146551b3c3b7a82fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Simulation"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}