{"id": 339422, "slug": "school-bus-driving-2018", "name": "School bus driving 2018", "name_original": "School bus driving 2018", "description": "Did you ever think to drive the gigantic School Bus or Coach? Are you afraid to drive something GREAT like school bus coach or something Big? This game app will allow you to sit tight at the driver’s seat and go around the attractive city locations and have fun. You are not supposed to have a distinctive driving test or license to drive the heavy buses all around the magnificent city. Let’s play and try, who can be a successful driver.<br/>Go ahead towards front seat as the school bus driver, and pick up passenger kids and drop them ahead to their destinations in your school bus. Consider yourself as the crazy school bus driver; in charge of the public bus transport, all you have to do is to give your school kids a safe and sound drive round the city, pick and drop them to their destinations in this bus driver simulator game. You have to avoid the collisions with the traffic vehicles in order to pick and drop the school students safe and sound. Use you controls to stay clear of dangers on the road; these controls include signals, dippers, different camera views and much more. And maybe you like this game so much that you might start applying bus driver license for real. School bus driving simulator is a game for everyone that would like to keep those driving skills up to date, you need to practice everything from parking, reversing and use your mental skills to keep calm.<br/>Are you ready for an enjoyable adventure? Your mission is to safely pick and drop the kids by driving your school bus!!!!<br/>Features of School bus simulator <br/>•\tIt’s absolutely FREE on ios app store !<br/>•\t3D city environment with realistic graphics <br/>•\tRealistic bus driving physics<br/>•\tSmooth controls and fun gameplay<br/>•\tDigital and analog speedometer<br/>•\tCash Animation<br/>•\tRealistic intelligent traffic <br/>•\tExperience the smooth gameplay of this free driving simulator game<br/>•\tDetailed 3d graphics optimized to run smooth on your mobile phone or tablet device<br/>•\tiOS Optimization: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices.", "metacritic": null, "released": "2016-06-07", "tba": false, "updated": "2019-07-08T02:54:36", "background_image": "https://media.rawg.io/media/screenshots/057/0571a577944820944094590c672d015e_xhMG8w6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Simulation"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}