{"id": 33949, "slug": "harrier-jump-jet", "name": "Harrier Jump Jet", "name_original": "Harrier Jump Jet", "description": "Pilot one of the most unique fighter jets ever made in three challenging, “what-if” scenarios. Start each mission with a review of your flight plan, targets, and orders, then select your armaments and jet into intense, realistic combat from either an aircraft or forward air base. <br/>\n<br/>\r\nIn 1992 the team behind Harrier Jump Jet created military scenarios around contemporary global flash points. The result is three fascinating, 10-day campaigns in the Falklands, Hong Kong, and Finland. The Hong Kong campaign pits the RAF’s GR5/7 against a variety of little seen Chinese fighters, including the Jian-6 and Shenyang J-8 “Finback.”<br/>\n<br/>\r\nThe game development team put significant effort into achieving realism, with extra emphasis on modeling the Harrier’s vertical takeoff and landing (VTOL) capabilities. They had working sessions with experienced Harrier combat pilots and engineers at the Royal Airforce Station Wittering (RAF Wittering). RAF Wittering -- known as the “Home of the Harrier” -- is the main operating base and headquarters for the RAF A4 Force.<br/>\n<br/>\r\nIf you are an air combat simulation fan, Harrier Jump Jet should have a place in your collection. Run a few practice missions to get a handle on this unique aircraft, and then push the difficulty level to Elite and get ready for a serious challenge.<br/>\n<br/>\r\nFly an RAF GR5/7 or USMC AV8B Harrier<br/>\r\nThree campaigns: Falkland Islands, Hong Kong, Nordkapp<br/>\r\nDay and night missions<br/>\r\nMultiple levels of difficulty for enemy ground forces and pilots<br/>\r\nMultiple levels of realism for weapons, flying and landing <br/>\r\nSingle-player<br/>\n<br/>\r\nHarrier Jump Jet was first published in 1992 by Microprose, a label well-known for developing combat simulation games.", "metacritic": null, "released": "1992-01-01", "tba": false, "updated": "2023-02-08T10:45:56", "background_image": "https://media.rawg.io/media/screenshots/769/76956962fb1772814b174f966ef32522.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MicroProse Software"], "genres": ["Simulation"], "publishers": ["Atari", "MicroProse"], "esrb_rating": null}