{"id": 339488, "slug": "us-army-survival-training-2018", "name": "US Army survival training 2018", "name_original": "US Army survival training 2018", "description": "US Army survival training 2018 is a fully action packed game with special training to army officers and commanders for facing any extremely challenging conditions. In us army training school game, each mission is fully loaded with challenging hurdles and combat training tools to survive in any circumstance during wars. As for us army military officer you should be capable of survive actively during any crisis or critical strike etc. and it would be possible if you would complete all the pieces of training mandatory for becoming for becoming a part of special operations forces. Its the time be a loyal officer of us and Russian army training schools by becoming the member of army training boot camps and military force.\t  <br/>This is not an ordinary us army commando mission game, you have to play with your life to become the strongest army commando to defeat the world. This us army game is not just about to train with push ups, sit ups, roll over, running or jogging exercises: in fact, this commando adventure game is to train with incredible obstacles which you have never seen before this us army school game. There are a variety of fatal metallic bob pendulums are oscillating if they hit you then you be would die and your army training session will be terminated, you have to restart the game for resuming your free army training course.<br/>You have to prepare yourself for worst scenario of army war, you may have to fight in the hot dangerous deserts or in dense forests, you must always be ready for surviving in any situation. You must learn to follow us army unit rules to avoid any mistake because your one mistake can lead to defeat mission us in the war field. During military training, you would see death very closely while crossing life-threatening obstacles and hurdles which can hit you badly that will make you out of the sense for a while.\t<br/>You have to make yourself hardest us commando of the army by climbing high walls of the net, by jumping from walls and high ropes. You have to jump from rings of fire command war hero of free army games and commando games. You have to cross pips holes very carefully by crouching in them to become the hero in training of army game. In this free army training game, you may also have to save yourself from iron blades and dangerous fences. <br/>Army games free 3d real mission is actually developed for counter-terrorist training for saving your people from terrorists. If you face these difficulties of us army training then you would be able to maintain the peace of your country against the wrong intentions of militants.<br/> Enemies can be found anywhere so you have to prepare yourself for the gorilla war by extreme tough training of wall and rope climbing, passing through sewerage pipes, jumping on metallic drums etc. This army training course would make enough strong and brave that will be absolutely fearless and can fight with any on in any dangerous situation.  <br/>*** Features of US Army survival training 2018 ***<br/>Multiple challenging missions<br/>\t•\tDeadly obstacles<br/>\t•\tRealistic 3D environment<br/>\t•\tMultiple foji characters<br/>\t•\tBreathtaking training courses<br/>\t•\tHighly addictive gameplay<br/>\t•\tTrained yourself as a real cadet<br/>\t•\tHD graphics<br/>Don’t waste your time in searching other us army training school games, just download this and enjoy extreme fun cross obstacles by performing dangerous stunts.", "metacritic": null, "released": "2018-02-07", "tba": false, "updated": "2019-07-08T03:20:54", "background_image": "https://media.rawg.io/media/screenshots/483/483a074ca19b49c3e6ac1dbd92fbdf25_Yd1LS6C.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Action", "Adventure"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}