{"id": 339480, "slug": "real-robots-war-fighting-2018", "name": "Real Robots War Fighting 2018", "name_original": "Real Robots War Fighting 2018", "description": "Real robot war 2018 game is all about robot fighting, war robot game is going to be your love if you are mad about playing robot shooting games on your device. In this futuristic robot game, you are a bot with a highly secret mission, for shooting war robots, you have to go in every part of futuristic sci fi environment for completing the challenging tasks as robot fighter. Always remember that in secret buildings of sci-fi realistic environment, there are always some sniper robots on duty to stop you. Your duty is to stop the monster robot battle by killing all robo and keep moving forward until transformer fight ends and you become among robot fighting champions of iron war.<br/>Shoot your beast enemy's bots and destroy them by hitting fire button and kill all fighting robots. Fire though rocket launchers and keep shooting as fast as you can till ultimate robot fighting come to end. You can also increase your strength and stability by purchasing your Mech robot from robot selection when you have enough in-game cash. Eliminate the future unfriendly robots and turn them into dust and stop the bot fighting to make the world peaceful place to live!<br/>This shooting robot game is full of different challenging missions and enjoys clash of robots in this street fight of steel robots. This grand sci-fi robotic street fight is very addictive among robot fighting games and worth playing that may be engaged you for hours. Great robotic war is going to be held between transformer steel robots and player robot shooter which you would not find in ordinary robot transformer games. Futuristic robots in this war robot game are alien robots, these iron robots came from different planets and they want to capture most modern scientific lab in this robot battle game. You should know that this robotic fight in this shooting robot game is with other robot strike forces that cover fire for destroying the human civilization. You may have tried other robot combat games but this mech robot shooting game is worth playing all robot games. In this robot war game, the enemies are not humans actually these alien transformer robots are from the other galaxy. <br/>You have to shoot maximum iron robots for earning maximum cash which will help you to buy more powerful robots. You need to focus on crossfire for shooting the grand enemy robots in this robot fighting games. Robots War Fighting 2 - World Battle machines transformer simulation game will give you challenging competition among the villain robots in this robot fighting game. <br/><br/>****Features of Real Robots War Fighting 2018 ****<br/><br/>• Highly Challenging and addictive missions<br/>• Futuristic and sci fi 3D environment<br/>• Kill the robot enemies coming your way<br/>• Multiple shooter robots with latest weapon system<br/>• Earn score for purchasing more equipped robots<br/>• Smooth shooting and moving controls<br/>• Offline gameplay<br/>• Realistic physics controls<br/>• Highly optimized 3D models and graphics<br/>• HD Graphics and 3D environment<br/>• Amusing sounds<br/><br/>Just download this game and enjoy extreme fun of shooting robots with your latest weapon system.", "metacritic": null, "released": "2017-12-07", "tba": false, "updated": "2019-07-08T03:17:34", "background_image": "https://media.rawg.io/media/screenshots/784/7846e76aeafd5bee1c66a4d3eff0f42d_QMwh6Nt.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Action"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Teen"}