{"id": 339492, "slug": "real-crazy-taxi-driver-3d-simulator-free-2016-driv", "name": "Real Crazy taxi driver 3D simulator free 2016: Drive sports cab in modern city", "name_original": "Real Crazy taxi driver 3D simulator free 2016: Drive sports cab in modern city", "description": "Real Crazy taxi driver 3D simulator free 2016: Drive sports cab in modern city<br/>Have you ever experience taxi driving on the busy roads of extreme big modern city? NO? Then Get ready for the experience of wildest driving adventure in Modern city!<br/>Dear Taxi simulation fellows, Real Crazy taxi driver 3D simulator offers you to play the most exciting and thrilling taxi driving in busy roads of Modern city. You need to be drive fast but wisely. Taxi driving gets more exciting and crazy with all new features and updated all new fantastic and super cool models of luxurious Taxi that will help you to comfort while drive the real taxi. Drive taxi on the busy city roads and experience a impressive and outstanding 3D view of big modern city 3D environment. The passengers are waiting for you at different spots of big modern city, SO Rush fast!!!<br/>In Modern city roads you should have fully command on your taxi car. In Real Crazy taxi driver 3D driving simulation you have to pick n drop the passengers from one stop to another. Mostly Passengers want to reach their target points on time you have to drive fast n furious in busy city roads. Don’t hit other traffic cars and reach their target points by using the various controls and driving settings. <br/>Various interesting stages make this game more super cool. Splendid Luxurious taxi vehicles and detailed 3D surroundings make you feel like the master of your skill. Enjoy easy n smooth controls and gameplay while drive Taxi simulator through the modern city.<br/><br/>** Real Crazy taxi driver 3D simulator free **<br/>•\tMultiple challenging levels <br/>•\tRealistic 3D Detailed Environment<br/>•\tAwesome gameplay<br/>•\tThrilling Precision Taxi Driving Experience<br/>•\tRealistic Animated Passengers<br/>•\tMarvelous eye catching Graphics<br/>•\tSmooth and easy controls<br/>•\tAmazing  game sounds<br/>•\tCar skid effects while driving the taxi<br/>•\tExciting taxi driving missions<br/>•\tAmazing camera view to deliver you realistic sports taxi car experience", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2019-07-08T03:22:40", "background_image": "https://media.rawg.io/media/screenshots/a0e/a0ee8c64458dd6cbde7c3660e49113db_ZRMkKW0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Simulation"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}