{"id": 339406, "slug": "fix-my-car-muscle-restoration", "name": "Fix My Car: Muscle Restoration", "name_original": "Fix My Car: Muscle Restoration", "description": "Completely tear down, rebuild, and restore your newly gifted car into a beautiful and powerful work of art! Find tools and parts, remove old parts, tear out the engine, sand the paint down to metal, then build it all back up again! Apply your awesome mechanic skills, fix car problems, upgrade your ride, and detail it until it's better than new! It's all up you and your special friend to get this project done!<br/><br/>* This is the FULL version of the game. You get absolutely everything unlocked upfront with NO ads or IAP! *<br/><br/>It's your birthday and you've just been gifted an old muscle car! The car left to you is a total disaster, but that doesn't mean you can't turn it into something great! The nearby school has equipment to help, and you have an unmatched ability to find the special parts that will transform this car into something really cool. You won't be working alone either - your friend from next door has offered to help, and she knows cars! Working on a car from the ground up will be difficult but she will give you her full support to get the job done!<br/><br/>This awesome new mechanic simulator by FireRabbit has a lot to offer! Adventure and explore new environments, find cool parts and tools, and perform all kinds of mods! Objectives range from routine maintenance to eye-popping horsepower and cosmetic upgrades. What are you waiting for? Get out there and get the project done, your car won't build itself!<br/><br/>FEATURES:<br/><br/>+ 97 objectives and upgrades to complete!<br/><br/>+ Dozens of tools and cool after-market parts to find and install! <br/><br/>+ Perform dozens of jobs ranging from basic routine maintenance to outrageous performance mods! <br/><br/>+ Explore cool environments!<br/><br/>+ Built-in hint system so you never get stuck! <br/><br/>+ All hints and objectives available in FULL version, LITE version requires unlocking with reward videos or a one-time in app purchase<br/><br/>DETAILS:<br/><br/>See this game and more at: https://firerabbit.com/<br/><br/>Come talk with us on our page at: https://www.facebook.com/firerabbit.canada<br/><br/>Hit us up on Twitter at: https://twitter.com/firerabbit_inc", "metacritic": null, "released": "2019-07-04", "tba": false, "updated": "2019-07-30T11:59:18", "background_image": "https://media.rawg.io/media/screenshots/f4f/f4f9b16679aa80cb5595b697d546f678_wdleOi1.jpg", "website": "https://www.firerabbit.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FireRabbit"], "genres": ["Simulation", "Racing"], "publishers": ["FireRabbit"], "esrb_rating": null}