{"id": 339487, "slug": "china-bus-driving-elevated-bus-mania-2017", "name": "China bus driving - elevated bus mania 2017", "name_original": "China bus driving - elevated bus mania 2017", "description": "Elevated city bus driving 3D-bus parking game<br/><br/>You might have fed up by playing the traditional bus driving games. Here we bring a new and unique vehicle which you have never tried before, so let’s drive one of the world’s best, 1st realistic and modern elevated bus to make your conveyance easy. Get yourself ready to ride on the latest elevated bus in busy roads of the city without disturbing other traffic vehicles that includes cars, buses and coaches. Your duty is to pick up the passengers from metro or bus stations and drop them to their destination elevated bus stations. Try your latest elevated bus; drive freely in the modern city without worrying about the traffic and feel like flying in the air ship. It is the new modern generation idea for transporting the passengers and tourists. You are required to expertise driving skills for driving this latest purposed build elevated bus. <br/><br/>This transit elevated bus is a latest, unique idea with smooth controls above the different traffic vehicles. This is the first ever unique bus model proposed by the Chines automobile engineers. This transit elevated bus has a pre-defined route and path, and its passenger’s compartment spans the width of both traffic lanes. By using this transit elevated bus you can travel around the city freely over the other traffic vehicles. This transit elevated bus has electrically powered technology which causes no pollution like other long vehicles or bus coaches.<br/><br/>Pick passengers in bulk, drive over the traffic vehicles, drive towards destination elevated bus stations and park precisely, your speed must be below 60 KMPH while parking. Get experience of the wonderful drive of huge and gigantic elevated bus. This is the outstanding and next generation elevated bus and much better than the other double decker bus and coaches. The main advantage of the elevated bus is that the other traffic vehicles will not be affected. <br/>Controls are very realistic, easy and use latest electric technology. Different camera angles help to view the elevated bus and realistic 3D environment. This elevated bus has capacity to carry hundreds of passengers and tourists at one time.<br/>Features of “Elevated City Bus Driving“<br/>•\tRealistic 3D Detailed Environment<br/>•\tAdventurous &amp; exciting multiple challenging levels<br/>•\tAwesome gameplay<br/>•\tExtreme Driving Experience<br/>•\tRealistic Animated Passengers<br/>•\tMarvelous and eye catching HD Graphics<br/>•\tSmooth and easy controls<br/>•\tAmazing  game sounds<br/>•\tDay Mode gameplay<br/>•\tRealistic controls over the modern city environment<br/>•\tEasy and free to play<br/>•\tOffline Game Play<br/>•\tAmazing camera views to deliver you realistic bus driving experience<br/>•\tiOS Optimization: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices<br/><br/>Don’t waste your time in searching other games, download it now and enjoy the new and unique driving experience of elevated bus…….", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-07-08T03:20:28", "background_image": "https://media.rawg.io/media/screenshots/774/77480f1a3934730b02faa990013ce975_rXQCvnA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Simulation"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}