{"id": 339483, "slug": "offroad-bicycle-rider-uphill-mountain-bmx-rider", "name": "Offroad bicycle rider - uphill mountain BMX rider", "name_original": "Offroad bicycle rider - uphill mountain BMX rider", "description": "Try Offroad bicycle rider game, its one of the best extreme offroacd bicycle racing and bicycle stunt game on iTune Store. Uphill offfroad Bicycle rider game is for the gamers who love to ride the offroad cycle stunt race game. Boost your skills by riding the amazing offroad bicycle in uphill offroad mountain environment. Use your offroad riding skills which are necessary in cycling game and be the real legend of uphill bicycle rider game.<br/><br/>Get the experience of cycle riding and perform extra-ordinary stunts with free downhill off road cycle race in minimum time. Offroad bicycle rider is a tremendous and exciting cycling game in downhill supreme mountainous environment. Keep Following the arrow directing towards animated checkpoints for achieving the finish point and unlock the next stage of deadly offroad BMX cycle riding game. In uphill offroad best biking game, there are various stages for riding and wander around the exciting downhill mountains and uphill off road pathways. Ride the heavy bicycle carefully and avoid hitting the mountain edges and other hurdles if you crash bike by hitting anything then will lose the game. <br/><br/>In downhill supreme Offroad Bicycle Rider game you have to ride your BMX cycle on uphill mountains consists of beautiful valley, green meadows, attractive and worth seeing lakes and much more. In off road bicycle racing game you have to ride the bicycle as trained bicycle racer and rider. Enjoy offroad BMX cycle racing game in beautiful natural environment with amusing sound and effects. <br/><br/><br/>Get your offroad Bicycle Riding Racer app, it is one of the best ultimate bicycle riding game on store. If you interested in riding the cycle then this BMX cycle stunt race game is made only for you. <br/>In this game you have to earn maximum cash by completing the challenging levels. Once you have enough cash then you can unlock more experienced and professional bicycle riders for riding on curvy and life taking offroad tracks<br/>Features<br/>•\tChallenging and highly addictive missions<br/>•\tAll bicycle controls i.e steering, tilt and handle controls<br/>•\tEarn money as much as you can <br/>•\tDetailed Animated bicycle racers<br/>•\tOffline gameplay<br/>•\tRealistic physics controls<br/>•\tHD Graphics <br/>•\tHighly optimized 3D models and graphics<br/>•\tAmusing sounds<br/>•\tAnimated animals<br/>•\tHighly optimized beautiful and realistic green hilly environment<br/><br/>Go and get a super fast offroad bicycle to reach your destination. Don’t be late, race around the big uphill environment and complete challenging missions on time. Find the best route by following check points and save costly time. Just download it and enjoy the thrill of offroad bicycle riding!!!!!", "metacritic": null, "released": "2017-03-16", "tba": false, "updated": "2019-07-08T03:18:51", "background_image": "https://media.rawg.io/media/screenshots/bd1/bd138e51783405f051a07d9daa1b7381_EIU1v6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Simulation"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}