{"id": 339427, "slug": "flying-school-bus-simulator-3d-free-school-kids", "name": "Flying School bus simulator 3D free - school kids", "name_original": "Flying School bus simulator 3D free - school kids", "description": "Flying School bus simulator 3D free: pick the school kids and fly bus to the school<br/>Welcome to the next generation of Flying School Bus Simulator game!<br/>Have you ever heard about flying buses? OR about flying school bus to pick and drop the school kids in real time? Yes that’s the future, but it’s come true now in this flying bus simulation game. The most realistic flying bus simulator game is here! It’s all about to the newest and most realistic flying school bus game ever! Your task is to fly the bus towards school kids, pick them and again fly the bus towards their school safely. You have to fly the school bus in beautiful realistic city. You have to avoid collisions with skyscrapers; if you hit any building you will lose the game. So fly carefully and precisely like an expert pilot.<br/>If you like airplane and flight games then this will be the best experience for you.<br/>Let’s begin your flying bus simulator game career today.<br/>Features of flying School bus simulator <br/>•\tIt’s absolutely FREE on ios app store !<br/>•\t3D city environment with realistic graphics <br/>•\tRealistic flying bus  physics<br/>•\tSmooth controls and fun gameplay<br/>•\tCash Animation<br/>•\tExperience the smooth gameplay of this free flying simulator game<br/>•\tDetailed 3D graphics optimized to run smooth on your mobile phone or tablet device<br/>•\tiOS Optimization: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices.", "metacritic": null, "released": "2016-06-21", "tba": false, "updated": "2019-07-08T02:56:45", "background_image": "https://media.rawg.io/media/screenshots/968/9683b6467ed4497c8c5c005b2ace1ca8_n3aqRkH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manzoor Ahmad"], "genres": ["Simulation"], "publishers": ["Manzoor Ahmad"], "esrb_rating": "Everyone 10+"}