{"id": 339695, "slug": "tfg-prototype", "name": "TFG [prototype]", "name_original": "TFG [prototype]", "description": "<ul><li>created by: phobos2077</li><li>version: pp1a</li><li>made between 2018 and 2019</li><li>engine: Unity</li></ul>\r\n\r\nPREFACE\r\n<p>This is a game prototype I've made with the main goal to learn Unity game engine. I didn't have any grand vision or a concept for this game, except that I knew I wanted to make a top-down shooter with mouse aiming. When I came up with the idea to make a Battle City throwback the original plan was to make a very simple 3-level prototype with level style and gameplay close to the original game. I planned to finish it by September 2018... Well, that didn't happen. After 6 month hiatus I finally picked it up and gragged it to it's current state.</p>\n<p>My current goal is to gather some feedback while I take a step back and re-evaluate the whole concept (hence the \"prototype\" status). I have a few possible directions for this game in mind, possibly abandoning the whole \"Tanks\" thing and just using the knowledge, code and assets gained for the next project.</p>\r\n\r\nDESCRIPTION\r\n<p>The game has 6 levels with a bit of variety in terms of objectives. There are 3 difficulty levels you can choose (though they don't change much, were added at the last moment to make the game more accessible). There is a movement style option in the Settings to use more \"traditional\" control scheme (Up is North instead of Forward) though I recommend giving the default scheme a shot as it gives you more precision.</p>\n<p>If you lose all your lives - you will be thrown back to the main menu. However, there is a Level Select option for those who want to replay from a certain level. You have to beat a previous level to unlock the next one in this menu.</p>\r\n\r\nSYSTEM REQUIREMENTS\r\n<p>- Enough disk space for the unpacked game.<br/>- Video card with Shader Model 3 support (for AO).<br/>- Keyboard and a mouse.</p>\r\n\r\nHOW TO PLAY\r\n<p>Move with W, S, A, D. There are 2 movement schemes available:<br/>- Tank controls (default)<br/>- Modern controls (see in-game settings)</p>\n<p>Aim with mouse (turret will aim at the cursor position). Fire Cannon = Left Mouse Button.<br/>Use Item - Right Mouse Button.</p>\n<p>There are two types of items available atm:<br/>- Guided missiles (Key - 1): you have to hover mouse cursor over an enemy for half a second to lock on before you can fire.<br/>- Land mines (Key - 2): they are placed at the current position of the tank.</p>\n<p>Inventory contents can be seen on the right side of the screen. Currently selected item type will have a bigger icons.<br/>To switch between inventory items press the appropriate number key for each item type (see above).</p>\n<p>To win you have to complete all objectives listed in the top-right corner of the screen.<br/></p>", "metacritic": null, "released": "2019-07-06", "tba": false, "updated": "2019-07-08T04:18:44", "background_image": "https://media.rawg.io/media/screenshots/7e0/7e0b8ad1332aef2ff149eb3d9a831f44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["phobos2077"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}