{"id": 339627, "slug": "enigmatic-influence", "name": "Enigmatic Influence", "name_original": "Enigmatic Influence", "description": "<p>Made for the 2019 TasGDS game jam: 'calm'<br/></p>\n<p>The game is complicated, with lots of events happening per keyboard input, but you might be able to figure it out!</p>\n<p>WASD to move, R to reset/clear the board.</p>\n<p>Recommended Course of Inquiry:<br/></p>\n<ol><li>How many kinds of item can be created/held?</li><li>Which combinations of items can be held simultaneously?</li><li>How do you sustainably collect one kind of dot without collecting the other?</li><li>How far can you tip the balance of dots on the screen?</li><li>How high can the bright red line go?</li></ol>\n<p>The game is implemented in Rust using the Vulkano library for high level vulkan bindings.</p>\n<p>The original idea was to have some of the emotion-management aspects of Cultist Simulator, (the game you _should_ be playing instead of this one) though I originally expected to have a large variety of resource types, and hoped the game would flow between calm (as per the jam theme) and tense uncertainty as your needs fluctuated.</p>\n<p>The first two resources I added turned into their own elegantly simple game though, and watching your influence over the board slowly change as you persistently navigate it turned out to be far more calming than anything I could have intentionally made, so that ended up being the game I presented, and am submitting.<br/></p>", "metacritic": null, "released": "2019-07-07", "tba": false, "updated": "2019-07-08T03:59:15", "background_image": "https://media.rawg.io/media/screenshots/130/130b2f5dccc8e583c0425c6d750bf856.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Spivee"], "genres": [], "publishers": [], "esrb_rating": null}