{"id": 339782, "slug": "ghost-ranch", "name": "Ghost Ranch", "name_original": "Ghost Ranch", "description": "<p>This game requires a gamepad to play. Sorry, due to time restraints I only had time for one control method. The game works best with an Xbox 360/Xbox One Gamepad.</p>\n<p>Game only available for Windows. Sorry. Again just due to time restraints. Works on 64 and 32 bit.</p>\n<p>_____________________________________________________________________________________________</p>\n<p>Help ElJay and Niknak save thier ranch from two great beasts poisoning the land. This was created with Vile Ingredients for the Glinny's Cauldron Game Jam.</p>\n<p>Vile Ingredients used: </p>\n<p>- You have a 1% chance to not be able to double jum<br/></p>\n<p>- Instant death from touching the SIDE of a spike. Not the dangerous points, but the side of the spikes.<br/></p>\n<p>- Every loading screen is a bright blank white screen.<br/></p>\n<p>- The final boss of the game is a character first introduced directly prior to the final boss fight.<br/></p>\n<p>- The game's soundtrack was written by Nobuo Uematsu, but performed by 4th graders with recorders.</p>\n<p>- Spells that inflict status effects  virtually never work on bosses. (Partially)<br/></p>\n<p>- The first waterfall you discover has a secret cave, but the following 23 do not. (Partially)</p>\n<p>- Customizable hairstyle but every selection clips through your weapon and armor. (Partially)<br/></p>\n<p>SLOGAN: Get ready to explode your balls into a firestorm of dust and skeletons.<br/></p>\n<p>CELEBRITY LIKENESS: Justin Bieber as \"Squeelin\" Shay Higgins (Partially)</p>\n<p>Other Ingredients:</p>\n<p>Surprise level up mechanics. You don't decide what levels up. When you reach a \"Level up surprise\" machine its is random what stats are leveled up.</p>\n<p>Pressing \"Back/Select\" button minimises the game window</p>\n<p>Terribly abrupt ending.</p>\n<p>Awkward time to read the story intro. </p>\n<p>A Day and Night cycle that has no effect on the game at all.</p>", "metacritic": null, "released": "2019-07-06", "tba": false, "updated": "2019-07-08T04:46:44", "background_image": "https://media.rawg.io/media/screenshots/af7/af73434bc2470b7b725c1e815fa3cd57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GGladam"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}