{"id": 339997, "slug": "super-pixel-color-by-number-2", "name": "Super Pixel: Color by Number", "name_original": "Super Pixel: Color by Number", "description": "Get rid of your stress and have lots of fun! Super Pixel: Color by Number provides you with dozens of creative 2D and 3D pixel artwork. Not enough? Pick a photo from your gallery and create your own pixel art! Proudly presented by Lyrebird Studio, developer of top-downloaded photo editing apps!<br/><br/>Top Features:<br/>- Choose among various categories; from animals to foods, birds to spaceships, etc.<br/>- New creative content every week! Color amazing 3D figures and 2D patterns!<br/>- Upload your own pictures, turn them into pixel artwork and color!<br/>- Take photos with Pixel Art Camera and paint them on Sandbox platform!<br/>- Simple patterns and models that will reveal the artist in your kids!<br/>- Complex patterns and models that will boost your creativity!<br/>- Use Bomb to color neighboring cells of any numbers!<br/>- Use Magic Wand to color neighboring cells of the same number!<br/>- Save and edit past work!<br/>- Make timelapse videos of your artwork!<br/>- Choose and apply different shapes for pixels and filters for timelapse videos!<br/>- Download &amp; Share your artwork and timelapse videos with your friends or on social media with just a single tap!<br/>- Player-favorite Pixel Art Color by Number game!<br/><br/>Enjoy and relax!<br/><br/>Subscription: <br/>“Monthly” and “Yearly” subscriptions enable users to use our app ads-free, access all the content and use unlimited import. The duration of “Monthly” subscription is 1 month and the duration of “Yearly” subscription is 1 year. The payments are to be charged to your iTunes Account at confirmation of purchase. The subscriptions automatically renew unless you turn off auto-renewal at least 24 hours before the end of the current period. Subscription can be managed by you and you can turn off auto-renewal through your Account Setting after your purchase. We offer 3 days of free trial for “Monthly” subscription and no free trial for “Yearly” subscription. If you have an unused portion of your free trial period, that portion will be forfeited when you purchase a subscription.<br/><br/>Privacy Policy: https://lyrebird.studio/pp_apple.html<br/><br/>End User License Agreement: https://lyrebird.studio/eula.html", "metacritic": null, "released": "2019-01-26", "tba": false, "updated": "2019-07-12T02:00:14", "background_image": "https://media.rawg.io/media/screenshots/2d2/2d2c6b05107dd6e18d607789afb6e673.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lyrebird Studio"], "genres": ["Simulation", "Family"], "publishers": ["LYREBIRD STUDIO FZE"], "esrb_rating": "Everyone 10+"}