{"id": 3399, "slug": "alter-echo", "name": "Alter Echo", "name_original": "Alter Echo", "description": "<p>In the future, the most powerful substance ever made can control time and physics. Only a chosen few can control it. But only one can save us from it. You are the one. You are Nevin and you&#39;re armed with the most radical weapon ever. It&#39;s a shape-shifting PolySuit, and it can even stop time itself. You&#39;re armed and you&#39;re dangerous. But you&#39;re going to need every advantage you can get, because you&#39;re fighting across Proteus, a planet whose very surface is alive - and it&#39;s controlled by Paavo, an evil mastermind who seeks to annihilate you. Languages: English, French, German<br />\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.<br />\nThis item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated systems associated with this Sony Entertainment Network Account. Please see software description for device compatibility.</p>", "metacritic": null, "released": "2015-03-17", "tba": false, "updated": "2019-08-02T16:24:40", "background_image": "https://media.rawg.io/media/games/b8a/b8a581108adf1163568ba2368447eb3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3", "Xbox", "PlayStation 2"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}