{"id": 339962, "slug": "dont-even-think", "name": "DON'T EVEN THINK", "name_original": "DON'T EVEN THINK", "description": "Don’t Even Think is an asymmetric PvP survival game.<br/>The game gives the battle royale genre a different concept. During an intense battle, fighting alone will not be a wise decision. When the time is right, you might get an unexpected result by cooperating with other players. Collect information, analyze the information, and make your strategy work will be the key to your victory.<br/>Humans need to find weapons and ammo during the cold night. They need to collect the resources and keep themselves warm while looking for the information that will help them escape. By boarding the plane by the dawn, the humans will claim the victory.<br/>Werewolves need to find rotten bodies and drink their blood to acquire powerful abilities. They need to locate the humans by the light and smoke, hunting them down when the time is right. By eliminating the humans and stop them from escaping, werewolves will be able to claim the victory. <br/><br/>Online features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/><br/>Network Players 2-27<br/>DUALSHOCK®4<br/>Online Play (Required)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>", "metacritic": null, "released": "2019-07-10", "tba": false, "updated": "2022-10-18T20:00:46", "background_image": "https://media.rawg.io/media/screenshots/f95/f95074878aa32fba9e77b9aba6c9fe48.jpg", "website": "", "rating": 2.25, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 96, "toplay": 2, "dropped": 10, "playing": 2}, "playtime": 0, "achievements_count": 114, "ratings_count": 15, "suggestions_count": 567, "game_series_count": 0, "reviews_count": 16, "platforms": ["PlayStation 4"], "developers": ["Beijing Perfect World Software Technology Development Co"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": "Teen"}