{"id": 34, "slug": "crash-bandicoot-n-sane-trilogy", "name": "Crash Bandicoot N. Sane Trilogy", "name_original": "Crash Bandicoot N. Sane Trilogy", "description": "<p>Your favorite marsupial, Crash Bandicoot™, is back! He’s enhanced, entranced and ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before. Spin, jump, wump and repeat as you take on the epic challenges and adventures through the three games that started it all, Crash Bandicoot™, Crash Bandicoot™ 2: Cortex Strikes Back and Crash Bandicoot™ 3: Warped. Relive all your favorite Crash moments in their fully-remastered graphical glory and get ready to put some UMPH in your WUMP!Crash Bandicoot™ N. Sane Trilogy Stormy Ascent Level<br />\nExperience the notorious Stormy Ascent level from the original Crash Bandicoot game. Previously unfinished and unreleased, this level will challenge even the most hardcore of Crash fans! Do you have what it takes to tackle the fast retracting steps, vial throwing lab assistants, flying birds, moving platforms and iron spikes?Crash Bandicoot N. Sane Trilogy Future Tense Level<br />\nPlay the first-ever NEW level built for the original trilogy’s gameplay in almost 20 years. Drawing inspiration from the cut “Waterfall Level” from the first Crash Bandicoot game, Future Tense features several puzzles from the original level set in the futuristic setting from Crash Bandicoot 3: Warped. Discover a whole new level of difficulty for Crash Bandicoot N. Sane Trilogy as you dodge rockets, destroy robots and leaps lasers while ascending a massive futuristic skyscraper.</p>", "metacritic": 81, "released": "2017-06-30", "tba": false, "updated": "2024-04-18T14:02:45", "background_image": "https://media.rawg.io/media/games/444/4440f674e2bcb257e249a9ab595d8ab6.jpg", "website": "https://www.crashbandicoot.com/", "rating": 4.13, "rating_top": 4, "added_by_status": {"yet": 284, "owned": 3286, "beaten": 385, "toplay": 222, "dropped": 285, "playing": 148}, "playtime": 4, "achievements_count": 204, "ratings_count": 607, "suggestions_count": 543, "game_series_count": 0, "reviews_count": 624, "platforms": ["PC", "Nintendo Switch", "PlayStation 4", "Xbox One"], "developers": ["Activision", "Vicarious Visions", "Toys for Bob", "Iron Galaxy"], "genres": ["Action", "Platformer"], "publishers": ["Activison"], "esrb_rating": "Everyone 10+"}