{"id": 340012, "slug": "love-story-draw-physics-line", "name": "Love Story: Draw Physics Line", "name_original": "Love Story: Draw Physics Line", "description": "▼ STORY<br/>The plot of the game is about the journey to find the love of two balls.<br/>Pass through 5 chapters to explore the meaning story.<br/>◆CHAPTER 1: HEAL<br/>◆CHAPTER 2: PROTECTION<br/>◆CHAPTER 3: INFATUATED<br/>◆CHAPTER 4: DESTINY<br/>◆CHAPTER 5: HAPPY<br/><br/><br/>▼ THE RULES ARE SIMPLE!<br/><br/>◆ Heal the broken heart by controlling two balls.<br/>Draw lines and shapes freely to move and roll the balls.<br/>Controls 2 balls to touch the heart.<br/>Flexible thinking is going to become the key to victory.<br/><br/>◆ Share the moment of victory <br/>You can review the moment you cleared a stage on picture screenshoot.<br/>Share it on Facebook to show off your superior skills to your friends.<br/>Not to mention that watching your friends’ gameplay might also become a hint!?<br/><br/>◆ Let's collect pens, ink, background, skins<br/>Starting off with a simple pen, moving onto color pen, crayons and so on.<br/>We have prepared more than 8 varieties of pens of different colors and sizes.<br/>Collect various pens and walk through the stages.<br/><br/>◆ Your brain abilities will be tested<br/>This game, continuing after Brain Wars, also tests your logical thinking and the flexibility of your mind.<br/>As this game includes the elements of riddle and “Escape the Room” type of games, we would recommend Love Story to people who enjoy brain-type puzzles, cards and strategy games.<br/>It might also have an impact on your children’s intellectual growth and preventing brain deterioration?<br/><br/>▼FEATURES<br/><br/>* Free to play, play it anywhere anytime<br/>* Suitable for all ages<br/>* Draw love story<br/>* Simple rules but a little difficult to clear the level, you'll find the addiction.<br/>* You can also enjoy the fun of collecting pens, ink, skins, background.<br/>* Now try to get a higher score and share it with your friends!<br/>* 500+ stage interesting<br/>* Interesting and deep story<br/>* 5 chapter <br/>* Each chapter brings you interesting love stories<br/>* 8 Skins<br/>* 8 pen<br/>* 7 ink vials with special effects<br/><br/>Download 'LOVE STORY : DRAW PHYSICS LINE' for free and share your relaxing moment with friends  now!", "metacritic": null, "released": "2018-12-29", "tba": false, "updated": "2019-07-29T17:41:36", "background_image": "https://media.rawg.io/media/screenshots/994/9949df730adb75256b9dc540b301e876_vy3qQaq.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tien Tran"], "genres": ["Casual", "Puzzle"], "publishers": ["Tien Tran"], "esrb_rating": null}