{"id": 340148, "slug": "axhel-a-fun-puzzle-game", "name": "AXhel – A Fun Puzzle Game", "name_original": "AXhel – A Fun Puzzle Game", "description": "AXhel is an original, easy, funny and frenetic puzzle game that will put to the test your neurons, visual memory, reflexes, logic and ability skills.<br/><br/>If you like puzzle games you will surely adore AXhel. But beware, once you start playing you may never want to stop!<br/><br/>The goal of the game is simple: to survive as long as possible and obtain the highest score. Remove the tiles from the game field and prevent it from being full filled. Use the Special Weapons when needed. In AXhel it’s not enough to be as fast as possible with your fingers... you also need a strategy to use your fingers as fast as possible...<br/><br/>Some features:<br/>* expressly and exclusively designed for Apple’s platforms (Mac, iPad and iPhone);<br/>* 8 original sets of tiles;<br/>* three different difficulty levels. And a \"relax mode\" option…<br/>* gameplay that rewards strategy as well as speed;<br/>* original \"clockwise spiral-shaped\" pattern algorithm for adding new coloured tiles and original “centrifugal force” pattern algorithm for compacting the game field when tiles are removed;<br/>* six different special weapons. The difficulty level tunes the frequency of generation for weapons;<br/>* playable for everybody and anybody!<br/>* it's fun for all ages!<br/><br/><br/>**** If you like puzzle game download AXhel now... don't miss it! ****<br/><br/><br/>Thanks for using our products. Feedback is always welcome to: support@dighentis.com<br/>App Store reviews are greatly appreciated, thank you.", "metacritic": null, "released": "2012-07-02", "tba": false, "updated": "2019-07-30T05:36:41", "background_image": "https://media.rawg.io/media/screenshots/80b/80b42b4289151bdf95606cbdf443b3d8.jpg", "website": "http://www.dighentis.com/applications.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Alessandro Benedettini"], "genres": ["Board Games", "Puzzle"], "publishers": ["Alessandro Benedettini"], "esrb_rating": null}