{"id": 340133, "slug": "sniper-nailed-shoot-hit", "name": "Sniper Nailed Shoot Hit", "name_original": "Sniper Nailed Shoot Hit", "description": "Get ready for sniper shooting experience in realistic city environment with deadly sniper shooters. It is first person sniper shooting game, where you have multiple critical levels. Every challenging mission gives you an exhilarating shooting experience.Modern sniper shooter in every sense, Sniper takes you on a cyclone tour of the criminal city. Pick up the sniper, boil your blood, Hold your breath and pull the trigger up and kill the entire terrorist in city. Play as professional sniper shooter in this assassin sniper shooting game. You are real modern sniper shooter ready to play in thrilling dangerous attacks and assassin missions.<br/><br/>The city has many terrorist and they walk on road and terrace of buildings. These terrorist are dangerous for your city so; you need to use your professional sniper shooting skills to shoot and kill whole terrorist. Use your limited ammo and shoot the insane terrorist from distance. Aim to head-shot for preserve your ammo and earn double cash as a reward. You can use your rewarded money to upgrade your sniper guns. Find the terrorist in city and shoot them in specific time to complete your mission. Before your shooting a bullet verify that your target is really terrorist or not. Because there are many civilians in the city roads and the terrorist are ambushing themselves among civilians. Shoot and kill the entire terrorist around your city and safe your country from terrorism.<br/><br/>This game equipped realistic 3D graphics and sound effects that will give you an amazing thrill shooting experience. This is best time to check and show your thrilling sniper shooting skills. This game allows you very realistic control of sniper guns and two modern sniper guns, that will give you thrill shooting experience and several hours of game-play. Do not hesitate to experience the animation of this sniper shooting game and passionate sniper.<br/><br/>Game Features:<br/>- Realistic 3D city Environment<br/>- Very smooth control of sniper guns<br/>- Improve your skills and accomplish critical levels<br/>- Addicting FPS game-play<br/>- Two lethal sniper guns<br/>- Multiple thrilling missions for your enjoyment", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-09-06T03:19:07", "background_image": "https://media.rawg.io/media/screenshots/9da/9dadaafc886dce6a77e7bc7d002713d6_gPrnID7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Action", "Adventure"], "publishers": ["Mindsol Studio"], "esrb_rating": null}