{"id": 340123, "slug": "sniper-target-shooting-mission", "name": "Sniper Target Shooting Mission", "name_original": "Sniper Target Shooting Mission", "description": "In this Sniper Target Shooting Mission game there is special task force, which is army commando. You would be given a commando mission or a sniper mission, this mission is to eliminate militants from your area with the help of IGI commando, IGI commando will not be with you all the time but when you need them. These militants are highly dangerous that is why army commando is not sent to fight with them, neither the IGI commando can alone fight against them. You are the only person in army commando who all alone will fight against all these enemies. In this army sniper commando game you are assigned a special mission, aside from the mission in army sniper commando game you are representing the two forces that are army sniper commando and igi commando. Pick up your modern weaponry, which includes heavy machines gun &amp; modern sniper gun. No matter in igi commando game your enemy is quite dangerous but you have guts to cope with them, you are highly trained gunman of igi commando team.<br/><br/>BEST SHOOTING GAME<br/>There are multiple game strategies  and these are tough and challenging. If you are challenging type and you think you have strategic mind then download this combat game. This combat sniper game is test of your strategic mind, as your enemy in this combat is quite dangerous, and have same kind of modern machine guns and modern sniper guns. There is lot of commando games on app store, but there is no comparison of this sniper combat army game with those games. You must keep an active and smart mind to be the champ of this sniper combat army game. You would be given a sniper gun with which you have to shoot all the gangsters of the city. You are highly trained sniper soldier and you are master in your sniper assassination work. Be brave take your sniper gun and start shooting your targets. <br/><br/>DO YOU THINK YOU HAVE STRATEGIC MIND FOR THIS MISSION?<br/>Do you really think you have beautiful head on your shoulders? Ok, then try to play this us army shooting game. In this us army game there is crazy fight between two world class armies. In this us army game you are provided with commando sniper gun, normally this gun is only used by commando soldiers, but your target mission in this us army game is little tough that is why you too provided with commando sniper gun. Without strategic mind you are nothing in this sniper commando game. in this sniper commando game, you will be assisted by us army. Moreover, in this sniper commando game, you would be provided with latest weaponry. In this sniper commando game there is everywhere shooting and killing. This sniper commando game holds great deal of challenges and adventure. You need to be careful while on your mission in this us army game. <br/><br/>How to play:<br/><br/>-\tTap the bullet button to open fire.<br/>-\tPress on screen and adjust your aim<br/>-\tTap on left or right buttons to move left or right.<br/><br/>Features:<br/><br/>-\tFree to play<br/>-\tConsole quality ultra-realistic HD 3d Graphics<br/>-\tRealistic and effective sounds<br/>-\tMultiple deadliest guns or weapons<br/>-\tEasy, intuitive and smooth controls<br/>-\tBeautiful 3d snow mountain environment<br/>-\tEntertaining, thrilling and challenging missions", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2019-09-06T03:17:49", "background_image": "https://media.rawg.io/media/screenshots/e94/e94abb97b089ed76bf1110ce923f30cf_258DUSP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Action", "Adventure"], "publishers": ["Mindsol Studio"], "esrb_rating": null}