{"id": 340144, "slug": "fireballz-lava-labyrinth", "name": "Fireballz: Lava Labyrinth", "name_original": "Fireballz: Lava Labyrinth", "description": "Fireballz is a new take on the classic connect the dots puzzle games. You control a fire ball and navigate from dot to dot, setting your targets on fire. Doesn’t sound too complex, right? Well, it actually is. Because in Fireballz, you are never alone. Ice balls are trying to destroy you!<br/><br/><br/>Ice vs. Fire<br/>There are 3 types of enemy ice balls, which create an infinity of combinations and scenarios. You will feel like you’re navigating in a labyrinth that’s changing at every step. This puzzle game isn’t only an IQ test, but also a test of your mind’s flexibility. <br/><br/>As you connect the dots, you burn everything. The goal is to ignite your targets. But beware! Ice balls can put out the fire! Remain calm and avoid them. If you collide with ice balls, it’s like you fail the IQ test. The Ice vs. Fire dynamic is why every level feels so lively!<br/><br/><br/>Complex A.I. enemies<br/>Some ice balls are following you, others are cutting your path. Some ice balls explode like mines, others put out the fires you started. There are 3 types of enemies. Patrols navigate from dot to dot and if they collide with your fire ball, they send it into space in small pieces. Sentinels are more complex: they also move from dot to dot, but they eliminate any ignited ball in their path. But this also means you can navigate the same path twice! <br/><br/>Mines are static enemies which test your brain flexibility. After a certain number of moves, they will detonate and blow you into space! Here’s a tip: you can trick them if you navigate not dot to dot, but take a shortcut through teleporters! ;) Ice balls keep you on your toes, they keep your brain active. Flexibility is a must if you want to solve all the levels of this labyrinth like puzzle game!<br/><br/><br/>Shield Protection<br/>As you connect the dots, ignite targets and solve levels, you will gain an invulnerability shield. This shield is lit! You collided with an ice ball? Stay calm! The shield is active and it protects you. It’s your turn to send them into space.<br/><br/><br/>Calm &amp; Relaxing<br/>Our specialty have always been relaxing free games and this one makes no exception. A peaceful calm will take over you, the music will flow through your soul, you will feel like floating through the infinity of space. But don’t space out, keep your brain active and prove your flexibility or those lively ice balls will get you!<br/><br/><br/>Features<br/>• FREE – Fireballz is a free game and you can play it to infinity without any payment. Consider it a fun, free IQ test!<br/>• 250 HAND-MADE LEVELS! 8 difficulty ranges. Every level is a complex labyrinth with multiple solutions, in which you can connect the dots and ignite your targets. You’ll never feel burned out! <br/>• IQ TEST – only 10% of players can finish the game. From these 10%, only 10% can do it without hints. Fireballz includes a wide range of levels, from simple ones for casual gamers, to more complex ones, like labyrinths, for hard-core puzzle players. Connect the dots, ignite your targets, stay active and find where your brain ranks on the Leaderboards! Your rank is just like an IQ test result.<br/>• COLLECTIBLES – collect rare ballz skins or unlock new, beautiful themes. Check if your country’s flag is a collectible ball! Plenty of colorful, lively skins to choose from. Does this “ignite” your interest? Then take your fireball dot to dot, gather coins, and unlock everything!<br/><br/>STARMAN VIP BUNDLE offers a weekly subscription for 5.49$ after a 3 day free trial. It gives new skins, +200% Daily Reward, Free Hints, No Ads.<br/>This is an Auto-renewable subscription. The payment is charged to your account after confirmation. The subscription is renewed unless you turn it off 24 hours before the period ends. Your account will be charged for renewal as well. You can turn it off in your account settings. For more information, check the links below:<br/>Terms of Service: https://www.infinitygames.io/tos/<br/>Privacy Policy: https://www.infinitygames.io/privacy-policy/", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-07-30T11:52:51", "background_image": "https://media.rawg.io/media/screenshots/318/31839c099d4122e53e514c1b9ebb21b6.jpg", "website": "https://www.infinitygames.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WebAvenue Unipessoal Lda"], "genres": ["Action", "Puzzle"], "publishers": ["WebAvenue Unipessoal Lda"], "esrb_rating": null}