{"id": 340145, "slug": "canada-cargo-truck-driving-simulator-3d", "name": "Canada Cargo Truck Driving Simulator 3D", "name_original": "Canada Cargo Truck Driving Simulator 3D", "description": "Let your dreams come true with this amusing Canadian truck delivery simulator! Become one of the cargo delivery legends, unlock all the rewards and have fun playing Canada Cargo Truck Driving Simulator 3D!<br/><br/>Feel the adrenaline being a driver of the real delivery Canadian truck trailer! Make the snow of country Canadian road thawing under your wheels, deliver significant cargo right in time and have fun playing Canada Cargo Truck Driving Simulator 3D! Maneuver between stones and ice drift, be as apeedy as you can and learn the path of the best offroad delivery driver ever!<br/><br/>Fasten your seat belts, get your foot down and prepare to a really high speed! Don’t miss any turn and obstacle! Left your significant trace in Canadian truck delivery racing history! <br/><br/>Mind that you will earn money only if you’ll deliver your goods safe and sound in time, otherwise your game will be over in a second! So be wise and superfast to power-up your super Canadian truck or repair your damaged load any time of your race! Unlock all types of Canadian trucks and choose your favorite one to play for! Achieve the high level of synchronization with your truck! Do your best and complete every delivery mission!<br/><br/>Use the mini map to navigate and become really skillful delivery truck driver! Enjoy this fantastic Canadian truck delivery fever and have fun! Avoid obstacles, deliver all the cargo and try not to crash on your important way!<br/><br/>Canada Cargo Truck Driving Simulator 3D features:<br/>•\tRealistic delivery truck driver simulator<br/>•\tWide range of different power-ups for your car<br/>•\tInteresting tracks and maps<br/>•\tMaster your driving skills!<br/>•\tAmazing 3D graphics<br/><br/>Choose one of these powerful Canadian trucks and start your significant delivery loading mission! Drive as fast as you can through the snowy expanses of such Canadian cities as Toronto, Montreal or Ottawa city, reach the finish point in time and deliver your load playing Canada Cargo Truck Driving Simulator 3D!", "metacritic": null, "released": "2017-05-11", "tba": false, "updated": "2019-09-09T05:59:29", "background_image": "https://media.rawg.io/media/screenshots/828/828236e92aa87c8d29dc646ca204a603_tvXapKn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Simulation", "Racing"], "publishers": ["Tayga Games OOO"], "esrb_rating": null}