{"id": 340121, "slug": "street-robber-boy-hit-n-run", "name": "Street Robber Boy-Hit n Run", "name_original": "Street Robber Boy-Hit n Run", "description": "Extreme Street Robber Boy is fully action and thrill pursuit simulation game. The Street Robber Boy simulator is like race game where you have to chase down the criminals and force them to stop the street robbery. In street, chaser adventure fulfills your dream, act as police officers, and get the real feel of catching the bad guys. Be the real cop officer or the street chaser and get to know how difficult is to be a law enforcement in city streets and chasing the robbers in extreme robbery games. Show your great running skills to the max and chase the thief quickly within the time limit. In ultimate street robbery games run and surf like a cheetah, chase robber like a shadow, and catch robber like an eagle. Clear all the streets from thieves and from his partners in the 3 Street Robber Boy simulation game.<br/><br/>This adventures gameplay provide the user a lot of fun, multiple levels are designed to get point’s position and coins. In real chase game, every level has its own mission to go on next level you must clear the present level of  Street Robber Boy. Keep in mind the allowed time limit to complete a specific level. Robbery games consist of multiple levels and every level has its own specific mission and challenge to complete, on completion of levels you get either coins or scores. Be crazy in robber chaser 2018 surf as many as you will catch the street robber. Robber chaser is like as the subway runner but the difference is that you act in as a chaser except for runner. Take it as a street adventure and catch all the robbers which harm the innocent street peoples. Be ready to play as a chaser and fulfill your all mission and duties to become a city robber catcher or street king that vanish all the evils from the streets. <br/><br/><br/>Features:<br/><br/>•\tBeautiful and vivid street environments<br/>•\tRealistic and cool HD graphics<br/>•\tSwift controls and smooth gameplay<br/>•\tAddictive missions with many game types<br/>•\tBottles for hitting and Balls for kicking them<br/>•\tExperience of like a cop police officer which chase the robbers<br/>•\tClean the city streets from robbers to catch them<br/>•\tRealistic running and chasing simulator<br/>•\tMind-blowing sound play<br/><br/><br/>If you really enjoy the  Street Robber Boy and want to play our other runner and chaser games then click the “More from Developer” button or visit our publisher account. <br/>Please rate and review the game after playing and don’t forget to share with others.", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-09-06T03:17:41", "background_image": "https://media.rawg.io/media/screenshots/c63/c634bbd7cb25a218ef15a1a86bdb72ba_E5Jeyw1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Action", "Adventure"], "publishers": ["Mindsol Studio"], "esrb_rating": null}