{"id": 340137, "slug": "laser-piano-pro", "name": "Laser Piano Pro", "name_original": "Laser Piano Pro", "description": "Try a completely new, original, fun, exciting and relaxing music and game experience with the sounds of your Laser Piano synth! Compose your songs or play the music game: are you ready for this great music experience?<br/><br/>Some features:<br/>* Play Music or Play Game modes.<br/>* High quality piano synth sounds (3 different sets available).<br/>* 5 different laser sets and 9 beautiful backgrounds to use.<br/>* Background music loops to accompany your compositions.<br/>* Classic and Level game modes. Two difficulty levels to ensure longevity.<br/>* Music AI to create virtually infinite music compositions for game mode. Each match is new and different!<br/>* Expressly and exclusively designed for the iPhone, with a beautiful, immediate and intuitive user interface.<br/>* Playable for everybody and anybody! Really fun for all ages! Play and dance to the sounds of your laser piano synth!<br/>* Do you have additional features/improvements to suggest for the next update? Just contact us!<br/><br/><br/>*** And have fun making your music compositions! ***<br/><br/>Download also our other Music Applications on App Store, some are FREE!<br/><br/><br/>Thanks for using our products. Feedback is always welcome to: support@dighentis.com<br/>App Store reviews are greatly appreciated, thank you.", "metacritic": null, "released": "2012-12-10", "tba": false, "updated": "2019-07-12T02:56:31", "background_image": "https://media.rawg.io/media/screenshots/02c/02c57015f90594e2b56c4d6b55dd7bb1.jpg", "website": "http://www.dighentis.com/applications.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alessandro Benedettini"], "genres": ["Casual"], "publishers": ["Alessandro Benedettini"], "esrb_rating": "Everyone 10+"}