{"id": 340457, "slug": "asgarnon-dark-light-alpha-demo", "name": "ASGARNON Dark Light [ALPHA DEMO]", "name_original": "ASGARNON Dark Light [ALPHA DEMO]", "description": "<p><strong>História</strong></p><p>Havia um grupo de aventureiros na cidade de Kormam que era reconhecido como o grupo mais forte da região, juntos enfrentaram e destruirão toda e qualquer ameaça ao local,</p>\n<p>Rowenna a feiticeira do grupo assim como sua amiga Melliz tinha a ambição pela posição de Mestre de guilda regional, um cargo dado apenas aos mais poderosos aventureiros de cada guilda, as duas tinham uma rivalidade e ao mesmo tempo um companheirismo enorme, Rowenna pertencia ao clã umbron, um clã que domina a magia do elemento das sombras, afim de aumentar seu poder, Rowenna recorreu a rituais proibidos para invocar a própria entidade da escuridão, afim de roubar seu poder e se tornar a mais poderosa Umbron que já existiu.</p>\n<p>A escuridão é uma entidade maligna que não pode ser dominada por nenhum mortal qualquer, infelizmente Rowenna não sabia disso e isso custou a sua vida, Rowenna estava gravida e antes de morrer deu a luz a seu filho Dazlin, no momento do nascimento de Dazlin Rowenna estava possuída pela escuridão, isso fez com que Dazlin conseguisse o que Rowenna tanto procurava, o garoto nasceu com o sangue da entidade da escuridão sendo assim o mais poderoso Umbron, mas órfão logo apos seu nascimento.</p>\n<p>Dazlin foi adotado por Melliz que o criou como seu próprio filho, quando cresceu e descobriu a verdade sobre seu passado, Dazlin decidi encontrar a escuridão que ainda estava solta pelo mundo, afim de destruí-la e vingar sua mãe.</p>", "metacritic": null, "released": "2019-07-09", "tba": false, "updated": "2019-07-12T04:14:33", "background_image": "https://media.rawg.io/media/screenshots/985/98526ec2cfa8d97c506bf27271c38015.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dreyliam"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}