{"id": 340572, "slug": "the-flying-fishs-revenge", "name": "THE FLYING FISH'S REVENGE", "name_original": "THE FLYING FISH'S REVENGE", "description": "<p>Code by IronPowerTGA (Antoine Guilbaud) I'm French ;)<br/></p>\n<p>Art by cupcake (Paul Wandley)</p>\n<p>Music by Eric Skiff<br/></p>\n<p>STORY : <br/></p>\n<p>Finley was once a happy flying fish. A pacificist who lived to swim and avoided predators with ease. Then, the fisherman started coming in droves. They fished and fished and Finley kept saying \"they'll move on soon, don't worry!\" Then , things got personal. Finley started to lose friends and then his family to the fisherman. That was the last straw. He knew he could not let the fishermen get away with this. Finley decided to take the fight to the fishermen and get revenge!</p>\n<p>Histoire :(French)<br/></p>\n<p>Finley est un poisson volant heureux, un pacifiste qui ne vit que pour nager et fuir les prédateurs. Cependant les pêcheurs sont venus en masse. Ils pêchaient sans cesse, Finley disait \"ils vont bientôt partir, n'ayez pas peur !\". Puis, les choses sont devenues une affaires personnelles. Filey commença à perdre tous ces amis et enfin ça famille. Ce fut la goute d'eau qui mit le feu à la charité. Il ne pouvait laisser les crimes des pêcheurs impunis. Finley décida de combattre les pêcheurs et d'avoir une ultime  revanche.</p>\n<p><strong>To Finish level you must go in the water.<br/></strong></p><p><strong>The objective is to increase you score in level. </strong><br/></p>\n<p>HOW TO  MAKE MAP tutorial : Video tutorial : How to Make Level<br/></p>\n<p>if you want  quit level press escape.</p>\n<p>We (cupcake) made 2 level 0 and 1. Levels 2 and 3 must be create.</p>\n<p>You can share you level : antoine.guilbaudd@gmail.com</p>\n<p>Rate the game, post a comment we love to speak with other people ;)<br/></p>", "metacritic": null, "released": "2019-07-09", "tba": false, "updated": "2019-08-28T23:15:23", "background_image": "https://media.rawg.io/media/screenshots/eba/ebab0f06a20486147c985ab99e3eaf1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IronPowerTGA", "cupcake<3"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}