{"id": 340767, "slug": "paragon-2", "name": "Paragon 2", "name_original": "Paragon 2", "description": "<p><strong>Get ready to explode your balls into a firestorm of dust and skeletons in Paragon 2. Fight monsters in fast, stylish turn based action while exploring a vast open space in this vile and shameless mashup of some games from 2017 I'm pretty sure that no one has ever heard of.<br/></strong></p>\n\n<p><strong>Submission for Glinny's Cauldron Jam. Uses the following from the list of potential ingredients (Glinny's recipe):</strong></p>\n<p><strong>- You have a 1% chance to not be able to double jump.<br/>- Spells that inflict status effects virtually never work on bosses.<br/>- Instant death from touching the SIDE of a spike. <br/>- Every loading screen is a bright blank white screen.<br/>(Note: For one cutscene the game fades to and from black, this is only a mask and the game is not loading)<br/>- The final boss of the game is a character first introduced directly prior to the final boss fight.<br/>- No buildings can be entered. Anytime you attempt to enter one your character says \"It's not the right time for that\"<br/>- Every town has a mandatory Bad Anime Hot Spring scene.<br/>- SLOGAN: Get ready to explode your balls into a firestorm of dust and skeletons.<br/><br/>Bonus:<br/>-Experience does nothing.<br/>-The ending (spoilers).</strong></p>\n<p><strong>- Full Controller and KB support (prompts should auto change)</strong><br/><strong>- Menu and UI navigation is done with WASD/Arrows or Left Stick/D-Pad (Mouse is only for in-game camera control),</strong><br/><strong>- Backspace for cancel, Enter for confirm, Esc/P for pause. Controller is standard Circle/B cancel, X/A confirm, Options/Menu pause.</strong><br/><strong>- If there is a bug or the game gets stuck during a battle, try using the 'Flee' command to force the game back into the overworld (Flee should only be unavailable if 'Auto Battle' is active).<br/>- Resolution defaults to 1080p when in fullscreen mode and 720p when in windowed (adjust 'Resolution Scale' if you want to increase or decrease it in either mode).</strong><br/><strong>- If you don't have the pre-requisite UE4 files your system and it doesn't prompt you when launching the game, the installer can be found in Engine\\Extras\\Redist\\en-us<br/></strong><strong>- 64-bit Windows only. If anyone needs 32-bit, please let me know and I'll try to make that happen.</strong><br/><strong>- There are probably a lot of bugs, and I'm very sorry about that, but please feel free to leave a comment if you encounter any. I might be able to update it at some point. </strong><br/></p>\n\n<p><strong>Specs for the PC this was created with:<br/>- GTX 750 Ti<br/>- i5 4590<br/>- 16 GB DDR3<br/>- Samsung 850 EVO (SSD)<br/>- Windows 10<br/><br/>With my relatively outdated setup, I'm generally able to stay between 30 and 40 frames on the default settings (there is one part in particular where it sometimes dips to the high 20s). That being said, there are several settings in the options menu that can be lowered or raised to fit your specific needs. </strong></p>\n\n<p><strong>Created by\r\nTrevor Betts<br/>(Twitter: @TrevorJBetts)</strong></p>\n<p><strong>The game's logic was written by myself via Unreal Engine 4's visual scripting language. I also created most of the sprite/UI assets (and a few 3D ones), while most of the audio and 3D assets (including textures) were obtained for free through Epic (permanent and monthly free collections) and YouTube's attribution free audio library.</strong></p>", "metacritic": null, "released": "2019-07-08", "tba": false, "updated": "2019-07-12T05:29:07", "background_image": "https://media.rawg.io/media/screenshots/16b/16b1aa33ef2ce065dd18514dcd1aab1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WordsAndDreams"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}