{"id": 340807, "slug": "tap-tiles-magic-piano-music", "name": "Tap Tiles: Magic Piano Music", "name_original": "Tap Tiles: Magic Piano Music", "description": "crazy fan of piano Music ?<br/>Do you love Latin music ?<br/>Let's download now : \"Tap Tiles : Magic Piano Music\"<br/><br/>with a carefully selected soundtrack and songs to create an experience like no other. Featuring different Arcade and Adventure worlds of increasing difficulty, each one paints a unique picture and evokes different emotions and colorful experience. <br/>The key is to play to the music and reach the endless mode. <br/>Listen to the beat and the melody and do not forget the concentration, and after a short while you will find yourself doing better and better in your subway game. \u2028\u2028Addictive musical game for tapping and dancing and following Notes to reach the Cross Line.\u2028\u2028A magic Dancing Line come and play magic music rhythm in beautiful seasons in a various colorful World. So Run Dash Dash and Listen the melody carefully and tap on the screen to the steering wheel, control the Geometry Tapping turn to avoid the obstacles appeared and to not Smash and Hit. \u2028<br/><br/>Tap faster to beat your tapping speed, and enjoy the classical and pop music tiles.<br/>\"Magic Piano Tiles Latin - Favorite Latin Songs\" is a wonderful game about music to play.<br/>Here is the butterfly piano magic tiles game to enjoy more songs on your phone.<br/>Press the piano black tiles continues to play music, then sing karaoke with your favorite song.<br/>Beware of white tiles and do not miss any piano black tiles to finish each song.<br/>searching for free kids games online or games for girls and even games for boys, you got it here is the newest piano games with hd graphic and high quality of songs, enjoy play butterfly piano magic tiles with your friends, <br/>as you known that pink color is the favorite color for girls, so if you play this pink piano game. tap black tiles while listening to music, avoid the white tiles! <br/>Have you ever dreamed of playing classical songs like Little Star, Canon or Jingle Bells on a piano? Realize your dreams NOW! <br/>\"Magic Piano Tiles Latin - Favorite Latin Songs\" is the newest piano game play and it's available on pink as you love and it will be other games in the future like glitter piano and piano tiles diamond games. As we like piano games, This diversion consolidates different instruments which are guitar, drum, and particular piano! <br/>Amazing melodies and wonderful game play. Just with a light and fast touch on the screen, you can quickly become a skilled pianist with \"Magic Piano Tiles Latin - Favorite Latin Songs\" no worse than a genuine piano master. <br/>Listen black tiles where there is butterflies , avoid white tiles, and that's it! pink piano tiles. It's just simple and amazing! <br/>Challenge your friends playing this butterfly piano tiles games and be the master and the hero of this free game, if you love songs , you will play it with this game, so search about piano tiles and play it.<br/><br/><br/>How to play:<br/>- Tap on the black piano tiles continuously to play the music piano. <br/>- Avoid the white piano tiles!<br/>- Simple to play, but difficult to master. <br/>- Catching all the black tiles in this high speed musical game is definitely not easy!<br/>- Over 100 songs to play <br/><br/>Game Features:<br/>- Awesome game design and flat graphic<br/>- High quality piano music soundtracks<br/>- Features a large collection of piano songs<br/>- Smooth game playing experience<br/>- Collect gem<br/>- Add favorites list<br/>- Get experience, open new levels.<br/>- 100% Free game music<br/>- You can Share game and results<br/><br/>Try out this music tiles game now and improve your reaction speed and musical skill!<br/>Enjoy and Be the best Piano player.", "metacritic": null, "released": "2019-02-25", "tba": false, "updated": "2019-08-05T05:27:34", "background_image": "https://media.rawg.io/media/screenshots/53f/53fee8a0933315d513fe175109f85711.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mohamed DAOUIA"], "genres": ["Casual"], "publishers": ["Mohamed DAOUIA"], "esrb_rating": null}