{"id": 340816, "slug": "flying-moto-traffic-racer-3d", "name": "Flying Moto Traffic Racer 3d", "name_original": "Flying Moto Traffic Racer 3d", "description": "Flying Moto Racer 3d<br/><br/>Racing Moto is a fast paced racing game. You never dare drive so fast in the real world!<br/>Have fun dodging cars and trucks while you speed up to the limit. Race against the AI in an outstanding Racing Face-Off and try to earn the respect of your fellow bikers. <br/><br/>Speed Motercycle Racing 3D embodies the most amazing feature in any bike game: Nitro Boost. Arm your nitro by accelerating and <br/>overtaking other cars and then use it to reach max speed. While driving, please appreciate the beautiful scenery.<br/>Fly your plane around the city discover new landscapes, Drive your motor do stunts and drifts !<br/><br/>Drive the fastest and coolest moto bike. Race against other cars. Be the real KING of SPEED! What are you waiting for? Just download it <br/>and enjoy driving.<br/>Drive motorbike along the offroad terrian. Motorbike Simulator is the latest exciting massive extreme open world bike game! Control <br/><br/>super fast motocross bikes, attain serious air time and be the coolest bike driver in the world!<br/>Feel the thrill of Bike racing like never before in this action-packed, heart-thumping Bike racing game. Racing Moto is a fast paced racing game. You never dare drive so fast in the real world!<br/> Drive your Bike at insane speeds through traffic. Experience the extreme simulation,Get your tires and bike dirty with Uphill Climb <br/>Drive. Face the off road hills and be ready for some speed driving as a daredevil bike driver.<br/><br/>Time travel to the future, be the extreme pilot of the flying car.<br/>If you are a fanatic fan of flying bus, dragons and muscle carriage driving games then download this free flying motor game today.<br/>This game is only for Fun.....<br/>Enjoy a realistic  Motercycle Racer 3d and be the best motorcar stunt race driver.<br/>airborne motorcar Free: This game is made for all fans of free carriage driving games, Simulation games and Airplane Flight games.<br/>This game is for all ages who like to do advantures. infect your kids also love this game. <br/>This game not include massive jumps, mid-air hoops, floating platforms, spiral roadways and outlandish maneuvers in impossible <br/>environments.<br/>This game is for all ages who like to do advantures. infect your kids also love this game.<br/><br/>It's time for our car stunt race driver 3d to show exceptional air craft pilot skills and car driving skills in one of the most spectacular flying <br/>car games.<br/>Get ready for real racing stunts in your speed car and become the best stuntman driver &amp; deadpool racer. Play Extreme Stunts Snow Car Race for offroad driving challenges in city sports.<br/>SpeedMoto is a 3d  racing game with simple control and ecellent graphic effect.<br/>In this game you can ride the motorcycle shuttle in outskirts, forest, snow mountain,bridge. More and More maps and motos will coming soon..<br/><br/>Keyfeatures: <br/><br/>=&gt; Just swap your phone to control moto direction<br/>=&gt; Tap the screen to accelerate the moto<br/>=&gt; Excellent gameplay.<br/>=&gt; Great 3D graphics.<br/>=&gt; Lots of bike racing fun!<br/>=&gt; Easy and Free to use<br/>=&gt; No WiFi? No Problem.<br/>=&gt; Offline Play.", "metacritic": null, "released": "2016-06-16", "tba": false, "updated": "2019-07-15T01:48:42", "background_image": "https://media.rawg.io/media/screenshots/89b/89b25ad79a9ba37c1e9429f2c08bbd9f_j3ANQRm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tom madrid"], "genres": ["Action", "Racing"], "publishers": ["Tom madrid"], "esrb_rating": "Everyone 10+"}