{"id": 340845, "slug": "motorbike-stunt-simulator", "name": "MotorBike Stunt Simulator", "name_original": "MotorBike Stunt Simulator", "description": "MotorBike Stunt Simulator<br/><br/>MotorBike Stunt Simulator is a fun and exciting open world police motorbike driving bike simulator where you, the best police bike officer, control a super fast police bike.<br/><br/>Enjoy fast sports bike racing and riding by performing stunts and completing sports bike level challenges with most realistic super bike simulator .<br/><br/>Racing the best in bike action games. Complete previous level to get into next level, every next level is much more challenging and strategic demanding than the previous one. Strap on your helmet, ride super bike with style and burn the track with throttle when bike is in extreme speed.<br/><br/>You take the role of the police motorbike officer and you must go through each best level, ridding the city.<br/><br/>Choose from a wide selection of police motorbikes and drive wherever you want in the city paradise. Experience the biggest, fastest drifts, and gain top speeds to execute difficult stunts like the loop de loop! <br/><br/>Key Features :<br/><br/>=&gt; Amazing Selection of Bikes<br/>=&gt; Easy to learn Bike controls, both touch and tilt controls<br/>=&gt; Improved motorbike physics engine, for a more realistic driving experience<br/>=&gt; Realistic motorbikes sound effects <br/>=&gt; Real world environments", "metacritic": null, "released": "2017-05-10", "tba": false, "updated": "2019-07-15T02:00:21", "background_image": "https://media.rawg.io/media/screenshots/fea/fea2124611ad2e7fbc86b6ebcd07c74d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tom madrid"], "genres": ["Action", "Simulation"], "publishers": ["Tom madrid"], "esrb_rating": "Everyone 10+"}