{"id": 340884, "slug": "magic-nail-salon-girls-makeover-games", "name": "Magic Nail Salon: Girls Makeover Games", "name_original": "Magic Nail Salon: Girls Makeover Games", "description": "** Want to have a manicure? Come on, Spice up your nails with our new app, Magic Nail Spa Salon! **<br/>Create your very own manicure designs in Nail Salon. You could paint on different skin color，choose from loads of polish color collections to custom paint gorgeous nails, choose from absolutely tons of sparkling rhinestones, crystals, diamonds, gemstones, pearls, stickers, patterns, fimo, resin and much much more to decorate your nails, and you are welcome to choose the customized nails from Salon as well.<br/>Take a photo with your nails as our cover girl. <br/>6 millions of collections and most plentiful colors available to make all your ideas come true!<br/><br/>Features <br/>- Different customer has different requirements. Please provide the right service to every customer.<br/>- Clean nails with soap and nurse hand skin.<br/>- treat princess' hand with medical instruments.<br/>- 5 nail shapes <br/>- 15+ rings <br/>- 50+ customized nails series <br/>- Plentiful nail polish colors to choose <br/>- 40+ Nail Patterns <br/>- Sparkling Crystals, Diamonds, and Gemstones to decorate<br/>- Gorgeous Gem alloy<br/>- Cute Fimo &amp; Resin <br/>- Design each finger differently or simply apply one design to all fingers.  <br/>- Take a photo with your nail design!", "metacritic": null, "released": "2016-03-09", "tba": false, "updated": "2019-07-15T02:13:43", "background_image": "https://media.rawg.io/media/screenshots/b18/b18696a317d43313854cc567568edf5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Edaysoft"], "genres": ["RPG", "Simulation"], "publishers": ["Shanghai Edaysoft Co"], "esrb_rating": "Everyone 10+"}