{"id": 340886, "slug": "princess-room-decoration-girl-games", "name": "Princess Room Decoration - Girl Games", "name_original": "Princess Room Decoration - Girl Games", "description": "Decorating can be lots of fun and with this room decoration game, you can show your creative skills and decorate a bedroom just the way you like it. With this free decorating game you can choose a bed, a seating option, a desk, wall hangings, lights, rugs, wardrobes, as well as windows, floor type, wall colour, and any final finishing touches. So if you have an interior designer in your heart and love room decoration, why not try your hand at this fun decoration game today and see what masterpiece you come up with to show your friends and family.<br/>Features:  <br/>• Find and decorate the room with the bed of your dreams. <br/>• Add a comfortable seating option for friends to sit in.<br/>• Have fun choosing a desk and mirror to complete your hair and makeup before heading out. <br/>• Decorate the room by adding wall hangings and lights to compliment your bedroom. <br/>• Accessorize by adding a rug or wardrobe that matches your bed and wall hangings. <br/>• Renovate and add an additional window to let more sunlight in. <br/>• Change the floor to timber, tiles or carpet to add that extra effect. <br/>• Decorate and change the wall colour and patterns for that unique style. <br/>• Add the final finishing touches with teddies, lamps, plants and more.", "metacritic": null, "released": "2015-07-13", "tba": false, "updated": "2019-07-15T02:14:38", "background_image": "https://media.rawg.io/media/screenshots/839/839bd480b67b35c65fff4057e6e65ba1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Edaysoft"], "genres": ["Simulation", "Family"], "publishers": ["Shanghai Edaysoft Co"], "esrb_rating": "Everyone 10+"}