{"id": 340962, "slug": "castle-legend3-city-of-eterni", "name": "Castle Legend3: City of Eterni", "name_original": "Castle Legend3: City of Eterni", "description": "2000 Dia year, &amp;in distant northwest Silert continent,&amp;a mysterious and powerful alien force arised.&amp;They rapidly occupied northwest continent with their ancient dark magic,&amp;home of previous Saxon Kingdom.&amp;This growing force was called \"Sunset\",&amp;because of the place they arised in.&amp;\"Sunset\" directly threatened Poldo Kingdom, the hegemon of Silert continent.&amp;Meanwhile, the light of holy sword \"Shionoway\" faded away...&amp;It had been guarding Poldo Kingdom for thousands of years.&amp;It seemed that Poldo Kingdom was doomed,&amp;and everyone had no doubt about it.<br/>The 81th king of Poldo Kingdom, the old Poldo Leon,&amp;forsaw the annihilation of his kindome.&amp;To avoid this fate, he decided to send his elite mercenary,&amp;led by his most outstanding son, Poldo Rose,&amp;to cross \"Sunset\" land and visit Garan Castle,&amp;to find out why holy sword faded away and seek for the power to save Poldo.&amp;Can Rose's team do like Poldo Simon did a thousand years ago,&amp;arrive City of Eternity through Castle Garan,&amp;fulfill the crucial misson from his father,&amp;and find abosolute power?<br/>  *Game Features*<br/>--Endless Adventure in Dungeon<br/>  There are many sophisticatedly-designed dungeon maps in different themes. In each map, countless \"easter eggs\" await players to explore. Different map is defended by different monsters and big boss, which awaits players to challenge. All the maps are free for all.<br/><br/>--Rich and Interesting Gameplay<br/>  There are different classes to be chosen: warrior, mage and priest. They have different gift skills. Players can choose and collocate different skills combination based on different tactics. Thousands pieces of equipment is randomly available through monsters' drops and exploration rewards. These equipment has different extra attributes and set effects, which can be used wisely according to diffrent character class and tactics. Castle Legend 3 has improved the rule of gift upgrade. It's a new attempt in Castle Legend series, which makes the game more tactical.<br/><br/>--Challenging and Fulfilling Stages<br/>  Combat mode is designed based on classic Castle Legend series' strategic combat on a chess board, with more strategy elements. Each battle has different scene, in which players need to control different environment, night-and-day shift or the timing of tide's up-and-down.<br/>  In different battles, players can fetch different temporary stage items, which can be much helpful if used wisely. Players will also encounter many different bosses, who have different skills and AI mechanism. It's quite challenging and fulfilling to defeat them using your own tatics!<br/><br/><br/>--Countless Exploration and Hidden Contents<br/>  Castle Legend is an adventure game, trust us! The hidden contents are better integrated with map scene and game story, which are traceable according to hints. As long as players are careful enough, these \"easter eggs\" can be revealed.<br/><br/>--Free to Play<br/>  No VIP system, no card drawing, no a bunch of growth system and commercial events. Games of Winwill studio always have good reputation.<br/><br/>--Continuous Updates<br/>  We will update new contents on a weekly or biweekly basis. Castle Legend will accompay players for a long time!<br/><br/>Facebook：KeQiao Lou<br/>Mail：shchisen@163.com", "metacritic": null, "released": "2018-11-07", "tba": false, "updated": "2020-08-17T02:31:45", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba60609adfc542386e6fe680b32fdafc.jpg", "website": "http://www.chisennet.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanghai Chisen Network Technology Co"], "genres": ["Adventure", "RPG"], "publishers": ["Shanghai Chisen Network Technology Co"], "esrb_rating": null}