{"id": 340984, "slug": "simplebaseball-f", "name": "SimpleBaseball F", "name_original": "SimpleBaseball F", "description": "!!! Two-person play by Wireless is possible. !!! <br/><br/>It is a simple baseball game of 2D like a baseball board.<br/>Please let me slide the pitched ball upwards and hit it with a finger.<br/>It can be made to slide on a ground also where.<br/>* A scoreboard and the button do not include it.<br/>When you are the bat well, a ball protrudes to the ground.<br/>You may miss a ball.<br/>Please strike targeting \"hit\", \"2 base hit\", and \"3 base hit\" field. [ of the grand back ] <br/>If the vigor of a ball is strong and timing suits, this field will be exceeded and it will become a \"home run.\"<br/>It will become a \"single\" if a ball stops on a ground.<br/>A fielder flies occasionally and catches a ball.<br/>A runner progresses according to the kind of hit.<br/>Moreover, the runner who has already got to the first base progresses similarly.<br/>The runner can advance (a steal, end run). When the fielder catches a ball, fielder throw a ball to the advancement.<br/>It is necessary to succeed in advancement earlier than a ball thrown a ball.<br/>**This game is different from a rule of the original baseball.<br/>  It is a rule of the 2D baseball (this game use)<br/><br/>At the time of defense, you slide a finger toward the home base in \"throw pad\".<br/>It becomes the breaking ball when you  slide it to right and left while sliding it to the upper part.<br/>When you slide a finger fast, you throw a fast ball.<br/>it slow ball too.<br/>* When I do not use a throw pad, I start a throw by a button.<br/>After a throw, it becomes hard to see a ball for an instant when I tap a button \"to hide\".<br/>* When chooses \"The ball disappear\".<br/>\"The disappearing ball\" can hit although a ball hides.<br/><br/>The game has three modes. <br/>1)Both teams are only attack together.<br/>  When you tap a throw button (ball button), a throw is started.<br/>  The pitcher throws a straight and a curve ball.<br/>  You play batting with a friend in turn or play the attack of both teams alone.<br/>2)You play against a computer.<br/>  The offense: batting and steel.<br/>  The defense: only pitching.<br/>               Junk ball having.<br/>3)Two play(Bluetooth)<br/>  You face it with two iPhone.<br/>*This app can not communicate with the \"SimpleBaseball2\".<br/><br/>You can choose the right batter and the left batter. <br/>You can change pitching Speed. <br/>You can change the \"batting power\".<br/>You can change the \"Defense power\".<br/>You can change \"inning\".<br/><br/>The Free version displays the advertisement on the screen. <br/>*It is different in an operation method of the \"right or left batter choice\",\"throw speed\", but the function is the same.", "metacritic": null, "released": "2010-11-04", "tba": false, "updated": "2019-07-15T02:51:44", "background_image": "https://media.rawg.io/media/screenshots/0c2/0c21057bd9e4ae8e74e0e5080f26ccb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Youness Software Co"], "genres": ["Sports", "Board Games"], "publishers": ["Youness Software Co"], "esrb_rating": "Everyone 10+"}