{"id": 341081, "slug": "toy-game-story-adventure-for-kids", "name": "Toy game story adventure for kids", "name_original": "Toy game story adventure for kids", "description": "Maggie,the naughty crow, flies high away with babies toys: the intervention of your kids is necessary to restore justice. Indeed, a series of babies toys are missing ! This is the second episode of toy game story adventure : now little kids under 5 years old can be challenged too.They will fly to rescue friends toys :cars,trains,dolls Having fun ! <br/>Would you like your child drives colorful ballooning, answers quizzes when he plays and learns? Would you like him to be proud and happy to have rescued all these babies toys missing? Do you want your \"hijos\" or daughter learns to help adults,such as parents toys «suffering »?<br/>We created \"Toy game Story adventure for kids\" to awake the intelligence of your child, and satisfy his curiosity and imagination! It's a real challenge for your little kids.<br/>Why this educational game is suitable for your kids ?<br/><br/>A MISSION \"CAPTIVATING\"  FULL OF SURPRISES: <br/>This game is suitable for your young kid because this game captivates him with simple game play, targeting learning and playing :  <br/>1)\tYour child drives a colorful ballooning to pick up babies toys missing in the sky.<br/>2)\tYour clever kid selects suitable ballooning, according the weather, natural danger all along his flight. <br/>3)\tYour young learner discovers seasons thanks to colorful drawings and natural elements (rain and wind for autumn,  snow, ice stones, for winter, sun and blue sky with colorful birds on spring,  more bright sun and more colorful birds. <br/>4)\tMini games are still challenging your clever kid : weather game 1 and 2, color game, matching  game, quiz game, logic game. <br/><br/>A PLAYFUL AND EDUCATIONAL GAME : <br/>This magical game is suitable for your child under 5, because it is a fun and educational tool to complement his school lessons and life lessons:<br/>PLAYFUL:<br/>Your child plays and is rewarded when he succeeds to respond to mini games’ questions. So when your son or daughter wins, he / she can fly higher and rescue more babies toys ! <br/>EDUCATIONAL: <br/>* WEATHER GAME 1 and 2 : develops nature skills<br/>Kid learns about weathers and its components like rain, sun, tornado,thunder, lightning and more.<br/>*COLOR GAME, develops memory skills<br/>Child learns colors toys<br/>He increases his memory skills, more there are colorful toys to memorize.<br/>*MATCHING GAME, increases the logic skills,and it introduces the theme of the family. Your child learns to associate the good parent toy with his baby toy, according to their similarities.<br/>*MEMORY GAME increases spatial memory skills,<br/>The child learns to recognize the characteristic shapes of toys and their similarities.<br/>He must also memorize the locations of images of similar toys, hidden behind the cards.<br/>*LOGIC GAME increases overall observation capacity facing a global issue.<br/>The child learns to connect the images of toys in pairs: your child needs to look carefully similar toys according to their facial expressions and their forms. <br/>Successfully interconnected, toys disappear progressively of the screen. <br/>So your child adapts to the new configuration of the images, front his eyes.<br/>*QUIZ GAME enhances listening skills, memory, and concentration<br/>Kid learns then remembers name of each toy in English.<br/>Your kid adapts to the new location of the pictures that are front his eyes.<br/>Finally what are the multiple interests of TOY GAME FOR KIDS ? <br/>Your child runs, jumps, answers quizzes when he plays and learns<br/>Your child is happy and proud to help these babies toys<br/>Your son or your daughter or your student learns to help adults, such as parents toys. Now your child use to think more and more logically:  thanks to challenging mini games and funny tricky game play.<br/>Kid uses all his abilities to solve problems.<br/>Finally your child becomes self confident when he is aware of his talents<br/>My famous soft team is pleased to create this game for you all.<br/>Thanks for your messages of support.Continue to write us: toygamestory@gmail.com<br/>You can also leave reviews to inform us of your satisfaction and your child's progress.", "metacritic": null, "released": "2016-09-30", "tba": false, "updated": "2019-07-15T03:37:51", "background_image": "https://media.rawg.io/media/screenshots/7fa/7fa360e4e1d4183370742a71daf5a4f0.jpg", "website": "https://www.facebook.com/Toy-Game-Story-Adventure-for-Kid-255139284883295/?skip_nax_wizard=true", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Philippe Pinceau"], "genres": [], "publishers": ["Philippe Pinceau"], "esrb_rating": "Everyone 10+"}