{"id": 341084, "slug": "halloween-pumpkins-heroes-fighters-trick-or-treat", "name": "Halloween Pumpkins heroes fighters, trick or treat", "name_original": "Halloween Pumpkins heroes fighters, trick or treat", "description": "Welcome to a new adventure \"Halloween Pumpkins heroes fighters\". Trick dark silhouettes, it means kick out dark characters, with your naughty pumpkins fighters, <br/><br/>Earn more and more sweet and juicy candies <br/><br/>Use your candies to get and update new powerful fighters pumpkins in your army<br/><br/>Reach the checkpoint on time to get extra candies and go to the next adventure ! <br/><br/>Trick or Treat : share candies with Leo and Lea and discover their beautiful costumes ! <br/><br/>Features : <br/>100 Candies credit to start to trick your foes. Then you need to play hard to earn more delicious candies ! <br/>Guess famous silhouettes characters in game play. You may recognize them. Good Luck ! <br/>Share awesome candies score, with friends on your fan page.<br/>Cross checkpoints and finish line to feel happy and proud when you succeed your missions. <br/>Having fun to play this new generation of toy blast category game it's ones of the a nicest and funniest halloween games ! <br/>Enjoy this free halloween game.<br/>Happy Halloween with one of the cutest games for kids, games for girls and actually for everyone !", "metacritic": null, "released": "2016-10-29", "tba": false, "updated": "2019-07-15T03:39:08", "background_image": "https://media.rawg.io/media/screenshots/fb6/fb65a25bdf25365e52eaf729c8699352_2apMbDn.jpg", "website": "https://www.facebook.com/Halloween-Pumpkins-Fighters-Heroes-1797708750471473/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Philippe Pinceau"], "genres": ["Strategy", "Family"], "publishers": ["Philippe Pinceau"], "esrb_rating": "Everyone 10+"}