{"id": 341086, "slug": "battles-of-beetles-bosses-clash", "name": "Battles of Beetles - Bosses clash !", "name_original": "Battles of Beetles - Bosses clash !", "description": "Have you ever dreamed to control biggest powerful beetles in the world ?  <br/>Here you are : « Battles Beetles: fight epic bosses' fleets, troops » is born for you ! <br/><br/>Colorful Insects from ecuadorian rainforest, Brasilian jungle, and more … are now ready in epic Battles in nature. <br/><br/>Wilde life surprises one more time :  <br/>Indeed, after selecting your favourite Boss Beetle, and your competitors on CPU or multiplayer mode, be ready on Battlefield.  <br/>Press Beetle’ Back to release your fleet and troop on Battlefield. <br/>Colonels, Lieutenants, soldiers keep their positions, defending you, attacking your enemies ! <br/>You may observe your enemies movements, and apply your strategy according your plan then you may become the Beetle King ! <br/>Be strong and strategic  there is no mercy in middle wildlife. <br/>Surrending is your choice ? You will disappear after few minutes like you never existed before.<br/><br/>Play in the middle of wildlife and become the Beetle King ! <br/><br/>Features : <br/>13 various beetles and more available for epic battles<br/>4 kind of fighters = Boss, Colonel, Lieutenant, Soldier or starship trooper with their own attributes. <br/>5 awesome Battlefields <br/>2 Games play mode : « multiplayer on 1 device » and against CPU.<br/>3 Levels of difficulties.<br/><br/>Many thanks to all P. B. team, developers, designers for full free contribution in this project.<br/>Warm thanks to all our followers and supporters. <br/>Feel Free to send message and or to review on app store : toygamestory@gmail.com", "metacritic": null, "released": "2017-07-21", "tba": false, "updated": "2019-07-15T03:40:06", "background_image": "https://media.rawg.io/media/screenshots/440/440fc04118e1e7b234b8dbe2c6d2e20f_zf25UeO.jpg", "website": "https://www.facebook.com/Battles-of-Beetles-Bosses-Clashes-949074781899836/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Philippe Pinceau"], "genres": ["RPG", "Strategy"], "publishers": ["Philippe Pinceau"], "esrb_rating": "Everyone 10+"}