{"id": 341149, "slug": "the-legend-of-victor", "name": "The Legend of VIctor", "name_original": "The Legend of VIctor", "description": "<p>I want to keep working on The Legend of VIctor, but I don't want to alter the original submission for the Shenanijam 2019. This page will have the newest version of my game, where the other one is frozen in time and will never receive an update.<br/></p>==================================================<p>This is my entry for the Shenanijam 2019 Game Jam. I call it The Legend of VIctor.</p>\n<p>It was the night before Cursemas and all through the house, just one creature was stirring; a boy, not a mouse. This young boy was saying, maybe even praying \"I wish I was a transformer, and maybe a bit warmer...\" All of a sudden, the room started spinning, and a genie appeared grinning. \"I can make your dream true, but I'll need something too\" said the Genie \"Absolutely!\" said the boy quite acutely. \"You see, I'm a programmer, but I have no glamour. I'm not very good, but I think I can program you. It may not work great, is that understood?\" said the Genie and without pause, the boy glanced over this clause. \"Let's do this!\" said the boy as the genie let out a hiss. The room turned dark and the boy was knocked out stark. When he awoke, he thought he had a stroke. He couldn't even move, when he thought he'd improve. \"WHAT IS HAPPENING!?!\" yelled the boy when his head started to ring. \"Hello?\" said the boy. \"I just thought you should know... You now move with VI, but try not to cry... It's easy with time, you'll find it sublime... I'll give you a map, to help fill the gap...\"</p>\n<p>Type :help in the game to view the commands.</p>\n<p>I suck at poetry, but you get the idea. :P</p>\n<p>Thank you, Butterscotch Shenanigans for putting together this Game Jam. Thank you BScotch Discord community for giving me some people to talk to. It was fantastic working alongside you all this weekend!</p>\n<p>I believe I covered all 3 themes, but it might be stretching:</p>\n<ul><li>Cursemas Eve (Boy got his DNA altered by the Cursemas Eve genie so he could be a robot, the genie trick was that he can only move with VI controls because the crappy genie dev was too lazy to put in ones that were better suited.)</li><li>DNA Chaos (^^^)</li><li>Wrenches 101 (You're observing wrenches in their natural habitat and learning about their attack methods. What more could you want?)</li></ul>\n<p>As far as the achievements, I believe I met these:</p>\n<ul><li>Maverick (Team size 1)</li><li>Gameboy (4-color GB palette, 8-bit sfx)</li><li>Healthy Living (Stopped to exercise every couple hours. Ate nothing but chicken/rice and plain oatmeal. Slept 8+ hours)</li><li>Mozart (Composed my own music, which can be silenced with :sound)</li><li>Iron Triangle (Use primarily triangles. This one may be reaching a bit?)</li></ul>", "metacritic": null, "released": "2019-07-14", "tba": false, "updated": "2019-07-15T03:57:20", "background_image": "https://media.rawg.io/media/screenshots/08b/08b1ae3aa93842463f5364cbb4ea02de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["BytePen"], "genres": ["Action"], "publishers": [], "esrb_rating": null}