{"id": 341552, "slug": "tales-from-the-road", "name": "Tales from the Road", "name_original": "Tales from the Road", "description": "<p>Tales from the Road is a slice of life interactive fiction game with a furry theme. The game features a story about a disgruntled contract worker whose grown bored of their work. The first chapter of the story features an introduction to our core cast of characters and explores the player character’s (PC) dissatisfaction with their current situation. The second chapter expands upon the relationships and backstory of the PC and introduces an important story aspect which will be heavily expanded upon in the future. The script for the story is currently 15,000+ words long, with 2 of the chapters being completed, and the 3rd being a work in progress. Total playtime should be around 1 - 2 hours.<br/></p>\n<p>The gameplay is simple. The game is entirely text-based and is played from a command window environment. You can navigate the world using the usual commands of ‘north’, ‘south’ ‘west’ ‘east’ 'talk'  and by typing the name of the thing you are trying to interact with. There’s no combat or anything like that, making this game very story driven. There just wasn’t really a place for a combat system given the story I’m trying to tell.</p>\n<p>This game is mostly safe for work. There is swearing, but it's casual. Nothing beyond an F-bomb.<br/></p>\n<p>The game features a save system, allowing you to come back and play it at any time. Please note though that due to the current experimental state of the game current save files might not be compatible with later versions of the game. I've done my best to keep everything cross-compatible, so odds are it would only end up being a problem very late into the games development, if at all.</p>\n<p>This is an early version of the game. Bugs might happen, there might be some odd design issues. If you encounter either of those things just let me know on here, on GitHub or on Twitter and I’ll do my best to try and fix them. Just remember, I'm not a senior dev with years of experience, I'm just a lowly computer science student. This whole thing is very much a learning experience for me. </p>\n<p>As of right now I'm primarily trying to see if it's worth investing more time into developing this game, so feedback of any kind is greatly appreciated! See this blog post titled \"Interest in the Game Given its Current State\" for more info.</p>\n<p>I created this game entirely in Python, using the Pycharm IDE. Tales from the Road will always be completely free and open source. Donations are accepted but not expected, especially at this stage.</p>\n<p>Well, I think that’s about it. If you want more info on the project check out the GitHub page, I try to post some insight into my writing and development process every so often on there.</p>\n<p>Hope you enjoy the game!\r\n</p>", "metacritic": null, "released": "2019-07-12", "tba": false, "updated": "2019-07-15T05:33:27", "background_image": "https://media.rawg.io/media/screenshots/5ba/5ba30fe8beaf435d4023e9038201750f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iforgotmybrain"], "genres": [], "publishers": [], "esrb_rating": null}