{"id": 341690, "slug": "amtrak-train-driving-simulator", "name": "Amtrak Train Driving Simulator", "name_original": "Amtrak Train Driving Simulator", "description": "Dive right into this amazing train simulator game, where you have to transport civilians to their destinations and transport cargo. With each passing task , it keeps getting more difficult.<br/>As a train driver this driving simulator would put you in tight spots, where you have to use your maneuvering skills and get the job done !<br/><br/>Euro train simulator 2018 is perfect fun for both adults and kids who love Trains &amp; Train Games. Pick up passengers from stations, or carry some freight.<br/>Once you are in, the train express is all yours to control. <br/>Train sim 2018 is our first train transporter game , feature-rich railroad simulation games covering every major destination in the world. <br/>Featuring an intuitive, easy to use interface, the game lets users play Career Mode to accomplish each scenario and unlock new trains and routes. <br/>Control your favorite historical or modern trains perfectly recreated in 3D. Drive the trains, sit in passenger cars, or simply view the train from the ground as it comes towards you. <br/>This professionally made Train Simulator has something for every Train fan. Travel the beautiful environments across euro.Train Simulator 18 is where you can learn how to maneuver a real train.<br/><br/>Locomotive Train Simulator 2018 is the latest train simulator that will allow you to become the best train driver! Beautiful environments, amazing trains, wonderful features will make you feel like driving a real train! <br/>Download for free the best Train Simulator Game.<br/><br/><br/>Features :<br/><br/>- Pick up &amp; drop the passengers <br/>- Realistic train physics <br/>- Immersive audio<br/>- Unbelievable scenes &amp; locations<br/>- Easy controls<br/>- Free Train Simulation Game play<br/>- Challenging tracks<br/>- Challenging tasks<br/>- Free app for kids and adults<br/>- Accelerate &amp; halt at station<br/>- Compatible with all tabs and mobile devices", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-07-19T02:10:30", "background_image": "https://media.rawg.io/media/screenshots/b53/b53450adf81083d9a1caccacdd487095.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Toheed Ullah"], "genres": ["Simulation", "Racing"], "publishers": ["Toheed Ullah"], "esrb_rating": "Everyone 10+"}