{"id": 341681, "slug": "sweet-escapes-build-a-bakery", "name": "Sweet Escapes: Build A Bakery", "name_original": "Sweet Escapes: Build A Bakery", "description": "Build a delicious world in Sweet Escapes! Conquer sinfully sweet matching puzzle games to build and design a village of sugary shops, with each bakery specializing in a different decadent dessert. <br/><br/>From fresh food &amp; mouth-watering pastries to premium ice cream to chocolate candy confections and the sweetest soda, you'll design each bakery to prepare and offer an array of delicious indulgences to your toon friends and customers.<br/><br/>Play match 3 puzzle games to build your shops. Enjoy tasty food and dessert-themed puzzles where matching the right candy pieces and combinations gets you a delicious victory!<br/><br/>Adventure with JOY, a lovable rabbit and your dedicated assistant, and an ever-growing crew of fun and hilarious animals. Let your friendship blossom as you build your candy shops.<br/><br/>Your animal friends are always there to support you throughout your story… unless the Health &amp; Safety Inspector has his way.<br/><br/>Resurrect a rundown bakery to world-renowned glory. Create a candy shop dedicated to every iteration of sugary, succulent sweets. Launch a high-end soda shop that takes the bubbly beverage to new dessert-themed heights. <br/><br/>Start building a town, baking delicious sweets and have a blast with Sweet Escapes!<br/><br/>Sweet Escape Features:<br/><br/>TOWN BUILDING<br/>● Design a virtual town of sweet shops dedicated to delicious desserts.<br/>● Redesign an existing bakery and build new ones.<br/>● You decide what each bakery and shop looks like &amp; what sweet desserts you’ll and offer.<br/><br/>BAKING ADVENTURE<br/>● Choose the mouth-watering items you want to make.<br/>● Build menus for your bakery – cookies, candy, pastries and more!<br/>● Offer special events to your customers. <br/>● Bakeries, soda shops, candy shops and more!<br/>● Tend to the surrounding land while planting &amp; harvesting fruits and herbs for your recipes.<br/><br/>PUZZLE GAMES<br/>● Fun and enticing dessert-themed matching puzzles.<br/>● Find sweet, unique boosters and exploding combinations - an endless stream of indulgent fun and creativity!<br/>● Match 3 - swap and match pieces to play!<br/>● Stuck in a jam? Use power-ups to crush the problem!<br/><br/>ANIMAL TOON STORY<br/>● Watch a crew of lovable animals rally together to help you build and run your shops.<br/>● Every animal friend has their own unique talent and passion for dessert!<br/>● Crush the challenges from the kooky Health &amp; Safety Inspector with his ridiculous list of demands.<br/><br/>Start a baking, matching, building adventure with Sweet Escapes! Download now!<br/><br/><br/>Sweet Escapes is free to play, though some in-game items can be purchased to help boost gameplay. If you don't want to use this option, simply turn it off in your device's Restrictions menu.", "metacritic": null, "released": "2019-07-18", "tba": false, "updated": "2019-07-29T07:56:07", "background_image": "https://media.rawg.io/media/screenshots/660/6606fb5f89ef8dfd993983e5e83e10b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Redemption Games"], "genres": ["Puzzle"], "publishers": ["Redemption Games"], "esrb_rating": null}