{"id": 341654, "slug": "my-monster-town-airport-game", "name": "My Monster Town: Airport Game", "name_original": "My Monster Town: Airport Game", "description": "Do you want to visit an interactive airport and play pretend? Then this app is perfect for you! Touch, drag, interact, and use your creativity while you play in this huge airport! This is a fun game where kids don't have any boundaries, they can do whatever they want. <br/><br/>Exciting things to do in this app: <br/><br/>1. Luggage Security Checkpoint<br/>Scan all the suitcases and bags and see if everything is safe for the flight. Prepare for check-in!<br/><br/>2. Explore Different Airport Shops<br/>There are various shops at the airport where you can enjoy while waiting for your flight. Don't forget to buy awesome things at the stores and try them on!<br/><br/>3. Cafeteria<br/>Feeling hungry at the airport? There's lots to eat at the airport cafeteria! Burgers, pizzas, cakes - this cafe has it all! Select your favorite monsters and feed them delicious food.<br/><br/>4. Two Floors of Fun<br/>There's not just one but TWO floors for kids to explore! Head over to the escalator and go to the upper floor. Kids can tap on anything they like and play however they want. We encourage curious little kids to discover fun things themselves and set their imagination free!<br/><br/>Key features:<br/>* 9 awesome monster characters to play with!<br/>* Perfect for kids of ages 3-8.<br/>* Full of exciting surprises and interactions!<br/>* Two floors of pretend play fun. Lots to play!<br/>* No annoying ads or pop-ups. Completely safe for kids.<br/>* No internet connection required. Play offline! Perfect for travel days.<br/>* No in-app purchases. 100% free!<br/><br/><br/>Download now and enter the Chompy town airport right away!", "metacritic": null, "released": "2019-02-08", "tba": false, "updated": "2019-07-19T01:57:43", "background_image": "https://media.rawg.io/media/screenshots/3a5/3a59a55345a5025d4d71a4171cfcb5e1_6IXeNht.jpg", "website": "http://www.idzdigital.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IDZ Digital"], "genres": ["RPG", "Family"], "publishers": ["IDZ Digital Private"], "esrb_rating": "Everyone 10+"}