{"id": 341652, "slug": "my-princess-town-doll-house", "name": "My Princess Town - Doll House", "name_original": "My Princess Town - Doll House", "description": "Have you always wanted to be a princess and be in your fairy tale dream house? Then your wish has come true! Now you can be a princess in your very own doll house. Explore the huge castle and play pretend! It's a fantasy world where there's no limit to creativity and fun.<br/><br/>* Play Princess Games<br/>You can create your very own original princess story in this unique castle. You can even dress up every little princess in this game. Choose cute dresses and show off your fashion sense in these princess games.<br/><br/>* Princess Throne Room<br/>Make the characters sit on shiny thrones and have a royal discussion! Eat yummy food and talk about the happenings of the town. Explore every corner of this room to find and hidden secrets!<br/><br/>* Princess Kitchen<br/>Whenever your princess is hungry, just head over to the kitchen and get some munchies. Feed yummy food to the characters and prepare some more food for later! There are lots of usable items here. There's always something cooking in this royal kitchen!<br/><br/>* Princess Bedroom<br/>Develop your storytelling skills by playing pretend. In the princess bedroom, you can check out the wonderfully designed room filled with awesome items. Help your princess get ready in your doll house.<br/><br/>Key Features:<br/>- 15 new characters including princesses,  princes, kings, queens and soldiers.<br/>-  Various royal items to play with!<br/>-  Touch, drag and explore every object and see what happens!<br/>- This Princess dream house is completely safe and ad-free!<br/>-  Made for kids of ages 6-8, but everyone will enjoy playing in this doll house.<br/><br/>Be a princess right away and start ruling your kingdom from your castle. Download now!", "metacritic": null, "released": "2019-07-11", "tba": false, "updated": "2019-07-19T01:56:46", "background_image": "https://media.rawg.io/media/screenshots/02a/02a94650cbf579717d1b9a2eb1803c49_hWddWXz.jpg", "website": "http://www.idzdigital.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IDZ Digital"], "genres": ["RPG", "Family"], "publishers": ["IDZ Digital Private"], "esrb_rating": "Everyone 10+"}