{"id": 341615, "slug": "fishing-sim-world-pro-tour-giant-carp-pack", "name": "Fishing Sim World: Pro Tour + Giant Carp Pack", "name_original": "Fishing Sim World: Pro Tour + Giant Carp Pack", "description": "Fishing Sim World Pro Tour + the Giant Carp Pack in this BIG fish bundle.  <br/><br/>Fishing Sim World: Pro Tour features an authentic career mode where you work your way up to an elite angler. Compete against over 100 of the best anglers on the planet including Ali Hamidi across Carp, Bass and Predator fishing. Unlock sponsorship offers, gain career earnings and social media followers. <br/><br/>The Giant Carp Pack features two incredible venues – the historic Wraysbury 1 South Lake and the incredible Gillhams Fishing Resort in Thailand. <br/> <br/>Wraysbury is one of the most historic carp fishing venues of all time. With around 500 carp, topped by Mary at 56lbs. You can also fish for pike, tench, bream and roach as well as the 25 different trophy fish.  <br/><br/>Gillhams is a fishing paradise in Thailand. Despite only 12 acres in size, there are 5 brand new species of fish - arapaima, siamese carp, redtail catfish, mekong &amp; black pacu with each reaching staggering weights including Arapaima to over an incredible 560lbs!<br/><br/>Online features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/><br/>1 player<br/>Network Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer<br/>DUALSHOCK®4<br/>Online Play (Optional)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2019-07-18", "tba": false, "updated": "2019-10-23T14:57:06", "background_image": "https://media.rawg.io/media/screenshots/607/6070af17f4f0c4991d0b5940cb5af69c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Dovetail Games"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}