{"id": 341781, "slug": "egypt-solitaire-match-2-cards-card-game", "name": "Egypt Solitaire. Match 2 Cards. Card Game", "name_original": "Egypt Solitaire. Match 2 Cards. Card Game", "description": "Egypt Solitaire. Match 2 Cards isn't just a card game, it’s a real journey! 120 unique card deals in a mysterious Egyptian atmosphere to help you immerse yourself in a story of ancient times!<br/><br/>This game is sure to be enjoyed by all who play patience games like Solitaire, Spider, Pyramid, Klondike, Medici, Vampire, Diamond, Nines, Fool’s, Three, Hearts, Freecell, Half Moon, Golf, Three Towers, Yukon, Forty Thieves, Scorpion, Tower, Canfield, Algerian, Montana, Eight Off, Calculation, Clock, and King, Queen, Knave. Whatever the form of solitaire, playing it is always fun because the gameplay has withstood the test of time!<br/><br/>Archaeological digs in ancient places are always unpredictable! You never know what surprise may await you. Learned archaeologists and courageous adventurers spend all their time exploring the ancient places of Egypt in search of old artifacts and treasures. Prove that you’re the best of them! Be the first to reveal the secret of the ancient pyramids and solve the mystery of the pharaoh!<br/><br/>Egypt Solitaire. Match 2 Cards was created for those that love adventure and unusual deals! Find and quickly match pairs of cards and a special multiplier will increase your reward! Buy bonuses for coins: shuffle, mulligan and Joker. Collect the required amount of gold cards and use them to unlock the following packs. Choose your difficulty mode – the Professional mode is a true challenge for solitaire connoisseurs! Pleasant music and premium-quality graphics will help you immerse yourself in the atmosphere of the ancient world!<br/><br/>Don’t sit twiddling your thumbs! Onward to adventure in Solitaire Egypt Match!<br/><br/>– Solitaire card game for new players and experts alike!<br/>– Unique game mechanics: choose pairs of cards<br/>– Use bonuses: Joker, mulligan and shuffle<br/>– Collect gold cards to complete levels and unlock the next area<br/>– Collect bonus cards and get extra coins and bonuses<br/>– Pick up cards faster to increase your combo multiplier and get more coins<br/>– 12 locations, 120 levels and several in-game difficulty modes<br/>– For daring players, special tasks and over 20 colorful trophies<br/>– Premium-quality graphics to create an atmosphere of adventure!<br/>– Original themed decks and 9 card backs<br/>– Beautiful music to help you relax and concentrate on the game", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-07-19T02:51:23", "background_image": "https://media.rawg.io/media/screenshots/7ca/7ca9000897ef533eea4982e799dc8a11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["8Floor"], "genres": ["Board Games", "Card"], "publishers": ["8Floor"], "esrb_rating": "Everyone 10+"}