{"id": 341782, "slug": "mr-grouchs-clean-sweep", "name": "Mr. Grouch's Clean Sweep", "name_original": "Mr. Grouch's Clean Sweep", "description": "It’s spring, and that means it’s time to clean house! And Mr. Grouch needs a little help.<br/><br/>Join him in this collection of mini games that’s targeted at younger players, but ideal for adults as well. Help Mr. Grouch de-clutter in a hidden object game, help him match items in his house, repair broken paintings in sliding puzzle and more! <br/><br/>Set in the world of Mr. Grouch, Clean Sweep features four mini games that are designed to teach kids pattern recognition, word to object pairing, and early stage spatial awareness. <br/><br/>Hidden Object Game - Mr. Grouch is decluttering! Help him find items he wants amongst all the clutter.<br/><br/>Matching Game - Mr. Grouch has lost his glasses and needs a little help knowing what items he has and which ones to keep or throw out. Help him by matching the item to the word.<br/><br/>Broken Paintings Game - Bubbles, Mr. Grouch’s dog, has been mischievous again and has broken several of Mr. Grouch’s paintings. How naughty! Help Mr. Grouch re-assemble each painting in this ‘sliding block’-style puzzle game.<br/><br/>Two-of-a-kind - Mr. Grouch is sorting out his household items. Help him match up each item within the time limit.<br/><br/><br/>Game Features:<br/>- Separate Kids / Adults difficulty level for younger and older players<br/>- High quality game art and animations<br/>- Four mini-games, and multiple game levels equals tons of replay-ability<br/>- High score feature for each game<br/>- No Ads, No In-App Purchases, No Marketing<br/><br/><br/>And if you like Clean Sweep, check out Mr. Grouch’s Lawn Invasion for more puzzle action featuring Terrance, Thomas and Delina Mole!", "metacritic": null, "released": "2019-04-12", "tba": false, "updated": "2019-07-19T02:51:56", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee381568374f9cb45057335a0b98e700.jpg", "website": "http://www.downsideupgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Downsideup Games"], "genres": ["Family", "Puzzle"], "publishers": ["Downsideup Games"], "esrb_rating": "Everyone 10+"}