{"id": 341795, "slug": "mr-grouchs-lawn-invasion-hd", "name": "Mr. Grouch's Lawn Invasion HD", "name_original": "Mr. Grouch's Lawn Invasion HD", "description": "Join Terrance, Thomas and Delina Mole in this Othello-style puzzle game that’s ideal for older kids as they learn spatial awareness, problem solving and develop rules-based understanding.<br/><br/>Mr. Grouch is retired and wants an easy life, but that doesn’t stop the local countryside moles from playing games and digging molehills — all over Mr. Grouch’s front lawn!<br/><br/>Mr. Grouch’s Lawn Invasion is a casual puzzle game with multiple game modes including campaign story mode, two-player, and more. Follow the main story with over 30 levels and journey along with Terrance and Thomas as they put a stop to naughty Daryl’s mole-bullying antics, or just play a one-shot game versus the AI.<br/><br/>Lawn Invasion offers a blend of Othello (“Reversi”) style board gaming, with tonnes of extras like Earthmines, fire crackers, dog treats (did we introduce Mr. Grouch’s dog, Bubbles, yet?), and more.<br/><br/>Strategy and intuitive gameplay combine in a game with more depth than at first glance.<br/><br/><br/>Key game features:<br/>- 30 levels of molehill digging fun, hiding from Mr. Grouch, running away from Bubbles the dog and much, much more.<br/>- Play as Terrance or Thomas, and unlock Delina Mole and (eventually) naughty Daryl too!<br/>- Adjustable difficulty settings Easy/Medium/Hard to scale game AI strength<br/>- Nightmare game mode for the hardest challenge possible!<br/>- Five different level themes with extra puzzles, shot clock timers, and other obstacles.<br/>- Vibrant and colorful 3D animated characters and environment<br/>- Unique composed music (HD features extra songs!)<br/>- 16 Game Center Achievements<br/>- Interactive game boards (tap the BBQ!)<br/><br/>HD game features:<br/>- Made for Kids<br/>- Additional music content<br/>- Updated artwork<br/>- No Ads, No Marketing<br/>- No In-App Purchases", "metacritic": null, "released": "2019-04-04", "tba": false, "updated": "2019-07-19T02:57:24", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbf376d12c8daf82dbde7bb1d51ce892_fyVYuKZ.jpg", "website": "http://www.downsideupgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Downsideup Games"], "genres": ["Family", "Puzzle"], "publishers": ["Downsideup Games"], "esrb_rating": "Everyone 10+"}