{"id": 341771, "slug": "mr-grouchs-lawn-invasion", "name": "Mr. Grouch's Lawn Invasion", "name_original": "Mr. Grouch's Lawn Invasion", "description": "Join Terrance, Thomas and Delina Mole in this Othello-style board game.<br/><br/>Mr. Grouch’s Lawn Invasion is a casual puzzle game multiple game modes. Follow the main story where naughty Daryl kidnaps Delina and Terrance and Thomas must join forces to rescue her, all while avoiding Mr. Grouch and his dutiful dog companion, Bubbles. <br/><br/>Additional game modes include: 2-Player, Nightmare, AI-play, and Relaxation mode.<br/><br/>Strategy and intuitive gameplay combine in a game with more depth than at first glance.<br/><br/><br/>Key game features:<br/>- 30 levels of molehill digging fun, hiding from Mr. Grouch, running away from Bubbles the dog and much, much more!<br/>- Play as Terrance or Thomas, and unlock Delina and Daryl.<br/>- Five difference level themes with additional puzzles, shot clock timers, and other obstacles.<br/>- Vibrant and colorful 3D animated characters and environment<br/>- Unique music<br/>- Interactive game boards and achievements<br/><br/><br/>Mr. Grouch’s Lawn Invasion Story Mode is free to play up to level nine. AI play and 2-player game modes are also free. Autumn, Winter and Spring are premium levels and can be purchased via in-app purchase. This game features third-party ads, which are removed when a season is purchased.", "metacritic": null, "released": "2016-06-28", "tba": false, "updated": "2019-07-19T02:46:12", "background_image": "https://media.rawg.io/media/screenshots/042/0428ff4660ebe0a20be723f56b8c0c99_f8xF9Tw.jpg", "website": "http://www.downsideupgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Downsideup Games"], "genres": ["Family", "Puzzle"], "publishers": ["Downsideup Games"], "esrb_rating": "Everyone 10+"}