{"id": 341706, "slug": "guns-cars-and-zombies-turbo", "name": "Guns, Cars and Zombies! Turbo", "name_original": "Guns, Cars and Zombies! Turbo", "description": "You asked, we delivered! Play the #1 Racing Game Guns, Cars, Zombies - now on the Skillz platform!<br/><br/>Test your mettle against other players in the most epic post-apocalyptic online racing game for mobile. Select your vehicle, choose your weapon, and race against the clock to be the victor in this one-of-a-kind racing challenge that lets YOU put your money where your mouth is.<br/>\u2028Can you rise to the top in the zombie apocalypse?<br/><br/>▶ CASH PRIZES ◀<br/>Play tournaments in practice mode for tokens!<br/>Compete against top players for real world cash prizes!<br/><br/>▶ BEST 3D GRAPHICS ◀<br/>Crisp, immersive graphics!<br/>Fast, responsive gameplay!<br/><br/>▶ AMAZING ENVIRONMENTS ◀<br/>4 world environments!<br/>New weather effects!<br/>Hundreds of unique combinations!<br/><br/>▶ DEADLY WEAPONS ◀<br/>Mount weapons to be more deadly!<br/>Shoot zombies to survive!\u2028<br/><br/>▶ BRAND NEW COMBO GAME MODE ◀<br/>DRIVING MODE: Put the pedal to the metal as you race to the finish line while securing your score!<br/>TURRET MODE: Get out of the driver's seat, hop in behind the turret, and shoot down all of the zombies for extra points!<br/><br/>▶ HOW TO PLAY ◀<br/>Hit zombies and avoid obstacles on the road!\u2028<br/>Shoot zombies for points!\u2028<br/>Fulfill your primary and secondary objectives!<br/>Make it to the finish line with enough time to trigger TURRET MODE!<br/><br/>▶ HINTS ◀<br/>Make sure you play with your device connected to the internet to compete in tournaments and earn prizes.<br/>Test your luck in practice mode before competing for the big bucks!<br/><br/>▶ RESTRICTIONS ◀<br/>Cash tournaments are available in about 75% of the world. <br/><br/>Cash tournaments are not enabled in the following U.S. states: AZ, AR, CT, DE, FL, LA, MD, MT, SC, SD, and TN. If you don't live in a cash-enabled region, you can still play for fun with our virtual currency.<br/><br/>Globally, Cash Tournaments are not available in: Afghanistan, Bosnia and Herzegovina, Belarus, Bulgaria, Democratic Republic of the Congo, Cote d'Ivoire, China, Cuba, Egypt, France, French Guiana, French Polynesia, French Southern Territories, Greece, Croatia, Indonesia, Iran, Iraq, Italy, Japan, North Korea, South Korea, Lithuania, Montenegro, Macedonia, Malaysia, Myanmar, Nigeria, Pakistan, Romania, Serbia, Russia, Sudan, Slovenia, Syria, Turkey, Ukraine, Vietnam, Kosovo, Zimbabwe <br/><br/><br/>▶ PLEASE NOTE ◀<br/>You must be 13+ to play GCZ Turbo!<br/>GCZ Turbo! is free to play, but it contains items that can be purchased for real money. You can toggle these purchases on/off in the \"\"Restrictions\"\" menu on your device.\u2028<br/><br/>What are you waiting for?! Start your engines, and don’t forget to rate us in the store!", "metacritic": null, "released": "2018-08-18", "tba": false, "updated": "2019-07-19T02:16:36", "background_image": "https://media.rawg.io/media/screenshots/580/580702addedbc91e3b7c35723f063595_zbiuUIH.jpg", "website": "https://denalistudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["DENALI GAMES"], "genres": ["Action", "Sports", "Racing"], "publishers": ["DENALI GAMES"], "esrb_rating": "Mature"}