{"id": 341787, "slug": "pizza-panic-2-lite", "name": "Pizza Panic 2 Lite", "name_original": "Pizza Panic 2 Lite", "description": "Pizza Panic 2 - A new kind of match 3! It’s grand opening day! Swipe to match 3 or more ingredients and earn game cash. Customers will begin to appear in your shop complete with hungry bellies. Swipe through the ingredients to match and complete the requested orders to rake in the dough (see what we did there?). But be careful, the longer a customer is kept waiting, the thinner their patience gets. Angry customers will storm out of your shop and you will lose the sale.<br/><br/>Special items will add an additional game boost including a Power Pizza - automatically completes and serves an active order, Power Bomb - matches all items within one space, Clock - adds a few seconds to the clock, and Game Coins - game currency for use in the Coin Shop.<br/><br/>Earn game cash and xp as you progress through 100 levels in the game, unlocking items along the way. Use your game cash in the Shop to purchase additional ingredients, recipes, boosts to maximize your profits, treats to calm angry customers down, and drink stand upgrades. There is also an additional currency, game coins, that you can use in the Coin Shop to purchase additional recipes that require less ingredients and bring your business more profit than the standard recipes.<br/><br/>Panic is sure to ensue as your eyes race across the board to catch everything before your business goes belly up! Can you stand the heat in this culinary chaos? Or will you fold under the pizza pressure?<br/><br/>Features:<br/>* Up to 100 Levels of XP<br/>* Tons of Unlockables<br/>* New Ingredients, Recipes, Boosts, Treats &amp; More!<br/>* Bonus Boosts for Game Coins", "metacritic": null, "released": "2014-08-12", "tba": false, "updated": "2019-09-02T05:44:59", "background_image": "https://media.rawg.io/media/screenshots/f7e/f7e5774e2056c2b99fcb919e5858fbbe.jpg", "website": "http://www.KillerBytesGames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KillerBytes"], "genres": ["RPG", "Casual"], "publishers": ["Brandon Velazquez"], "esrb_rating": null}