{"id": 341775, "slug": "tj-savage-prologue", "name": "TJ Savage: Prologue", "name_original": "TJ Savage: Prologue", "description": "Mars-5 has stopped transmitting and only TJ Savage can solve the mystery.<br/><br/>You are TJ Savage, and this is YOUR adventure!<br/><br/>--<br/><br/>It is the late 21st century. Huge corporations control much of the world’s wealth, while sophisticated criminal enterprises scoop up that which remains. Off-world mining has been established and these mega corporations -- some with more revenue than most countries -- now retrieve gold, titanium and other precious metals from moons and asteroids.<br/><br/>LunarCol is – and has been for many years – the largest of all the off-world conglomerates. It has a hand in many industries: mining, genetics, and more recently pharmaceuticals. With their Mars-5 base, LunarCol had a permanent presence on Mars. It’s purpose though? Unclear.<br/><br/>Now, the Mars-5 base has gone silent -- no longer responding to hails and only the standard broadcast telemetry from the base being received.<br/><br/>You are TJ Savage, the world’s greatest space investigator and detective. Or at least you were. No one would disagree TJ is the best out there, but as of late, things haven’t quite been going so well.<br/><br/>That last case did not go according to plan. TJ had everything wrapped everything up, he knew who had stolen the plans, and where they had been taken; wrapped everything up apart from one detail, that is. One minor detail: he had got something wrong. <br/><br/>A crisis of faith, and an uncertain future is where TJ finds himself today. And that is where this new adventure begins.<br/><br/>TJ Savage Prologue is the introduction episode to the Space Investigator series. This short adventure sets the scene and introduces the characters. Play as TJ Savage and Kathleen Hayes as you arrive on and enter the Mars-5 facility.<br/><br/>TJ Savage: Prologue, features:<br/>-\tFully voiced introductory story<br/>-\t3D game world played from an isometric view<br/>-\tPlay as both TJ Savage and Kathleen Hayes<br/>-\tListen to voice logs and journals from the base occupants<br/>-\tExplore the shuttle bay and figure out how to enter the main facility<br/>-\tHidden object and hacking puzzles<br/>-\tEstimated playtime: 20-30 minutes<br/><br/>The adventure will continue in TJ Savage: Space Investigator – Episode One.", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-07-19T02:48:01", "background_image": "https://media.rawg.io/media/screenshots/2b4/2b4db67ea16c196bebc79e618aef6d17.jpg", "website": "http://www.downsideupgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Downsideup Games"], "genres": ["Adventure", "RPG"], "publishers": ["Downsideup Games"], "esrb_rating": "Teen"}