{"id": 341835, "slug": "bedtime-stories-for-kids-2-premium", "name": "Bedtime Stories for Kids 2. Premium", "name_original": "Bedtime Stories for Kids 2. Premium", "description": "We continue to release incredibly popular game series Bedtime Stories! This time, free educational games for kids are expanded with a new game Lullaby. Heroes of our story will be amusing characters from our favorite seaside Hippo town. And it will be not only all the members of Hippo family. Today we visit a mysterious pirate ship “Red Snapper\" and find out what bedtime stories its inhabitants know. Are you ready for new exciting stories and adventures? Then Lullaby for boys and girls are waiting for you!<br/><br/>Lullaby is a special type of games. Like any bedtime story, this game is designed to help your baby to fall asleep. Simple gameplay makes it easy. A favorite cute Hippo town characters create wonderful mood before going to bed. Your child will see the most sweet and good dreams. Our free educational games for kids can make that real.<br/><br/>In a series of Bedtime games child needs to perform some simple actions to put into bed a game character. This time we do it with more than one character, but the whole family Hippo and mysterious inhabitants of the pirate ship \"Red Snapper\". Everyone does something special before going to bed. Some need to tidy up the room before going to bed, and someone has to finish work that was made during the day. Papa Leo, for example, likes to write exciting bedtime stories for children. And our grandfather Hippo is a famous developer! He looks through his telescope at the night sky and opens new unknown stars. You will need to help all our heroes. And, of course, our lullaby includes elements of development. After all, all our games are, first of all, educational games for boys and girls.<br/><br/>Try our new game from series of free educational games for kids. Hippo and all the inhabitants of the seaside town are waiting for your baby. Get into the sea of positive emotions! Stay tuned and stay with us. Our free games for boys and girls will always delight you and your children.", "metacritic": null, "released": "2016-09-20", "tba": false, "updated": "2019-07-19T03:11:34", "background_image": "https://media.rawg.io/media/screenshots/72b/72b83b9598099d00f52af974e1b2b658_BaDqfM1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oculist"], "genres": ["Family"], "publishers": ["CLEAR INVEST"], "esrb_rating": "Everyone 10+"}