{"id": 341916, "slug": "magi-episode-1-part-1-demo", "name": "Magi Episode 1 Part 1 Demo", "name_original": "Magi Episode 1 Part 1 Demo", "description": "Magi is an episodic game, that will be released in parts.\r\nPlay as a male or female protagonist, unlock spells, and learn about Ophelia's school of Witchcraft as well as it's characters. There are gender variations for each character, but currently I only have the male main character version of Part 1 completed. Each episode part will have a free demo that teases content.<br/><br/>Disclaimer: Due to the game being released in parts (so that I can do it in manageable chunks), the game-play is short and there's still a lot I need to improve upon so if that doesn't appeal to you that's completely okay. This is my first time making a game, so feedback is greatly appreciated. Part 2 Will have more features, blinking reworked sprites with undressing, new reworked backgrounds, and it will be in ren'py.<br/><br/>Pairings:<br/>M/F<br/>M/M (coming soon)<br/>F/F<br/>MFF<br/><br/>Fetishes:<br/>creampie<br/>domination<br/>submission<br/>corruption<br/><br/>Do you have a specific fetish or type of character that you like seeing? <br/><strong>The high priestess tier on patreon allows you to get your own episode version that won't affect other players. I'll create characters based off of your preferences, animations, and plot events based on your kinks as well.</strong><br/><br/>Patreon<br/><br/>Patrons also get access to speedpaints and process screenshots to take part in every step of the creation process.", "metacritic": null, "released": "2019-07-18", "tba": false, "updated": "2019-07-19T03:40:16", "background_image": "https://media.rawg.io/media/screenshots/a26/a261db734562a987f971065f8adf5384.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BeanNoodle"], "genres": [], "publishers": [], "esrb_rating": null}