{"id": 342167, "slug": "portal-brawl-tlp-tournament", "name": "Portal Brawl TLP Tournament", "name_original": "Portal Brawl TLP Tournament", "description": "<p>Portal Brawl is a fast-paced action game based on waves of enemies, whose goal is to buy better weapons to keep advancing until the end of the game.</p>\n<p>We decided to develop this game based on and inspired by games such as BoxHead, Crash Bandicoot, Mega Man, Brawl Stars, DOOM, MediEvil among others.</p>\n<p>Because it's our first game, mistakes are always made trying to cover too many things, but after a lot of effort we managed to get ahead with our own style of game.</p>\n<p>\n</p>\r\nOur history\r\n\r\n<p>Hello, we are 2 software developers, game lovers and code lovers.</p>\n<p>From a friendship formed in a working environment arises the idea to create something we really like, and offer it to the world.</p>\n<p>This is how GofioGames was born with the aim of translating our freaky ideas into video games and enjoy the result.</p>\n<p>We want to give life to our first project: Portal Brawl, with which we want to make our way through the incredible world of video game development.</p>\n<p>so that we can grow, fulfilling our dream along the way.</p>\n<p>Mattia La Spina | Fran Dioniz </p>\r\nPresentación\r\n\r\n<p>Portal Brawl es un juego de acción trepidante basado en oleadas de enemigos, cuyo objetivo se centra en la compra de mejores armas para seguir avanzando hasta el final del juego.</p>\n<p>Decidimos desarrollar este juego basándonos e inspirándonos en juegos como BoxHead, Crash Bandicoot , Mega Man, Brawl Stars, DOOM, entre otros.</p>\n<p>Debido a que es nuestro primer juego, siempre se cometen errores intentando abarcar demasiadas cosas, pero después de mucho esfuerzo conseguimos salir adelante con nuestro propio estilo de juego.</p>\r\nNuestra historia\r\n\r\n<p>¡Hola! Somos 2 desarrolladores de software, amantes de los videojuegos y apasionados del código.</p>\n<p>A partir de una amistad formada en un ambiente laboral surge la idea de crear algo que realmente nos guste, y poder ofrecerlo al mundo entero.</p>\n<p>Así nace GofioGames con el objetivo de plasmar nuestras ideas frikis en videojuegos y poder disfrutar del resultado.</p>\n<p>Queremos dar vida a nuestro primer proyecto: Portal Brawl, con el cual queremos abrirnos paso por el increíble mundo del desarrollo de videojuegos</p>\n<p>y así poder crecer, cumpliendo nuestro sueño por el camino.</p>\n<p>Mattia La Spina - Fran Dioniz</p>\r\nOur social networks\r\n<p> Facebook | Youtube | Instagram | Twitter </p>", "metacritic": null, "released": "2019-07-16", "tba": false, "updated": "2019-07-19T04:43:45", "background_image": "https://media.rawg.io/media/screenshots/c21/c21f183dcaca7c82ae8aa02d514eafef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["GofioGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}