{"id": 342344, "slug": "the-sunlit-strait-a-sunless-sea-fan-game", "name": "The Sunlit Strait: A Sunless Sea Fan Game", "name_original": "The Sunlit Strait: A Sunless Sea Fan Game", "description": "<p>Thanks for playing my game! This interactive text-based adventure is a game based in the fiction of <em>Sunless Sea.</em> <em>Sunless Sea</em> is a survival/exploration role-playing video game with rogue-like elements developed by Failbetter Games. <br/><br/>The game is set in an eldritch underworld where London has sunk below the surface and settled in an underground sea. Fallen London as it is now known is the hub of life in the caverns below the surface world, know as The Neath. The Neath contains a wide open expanse of dark ocean called The Zee. Zee Captains take rickety boats and uncertain crews out into the darkness of The Zee in search of riches, fame, and fortune. <br/><br/>The game features islands that act as self contained stories where the player makes choices to build their narrative. The style of the writing in the game is one that makes heavy use of alliteration, obtuse language, and dense wordplay. I have done my best to mimic that style in the narrative of this game. <br/><br/>This is a Choose Your Own Adventure text game. Some choices will have consequences, but due to the limited ability of my coding skills and Twine, the program that created this game, you will be on the <strong>honor system</strong> when it comes to the choices that you made. Enjoy!<br/><br/>When you see <strong>HONOR SYSTEM </strong>Check the requirements for moving forward and see if you remember having completed them. Or don't. Its up to you. <br/><br/>Here is a link to the soundtrack for the game that you can play in another window to help set the mood!<br/><br/></p>", "metacritic": null, "released": "2019-07-13", "tba": false, "updated": "2019-07-19T05:30:18", "background_image": "https://media.rawg.io/media/screenshots/6d4/6d4da1195aaa05588422735ca4d96854.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["coletroisi"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}