{"id": 342339, "slug": "dorobu", "name": "Dorobu", "name_original": "Dorobu", "description": "The Game\r\n<p><strong><em>Dorobu</em></strong> is a <strong>turn by turn</strong>,<strong> 1 v 1 tactics game</strong> where each player controls the infamous Ninja-Dwarves !</p>\n<p>The game can be entirely controlled with just the mouse in hotseat. You and a another take turns moving each ninja-dwarf across the map. </p>\n<p>The first phase of the game is symetrical : both players race to get the randomly spawning <strong>bottle of sake</strong> as fast as possible. Then once one of the players gets the objective, they become the <strong>attacking team</strong> and must bring it to the <strong>extraction point</strong> to score. The other player is the defender and must either knock the sake carrier off the map or let the turn timer run out to score. <strong>The first player to get 2 points wins the game</strong> !</p>\n<p>Every turn you play one of the units in your duo and can do <strong>1 full move and 1 special action</strong>, mentioned below.</p>\n<p>But no need to worry about remembering all this, there is a <strong>tutorial and helpful hints</strong> to teach you the game !</p>\r\nGame Elements\r\n<p>Here's a rundown of what you can expect when you play the game :</p>\r\nUI Elements\r\n<p><strong>Character portrait :</strong> Picture of the the face of the currently active ninja-dwarf, handsome isn't he ?</p>\n\n<p><strong>Move button :</strong> At the begining of the turn, a dice roll determines the unit's movement allowance for that turn, indicated by the counter, click on the button and then a selectable tile to move the unit there, movement can be done in multiple bursts</p>\n\n<p><strong>Score counter : </strong>There are two of these at the top of the screen, one for the black team and one for the purple team, if one of these gets to 2, that player wins the game</p>\n\n<p><strong>Turn counter :</strong> Indicates the amount of full turns have been played so far. When one of the players obtains the sake, a turn timer starts and if it runs out, the defending team gets a point and the match is reset</p>\n\n<p><strong>End turn button : </strong>Found at the bottom right of the screen, the end turn button can be pressed at any time such as when your ninja-dwarf has done all his actions for his turn. Then, pass the mouse to your opponent an see what happens !</p>\n\n\r\nEnvironment\r\n\n\n\r\n\r\nSpecial Actions\r\n<p><strong>Grappling Hook :</strong> Always available to all units, unit can hook onto specific blocks on the map and get to higher (or lower) platforms, can also pull allies and enemies closer</p>\n\n<p><strong>Fireworks :</strong> One use item, unit can fly away to 8 tiles in any direction, will also push all units around starting position by 1 tile</p>\n\n<p><strong>Smoke Bomb : </strong>One use item, can be thrown onto specific areas to block those tiles from being moved on until next turn</p>\n<p> </p>\n<p><strong>Hammer : </strong>One use item, when next to another unit, can be used to knock them back 8 tiles including onto traps and lava</p>\n\r\nThe Team\r\n<p>This game is the result of two months of work as 2nd year game design students based in Lyon, France. We were inspired by the funny and off the wall tone and more seriously by japanese culture. We were inspired by a plethora of games including <strong><em>Worms, Final Fantasy Tactics, Pit People</em></strong> to name a few. </p>\r\nThe team is :\r\n<ul><li><strong>Aaron Mai</strong><ul><li>Project Lead - VFX/Game Design</li></ul></li></ul>\n<ul><li><strong>Severin Jacob</strong><ul><li>Level Design/Art - Game Design</li></ul></li></ul>\n<ul><li><strong>Nathanael Angevin</strong><ul><li>Programming - UI/Game Design</li></ul></li></ul>\n<ul><li><strong>Kilian Baptendier</strong><ul><li>2D/3D Art - QA - Game Design</li></ul></li></ul>\n<ul><li><strong>Emmanuel Errard</strong><ul><li>Programming - Sound/Game Design</li></ul></li></ul>\n<ul><li><strong>Luc Bordas - Linchius</strong><ul><li>Additionnal Music</li></ul></li></ul>", "metacritic": null, "released": "2019-07-15", "tba": false, "updated": "2019-08-28T23:15:16", "background_image": "https://media.rawg.io/media/screenshots/28e/28e5b6cef8a0d3e487064bbd320b5a43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Faders", "Kilian Baptendier", "Okkoo", "Severin Jacob", "Aaron MAI"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}