{"id": 342396, "slug": "screamin-meemies", "name": "Screamin' Meemies", "name_original": "Screamin' Meemies", "description": "<p>Pilot your submarine to the hellmouth and collapse it with torpedoes to save humanity. Engage your sonar with <em>THE POWER OF YOUR VOICE!</em><br/></p>\n<p>Screamin' Meemies was created as my entry to the 2019 Butterscotch Shenanijam. <br/></p>\n<p><strong>Theme:</strong> Cursemas Eve</p>\n<p><strong>Controls:</strong></p>\n<ul><li>Right mouse click (and hold): pilot your submarine.</li><li>Left mouse click: fire torpedoes.</li><li>Yell \"PING\" into your microphone: use your sonar.<ul><li>Make sure your microphone device and gain are properly adjusted on the title screen.</li></ul></li></ul>\n<p><strong>Achievements:</strong></p>\n<ul><li>Seal Approved - Some aspect of your game is controlled by the sound of claps and/or screams.</li><li>Maverick - Your team size is 1.</li><li>Healthy Living. I was so close, but then stayed up too late at the end. But I did hit the gym and eat well!</li></ul>\n<p><strong>Version History:</strong></p>\n<ul><li><em>v1.6.2: Corrected spelling error in credits.</em></li><li><em>v1.6: Interactive menu lets you learn how to play and test your sonar.</em></li><li><em>v1.5: Allows recording device selection from main menu.</em></li><li><em>v1.4: Microphone gain, with colored bar.</em></li></ul>\n<p><strong>Thoughts:</strong></p>\n<p>Game Theme</p>\n<p>All I knew when I started Screamin' Meemies was that I wanted microphone input controlling some aspect of the game. Its mood shift to dark was unintentional. On the first day I suggested the \"sacrifice your crew to power the sonar\" mechanic to my kid as a way of rate-limiting its use (everything else was a UI nightmare), but it was just a mechanics discussion, not a way of creating a mood.</p>\n<p>As the game progressed, I wound up choosing music that really pushed me down this alley. Once I had Bensound's \"Ofelia's Dream\" in there, the idea came to me that we'd track the crew with figures to help humanize them. And then, that we'd show them as people on the end-game screen. By this point I was aware that I really wanted to make it a hard decision to sacrifice your crew.</p>\n<p>I added the sword slashing sound to the sacrifice mechanic along with human screams. I'm a tiny bit concerned with how much time I spent getting those screams just right.</p>\n<p>I love how you see your dead crew members' names on the end screen. My only regret is I didn't have time to add their partner status and number of children.</p>\n<p>Other Design Discussion</p>\n<p>The instructions screen was initially a wall of text. I like how you can now pilot the submarine around and try out the sonar. This works to as both a bit of a fun mini-tutorial (I love shooting unlimited torpedoes) and also to ensure your microphone volume is correct.</p>\n<p>You might notice the use of caps across the instructions. I took my cue from my favorite old-school game: Space Taxi (for the Commodore-64). Its instruction screen was much like this, with caps for emphasis in an age with no bolding or italics.</p>\n<p><strong>Credits:</strong></p>\n<ul><li>Microphone volume extension by HappyTearParakoopa.</li><li>The now heavily-modified submarine profile came from 'Rama', Cc-by-sa-2.0-fr</li><li>'Ofelia's Dream' from Bensound.</li><li>Sound effects from GDC giveaway via Sonniss.</li><li>Plant life from Open Pixel Project Jungle Theme.</li></ul>", "metacritic": null, "released": "2019-07-15", "tba": false, "updated": "2019-07-19T05:43:27", "background_image": "https://media.rawg.io/media/screenshots/e23/e230cef2fa601b850bdcf4e7516410a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Mike LeSauvage"], "genres": ["Action"], "publishers": [], "esrb_rating": null}