{"id": 342384, "slug": "dead-by-santa", "name": "Dead by Santa", "name_original": "Dead by Santa", "description": "When bad kids go in a mission to steal gits from Santa's house because they received coals for Christmas, the last think that they expect is to run from the crazy Mr. Claus.\r\n<p>Try to collect gifts along with other players and run away from Santa Claus' house in this crazy survival horror game, where you have to yell at your microphone to move around on his backyard. But remember, you are angry at Santa, so you will not leave the place without saying some \"nice\" words to him. <br/></p>\n<p>(Little tip: Curse words....)<br/><br/>Interpretation of theme, we had a lot of different Ideas but landed on Cursemas Eve<br/></p><p>You curse as the core mechanic. Yep.</p><p>Instructions: Player that hosts is always Santa, up to 4 other players can join. Press \"F\" to interact! Santa has to kill all other players. The others have to destroy all the presents on the map. All players other than Santa move faster with each bad word said. Santa is the exception and the list of his speed boosting words are as follows:  \"Naughty\" , \"No gifts for you!\" , \"Ho ho ho\",  \"Merry christmas\", and \"Where's my cookies\".<br/></p>\n<p>The bad words for the other players is up to you to figure out. if the game does something unusual or unwanted, please restart!</p>\n<p>IMPORTANT: The game contains frequent coarse language! Content may not be suitable for people under 14!<br/></p>", "metacritic": null, "released": "2019-07-15", "tba": false, "updated": "2019-07-19T05:40:00", "background_image": "https://media.rawg.io/media/screenshots/7c8/7c8e24a03277ef7b4ee2cfb3d0d26266.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FTWRahul", "malory98", "SunJane"], "genres": [], "publishers": [], "esrb_rating": null}