{"id": 342472, "slug": "micropul", "name": "MICROPUL", "name_original": "MICROPUL", "description": "<p><em>It's impossibly costly to harvest micropul, a new kind of matter found inside an energy core. An easier way is to shoot a micropul right on a catalyst to cause a fission and break off chunks from the core. Scientists all over the world are looking into optimizing this new physics-defying technique. “If you're smart enough, it's like using electricity to generate twice the amount of electricity! This is the future...”</em></p>\n<p><strong>Micropul</strong> is a strategic &amp; tactical tile-laying game in which the player take the role of a scientist trying to extract precious micropul matter from an energy core. The game is played as a solitaire puzzle and the player can place tiles and stones, stocking new tiles and claiming groups. The goal is to play optimally and beat your previous score.</p>\n<p>The player has a hand of tiles they must play optimally to keep a flow of new tiles coming in and, if possible, keep aside some tiles in a supply stack that will be worth more points at the end of the game. Drawing new tiles is done by activating catalysts, this is the tactical part. During the game, groups of micropul of the same color will get formed. These groups can be claimed and will be worth points if they are closed at the end of the game. This is the strategic part. Winning is done by balancing the tactical and strategic part.</p>\n<p>This video game is an adaptation of the board game <strong>Micropul</strong>, created by Jean-François Lassonde in 2004.<br/><br/></p>", "metacritic": null, "released": "2019-07-15", "tba": false, "updated": "2019-07-19T06:10:46", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0af0fbbe2dfb44be25adb1b81d0631e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MiguelPaz"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}