{"id": 342591, "slug": "oden-cart-2-a-taste-of-time", "name": "Oden Cart 2 A Taste of Time", "name_original": "Oden Cart 2 A Taste of Time", "description": "Another strange, bittersweet tale is unfolding at a tiny oden cart,<br/>and you won't believe when! Take on the role of a stubborn old<br/>oden cart owner trying to get back home in this story-driven game.<br/><br/>The customers who frequent your cart are quite the colorful bunch.<br/>Help them blow off steam by listening to their worries and woes.<br/><br/>As you do, their stories will be revealed before your very eyes.<br/>You'll see that some hopes, dreams, and fears never change.<br/><br/>And before you know it, a moving story will unfold from a few casual complaints!<br/>There may even be a surprising twist or two along the way.<br/>Be sure to see the entire story through to the end!<br/><br/>As always, we're not after your wallet. You can play the entire game for free, with no in-app purchases.<br/>Play a little bit each day as a break from your own hectic life.<br/><br/>【Story】<br/>~~~~~~~~~~~~~<br/>Everyone has their secrets.<br/>Be they silly trifles or painful events<br/>rarely spoken aloud, they are always<br/>on the tips of tongues, held back out<br/>of fear or reverence.<br/>Welcome to Edo, the City of Flowers<br/>A small cart sits on the edge of town,<br/>selling a food from the future called \"oden.\"<br/>Tonight, like all nights, customers will<br/>flock to it in search of a moment's peace.<br/>But will the cart's owner ever be<br/>able to return to his own era?<br/>The answer lies in a most peculiar<br/>story, which you are about to witness...<br/>~~~~~~~~~~~~~<br/><br/>◎How to Play<br/>【Goal】<br/>Tap or swipe the customers' gripes to listen to them. They'll feel better, and you'll sell more oden. Win-win!<br/>The customers may repeat themselves, but remember to be patient. We all need a shoulder to cry on now and again.<br/>Keep playing to see how their stories end!<br/><br/>【Playing the Game】<br/>1. Use the Restock Menu to purchase oden.<br/>2. Customers will drop in, each with their own secrets.<br/>3. Tap or swipe to listen to your customers' gripes!<br/>4. Listening to gripes keeps customers happy, and helps your bottom line!<br/>5. The more money you have, the more oden ingredients you can buy!<br/>6. Listening to a customer's gripes enough times increases their Loyalty Level.<br/>7. The higher their Loyalty Level, the longer they linger at your cart.<br/>Listen to what your customers have to say, and see how their stories unfold!<br/><br/>【Restocking Your Cart】<br/>Purchase oden to fill your cart and draw in customers.<br/>Your stock of oden will get eaten up after a while, so be sure to check in regularly and restock.<br/><br/>Helpful Hints:<br/><br/>Different customers show up depending on the oden you stock.<br/>You can find each customer's favorite food in the \"Customers\" menu.<br/>Raise a customer's Loyalty Level and they might open up to you even more!", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-07-22T02:01:08", "background_image": "https://media.rawg.io/media/screenshots/3cb/3cb2ce9d5eee5856e7a54449d29909fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GAGEX Co.,Ltd."], "genres": ["Adventure"], "publishers": ["GAGEX Co.,Ltd."], "esrb_rating": "Teen"}