{"id": 342579, "slug": "hungry-hearts-diner", "name": "Hungry Hearts Diner", "name_original": "Hungry Hearts Diner", "description": "home-cooked food. Rice balls, dumplings, tempura...you can make it all!<br/>In fact, the more you cook, the more dishes you'll unlock.<br/>And hey, you'll even get a chance to learn about good ol' fashioned<br/>Japanese cuisine while you're at it! Did you know you can make<br/>jelly out of seaweed? Because I didn't!<br/><br/>Of course, the people who visit your diner all have a story to tell.<br/>And what makes people more talkative than a full belly?<br/>Feed your customers until they feel like sitting back and spinning<br/>you a yarn or two!<br/><br/>But not every story is a happy one, and not every ending<br/>joyous. Stay tuned for some twists and turns!<br/><br/>Story<br/> ------------------------------------------<br/>On a tiny side street in a nameless little neighborhood sits an<br/>old Japanese diner. Things are quiet here; old-fashioned<br/>you might say. But of course they are. It's Showa era Japan,<br/>and the television is just starting to come into vogue.<br/><br/>Slide open the screen door and you'll see a kindly old lady<br/>hard at work behind the counter. Her husband's been sick<br/>for a while, and she's had to run the place on her own.<br/>It's hard work, but she's a tough one, and she gets by.<br/><br/>Sit down at one of the worn wooden tables, and close your<br/>eyes. Thunk thunk goes the steady beat of a knife chopping<br/>veggies. Hisss; the sound of meat sizzling in a pan.<br/>Swish swish; a whisk beating eggs.<br/>The soothing sounds of a simple kitchen.<br/><br/>Sit here long enough, and all that tension will just flow<br/>right out of you. So come on in, order a hot meal, and take<br/>a load off. The peace'll do you good.<br/><br/>So, let me guess. The question you're asking yourself right now<br/>is \"is this game for me\"? Well, maybe it is.<br/> -Do you like casual/idle games?<br/> -Do you like games where you run a shop?<br/> -Are you looking for a nice, relaxing story?<br/> -Ever played any of our other games, like Oden Cart or Showa Candy Shop? (If so, thanks a bunch!)<br/> -Are you hungry?*<br/>*Warning: This game is not edible. Please don't try to eat your phone.<br/><br/>If you answered \"Yes!!!!\" to any of the above, well,<br/>maybe this game's for you. Give it a download and a shot.<br/>It's free, so it won't cost you a dime!<br/>We very much hope it brings you a smile! Or perhaps even some tears?", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2021-06-18T04:29:37", "background_image": "https://media.rawg.io/media/screenshots/f19/f19ce899021eb6494dceceb2eb2dd258_8gwZB3Q.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["GAGEX Co.,Ltd."], "genres": ["Adventure", "Simulation"], "publishers": ["GAGEX Co.,Ltd."], "esrb_rating": null}