{"id": 342578, "slug": "showa-candy-shop-2", "name": "Showa Candy Shop 2", "name_original": "Showa Candy Shop 2", "description": "Un juego que te transporta a esa época y hace aflorar las lágrimas.<br/>¡La esperada segunda parte del popular juego!<br/><br/>Un juego sin complicaciones en el que puedes gestionar tu pequeña tienda de cuches retro si tener que estar pendiente todo el tiempo.<br/><br/>¡Cuida de tu tienda y recoge en tu álbum los dulces y los juguetes de tus recuerdos!<br/>Colecciona yogures ácidos misteriosos, un esqueleto que brilla, una ciruela en conserva...<br/>¡Anda, aquí están! Lleno de objetos nostálgicos que te harán sonreír. <br/><br/>A medida que avanzas, progresa también la historia.<br/>Una historia conmovedora que se desvela poco a poco. ¡No te pierdas el final!<br/><br/>También se ha añadido una máquina de bolas (gratuita) de las que se prohibieron.<br/>Con premios que rayan en el absurdo, pero que te traen buenos recuerdos.<br/><br/>¡Hemos recibido gran cantidad de productos de la era Showa que están al borde de la estafa!　<br/>Podrás acabar el juego sin pagar nada, así que juega un poco todos los días.<br/>Te ofrecemos un pequeño descanso en tu ajetreada vida.<br/><br/>【Historia】<br/>Una esquina del distrito 3. En plena era Showa.<br/>La ciudad es un hervidero que prepara las Olimpiadas.<br/>En una esquina de ese Tokio hay una tienda de chuches que pasa inadvertida.<br/>Es una tienda pequeña que lleva sola una amable abuelita.<br/>La abuelita siempre piensa en lo mismo mientras contempla la Torre de Tokio al atardecer:<br/>En esos días en que pasaron tantas cosas, unas buenas y otras malas.<br/>Volvamos con la abuelita a esa época.<br/>A las nubes del atardecer y al silbato de los vendedores ambulantes.<br/>A los dulces de arroz, a las canicas y a los globos.<br/>Al caramelo líquido, al kombu en vinagre y a los caleidoscopios. <br/>A aquellos días en los que cualquier cosa era como un tesoro.<br/>A la época en que no había smartphones ni internet, pero todo relucía...<br/>A las vacaciones de verano que parecían no tener fin.<br/>Esta es la historia de una abuelita corriente, como tantas otras.<br/><br/>◎Cómo jugar<br/><br/>【Objetivos】<br/>· Invertir el dinero que recibes de los clientes para mejorar la tienda<br/>· Intentar completar el álbum en el que se guardan los objetos nostálgicos<br/>· Descurbrir el final de la historia <br/>· Completar todas las colecciones de la máquina de bolas <br/><br/>【Normas básicas】<br/>(1) Aumentas los productos con «Reponer».<br/>(2) Vienen un montón de niños con sus pagas (clientes).<br/>(3) Mueve el dedo sobre los clientes y hazte con su dinero.<br/>(4) Cuando acumules dinero, ve a «Tienda» y mejora tu tienda.<br/>(5) A medida que mejores la tienda, tendrás más productos que «Reponer»<br/>(6) Y con nuevos productos, atraerás a nuevos clientes.<br/>(7) Acumulando clientes conseguirás nuevos objetos para tu álbum.<br/>Si repites los pasos del 1 al 4, acumularás dinero poco a poco.<br/>Mientras sigues con esto, completa tu álbum y asiste al final de la historia.<br/><br/>【Días de la semana】<br/>En el juego, los días van pasando de lunes a domingo.<br/>Según el día que sea, vienen unos u otros clientes.<br/>Comprueba qué día vienen qué clientes consultando tu álbum.<br/>Los días cambian a medida que pasa el tiempo, así que entra en la aplicación de vez en cuando y mira qué día es.<br/>Ten en cuenta que los días no coinciden con los días de verdad.<br/><br/>【Recuerdos】<br/>En la trastienda a veces aparecen recuerdos de la abuelita.<br/>Si los coleccionas, la historia avanzará poquito a poco.<br/>No te olvides de visitar de vez en cuando la trastienda.<br/><br/>【Máquina de bolas】<br/>Haz girar la máquina de bolas y colecciona premios ridículos.<br/>Los premios cambian según el día.<br/>A veces te tocará dos veces lo mismo, ¡no te rindas!<br/>La máquina de bolas no funciona con monedas, sino con fichas especiales.<br/>Las fichas puedes obtenerlas coleccionando recuerdos o en otros sitios.", "metacritic": null, "released": "2016-09-04", "tba": false, "updated": "2019-07-22T02:01:29", "background_image": "https://media.rawg.io/media/screenshots/2bf/2bfa632dca43c6edecdc557260f122e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GAGEX Co.,Ltd."], "genres": ["Adventure", "Simulation"], "publishers": ["GAGEX Co.,Ltd."], "esrb_rating": null}