{"id": 342570, "slug": "ar-sea-battle", "name": "AR Sea Battle", "name_original": "AR Sea Battle", "description": "Battleship is, perhaps, the only PvP guessing game that will help you and your friends to cope with boredom at any time and in any place, because absolutely nothing except the pen and paper is required to play this board game. You just need to draw a square and arrange your ships, and you're ready to play this fun PvP guessing game!<br/>But with the AR Sea Battle application, you do not even need to draw the field for this PvP board game, the technology of augmented reality will do everything instead of you! Just press the \"Start\" button and your everyday reality will be augmented and supplemented  with the stormy dark-blue sea and 10 ships (from small inflatable boats to a huge submarine)! In this virtual puzzle, as well as in the classical edition of this board game, your and opponent’s fleets consist of:<br/>• 4 single-decked boats, more like submarines<br/>• 3 two-deckers called destroyers<br/>• 2 three-deck cruiser ships <br/>• 1 four-decker battleship<br/>Only with the technology of augmented reality, your favorite guessing game will no longer be so \"unrealistic\" and \"paper\". Now your ships, as well as the enemy’s fleet, will be placed on a real blue stormy sea, which will appear anywhere you need: in the middle of your room, in a green lawn or park. In general, the sea will appear where you will be at the moment of the game playing.<br/>First of all, place your fleet.  How to locate the fleet in order to win is the main puzzle, on which the result of the game depends. Wait until your opponent does the same, and then start playing. With this guessing game you have to enter into a real battle to the bitter end. Now you're going to kill the enemy not in ordinary way crossing his boats, but with a real rocket, which you need to launch to the square where, on your opinion, the enemy’s cruiser or battle ship is located. Do not be afraid, although the events with the technology of augmented reality look very realistic, the rocket will not fly out of the phone and will not cause any harm to your room!<br/>Rock the AR Sea Battle! And Welcome to modern technologies of augmented reality!", "metacritic": null, "released": "2017-09-20", "tba": false, "updated": "2019-07-22T01:53:22", "background_image": "https://media.rawg.io/media/screenshots/6d9/6d93714c06e6fd91d0a6b717936e531d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexander Rabtsevich"], "genres": ["Adventure", "Board Games"], "publishers": ["Alexander Rabtsevich"], "esrb_rating": "Teen"}