{"id": 342658, "slug": "team-rock-blasters-game-jam-edition", "name": "Team Rock Blasters (Game Jam Edition)", "name_original": "Team Rock Blasters (Game Jam Edition)", "description": "<p>Team Rock Blasters! (Game Jam Edition) is a 2v2 team game based on the arcade classic Asteroids. In Team Rock Blasters, four players compete for points in a game of space rock blasting and gold chunk collecting madness. <br/></p>\n<p><strong>How to Play</strong><br/></p>\n<p>On each team a player takes on the role of either a Blaster or a Collector. Much like in the game Asteroids, the Blaster shoots at meandering rocks for points. Unlike Asteroids, however, players may also blast the other team's players to smithereens for points.</p>\n<p>In contrast to the Blaster, the Collector scoots around the play field collecting chunks of gold which were blasted out of the rocks by the Blaster. His only means of defense is a impenetrable shield. If he should die to rock or Blaster, however, all his gold (and points) float peacefully back into space. The team with the most points when the last rock is blasted wins</p>\n<p><strong>Controls (Controller Only)</strong></p>\n<ul><li>Rotate Ship - Left Joystick</li><li>Thrusters - Right Trigger</li><li>Fire/Shields - Bottom Button</li><li>Hyperspace - Left Button</li><li>Start - Use Controller Start or the 1, 2, 3, and 4 keys on Keyboard</li></ul><p><strong>History</strong></p><p>Team Rock Blasters! (Game Jam Edition), as the name implies, was a game I created during a Philly Game Devs \"Versus Game\" themed game jam event in 2012. I've updated the base project to Unity 2019 as a WebGL (HTML) game for play in a browser. The game is otherwise how it was created at the game jam with no modification of code or content. What you see is what you got back in 2012. I'm actually surprised that the Unity API update process worked so flawlessly. Enjoy!<br/></p>", "metacritic": null, "released": "2019-07-21", "tba": false, "updated": "2019-07-22T02:27:38", "background_image": "https://media.rawg.io/media/screenshots/a80/a80cf4f260de221a5f08caef33e9c408.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["zenasprime"], "genres": ["Action"], "publishers": [], "esrb_rating": null}