{"id": 342607, "slug": "mystery-trackers-winterpoint-tragedy-a-hidden-ob-2", "name": "Mystery Trackers: Winterpoint Tragedy - A Hidden Object Adventure (Full)", "name_original": "Mystery Trackers: Winterpoint Tragedy - A Hidden Object Adventure (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>The Agency has sent you off on another adventure to investigate a distress call from a scientific research team in Alaska. The discovery by Professor Lloyd of an ancient species trapped in the ice has revealed a traitor in their midst. Someone wants these creatures kept secret, and is willing to pay the ultimate price! <br/><br/>• WHO SABOTAGED THE WINTERPOINT RESEARCH STATION? <br/>These ancient lifeforms have the ability to control both body and mind. Is there anyone you can trust, or will you end up a slave as they try to spread to the rest of the world? <br/><br/>• DISCOVER A HIDDEN WORLD <br/>Use the abilities of your high-tech visor to examine frosty hidden object scenes. <br/><br/>• GET BY WITH A LITTLE HELP FROM A FRIEND! <br/>Your trusty sidekick will assist you in a variety of frigid puzzles and chilling mini-games. <br/> <br/>• RID THE PLANET OF COLD STALKERS IN THE BONUS CHAPTER <br/>Destroy these dangerous beings forever and enjoy additional Collector’s Edition exclusives including super puzzles and collectibles! <br/><br/>*This game is best experienced on iPhone 5/iPod Touch 5th gen and up.* <br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-04-13", "tba": false, "updated": "2020-04-10T02:12:21", "background_image": "https://media.rawg.io/media/screenshots/29c/29c131455355fd0e8fc27c7c7e22e0a1_wxsvRoN.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}