{"id": 342611, "slug": "zone-warrior", "name": "Zone Warrior", "name_original": "Zone Warrior", "description": "Defend the Solar System from alien attack!<br/><br/>Zone Warrior is a 3D space game, part space flight simulator, part arcade action.<br/><br/>Each level places you at a space station orbiting a planet in our Solar System which you have to defend, initially from space mines hurtling toward your space station. If your space station is damaged you will have to perform a manual docking for which you get points.<br/><br/>Later, alien ships are sent in after you with close space dogfighting action as you battle hoards of marauding alien fighters, intent on vaporizing your ship and laying waste to your space station.<br/><br/>You have laser cannons and a small number of smart missiles. You accumulate missiles as you go through the levels. If you need more fuel, fuel cells are available near the stations which you can collect by flying into them.<br/><br/>You can pause the game by touching the score. From there you can reverse the direction of the controls and change the sensitivity of the accelerometer.<br/><br/>PocketGamer Silver Award: \"Zone Warrior is the kind of space opera that should be on everyone's iPhone - smooth, smart and much fun to play.\"<br/><br/>Check out Apollo Eagle which is also available on the App Store.<br/><br/>Astronomical apps Moon Atlas, Mars Atlas, Venus Atlas and Planisphere are also available on the App Store.", "metacritic": null, "released": "2008-10-16", "tba": false, "updated": "2019-07-22T02:10:06", "background_image": "https://media.rawg.io/media/screenshots/964/964c0ad6b306063c4c74223cb27c9480.jpg", "website": "http://lunardevelopment.com/zonewarrior", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Julian James"], "genres": ["Action", "Simulation"], "publishers": ["Julian James"], "esrb_rating": "Teen"}