{"id": 343122, "slug": "vuess-vow-vong-vo-vold-vown-vhe-vey", "name": "Vuess Vow Vong Vo Vold Vown Vhe Vey", "name_original": "Vuess Vow Vong Vo Vold Vown Vhe Vey", "description": "Another time, another place\r\n<p>Salt Lake City, 2011. A young man fights a losing battle against isolation and insanity in a spartan, subterrene, cinder-block cell. His only weapon: memes.</p>\n<p>Desperate to make progress, he launches haphazardly into the unknown. Failure is his tutor as he transmutes guesswork into wisdom, but he can't shake the feeling that the world is having a laugh at his expense...</p>\r\nThe greatest 1D video game\r\n<p>Let's play a simple game: fill up a progress bar by pressing and releasing a single key. With a slight twist, we exalt this workaday routine to a white-knuckle, pulse-pounding odyssey: you must guess when to hold down the key and when to let it up. </p>\n<p>I call it \"Vuess Vow Vong Vo Vold Vown Vhe Vey.\"</p>\r\nParody, again\r\n<p>Back in 2011 I thought I was witty. I had finally beaten Terry Cavanagh's wonderful \"VVVVVV,\" and I got the impression that the game was trolling me. Its greatest challenge was just this: <em>guess how long to hold down the key</em>. I thought, \"I can write that from scratch.\" So I did. In C++. With a main.cpp file that went on for thousands and thousands of lines.</p>\n<p>I circulated it among some friends, and they were all furious with me.</p>\n<p>Now, for its debut on itch.io, I have fully re-implemented the game in Haskell using the same techniques I used to make \"Peoplemon.\" In fact, I did part of this work in 2017 as a trial run of those techniques. I made some slight improvements to the game play, and the new source code was so much easier than the original to write and understand that it truly isn't funny. </p>\r\nA dense swarm of ancient memes\r\n<p>What is funny is that the game is lousy with dumb internet jokes that surely no living soul now remembers. It can now, I hope, serve as a sort of museum. Gaze upon ancient, hieroglyphic mysteries like \"Even The Passenger Gets In Trouble\" and \"Mr. Body Massage Machine.\" Let your imagination run wild about what kind of lives the people who wrote them might have lived.</p>", "metacritic": null, "released": "2019-07-19", "tba": false, "updated": "2019-07-22T04:15:32", "background_image": "https://media.rawg.io/media/screenshots/739/739b3bee1987d74ebe1cf8201acf4912.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Alex Stuart"], "genres": [], "publishers": [], "esrb_rating": null}