{"id": 343114, "slug": "tsuki-no-shita", "name": "Tsuki No Shita", "name_original": "Tsuki No Shita", "description": "<ul><li>Plot</li></ul>\n<p>Leo is under the tutelage of Lancelot, knight of the round table. While he is away, Leo comes across a strange girl named Ruby. Ruby tells Leo that Gaia, the god of the world, has gone crazy. Leo and Ruby search for people wiling to stand up against Gaia.</p>\n<ul><li>Characters</li></ul>\n<p>Leo - Knight</p>\n<p>Leo is a knight in training under the training of Lancelot, knight of the round table.<br/>Leo always dreamed about protecting his home as a knight who fights for what's right,<br/>and under Lancelot's tutelage, he believes that he can become the knight he wants to become.</p>\n<p>Ruby - Gunslinger</p>\n<p>Ruby is a girl who's favorite thing in the world is guns. She's a professional gun expert<br/>and is willing to anything just to pull a trigger.</p>\n<p>Sabrina - Witch</p>\n<p>Sabrina is a shy witch who loves casting spells. Unlike most wizards and witches, Sabrina<br/>doesn't like to use her magic for her own personal gain. She only uses her magic to support<br/>her loved ones.</p>\n<p>Ren/Lupin - Thief</p>\n<p>Ren is a descendant of the phantom thief Arsene Lupin. Ren carries the Lupin name as he sends<br/>messages about what he's going to steal and then steals it with style, and gets away with it<br/>every time.</p>\n<p>Kuro - Assassin</p>\n<p>Kuro is an assassin who distances himself from other people. Ever since the death of his parents,<br/>he's been killing the same type of people who took them away from him.</p>\n<p>Axel - Demon - Male</p>\n<p>Axel is a stray demon from hell. He loves interacting with people and loves to eat. However,<br/>his demonic instincts kicks in whenever he feels threatened.</p>\n<p>Gwen - Android - Female</p>\n<p>Gwen was an android originally made to kill people. However, when she finds out one of her targets<br/>has a family, she gains a personality that believes that people deserve a second chance. Thus, killing<br/>her creator and living on her own.</p>", "metacritic": null, "released": "2019-07-19", "tba": false, "updated": "2019-07-22T04:14:01", "background_image": "https://media.rawg.io/media/screenshots/390/390436b6209b7462e75d49f2d51fecc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lkmasher"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}