{"id": 3433, "slug": "evolve", "name": "Evolve", "name_original": "Evolve", "description": "<p>Evolve is a game about hunting alien monsters. The creatures evolve during the hunt, making them a difficult prey. The game also allows the players to control the monsters.</p>\n<h3>Plot</h3>\n<p>Evolve takes place in a distant future on a faraway planet called Shear. Humans only recently colonized the planet and encountered hostile alien monsters that quickly evolve. As they consume other local animals, they can mutate into new, stronger creatures. The main protagonist in the story mode is William Cabot, a retired famous monster hunter, who comes to Shear to &quot;tame&quot; the planet and save the colonists from the monsters.</p>\n<h3>Gameplay</h3>\n<p>While the game has a single player campaign, it is oriented towards online multiplayer team deathmatches. The teams are asymmetrical: a group of four hunters opposes one monster. The hunters have to find and annihilate the monsters using their guns, jetpacks, and tracking devices. The monster&#39;s goal is to evolve. It requires him or her to prey on the smaller animals to gather experience and level up. Until the monster reaches its full power, it is very vulnerable.</p>\n<h3>Character classes</h3>\n<p>Both factions have several classes. The hunters have five characters in each of their four classes: Assault, Trapper, Support, and Medic. The monsters have five types: Goliath, Kraken, Wraith, Behemoth, and Gorgon. Both monsters and hunters only start with the basic characters and have to unlock the rest by defeating the enemies.</p>", "metacritic": 76, "released": "2015-02-10", "tba": false, "updated": "2024-01-02T00:16:54", "background_image": "https://media.rawg.io/media/games/c30/c304b2c132f6bc1b6bcec5b03417a005.jpg", "website": "http://evolvegame.com/", "rating": 2.71, "rating_top": 3, "added_by_status": {"yet": 24, "owned": 899, "beaten": 47, "toplay": 6, "dropped": 165, "playing": 5}, "playtime": 4, "achievements_count": 220, "ratings_count": 219, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 222, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["2K", "Turtle Rock Studios"], "genres": ["Action", "Shooter"], "publishers": ["2K Games"], "esrb_rating": "Mature"}