{"id": 343366, "slug": "jelly-splash-match-3-connect-three-in-a-row", "name": "Jelly Splash Match 3: Connect Three in a Row", "name_original": "Jelly Splash Match 3: Connect Three in a Row", "description": "KICK BACK and MATCH WITH A SPLASH!<br/><br/>In the mood for some gooey three-in-a-row relaxing games?<br/><br/>Play the Jelly Splash fun puzzle games!  Your favorite match-3 game combined with brain puzzles!<br/><br/>Match 3 or more Jellys in this splashtastic, addicting matching game online! Fall in love with our three in a row free online puzzle game. If you love fun-filled addictive games, join the colorful Jellys and try to match 3 or more of them in a row or diagonally to form the longest line of Jellys you can. Settle in and relax with one of the most relaxing games of all free games on your device.<br/><br/>ADDICTIVE &amp; DELIGHTFUL FREE GAME TO PLAY<br/>If you love to play match 3 games online and puzzle games tickle your fancy, get ready to experience one of the best 3 in a row games available! Defeat the evil Slimes and enjoy a Jelly-filled adventure game! You’re sure to get addicted to this yummy match 3 game!<br/>What are you waiting for?! Install and play our splashy, awesome game today! <br/><br/>Journey through loads of different levels and dozens of different three in a row challenges to free your Jelly friends. But watch out for the Slimes, who’ve taken over Jelly Land! This awesome game is waiting for you once you install Jelly Splash!<br/>With loads of fun events, big sales and huge bonuses, you’ll love coming back again and again for some relaxing matching fun.<br/><br/>★ADDICTING GAMES WITH JELLYS★<br/><br/>UNLIMITED GAME TIME – Play at your pace and keep your matching relaxed<br/>NEW LEVELS – Constantly enjoy totally new levels, events, and sales<br/>JOLLY JELLYS – Fall in love with the charming Jellys, each with their own character<br/>AMAZING CHALLENGES – Discover dozens of gorgeous worlds, while overcoming fun obstacles, winning amazing prizes in tournaments and racing up a weekly Tower<br/>75 MILLION CAN’T BE WRONG – With over 75 million fans, why not get splashing today?<br/><br/>Jelly Splash is free to download and play, but it also allows you to purchase virtual items with real money inside the game. You can disable in-app purchases in your device’s settings.<br/><br/>You may require an Internet connection to play Jelly Splash and access its social features. Jelly Splash may also contain advertising.<br/><br/>Download now and chill out with the Jellys in the splashiest match puzzle game ever!<br/>-------------------------------------------------------------------------<br/>Facebook: https://www.facebook.com/JellySplashGame<br/>Support: https://wooga.helpshift.com/a/jelly-splash/?l=en<br/>Terms of Use: https://www.wooga.com/terms-of-service/<br/>Privacy Policy: http://www.wooga.com/legal/privacy-policy/", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-24T11:09:30", "background_image": "https://media.rawg.io/media/screenshots/b7b/b7bc196c655ca586d7cd5151eca24e19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["wooga"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}