{"id": 343599, "slug": "lost-orbit-terminal-velocity", "name": "LOST ORBIT: Terminal Velocity", "name_original": "LOST ORBIT: Terminal Velocity", "description": "Stranded after his ship is destroyed in deep space, Harrison, a lowly maintenance worker and our hero, must struggle to find his way home…<br/><br/>LOST ORBIT centers around the exploration of space. Players take control of a lone astronaut who sets off on a dangerous journey to rejoin his civilization, armed with only an improvised set of equipment and a relentless spirit. Without the help of his ship, Harrison will need to use the gravitational forces of planets to navigate and propel himself through space.<br/><br/><br/><br/>Set in a world rich with comedy and tragedy, LOST ORBIT is a game filled with risk, loneliness, wonder, and death.<br/><br/><strong>A personal story </strong>-  A fully narrated story delivers a deep and entertaining experience exploring death, loneliness and madness. A fully narrated and voiced story takes you through a funny and heartwarming experience as you face mortality, family and hunger. <br/><br/><br/><strong>Beautiful Worlds</strong> - Traverse fantastical interstellar worlds on a quest to reunite with civilization and uncover the mysteries of the disaster that left Harrison stranded. Top down action has never looked this good, explore the wonder of the cosmos and find new ways to die.<br/><br/><br/><strong>Fast Paced</strong> - Travel through space at break-neck speeds! Go faster and then go faster. Upgrade your suit and utilize cosmic forces to propel yourself to the brink of death as you dodge, grind, and smash your way home. Challenge yourself to complete each level perfectly and then take to the leaderboards to challenge the world for the best times!<br/><br/><br/><strong>Challenge </strong>- 50 intense levels across 5 systems and over 15 extreme challenge levels<br/>- A derelict mining system with broken down and deadly machines<br/>- Vega, a lush and beautiful space forest with dangers around every corner<br/>- Teleport through a barnacle filled system, home of a dangerous race of creatures<br/>- Sneak through a galactic battleground, filled with destroyed ships firing laser in every direction<br/>- Blast through a crystal filled system patrolled by space pirates", "metacritic": null, "released": "2019-07-16", "tba": false, "updated": "2019-11-19T18:26:07", "background_image": "https://media.rawg.io/media/screenshots/638/6380589cfef78db65e6c5406be63d48c.jpg", "website": "http://www.pixelnauts.ca/lostorbit", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 26, "ratings_count": 2, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 2, "platforms": ["Xbox One", "Nintendo Switch", "macOS", "PC", "Linux"], "developers": ["PixelNAUTS Games"], "genres": ["Action"], "publishers": ["PixelNAUTS Games"], "esrb_rating": "Teen"}