{"id": 3437, "slug": "apotheon", "name": "Apotheon", "name_original": "Apotheon", "description": "The Gods of Olympus have abandoned humanity, leaving you to perish without their benevolence. Take up arms against the Gods, climb Mount Olympus, and take their divine powers for yourself to ensure mankind’s survival! <br/>\r\nApotheon is a fast and brutal 2D action game with a striking art style and heroic narrative based on Ancient Greek Mythology.<br/>\n<br/>\r\nFeatures:<br/>\r\n-Brutal and bloody bronze-aged combat! Slay your enemies with swords, spears, arrows, and other ancient weapons of war.<br/>\r\n-Explore the massive open world of Mount Olympus! Battle mythical beings and search for divine treasure across the Forests of Artemis, the Palaces of Apollo, and other sanctuaries of the Gods.<br/>\r\n-Guide the rise of Nikandreos, humanity’s last hero. Interact with a colourful cast of fully voiced legendary characters throughout a rich single-player experience. <br/>\r\n-Challenge your friends to single combat! In one versus one local multiplayer, pit your skills against other would-be heroes of Greece.<br/>\r\n-Learn a little about Greek Mythology! Apotheon tries to stay true to its source material. Read an excerpt from the Iliad about Diomedes before you stick a Xiphos through his Aspis.", "metacritic": 78, "released": "2015-02-02", "tba": false, "updated": "2024-01-24T22:43:10", "background_image": "https://media.rawg.io/media/screenshots/e49/e497cca0e21625b8e36614399f0b970e.jpg", "website": "http://www.apotheongame.com", "rating": 3.2, "rating_top": 4, "added_by_status": {"yet": 115, "owned": 1913, "beaten": 104, "toplay": 38, "dropped": 181, "playing": 7}, "playtime": 4, "achievements_count": 123, "ratings_count": 329, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 333, "platforms": ["PlayStation 4", "macOS", "PC", "Linux"], "developers": ["Alientrap"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Alientrap", "Alientrap Games"], "esrb_rating": "Teen"}