{"id": 34412, "slug": "reversi", "name": "Reversi", "name_original": "Reversi", "description": "The classic game of Reversi, also known as Othello, is a much-loved strategy board game. It is often described as taking only a minute to learn but a lifetime to master. Each game only takes a few minutes and can be played by all ages. This continues to be one of the most sought-after versions of the game for the natural AI when playing against the CPU and the refreshing, crisp graphics.<br/><br/>FEATURES:<br/><br/>- One or two player mode<br/>- Six levels of difficulty from beginner to guru<br/>- Each level has its own style of play<br/>- Strong computer opponent at higher levels<br/>- Very fast computer play, even on the highest level<br/>- Hints option to help improve your game play<br/>- NEW! Load/save games to/from file<br/>- NEW! Custom board setup<br/>- Four gorgeously styled boards<br/>- Retina enhanced graphics<br/>- Animated pieces<br/>- Sound effects<br/>- Unlimited undo and redo<br/>- Scoreboard<br/>- Auto-save game in progress<br/>- Play with mouse or keyboard<br/><br/>Praise for the iPhone version:<br/><br/>\"There are several free Reversi games in the app store, but none have the breadth of options or depth of AI of this paid version. AppCraver looks forward to seeing what developer Kiss The Machine comes up with next\" - www.appcraver.com<br/><br/>\"For those who are serious about playing Reversi and want a serious AI challenge get this one\" - mrbass.org best iPhone and iPod Touch games", "metacritic": null, "released": "1985-01-01", "tba": false, "updated": "2023-02-08T10:51:28", "background_image": "https://media.rawg.io/media/screenshots/22e/22ed48ce409421d2b511352aca0a539d.jpg", "website": "http://kissthemachine.com/reversi/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 9, "beaten": 3, "toplay": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "PC", "macOS", "Android"], "developers": ["AI Factory", "Banana & Co.", "James Oh & Associates", "Kiss The Machine", "Nicholas Dean", "OneMirror"], "genres": ["Strategy", "Board Games", "Family", "Puzzle"], "publishers": ["James Oh & Associates", "Michael Patricios", "Nicholas Dean"], "esrb_rating": "Everyone 10+"}