{"id": 345005, "slug": "the-wolf-among-us-episode-1-faith", "name": "The Wolf Among Us - Episode 1: Faith", "name_original": "The Wolf Among Us - Episode 1: Faith", "description": "Download  Episode One of The Wolf Among Us, a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Fairytale characters are being murdered in this hard-boiled, violent and mature thriller based on the award-winning Fables comic book series (DC Comics/Vertigo) by Bill Willingham. <br/><br/>As Bigby Wolf - THE big bad wolf - you will discover that a brutal, bloody murder is just a taste of things to come in a game series where your every decision can have enormous consequences.  <br/><br/>• From the team that brought you 2012 Game of the Year, The Walking Dead<br/><br/>• Now, it’s not only WHAT you choose to do that will affect your story, but WHEN you choose to do it<br/><br/>• A mature and gritty take on characters from fairytales, legends and folklore who have escaped into our world <br/><br/>• A perfect place to begin your Fables journey, even if you’ve not read the comics this game is set before the events seen in the first issue<br/><br/><br/><br/>1 player<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/><br/>", "metacritic": null, "released": "2013-10-15", "tba": false, "updated": "2022-09-05T16:55:05", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 3"], "developers": ["Telltale Games"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": "Mature"}