{"id": 345419, "slug": "arcade-archives-road-fighter", "name": "Arcade Archives ROAD FIGHTER", "name_original": "Arcade Archives ROAD FIGHTER", "description": "'ROAD FIGHTER' is a racing game released by KONAMI in 1984.<br/>Control your monster machine at speeds of up to 400 km/h, avoiding enemy cars and oil spills to finish all 6 stages faster than anyone else.<br/>If you start to swerve off-course, countersteer and use your driving techniques to power through it!<br/><br/>The 'Arcade Archives' series has faithfully reproduced many classic Arcade masterpieces.<br/>Players can change various game settings such as game difficulty, and also reproduce the atmosphere of arcade display settings at that time. Players can also compete against each other from all over the world with their high scores.<br/>Please enjoy the masterpiece that built a generation for video games.<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1-2 players<br/>DUALSHOCK®4<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>Arcade Archives Series Produced by HAMSTER Co.", "metacritic": null, "released": "2019-07-25", "tba": false, "updated": "2019-11-19T18:32:10", "background_image": "https://media.rawg.io/media/screenshots/82a/82a862ca4f649d364fc8e4c72ba5f7e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Nintendo Switch"], "developers": [], "genres": [], "publishers": ["HAMSTER"], "esrb_rating": "Everyone"}