{"id": 34692, "slug": "sovereign", "name": "Sovereign", "name_original": "Sovereign", "description": "<h3> Join the Community on Discord </h3><br/><strong><h3> The Game </h3></strong><br/>Sovereign is a co-op multiplayer, action-adventure, open-world, RPG. Explore a fantasy open-world, fight enemies through dungeons and areas full of enemies, using the variety and flexibility of omni-directional combat and more. Discover the mysteries and lore of this universe. Play the way you want and customize your character the way you want! Do all of this with your friends in a co-op multiplayer adventure.<br/><br/><strong><h3> Key Features </h3></strong><ul> <li> COMBAT<br/></li><li> RESOURCE GATHERING<br/></li><li> CRAFTING <br/></li><li> EXPLORATION<br/></li><li> QUESTING<br/></li><li> CHARACTER CUSTOMIZATION<br/></li><li> CO-OP MULTIPLAYER<br/></li><li> AND MORE... </li></ul><strong><h3> Replay-ability  </h3></strong><br/>The game is entirely replay-able as you wish to do so. Players can create their own characters for each play-through and customize them the way they want. You will also be able to alternate the statistics of said player. For example, increase their strength or speed to beat or evade your opponents.<br/><br/><strong><h3> Suited For You  </h3></strong><br/>Not only will character customization play a part in Sovereign but so will the great variety in weapons and spells. From bows and arrows, to axes, to swords and shields and armor, Sovereign has got you covered. The game will have a skill tree to allow for particular spells to get chosen for the player. This will allow for more efficient use of resources during combat.<br/><br/><strong><h3> Play with friends  </h3></strong><br/>Everyone’s favorite past-time (or almost) while playing games is to join up with your buddies. Sovereign features a co-op multiplayer experience which allows you to play with your friends in a single world. The same story, quests and battles are available to you via multiplayer. This system also features a chat box for you to easily interact with other players that are a part of your world.<strong><h3> Join the Community on Twitch </h3></strong><strong><h3> Join the Community on YouTube </h3></strong><strong><h3> Join the Community on Twitter </h3></strong><h3> Join the Community on TikTok </h3>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-06T05:57:59", "background_image": "https://media.rawg.io/media/screenshots/350/3501f2f4df1591bf8909a933f606a0ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Verant Interactive", "SovereignDev"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Sony Interactive Entertainment", "SovereignDev"], "esrb_rating": null}