{"id": 34757, "slug": "psychotoxic-gateway-to-hell", "name": "Psychotoxic: Gateway to Hell", "name_original": "Psychotoxic: Gateway to Hell", "description": "<p>PsychoToxic places gamers in the shoes of heroine Angie Prophet who is faced with the daunting task of saving mankind from impending Nuclear Armageddon. The year is 2022, the place is New York City. Angie Prophet... half human, half angel... is the only one who can defeat the Fourth Horseman of the Apocalypse, an evil character from ancient Babylon. Throughout the game, Angie comes to an understanding of her role as civilization&#39;s savior, discovering a series of unique abilities, such as invisibility, the slowing of time and the infiltration of other&#39;s dreams all of which aid her progress. Features: Highly interactive environment with nearly everything being destructible 29 richly detailed levels, 8 of which are unique &quot;dream stages&quot; that take Angie inside the dreams (and nightmares) of other characters. Nonstop action with 20 to 25 hours of gameplay. Battle 90 unique and different enemies - all utilizing the Ragdoll Physics Engine. Graphics powered by the Trinigy Vision Graphics Engine. An impressive array of 19 different weapons - ranging from small arms to large ADWs (area damage weapons). Angleforce powers - including invisibility, slowing of time and mental telepathy. A high tension story line that holds players’ attention from beginning to end in the ultimate fight between good and evil</p>", "metacritic": 40, "released": "2005-03-21", "tba": false, "updated": "2023-01-31T19:25:27", "background_image": "https://media.rawg.io/media/games/285/285316e253ab1c2c2a54078115e0b1ea.jpg", "website": "http://www.nuclearvision.de/pages_e/psychotoxic.htm", "rating": 2.5, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 8, "beaten": 1, "toplay": 6, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 496, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Nuclearvision Entertainment"], "genres": ["Action", "Shooter"], "publishers": ["Whiptail Interactive"], "esrb_rating": null}