{"id": 34786, "slug": "pirates-of-the-burning-sea", "name": "Pirates of the Burning Sea", "name_original": "Pirates of the Burning Sea", "description": "<p>Pirates of the Burning Sea is an MMORPG featuring high seas action and adventure in a bold world of pirates and plunder. Set against the backdrop of the New World of the 18th Century, players can choose one of three nations England, France or Spain or choose the role of a Pirate and battle it out for glory and power. Virtual buccaneers can engage in fierce ship-to-ship combat in real time, complete with the roar of cannon fire and the crunch of timber. Players choose one of three fighting styles and engage in intense melee combat in one on one duels, as well as boarding and taking control of enemy vessels. The game&#39;s Conquest system turns any of the more than 80 ports into a battleground, as rival players accrue points in both PvE and combat, culminating in a period of PvP warfare that determines who controls the port, and all of its valuable economic resources. Burning Sea also features an economy completely run by players, forging their own empires across the Caribbean; players can build their own quarries, distilleries and timber mills, managing large-scale production and distribution in a cutthroat world of commerce where profits are the dream and desperate measures the reality!</p>", "metacritic": 76, "released": "2008-01-22", "tba": false, "updated": "2021-09-25T07:38:51", "background_image": "https://media.rawg.io/media/games/d40/d40501d70ae268706bc1137932793c8b.jpg", "website": "http://www.burningsea.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Акелла", "Flying Lab Software"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Flying Lab Software"], "esrb_rating": "Teen"}