{"id": 3485, "slug": "secret-ponchos", "name": "Secret Ponchos", "name_original": "Secret Ponchos", "description": "<p>Secret Ponchos is a Wild West-themed twin-stick multiplayer shooter. </p>\n<h3>Art-style and setting</h3>\n<p>Secret Ponchos universe takes inspiration from spaghetti westerns.<br />\nIts levels are set in classic western environments such as saloons, railroads, small towns, and mines. The game’s art-style is cartoonish; the character models are very expressive and grotesque. </p>\n<h3>Gameplay</h3>\n<p>The players participate in online matches with up to three players in each team. There are eight different characters (named “outlaws”) in the game, each one with its unique abilities, weapons, and stats. Every outlaw has two different weapons with several fire modes such as the rifle that can both fire spread shots and snipes enemies from the long distance, sawed-off shotgun that can stun enemies, the sword with charged attacks and many more. Each character has five characteristics that can be adjusted in the “Outlaw Perks” menu: damage, speed, stamina, fire rate, and health. <br />\nThe game has a rank system tallied as a bounty. Winning ranked matches increases your bounty and lets you progress through 10 ranks, from Petty to Death Bringer. </p>\n<h3>Game modes</h3>\n<p>Even though there is a single-player arcade mode, Secret Ponchos is mostly a multiplayer game. <br />\nThere are four multiplayer game modes: Domination in which team with five kill advantage wins, Deathmatch with no respawn, Free-for-all, and Posse leader where you have to protect your team’s leader and kill the opposite team’s leader.</p>", "metacritic": null, "released": "2014-12-02", "tba": false, "updated": "2023-11-28T01:21:21", "background_image": "https://media.rawg.io/media/screenshots/c16/c167162530a93902a232389086164fca.jpg", "website": "http://www.secretponchos.com", "rating": 2.38, "rating_top": 3, "added_by_status": {"yet": 49, "owned": 1076, "beaten": 8, "toplay": 2, "dropped": 67, "playing": 1}, "playtime": 4, "achievements_count": 163, "ratings_count": 119, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 119, "platforms": ["PlayStation 4", "PC"], "developers": ["Switch Blade Monkeys", "Switchblade Monkeys Entertainment"], "genres": ["Action", "Indie"], "publishers": ["Switchblade Monkeys Entertainment"], "esrb_rating": "Teen"}