{"id": 34868, "slug": "homeworld-2", "name": "Homeworld 2", "name_original": "Homeworld 2", "description": "<p>Homeworld 2 continues the epic struggle of the Hiigarans and their leader Karan S&#39;jet. Many thought their hardships would end when they returned to Hiigara, yet fate has not been so kind to the Exiles. Now the Hiigarans face a new and bitter enemy, a renegade clan from the eastern fringes of the galaxy, who wield the power of the ancients. Homeworld 2 chronicles the valiant journey of the Mothership and its crew into the oldest regions of the galaxy to confront their new foe and discover the truth behind their exile.</p>\n<p>An innovative 3D engine generates cinematic-quality graphics, stunning special effects, and beautifully rendered ships. The sublime vistas and otherworldly splendor of Homeworld 2 are in the award-winning tradition of the original. In-game cinematics flow seamlessly in and out of gameplay as players command their armada around eerily beautiful phenomena of deep space, including giant asteroids, massive derelicts, gas clouds, and nebulae light years across.</p>\n<p>A streamlined interface lets players take total control of their ships and explore the universe. And all-new camera panning makes maneuvering fleets in the thick of battle easier than ever. Zoom in to see objects in intricate detail, zoom out to get a panoramic view, or rotate your view of deep space a full 360 degrees.</p>\n<p>In the dynamic 3D universe of Homeworld 2 the awe-inspiring phenomena of deep space--giant asteroids, huge derelicts, murky gas clouds, and vast nebulae--pulse with the energy that permeates the cosmos. These fully interactive phenomena--some strategically helpful and others fraught with danger--add another dimension to gameplay.</p>\n<p>Two all-new customizable battle fleets, each with unique capabilities and spacecraft, enhance Homeworld 2&#39;s strategic complexity and tactical flexibility. Players can now group ships in strike formations that move together into combat. New ships such as the flak corvette and the marine frigate offer innovative tactical choices, while capital ships have subsystems like engines and weaponry that can be crippled while leaving the ship ready for capture.</p>\n<p>New multiplayer modes and features allow up to six players to wage war via a LAN or over the Internet. Additional tools and modules enable the community to develop new missions and mods.</p>", "metacritic": 83, "released": "2003-09-16", "tba": false, "updated": "2022-04-20T04:05:04", "background_image": "https://media.rawg.io/media/games/aa7/aa79d63057fc122ef464fb9ba2c5181a.jpg", "website": "http://www.homeworld2.com", "rating": 4.41, "rating_top": 5, "added_by_status": {"yet": 11, "owned": 23, "beaten": 17, "toplay": 15, "dropped": 14}, "playtime": 1, "achievements_count": 0, "ratings_count": 31, "suggestions_count": 394, "game_series_count": 3, "reviews_count": 32, "platforms": ["PC"], "developers": ["Relic Entertainment"], "genres": ["Strategy"], "publishers": ["Sierra Entertainment"], "esrb_rating": "Teen"}