{"id": 34902, "slug": "boiling-point-road-to-hell", "name": "Boiling Point: Road to Hell", "name_original": "Boiling Point: Road to Hell", "description": "<p>Saul Myers is a veteran of the French Foreign Legion living abroad in Paris. His daughter Lisa is a journalist working in the fictional South American country Realia. When news of her kidnapping reach Saul, he doesn&#39;t hesitate: it&#39;s off to Realia, to rescue his daughter. Once there, Saul will have to find his own way among corrupted politicians and criminal organizations, searching for clues to discover Lisa&#39;s whereabouts, and doing everything necessary to bring her back.</p>\n<p>Boiling Point: Road to Hell is a hybrid of free-roaming first-person shooter and role-playing, with elements of a &quot;sandbox&quot; driving game in GTA style. The game combines exploration of vast environments with a mission-based structure. Saul will need to gather information concerning his missing daughter, and will therefore have to work for the factions that dominate the Realian landscape. There are six factions in Realia (government, native tribes, bandits, mafia, and communist guerrillas); the player can decide whose missions Saul should undertake. Naturally, working for one faction might influence Saul&#39;s standing with the others. Civilians are also counted as a faction, and Saul can become one of them, should the player try to preserve neutrality as much as possible.</p>\n<p>The role-playing element manifests itself in the game&#39;s skill system. The skills consist mainly of weapon proficiencies and physical abilities. They can be raised by practice, but also atrophied when not used for a long period of time. Most characters in Realia are not immediately hostile to Saul, and will become so only if he betrays their faction or sides with their enemies. Saul uses traditional FPS arsenal (revolvers, assault rifles, etc.) to deal with the enemies. There are also drivable vehicles (cars, boats, helicopters and planes) in the game.</p>", "metacritic": 61, "released": "2005-05-18", "tba": false, "updated": "2024-02-26T00:26:32", "background_image": "https://media.rawg.io/media/games/c87/c87712fa663789c1585cc613bd87f9cc.jpg", "website": "http://www.atari.com/boilingpoint/", "rating": 3.45, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 26, "beaten": 43, "toplay": 12, "dropped": 26, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 60, "suggestions_count": 472, "game_series_count": 1, "reviews_count": 60, "platforms": ["PC"], "developers": ["Deep Shadows"], "genres": ["Action", "Shooter", "Adventure", "RPG", "Racing"], "publishers": ["Atari", "Ziggurat"], "esrb_rating": "Teen"}