{"id": 349109, "slug": "60-seconds-reatomized", "name": "60 Seconds! Reatomized", "name_original": "60 Seconds! Reatomized", "description": "<p>Dolores, Ted, Mary Jane and Timmy return to face the nuclear apocalypse in this new, remastered edition of the classic atomic adventure - 60 Seconds! Reatomized, featuring 4K support, refreshed 2D graphics and hand-drawn 3D textures, new interactive menu, improved UI system, a technical refresh, and of course... new content!<br />\nNEW GAMEPLAY MODE Survival Challenges - unique, short storylines which will put your survival skills to the test!<br />\nNEW OPPORTUNITIES  to escape the wasteland in form of a storyline spanning across multiple playthroughs! Can you escape the wasteland in style?<br />\nNEW RELATIONSHIP SYSTEM  more stories and crazy interactions between the McDoodle family members!<br />\nNEW SOUNDS, ART AND UNLOCKABLE VISUAL CONTENT  allowing you to add a little color to your fallout shelter!<br />\nNEW ACHIEVEMENTS!<br />\nWith only 60 seconds left to impact, go on a mad dash through the house in search of family members and useful supplies. Everything will be against you: time, your very own furniture, a house that&#39;s different every time you play, and the fundamental question... what to take with you and who to leave behind?</p>\n<p>Reaching the fallout shelter in time, alive, is only the beginning. Whatever you scavenged and whoever you saved will play a vital role in your survival. Each survival story will be different, with every day surprising you with unexpected events. Will all of these stories end well? It&#39;s up to you. Ration food and water, make best use of your supplies, face difficult choices and even venture into the wasteland.</p>\n<p>Good luck.</p>", "metacritic": null, "released": "2019-07-25", "tba": false, "updated": "2023-12-20T05:31:47", "background_image": "https://media.rawg.io/media/games/ce5/ce55171e4744e78eebe9af113b854028.jpg", "website": "http://60secondsgame.com", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 55, "owned": 640, "beaten": 33, "toplay": 19, "dropped": 32, "playing": 4}, "playtime": 3, "achievements_count": 242, "ratings_count": 65, "suggestions_count": 295, "game_series_count": 1, "reviews_count": 69, "platforms": ["Xbox One", "PlayStation 4", "PC", "macOS", "iOS"], "developers": ["Robot Gentleman"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Robot Gentleman"], "esrb_rating": "Teen"}