{"id": 349189, "slug": "furys-sky", "name": "Fury's Sky", "name_original": "Fury's Sky", "description": "1000 years have passed since the time of the Hero, Sir Levin. Wielding a mysterious energy, and advanced  flying machines capable of utilizing it, Levin's forces quashed the  warring Nations of Old, and brought peace to the new World-Nation. But  it was not to last. As time passed, the Nations of Old resurfaced,  bearing the energy that been used against them in ages past. They  shattered the territory of the World-Nation into pieces, carving swathes  of the land for themselves. However, they did not do this on their own. Fearing the coming of a second Hero, the Nations turned to mercenaries to act on their behalf and carry the pretense of global peace.<br/><br/>One such mercenary company was the Yellow Jackets. Acting as the regional  army and air force for the great Kingdom of Liefton, the Yellow Jackets  bore a code of honor atypical of the cutthroat bands typically employed by sovereign nations. Their commitment to virtue, and their growing  influence in the region, lent themselves many enemies among rival  nations and mercenaries alike.<br/><br/>This is their story.<br/><br/><br/><br/>Fury's Sky is a game both unique and familiar. As you fly through the main campaign, experience finely tuned flight action inspired by genre classics, and utilize brand new mechanics. Manage an unlimited pool of energy to power your weapons, and employ a powerful airbrake to stop yourself and quickly change direction, or get a bead on targets.<br/><br/><br/><br/>The game will feature 8 planes to choose from, with a complement of swappable weapons for each, totaling at 42. Each plane represents a distinct playstyle, from zipping past enemies in the speedy yet unwieldy Locust, to decimating enemies with the powerful yet sluggish Condor, to getting up close and personal with the potent yet fragile Hatchet. With all of this customization, you're sure to find something you like!<br/><br/><br/><br/>The campaign will test your flight skills with anything and everything. From escorting a transport through a canyon, to destroying an enemy base, to fighting a massive battleship on your home turf, the game will continue to throw new things at you and force you to adapt. Are you ready?", "metacritic": null, "released": null, "tba": false, "updated": "2024-04-06T17:16:53", "background_image": "https://media.rawg.io/media/screenshots/d39/d39d6035c0911af1a49a6097bf4907fa.jpg", "website": "https://proudcipher.com/furys-sky", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Proud Cipher Media Group"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Proud Cipher Media Group"], "esrb_rating": null}