{"id": 349218, "slug": "android-amazones", "name": "Android Amazones", "name_original": "Android Amazones", "description": "\"Android Amazones\" is a game for players who want to enjoy TPS shooter easily.<br/>This game can be played in Window mode.<br/>The player becomes the investigator Saya and fights the robots to rescue her sister.<h3>Story</h3>The detective Saya woke up in the middle of the night with the phone.<br/>Amazingly, Amazones robots are attacking the city.<br/>There is her sister in the city. She must go for rescue.<br/>Saya's long day begins now.<br/><br/>Prologue(Neighborhood): Annihilate all the Amazones robots .<br/>Main story(City): Rescue her sister.However, only to rescue her sister may not get to the real ending.<br/>Mini game(The Cave): the cave consisting of a five-level maze<br/>Collection elements: prologue and main story. Six airplane plastic models.<h3>Feature of this game</h3>TPS shooter at an easy-to-play price.<br/>This game can fire the gun while the character is running.<br/>There is a day-night cycle.<br/>Properly meaningful Steam achievements.<br/>If there is a problem at the same level, restore with save and load.<br/>Once you return to the menu, loading will restore her position but the weapon will be reset.<br/>  (It is assumed to win the game without saving)<br/>You need a graphics board on your computer to play this game.<br/>The joystick and controller may operate if you set the key assignment by yourself at startup screen or big picture mode. (Not officially supported)<br/>Player weapons are handguns, shotguns and assault rifles.<br/>We composed all the music.<h3>Please note</h3>There are no conversations between characters in this game, and some players may feel like a mini game collection. <br/>Please refrain from downloading if you want a game consisting of a solid story.<h3>Method of operation</h3>Move: W, A, S, D<br/><br/> Jump: Space key<br/>Shoot a gun: left mouse click<br/>Reload the gun: R<br/>Zoom camera: right mouse click<br/>Crouch: C<br/>Dash: Shift key<br/>Change weapons: Q, E, mouse wheel<br/>Pause menu: ESC key<h3>Xbox controller</h3>Character movement: Left stick<br/><br/> Camera movement: Right stick<br/>Pause : B<br/>Jump: A<br/>Change weapons: Y<br/>Reload the gun: X<br/>Dash: LS click , LB<br/>Crouch: RS click<br/>Aim target: LT<br/>Shoot Weapons: RT<h3>Japanese government authorized Japan orphanages Foundation official sponsor</h3>Part of the sales proceeds will be donated to children's homes. Visit the official site for more information.", "metacritic": null, "released": "2019-08-05", "tba": false, "updated": "2019-08-28T21:44:40", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d509d832d584a2e6e33a63665e40875.jpg", "website": "https://emerose.biz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sonic-alpha"], "genres": ["Action", "Indie"], "publishers": ["NS"], "esrb_rating": null}