{"id": 349308, "slug": "clickraid2", "name": "ClickRaid2", "name_original": "ClickRaid2", "description": "ClickRaid2 is an idle MMO-incremental game. Bring your friends, make a party, kill mobs, bosses and hunt for treasure chests! Collect shards, gold and ancient scrolls to upgrade gems, skills and ancient texts. Choose between 13 classes, all with unique models and skills. With a max party size of 6, enjoy finding a composition you like. <br/>\n<br/>\r\nKill mobs constantly on each floor to receive passive gold gain and more global damage through the Bounty Hunt. Bounty Hunt is automatic and slowly increases your characters global damage and increases the amount of gold you get from mobs and bosses alike. <br/>\n<br/>\r\nKill bosses on each stage to continue to the next. Killing these bosses also drops Blue Shards and Ancient Scrolls. These blue shards allow you to craft and upgrade gems. Gems can increase your attack, your crit, even your healing. There are 8 possible gems to choose from and they all cost the same amount to craft. Upgrading gems slowly increases the cost of Blue Shards. Ancient Scrolls allow you to upgrade ancient texts, both for yourself and the server.<br/>\n<br/>\r\nAncient texts gives you the chance to upgrade Defense Penetration and Enhance your armor personally. For the server you can make the journey through lower levels faster by adding texts to a server wide pot, making you skip to treasure rooms through the stages. Once the tier reaches 100 ancient texts you can enter survival rooms after prestiging, making the journey through lower levels faster. Each tier encompasses 10 floors.<br/>\n<br/>\r\nPrestige to start over. Your character level and skill levels are all reset. You keep your gems, though they scale down with floor levels. <br/>\n<br/>\r\nEnjoy a server wide battle against a hard boss once per hour to get Red shards, gold and boss seals. Boss seals are another way to increase the damage of your characters skills.  Red shards allow you to instantly upgrade gems, instead of waiting for the crafting to complete. <br/>\n<br/>\r\n13 classes makes for a variety of possible team compositions.  Choose from Warrior, Bard, Berzerker, Cleric, Druid, Enchanter, Monk, Necromancer, Nomad, Occultist, Ranger, Rogue and Wizard. <br/>\n<br/>\r\nJoin or create a guild for yourself and others. This system is still under construction, but currently allows you to have a guild title and guild chat. In the future possible guild systems to improve yourself and your guild will be implemented.", "metacritic": null, "released": "2019-07-04", "tba": false, "updated": "2019-08-23T12:10:55", "background_image": "https://media.rawg.io/media/screenshots/33a/33a05e24d08c1eae448cd6c389758492.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Slikey Games"], "genres": ["RPG", "Massively Multiplayer", "Indie"], "publishers": ["Slikey Games"], "esrb_rating": null}