{"id": 349376, "slug": "romance-of-the-three-kingdoms-legend-of-caocaotact", "name": "Romance of the Three Kingdoms: Legend of CaoCao(Tactics)", "name_original": "Romance of the Three Kingdoms: Legend of CaoCao(Tactics)", "description": "<strong>From mobile platforms to PC</strong><br/>The timeless SRPG Classic, Romance of the Three Kingdoms: The Legend of CaoCao (Tactics), is now available on PC. KOEI presented its title of ROTK in 1998, and due to its popular demands, in 2018 there was an online converted and a remade version launched for the global market via mobile. <br/>And now, in 2019, we are delighted to present to you Romance of the Three Kingdoms: The Legend of CaoCao (Tactics) on PC! Now, you can enjoy the strategic tour de force \"The Legend of CaoCao (Tactics)\" for PC.<br/><br/><strong>Renowned SRPG Masterpiece, ROTK</strong><br/>Experience the remarkable journey to the momentous period of bedlam in 184 A.D. The period when the downfall of the great Han Dynasty and the difficulties of the Yellow Turban collided. Unify all the lands and lead your commanders with tactful strategies and test your might against worthy opponents. <br/><br/><strong>Classic &amp; Retro Style: Pixel Art </strong><br/>The first ever spin-off and the officially updated and released version of the Three Kingdoms series shows off its classic retro vibe through the style of Pixel Art. The unique Pixel Art UI of ROTK will evoke nostalgia for all users, providing truly unprecedented gameplay experiences. <br/><br/><strong>Turn-Based Strategy Simulation</strong><br/>Romance of the Three Kingdoms: The Legend of CaoCao (Tactics) comprises turn-based gameplay through battles with stories or real-time battles. Depending on the very single move you make, it can either lead the battle to victory or an epic failure. <br/>Formulate diverse strategies and attain different results every time and make sure to be vigilant of varies crucial elements in game. Terrain types, positioning of commanders and their specialties should all be carefully noted when making each one of your moves.  <br/><br/><strong>Stories followed by the great Legend</strong><br/>Through Story Mode, there will be scenarios based on the actual chief commanders’ battle records, taking place on the historical battlefields. <br/>Unravel different stories and relive the lives of all the great commanders from CaoCao, to all the other great commanders that have left a mark in history. <br/><br/><strong>Journey to Unification</strong><br/>Conquer all 112 divided domains and achieve one large unified empire. And make sure you draft new and trained armies and fortify your domains to prevent any possible invasions.", "metacritic": null, "released": "2019-07-25", "tba": false, "updated": "2019-08-28T21:44:38", "background_image": "https://media.rawg.io/media/screenshots/148/148a9624bd22e5febe853da248297e76.jpg", "website": "https://www.nexon.com/caocao", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23, "toplay": 1}, "playtime": 6, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["NEXON KOREA"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": ["NEXON KOREA"], "esrb_rating": null}