{"id": 349346, "slug": "palmyra-orphanage", "name": "Palmyra Orphanage", "name_original": "Palmyra Orphanage", "description": "In a remote corner of post-Soviet Russia lies an orphanage \"Palmyra\". Somehow, this children's home was able to survive the collapse of the country and the terrible fever of the nineties. But recently, any mentions of him disappeared from all archives. What is hidden behind the walls of forgotten shelter?<br/>\r\nYou've finally found a clue about location of your missing brother. To do that, you will have to return to the place that should be forgotten. The old orphanage was a place in which you were separated. Now all you need to do is to walk through the empty rooms of your past and find documents about your brother relocation. But are they really empty? Ghostly footsteps are heard among the corridors of the crumbling building. Shadows are thirst for peace, cry out for help. They are trying to drag you into their memories, to drown in someone else's death. But this is not their land. This is the property of the principal. He wanders. He waits. He hates. He will take care of you.<br/>\n<br/>\r\nPalmyra Orphanage is a paranormal first-person horror, in which only stealth and attention will help you survive. Choose witch end they deserve. Unravel history of the orphanage, but be careful.<br/>\n<br/>\r\nFeatures:<br/>\r\n• He is always there. Stealth mechanics will challenge your skills. It requires careful though and attention to every step.<br/>\r\n• Intense story that hides a lot of secrets. Riddles of the shelter will be solved only by those who can find all marks of the past.<br/>\r\n• Each room, from the empty dormitories, to the old school classrooms, has been carefully recreated to convey a sense of loneliness and despair.<br/>\r\n• Several different endings will allow you to decide for yourself how this story ends.<br/>\r\n• Dark and atmospheric sound.<br/>\r\n• The plan of the building is based on the existing blueprints of Russian orphanages.<br/>\r\n• The events of the game and the characters were inspired by the real cases of children abuse, recorded during the inspection of a number of orphanages.", "metacritic": null, "released": "2019-07-24", "tba": false, "updated": "2023-08-29T03:54:56", "background_image": "https://media.rawg.io/media/screenshots/2a0/2a0585a490251acef12ce6fe50ef567f.jpg", "website": "", "rating": 3.11, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 40, "beaten": 4, "toplay": 1, "dropped": 2}, "playtime": 2, "achievements_count": 16, "ratings_count": 9, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Steppe Hare Studio"], "genres": ["Indie"], "publishers": ["Steppe Hare Studio"], "esrb_rating": null}