{"id": 349413, "slug": "vicious-circle", "name": "Vicious Circle", "name_original": "Vicious Circle", "description": "Vicious Circle is an uncooperative multiplayer shooter set in a colorful yet gritty sci-fi universe. Gameplay is fast and frenetic with an emphasis on thwarting other players with dirty tricks at every turn. Be a mercenary and compete for loot, or take on the role of a massive monster and try to kill everything in your path. The first player to collect the biggest haul and reach the evac zone wins - unless the player controlling the big baddy gets them all first.<br/><br/><br/><br/>Work with other mercenaries to survive, but remember: only the player with the most loot wins. Should you combine forces against the terrifying monster, or sneak away to make bank while everyone else is busy? Mercenaries cannot directly harm each other, but they can use the environment and a selection of potent gadgets to outwit their opponents. Maybe lock a door at the right moment to trap another player in the same room as the monster, or use a gadget to suck the loot away from everyone around you. Just remember, what goes around comes around.<br/><br/><br/><br/>Each round, one player is selected to play as a massive creature with a simple goal: kill everyone. You won't stand a chance if the mercenaries band together, so it's up to you to divide and conquer. Use your enhanced senses to track down your foes and pick them off one by one, or barrel into combat and sow chaos. Either way, you have a selection of powerful abilities to ensure nobody makes it out alive!<br/><br/><br/><br/>Life and death work a little different near the Vicious Circle. If you die as a mercenary you'll respawn as a Lil' Dipper. These small, agile creatures can permanently take control of another mercenary's body, including any loot they had collected. But watch out, the player you possessed will become a Lil' Dipper themselves, anxious to get back into their old body...or maybe one with even more loot!<br/><br/><br/><ul><li>New Mercenaries!<br/></li><li>New Monsters!<br/></li><li>New Maps!<br/></li><li>New Gadgets!<br/></li><li>New Events!<br/></li><li>New Game Modes!</li></ul><br/><br/><ul><li>Unlock exclusive cosmetics and other rewards by playing and completing challenges.<br/></li><li>Seasonal Battle Passes are time limited events allowing players to unlock exclusive content during the current active season.</li></ul>", "metacritic": null, "released": "2019-08-13", "tba": false, "updated": "2019-08-23T12:10:54", "background_image": "https://media.rawg.io/media/screenshots/1a1/1a1843c534ff501d3290bb0e23b2f15c.jpg", "website": "https://www.games.roosterteeth.com/viciouscircle", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 54, "toplay": 2, "dropped": 2}, "playtime": 1, "achievements_count": 25, "ratings_count": 4, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Rooster Teeth Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Rooster Teeth Games"], "esrb_rating": null}