{"id": 349427, "slug": "cymatically-muffed", "name": "Cymatically Muffed", "name_original": "Cymatically Muffed", "description": "<h3>Wishlist to be notified of release!</h3><h3>What are Muffs?</h3>Muffs are Dr. Wolfe's latest development in cyber enhancement. Unleashing the power of cymatics, these massive headphones will make you stronger, faster, and smarter (maybe). They monitor your health, inventory, and a slew of other nifty information.<br/><br/><br/><br/><br/><br/><br/><br/>It's a muffs eat muffs world for 2-16+ competitive players. Battle it out against your friends in free-for-all style or team up using one of our many customizations. The extensive array of maps and modes provides replayability that will make this your go-to game for groups of any size.<br/><br/><br/><br/><br/><br/><br/>Earn your muffs, leave your mark, find your place. Explore on your own or team up with your friends in this exciting adventure campaign. Make your way through a wide variety of hand crafted levels as you discover the secrets Cymatically Muffed has to offer.<br/><br/>Have friends that are late to the party? There's no need to restart, they can join a game in-progress.<h3>Features</h3><ul><li>On-Demand Split-Screen/Shared-Screen Control<br/></li><li>Native Support for a Wide Range of Controllers<br/></li><li>Cooperative Campaign for 1-4+<br/></li><li>Player vs Player Battle Modes for 2-16+<br/></li><li>Extensive Battle Mode Customizations for High Replayability</li></ul><br/><h3>What does \"16+\" mean?</h3><ul><li>16 players on controllers can play concurrently, with a 17th player on keyboard and mouse. This is not recommended as the keyboard player will have an advantage.<br/></li><li>If at a future date SteamInput API supports more than 16 concurrent devices, Muffed will too.</li></ul>", "metacritic": null, "released": "2019-08-07", "tba": false, "updated": "2021-04-23T03:52:08", "background_image": "https://media.rawg.io/media/screenshots/205/2056ccf3958edd6d9579129ee3a9045b.jpg", "website": "https://muffed.kelsam.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Xbox One"], "developers": ["Kelsam"], "genres": ["Action", "Indie"], "publishers": ["Kelsam"], "esrb_rating": null}