{"id": 349473, "slug": "acting-lessons", "name": "Acting Lessons", "name_original": "Acting Lessons", "description": "<p>The game centers around you, a heartbroken man with a background in cryptocurrency trading, telling the story of how you met a girl named Megan during a life changing day. Megan is a young aspiring actress down on her luck and in desperate need for help. Will you be there for her when she needs it the most and help her turn the tide? Will you be able to win her heart?<br />\nActing Lessons is a drama filled adult Visual Novel (VN) with many different endings.<br />\nThe choices you make in this game, even early on, will permeate throughout the game and affect the people around you and your adventure.<br />\nThe game is centered around the relationship between Jonas (or your name of choosing for the main character) and Megan, but there are multiple women in the cast that you can pursuit.<br />\nWill you be there for Megan and stay faithful to her or will you fall in love with her childhood friend Melissa?<br />\nPerhaps you find someone else more intriguing, for instance, the nurturing nurse Leah or the blue haired actress Rena?<br />\nWill you value the friendship with your best friend Liam and be there when he truly needs you?<br />\nThese choices, and a lot more, are all yours to make.<br />\nExpect a 5 - 8 hour long humor filled and emotion packed Adult Visual Novel that many players only could find the strength to play once.</p>", "metacritic": null, "released": "2018-12-09", "tba": false, "updated": "2024-01-19T13:22:13", "background_image": "https://media.rawg.io/media/games/809/809e51d5f7e42610d571c207ab9f965e.jpg", "website": "", "rating": 3.9, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 115, "beaten": 24, "toplay": 15, "dropped": 3, "playing": 1}, "playtime": 5, "achievements_count": 10, "ratings_count": 30, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 30, "platforms": ["macOS", "PC", "Linux"], "developers": ["Dr PinkCake"], "genres": ["Indie"], "publishers": ["Dr PinkCake"], "esrb_rating": null}