{"id": 3494, "slug": "thomas-was-alone", "name": "Thomas Was Alone", "name_original": "Thomas Was Alone", "description": "<p>The player controls one or, more often, several rectangles or squares of different colours and sizes. Each shape has a name, and individual character traits, including Thomas, mentioned in the title. The relationships between the characters are conveyed to the player by the voice-over.</p>\n<p>&quot;Thomas Was Alone&quot; action takes place in a specific virtual space, in which some &quot;Event&quot; has caused the procedures of artificial intelligence with individuality and the ability to act without a specific control. Each entity is shown as a coloured rectangle. Rectangles can move to the left, right, and also know how to jump. Each of the characters has their unique abilities, in particular, large jumps or the ability to swim in the water (other rectangles die, being in it). When a player can control multiple characters, he can switch between them, controlling one aspect at a time.</p>\n<p>The player&#39;s goal is to direct the shapes to the exit points tied explicitly to each shape so that they all occupy that exit at the same time. Most often it requires particular interaction between forms for better manoeuvrability.</p>", "metacritic": 77, "released": "2012-06-30", "tba": false, "updated": "2024-04-06T12:35:11", "background_image": "https://media.rawg.io/media/games/6c8/6c8cb4780ce30b76b944cf656e8fff49.jpg", "website": "http://www.bithellgames.com", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 128, "owned": 2937, "beaten": 410, "toplay": 58, "dropped": 163, "playing": 15}, "playtime": 2, "achievements_count": 110, "ratings_count": 538, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 542, "platforms": ["Android", "PS Vita", "PlayStation 4", "PlayStation 3", "Wii U", "macOS", "PC", "iOS", "Xbox One", "Linux", "Nintendo Switch"], "developers": ["Curve Digital", "Bossa Studios", "Bithell Games", "Mike Bithell"], "genres": ["Adventure", "Family", "Indie"], "publishers": ["Curve Digital", "Bossa Studios", "Bithell Games"], "esrb_rating": "Everyone"}