{"id": 349518, "slug": "terminus-survival", "name": "Terminus: Survival", "name_original": "Terminus: Survival", "description": "Terminus: Survival is an online multiplayer open-world survival shooter. The goal is to survive against the environment, hostile AI and other players. Explore the world, mine resources, craft equipment and create a settlement<br/><br/><strong><h3>FEATURES</h3></strong><strong>PVP </strong>- Terminus: Survival currently features 17 different weapons with various attachments. Many more weapons and attachments are planned for future updates<br/><br/><strong>Customize </strong>- Our weapons modding system allows you to fully mod weapons with multiple attachments, scopes and gun parts. <br/><br/><strong>BUILD </strong>- Create a base to store all your valuable loot  <br/><br/><strong>RAID </strong>- Demolish and break into your enemies’ bases. Take your claim and expand your territory <br/><br/><strong>CRAFT </strong>- Collect components and find blueprint recipes to craft tools and weapons<h3>Disclaimer: </h3>I am currently the sole developer of this project. With your support during Early Access I can add needed programmers and artist to the dev team. There may be bugs, performance problems and game-play issues. The game also may change completely over the course of Early Access. This version is not a representation of a final product. Please take this into consideration.<h3>Join our discord:</h3> https://discord.gg/SynteN8", "metacritic": null, "released": "2019-07-25", "tba": false, "updated": "2019-08-23T12:10:54", "background_image": "https://media.rawg.io/media/screenshots/b4a/b4a137ef0978e9cbc5c3a98024bc1388.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Artifact Games"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Artifact Games"], "esrb_rating": null}