{"id": 349594, "slug": "cantata", "name": "Cantata", "name_original": "Cantata", "description": "Across the surface of Shoal, ten thousand guns sound at once. The keen of laser beams build, punctuated by the staccato thrum of orbital landings. A choir of voices rises as the armies of the galaxy’s oldest and newest civilizations meet in battle. From the vast reaches of space, the chaos is almost musical—a symphony, drifting into the void.<br />\nGAMEPLAYCantata is a character-driven tactical strategy game that puts you in the middle of a spiritual, pragmatic war for survival. Play as one of the nine commanding officers from one of the three factions - the Machines, Humans or Aliens - and leverage your faction’s unique powers and abilities to slowly expand your hold on this alien world.MAJOR FEATURES Nine Commanding Officers across three factions<br />\nFaction specific units and buildings<br />\nOne Large Campaign Map per CO<br />\nMassive, accessible modding - go beyond reskinning and edit unit behavior, import your own sprites.<br />\nDeep, tactically rich systems that are easy to learn but can take time to master.<br />\nOnline and local multiplayer<br />\nEXPLORE AN ALIEN PLANETEvery map you play on holds secrets you&#39;ll need to spend time to seek out and find. This isn&#39;t a puzzle game, you&#39;ll need to do proper reconnaissance to determine the best route across the landscape to your opponent. Once you find it, do you take the most direct route or do you circle them, opening yourself up to the opportunity to see what really was just beyond those mountains...<br />\nEXPAND YOUR BASE AND ARMYEach game you&#39;ll start with a small base and a couple of units. Every turn you have the ability to build up your base more and more, giving you the ability to build more complex unit types. But watch out! Your base is also your supply network. If a crucial building gets destroyed, it may take down your whole supply chain and force you to rebuild to adapt to the new circumstances.<br />\nENDURE HARSH CONDITIONSYou&#39;ll face off against the other factions as you play through the campaign, but the planet of Shoal isn&#39;t one to let you idly move across its surface. Just like any other player, the planet itself takes a turn every round, giving it the ability to fight back against the war on its surface with weather, fauna, and other mysteries.<br />\nMAKE THE GAME YOUR OWNEvery map that you&#39;ll play in the game will be made with the game&#39;s level editor that will be available to any player to use as well, day one! Go beyond simple level creation and import your own sprites to create your own units and effects and use the editor&#39;s simple triggering system to build the map (or game!) of your dreams!</p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2023-08-26T13:01:05", "background_image": "https://media.rawg.io/media/screenshots/dbc/dbc43c24e744bc9ada16686806b47ebb.jpg", "website": "https://www.cantata-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 17, "toplay": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Afterschool Studio"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Afterschool Studio"], "esrb_rating": null}