{"id": 349587, "slug": "the-last-antlion", "name": "The Last AntLion", "name_original": "The Last AntLion", "description": "The Queen Ant doesn't like filthy half-ant, half-lion hybrids like you living in her nefarious kingdom.   She has made it her life's mission to eradicate your kind from the earth in order to restore the purity of the ant race.  Continent by continent, her Army Ants have captured every single AntLion in existence and forced them to participate in her cruel gladiatorial games.  <br/><br/>It amuses her to watch you fight to the death against her powerful army.  With each wave of her wand, another set of ants are unleashed to defeat you.  Nobody has ever made it through all 8 waves.  Using your magical bow, you'll be forced to battle the Worker Ants, Fire Ants, Ghost Ants, Mummy Ants, Pharaoh Ant, Electric Ants, Dinosaur Ants and Army Ants.  If you manage to make it that far, you'll have to battle the Queen herself to survive.<br/><br/>Loot hundreds of enemies, open magical chests, find hidden items and purchase epic rewards, including Armor of the AntLion, Book of the Dead, Cloak of Flames, Boots of Bravery, Ring of Lightning, Fire Arrows, Belt of Haste, Amulet of Time, Quivers, Bombs, Potions and Keys.<br/><br/>It's time to get revenge and redeem your fallen comrades.  <strong>YOU</strong> are The Last AntLion.  Can you survive?<br/><br/><strong>Controls:</strong><br/>Shoot: 1, H, J, SHIFT LEFT, SHIFT RIGHT, NUMPAD1, NUMPAD4<br/><br/>Roar: 2, Y, U<br/><br/>Potion: 3, T, I, BACKSLASH, NUMPAD2, NUMPAD8<br/><br/>Bomb: 4, F, L, NUMPAD3, NUMPAD6<br/><br/>Run: LEFT ARROW, RIGHT ARROW, A, D<br/><br/>Jump: SPACE, UP ARROW, W, G, K, NUMPAD0, NUMPAD5<br/><br/>Select: MOUSE<br/><br/>Pause/Retry: ESC<br/><br/>Mute: M", "metacritic": null, "released": "2019-07-13", "tba": false, "updated": "2020-03-03T12:06:05", "background_image": "https://media.rawg.io/media/screenshots/4cc/4cc5b5b08c0a7ecba5044dcb2ef063cc.jpg", "website": "https://www.thelastantlion.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shawn Kilian"], "genres": ["Action", "Adventure", "Strategy", "Indie", "Platformer"], "publishers": ["Shawn Kilian"], "esrb_rating": null}