{"id": 349663, "slug": "battle-planet-judgement-day", "name": "Battle Planet - Judgement Day", "name_original": "Battle Planet - Judgement Day", "description": "<strong>Battle Planet - Judgement Day</strong> is a planetary rogue-lite top-down shooter. You are one of the universe's 3 most wanted criminals on the run, fighting your way through hordes of aliens, military and police units. There is only one way to reclaim your freedom - destroy them all...<br/><br/><br/>Escape a crashed prisoner transport ship and fight the authorities in a non-stop mayhem of blazing gunfire and planet destroying bombs sent to perforate you and the ground beneath your feet.<br/><br/>Doomed to be killed in a never ending loop, your trial of survival relies solely on your hardcore skills<br/><br/><br/><br/><ul><li>couch co-op mode: die together in excessive sessions with friends<br/></li><li>permanently upgrade your convict and the weapon arsenal after each run<br/></li><li>battle your way through hordes of enemies designed to torment you<br/></li><li>power up your ass with a load-out of perks<br/></li><li>face bosses that have your controller buttons on their death list</li></ul><br/>Make them pay, to make sure today is NOT your judgement day.<br/><br/><br/>Garry Shyman, composer of Bioshock, Middle Earth: Shadow of Mordor and Destroy All Humans worked on our soundtrack bringing to life the intensity of the battlefield with a fast paced electronic orchestral mix<br/><br/><br/>Inspired by the times where games were hard to beat and as big rogue-like fans ourselves, our inspirations for Battle Planet - Judgement Day were a constant reminder of the quality and feeling we wanted to achieve:<br/><br/><ul><li>Dead Cells<br/></li><li>Spelunky<br/></li><li>The Binding of Isaac<br/></li><li>Nuclear Throne<br/></li><li>Rogue Legacy<br/></li><li>Alienation<br/></li><li>Super Stardust</li></ul>", "metacritic": null, "released": "2019-10-16", "tba": false, "updated": "2019-11-19T19:18:23", "background_image": "https://media.rawg.io/media/screenshots/e25/e25998110cb6f9cc3839556a59209a12.jpg", "website": "http://www.threaks.com/portfolio/battle-planet/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 22, "toplay": 3, "dropped": 2}, "playtime": 1, "achievements_count": 6, "ratings_count": 2, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "PlayStation 4", "Nintendo Switch"], "developers": ["Threaks"], "genres": ["Action", "Indie"], "publishers": ["EuroVideo Medien", "Wild River Games"], "esrb_rating": "Teen"}