{"id": 349713, "slug": "club-soccer-director-pro-2020", "name": "Club Soccer Director PRO 2020", "name_original": "Club Soccer Director PRO 2020", "description": "Take control of a Real Football Club in Club Soccer Director PRO 2020<br/>\n<br/>\r\nThis is the game that puts you in charge of the whole club. Create the club the way you want it, set the club philosophy and hire the manager and his team to play the way you want.<br/>\n<br/>\r\nHandle all the player recruitment, dealing with difficult agents and managing the budgets to build a squad capable of achieving the clubs goals.<br/>\n<br/>\r\nDevelop a world class stadium and training ground, develop the academy, fitness centre and medical facilities and maximise the commercial revenues with the development of facilities within and outside the stadium.<br/>\n<br/>\r\nHandle all the busy day to day interactions with the manager, the board, finance, the players, staff, opposition managers and the demanding press.<br/>\n<br/>\r\nNo other game gives you total control of the club, but can you handle it?<br/>\n<br/>\r\nCHOOSE FROM HUNDREDS OF CLUBS<br/>\r\nChoose from 820 clubs in 38 leagues from 14 different countries across the world. Create your legacy and build your team from scratch including home country, club, stadium name and kit design<br/>\n<br/>\r\nUNRIVALLED CLUB-LEVEL MANAGEMENT <br/>\r\nManage every aspect of your club’s development and how you invest funds. Develop and upgrade your club's facilities, including the stadium, fitness centre, medical, training ground and youth Academy. Increase revenues by negotiating sponsorships. Hire and fire your management team and build your dream squad by negotiating transfers and offers with player agents as well as handling contract negotiations with players and staff alike. <br/>\n<br/>\r\nEVERY DECISION COUNTS <br/>\r\nJust like real life, your decisions affect the attitude of the board, team morale and even the fans. How you engage with press and media, ticket prices, the quality of your squad and the potential of your Academy prospects all have a bearing.<br/>\n<br/>\r\nLIFELIKE STATS ENGINE<br/>\r\nClub Soccer Director 2020’s comprehensive live-action stats engine mirrors real-life player behaviour and match outcomes, processing over 1000 decisions per game and generates real-time statistics for both individual players and teams.<br/>\n<br/>\r\nDEVELOP THE CLUB<br/>\r\nNow is beautiful 3D you can create your own area for the club and develop your stadium, training ground, academy, facilities likes shops, fitness centre and medical facilities.<br/>\n<br/>\r\nMATCH HIGHLIGHTS<br/>\r\nFor the first time Club Soccer Director 2020 shows key match highlights during the game so you can see those key goals and misses!<br/>\n<br/>\r\nTACTICAL FREEDOM<br/>\r\nLeave key decisions to the manager or overrule him by implementing your own play style as well as deciding on team lineup, formation, in and out-of-possession tactics, substitutes and more.<br/>\n<br/>\r\nCOMPREHENSIVE PLAYER DATABASE<br/>\r\nBuy or loan players from a database of over 30,000 players, each with their own unique play styles, stats and behaviours. Club Soccer Director 2020 continuously generates new players on a regular basis, ensuring you have plenty of talent to choose from whether you’ve been in the hot-seat for 1 season or 10!   Player cycles continue beyond the pitch as some retiring players go into staff roles just as they do in real life!<br/>\n<br/>\r\nFULL EDITOR<br/>\r\nFull in-game editor allows you to edit team names, ground, kits, players avatars, staff avatars and share them with other players<br/>\n<br/>\r\nDEVELOPED BY A REAL COACH AND MANAGER!<br/>\r\nLead developer Jim Scott is both a manager and coach, bringing over 15 years of industry experience to Club Soccer Director 2020.", "metacritic": null, "released": "2019-08-08", "tba": false, "updated": "2019-08-28T21:44:32", "background_image": "https://media.rawg.io/media/screenshots/0de/0decbdab532922fef26bcd651148fda2.jpg", "website": "https://www.clubsoccerdirector.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Go Play Games"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Go Play Games"], "esrb_rating": null}