{"id": 349880, "slug": "court-of-ashes", "name": "Court of Ashes", "name_original": "Court of Ashes", "description": "With your king assassinated, and the country in the midst of a war, experience the events that unfurl as one of the five royal advisers now thrust together to create a collective governing council. Manage your resources and allocate them prudently to turn the tides of battle in your favor. Cultivate relationships with your other council members to convince them to support your choices. Filled with narrative-driven interactions and branching choices, Court of Ashes is a turn-based strategy game where you must learn to rule before there is nothing left to rule over.<br/><br/><h3>Five Separate Journeys</h3><br/>Choose any one of the five council members to play as and witness the Court of Ashes story through different lenses. Explore how each character has their own ideas about rule and how those ideas manifest into strengths and weaknesses for them. Develop your relationship with each council member to unlock all 60 individualized affinity scenes.<h3>Responsive Storytelling</h3>Discover 18 different endings, with various subendings, driven by your choices. Decide which path to follow in a branching narrative which follows your responses to both the war and the other council members.<br/><br/><br/><h3>Continual Discovery</h3> Explore the story a second, third, or fourth time through different characters, approaches to conflict, and alliances. Earn unlockable outfits, starting options, and scenes to enhance each new dive into the choices and experiences of Court of Ashes.<h3>Original Soundtrack</h3>Each character has a voice on the council, and those voices come to life through the Court of Ashes OST by Eric Britt of Orchestorm Productions. Sample the diverse voices, themes, and anthems that encapsulate this story by visiting https://soundcloud.com/ericbrittmusic/sets/court-of-ashes-soundtrack.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:30", "background_image": "https://media.rawg.io/media/screenshots/373/373d98f88857d4c7565e8ee5c5b94db2.jpg", "website": "https://www.cratel.io", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 26, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cratel Studios"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Cratel Studios"], "esrb_rating": null}