{"id": 349886, "slug": "second-final", "name": "Second Final", "name_original": "Second Final", "description": "Michael Jar a scientist in engineering and programming field, he worked at the lab more than 10 years at tech and security department. Mike is leader of most projects of the lab beacause his main aim is make tommorow more developed than yesterday. One day leadership of lab decide to involve Michael in the secret project with Codename Big Future. Of course Michael looked very positively on this offer, but the final decision was taken the next day.<br/>Michael's problems started when he responded positively and was ready to get involved in this project, Michael being given the terms and conditions of this contract in the following moments. When Michael saw that he would be deprived of anything even his personality. Michael had hardly gone over these moments, but this is not all, the ultimate goal of this project is to launch a neutron rocket on the population, creating a massive genocide that will lead to the disappearance of 40% of the population<br/>Mike not sleep for several days ,he had taken a very hard decision to destroy the rocket and not allow that event to happen, he knowns what difficult way he had selected, corpus \"D\" of the lab is very securied<br/><br/><strong>Game Features</strong><br/><ul><li><strong>Platform Game</strong></li></ul><ul><li><strong>Multiple type of Missions</strong></li></ul><ul><li><strong>Stealth Game</strong></li></ul><ul><li><strong>Player World Interaction</strong></li></ul><ul><li><strong>Traps Systems</strong></li></ul>", "metacritic": null, "released": "2019-07-23", "tba": false, "updated": "2019-08-28T21:44:30", "background_image": "https://media.rawg.io/media/screenshots/f05/f05e06d6bdeedd02e9eb853b4cebc545.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Standard EVO Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Standard EVO Games"], "esrb_rating": null}