{"id": 349914, "slug": "fatelineming-yun-xian", "name": "Fateline(命运线)", "name_original": "Fateline(命运线)", "description": "<strong>Story</strong><br/><br/>In the years of Ignorance, we children look at the stars, beginning the first thinking of universe. Among million years’ knowledge, we start to know what is truth.<br/><br/>We grow up in the sun. We know sun set brings night and it will rise again. The fear of darkness also gradually disappears when we grow up.<br/><br/>However, we forget sun and earth are only pieces sand of universe sea, lowly and humble.<br/><br/>We are looking for “it”, “it” is watching us.<br/><br/>This is a science fiction story about love.<br/><br/>On a scale of universe, there is only tiny chance for we to encounter. In the time fleeting, I pray I can say I love you.<br/><br/>......<br/><br/><strong>Voice of developer</strong><br/><br/>The purpose of this game is simple: we are all lonely.<br/><br/>By daylight, we show our bright parts, talking to our family and workmates, seems optimistic.<br/><br/>But when night falls, we become sentimental. <br/><br/>We all want to meet a friend, telling the secrets that we don’t want to tell by daylight. <br/><br/>We live in fast developing city, immerse oneself in work mission, corporate performance, salary, sincere relationship becomes luxury, the one that we can tell secrets trustingly seems gradually disappear in our life.<br/><br/>we are all lonely.<br/><br/>My purpose is simple, I hope there is the one, I don’t need to know who he or she is, what look like, how old, but I can tell secrets trustingly with the one in my busy life. He will show up when I need him, and wait we there at any time.<br/><br/>For me, when this game is finished, the one already show up. And no longer, I will bring him to you.<br/><br/>...<br/><br/><strong>Introduction of graphics</strong><br/><br/>Simulate a real person, he will even use meme.<br/><br/><br/><br/>Give you a call<br/><br/><br/>With game progressing, he will update his homepage.<br/><br/><br/>And the truth of story always hide in the files he send to you.<br/>", "metacritic": null, "released": "2019-08-16", "tba": false, "updated": "2019-08-28T21:44:30", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b186093570c677f62d198bee0b119ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["singi", "匿蝶网络"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["singi"], "esrb_rating": null}