{"id": 349933, "slug": "cursed-one-2", "name": "Cursed One", "name_original": "Cursed One", "description": "<strong>«Cursed One»</strong> - story-driven first person horror in Fantasy setting. <br/>Humanity is dying from an incurable disease. Hope was beginning to fade, until you found the ancient books, These books talk of a mysterious crypt where the \"truly wishful can find their desires\". Perhaps an opportunity to stop the epidemic lies there. <br/>What secrets can be found in this mysterious place, and are you worthy enough to reveal them?<br/><br/><br/><br/><br/><br/><br/><ul> <li><strong>Fantasy-horror</strong> - fall into the vortex of magic, fear, and constant anxiety. The magical Source is in your hands. It will guide you, and be your light in the darkness.<br/></li><li><strong>Atmosphere</strong> - immerse yourself into the dark atmosphere of the underground corridors, large Crypt, vast caves and narrow passages.​<br/></li><li><strong>Traps</strong> - watch your step, be aware of your surroundings, the floor you walk may contain many traps, Some able to cause serious damage, while others may kill you in an instant.​<br/></li><li><strong>Unknown enemy</strong> - run from a creature that follows you tirelessly: hesitate for a second and you'll become his next victim.​<br/></li><li><strong>Secrets</strong> - the Crypt keeps many secrets that are carefully hidden. You may be the first to reveal them.​<br/></li><li><strong>Puzzles</strong> - path to your goal is always difficult. On your way you will face difficult obstacles that you must overcome.​</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:30", "background_image": "https://media.rawg.io/media/screenshots/1d7/1d79a67c85a5574aa119fbf8b0e80471.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Unnamed Yet ENTERTAINMENT"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Unnamed Yet ENTERTAINMENT"], "esrb_rating": null}