{"id": 350063, "slug": "flynguin-station", "name": "Flynguin Station", "name_original": "Flynguin Station", "description": "<p>Flynguin Station is a casual projectile-endless runner game with RPG elements. Travel to a scientific research camp in the Antarctic and save the penguins  by helping them rediscover the secrets of flights, lost to them thousands of years ago.<br />\nLaunch your penguin high in the air. Then slide on the ground to pickup up power-ups while avoiding harmful obstacles. Buy items to improve your penguin performance. Turn the odds in your favor with the Research Lab. And don&#39;t forget to customize your penguin!Game FeaturesLevel Up<br />\nAs you play the game, you&#39;ll earn experience to level up your penguin. Leveling up grants you research points, customizable rewards, and other rewards that you can use to improve your penguin&#39;s research level and odds.Play-To-Win<br />\nNo micro transactions! No life limits! The playing field is equal to all! Money and Research points are earned by playing. Just play the game to level up, obtain in game currency and make your penguin better than the others. Make use of the catch up mechanics every day to keep up with your friends progression.Randomized World<br />\nNo two flights are the same! The world ahead and it&#39;s obstacles are randomly generated. You won&#39;t learn the track ahead, but instead react to the obstacles up ahead. Keep your mind sharp and your fingers quick.Research Ranks<br />\nThere are 46 different research categories to improve with no limit to how many points you can spend on one category.  Plan your long term strategy and make your penguin different from other competitors! Got in-game money to spare? Keep buying more research ranks and get an edge on your competitors.Steam Leaderboards<br />\nCompete against your friends online to see who can go the furthest. See where they stop along the track and be sure you let them know you are better than them. You can inspect your friends&#39; equipped objects and research ranks to compare them to your own. See how your penguin is different and better, or learn new strategies from the top players.Penguin Creator<br />\nEarn various skins and parts for your penguin as you play the game. Design your penguin to your personality. Change your penguin&#39;s skin, beak pattern, eyes, and feet. Your penguin&#39;s look is your own.In-Depth Physics<br />\nTake into consideration altitude, air density, air drag, gravity and other variables while flying. Multiple effects stack! Go the extra mile!</p>", "metacritic": null, "released": "2019-08-06", "tba": false, "updated": "2019-08-28T21:44:28", "background_image": "https://media.rawg.io/media/screenshots/7dc/7dc275153df715a5f370ac6240486ec2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 54, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Odd Time Studios"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Odd Time Studios"], "esrb_rating": null}