{"id": 350041, "slug": "cat-lady-2", "name": "Cat Lady", "name_original": "Cat Lady", "description": "Ally Marie arrives for her regular visit to Grandma's cat-filled mansion but is startled to find an ancient evil has awoken. Not only is Grandma missing: all of her belongings are transforming into monsters, and the cats are now self-aware! With the help of her cats, Ally must find a way to save Grandma and destroy the ghosts lurking in the mansion.<br/><br/>Cat Lady features a purr-fect blend of dual-stick shooter action, roguelike elements, and tons of collectibility. Swap and upgrade your feline friends to blast homey hauntings with magical spells, investigate randomly generated biomes to progress through multiple unique areas of the mansion, and uncover the spooky intentions behind your Grandma’s kidnapping and the parade of perilous poltergeists who stand in your way.<br/><br/><br/><br/><ul><li> Play as Ally Marie, fighting ghosts by forming a team of cute kitty friends with magical powers<br/></li><li> Explore endless arrangements of unique rooms in Grandma’s mansion, fighting haunted household objects and bosses bent towards a sinister purpose<br/></li><li> Unlock new cats, areas, abilities, and enemies as you investigate the mansion, and experiment with new kitty combinations for maximum replayability<br/></li><li> Dive into dungeons littered with challenges, secrets, and collectibles to overcome overwhelming occult forces<br/></li><li> Enjoy the hauntingly adorable soundtrack by indie game dynamic duo, Jim Guthrie and J.J. Ipsen (Superbrothers: Sword &amp; Sworcery EP, Below, Planet Coaster, Reigns: Her Majesty)</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:28", "background_image": "https://media.rawg.io/media/screenshots/fe2/fe20ea37096f3fc62e987df184f081c9.jpg", "website": "https://catladygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Rose City Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["VIZ Media"], "esrb_rating": null}