{"id": 350132, "slug": "extinction-protocol", "name": "Extinction Protocol", "name_original": "Extinction Protocol", "description": "Extinction Protocol is a minimalist take on the strategy genre where you take control over a construction drone armed only with a transport hook. You'll master the physical controls and explore the wasteland shrouded in clouds for resources. You'll build, and ultimately defend your shelter against endless assaults of old war machinery.<h3>Explore</h3><strong>Delve into the vast and ever-changing wasteland where laws of nature do not apply.</strong><br/><br/>Examine the ruins of ages long gone. Scan the environment for hidden secrets and tinker with the old radio technology in the search for answers. Listen to countless weird transmissions and follow the narrative dots through to know what forces you're actually against or who you are.<h3>Build</h3><strong>Create your base piece by piece from a flexible system of construction blocks.</strong><br/><br/>Find the fragile balance between economy and defense. Scavenge for resources and think twice how to spend them. Acquire new construction blueprints and find your favorite synergies. Master the physics to speed up your construction times and minimize costly errors.<h3>Survive</h3><strong>Defend against endless assaults. Make your last stand in a world beyond salvation.</strong><br/><br/>As if the harsh conditions weren't enough, your base gets regularly attacked by all kinds of mechanized enemies. At first, you'll be happy for every day your frontline holds. But as the game goes on, you'll have to counterattack, expand and capture enemy checkpoints", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:27", "background_image": "https://media.rawg.io/media/screenshots/2c2/2c244934ce699e084b9d3fd632fa38d0.jpg", "website": "http://extinction-protocol.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Drawblack"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Drawblack"], "esrb_rating": null}