{"id": 350109, "slug": "monstercastle-guai-wu-cheng-bao", "name": "MonsterCastle - 怪物城堡", "name_original": "MonsterCastle - 怪物城堡", "description": "<h3>Monsters who survive in the Jedi must avoid the future of genocide!</h3>Monster Fortress is a simulated survival game.<br/>In the game, you will play the manager of the castle. You are one of the builders of an underground castle built by the few monsters in the world to keep the fire alive. For some unknown reason, today's castles are under your control. It is your duty to receive all monsters who are gradually weakened by the exhaustion of faith and to maintain the good operation of the castle.<br/><h3>Our goal is to redeem all the vagrant monsters and build a warm home!</h3>Nowadays, the world is getting worse and worse. The weak and small human beings who were sheltered by us and provided us with the strength of faith now not only want to put us in the institute, but also want to send us slices to the table!!!<br/><br/>The purpose of the monster fortress is to protect the species of fire and escape the tragic fate of being treated as a plate of Chinese food by human beings!!!<br/><br/>There are many different parts of the monster fortress. Like human society, running a huge Castle requires a lot of different kinds of energy. When you collect enough energy, use a certain amount of energy to build different functional areas in the castle or expand the capacity of the castle, from time to time send members of the staff to explore and collect information and material treasures and so on. As energy gathering increases, you can unlock more different areas, and the more unlocked, the better the castle will work.<br/><br/>Of course, in the beginning, we will provide you with a \"huge sum\" of energy as your start-up funds, in order to solve your food and clothing.<br/><h3>Protecting civilization is inseparable from your observation and efforts.</h3><br/>As the manager of the monster castle, you should not only ensure the food and clothing of the members of the race, but also know how to make the best use of every workforce in the castle to ensure that the production efficiency of all energy reaches its peak.<br/><br/>Each member has a different base value. You need to have a clear understanding of their base values and job preferences to ensure that all members are assigned to the most suitable positions. In addition, you can also build public facilities to improve the basic value of the area, to help you better operate the entire castle.<br/><br/>Corresponding to the basic value of different work, the energy obtained has a gap you can not imagine, please choose carefully.<br/><h3>Don't be blinded by the peaceful life. Always remember that we survive in the cracks.</h3><br/>There are always many accidents in the world. In the process of management, you never know what will happen in the next second. Monsters pray for a stable life, but humans cannot tolerate the existence of strange beings with magical powers in their world. Even if we hide in the dark underground world, once discovered, they will destroy our homes at all costs.<br/><br/>In addition, due to technical constraints and old equipment, many facilities occasionally have some minor accidents.<br/>Please take good security measures to protect our only home.<br/>", "metacritic": null, "released": "2019-08-15", "tba": false, "updated": "2019-08-28T21:44:28", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd4f8c0ddc89b56ef6acbe4478e15de0.jpg", "website": "https://weibo.com/p/1005052645370373/home?from=page_100505&amp;mod=TAB&amp;is_all=1", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TentacleGame"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["TentacleGame"], "esrb_rating": null}