{"id": 350114, "slug": "gods-of-havoc-into-the-void", "name": "Gods of Havoc: Into the Void", "name_original": "Gods of Havoc: Into the Void", "description": "<h3>Gods of Havoc heralds a return to the classic God-Game.</h3>Gods of Havoc is a three-part series offering difficult, turn-based strategy. Each game places the player as a god in different eras of a planet’s history. 'Gods of Havoc: Into the Void' takes place on a galactic scale.<h3>Gods of Havoc: Into the Void</h3>You take the roll of a god, to a sentient, and self-governing populace. With no interference from you, your people will spread out to the stars, colonise new worlds, build fantastic structures, wage wars, and reshape the universe… that is, they would, if there weren’t other gods, and other races, waiting to stop them.<br/>As a god, you have the power to aid your people with powerful magics, and to guide their progress with suggestions and dreams. Even with your help, it may not be enough to defeat the brutal and magical forces building against them.<h3>The Series</h3>Don't forget to check out, and wishlist, the another pending game in the series, Gods of Havok: Fall to Earth<br/>https://store.steampowered.com/app/1120770/Gods_of_Havoc_Fall_to_Earth/<h3>The Game</h3><ul><li>A turn-based strategy game.<br/></li><li>Battle up to ten other gods and their peoples.<br/></li><li>An intelligent simulation of space colonisation, exploration, and exploitation.<br/></li><li>Use a ‘Pass-Time’ option to move the game forward,<br/></li><li>And customise a log to alert you when certain events happen.<br/></li><li>A fiendishly difficult AI with various difficulties.<br/></li><li>Crafted from a love of Populous, Megalomania, and other ancient god-game classics!<br/></li><li>3 game-modes: standard solar systems, high density asteroids, and completely random placement. Each offers unique gameplay and strategies.</li></ul><br/><h3>Your People</h3>At the core of the game, is the civilisation you are nurturing. They will begin by colonising the different planets in the solar-system, building various ships, establishing defence fleets, sending out prophets to convert their neighbours, and eventually begin work on a Dyson Sphere and Mega-Ships. So long as no other race stops them.<h3>Your Role</h3>As your people’s protector you can help them on their expansion into space. The more followers you have, the more powerful you become.<br/><ul><li>Create swamps to slow enemy ships, mines to damage them, or swarms of space insects and dragons to attack them.<br/></li><li>Empower your people’s defence fleet to become a crusader and let it seek out enemies, or guide it on a crusade.<br/></li><li>Terraform and manufacture your people’s planets to increase their population and produce more mana for you.<br/></li><li>Cast winds, floods, fire, and plagues on enemy planets to kill off their population.<br/></li><li>Convert or destroy enemy fleets using the Hand of God.<br/></li><li>Turn ancient asteroids into powerful vessels or magical space-stations to fortify your people’s position in space.   </li></ul><h3>The Enemies   </h3> <br/>Unfortunately for your people, you are not the only god. Play against a difficult AI which has all of your powers and perhaps, even less scruples!", "metacritic": null, "released": "2019-08-08", "tba": false, "updated": "2019-08-28T21:44:27", "background_image": "https://media.rawg.io/media/screenshots/51e/51e0e85d85e3d50e1d144e460839fcaf.jpg", "website": "https://www.gods-of-havoc.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mykel Flynn"], "genres": ["Strategy", "Simulation"], "publishers": ["Mykel Flynn"], "esrb_rating": null}