{"id": 350270, "slug": "it-stares-back", "name": "It Stares Back", "name_original": "It Stares Back", "description": "Enter The Great Tapestry: Once a candy-colored realm of dreams and fantasy, now a corrupted death-scape of perilous ruin. Will you gaze into the void to learn the fate of this tattered land? Be wary, traveler… <br/><br/><strong>IT STARES BACK</strong><br/><br/>Play as the Noble Guide, a fabled commander with the power to conjure lost spirits that might join the ranks of your undead army. Explore the Four Kingdoms to discover new heroes, armor, soldiers, and structures much needed in your campaign to restore the Great Tapestry to its former brilliance.<br/><br/>Weave your fate into this dark-fantasy <strong>RTS</strong> that uniquely incorporates <strong>RPG</strong> mechanics into its’ illustriously <strong>hand painted</strong>, lore-rich story.<br/><br/>4X, hex based, real time strategy combat has never played like this before. Gaze over the battlefield as Hex, the mechanical owl. <strong>EXPLORE</strong> by sending the Noble Guide out to light spires scattered across the map, revealing a variety of troop resources to <strong>EXPLOIT</strong>. <strong>EXPAND</strong> your territory across each region carefully, as there are many holes in the Tapestry and void is unforgiving. <strong>EXTERMINATE</strong> the wretched beasts that lie waiting in the Clamoring Mist. For they stand between you and the completion of the Rites of Awakening.<br/><br/>Death is a welcome friend. Soldiers revive in collected dying pools, giving you wave after massive wave of undead to hurl at your opponents!<br/><br/>Currently in Early Access with regular developer updates to the map region in \"Dreams of the Makers.\" Join our Discord Legions to make your own maps and share them with our Community.", "metacritic": null, "released": "2019-06-25", "tba": false, "updated": "2019-08-28T21:44:25", "background_image": "https://media.rawg.io/media/screenshots/206/2060655bf61d74d298af3e92b50256fb.jpg", "website": "http://lightarcstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Light Arc Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Light Arc Studio"], "esrb_rating": null}