{"id": 350292, "slug": "tanks-and-guns-battle-supreme", "name": "Tanks and Guns: Battle Supreme", "name_original": "Tanks and Guns: Battle Supreme", "description": "Tanks and Guns is a new online multiplayer game - featuring Battle Royale and Deathmatch - merging a strong first person shooter with vehicular combat and racing. Tanks are the ultimate prize and whoever commands one is likely to win - unless enemies work together to take it down, and then fight each other again.<br/><br/>A key part of Tanks and Guns gameplay is using vehicles - tanks and cars - racing down mountain roads, hill-climbing, navigating difficult terrain and finding and choosing the right vehicle for the task at hand. Many areas are not realistically reachable on foot in a timely manner, and often these areas hold the best loot, weapons and yet better, more powerful and armed vehicles. At the most vaunted hot spots tanks and heavily armed helicopters can be acquired, turning the tide of the game and who is going to win, unleashing massive firepower.<br/><br/>The game features an active aiming reticule system - constantly adapting and moving around, based on tracing from the barrel of the gun, to show the circle of impact in the world. This allows for bullets properly leaving the barrel of the guns, not just shooting from the center of the screen as in older shooters. This creates a much more realistic experience and more of a real gun handling feeling. All guns also feature iron sights and scopes, which is preferred for precision shooting.<br/><br/>The game features LAN and Internet multiplayer. If you are interested in getting involved in the community and are looking to run dedicated servers for yourself, your clan or friends, or even better - the public, please contact us.<br/><br/>The hardware requirements are steep! Sorry about that but we are pushing for something new, a higher level of graphics detail and physics interaction. The minimum requirement is an nVidia 1060 level GPU with an Intel i5 or equivalent, which can run the game at 30 fps at 1080p. To hit 60 fps you need at least an nVidia 1070 level GPU and an intel i7 quad core.<br/><br/>The game is built around a brand new D3D12-only high-end graphics engine - generating massive detail on-the-fly using high-range displacement maps, realtime deformation and advanced material blending - reaching final output geometry density close to pixel precision, achieving a geometry generation and throughput rate in the 0.5 - 2 <strong>billions of triangles</strong> per second range on mid to high-end GPUs - while still targeting 60 fps minimum framerate on nVidia 1070 and upwards class GPUs. The technology represents a major shift in game content production, visual quality and world generation, being able to take full advantage of real-world scanned materials and displacement maps to generate the game world, including defining features and gameplay areas. The technology generates roads, tracks, caves and other game areas on-the-fly in real-time, using procedural systems to mold a raw input terrain map into a fully featured game map. This is a huge advantage for game content iteration times, game updates install sizes and enables variations of maps where a seed can be used to select a combination of roads, features and gameplay areas, keeping the gameplay and the challenges fresh.<br/><br/>Perhaps most importantly,<strong> for real advances in what really matters - gameplay - the graphics technology is coupled directly to the physics system</strong>, offering realistic physics environments with real materials with deformation, friction, traction and resistance for vehicles and all physics objects, resulting in more realistic, fun and challenging physics behavior. Vehicles and players cannot easily traverse all terrain and ground, cannot climb steep inclines without sufficient traction and can get stuck in mud and deep sand or water. This changes gameplay dramatically as just like in real life, one has to think about where to choose to go, and what the risks are to get stuck or hitting a dead end versus the potential reward of getting there faster by taking a shortcut.", "metacritic": null, "released": "2019-08-16", "tba": false, "updated": "2019-08-23T12:10:53", "background_image": "https://media.rawg.io/media/screenshots/89f/89f4fb465993d45bfc44791f19b1623b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Assassins Corp"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Assassins Corp"], "esrb_rating": null}