{"id": 350299, "slug": "kan-bu-jian-de-ai", "name": "看不见的爱", "name_original": "看不见的爱", "description": "This is a plot game, we have experienced advice from different people in our lives, they may be close to or distant from us, but the language they speak will have a profound and lasting impact on our future lives. Our team hopes to record such memories, by telling about the protagonist's different life experiences after reincarnation, so that players can more or less see their own past experiences, which may have been said to you. You may have said it to others, and the person who may have said it may not care too much, but the person who listens to it may be under a lot of pressure or stimulation. This time we will protect the life of the game character, move forward with him, and look for this invisible heart together. <br/>\n<br/>\r\n----------------------------------------------------<br/>\r\nMain features: <br/>\r\n* A unique gaming experience for non-combat stories. <br/>\r\n* Subtitles are based on the rhythm of the music and float out at random to attack the player. <br/>\r\n* Click on the subtitle to protect the protagonist's life from language attacks. <br/>\r\n* A concentrated plot arrangement that allows people to experience the authentic life experience to the fullest. <br/>\r\n* There are 1 levels in this game. <br/>\n<br/>\r\n----------------------------------------------------<br/>\r\n48 hours limit Development works of CiGA Game Jam 2019 Shenzhen Station", "metacritic": null, "released": "2019-07-25", "tba": false, "updated": "2019-08-28T21:44:25", "background_image": "https://media.rawg.io/media/screenshots/e63/e630583fc7528d5e9a15dda5ad5da1a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["深圳市晴天谷网络科技有限公司"], "genres": ["Casual", "Indie"], "publishers": ["深圳市晴天谷网络科技有限公司"], "esrb_rating": null}