{"id": 350222, "slug": "inbound-ufo", "name": "Inbound UFO", "name_original": "Inbound UFO", "description": "<strong>Inbound UFO</strong> is an indie tower defense game created by a team of two developers over the course of 3 years. The game has a style inspired by the <strong>RTS</strong> games from the beginning of<strong> 2000's</strong>. It is a game that combines the fast combat tactical decisions with the long term upgrade strategy and gives the player an unique gaming experience every time he or she hits the start wave button.<br/><br/><strong>The Story</strong><br/><br/>A full scale alien invasion is developing and it has the signs of a strange and unexplainable deployment of forces that attack in apparently random places after disabling some of the most powerful strategic weaponry on Earth and blowing off the orbit the most advanced satellites that human race managed to create so far.<br/><br/>It is becoming quite difficult to stop even the tiniest alien coming down the road. Upgrades are necessary but the army is in trouble with the finances and the communication channels. Expect a delay when calling for Army Support. Fortunately the HQ will provide several towers from the strategic army supply for free. The rest is your merit and you have to prove your skills in order to get the cash and the research funds.<br/><br/>You are leading a brigade, part of a classified army division trained and equipped to handle this type of encounters.<br/>Plan your map strategy for the worst scenario, watch your cash and don't be afraid to sell the already deployed and used towers in order to defend in better positions.<br/>Be precise and creative, command your towers with maximum vigilance, the time is short.<br/><br/><strong>The Game</strong><br/><br/><ul><li>20 missions Campaign with high replayability and an automatic wave generator unlocked when advancing in campaign.<br/></li><li>16 towers made up from 4 tower categories, each with 4 tiers.<br/></li><li>Controllable towers that have a set of orders that can be issued to them, allowing the player to pin point an enemy, organize an ambush, hold a tower for a shot in the back and so on.<br/></li><li>Upgradable towers and secondary weapons that give the player an option to leverage between the upgraded characteristics and combat deployment costs.<br/></li><li>20 enemies with different AI-s, skills, weaknesses and strengths that will put pressure on your tactical and strategical skills.<br/></li><li>A Time Slowdown ability that comes as a very handy tool to gain tactical time.<br/></li><li>Realistic projectile physics and AI reactions.<br/></li><li>A global in-game military budget that will test your strategic skills from a financial perspective. Don't build more towers than needed. Use all the free towers too.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:26", "background_image": "https://media.rawg.io/media/screenshots/aac/aac1a898c3ab4415fedc56a76b1f0375.jpg", "website": "http://www.invenmatic.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Invenmatic"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Invenmatic"], "esrb_rating": null}