{"id": 350428, "slug": "reign-of-guilds", "name": "Reign of Guilds", "name_original": "Reign of Guilds", "description": "In Reign of Guilds, one doesn't need to survive, build cabins, or cultivate cabbage. Here, nobody values blisters from a pickaxe or a shovel, but what considered as value are interaction skills with other players, be it either combat or diplomacy, trade or craft.<br/><br/>Some Guilds will go toe-to-toe in deadly battles for the lands, castles, titles, and the throne, while others will win over craft and trade markets without any bloodshed and position themselves on the same level with Counts and the King.<br/><br/>The King, Counts, associations, the Royal Bank, taxes, commissions, expenditure on lands and maintenance of auctions? Let's get this sorted out.<br/><br/><br/><br/><ul><li>Dynamic combat system from the first person view with full non-target, enabled friendly fire, and a unique system of magical buffs.<br/></li><li>A new look at “old” rules and a minimal amount of restrictions.<br/></li><li> PvP and PvE only in the open-world.<br/></li><li>Loss of experience and drop of items when killed, depending on the karma of the character.<br/></li><li>The character development is possible via any of the three ways in any combinations: PvE / Craft / PvP.<br/></li><li>Only b2p monetization during the Early Access and p2p after the release with compensation of the price paid for the Early Access game with playtime. </li></ul><br/><br/><br/><ul><li>Players from different countries will collide with each other within one Kingdom of Dwarrhan fighting for the throne, titles, and areas of influence.<br/></li><li>The Open World is divided equally between Europe and CIS: two continents for each side.<br/></li><li>There are 7 Counties on each continent. In the center of Dwarrhan, there is a Royal County under the same title.<br/></li><li>Traveling over the kingdom is free, seamless, and is restricted only by the game mechanics.</li></ul><br/><br/><br/><ul><li>There are more than 60 castles of different levels on the Eastern and Western continents. Almost every Castle plays a role in capturing of power in the Counties.<br/></li><li>The Guilds’ Heads can receive the title of Count. A Count gets the right to receive trading and land taxes from all the players on his territory, but he bears the expenses for maintenance of his possessions.<br/></li><li>The Counts will fight for the Royal Throne. The King not only rules over his County and the Royal trade, but he sets the Royal Tax for the Counts by taking some part of taxes collected by them.</li></ul><br/><br/><ul><li>The economy is deeply embedded into all game aspects for each player via taxes, commissions, and expenses on development and maintenance of the lands and markets. Only a reasonable balance will lead to the prosperity of the County and the whole Kingdom.<br/></li><li>All the resources are available in the open-world and distributed unequally over the Counties and continents.<br/></li><li>The mining and processing of the resources are given in the hands of NPCs, but the Count must maintain the corresponding industries for that.<br/></li><li>All players have to do is to collect the resources and transport them to economically advantageous places for processing..<br/></li><li>Under the condition of the open-world PvP, only organized groups will be able to ensure effective and secure transportation of the resources.<br/></li><li>Collected taxes of all levels must also be transported from the main castles to the branches of the Royal Bank.</li></ul><br/><br/><br/><ul><li>The multi-level craft system. Up to 27 thousand of variations of characteristics for a single item. The wear and tear gradually cause items to lose their characteristics.<br/></li><li>There are associations of Traders, Craftsmen, and Mercenaries in each County. Each Association has its own auction which is ruled by its Head Guild. Not only it sets the number of commissions, but also it is able to completely block the access to the auction by Guilds, Counts, and the King.<br/></li><li>Unique dynamic balancing mechanics of venders which regulates the trade with NPCs and works based on the principle of the law of demand and supply.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:10:52", "background_image": "https://media.rawg.io/media/screenshots/0b0/0b045009aaa653a4de7208682dd82dd5.jpg", "website": "https://reignofguilds.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 619, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atlant Games"], "genres": ["Massively Multiplayer"], "publishers": ["Atlant Games"], "esrb_rating": null}