{"id": 350436, "slug": "cradle-of-sins-vr", "name": "Cradle of Sins VR", "name_original": "Cradle of Sins VR", "description": "The game is played in matches between two teams of three players with each team defending their own separate Altar on the map. Each of the players independently control a powerful character. The game features 10 unique characters at release, each of which has their own unique weapons, abilities and upgrades. Different weapons ranging from swords, crossbows, shields, staffs and powerful crystals. Players have a passive income of gold and get rewards for killing enemies across the map. This gold can be used to buy weapons and upgrades to successfully battle the opposing team's character in player versus player combat. A team wins by being the first to destroy a large structure located in the opposing team's base.<br/><h3>Story</h3><br/>The Great Architect plagued with heartbreak and ruin. All that he loved was ripped away in a matter of moments. He vowed to himself that he would create a powerful being who would grant him what was once taken from him.<br/>He gathered warriors to the island one by one and told everyone to fight and learn from one another. He had specifically chosen these warriors for their knowledge and powers to accomplish his goals. In the end The Great Architect promised to grant the winner whatever they most desire.<br/>Slimes are the henchmen of The Great Architect. These creepy minions were created using dark magic with a purpose to cause order on the island, making it is impossible for the warriors to escape. One wrong move, and they may torture one into submission.<br/><br/>Visit our website to learn more about the game story.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:10:52", "background_image": "https://media.rawg.io/media/screenshots/764/764a23625be5a2384af1a1db7bdd314f.jpg", "website": "https://cradleofsins.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["U24 Solutions"], "genres": ["Action", "Strategy", "Massively Multiplayer"], "publishers": ["U24 Solutions"], "esrb_rating": null}