{"id": 350671, "slug": "admiral-stepinski", "name": "Admiral Stepinski", "name_original": "Admiral Stepinski", "description": "<h3>No \"winning player will always win\"</h3>When a winning player captures a lot of planets and has a lot of connections between planets, losing players can steal from him or her by crossing the connections at any point.<h3>No \"building one big army\"</h3>Every ship costs maintenance every 10 sec so no place for Huge Army tactics.<h3>Features</h3><ul><li>fast-paced tactics where radar is important<br/></li><li>if you get too powerful at beginning, you will probably lose<br/></li><li>40 maps<br/></li><li>2 short single player campaigns, 2 short co-op campaigns for two players<br/></li><li>3 factions<br/></li><li>gatling turret, laser turret, rocket turret<br/></li><li>gatling bullet hits calculated in real time<br/></li><li>shields<br/></li><li>5 types of ships<br/></li><li>AI<br/></li><li>online skirmish and 2 players co-op multiplayer [no lan multiplayer]</li></ul><h3>Mechanics</h3><ul><li>Player’s planets and connection between player’s planets earn money. <br/></li><li>Player can build ships from money of his/her planet and also from money of all near connections with player’s planets.<br/></li><li>Every ship has maintenance cost which decreases earnings of planets.<br/></li><li>If connection between planets is crossed by enemy ships at any point, all lane’s money is distributed among the captures’ planets and the lane earns money for the capturer. The crossing point will be destroyed when friendly ships get near.</li></ul>So in order to win, it’s important to guard the connections of your planets.<h3>Other Mechanics</h3><ul><li>Planet can get upgraded to unlock more powerful ships.<br/></li><li>Ships are divided into fast-but-weak and strong-but-slow ones. The player who uses radar information wisely will be able to prepare for attack of the strong ones. <br/></li><li>There is one more ship type: super-strong, super-expensive, super-slow one with a lot of turrets.</li></ul><h3>Visuals</h3><ul><li>Every individual laser turret must rotates in order to shoot which adds details.<br/></li><li>When damaged, ship shows damage marks with smoke going from the holes.<br/></li><li>On destruction, ship becomes grey and slowly fades away leaving trails of smoke.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:19", "background_image": "https://media.rawg.io/media/screenshots/fd5/fd50f120a7c0f623c65a37a31395ed83.jpg", "website": "http://admiralstepinski.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adam Stępiński"], "genres": ["Strategy", "Simulation"], "publishers": ["Adam Stępiński"], "esrb_rating": null}