{"id": 350719, "slug": "flippin-kaktus", "name": "Flippin Kaktus", "name_original": "Flippin Kaktus", "description": "<p>Flippin Kaktus is a brutal action-driven adventure with platformer elements, featuring rage outbreaks combat style. In 1984 wacky punk defies vicious drug cartel to save his foster family... but the story begins on agave plantations in 1914. Mysteriously awaken under scorching desert sun, Kaktus has to disclose his own dark side to withstand opponents in unfriendly world.<br />\nDouble trouble: flip between two Kaktus personalities to excel in combat. Use sly and nimble style to dodge the bullets or accumulate rage powers to brutally bash through enemies.<br />\nThe dark side of Kaktus: use dangerous substances like alcohol and drugs to get some temporary combat boost against trained thugs. Not without dire consequences... and ODs.<br />\nVersatile exquisite combat: brute force is limited and not always the best choice. Harness your tactical skills and make use of environment to maximize your battle potential - equip armor, lure enemies into traps, drop barrels on their heads or ambush from disguise!<br />\nAdvanced enemy AI: cowboy, hunter, machete thug, uzi gangster... - they are seasoned fighters that won’t give up easily. Your only hope is - they’ve never seen a walking cactus before!<br />\nCall los amigos: make eccentric friends along the journey and find a use of their quirky abilities. When push comes to shove they will be there to lend a hand… or wing… or hoof!<br />\nPlatformer that makes sense: every prop on a level has a real-world reference - from desert quicksand to cutting-edge factory equipment. Fire burns, acid corrodes, water soothes, explosion obliterates.<br />\nA tad of nostalgia: 11 unique locations with memorable design and hand-crafted levels, inspiration from Mexican culture and VHS action-movies, retro gameplay, artist-tailored comic art and of course - mellow melodies of mariachi, industrial and synthwave.</p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-04-29T12:21:52", "background_image": "https://media.rawg.io/media/screenshots/191/1918dd0c59d1d323bc8a279ada8bebd1.jpg", "website": "https://flippinkaktus.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 5", "Xbox Series S/X", "Nintendo Switch", "PC", "Linux", "macOS"], "developers": ["MyBunny Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["MyBunny Games"], "esrb_rating": null}