{"id": 350741, "slug": "night-island", "name": "Night Island", "name_original": "Night Island", "description": "Welcome to Night Island. This is a Roguelite overhead action game that uses randomly picked weapons, abilities, and props to fight evil and powerful enemies in the generated levels.<br/>On this isolated island, where the night is shrouded, zombies are everywhere and danger is everywhere. You wake up in your dreams, but don't remember anything. Your brain is like a defective picture tube. The past picture is short, broken and noisy. Fortunately, the survivors on the island are familiar with you. They trust you and hope that you can lead them to find a way to survive. But they are not so enthusiastic about helping you to restore your memory. And when you die and rise again and again, they turn a blind eye and become accustomed to it...<br/>You need to explore again and again in the cycle of life and death, uncover the secrets of the night, discover the voices hidden behind the words of the survivors, and your most important thing - identity.<h3>Game Features</h3><br/> RogueLite and a large number of random elements: a permanent death experience with repetitive playability and stimuli<br/><br/> Rich Build combination: the powerful ability to destroy the earth through weapons, skills, and passive<br/><br/> In-depth story selection in combination with gameplay: plot selection through core battleplay instead of simple options<br/><br/> Powerful enemies: up to 14 powerful and brutal Boss, waiting for you to challenge<br/><br/> Exploring elements: Collect 80+ weapons, skills, and props in hidden rooms, secret passages, and NPC secrets<br/><br/> Through the talent tree, the ability to customize the role, and learn new abilities", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:18", "background_image": "https://media.rawg.io/media/screenshots/720/720fca5aa8ac911f882b7fc2a183afd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aurora Interactive"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Aurora Interactive"], "esrb_rating": null}