{"id": 35086, "slug": "kao-the-kangaroo-round-2", "name": "KAO the Kangaroo: Round 2", "name_original": "KAO the Kangaroo: Round 2", "description": "<p>Play as Kao! The cutest and bravest kangaroo of all video games returns in this digital version of “Kao the Kangaroo: Round 2.&quot;<br />\nExperience the joy of playing a classic 3D single-player platformer filled with various challenges, including fighting, racing and solving puzzles.<br />\nBounce through 25 levels set in 5 unique, colorful worlds to rescue your animal friends captured by the evil Hunter and his henchmen!<br />\nExperience the digital version of a classic 3D arcade platformer with online features like:<br />\n<em> Steam achievements<br />\n</em> Steam cloud saving<br />\n<em> High resolution support<br />\n</em> Controller support (Xbox 360/ One and PS4)<br />\n<em> Bounce through 25 levels set in 5 unique, colorful worlds<br />\n</em> Punch the baddies! Use a variety of different fighting techniques to rescue your friends<br />\n<em> Approximately 30 challenging enemies to defeat<br />\n</em> Boss encounters<br />\nThe digital version of Kao the Kangaroo is a nostalgic journey to the past for all players who grew up with the classic platformers. This is a fun, educational experience – enjoy vintage gameplay on this classic 3D arcade game.<br />\nOnce you add it to your library, it will never leave.<br />\nThe opportunity to play this classic version of Kao the Kangaroo was made possible by all of the engagement and requests from our loyal Kao fans. These wonderful players came together under #BringKaoBack and asked us to release Kao digitally.<br />\nThis moved us deeply, and we decided to grant their request and release the game as our way of saying “Thank you for being with Kao for the last 2 decades.” We also want to thank you for your interest in our game, since you are here on our product page.</p>", "metacritic": null, "released": "2005-04-15", "tba": false, "updated": "2023-12-18T17:34:31", "background_image": "https://media.rawg.io/media/games/83a/83af36d8924271087360d142d34f0960.jpg", "website": "http://www.kaothekangaroo.com/index_en.html", "rating": 2.64, "rating_top": 1, "added_by_status": {"yet": 117, "owned": 2215, "beaten": 36, "toplay": 6, "dropped": 33, "playing": 6}, "playtime": 1, "achievements_count": 9, "ratings_count": 130, "suggestions_count": 507, "game_series_count": 5, "reviews_count": 130, "platforms": ["PC", "Xbox", "GameCube", "PlayStation 2"], "developers": ["Tate Multimedia", "Tate Interactive"], "genres": ["Action", "Adventure", "Racing", "Arcade", "Casual", "Platformer"], "publishers": ["Atari", "Tate Multimedia", "JoWooD Productions"], "esrb_rating": null}