{"id": 350928, "slug": "vr-ping-pong-pro", "name": "VR Ping Pong Pro", "name_original": "VR Ping Pong Pro", "description": "<p>Rackets at the ready! VR Ping Pong Pro is the follow up to the hit table tennis simulator of 2016, VR Ping Pong. Test your skills with a variety of challenging game modes, as you rise up the ranks to become the true Ping Pong Pro! Do you have what it takes? Pick up your virtual racket and find out!<br />\nFeaturing 8 new levels including an arcade, a stadium and a Japanese garden; you can compete to become the champion against gorgeous and photorealistic backdrops! VR Ping Pong Pro also features racket/ball customisation with a tonne of different options to choose from; you can become the pro in style!<br />\nGo from novice to pro with 5 unique difficulty levels to suit any player’s skill level. The addition of in-depth player statistics, online rankings and online multiplayer raises the stakes as you all compete to become the true Ping Pong Pro – after all, there can only be one! Will it be you?<br />\nFeatures<em><br />\nSingles Match – (Player vs CPU or Player 1 vs Player 2)<br />\nOnline multiplayer – choose to play either single matches or tournaments with people from all over the world<br />\nBecome the best in Tournament Mode – pyramid-style tournaments are ranked by difficulty<br />\nExciting mini games where you can hone your skills or just have fun!<br />\nA variety of photo-realistic environments, placing you right at the centre of the action<br />\nTrue to life physics, (with full-spin mechanics), make it feel like you’re really there!<br />\nCustomisable Rackets – racket changes serve a practical purpose as well as a visual one, and can alter your serve for example<br />\n</em>Even more features coming soon!</p>", "metacritic": null, "released": "2019-11-12", "tba": false, "updated": "2023-02-13T18:18:43", "background_image": "https://media.rawg.io/media/screenshots/3ac/3aceef6a94ad3fc15200c85aa7876d6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "dropped": 2}, "playtime": 3, "achievements_count": 2, "ratings_count": 4, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "PlayStation 4"], "developers": ["ONE-O-ONE GAMES", "Reddoll", "IVP"], "genres": ["Simulation", "Sports"], "publishers": ["Merge Games"], "esrb_rating": null}