{"id": 350957, "slug": "aim-for-the-win", "name": "Aim for the Win", "name_original": "Aim for the Win", "description": "Aim training shouldn't feel like school. Why take the fun out of getting better at video games?<br/>\n<br/>\r\nAim for the Win, Aim FTW, is the video game that makes you a better gamer. This game trains you so that you can focus on having fun!<br/>\n<br/>\r\nEven better, Aim FTW is backed by hard science and artificial intelligence to help you get better faster than alternative solutions. You feel the effect and notice an improvement in your gameplay within hours.<br/>\n<br/>\r\nAim FTW is also customized to each individual gamer. This game doesn't just train you, it adapts to you. You no longer have to fit into unrealistic molds or one-size-fits-all trainers that don't fit your current skill level. As you grow in skill, the game grows in difficulty and complexity, forcing you to improve.<br/>\n<br/>\r\nAim FTW features multiple game modes to hone different aspects of your game play and is under continuous development. We will continue releasing features and updating existing modes to make your training as effortless as possible so that you can become the best gamer possible.<br/>\n<br/>\r\nAim FTW is a free-to-play game. We don't believe that financial complications should hold you back from success. You will never have to pay for the base game and all or almost all content will be either free or unlock-able via gameplay.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:15", "background_image": "https://media.rawg.io/media/screenshots/773/773ca42b62851d2b0ad8850566e9749f.jpg", "website": "https://www.aimforthewin.gg", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["NetPlay"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["NetPlay"], "esrb_rating": null}