{"id": 351006, "slug": "project-deepweb", "name": "Project DeepWeb", "name_original": "Project DeepWeb", "description": "<p>The DeepWeb. This place is beyond description — you have to see it for yourself. Something, that did not passed humanity filters. Everyone here can finally take off his mask and show himself. Friends, enemies, knowledge, ignorance, life and death — everyone here can find exactly what he searches for.Should you search? No. If it&#39;s hided, you should not know it. In most cases it&#39;s dangerous, immoral or wild. It&#39;s unnecessary information, which was safely tucked away by caring parent for your own safety.But sometimes someone goes too far. Throughout time there were brave men, who were traveled to places where common man never step. They believe, that among lots of pain you can find one that will provide new sounds for human hearing, and among darkness - one, that will be able to hide you from people.<br />\nBut anyway, the Silent House awaits new guests.<br />\nProject DeepWeb is an absolutely new perspective on the genre of psychological horror. Puzzles are on the surface, but answers are deep inside. You&#39;re going to discover hundreds of websites, find dozens of documents, go through every Internet level — it&#39;s all to achieve your objective. And if you&#39;re brave enough to dig a little deeper, you&#39;ll see something, that was supposed to stay intact forever.Welcome to the DeepWeb. It&#39;s a showtime!</p>", "metacritic": null, "released": "2020-04-15", "tba": false, "updated": "2023-04-29T14:28:09", "background_image": "https://media.rawg.io/media/screenshots/ade/ade45d8cca0260b80d5d78ffe51b3109.jpg", "website": "https://nightcat.games/games/project-deepweb", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["NightCat Games"], "genres": ["Simulation", "Indie"], "publishers": ["NightCat Games"], "esrb_rating": null}