{"id": 351068, "slug": "ohshape", "name": "OhShape", "name_original": "OhShape", "description": "<h3>Description</h3>OhShape is a thrilling fast-paced action VR game where you will perform different poses and move your body to the rhythm of the music to go through silhouettes trimmed on walls. With a great soundtrack, this indie VR game will test your reflexes and skill while you try to achieve the highest score.<h3>Key Features</h3><ul><li>Feel the Rhythm: A precise mix of kinesthetic movements, music and visual effects will take you to another dimension.<br/></li><li>Fun for All: No matter what your skill is, OhShape has easy, medium and difficult levels for each track so you can just relax and enjoy or take it seriously and become a Master of Rhythm.<br/></li><li>Updated Content: OhShape will have a great soundtrack and we will bring a steady flux of songs and game modes so you will always have something new to try.<br/></li><li>Handcrafted Levels: We work with a team of professional choreographers and together we design each level to make it more fun, organic and stylish.<br/></li><li>Compete with Friends: Climb to the top of the leaderboard in a party with friends or beat the highest scores from players around the world.<br/></li><li>Get On Shape: Moving to the rhythm of the music is a fun sport. Burn that calories with the best cardio ever!</li></ul>", "metacritic": null, "released": "2020-09-24", "tba": false, "updated": "2023-08-31T07:25:56", "background_image": "https://media.rawg.io/media/screenshots/c73/c7309f8025027022d37aed1c699bde64.jpg", "website": "http://ohshapevr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 44, "toplay": 1, "dropped": 3, "playing": 2}, "playtime": 1, "achievements_count": 42, "ratings_count": 4, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 4", "PC"], "developers": ["Odders Lab"], "genres": ["Action", "Sports", "Family"], "publishers": ["Odders Lab"], "esrb_rating": null}