{"id": 351100, "slug": "treasure-fleet", "name": "Treasure Fleet", "name_original": "Treasure Fleet", "description": "In this turn based 4X strategy game you embark in a voyage of discovery and build lucrative colonies, search for lost treasures deep in the jungle and trade with the native villages.<br/><br/>As you establish settlements, colonists or hired craftsmen can be brought in to work the land and generate trade goods that can be sold for profit in your home country. Build factories to increase the trade with the natives, or forts to secure your colonies. Explore terra incognita and visit native villages, explore ruins hidden in the wilderness and search for treasures, and ultimately discover the fabled El Dorado.<br/><br/>Build up military forces and prepare to support garrisons of professional solders. Before you declare and win your colonies' independence, you will be drawn into the wars your home country fights with other European powers, or you will come across hostile natives that can raid your colonies and ambush your units.<h3>Key features:</h3><br/><ul><li>Procedurally generated map that provides a unique experience each new game<br/></li><li>A living world with different native cultures, foreign colonies and pirates<br/></li><li>Choose your own goals, you can focus on exploration, trade or conquest<br/></li><li>Your King will give you missions and offer rewards if completed successfully<br/></li><li>New ship types become available as the game progresses<br/></li><li>Develop your colonies with over 30 building types<br/></li><li>Each country you choose to play has unique bonuses</li></ul>", "metacritic": null, "released": "2019-05-25", "tba": false, "updated": "2020-03-02T14:41:14", "background_image": "https://media.rawg.io/media/screenshots/e61/e61be3f92dc0cdeedb4d7818f6d25630.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Dragos Pusca", "Bitworld Voyager"], "genres": ["Strategy", "Indie"], "publishers": ["Dragos Pusca"], "esrb_rating": null}