{"id": 351206, "slug": "ambrosia-2", "name": "Ambrosia", "name_original": "Ambrosia", "description": "On the island of Aspida, scientists and researchers have discovered Ambrosia - the next step in human innovation, a mad promise to astonish and astound. But mad science means mad scientists, and when the research colony goes dark, Iris rightly assumes something has gone very wrong. Players take control of the audacious engineer as she travels to the inscrutable island to find the source of Ambrosia and put a stop to the madness.<br/><br/>To overcome Aspida’s dangers, players will search the island for weapons and components to craft a unique arsenal. Weapon modification in Ambrosia is a simple process. Take the Pulse Breaker, built around three energy cores that each discharge energy blasts. Iris can charge a single core to unleash a more powerful blast, but if all three cores are spent, she must wait before firing again.<br/><br/>So let us make it better! <br/><br/>First, we insert a bursting core mod, which expends all active cores in a single cone of fire when charged. Now we have more damage, but we also have a longer wait to recharge all three cores. If we miss an enemy, we’re in trouble! So we add a splitter, which splits shots when fired normally or when charged. Add an extra core, and our shots go from three to four - or four to eight with the bursting core!<br/><br/>The goal is to offer straight-forward experimentation that yields immediate results with a system deep enough to reward true ingenuity!<br/><br/>Features<br/><ul><li>15-hour single player campaign<br/></li><li>Interconnected pixel-art world to explore<br/></li><li>Experiment with over 100 mods slotted into six-shooters, energy weapons, sniper rifles, grenade launchers and more!<br/></li><li>Snappy crafting system lets players unlock new powers and abilities at their own pace<br/></li><li>Beautiful pixel art brings life to the adventure<br/></li><li>Original score composed by Johnny Stixx<br/></li><li>Thoughtful story offers mystery and intrigue for players to uncover</li></ul>", "metacritic": null, "released": "2021-01-29", "tba": false, "updated": "2023-04-18T13:52:06", "background_image": "https://media.rawg.io/media/screenshots/b54/b547aee7f6e6018b0de66844f4065d06.jpg", "website": "http://www.kaguragames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "beaten": 2, "toplay": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Shimobashira Workshop", "Realmsoft"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Kagura Games", "Realmsoft"], "esrb_rating": null}