{"id": 351406, "slug": "crawlco-block-knockers", "name": "Crawlco Block Knockers", "name_original": "Crawlco Block Knockers", "description": "<strong>A Box-Bopping Revolution!</strong> <br/>Crawlco Block Knockers is an exciting puzzle/action hybrid. Blocks enter the play field, and you pull or kick them into the marked zones. Match them up by color to lock their position and prepare them for shipment. Good news: this reveals part of a sexy image! Bad news: your workspace just got a little bit tighter! Avoid the enemies, or smash them between blocks. Aim carefully to boost your score, and take care to not box yourself in. There are even elaborate boss battles to test your block-slinging mettle!<br/><br/><strong>Customize Your Play!</strong><br/>Dare we say Block Knockers is a thrill to play? We do! But if you'd like to solve puzzles without distraction, you can turn off enemies, and if you solve enough puzzles perfectly, you can even skip boss battles entirely. (But please fight the bosses! We worked hard on 'em!) Control the adult content yourself with the game's \"modesty\" setting -- obscure the naughty bits, or even the entire image if desired.<br/><br/><strong>Enjoy!</strong><br/>We love old arcade games, and that includes pervy old arcade games! We've worked hard to adhere to that retro aesthetic, and even got the perfect future funk tunes from OSC to maximize your enjoyment. Take a break and Get Knockin' with Crawlco Block Knockers today!", "metacritic": null, "released": "2019-08-01", "tba": false, "updated": "2019-08-28T21:44:09", "background_image": "https://media.rawg.io/media/screenshots/b14/b146c8744ae8c55efe470131503495e1.jpg", "website": "https://twitter.com/CosmiKankei", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 4, "playing": 1}, "playtime": 0, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["CosmiKankei"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["CosmiKankei"], "esrb_rating": null}