{"id": 351436, "slug": "evans-remains", "name": "Evan's Remains", "name_original": "Evan's Remains", "description": "Evan's Remains is a mystery-thriller puzzle adventure about finding a missing boy: Evan. The game combines logic-based platform puzzles with narrative inspired by Japanese graphic adventure games.<br/><br/><h3>Gameplay: </h3>Every time the player solves from two to three puzzles, the story goes forward and new mechanics are introduced. The challenge of the puzzles lies in the player’s ability to figure out what do rather than solve challenges based on skill. As the difficulty curve increases, the puzzles become more complex by combining two or more previously introduced mechanics.<br/><br/><h3>Story: </h3>Evan, the genius boy, has been missing for years. One day, a letter signed by him is received, claiming he’s on an uninhabited island somewhere in the Pacific Ocean. Nobody knows why, but he asked specifically for a girl named “Dysis” to go and look for him. The player will take control of this girl, who we don’t know much about. As we follow Dysis’s adventure, questions will start to be answered little by little. All of the little puzzle pieces which seemed unrelated in the beginning will now begin to slowly fit together as the truth is slowly revealed.<br/><br/>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2024-04-13T20:09:06", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe4ed73789568938d2ae60e4e2a59c01.jpg", "website": "https://evan-s-remains.xsollasitebuilder.com/", "rating": 3.57, "rating_top": 4, "added_by_status": {"yet": 50, "owned": 747, "beaten": 17, "toplay": 13, "dropped": 3, "playing": 2}, "playtime": 3, "achievements_count": 88, "ratings_count": 19, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 21, "platforms": ["iOS", "PlayStation 4", "Xbox One", "PC", "Nintendo Switch", "macOS"], "developers": ["Whitethorn Digital", "maitan69", "Matías Schmied"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Whitethorn Digital"], "esrb_rating": null}