{"id": 351500, "slug": "cthulhus-catharsis", "name": "Cthulhu's Catharsis", "name_original": "Cthulhu's Catharsis", "description": "You are Cthulhu, Nyarlathotep, Shub-Niggurath, or Yog-Sothoth. Now the Great Ones You didn't pick want to kill You. You, Greatest One, get to outsmart them in this campy turn-based strategy God-game.<br/><br/>It's like Risk meets Civilization, garnished with Hearthstone-style units and steeped in the Cthulhu mythos.<br/><br/>That's it. That's the video game.<br/><br/><br/><ul><li>Play as 1 of 4 eldritch horrors: Cthulhu, Nyarlathotep, Shub-Niggurath, or Yog-Sothoth.</li></ul><ul><li>Mutate Your units to gain a tactical advantage on the battlefield.</li></ul><ul><li>Raise your own nations from the sea to outmaneuver the other Gods.</li></ul><ul><li>Sink nations to achieve supremacy.</li></ul><ul><li>Force Your shoggoth slaves to build and train units.</li></ul><ul><li>Sacrifice humans under your domain to gain power.</li></ul><ul><li>Research and focus trees that change dynamically based on Your chosen deity.</li></ul><ul><li>Adapt to elder monstrosities like Father Dagon and Mother Hydra invading this world. Appease them, and they can do great terrible things. Anger them, and their wrath will be almost as great as Yours.</li></ul><ul><li>Play online against your friends and enemies. One may even team up for co-op action by allying with another God--but be warned, for single absolute Power can be a tempting prospect.</li></ul><ul><li>Or You can play singleplayer against the AI!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:07", "background_image": "https://media.rawg.io/media/screenshots/384/384910dd6eb1b45ece3c0be5b614292a.jpg", "website": "https://cthulhu.fun", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Dastardly Digital"], "genres": ["Strategy"], "publishers": ["Dastardly Digital"], "esrb_rating": null}