{"id": 351569, "slug": "dinosaur-shakespeare-to-date-or-not-to-date", "name": "Dinosaur Shakespeare: To Date or Not To Date?", "name_original": "Dinosaur Shakespeare: To Date or Not To Date?", "description": "<strong>Are you ready for the absolute craziest year at Elsinore Academy yet?</strong> Good! 'Cause you have no choice. <br/><br/>After an apocalyptic cataclysm has rocked the very world, 50% of the population has gone extinct. It is now more important than any time in history for future royalty to be pumped out of Elsinore Academy, the cornerstone of academia and the best college in your country. Well, as of the giant meteor that nearly killed every living thing on the planet.... the only college in your country.<br/><br/>Embark on an epic journey with six of your closest friends in an effort to once and for all figure out why everything in your world is just so darn screwed up. It'll be fun! What could go wrong? You're Shakespeare Dinosaurs! Those two things have no amount of equal or greater baggage between them! Just don't fall in love on your epic quest. That never happens in Dating Sims. Like, that's not normal.<br/><br/><strong>Does include drug references, sexual humor, and swearing.</strong><br/><br/><br/><br/><ul><li> Romance six classic Shakespeare characters over a variety of adventures, both inside and outside the classroom!</li></ul><ul><li> New Romance mechanic! This time, it's not stat based on gossip based, but revolving around what you do during each activity!</li></ul>", "metacritic": null, "released": "2019-12-17", "tba": false, "updated": "2020-02-18T11:05:32", "background_image": "https://media.rawg.io/media/screenshots/918/918a7a358f32807ba78399c3ced3415d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Stegalosaurus Game Development", "Steg Game Dev"], "genres": ["Adventure", "Indie"], "publishers": ["Stegalosaurus Game Development"], "esrb_rating": null}