{"id": 351694, "slug": "survivr-castle-defender", "name": "SurviVR - Castle Defender", "name_original": "SurviVR - Castle Defender", "description": "<strong> VR Tower Defense</strong> game for HTC Vive headset. Join this medieval fantasy world and defend your castle against orcs, trolls, goblins and other creatures! Use your crossbows, bow &amp; arrow, magic spells and swords to slay the enemies!<br/><br/> Being in a fantasy medieval world, the game brings mythical creatures like orcs, trolls, demons, beasts, goblins, ogres and other monsters. Each enemy has its own sounds for attack, hit and die. Enjoy a rich sound experience with the environment sounds and special epic music during gameplay!<br/><br/> SurviVR - Castle Defender combines the First Person Shooter style with the tower defense VR game. By using the HTC Vive controllers, the user can teleport over the castle, select different weapons and shoot. This is an immersive tower defense experience.<br/><br/> The castle contains several strategic teleport areas and towers. Weapons like crossbows, bow and magic spells can be used all over the map, but there are special areas for sword fights, along the enemies path.<br/><br/> In SurviVR, the map can be played with three difficulty modes (easy, medium, hard). Each difficulty has its own number of waves and enemies types. The user can randomize the waves and character spawning for each difficulty level.<br/><br/> The action takes place in a fantasy universe, during a medieval era. Player's castle is attacked by orcs and other creatures which are trying to reach the hell warp, to destroy humanity. As in a tower defense game, enemies will attack in several waves and will try to pass the castle's gates, fight the human knights and continue their path to victory.", "metacritic": null, "released": "2019-07-01", "tba": false, "updated": "2019-08-28T21:44:04", "background_image": "https://media.rawg.io/media/screenshots/f7f/f7f95301030d764ecc5477f884e1aad2.jpg", "website": "https://survivr-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 556, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ioiGames"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["ioiGames"], "esrb_rating": null}