{"id": 351692, "slug": "theropods", "name": "Theropods", "name_original": "Theropods", "description": "<strong>Theropods</strong> is a point and click adventure game that combines <strong>puzzles</strong> with a <strong>cinematic story</strong>, <strong>colourful characters</strong> and a <strong>retro aesthetic</strong>. Oh, and lots of <strong>dinosaurs</strong>!<br/><br/><br/><br/>Travel back to the time when dinosaurs ruled the world and (a little less further back) when adventure games ruled the gaming world! Immerse yourself in a vast, prehistoric world full of dinosaurs, constructed with love, <strong>PIXEL BY PIXEL</strong>.<br/><br/><br/><br/><br/><br/><br/>Experience an adventure game that has been <strong>lost since the 90s</strong>, back when Adventure Games were at their peak. Characters, dinosaurs and backgrounds come alive with <strong>handcrafted sprites and smooth animations</strong>, created frame by frame with love and care.<br/><br/><br/><br/>A <strong>young hunter</strong> travelling home to free her enslaved tribe from a tribe of <strong>bloodthirsty barbarians</strong>. A <strong>mysterious spaceman</strong> stranded on a strange prehistoric planet with slim hopes of returning home. Experience <strong>friendship, bravery and betrayal</strong>, all while playing a classic adventure game!<br/><br/><br/><br/><br/><br/>We are huge fans of ‘silent’ narrative games like Machinarium and Gobliiins, where the <strong>dialogue is mostly absent</strong> yet they still manage to tell <strong>fascinating stories</strong> immersing you fully into their worlds. <br/><br/><br/><br/>Fitting in with <strong>prehistoric civilisations</strong>, our dialogue takes the form of grunting and we decided to go full out with no text either. The lack of dialogue and text creates challenges for us and opens up possibilities for <strong>creative solutions</strong>, such as providing hints to the player, relying heavily on<strong> animations and visual cues.</strong><br/><br/><br/><br/>You know how in most adventure games, the action is only in the form of a cutscene? How about <strong>playing those cool action moments</strong> in your adventure game?<br/><br/><br/><br/><br/><br/>We are <strong>BIG</strong> fans of <strong>science fiction</strong>. As if humans and dinosaurs coexisting wasn’t enough, technology, <strong>space suits, pods and energy crystals</strong> are the perfect fit to shake up our prehistoric world!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:04", "background_image": "https://media.rawg.io/media/screenshots/172/17242f6aedd42d37110bfe6462760dbb.jpg", "website": "http://theropodsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kostas Skiftas", "Tinystuffz"], "genres": ["Adventure"], "publishers": ["Theropods Team"], "esrb_rating": null}