{"id": 351603, "slug": "soul-scathe", "name": "Soul Scathe", "name_original": "Soul Scathe", "description": "<strong>Soul Scathe</strong> is a VR Dungeon Crawler RPG with procedurally generated dungeons focused on reactive melee and magic combat. Embark on a journey as the Valiant Returner, a principal battlemage that died during battle in the past. Losing all sense of your past self, you are revived and guided by the Asapal Deity whom witnessed your last moments. They seek to restore your lost memories of the past by guiding you to collect the scattered fragments of your soul.<h3>Game Features</h3><br/><ul><li><strong>Procedurally generated dungeons</strong> - Venture through the depths of dangerous dungeons, combating against deadly foes and traps along the way. Discover secrets, loot, and climb and explore a path through in order to survive long enough to find the Hallway Of Elusion and get back to the safehaven of Mistchamber.<br/><br/></li><li><strong>Spell Fusion System</strong> - Utilize 14 different base spells, many of which can be fused together by physically gesturing and combining the spells to create a brand new spell. In total there are 9 spell fusions, giving you 23 unique spells to cast.<br/><br/></li><li><strong>Reactive Melee Combat</strong> - Deliver hard blows to foes with responsive auditory, haptic, and visual feedback that can extend into decapitations and satisfying hits.<br/><br/></li><li><strong>Use The Environment Against Foes </strong> - Use everything at your disposal by turning deadly traps into equally deadly weapons. Bring down heavy chandeliers, lead enemies into hidden switches, and use telekinesis to control the mechanisms, delivering nearby devastation.<br/><br/></li><li><strong>Level Up and Personalize Your Style</strong> - As expected from RPGs, you can level up and assign stat points to give you the choice of how you want to evolve.</li></ul><br/>", "metacritic": null, "released": "2019-07-31", "tba": false, "updated": "2019-08-28T21:44:06", "background_image": "https://media.rawg.io/media/screenshots/aec/aec224e0e3605f5867e568870b60b4e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bluelight Construct"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Bluelight Construct"], "esrb_rating": null}