{"id": 351743, "slug": "they-are-beasts", "name": "They Are Beasts", "name_original": "They Are Beasts", "description": "Try an atmospheric top-down shooter in which you find yourself in the role of a desperate fighter, whose sole purpose is to avenge your own suffering, killing as much evil as possible... and bring your soul back.<br/>\n<br/>\r\nYou are the victim of a bloody ritual of devil worshipers, eager to please their master. But during the sacrifice something went wrong - the demon got your soul, but the cultists could not break your body. Armed, you seek to destroy as many creatures of hell as possible. They took your soul, and now you do not know what the fear or pity is... But is it possible to become yourself again? In whose hands is your immortal soul? Embark on a dark journey through the real hell in story mode and learn the secret of the bloody cult! Or try a survival mode in which your main task is to destroy as many hellish creatures as possible, using various types of weapons, and avenge all that you had to go through!<br/>\n<br/>\r\nThey Are Beasts is:<br/>\n<br/>\r\n•\tHardcore third-person shooter, in which the power of opponents increases as mush as yours – try to beat them all!<br/>\r\n•\tSeveral types of weapons with unique characteristics – use as many grenades as you want.<br/>\r\n•\tCharacter’s progress and various achievements at each stage of the walkthrough.<br/>\r\n•\tDynamic gameplay, immersing in the dark atmosphere of despair and pain: there is only one way to get out of this hell – kill them all!<br/>\r\n•\tTwo game modes: storyline – for those who want to immerse themselves in a tangled story, and survival mode, where there is only one rule – kill or be killed.<br/>\n<br/>\r\nDanger at every turn – do not forget to recharge!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:44:02", "background_image": "https://media.rawg.io/media/screenshots/20d/20dd5ec78aaeb89cc636b8038f52a52a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tarakan Game Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Tarakan Game Studio"], "esrb_rating": null}