{"id": 35176, "slug": "dominion", "name": "Dominion", "name_original": "Dominion", "description": "<p>Dominion is the game that started a new genre:  Deckbuilding.  Winner of the Spiel des Jahres in 2008 and many other awards, Dominion has established itself as a true classic.  With more than a dozen expansions currently available, players will always be able to find new challenges.<br />\nIf you have never played Dominion before, start here with the basic game.  There are millions of different combinations that can be played just with Dominion alone.  Each game is different but only lasts twenty to thirty minutes.  It&#39;s great for one player but just as fun with two or more players.GOAL<br />\nThis is a game of building a deck of cards. The deck contains your resources, victory points, and the things you can do. It starts out a small sad collection of Estates and Coppers, but you hope that by the end of the game it will be brimming with Gold, Provinces, and the inhabitants and structures of your kingdom.GAME IDEAYou are a monarch, like your parents before you, a ruler of a small pleasant kingdom of rivers and evergreens. Unlike your parents, however, you have hopes… dreams! You want a bigger kingdom, more pleasant, with more rivers, and a wider variety of trees. You want a Dominion!<br />\nIn all directions lie fiefs, freeholds, and feodums. All are small bits of land, controlled by petty lords and verging on anarchy. You will bring civilization to these people, uniting them under your banner. But wait! It must be something in the air; several other monarchs have had the exact same idea. You must race to get as much of the unclaimed land as possible, fending them off along the way. To do this you will hire minions, construct buildings, spruce up your castle, and fill the coffers of your treasury. Your parents wouldn’t be proud, but your grandparents, on your mother’s side, would be delighted.<br />\nFeatures<br />\n2 - 4 player with network multiplayer (Up to 6 players with Intrigue Expansion)<br />\nSolo play against varying AI difficulties<br />\nThirteen expansions and three promo sets available for purchase<br />\nPass and Play mode<br />\nTutorial &amp; Rules<br />\nJumbo Mode for accessibilityContents<br />\nDominion includes three basic Treasure cards, three basic Victory cards, Curses, and twenty-six Kingdom cards.  Kingdom cards like Smithy, Throne Room, Militia, Gardens, Witch, Chapel and Village introduce the cornerstone mechanics of Dominion and serve as archetypes for variations seen in later expansions. The major strategies of Dominion, including engine-building, big money, slog, rush, and combo can be traced to cards from this basic set.Digital Optimizations and Custom SettingsMoat - You can opt to automatically always react with Moat<br />\nMoneylender - You can opt to automatically always trash a CopperAwards &amp; Prizes</p>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2022-12-08T18:26:45", "background_image": "https://media.rawg.io/media/screenshots/a4b/a4be19330d94fd3827ac8a2104f61961.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 185, "beaten": 1, "toplay": 1, "dropped": 1, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS", "Android"], "developers": ["Temple Gates Games"], "genres": ["RPG", "Strategy", "Card"], "publishers": ["Temple Gates Games"], "esrb_rating": null}