{"id": 351702, "slug": "what-the-duck-3", "name": "What the Duck", "name_original": "What the Duck", "description": "What the Duck is a 3D Adventure/Action RPG about a world that people can summon their Spiritual Animals to fight. The catch? While there are people with Dragons, Tigers, Phoenixes, etc, you get to live the journey of Illy Bavent and his spiritual animal, a tiny Duck. <br/><br/>Illy joins forces with Hellen Drunkren, a badass girl looking for revenge on a journey that will put them against the strongest forces of the Empire, the Provincial Generals. Battle, craft and explore with the help of your spiritual animal. The Journey will be tough, so you’ll need to craft powerful weapons in a musical minigame called Rhymesmith.<h3>Gameplay</h3>The combat is the main aspect of What the Duck gameplay. It’s fast and has different types of weapons that can be quickly changed during the battles. You also have the help of your spiritual animal that grants you different abilities in battles and more ways to explore the world when not in combat.<br/><br/>The Rhymesmith is the crafting system and allows you to create new weapons with a musical/rhythm minigame that will make the blacksmith work much more fun.<br/><br/><ul><li>Battle alongside your spiritual animal<br/></li><li>Explore the different provinces of the Empire<br/></li><li>Reach places only a Duck can!<br/></li><li>Craft weapons on the beat of the song in Rhymesmith.</li></ul>", "metacritic": null, "released": "2022-03-16", "tba": false, "updated": "2019-10-07T03:00:38", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c19135a7bb4e79804ce07e7f82c3b2.jpg", "website": "http://www.whattheduckthegame.com/#main", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Seize Studios", "Comic and Sons"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Seize Studios", "Comic and Sons"], "esrb_rating": null}