{"id": 351785, "slug": "hijos-del-invierno", "name": "Hijos del Invierno", "name_original": "Hijos del Invierno", "description": "Under the winter sky of the country of Perpetua, in the humble snow village of Lunensis live two young brothers: <strong>Emilia</strong> and the little <strong>Pepo.</strong> Recently their mother was exiled by the authorities of the town being marked on his cheek to never return to any civilized place, condemnation that all criminals of Perpetua share. Faced with this situation, Emilia and Pepo were left to their fate, however, one day they see strange light signals coming from the forests surrounding the border walls of Lunensis and they, convinced that <strong>Erika</strong>, their mother, is the one who sends that call, go out in her search.<br/><br/><br/><strong>Hijos del Invierno</strong> (Children of the Winter) is a single-player MetroidVania platform game where you will control Emilia, a 13-year-old teenager and Pepo, her 6-year-old little brother who will use their skills and qualities to travel through the snowed country of Perpetua. However, the threats are too big for these children, so they must also use their cleverness to get through the dangers that await them. Facing the enemy is not always the best option.<br/><br/><br/><strong>JUMP, DODGE, SHOOT!</strong><br/>-The forests of Perpetua are inhabited by dangerous exiled criminals and errant magical creatures. Emilia will use her porotera (bean thrower), a curious tool that launches small projectiles to distract and deal with the threats she will face along the way.<br/><br/><br/><strong>MAGIC!</strong><br/>-A mystery surrounds the figure of Pepo, who can freeze some of the magical creatures at the mere thought of it. Use this ability to take a break from those crippling hosts that block your path. You can also use the frozen beasts as platforms to reach other places further away.<br/><br/><br/><strong>IMPROVE YOU SKILLS</strong><br/>-Not only enemies will you find on your way. Find allies to help you improve the potential of your porotera.<br/><br/><br/><strong>DISCOVER SECRETS</strong><br/>-The country of Perpetua is the only known that was formed after the Eternal Winter scourged the planet. 200 years have passed and much has been lost or forgotten.<br/><br/><br/><strong>SEPARATE ROADS</strong><br/>On occasion, Pepo must assume the responsibility of reaching their destination. Manage the courageous Pepo while overcoming the difficulties of Perpetua.<br/><br/><br/><strong>DISCOVER THE TOWNS OF PERPETUA[/ b]<br/>-A handful of towns and cities have emerged since the Eternal Winter. Misery is a constant but each has different customs and activities.<br/><br/><br/><strong>FACE POWERFUL BOSSES[/ b]<br/>-One of the main reasons why many of those who leave the villages of Perpetua never return is because of the threat of great magical and human enemies. Their savagery has no limits and escape is not an option.<br/><br/>Currently, <strong>Hijos del Invierno</strong> is a demo in the alpha state, so we expect all kinds of comments to help us improve and transform it into a memorable video game.</strong></strong>", "metacritic": null, "released": "2019-03-04", "tba": false, "updated": "2020-02-25T14:48:02", "background_image": "https://media.rawg.io/media/screenshots/be1/be1d5f127063ca69731ef737b5e83df5.jpg", "website": "http://www.hijosdelinvierno.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 502, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dinogorila", "Dinogorila Creative Lab"], "genres": ["Action", "Adventure", "Casual", "Indie", "Platformer"], "publishers": ["Dinogorila Creative Lab"], "esrb_rating": null}