{"id": 351759, "slug": "this-is-the-zodiac-speaking", "name": "This is the Zodiac Speaking", "name_original": "This is the Zodiac Speaking", "description": "<p>This is the Zodiac Speaking is a dark, fact-based single player FPS adventure thriller combining stealth &amp; detective modes in an stylized world of California 1970s and based on the story of Zodiac, one of the most famous never-caught serial killers.<br />\nPlay as Robert Hartnell, a San Francisco journalist, who receives a phone call from the Zodiac greeting him with the memorable &quot;Hello, this is the Zodiac speaking&quot;.<br />\nThis is the Zodiac Speaking is a thiller with elements of horror, stealth mechanics, detective mode and several endings to discover. The gloomy atmosphere of the game is achieved with the original, stylized graphics and film-like music. The co-author of the script to This is the Zodiac Speaking  is Łukasz Orbitowski, one of the best Polish writers, laureate of the prestigious Paszporty Polityki award and nominated for the Nike award.<br />\nPlay This is the Zodiac Speaking and:<br />\nDiscover the evidence-based story of the America&#39;s most famous never caught serial killer<br />\nExperience the story from the perspective of a person who survived the attack of the psycho killer<br />\nUnravel the details of the murders during psychological sessions and in detective mode<br />\nListen to the voices of victims and save their souls<br />\nDiscover the alternative endings<br />\nEnjoy the atmospheric, film music<br />\nTravel to the vintage 70&#39;s and feel the climate of the past</p>", "metacritic": 44, "released": "2020-10-15", "tba": false, "updated": "2022-12-19T23:03:23", "background_image": "https://media.rawg.io/media/screenshots/da9/da97393a7260adf648145abecd44eaf2.jpg", "website": "http://zodiacthegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 47, "toplay": 6, "dropped": 1}, "playtime": 2, "achievements_count": 55, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "PlayStation 4", "Xbox One", "PC"], "developers": ["Punk Punch Games"], "genres": ["Adventure", "Indie"], "publishers": ["PlayWay"], "esrb_rating": null}