{"id": 351764, "slug": "skellboy", "name": "Skellboy", "name_original": "Skellboy", "description": "<p>Sometimes, when there is nobody up to the task, old heroes have to rise from the grave to save the day! Crush your enemies and make good use of their guts - literally, as you can augment Skippy with your foe&#39;s body parts and weapons!<br />\nHelp Skippy, the cubic skeleton, to fight off Squaruman&#39;s endless forces of undead and vicious foes in this rectangular action packed cardboard adventure!<br />\nWait, What?<br />\nLife was peaceful in the Cubold Kingdom until the king&#39;s evil court magician got dumped by the princess. With his heart broken and his rage fueled, he called upon the evil spirits to resurrect the dead and the kingdom&#39;s long forgotten monstrosities. What he doesn&#39;t realize in his fury is that he accidentally summoned an ancient hero as well... Skippy! Travel across the beautifully rendered kingdom of Cubold and take full advantage of your resurrected, skeletal body! Swap out body parts to acquire new abilities during your adventure or pick up a new weapon to vanquish the evil magician&#39;s lackeys. Onwards, Skippy, it&#39;s time to be a hero once more!<br />\nWhat&#39;s inside?<br />\nAn expansive singleplayer experience across the interconnected Kingdom of Cubold full of square charming characters and edgy villains!<br />\nA true action-rpg adventure that will test your skill and rewards exploration!<br />\nSwap your bones for 100+ different body parts and items of friends and foes with (more or less) useful effects!<br />\n5 unique weapon types to clobber any foes you face!<br />\nSpecial enemies and bosses that will truly test your mettle!<br />\nA Vibrant 2d pixelart style that comes to life in a 3d world!<br />\nIncludes some rocking chiptune tracks and sounds!</p>", "metacritic": null, "released": "2019-12-03", "tba": false, "updated": "2020-12-16T14:19:17", "background_image": "https://media.rawg.io/media/screenshots/8fe/8fe257c3c7d37c8ae911774784da9d44.jpg", "website": "http://www.skellboy.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 15, "toplay": 5, "playing": 1}, "playtime": 4, "achievements_count": 71, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["UmaikiGames", "Umaiki Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Fabraz", "UmaikiGames"], "esrb_rating": "Everyone"}