{"id": 351851, "slug": "cplus-for-craigslist", "name": "CPlus for Craigslist", "name_original": "CPlus for Craigslist", "description": "Colorfi is super easy to use with a simple design. It comes with hundreds of high definition pictures and more than 40 free pictures.  <br/><br/>Pick a picture and start coloring it in the most relaxing way. You can fill with a tap, or paint with brushes. There are many themes of color palettes to choose and you can even build your own.<br/><br/>Basic category is free and gets you warm up easily. Besides that, Colorfi also has many interesting catalogs like Animals, Food, Mandalas, Messages, Nature, People, Places, and Zodiac. <br/><br/>Features:<br/>- flood fill mode to tap and fill<br/>- brush mode to draw freehand<br/>- large range of brush widths<br/>- build your own palettes<br/>- Easily share your drawings on your favorite social network<br/><br/>Subscription:<br/>- Unlimited access to full picture catalog and removal of ads.<br/>- The subscriptions prices are $1.99 USD weekly, $4.99 USD monthly and $29.99 USD annually or equal to the same price tier that \"Apple's App Store Matrix\" determines in other currencies. <br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>– Terms of use: http://www.yanflex.com/colorfi/tos.html", "metacritic": null, "released": "2018-03-05", "tba": false, "updated": "2019-10-22T13:49:04", "background_image": "https://media.rawg.io/media/screenshots/e0b/e0bb61d1b7025f739f4ff7a9768d632a_kRTk3JA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YanFlex"], "genres": [], "publishers": ["YanFlex"], "esrb_rating": "Everyone 10+"}