{"id": 351846, "slug": "countdown-2", "name": "Countdown‼", "name_original": "Countdown‼", "description": "Wedding Planner is the perfect companion to have while preparing for your big day. It's packed with a personalized checklist of all the essential to-dos for you and your partner's \"I dos.\" You'll feel so much more at ease to know what has been done and what still needs to be done - there's no better app to use for all your wedding needs, so start planning with Wedding Planner today!<br/><br/>And it's so much more than just a checklist. Here are some of Wedding Planner's amazingly helpful features:<br/><br/>• Sync &amp; Backup: Invite your partner to participate or simply back up your data for peace of mind.<br/>• Categories: If you ever feel lost, you can find any checklist item by category from Accessories to Stationery.<br/>• Photos: Keep your favorite photos of you and your loved one right on the home screen to remind yourself of what this is all about every time you open the app.<br/>• Music: Add your special song and listen while you get things done.<br/>• Budget: Set a budget and get an estimate of how much to spend on each expense.<br/>• Journal: Keep a wedding journal for all the days leading up to the wedding - these are memories worth saving.<br/>• Day-of: Plan the timeline of events on your wedding day and easily share it with vendors, friends, and family.<br/>• Contacts: Put all your important wedding contacts in one place and organize them by category.<br/>• And more!", "metacritic": null, "released": "2010-10-25", "tba": false, "updated": "2019-10-22T13:48:58", "background_image": "https://media.rawg.io/media/screenshots/b85/b85aeb63b6ee935cd5457aaac7fa13ec.jpg", "website": "http://www.sevenlogics.com/mobile-apps/birthday-countdown-app.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sevenlogics"], "genres": [], "publishers": ["Sevenlogics"], "esrb_rating": "Everyone 10+"}