{"id": 351859, "slug": "bible", "name": "Bible", "name_original": "Bible", "description": "Better information helps you make better decisions. Church Metrics is an easy-to-use web tool and app that helps you track church data like attendance, salvations, baptisms, giving, and more. Customize unlimited additional categories to track anything that matters to you, from cars in the parking lot to volunteers. Your dashboard displays the real-time data, and charts and reports help you make data-driven decisions. And because it was built by Life.Church for churches like yours around the world, it’s completely free, with no software or services to buy. Ever.<br/><br/>• Track any metric you choose—if you can count it, you can track it!<br/>• Adjust your fully-customizable dashboard to display the data that matters to you.<br/>• See a visual representation of trends and patterns with interactive charts.<br/>• Track metrics for a single-site church or multiple campuses.<br/>• Get automatic email reports.<br/>• Transform data into sleek, easy-to-understand reports.<br/>• Keep pastors, board members, or other key leaders in the loop with reliable data.<br/>• Import and export data and reports using Excel.<br/>• Support multiple users, roles, and permissions with varying levels of access.<br/>• Switch between accounts easily.<br/>• Integrate with external apps.<br/>• Create private, invitation-only Church Metrics Groups to manage and review data for an entire denomination, church plant group, network of churches, or other association if needed.<br/>• 100% free. No trial period, no paid plans, no in-app purchases, no software to buy.<br/><br/>If you already use Church Metrics, download the app and log in to your dashboard. If you don’t yet have a Church Metrics account, download the app and get started!<br/><br/>Connect with Church Metrics:<br/>Follow us on Twitter: https://twitter.com/churchmetrics  <br/>Use Church Metrics online: https://churchmetrics.com<br/>Get Church Metrics support: https://support.churchmetrics.com/<br/><br/>Why We Exist:<br/>At Life.Church, one of our core values is \"irrational generosity.\" We're committed to equipping the “capital C\" Church—that’s local churches around the world—in every way we can through free resources, partnerships, and products. Our goal is to help churches like yours everywhere lead people to become fully devoted followers of Christ. Visit https://www.life.church/churches to see all of our free ministry tools and products.", "metacritic": null, "released": "2013-11-28", "tba": false, "updated": "2019-10-22T13:48:53", "background_image": "https://media.rawg.io/media/screenshots/ba2/ba23b32e5f457793b5eb6185c5b6304a.jpg", "website": "http://www.bible.com/kids", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Life.Church"], "genres": ["Educational"], "publishers": ["Life.Church"], "esrb_rating": null}