{"id": 352, "slug": "warhammer-40000-freeblade", "name": "Warhammer 40,000: Freeblade", "name_original": "Warhammer 40,000: Freeblade", "description": "App Store ‘Best of 2015’ Awards Winner<br/><br/>TAKE COMMAND OF A WARHAMMER 40,000 IMPERIAL KNIGHT IN THE MOST ACTION-PACKED AND VISUALLY STUNNING ACTION GAME ON iPAD AND iPHONE.<br/><br/>When a young Imperial Knight sees their noble house destroyed by the twisted forces of Chaos, they join forces with the Dark Angels Space Marines chapter as a Freeblade. Experience an epic story in over 170 single player missions as you command your Freeblade on a journey of honour, redemption and vengeance. Test your skills and patrol the world of Tarnis to slay endless invaders. <br/><br/>EXPLOSIVE “TAP TO SHOOT” ACTION<br/>Feel the power of an unstoppable war machine at your fingertips. Use cannons, missiles and thermal blasts to obliterate your foes and watch environments crumble to dust before you.<br/><br/>SUPER HIGH DETAIL 3D GRAPHICS<br/>Witness the most visually stunning shooter available for your device. Experience the world, characters and creatures of Warhammer 40,000 like never before in stunning high detail using the latest graphical effects.<br/><br/>EXPERIENCE ALL NEW 3D TOUCH GAMEPLAY<br/>Experience an enhanced control system that incorporates 3D Touch technology on compatible devices. Press into the screen to zoom weapon sights, the deeper the press the further the zoom, a reduction in pressure zooms the sights back; or press down far enough and switch to a heavier weapon to go in for the kill – all without lifting a finger from the screen.<br/><br/>EPIC MELEE COMBAT BATTLES<br/>Rip apart the enemies of the Imperium with a mighty Chainsword. Feel the weight of your Freeblade’s every swing as they execute mechanised horrors and gargantuan beasts with brutal, visceral strikes.<br/><br/>FORGE, UPGRADE AND CUSTOMISE<br/>Design the look of your own Freeblade, forge and equip powerful weapons including the Avenger Gatling Cannon and Melta Gun to purge Ork scum and Chaos heretics alike.<br/><br/>COMPETE IN DAILY EVENTS <br/>Battle to get the highest score against players around the world in a new mission every day for legendary wargear and unique customisation options; let the other Freeblades know who the best in the world truly is!<br/><br/>MULTIPLAYER MODE<br/>Climactic Knight vs. Knight battles! Destroy other player's Freeblades with your very own powerhouse!<br/><br/>* NOTE: Freeblade currently requires iPhone 5, iPad 3, iPad Mini 2 or iPod Touch 6th Generation or above to play, support for other devices coming soon.*<br/><br/>Warhammer 40,000: Freeblade is completely free to download, it is possible to play through the game without purchase, however some in game items, features and enhancements can be optionally purchased using real money. If you do not wish to use these features you can disable in app purchases in your device settings.<br/><br/>Warhammer 40,000: Freeblade © Copyright Games Workshop Limited 2017. Warhammer 40,000: Freeblade, the Warhammer 40,000: Freeblade logo, GW, Games Workshop, Space Marine, 40K, Warhammer, Warhammer 40,000, 40,000, the ‘Aquila’ Double-headed Eagle logo, and all associated logos, illustrations, images, names, creatures, races, vehicles, locations, weapons, characters, and the distinctive likeness thereof, are either ® or TM, and/or © Games Workshop Limited, variably registered around the world, and used under licence. Warhammer 40,000: Freeblade is a product of the GamesLab West Midlands programme, funded by the European Regional Development Fund, supported by the Government’s Regional Growth Fund, and led by Creative England. All other trademarks are property of their respective owners. © Pixel Toys 2017.<br/><br/>Privacy Policy: <br/>www.pixeltoys.com/privacy-policy/<br/><br/>Terms of Service:<br/>www.pixeltoys.com/terms", "metacritic": null, "released": "2015-11-19", "tba": false, "updated": "2024-03-24T23:05:44", "background_image": "https://media.rawg.io/media/screenshots/797/797a184371c8f8f43f5273259e0ea9ff.jpg", "website": "http://www.freebladegame.com", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 2, "beaten": 2, "toplay": 2, "dropped": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 479, "game_series_count": 39, "reviews_count": 8, "platforms": ["iOS"], "developers": ["Pixel Toys"], "genres": ["Action", "RPG"], "publishers": ["Pixel Toys"], "esrb_rating": null}