{"id": 352670, "slug": "base-ten-blocks-es", "name": "Base Ten Blocks ES", "name_original": "Base Ten Blocks ES", "description": "Hands-On Math Base Ten Blocks supports both English and Spanish languages. Hands-On Math Base Ten Blocks simulates the use of a popular math manipulative used to teach place value and addition and subtraction with regrouping.<br/><br/>Base Ten Blocks are one of the best ways to help students learn about place value. While using the app students place Base Ten Blocks on an interactive Playground to represent numbers. Blocks can be regrouped or exchanged by dragging a virtual manipulative from one column to the next.<br/><br/>Using Hands-On Math Base Ten Blocks students can develop the following important mathematical concepts:<br/><br/>    * Place value concepts<br/>    * Regrouping in the ones, tens and hundreds places<br/>    * Basic operations: addition and subtraction<br/>    * Naming numbers<br/>    * Expanded notation<br/>    * Reading and writing numbers<br/><br/>Base Ten Blocks are a very useful way for student visualize numbers, intuitively understand place value and deepen their understanding of addition and subtraction. Use Base Ten Blocks to have students represent numbers, as well as read and write the numbers. Rules for regrouping can be difficult for children. Use Base Ten Blocks to illustrate regrouping by dragging and dropping blocks from one column to another. <br/><br/>A simple switch on the settings screen allows the user to select that the text and speech used in the program be presented in either English or Spanish.", "metacritic": null, "released": "2012-06-06", "tba": false, "updated": "2019-10-22T13:56:15", "background_image": "https://media.rawg.io/media/screenshots/186/186d0797ec1f4d675da1a07e3264e9ec_64CA1Ul.jpg", "website": "http://www.venturaes.com/iosapps/hom4.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ventura Educational Systems"], "genres": ["Educational"], "publishers": ["Ventura Educational Systems"], "esrb_rating": "Everyone 10+"}