{"id": 353092, "slug": "supaplex-3d-itch", "name": "Supaplex 3D (itch)", "name_original": "Supaplex 3D (itch)", "description": "<p><strong>Supaplex is back, this time in 3D!</strong></p>\n<p>The game contains all original 111 levels and attempts to have all the features of the original game, and even make it more engaging and fun to play by making it play more smoothly then the original. And by adding a level editor that allows you to share levels with your friends!<br/><br/><strong>Extra features</strong><br/>Aside from the upgraded visuals, this version has some extra features compared to the original game.</p>\n<ul><li>Level editor that allows you to create levels and share with friends</li><li>You can now save and load your progress during a level, so you don't have to start over from scratch. Even if you have exited the game you can continue where you left off.</li><li>You can slow down time, to make specific tricks easier to pull off.</li></ul>\n<p><strong>What is the game about?</strong><br/><br/><br/>For those who don't know this game, it used to be a popular Dos game that was developed in 1991. It was a difficult but rewarding game. Many levels require you to think thoroughly before making any move.</p>\n<p>The main character is called Murphy, he is the red blob-like character. His goal is to reach the exit of each level, in order to do this he must collect enough infotrons (atom like objects). However, in order to collect these objects you have to puzzle your way though levels where you have to think before you act. Making it a difficult but rewarding experience.<br/><br/><br/></p>\n<p><strong>Early access?</strong></p>\n<p>I've chosen to use Itch.Io as a early access platform. The reason for this is that the user base of this website is really engaged. What early access means for this game:<br/></p>\n<ul><li>Some levels may be unsolvable (I haven't encountered any yet, going up to level 30-40) I haven't been able to test all of them with the latest changes.</li><li>Some bugs may be present, if you find any, please report them to me in the community section!</li><li>Tutorials are not present yet</li><li>Some of the user interface is still a bit rough around the edges, especially for the level editor. But it is fully functional.</li><li>Gamepad support is not functional yet for the user interface, it works during gameplay</li><li>Configuration for special ports is not possible yet with the level editor</li></ul>\n<p><strong>Benefits of purchasing during early access:\r\n</strong><br/><em>You will receive a Steam key once it launches in august</em><br/><em> You have input in the development process</em></p>", "metacritic": null, "released": "2019-07-23", "tba": false, "updated": "2019-07-27T11:10:31", "background_image": "https://media.rawg.io/media/screenshots/e45/e459ff59ca815125cc0c4db4ca4aa5ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lowscope"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}