{"id": 353045, "slug": "ridin-the-rail", "name": "Ridin’ the Rail!", "name_original": "Ridin’ the Rail!", "description": "<p><strong>Ridin’ the Rail </strong>is a VR game prototype. It was created by the <strong>Lightseed</strong> team in seven days for the PIGSquad Summer Slow Jam in July 2019; the technical theme was “three colors, three buttons” and the creative theme was “one more time.”</p>\n<p>The game play has a unique color-mixing mechanic: players must figure out how light mixes in light, not pigment (hint: red + green = yellow!). The game world is inspired by the trains of Norway, although one playtester called it “a beautiful low-poly Myst.” The second technical challenge we gave ourselves was to have the player move through space in a VR game without causing vertigo.</p>\n<p><strong>BACKGROUND</strong></p>\n<p>As Galileo observed (inspiring Einstein’s special relativity theory many years later), it is impossible to detect constant motion of the same speed. It’s only the changes in speed, also known as acceleration, that are recognizable. </p>\n<p>When the human brain sees acceleration, but does not feel it in the inner ear, it decides that something is wrong. Evolutionary biologists guess that early brains that ate poisonous plants would have a similar effect, and would induce vomiting as a protection defense! This is the root cause of carsickness and other vehicular nausea. </p>\n<p>The simplest way to achieve motion with no acceleration in VR would be to have a game travel at a constant speed in one direction, and indeed an earlier Lightseed prototype works on this principle.</p>\n<p>However, we weren’t interested in making a train to nowhere! We wanted a game. And due to the “one more time” theme, we wanted to travel or play in a loop. So we looked at ways where (1) the three colors would help players continue to move at a steady speed, thus the color-mixing puzzle to unlock gates, and (2) when acceleration was necessary to, for example, turn in a gradual circle to get back to the starting point, there would be plenty of reference points for the brain to hold on to and reduce the sense of unexpected motion caused by that mismatch between the eye and inner ear. Thus the frame of the car, the visibility of the track ahead of you, and the general gradualness of any changes in direction. </p>\n<p>Once we saw that the game was playable by the great majority of players without ill effect, we went on to push the motion envelope a bit more with some changes in elevation and steeper curves. We like it… see what you think!</p>\n<p><strong>TECHNICAL &amp; DESIGN NOTES</strong></p>\n<p>The lights projecting from the front of the train are actually volumetric light cones built with Unity’s Shader Graph for the Lightweight Render Pipeline. The way they mix color is a real physical phenomenon, no trickery involved! The light cones are transparent, additive light sources, so they allow color to mix as it does in the real world. Because they work (as do all VR images) by turning on tiny red, green, and blue phosphors, they allow e.g. red phosphors from the red light cone to overlap with green phosphors from the green light cone, and the human brain blends the input from the related cones in the human eye and sees yellow. </p>\n<p>Development was done in Unity3D with VRTK. Scenery and props were built in Probuilder and incorporated the Trees and Rocks pack from LMHPoly and Little Houses and Little Bushes from Liteland. </p>\n<p>Sound effects were built in Audition from samples provided by the wonderful freesound.org — details available upon request.</p>", "metacritic": null, "released": "2019-07-24", "tba": false, "updated": "2019-07-27T10:58:43", "background_image": "https://media.rawg.io/media/screenshots/6b0/6b0e003dfa564c426472ab5da6f5ae15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lightseed"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}