{"id": 353016, "slug": "din-in-the-seventeenth-minute", "name": "Din in the Seventeenth Minute", "name_original": "Din in the Seventeenth Minute", "description": "<p><em>Latest Update: July 24, 2019 — version 1.0</em></p>\n<p> <strong>Din in the Seventeenth Minute</strong> is my entry for the Nouvim 3000 interactive fiction jam. The requirements were to make a short interactive story within a month, from 500 to 3,000 words, without the use of audio or extraneous imagery. The given theme was <em>Infamy</em>. While the original jam is intended for French works, I decided to submit this English language work anyway. I had worked on a French translation, but unfortunately was not able to finish it in time. Perhaps at a later date, it will be released.</p>\n<p>I interpreted the theme of <em>Infamy</em> not as about an individual person, infamous for his or her deeds, but rather as a concept, infamous for its latent existence within all of us. Beyond that, there isn't much I wish to say about the story itself—reading it should convey everything I wished to present.</p>\n<p>While this is a work by 3 Halves Games, it was created solely by the developer and writer, M.H. Abdul-Rahim. However, this story does related to a previous 3HG work: it is the prequel to our 3D exploration game, EXTRA PLANETARY.</p>\n<p>Please feel free to follow us on social media and join our Discord server. We're happy to have you.</p>\n<ul><li>Twitter</li><li>Facebook</li><li>Discord</li></ul>\n<p>Thank you for reading.</p>\n<p><strong>Credits</strong></p>\n<p>Presented by 3 Halves Games. Written by M.H. Abdul-Rahim. Built using node.js technology, including Babel, Webpack, Standard, Husky, Font Face Observer, and Phaser CE.<br/></p>\n<p><strong>Changelog</strong></p>\n<ul><li>v1.0.0 (2019-07-24)<ul><li>Full initial release of the story</li></ul></li></ul>", "metacritic": null, "released": "2019-07-24", "tba": false, "updated": "2019-07-27T10:50:59", "background_image": "https://media.rawg.io/media/screenshots/2ea/2eaafb570af01c57a9eb31ffe8b312b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["3 Halves Games"], "genres": [], "publishers": [], "esrb_rating": null}