{"id": 353167, "slug": "drive-for-freedom-88", "name": "Drive for freedom 88", "name_original": "Drive for freedom 88", "description": "<p>1988, the apocalypse threatens the planet. Despite the efforts of humanity to avoid the worst, it was not spared by the meteorite rains causing climate disruption and social chaos. Your only chance to survive: repair the plane that will reach a well-protected military underground complex. For that, you will have to harvest many resources by traveling highways and participating in wild races. A well prepared vehicle will be essential because the road will be long and full of pitfalls!</p>\n<p>-Volve in a free world in 2D diving view</p>\n<p>-Participate in circuit races</p>\n<p>-Thousands of configurations possible among 3 categories: sedans, pickups and trucks</p>\n<p>-Recruit and send your co-driver on a mission or race and bet on him</p>\n<p>-Buy, repair and upgrade your vehicles in different locations</p>\n<p>-Improve your own garage to store and maintain your vehicles</p>\n<p>-Manage your damage and your fuel before breaking down</p>\n\n<p>This first episode of \"Drive for Freedom\" is completely free, and we hope, thanks to your interest in our project, to move on to episode 2, which will offer a new engine, deeper RPG content and compatibility. Linux and MacOS in addition to Windows.<br/></p>\n\n<p>Download the game demo for free!</p>\n\n<p><em>Warning: Game in Alpha version, Bêta release planned on 8/08 at 8:08am.</em></p>\n<p>\n</p>\n\n<p>1988, l'apocalypse menace la planète. Malgré les efforts de l'humanité pour éviter le pire, elle ne fut pas épargnée par les pluies de météorites à l'origine de dérèglements climatiques et du chaos social. Vôtre seule chance de survivre : réparer l'avion qui permettra de rejoindre un complexe souterrain militaire bien protégé. Pour cela, il vous faudra récolter de nombreuses ressources en parcourant les autoroutes et en participant à des courses sauvages. Un véhicule bien préparé sera indispensable car la route sera longue et semée d'embûches !   </p>\n<p>-Évoluez dans un monde libre en 2D vue plongeante\r\n  </p>\n<p>-Participez a des courses sur circuits\r\n  </p>\n<p>-Des milliers de configurations possible parmi 3 catégories: berlines, pickup et camions\r\n  </p>\n<p>-Recrutez et envoyez votre copilote en mission ou en courses et pariez sur lui\r\n  </p>\n<p>-Achetez, réparez et améliorez vos véhicules dans différents endroits\r\n  </p>\n<p>-Améliorez vôtre garage personnel pour y stocker et entretenir vos véhicules\r\n  </p>\n<p>-Gérez vos dégâts et votre fuel avant de tomber en panne</p>\n\n<p> Ce premier épisode de \"Drive for Freedom\" est totalement gratuit, et nous espérons, grâce à l'intérêt que vous portez à notre projet, évoluer vers l’épisode 2, qui offrira un nouveau moteur, un contenu RPG plus profond ainsi qu'une compatibilité Linux et MacOs en plus de Windows.</p>\n\n<p>Télécharger la demo du jeu  gratuitement!</p>\n\n<p><em>Attention: Le jeu est en version Alpha, la sortie de la Bêta est prévu le 8/08 a 8h08.</em></p>", "metacritic": null, "released": "2019-07-23", "tba": false, "updated": "2019-07-27T11:28:51", "background_image": "https://media.rawg.io/media/screenshots/22f/22f4d9ebc2d7ceb53cf6799117aa5b0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 458, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ARKAD Studio"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}