{"id": 353586, "slug": "top-car-driver-city-racing", "name": "Top Car Driver: City Racing!", "name_original": "Top Car Driver: City Racing!", "description": "Compete in a sports car race at night!<br/><br/>When night falls in Cars City the best sports cars go out and compete to dominate the streets of the city. Run at full speed to demonstrate that you're a master driver!<br/><br/>Choose between one of the great available cars and enjoy what the true sports car offer!<br/><br/>Pay attention because the other cars try to chase you and disrupt your career! You'll have to be very focused to avoid rivals and maintain the life bar green!<br/><br/>Avoid shocks because they will reduce your life and may end your career! Your mission is to increase your level and pilot fame so that your sport car becomes the most respected in town!<br/><br/>The controls are very simple, you just have to tilt your device sideways as if it was a wheel, and by pressing the screen you can increases the speed of your car!<br/><br/>Challenge your friends to see who goes further and gets a better score on the leaderboard! Only the best drivers will enter there and you can be one of them!<br/><br/>Features of this car racing game:<br/><br/>◉ Night landscape!<br/>◉ Beautiful sports cars!<br/>◉ Simple controls!<br/>◉ Realistic graphics in urban environment!<br/>◉ Leaderboards!<br/>◉ Fun music!<br/>◉ Free!<br/><br/>The best sports car racing game in the world is waiting for you to download it! Feel like Webber, Vettel or Fernando Alonso!<br/><br/>We appreciate you leaving us reviews and comments to know if you liked it and so that we can improve it. We try to answer to all the comments you leave us!<br/><br/>Is it true that no one can beat you and you're the king of the night driving?", "metacritic": null, "released": "2015-06-06", "tba": false, "updated": "2019-07-29T08:04:52", "background_image": "https://media.rawg.io/media/screenshots/a8b/a8be747402ff458ca85fcca3038cd21c_PlrnObZ.jpg", "website": "http://labcavegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lab Cave Apps"], "genres": ["Simulation", "Racing"], "publishers": ["Lab Cave Apps"], "esrb_rating": "Everyone 10+"}