{"id": 353536, "slug": "1shot-quick-timing-shooter", "name": "1SHOT - Quick Timing Shooter", "name_original": "1SHOT - Quick Timing Shooter", "description": "Are  you ready to become a one shot legend? Master the maze, perfect your timing, hone your reaction, and tap for the perfect shot to hit your target. Experience the #1 shot timing game of 2019.<br/><br/>Game Features:<br/><br/>1.  Unlock every Awesome Weapon<br/>What's your weapon of choice? From a red laser cannon to a deadly accurate bow or even the no scope sniper, we have the weapon for you!  Each comes with its own unique animation to pull you into the action. Never miss a shot! Earn gems to unlock them all! More weapons coming soon.<br/><br/>2.  Test your Reaction Timing<br/>Each shot requires perfect timing and judgement. Track the obstacles movement, find the opening and TAP! Just don't miss! There is no forgiveness, you only get one tap, one shot, to hit the target or you'll need to start over.<br/><br/>3.  Challenge Yourself<br/>Why take the easy way? Cut it close for absolute perfect timing and shoot at a critical moment to hit the target. Prove that you have the fastest reaction in the game and shoot your shot in the most daring, smallest window. With one shot, it takes courage to put it all on the line for the extra glory. Your courage will be rewarded. Score higher, earn more points, and if you're truly a master at 1shot, unlock rare targets as a reward for taking the extra risk. Careful though, obstacles will make you miss, you need to be PERFECT.<br/><br/>4.  Discover all the Targets<br/>Whether you want a quick shot at a classic target, or explode a jack-o-lantern, this game has the target for you. Only the most skilled will be able to unlock them all. Only the quickest have the right reaction. Only the zennest can make the timing. Will your shot be perfect?<br/><br/>5.  Navigate all the Obstacles<br/>Swinging circles, floating cubes, moving pillars and much, much more. Each target it obstructed by new, creative obstacles to challenge your timing and make you miss. Tap quick or the moving obstacles will get in the way of your perfect shot. Explore the maze to discover all the creative challenges.<br/><br/>6.  Find the center of the maze<br/>Work your way through the maze, finding challenges at every turn. Only true experts have the speed, reflexes, and focus to make it all the way through. Coming soon.<br/><br/>Whether you're waiting in line, bored on the bus, or trying to avoid real responsibilities, this game is the perfect way to challenge your quick reaction and pass the time. Only the most skilled have what it takes to have a perfect shot. You only get one shot. Make it count.", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-07-30T19:29:58", "background_image": "https://media.rawg.io/media/screenshots/790/790206d0e1bdd51f5a1867feb5a60cd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["MagicAnt,Inc", "MagicAnt.Inc"], "genres": ["Action", "Sports", "Casual"], "publishers": ["MagicAnt,Inc."], "esrb_rating": null}