{"id": 353518, "slug": "flower-legends-match-3", "name": "Flower Legends Match 3", "name_original": "Flower Legends Match 3", "description": "Set off on a lovely adventure with Flower Legends Match 3 puzzle game and match your way through thousands of amazing levels. Make your garden bloom!<br/><br/>Play the best matching game today and get ready to enjoy hours of endless fun. Swap and blast flowers of the same color to make beautiful combos and win levels- it’s super relaxing and addicting! Win awesome boosts to help you pop your way around tricky challenges and clear the board before you run out of moves. <br/><br/>Are you addicted to match 3 games? Can’t have a day without matching flowers on your phone? <br/>You better don’t miss this flower crushing mania! <br/>Download now and challenge yourself with thousands of dazzling puzzle levels and awesome brain teasers. Earn amazing rewards and don’t forget to check back each day to claim your daily bonus.  <br/><br/>FUN-FILLED PUZZLE MATCHING GAME! Enjoy Flower Legends matching game with your family and friends, and develop your skills by playing everywhere, and as much as you want online or offline. This game keeps getting better as you advance and encounter more challenging elements and super fun puzzles! Join the legendary adventure now and match your way to sweet victory!  <br/><br/><br/>FEATURES:<br/>- Lovely blooming levels filled with colorful puzzlers and cool effects. <br/>- Challenging gameplay with plenty of fun puzzles.<br/>- Incredible combos and boosts.<br/>- Free to play and totally addicting garden game!<br/>- Great adventure at the match 3 garden. Swap and blast rose and leaf buds and win levels.<br/>- Beautiful graphics and designs, plenty of colorful flowers. <br/>- No wifi or internet connection is needed.<br/><br/><br/>HOW TO PLAY:<br/>- Swipe and crush 3 or more flowers.<br/>- Play through thousands of levels and solve all the fun puzzles.  <br/>- Match 4 flowers of the same color to create a striped item. Match the striped flower with other items to create a line blast and clear the row. <br/>- Match 5 buds of the same color in an L or T form to get a cool boost that will explode surrounding flowers. <br/>- Match 5 flowers in a row to create a colorful bomb and generate major explosions to clear the field! <br/><br/><br/>SET UP A STRATEGY! Try to clear a level with fewer moves to get a higher score. Don’t rush in to randomly match three in a row, remember: matching four or five items is always better! As you start a new level, try to find the largest amount of items to create greater effects and explosions. <br/><br/><br/>Looking for a fun way to enjoy a long car ride? <br/>Why not spend your time playing the best puzzle game in the store! Download for free and start matching flowers today!<br/><br/>Flower Legends Match 3 will take you into the most wonderful journey! Play now, link and crash 3 beautiful flowers, create amazing combos and boost your game with awesome power-ups and bonuses. <br/><br/><br/>Check back often for new levels and cool updates.<br/><br/><br/>Play today this super fun flower game and join the incredible adventure in the garden!", "metacritic": null, "released": "2019-01-28", "tba": false, "updated": "2019-07-29T07:07:30", "background_image": "https://media.rawg.io/media/screenshots/6ca/6ca1c1672e714d703949fdcc307951ca.jpg", "website": "https://www.ilyon.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ilyon Dynamics"], "genres": ["Casual", "Puzzle"], "publishers": ["Ilyon Dynamics"], "esrb_rating": "Everyone 10+"}