{"id": 353555, "slug": "snoopy-pop-blast-the-bubbles", "name": "Snoopy Pop+ Blast the Bubbles", "name_original": "Snoopy Pop+ Blast the Bubbles", "description": "Join Snoopy, Charlie Brown and the rest of your favorite Peanuts characters in Snoopy Pop - a delightful new bubble shooter with exciting game modes! Pop bubbles and explore all the fun the Peanuts Gang has in store for you!<br/><br/>Good Grief! Woodstock and the rest of his flock of birds are trapped in bubbles! Help Snoopy strategically burst bubbles to save his best friend! He’ll need the skills and talents of each of his famous personas to save them! Employ the help of Charlie Brown’s yellow kite and Linus’ blanket to overcome obstacles and return the birds safely to land. Prepare your doghouse and stock up on bubbles as you take on the infamous Red Baron to save your fledgling friends! <br/><br/>Features:<br/>- Over 800 fun-filled levels with more to come!<br/>- Exciting neighborhoods to explore!<br/>- Featuring original music from the Peanuts series!<br/>- All new game modes starring all of your favorite Snoopy personas! <br/>- Collect Peanuts characters, game pieces, boosters, and more!<br/>- Defeat the Red Baron and become a world-famous “Flying Ace”!<br/>- Use the Beach Ball Burst to make quick work of any bubble challenges!<br/>- In-game events themed around classic Peanuts storylines and holiday specials you’ve grown up with!<br/>- Check back often for fresh new characters and puzzles... added weekly!<br/><br/>Don’t be a blockhead! Play Snoopy Pop today! <br/><br/>DEVELOPER INFO: Jam City is the leading developer in truly cross-platform social gaming! Check out our other free match 3 puzzle games! You'll love to swap, match, and crunch through ever expanding levels and events. Check back often to see all the new games that we've added! Jam through each new puzzle adventure.", "metacritic": null, "released": "2017-07-10", "tba": false, "updated": "2019-07-29T07:31:02", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2dd441b42ab7c68a58c67779a5b3757.jpg", "website": "http://www.jamcity.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jam City"], "genres": ["Casual", "Puzzle"], "publishers": ["Jam City"], "esrb_rating": "Everyone 10+"}