{"id": 353666, "slug": "fort-stars-kingdom-battle", "name": "Fort Stars: Kingdom Battle", "name_original": "Fort Stars: Kingdom Battle", "description": "Create the ultimate team of heroes to raid enemy castles, steal loot and conquer the kingdoms! The right combination of brains and brawn will lead you to victory. Defend your own riches by building an impenetrable fortress with traps and guardians around every corner.<br/><br/>ASSEMBLE A MIGHTY TEAM<br/>Pick me! Pick me! There is an arsenal of epic heroes to collect, customize and upgrade, but it’s your duty to select the best raiding party. Do you want strength? Speed? Or Sorcery? Should you send your team to find Gold, Crystals, or Cards? They are the brawn, but you are the brains!<br/><br/>RAID YOUR RIVALS FOR LOOT<br/>To reach the riches in the Throne Room, you must be strategic with your attacks. Holy Shield? Reduce damage! Summon Gruntlings? Unleash snappy, snappy, bite, bite! Elf archers? Pierce the enemy with pointy-eared, projectiles! Whether you want to lash with lightning, summon a sorceress, or make your enemies flee in fear, there’s a spell for you. Succeed and the loot is yours!<br/><br/>BUILD THE ULTIMATE FORTRESS<br/>Turn the tables on your foes and build an impenetrable labyrinth of danger with traps, tricks, and guardians. Create an epic defense for your Throne Room to prevent the enemy from taking the all the glory, medals and treasure! <br/><br/>WORLD GAMES<br/>* Climb the rankings of the global leagues!<br/>* Form a guild and take on the world with your friends!<br/>* Face humongous, screen-filling guardian bosses!<br/>* Invade fortresses built by friends, foes, and anyone else around the world!<br/><br/>*************<br/><br/>Please follow us on social to keep up to date on the latest in-game events:<br/><br/>https://www.facebook.com/fortstarsgame/<br/><br/>Don't forget to leave a review on the store, we want your feedback to keep making Fort Stars a better experience!<br/><br/>Privacy policy: <br/>https://fortstars.zendesk.com/hc/en-us/articles/360005287513-Privacy-Policy<br/><br/>Terms of Service:  <br/>https://fortstars.zendesk.com/hc/en-us/articles/360011864693-Terms-of-Service<br/><br/>*************<br/><br/>Fort Stars uses various third party services to support your gaming experience, ranging from advertising to customer support. In order for these components to function correctly, they require permission to access external storage. PlayStack respects your privacy and will never access, make use of, or share your personal data.<br/><br/>Fort Stars contains a subscription service.<br/><br/>The \"VIP Pass\" is a 1 week auto-renewable subscription offering 2x faster vault unlock, travel, and heal times.<br/> <br/>• Payment will be charged to iTunes Account at confirmation of purchase.<br/>• Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>• Account will be charged for renewal within 24 hours prior to the end of the current period, and identify the cost of the renewal.<br/>• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>• Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-07-29T09:08:40", "background_image": "https://media.rawg.io/media/screenshots/4fa/4fa38cfc62f263d73c5334f578234c6a_TuQIDiu.jpg", "website": "https://fortstars.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayStack"], "genres": ["Action", "Strategy"], "publishers": ["PlayStack"], "esrb_rating": "Everyone 10+"}