{"id": 353664, "slug": "impossile-crazy-spin-wheel", "name": "Impossile Crazy Spin Wheel", "name_original": "Impossile Crazy Spin Wheel", "description": "You may get hopelessly addicted to this impossible spinning wheel. How many color arrows can you match on this wheel? What level can you get to? Download right now to find out.<br/><br/>** How to Play<br/><br/>- Tap your screen to spin the wheel<br/>- Match the arrow color with the color on the circle dial<br/>- Each level will require one additional color match to complete<br/>- The arrow will change colors on each tap and the dial will twist back and forth<br/>- Score the highest &amp; share with your friends &amp; family!<br/><br/>How many color arrows can you match on this wheel? What level can you get to? Download right now to find out. Pop the circle wheal now!<br/><br/>Very simple to play, just tap the screen to spin the Impossible Color Spin and match the arrow color with the color on the circle dial wheel. The arrow will change colors on each tap and the dial will twist back and forth.<br/><br/>Compete with your friends on the Leaderboard, challenge your family and friends to beat your spiny wheel high score. Good luck and have fun by spinning Impossible Color Spin! Try to stop this Impossible Color Spin that will blow your mind! Arrows &amp; colors &amp; addictive game!<br/><br/>** Impossible Color Spins Features<br/><br/>- Intuitive controls with an infinite gameplay<br/>- Vibrant graphics.<br/>- Fun &amp; Challenging gameplay among spin the wheel games<br/>- Made for users of all ages.<br/><br/>Tap the matching color to the arrow color and play! The best spiny wheel game on itune! Match the arrow to the color. Phoenix games is a young gaming company that have the goal to bring users best casual games! with your help and downloads we can make it and bring you new and fun games!<br/><br/>Impossible Color Spins brings the ultimate color wheel fun &amp; a challenging reflexes game for everyone! Simply match the arrow color as it passes through the matching color on the circle dial. Download Impossible Color Spins now &amp; see how long you can survive the challenge!!<br/><br/>Beware! The arrow will spin back &amp; forth on the dial. This game will test your reflexes &amp; concentration. Get addicted to this amazing spinning wheel free game!! See how many colors you can correctly match!<br/><br/>** ABOUT Phoenix Games LLP **<br/><br/>With over millions of users Phoenix Games LLP to be known as the creator of games that babies, kids, girls and parents love.<br/><br/>Visit us on https://www.phoenixgames.in<br/><br/>Share the experience of these top free games with your family, friends and social people.<br/>Or follow us on…<br/><br/>** FACEBOOK **<br/>https://www.facebook.com/phoenixgamesllp<br/><br/>** WE VALUE YOUR FEEDBACK **<br/>message us on https://www.facebook.com/phoenixgamesllp<br/><br/>** PRIVACY POLICY **<br/>As a designer of kids &amp; Adults games, read our privacy policy here: http://phoenixgames.in/privacy.html", "metacritic": null, "released": "2019-05-24", "tba": false, "updated": "2019-07-29T09:07:48", "background_image": "https://media.rawg.io/media/screenshots/0ac/0acb7441f0940db3b2403594e423551f.jpg", "website": "http://phoenixgames.in/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Phoenix : makeup & dress-up educational free salon games for princess girls & kids"], "genres": ["Action", "Casual"], "publishers": ["Anjo Diam HK"], "esrb_rating": "Everyone 10+"}