{"id": 353640, "slug": "blaster-chef", "name": "Blaster Chef", "name_original": "Blaster Chef", "description": "Match blocks to blast away ingredients and help chef Josh put together the perfect recipe in this exciting food matching puzzle game!<br/><br/>Match, blast, and collapse your way to the top. Prove you are the #1 puzzle chef by matching your way through challenging and creative puzzles. You'll need to use all your wits and your best strategy if you want to become the one and only Blaster Chef!<br/><br/>Blaster Chef Recipe:<br/><br/>Nutritional Information: <br/><br/>- Gluten-Free            - Low-Calorie <br/>- Addictively fun      - Source of puzzle mania<br/><br/>Ingredients:<br/><br/>• Classic match &amp; blast puzzle gameplay<br/>• Various cooking-themed challenges that will test your wits <br/>• Various helpful boosters and rewards to unlock<br/>• Lots of varied cooking puzzles, with new ones added regularly<br/>• Easy to play match &amp; blast gameplay that is satisfying to master<br/>• Colorful, fun graphics and exciting collapse gameplay<br/>• Leaderboards to compete against your friends in cooking contests<br/><br/>Preparation:<br/><br/>- Find two or more of the same colored matching ingredients and tap to blast them!<br/><br/>- Tap five or more matching blocks to create special items!<br/><br/>- If you get stuck, feel free to use one of our special boosters<br/><br/>- Each level has different goals, so be sure to check the recipes!<br/><br/><br/><br/>Chef Josh has a dream, and that dream is to become the one and only Blaster Chef. But the only way to claim such an amazing title is by becoming the very best cooking collapse puzzle solving chef out there! It's not enough to be cooking average food. The food, like the chef's collapse puzzle skills, needs to be the best! So together with his pet cat Sam and gourmet pigeon Pesto, Josh is traveling through the streets of Paris in search of the best recipes and fresh and new cooking ingredients. But he can't do it all by himself! He needs your help to solve a variety of cooking-themed puzzles, blast away and collapse the food blocks, and in the end become the real Blaster Chef.<br/><br/>So pick up your chef's hat, warm up your blasting finger, and let's get cooking!<br/><br/><br/><br/>Want to be the first to hear about new CookApps games? <br/>Follow us: <br/>Company: www.cookapps.com<br/>Contact us: support@cookapps.com", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2019-07-29T08:50:20", "background_image": "https://media.rawg.io/media/screenshots/c55/c556843f88827f7fbc1a896e991175d3_R8jRjJ3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CookApps"], "genres": ["Casual", "Puzzle"], "publishers": ["cookapps"], "esrb_rating": "Everyone 10+"}