{"id": 353792, "slug": "sdorica-mirage", "name": "Sdorica -mirage", "name_original": "Sdorica -mirage", "description": "Over 10 million downloads!<br/>Four years in development, Rayark Games' latest work challenges the limits of visual design, music performance and storytelling in a Role-playing game. <br/><br/>Legend has it that the world was once pitch black. Humans were puppets of the giant dragon \"Sdorica\". As a \"Watcher\", how would you change this world?... <br/><br/><br/>Game features:<br/>-Players will use the soul orbs to cast skills of the characters to make different combos and attack the enemies in order to pass a level.<br/><br/>-Regular weekly update, launching new plots, new characters, different story lines and different adventures for your fantasy journey.<br/><br/>-More than 41 unique characters with the capacity of upgrading up to a max Tier for stronger and gorgeous techniques.<br/><br/>-Characters skills are diverse, according to your favorite character and depending on their synergy, you can stablish your own team.<br/><br/>-Unscheduled Collaborations, Fantasy Trials, Treasure Hunts, and Challenges with your friends.<br/><br/>Four Major Arts:<br/><br/>- Visuals<br/>In the colorful and magnificent environment, every single character will be on stage. Experience a picturesque, storybook-like adventure.<br/><br/>- Music<br/>Handled by Chamber Chu, the composer of DEEMO's main soundtrack, a fully orchestrated soundtrack materializes the world note by note.<br/><br/>- Storytelling<br/>Displayed with fully animated cutscenes handcrafted by 2D animators. In addition to the main storyline, the side stories of over 41 characters are woven together to create this grand tale.<br/><br/>- Strategy<br/>Support, Attack and Defense; three classes of characters complement each other. From picking team members to planning a strategy based on the number of blocks on board, enage in exhilarating battles that challenge your tactical mind.", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-29T10:39:47", "background_image": "https://media.rawg.io/media/screenshots/c89/c893458c5b693dc76727d2f1e8591640_VhHObgu.jpg", "website": "https://www.rayark.com/g/sdorica/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rayark International"], "genres": ["RPG", "Strategy"], "publishers": ["Rayark International"], "esrb_rating": "Everyone 10+"}