{"id": 353795, "slug": "merge-fruit-ninja", "name": "Merge Fruit Ninja", "name_original": "Merge Fruit Ninja", "description": "Welcome to play Merge Fruit Ninja on your phone. Train your Ninja to be a Ninja master by slicing up fruits everyday. <br/><br/><br/> Merge Fruit Ninja Feature:<br/>Merge Fruit to train your Ninja.<br/>Variety of fruits. There are more than 50 kinds of fruits in the game. And some rare fruits are waiting for you to collect.<br/>Idle system. Your Ninja will slice up automatically. You can get rewarded even when you are offline.<br/><br/>Make your Ninja become the world’s strongest and smartest Ninja in the world! <br/>———————————————————————————————————————<br/><br/>Upgrade to Merge Fruit Ninja Premium for more awesome features:<br/>* Increase 50% earnings.<br/>* Increase 20% crit rate.<br/>* add 2 Fruit Limit.<br/>* add 2 extra Fruit Space.<br/>* 120% offline earnings.<br/>* remove pop-up ads.<br/>* get 10 magatama everyday.<br/><br/>It's an auto-renewing subscription:<br/>1 week Merge Fruit Ninja Premium for $4.99, auto-renews at the end of each week term at $4.99. Your trial period will begin when you confirm your payment. Your trial period lasts 3 days. No money will be charged or held in your iTunes account before the end of your trial period. After the trial period, monthly subscription will start for $4.99. <br/>* Payment will be charged to your iTunes Account at confirmation of purchase.<br/>* Your subscription automatically renews unless auto-renewal is turned off at least 24-hours before the end of the current period.<br/>* Your iTunes account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>* You can manage your subscriptions and turn off auto-renewal by going to your Account Settings in the iTunes store after purchase.<br/>* Any unused portion of a free trial period, if offered, will be forfeited if you purchase a subscription to that publication, where applicable.<br/><br/>All personal data is handled under the terms and conditions of Merge Fruit Ninja's privacy policy. More details can be found here:<br/>Privacy Policy: http://fruitninja.boo.chat/support/privacy.htm<br/>Terms of Use: http://fruitninja.boo.chat/support/terms.htm", "metacritic": null, "released": "2019-06-29", "tba": false, "updated": "2019-07-29T10:43:54", "background_image": "https://media.rawg.io/media/screenshots/196/196a79335d78065eddc1af4bd405ead0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nixi Technology Co.,Ltd."], "genres": ["Casual"], "publishers": ["Xi'an Ni Xi Network&Technology Co"], "esrb_rating": "Everyone 10+"}