{"id": 353730, "slug": "cook-it-chef-cooking-games", "name": "Cook It! - Chef Cooking Games", "name_original": "Cook It! - Chef Cooking Games", "description": "“Cook It!” is an awesome NEW restaurant simulation that combines your favorite COOKING GAME with your favorite DESIGN GAME. That’s right, those two types of games are together at last in this amazing new FREE TO PLAY adventure! <br/><br/>“Cook It!” is the NEWEST creation of FlowMotion Entertainment, the same company that produced the hit cooking game “Kitchen Craze” and the hugely popular farming and design game “Cooking Country” which together had over 20 MILLION players. Now we’re back with “Cook It!”<br/><br/>Explore a funky city as you unlock endless new tasty destinations, from the adorable Queen’s Bakery to the exotic Sushi Shack to the delicious Donut Den. Each location has its own kitchen to UPGRADE, and its own restaurant to DESIGN and DECORATE to your personal taste. Pick the color of your chairs, the art on the walls, and everything else as you race to serve a crazy cast of super cute customers! This is one COOKING AND DESIGN adventure you won’t want to miss!<br/><br/>Features:<br/>■ Play ANYWHERE! No internet connection required.<br/>■ FREE to play! There so many ways to earn FREE Whisks and Boosts!<br/>■ The FASTEST TAPPING gameplay! No dragging here.<br/>■ The CUTEST characters! You’ll love the Fashionista and her Puppy!<br/>■ Cook EXOTIC food from around the world! Try out hundreds of different recipes.<br/>■ UPGRADE everything! Your ovens, your plates, your ingredients - it all gets better!<br/>■ DECORATE your restaurant! Pick just the options and style YOU like.<br/>■ Only the TRUE MASTER CHEFS will have what it takes to defeat a game as challenging as “Cook It!”<br/><br/>What are you waiting for? iOS users have waited all year for the sequel to “Kitchen Craze,” and it’s FINALLY HERE! Download “Cook It!” now, and start the NEWEST and GREATEST cooking adventure on mobile right away!<br/><br/>------------------<br/>Subscriptions:<br/>.1. VIP Chef Weekly Subscription <br/>2. Top Chef Weekly Subscription<br/>Please Note! This is a subscription purchase that will allow you to collect Whisks and Buffet Ticket each day. Once your 7-Day Free Trial concludes, you will be charged weekly through your iTunes Account at confirmation of purchase. This charge will take place within 24 hours prior to the end of the current period. The subscription automatically renews unless the auto-renewal is turned off at least 24 hours prior to the end of the current period. You can manage this subscription within your Account Settings. If applicable, any unused portion of the subscription will be forfeited upon cancellation of the subscription. The subscription can be canceled at any time. <br/>------------------<br/>Privacy Policy: https://www.flowmotionentertainment.com/privacy-policy<br/>Terms of Service: https://www.flowmotionentertainment.com/privacy-policy<br/>------------------<br/><br/>Like us on Facebook! https://www.facebook.com/Flowmotionentertainment <br/>Follow us on Instagram! http://www.instagram.com/flowmotion_entertainment<br/>FAQ: https://flowmotion.freshdesk.com/support/solutions", "metacritic": null, "released": "2018-12-01", "tba": false, "updated": "2019-07-29T09:56:40", "background_image": "https://media.rawg.io/media/screenshots/cba/cbaeeee65fd0f8fa8286c27e142464a7_gbg9CVO.jpg", "website": "http://www.instagram.com/flowmotion_entertainment", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FlowMotion Entertainment: Top Free Fun Addictive Cool Games"], "genres": ["Strategy", "Casual"], "publishers": ["FLOWMOTION ENTERTAINMENT: TOP FREE FUN ADDICTIVE COOL GAMES"], "esrb_rating": "Everyone 10+"}