{"id": 353861, "slug": "silent-streets-mockingbird-2", "name": "Silent Streets Mockingbird", "name_original": "Silent Streets Mockingbird", "description": "\"Beautifully written, full of twists and turns\" - POCKET GAMER<br/>\"I really like the idea of using ARKit to render elements of a crime scene in your room\" - TOUCH ARCADE<br/>\"I was completely pulled into the game... Recommended!\" - AR CRITIC<br/><br/>Explore dark mysteries in Silent Streets, a Victorian detective adventure. Inspect crime scenes in your real surroundings with augmented reality technology. Forge friendships with unforgettable characters, interrogate suspects, and bring justice to this grim world!<br/><br/>Blood always flows freely in the docklands’ bare-knuckle boxing scene, but to Snowport’s new Detective, there’s more than the usual corruption going down. Who killed the championship favourite? What experiments is the Science Society conducting? And how is the church involved? Dig to the bottom of the truth in Silent Streets: The Mockingbird’s Last Dive!<br/><br/>• Apple ARKit augmented reality - Set up a murder scene in your room and find the evidence before running out of time. A new take on the point and click genre!<br/>• Engaging story - The game is packed with subtle humour and loads of lore by Richard Cobbett, an accomplished games writer.<br/>• Beautiful artwork - realistic black and white style with colour accents, along with a minimalistic user interface, immerses you even deeper into the game world.<br/>• Choose your own adventure - Do you want to confront the suspect or gather more information first? The story is full of choices, and whatever path you take, be prepared for unique encounters and side quests on your way!<br/>• Incentive to walking more - Silent Streets is pedometer-friendly. You can do the legwork for your detective to move around town. Or you can get a cab ride instead, or wait until you hitch a ride - you decide!<br/>• Appreciate the sound of Snowport - Each role is voiced by a professional actor, and every location is breathing with 19th century Victorian ambience.<br/><br/>*PLEASE NOTE: if your device does not support Apple ARKit technology, a 2D point and click scene is displayed instead of augmented reality evidence collection*", "metacritic": null, "released": "2018-03-01", "tba": false, "updated": "2019-07-29T11:40:41", "background_image": "https://media.rawg.io/media/screenshots/8ee/8ee2d77d21f61720f90d7ef238575347_ie2p775.jpg", "website": "https://www.playond.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bending Spoons Apps IVS"], "genres": ["Adventure", "RPG"], "publishers": ["Bending Spoons Apps IVS"], "esrb_rating": "Teen"}