{"id": 353859, "slug": "auctioneer-the-game", "name": "Auctioneer: The Game", "name_original": "Auctioneer: The Game", "description": "Are YOU in it to win it? Can you spot the highest bid? Become the greatest auctioneer in the world! Conquer the planet’s greatest auction houses and sell the most desired pieces of art and much much more..<br/><br/>◉ Sell tons of unique items!<br/>◉ Unlock new auction houses!<br/>◉ Beat friends' high-scores!<br/><br/>Be as fast as the auctioneer chant!<br/><br/>SUBSCRIPTION INFO:<br/><br/>• The subscription gives you unlimited access to all the games offered in Playond and includes:<br/>\t- A lot of amazing games<br/>\t- Many hours of play time<br/>\t- New games added all the time<br/>\t- No ads or extra payments<br/>• Subscription length: weekly, monthly<br/>• Your payment will be charged to your iTunes Account as soon as you confirm your purchase.<br/>• You can manage your subscriptions and turn off auto-renewal from your Account Settings after the purchase.<br/>• Your subscription will renew automatically, unless you turn off auto-renew at least 24 hours before the end of the current period.<br/>• The cost of renewal will be charged to your account in the 24 hours prior to the end of the current period.<br/>• When canceling a subscription, your subscription will stay active until the end of the period. Auto-renewal will be disabled, but the current subscription will not be refunded.<br/>• Any unused portion of a free trial period, if offered, will be forfeited when purchasing a subscription.<br/><br/>Terms of service: https://www.playond.com/tos.html<br/>Privacy policy: https://www.playond.com/privacy.html<br/><br/>Have a feature request you would like to see in a future version of the game? Do not hesitate to contact us at support+auctioneer@playond.io", "metacritic": null, "released": "2019-06-05", "tba": false, "updated": "2019-07-29T11:39:59", "background_image": "https://media.rawg.io/media/screenshots/b5c/b5cebf8c39a5e65c6296f470f6ced16e.jpg", "website": "https://www.playond.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bending Spoons Apps IVS"], "genres": [], "publishers": ["Bending Spoons Apps IVS"], "esrb_rating": "Everyone 10+"}