{"id": 353807, "slug": "ingress-prime", "name": "Ingress Prime", "name_original": "Ingress Prime", "description": "Welcome to the world of Ingress Prime, Agent. The fate of this universe, and perhaps others, depends on you. The discovery of Exotic Matter (XM), a resource of unknown origin, has sparked a covert struggle between two Factions. Cutting-edge XM technologies have completely transformed the Ingress Scanner, and it is now waiting for you to join this battle.<br/><br/>THE WORLD IS YOUR GAME<br/>Explore the world around you and interact with places of cultural significance—such as public art installations, landmarks, and monuments—to collect valuable resources using your Ingress Scanner. <br/><br/>CHOOSE A SIDE<br/>Fight for the Faction you believe in. Harness the power of XM to evolve mankind and discover our true destiny with The Enlightened, or protect humanity from a hostile takeover of the mind with The Resistance. <br/><br/>BATTLE FOR CONTROL<br/>Dominate territories by linking Portals and creating Control Fields to achieve victory for your Faction. <br/><br/>WORK TOGETHER<br/>Strategize and communicate with fellow Agents in your neighborhood and around the world.<br/><br/>Agents must be over 13 years old (for residents outside of the European Economic Area); or over 16 years old or such age needed to consent to the processing of personal data in the Agent's country of residence (for residents of the European Economic Area). Unfortunately, no children may play Ingress.", "metacritic": null, "released": "2014-07-14", "tba": false, "updated": "2019-07-29T10:57:34", "background_image": "https://media.rawg.io/media/screenshots/48a/48a318cc9bbef114ddae160a168f8695.jpg", "website": "http://www.ingress.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Niantic"], "genres": ["Adventure", "Strategy"], "publishers": ["Niantic"], "esrb_rating": "Everyone 10+"}