{"id": 353899, "slug": "polygon-world-war-ii", "name": "Polygon World War II", "name_original": "Polygon World War II", "description": "Great World War on Europe battlefield with US army. Fight with endless rivals squads and evil invaders. As the brave US army man - make guns blazing on the famous battlefield and grand operation like Normandy Beach, Stalingrad, a battle for Brittany, Black Flag, D-Day, Battle of Berlin and many others. \"Polygon World War II\" is the ultimate TPS offline shooting game about WW2 frontline war. Fight for honor, country, and medal.<br/><br/>Game Features:<br/>- A great quality game, TPS offline shooter.<br/>- World War II battles and operations.<br/>- Weapons used in WW2.<br/>- Play as an unknown hero of the battlefield.<br/>- Upgrade weapons to make them more effective in combat.<br/>- Single player shooting game.<br/>- Build-in game store.<br/>- Fearsome troops, big guns, vehicles of WW2.<br/>- Unlimited open world.<br/>- Epic shooting gameplay mechanics.<br/>- Well optimized even for weak devices. <br/><br/>Polygonal cartoon low-poly art graphic:<br/>Charming low poly world at war wartime. Beautiful, stylish cartoon models of war soldiers do not convey all the horrors of the ww2. Low-poly battlefield and frontline, detailed endless war cities and block city, perfectly models of military equipment and weapons from war world.<br/><br/>Unlimited open world:<br/>Explore the open world of war game in ww2 single player shooting game. Find new types of weapons, upgrade guns to make them more effective in combat for game money. Get experience for the war quests and ww2 campaign tasks, improve your brave army man of US. Buy power-ups and active skills.<br/><br/>Immerse yourself in the game of the Second World War. It's offline single player shooting game.", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-07-29T12:11:35", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bd3dfdf6066ceb166399550b8bf9ae6_SRO38Ow.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lukasz Pawlowicz"], "genres": ["Action", "Adventure"], "publishers": ["Lukasz Pawlowicz"], "esrb_rating": "Teen"}