{"id": 353891, "slug": "mortal-kombat-new", "name": "Mortal Kombat MOBILE", "name_original": "Mortal Kombat MOBILE", "description": "<p>Experience the over-the-top, visceral fighting of MORTAL KOMBAT X!<br />\nBring the power of next-gen gaming to your mobile and tablet device with this visually groundbreaking fighting and card collection game.<br />\nAssemble an elite team of Mortal Kombat warriors and prove yourself in the greatest fighting tournament on Earth.</p>\n<p>BRUTAL 3 v 3 KOMBAT<br />\nCreate your own team of Mortal Kombat fighters and lead them into battle to earn experience, new special attacks, and powerful artifacts.</p>\n<p>MASSIVE ROSTER OF FIGHTERS<br />\nCollect Mortal Kombat veterans like Scorpion, Johnny Cage, Sub-Zero, Sonya, Kitana, Ermac, and many others. Discover the newest additions to Mortal Kombat such as the insect-like DVorah, fiery Cassie Cage, bloodthirsty Kotal Khan, and the mysterious Kung Jin.</p>\n<p>JAW DROPPING X-RAYS AND FATALITIES<br />\nMortal Kombat X brings its trademark Fatalities and X-Rays to mobile, with stunning graphics, these over the top moves punch you right in the guts.</p>\n<p>CHALLENGE OTHER PLAYERS<br />\nCompete with other players in Faction Wars, an online competitive mode where players engage other player teams. Rank up in your own Factions leaderboard to earn weekly prizes.</p>\n<p>SUMMON ALLIES INTO BATTLE<br />\nFind other players to be your Ally. Borrow a kombatant and strike a decisive blow against your enemies.</p>\n<p>UNLOCK REWARDS IN BOTH THE CONSOLE AND MOBILE GAME<br />\nPlay the game and unlock exclusive rewards for the console version of Mortal Kombat X, including ultra rare characters like Klassic Kitana and Injustice Scorpion. Playing the console version unlocks rewards in mobile as well.</p>", "metacritic": 66, "released": "2015-04-07", "tba": false, "updated": "2024-03-20T13:29:12", "background_image": "https://media.rawg.io/media/games/d0d/d0decdc9f5f884156e1bef6f4097bc2e.jpg", "website": "http://www.mortalkombat.com/", "rating": 2.71, "rating_top": 3, "added_by_status": {"owned": 5, "beaten": 6, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 551, "game_series_count": 0, "reviews_count": 7, "platforms": ["iOS", "Android"], "developers": ["Warner Bros. Interactive"], "genres": ["Action", "Strategy", "Card"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Mature"}