{"id": 353936, "slug": "futuristic-robot-transforming", "name": "Futuristic Robot Transforming", "name_original": "Futuristic Robot Transforming", "description": "Enjoy flying root bike in a futuristic setting by playing this one of a kind futuristic robot transforming. The time is further ahead in the future and the city is in peace but one day all of a sudden some futuristic robots attack on your robot city to start a robot battle!! As the super robot you cannot let that happen at any cost!! <br/><br/>You have to become the hero simulator and protect all other futuristic robots living in the city as well as futuristic citizens. The enemy is as same a converter futuristic robot like yourself. Both kinds of futuristic robots have the power to be a converter robot bike!! This has now become a war simulator situation where you have to be the super robot war hero and become the hero simulator!!!<br/><br/>In this futuristic robot battle the robots will be flying since it is a flying bike robot bike battle. In this futuristic flying world take the enemy futuristic robots to the bike battle field for the time of bike war is here. It is guaranteed adventure upon your flying bike war simulator war hero heart!!! <br/><br/>Upon the enemy futuristic robots arrival, take the enemy flying robot to the sky for a futuristic robot transforming!! All the flying bike robot are converter futuristic robots which have the ability to turn from bike racing simple bike to a killer futuristic robot transforming bike hero simulator and also a robot man in form which makes him very powerful, big and strong!<br/><br/>The game play is very simple of this war simulator robot bike games, the futuristic robot flying bike war simulator has many on screen controls. Kicking, punching, hitting, are all a part of physical controls and also, you can fire different kinds of attacks from the hero simulator futuristic robot transforming hero converter armour!!<br/><br/>Destroy all enemy futuristic robots before they ruin your flying bike robot in futuristic robot battle, robot bike games. Use good control of your war hero laser beams and convert into robot man to fight the ultimate futuristic robot enemy in this bike battle war simulator robot games as a super robot!!!<br/><br/>You have nothing to lose because of your futuristic robotic strength. Show all enemy futuristic robots war simulator robot who is the robot bike boss. So download the futuristic robot transforming game right now and bring your game on!!! The fun futuristic robot transforming hero game is free of cost so you can enjoy the thrill more than ever now in the best robot war game with exciting features!!!<br/><br/>***Features of Futuristic Robot Transforming***<br/>• Multiple levels <br/>• Multiple futuristic robot flying bike war hero robots <br/>• Futuristic city environment <br/>• War simulator and bike battle simulator <br/>• HD graphics <br/>• Bike to flying bike robot converter feature <br/>• On screen controls to perform robot bike stunts <br/>• Fun sound effects", "metacritic": null, "released": "2018-04-21", "tba": false, "updated": "2019-07-29T12:28:25", "background_image": "https://media.rawg.io/media/screenshots/4cf/4cf8f765113b32e7b294d8a675bb8e23_NBQcrVv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Asad Khan"], "genres": ["Action", "Adventure"], "publishers": ["Asad Khan"], "esrb_rating": "Teen"}