{"id": 353904, "slug": "humanity-vs-mechs-legion", "name": "Humanity vs Mechs legion", "name_original": "Humanity vs Mechs legion", "description": "Scientists exploration universe. They found armored AI in form of massive aggressors energy, special sci-fi legion mechs, that are dangerous hostile societies toward humanity and earth race.<br/>As quickly as super mechs legion assault began, news about this mechs war spread quickly around the world, and trouble we, as humanity, dig into.<br/>A solution in this super mechs legion war adapt is you - one of super elite cyborg warrior soldier.<br/>Humanity being, supported by sci-fi technology and grand craft robotics, can stop them.<br/>Gather pals, gather weapon arsenal and defeat extraterrestrial battle mechs in sci-fi machine warfare, before it's too late to save the human race, human destiny! Spit in face of armored AI aggressors energy!<br/><br/>ARMORED AI ROBOTS WAR!<br/>Incredible sci-fi TPS simulator of elite cyborg warrior gives to player 30 missions and quests in order to complete, they become more difficult as you advance.<br/>Missions and quests include clearing battle arena from armored AI enemies, sabotage armored robots enemy supplies, destroying specific targets, dangerous hostile and massive aggressors etc.<br/>Ruthless sci-fi mechs legion has fiercely tricks and features to make your life more brutal, difficult, doom-like with sci-fi arsenal weapons: deadly railguns, frightening plasma guns, flamethrowers, Pulse Rifle, miniguns, rocket launchers, grenade etc.<br/>You're not the toddler! “Humanity vs Mechs legion” has weapons, features, perks, and guns like the flamethrower, rocket launcher, machine gun, Pulse Rifle, railgun, Sonic Shotgun, golden desert eagle, \"Hand\" Grenade, minigun, Mini-Nuke, bazooka and more.<br/><br/>DEFEND HUMANITY FROM SUPER MECHS LEGION ASSAULT!<br/>On “AI wars arena” armored AI mechs have mechs squad commanders and robots bosses, who control massive aggressors energy in robots war versus super elite cyborg warrior soldier. This includes mechs warriors made of real steel named as Butcher, Raven, Spectre, etc.<br/>They won't show mercy with their big guns, you shouldn't too! The harder you hit them, the stronger mechs, enhanced by their knowledge about robotics and sci-fi technology, they will bring to fight back.<br/>Therefore, gather weapon, gather money, gather experience to become elite cyborg warrior soldier in this armored AI wars arena.<br/><br/><br/>DUG AND DIG OPEN WORLD CITY TPS!<br/>AI wars arena takes place in an enormous city, open for exploration. On the other side, the cuddly city of human citizens already infested by super mechs with massive aggressors energy. <br/>Discover city and AI wars arena, dig and dug streets. Lay your hands on goods and treasures, that was abandoned. Super mechs with sci-fi robots won't use it anyway. Find supply crates to get better weapons, features, add-ons, and ups, you never know where you can find a rocket launcher or a machine gun.<br/>On “AI wars arena” you can find many energy drinks, so you can turn on slow motion to increase your precision in shots! Use the jetpack to get on the roofs. Ultimate robots war freemium!<br/><br/>FEATURES:<br/>- 30 missions<br/>- Free Play mode<br/>- Awesome guns like a machine gun, rocket launcher or flamethrower<br/>- Golden gun!<br/>- Legions of mechs to fight<br/>- Challenging bosses<br/>- Jet pack!<br/>- Wide, open city to explore<br/>- Slow motion mode<br/>- Ultimate robots war", "metacritic": null, "released": "2018-09-16", "tba": false, "updated": "2019-07-29T12:13:29", "background_image": "https://media.rawg.io/media/screenshots/559/559a0833292cf1fdfd3a8a77d385b5da_A10WQJC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lukasz Pawlowicz"], "genres": ["Action", "Adventure"], "publishers": ["Lukasz Pawlowicz"], "esrb_rating": "Teen"}