{"id": 353989, "slug": "bid-whist-online-multiplayer", "name": "Bid Whist: Online Multiplayer", "name_original": "Bid Whist: Online Multiplayer", "description": "Bid Whist is a partnership trick taking card game played by millions around the world. It is a game played in pairs where trump is chosen by the players. The Bid Whist Multiplayer game lets you take the excitement of this popular card game and share it by connecting with your family, friends or strangers from across the globe.<br/> <br/>Available for free on both the iPhone and iPad, you can enjoy a round or two on the go. Place a bet, earn more points than your opponents and win chips. Improve your skills, challenge opponents, gain experience and become the Bid Whist expert.<br/><br/>Bid Whist Multiplayer comes packed with a bunch of exciting features:<br/> <br/>Get free chips as a ‘Daily Bonus’.<br/>Win free chips every hour from the ‘Magic Box’.<br/>Earn extra coins through in-app purchases to challenge your opponents.<br/>Pick your choice of play with different modes like Bid Whist, Classic, VIP, Solo and Whist.<br/>Connect with millions of players the world over with the Multiplayer mode.<br/>Enjoy the gameplay with fluid and rich animations.<br/>Check statistics and leaderboards.<br/>Create Private Tables. Simply choose your ‘Game Room’ type, set the ‘Bet Amount’ and the ‘Final Point’. If you don’t wish to be found, simply create your Private Table where games are ‘Invite only’. <br/>Create tables in different modes. Select room of particular bet amount and winning points.<br/>Completely free to play.<br/><br/>The Different Modes available are:<br/> <br/>Bid Whist:  Make your bid with your partner and challenge other teams.<br/>VIP: The VIP mode lets you enjoy the classic Bid Whist in custom tables.<br/>Whist: In the Whist mode no one bids at the Whist table! Trump suit changes automatically in each round.<br/>Solo:  This mode has no partnership. Each player gets their own points. <br/><br/>Download Bid Whist Multiplayer to enjoy the best card game experience available to you on your iOS device.", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-07-29T13:04:34", "background_image": "https://media.rawg.io/media/screenshots/cfa/cfa1af062332b0174244f246ecca755c_GNszVrb.jpg", "website": "http://www.gamewithpals.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Artoon Solutions"], "genres": ["Board Games", "Card"], "publishers": ["ARTOON SOLUTIONS PRIVATE"], "esrb_rating": "Teen"}