{"id": 353923, "slug": "flying-car-war-hero-robot", "name": "Flying Car War Hero Robot", "name_original": "Flying Car War Hero Robot", "description": "Are you ready to drive the flying car and play the all new 3D shooting game Flying War Simulation from robot fighting games? Then hit the install button and download the science fiction game based on the steel robot fighting shooting games. <br/>A savior robot of the 3D shooting games world who has the power to use laser shooting. Car change yourself when you need to fight the flying robot car. A flying robot game in simulation games where you can use your futuristic fighting skills and the autobots into flying car robot and use your laser shooting power and auto lock shooting for car shooting the decepticons. <br/>A simulation games where evil robots are out there to destroy the earth in future battle and the autobots have to convert depending on how strong the evil enemy is for robot fighting as a real steel savior robot.A futuristic laser shooting game of flying car where you can select your favorite autobots and start the battle game with the evil robots. A game play where you will find futuristic on a journey to save earth from the villainous decepticons by using laser shooting war games in the flying car. <br/>A war in sci-fi world has struck between the robots of the outer space and they have chosen your city to fight the future battle in this futuristic robot fighting game. Now it’s YOUR time to become the real super robot and save earth. Flying Car Robot War Simulation is a science fiction game featuring super quality 3D graphics with the latest weapons and fully equipped real steel autobots to destroy the evil robots.<br/>KILL THEM ALL!<br/>In the new era the robot game has been developed in some extraordinary features where the autobots have the power to turn into different objects like flying car and shooting car. The latest technology is used to car change in flying car games. You can enjoy the shooting car feature as well with the flying car games.<br/> <br/>GAME FEATURE: <br/>Auto-lock system to kill the enemy with the missile where the missile will hit the enemy no matter where he moves. <br/>Auto-lock  bullets feature.<br/>Flying car has  smart feature of Weapon switching. <br/>A simulation games offering three different game areas; City, Jungle and Desert. <br/>Two different futuristic shooting games mode. <br/>Free mode and carrier mode with variety of robot car.<br/>Carrier mode has level based missions.<br/>Laser shooting four different enemy to play with as you rise to other levels. <br/>Variety of 6 different robot car simulator options to select from. <br/>10 different stars based robot fighting levels hard to play; there are three sci-fi stars to win.<br/>You can buy the 6 different robot cars with the help of coins by watching videos.<br/>6 different flying robot car with 6 different qualities of Cheetah, Tiger, Panther etc.<br/>autobots will have to fight with Villainous decepticons like drones, flying robot cars and enemy robots in future battle.<br/> Option to turn off/on the game sounds.<br/>You will have a choice to select from robot to robot car to flying robot car. <br/>All the robots have the power to laser shoot at the enemy<br/>Enemy navigator which will help the autobots to navigate their enemies. <br/>Power booster to regain the power.<br/> <br/>How To Play Flying Car War Hero Robot:   <br/>Click PLAY to begin the robot fighting 3D simulator shooting game. <br/>Select your favorite featured car robot from the 6 different very cool robots.<br/>Start the game and follow the target. <br/>See, what every level demands.<br/>Kill the decepticons coming your way. <br/>Change robot into car robot with laser shooting power, Car change to flying car robot.  <br/>Once you’re done with the robots, shoot on the flying robot car enemy to complete the level.<br/>Move to next level once you reach the target.<br/>Unlock more robot flying cars and select from the gallery which one suits you best!<br/>Be ready to receive surprise laser shooting. Kill the enemy robots, dangerous flying robot car, drones and much more. Beat the enemy, soldier! Save earth and be the super robot of the millennium. The world is waiting for your help.", "metacritic": null, "released": "2018-03-02", "tba": false, "updated": "2019-07-29T12:23:24", "background_image": "https://media.rawg.io/media/screenshots/47d/47dc0967f266a158d5c2cde5fa135309_VyGIEn9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Asad Khan"], "genres": ["Action", "Adventure"], "publishers": ["Asad Khan"], "esrb_rating": "Teen"}