{"id": 353947, "slug": "dragon-fire-simulator-attack", "name": "Dragon Fire Simulator Attack", "name_original": "Dragon Fire Simulator Attack", "description": "Live a prehistoric mythological legend life for once in Dragon Fire Simulator Attack game and enjoy the hunt of a lifetime. Simply download the monster dragon game and become a conqueror of the dragon world!! <br/><br/>The key element of the Dragon Fire Simulator Attack game is, just destroy everything!! <br/>Destroy the city and destroy the buildings and kill the citizens and the wild animals, eat them and fill your dragon tummy!! Devour and ruin everything happening in the dragon city.<br/><br/>You as a dragon in the Dragon Fire Simulator Attack games will hunt down buildings and animals and people and many others things because they are creating problems for you, show your rage by destroying buildings and everything in the city. <br/><br/>You will be choosing to be a dragon out of many dragons, so select a fierce dragon in this Dragon Fire Simulator Attack game as a dragon simulator who goes out in the Dragon Fire Simulator Attack games. Use your dragon attack to get rid of buildings, citizens, and other wild animals and cause massive destruction. <br/><br/>Dragon Fire Simulator Attack game allows you to roam free in the dragon city breathing out the fire to destroy everything!! As a dragon use the navigation bar to discover the dragon city and hunt the crazy wild animal and citizen simulator and create trouble and destruction for them. You can also navigate your prey!!<br/><br/>Download the Dragon Fire Simulator Attack games for an adventure in the Dragon Fire Simulator Attack game simulation. <br/><br/>This Dragon Fire Simulator Attack game is as a war field where the dragon first hunts for the prey and then fights with dragon warrior. As a dragon simulator find yourself your destruction prey, from the navigation tool on the screen in the simulator games then make way to the red spot on navigation tool to find dragon attack simulator. <br/><br/>Press bite key to damage the prey simulator, hit them and kill them and also eat them with dragon attack and keep biting till their health bar ends in the dragon city simulation games. <br/><br/>You can harm the people of the dragon city and you can also destroy cars, buildings and other things on the road. You have to kill everything available and tasked and make the dragon world your territory in the Dragon Fire Simulator Attack games.<br/><br/>How to Play Dragon Fire Simulator Attack game:<br/><br/>&gt; Select dragon simulator level out of 10 levels<br/>&gt; Select one of the 4 unlocked dragons from dragon simulator game <br/>&gt; Enter the city through joystick movement <br/>&gt; Exhale fire breath and destroy the city with the given control <br/>&gt; Hit the buildings to break them from the given controls <br/>&gt; Eat the citizens and other living things running in the city<br/>&gt; Complete the destruction task in given time or the game will be over <br/>&gt; Fight the warrior knight at the end of each level<br/>&gt; Collect coins at the end to unlock new levels<br/><br/>Features of Dragon Fire Simulator Attack game:<br/><br/>&gt; 10 levels <br/>&gt; 4 dragon simulator dragons <br/>&gt; Multiple dragon destruction simulation tasks <br/>&gt; All dragons fly and have fire breath which they can exhale to destroy the city <br/>&gt; Time based tasks <br/>&gt; Joystick controls and movements <br/>&gt; 3d simulation <br/>&gt; HD graphics <br/>&gt; Realistic sound effects <br/><br/>Play this exciting Dragon Fire Simulator Attack game and perform the destruction task at the given time or you’ll lose and you’ll have to restart the Dragon Fire Simulator Attack game. Complete dragon game in time and unlock exciting new features in and for the Dragon Fire Simulator Attack game!!", "metacritic": null, "released": "2018-04-21", "tba": false, "updated": "2019-07-29T12:32:35", "background_image": "https://media.rawg.io/media/screenshots/455/4553769bd9e36796995ed81768a91e09_NTx2Qu5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Asad Khan"], "genres": ["Action", "Adventure"], "publishers": ["Asad Khan"], "esrb_rating": "Teen"}