{"id": 353965, "slug": "super-idle-cats-farm-tycoon", "name": "Super Idle Cats - Farm Tycoon", "name_original": "Super Idle Cats - Farm Tycoon", "description": "Cats have finally conquered Earth! <br/><br/>Found your own fruit farm, and become the most important (and wealthy!) farmer cat in the world.<br/><br/>They day has come. Finally, cats rule the world, and they are working hard to create a new cat society. First step:  build farms.<br/><br/>Contrary to what it might seem, cats love fruits. Specially bananas, coconuts, pineapples, and tomatoes (yes, tomatoes are actually fruits). But they tricked humans, and refused to eat fruits in front of them.<br/><br/>Build your farm, plant fruits, and deliver the best product to your fellow cats. Invest in cat-science to discover new, and incredible fruits that will revolution the world, and increase your profits.<br/><br/>Invest wisely in your crops, and transports to produce the best fruits in the world. Do not hesitate to prestige, and restart your farm to start over with more experience. Your farm will grow faster, and you will be able to unlock new researchs.<br/><br/>The easy gameplay is great for casual gamers, but more experienced players will also join the game. Discover how the easy gameplay combined with important management decisions, creates hundreds of different strategies to grow your farm.<br/><br/>Features:<br/>- Easy, and casual gameplay. All people can create their own farm!<br/>- A continuous challenge for all players<br/>- Cats! <br/>- Research new technologies to increase your production<br/>- Four different fruits, and dozens of evolutions<br/>- Exclusive items that will improve your farm<br/>- Fabulous 3D graphics, and clear UI<br/>- More cats!  <br/>- Push the science forward with the cat-science<br/><br/>Did we say there are cats?", "metacritic": null, "released": "2018-08-05", "tba": false, "updated": "2019-07-29T12:41:35", "background_image": "https://media.rawg.io/media/screenshots/693/693cd3fc8c4e84d76ea0e7f52e2e21d3.jpg", "website": "http://codigames.com/portfolio/super-idle-cats/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Strategy", "Simulation"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Everyone 10+"}