{"id": 353964, "slug": "lego-ar-playgrounds", "name": "LEGO AR Playgrounds", "name_original": "LEGO AR Playgrounds", "description": "LEGO® Playgrounds is a new portal to discover and play with the latest mixed reality experiments from LEGO.<br/>LEGO® NINJAGO® AR is the first playground to use Augmented Reality technology to detect a real physical LEGO® NINJAGO® set and bring it to life with exciting effects, games and animations.<br/>The team behind LEGO Playgrounds would like to share these early experiments with you - to learn and make things even better for future experiences. If you have any comments or feedback about this playground, please contact us from within the app.<br/><br/>--------------------------------------------------------------------<br/><br/>LEGO® NINJAGO® AR: Bring selected LEGO® sets to life in mixed reality!<br/>Dash to the LEGO® NINJAGO® Dragon Pit to take on the waves of Dragon Hunters as the evil Iron Baron watches from his throne! Unleash the captured dragons and watch out for the dual missile shots being fired down from the watchtower! How long can you and your friends survive?<br/><br/>Confront the LEGO® NINJAGO® Dieselnaut tank commanded by the Iron Baron and fight his henchmen as they attempt to hunt and capture dragons. How long can you and your friends keep them back?<br/><br/>Connect and team up with a friend to battle against the Dragon Hunters. Share power-ups and 3D assets, create strategies to withstand the endless waves of Dragon Hunters.<br/><br/>Compare your high-score with friends. How many waves did you survive and what level did you reach?<br/>--------------------------------------------------------------------<br/>Mix Realities:<br/>Bring a physical LEGO® NINJAGO® set to life with an action-packed AR game scene.<br/><br/>Master Ninja Skills:<br/>Control your Ninjago hero and put your combat skills to the test. Stay in the action as long as you can!<br/><br/>Play with Friends: <br/>Team up with a friend to play in the same AR space around your physical LEGO® sets. Work together and help each other defeat the Dragon Hunters.<br/><br/>Be Creative: <br/>Design, place and share objects and power-ups with friends to create unique strategies for taking on the enemy.<br/><br/>-----------------------------------------------------", "metacritic": null, "released": "2018-12-07", "tba": false, "updated": "2019-07-29T12:40:54", "background_image": "https://media.rawg.io/media/screenshots/c00/c00c2d5aba3f7822dd02084b639f5eb8_g9wR9n8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LEGO System A/S"], "genres": [], "publishers": ["LEGO System A/S"], "esrb_rating": "Everyone 10+"}