{"id": 353949, "slug": "secret-killer-sniper-frontier-target", "name": "Secret Killer Sniper Frontier Target", "name_original": "Secret Killer Sniper Frontier Target", "description": "Let’s play Secret Killer Sniper Frontier Target game.<br/>Step onto the city  with the game that raised the bar for first-person shooters.<br/>Prefer to work alone marksman? Then take your next step into the city where there are alot of terrorists, campaign as you shoot your way through one dire situation after another to save the world.<br/>Secret Killer Sniper Frontier Target  an incredible test to your aiming skill and ability; perform well to become a Master assassin!<br/><br/>Experience the thrill of being the Frontline Commander. Your mission is to kill all bad guys and to protect the city. You must use all of your expertise to stay alive. Try for single target that really matters..! Spy on targets from far-off; shoot them down with modern sniper guns, without fail.<br/><br/>Frontier Target Sniper is a free game with a lot of Excitement and fun from Rebel games.<br/><br/>Easy to control, headshot!<br/>You will serve as the army's best sniper, participate in the crime in city against the terrorists.<br/><br/>Features:<br/>- Excellent game and completely free<br/>- First-person shooter experience<br/>- Dozens of unique army sniper task<br/>- Real sniper shooting target<br/>- Impressive gun sound <br/>- Amazing graphics<br/>- High AI enemies, more challenge<br/>- Attack car and militants", "metacritic": null, "released": "2017-06-17", "tba": false, "updated": "2019-07-29T12:33:17", "background_image": "https://media.rawg.io/media/screenshots/c28/c28e7f0c0a7695c60b044e75ae879798_ZAi9ItC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Asad Khan"], "genres": ["Action", "Adventure"], "publishers": ["Asad Khan"], "esrb_rating": "Mature"}