{"id": 354116, "slug": "kung-fu-clicker-idle-dojo", "name": "Kung Fu Clicker: Idle Dojo", "name_original": "Kung Fu Clicker: Idle Dojo", "description": "Restore a dojo to its former glory and become a martial arts master with Kung Fu Clicker!<br/><br/>The Shadow Fang gang are wreaking havoc on the neighborhood dojo. It’s up to you to fight them and defend your dojo from their attacks! Tap to invest in your dojo and let your idle profits grow. Then keep tapping to build bigger and better rooms for training students in the arts of kung fu and karate, and to recruit martial arts masters. Fight to restore your dojo to its former glory by competing against other kung fu clans, climbing the leaderboards, and earning a prestigious black belt.<br/><br/>Train your students to become heroes with Kung Fu Clicker, the incremental fighting game!<br/><br/>Kung Fu Clicker is free to play but offers some game items for purchase with real money.<br/><br/>Terms of Service: http://pikpok.com/terms-of-use/<br/><br/>Monthly subscription for 1 Month with great daily in-game benefits. This subscription will auto-renew every month and must be cancelled at least 24 hours before renewal.<br/><br/>Monthly subscription will renew automatically unless auto-renew is turned off at least 24-hours before the end of the current period. Payment will be charged to iTunes Account at confirmation of purchase. Account will be charged for renewal within 24-hours prior to the end of the current period. Renewal costs 9.99 USD/month (or local equivalent).<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a monthly subscription, where applicable.", "metacritic": null, "released": "2018-09-06", "tba": false, "updated": "2019-07-29T15:05:52", "background_image": "https://media.rawg.io/media/screenshots/d5d/d5da67a1f41d64d9360428dfd25a90d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PikPok"], "genres": ["Strategy", "Simulation"], "publishers": ["Prodigy Design Limited T/A Sidhe Interactive"], "esrb_rating": "Everyone 10+"}