{"id": 354153, "slug": "taki", "name": "TAKI", "name_original": "TAKI", "description": "A free card game that combines an equal share of luck and strategy, which is the secret for its perfect game flow.<br/><br/>Action cards, exciting rules and Super TAKI cards will hook you right from the start and satisfy you like no other game.The new version includes \"the best of 5\" tournament, and saving personal record.<br/><br/>עכשיו טאקי  עם חברים!<br/>שחקו טורניר הטוב מחמש על נקודות, או תקתקו משחק מהיר מול אחד, שניים או  שלושה יריבים. <br/>חוקי המשחק<br/>מטרת השחקן היא להיפטר ראשון מכל הקלפים שברשותו.<br/>הקלף במרכז המסך הוא \"הקלף המוביל\". כל שחקן בתורו רשאי להניח עליו קלף אחד (ולעתים יותר) מהקלפים שלו, אם יש ביניהם קלף מתאים (מאותו צבע, מספר או צורה כמו בקלף המוביל) או קלף פקודה לשינוי צבע. אחרת, עליו לקחת קלף מהקופה. המשחק מסתיים כאשר אחד השחקנים נפטר מכל קלפיו ומנצח.<br/>כל הקלפים שאינם קלפי מספר רגילים הם קלפי פקודה ושימוש נכון בהם הוא המפתח לניצחון.<br/>את הקלפים מניחים על ידי גרירה באמצעות האצבע של הקלף הרצוי לכוון מרכז השולחן.<br/>בהצלחה!<br/><br/>Subscription information:<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>- Account will be charged for renewal within 24 hours of the end of the current period, and the cost of the renewal will be provided.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- You can cancel your subscription by entering the following address: https://support.apple.com/en-us/HT202039<br/><br/>מידע על רכישת מנוי:<br/>- התשלום יחויב בחשבון המשתמש באייטונס.<br/>- לאחר אישור הרכישה המינוי יתחדש באופן אוטומטי אלא אם כן בוטל החידוש 24 שעות לפני סוף התקופה הנוכחית.<br/>- החשבון יחוייב 24 שעות לפני תום התקופה הנוכחית.<br/>- כל חלק שלא נעשה בו שימוש בתקופת הניסיון יחולט כאשר המשתמש ירכוש מנוי.<br/>- ניתן לנהל או לבטל את המינוי מתוך חשבון המשתמש מיד לאחר הרכישה. לינק https://support.apple.com/en-us/HT202039.<br/>תנאי שימוש ופרטיות:<br/>Privacy policy and terms of use:<br/>http://kinkajoo-apps.com/trivia-link-privacy-policy/", "metacritic": null, "released": "2019-05-30", "tba": false, "updated": "2019-07-29T15:27:55", "background_image": "https://media.rawg.io/media/screenshots/367/3678190df49430277da1f0bd2dbcd94b_xLnBXzd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kinkajoo"], "genres": ["Board Games", "Card"], "publishers": ["Kinkajoo"], "esrb_rating": "Everyone 10+"}