{"id": 354123, "slug": "jungle-kings-multiplayer", "name": "Jungle Kings - Multiplayer", "name_original": "Jungle Kings - Multiplayer", "description": "Challenge your friends and worldwide players in exciting match-3 multiplayer game!<br/><br/>Jungle Kings is a brain challenging game where you can play against real players in real time. <br/>Slide blocks into the game board to create a combo of three or more blocks to attack the opponent's animal, and block the opponent’s attacks to protect your animal.<br/><br/>Compete in 1-vs-1 matches in different arenas to earn Jungle Coins. In every competitive 1-vs-1 match you play, there’ll be Jungle Coins at stake – win the match and the coins are yours. You can use these coins to enter higher ranked arenas with bigger stakes, or to buy new animals and upgrades in the Animal Center Shop.<br/><br/>Features:<br/><br/>* First of its kind multiplayer 1-on-1 match-3 mobile game for FREE!<br/><br/>* Play with friends - Simply sign in with your Facebook account and you’ll be able to play against your friends. Challenge friends anytime, anywhere and show off your skills.<br/><br/>* Quick Match - Play against people from all over the world - and show them who's the boss!<br/><br/>* Animal center – Buy animals, accessories and enhancements.<br/><br/>* Daily Rewards - Spin and Win to earn free Jungle Coins!<br/><br/>* Level Up - Play matches to increase your ranking and get access to more exclusive match arenas, where you play against only the best players.<br/><br/>* A hugely addictive gameplay and intuitive puzzle for all ages.\u2028<br/><br/>* Fun to play, challenging to master.<br/><br/>* Strategy game that you can take you with you all day long.<br/><br/><br/>Jungle Kings is free to download and play, but it also allows you to purchase virtual items with real money inside the game. You can disable in-app purchases in your device’s settings.<br/>You may require an Internet connection to play Jungle Kings and access its social features. Jungle Kings may also contain advertising.<br/><br/>-------------------------------------------------------------------------<br/>Facebook: https://www.facebook.com/JungleKingsGame<br/>Support: JungleKingsGame@gmail.com<br/>-------------------------------------------------------------------------<br/><br/>Download now and start your fantastic match-3 mastering, Jungle Kings!", "metacritic": null, "released": "2016-11-04", "tba": false, "updated": "2019-07-29T15:11:29", "background_image": "https://media.rawg.io/media/screenshots/2ee/2eee36cb9d282007f44d4d7211fad15d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Comunix"], "genres": ["Strategy", "Puzzle"], "publishers": ["Comunix"], "esrb_rating": "Everyone 10+"}