{"id": 354286, "slug": "idle-ball-race", "name": "Idle Ball Race", "name_original": "Idle Ball Race", "description": "Race against a hundred marbles!<br/>Use your 4 special powers to lead your ball to the end-line<br/>Make money and get to the highest leagues<br/><br/>Will you be the first? Let the race begin<br/><br/><br/><br/><br/>AUTO RENEWABLE SUBSCRIPTION<br/><br/>Subscription options<br/><br/>In our game we have the following subscription options:<br/><br/>Weekly VIP Membership offers $3.99 weekly subscription after 3-day free trial for unlocking bonus features and removing all ads. Also, the subscription will provide 20 Gems on a daily basis.<br/><br/>Monthly VIP Membership offers $9.99 monthly subscription for unlocking bonus features and removing all ads. Also, the subscription will provide 20 Gems on a daily basis.<br/><br/>3Months VIP Membership offers $19.99 3-months subscription for unlocking bonus features and removing all ads. Also, the subscription will provide 20 Gems on a daily basis.<br/><br/>End of trial and subscription renewal<br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to Apple ID Account at the confirmation of purchase.<br/><br/>After the 3-days free trial the subscription automatically renews unless it is cancelled at least 24 hours before the end of the trial period.<br/><br/>Your Apple ID Account will be charged according to your plan for renewal within 24 hours prior to the end of the trial period.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase. <br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. <br/><br/>Cancelling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. <br/>Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. <br/>The current active subscription period cannot be cancelled. After your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at contact@madboxgames.io.", "metacritic": null, "released": "2019-01-19", "tba": false, "updated": "2019-07-29T16:51:33", "background_image": "https://media.rawg.io/media/screenshots/c24/c24f4f14335fbdd50da651e0aae638ce.jpg", "website": "http://madboxgames.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Madbox"], "genres": ["Strategy", "Racing"], "publishers": ["MADBOX"], "esrb_rating": "Teen"}