{"id": 354291, "slug": "seekers-notes-hidden-mystery", "name": "Seekers Notes: Hidden Mystery", "name_original": "Seekers Notes: Hidden Mystery", "description": "THE MOST BEAUTIFUL HIDDEN-OBJECT GAME!<br/><br/>Set off on an incredible journey to the cursed city of Darkwood! Its dark streets hold many secrets that will only reveal themselves to the chosen one, and it's you who are destined for the role. You are the Seeker, the owner of a powerful artifact—the Magical Map! It's your fate to save the city from the oppression of the Curse. Don't waste another minute—start your battle with evil right now!<br/><br/>What awaits you in Seekers Notes:<br/><br/>- Gorgeous graphics, striking characters, and picturesque locations<br/>- Free updates: new quests, fabulous locations, and unique prizes await you every month<br/>- An awesome plot and fascinating storylines with unexpected twists and turns<br/>- Spellbinding puzzles: Treasure Box, Haunted Lights, Mosaic, and Ancient Cards<br/>- More than 7,100 exciting quests<br/>- You can assemble over 890 amazing collections<br/>- Enchanting music that will plunge you into the mysterious atmosphere of the game<br/>- Craft unique items with the Fortune Teller, Blacksmith, and Inventor<br/>- Trade useful items with the residents of Darkwood<br/>- Banish dangerous monsters and placate magical creatures<br/>- Play with your friends!<br/>We're already 3 years old! Thank you for being with us!<br/>Seekers Notes is a free game, but some game elements can be purchased with real money. If you don't want to use in-app purchases, please disable them in your device's settings.<br/><br/>Subscription Options<br/>We have the following subscriptions in our game:<br/>- Double Energy Restoration (1 month) offers a monthly subscription for 14.99$ which makes your energy restore twice as fast;<br/>- Double Experience Month (1 month) offers a monthly subscription for 9.99$ which doubles your experience.<br/><br/>End of the trial period and subscription renewal<br/>- The price indicated is for United States customers. Pricing in other countries may vary and actual changes may be converted to your local currency depending on your country of residence.<br/>- Payment will be charged to your iTunes Account after confirmation of purchase.<br/>- Subscription automatically renews unless auto-renewal is turned off at least 24 hours before the end of the current period.<br/>- The account will be charged for renewal during the 24 hours before the end of the current period, and the amount charged will be the current cost of renewal.<br/>- Subscription may be managed by the user and auto-renewal may be turned off at any time in your iTunes Account Settings.<br/><br/>Canceling trial or subscription<br/>- You can turn off auto-renewal for subscriptions whenever you want through iTunes. Please see https://support.apple.com/HT202039.<br/>- When your current trial/subscription period expires, you will be unsubscribed.<br/>- The current active subscription period cannot be canceled.<br/>- When your subscription expires, you will no longer be able to use elements included in the Subscription Options.<br/><br/>Terms of Service: https://mytona.com/terms-of-service<br/>Privacy Policy: https://mytona.com/privacy-policy<br/><br/>Join us on social media and keep up with the news:<br/>https://www.facebook.com/SeekersNotes<br/>https://www.instagram.com/seekersnotes_official/<br/>https://twitter.com/SeekersNotes", "metacritic": null, "released": "2015-07-30", "tba": false, "updated": "2019-07-29T16:57:43", "background_image": "https://media.rawg.io/media/screenshots/166/166e0b3aa33a004793183d1b5d35db6b_JBJHw3E.jpg", "website": "http://www.mytona.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MyTona"], "genres": ["Adventure", "Puzzle"], "publishers": ["MyTona Pte"], "esrb_rating": "Everyone 10+"}