{"id": 354238, "slug": "puzzledom", "name": "Puzzledom", "name_original": "Puzzledom", "description": "A collection of the best and most addictive logic puzzles, with minimalist graphics and unique level design!<br/><br/>\"Puzzledom\" merges the best puzzles like Connect, Blocks, Rolling Ball and Escape, which are easy to learn and fun to master into one game collection.<br/>As a puzzle lover, you don't need to spend much time on searching new brain teasers any more. We will give you a ONE-STOP game experience from now on! <br/><br/>\"Puzzledom\" collection currently has:<br/>Connect <br/>Connect is a simple game involving connecting dots with the same color. When you draw the lines, please make sure the lines don't cross over each other. All the spaces should be filled. <br/><br/>Blocks<br/>Blocks is a classic puzzle that you need to fill the entire board with different shapes of blocks. Just drag the right block, move it onto the board and match the right place. It's a perfect logic game for brain training.<br/><br/>Rolling Ball <br/>Rolling Ball is a path guiding game that you need to slide the blocks to create a channel, making the white ball move from the starting point to the end point.<br/><br/>Escape <br/>Escape is a well-known game, called Chinese Sliding-Block. The goal is to move the red block to the exit. This game will test your observation skills.<br/><br/>More puzzles coming soon<br/>We are now working hard on developing new challenging puzzle games. Puzzledom will be the king of brain teasers!<br/><br/><br/>FEATURES<br/>• Tons of manually designed levels <br/>Over 8000 free levels inside and more funny levels are under development. <br/><br/>• Easy but funny game play<br/>We only put the best puzzles inside, which will make you cannot stop once you start playing.<br/><br/>• Minimalist graphics<br/>The art design is simple but beautiful. It's a game for all ages.<br/><br/>• Playing the game with your friends<br/>We will support online rank list soon! You can challenge your friends by achievements and the leader board. <br/><br/>• No time limit<br/>Unlike Match 3 games, puzzledom does not have a time limit. You can play it anytime even without WIFI. You can use hints to unblock obstacles when you feel struggled in some levels.<br/><br/>Enjoy the game with your family ;) <br/>If you have any good ideas about Puzzledom, please send us an email in the game!<br/><br/>PUZZLEDOM UNLIMITED SUBSCRIPTION: <br/><br/>- You can subscribe for unlimited access to puzzledom content. <br/><br/>- The subscriptions are $7.99 weekly <br/><br/>- You'll be able to access unlimited new puzzle games for the duration of your subscription. <br/><br/>- Payment will be charged to iTunes Account at confirmation of purchase. <br/><br/>- Subscription automatically renews unless auto-renew is turned off at leat 24-hours before the end of the current period. <br/> <br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen subscription. <br/><br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. <br/><br/>- No cancelation of the current subscription is allowed during active subscription period. <br/><br/>- You can read privacy policy and terms of use at http://52.8.183.55/policy.html<br/><br/><br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that content. <br/><br/>*Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent of the subscription price in$USD.<br/><br/>Terms of Service and Privacy Policy http://52.8.183.55/policy.html<br/>Questions? Ask:help@metajoy.io", "metacritic": null, "released": "2017-08-08", "tba": false, "updated": "2022-11-03T18:40:33", "background_image": "https://media.rawg.io/media/screenshots/cd9/cd9680b85d90d1bfa3dc4c95e9437280.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["MetaJoy"], "genres": ["Board Games", "Puzzle"], "publishers": ["Metajoy"], "esrb_rating": "Everyone 10+"}