{"id": 354310, "slug": "uphill-rush-slide-jump", "name": "Uphill Rush: Slide Jump", "name_original": "Uphill Rush: Slide Jump", "description": "Launch your character into the air and try to bounce forever. Try this ultra fun and super simple game that will keep you hooked for hours.<br/><br/>Slide and jump as far as you can in the funniest water park you've ever seen.<br/><br/>Master your skills in this challenging and splashy game. Experience infinite fun with the simple tap and launch gameplay.<br/><br/>Equip your character with the awesome, inflatable watercraft of your choice and begin your mega jumping, endless bouncing, and ultra crazy adventure.<br/><br/>Aim high, jump far, and make a splash as you try to beat your best score and improve your skills while having mega fun!<br/><br/>This simple game will help you kill boredom and improve your aiming skills while having a blast!<br/>Don’t wait! Play it now for FREE!<br/>Fly down water slides as you explore coastal cities and other exciting locations. <br/><br/>Perform mega jumps and bounce forever in the splashiest game of them all.<br/><br/>Features:<br/>-\tExplore over a dozen awesome locations like the amusement park, Port City, Bay City, and the arctic area.<br/>-\tChoose one of many awesome, inflatable watercraft that you can customize while on your way to victory! <br/>-\tPick your vehicle from a variety of crazy watercraft including: spaceship, rocket, banana, boat, and many more!<br/>-\tCollect gems and upgrade your experience as you master the game.<br/>-\tDiscover the extra daily challenges, which include an ultra fun mini game.<br/><br/>Don’t wait! Play the ultra splashy game now for FREE. Slide fast, jump high, and bounce forever! Mega fun is just one tap away!<br/><br/><br/>Uphill Rush Slide Jump VIP subscriptions<br/><br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/><br/>- Subscription automatically renews for the same price and duration period as the original one week package unless auto-renew is turned off at least 24-hours before the end of the current period<br/><br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package weekly<br/><br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase<br/><br/>- No cancellation of the current subscription is allowed during active subscription period<br/><br/>- Please visit http://support.apple.com/kb/ht4098 for more information about subscriptions.<br/><br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period<br/><br/>- Subscription prices and duration: weekly $4.99, monthly $7.99<br/><br/> __ <br/><br/>* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD<br/><br/> __ <br/><br/>PRIVACY POLICY<br/><br/>http://www.spilgames.com/mobile-apps-privacy-policy/<br/><br/> __ <br/><br/>TERMS OF USE<br/><br/>http://www.spilgames.com/terms-of-use/", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2019-07-29T17:10:49", "background_image": "https://media.rawg.io/media/screenshots/b8e/b8ef1cff0f1ee3f60618f6f12c6ae0a2.jpg", "website": "http://www.spilgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SPIL GAMES"], "genres": ["Racing", "Casual"], "publishers": ["SPIL Games"], "esrb_rating": "Everyone 10+"}