{"id": 354300, "slug": "weed-inc-idle-tycoon", "name": "Weed Inc: Idle Tycoon", "name_original": "Weed Inc: Idle Tycoon", "description": "Grow your Weed Inc business in the best idle game! Collect and upgrade dozens of your favorite weed strains like Sour Diesel, Grand Daddy Purple, and Trainwreck to profit in this new strategic idle game. Manage every stage of production of marijuana, hemp, buds and the dankest strains from the grow room, processing room, and your storefront. Hire managers, upgrade your strains, and expand to new locations as you build your weed empire. <br/><br/>FEATURES<br/>● Manage your Dispensary, Processing, and Grow Rooms as you expand your business. <br/>● Earn crates to unlock rewards, collect powerful new strains, and upgrade existing ones.<br/>● Hire unique managers who give special limited time boosts and power-ups to your locations.<br/>● Expand to locations across the country in Los Angeles, Seattle, Denver, and New York City!  Canada too.<br/>● Build and upgrade your strain collection with dozens of your favorite Indica, Sativa, and Hybrid weed strains. <br/>● Renovate your locations to boost their income and attract bigger customers.<br/>● Play Limited Time Events &amp; Tournaments<br/>● Check in everyday for amazing rewards<br/><br/><br/>Join us online: <br/>* Facebook: https://www.facebook.com/WeedIncGame/<br/>* Instagram: weed_inc_game<br/>* Twitter: @Weed_Inc_Game (https://twitter.com/Weed_Inc_Game)<br/><br/>Please note Weed Inc is a free-to-play experience, but some game items are available for purchase using real money. A network connection is also required.<br/><br/>Got any problems or suggestions? <br/><br/>Feel free to send a message to <br/>support@metamoki.com", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-07-29T17:03:28", "background_image": "https://media.rawg.io/media/screenshots/5de/5de1a0603ad86b87887e09b26fe609d3.jpg", "website": "https://www.facebook.com/WeedIncGame/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Metamoki"], "genres": ["Strategy", "Simulation"], "publishers": ["Metamoki"], "esrb_rating": "Mature"}