{"id": 354362, "slug": "multicraft-build-and-survive", "name": "MultiCraft ― Build and Survive", "name_original": "MultiCraft ― Build and Survive", "description": "Introducing MultiCraft ― world of unlimited opportunities! The real Adventures are waiting for YOU here!<br/><br/>Build and Destroy Blocks. Get Resources and Create Various Tools, Blocks and Weapons with which you can Survive and build unique Buildings.<br/><br/>Choose your side in this world – a Builder (Creative mode ) or a Ruthless Hunter, who will do everything to survive (Survival mode)!<br/><br/>► Be careful, in this world not only peaceful Animals, but an awful Monsters too! Win a battle with them and you will get priceless resources!<br/>► Swim across the seas for new lands and resources – lands are unlimited. Exploration their!<br/>► If you decided to Survive – keep eye on hunger and fill out it in time! Search for food, grow plants and kill mobs for meat!<br/>► Built your shelter from the monsters and you will survive this night! They are coming for you… Zombies, Skeletons, Huge Spiders and other hostile mobs.<br/>► At any time you can fly to the skies with the mode “flight” or become fast as flash with the mode “acceleration”. Make game easy if you want.<br/><br/>In this game your actions are unlimited only by your imagination! The game does not require any skills - you can at all understand in the first minutes of the game. With MultiCraft you can spend good time everywhere and every time! And it’s totally FREE!<br/><br/>Do you want to play with your friends? Join one of the user servers (“Multi Player” tab). The game has a constantly updated list of various servers. You will definitely find one that you like. Also, in the near future we plan to launch a large number of MultiCraft servers.<br/><br/>In this game they are waiting for you:<br/>► Huge Spiders;<br/>► Insidious Skeletons;<br/>► Strong Zombies and other hostile mobs;<br/>► Red and Blue ore, mechanisms;<br/>► A realistic game process;<br/>► Cows, pigs, sheep and other peaceful mobs;<br/>► Chickens, that carry eggs;<br/>► Stable FPS and drawing card without lag;<br/>► High game optimization and the generation of the world for all modern devices;<br/>► A lot of different biomes and the unique topography;<br/>► A large number of different foods and plants;<br/>► Completely revised for easy management of the game;<br/>► Single player;<br/>► Multiplayer mode and accelerated flight.", "metacritic": null, "released": "2016-11-14", "tba": false, "updated": "2019-07-29T17:56:05", "background_image": "https://media.rawg.io/media/screenshots/6d1/6d19f11cbe62e9899f85920f562a2873.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Maksim Gamarnik"], "genres": ["Action", "Adventure"], "publishers": ["Maksim Gamarnik"], "esrb_rating": "Everyone 10+"}