{"id": 354331, "slug": "snakebusio", "name": "snakebus.io", "name_original": "snakebus.io", "description": "SnakeBus io — Plunge into the world of big buses, surround the city with your cars, become the longest bus on the map and defeat all rivals online!<br/><br/><br/>You get a mini-bus, you have a goal:<br/>Collect as many passengers as possible while improving your bus!<br/>Compete, because bus drivers are your competitors. They can cut, crash into you, from this you can break and start all over again! Be sure to get into the top 1! <br/>On the map there are bonuses (nitro and invisibility), thanks to which you can quickly and safely collect passengers, as well as easily remove your enemy.<br/><br/>Play against other people on the Internet! Can you become the longest and biggest bus?<br/><br/>In simple words - it's a snake on the bus, this has not happened.<br/>If your first car touches another player, you give the cars (points), if the cars are not enough - you are dead, the game is over. But if others bump into you, they will break, and you get cars and points!<br/><br/>In SnakeBus, you have a chance to win even if you are small in size. You can Dodge and be invulnerable to defeat them.<br/><br/>Do you like the classic game “Snake”? Wow! As with the classic Snake game that has been on all cell phones and computers for decades, you can play buses!<br/>This is a multiplayer game, it allows you to become a cool bus driver who needs to pick up all the passengers and increase their passenger seats. When you drive around a big city, picking up people - you will grow more and more!<br/>Do not forget to use nitro and invisibility, these bonuses are scattered on the city map.<br/><br/>We reinvented the wheel!? Do you remember how the game snake drove away sleep? Want to play again? This fun modified game will take time back to a time when the best games were simple but fun.This is a mixture of retro games and something new (modern models of buses in the game are present). Let the game long buses - will be your choice.<br/><br/>Move, avoid touching. Defeat other drivers. Let them crash. Collect their cars and grow yourself. Stay alive as much as possible!<br/>How long will it take before your back car becomes an obstacle for you? Take the challenge! Classic games have never been more fun!<br/><br/>Peculiar properties:<br/>- Online (online game).<br/>- Rating players around the world.<br/>- Modernization of buses.<br/>- Bonuses on the map (acceleration and invisibility)<br/>- Convenient control (various settings).<br/>- Easy to start.<br/><br/>Bus upgrade system:<br/>- First level, players initially get a simple model - up to 100 points, it is slow.<br/>- The second bus is the average, standard bus - up to 300 points, it is faster.<br/>- The third bus is an American bus - from 700 points, the maximum speed.<br/><br/>When you upgrade to a new bus all cars are reset to one, but the points remain.<br/><br/><br/>Go to the city and fight with other drivers in a fierce battle. Take all the passengers from other buses to win! Show who is the coolest driver in the city!<br/><br/>Download now and start driving the buses!<br/>Enjoy and good luck in achieving the results. Be in top!", "metacritic": null, "released": "2019-07-26", "tba": false, "updated": "2019-07-29T17:27:19", "background_image": "https://media.rawg.io/media/screenshots/364/364aeed6dc750df10dcb03bc5bd9edff_qmY1btD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ruslan Visaitov"], "genres": ["Racing", "Casual"], "publishers": ["Ruslan Visaitov"], "esrb_rating": "Everyone 10+"}