{"id": 354493, "slug": "dino-dig-grab-collect", "name": "Dino Dig - Grab & Collect", "name_original": "Dino Dig - Grab & Collect", "description": "A puzzle game like no other!<br/><br/>Blast to the past in Dino Dig – Pair &amp; Collect. Solve puzzle games in search of hidden eggs and treasures. Then grow your very own nursery full of cute baby dinos! <br/><br/>Solve Puzzles and dig to the bottom!<br/>Have a blast in this dinosaur game from the past. Snatch color bricks with your dinosaur claw. Stack the same four colors and watch them explode, but you only have a limited number of moves. Keep stacking to make it to the end of the puzzle before running out of turns. <br/>- Use the claw to grab a color<br/>- Drop the stack on at least four of the same color bricks then watch ‘em explode!<br/>- Break through to collect dino eggs, bonuses, and boosters<br/>- Blast your way through with cascading combos <br/>- Keep it up! Can you solve puzzles and make it to the end? <br/><br/>Keep Blasting for Boosters and Bonuses!<br/>Puzzle games hide more precious dino eggs, bonuses, and boosters. Use your dino claw to search for prizes hidden inside every pop game<br/>- Blast color bricks to find the hidden prizes and BONUSES<br/>- Break through and collect more dino eggs<br/>- Use your dino claw to snatch TREASURE CHESTS filled with GOLD COINS<br/>- Use gold coins to buy bonuses and hatch more adorable pet dinos.<br/>- Dig for bonus bombs and blast through to the end even faster<br/>- Earn rewards after completing challenging games<br/>- Each time you break the record, you get more bonuses!<br/><br/>Play Free Puzzles - Hatch Adorable Dinos of Your Very Own!<br/>As you solve your way through challenging puzzle games, break through to the bottom and dig for dino eggs. Collect as many dinosaurs as you can and watch them play together. You’ll have your own family of fossil friends!<br/><br/>- Dig through colored bricks to uncover dino eggs<br/>- Collect eggs to add to your nursery<br/>- Hatch eggs to get your own baby dino<br/>- Expand your collection of dinos to find rare breeds<br/>- Collect them all!", "metacritic": null, "released": "2019-06-18", "tba": false, "updated": "2019-07-29T19:22:59", "background_image": "https://media.rawg.io/media/screenshots/a83/a8379751b4adcced3ec2f1570824401d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hyper Mania"], "genres": ["Adventure", "Casual"], "publishers": ["HYPER MANIA"], "esrb_rating": "Everyone 10+"}