{"id": 354442, "slug": "11x11-soccer-manager", "name": "11x11: Soccer Manager", "name_original": "11x11: Soccer Manager", "description": "<p>Meet the new season of 11x11!<br />\nIt has never been this enjoyable to be a soccer team manager - amazing graphics in 3D, modern and convenient interface, unforgettable matches!<br />\nWe have kept everything that you have come to love the old version for - build your own city, buy soccer players on the transfer, train them and increase the level of your team. However, we haven’t forgotten to introduce new features: collect contracts, hire rare players, acquire the richest sponsors and lead your team into the best league.<br />\nThe game contains a Premium subscription, which gives some bonuses every day.<br />\nSubscription options<br />\nWe have the following subscriptions in our game:<br />\nVIP1 is a 7.49$ monthly subscription plan that offers more than 2,000 boosters, 100 legendary contracts, plus 2 packs with rare and unique players in total. These resources are split into daily rewards and are given out gradually throughout the month.<br />\nVIP2 is a 25$ monthly subscription plan that offers more than 4,000 boosters, 150 legendary contracts, plus 2 packs with unique and legendary players in total. These resources are split into daily rewards and are given out gradually throughout the month.<br />\nVIP3 is a 60$ monthly subscription plan that offers more than 5,000 boosters, 150 legendary contracts, plus 2 packs with 2 legendary players in total. These resources are split into daily rewards and are given out gradually throughout the month.<br />\nVIP4 is a 100$ monthly subscription plan that offers more than 7,000 boosters, 75 superior contracts, plus 2 packs with 2 legendary players in total. These resources are split into daily rewards and are given out gradually throughout the month.<br />\nEnd of subscription renewal<br />\n- This prices is established for the United States customers. Pricing in other countries may vary and actual changes may be converted to your local currency depending on the country of residence.<br />\n- Payment will be charged to your iTunes Account at information of purchase.<br />\n- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br />\n- The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of renewal.<br />\n- Subscription may be managed by the user and auto-renewal may be turned off by going to the user`s Account Settings after purchase.<br />\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br />\n- You can turn off the auto-renew for the subscription whenever you want through iTunes. Check https://support.apple.com/HT202039<br />\n- When your current subscription period expires, you will be unsubscribed.<br />\n- When your subscription expires, you will no longer be able to receive VIP daily rewards.<br />\nPrivacy Policy: http://nekki.com/privacy.php<br />\nTerms of Service: http://nekki.com/agreement.php</p>", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2022-12-30T20:59:41", "background_image": "https://media.rawg.io/media/screenshots/d71/d7131534fb90d1ee5b172491c38bea8b_LLBxOS9.jpg", "website": "http://11x11.nekki.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NEKKI"], "genres": ["Simulation", "Sports"], "publishers": ["Bonsai Games"], "esrb_rating": "Everyone 10+"}