{"id": 354494, "slug": "archery-go-bowarrow-king", "name": "Archery Go - Bow&Arrow King", "name_original": "Archery Go - Bow&Arrow King", "description": "Like Archery games? Wanna improve your archery skills without going outdoors?<br/>Play with Archery Go- archery games now, experience real 3D archery scene, super addictive archery game.<br/><br/>Feature:<br/>Choose you bow and arrow,<br/>Aim your target, and shoot your arrows to hit the target,<br/>Challenge classical PVE archery mode to exercise your bow and arrow control over your archery,<br/>Level up to Archery Adventure Mode, to enjoy super fun of this bow and arrow game,<br/>Join PVP 1-on-1 match mode, to play with archers worldwide or you can just play with friends face to face,<br/>Upgrade your Archery, bow and arrows to win every battle.<br/><br/>Learning which bow is right for you, and correctly choosing your first bow,<br/>Aim and shoot your arrows now towards your target and become the best archers now with Archery Go.<br/><br/>--Subscription Information--<br/><br/>Payment will be charged to your Apple ID account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period, and identify the cost of the renewal. You can manage and cancel your Subscriptions by going to your Account Settings on the App Store after purchase.<br/><br/><br/>*Title of Service: <br/>Archery Go VIP Subscription<br/><br/>*Length of subscription: <br/>1 week<br/>1 month<br/>1 year<br/>1 week with 3 days free trial<br/>(You’ll be able to remove interstitial ads , try all equipment  and get revival chance.Daily diamonds, gold coins , energy and one free diamond spin chance for the duration of your subscription.)<br/><br/>*Price of subscription and price per unit: <br/>You will be a VIP user with the auto-renewing subscription: <br/>1 week VIP: USD $7.99<br/>1 month VIP: USD $19.99<br/>1 year VIP: USD $99.99<br/>1 week VIP with 3 days free trial: USD $7.99 ( first 3 days free, then $7.99 per week ) <br/><br/>What unlock this feature?<br/>Auto-Renewable subscription can remove interstitial ads ,try all equipment  and get revival chance.Daily diamonds, gold coins, energy and one free diamond spin chance for the duration of your subscription.)<br/>Premium membership can give priority to new equipment.<br/>New equipment are constantly being updated.<br/><br/>Please read below about the auto-renewing subscription nature of this product before purchasing it: <br/>*Offer limited to one 3 days trial per user. After the first 3 days, subscription renews automatically unless canceled before the end of the 3 days trial. Subscription may be canceled at anytime within the iTunes and App store Apple ID Settings. All prices include applicable local sales taxes. <br/>*Payment will be charged to iTunes Account at confirmation of purchase. <br/>*Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. <br/>*Account will be charged USD $7.99 for 1 week VIP, USD $19.99 for 1 month VIP, USD $99.99 for 1 year VIP, USD $7.99 for 1 week VIP with 3 days free trial renewal within 24-hours prior to the end of the current period. <br/>*Account will be charged for renewal within 24 hours prior to the end of the current period, and identify the cost of the renewal. <br/>*Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. <br/>*No cancellation of the current subscription is allowed during active subscription period. <br/>*Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication. <br/><br/>Please access our Terms of Use at:<br/>https://sites.google.com/view/archerygoeula/<br/>Please access our Privacy Policy at:<br/>https://sites.google.com/view/archerygoprivacy/", "metacritic": null, "released": "2019-05-28", "tba": false, "updated": "2019-07-29T19:24:04", "background_image": "https://media.rawg.io/media/screenshots/8ed/8edf6aede2b74697f2748cc760c98294.jpg", "website": "https://www.facebook.com/ArcheryChamp-274555046523822/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SOLO X"], "genres": ["Action", "Sports"], "publishers": ["Solo X Technology"], "esrb_rating": "Teen"}