{"id": 354434, "slug": "bowman-2-stick-bowmaster-game", "name": "Bowman 2: Stick Bowmaster Game", "name_original": "Bowman 2: Stick Bowmaster Game", "description": "Bowman is a highly addictive classical game. Even if you've never heard of it before, play it just once and you'll be hooked.<br/><br/>The object of the game is to shoot arrows at your opponent and kill them before they kill you. It's a battle against your opponent to see who can accurately judge the angle and strength of the shot to make the arrow land on your opponents body.<br/><br/>A head shot inflicts the most damage while a shot in the chest takes second place. Everywhere else on the opponents body inflicts less damage.<br/><br/>To shoot your bow, simply drag your finger across the screen and you'll be presented with a trajectory plus angle and strength (power) information. Release your finger to release the bow.<br/><br/>You can play Bowman against an iOS device or against a friend.<br/><br/>To make it even more entertaining, we have also included a bird shooting game. You'll have to shoot as many birds as you can within 1 minute and then let your friend try the same. Hopefully, you will have shot more birds than your friend.<br/><br/>It has many options like windy mode, disabled angle and wall block mode which you can turn on or off depending on how challenging you want it to be.<br/><br/>Thousands and thousands of people play Bowman online every day and now you can enjoy a better version of it on the iOS devices. It really is highly addictive.", "metacritic": null, "released": "2015-10-30", "tba": false, "updated": "2019-07-29T18:41:09", "background_image": "https://media.rawg.io/media/screenshots/fac/faca00045f4d2a5e1ab364cb85eef8c3_odnx8Gn.jpg", "website": "http://dappsdapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Metin Yucel"], "genres": ["Action", "Sports"], "publishers": ["Metin Yucel"], "esrb_rating": "Everyone 10+"}