{"id": 354422, "slug": "bubble-chef-cooking-game", "name": "Bubble Chef - Cooking Game", "name_original": "Bubble Chef - Cooking Game", "description": "Best pop bubble shooter game! The first VISUAL 3D bubble shooter game: watch as the balls bounce down the board! Aim and blast bubbles to unlock ingredients and travel the world cooking delicious dishes in exotic destinations. <br/><br/>Where will you go? From Japan to Paris, Spain to China and back to Italy - there are so many amazing culinary destinations to travel to. Roll sushi, boil pasta, and carefully put together sweet macaroons. <br/><br/>You can even unlock recipes to try at home in your very own kitchen! <br/><br/>Get lost in the world of Bubble Chef. Addictive gameplay, an engaging storyline and delicious food. <br/><br/>GAME FEATURES:<br/><br/>FULLY 3D VISUALS: Watch as the bubbles bounce off the board as you aim, shoot and unlock them<br/>Rescue ingredients: Shoot bubbles to unlock special ingredients and create dishes<br/>Travel the world: Visit new destinations and create local meals: from sushi in Japan to pizza in Rome<br/>Cook at home: Unlock REAL RECIPES that you can recreate at home! <br/>Engaging storyline: Join our top chefs in an exciting worldwide adventure <br/><br/>While Bubble Chef is free to play and enjoy, some in-game items and functions can be can be purchased for real money. If you don't want this option enabled, please disable in-app purchases.<br/><br/>Developer info: Genera Games is one of the top puzzle game creators in the world! We’re the studio behind two of the most popular puzzle games for mobile: Frozen Free Fall and Frozen Free Fall: Icy Shot; another bubble shooter game.", "metacritic": null, "released": "2019-05-24", "tba": false, "updated": "2019-07-29T18:30:08", "background_image": "https://media.rawg.io/media/screenshots/4d5/4d5dc31cc20458abe29c99b8e54ec2b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Genera Games"], "genres": ["Simulation", "Puzzle"], "publishers": ["Genera Games"], "esrb_rating": "Everyone 10+"}