{"id": 354497, "slug": "garena-speed-drifters", "name": "Garena Speed Drifters", "name_original": "Garena Speed Drifters", "description": "Speed Drifters: ¡Derrapa al máximo!<br/><br/>¡Derrapa hacia la victoria en tres minutos! Ajusta tu cinturón de seguridad y busca a tus amigos para correr juntos en múltiples modos de juego. ¡Compite donde sea, cuando sea y contra quien sea! Ven y prueba Speed Drifters.<br/><br/>Modo objeto - ¡Usa una amplia gama de objetos para sabotear a tus oponentes y alcanzar la meta! Disponible en solitario y en equipo, así que llama a qien quieras para agruparse y protegerse mutuamente con los objetos y vivir la mejor experiencia posible en una carrera.<br/><br/>Modo velocidad - ¡Demuestra que eres el mejor piloto en la pista! Derrapa con precisión y usa tus Potenciadores con sabiduría para ser el primero en cruzar la meta. Un modo clásico que todos pueden disfrutar.<br/><br/>Modo clasificatorio - ¿Eres el próximo Dios legendario de las carreras? Enfréntate a pilotos de tu nivel y sube de clasificación. Pule cada detalle de tus habilidades para se el mejor a nivel internacional.<br/><br/>Pero no todo es competir, también puedes:<br/><br/>No perder el estilo - ¡Más de 100 tipos de prendas están disponibles para vestirte como lo desees! Puedes usar un atuendo elegante y ser la persona más guapa de la carrera, o cargar con una espada para imponer respeto.<br/><br/>Conducir el auto de tus sueños - ¡Hay más de 30 modelos para elegir! Busca el auto que más se adecue a tu estilo de juego y mejóralo hasta ser inalcanzable.<br/><br/>Descansar un poco - ¿Cansado de la acción? Socializa en el Área de descanso, donde encontrarás amigos y minijuegos. Explora el mapa, que tal vez podrías encontrar una ballena.<br/><br/>Conocer a tu otra mitad - Forma una pareja con tu ser amado o una persona que se haya vuelto cercana a ti en el juego. Si todo sale bien, podrías pensar en darle un anillo.<br/><br/>Escuchar la mejor música - Explora una gran selección en nuestro reproductor interno.<br/><br/>Formar un club - Recluta a tus amigos, entrenen juntos y vuélvanse el club número uno a nivel regional.<br/><br/>Página web oficial: http://speed.garena.com/<br/><br/>¡Síguenos en redes sociales!<br/>Facebook: https://www.facebook.com/SpeedDriftersLatino<br/>Instagram: https://www.instagram.com/speeddrifterslatam/<br/>Twitter: https://twitter.com/SpeedLatino<br/>Youtube: https://www.youtube.com/channel/UC2BwsG1qKMUH2sJpqMSnULQ", "metacritic": null, "released": "2019-07-19", "tba": false, "updated": "2019-07-29T19:25:08", "background_image": "https://media.rawg.io/media/screenshots/cc3/cc3b6cd8a880191153e01c61227604b3_VIkJHg5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GARENA INTERNATIONAL I"], "genres": ["Racing"], "publishers": ["GARENA INTERNATIONAL I PRIVATE"], "esrb_rating": "Teen"}