{"id": 354459, "slug": "war-robots-multiplayer-battles", "name": "War Robots Multiplayer Battles", "name_original": "War Robots Multiplayer Battles", "description": "Great to see you, Commander!<br/>War Robots is the biggest shooter game about giant robots that fits into your pocket. Join epic PvP battles against rivals from all over the world and show them who’s the smartest, fastest, toughest pilot around! Prepare for surprise attacks, intricate tactical maneuvers and other tricks up enemies’ sleeves. Destroy! Capture! Upgrade! Become stronger — and prove yourself as the best mech commander in the War Robots online universe!<br/><br/>MAIN FEATURES<br/>- Choose your fighter. Over 50 robots with unique designs and powers let you find a style to call your own.<br/>- Play how you want. Want to crush and destroy? To save and protect? Or just annoy the hell out of your enemies? You can do it all with the massive selection of weapons, including ballistic missiles, plasma cannons, and giant shotguns!<br/>- Customize. Each robot can be fitted with weapons and modules of your choice. Find your favorite combo and show everyone what you’ve got!<br/>- Battle together in multiplayer. Team up with other people! Join a powerful clan to find trusty partners (and friends!), or even start your own!<br/>- Battle on your own. Prefer playing solo? Lone wolves can express themselves in special modes like Arena or Free-for-All!<br/>- Explore the lore. The War Robots world grows and expands with every update, and the ever-growing community is always ready to help you.<br/><br/>Looking for more action?<br/>Check out the latest news on Facebook: https://www.facebook.com/warrobots/<br/>…or Twitter: https://twitter.com/WWR_by_Pixonic<br/> <br/>Watch War Robots TV on YouTube: https://www.youtube.com/user/WALKINGWARROBOTS<br/> <br/>Hop on Reddit for in-depth discussions: https://www.reddit.com/r/walkingwarrobots/<br/> <br/>And visit our official website for articles, patch notes and development stories: https://warrobots.com<br/> <br/>Note: War Robots requires a stable internet connection for the best gameplay experience.<br/>Good hunting, Commander!", "metacritic": null, "released": "2014-04-15", "tba": false, "updated": "2019-07-29T19:00:58", "background_image": "https://media.rawg.io/media/screenshots/6cb/6cb3c2c5bfb7698263864bf42cfac220_SvFc83Z.jpg", "website": "http://pixonic.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixonic Games"], "genres": ["Action", "Casual"], "publishers": ["PIXONIC GAMES"], "esrb_rating": "Teen"}