{"id": 354448, "slug": "card-heroes-fantasy-ccg-duel", "name": "Card Heroes: Fantasy CCG Duel", "name_original": "Card Heroes: Fantasy CCG Duel", "description": "Collect your own collection of card heroes and fight with players around the world in the new collectible card game Card Heroes!<br/>In the fast turn-based strategic battles you will be helped by the unique skills of your cards, you will deal crushing blows and strike the enemy with spells and magic to win. Whether you are a novice or a skillful strategist, you will easily master the game, feel its depth and excitement, and beautiful graphics and special effects will not leave you indifferent. The sharpened balance of the game will give you a thrill from fights with real rivals.<br/><br/>SEND TO THE ADVENTURE! The game begins with a fascinating journey in which you release the captured lands from enemies that keep the secrets of the ancient scrolls. The plot tasks will help you quickly learn, and in return you will get new cards from chests and powerful artifacts.<br/><br/>COLLECT YOUR PERSON. Battles accumulated in battle will replenish your collection, which will grow with your skill. Develop your strategy, collect a deck that you like, and forward to victory!<br/>Each card has three parameters:<br/>- Health;<br/>- Unique ability;<br/>- Attack.<br/><br/>THE LEGENDARY ARENA. Participate in online battles in the arena against real players, get rewards for reaching new leagues and get to the list of the best.<br/><br/>TOURNAMENT OF GLORY. A weekly global event will give you emotions and a new gaming experience, because each time the rules change a little. Think of the right strategy, take the prize place and everyone will know about it!<br/><br/>CLAN. You can create your own clan or join existing clans. The clan is a kind of castle with its buildings, improvements and bonuses. The citadel, the treasury, the building of the brotherhood of glory, the source of wisdom, the ancient altar and the silver mine are accessible to construction. Do the tasks with the clan of the clan and get a clan chest with bonuses to the level of cards. Collect the best heroes who, with the help of sword and magic, will lead your clan to victory!<br/><br/>CHAMPIONSHIP. Every week there is a full-scale battle in which the best players of the server are determined, among all countries. The best players get great prizes, for example +1 level to any card from your deck.<br/><br/>Honor skill, use different tactics, collect an epic deck of cards and who knows, maybe you will become a Legend?<br/><br/>HEROES / CARDS:<br/>- BLACKBERRY - ability to reduce enemy attack<br/>- TITAN - every new round increases its attack and health parameters<br/>- PHOENIX - after death, 1 time rebounds in the next round<br/>- ENGINEER - at death, inflicts damage on all enemies<br/>- ASSASSIN - in the first round the damage was doubled<br/>- Vampire - restores his health when attacking the heroes of the enemy<br/>- ASP - inflicts non-healed damage to enemy cards, poisonous attack<br/>- SHADOW - damage from long range attacks reduced by half<br/>- MAG - attacks any 2 targets<br/>- ANGEL - resurrects an ally with 50% health and dies<br/>- PALADIN - heals 1 ally and has good armor<br/>- HEALER - heals 2 allies;<br/>- DRUID - heals 3 allies;<br/>- HOLY - sacrifices himself, increasing ally's health<br/>- DOCTOR - the most effective treatment of 1 ally<br/>- Shaman - attacks anyone in his line, passively heals allies<br/>- HUNTER - attacking himself or next<br/>Collect your best deck in CCI / CCG and hit the top!<br/><br/> Install and play for free right now! <br/><br/>Features:<br/>* This is a collectible card game CCG / TCG, with elements of RPG and strategy<br/>* Fast card battles lasts only 2-3 mins<br/>* Languages: English, German, French, Italian, Spanish, Russian, Polish, Portuguese<br/>* The game takes place online, so you need an Internet connection to play with your friends<br/>* Having problems? Write about it in the Help section of our in-game forum and we’ll make sure to help you<br/>* We recommend 1GB or more of RAM and a CPU of at least 1.2GHz<br/>* Requires less than 1GB of memory on your device.<br/>* Facebook: https://www.facebook.com/CardHeroesOfficial", "metacritic": null, "released": "2017-10-19", "tba": false, "updated": "2022-11-02T19:12:58", "background_image": "https://media.rawg.io/media/screenshots/c54/c5491c17aa1bfa0d87da93eaeda81bfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Skytec Games"], "genres": ["Strategy", "Card"], "publishers": ["SKYTEC GAMES"], "esrb_rating": "Everyone 10+"}