{"id": 354583, "slug": "astrotactics", "name": "Astrotactics", "name_original": "Astrotactics", "description": "Meet Astrotactics - a new exciting PvP collectible card game. You will meet new heroes and epic battles with other players.<br/><br/>The history of Astrotactics takes its origin from the Ancients, who, according to legends, played it when there were no photon engines or galactic journeys. Nobody saw the Home World of the Ancients. Often, many people say that they were gods who created the stars.<br/><br/>Astrotactics - a dynamic game that on the fields of the card battle will open you the world of full-scale space wars and give a chance to touch the legends of the Ancients.<br/><br/>Astrotactics is an exciting card strategy where your knowledge and skills allow you to collect the most powerful deck in the Universe. Challenge the best players in the galaxy!<br/><br/>You will have at your disposal modern weapons of six basic races: cruising ships, combat robots, field doctors, secret traps, mutants and many other surprises.<br/><br/>Play with friends and discover new races. Follow the trail of the Ancients and try collect all their cards.<br/><br/>Improve your cards with gems and get real power!<br/><br/>Your victory is your tactic!<br/><br/>Game features:<br/><br/>* 6 unique heroes with their own battle strategy. Fast rush mutants or sure shot of heavy artillery.<br/><br/>* 6 neutral races whose cards can be played by any hero. Slugs are so cute, aren't they?<br/><br/>* Legendary cards of the Ancients, who are able to turn the outcome of the battle. Try to collect the entire deck!<br/><br/>* Rare gems that can be inserted into cards and improve their characteristics: rubies, emeralds, amethysts.<br/><br/>* Ranking of players with prizes in each season.<br/><br/>* Online game with other players. Invite friends and play with them.<br/><br/>Astrotactics is absolutely free to play. The game requires an internet connection and a device not younger than iPhone 5.", "metacritic": null, "released": "2018-11-22", "tba": false, "updated": "2019-07-29T20:23:22", "background_image": "https://media.rawg.io/media/screenshots/934/934efcb1c6f5aae1ca712c245cfd536e_Y1WgKEE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ice Storm"], "genres": ["Card"], "publishers": ["ASG, OOO"], "esrb_rating": "Teen"}