{"id": 3545, "slug": "lone-survivor-the-directors-cut", "name": "Lone Survivor: The Director's Cut", "name_original": "Lone Survivor: The Director's Cut", "description": "<p>Lone Survivor: The Director&#39;s Cut is a version of the game Lone Survivor, released as an addition to the game Lone Survivor.</p>\n<p>The hero is a person who turned out to be isolated from other people and therefore did not become infected with a virus that turned the remaining people into aggressive mutants.<br />\nThe hero leaves his apartment to explore neighboring apartments in search of food and other survivors. The hope to find other survivors is fueled by the messages found by the hero, which say that somewhere these survivors still exist.</p>\n<p>Mirrors serve as portals for getting into the apartment of the survivor and back. This apartment is a place where you can stay safe and sleep - it will allow the hero to keep mental health, otherwise he runs the risk of going insane.<br />\nDuring sleep, the hero comes to dreams, and sometimes hallucinations. Their content depends on the type of sleeping pills that the hero takes. Hallucinations can visit the hero regardless of sleep and cheerfulness. Because of this, the same rooms can look quite differently during visits at different times. The hero (and the player), in general, quickly realize that with the adequacy of the perception of the hero something is very wrong.<br />\nA flashlight helps to move forward, and mutants make it difficult to advance. They can be killed, but you can pass unnoticed by them. To kill mutants, the hero uses weapons.</p>\n<p>Sometimes progress is impossible without a special things that must be found.<br />\nDepending on the choices and actions of the player, you can end the game with five different endings.</p>", "metacritic": 81, "released": "2012-04-23", "tba": false, "updated": "2023-06-29T20:46:48", "background_image": "https://media.rawg.io/media/screenshots/ace/aceefab20a4040eb9b55e2cd9ea3948a.jpg", "website": "http://www.lonesurvivor.co.uk", "rating": 3.14, "rating_top": 4, "added_by_status": {"yet": 137, "owned": 1504, "beaten": 39, "toplay": 28, "dropped": 60, "playing": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 101, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 101, "platforms": ["Wii U", "PlayStation 4", "PlayStation 3", "PS Vita", "PC", "macOS"], "developers": ["Curve Digital", "Jasper Byrne", "Superflat Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Curve Digital", "Superflat Games"], "esrb_rating": "Mature"}