{"id": 354549, "slug": "drag-battle", "name": "Drag Battle", "name_original": "Drag Battle", "description": "Upgrade your cars, enable new skills, use your own drafts to create new parts, apply them on your cars, and win rivals!<br/><br/>STYLING<br/>Styling features allow you to change the look and feel of your car, from headlights to body kits. A wide selection of color and coloring types.<br/><br/>DRIVER'S SKILLS<br/>Upgrade your driver's level by learning new skills. There are dozens of new abilities and it's up to you to decide what your build is going to be like.<br/><br/>TUNING<br/>You are sure to love our non-linear car upgrade model. Hundreds of spare parts are waiting for your tweaks in the game. Don't have the right one? Win them in races or use your own drafts to create parts to your liking.<br/><br/>DRIVING PHYSICS<br/>It's a really true-to-life racing game. Aerodynamics, tyre composition, weight distribution, power-to-weight ratio. Every detail matters!<br/><br/>Splendid scenery, lots of bosses and competitions, chapmpionships and free races. Daily quests, achievements and leaderboards. Just what you like most. See you on the race track!<br/><br/>SUBSCRIPTION PRICING AND TERMS <br/><br/>Subscription options <br/><br/>In our game we have the following subscription options: <br/><br/>Unlimited fuel offers a weekly subscription for $3.99 after 3-day free trial. You can play the game without fuel limits.<br/><br/>End of trial period and subscription renewal <br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence. <br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase. <br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. <br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. <br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase. <br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. <br/><br/>Canceling trial period or subscription <br/><br/>You can turn off the auto-renew for the subscription whenever you want in the settings if your iTunes account. Check https://support.apple.com/HT202039. <br/><br/>When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option. <br/><br/>EULA Link: http://icestormgames.com/terms-of-service<br/>Privacy policy: http://icestormgames.com/privacy-policy<br/><br/>For more information about the developer, you can get the following links:<br/>Official website Ice Storm Games: http://www.icestormgames.com<br/>Official Twitter Ice Storm Games: https://twitter.com/IceStormGame<br/>Official FB page Ice Storm Games: https://www.facebook.com/icestormgames/<br/>Official YouTube canal Ice Storm Games: https://www.youtube.com/IceStormGames", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2019-07-31T05:48:06", "background_image": "https://media.rawg.io/media/screenshots/9a1/9a1ef6bbc997a194291e39fcb8417284.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Ice Storm"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["ASG, OOO"], "esrb_rating": null}