{"id": 354506, "slug": "heroes-of-destiny-fantasy-rpg", "name": "Heroes of Destiny: Fantasy RPG", "name_original": "Heroes of Destiny: Fantasy RPG", "description": "Master a team of heroes in a fantasy Action RPG. Choose a team of four, set up your gear, explore diverse regions, and win through series of intense battles!<br/><br/>A mysterious evil known as the Darkness has invaded the Kingdom of Lerona and beyond. It corrupts everything on its way unleashing chaos and wreaking havoc on a recently peaceful land. <br/>Assemble your group of faithful heroes – champions to battle the hordes of crazed, blood-thirsty monsters that terrorize the kingdom. Banish the beasts with swords, arrows and powerful magic.<br/>Take the battle to the Nether where Darkness lurks. Join the fight, earn epic loot and guide your own Heroes of Destiny to victory!<br/>INTENSE RPG ACTION<br/>● Control a team of up to 4 heroes with simple, intuitive touch controls.<br/>● Real-time action RPG gameplay: dozens of skills to inflict damage to your foes and protect or heal your heroes.<br/>● Weekly events with awesome rewards. Slay innumerable hordes of monsters and clear deepest dungeons to get unique items that change your gameplay experience drastically.<br/>HUGE WORLD OPEN FOR YOU TO EXPLORE<br/>● Awesome characters and environments – battle monsters in richly detailed outdoor, dungeon, and city environments.<br/>● Travel the vast world of mountains, forests, big cities and small hamlets.<br/>ROLE-PLAYING AT ITS BEST<br/>● Mages, Rangers, Knights and Healers: dozens of unique characters with unique abilities.<br/>● Hundreds of different gear types to customize your heroes and improve their combat stats.<br/>● Beat the darkest dungeons, kill powerful bosses, and earn hoards of epic treasures!<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- For information about how MY.COM collects and uses your data, please read our privacy policy at: https://legal.my.com/us/games/mobile_privacy/<br/>- If you have a problem with this game, please use the game’s “Help” feature.<br/><br/>VIP is a weekly, monthly or half-yearly service that allows you to get double coins and gems earnings from missions, double event tokens from event missions, double income from mines, double rewards from video offers, double upgrade rate for runic items, extra 20% of XP from missions, additional 20% chance of successful equipment upgrade, grants one free Mystery Chest every day and allows to reset heroes’ skill points for free. VIP costs 1.99 USD/week, 4.99 USD/month, 14.99 USD/6 months (or local equivalent) and will be charged on your iTunes Account after purchase and when the subscription renews monthly.<br/><br/>VIP lite is a weekly service that allows you to get double income from mines, double rewards from video offers, and extra 20% of XP from missions. VIP lite costs 0.99 USD/week (or local equivalent) and will be charged on your iTunes Account after purchase and when the subscription renews monthly.<br/> <br/>Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above.<br/> <br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period.", "metacritic": null, "released": "2018-02-13", "tba": false, "updated": "2019-07-29T19:28:52", "background_image": "https://media.rawg.io/media/screenshots/7b1/7b136aae9f3cb0b6ee4457e5df6e41af_x5bWaQ8.jpg", "website": "https://www.facebook.com/TheHeroesOfDestiny/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MY COM"], "genres": ["Action", "RPG"], "publishers": ["My.Com"], "esrb_rating": "Everyone 10+"}