{"id": 354587, "slug": "rolling-souls", "name": "Rolling Souls", "name_original": "Rolling Souls", "description": "Welcome to the unique world of Rolling Souls! This unique world is not similar to our usual one, called Earth, everything is based on circular movements. The hero and various objects are tied to a circle.<br/><br/>The goal of the game - to collect all the \"fragments of souls\" by the hero, who look like brilliant crystals, and are located in circles (in orbits), sometimes rotate in orbit. But be careful and avoid different dangers on the way!<br/><br/>How to play:<br/>To complete a level, you need to get into the green circle. And in order to make it available, you need to collect all the crystals (precious stones) at a level, with each crystal assembled, the green circle increases in size. Just as the player collects all the gems, the circle becomes the optimal size and can be reached.<br/><br/>Game features:<br/>- simple control with one finger; <br/>- three interesting worlds, distinguished by colors, characters, crystals;<br/>- the game is suitable for the whole family: our game is fun to play for both children and adults;<br/>- amazing animation and game graphics inside;<br/>- fun and relaxing music; <br/>- the game is in the category of free games.<br/><br/>Download unique circular wonder puzzles and enjoy!<br/><br/>For more information about the developer, you can get the following links:<br/>Official website Ice Storm Games: http://www.icestormgames.com<br/>Official Twitter Ice Storm Games: https://twitter.com/IceStormGame<br/>Official FB page Ice Storm Games: https://www.facebook.com/icestormgames/<br/>EULA Link: http://icestormgames.com/terms-of-service", "metacritic": null, "released": "2019-07-27", "tba": false, "updated": "2019-07-29T20:24:51", "background_image": "https://media.rawg.io/media/screenshots/b3e/b3e72a3e76823c126e89bae7b268a188.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ice Storm"], "genres": ["Casual", "Puzzle"], "publishers": ["ASG, OOO"], "esrb_rating": "Everyone 10+"}