{"id": 354584, "slug": "nitro-nation-drag-drift", "name": "Nitro Nation Drag & Drift", "name_original": "Nitro Nation Drag & Drift", "description": "DRIFT mode arrives to Nitro Nation! The most addictive Drag Racing game goes Sideways!<br/><br/>Race, mod, and tune dozens of real licensed cars. Start a team, invite your friends, win tournaments. Trade car parts with other racers in real time and build your dream car for both Drag and Drift races!<br/><br/>MEET THE DRIFT - The most advanced and realistic Drift mode comes to drag racing world!<br/>Cutting edge technology recreates the most precise and lifelike drift experience ever!<br/>New Suspension Upgrades to adjust your car specifically for drift. <br/>Intuitive, customizable controls will fit any racer.<br/>Never seen before unique tracks designed for drift.<br/><br/>LOTS OF CARS - Supercars and Exotics? Check. Tuners and Street racers? Check. Classic and Modern muscle? You bet! The best part? There's always more of them coming to the game!<br/>We know you love drag racing cars, we have more than 150 real cars from top international car brands like Audi, BMW, Chevrolet, Chrysler, Dodge, Ford, Jaguar, Mercedes-Benz, Nissan, Subaru, Volkswagen - and many more!<br/><br/>FAIR PLAY - no \"fuel\" that you have to wait for. Free of \"delivery time\" for cars or upgrades. Every vehicle is competitive and there are no \"premium\" upgrades. It's all about player driving skill and dedication.<br/><br/>REAL RACERS &amp; TEAMS – we’re all about multiplayer racing, there's always an online rival waiting for you on the street or the track. Start by racing any distance from 1/8 to a full mile, join or create a team, win tournaments with your crew, work your way up the leaderboard rankings, or test your nerves in wager races.<br/>Join a Live Multiplayer race, play in real time with friends and opponents all over the world! Compete in weekly Regional tournaments and work your way up through the Bronze and Silver divisions to the Worldwide Gold Elite Racing division!<br/><br/>EPIC UPGRADES - Upgrade and improve 33 unique car components with 3 tiers of aftermarket blueprints. Satisfy your need for speed and build a one-of-a-kind top drag racing machine. Ever dreamed of smoking an exotic sports car in your 800 HP Volkswagen Golf? Happens every day on the streets of NN.<br/><br/>PERSONAL TOUCH – customize your drag car with cool decals, arrange them the way you like. Choose your own custom paint color and finish for every bit. Add real Toyo Tires and aftermarket Tec Speedwheels rims, install aftermarket bumpers, skirts and spoilers to give your car a unique look!<br/><br/>CAR GEEKS WELCOME – powered by the CarX Physics Engine, we have the most realistic car physics on the market - everything works the way it does in real life. Tune your gears with detailed specs, dyno graphs, gearing charts and advanced race statistics will help you put your racing knowledge to use.<br/><br/><br/>AWESOME COMMUNITY<br/>It's all about the multiplayer experience! Connect with other car game fanatics, make some new friends and enjoy Nitro Nation together:<br/>Website: https://goo.gl/ZfcbGQ<br/>Facebook: https://goo.gl/BX4B3u<br/>Twitter: https://goo.gl/rLuvnk<br/>Instagram: https://goo.gl/77mK7N<br/>Discord: https://goo.gl/rqFfxP<br/>Reddit: https://goo.gl/14BBUC<br/><br/>TECHNICAL REQUIREMENTS<br/>The fully installed game requires at least (1.5 GB) of free space in your internal storage<br/>Device: 1 GB of Ram recommended<br/>Wifi: Internet connection is required to play<br/><br/>TROUBLESHOOTING<br/><br/>If you forgot your password, you can reset it using the corresponding option on the login screen. <br/>Check your e-mail for instructions. If you haven't set up a recovery e-mail, or if you forgot your username, please contact us at https://goo.gl/YG8xPP and tell us everything that can help identify your account.<br/><br/>If you have any questions, make sure you check out our FAQ at https://goo.gl/BT3Spx<br/>or contact the Support Team here: https://goo.gl/YG8xPP<br/><br/>Privacy Policy: http://creative-mobile.com/privacy-policy/<br/>Terms of Use: http://creative-mobile.com/terms-of-use/", "metacritic": null, "released": "2015-05-14", "tba": false, "updated": "2019-07-30T23:59:59", "background_image": "https://media.rawg.io/media/screenshots/707/707c2edb3814937b9d869df2da796562_z7AJPKm.jpg", "website": "http://www.nitronation.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Creative Mobile", "Creative Mobile Games"], "genres": ["Sports", "Racing"], "publishers": ["Osauhing Creative Mobile"], "esrb_rating": null}