{"id": 354514, "slug": "eden-obscura", "name": "Eden Obscura", "name_original": "Eden Obscura", "description": "Welcome to a paradise of sound and life.<br/>Journey to the garden of sound and life, a mysterious and artistic place full of the extraordinary!<br/><br/>Eden Obscura, named after the historic camera obscura, is quite literally \"light\" entertainment; it uses the camera in your phone to create interactive visual effects while you jump around the screen gathering pollen to grow surreal artistic plants and landscapes in a world that is like no other. Vibrant colors combined with eclectic and sophisticated electronic music take you on an artistic and mind expanding journey, while at the same time it is quite simply a ton of fun to play.<br/><br/>================================<br/><br/>・An artistic style simulating nature and plant life, imagined through the random flow of ink dropped down a sheet of paper.<br/><br/>・Unique garden visuals that use the camera to synthesize light and your surroundings in realtime.<br/><br/>・A unique action experience born from the symphony of grooving techno/house sound and stylistic visuals.<br/><br/>================================<br/><br/>■Nominated in 3 categories as the first Japanese title by IGF Awards hosted by Game Developer Conference and selected as the committee choice award by the Agency for Cultural Affairs in the Art Festival Entertainment category, the world-acclaimed PixelJunk Eden takes on new life on mobile as Eden Obscura!<br/><br/>■Eden Obscura is a reimagining of the award-winning game PixelJunk Eden for mobile devices, and is once again helmed by international multimedia artist Baiyon, previously featured in the magazine Game Developer as one of 50 people to watch in the games industry.<br/><br/>■Winner at Busan Indie Connect Festival 2017<br/><br/>================================<br/><br/>“Eden” is a collective world formed from an untold number of gardens. You control the “Grimps,” residents of this world, and travel through these gardens collecting “Spectra,” the source of life.<br/><br/>As you run, jump, and spin on silk string, the gardens grow around you providing new paths to adventure and you’ll find yourself deep in a realm of cutting-edge sound and amazing visuals.<br/><br/>================================<br/><br/>This app requires the camera feature to be turned on.", "metacritic": null, "released": "2018-05-19", "tba": false, "updated": "2019-07-29T19:31:46", "background_image": "https://media.rawg.io/media/screenshots/9dd/9ddad8fb95dafb04f75823670947b781.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Q-Games"], "genres": ["Action", "Simulation"], "publishers": ["Q-Games"], "esrb_rating": "Everyone 10+"}