{"id": 354651, "slug": "art-of-tactics-war-games", "name": "Art of Tactics: War Games", "name_original": "Art of Tactics: War Games", "description": "If you do things whole-heartedly, you can make it an art. If you can walk in battles and survive every time, you can make your own art of tactics.<br/>Here is the ideal place for players from all over the world to find an opponent, join in a quick battle and grind your art of tactics to master!<br/><br/>[What can you enjoy?]<br/>FUN!<br/><br/>One Sever the Same Battleground<br/>All players will enjoy Art of Tactics in one universal server. With different languages spoken and various flags waving, they come to seek a best Strategy PvP experience.<br/><br/>Rank-based Global Matching<br/>Everyone can find a formidable adversary at any time, the matching system can get you an exciting and fair competence from anywhere. Every win or lose counts in your ranking, the accurate matching will bring you the opponents that you are longing for.<br/><br/>Small Maps and Fast War<br/>Unlike the long campaigns in other games, Art of Tactics’ single unity only takes hours to days. You can walk into different maps according to your rank and face 5-15 other players, try as fast as you can to eliminate your enemies from the map!<br/><br/>Same Resources and Better Tactics<br/>Every player will start the battle with a main castle and the same amount of resources. Then it is the showtime of how tactics work: use speedup scrolls at right moment to confuse your enemy with your actual arriving time; array less powerful heroes with dodge buff to keep off invaders and buy you some time for sneak attack; deploy catapult troops to knock the gate faster before their reinforcement comes; ally with your neighbour to watch your back and save you more troops to launch attacks. Your flexible application of tactics can create hundreds of scenarios and you can develop you best steps to battle.<br/><br/>Survival Mode Guild War<br/>Random heroes, random gear, limited time with disappearing cities, welcome to the brand new guild war mode! In this mode you will get random heroes and gear from the cities you have occupied, but some of the cities will disappear after every phase ends. Your target is to kill all the other opponents from other guilds and survive in the last city after three phases.<br/><br/>Learn from Failure and Seize the Next Victory<br/>Win of lose means live or dead in most games, while failure leaves your efforts in vain. But in Art of Tactics, failure teaches you and enriches you with new knowledge, you will stand up from where you fall and seize the next victory!<br/><br/><br/>Backups<br/>To find more allies or solve your doubts, please follow our official Facebook page: https://www.facebook.com/artoftacticspoppace/<br/><br/>Welcome on board, Commander!", "metacritic": null, "released": "2019-07-01", "tba": false, "updated": "2019-07-29T21:16:36", "background_image": "https://media.rawg.io/media/screenshots/d94/d94a89047d2593b79cfcaf95d38c307f_TFYvpaN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zhang Fan"], "genres": ["RPG", "Strategy"], "publishers": ["Zhang Fan"], "esrb_rating": "Teen"}