{"id": 354694, "slug": "army-men-strike-toy-soldiers", "name": "Army Men Strike: Toy Soldiers", "name_original": "Army Men Strike: Toy Soldiers", "description": "Play like a kid, Fight like a man!<br/><br/>Army Men Strike is the strategy game that puts you in command of a miniature green army. Take toy soldiers through tower defense battles in your house, using real time strategy and tactics to win the little World War.<br/><br/>Time can change many things, but not your childhood. Travel back to your youth, gather your green army men and continue your unfinished adventure in this real time strategy game!<br/><br/>Lead your green army soldiers, remote-control planes, rubber ducks, transformers and many other toys in RTS combat. Defend your bedroom, hallway, living room and backyard against the invasion of the Evil Legion and put your strategy to the test! <br/><br/>Experience a great war game, combining real-time strategy, tower defense, resource control and simulation gaming into a single mobile experience! Recruit your toy soldiers, build fortifications and compete for territory and glory.<br/><br/>Your green army is waiting for you. It’s time to lead them to toy glory!<br/><br/>-Features- <br/><br/>Toy Tower Defense<br/>• Wage miniature RTS war in your home – every piece of houseware has a unique function in this toy world!<br/>• Build a headquarters in your bedroom, use the moneybox as your treasury, transport resources with your little train, and collect metal with magnets. <br/>• Fight enemies in the kitchen, the living room and even the bathroom! <br/>• Adventurous and playful battlefields make war interesting and fun! <br/><br/>Build Your Army <br/>• Recruit the elite toys as heroes to lead your army and let the toy war commence! <br/>• Use strategy to build the best army for each battlefield<br/>• Upgrade and promote your green army soldiers to flamethrowers, snipers, tanks, artillery units and many more!<br/> • Design and assemble strategic bombers to strike at your enemies!<br/><br/>Take Your Forces to War<br/>• Compete against other players to expand your territory, build greater power and earn prestige. <br/>• Gather resources to upgrade your army, guns and base.<br/>• Build your tower defense with fortifications to keep invaders at bay and increase your odds of survival. <br/><br/>Real Time Strategy<br/>• Choose your targets and plan your conquest.<br/>• Put your skills and strategy to the test against players around the world in RTS combat.<br/><br/>Test Your Strategy to Win<br/>• Patience and strategy are key to each battle. Build and deploy your troops wisely. • With a good strategy, you can defeat any enemy! <br/>• Outwit your foes with intelligence and timing rather than brutal force. <br/><br/>World War Game<br/>• Chat with players from all over the world anytime and anywhere.<br/>• Form alliances and make new friends. <br/>• Compete or cooperate with other alliances. Diplomacy or war, it’s up to you! <br/><br/>-Your Toys Are Waiting For You!<br/>Return to your childhood with the toy soldier game you loved. Join us in the toy world and make it a better place!<br/><br/>It’s time to return to the toy battleground! Download Army Men Strike now! <br/><br/>-Over 3,000,000 Downloads!- Thanks to your support, we’re now sharing the happiness and joy of toy games with millions of players all over the world! <br/><br/>PLEASE NOTE! Army Men Strike is free to download and play. However, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>Under our Terms of Service and Privacy Policy, you must be at least 12 years of age to play or download Army Men Strike.<br/>Terms of Service: http://privacy.super-chameleon.com/html/privacy_en.html<br/><br/>Official Facebook Page: https://www.facebook.com/ArmyMenStrike/", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-07-29T21:38:38", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7aeca34b2bcdd50ad21dbaaa5239a81_lQkFQad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VolcanoGames"], "genres": ["RPG", "Strategy"], "publishers": ["Volcano Force Technology CO"], "esrb_rating": "Teen"}