{"id": 354695, "slug": "lunathorn", "name": "Lunathorn", "name_original": "Lunathorn", "description": "A quiet and vibrant world, which is protected by Gods. However, Darkness is predicted to arrive on this land and the world will be in chaos. <br/>The demons invade and the Gods falls. In order to save the situation, Odin have instructed Valkyrie to go to the mortal world and look for the destined warrior. The destined warrior will meet the Ancient God and collect all the 15 Artifact Weapon. <br/><br/>\"Lunathorn\" is a new 2019 must-play MMORPG game that greatly awaited which is full with the Western Mythology. With armor and skill equipped, join in the battle to defeat the darkness and save the world.      <br/><br/><br/>【Game Features】<br/>\u2028-High-quality Graphics and HD Audio \u2028The powerful Unreal Engine 4 creates a jaw-dropping visual experience with rich detail, realistic gameplay effects and a massive HD map for Battle Royale. Feel like you’re in the thick of the action as you play with high-quality audio, immersive 3D sound effects and 7.1 channel surround sound.  <br/><br/><br/>Epic World Map\u2028High quality graphic and stunning scenes are going to immerse you in the 3D fantasy world!\u2028\u2028- Fair Gaming Environment\u2028Powerful anti-cheat mechanisms ensure a fun and fair environment for all Lunathorn players.\u2028\u2028-Dazzling effects \u2028Breathtaking and delicate effects are going to bring you a beyond the reality feeling!\u2028\u2028-Breathtaking skill\u2028You’ll be amazed by the gorgeous skills, cool fighting effects and simple operations! The key to win is but your technique!\u2028\u2028-Stylish costumes \u2028With a wealth of costumes at your fingertips, you are free to highlight your personality in the game easily!\u2028\u2028-Guild War\u2028Call out to you friends, build a guild and fight for your victory!\u2028\u2028-Multiplayer PvP \u2028Ranging from cross server PvP, Clan War to battle royale, the game strives to deliver the most exhilarating gameplay!<br/><br/><br/>【Reminder】<br/>※This game is rated for 12+ according to Game Software Rating Regulations.<br/>※ This game contains image of fighting, sexual or attacking that is not bloody, or a slightly terrif<br/>ying image.<br/>※This game design procures users to have virtual romantic relationship or virtual marriage.<br/>※This game has a top-<br/>up store. You are  advised to spend wisely according to personal interest and ability.<br/>※Playing game for long hours might affect normal work and rest. You are advised to take rest an<br/>d exercise appropriately.", "metacritic": null, "released": "2019-08-08", "tba": false, "updated": "2019-07-29T21:40:07", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f838d7a672057a4da03b1c74bd60a28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EYOU TECHNOLOGY"], "genres": ["RPG"], "publishers": ["EYOU TECHNOLOGY"], "esrb_rating": "Teen"}