{"id": 354705, "slug": "rise-of-kingdoms", "name": "Rise of Kingdoms", "name_original": "Rise of Kingdoms", "description": "11 Civilizations, 34 Heroes, Real Warfare<br/> <br/>From the depths of obscurity to the peaks of legend, you will be the author of your civilization's history. Will you launch epic wars and conquer the entire world? Or rise up as a virtuous leader renowned for your sagacity? Will you set off to explore the unknown as a pioneer? Or dedicate yourself to helping your own people?<br/> <br/>Only time will tell...<br/> <br/>***Features***<br/>#Real-Time Battles#<br/>Battles are not pre-calculated but happen in real time on the map. Anyone can join or leave a battle at any time, allowing true RTS gameplay. See an ally being attacked right in your backyard? Send some troops to help your buddy out, or launch a surprise counterattack on the attacker’s city. <br/><br/>#Seamless World Map#<br/>All in-game action takes place on a single, enormous map inhabited by players and NPC characters. No isolated bases or separate battle screens. Never before seen on mobile “infinite zoom” feature allows you to transition freely between the world view and individual cities or barbarian outposts. Map features include natural obstructions such as rivers and mountain ranges and strategic passes that must be captured to gain entrance to neighboring regions.<br/><br/>#Eleven Unique Civilizations#<br/>Choose one of 11 historical civilizations (more to come!) and guide your civilization from a lone clan into a great power. Each civilization has its own architecture, unique units, and special advantages.<br/><br/>#Exploration &amp; Investigation#<br/>The world of Rise of Kingdoms is covered in thick fog. Dispatch scouts to explore this mysterious land and uncover the hidden treasure within. Investigate lost temples, barbarian fortresses, mysterious caves, and tribal villages, gather intelligence on your enemies, and prepare yourself for the ultimate clash! <br/><br/>#Unrestricted Troop Movements#<br/>New orders can be issued to troops at any time, offering limitless strategic possibilities. Launch a feint at an enemy city, then circle back and meet up with your alliance army to capture a pass. Dispatch troops to collect lumber from a nearby forest and have them pick off a few barbarian clans along the way. Forces can also be split up between multiple commanders so that you can engage in multiple actions simultaneously.<br/><br/>#Alliance System#<br/>Full set of alliance features allow players to help one another: alliance chat with built-in translation function, officer roles, map indicators to coordinate strategies, and more! Alliances can expand their territory to gain resources, capture mountain passes and barbarian outposts to strengthen their position, and work together to unlock group achievements.<br/><br/>#Conquer the Kingdom#<br/>Fight alongside your alliance to take control of this vast kingdom. Clash with other players and use superior tactics to emerge victorious in a MMO strategy battle royale. Rise to the top and you and your civilization will be written down in your kingdom’s history!<br/><br/>#RPG Commanders#<br/>Call upon dozens of historical figures who will serve as your trustworthy commanders, from Julius Caesar and Sun Tzu to Joan of Arc and Kusunoki Masashige. Level up your commanders by defeating barbarians and sending them into battles, then upgrade their abilities using an RPG style talent tree and skill system.<br/> <br/>*Expedition Mode<br/>*Infinite Zoom--never before seen on mobile!<br/>*Scouting<br/>*Espionage<br/>*Kingdom Progression<br/>*Civilization Specific Cities<br/>*Stunning Graphics<br/>*3D Character Models<br/>And more…<br/> <br/>Facebook:https://www.facebook.com/riseofkingdomsgame", "metacritic": null, "released": "2018-09-20", "tba": false, "updated": "2024-03-20T13:29:27", "background_image": "https://media.rawg.io/media/screenshots/e5d/e5d9ca855dce3ea06e22c71c970eceea.jpg", "website": "", "rating": 3.85, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 12, "beaten": 6, "toplay": 2, "dropped": 1, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 13, "platforms": ["iOS"], "developers": ["Lilith Games"], "genres": ["RPG", "Strategy"], "publishers": ["LilithGame Co"], "esrb_rating": "Everyone 10+"}