{"id": 354794, "slug": "merge-unicorn-idle-evolution", "name": "Merge Unicorn - Idle Evolution", "name_original": "Merge Unicorn - Idle Evolution", "description": "WHO WE ARE: <br/>we produce the best Evolution Games to solve the boredom of you. <br/><br/>Our Community is the heart of every game, because we produce new Evolution Game based on your interest and ideas. <br/><br/>Today we present you: Merge Unicorn<br/><br/>Our games are easy to learn but hard to master, this means you will <br/>start slow and gets better during the game and challenged to get all the 30 Unicorn Evolutions to merge. (more will follow you soon! :-) ) <br/><br/>Evolution Games Merge are a mix of different game types :<br/><br/> Idle, you earn money while you sleep<br/> Clicker , you can fast forward on clicking each your bag timer until your finger hurts. :) <br/> Merge Two , you can relax and match things together<br/> Discovery, you always discover a new evolution on your next session. <br/> Tycoon, invest your money smart to improve your gold income to get even richer and buy new evolutions on the fly. <br/> KAWAII , who does not love cute, fluffy Evolutions! :)<br/> Hatching, take care of all your evolutions<br/> Challenge, compete with friends who Discover the next Evolution<br/> Collect, complete all Evolutions and create your own. <br/>Customise, you can customise each evolution on your own<br/><br/>Become part of the unicorn family.<br/>Find out what happens when you put two identical unicorns together. WAIT they start evolve and become a new cool cute kawaii unicorn evolution. <br/><br/><br/>Start small on the world, grow bigger to a new continent, even galaxies are not save for your cute, Merge Unicorns. <br/><br/>&lt;3<br/><br/><br/>HOW TO PLAY<br/><br/>It’s simpler then a matching game!<br/><br/>• As your Unicorns evolution drop coins, buy new Unicorns Evolution to earn even more coins<br/><br/>•Merge similar Unicorns Evolution to evolve them into new and more profitable Unicorns Evolution<br/><br/>• Also tap the Unicorns evolution to make more coins <br/><br/>Highlights<br/><br/>•  30 different forms of Unicorns evolution<br/><br/>•  You can play our game offline, i means in every town in the world and also while driving in the car. You can even hatch your own unicorn dragons<br/><br/>• A cool mix of idle tycoon and incremental clicker mix like Tamago!<br/><br/>• Three possible endings: find the right god as you play!<br/><br/>Download Unicorns Merge Evolution now start your own journey<br/><br/><br/>We love clicker and idle games the way you do! If you have any questions, found a bug or you have new upgrade ideas, get in touch with us! We appreciate your help a lot and donate it with a 5$ ingame code for free!", "metacritic": null, "released": "2018-10-02", "tba": false, "updated": "2019-07-29T23:01:42", "background_image": "https://media.rawg.io/media/screenshots/944/94448401ae98879540505da9a0c4993b_KtOmacJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DevStone"], "genres": ["Strategy", "Simulation"], "publishers": ["DevStone UG"], "esrb_rating": "Everyone 10+"}