{"id": 354704, "slug": "my-cafe-restaurant-game", "name": "My Cafe — Restaurant game", "name_original": "My Cafe — Restaurant game", "description": "Join more than 50 million coffee lovers around the world and unleash your entrepreneurial spirit in this FUN and RELAXING restaurant game. Decide on your cafe STRATEGY and earn income, even when you are offline!<br/><br/>REAL BUSINESS SIMULATION<br/>● With My Cafe you can own and grow a coffee shop of your dreams <br/>● Decorate the space as you wish, hire and train staff, decide on menu items and even set prices as you see fit<br/><br/>CAFE MAKEOVER<br/>● Do you have a knack for design? Hone your interior design skills and do a total cafe makeover<br/>● In this restaurant game, you can choose from numerous decor styles, position furniture as you wish, and make a place totally yours by accentuating with elements that show your true self<br/><br/>INTERACTIVE STORYLINES<br/>● As a true coffee shop owner, you will get to meet your customers from various backgrounds and get to help them navigate through life. In this time management game you can pick between different lines of dialogue with customers and see where your story takes you! <br/>● Do you like drama? Romance? In My Cafe, the choice is all yours!<br/><br/>GO SOCIAL WITH MY CAFE<br/>● Play this cafe game with friends or meet like-minded people to form townships and compete against owners of other coffee shops.<br/>● Fulfill festival tasks and lead your town to success together!<br/><br/>COFFEE MANIA: Do you love coffee as much as we do? <br/>● My Cafe: Recipes &amp; Stories allows you to unleash your barista superpower and create custom coffee and tea drinks for all your guests. <br/>● Unlock unique coffee recipes and spice up everyone’s life in your cafe with distinctive drink combinations.<br/><br/>••••••••••••••••••••••<br/>My Cafe: Recipes &amp; Stories is FREE to download and play with no obligations to pay. However, some in-game items can be purchased for real money. If you wish to disable this feature, please turn off in-app purchases in your device’s settings.<br/>••••••••••••••••••••••<br/><br/>+++++<br/>Note: An internet connection is required to play the game<br/><br/>Privacy Policy:<br/>http://melsoft-games.com/ru-privacy-policy/<br/><br/>Terms of Use:<br/>http://melsoft-games.com/ru-end-user-license-agreement/<br/><br/>A Prestige Township is a weekly/monthly/annual subscription service that allows you to increase the prestige of any township of which you are a member and accept two quests at the same time during Festivals. A Prestige Township subscription costs USD $3.99/$7.99/$49.99 USD (or local equivalent) per week/month/year, which will be charged to your iTunes account after purchase and when the subscription is renewed weekly/monthly/annually.<br/><br/>Subscriptions are renewed automatically unless auto-renew is turned off at least 24 hours before the end of the current subscription period. The payment will be charged to your iTunes account once the purchase is confirmed. Your account will be charged for renewal within 24 hours prior to the end of the current subscription period.<br/><br/>You can manage your subscription and disable auto-renewal in your account settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when you purchase a subscription.<br/>+++++<br/><br/>Follow our official page to get the latest news and helpful tips on how to develop your cooking game:<br/>Facebook - http://www.facebook.com/MyCafeGame", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2023-01-02T06:13:37", "background_image": "https://media.rawg.io/media/screenshots/830/8305112a58b2bad8d1edfb11e2e8a1b8.jpg", "website": "http://www.melesta-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Melsoft", "Melsoft Games"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["Melsoft"], "esrb_rating": null}