{"id": 354775, "slug": "mech-battle-robots-war-game", "name": "Mech Battle - Robots War Game", "name_original": "Mech Battle - Robots War Game", "description": "Mech Battle is THE multiplayer robot war game that everybody is playing now!<br/><br/>We love our players, so you can achieve anything in the game by just playing, everything can be obtained for free!<br/><br/>Build up your incredible robot hangar, play action-packed team battles, upgrade your war machines and weapons with the earned resources and prove yourself in amazing battles in beautiful landscapes and arenas. <br/>Apply different tactics to your combat while you're fighting for beacons, capturing flags or just terminate your enemies in exciting death matches! <br/>Construct your individual robots and equip them with fearsome weapons, thousands of combinations are possible!<br/><br/>If you love robot wars and robot games then Mech Battle is your perfect match!<br/><br/>So take up arms, pilot! Fame and fortune is waiting on the battlefield!<br/><br/>MAIN FEATURES:<br/>- Upgradable mechs with abilities like jump, berserk, speed boost, dodge, stealth and others<br/>- Upgradable weapons like kinetics, lasers, energy weapons, ballistics, rockets, shields, missiles and more<br/>- Combine weapons and mechs to create war machines that fit your playing style<br/>- Join or create a clan, play with your friends<br/>- Play different game modes in beautiful maps and arenas<br/>- Complete daily missions to earn additional resources<br/>- Rank up in various leaderboards and become famous all over the world<br/>- Apply crazy paints to your steel titans<br/>- Enjoy fast paced tactical real-time online wars<br/>- Choose from different camera views<br/>- Communicate with your team members using the innovative command wheel<br/>- Use the Mech Lab for deep weapon and robot analyses<br/><br/>So what are you waiting for? See you on the battlefield, soldier!<br/><br/>If you have any question or suggestion please feel free to contact us, we are very committed to constantly improving and further developing this incredible third-person PvP robo shooter!<br/><br/>Find out more at https://mech-battle.com <br/>or join our Mech Battle Facebook group at https://www.facebook.com/mechbattle/", "metacritic": null, "released": "2018-11-26", "tba": false, "updated": "2019-07-29T22:43:32", "background_image": "https://media.rawg.io/media/screenshots/4db/4dbe9561fe21759124b52e395d72ef11_KS2vYEz.jpg", "website": "http://www.mech-battle.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Djinnworks"], "genres": ["Action", "Simulation"], "publishers": ["Djinnworks"], "esrb_rating": "Everyone 10+"}