{"id": 354701, "slug": "weed-firm-memories", "name": "Weed Firm: Memories", "name_original": "Weed Firm: Memories", "description": "Running a successful weed firm has taken its toll on expelled botany sophomore Ted Growing.<br/> <br/>After everything he’s been through, Ted is ready to put his pots away and enjoy a well-deserved vacation on a tropical island. He has everything he needs to relax under the Caribbean sun of Ganja island. He's got his:<br/><br/>- \tbeach chair<br/>- \tsunglasses<br/>-       and an amazing chilled herbal tea in his hand <br/><br/>He's got everything he needs, but wait...something's missing. He can't remember what it is, he needs to weed through its mind, but… something is definitely missing indeed. <br/><br/>Don't get too relaxed on Ganja beach, bro! Your potting work isn’t over just yet! <br/><br/>In this memory-matching game based on the legendary business simulation game  Weed Firm: RePlanted, you are faced with a seemingly simple task. You need to memorize and match exact pairs of all your old clients from the original Weed Firm. The gang's all here: Jane the Dancer, that infamous Mooch Ryan, Jezebel the spooky goth, Bob the Rasta, and many more!<br/><br/>As you partake in the memory matching madness you will:<br/><br/>+ \tRace against time; putting your memory and concentration to use as you match pairs of cards.<br/>+ \tFace diversions in the form of and snarky commentary as Ted's colorful pot clientele tease you.<br/>+ \tGet the munchies! The faster you are, the more tasty cupcakes you collect to boost you to the next level. <br/><br/>You'll never be bored as you blaze through levels of ever-increasing difficulty in your fight against that eternal arch-enemy himself: Father Time! Help Ted free his weed clients from the clutches of oblivion so he can leave the shop and rush back to his beach chair!<br/><br/>Good luck and happy memories! Enjoy your throw back to Weed Firm!", "metacritic": null, "released": "2015-04-22", "tba": false, "updated": "2019-07-29T21:46:34", "background_image": "https://media.rawg.io/media/screenshots/8b7/8b7a7c93263b1db7ee78008351e51d5e_Sfl61bi.jpg", "website": "http://www.manitobagames.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Koolbros"], "genres": ["Board Games", "Puzzle"], "publishers": ["Ludum"], "esrb_rating": "Mature"}