{"id": 354757, "slug": "chief-almighty", "name": "Chief Almighty", "name_original": "Chief Almighty", "description": "In the war of fire, beasts and stone, will you be the Chief Almighty?<br/>Rally ally tribes together in the primal stone ages! The epic prehistoric lands are rich with resources and ancient beasts ready for you to explore and dominate.Trust your instincts when deploying diplomacy with rival Chiefs, Lead your armies and tribes to smash the most dangerous of rivals, Hunt ancient creatures to become a fierce symbol of your power!<br/><br/>●●Strategy Mobile Game in the Stone Ages. Explore the continents with players Worldwide! ●●<br/>▲Hunt ancient beasts, experience a primitive hunting frenzy!<br/>▲Collect resources, ally with other Chiefs, build your tribe!<br/>▲Ally, plunder, expand, occupy. Expand your power and influence with strong allies, ready to facehead-on the worthiest of Chiefs!<br/>▲Diplomacy or Domination? Trust your instincts, only the brave and resourceful will dominate the continent!<br/>▲Grand Opening of the one and only worldwide server.<br/><br/>●●Classic Features●●<br/>◎◎Real Time Strategy Assembling◎◎<br/>Organize clan mates, assemble ancient beast, awaken your leadership and lead warriors and ally Chiefs to be the Chief Almighty!<br/>◎◎HD Unity3D Game Engine. Excellent Graphics◎◎<br/>High scale panoramic map zooming. Players fully visualize each and every aspect of the map.<br/>◎◎Global Server! Players of different nations compete intensively for ancient relics, in pursuit of the Arch-Chief’s honor! ◎◎<br/>Arcane ancient relics, treasures of endless wealth. Whether you hail from the great eastern lands or the vast west, join a clan and you’ll be able to experience the most primitive, exciting battles!<br/><br/>◎◎Fierce collision between ancient creatures and primitive warriors. Dinosaurs, ancient and Warriors are waiting for your commands! ◎◎<br/>▲Barbarians,the pride of the clan with bloodlust instincts, braves forward even against fierce Behemoths!<br/>▲ Javelineers, essential in the battlefield, capable of dealing high damage with great precision and dexterity!<br/>▲War Riders , riding vicious high-speed dinosaurs, rains death on your enemies with battleaxes and arrows!<br/>▲Ancient Behemoths, from small wild boars, giant mammoths to triceratops and more beasts of prehistoric times all at your command!<br/><br/>▲Rule Description of subscription:<br/>1:Valid For: 7 Days<br/>2:Within the valid days after subscription, Collect (Daily): 1.5M Wood*1, 100 Diamond*3, 20K Chief EXP*1, 50 Energy*1<br/>3:Fees will automatically be charged after the last Valid Day; cancelling of Subscription can only be done manually<br/>4:Your iTunes account will commence with the charge once Subscription has been confirmed<br/>5:Subscription will be continued unless the auto-subscription option is closed 24 hours before the current subscription is over<br/>6:Your account will be subject to the Fees and confirmation of the next subscription, within the last 24 hours before the current subscription ends<br/>7:After Subscription, you can close your subscription service at your account's setting<br/>8. Subscription feature cannot be tried for free<br/><br/>▲Renewing Description Notice of Subscription:<br/>1. Upon Subscribing, fees will be automatically deducted every 7 days to prolong the Subscription Benefit for 7 days<br/>2. Your iPhone's Subscription Benefit Fees will be deducted from your Apple iTune account<br/>3. If you want to cancel Subscription, please close the automatic subscribe feature at least 24 hours before the next fee deduction<br/>4. Cancel Method: From Home page, enter [Setting]—&gt;Tap on [iTune Store or App Store]—&gt;Tap on [Apple ID] and select [View Apple ID]—&gt;[Subscriptions], then select Cancel survival mobile Subscription Benefit<br/><br/>Terms of Service: https://stoneage.yottagames.com/article/get_content/1078/<br/>Privacy Policy: https://stoneage.yottagames.com/en/privacy-and-cookie-policy/<br/><br/>Stone Age Studio<br/>Official Customer Service Email: ca@yottagames.com<br/>Official Facebook Fans Page: https://www.facebook.com/ChiefAlmightyGlobal/<br/>Customer Service- Assistant (Assistant always at your side)", "metacritic": null, "released": "2018-03-02", "tba": false, "updated": "2019-07-29T22:30:25", "background_image": "https://media.rawg.io/media/screenshots/879/8790ef639202758128856cdb7f390d42_1xckP5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YOTTA GAMES"], "genres": ["Strategy"], "publishers": ["YOTTA GAMES"], "esrb_rating": "Teen"}