{"id": 354798, "slug": "airlines-manager-tycoon-2019", "name": "Airlines Manager: Tycoon 2019", "name_original": "Airlines Manager: Tycoon 2019", "description": "▶ The ultimate Airline administration and management game<br/>▶ The tycoon reference in aeronautical and aviation games for mobile<br/>▶ Realistic simulation with maximum immersion and entertaining management<br/><br/>CREATE YOUR AIRLINE &amp; JOIN THE COMMUNITY<br/><br/>● More than 3 million managers <br/>● More than 130 aircraft and 2,600 airports available<br/>● 500 items of research and 200 passenger services to unlock<br/>● Official partnership with IATA (International Air Transport Association)<br/>● Acclaimed by aviation enthusiasts and management game aficionados<br/>● 4 languages currently available: English, French, Spanish, German<br/><br/>◆◆◆Manage your airline as if you were a real Tycoon (\"business magnate\") to become the leading CEO◆◆◆<br/><br/>PLAY AT YOUR OWN PACE<br/>2 game modes<br/>1) Real time (Paris-New York in the game takes 7 hours)<br/>2) Time accelerated x7 (Paris-New York in the game takes 1 hour)<br/><br/>PLAY ACCORDING TO YOUR OWN STYLE<br/>Choose your strategy and develop your airline<br/>Low-Cost or Premium?<br/>Economy, business or first class?<br/>It's up to you to decide!<br/><br/>FEATURES<br/>• Acquire airports<br/>• Buy or rent aircraft<br/>• Open new routes<br/>• Schedule flights<br/>• Manage your entire strategy from A to Z (Development, Banks, Finance, Maintenance, Services, R&amp;D, Marketing, Human Resources)<br/>• Admire your empire live thanks to the huge flight map for your aircraft!<br/>• Build your empire and dominate the airline universe thanks to your fleet, airports and routes.<br/>• Set your own prices: route audits, simulation of demand<br/>• Offer a full range of services: better access to airports, attractive prices, on-board comfort<br/>• Control your finances: bank loans, precise accounting, detailed cash account<br/>• Train your staff: agency or in-house, in all airline sectors<br/>• Access the workshop to unlock new bonuses in a few clicks!<br/>• Analyze the day's schedule: what is the most profitable airport? What are the most profitable routes?<br/><br/>FOR AMATEURS OR EXPERTS<br/>Simplified management or complex management (optional) of your airline<br/>• Detailed scheduling of flights<br/>• Prices based on audits and simulations<br/>• Staff training in all airline sectors<br/>• Aircraft maintenance<br/>• Different strategies possible<br/><br/>WHY PLAY?<br/>Airlines Manager Tycoon 2018 is the best airline administration/management/strategy game for mobile. <br/><br/>Whether you like airport/aircraft administration/management games or even flight simulator/control tower simulation games, or whether you are a management/Tycoon game aficionado in general, this game is for you.<br/><br/>Create the airline of your dreams, collect aircraft and extend your network with a large number of airports and routes in order to build your aviation empire.<br/><br/>This is the must-have Tycoon management game if you enjoy strategy and you dream of developing an empire. Do you have what it takes to take up the challenge and dominate the skies? Are you ready to go down in history?<br/><br/>GAME WEBSITE AND FORUM<br/>Find further information on the game's official website www.airlines.manager.com<br/>Follow us on the forum http://forum.airlines-manager.com\"<br/><br/>OFFICIAL SOCIAL MEDIA<br/>Join our Facebook community https://www.facebook.com/AirlinesManager<br/>Consult the latest news on Twitter https://twitter.com/airlinesmanager<br/>Subscribe to our channel https://www.youtube.com/user/AirlinesManager2HQ<br/><br/>STUDIO'S WEBSITE<br/>Keep up with the latest news from our studio on our official website http://playrion.com<br/><br/>HELP AND SUPPORT<br/>Concerns or suggestions?<br/>Please visit our support center at https://help.airlines-manager.com<br/>or send a message to marion@airlines-manager.com<br/>We are always pleased to hear from our players!<br/><br/>Your Airlines Manager Tycoon 2018 team<br/>Comment: a network connection is required to play", "metacritic": null, "released": "2014-05-05", "tba": false, "updated": "2019-07-29T23:04:58", "background_image": "https://media.rawg.io/media/screenshots/0a8/0a88d231ceb34fef1744b50818434384_6MbqgNR.jpg", "website": "http://www.airlines-manager.com/#s=49&utm_source=AM2_Mobile&utm_medium=cpc&utm_campaign=iOSv15&utm_content=iOS", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Playrion"], "genres": ["Strategy", "Simulation"], "publishers": ["Playrion"], "esrb_rating": "Everyone 10+"}