{"id": 354759, "slug": "finger-balance-free", "name": "Finger Balance FREE", "name_original": "Finger Balance FREE", "description": "Coconut Island Midweek Insanity: Our new game \"Mister Frog\" goes free. It's a super addictive game! Check it out. <br/><br/>Featured by Apple in \"Gravity Puzzlers\" &amp; \"The Best Games You've Never Played\"<br/>Nominated as Most Innovative Game at International Mobile Gaming Awards(IMGA)<br/>No.1 Top Overall free Apps in US, UK, Germany, Hong Kong, Taiwan,Finland!<br/>No.1 Board Game in US, UK, Germany, France, Canada, Hong Kong, Taiwan, Denmark, Russia!<br/>No.1 Puzzel Game in US, UK, Germany, France, Denmark,Hong Kong,Taiwan, Russia!<br/>Full version of this game ranked # 6 Top Paid Apps in US,   #1 Top Puzzle Games in US, Germany, #1 Top Board Games in US, UK, Germany. Featured as \"What's Hot\" \"New and Noteworthy\"<br/><br/>Featuring innovative and unique gameplay never seen before in the App Store, Coconut Island, maker of iDragPaper with 7 million players worldwide, is proud to present to you Finger Balance, brand new one of its kind puzzle game for iPhone.<br/><br/>Test the dexterity and stability of your fingers, by balancing a ball on a rod and navigate through challenging and fun levels.<br/><br/>Reveiw:<br/>“Finger Balance is a new type of physics inspired puzzler for the iPhone that is sure to be a favorite among challenge loving gamers.” - AppSafari rating 4/5<br/><br/>“Finger Balance by Coconut Island is one of those rare games where you can't help but wonder why it took so long to come about.” - AppSpy.com rating 4/5<br/><br/>\"If you're the kind of insane superbeing who used to happily spend hours trying to ride the 0.1 bar from end to end on the guitar-string level of Super Monkey Ball, then with Finger Balance you can spark similar obsessive-compulsive tendencies off once again.\" - Eurogamer.net rating 8/10<br/><br/>\"This insanely addictive physics puzzler has all the right elements of a classic casual game.\" - appSIZED rating 4.5/5<br/><br/>\"With laborious mazes, easy graphics, and a modest price tag, Finger Balance is a should buy!\" - appadvice rating \"SHOULD BUY\"<br/><br/>\"Mi intrigano soprattutto i giochini semplici ma davvero originali. È proprio il caso di questo Finger Balance.\" - iPhoneItalia<br/><br/>Gameplay:<br/>You're given a rod and a ball on it. Your objective is raise and lower both  ends of the rod to balance the ball and navigate it through obstacles.  <br/><br/>Features:<br/>- Unique gameplay you have never experienced before<br/>- Instant reply. Relive the best 6 glory moments of your accomplishment<br/>- 19 Levels in different difficulties (90 levels and 3 game modes in full version)<br/>- 8 Achievements (23 in full version)<br/>- Level editor (can only save one user-generated level in free version while unlimited in paid version)<br/>- Retro style graphics<br/>- Original background music and sound effects<br/>- OpenFeint online leader board<br/>- Score publishing with Facebook and Twitter<br/>- Access integrated game community in-game<br/>Next update: User-generated levels uploading, downloading and rating!<br/><br/>Gameplay video: http://www.youtube.com/watch?v=_Hizt_gU_PU<br/>Official guide video: http://www.youtube.com/watch?v=fR6YwhKtcoY<br/><br/> Just remember to use your finger tips to move the rod and touch as little screen area as possible!<br/><br/>Please support our new game \"One Tap Hero Free\", an award-winning cute puzzle platformmer! <br/>Search \"One Tap Hero\" in App Store", "metacritic": null, "released": "2010-09-30", "tba": false, "updated": "2019-07-29T22:36:32", "background_image": "https://media.rawg.io/media/screenshots/266/26668e2ae604485254dfabc2bc00bbc4.jpg", "website": "http://www.CoconutIslandStudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coconut Island Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Coconut Island Games"], "esrb_rating": "Everyone 10+"}