{"id": 354827, "slug": "gods-and-glory-war-of-thrones", "name": "Gods and Glory: War of Thrones", "name_original": "Gods and Glory: War of Thrones", "description": "Build an empire and clash with other players from across the world in epic MMO battles. Gods and Glory is the ultimate mobile strategy game with over 3 million players from 130 countries.  <br/><br/>Dive into the heat of battle with your heroes, conquer new lands for valuable resources, build a sprawling capital and harness the power of the gods… these are only some of the exciting adventures that await you in Gods &amp; Glory!<br/><br/>FEATURES:<br/>- FIGHT in unique role playing battles<br/>- BUILD &amp; DEFEND your capital from incoming invasions<br/>- CONQUER the neighbouring realms for useful resources<br/>- RULE  and expand your empire as you wish<br/>- UNITE in powerful alliances with friends and fellow players from over 130 countries<br/>- SUMMON the power of six different gods and harness their powers in battle<br/><br/><br/>Join the official game community and participate in our competitions to snag valuable prizes!<br/>http://www.facebook.com/godsandgloryofficial<br/><br/>PLEASE NOTE! Gods and Glory: Age of Kings is free to download and install. However, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/>You can also get one of our digital subscriptions.<br/>A network connection is also required.<br/><br/>DIGITAL SUBSCRIPTIONS<br/>Auto-renewing subscriptions grant you great game benefits. <br/>The following types of subscription are available:<br/>- Individual “Conqueror” subscription per 1 month for 4,99 USD.<br/>- Individual “Demigod” subscription per 1 month for 24,99 USD.<br/>- Individual “Godlike” subscription per 1 month for 99,99 USD.<br/>- Alliance “Patron” subscription per 1 month for 4,99 USD.<br/>Once you subscribe, the funds will be automatically deducted from your iTunes account at the end of the subscription period. The payment for the subscription will be processed within 24 hours before the current subscription expires. The subscription may be canceled in your iTunes account settings immediately after the purchase, but not later than 24 hours before the current subscription expires. If the subscription is canceled, its bonuses remain active for the paid period. <br/> Warriors, we’re unable to reply to your AppStore reviews, but you’re welcome to send us your questions and feedback via the “Report a problem” form in the game settings as well as via our app page. Your feedback is highly appreciated!<br/><br/>Privacy Policy<br/>http://legal.na.wargaming.net/?Privacy-Policy<br/><br/>User Agreement<br/>http://legal.na.wargaming.net/?EULA", "metacritic": null, "released": "2016-11-15", "tba": false, "updated": "2019-07-29T23:17:56", "background_image": "https://media.rawg.io/media/screenshots/648/64815774ab3936de2e4225ac26e2b3e3.jpg", "website": "http://godsandglory.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wargaming Group"], "genres": ["RPG", "Strategy"], "publishers": ["Wargaming"], "esrb_rating": "Everyone 10+"}