{"id": 354836, "slug": "clash-of-my-planets", "name": "Clash of my planets", "name_original": "Clash of my planets", "description": "[Game features]<br/>[Building base-guard satellite ships]<br/>- Build your new starship, upgrade and build research institutes, command centers, ghost towers, space greenhouse weapons control rooms and so on.<br/>- Driving exclusive starship into immense space includes exploring new stars, searching for nearby mineral stars, attacking potential threat fleet and hostile starship actively.<br/>- Starships reach the target area by jumping, commanding landing ships, assigning different heroes and arms and reasonably matching skills to experience the beauty of strategy games, and ultimately win the war. After each victory, there will be a reward rich resource box waiting for you to open.<br/>[New Star Regions Super Team]<br/>- Work side by side with superheroes of all races in the whole universe, and experience the top pleasure of cosmic hegemony!<br/>- By exploring new stars, we will find countless alternative civilizations. We can employ or technologically arm and artificially evolve commanders from all planets. They will be your powerful arm to conquer the universe.<br/>- Infantry, armour, fighter planes, airborne orbiters, heroes of different races and other combinations can make battles change rapidly.<br/>[High Degree of Freedom Global Star Wars]<br/>- Choose your position, join the Starship Alliance, compete with global players for Starcraft, re-establish and protect human civilization.<br/>- Build your own starfleet, build a strong star fortress, and compete with global players in the stars.<br/>- Your Honourable Starship Commander, is it robbing other players of resources, or exploring a new planet to tap wealth, all under your control!", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2019-07-29T23:25:07", "background_image": "https://media.rawg.io/media/screenshots/a92/a92ccd0a17c9b1534492b3ac22b889fb_ClgrNvh.jpg", "website": "http://pandafun.online", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hong Kong JoyTap"], "genres": ["Strategy", "Card"], "publishers": ["Hong Kong JoyTap"], "esrb_rating": "Everyone 10+"}