{"id": 354846, "slug": "terragenesis-space-settlers", "name": "TerraGenesis - Space Settlers", "name_original": "TerraGenesis - Space Settlers", "description": "Utilize real science from NASA to cultivate life on desolate planets. Think you have what it takes to bring a dead planet back to life? Can you settle the stars?<br/><br/>The universe is your playground in TerraGenesis! Colonize real planets in our solar system, planets created just for TerraGenesis and even alien worlds! When the world is in your hands, the possibilities are truly endless. Play TerraGenesis and start terraforming today!<br/><br/>TerraGenesis Features:<br/><br/>COLONY BUILDER<br/>- Join one of four interstellar Factions, each lending different benefits for colonization<br/>- Colonize entire worlds one step at a time, by creating pressurized habitats for your colonists so they can survive in hostile environments<br/>- Terraform your planet to support human life by altering specific properties of each world, including air pressure, oxygen, sea levels and biomass<br/>- Track your civilization’s progress and your world’s current status with the Stats Summary Page<br/><br/>DISCOVER PLANETS &amp; MOONS<br/>- Colonize real planets from our solar system, including Mars, Venus, Mercury and even Earth!<br/>- Terraform orbital satellites, including The Moon as well as the Moons of Jupiter, Saturn, Uranus and Neptune<br/>- Build colonies on fictional planets, including Bacchus, Ragnarok, Pontus, Lethe and Boreas<br/>- Terraform Dwarf Planets, including Ceres, Pluto, Charon, Makemake, Eris and Sedna<br/>- Melt ice caps to create planet-wide oceans and seed the planet with life<br/><br/>BIOSPHERE SIMULATOR<br/>- Build your own functioning ecosystem with interacting, custom organisms<br/>- Start with 26 different phyla and add 64 unique genes to create all kinds of amazing organisms to inhabit your world<br/>- Manage your lifeforms as they thrive in both terrestrial and aquatic biospheres<br/>- Generate random worlds with complete surface and elevation maps, unique starting conditions and more<br/><br/><br/>TerraGenesis is free to play and as an indie game it was important to us that all in-app purchases are entirely optional and not required for a full and complete experience.<br/><br/>Enjoying TerraGenesis? Learn more!<br/>Facebook: https://www.facebook.com/TerraGenesisGame<br/>Twitter: https://www.twitter.com/SettleTheStars<br/><br/>Terms of Use: http://www.tiltingpoint.com/terms-of-service", "metacritic": null, "released": "2016-07-06", "tba": false, "updated": "2019-07-29T23:29:03", "background_image": "https://media.rawg.io/media/screenshots/720/720c9ec37b13601d74a65b365f78329e.jpg", "website": "https://www.facebook.com/TerraGenesisGame", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Tilting Point"], "genres": ["Strategy", "Simulation"], "publishers": ["Tilting Point"], "esrb_rating": "Everyone 10+"}