{"id": 354903, "slug": "powerhouse-circuit-scramble", "name": "Powerhouse - Circuit Scramble", "name_original": "Powerhouse - Circuit Scramble", "description": "Powerhouse - circuit scramble is a free and addictive circuit game. Get your voltmeter ready, this game is filled with challenges and thought provoking fun! Circuit scramble throws you into the world of circuit-based logic that drives real world electronics! Navigate through a field of logic and components as you attempt to find the correct inputs to complete the slide puzzle. It will really make your brain work overtime!<br/> <br/>Features of powerhouse - circuit scramble:<br/>- Unique unblock puzzles FREE, designed to make you think and learn on every circuit!<br/>- Daily challenge. Every circuit you beat, you level up and increase your prize and score on the leaderboard! <br/>- OVER 700 addicting powerline puzzles in total!<br/>- Different electronic components to work with. Voltage divider, diode, transistor, LED and more.<br/>- 25 ELECTRIC Google Play achievements and 2 ELECTRIC Google Play leaderboards!<br/>- Google play cloud sync. Save your power line games to the cloud and sync between devices!<br/>- All of these puzzles for free! These circuitry games will provide hundreds of hours of challenging entertainment that will electrify your receptors!<br/><br/>How to play Powerhouse - circuit scramble:<br/>- Voltage source: Connect the power to flow to the LED from here by sliding the tiles and connect them together!<br/>- LED: Once the power flows to all of these on the circuitry board, you will advance to the next epic level!<br/>- Voltage Splitter: Need an extra power source? Just split the voltage power line to flow to the nearest component!<br/>- Zener Diode: Voltage can only pass one way through these devices, so think hard where you place them.<br/>- Transistor: Transistors require 2 power sources connected to power up - then your transistor will turn on!<br/> <br/>Logic puzzles are proven to help with logic making decisions and overall health of your brains. Brain games are great for kids, adults and anyone else. Enjoy these logical puzzles with the whole family in this transistor game!", "metacritic": null, "released": "2017-06-30", "tba": false, "updated": "2019-07-30T00:21:02", "background_image": "https://media.rawg.io/media/screenshots/b07/b07891274d429d57abce4f3ba0bbcbbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kyle Sawatzky"], "genres": ["Puzzle"], "publishers": ["Kyle Sawatzky"], "esrb_rating": "Everyone 10+"}