{"id": 354967, "slug": "williams-pinball", "name": "Williams Pinball", "name_original": "Williams Pinball", "description": "Williams™ Pinball ushers in a new era of mobile pinball excellence, uniting pinball players around the globe with new multiplayer features!<br/><br/>Experience a dazzling collection of classic premium pinball tables such as Fish Tales™, Medieval Madness™, Attack from Mars™, Junk Yard™, The Party Zone™, Black Rose™ and The Getaway High Speed II™ with more tables on the way! <br/><br/>Play head-to-head against players for real money and cash prizes, powered by Skillz!<br/><br/>Each table is playable in its original form or in a remastered version featuring newly created 3D interactive characters, side wall art and more, bringing these classic tables to life like never before!<br/>Zen’s Pro Physics simulation provides the most authentic pinball experience available.<br/><br/>From the makers of Zen Pinball, Marvel Pinball, Star Wars™ Pinball, Aliens vs. Pinball, Bethesda® Pinball and more!<br/><br/>FEATURES:<br/><br/>- Multiplayer matchups powered by Skillz provide endless competitive play and the chance to win real money and cash prizes in select countries<br/>- Daily challenges and competitions<br/>- Pro Physics delivers the most realistic mobile pinball experience available<br/>- New tables added frequently<br/>- Global leaderboards<br/>- Single-player challenges<br/>- Table customizations<br/><br/>PRESS QUOTES<br/><br/>Destructoid<br/>\"The Bally/Williams licence and Zen Studios are truly a match made in heaven\"<br/><br/>The Sixth Axis<br/>\"Each of the tables is perfectly recreated here and it’s simply astonishing the level of detail that Zen Studios have achieved\"<br/><br/>Digitally Downloaded<br/>\"As with all Zen Studios titles, the physics are spot-on\"<br/><br/>ZTGD<br/>\"Any fan of pinball of any skill level should add this to their collection\"", "metacritic": null, "released": "2019-01-28", "tba": false, "updated": "2019-07-30T01:09:21", "background_image": "https://media.rawg.io/media/screenshots/6e7/6e7945cacee57c319aed23d58a3bfa1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zen Studios"], "genres": ["Simulation", "Casual"], "publishers": ["Zen Studios"], "esrb_rating": "Mature"}