{"id": 354999, "slug": "world-of-dragons-3d-simulator", "name": "World of Dragons: 3D Simulator", "name_original": "World of Dragons: 3D Simulator", "description": "Rule the sky and live life as a legendary Dragon! Explore a vast world of floating islands, dangerous monsters, and mythical creatures! Start your own dragon family, destroy medieval castles, and battle for your life against deadly enemies like goblins, orcs, and ogres!<br/><br/>Download World of Dragons: Dragon Simulator today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>+ REALISTIC SIMULATOR - You'll need to maintain your health, hunger, thirst, and energy if you're going to survive!<br/><br/>+ EPIC FIGHTS - Blast massive fireballs and scorching flame pillars to incinerate your enemies and rain down destruction on unsuspecting human and orc kingdoms!<br/><br/>+ BOSS BATTLES - Ready to put your dragon to the test? Enter into combat with 5 unique bosses that will push you to your limits! Succeed in slaying them and your rewards will be plentiful!<br/><br/>+ COLLECT TREASURE - Massive loot drops will satisfy your dragon's lust for gold! Spend your fortune to customize your dragon with unique skins, fire colors, and legendary armor!<br/><br/>+ LEVEL UP YOUR DRAGONS - Gain experience by defeating enemies and destroying buildings! Level up your dragons to increase their health, attack damage, and even unlock new attacks like Fire Breath!<br/><br/>+ START A FAMILY - Find a mate to bond with and hatch your very own baby dragons to help you hunt! Watch your baby dragonites grow in size and assist you in combat!<br/><br/>+ SURVIVAL GUIDE - Look to your handy survival guide for a map of the world, your treasure collection, dragon customizations, and much more!<br/><br/>+ HUGE 3D ENVIRONMENT - Your dragon is free to fly through a massive open world of floating islands in the sky!<br/><br/>+ NEW TOUCH-BASED CONTROLS - Brand new intuitive controls let you navigate your dragon like never before! Pinch to zoom and play from your dragon's perspective or get a bird's eye view of the action!<br/><br/>+ HD GRAPHICS - Stunning High Definition graphics will dazzle your display! Three levels of detail will provide the perfect performance and look for your device!<br/><br/>+ GLUTEN-FREE PROMISE - With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download World of Dragons: Dragon Simulator and experience the thrilling life of the most legendary beast of all time!<br/><br/>If you liked living as a Dragon then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies or check out the Scorpion Simulator and wield a poisonous stinger!<br/><br/>Follow us on Facebook for more awesome animal simulation games!<br/>facebook.com/glutenfreegames<br/><br/>Follow us on Twitter too! We love hearing feedback and suggestions!<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2014-09-27", "tba": false, "updated": "2019-07-30T01:55:03", "background_image": "https://media.rawg.io/media/screenshots/4e1/4e103c60c585d5d8bd524b2a06e0baff_i9mgoCy.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Gluten Free Games"], "genres": ["Adventure", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": "Everyone 10+"}