{"id": 355069, "slug": "playbook-stories-with-choices", "name": "Playbook: Stories with Choices", "name_original": "Playbook: Stories with Choices", "description": "We are bringing you a brand new interactive story game – the PLAYBOOK! What makes us different is the fact that we’re offering you a unique playing experience with REAL CHOICES and PUZZLE GAMEPLAYS. Instead of a simple tap-based visual novel, you will get compelling stories about the supernatural, betrayal, love and friendship which will take you to MANY DIFFERENT ENDINGS. Make choices that really matter and along the way, find secret objects, assemble torn pictures, look for the differences between the two scenes, or pick a lock to open the secret drawer. The best collection of story games with choices is waiting for you! Pre-order Playbook today and enjoy a storytelling masterpiece. <br/><br/>*** REAL CHOICES: Make decisions that drastically change the storyline.<br/>*** DIFFERENT ENDINGS: Each episode offers different paths, discover all of them.<br/>*** CHARACTER CUSTOMIZATION: Choose your favorite outfit, hairstyle, and makeup for every occasion!<br/>*** PLAY PUZZLE GAMES: Enjoy finding clues, looking for hidden objects, lock picking, and many others.<br/>*** CHOOSE YOUR GENRE: Mystery, Horror, Crime, Adventure, Sci-Fi, Romance, and more to come.<br/>*** SUPPORTED LANGUAGES: English, Español, and Português.<br/><br/>Try out Playbook: Interactive Stories and become the creator of your own destiny. <br/>Make real choices which branch the story to many different paths, each taking the protagonist of the story on a different journey. CHOOSE WISELY because the fate of other characters also depends on you. Play our game with episodes and choose what to say, who to hang out with, what to do and where to go. Party with your best friends, meet a cute guy, fall in love with a vampire, discover the dark underworld, fight crime, find the killer. Enjoy well-developed characters and scenarios which will keep you at the edge of your seat. <br/><br/>CHOOSE YOUR LOOK and DECIDE WHAT HAPPENS in your favorite interactive stories. While you’re reading the narrative and making crucial choices, play puzzle games to find what’s hidden behind the secret doors, swipe tiles to discover what happened or assemble the pieces of a torn photo to see who’s in it. Enjoy the breath-taking VISUALS while you’re leading characters participates in an adventure of a lifetime. Play this amazing visual adventure and CHOOSE THE BEST PATH!", "metacritic": null, "released": "2019-08-20", "tba": false, "updated": "2019-07-30T03:06:51", "background_image": "https://media.rawg.io/media/screenshots/6cc/6ccd8c0140f633bbf145d2fb64098307_zKScf16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Midva Games"], "genres": ["RPG", "Simulation"], "publishers": ["Midva"], "esrb_rating": "Mature"}