{"id": 355075, "slug": "lords-of-discord-fantasy-tbs", "name": "Lords of Discord Fantasy TBS", "name_original": "Lords of Discord Fantasy TBS", "description": "***NOTE:  Compatible with iPad 3 and up, iPad Mini 2 and up, iPhone 5 and up - WILL NOT RUN ON EARLIER DEVICES.***<br/><br/>Plunge into the fantasy world of a 3D turn-based strategy game rooted in the legacy of the genre’s greatest classics. <br/><br/>Form a party of valiant heroes and equip them to conquer new lands, complete quests, and fight hordes of monsters. Build up your power, develop your Castle, and gain an edge over your rivals. <br/><br/>Challenge other players, earn awards, and improve your online ranking. Bring the flames of war upon the enemy!<br/><br/>Dozens of heroes stand ready to fight under your banners, vanquishing the enemy with their swords and magic. Locations inhabited by elves, orcs, undead, and other races await! Using your warriors’ unique abilities, cleanse these lands of your foes in traditional turn-based combat. <br/><br/>Conquered territories yield the resources you need to build and upgrade your Castle, and the armor and equipment you win in battle will help you create an unrivaled army. <br/><br/>As they soldier on through countless battles, novices and acolytes will become seasoned veterans and powerful mages, able to crush the most indomitable hordes of enemies.<br/><br/>Begin your war today! Become a Lord of Discord!<br/><br/>Game Features <br/><br/>- Classic turn-based combat<br/>- Full 3D environment<br/>- Dozens of heroes and monsters to hire<br/>- Multiple enemies with unique abilities<br/>- Сonquer territories and develop your Castle<br/>- PvP battles against players from all over the world<br/>- All kinds of armor and equipment<br/>- Exciting missions and quests<br/>______________________________________<br/>Thanks for playing Lords of Discord! If you like the game, please consider rating or leaving your review. We appreciate all the feedback!<br/><br/>Keep track of HeroCraft game news and updates!<br/>twitter.com/Herocraft <br/>youtube.com/herocraft <br/>facebook.com/herocraft.games", "metacritic": null, "released": "2016-01-19", "tba": false, "updated": "2019-07-30T03:11:40", "background_image": "https://media.rawg.io/media/screenshots/eea/eea53b1a42d40ac8ea82007590ccd721.jpg", "website": "http://www.herocraft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HeroCraft"], "genres": ["RPG", "Strategy"], "publishers": ["HeroCraft"], "esrb_rating": "Teen"}