{"id": 355002, "slug": "cheetah-simulator", "name": "Cheetah Simulator", "name_original": "Cheetah Simulator", "description": "Enter into the wild savanna and live the life of a Cheetah! Explore a vast grassy plain filled with ferocious animals of all shapes and sizes. Raise a family, hunt down food, and battle for your life against fierce predators like hyenas, crocodiles, and lions!<br/><br/>Download the Cheetah Simulator today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>+ REALISTIC SIMULATOR - You'll need to maintain your health, hunger, thirst and energy if you're going to survive in the hostile plains of the African savanna!<br/><br/>+ BLAZING SPEED - Race your way through the vast world at blurring speeds that will leave your enemies in the dust!<br/><br/>+ EPIC BATTLES - Use your razor sharp claws, swift speed, and deadly pounce to hunt down tasty snacks and fight dangerous exotic animals!<br/><br/>+ START A CHEETAH PACK - Find a mate to bond with and raise your very own family of cheetahs! Watch your cubs grow in size and strength as they help you battle your enemies!<br/><br/>+ LEVEL UP YOUR CHEETAH - Gain experience by defeating and devouring enemies and level up your cheetahs to increase their health, attack damage, and even unlock new abilities!<br/><br/>+ CHEETAH SURVIVAL GUIDE - Look to your handy survival guide for information on enemy wildlife, a map of the savanna, cheetah customizations, and much more!<br/><br/>+ HUGE 3D ENVIRONMENT - Your cheetah is free to roam a massive open-world environment that is more the double the size of the previous simulators!<br/><br/>+ 18 UNIQUE AFRICAN SPECIES - Behold the largest collection of animals ever put into a single simulator! Hunt down elephants, hippopotamus, wild boars, gazelle, zebras, pythons, rhinoceros, and many more!<br/><br/>+ HD GRAPHICS - Stunning High Definition graphics will transport you to a remote grassland ecosystem and surround you with nature's beauty! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!<br/><br/>+ OPTIONAL BLOOD EFFECTS - Looking for more realistic action? If you are of age or have your parents permission, turn on the blood effects for some added combat ferocity!<br/><br/>+ GLUTEN-FREE PROMISE - With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Cheetah Simulator to experience the adrenaline pumping speed of the world’s fastest animal!<br/><br/>If you liked living as a Cheetah then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies, or check out the World of Dragons: Dragon Simulator and raid castles and battle mythical bosses!<br/><br/>Follow us on Facebook for more awesome animal games and simulators!<br/>facebook.com/glutenfreegames <br/><br/>Follow us on Twitter too! We love hearing feedback and suggestions!<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2014-10-12", "tba": false, "updated": "2019-11-18T01:44:03", "background_image": "https://media.rawg.io/media/screenshots/17f/17f2cc9b1aed82831b071d401977d54a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android", "macOS"], "developers": ["Gluten Free Games"], "genres": ["Adventure", "Simulation", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": "Everyone 10+"}