{"id": 355008, "slug": "candlemanfind-yourself", "name": "Candleman:find yourself", "name_original": "Candleman:find yourself", "description": "*The cooperation releasing game of “Fantastic Games”, the independent games supporting program of CMGE *<br/><br/>[Game Introduction]<br/><br/>Despite only being able to burn for 10 seconds, a little candle journeys into the darkness, with the purpose of seeking light. <br/><br/>Candleman provides an immersive adventure, with an innovative and unique game mechanism and well-balanced level design.<br/><br/>[Game Features]<br/><br/>LOW-LIGHT GAMEPLAY <br/>Venture through the darkness with only 10 seconds light. <br/><br/>LUSH YET HAUNTING ENVIRONMENTS<br/>A mysterious world bathed in the radiance of lively light and vibrant colours. <br/> <br/>RICH AND VARIED CHALLENGES<br/>Face obstacles based on the mechanics of light and shadow. <br/> <br/>AN EMOTIONAL JOURNEY OF LOST AND FOUND<br/>Journey out of the darkness with the little candle, looking for the light.<br/><br/>[Reviews &amp; Comments]<br/> <br/>Like a playable Pixar short that'll warm your heart. - Mirror<br/><br/>A beautiful, finely-tuned death trap.  – Gamespot<br/><br/>One of the strangest, but surprisingly endearing, heroes. - Metro<br/><br/>It made me feel like I was a kid again. - A Flawed Orange<br/><br/>A refreshingly unique platforming masterpiece - Death Essence<br/><br/>Any younger gamers would definitely enjoy this game. - vx FluxWolf xv<br/><br/>A great example of just an awesome indie game – LifeSuxPlayHALO<br/><br/>[Contact Us]<br/><br/>facebook：@CMGEIndie<br/><br/>Twitter:  @CMGE_Indie<br/><br/>Instagram: fantasticgames_cmge<br/><br/>Only available on iOS 9 or above temporarily", "metacritic": null, "released": "2018-03-27", "tba": false, "updated": "2019-07-30T02:05:27", "background_image": "https://media.rawg.io/media/screenshots/114/11480ea1816080d4dd4dfadd12958918.jpg", "website": "http://i.cmge.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["中手游"], "genres": ["Adventure", "Puzzle"], "publishers": ["CMGE Group"], "esrb_rating": "Everyone 10+"}