{"id": 355063, "slug": "the-escapists-prison-escape", "name": "The Escapists: Prison Escape", "name_original": "The Escapists: Prison Escape", "description": "The Escapists, you’ve done the crime but can you survive and do the time? The Escapists is a unique prison escape sandbox game where you get to experience a life behind bars and barbed wire fences. You’ve had a life of crime but now you’re caught. With thrilling and immersive gameplay, you need to create an escape route in a world of other prisoners and ruled by routine.<br/><br/>From roll call to lights out, you’re banged up. There’s no get out of jail free card in this game, you need to break out. Are you up for the challenge or are just going to sit there in your cell? You need all your wits and skill to bust out. No walls are going to hold you, you need to escape!<br/><br/>While under the careful watch of the guards, you’ll need to get used to prison life while you use strategy and daring to swipe useful objects from under their noses. Make innocent looking items into useful tools like shovels for cunning escape plans or handy weapons to survive in a fight.<br/><br/>Escaping requires cunning, strategy, the right equipment and staying at least two steps ahead of the guards. Bribe and fight your way through the prison ranks. If your fellow prisoners like you enough, recruit them and create your own gang. You might even take over a prison! The guards are out to stop any escape attempts, so you’ll have to avoid suspicious behaviour by attending roll calls, working a prison job and hiding your stolen contraband.<br/><br/>Features:<br/><br/>● Addictive prison simulator game, steal spoons and forks, use them to dig a tunnel out of your cell.<br/>● Over 6 themed prisons, try to escape from minimum security jails or fearsome big houses like Alcatraz<br/>● Find, steal and trade items to create dozens of crafting combinations to aid your escape<br/>● Use the exercise yard to increase your strength, handy for scaling walls<br/>● Find other prisoners to trade swag with, you’ll need duct tape, a screwdriver or nail files<br/>● Dodge contraband detectors. if you pass through one with contraband in your pocket, the heat meter rises to 99 percent<br/>● Adapt to life behind the steel doors with prison routines and jobs and master the game's six penitentiaries, there are three extra prisons waiting to be challenged.<br/>● Push yourself to survive and increase your strength, speed, and intellect. There are multiple ways to break out and escape, you just need to find them.<br/><br/>The Escapists is a thrilling sandbox strategy prison simulator that challenges you to bust out in a number of different ways. You want to break free but you're banged up and you need to escape! How you survive and do that is up to you, but when you’re out of your cell, a rigid daily schedule is designed to keep you in line. You're expected to work at one of several jobs during the day, exercise and showers are mandatory.<br/><br/>The Escapists is tough game, just like jail.<br/>Can you dig a tunnel right under the walls of the prison? Or even steal a guard uniform to blend in with your captors? Addictive and tense, it’s a real challenge to escape your first prison. Commit a few inside crimes, there are dozens of items to find, steal and smuggle. Some are contraband you can sell or trade for more useful gear. Create clever makeshift weapons and tools, a bar of soap in a sock is useful in a fistfight.<br/><br/>Materials purchased or \"borrowed\" from your fellow inmates are used to craft tools and other items like wires, a bottle of bleach, a piece of timber, a bar of chocolate, a plastic comb, and much more. If you’re smart enough, you’ll figure out ways to make your escape. There are dozens of items to find and use to get out of your cell, including a pickaxe, wire cutters, zip lines and more.<br/><br/>The Escapists is an addictive strategy prison simulator game that challenges you to break out of jail. Don’t be a prisoner, be an Escapist!<br/><br/>Download The Escapists today, it would be a crime not to. You can’t check out and you can never leave, unless you have an escape plan…<br/><br/>http://escapistgame.com/<br/><br/>https://www.team17.com/", "metacritic": null, "released": "2017-03-02", "tba": false, "updated": "2019-08-02T04:53:22", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee33f3ed5992dc23b92cd5b81a8bf7e0_fkOoZ10.jpg", "website": "http://www.team17.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Team17 Digital"], "genres": ["Strategy"], "publishers": ["Team17 Digital"], "esrb_rating": null}