{"id": 355198, "slug": "strike-force-heroes", "name": "Strike Force Heroes", "name_original": "Strike Force Heroes", "description": "Strike Force Heroes is an oldschool arena shooter rebuilt with modern mechanics with full co-operative and PvP online multiplayer. It melds over the top action with epic story-telling in this intense remake of the hit Flash game.<br/><br/>Fight in lush forests, on speeding trains, and atop crashing airplanes, customizing your soldiers with different weapons, skills, and upgrades! Strike Force Heroes has been completely reimagined from the ground-up featuring an expanded campaign with full voice acting, animated cutscenes, challenges, and a brand new loot system.<h3>CUSTOMIZE YOUR HERO</h3><br/>Level up 4 classes with exclusive weapons, outfits, and abilities, each with their own completely unique strengths, weaknesses, and playstyle.<br/><br/>One-shot enemies with the glass cannon Assassin, or eat all the bullets as the unstoppable Tank, any playstyle you enjoy, the heroes have you covered.<h3>CHOOSE YOUR LOADOUT</h3><br/>With hundreds of weapons, abilities, and equipment, there's something for every play style.<br/><br/>Go with a safe loadout, or create a clever setup that synergizes perfectly with all your equipment for risky yet deadly results.<br/><br/>Whether you like to get up close and personal with melee, take your enemies out silently with snipers, or just blow stuff up, there's a weapon for you!<h3>A HAND CRAFTED EXPERIENCE</h3><br/>Experience an engaging storyline through fully animated cutscenes with wisecracking characters, explosive action sequences, and challenging boss fights. A routine mission goes awry and your squad finds themselves trapped on a mysterious island where nothing is as simple as it appears.<h3>ONLINE CO-OP AND PVP</h3><br/>For the first time ever, invite your friends to join you throughout the entire campaign, or blast them away in fully customizable PvP custom matches!<br/>How many friends? All of them!<h3>ENDLESS REPLAYABILITY</h3><br/>Beating the campaign unlocks harder difficulties to earn better rewards, further build out your heroes, and challenge even the most seasoned of players.<br/><br/>Play through Missions of the Day to earn new rewards and create the most powerful hero.<br/><br/>Earn more rewards by completing tons of fun side-tasks such as getting headshots while airborn, defeating enemies with hero abilities, or even teabagging enemies!<br/><br/>Put your skills to the ultimate test with dozens of unique challenge missions that add crazy twists to the base game, requiring some strategy and clever thinking to overcome.<h3>A REMAKE WITH LOVE</h3><br/>The original 2-man development team behind the hit Flash series Strike Force Heroes and Raze are back with their unique blend of high quality art, polished gameplay, and twisted sense of humor.<br/><br/>Strike Force Heroes' signature pulse-pounding action is brought to life across lovingly detailed environments with crystal clear audio and full voice acting.", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2023-11-13T06:26:13", "background_image": "https://media.rawg.io/media/screenshots/b5c/b5c4a6f8e9d9778430a790e657c47568.jpg", "website": "", "rating": 4.33, "rating_top": 5, "added_by_status": {"owned": 5, "beaten": 1}, "playtime": 2, "achievements_count": 40, "ratings_count": 6, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "iOS"], "developers": ["Sky9 Games", "MOHD AKBAR"], "genres": ["Action", "RPG", "Simulation", "Indie"], "publishers": ["IndieArk", "MOHD AKBAR"], "esrb_rating": "Everyone 10+"}