{"id": 355237, "slug": "chess-cheats", "name": "Chess Cheats", "name_original": "Chess Cheats", "description": "**********<br/>All New Version to support the new \"Chess with Friends\" App!<br/>********** <br/><br/>Do you play Chess with Friends?  Do you want to totally annihilate your opponents? Avoid major Blunders? Improve your chess skills? Then this app is for you!!<br/><br/>This is simply the best app for helping you win your \"Chess with Friends\" matches!  <br/><br/>Includes Optical Character Recognition (OCR) to make importing your games fast and easy. All that is needed is a screenshot (press the power button and the home button at the same time to take a screenshot). No need to manually edit the location of all the pieces on the board!<br/><br/>This app can be used in a variety of ways including automatically finding the best possible move to make, helping to catch a blunder, or interactively exploring different move options.<br/><br/>Using this app is meant as a teaching tool to help improve your chess skills because you can easily experiment with different moves and have the computer automatically respond for your opponent! Or you can move for your opponent if you would prefer – through the many options and controls available.<br/><br/>**Please note: this app only works with screenshots from the \"New Chess with Friends\" app (and only works with the \"Classic\" board and pieces theme).  If you are using the original Chess with Friends check our original \"Chess Cheats\" (blue icon).<br/><br/>Feature Highlights:<br/>---------------------------------------<br/>- Automatic chess board and game piece recognition for the iPhone/ iPod touch / iPad (including both Retina and non-retina displays).   <br/>- Auto detection for who's turn it is and which color you are playing<br/>- Express button to automatically load the last image; makes importing games super fast!<br/>- Easily edit the board including adding an en passant square<br/>- The app can calculate the best move for you or your opponent at any time<br/>- E-mail a game in FEN notation for analysis elsewhere<br/>- In app help bubbles to help you learn to use the app<br/>- Customizable board colors (8 options) and chess pieces (6 options)<br/>- A strong chess engine! (Elo  greater than 2400)<br/><br/><br/>If you have any problems please contact us:  newchesscheats@ganotechnologies.com<br/><br/><br/>====================================<br/>Disclaimer:  Gano Technologies LLC is not in any way affiliated with Zynga, Inc. or their application New Chess with Friends.  New Chess with Friends is a registered trademark of Zynga Inc.", "metacritic": null, "released": "2016-08-11", "tba": false, "updated": "2019-07-30T06:53:50", "background_image": "https://media.rawg.io/media/screenshots/2ca/2ca61013a95f276781bcc2e3fff287e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gano Technologies"], "genres": ["Board Games", "Puzzle"], "publishers": ["Gano Technologies"], "esrb_rating": "Everyone 10+"}