{"id": 355234, "slug": "chess-problems-lite", "name": "Chess Problems Lite", "name_original": "Chess Problems Lite", "description": "A lite version of the Ultimate mate in 1 to 4+ chess puzzle apps! <br/><br/>Sharpen your chess skills!  Beginners and experienced players will enjoy solving these chess problems!<br/><br/>This app has 10 interactive chess problems ranging from easy mate in one move problems to very challenging mate in four moves. The object is to finish each game by forcing a checkmate in a given number of moves. In the full versions of this app there are a much larger number of classical puzzles collected from a variety of sources. These puzzles are fun to play and can be enjoyed at your leisure on your iPhone, iPod touch, and iPad.<br/><br/>Chess problems are especially useful for learning to play chess or anyone wanting to improve their skills.<br/><br/>New features added include:<br/>------------------------------<br/>- Completely revamped chess engine that is much stronger<br/><br/>- Timing clock is displayed while you are working on each puzzle. How long you take to solve a puzzle is stored.<br/><br/>- New options: more chess piece sets (total of 7) and more colors schemes (total of 7) including wood and marble. (Improved the options menu as well)<br/><br/>- Social Gaming:  Leaderboards to compare the number of puzzles you have solved with your friends and other players.  Facebook integration - including the ability to post your progress and ask your friends for help on a puzzle.<br/><br/>- Universal app - works on iPhone, iPod Touch, and iPad - high resolution graphics all around (where supported).<br/><br/>For even more chess puzzle challenges check out these apps:<br/>- Mate in 1 Puzzles <br/>- Mate in 2 Puzzles<br/>- Mate in 3 Puzzles  <br/>- Mate in 4+ Puzzles", "metacritic": null, "released": "2010-05-04", "tba": false, "updated": "2019-07-30T06:52:28", "background_image": "https://media.rawg.io/media/screenshots/cdf/cdf584b45aabca505fb462d7ddcd913c.jpg", "website": "http://www.gano.name/shawn/matepuzzles", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gano Technologies"], "genres": ["Board Games", "Puzzle"], "publishers": ["Gano Technologies"], "esrb_rating": "Everyone 10+"}