{"id": 355348, "slug": "checkers-no-1", "name": "Checkers № 1", "name_original": "Checkers № 1", "description": "“Checkers N°1” is the most downloaded checkers app in the world. It has the highest rate with highest number of user reviews in various countries where checkers is in demand (Mexico, Brazil, Italia, France, Spain, Belgium, Russia, Ukraine, Netherland,  …).<br/><br/>Realistic touch and feel, with its fluidity and simplicity, this game will evoke your old time childhood memories when you played with your family and friends. Moreover, for 1 player game, its scalable and fast AI lets you forget that you are playing against a computer. Enjoy the world leading Checkers game!<br/><br/>With this software, you will be able to play locally, against someone or against the computer. You will also be able  to play against anyone in the world through Game Center.<br/><br/>Key features (Free version):<br/>- Games against computer (4 levels, color option)<br/>- Online games with Game Center<br/>- 2 players game<br/>- Draw recognition and automatic draw propositions for single player games<br/>- \"Lose to win\" option against the computer: Lose all your checkers before the computer!<br/>- iPod compliant: Listen to your own music while playing (except for Game center games). Launch the music app after having launched the checkers app!<br/>- Leaderboards to compare your score<br/>- Achievement boards to get your level<br/>- Nice look and feel<br/><br/>Key features (Premium version):<br/>- no ads<br/>- AI difficulty level 4 and 5, very fast and smart<br/>- Automatic record of all the games, and easy replay of any of them<br/>- Possibility to unlock the pawns and move them anywhere off/on the board<br/>- Time limit games (like for chess)<br/>- Show board numbers option (iPad)<br/>- Delete button to come back to a previous board combination (2 players and single players game)<br/>- More points gained per game center game<br/>- Option to see the last move<br/><br/>A must have if you like strategic board games.", "metacritic": null, "released": "2011-03-04", "tba": false, "updated": "2019-07-30T09:15:36", "background_image": "https://media.rawg.io/media/screenshots/1a8/1a8c7cca0667f77de25d90cfbcaf4c24_2KeUVAJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Itchigoo"], "genres": ["Strategy", "Board Games"], "publishers": ["Harold CHATENET"], "esrb_rating": "Everyone 10+"}