{"id": 355318, "slug": "clicker-knight", "name": "Clicker Knight", "name_original": "Clicker Knight", "description": "Clicker Knight: Incremental Idle RPG<br/><br/>Travel through the wilderness, slaying monsters and collecting epic loot in this Idle RPG! Tap to cast spells, upgrade your hero with unique abilities and craft potions to defeat your enemies! Assign your stat points and click to win in Clicker Knight and epic incremental idle RPG! <br/><br/>This is an unique RPG clicker game. You’ll have to battle monsters, sell equipment, upgrade your skills, craft potions and cast spells to defeat tough enemies. Tap furiously to find hidden treasure in tons of different zones, making sure your tap hero has enough gear, health and items to keep progressing in this incremental RPG!<br/><br/>Clicker Knight: Incremental Idle RPG Features:<br/><br/>Explore!<br/>- Use your tap powers for epic loot!<br/>- Each zone is packed with tough monsters.<br/>- Craft unique gear and craft potions in an epic clicker!<br/><br/>Battle Monsters<br/>- Battle for rare loot!<br/>- Tap any monster that comes your way.<br/><br/>Unlock Pets<br/>-Unlock many different kinds of pets and level them up to evolve them. Each pet has a unique and powerful ability!<br/><br/>Collect Loot<br/>- Your idle hero needs epic loot to survive!<br/>- Find hidden loot and customize your hero.<br/><br/>Tons of Skills<br/>-Over 30 Skills you can learn in each of the 3 skill trees. <br/>-Over 15 additional Prestige system buffs!<br/><br/>Guilds<br/>-Recruit guild members<br/>-Build your guild hall<br/>-Compete to have your Guild be #1<br/><br/>Incremental Clicker Action<br/>- Play as much or as little as you like!<br/>- Your hero keep leveling up even when you are offline<br/>- Return to collect the loot and riches your hero collected while you were offline!<br/><br/>Lovers of RPG games and incremental clickers won’t be able to put down this idle monster battling RPG. Go on an epic tap quest, explore zones to battle monsters and defeat the tough dungeon bosses. You never know what could creep up on your hero- keep your tapping reflexes sharp in Clicker Knight!", "metacritic": null, "released": "2019-05-02", "tba": false, "updated": "2019-07-30T08:33:16", "background_image": "https://media.rawg.io/media/screenshots/3d7/3d72318e3d2b364da827e85a7a974048_LUETibp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Iron Horse Games"], "genres": ["RPG", "Simulation"], "publishers": ["Iron Horse Games"], "esrb_rating": "Teen"}