{"id": 355395, "slug": "sonar-beat-lite", "name": "Sonar Beat Lite", "name_original": "Sonar Beat Lite", "description": "Sonar Beat is a musical rhythm game with a twist: the notes follow a spiral structure, so the ones you miss will remain and will move forward to your center. If they reach it, you’re dead. You play through a radar interface using your sensor cone to detect enemies approaching the center. Gameplay randomness ensure they won't always appear on the same point every time you play, so be careful. You must destroy each enemy at the precise moment that your sensor gets in contact with it. If you fail, the enemy will come closer by and you will ultimately lose!<br/><br/>Compete in online leaderboards for the highest rank and challenge your friends by sharing your score in social media.<br/><br/>· https://www.youtube.com/watch?v=anTpDcU8qwE<br/>· https://www.youtube.com/watch?v=qxB793LIwak<br/><br/>FEATURES<br/><br/>· Crafted electronic music with underwater theme, 12 different tracks.<br/>· Unique and eye-catching graphics with different styles for each song.<br/>· Procedural levels, balanced between rhythm and randomness so each song is different every time you play.<br/>· Cross-platform play and saves. You can switch between mobile/computer/console at any time, keeping your user and highscores.<br/>· Tons of variety in a single play: many kinds of enemies and beat types throughout all the songs.", "metacritic": null, "released": "2019-06-06", "tba": false, "updated": "2019-07-30T10:18:25", "background_image": "https://media.rawg.io/media/screenshots/db3/db3088703b43d2c6a88f91f98d698c20_uB5Sfn0.jpg", "website": "http://www.lifezerogames.com/press/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Life Zero Entertainment"], "genres": ["Casual"], "publishers": ["Life Zero Entertainment"], "esrb_rating": "Everyone 10+"}