{"id": 355406, "slug": "the-executive-2", "name": "The Executive!", "name_original": "The Executive!", "description": "40% OFF SALE to celebrate the launch of MUL.MASH.TAB.BA.GAL.GAL!!!<br/><br/>Flame kick werewolves, perform thrilling acrobatic stunts, and run a trillion dollar mining company in Riverman Media’s combat-action masterpiece! <br/><br/>#2 Best-reviewed iOS game of 2015 - Metacritic.com<br/><br/>From the creators of the award-winning “Pizza Vs. Skeletons” comes The Executive: a fast-paced, cinematic, martial arts action game designed from the ground up for iPhone and iPad. You are the CEO of a company that has been infiltrated by werewolves, and it’s your job to save your employees, and eventually the entire city, from their dastardly schemes.<br/><br/>OUR PROMISE TO YOU: No ads. No getting suckered into buying more stuff later. The whole game, for one price, for all updates, forever.<br/><br/>The Executive combines a high-speed combat system, timing-based running and platforming, 120 hand-crafted levels, a full inventory of moves and upgrades, and a simple mining company simulation for earning money, all into one cohesive experience. The fighting engine evokes a cross between Street Fighter II and Zelda II: The Adventure of Link, with controls designed from scratch to be ideal for touch screens. The platforming (or “stunt”) segments require precise timing, similar to Elite Beat Agents but with an emphasis on visual timing instead of musical rhythm. Both of these mechanics are brought together by the SP bar, which allows you to execute gesture-based special moves like flame kicks, health restoration, and even morphing your character’s arm into a silver spike to impale foes.<br/><br/>The Executive uses Riverman Media’s proprietary animation system to bring to life its large, hand-drawn 2D sprites with an unprecedented amount of smoothness and detail. The Executive represents the pinnacle of Riverman Media’s research and development into new 2D graphics technology.<br/><br/>FEATURES<br/><br/>+ 120 levels, hand-crafted one pixel at a time. No randomly generated endless filler.<br/>+ Dozens of abilities and skills to learn<br/>+ Battle enemies and execute stunts in every level<br/>+ Over 50 unique enemies, each with their own intelligence, strengths, and weaknesses<br/>+ Invest in your mining company and earn money continuously<br/>+ 12 Menacing bosses that will require your strategy and skill to defeat<br/>+ Universal App: purchase it once, play forever on iPhone, iPad, and iPod Touch<br/>+ 12 Challenging achievements<br/>+ High-definition “Retina” graphics for all supported devices, Retina HD graphics on iPhone 6+<br/>+ iCloud support: touch the Book icon from the main menu to transfer progress between devices!<br/><br/>Not ready to buy? Try the first 10 levels in the FREE version! Once you're ready to upgrade to this version, your progress will transfer over automatically.<br/><br/>――――――――――<br/>Riverman Media is two brothers who have dedicated their lives to the art of 2D game making<br/>――――――――――<br/><br/>* Street Fighter 2, Zelda II: The Adventure of Link, and Elite Beat Agents are not affiliated with Riverman Media or The Executive.", "metacritic": null, "released": "2015-07-02", "tba": false, "updated": "2019-07-30T10:30:33", "background_image": "https://media.rawg.io/media/screenshots/a45/a458ddb7791990e5643f1851d19e4501_Y1PxmDl.jpg", "website": "http://rivermanmedia.com/projects/the-executive/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Riverman Media"], "genres": ["Action", "Adventure"], "publishers": ["Riverman Media"], "esrb_rating": "Everyone 10+"}