{"id": 355464, "slug": "flight-sim-air-cavalry-2019", "name": "Flight Sim Air Cavalry 2019", "name_original": "Flight Sim Air Cavalry 2019", "description": "More than 5,000,000 people around the world downloaded Air Cavalry flight sim!<br/>Get into the cockpit of the most advanced helicopters in the world, including the UH-60 Black Hawk, MV-22B Osprey, CH-47 Chinook, AH-64 Apache, UH-1 Iroquois, OH-6 Cayuse, AH-1Z Cobra, CH-53 Super Stallion, Eurocopter Tiger, Kiowa Warrior, Mi-24 Hind, Ka-50 Black Shark or Mi-8 Hip helicopter in various regional environments, building on your flying skills and experience. Enjoy infinite flight in legendary helicopters like a real combat pilot.<br/><br/>• IMMERSIVE GAMEPLAY<br/>You will experience the flight in famous combat &amp; rescue aircraft.<br/>Test your precision pilot skills, combat gunner skills and your own strategy planning.<br/><br/>• HUGE COLLECTION OF AIRCRAFT<br/>This flight sim offers well known aircraft types like Chinook, Cobra, Huey, Apache, Hind as well as super modern aircraft like Stealth-hawk, Osprey, Tiger, Kiowa and more.<br/>Choose from 15 choppers right now.<br/><br/>• DIFFERENT LOCATIONS<br/>You will fly in Afghanistan, snow environment with huge mountains, desert, Vietnam forrests, big cities or carrier ops in the middle of the ocean.<br/><br/>• GAME CENTER<br/>You will climb the leaderboards, unlock achievements and challenge friends.<br/><br/>Air Cavalry flight simulator offers next-gen console like quality graphics, ultimate physics of aircrafts and weapons. <br/><br/>- Join a Carrier Operations on USS Nimitz or Admiral Kuznetsov!<br/>- Fight and rescue in Afghanistan or Vietnam!<br/><br/>Complete Game Center milestones and see your progress against others. <br/><br/>Use your flight radar and weapon systems to practice engaging buildings and moving vehicles. <br/><br/>Features: <br/><br/>- 16 aircraft (more in developement)<br/>- Carrier Operations on USS Nimitz CVN 68<br/>- Transport operations with CH-47 Chinook or CH-53 Super Stallion<br/>- Apache front (gunners) and back seat (pilot) positions <br/>- Multiple regional environments <br/>- Refuel and rearm aircraft to continue flights <br/>- Destroyable buildings<br/>- Achievements via Game Center <br/>- Leaderboards <br/>- Realistic 3D virtual cockpits<br/>- Realistic weapon management and targeting systems <br/>- Realistic weapon system physics engine <br/>- And much more in development<br/>- iOS 12 optimization<br/>- iPhone X, XS, XR optimization <br/><br/>The continuing development of our advanced helicopter flight simulator will bring new aircraft and missions, so check back often! <br/><br/>*** check our other simulators ***<br/>- Apache SIM<br/>- Black Shark HD<br/>- Black Hawk 3D<br/>- Chinook Sim<br/>- Osprey v22 ops<br/><br/>We always look forward to hearing the views of our customers. You can contact us 24 / 7 directly using: <br/><br/>- email (realmobilesimulation@gmail.com) <br/>- twitter (@apache3dsim) <br/>- facebook (https://www.facebook.com/aircavalryapp) <br/>- website (http://www.realmobilesimulation.com)", "metacritic": null, "released": "2014-01-10", "tba": false, "updated": "2019-07-30T11:51:21", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4cd2a6d81ae7aea85c799462acbe86b_NHTL5tj.jpg", "website": "http://www.realmobilesimulation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iTechGen"], "genres": ["Simulation", "Racing"], "publishers": ["Filip Kasik"], "esrb_rating": "Everyone 10+"}