{"id": 355407, "slug": "the-executive-lite", "name": "The Executive Lite", "name_original": "The Executive Lite", "description": "Full version is 40% OFF for a VERY LIMITED TIME!!!<br/><br/>Flame kick werewolves, perform thrilling acrobatic stunts, and run a trillion dollar mining company in Riverman Media’s combat-action masterpiece!<br/><br/>Play 10 levels of the iOS megahit The Executive for FREE, then transfer your progress automatically to the FULL VERSION!<br/><br/>From the creators of the award-winning “Pizza Vs. Skeletons” comes The Executive: a fast-paced, cinematic, martial arts action game designed from the ground up for iPhone and iPad. You are the CEO of a company that has been infiltrated by werewolves, and it’s your job to save your employees, and eventually the entire city, from their dastardly schemes.<br/><br/>FEATURES<br/><br/>+ 10 levels, hand-crafted one pixel at a time (120 in the full version)<br/>+ Several special moves and skills to learn (dozens in the full version)<br/>+ Battle enemies and execute stunts in every level<br/>+ Many unique enemies, each with their own behavior (over 50 in the full version)<br/>+ Invest in your mining company and earn money continuously<br/>+ 12 Challenging achievements, shared with the full version<br/>+ A surprising and difficult final boss <br/>+ High-definition “Retina” graphics for all supported devices and Retina HD graphics on iPhone 6+ in the Full Version<br/> <br/>Note: To ensure that your progress is properly transfered to the Full Version, The Executive, leave this version installed before running the Full Version for the first time.<br/><br/>――――――――――<br/>Riverman Media is two brothers who have dedicated their lives to the art of 2D game making<br/>――――――――――", "metacritic": null, "released": "2015-12-03", "tba": false, "updated": "2019-07-30T10:30:57", "background_image": "https://media.rawg.io/media/screenshots/957/9577ab672ce83c8adeb3fcc3a4b73550_WQGdOYT.jpg", "website": "http://rivermanmedia.com/projects/the-executive/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Riverman Media"], "genres": ["Action", "Adventure"], "publishers": ["Riverman Media"], "esrb_rating": "Everyone 10+"}