{"id": 355447, "slug": "invaders-2048", "name": "Invaders 2048", "name_original": "Invaders 2048", "description": "Invaders 2048 is a classic shoot ‘em up recreated with 2048 puzzle.  <br/>Merge the same blocks to build higher missiles and experience new invaders on the way. <br/>Enjoy the classic pixelated enemy alien graphic just like the good old days.<br/><br/>HOW TO PLAY<br/>-Invaders 2048 is a fixed shooter in which the player mergers the 2048 tiles to make missiles by moving it horizontally or vertically. <br/>-Players can choose to fire and attack when they wish by long-pressing the number tiles. <br/>-The aim is to defeat the rows of space aliens slowly moving down the rows. <br/>-Players defeats space aliens and bosses and allow to play the next level. <br/>-Each invader boss has unique skills that get in the player’s way. <br/>-As more space aliens are defeated, the game’s music speed up. <br/><br/>It’s Dangerously Fun! It’s Free! Invaders, Anyone? <br/><br/>FOR PLAYERS WHO:<br/>1) Are big fans of the free 2048 Games<br/>2) Are big fans of the Classic Space Shooting Games<br/>3) Are big fans of Sci-fi  &amp; Space genre<br/>4) Are tired of the same free games<br/>5) Are looking for a new experience<br/>7) Only keep games worth playing<br/>8) Love uploading their game plays &amp; replays on Youtube<br/><br/>Simple gameplay and exciting challenges<br/>-Swipe numbered blocks to merge them <br/>-Find the right time to shoot them all<br/>-Defend your kind from space invaders<br/><br/>Classic concept from the golden age of arcade video game is back with 2048 puzzle.<br/><br/>The objective of Invaders 2048 is to make missiles and destroy alien enemies.<br/>The game ends when the aliens reach and invade our area.<br/>Different alien bosses have unique skills that are more challenging. <br/><br/>Producer : Sangpil Moon @moondaesa<br/>Client Programmer : Geonhee Han<br/>Graphic Design : Yewon Lee &amp; Heyme Kim<br/><br/><br/>Privacy Policy: http://www.cogooland.com/COGOO_PRIVACY_POLICY.html<br/>Terms of Use: http://www.cogooland.com/COGOO_TERMS_OF_USE.html", "metacritic": null, "released": "2019-01-30", "tba": false, "updated": "2019-07-30T11:34:53", "background_image": "https://media.rawg.io/media/screenshots/f34/f3473bdc23e795390368cdbebf7c2222.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cogoo"], "genres": ["Casual", "Puzzle"], "publishers": ["Cogoo"], "esrb_rating": "Everyone 10+"}