{"id": 355443, "slug": "world-of-mines", "name": "World of Mines!", "name_original": "World of Mines!", "description": "World of Mines is a classic, throwback PC game with a World Map twist. <br/>Inspired by the original game written for many computing platforms since the 1960s. <br/><br/>COGOO INITIATIVE<br/>Team Cogoo has created World of Mines as a small and humble campaign to help promote 2025 Completion Challenge and to raise awareness in our community. Whether you have 10 minutes, one hour, or plenty of time, you can help build  a world free of land mines and promote the rights of landmine victims too! <br/><br/>THE WORLD IS STILL IN DANGER OF LANDMINES<br/>The use of land mine is controversial because of their potential as indiscriminate weapons. They can remain dangerous many years after a conflict has ended, harming civilians and the economy. 78 countries are contaminated with land mines and 15000+ people are killed every year. Approximately 80% of land mine casualties are civilian, with children as the most affected age group. Most Killings occur in times of peace. <br/><br/>If you like old classic games such as chess, checkers, backgammon, solitaire, freecell as well as classic puzzle games like sudoku, tetris and crossword puzzles then this game is for you!<br/><br/>GAME PLAY<br/>-Save the world from landmines by finding bombs<br/>-Easy to control <br/>-Best, smoothest, fastest interface of any Mines game<br/>-First tap luck<br/>-Flag Mode: Turn on flag mode to mark tiles you think are bombs quickly<br/>-177 Countries for hours of fun. (Countries and number of bombs don’t necessarily have a meaning)<br/>-Variety of map sizes and shapes<br/><br/>HOW TO PLAY<br/>The objective of the game is to clear a country map containing hidden “mines” or bombs without detonating any of them, with help from clues about the number or neighboring mines in each field. The player is initially presented with a world map. The Player can select and choose to play a specific country by touching the country on the map. The game is played by revealing squares of the grid by touching each square. If a square containing a mine is revealed, the player loses the game. If no mine is revealed, a digit is instead displayed in the square, indicating how many adjacent squares contains mines. If no mines are adjacent, the square becomes blank, and all adjacent squares will be recursively revealed. The player uses this information to deduce the contents of other squares, and may either safely reveal each square or mark the square as containing a mine. <br/><br/>If you love the game and care to provide feedback, please join our Facebook group and share you thoughts on future improvements.", "metacritic": null, "released": "2018-12-05", "tba": false, "updated": "2019-07-30T11:34:27", "background_image": "https://media.rawg.io/media/screenshots/789/78955c497acd488ff46099e4550e473a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["Cogoo"], "genres": ["Board Games", "Puzzle"], "publishers": ["Cogoo"], "esrb_rating": null}