{"id": 355539, "slug": "my-virtual-girlfriend-love", "name": "My Virtual Girlfriend Love", "name_original": "My Virtual Girlfriend Love", "description": "My Virtual Girlfriend is the # 1 dating simulation game available - no other games like that!<br/>Features on MSNBC, Kotaku and Lopez Tonight!<br/><br/>Please note: The game text reads in English language only<br/><br/>My Virtual Girlfriend Love is a funny and flirtatious dating game where the goal is to choose a date, then romance your way into her heart until she falls in love with you.<br/><br/>There are thousands of beautiful girls to choose from, all with unique personalities and looks.<br/><br/>Engage in conversation. Go on activities like mini golf or dinner dates, offer gifts like new clothes and she will even wear them for you. She even responds to your touch.<br/><br/>Every choice you make has rewards or consequences when you try to get points with her. As you progress in the game, she will grow to like you more and more. With each new level achieved, it will open a new way of interacting with him and there are up to 35+ levels in the game.<br/>Do the right thing and she will love you, but makes the wrong move and she will leave you.<br/><br/><br/>Features:<br/><br/>• 1000's of beautiful and unique girls to date<br/>• Some ways to interact - through conversation, action, activities and touch<br/>• Girls can also be customized to your liking through Custom Editor girlfriends. Change face, hair, skin, clothing, features, bobble head, body proportions.<br/>• 35+ levels of progressive game play<br/>• Vampire and Zombie girlfriends<br/>• Funny personalities<br/>• Smart artificial intelligence.<br/>• Hi res 3D graphics with camera controls.<br/>• Achievements and awards<br/>• Special clothes - bikinis, swimwear, clothes, cosplay and more!<br/><br/>It's all about flirting, love, dating and romance.<br/><br/>Well, what are you waiting for? <br/>Level up your dating game by playing My Virtual Girlfriend Love!<br/><br/>Youtube Trailer:<br/>http://www.youtube.com/watch?v=71ibW3ibkOI", "metacritic": null, "released": "2010-12-22", "tba": false, "updated": "2019-07-30T13:31:45", "background_image": "https://media.rawg.io/media/screenshots/8d9/8d9bbcac8cd05515ecaa17c7fa254620.jpg", "website": "http://www.myvirtualgirlfriendgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wet Productions"], "genres": ["RPG", "Simulation"], "publishers": ["WET Productions"], "esrb_rating": "Mature"}