{"id": 355544, "slug": "winx-club-butterflix-adventure", "name": "Winx Club Butterflix Adventure", "name_original": "Winx Club Butterflix Adventure", "description": "Winx Club: Alfea Butterflix Adventures! <br/>Bringing you the best Winx game experience to mobile ever. <br/><br/>Experience a gorgeous Winx world, go on your own adventures, solve tricky puzzles, explore hidden secrets and get the latest Winx fashions too! If you liked the Playstation version of Winx Club back in 2004, you will love this game!<br/><br/>- Choose any of the Winx characters. Be fashionable, intelligent and brave! In this new and beautiful 3D Adventure set in Alfea College for fairies!<br/><br/>- Seek out the mysterious keys, investigate new and exciting rooms and uncover hidden treasures. Collect over 150 exclusive Trading cards too.<br/><br/>- Transform into Butterflix, battle Brafilius and his pesky Gemlins. Use spells to defeat them all!<br/><br/>- Attract new students, interact with them and share your student population with your friends through the global high-score table.<br/><br/>-  Wear unique outfits from season 7 with even more fashionable clothes to follow soon.<br/><br/>- There are also many mind-bending puzzles to put your brain to the test.<br/><br/>-  Introducing an amazing new control system with 360 degrees views!<br/><br/>Parents please note: the game does include IN-APP purchases which are optional, IN-APP purchases can be switched off in your phone / tablet settings menu.<br/><br/>Winx Club copyright 2015 Rainbow Srl. All Rights Reserved. Winx Club and all related logos, characters and elements are trademark of Rainbow Srl. Series created by Iginio Straffi.<br/><br/>For exclusive Tips and Hints, please visit us on Facebook &amp; Youtube.<br/><br/>www.facebook.com/playwinxclub<br/>www.youtube.com/playwinxclub<br/><br/><br/>Wow 5 Stars<br/>by IcyMalloy - Version - 1.0.0 - Sep 1, 2015<br/><br/>Tsumanga and em studios as u can see by my tittle this game is just wow U guys are absolutely amazing can't wait for updates to this game and othersSirenix power (daphne) and even Winx fairy school(clubs)<br/><br/>Awesome App ! 5 Stars<br/>by WinxClubLibanYT - Version - 1.0.0 - Sep 4, 2015<br/><br/>Awesome App ! Keep Doing Like That ! I Suggest It For Everyone !", "metacritic": null, "released": "2015-08-24", "tba": false, "updated": "2019-07-30T13:44:47", "background_image": "https://media.rawg.io/media/screenshots/86f/86f55e97ff5dd633861029334d1cd9bd_cudrVHp.jpg", "website": "http://www.playwinxclub.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tsumanga Studios"], "genres": ["Adventure", "RPG"], "publishers": ["Tsumanga Studios"], "esrb_rating": "Everyone 10+"}