{"id": 355582, "slug": "bow-hunting-calls-bluetooth-compatible", "name": "Bow Hunting Calls - BLUETOOTH COMPATIBLE", "name_original": "Bow Hunting Calls - BLUETOOTH COMPATIBLE", "description": "Save hundreds of dollars with this bow hunting calls app for archery hunting vs. buying multiple expensive eCaller tapes or systems.  Simply connect the app to any Bluetooth speaker and you have a bow hunting call system using these hunting calls.<br/><br/>Bow Hunting Calls - Premium Hunting Calls For Archery Hunting Success - BLUETOOTH COMPATIBLE app gives you archery calls for Whitetail Deer, Elk, Moose, bear and turkeys.  These hunting calls are clear and crisp perfect for getting the interest of nearby hunting game.  Over 25 game calls for big game hunting included. <br/><br/>FEATURES: <br/>-  25+ bow hunting calls for game hunting<br/>-  Effective, realistic and clear audio to bring in game including whitetail deer, elk, moose, bear and turkeys<br/>-  Bluetooth compatible to sync to a Bluetooth speaker in the field  <br/>-  The game sounds can play in the background of your phone allowing you to text, take pictures and surf the internet without disrupting the game calling sounds<br/>-  Long soundtracks allow you to set the call and focus on hunting <br/>-  Connect to your speaker system with audio cables or Bluetooth (cables not included)  <br/>-  No more forgetting to grab your MP3 player or memory cards, you always have your phone with you  <br/>-  E-Calling audio for hunting at a fraction of the cost of purchasing multiple soundtracks and memory cards separately<br/><br/>Soundtracks included in “Big Game Hunting Calls\" <br/>-  Bear Roars and Huffs<br/>-  Bear Growls<br/>-  Bear Cub Distress<br/>-  Moose Grunt<br/>-  Moose Bull Grunt<br/>-  Moose Cow<br/>-  Moose Rattling<br/>-  Moose OOH-WAH<br/>-  Moose Thrashing<br/>-  Deer Buck Grunt<br/>-  Deer Antler Rattle<br/>-  Dear Doe Grunt<br/>-  Dear Doe Bleat<br/>-  Dear Lost Fawn<br/>-  Elk Bugle #1<br/>-  Elk Bugle #2<br/>-  Elk Bugle #3<br/>-  Elk Grunt #1<br/>-  Elk Grunt #2<br/>-  Elk Estrus<br/>-  Elk Chirp<br/>-  Elk Moan<br/>-  Turkey Gobble<br/>-  Turkey Gobbles &amp; Yelps<br/>-  Turkey Aggressive Gobbles<br/>-  Turkey Purrs<br/>-  Turkey Excited Young Hen Yelps<br/>-  Turkey Raspy Hen Yelps<br/>-  Turkey Cuts<br/><br/>Download “Bow Hunting Calls - Premium Hunting Calls For Archery Hunting Success - BLUETOOTH COMPATIBLE” and start having archery hunting success today!", "metacritic": null, "released": "2016-06-24", "tba": false, "updated": "2019-07-30T15:15:22", "background_image": "https://media.rawg.io/media/screenshots/862/8622af53084e1ab22eb24f8ce951577e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Action", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Mature"}