{"id": 355579, "slug": "real-predator-calls-lite-real-predator-hunting-cal", "name": "REAL Predator Calls LITE - REAL PREDATOR HUNTING CALLS!", "name_original": "REAL Predator Calls LITE - REAL PREDATOR HUNTING CALLS!", "description": "Save hundreds of dollars with this predator hunting calls bundle vs. buying expensive eCaller systems.  Simply connect the app to any Bluetooth speaker and you have an instant predator caller system<br/><br/>The REAL Predator Hunting Calls app provides you predator hunting calls at your fingertips.  These predator soundtracks are clear, crisp, lifelike and recorded from REAL predators.  Soundtracks are from coyotes, wolves, fox, mountain lions and bobcats.   Over 10 predator call soundtracks included. <br/><br/>FEATURES: <br/>-  10 + predator hunting soundtracks<br/>-  Effective, realistic and clear audio to bring in wary predators<br/>-  Bluetooth compatible to sync to a Bluetooth speaker in the field  <br/>-  Sounds can play in the background of your phone allowing you to text, take pictures and surf the internet without disrupting the predator calling sounds<br/>-  Long soundtracks allow you to set the call and focus on predator hunting <br/>-  Connect to your speaker system with audio cables or Bluetooth (cables not included)  <br/>-  No more forgetting to grab your MP3 player or memory cards, you always have your phone with you  <br/>-  E-Calling audio for coyotes at a fraction of the cost of purchasing multiple soundtracks and memory cards separately<br/><br/>Soundtracks included in “REAL Predator Hunting\" <br/>-  Coyote Howl - coyote hunting calls<br/>-  Coyote Fight <br/>-  Mountain Lion Whistle<br/>-  Mountain Lion Roars<br/>-  Fox Barks<br/>-  Baby Fox Distress<br/>-  Bobcat Growls<br/>-  Lone Wolf Howl<br/>-  Wolf Fight<br/>-  Squirrel Distress<br/>-  Mouse Squeaker<br/><br/><br/>Download “REAL Predator Hunting Calls” and start having coyote hunting success today!", "metacritic": null, "released": "2016-06-10", "tba": false, "updated": "2019-07-30T15:13:33", "background_image": "https://media.rawg.io/media/screenshots/b1d/b1d238f9ccf1486cc6db08652e346010.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GuideHunting L. L. C."], "genres": ["Adventure", "Sports"], "publishers": ["GuideHunting L. L. C."], "esrb_rating": "Everyone 10+"}