{"id": 355523, "slug": "tap-star-world-soccer", "name": "Tap Star: World Soccer", "name_original": "Tap Star: World Soccer", "description": "Play for your country in a global online multiplayer soccer tournament! Can you help your side win the World Soccer Cup?<br/><br/>-GLOBAL ONLINE MULTIPLAYER TOURNAMENT<br/>Choose to play for one of 32 competing nations from around the globe. Play at your very best to help YOUR country lift the World Soccer Cup when the tournament ends on the 13th of July!<br/><br/>-FOUR ADDICTIVE SOCCER MINIGAMES<br/>Strike the ball into the back of the net, dive between goal posts to block shots, string together passes in midfield and head the ball home from corner kicks!<br/><br/>-INCREDIBLY SIMPLE CONTROLS<br/>It couldn’t be easier to play! Simply tap anywhere on the screen to score, save and pass! Master perfect timing to gain the highest score possible, and help your country to victory.<br/><br/>-WORLDWIDE AND COUNTRY LEADERBOARDS<br/>Worldwide leaderboards show you which country is leading the tournament. Country leaderboards show you the best players. Can you break into the Top 100 and play for your country?<br/><br/>-FOUR TROPHIES TO BE WON<br/>Trophies are shown in a special trophy room. As well as a trophy for the top team, extra ones are given for the most active players, the most fans, and the world’s top eleven players! Every player who joins in contributes!<br/><br/>The Tap Star World Soccer Tournament ends on Sunday the 13th of July. The Top 100 players from each country contribute to their country’s score. The country with the highest score at the end of the tournament wins! Your country’s name and flag could be proudly displayed in the game forevermore!<br/><br/><br/>Music by Kevin MacLeod", "metacritic": null, "released": "2014-06-15", "tba": false, "updated": "2019-07-30T13:15:00", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e32ae3140100d4732caf5c8a193d0f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameDigits"], "genres": ["Sports", "Casual"], "publishers": ["GameDigits"], "esrb_rating": "Everyone 10+"}