{"id": 355743, "slug": "solitaire-grand-harvest-tripeaks", "name": "Solitaire - Grand Harvest - Tripeaks", "name_original": "Solitaire - Grand Harvest - Tripeaks", "description": "★ FREE TRIPEAKS SOLITAIRE ★<br/><br/> Farm your way through relaxing, challenging, and FREE Tripeaks solitaire card games!<br/><br/>If you love classic free solitaire games like Klondike, Pyramid, FreeCell, or Spider solitaire, you’re going to love the Tri-peaks solitaire experience of Solitaire – Grand Harvest.<br/><br/>♠ Join the fun - get farming and card-flipping as both your crops and your coins grow as you play fun tripeaks solitaire card games for free!<br/>♥ Clear each level on every field as you flip your cards and harvest your crops. It’s fun, it's FREE - and the most rewarding free tripeaks solitaire game you’ve ever played! <br/>♦ Complete fun solitaire Missions every day for HUGE rewards including thousands of solitaire credits and power-ups!<br/><br/>This isn't one of your standard free tripeaks solitaire games - this is Solitaire - Grand Harvest tripeaks!<br/><br/> Fun REWARDS &amp; Exciting Tripeaks Solitaire Games! <br/>Enjoy all of the excitement that tripeaks solitaire games have to offer, with FREE solitaire bonuses HOURLY - harvest your crops every hour for even more tripeaks solitaire rewards! <br/><br/>♣ Get flipping, harvesting, and join exciting tripeaks solitaire missions and challenges for even MORE free solitaire rewards and bonuses! <br/>♦ Level up your solitaire game - clear your cards and receive rewards as you harvest each farm and field! The better your card flip, the better the tripeaks solitaire game rewards!<br/><br/>Need for more awesome solitaire bonuses? SPIN the BONUS WHEEL for extra tripeaks solitaire bonuses including FREE coins, EXTRA cards, FREE solitaire rounds and EXTRA harvests! In a tight spot? Use your coins for WILD cards - got a long card streak you don't want to break? Use a WILD card and play any card in its place!<br/><br/> Get SOCIAL and Get REWARDED! <br/>Tripeaks solitaire games are even more fun with friends! <br/>♠ Get 10,000 FREE COINS when you invite your friends to play their own tripeaks farming solitaire games - send them a link or Facebook invite to have them join the tripeaks farming fun - then watch them make their way around their own farms, or send them some solitaire cards!  <br/>♥ Go VIP: Harvest, farm, and card flip your way to VIP tripeaks solitaire levels and earn exciting rewards - but be warned, you’ll need to harvest and think strategically!  <br/><br/> Download and Play Solitaire - Grand Harvest NOW! <br/><br/>Your crops and cards are waiting for your harvest, and these tripeaks solitaire games won't play themselves! Swing by the farm, flip your cards, and download one of the most exciting solitaire games of all: play Solitaire - Grand Harvest tripeaks now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:09:33", "background_image": "https://media.rawg.io/media/screenshots/bfb/bfb1f4f26f4a456eb170a540005c6cd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Supertreat"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}