{"id": 355770, "slug": "idle-supermarket-tycoon-tiny-shop-game", "name": "Idle Supermarket Tycoon - Tiny Shop Game", "name_original": "Idle Supermarket Tycoon - Tiny Shop Game", "description": "Ready to be rich?<br/><br/>Become the richest supermarket entrepreneur!<br/><br/>Build your own business, earn money, and become the best supermarket tycoon in the world!<br/><br/>Start with a mini-mart and turn it into a major supermarket business. Build a bakery, sell fruit and vegetables, offer high-quality fish and meat. Run your own perfume and electronics departments. Let the customers fill their shopping carts!<br/><br/>Research new features to improve the quality of your products, offers, and departments. Make your business grow!<br/><br/>Become the best supermarket manager. Hire sellers and make them increase your sales and profits. Set the salary of the employees from different departments. Take care of your customers too, offering them a wider range of options and healthy products. Build a huge parking lot where they can safely leave their vehicles while they shop.<br/><br/>Develop different marketing strategies to attract potential and existing customers. Choose the best products and improve your research to offer the best deals to your customers. Their opinion and feedback is critical to run a profitable business. Happy customers are returning customers!<br/><br/>If you like idle and tapping games, you will enjoy this casual supermarket management game. Idle Supermarket Tycoon is an easy-to-play game where you run your own business with different product departments. Make important management decisions to build your empire and transform your small supermarket into one of the greatest in the world!<br/><br/>Features:<br/>- Casual and easy gameplay<br/>- Different challenges to complete<br/>- Amazing animations and 3D graphics<br/>- Unique products to sell!<br/>- Make important managing decisions to expand your business<br/>- Save your progress in the cloud and recover it if you change your device", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:28:59", "background_image": "https://media.rawg.io/media/screenshots/7c2/7c25334d135ab57238efcb95270144ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Codigames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}