{"id": 355745, "slug": "mountain-climb-stunt", "name": "Mountain Climb: Stunt", "name_original": "Mountain Climb: Stunt", "description": "Mountain Climb: Stunt is a racing game in which you need to climb the track established between two mountains by your car that has realistic driving dynamics. <br/><br/>A brand new game from the producer of Mountain Climb 4x4 game! Hill climb, jump from the hills.. You have the complete control of the vehicle while climbing up the mountains and hills. Stunts, becoming increasingly difficult and more fun, have duration times specially determined. Before the time is up, you must race with yourself first and then try to finish the stunt as soon as possible. If you want to play again the parts that you could not complete with 3 stars, you can race with the ghost driver, meaning your own score, and get ahead of it. Remember! In the races that you complete with 3 stars, you win 2 times more prizes that the ones you win normally. With the prize money you win, you can buy new cars, customize your cars.<br/><br/>FEATURES<br/><br/>•\tCompletely real vehicle physique. Your car moves the way you want it to, there is no <br/>        artificial intelligence interference.<br/>•\t5 different cars with four wheel drive (4x4) system (Soon many more!)<br/>•\tChanging environmental graphics as you play so that you do not get bored.<br/>•\tSpecially designed parts that will make you addicted.<br/>•\tHigh graphics quality even on phones with low equipment.<br/>•\tEvery week, 5 new parts and every month 1 new car.<br/><br/><br/>HOW TO PLAY? <br/><br/>•     If you want to experience a realistic car driving experience, you should choose steering <br/>      wheel and pedal. If you think it's difficult to control steering wheel and pedal, entering <br/>      the settings you can choose the buttons that allow you to go left and right. <br/><br/>•     Before the time is up, you must climb the hills to the mountain through the tracks. If <br/>       your time is up before climbing up the mountain, you can buy an extra 20 seconds by <br/>       the coins you won or watching video.<br/><br/>•     In case you pass the checkpoint in the Stunts, even if you fall from the cliff you can go <br/>       back to that point by buying.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:11:31", "background_image": "https://media.rawg.io/media/screenshots/bd0/bd0c207a647003d5aeaed0dbd72c5037.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Silevel Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}