{"id": 355857, "slug": "bingo-quest-summer-garden-adventure", "name": "Bingo Quest - Summer Garden Adventure", "name_original": "Bingo Quest - Summer Garden Adventure", "description": "AYOH - Shout out a cheer! Bingo Quest SUMMER Garden is here!  Featuring ALL NEW artwork showcasing the beauty of the season!<br/><br/>Travel along the map into 4 picturesque Summer worlds. Walk through manicured flower gardens, unruly and mysterious forests, and even with the occasional beautiful beast! Are you ready to discover all that the newest Bingo Quest has to offer? <br/><br/>IMMERSE YOURSELF IN THE BLOOMING WORLD OF BINGO QUEST - SUMMER GARDEN ADVENTURE! <br/>Bingo Quest Summer Garden will take you on an adventure through the hot summer sun featuring beautiful artwork and relaxing scenery. An excellent free and fun bingo game featuring offline play!<br/><br/><br/>ADVENTURE THROUGH BEAUTIFUL LANDS WITH 80 LEVELS OF FREE BINGO<br/>As you progress through our free bingo game adventure, you’ll have the chance to explore new areas in the land of four seasons.  Adore the summer birds and waterfalls along your bingo journey and, with 80 levels of free bingo waiting for you in the gardens, you’ll have hours of fun in this beautiful garden land! You can even play offline!<br/><br/>UNLOCK STUNNING FREE BINGO QUEST: SUMMER ADVENTURE ARTWORK<br/>Collect puzzle pieces as you play bingo with the the summer babies – use these puzzle pieces to unlock beautifully illustrated artwork of the otherworldly garden realm. Collect graphics of detailed, beautiful gardens and flowers as you progress through the game. Can you collect them all? <br/><br/>SPIN THE MAGICAL WHEEL OF FORTUNE<br/>Every day you can visit the wheel of fortune – rumored to give those who spin it a free reward every 24 hours. Receive extra daubers, coins, keys and more, so be sure to visit every day and claim your free prize!<br/><br/>---------------------------------------------------------------------------------<br/>BINGO QUEST SUMMER GARDEN ADVENTURE – HIGHLIGHTS<br/>---------------------------------------------------------------------------------<br/><br/>★ Fun, free bingo game for all ages<br/>★ Play through 80 levels of fantastic free bingo<br/>★ Explore different parts of the beautiful garden worlds, each with their own dauber<br/>★ Unlock stunning artwork of the wondrous gardens and flowers<br/>★ Spin the magical wheel of fortune for free bingo prizes and rewards<br/>★ Collect free coins and use them to buy power ups to help on your bingo adventure<br/>★ Use your keys to unlock treasure chests at the end of each level – what could they contain?<br/>★ Change the bingo caller speed<br/>★ Play Bingo Quest offline – no internet connection required! <br/><br/>For a refreshing, fun and free bingo experience, look no further than Bingo Quest Summer Garden Adventure!. Full of beauty and adventure, you’ll have hours of fun playing bingo in the beautiful garden paradise. Why play anywhere else? <br/><br/><br/>========================================================================<br/>COME AND PLAY BINGO IN THE SUMMER GARDENS – DOWNLOAD BINGO QUEST FOR FREE TODAY!<br/>========================================================================", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:33:56", "background_image": "https://media.rawg.io/media/screenshots/979/979e5f98403cd2c6e31994a648ced565.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FGL Indie Showcase"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}