{"id": 355866, "slug": "galaxy-shooter-falcon-squad", "name": "Galaxy Shooter - Falcon Squad", "name_original": "Galaxy Shooter - Falcon Squad", "description": "In a near future, human conquered all planets in the Solar System, thus became the mightiest race in the Galaxy. Sensing the potential threat, all other races rallied their armed forces, bending on destroying the human race.<br/>Humans had suffered from a sudden attack, lost many space colonies in the process. You, once a hero of classic time, was living in seclusion, now return to ride your own fighter aircraft in the battle against evil Alien Forces.<br/>The game has classic pixel style and Danmaku barrage of bullet hell shooter.<br/>Defend the galaxy from alien attacks, we need you!<br/>FEATURES<br/>- Fantastic visual: Gorgeous Pixel graphics, which reminds of old school retro games, is best fitting for vertical shooters. Epic exciting sky battles are waiting for the arrival of a true hero.  <br/>- Exciting Campaign: More than 90 levels full of different challenging enemies and breathtaking action!<br/>- Epic Boss: Wipe out swarm of minions before challenging tough and fierce big Boss battles. Taste the Danmaku barrage of bullets!<br/>- Perfect Shoot ‘em up: Lots of fighter jets, supporting drones and gorgeous wings, ammunitions and guns, with various upgrade options to choose from, a full armory of high technologies to customize your partner!<br/>- More additional mode: Experience more of true space battles in different modes like PvP, Endless, Tournament,… or taking part in live events for even more rewards and excitement. <br/>- Unique PvP battles: Challenge your friends or random players through PVP battles! Fight and raise your rank to the top of the global leaderboard!<br/>- Retro modernized: Played or didn’t play Shmup (STG) game before? No matter, this is a Super-easy control game, so easy that a tutorial is not even needed! This top-down shooter will make you feel awesome and relive the old feeling of playing scrolling game! <br/>Lead the humanity and bring us back to our glory day again. The force is with you!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:38:43", "background_image": "https://media.rawg.io/media/screenshots/ca3/ca318cfe7fed046001674516ab3bf89c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ONESOFT"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone"}