{"id": 355864, "slug": "poker-face-texas-holdem-poker-with-friends", "name": "Poker Face - Texas Holdem‏ Poker with Friends", "name_original": "Poker Face - Texas Holdem‏ Poker with Friends", "description": "●● Playing poker with Avatar is sooo last year. ●●<br/> <br/>Pokerface, #1 Group Video Chat Poker game  that enables friends to play and connect via group video chat around a poker table, It’s simple and synchronous up to 5 people at the same time, and now you and your friends can meet for your poker night - wherever you are ;)<br/> <br/>Will you be able to bluff your friends? Download Poker Face Now: Play Poker with Friends | Multiplayer and let’s see what you’ve got!!!<br/>Get up to $1,000,000 welcome bonus.<br/> <br/>◉ LIVE FRIENDS:<br/>Play Texas Hold'em Poker with your friends anytime anywhere!<br/>Jump and invite your friends to tables in one click. We empower people to have more frequent conversations and fun with the people they care about most.<br/> <br/>◉ WORLDWIDE:<br/>Buy-in and play friendly poker with your friends and their friends too and meet new poker players across the globe.<br/><br/>Social Poker:<br/>Wherever you are, wherever they are, play poker with buddies in a tap of a screen! Watch their reactions, communicate as if they’re sitting right beside you. That’s what Poker Face is all about - The only REAL Social Poker App!<br/> <br/>MAIN FEATURES:<br/> <br/>Group Video Chat Poker Game:<br/>Live group video chat with up to 5 people at a time!<br/> <br/>Lucky Bonus:<br/>Get exciting prizes from the wheel every 4 hours!<br/> <br/>Fair Play:<br/>Fair hand dealing. The cards in the game are shuffled randomly to provide you the best Texas hold'em experience!<br/> <br/>Look in your opponent’s eyes!<br/>Sheer luck will not do anymore. You’ll have to work your entire body to win this game! Feel the adrenaline rush throughout the fight, and they will be watching every movement you make. Can you keep them in the game and win the pot?<br/> <br/>♠🍀♠ Put on your poker face strategy, feel the heat, and bet like a real VIP poker player! Download Poker Face NOW!!! ♠🍀♠   <br/> <br/>Connect with us on social:<br/>Facebook:  https://facebook.com/joinpokerface<br/>Twitter:  @pokerface_game<br/>Instagram:  @pokerface_game<br/> <br/>*Practice or success at a social poker casino gaming does not imply future success at 'real money' gambling.<br/>*This game is intended for an adult audience for amusement purposes only and does not offer 'real money' gambling, or an opportunity to win real money or prizes based gameplay.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:37:39", "background_image": "https://media.rawg.io/media/screenshots/575/5756f1974820ddaf76c5e6d8ba857749.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Comunix"], "genres": ["Card"], "publishers": [], "esrb_rating": "Teen"}