{"id": 355819, "slug": "the-galaxy-survivor", "name": "THE GALAXY: SURVIVOR", "name_original": "THE GALAXY: SURVIVOR", "description": "*** NOW IS SALE -75% !! DO NOT MISS***<br/><br/>THE GALAXY: Survivor is a game from Invictus Studio! made in a rare style SANDBOX-SURVIVAL in it you have to survive on the planet and develop using its modern technology.<br/><br/>• INCREDIBLY BEAUTIFUL GRAPHICS<br/>The newest shaders will give you a full plunge into the world of the game, high-quality textures, elaborate shadows, destruction, optimized for many mobile devices.<br/><br/>• ADVANCED GAMEPLAY<br/>Complete freedom of action, crafting system, construction, survival, planets, good atmosphere, day and night, and not only, you will always find something to do even after several hours of play.<br/><br/>• MULTIPLAYER<br/>A galaxy in which 5 planets of different colors with different living creatures, you can fly to the planet and start to develop there, each planet has a size of 2 km. This gives you a lot of space, multiplayer being tested, everyone can take part.<br/><br/>• GREAT NUMBER OF ITEMS<br/>Ores, mechanisms, plants, materials, use everything for their intended purpose is not so much.<br/><br/>• INTERESTING DEVELOPMENT<br/>Create a drill that is digging for you, make a farm, promote your plasma, bring to perfection what you want.<br/><br/>• CONVENIENT MOBILE CONTROL<br/>Convenience is always important, Invictus Studio has developed a minimalist mobile control with high-quality design and an intuitive interface.<br/><br/>• DIFFERENT GAME MODES<br/>Creative mode and sandbox mode make the game more interesting, over time more modes will be added to the game, have fun :)<br/><br/>The game is at an early stage of development by purchasing it, you help the project in development, Updates are released regularly, you can also help with ideas and fix bugs or become a tester by writing to email", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:11:50", "background_image": "https://media.rawg.io/media/screenshots/fd6/fd6fda901c9c17380fef6b58832258b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Invictus Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Teen"}