{"id": 355856, "slug": "piano-music-tiles-2-free-music-games", "name": "Piano Music Tiles 2 - Free Music Games", "name_original": "Piano Music Tiles 2 - Free Music Games", "description": "Piano Music Tiles 2<br/><br/>Tap fast, enjoy the music game and challenge your tapping speed!<br/>Try FREE 200+ piano songs and a crazy variety of musical instrument sounds.<br/>Piano Music Tiles 2 is one of the best music games awaiting to be played!<br/><br/>How To Play:<br/>• Piano Music Tiles 2 is very easy and simple to play. Tap on the piano tiles, don't tap the white tiles  to enjoy the hottest piano songs.<br/>The game will stop if you miss the piano tiles or tap on white tiles. Be careful!<br/><br/>Game Features:<br/>🎵 05+ instruments: You can play songs with Home Piano, Grand Piano, Harp, Vibraphone, Celesta, Nilon Guitar, Hamornica.<br/>🎵 20+ beautiful themes: Piano Music Tiles 2 is the best beautiful piano of 2018.<br/>🎵 05+ exciting piano game modes, simple to play: Piano Music Tiles 2 is the best awesome piano tiles games for family &amp; friends. Perform your favorite piano songs and impress all your friends with your piano music speed and talent.<br/>🎵 200+ hottest piano songs to feel the beautiful piano music melodies beyond imagination through every tap with perfect timing tiles.<br/>🎵 You can play offline mode! Enjoy the music tiles by yourself without internet interruption! Further, the game is also added new package which includes all new and great songs.<br/>🎵 Awesome game design and graphics for the new piano tiles games 2018. You will feel like you are playing a true magical classic piano made with expensive mahogany, whose rhythm is perfect for any piano music lover.<br/>🎵 Smooth gaming experience, easy to play and lightweight to install.<br/><br/>Try out this game now and challenge your own reaction speed and skills! This speed tapping piano tiles games 2018 is more relaxing than you could imagine.<br/><br/>Permission: In order to provide the optimized experience, we would request “Storage” permission when you download this piano music game.<br/><br/>Piano Music Tiles 2 is waiting for you! <br/>Download now!<br/><br/>Feedback: We’re always trying to make our Piano Music Game app better so if you have questions or suggestions, please share them with us! Email: pianoempire0101@gmail.com.<br/><br/>If you want a song that's not available? Suggest songs on Our Facebook page.<br/>https://www.facebook.com/PianoMusicTiles<br/><br/>Privacy policy: https://goo.gl/x3u35N", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:33:14", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aab55b59dce8eecf63d9e593b5b1dd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Colorful Piano"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}