{"id": 355905, "slug": "dominoes-offline-free-dominos-game", "name": "Dominoes - Offline Free Dominos Game", "name_original": "Dominoes - Offline Free Dominos Game", "description": "Dominoes Offline by SNG is now available for android mobile phones and tablets with its high quality. Download now and play for free. You can play Dominos - Offline game anywhere you want. There is no need for an internet or wifi connection. You can earn millions of chips and play in high-bet rooms against different levels of artificial intelligence if you are a really good Dominoes player. <br/><br/>New Features:<br/>- Online mode:  You can play against human players. There is a time limit for each move in this mode. Challenge your friends and show your Dominoes skills to all your friends. <br/>- Daily and weekly quests: You can earn more gold and enable new features. <br/><br/>Dominoes is a very popular board game all around the world. It is known as Bergen (a version of Draw) in Scandinavian countries, Matador in Spain, QuiQui or Gaple ( a version of block) in Indonesia, Domino in Brazil and other popular names are Mexican Train, \"naval kozel\",  cross and human-human-wolf.<br/><br/>Features:<br/><br/>- Three different Domino modes (Muggins or All Fives, Block and Draw or Classic)<br/>- Simple and Smooth game play<br/>- Challenging AI bots <br/>- Rooms with different bet amount and difficulty levels<br/>- Daily Bonus<br/>- Totally free (no InApp)<br/>- Various themes<br/>- No need to the internet<br/>- Offline mode (no wifi games)<br/>- Online mode (play with human opponents)<br/>-2 or 4 players mode.<br/>- Daily and weekly quests  for more gold.<br/><br/><br/>Domino Offline is a board game for two players, played with domino tiles. The main contribution of our game is playing dominoes game offline plus its bet and room structure. You cannot consume all of your chips. We always send you millions of chips as gift. By this way, you can always play in high-bet rooms.<br/><br/>Play the best free offline game Domino and improve your skills.<br/><br/>SNG Games publishes free offline games that don't need wifi. Try our offline games Hearts Offline, Spades Offline, Yatzy Offline, Gin Rummy Offline, Backgammon Offline and Rummy Offline totally free.<br/><br/>Dominoe offline is intended for adult audiences and does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at our game does not imply future success at \"real money gambling\".", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:09:32", "background_image": "https://media.rawg.io/media/screenshots/902/90266a5cc849244d7c0efa2c469ce4f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SNG Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}