{"id": 355921, "slug": "crazy-chef-craze-fast-restaurant-cooking-games", "name": "Crazy Chef: Craze Fast Restaurant Cooking Games", "name_original": "Crazy Chef: Craze Fast Restaurant Cooking Games", "description": "A NEW FREE COOKING games and CHEF games! Feel the COOKING FEVER 🔥 in FAST TAP, COOK 🥣 and SERVE. Enjoy the cooking craze time in the Kitchen with your fingers, and cooking madness in world-wide restaurants, serve dishes like a Crazy Chef!  <br/><br/>Fast Cook &amp; Have more FUN in this addictive kitchen game<br/>- TAP, SERVE &amp; COLLECT, Easy to play😍!<br/>- Get More FUN Dash though the cooking service!<br/>- Play More, Reward More!💰<br/><br/>Upgrade the food and kitchenware in a smart order to pass levels more quickly! <br/>Tap to Cook and Serve the customers fast and time wisely to get more TIPS!<br/>Create Combos to earn more COINS! <br/><br/>Ready to take this challenge? <br/>Come on! Don't miss the chance to be a top world class chef! <br/>Download and Start COOKING right now! <br/>Enjoy the Cooking Joy and Time-Management Fun in this fabulous cooking game! <br/><br/>Produced by top cooking games professionals, this Free Kitchen Game does nothing but provides: <br/>- the ⭐Easiest gameplays <br/>- the ⭐Smoothest game operations <br/>- the ⭐Most Fluent game experiences <br/><br/>Plenty of Game Levels makes you be the COOKING MASTER: <br/>- Fry, Bake, Boil, Steam, Simmer and Grill magical ingredients to make worldwide food 🥣🍳 <br/>- Mix various and special drinks and wines ☕️🍹 <br/>- Serve your customers breakfast, lunch, dinner and deserts<br/>- Bake donuts, cook cookies, grill burgers and tasty steaks<br/>- Make coffee☕️cola🍹ice-cream🍦and variety of drinks🍮<br/>…<br/><br/>- Update in a regular base with new 🍴restaurants🍴, dishes and gameplays <br/>- Download and updated once, play offline always 🏖️<br/>- Cook anywhere, anytime to promote your cooking skills and serve customers better <br/>- 100% FREE to reach the top place in the cooking field 🏆<br/><br/>Various Challenges &amp; Targets: <br/>- Serve the customers quickly to reach enough dishes <br/>- Keep the customers happy 😘 and get their likes 👍 <br/>- Earn as many coins as you can to upgrade the kitchenware and food <br/>- Unlock more restaurants to learn top class cuisine all over the world <br/>- Complete tasks and achievements 🏆 to get rewards <br/>- Play extra job to earn more coins <br/><br/>Multiple Strategies, Tips and COOKING Skills: <br/>- Manage your serving time ⏰ and order in the rush hour <br/>- Create more combos to get extra bonuses 💰 <br/>- Upgrade the kitchenware ✨ and kitchen appliances to produce more and quickly <br/>- Upgrade the ingredients and food 🌭️ to increase your earnings <br/>- Apply the useful 🌟 boosts 🌟 to get help in the hard level <br/><br/>Chef World, Free to Play, More FUN<br/>- 🌟 Get 3 chef stars in every levels to become the chef master🏆<br/>- Promote your skills, better Time Management<br/>- Play the top Cooking games for FREE<br/><br/>Most of cooking games are for girls, but this one is never a girls only game. Boys also can find a lot of fun by this new, free, and addictively interesting cooking game! <br/><br/>Feel free to contact us if you have any questions or suggestions with the game: <br/>support@casualjoygames.com <br/><br/>Like Us on Facebook to Stay Up-to-Date <br/>https://www.facebook.com/CookingKitchenFever/ <br/><br/>Customers and guests are waiting for the Super Chef in the restaurant! <br/>What are you waiting for? Don’t waste the time!<br/>Come on and 👉DOWNLOAD the game Right Now!🏃", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:20:19", "background_image": "https://media.rawg.io/media/screenshots/14c/14ce6de38f83e41523fbf77a5b251d6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Casual Joy Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone"}