{"id": 355937, "slug": "stickman-warriors-online", "name": "Stickman Warriors Online", "name_original": "Stickman Warriors Online", "description": "Stickman Warriors Online – the sequel of the fabulous saga, but now you can fight the enemies in an online mode!!!<br/>You will be playing for the Stickman and killing to destroy different enemies. The game is an arena where deadly battles are conducted between popular Stickman characters. In order to win and survive you will have to fight to the last drop of your blood. Show you warrior skills to become a winner in unequal battles. You will have to fight with the enemies trying to destroy you. Counter a strike! Once you skip a beat, you are dead. Stickman can carry an attack by different body parts and use various types of weapons. Join the battle and fight! <br/><br/>Now you can fight with friends in ONLINE mode!!!<br/><br/>New options and tricks: <br/>-\tA lot of new locations and levels with different enemies<br/>-\tNew heroes who are stronger and faster than your warrior<br/>-\tNew design, which stickman game funs will definitely like<br/>-\tAmazing tricks and destruction<br/>-\tHD graphics<br/>-\tUnique soundtrack<br/>-\tHardcore game play <br/>-          ONLINE mode game<br/><br/><br/>You will get heroic fights in the game, full of mastership and speed. Many weapon types available. You will have to avoid the enemies to survive. Experience realistic and eventful fighting atmosphere of the game in the best stickman games style! Make the tricks, crash against the walls, break the bones, and destroy your enemies and other warriors. <br/><br/>Special features: <br/>★Stickman Warriors Online is totally free! <br/>★There is a mode in the game - opposite each other – where you can kill your enemy! <br/>★Play the game on your phone or tablet and share it with your friends! <br/>★Heroic, full of destruction all-action blockbuster soaked up all the best in Stickman games! <br/>★Dynamic gameplay at each level! Stern battles with different enemies! <br/>★Become the first in the fight – highscore!<br/>★Stickman games funs will definitely like interesting graphics! <br/>★Captivating action! Well-designed locations and destruction of main characters! <br/><br/>« Hardcore battles ONLINE!» <br/><br/>«The best game for Android among other stickman games!» <br/><br/>The game is free.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:30:23", "background_image": "https://media.rawg.io/media/screenshots/de4/de490153e4a3a06383f6a6cb65306de8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Merkury Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Teen"}