{"id": 355947, "slug": "next-music", "name": "NEXT Music", "name_original": "NEXT Music", "description": "Welcome to the biggest virtual music festival, where you’ll discover what’s next in music. Catch a live performance of your favorite artist or tap to the beat of your favorite songs. From Pop to Latin, EDM to Classical, there’s something for every music fan.<br/><br/>Surf between hundreds of virtual stages to catch a show, make requests and chat with other music fans. Every day we feature new shows so you can discover new artists and new music. You can even show your love by sending artists virtual gifts!<br/><br/>Sit in on a live interview with artists like TI, Mariah Carey, NGHMTRE and many more. Ask your most pressing questions directly and chat with other fans.<br/><br/>Rock out on the virtual guitar, as you tap to the beat of new songs in an immersive music experience. Every month, we add new songs so you can play the latest and greatest hits.<br/><br/>Challenge your friends or millions of music fans to a duel to see who has the fastest hands. Win prizes, earn bragging rights and watch your name climb the leaderboard as you go for world domination!<br/><br/>Team up with a crew for the ultimate competition in our weekly tournaments! Challenge other crews from around the world on the Crew Song. Battle it out to see whose name and flag will reach the top of the Crew leaderboard.<br/><br/>It’s time to party with music fans around the world in the biggest virtual music festival.<br/><br/>Privacy Policy: http://nextmusic.com/privacy<br/><br/>Terms of Service: http://nextmusic.com/tos", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:35:44", "background_image": "https://media.rawg.io/media/screenshots/393/393a01726523e2ca69e6958ea7059780.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["WRKSHP"], "genres": [], "publishers": [], "esrb_rating": "Teen"}