{"id": 355970, "slug": "piano-game-for-five-nights", "name": "Piano Game for Five Nights", "name_original": "Piano Game for Five Nights", "description": "Five Nights at Freddy's Piano Game game is appear in piano game with exactly beats of Five Nights at Freddy's songs. Tap to screen and feel the music<br/>Ever had a dream of being an cool pianist surrounded by friends and family? Ever dreamed of playing Piano Tiles with your idol songs? Five Nights at Freddy's piano songs?<br/>This is a super fun Piano game and highly great game for everyone.<br/>No special skills needed for Five Nights at Freddy's Piano Game, all is tap to screen!<br/><br/>Five Nights at Freddy's Piano Game game features:<br/>1.Speed challenge piano game.<br/>2.Your favorite songs is all here with 400+ songs<br/>3.There are more songs of other us uk singers <br/>4.New song update daily<br/>6.Unlock next songs by 2 stars<br/><br/>Game rules:<br/>Tap on the piano tiles while listening to music. Tap to black and start of color tiles. Enjoy us uk music, improve your speed!<br/><br/>DISCLAIMER:<br/>Five Nights at Freddy's Piano Game is an unofficial fan application. It is not affiliated with or endorsed by Five Nights at Freddy's, their management, or record label.<br/><br/>This app does not include any copyrighted material.<br/>The piano melodies are arranged with individual piano notes<br/>This app is for entertainment purposes only.<br/><br/>FEEDBACK:<br/>Feel free to email us song requests, issues, comments, and suggestions, with your comments, we can add more songs and make better games ever! Thank you for download game!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:52:08", "background_image": "https://media.rawg.io/media/screenshots/7ee/7ee5fdba0cc9d98bcd059b17b10296be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Lionel Light"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}