{"id": 355950, "slug": "cooking-hot-world-wide-restaurant-cooking-games", "name": "Cooking Hot - World Wide Restaurant Cooking Games", "name_original": "Cooking Hot - World Wide Restaurant Cooking Games", "description": "Welcome to Cooking Hot👩‍🍳👨‍🍳, the BEST chef game, FAST PACE Cooking Game and Restaurant Game! It brings you the Purest and Truest COOKING experiences. Come to different cooking cities, feel the craze and madness of a cooking games lover. Cook and Serve food as a crazy chef! <br/><br/>In this chef game, you act as a top chef and star chef. The craze for the cooking grabs you, and you are cooking in brink of madness. You work in the kitchens of different countries and cooking styles, TAP fast to cook various food, serve dishes to customers.  <br/><br/>The high tense and coherent gameplays bring you fascinating experience, and make your time full of awesome dash moment. <br/><br/>We discard the verbose operations and irrelevant systems in the current cooking games on the market, and provides you a Fast Pace and Simplified restaurant simulation game. Focus your work in various restaurants, satisfy the taste buds of your customers and fans! <br/><br/>👉Download for FREE NOW and get ready to rock the cooking world!🏃<br/><br/>EASY AND ADDICTIVE GAMEPLAYS <br/><br/>Game is relaxing, it is very easy to play but challengeable to be mastered!<br/><br/>* Top correct ingredients to cook the food <br/>* Cook in correct order for special food<br/>* Serve food with right side dishes <br/>* Earn coins and tips from cooking service<br/>* Upgrade kitchenware and food for luxury cuisines <br/>* Complete multiple cooking targets to pass levels<br/>* Open new restaurants and learn new cooking skills<br/>* Check in daily to get rarity boosters<br/>* Complete daily tasks and achievements to get rewards <br/>* Create exciting combos and get bonus<br/><br/>Feel the growth of cooking knowledges and the enhancement of cooking skill as you playing the game. <br/><br/>Endless fun and joy is coming! <br/>Do you dare to challenge the most picky customers?<br/>Will you accept the lasting cooking joy?<br/>👉Install now and start your hot cooking journey!🏃<br/><br/>REALISTIC CHALLENGES AS IN REAL RESTAURANTS<br/><br/>You are facing the same challenges a top chef will encountered in a real restaurant!<br/><br/>* Serve the customer in time<br/>* Serve correct food with right side dishes<br/>* Keep an eye on the cooker, don’t burn food<br/>* Arrange your cooking reasonably, don’t discard food <br/>* Use time management skills <br/>* Serve in smart dish sequence<br/><br/>Use your fingers to cook delicious and fine food, realize your cooking dream as a crazy chef. The hottest thing is: you are a star chef, people hear of your fame and chasing you all over the world in order to taste the amazing food cooked by you. <br/><br/>UNIQUE FOOD AND RESTAURANTS<br/><br/>We give you the best, best cooking gameplays, best cooking experiences, and the best cooking operations; also, our dedicated artists give you the best kitchen, kitchenware, ingredients, and beautiful food that tantalize your appetite. You can:<br/><br/>* Feel food culture in distinctive restaurants, America, France, Italy …  <br/>* Cook unique and traditional food, hotdog, steak, rib, waffle …<br/>* Mix sweet drinks, lemonade, red wines, coke, beers …<br/>* Cook breakfast, lunch, dinner, deserts and snacks … <br/>* Master all the cooking gestures, boil, fry, steam, grill …<br/><br/>Tired of waiting for new levels in the other games? It won’t happen here. Mountains of game Levels are here waiting for your challenge! And we release updates regularly with new restaurants, new levels, new dishes, new gameplays! <br/><br/>No more hesitate! 👉Download and play now!🏃<br/>You are the right cooking master customers are longing for!<br/><br/>Follow our fan page, get the latest news, participate the fan page activities, get the gifts that are only for fans. Write down your cooking dairy, share game experiences with your friends, get social, and spread the cooking fun!<br/><br/>https://www.facebook.com/CookingHotGame", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:38:13", "background_image": "https://media.rawg.io/media/screenshots/17f/17f8d53d40926bdcb527ee36803b46f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FlyBird Casual Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone"}