{"id": 355909, "slug": "numpuz-classic-number-games-num-riddle-puzzle", "name": "Numpuz: Classic Number Games, Num Riddle Puzzle", "name_original": "Numpuz: Classic Number Games, Num Riddle Puzzle", "description": "Numpuz: Number Riddle is a classic math puzzle game. Tap and move the wood number tiles, enjoy the magic of digit, coordinate your eyes, hands and brain. Challenge your logic and brainpower, have fun and enjoy it!<br/><br/>How to play Numpuz? <br/>Sliding puzzle game consists of a frame of numbered square tiles in random order, with one tile missing, The object of the puzzle is to place the tiles in order by making sliding moves that use the empty space. Endless challenge mode that challenges your logical thinking and mental limits<br/><br/>FEATURES: <br/>-6 levels of difficulty (3,4,5,6,7,8 modes)<br/>-Wooden retro style of user interface<br/>-Simple to control, hard to master<br/>-Timer function: record your playtime<br/>-Test your logic and reaction speed<br/>-Realistic animation and tiles sliding<br/>-Combination of number and Puzzle<br/>-Traditional educational puzzle game<br/>-No wifi need, play in anytime anywhere<br/>-Best casual game to kill time <br/><br/>6 different sizes: <br/>3 х 3 (8 tiles) – for beginners and kids;<br/>4 х 4 (15 tiles) – classical mode for all ages; <br/>5 х 5 (24 tiles) – for those who like to think.<br/>6 х 6 (35 tiles) – complex mode for veteran<br/>7 х 7 (48 tiles) – difficult level to challenge<br/>8 х 8 (63 tiles) – design for master players<br/><br/>Play the Numpuz: classic intelligence Klotski digital game, challenge your brainpower! User-friendly operation and simple interface make you experience the unique charm of slide puzzle game! Go for enjoy it and have fun!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:11:52", "background_image": "https://media.rawg.io/media/screenshots/b72/b72769fd35ce0193c18d9f61302ef8d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DoPuz Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}