{"id": 356034, "slug": "traffic-puzzle", "name": "Traffic Puzzle", "name_original": "Traffic Puzzle", "description": "Traffic Puzzle  is a brand new match 3 puzzle game! Help two awesome cops restore order in the city! Lucre, the villain, made quite a mess on the streets, and it’s down to you to fix it! Start unblocking cars now!<br/><br/><br/>Traffic Puzzle features:<br/>• fresh matching gameplay combined with block puzzle and jewel blast features<br/>• relaxing game levels that will constantly surprise you<br/>• cute graphics<br/>• multiple power-ups to help you clear the city streets<br/>• get special rewards and boosters when you level up<br/>Play for free with friends, compare your progress and experience this amazing adventure together!<br/>Playing Traffic Puzzle find cars of the same color and blast 3 in a row to:<br/>• clear the way for ambulances so they reach patients on time<br/>• help parents pick up their children from nursery schools on time<br/>• remove wrecks covering the streets of beautiful and relaxing districts<br/>• keep the trains on schedule, as they are transporting kids to school trips<br/>• and last, but not least, play the role of celebrity bodyguards and help helicopters land safely in places crowded with fans!<br/>Special powers like Clown, Police Car or Joker will help you along as you play! But remember… this is a relaxing jewel blast game! You can always match 3 cars in a row to solve a puzzle!<br/><br/>Traffic Puzzle is a relaxing game with matching, completely free to play. However, you may have to pay for some features.", "metacritic": null, "released": "2019-09-21", "tba": false, "updated": "2019-09-27T03:29:03", "background_image": "https://media.rawg.io/media/screenshots/5e2/5e241f4cf8599e8e4894dbc54cba1a36.jpg", "website": "https://www.facebook.com/TrafficPuzzle/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Huuuge Global"], "genres": ["Puzzle"], "publishers": ["Huuuge Global"], "esrb_rating": null}