{"id": 356071, "slug": "legends-of-andor-the-kings-secret", "name": "Legends of Andor – The King’s Secret", "name_original": "Legends of Andor – The King’s Secret", "description": "This epic fantasy game takes you to a fantastic kingdom full of magical creatures and brave heroes. <br/><br/>Play a warrior, sorceress, dwarf or archer, and defend the king’s castle! Pass difficult trials, defeat determined opponents and protect the land from a dark secret.<br/><br/>Guide your group of heroes through twelve exciting legends in which new, challenging opponents and old companions await you. Choose your strategy carefully—you have only a limited number of moves to complete your quests. You can guide any legend to a successful resolution in several ways if you use your characters and their abilities to your best advantage. <br/><br/>Delve deeper than ever before into the mystical past of the legendary kingdom and discover a previously unknown story of Andor that takes your heroes into inhospitable and dangerous realms beyond Rietland.<br/><br/>Play the award-winning board game solo and take your group of heroes on exciting adventures anywhere, anytime. The Legends of Andor: The King’s Secret provides an easy introduction with simple rules and an extensive tutorial, and offers Andor fans and beginners alike a challenging gaming experience.<br/><br/>The land of Andor needs your help! Can you fight off the new threat from the south? <br/><br/>• Exciting fantasy game<br/>• Single-player game<br/>• New, epic Andor legends<br/>• Familiar heroes, old companions, new adversaries<br/>• Discover Andor’s past<br/>• Straightforward rules and tutorial<br/>• No Andor experience necessary to play<br/>• Developed by the Andor creator Michael Menzel and games author Jörg Ihle<br/>• Based on the board game The Legends of Andor from KOSMOS (awarded “Kennerspiel des Jahres 2013”)<br/>• Can be played in English, German, French, Spanish<br/><br/>Funded by FilmFernsehFonds Bayern.<br/><br/>***** <br/>Questions or suggestions: <br/>Mail to support@andorgame.com<br/>We are looking forward to your feedback! <br/><br/>News and updates: www.andorgame.de, www.facebook.com/AndorGame <br/>*****", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:58:48", "background_image": "https://media.rawg.io/media/screenshots/aa1/aa19f1ab6874646d014fe301680523dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["USM"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone 10+"}