{"id": 356097, "slug": "stick-ninja-ultimate-legends", "name": "Stick Ninja: Ultimate Legends", "name_original": "Stick Ninja: Ultimate Legends", "description": "Stick Ninja: Ultimate Legends will be the awesome free addictive fighting games in your phone.<br/>This games will give you a chance to live a part of a shadow in the figure of stickman character to fight in the 4th shinobi great war and more battle in nin ja saga with enemies and protect everybody from your hidden village.<br/>You have the most basic control ever! Just need to dodge, jump, power your chakra, become ultimate storm and destroy your evil enemies with your skills. Let entertain with this new dokkan.<br/>Fighting in formation battles across the story of the renowned stickman anime!<br/>Fight hordes of enemies and complete missions using the all<br/>Master team field skills, discover new ninjutsu rasengan and become the next stick Hokage in the first-ever ultimate nin shadow ja mobile game! With collection of 30+ unique shippuden nin ja &amp; shinobi design style and special jutsu of each.<br/>Mission Mode Based on the Original Anime Storyline stick man fight!<br/>• Mission Mode allows you to relive the experience of the naru to story<br/>• Battle through stories from the original series ninja stickman fighting anime games<br/>. Tournament battle ninjut su kage shinobi arena in the fight between hidden green and more hidden village.<br/>I know you like anime, manga or Naru Shippu den dokkan.<br/>You will be the most powerful Ninja fighter ever and keep training to become the strongest kage stick nin ja!<br/>Come, Recruit and build the legendary team unmatched to Nar, Ssk, Kks, Ga, Lee,Mad!<br/>Fighting skills include close-ranged and combination attacks for massive damage.<br/>Nin Field jutsu can turn the tide of battle in your favor shadow heroes.<br/>Anime universe: blue sea pirate, saiyan ssj Ultra Instinct warrior, super ultimate ninja saga world.<br/>Compete against other nin players for the most points and aim for the top in a special mode that can only be accessed during special event.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:15:36", "background_image": "https://media.rawg.io/media/screenshots/cde/cdedcd34b5e82a44edf11fcfcb768712.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ironmans"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}