{"id": 356019, "slug": "surfing-craft-crafting-stunts-surf-games-world", "name": "Surfing Craft: Crafting, Stunts & Surf Games World", "name_original": "Surfing Craft: Crafting, Stunts & Surf Games World", "description": "Do you love water theme parks and speed? Feel the tide in the best surfer games 3D of 2019! Become the most brave surf racer and perform extreme stunts! You can also enjoy crafting &amp; building mode to prepare more creative stunts. Join Surf League – PLAY Surfing Craft FOR FREE!<br/><br/>Surf travel around the world!<br/>Enjoy world made of blocks! Ride a water jet ski wherever you want and surf in the Surf League. Play awesome minigames and find a treasure of your dreams! Avoid running onto other motorboats, surfing or water skiing people! OR NOT! You’re a crazy surfer!<br/><br/>Boring days gone in Bikini Bottom!<br/>Play the best surfer games for girls and boys and find out why bad days are gone! Build a city or water theme park if you can! Surfing Craft is an addictive game with crafting &amp; building a whole new world!<br/><br/>Not another surf racing game!<br/>Join Surf League and start exploration of an open world and stunts! Enjoy your powerboat or jetpack water fun! Use crafting &amp; building mode to free your imagination. Build epic stages for stunts, enjoy city building or go on an adventure and find every treasure island on the sandbox open world!<br/><br/>Leave people speechless or talking!<br/>Tom – surfing enthusiast is your huge fan! Keep calm and enjoy pure surf action – boring days are gone permanently! Surfing Craft is the most exciting combination of surf games, jet ski games and classic crafting &amp; building in the water theme park!<br/><br/>Surfing League is calling!<br/>If you want to play one of the best surf games with own Surf League and travel around the world – play Surfing Craft for free! Are you brave enough to go on an extreme adventure? Surf League is one of the most dangerous sports ever! Play Surfing Craft for free and dare to dream!<br/><br/>Brand new boat game!<br/>You’re a true surfing racer with own Surf League who challenges every riptide and even super crew! Racing powerboat is not your task! Extreme surfing stunts, surf travel to treasure island and adventure – that’s the best Surf League you can dream a’bout!<br/><br/>Surfing Craft features:<br/>*Crafting &amp; building stages for stunts!<br/>*Ocean exploration and surf travel!<br/>*Extreme surf water park!<br/>*Discover every treasure island!<br/>*Date another surf racer!<br/><br/>Boring surfing days are gone!<br/>Discover one of the best surf games for girls and boys of 2019! Crazy stunts, crafting &amp; building, tens of islands, beautiful beach resort and surfing in one awesome boat game. Don’t bother and go on an adventure now!<br/><br/>Play Surfing Craft FOR FREE – one of the best surf games 3D of 2019!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:24:31", "background_image": "https://media.rawg.io/media/screenshots/d75/d75f609ee88366a29c07d219bc3f2d4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Fat Lion Games: Crafting & Building Adventure"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}