{"id": 356093, "slug": "cover-fire-shooting-games-pro", "name": "Cover Fire: Shooting Games PRO", "name_original": "Cover Fire: Shooting Games PRO", "description": "Your duty is to lead the battle and become the best shooter and sniper. <br/>Download now for free one of best offline shooting games on mobiles<br/><br/>New mode: Sniper FPS Black Ops. You received the call for duty of defeat all enemies the time runs out. Racing against the time and shoot! Each target adds 3 seconds to survive<br/><br/>Get your best shooter or sniper and combat on the frontline. It’s time to take action in the battlefield. Shoot to kill in special ops and survive in this addictive sniper shooting game!<br/> <br/>Try the free zombie event! Hit and don't leave any zombies alive!!  Are you a survival hero?<br/><br/><br/>COVER FIRE FEATURES<br/><br/>- The New Shooter experience. Join the resistance and Command this battle like a shooter and sniper. Take your weapon, strike the enemy army with a hail of bullet, grenades, massive guns. Release the Fury of this War!<br/> <br/>- Modern control that bring you an fun and addictive combat. Shoot to Kill!<br/> <br/>- HD Graphics with destructible environments. Everything interacts with you and your soldiers. <br/> <br/>- Become a real veteran soldier in the online tournaments mode, put yourself in a fun adventure with non stop action against other assassins players. Don’t stop shooting in offline missions with the best commando and sniper mission game.<br/> <br/>- Supply yourself with a huge real arsenal. You have never seen so realistic guns in shooter games: pistols, shotguns, rifles, snipers… feel like a real frontline commando!<br/> <br/>- Face the battlefield from different perspectives. Alternate among your mercenaries in realtime, find the ultimate combination to win the battle in the ultimate killing game.<br/> <br/>- Set up your assassin squad with their unique skills: hacker, sniper, assault man... Unlock new epics snipers and shooters like the bazooka-man or the gunslinger! Have you ever seen an inflatable dinosaur on the battlefield?<br/><br/>-Take the control of the battle and become the best shooter in the most addictive sniper shooting game.<br/><br/> <br/>In Cover Fire you will be the shooter who lead a squad of veterans through sieged cities, deserts and fields taken by guerrillas, and defeat all kind of enemies in the war game with the biggest graphic, greatest arsenal and the best gameplay on mobile.<br/> <br/>The ultimate shooter and sniper experience. Take cover, aim, shoot and eliminate this hazard. Don’t let the terrorists own the world in the best military shooter game ever!<br/><br/>- Build your frontline strategy in the battlefield and kill your enemy from all sides. Face limitless ops action in the online tournaments game mode.Take your weapons from a killing arsenal and level up your soldiers with unique shooter skills.<br/> <br/>- Challenging Story mode. Fight against Tetracorp and lead a mercenary riot on every mission. The best gameplay in the most engaging shooting game ever.<br/> <br/>- Feel the new experience unique in shooter games. Press the screen, pull the trigger and shoot!. Destroy and annihilate all the bad guys with your powerful weapons and your well-assembled team of heroes!<br/> <br/>- Upgrade the skills and abilities of every member of your band: make them faster, stronger, more lethal. Equip them with the best guns and gears. Level up your commando squad and lead them to victory.<br/> <br/>Limitless shooter action! https://youtu.be/7JUGGPCdTQ8<br/> <br/> <br/>Will you be able to annihilate all the enemies in this bloody war? Welcome to the Resistance. Welcome to Cover Fire.<br/> <br/> <br/>VISIT US:<br/> <br/>http://facebook.com/CoverFireGame/<br/>http://generagames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:13:12", "background_image": "https://media.rawg.io/media/screenshots/ad6/ad60d8a8a45aca4a1a0a4b92ec66bd73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 448, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Genera Games"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}