{"id": 356003, "slug": "z-day-hearts-of-heroes-mmo-strategy-war", "name": "Z Day: Hearts of Heroes | MMO Strategy War", "name_original": "Z Day: Hearts of Heroes | MMO Strategy War", "description": "The history you know is not necessarily true.<br/> In 1944, the Allied Forces landed in Normandy, now referred to as D-DAY.<br/> Evil scientists used weapons that could change the weather, which lead to the battles in Normandy failing in the storm.<br/> <br/> In 1945, the Nazis set off an experimental Antimatter Bomb, destroyed most countries in the world, and destroyed social rule.<br/> This day is called Zero Day, Z-DAY in short.<br/> <br/> In this dark new world, evil forces seek to conquer all humanity, and none dare oppose them... Except for those with the \"hearts of heroes\" that are willing to give their lifes to stop the apocalypse!<br/> <br/> The evil captain is already searching for the Antimatter, a compound with an infinite power of destruction. If nobody stops him, he will erase the entire human race and turn every human being into an undead zombie. <br/> Now is the time to act with strategy! Build your soldier army, fortify your base, make friends, and take out enemies while trying to survive a zombie PvP war! Prepare yourself as a Commander in the battlefield and fight the many faces of death in a survival MMO! YOU are a war hero in the doomsday!<br/> <br/> Let's the battle begin:<br/> <br/> • Rebuild your city and contain the zombie invasion, repair buildings and farms alongside your base and military centers in this strategy MMO! <br/> • Multiplayer PvP World War! Hold your head high and march bravely onto a battlefield of global terror to claim glory!<br/> • Army Alliances! Make friends and build relationships with your allies. Work together to defeat the assault of the evil Commandant and storm the monster Bastion in this RPG!<br/> • War Heroes! Gods of military will help you out to battle. Get your war heroes trained up!<br/> • Destroyers! Death from above. A legendary Aircraft of devastating attack power!<br/> • Supersoldier! Explore the Abandoned Facility with your mechanization soldier and compete in the arena!<br/> • Multiplayer battle competition! More than PvP, join the Region vs Region, Alliance vs Alliance, and the Northern Front events across multiple regions!<br/> • Chat! Connect with other players from around the world in real time conversation!<br/> • Strategy multiplayer RPG! Manage your resources, train your soldier army troops and develop the heroes defense and attack tactics. Understand your enemy and strike with strategy!<br/> • Building! Build yourself an Empire strong enough to survive the war to end all wars in the MMO battlefield.<br/> • Epic Survival Story! Fresh immersive horror fighting storyworld packed with terrifying zombie invaders!<br/> <br/> Only ONE alliance can claim the legitimate power to rule! Kill zombies, build military army troops, train heroes and form human alliances in this strategy MMO! Revive civilization as a zombie hunter accomplishing every RPG mission! Your soldiers are waiting. The zombie plague is just the beginning. Are you ready for the fight, Commander?<br/> <br/> SUPPORT:<br/> Are you having problems? contact_zd@kingsgroupgames.com<br/> Privacy Policy: http://www.kingsgroup.cc/privacy_policy/kingsgroup/en<br/> <br/> Facebook:<br/> https://www.facebook.com/ZDAYGame/<br/> <br/> Terms of Service:<br/> http://www.kingsgroup.cc/agreement/Kingsgroup/en<br/> <br/> NOTE: Z Day is a completely free to download and play survival MMO. Some game items, however, can also be purchased for real money. If you do not want to use this feature, please select password protection for purchases in your Google Play Store app. A network connection is also required.<br/> <br/> Z Day. No more rules. Don't wait, get the adrenaline pumping and ACT!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:14:09", "background_image": "https://media.rawg.io/media/screenshots/49e/49e5b95680153dca7647053388adaa90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KingsGroup Holdings"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}