{"id": 356004, "slug": "parchisi-star-online", "name": "Parchisi STAR Online", "name_original": "Parchisi STAR Online", "description": "Parchisi STAR is an online multiplayer version of popular classic board game Parchis. Parchis board game is a popular in Spain as Parchis and known by different name in other countries. It is a board game of the Cross and Circle family. It is an adaptation of the Indian game Pachisi or Parchis or Ludo or Parchis Online<br/><br/>Features<br/>- It is totally FREE to play<br/>- 2 or 4 player Parchis board game<br/>- Chat and send Emoji while you play the game<br/>- Designed for Tablet &amp; Phone<br/>- Daily Magic Chest. Open to win up to 50K Coins every day<br/>- Unlock achievements while you play this amazing game<br/>- Dice Collection<br/><br/>Parchisi is played with two dice, four pieces per player and a board with a track around the outside, four corner spaces and four home paths leading to a central end space. The most popular Parchis boards in America has 68 spaces around the edge of the board, 12 of which are darkened safe spaces. Each corner of the board contains one player's nest or starting area.<br/><br/>If you are free and want to spend quality time then Parchis is here for you. We all have played this in our childhood. So here we are offering you once again your childhood. So that you can live that moment again<br/>It was once played by Kings and is now enjoyed by you. Parchis has been the favorite online game of people across the world. Inspired by the Indian Classic Game: Pachisi, pachisi<br/><br/>Enjoy Parchisi Online<br/><br/>NOTE:<br/>Use of this application is governed by Gameberry Labs Pvt. Ltd. Terms of Use. Collection and use of personal data are subject to Gameberry Labs Privacy Policy. Both policies are available at www.gameberrylabs.com.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:14:35", "background_image": "https://media.rawg.io/media/screenshots/220/220d1ddadb6b4078298f8afc6f10af84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gameberry Labs"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}