{"id": 356186, "slug": "kawaii-home-design-decor-fashion-game", "name": "Kawaii Home Design - Decor & Fashion Game", "name_original": "Kawaii Home Design - Decor & Fashion Game", "description": "Love home design &amp; makeover? Let's start your business with a showroom full of kawaii furniture. In this  free decorating girl games, you will choose the furniture and rearrange them accordingly to your clients' request but still had your style. Play one of the best DIY home design games today and let your creativity shine!  <br/><br/>★ DIFFERENT STYLES TO MAKE YOUR DESIGNS STAND OUT<br/>A bedroom, a kitchen or a restaurant design - there's nothing you can't furnish perfectly! Design home, decorate and organize interiors, make it unique, show your style and be a famous Home Stylist. <br/>★ FAIR &amp; SUPPORTIVE COMMUNITY VOTING POLLS <br/>Root for other talented Home Stylists by picking the best home designs in Public Polls. <br/>★ DIY - CRAFTING YOUR OWN FURNISHINGS<br/>Manufacture your most favorite furnishings. Freely style and arrange your own Home Decor Showroom to make it more appealing.<br/>★ BE FASHIONABLE<br/>Be recognized not only as a successful Home Stylist in this decoration game, but also as an awesome Fashionista with various Boutique outfits.\u2028\u2028<br/>★ INTERESTING STORYLINE<br/>Your family runs a Home Decor Showroom. Unfortunately, it's at the edge of going bankrupt. Can you help your family business raise in the house decoration market again?<br/>★ PLAYING WITH YOUR FRIENDS<br/>Visit other Showrooms and help fellow home designers in need. Invite your Facebook friends to play and make new friends from various in-game activities. Remember this is not just girl games, you can play with your male-friend, boyfriend or husband.<br/><br/>== What to enjoy in Kawaii Home Design? ==<br/>▾ Relax and express your creativity in DIY homescapes style designed for your customer<br/>▾ Design home, decorate homescapes &amp; makeover houses with kawaii decorations in different design styles<br/>▾ Vote for your favorite designs from other talented Home Stylists<br/>▾ Unlock rewards as you polish your amazing abilities as a Home Stylist<br/>▾ Show your fascinating interior blueprint with your Facebook friends<br/>▾ Be fashionable with many kinds of cute outfits in the Boutique<br/>▾ You can design and decorate a room, a house or even a huge restaurant.<br/>▾ Remember Kawaii Home Design is one of the best girl games but boys can enjoy it as well.<br/><br/>NOTICE: Kawaii Home Design is a Cute RPG Mobile Game not only for girl, and It's free games, though some in-game items can also be purchased for real money. A network connection is also required.<br/><br/>Join in Community: https://discord.gg/Bgah4Sz<br/><br/>Enjoying Kawaii Home Design? Learn more about this free girl games!<br/>Facebook: https://www.facebook.com/kawaiihomedesign/<br/>Twitter: https://twitter.com/HomeKawaii<br/>Instagram: https://www.instagram.com/kawaiihomedesign/<br/><br/>Questions? Visit us at http://support.imba.co or Contact our Tech Support at khd.support@imba.co", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:09:49", "background_image": "https://media.rawg.io/media/screenshots/f6f/f6f3cc4410cb75d09862964c8aa1cfa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ONESOFT"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}