{"id": 356184, "slug": "case-animatronics-horror-game", "name": "CASE: Animatronics - Horror game", "name_original": "CASE: Animatronics - Horror game", "description": "<strong>CASE: Animatronics</strong> is a truly scary and challenging first-person stealth horror. Control of the police department is in the hands of an anonymous hacker. All the exits are locked. The power has been shut off. There are metallic thumps getting closer. Will you survive, Detective Bishop? <br/>Welcome to the police department, where working late can lead to tragic consequences. You're John Bishop, a overworked detective who tirelessly carries out investigations late into the night. You’re torn from yet another night of fitful rest and nightmares by a strange call from an old friend, turning your whole world upside-down.<br/>Your police department is cut off from the power grid. The security system has been hacked. All the exits are locked. But that’s not the real problem.<br/><br/>Someone, someTHING, is following you. Red eyes shine from dark corners, and the sound of shifting, clanking metal echoes through once-safe halls. You know them simply as animatronics, but something unknown and horrifying is driving them. Figure out what’s going on, survive the night, and find the one responsible for this madness.<br/><br/><strong>KEY FEATURES</strong><br/><strong>Hide</strong><br/>The object in your environment could be your salvation. Animatronics can’t see you cowering in the closet or under the table! <br/><br/><strong>Keep moving</strong><br/>Stay on the move, even if you see an animatronic, you just might manage to run away from unrelenting death. Everything depends on you!<br/><br/><strong>Solve puzzles</strong><br/>Try to figure out the cause of this ghoulish chaos and complete terrifying quests!<br/><br/><strong>Listen</strong><br/>Don’t trust your eyes alone! Listen carefully to your surroundings, every stray noise could completely change the situation.<br/><br/><strong>Use the tablet</strong><br/>Check the security cameras to keep the situation under control in other rooms, but don’t forget to keep an eye on the tablet’s battery life and use the charging station in time. <br/><br/><strong>Survive</strong><br/>Just one wrong move could be the death of you.<br/><br/>Do you like horror games? This one won’t let you get bored, constantly cranking up the tension.<br/>One of the most watched horror games on Youtube. Over 100 million views! THE FEAR IS REAL!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:08:09", "background_image": "https://media.rawg.io/media/screenshots/0c8/0c8d1bfe0bb45bc2e3b2b778c93afe20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Azur Interactive Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Teen"}