{"id": 356116, "slug": "mountain-climb-4x4-offroad-car-drive", "name": "Mountain Climb 4x4: Offroad Car Drive", "name_original": "Mountain Climb 4x4: Offroad Car Drive", "description": "Mountain Climb 4x4 : Offroad Car Drive is a realistic simulation and racing game that you need to climb hills by overcoming the obstacles by an off-road vehicle. You should reach the hill as soon as possible by collecting all the coins on your way in the stage, and complete the stage successfully. You have to do your best to avoid falling from a cliff and facing an obstacle, while trying to reach the hill. You will be addicted to this game with its stages having difficulties and features different from each other, which receive continual updates.<br/><br/> <br/>FEATURES :<br/> <br/>- An environment where the physics laws completely prevail! Cars go wherever you want them to go, and do whatever you want them to do.<br/><br/>- 5 different models of cars which have technical and hardware specifications different from each other (new cars are added continually)<br/><br/>- Modify some specifications of cars such as handling, motor and brake,<br/><br/>- Chance of changing the color, rim and appearance of cars<br/><br/>- High-quality and ever-changing environment models.<br/><br/>- Addictive episodes that are not boring at all<br/><br/>- Different actions that come with new episodes<br/><br/>- Newly added stages every 15 days<br/> <br/><br/>HOW TO PLAY?<br/> <br/>- Please choose the most appropriate method to control the car. You can select a best driving type fit for you or adjust your device sensor in the Settings section. Do not forget to adjust the steering sensitivity, if you have difficulty to control the steering.<br/><br/>- Try to buy upgrades, if your car cannot overcome the obstacles or is not fast enough. If the updates are not enough, you need to buy a new car.<br/><br/>- If you run out of your coins, you can earn coins by tapping “watch video, win coins” button or replaying the stages that you have already played.<br/><br/>- Try to develop different methods while trying to overcome obstacles, because cars move according to the law of physics. Don’t expect to get different results by trying the same method over and over again.<br/><br/> <br/>ANNOUNCEMENT :<br/><br/>The name of our game, Hill Climb Race 4x4, is changed to Mountain Climb 4x4. Now, we’d like you to find and love us with this name. Please remember to share any error related to the game with us via e-mail at support@silevel.com  Please do not forget to follow our social media accounts, if you want to be the first to know news about Mountain Climb 4x4 and our new games: www.facebook.com/silevel<br/><br/>We’ll be back soon with new graphics, new cars and brand-new stages. Thank you for your support.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:26:01", "background_image": "https://media.rawg.io/media/screenshots/71e/71e14d7699348079aff9b2f0e4bfb957.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Silevel Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}