{"id": 356157, "slug": "draw-a-stickman-sketchbook", "name": "Draw a Stickman: Sketchbook", "name_original": "Draw a Stickman: Sketchbook", "description": "** Winner of 5 Webby Awards - Draw a Stickman Franchise **<br/> ** Played over 100 Million Times around the Globe ** <br/><br/>Draw a Stickman: SKETCHBOOK is a FREE DEMO app that allows you to explore your creativity by giving you the freedom to draw anything!  If you can think it, you can draw it!  Let your imagination soar in this single sandbox level where you are given access to the same unique tools from Draw A Stickman: EPIC 2.  <br/><br/>Draw A Stickman: SKETCHBOOK allows for unlimited drawings to be saved, shared, and used for gameplay in Draw A Stickman: EPIC 2!  Dive into a colorful new world with this essential SKETCHBOOK companion, and enjoy hand-crafted interactions in a magical environment!<br/><br/><br/>CREATE!<br/>Experiment with the enhanced drawing tools, along with a medley of vibrant colors, and turn the blank canvas into your own creative masterpiece!<br/><br/>DISCOVER!<br/>Use your tools to reveal new surprises in this Sketchbook adventure! Different patches unlock different secrets!<br/><br/>SHARE!<br/>Download EPIC 2 to use the drawings you have created in your Sketchbook! Share those drawings with your friends, and they can also share their drawings with you!  <br/><br/>Unlimited ideas make for endless amounts of fun! Draw A Stickman: SKETCHBOOK is just one chapter in the greater stickman universe.  Experience the entire adventure!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:52:18", "background_image": "https://media.rawg.io/media/screenshots/ed6/ed6f75711cdaa99caa88883cb00391f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hitcents"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}