{"id": 356125, "slug": "hotel-hideaway-virtual-reality-life-simulator", "name": "Hotel Hideaway - Virtual Reality Life Simulator", "name_original": "Hotel Hideaway - Virtual Reality Life Simulator", "description": "Jump into the virtual world of Hotel Hideaway: a social online 3D role playing game full of opportunities to meet new people and make friends. This life simulator is a lively and vibrant virtual world full to the brim with social adventures and fun activities!<br/><br/>Dress your avatar to impress and stand out from the crowd with an abundance of stylish clothing, items and accessories. Customize your room with a variety of furniture items and decorations. Chat and talk with other cool characters in this multiplayer game. Learn secret gestures and dance moves- and then party into the early hours inside unique public spaces! This hotel has the actual life of a village full of players!<br/><br/>No matter what you like to spend your time doing, Hotel Hideaway is the virtual reality resort to be. Lots of fun and secrets are waiting so jump in and make sure the other guests recognise your name! Build your popularity in this MMO life simulator!<br/><br/>CREATE AND CUSTOMIZE YOUR 3D AVATAR<br/><br/>• Personalize your avatar down to the smallest detail, with a huge array of clothes, accessories, jewellery, makeup and even tattoos!<br/>• Reflect your own personal hairstyle in your avatar, or go overboard with outrageous costumes. The outfit combinations are endless!<br/>• Express yourself, your lifestyle and your mood by creating your own outfits from different clothing items and colors.<br/>• From formal to casual, streetwear to fantasy and everything in between, there’s something for everyone in this virtual reality.<br/>• New exciting items released every week! Experience actual role playing! Be a social player!<br/><br/>CUSTOMIZE AND DECORATE YOUR VIRTUAL LIFE SIMULATOR<br/><br/>• Design and personalize your own room with a wide selection of furniture items and decorations!<br/>• Turn your room into an epic house party haven for you and your friends, or a private place for rest and relaxation far away from the bustling hallways and public spaces of the hostel.<br/>• Place every item and choose the color scheme to best fit your own dream design for this resort.<br/>• New online fashion items released regularly in this online simulator. If you show a good sense of style, you will build a big fan base!<br/><br/>SOCIALIZE AND HANG OUT WITH NEW PEOPLE <br/><br/>• Chat with other guests and form tribes. Making new friends and influencing others is the only way to become the most popular guest!<br/>• Complete daily tasks! Team up with other guests to earn endless rewards, this is a multiplayer and life simulator!<br/>• Explore this MMO simulator, meet other guests and discover hidden secrets like a club or a restaurant. You may develop a relationship!<br/>• Show off your sense of style and become an icon among your online companions!<br/><br/>3D VIRTUAL REALITY &amp; SOCIAL ROLE PLAYING GAME<br/><br/>• Hotel Hideaway is a 3D virtual world where you can become who you’ve always wanted to be.<br/>• Chat live and meet with other players from around the world. This hotel is just like a tiny city filled with life.<br/>• Visit unique locations and explore what this simulator has to offer. Relax and chill in the spa, party at the beach or hang out in the many other public areas with your friends!<br/>• Be the center of attention with stylish clothing items and pixel outfits. Build a new room for your new stuff!<br/>• Take part in themed seasonal events; just like a living town, there are endless things to see and people to hang out in the hotel every month.<br/><br/>So, what are you waiting for? Jump into the unique RPG and life simulation of Hotel Hideaway NOW and leave your mark! From the creators of Habbo Hotel comes this interactive multiplayer game with no limits, just like a social network. Build your private room at ease in this resort, meet people and create your own role playing community!<br/><br/>Please note that Hotel Hideaway is a 3D RPG game for ages 17+.<br/><br/>FOLLOW US:<br/>facebook.com/HotelHideawayTheGame<br/>instagram.com/hideaway_official", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:30:35", "background_image": "https://media.rawg.io/media/screenshots/c58/c583105d82ae76773861713d8efc6452.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Sulake Corporation Oy"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Mature"}