{"id": 356180, "slug": "modern-car-drive-parking-3d-game-tkn-car-games", "name": "Modern Car Drive Parking 3d Game - TKN Car Games", "name_original": "Modern Car Drive Parking 3d Game - TKN Car Games", "description": "Welcome to a new era of car parking games. In Modern Car Drive Parking 3d, you will experience the real adventure of Free games. Worlds Best Car Parking Game With New Features and Best games Taste. Modern Car Drive: Parking games with thrilling parking levels. Welcome to definitive game experience. From the producers of The Knights Comes a brand-New car parking experience. Worlds Best Car Parking Game With New Features and Best games Taste<br/><br/>Modern Car Drive Parking 3D: Free Games<br/><br/>DRIVE LUXURIOUS CARS IN Free Games<br/><br/>Modern Car Drive Parking is a free games for parking games player. Here you will find physics-based vehicles of all types: classic cars with vintage style, modern cars luxurious features, racing cars with speed and thrill and street cars you find in your real life. Fulfil the challenges in each level. Join Millions of games player who love to drive games and want to become a car parking master.<br/><br/>CAR PARKING CHALLENGE<br/><br/>Modern Car Drive Parking 3d gives you the real challenge of car parking. You may have played many games and fast-paced racing games, but the latest and most comprehensive car parker simulator will give you a challenge of parking cars in tough conditions. Here you are going to have a chance to polish your driving skills. So, enjoy the latest car games and unique car parking adventures now.<br/>Car games will give you a chance to improve your parking skills. Driving a car on the roads is an easy job but parking a car at parking space is tough. After playing car games you will feel you have become a real car driver, then you can play all driving games easily.<br/>Here you getting a chance to polish your driving skills, so enjoy car games &amp; parking adventures.<br/><br/>Lots of road barriers &amp; hurdles will make you an expert in parking and driving. New parking simulator game-play allows you to experience the tough challenges. Feel the rush and try to be the best survival parker in this challenging environment. Get behind the wheel and start the car engine to start your career and polish showing your parking skills. This simulator will allow you to check your skills how good you are in parking skills. Drive carefully and park your car at the exact parking spot in the specific time.<br/><br/>Complete game levels as a real parker and get three stars in every game mission to unlock next game levels and enjoy lots of parking stages. Modern Car Drive Parking 3d provides you with a lot of parking &amp; driving missions which you find in other different car games, so you can learn every skill of car driving and car parking in just one game.<br/><br/>FREE GAMES OF MODERN ERA<br/><br/>Modern Car Drive Parking 3d is a perfectly designed game, according to the standard of modern car games for the fans who love to play thrilled parking and driving games with exhilarating HD graphics and incredibly challenging levels. Dazzling gleam parking car games contain an ultra-quality environment with lots of obstacles and outstanding graphics to entertain yourself. Good time killer car games have amazing varieties of modes and unlimited fun for lovers of parking car games. After installing car games, fasten your seat belts and get ready to drive and enjoy the free games. This free game will let you experience the thrill of parking. If you love driving games then this real car game is a good choice for you.<br/><br/>Modern Car Drive Parking 3d - Car Game Features:<br/><br/>•\tMelodious sound effects<br/>•\tUltimate HD graphics<br/>•\tVery realistic controls<br/>•\tImproving your driving and parking skills<br/><br/>Note:<br/>We’ve tried to provide you with a game based on new ideas, with the new features and best gameplay. We already have a lot of new features planned on our side for the game updates, but we shall be happy to know your opinions. <br/><br/>★ If you have any complaints/suggestions, leave us an e-mail: theknightspvtltd@gmail.com<br/><br/>Don't forget to play free games now, you will have to tap only install button to get free games from play store.<br/>COLLAPSE", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:06:10", "background_image": "https://media.rawg.io/media/screenshots/bc4/bc41984fb5bba9a24481bd87fa90532d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["The Knights Pvt"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}