{"id": 356100, "slug": "bike-stunt-race-master-3d-racing-new-free-games", "name": "Bike Stunt Race Master 3d Racing - New Free Games", "name_original": "Bike Stunt Race Master 3d Racing - New Free Games", "description": "The Knights Inc. Welcomes you in the Bike Race &amp; Bike Stunt Games <br/>Bike Racing Starts :<br/><br/>Bike stunt tricks master is a free mobile game available for android smartphones. Join Millions of game players who love to simulate bike games and want to become pro bike riders. Real bike stunt championship in your smart phone is just about to start; you are just a single tap away. Now the bike stunt game is available with upgraded tricky bikes and crazy riders<br/><br/>Why to Play Bike race Game?<br/><br/>Best chance to be the tricks master by applying stunts in racing 3d game. Only the best mobile game users are invited to perform unique stunts. Put the helmet, start your motorcycle and be the part of this bike race game adventure. Keep in Mind &lt; Helmet is a vital parameter to decide your winning in motor bike stunts, and this will prove at the end of game :-) &gt; Moto games adventure is now on your ﬁnger tips. Tutorial will help you to simulate bike driving.<br/><br/>Contest Overview - real motorcycle stunt vs. moto free games<br/><br/>Tracks are arranged according to real bike race scenarios which carry multiple levels from easy trials to technical approach. Are you motorcycle racer?? Let’s ﬁnd out what you have, use your motorcycle driving tricks and ﬁnish all the challenging task. Real fun of bike stunt and water games in this moto simulator bike race game<br/><br/>Things to Avoid <br/>Don’t hit the hurdle placed in your track; be smart enough, drive professionally by applying crazy moto stunts and became perfect stuntman. Here you are! Apply your motorcycle driving tricks and complete the dangerous tasks on time. We assure you, after playing this bike game for at least 5 mints, you will forget about all car games, bike race games and other water games in simulation. You are about to become a real stunt man of bike games because this is the best water stunt game. <br/><br/>Maximize Stars<br/> Finish all the levels with three stars, and make your chance to qualify for next levels. Some of the levels are conditional as you will only be able to open if you have speciﬁc number of stars. So be fast and quick. Millions of users are in competition with you just like other motorcycle games.<br/> Multiple bikes are available to perform stunts; all the bikes are categorized on the bases of (Grip, acceleration, Flexibility) choose best of them: spend a few coins to upgrade all. All motorbikes are on cheap rate, you don’t need to spend real money on them; just play levels earn coins and spend. This crazy bike stunts mania will turn into race championship if you have passion.<br/><br/>Bike racing controls<br/> <br/>Same as your real stunt bike! <br/> Press the race button to accelerate, press brakes to avoid colliding, left and right arrows are placed to control leaning of bike and jump button is provided as well in this bike racing game.<br/><br/> ** don’t forget to take backﬂip and front-ﬂip for extra rewards **<br/><br/>Note Please - Tilt control is also provided (Go from settings of this Bike Racing Game, select tilt control and enjoy free fun)<br/><br/>In - App purchases and Ads in Bike racing game <br/><br/>Use coins to unlock bikes, you also purchase bikes and take fun of this verity of bikes in this game.Be a moto rider stunt man in your real life if you have passion to simulate the moto in games. But keep in mind:<br/> * Don’t try it at home, ﬁrst take professional trainings!<br/><br/>- Play It Anywhere This Bike Game does NOT require any Wi-Fi connection. You can enjoy racing in the subway, while ﬂying on a (real) plane, in the car on the road, in a temple or mosque (or maybe even in washroom:-P). It’s always going to provide you thrill and fun at any cost! - Free Game, This Free game does not require any single penny from you to play, just tap to start game. We bet it’s the best stunt game available on Google play store. - Age Rating Disclaimer: Bike racing game does NOT contain violence or any other mature content. It’s just a simple and straightforward bike racing game. Free to play, share this Bike stunt game with your friends.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:17:13", "background_image": "https://media.rawg.io/media/screenshots/7d0/7d096a91629d097761aa37e618894017.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["The Knights Pvt"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}