{"id": 356166, "slug": "snakes-and-ladders-free-board-games", "name": "🐍 Snakes and Ladders - Free Board Games 🎲", "name_original": "🐍 Snakes and Ladders - Free Board Games 🎲", "description": "Enjoy the ultimate 🐍Snakes and Ladders game🐍a.k.a  'Chutes and Ladders'  in the most exciting way! It is not a regular snakes and ladders board game but a super-duper high quality unique game. This Snakes &amp; Ladders board game is perfect for kids and adults. 🐍🏃<br/><br/>Snakes and ladders which is also called as \"Chutes and Ladders\" is an ancient Indian board game, played by the King and the people of its kingdom centuries ago. It is now enjoyed by people of all ages with family. It is a perfect family game and kids as well as adults can have hours of fun playing this dice board game. 🎲🎲<br/><br/>Snake and ladder is also known as ‘Chutes &amp; Ladders’ in some countries. Whatever be the name, rules are all the same! Be the King and win the game. 👑🏆<br/><br/>Snakes and ladders new app is a simple race contest and the one who reaches the top first is the Master or King. You have to roll the dice and play turn by turn with your friends or family. Have hours of fun while travelling in train, bus or airplane now with Chutes and Ladders. No internet connection required.🏃<br/><br/>Play snake and ladder game in 4 different modes for free:<br/>- Player 1 vs Computer 🎲<br/>- Player 1 vs Player 2 🎲🎲<br/>- Player 1 vs Player 2 vs Player 3 🎲🎲🎲<br/>- Player 1 vs Player 2 vs Player 3 vs Player 4 🎲🎲🎲🎲<br/><br/>Features of Snakes &amp; Ladders for Kids &amp; Adults - New Free Board Game are:<br/><br/>🐍 FOR ALL AGES: This game is so easy to play, anyone can enjoy. Kids and adults can play together. Snake and ladder game is your ideal family pass time! 👨‍👩‍👧‍👦<br/><br/>🐍 CHOOSE YOUR COLOUR: You can customise your avatar with your favourite colour. 🌈<br/><br/>🐍 PLAY OFFLINE: Play this snake and ladder game for free, anytime and anywhere without internet connection. 😎📱<br/><br/>🐍 MULTIPLAYER: Play with up to 4 players at a time. Select your game mode and start playing. The one who wins in the King or Master! 🥇<br/><br/>🐍 NO IN-APP PURCHASES: We strive to make your experience the best and hence we have no purchases in the app. It is completely free to play! 💯<br/><br/>Searching for snakes and ladders 3D game? Look no further! This snake and ladder game is given a 3D effect for the best experience.<br/><br/>Do you like to play Ludo? If you love to play Ludo and other board games, you will definitely love this new Snakes and Ladders!<br/><br/>🐍 Download and play this ultimate board game - Snakes &amp; Ladders now! 🐍", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:57:56", "background_image": "https://media.rawg.io/media/screenshots/cf7/cf7d8cc403f6629dbe983c9ae0218b4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["IDZ Digital"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone 10+"}