{"id": 356170, "slug": "stick-warriors-fighter-street-vip", "name": "Stick Warriors: Fighter Street VIP", "name_original": "Stick Warriors: Fighter Street VIP", "description": "Stick Warriors: Shadow Fighter will be the most addictive fighting games in your phone<br/><br/>This fighting games will give you a chance to become one of dbz Super Saiyan in stickman character to fight z with enemies and protect everybody on earth. <br/><br/>How To Play:<br/>Stick Warriors: Shadow Fighter has the most basic control ever! you just need to dodge, jump, power your ki, become ultra instinct and destroy your dragon enemies with your skills<br/><br/>Game Features:<br/>- 20+ stickman fighter characters with unique dbz Super Saiyan design style and special skill of each<br/>- 30+ maps in story mode that help you collect stickman fighter characters more quickly. The maps in Stick Warriors be continuously updated, graphics transformation super ssj z on each other maps only in dbgt fight!<br/>- Versus mode for everybody who want to challenge themselves.<br/>- Tournament mode: fighting by your way to win the \"Ultra Instinct\"<br/>- High-quality UI graphics! Stunning special skill effects! Stick Warriors: Shadow Fighter present to you the best stick war fighting games ever!<br/><br/>Collect these kinds of super fighters: dragon ssj2, z ssj3, ssj4, ultra instinct (ui), xeno...<br/>More mugen heroes unlocked and more dragon to team up z with! Join forces with others dbs to fight the UI King BOSS! Choose your own team now and start fighting dbh!<br/>Comic book style cinematic intro for dragon dbs!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:00:02", "background_image": "https://media.rawg.io/media/screenshots/cd0/cd0aa3f3ca4c42255518867cbb7d76a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Premium Times"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}