{"id": 356167, "slug": "sponge-neighbor-escape-3d", "name": "Sponge Neighbor Escape 3D", "name_original": "Sponge Neighbor Escape 3D", "description": "You play for a guy whose name is Bob. You came to the bottom neighborhood of the city and settled next to the sponge neighbor. You liked his unusually huge pineapple house. You thought he was very kind. He has a huge mustache and he always says hello to strangers. You have learned that he works in a fast food restaurant which is famous for its crab burgers. After some time, you learned that the secret burger recipe was stolen. <br/><br/>  Very soon, you began to notice that your new neighbor began to behave discreetly. He always looks around and installed surveillance cameras around his house... Bob decides to find out if he is related to this robbery. Try to get into the house sponge and find evidence. Feel like a detective in the house of your strange neighbour.<br/>  Your curious character Bob should sneak to his house unnoticed. If a sponge sees you then it will catch you immediately! You can run away and hide in your house, hide under the beds in his house. Escape it if he will chase you!<br/> <br/>  The game has been implemented all your wishes. You can change the sensitivity control settings as you like. The game provides you with wide opportunities. You can pick up items and throw them at a neighbor to stun him, it will give you some time to escape!<br/><br/>  You always wanted to be a detective. Find the secret burger recipe and return it to the owner! In addition to the recipe, the restaurant lost money. You saw that your neighbor bought a luxury yacht-car. He could not afford to buy it at the salary of the chef of the restaurant. If he is involved in this - you have to figure it out.<br/><br/>Try and Enjoy the best game simulator!", "metacritic": null, "released": "2019-05-25", "tba": false, "updated": "2020-06-01T02:14:18", "background_image": "https://media.rawg.io/media/screenshots/ddb/ddb6f3ccf8c7ca2eb59ce11963d61590.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["TinySponge Studio", "Maksym Chepurnyi"], "genres": ["Adventure", "Puzzle"], "publishers": ["Maksym Chepurnyi"], "esrb_rating": null}