{"id": 356137, "slug": "roller-coaster-craft-blocky-building-rct-games", "name": "Roller Coaster Craft: Blocky Building & RCT Games", "name_original": "Roller Coaster Craft: Blocky Building & RCT Games", "description": "Build and ride you own rollercoaster! Tycoon in the ultimate amusement park? Everything’s possible in the crafting &amp; building games like this! Build your own funpark and play the best RCT games for free! Play Roller Coaster Craft for free!<br/><br/>Exploration and adventure in Funpark!<br/>Want to build a water park, scary theme park or the most exciting place in the world? Build as you want and design awesome amusement park! That’s no all – design, build and craft interior and exterior items like a boss! Take care of every home design! Build beautiful buildings using blueprints and start exploration of the amusement park world! Start exploration in the best roller coaster park of the world!<br/><br/>Super Roller Coaster Big Craft exploration!<br/>Play one of the best rollercoaster games where you can design the amusement park, ride the train take care of every detail! City building and home design in one app – that’s why crafting &amp; building games are the best! Build, craft and create thrilling rollercoaster tracks, run your own amazing theme park and become a real tycoon! Roller Coaster Craft – show your crafting &amp; building skills in one of the most awesome games for boys and girls! Super roller coasters, ultimate amusement park adventure, best rct games and your chance to become a rollercoaster tycoon in one awesome game! Play Roller Coaster Craft for free!<br/><br/>Prepare for big craft show of your dreams!<br/>Do you remember amazing Theme Park Craft - one of the best crafting &amp; building games in the store? Roller Coaster Craft comes from the same creators and best mobile games tycoons! Begin your exploration of ultimate amusement park with a roller coaster and minigames! Your own funland in big craft world! If you love rct games and want to become a rollercoaster tycoon – play rollercoaster craft games for free!<br/><br/>Be super roller coaster tycoon!<br/>Start building theme park city with crazy blueprints or as you want! Explore it or destroy it and start an adventure again! Develop your business and become the real rollercoaster tycoon. 4 mobile devices of your choice! Start building your theme park empire or a realistic city of Fun Parks! Set the train tracks, wagons and take the scariest park ride ever! Create a mini-zoo (zoo craft) with cute animals and play awesome minigames!<br/><br/>Blocky building games for boys and girls!<br/>Do you prefer boys craft or girls craft games? This big craft is a perfect mix of both genres! Use you theme park builder skills and create a place of roller coaster madness! Rct games combined with crafting &amp; building world – looks like a dream! House design, amusement park, city building games for boys and girls – all in one! <br/><br/>Roller Coaster Craft features:<br/>🎢 Become a rollercoaster tycoon!<br/>🎢 Build a rollercoaster track and ride it.<br/>🎢 Build theme park empire!<br/>🎢 Play minigames in crafting &amp; building world!<br/>🎢 City building in the big craft games!<br/><br/>Enjoy blocky building in one of the best rollercoaster games! Go on an adventure – play Roller Coaster Craft for free!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:38:22", "background_image": "https://media.rawg.io/media/screenshots/8a4/8a4ecd37502cef2db210f92fe298b548.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Fat Lion Games: Crafting & Building Adventure"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}