{"id": 356126, "slug": "its-always-sunny-the-gang-goes-mobile", "name": "It’s Always Sunny: The Gang Goes Mobile", "name_original": "It’s Always Sunny: The Gang Goes Mobile", "description": "Tap your way through the worst bar in Philadelphia! Team up with The Gang from It's Always Sunny -- Mac, Dennis, Charlie, Dee, and Frank -- the hilariously dysfunctional, self-obsessed group of friends, and start schemes to launder Frank's dirty money. <br/><br/>Play through your favorite scenes from the The Emmy® nominated, acclaimed FXX hit comedy IT’S ALWAYS SUNNY IN PHILADELPHIA, and rake in cash from hilarious schemes and unlock characters, guest stars, and facepalming new adventures. While Mac, Dennis, and Dee bicker and backstab over ways to con fools, Frank tasks Charlie with hiding the clean cash in a safe place. But as each new scheme successfully hits its stride, their plans and profits go up in smoke, as Charlie's favorite “safe place” -- the back-alley dumpster -- goes up in flames.<br/>-----------------------------------------------------------------------<br/>GAME FEATURES <br/><br/>COLLECT CHARACTERS &amp; GUEST STARS <br/>Tap, touch, and play with your favorite characters from the show, like Codpiece Dennis, Man-Spider Frank, Wildcard Charlie, Mac, and Ostrich Dee. Your favorite supporting characters are here as well, including The Waitress, Rickety Cricket, Uncle Jack, and more (Rum Ham!!!)!<br/><br/>RELIVE EPISODES FROM THE SHOW<br/>Play through classic scenes and experience cringe-worthy new adventures. Hang out with The Gang behind the bar, in Mac and Dennis' apartment, and many memorable locations from the show.<br/><br/>PLAY WITH DIRTY MONEY<br/>Manage Paddy’s Pub and cook up money-making schemes like Kitten Mittens, Virgin Mary Stain, D--- Towels, and more! Help the Gang exploit fools, back stab each other, and give in to their worst impulses! <br/> <br/>Contact us at support@alwayssunnygame.zendesk.com<br/>Like our page: facebook.com/alwayssunnygame<br/>Follow us on Instagram: @alwayssunnygame<br/>Get updates on Twitter: @alwayssunnygame<br/><br/>By downloading this app, you agree to our privacy policy and terms of use, available at: <br/>Terms of Service - http://www.eastsidegames.com/terms<br/>Privacy Policy - http://www.eastsidegames.com./privacy<br/><br/>Please note that this game is free to download and play, but some game items are available for purchase using real money. A network connection is required to play the game.<br/><br/>It’s Always Sunny: The Gang Goes Mobile TM &amp; © 2018 Fox and its related entities.  All rights reserved.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:30:59", "background_image": "https://media.rawg.io/media/screenshots/f8a/f8af51b3feac79b84e1d451120959b0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["East Side Games Studio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Mature"}