{"id": 356222, "slug": "neighbor-home-smasher", "name": "Neighbor Home Smasher", "name_original": "Neighbor Home Smasher", "description": "Experiencing a bad day? Scolded by your neighbor? Or Life is just messed up? Don’t worry we are here to save your day by presenting you our latest stress reliever game with exciting game play! <br/><br/>You have to enter into neighbor Bob house to perform various missions like shooting, smashing and screwing his home stuff.<br/><br/>Smash and destroy everything that comes in front of you with your power tools. Destroy the house with different guns. Demolish the house interiors with bullets. Take a hit at luxuries of house like LED and LCD TV’s, expensive furniture, wooden bookshelves, glass tables, washing machines, sceneries, cars and many more!<br/><br/>Its like a prop destruction mod. You need to find and destroy all props to complete the Level. This is best house destruction game with best physics and reality.<br/>Destroy the house with different guns.Smash the house interiors with bullets.<br/>There are multiple levels in this game.<br/>Destroy the old house prop and destroy the modern house prop in this game.<br/>this game contain excellent houses. Reduce your stress and play this game<br/>Destruct the home interiors with guns and enjoy the destruction effects.<br/>Be a angry wife or angry neighbor and smash the house. Shoot the modern interiors<br/><br/>Features:<br/><br/>-&gt; Neighbor Bob who will not let you go!<br/>-&gt; Dense house environment who will not let you find prop easily!<br/>-&gt; High Quality 3D Graphics! You will Enjoy how your device will show this Full of <br/>Atmosphere Game and You will feel the Neighbor's presence everywhere!<br/>-&gt; Amazing Sounds! A stunning soundtrack, the ominous melodies of which perfectly <br/>convey the atmosphere of the Smash Neighbor Bob House! Prop Hunting Adventures 3D <br/>thriller!<br/>-&gt; Smooth and Easy Controls! A well-designed first-person camera system that allows you <br/>to move around your neighbor house freely and look around without any delay!<br/>-&gt; Amazing environments.<br/><br/>Download now FOR FREE! and say hello to neighbor bob.", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2021-01-25T03:21:30", "background_image": "https://media.rawg.io/media/screenshots/18e/18e6cd53b873aedc5c99608629333751.jpg", "website": "https://web.facebook.com/FOGRevolution/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["nanoByte", "Naeem Ibrahim"], "genres": ["Adventure", "Simulation"], "publishers": ["Naeem Ibrahim"], "esrb_rating": null}