{"id": 356204, "slug": "dress-up-games-free", "name": "Dress Up Games Free", "name_original": "Dress Up Games Free", "description": "For all fashionistas and virtual doll styling fans here is the ultimate makeover app with tons and tons of clothes to rummage through. <br/><br/>Style gorgeous models for 6 different occasions: prom night, shopping run, wedding, international beauty pageant, pop singer contest and a movie star award show. In each occasion, there is a separate wardrobe, with glamorous dresses, skirts, tops, jackets, capes, shawls and veils. Pick among dozens of chic hairstyles, fancy shoes, stylish handbags, luxurious jewelry and other accessories. Certainly you can also choose the race of the girls. <br/><br/>The game boasts a huge selection of garments - likely more than you've ever seen in a cosplay &amp; fashion simulator. Set your inner fashionista free and train you skill as an outfit designer / image maker for famous actresses, celebrities, top supermodels and glam socialites on the red carpet. Join the world of glamour, Hollywood and Broadway, and imagine you are a superstar, actress, supermodel, music idol or just a crazily rich VIP shopaholic posting hauler videos with millions of fans and subscribers. For even more fame and glory, become the Beauty Queen of the world and marry a millionaire (e.g. some handsome actor with an oceanside mansion in California). Pick a trendy hairstyle and put together amazing bridal or festive outfits for your celebrity model.<br/><br/>If your friends also love dressup apps and digital girl makeovers, be sure to tell them about this great new app! Download it and play it for free, forever, on your Android phone or tablet - it's really the best you've ever seen.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:20:21", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e36075241d382c45f24070c443d1d92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games For Girls OÜ"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}