{"id": 356275, "slug": "sega-heroes-match-3-rpg-game-with-sonic-crew", "name": "SEGA Heroes: Match 3 RPG Game with Sonic & Crew!", "name_original": "SEGA Heroes: Match 3 RPG Game with Sonic & Crew!", "description": "Team up with SEGA characters in a new puzzle RPG! Legendary heroes are ready to form your ultimate SEGA squad - join the adventure now! <br/><br/>Collect SEGA heroes from your favorite games. Sonic the Hedgehog, Shinobi, Streets of Rage and more unite in this strategy puzzle RPG. Build an all-star team in this mash-up of epic proportions, battle by completing match 3 puzzles and defeat iconic SEGA villains!<br/><br/>SEGA classic characters unite. See Sonic and Tails fighting alongside Gillius and B.D. Joe, or have Ryo Hazuki and Joe Musashi team up. Join in an epic RPG adventure with all your favorite characters, with unforgettable puzzle action.<br/><br/>Solve puzzle games to defeat villains, like Sonic’s famous foe Dr. Eggman! Match 3 gems to unleash your characters’ signature attacks in action-packed battles!<br/><br/>Chat with friends in Guilds, battle against other players in the PvP arena, or test your endurance on Survival mode. Heroes from throughout SEGA history come together on your phone in SEGA Heroes!<br/><br/>SEGA Heroes Features:<br/><br/>RPG GAMES WITH EPIC ADVENTURES<br/>● Battle classic SEGA bosses and minions in tactical Match-3 combat<br/>● Team up with your favorite characters and go on an epic adventure through SEGA history<br/>● Battle famous bosses, including Dr. Eggman and Mr. X<br/>● Solve puzzles or enter Survival mode to see how far you can go<br/><br/>MATCH 3 PUZZLES<br/>● Solve puzzle games and progress through tons of levels<br/>● Match 3 pieces to unleash awesome attacks<br/>● Puzzle battles against SEGA’s iconic bad guys!<br/><br/>PvP &amp; ONLINE MULTIPLAYER<br/>● Chat with friends and join a Guild <br/>● PvP battles other players for supremacy in the arena<br/><br/>UPGRADE &amp; EXPLORE<br/>● Play live events, go on new adventures and earn special rewards <br/>● Upgrade SEGA heroes to unlock powerful special abilities <br/><br/>SEGA LEGENDS UNITE<br/>● Sonic the Hedgehog: Sonic, Tails, Big the Cat, Knuckles, Shadow, Amy Rose, Rouge, Cream and Cheese<br/>● Streets of Rage: Blaze, Adam, Axel, Mr. X<br/>● Golden Axe: Death Adder, Ax Battler, Gilius, Tyris <br/>● Shinobi: Joe Musashi, Ageha, Hotsuma, Hibana<br/>● Super Monkey Ball: AiAi, Baby, MeeMee, GonGon<br/>● Jet Set Radio: Gum, DJ Professor K, Beat, Captain Onishima <br/>● Phantasy Star: Alis, Lassic, Wren, Rolf<br/>● Crazy Taxi: B.D. Joe, Gus, Gena, Axel<br/>● The House of the Dead: Dr. Curien, Agent G, Thomas Rogan, Ebitan<br/>● Valkyria Chronicles: Alicia Melchiott, Selvaria Bles, Welkin Gunther, Largo Potter<br/>● Shenmue: Ryo Hazuki, Shenhua… <br/>● New SEGA Heroes released regularly!<br/><br/>Join Sonic the Hedgehog, Death Adder, Gum and all your favorite SEGA all-stars in an all-new match 3 RPG! Download SEGA Heroes today!<br/><br/>--------<br/>Privacy Policy: http://www.sega.com/mprivacy/<br/>Terms of Use: http://www.sega.com/Mobile_EULA<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:04:07", "background_image": "https://media.rawg.io/media/screenshots/444/4448be91465a4d1f005f1648b53eac60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SEGA"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone 10+"}