{"id": 356257, "slug": "jungle-adventures-3", "name": "Jungle Adventures 3", "name_original": "Jungle Adventures 3", "description": "Jungle Adventures 3 - If you liked Jungle Adventures &amp; Jungle Adventures 2, you will definitely love the newest addition in the series. <br/><br/>The story of an enraptured forest - In search of some food in the middle of the night, our hero Addu witnesses some tragic site. The cute Furry people of the forest were being kidnapped by a gang of goons. <br/><br/>Join Addu and his friends on an amazing adventure through remarkable worlds to help him save the Fur family while facing epic challenges blocking his path. <br/><br/>Run, Jump and Smash your way through a breathtaking journey of the all new Jungle Adventures 3 to experience an adventure unlike any other!<br/><br/><br/>Features:<br/><br/>Experience an exciting mix of fun and exploration.<br/>Beautiful and stunning graphics make amazing visuals.<br/>Addu has new abilities and pets.<br/>Unique challenges and tons of bosses to battle.<br/>Easy Controls &amp; Attractive Sound.<br/>More obstacles, power-ups and achievements added.<br/><br/><br/>Let this be the most unforgettable adventure of your life! Download Now!<br/><br/>Avoid obstacles by jumping around and using your powerful abilities against super monsters.<br/><br/>Run while you explore the beautiful worlds which we have created for a magical experience. With daily rewards to keep you hooked with amazing powerups for a great gameplay experience.<br/><br/>Have fun while you race against time in the unique bonus areas which you have to keep a lookout for. The more levels you clear the further you head into your adventure and face the reality of survival across dangerous levels.<br/><br/>With easy to play controls even kids can master this extremely fun and simple game. <br/><br/>With achievements to give you a challenge in the FREE and all new Jungle Adventures 3", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:53:18", "background_image": "https://media.rawg.io/media/screenshots/31f/31fde75271d9a10682a8f1e7e30be425.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rendered Ideas"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}