{"id": 356203, "slug": "car-racing-games-2019-free", "name": "Car Racing Games 2019 Free", "name_original": "Car Racing Games 2019 Free", "description": "Rev up the engines, put on your seat belts and get ready to drive amazing sports cars in this realistic car simulator game. <br/>Car Racing Games 2019 Free is an advanced car driving game with fully controllable extreme sports cars.<br/>Many impressive sports cars to choose from! Each sports car is faster and more power packed than the other! Each car is fully controllable with doors that open and close with a button. You can even open and close the hood and the trunk of all the cars.<br/><br/>Show off your driving skills in an exciting open world! Drift and drive around the city streets in amazing open doors car through realistic traffic and get a real city feel in Car Racing Games 2019 Free.<br/><br/>Different modes in Car Racing Games 2019 Free:<br/>Arrive Missions<br/>Follow the map to arrive at your destination!<br/>Checkpoint Missions<br/>Drive through checkpoints to arrive at your destination<br/>Freestyle Driving <br/>Explore the open world city at leisure<br/><br/>Select the mode that excites you the most and enjoy the challenges in Car Racing Games 2019 Free!<br/><br/>EXCITING FEATURES of Car Racing Games 2019 Free<br/>Open world driving simulator<br/>Fully controllable sports cars<br/>Open doors, hood and trunk of cars<br/>Realistic open world environment<br/>Superb sports cars to choose from<br/>Smooth and realistic car handling<br/>Rich realistic traffic on roads.<br/><br/>Get Car Racing Games 2019 Free now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:19:49", "background_image": "https://media.rawg.io/media/screenshots/986/9862e040d31cd6b6743825e6f1490a58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hyperfame Games Studio"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}