{"id": 356288, "slug": "bus-game-free-top-simulator-games", "name": "Bus Game Free - Top Simulator Games", "name_original": "Bus Game Free - Top Simulator Games", "description": "Bus Game<br/><br/>Good news! The revolution update with more buses, better graphics, better gameplay and overall better player experience is in progress. Expect it very soon!<br/><br/>You must be a fan of the driving games. We assume that you're crazy about parking games as well. If so, this bus game is one of the games that you need! Try to become a bus driver in one of the best bus simulator.<br/>Drive your bus through the city traffic, pick up passengers and drive them safely to their destinations.<br/>Your city bus is big so be careful! Duty driving is not that easy. Watch out for the traffic - don't hit any cars or people crossing.<br/><br/>There are many bus games in the Google Play store but this one is the top game. You can driving around the city, suburbs, construction sites, parks and even the beach. Look around - people are walking, cars are crossing. Get in your bus and become a city traffic racer in this top simulator game.<br/><br/>Bus Game features:<br/><br/>- Full 3D large environment<br/>- Smooth controls optimized for bus sim<br/>- Drive the passengers to their destinations<br/>- Many different routes across the city<br/>- One of the best games in the store<br/>- Offline game (no wi-fi or internet needed)<br/><br/>What does this game have that other games don't:<br/><br/>- Bright colorful graphic style<br/>- Well made optimization for older mobiles <br/>- Interior view<br/>- Easy steering<br/><br/>If you're disappointed with new games, get the solid classic. As all top games, this one gives you the real enjoyment. Master your driving skills in one of the best bus games!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:11:37", "background_image": "https://media.rawg.io/media/screenshots/cca/ccacb0afef48c9546e83638c130c11eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["baklabs"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}