{"id": 356293, "slug": "polynesia-adventure", "name": "Polynesia Adventure", "name_original": "Polynesia Adventure", "description": "Description:<br/>This simulated-adventure game is dedicated to the memory of the consummate determined adventurer, Amelia Earhart.<br/>Let's go back in time to the Polynesia of the early 20th Century. There we will help Emilia find her lost mother...and maybe even save the world in the process. Who knows?<br/>With the guidance of Akamu, your Polynesian ally, we will not only pursue a great adventure, but also build a great farm and city.  <br/>But, just as there are good people along the journey, we will also encounter some bad ones. <br/>In Polynesia Adventures:<br/>-Unleash the spirit of adventure, discover a new world, and find hidden treasures.<br/>-Complete tasks in order to progress further and unlock new worlds to explore. <br/>-Meet new people and work together.<br/>-Build a farm and a big city, extract out raw material and mine and construct various production buildings.<br/>-Create many items and deliver them to your customers to build up a successful business.  <br/>Polynesia Adventures awaits, and promises a world of imagination, challenges, and fun.<br/>We are working very hard to perfecting it, so If you run into any issues while playing or you have any suggestions, please don’t hesitate to reach out to us at polynesiaadventure@gmail.com.<br/>More ways to learn about PolynesiaAdventureGame:<br/>Facebook: https://www.facebook.com/PolynesiaAdventureGame <br/>or search @PolynesiaAdventureGame to follow us.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:14:13", "background_image": "https://media.rawg.io/media/screenshots/499/499eb2732750529a3410866bb5b2d467.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["MMAGAME"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone"}