{"id": 356296, "slug": "mahjong-solitaire-grand-autumn-harvest", "name": "Mahjong Solitaire: Grand Autumn Harvest", "name_original": "Mahjong Solitaire: Grand Autumn Harvest", "description": "Looking for a relaxing puzzle game? Welcome to Mahjong Autumn Harvest! <br/><br/>Enjoy 100s of unique mahjong puzzles for all difficulty levels and so much more – receive lots of free rewards &amp; prizes, collect &amp; craft valuable world treasures, unlock stunning HD artwork and evolve your pet as you play! With more content and bonus levels added each week, the mahjongg fun never stops! <br/><br/>----------------------------------------------------------------<br/>MAHJONG AUTUMN HARVEST - HIGHLIGHTS<br/>----------------------------------------------------------------<br/>⦁ Classic mahjongg solitaire rules with an Autumn Harvest theme<br/>⦁ Easy to understand gameplay suitable for all ages<br/>⦁ Helpful hints are always available when you need them<br/>⦁ Match tiles on an epic journey with over 100 levels<br/>⦁ Rescue and evolve your pet! <br/>⦁ More maps, features &amp; levels added every month!<br/>⦁ Normal and challenging expert modes for mahjongg solitaire experts<br/>⦁ Bonus levels with various ways to play<br/>⦁ Collect Mahjong Autumn Harvest artwork, save &amp; use as a HD background<br/>⦁ Complete dark dungeon levels in each map to earn HUGE rewards<br/>⦁ Free daily rewards &amp; coins for active players<br/>⦁ Each level uses its own unique themed tile sets<br/>⦁ Replay each level as many times as you like to earn more coins<br/>⦁ Earn coins to unlock more exciting mahjongg boards<br/>⦁ Play mahjongg offline, no wifi needed! <br/><br/>★ Fun, Relaxing &amp; Casual Mahjong <br/>We’ve designed our puzzles to be relaxing and fun, suitable for players of all skill levels – whether you’re a mahjong expert or a beginner! All of our puzzles are always solvable so you can sit back, relax and enjoy the game without worrying that you’ve made the wrong move and made the puzzle impossible. <br/><br/>If you ever get stuck, hints are only a tap away!<br/><br/>★ Collect &amp; Craft Rare Treasures<br/>As you go on your Mahjong Autumn Harvest journey you’ll discover ancient, rare artefacts. Collect all the crafting tiles for an artefact and you’ll be able to craft it – keep your treasures or sell them for gold coins, it’s your choice! At the end of each level, you’ll also be able to open a bonus treasure chest. What could they contain? There’s only one way to find out!<br/><br/>DOWNLOAD TODAY &amp; START YOUR MAHJONG ADVENTURE!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:15:50", "background_image": "https://media.rawg.io/media/screenshots/c44/c443e4bfebb1cc4978be576e8596962a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Beautiful Free Mahjong Games by Difference Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}