{"id": 356219, "slug": "pot-shot-crush-box", "name": "Pot Shot-Crush Box", "name_original": "Pot Shot-Crush Box", "description": "Pot Shot is a casual type of game. The game has a beautiful and concise design style, rich level content, and players can use the cannon to launch as much as possible to smash objects on the table for getting a high mark! Unlock all kinds of cannons through a couple of clearance of the quests. Each cannon has different shapes and shells, and can also unlock powerful skills, such as the laser, black hole, continuous shooting, etc.<br/><br/>- Skill system:<br/>Diamonds obtained through level victory can be used to unlock five different effects of skills; The power of the skill is more potent than ordinary bullets;<br/> - Cannon system:<br/>Diamonds can unlock more than 15 kinds of cannons which have different styles; players can choose to use before entering the level;<br/>- Level system:<br/>More than 150 types of standards levels can be cleared through different strategic dimensions;<br/> - Collection system:<br/>You can collect the corresponding level Illustration after clearing the specific BOSS level;<br/> - Scene system:<br/>Players can use diamonds unlock 12 elegant scenes, and use any scene you want in any level;<br/> - Lucky award:<br/>After each level upgrade, players can have an opportunity to get the lucky prize; Lucky people even can get ten times higher diamond rewards.<br/><br/>Let us know and leave some comments if you like this game O(∩_∩)O", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:28:32", "background_image": "https://media.rawg.io/media/screenshots/76e/76e0daf9795fdfbddddf77c8a97478dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Penguins Studio"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}