{"id": 356245, "slug": "ultimate-cribbage-classic-board-card-game", "name": "Ultimate Cribbage - Classic Board Card Game", "name_original": "Ultimate Cribbage - Classic Board Card Game", "description": "The cards are on the table, and it is time to show your skills in one of the most popular card games in the world, Cribbage (Crib)! Think of the best strategy to reach 121 before your rivals do. Play Ultimate Cribbage, the classic card &amp; board game that friends &amp; family have been enjoying for decades!<br/><br/>Clubs, Diamonds, Hearts, or spades! Use the correct card.<br/><br/>Start the game, play against the machine or use the multiplayer option to face players from all over the planet. With this mixture of chance and strategy, each game will be totally different, always guaranteeing maximum entertainment. Unlike casino games such as poker, bingo, or blackjack, cribbage allows you to play free long and addictive games full of adrenaline.<br/><br/>If you already play baccarat, Canasta, Pinochle, Backgammon, Gin Rummy 500, or Solitaire, then you'll love this classic card &amp; board game. Learn to play free crib “live” in a game with great hints. Friends will call you a Cribbage pro in no time!<br/><br/>The classic British card game is ready for your mobile phone and compatible with Android devices so that the whole family can play. Do you feel lucky? Pick up your hand and try to reach the agreed score before anyone else. This card game will give you hours of entertainment with family and friends.<br/><br/>Features:<br/><br/>• Classic cribbage board for two. Play with your friends or family to have an amazing experience.<br/>• Intuitive gameplay. Easy to use mechanism for people of all ages to play.<br/>Options:<br/>• 12 difficulty levels! At every level you will improve your strategy and learn new tricks to be the master of the Cribbage.<br/>• Need a score keeper? Try our automatic hand and crib counting! It makes it easier to count the points and know who is the closest to victory. Do not let anyone cheat!<br/>• Cribbage Pro? Play it the classic way and count points manually. Feel like you're in a real game by writing down the points yourself and doing everything manually.<br/>• Detailed crib, hand, and play score breakdowns every round<br/>• Classic, Muggins, and Shotgun Cribbage (Crib) variants<br/>Challenges: <br/>• Ace our challenges to bring new difficulty levels online. Unlock the most difficult levels and become a Cribbage pro.<br/>• Be a Cribbage Pro and complete them all!<br/>• Coming soon: compare the challenge progress with friends.<br/><br/>Make a friendly bet to make the game more fun or convince your friends to play all together against AI.<br/><br/>Unlike poker or blackjack casino games, cribbage is a game for the whole family, from the youngest to the oldest can play. Take into account the value of each card, and the value of each combination to win the match. Follow our tutorial to understand the rules and the different mode games. Enjoy the best card game ever! Cribbage (Crib) time!<br/><br/>Cribbage is a game from the specialists at Wildcard Games who make free card table games. Trust in our extensive experience in this type of games for a unique experience!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:44:41", "background_image": "https://media.rawg.io/media/screenshots/0c2/0c2f55784992bb56e40ac212ccac8266.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["WildCard Games"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}