{"id": 356363, "slug": "railway-station-craft-magic-tracks-game-training", "name": "Railway Station Craft: Magic Tracks Game Training", "name_original": "Railway Station Craft: Magic Tracks Game Training", "description": "Set up the biggest train company in history! Play train simulator, upgrade railway station and ride on magic tracks towards railway empire! Collect special vehicles like subway euro train, toy trains, miner train and many more! Play the best train games for boys and girls – play Railway Station Craft for free!<br/><br/>Crafting &amp; building of train company!<br/>Are you a house builder? Maybe city building is your hobby and building games for free are your thing. You should play the best train simulator games then! Create a whole trains city in american or indian style! Let the craft show begin! Game training prepare to become railway tycoon! Make money, compete with friends and say happy choo choo! Train is the best way to travel!<br/><br/>Play top fun games for free!<br/>Magic tracks, train upgrading, craft show and train games for boys and girls in one! Play top fun games for free and challenge friends of yours! Thomas, Barry, John and friends love trains as much as you so download Railway Station Craft and play with them! Go on an adventure and start exploration of beautiful city and land of euro rail, subway trains or… miner train! Arcade train game with crafting &amp; building mode – just amazing! Play top free games and start crafting exploration 3D now!<br/><br/>Train simulator in girl games!<br/>Ride on magic tracks and develop your train hobby! Game training before riding a real euro rail or TGV? Why not! Love you subway trains? Name them! Thomas Train, Barry Train. Friends, trains and railway empire in one of top fun games for free! Play Railway Station Craft for free!<br/><br/>Train racing games!<br/>Play top cool games with friends! Train ride is a pleasure you can’t afford if honor of your train simulator empire is in danger! Paint flames on your dinosaur train and play top racing games! Build magic tracks or subway tunnels and have fun! Go, go now! Train simulator games are the best! Say “choo choo” If you agree!<br/><br/>Top free games in subway!<br/>Use your crafting &amp; building skills in one of the best simulator games for free! Build the whole world, own subway, many railway stations and ride cute miner train! Compete with your friends and reach the top of the leaderboard! But be careful – don’t let for train crash during racing! Train crash in dinosaur train… sounds crazy but it happens in crazy subway games!<br/><br/>Railway Station Craft features:<br/>🚂 Top fun games – train theme park building!<br/>🚂 Train games for free – racing with friends and a house party afterwards!<br/>🚂 Cute games – paint your train collection!<br/>🚂 Train simulator games – build a whole Railway City!<br/>🚂 Iconic trains like TGV, toy trains, euro rail!<br/><br/>Play Railway Station Craft for free – one of top fun games of 2019. Go on an adventure, have fun racing with friends and build your train empire!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:56:06", "background_image": "https://media.rawg.io/media/screenshots/331/331041fa33767442acdb90a4ef10c359.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Survival Crafting & Exploration Adventure Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}