{"id": 356396, "slug": "train-craft-build-drive", "name": "Train Craft: Build & Drive", "name_original": "Train Craft: Build & Drive", "description": "Build, craft and explore. Create your own railway system! Building &amp; crafting game for teenage boys and girls! With trains! Exploration &amp; train simulator in sandbox world. Use blocks to build a huge train tracks system then ride a train to test it! Create and build a train station or a tunnel through the mountains! Rail builder game free! Train simulator in blocky sandbox world! Boys craft! Build and construct bridge, city, tunnels or even underground metro! It’s not train mod for  it's a full free game! Great game for teens and adults! Pocket edition of crafting games! Exploration. Build a train station and design and decorate the interior! Make your own adventure - train racing? Maybe an indian railway? Anything you want! Be a train conductor, train operator or bridge constructor! Train operator simulator game (train sim). Euro train super fast or retro choo-choo? Locomotive or a super modern carriage? Connect tracks, build and explore! Endless possibilities! Train simulator 2017 is the latest cutting edge train simulator that will allow you to become the best train driver ever! Crafting games, building games and trains! For the first time! Indian train simulator or TGV! Be a conductor, railway constructor or tracky train driver! FPS simulator! Sim &amp; city train simulator! Get on board! Tiny pocket trains right on your mobile! Pixel choo-choo! You can build many railway tracks and start train racing! Game for teens! Travel with commuters! Check the tickets and build the whole infrastructure from London undergound to New York or Tokyo subway! No subway surfing! Just you and the infinite sandbox blocky world! Building &amp; crafting! Indian train simulator! Be creative - free Building &amp; crafting games! Train   with locomotives! Mining, building and being awesome! Exploration - the new way! In this game you can drill the tunnel through the mountain or build a bridge! First FPS Train simulator not  TRAIN MOD! Craft and create! Story mode of a pocket edition crafting game! For real boys! Best hobby game! <br/><br/><br/>UPCOMING FEATURES:<br/>Multiplayer <br/>Train racing<br/>Snow, sandstorm, rain<br/>Animals and pets<br/>Cars and traffic!<br/>Brazilian mode!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:14:42", "background_image": "https://media.rawg.io/media/screenshots/623/6237cf3b98437c90d05f6be6eb839a78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}