{"id": 356314, "slug": "fix-my-car-zombie-survival-mechanic", "name": "Fix My Car: Zombie Survival Mechanic!", "name_original": "Fix My Car: Zombie Survival Mechanic!", "description": "Scavenge, build, survive! The infection is spreading quickly so work quickly with your beautiful and resourceful partner to find performance parts, tools, and supplies and use your mechanic skills to transform a run-down muscle car into a mean, high performance, zombie-proof ride! Upgrade your auto with dozens of engine, armor, weapon, suspension, body, and interior mods, and then detail it! <br/><br/>* This is the FULL version of the game. You get absolutely everything unlocked upfront with NO ads or IAP! *<br/><br/>Work as a team to fortify and take control of a high-end auto body shop, complete with cutting edge tools and equipment, to build the ultimate car and use it to escape the city! It may be the zombie apocalypse, but nothing says you can't have fun professionally upgrading your car, exploring the facilities, and gathering supplies!<br/><br/>First and foremost this is a car fixing simulation game, where you perform work ranging from routine maintenance to extensive performance upgrades. Rip it apart, fix it, build it back together better than ever, and then detail it to perfection!<br/><br/>FEATURES: <br/><br/>+ 60+ objectives and upgrades to complete!<br/><br/>+ Dozens of tools and cool after-market parts to find and install! <br/><br/>+ Perform dozens of jobs ranging from basic routine maintenance to outrageous performance mods! <br/><br/>+ Explore cool environments!<br/><br/>+ Built-in hint system so you never get stuck! <br/><br/>+ All hints and objectives available in FULL version, LITE version requires unlocking with reward videos or a one-time in app purchase <br/><br/>DETAILS:<br/><br/>See this game and more at: https://firerabbit.com/<br/><br/>Come talk with us on our page at: https://www.facebook.com/firerabbit.canada<br/><br/>Hit us up on Twitter at: https://twitter.com/firerabbit_inc<br/><br/>Instagram: https://www.instagram.com/firerabbit_inc/", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:24:20", "background_image": "https://media.rawg.io/media/screenshots/89f/89f8c7ff830c23f76abcf407847e66e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FireRabbit"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}