{"id": 356387, "slug": "idle-airport-tycoon-tourism-empire", "name": "Idle Airport Tycoon - Tourism Empire", "name_original": "Idle Airport Tycoon - Tourism Empire", "description": "Are you ready to take off?<br/><br/>Thinking about starting your own business and becoming your own boss? Why not become an airport tycoon?<br/><br/>Build your own airport, buy new planes, and research new transportation technologies to become the best airport tycoon in the world!<br/><br/>Take care of your passengers and offer them the best travel experience. Happy tourists bring in more money to purchase and develop the resources needed to keep improving your airport and aircraft. Upgrade the airport facilities and services to create the most popular airport in the world!<br/><br/>Develop a business strategy that will help your transportation business thrive while keeping passengers happy and increasing profit. Make sure to invest in your research department as it will help you to improve the airport’s services and make it the most popular among tourists.<br/><br/>But the fun doesn’t end there. Continue your tycoon adventure by selling your airport and building a new one. You will start over, but this time with all the business know-how previously acquired. The new airport will grow faster and be more profitable thanks to your accumulated experience.<br/><br/>Smart airport managers make smart decisions all the time. Decide which new services to make available and buy new planes to improve your aircraft fleet. Unlock new designs and bigger airplanes to earn more money. Upgrade your airport into a spaceport and conquer the space tourism industry. <br/><br/>If you like incremental games, you’ll love Idle Airport Tycoon. Like with other clicker games, there is always something to do, from researching new technologies and buying better aircraft to improving airport services to attract tourists. You can also sell your airport and start over (prestige) with all your previously acquired management experience, which will help you earn more money with your new airport.<br/><br/>Features:<br/>• Simple and casual gameplay for every player<br/>• Constant challenges suitable for any player at any level<br/>• Dozens of crazy technologies to discover<br/>• Different types of airplanes and aircraft<br/>• Unique items to improve your airport facilities<br/>• Fabulous 3D graphics and awesome animations<br/>• Save your progress to the Cloud and recover it if you change your device", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:09:01", "background_image": "https://media.rawg.io/media/screenshots/c7e/c7e9f964016f68db800bfba35d1b6906.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Codigames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}