{"id": 356330, "slug": "snow-leopard-family-sim-online", "name": "Snow Leopard Family Sim Online", "name_original": "Snow Leopard Family Sim Online", "description": "Explore wild nature as a Snow Leopard and raise a family in this Snow Leopard Family Sim Online game, new RPG adventure set in a huge, massive and challenging 3d world!<br/><br/>Start your journey as a small leopard, find your soulmate, raise the family and build a beautiful home. Play with your friends in online multiplayer games, create clans to keep your family safe. <br/><br/>Unlock unique attacks and skins. Grow your family in Snow Leopard Simulator!<br/><br/>SNOW LEOPARD FAMILY FEATURES:<br/><br/>Snow Leopard - Animal Simulator:<br/>- Animal Simulator: customize your family members by name, gender, fur color, attack and much more!<br/><br/>Raise a Family:<br/>- Customize each family member<br/>- Grow your family up to 10 members and more<br/><br/>Awesome Home:<br/>- Decorate your unique home up with 30 decoration elements<br/>- Unlock stages in the home so cubs have more space to play<br/><br/>Explore 3D World:<br/>  - Travel through different locations to explore different weather conditions<br/>  - Each world has its unique enemies<br/><br/>Online Adventure Game<br/>  - Play with friends<br/>  - Complete daily and weekly events<br/>  - Chat with your buddies<br/>  - Create you clans<br/> <br/>Battle Enemies:<br/>  - Battle dangerous and powerful enemies<br/>  - Party with others to take down dangerous bosses<br/>Raise a family of your favorite Snow Leopard in this adventure online game!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:33:49", "background_image": "https://media.rawg.io/media/screenshots/d83/d83e47b6f9692a048ce77bea05358052.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Area730 Entertainment"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone 10+"}