{"id": 356454, "slug": "anti-terrorism-shooter", "name": "Anti-Terrorism Shooter", "name_original": "Anti-Terrorism Shooter", "description": "Hello there! FPS shooting game fans. Welcome to join this best first person shooter!<br/>This is a front-line action war game. As a heroic warrior, in the front combat zone, use machine guns, shotguns and sniper rifles and other modern combat weapons to kill all kinds of brutal enemies. Use your excellent fighting skills to kill all enemies!<br/><br/>You are a well-trained military battlefield combat special forces members, is the tactical team and modern war power. You are equipped with machine guns, sniper rifles and grenades, you will be in this shooting game to complete the secret task to eliminate the evil forces that hinder world peace. It is time to pick up your guns and become the most brave warrior in this battle.<br/><br/>Accurate aiming, shooting, more accurate elimination of the surrounding terrorists. They are brutal thugs, is the executioner. Ready to fight with the terrorists desperately, give up kindness, and strive to shoot. In order to make you better fight with terrorists, your troops prepared a lot of advanced weapons for you. You are a front-line commando, have excellent combat skills, show all your skills, penetrate the enemy's territory, find and destroy hidden goals.<br/><br/><br/>Anti-Terrorism Shooter Features:<br/>- Exciting map with realistic combat environment<br/>- realistic fighting effect<br/>- amazing music and sound effects<br/>- True graphics<br/>- complex and difficult task<br/>- all kinds of powerful weapons<br/>- Smooth operation and control<br/>- Best FPS game", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:49:29", "background_image": "https://media.rawg.io/media/screenshots/e9e/e9ec907567916835d20c781372622e2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FIRE GAME"], "genres": ["Action"], "publishers": [], "esrb_rating": "Mature"}