{"id": 356412, "slug": "my-little-baby-childproof", "name": "My Little Baby - Childproof!", "name_original": "My Little Baby - Childproof!", "description": "+++ With the newly added microphone you can talk to your little toddler and see how your baby reacts. +++<br/><br/>We guarantee: This Premium Version will never contain advertisement, tracking frameworks or InApp-Purchases.<br/><br/>So you’ve always wanted to lovingly care for a cute little baby? Well here’s your chance with \"My Little Baby\" by TREVA – for all moms, young and old! <br/><br/>Suddenly you have a new arrival and there’s your little darling happily laughing at you. Now it’s down to you to do everything for them and make sure they want for nothing, thrive and grow bigger. Diaper-changing, bathing and feeding is all part of the job along with shopping, cooking meals and rocking your baby to sleep, as is dressing, cuddling and playing with them. Help your little cherub to crawl and walk and use the camera to take some great snaps of you and your little treasure. <br/><br/>And all of this comes with an awesome range of toys, clothing and other items to make your baby the happiest child in world!<br/><br/>•\tExperience super cute graphics with over 100 animations.<br/>•\tChoose your baby’s toys, clothing and other items from a huge range<br/>•\tMake your own choice of your baby’s skin, hair and eye color<br/>•\tCreate cute pictures of you and your new arrival<br/><br/>+++<br/>Languages: English, French, Spanish, Italian, German<br/>+++<br/><br/>+++<br/>Enjoy more TREVA games:<br/>http://www.treva-entertainment.com/english/<br/>http://www.pferdundpony-spiele.de/games/<br/>http://www.anikids.de/games/<br/>++++", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:23:57", "background_image": "https://media.rawg.io/media/screenshots/297/297b1f32bfa82c0903902ebb21614f84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Markt+Technik Verlag"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}