{"id": 356490, "slug": "bingo-pets-party-dog-days", "name": "Bingo Pets Party: Dog Days", "name_original": "Bingo Pets Party: Dog Days", "description": "Join in the Bingo Pets Party fun in our new, free bingo game! Enjoy hours of super bingo fun as you adventure to magical worlds, collect &amp; craft rare treasures, unlock lots of HD artwork and much more! If you’re a fan of bingo and you want a relaxing game you can play anywhere – look no further!<br/><br/>OVER 75 LEVELS OF BINGO PETS FUN!<br/>Our new bingo pets game has over 75 amazing levels for you to enjoy! Build your collection of awesome bingo daubers, unlock stunning HD artwork, craft rare treasures and more! With so much to do and more content added regularly, the fun never stops at Bingo Pets Party! <br/><br/>UNLOCK HD BINGO PETS ARTWORK!<br/>Ready for a cuteness overload? Hidden throughout the levels are secret puzzle pieces. If you can collect all of these puzzle pieces you’ll unlock stunning HD artwork of cute animals. Frame it, save it or send it to you friends – it’s yours to keep!<br/><br/>SPIN THE WHEEL OF FORTUNE<br/>There’s a magical wheel of fortune at Bingo Pets Party! Every day you can come and spin it to receive guaranteed rewards and prizes. From chests of gold coins to extra keys, there are lots of different prizes to win. Make sure to check back every day for a spin! <br/><br/>-------------------------------------------------------<br/>BINGO PETS PARTY - HIGHLIGHTS<br/>-------------------------------------------------------<br/>★ An exciting variation of classic 75 and 90 ball bingo<br/>★ Play through over 75 levels of fun, free bingo<br/>★ Lots of exciting new maps added every month<br/>★ Unlock beautiful HD artwork of cute animals<br/>★ Unlock funky new daubers &amp; more<br/>★ Spin the wheel of fortune to earn free gifts, coins, daubers and more!  <br/>★ Collect free coins and use them to buy power ups to help on your bingo quest<br/>★ Use your keys to unlock treasure chests at the end of each level – what could they contain?<br/>★ Change the bingo caller speed to suit your playing style<br/>★ Play bingo offline – no wifi needed! <br/><br/>Sit back, relax and immerse yourself in the sunny world of Bingo Pets Party. Explore stunning locations, play exciting, free bingo and enjoy new maps released regularly. With so much epic bingo in one game, why play anywhere else?!<br/><br/>JOIN THE FUN AT BINGO PETS PARTY – DOWNLOAD FREE TODAY", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:12:26", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3d89e6f4a36b4c9ba88e0e98d7b5d48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Beautiful Bingo Games by Difference Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}