{"id": 356460, "slug": "stickman-vs-stickmen-games-shotgun-shooting", "name": "Stickman vs Stickmen Games: Shotgun Shooting", "name_original": "Stickman vs Stickmen Games: Shotgun Shooting", "description": "Stickman vs Stickman: Stickman Games ( With Stickgirl addition )<br/><br/>The Knights Pvt Ltd welcomes you in real puzzle based stickman shooting games! Make strategy first and then shoot and become shooting games master! Stickman shooting games is the most addictive shooting and targeting 2d games of 2018. Stickman games is a fantastic action game. This stickman games have everything you like. Get ready to try your luck ? Then join the gun shoot battle with stickman shooters. <br/>Are you ready to defeat enemies in stickman games? Join the best stickman games.. Use your stickman fighting skills and become a best stickman gun shoo ter. Multiple Guns with different lazers are provided choose your favorite gun to start the action in stickman games. Consider yourself best stickman games player and play like an expert. Play stickman games &amp; show your gun shoot skils. Addictive stickman games with amazing stickman characters. choose your favorite gun and start the stickman games in your free time . Stickman games is very easy to play you can play anywhere. In stickman games you will have to shoot your enemies. Join the stickman games and fight with other stickmans.  Stickman games one of the best gun shoot game for every user who like the gun shoot games <br/><br/>Stickman shoot free games Levels” ::<br/><br/>This shooting games consist of 60 interesting levels. We assure you that each level is unique in its nature. Your strategy will be challenged in each shooting level. Your expertise will increase as you will spend time in game. Some levels are designed in way that the enemies are just static on their tracks and in some levels enemies are moving with certain speed so don’t waste your bullets and hit in right spot and in right time. Stickman games is challenging 2D environment gun shoot game. If you have enjoy the shooting games, or action games then stickman games is perfect for you. <br/><br/>- Stickman Extra Powers for fighting<br/><br/>This stickman games contains a few levels in which you will have to get extra power to damage the path to shoot your enemy. Play the stickman game smartly and get enough power in the level and then shoot. <br/><br/>-Stickman Reflector Levels <br/><br/>This game contains a few levels which are designed in way that you can’t hit your target directly, so find out the rotating arrows which will take you’re your shoot to target. <br/><br/>-Stick Girl Level<br/><br/>One level included to release the girls from crusher, other stickmen are going to press the button to crush the stickgirl, you need to kill all of them before they reach the switch.<br/><br/>Stickman vs Stickman : stickman GamesFeatures:<br/><br/>Great game for expelling your anger <br/>Vibrant graphics and silky-smooth animation <br/>Tons of exciting missions<br/>Hours of gun shooting fun<br/>Easy and smooth control of guns<br/>Limited Time to Play each level<br/>Limited bullets<br/>Multiple Lazer Guns<br/>Free Hint for levels<br/>Strategy and action game<br/><br/>Stickman Games not require any internet connection, play for free at no cost!This Stickman game is free to play, but it contains items that can be purchased for real money and may contain third party advertisements that may redirect you to a third-party site.<br/>If you like Stickman gun shoot game, please rate and give your feedback for further improvement of the game. <br/><br/>Warning: this gun shoot game contains lots fun!<br/><br/>Stay tuned for further updates every week !", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:55:16", "background_image": "https://media.rawg.io/media/screenshots/514/514adcfe4273196141de013ea697cc41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["The Knights Pvt"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}