{"id": 356445, "slug": "dead-target-offline-zombie-shooting-games", "name": "DEAD TARGET: Offline Zombie Shooting Games", "name_original": "DEAD TARGET: Offline Zombie Shooting Games", "description": "Keep your defense up and shoot zombies in one of the best first-person shooters, DEAD TARGET. Can you figure out the key to survival in Zombie Games?<br/><br/>Millions of shooters are shooting to kill zombies and save the world, let’s join with them and become the best!<br/><br/>In 2040, World War III struck, and the country’s frontiers changed. The zombie apocalypse began. A special sniper team was hired to head to the warfare, collect guns and supply to save mankind!<br/><br/>Fight for survival in a zombie apocalypse with the shooting games. Choose a best gun to fight against the dead that are walking toward you<br/><br/>Kill all the dead and don't leave any zombies alive!! Are you ready for all the action and adventure in this awesome shooter game? If you don’t want to be a dead, try your best in shooting and killing in wonderful zombie shooting games! <br/><br/>This Zombies game is an action game where you can: <br/>- Shooting zombies in this addictive Shooting game with epic 3D weapons<br/>- Upgrade guns and gear to face the upcoming zombie waves in zombie offline games<br/>- Experience 3D shooting as a zombie hunter in best zombie game<br/>- Slay zombies of all types in to the dead when you set your nerve to the highest level<br/><br/>-------<br/>DEAD TARGET FEATURES:<br/><br/>APOCALYPSE – CAN YOU SURVIVE?<br/>- A free FPS offline game where huge waves of zombies come to you as the storm<br/>- Shoot zombies before the invasion come toward you, the dead can come anytime in this Zombie game<br/>- Kill zombie by head shot to survive in the truly Shooting game<br/><br/>VARIETY OF ZOMBIES IN OFFLINE SHOOTING GAMES<br/>- Zombies with various killing abilities in the best offline game<br/>- Zombie games with some zombies those can be extremely infected with the virus<br/>- This Zombie game is one of the Zombies Shooting game with the most zombie types<br/><br/>POWERFUL WEAPONS OFFLINE GAMES<br/>- Shooting game with multiple weapons – A rifle, shotgun, and more<br/>- Upgrade the trigger and every part of the gun to shoot zombie <br/>- Unlock 3D guns when you rank up and improve your strength to become a true killer in sniper games<br/>- Discover combat moves in Shooting game using various guns<br/>- Shoot zombies with the right boost to become a terminator on the battlefield to win zombie game<br/><br/>ADDICTIVE QUESTS &amp; ACHIEVEMENTS IN BEST GUN GAME<br/>- Shooting zombies to survive in shooting games and complete quests to rank up and unlock more cool items in sniper games<br/>- Shoot zombies so you can be the last one standing and become a legend in this zombie shooting game<br/>- Weird achievements are always the highest paid in this zombie game<br/><br/>BATTLE ON DIFFERENT MAPS IN ACTION GAMES<br/>- Prevent zombies from escaping while defending the breached frontlines in offline games<br/>- A precise shot in offline games can trigger an explosion that can save the sniper at the right time<br/>- shooting games with many kind of lands to discover<br/><br/>EPIC EFFECTS IN ZOMBIE HUNTER<br/>- Enjoy 3D graphics with realistic lighting to present the infection of zombie in the sniper game<br/>- Shooting game with guns those have different sound effects to represent their real-life versions<br/>- Experience the dead with realistic graphics in zombie fighting games<br/><br/>LEADERBOARD SHOOTER GAME<br/>- Compare your kill records to know who is the best shooter<br/>- Share what you have done in the best shooter offline game<br/>- Shoot the most zombies to become the top zombie hunter in offline game<br/><br/>This zombie shooter is different from other Zombie games because of the addictive gameplay, many type of zombies and guns, a realistic 3D graphics and effects. As specially, this Zombie shooter game is offline game, you can shoot Zombies whenever and wherever you want<br/><br/>Can you survive the zombie apocalypse? Protect the frontlines in the FPS game, DEAD TARGET. Download now to start shooting zombies in best offline game<br/><br/>--<br/>NOTE: The game will require READ_EXTERNAL_STORAGE, WRITE_EXTERNAL_STORAGE to play some features.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:42:52", "background_image": "https://media.rawg.io/media/screenshots/c0c/c0cf3667d90af60c19af00f6bc3ab50e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VNG GAME STUDIOS"], "genres": ["Action"], "publishers": [], "esrb_rating": "Mature"}