{"id": 356485, "slug": "beach-party-craft-summer-high-school-adventure", "name": "Beach Party Craft: Summer High School Adventure", "name_original": "Beach Party Craft: Summer High School Adventure", "description": "Sleep all day, PARTY ALL NIGHT! Enjoy holidays break on summer high school vacation camp in a paradise! Bay watch won’t stop you from being a beach party king at the hottest beach on Earth! Music, dancing, crafting &amp; building!<br/><br/>Time for a summer high school adventure!<br/>Imagine a paradise island: warm nights, hot beaches, cute girls and handsome boys… It’s all here in Beach Party Craft! Experience an unique mix of crafting &amp; building games with fashion games, music games and dancing games! Start your high school music adventure with crafting &amp; building your own world (from blueprints!) or look for fun in the paradise island of Beach Party Craft! Sea adventure begins!<br/><br/>Are you ready for the hottest beach party on Earth?<br/>Beach Party Craft isn’t only about crafting &amp; building. It’s one of the best party games, but before you go wild like a party animal, make some preparations! Go shopping and change your clothes - it’s not a fashion runway, but not a pool party too! Dress up, add some makeup, visit nail salon and spa, look for famous hair salon of Coco. Games for girls are usually plain simple, but Beach Party Craft isn’t! If you want to amuse your best high school friends, boyfriend or girlfriend, you MUST dress up like a star. Dancing queen or king is going to be yours!<br/><br/>Enjoy the nightlife<br/>In Beach Party Craft you will find other party fun fans! Meet with friends from high school or last dorm party, then chat with your high school crush! But don’t waste your time on some high school romance like in many casual games for girls. Instead, look for single boys and girls - craft your own love story. Find a hip hop dancing queen like Elsa or a disco girl of your dreams like Nikki. Have fun in the theme park and become the best friends or maybe even a girlfriend and boyfriend!<br/><br/>Sea adventure awaits<br/>Tired of beach party? Build yourself a fishing boat or… a glamorous yacht! Launch the sea safari and invite your high school friends or even a… mermaid! Craft, build and design - make the best yacht party on the ocean! Craft the best vacation ever - only in Beach Party Craft!<br/><br/>CORE FEATURES:<br/>• Crafting &amp; building party city!<br/>• Become a party king at every beach party!<br/>• Listen disco or hip hop music and find the best dance moves!<br/>• Impress boys and girls, craft your own story!<br/>• Find a boyfriend or girlfriend. Love story without high school romance!<br/>• Amuse yourself in the best theme park by the sea!<br/><br/>UPCOMING FEATURES:<br/>• Multi Craft - multiplayer mode!<br/>• More clothes to dress up!<br/>• More dance moves!<br/>• More blocks!<br/><br/>The hottest beach on a paradise island and the hottest beach party in the fashion world awaits in Beach Party Craft! Crafting &amp; building games meet music games and dancing games in one of the best of casual games for girls of 2017! This vacation you just can’t miss this summer camp. Sit back, relax and DRESS UP your mobile phone with the best beach game for girls and boys! FOR FREE!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:10:16", "background_image": "https://media.rawg.io/media/screenshots/892/892780a791706ca11cd3760d0b02da52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Fat Lion Games: Crafting & Building Adventure"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Teen"}