{"id": 356416, "slug": "secret-high-school-season-1-vampire-love-story", "name": "Secret High School Season 1: Vampire Love Story", "name_original": "Secret High School Season 1: Vampire Love Story", "description": "Bella Olsen used to be a normal high school girl. One day, a terrible car accident happened to her, she thought she’s going to die. Unexpectedly, she woke up and found herself lying in her bed with no wounds at all. Later, she found herself became a vampire!<br/><br/>She hid her secret and went back to school. She dated a new student in her class —— Zac Stanwood, but accidently exposed her vampire identity during their first dinner date. Surprisingly, Zac was not scared at all.<br/><br/>While Bella and Zac were totally into each other, Bella's ex-boyfriend Spencer suddenly came back. Zac told Bella he's a vampire and Spencer is an evil werewolf. <br/><br/>A lot of mysterious things happened in this high school, ready to be part of it?<br/><br/><br/>Features:<br/>-Design your own special sun protection ring.<br/>-Give yourself a head to toe makeover started from a relaxing SPA.<br/>-Choose from tons of stylish makeup items.<br/>-Put on the trendiest outfit!<br/>-Dye your hair and have colorful highlights! DIY lipstick and eyeshadow.<br/>-Decorate the party according to your wonderful taste.<br/>-Class time! But Zac steals your whole attention.<br/>-School lunch time! You and Zac pretend to be human and eat food. It’s funny, right?<br/>-Decorate yummy birthday cake and host a party!<br/>-Surprise! Wait, why is your boyfriend comes with my BFF? Are they cheating on you?<br/>-OMG, you ex-boyfriend shows up again at dinner!<br/>-Who will you choose between Zac and Spencer? <br/><br/>And so much more are waiting for you to find out at SECRET HIGH SCHOOL!<br/><br/>Wanna have more fun? We would love to hear from you!<br/>Find us on Facebook at https://www.facebook.com/Beauty-Salon-Games-1094161030602834/<br/>For more information about Beauty Salon Games, please visit http://www.beautysalongames.net/", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:26:20", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffe2b1204b8b9bf0f83c8685fbadc017.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Beauty Salon Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Teen"}