{"id": 356508, "slug": "rollercoaster-tycoon-touch-build-your-theme-park", "name": "RollerCoaster Tycoon Touch - Build your Theme Park", "name_original": "RollerCoaster Tycoon Touch - Build your Theme Park", "description": "Build and rule your dream theme park in RollerCoaster Tycoon® Touch™. <br/><br/>\"Easily the best Roller Coaster Tycoon experience since RollerCoaster Tycoon 3 was released back in 2004.\" GAMEZEBO<br/><br/>Play the best theme park builder game! Creating, customizing and sharing your coolest park creations in beautiful 3D graphics has never been this fun or easy. Discover over 250 attractions including rides, roller coasters, restaurants, shops, decorations and more to build your pocket dream park. Complete fun missions every day and weekly challenges to obtain rewards to improve your park, keep your peeps happy and make more money! The innovative, touch-control roller coaster builder allows you to effortlessly draw crazy and unique roller coasters. Personalize your park, express your creativity, pick your layout, customize colors on all your attractions, and take pictures to share with your friends. Your pocket dream park awaits!<br/> <br/>KEY FEATURES:<br/><br/>• ATTRACTIONS:  Customize your dream park and delight guests by choosing from over 250 different rides, park decorations, paths, restaurants, shops, and more. All rides are beautifully rendered and animated in 3D! <br/><br/>• ROLLER COASTER EDITOR:  Easily build crazy custom coasters. Customize trains, stations and tracks by simply drawing with one finger. Or you can directly place beautiful pre-made coasters into your park using blueprints. <br/><br/>• CUSTOMIZATION: Use the powerful park editor to redesign your park at will. Use paths, fences and decorations to create themed sections. Change the color of your attractions by choosing from over 30 various colors !<br/><br/>• WATER PARK: A brand-new secondary park full of water slides and tropical fun. Make a splash today!<br/><br/>• SCENARIOS: Play through a number of tricky challenges to get sweet in-game rewards!<br/><br/>• PARK MANAGEMENT: this deep sim lets you create a successful park by maximizing peep satisfaction level, park value and revenue. Set prices as you wish and launch marketing campaigns to bring in new guests! Track everything easily with the intuitive Park Management screen.<br/><br/>• CARDS: Create an amazing park by completing a wide collection of 700 cards of various rarities: common, rare, epic, or legendary! Level-up to unlock new cards, and open card packs every day to obtain them. Complete daily missions, or visit the Card Shop to buy new cards. <br/><br/>• SOCIAL:  Visit your friends' parks and trade cards with them. Play with other players during seasonal events and coaster design challenges.   <br/><br/>COMPATIBILITY<br/>THIS IS A RESOURCE-INTENSIVE GAME FEATURING HIGH QUALITY 3D GRAPHICS. WE CURRENTLY SUPPORT ANDROID PHONES AND TABLETS WITH AT LEAST 1Gb MEMORY, RUNNING ON ANDROID 4.4 OR LATER.<br/><br/>Follow us on Facebook:<br/>https://www.facebook.com/RollerCoasterTycoonTouch<br/><br/>Follow us on Twitter:<br/>https://twitter.com/RCT_Touch<br/><br/>Follow us on Instagram:<br/>https://www.instagram.com/rollercoastertycoontouch/<br/><br/>Follow us on Youtube:<br/>https://www.youtube.com/channel/UCw-LG-U2sVDJB7Bon-5y9Nw<br/><br/>Have fun!!!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:23:22", "background_image": "https://media.rawg.io/media/screenshots/7fb/7fb92d15856cc219f8db74c07c3cbb90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Atari"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}