{"id": 356516, "slug": "chess-repertoire-manager-pro-build-train-play", "name": "Chess Repertoire Manager PRO - Build, Train & Play", "name_original": "Chess Repertoire Manager PRO - Build, Train & Play", "description": "Imagine you have a friend who is always willing to play chess with you anytime and anywhere. Who always conform with the chess opening that you are studying and comfortable with. A friend and an opponent that can adjust to your playing strength and allows you to take back a move if you made a mistake. The kind of opponent that shows you what he thinks in each board position of the game. A friend and a coach that helps you prepare an opening repertoire and helps you train with it. This is what this chess app is all about.<br/><br/>Main App Features:<br/><br/>♞ This chess app can be used offline.<br/>♞ This chess app has no ads.<br/>♞ Create unlimited chess opening repertoire for white and black.<br/>♞ Manage repertoire and organize your chess openings through folder hierarchy.<br/>♞ Backup and restore main database.<br/>♞ Built-in world's strongest chess engine (Stockfish 10) for analysis and finding best move.<br/>♞ Play chess against the engine using your own opening repertoire as opening book or play with your friend on the same device.<br/>♞ Complete list of chess openings that you can replay or study.<br/>♞ Automatic determination of opening names through built-in Encyclopedia of Chess Openings (ECO).<br/>♞ One touch move feature.<br/>♞ Support for other UCI chess engines and remote chess engines.<br/>♞ Ability to add move NAG annotation and rearrange candidate moves<br/>♞ Customize app theme color.<br/>♞ Customize chessboard color.<br/>♞ Ability to enter position comment for better retention of move to play.<br/>♞ Import games from PGN files to your repertoire including comments and variation lines.<br/>♞ Included 4000 chess games of super grand masters in PGN file format for reference.<br/>♞ Excellent chess book companion.<br/>♞ Load own games in PGN file format and analyze them through the built-in chess engine.<br/>♞ Integrated PGN viewer/editor to replay or edit games and save back to PGN file.<br/>♞ Ability to calculate variation lines beyond every candidate move.<br/>♞ Ability to handle transpositions in your opening repertoire<br/>♞ Ability to set position comments to be auto-read by device's TTS engine.<br/>♞ Ability to choose the depth and line repetition to train in an opening.<br/>♞ Ability to train randomly or sequentially either from starting position or from anywhere in the opening tree.<br/>♞ Ability to demo or preview line in training before trying the moves.<br/><br/>OPTION: Before buying perhaps you want to try the free version. With some limited functionality you can still get the hang out of this app. Look for Chess Repertoire Manager Free:<br/><br/>LINK: https://play.google.com/store/apps/details?id=com.ayelmarc.chessorm<br/><br/>Chess Repertoire Manager PRO is a chess training application focusing on the opening stage of the chess game and a must have tool for every serious or tournament chess player's arsenal who doesn't want to get caught in a bad position in the opening of their chess play.<br/><br/>The main idea is gain an advantage and prevent a losing position in the opening by having your best reply for every possible opponent move. So how can you do it? This is where this app comes into action.<br/><br/>Quick overview on how to use the main feature of the app: First, open the app and go to manage repertoire. Add your opening. Then select Prepare. On the main UI (the chessboard) enter your move and every opponents expected move manually. Use the built-in chess engine to find your best move or use a good chess book. Alternatively, import a PGN file with many games including comments and variations to automatically populate your chess opening repertoire. Then you are ready to train your opening. Select train in the main menu. Train your chess opening repertoire by playing mock games against it until you are familiar (pattern recognition) with every terrain (variation lines) in your opening repertoire.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:27:08", "background_image": "https://media.rawg.io/media/screenshots/0f0/0f039029dafc7fd9603d131995a4b979.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ayelmarc Apps"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}