{"id": 356522, "slug": "big-farm-mobile-harvest-free-farming-game", "name": "Big Farm: Mobile Harvest – Free Farming Game", "name_original": "Big Farm: Mobile Harvest – Free Farming Game", "description": "Big Farm is an online farming game where you can build a farm that everyone will envy. Plant, harvest, and trade goods to help your dream farm thrive!<br/><br/>When Uncle George wills you an old farm, it is your time to step up your farming skills and turn an untended field into flourishing farmland. In this cool farming game, you can: plant and harvest crops, and take care of animals, trade with villagers and sell your goods on the organic market. All these features and more await you in this farm management game.<br/><br/>BUILD YOUR DREAM FARM<br/>Carry your farm in your pocket wherever you go and never miss an opportunity to level up and expand in your favorite farming game. This free farm game is a unique blend of town building and farming. Decorate your farm or customize your farmhouse. Upgrade your barn, farmhouse, stables, and fields to increase productivity. You can be a farmer and a town builder when you play Big Farm: Mobile Harvest- one of the best farming games out there! Become a farmer and watch your farm town and farm land thrive.<br/><br/>FARM TOGETHER<br/>Living in an old farm country means being part of a family farm community. Become close friends with all the villagers - Benny, Tessa and all their jolly friends are waiting for you. Meet other farmers from all over the world and become a beloved member of the Big Farm- top farm game community. Join them in cooperatives in which you support each other. <br/><br/>MORE THAN JUST FARM BUILDING<br/>The harvest year is full of events - follow through the quests of the villagers and let your own farm story unfold. Help the villagers organize a farmland fairy tale festival, solve the mystery of UFO sightings above the farmhouse, or get in the Christmas spirit. Are you ready to build the farm of your dreams? <br/><br/>MORE TOP FARM GAME FEATURES<br/>❀ BUILD the farm of your dreams with plenty of buildings and decorations<br/>❀ JOIN the community and meet farmers worldwide<br/>❀ HARVEST your favorite fruits, vegetables, and flowers <br/>❀ PRODUCE and harvest organic foods and farm fresh goods all from your own farm village<br/>❀ MANAGE realistic production cycles<br/>❀ TAKE CARE of animals and raise chickens, cows, and pigs <br/><br/>Discover the Adventure farm: our new monthly event with plenty of new buildings and decorations, cute animals, and challenging quests. Look forward to new farm adventures!<br/><br/>Take your new farm everywhere. What are you waiting for? Install today and embark on your farm adventure! Play Big Farm: Mobile Harvest now for free! <br/><br/>Problems &amp; Questions: http://support.goodgamestudios.com/?lang=en&amp;g=16<br/>Facebook:  https://www.facebook.com/BigfarmMobile/<br/>Terms of Service: https://www.goodgamestudios.com/terms_en/#terms<br/>Privacy Policy: https://www.goodgamestudios.com/terms_en/#privacy-mobile<br/>Imprint: https://www.goodgamestudios.com/terms_en/#imprint<br/><br/>Subscription (optional):<br/>– Big Farm: Mobile Harvest offers an automatically renewing monthly subscription to the Big Farm Club.<br/>– The subscription activates special effects, bonuses and/or convenience functions for your farm while the subscription is active.<br/>– Your subscription will be charged to your Google Play account upon confirmation of purchase and will be automatically renewed each month unless you cancel the automatic renewal at least 24 hours before the end of the current period.<br/>– In your Google Play account settings, you can manage your subscription after making the purchase and/or deactivate automatic renewal.<br/>– Once you have canceled a subscription, you will continue to receive your active bonuses until the date on which the automatic renewal would have taken place. All active bonuses for this subscription will expire on this date.<br/><br/>*This app is completely free to play. Additionally, it offers optional in-app purchases. You may disable in-app purchasing using your device settings. This game requires an internet connection.", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-17T16:49:47", "background_image": "https://media.rawg.io/media/screenshots/7f9/7f9a4a366feb1b9c55ce5dff3e687e10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Goodgame Studios"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}