{"id": 356589, "slug": "schnapsen-app-vollversion", "name": "Schnapsen App Vollversion", "name_original": "Schnapsen App Vollversion", "description": "Schnapsen App im Kurzüberblick<br/><br/>- Cooles Design!<br/>- Freche Kartenspieler-Sprüche vom Gegner!<br/>- Die gängigen Spielregeln!<br/>- Intelligenter Computer, der Spielen „gelernt“ hat!<br/>- Anzeige von eigenen Stiche und Punkten!<br/>- Intuitives Handling! (Karte mittels Klick oder Drag and Drop ausspielen)<br/>- Hilfreiche Aktionsanzeige bei Option auf 20 oder 40 bzw. bei Farb- und Stichzwang! <br/>- Statistik über deinen Spielerfolg!<br/><br/>„Na, da kannst dir gratulieren!“ <br/><br/>Nein echt jetzt, herzliche Gratulation: Du hast es im AppStore zur besten Schnapsen-App geschafft, die es in diesem Internet gibt!  Jetzt wird alles gut!<br/><br/>Was ist super an Schnapsen App? <br/>- Wir sind die lustigste Schnapsen-App, die es gibt. Weil Spaß gehört dazu zum Kartendübeln. Und wenn du Dialektanfänger bist und das letzte Wort nicht verstanden hast, keine Angst: Mit Schnapsen App wirst es noch lernen – lies weiter!<br/><br/>- Mit Schnapsen App werden auch die Warmduscher, Beckenrandschwimmer und Nebensaisonbucher ihre Lektion in punkto dialektische, psychologische Kriegsführung lernen. Das gehört am Stammtisch eben dazu. Von 4 verschiedenen Gegnern wirst du verbale Wuchteln lernen, die sich gewaschen haben. Spaß garantiert!<br/><br/>- Wir sind ganz nebenbei auch die graphisch schönste Schnapsen-App der Welt. 4 verschiedene Kartendecks von Comic über Doppeldeutsch bis zu Riesensymbolen für den kurzsichtigen Kartenspieler und 4 verschiedene Hintergründe von der Wiese bis zum Beisl machen Schnapsen App zu einem hübschen und vielseitigen Erlebnis. <br/><br/>- Schnapsen App orientiert sich an den gängigen Spielregeln. 1er, 2er, 3er, 20, 40, Bubentausch, zuadrahn, 66 „danke genug“. Wer sich beschwert, dass der Computer bescheisst kennt entweder andere Regeln oder ist ein echt schlechter Verlierer. <br/><br/>- Schnapsen App ist die ideale Zwischendurch-Beschäftigung fürs auf-den-Bus-warten, den Klogang, das Arztwartezimmer und fade Familientreffen. Einfach ein lustiges Bummerl spielen und gschwind einen Gegner betonieren! <br/><br/><br/>Wirst du den Sepp, die Putzi, die Trudl und Hubert, den Schnapsenkönig selbst, besiegen? Oder dir von ihnen eine Goschen anhängen lassen? <br/>Wirst du die Statistik vom Schnapsenkönig selbst schlagen können? <br/><br/>Wirst du die Nerven bewahren, wenn es heißt: „Des san jo kane Bummerl, wos die do hobm, des is jo scho Ausschlog!“ <br/><br/>Hier die Features nochmal im Schnelldurchlauf<br/><br/>- Alle üblichen Spielregeln werden berücksichtigt<br/>- Ausspielen der Karte sowohl mittels Klick, als auch mittels Drag and Drop<br/>- Das Tauschen des Atout Buben mittels Drag and Drop<br/>- Eigenen Stiche mittels Klick auf Stiche-Stapel anzeigen<br/>- Punkteanzeige<br/>- Aktionsanzeige - Um die Benutzerfreundlichkeit zu steigern, gibt es bei Option auf 20 oder 40 bzw. bei Farb- und Stichzwang eine kleine Anzeige, damit du nichts übersiehst.<br/><br/>Die Vorteile der Vollversion<br/>- Werbungsfrei! <br/>- Vier unterschiedliche Gegner mit unterschiedlicher Spielstärke und Spielanlage<br/>- Vier verschiedene Schnapsen Umgebungen (Beisl, Casino, Wirtshaus, Wiese)<br/>- klassische Kartensets, doppeldeutsche und französische Karten, großes Kartenset für bessere Lesbarkeit<br/>- Statistik – mittels derer du dich über Facebook mit Schnapsen-König Hubert, dem Verfasser dieser Zeilen messen kannst. <br/><br/>Und wer bis jetzt noch nicht weiß worum es eigentlich geht…<br/>Schnapsen, ein Kartenspiel für 2 Personen, ist vor allem im deutschsprachigen Raum insbesondere in Österreich sehr beliebt. Man kennt das Spiel auch unter den Namen \"Zweierschnapsen\", \"Schnopsn\", \"Bummerln\", \"66\", \"Santase\", \"Snapszer\" oder \"Sechsundsechzig\", ist aber nicht zu verwechseln mit Bauernschnapsen.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:13:40", "background_image": "https://media.rawg.io/media/screenshots/1f1/1f1d09d4dba812dc0721fabe6f9a515d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Schnapsen"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}