{"id": 356599, "slug": "stickman-ghost-ninja-warrior-action-offline-game", "name": "Stickman Ghost: Ninja Warrior Action Offline Game", "name_original": "Stickman Ghost: Ninja Warrior Action Offline Game", "description": "Stickman Ghost Premium offer you:<br/>✅Unlock Pet.<br/>✅Free 20.000 golds.<br/>✅No interstitial ads.<br/>Stickman Ghost is a perfect combination of role-playing game, hack and slash action games and stickman game.<br/>      Stickman Ghost contains a variety of weaponry such as swords, bows and axes to become archer, bowman. With the skills and equipment, the stickman will be transported to the world of attractive stickman. You will have to become a stickman ninja warrior to fight with evil sticks and epic shadow bosses.<br/>Do you have enough motivation, courage and passion to join the battle?<br/><br/>      On a bloody moon night in the medieval kingdom, the whole world of stickman is invaded by evil. Stickman ghost - hero in the blood of dragons and fire with the power of a god, he is determined to go through the land, defeating the demon stickman to rescue people in the medieval kingdom. Stickman anger has reached the highest level. The journey to find peace for all the land and to rescue the world began.<br/>     Fight for justice and destroy the evil stick to avoid the extinction of the Sstick ninja world with the league of stickman!<br/><br/>      The best of stickman game<br/>      Stickman Ghost is a famous stickman game from the Unimob series that has millions of players around the globe.<br/>Try to feel the strongest stickman ninja, immersed in all the new skills with Stickman  graphics style. You will not want to miss a moment in this game.<br/><br/>      Deep into the battle with league of stickman<br/>      If you want to hack and slash or be become archer, bowman, let equip epic weapon of stickman in shop. Slash and fight or you die. Each shadow fight battle is different from the beginning to the end but with the help of angels and pets, if you use many skills and weapon, the ninja will be stronger and win faster. Try not to get the monsters hit.<br/><br/>      Upgrade, equip and stronger<br/>      With the variety of characters, level, attack, defense and blood are very important in fighting the enemy. Anger stickman can use their powers, abilities and special weapons to destroy enemies quickly like archer, bowman... Some monsters are extremely dangerous and you may need a more powerful weapon. Upgrade your attack power, armor, blood and enjoy the victory in each battle.<br/><br/>     Features of Stickman Ghost: Ninja Warrior<br/>•\tRealistic wobble, ragdoll physics make funny action in fighting battles.<br/>•\tThere are two modes of stickman fighting for you: Experience 60 challenging levels with a wide variety of stickman and monster types.And the mode does not end so that the stick man can show their skills and strength before the other ten thousand stick man.<br/>•\t10 different types of weapons and power to equip, choose your sword, bow, axe and a lot of weapons to become a stickman gladiator or stickman archer or simply a stickman kungfu, each weapon will have each level.<br/>•\tYou can slash, shoot, jump, fight and deep into the shadow fight.<br/>•\tAmazing gameplay with a combination of action game and role-playing to make the best stickman ninja game.<br/>•\tEasy control with one-touch chop shots.<br/>•\tMedieval warfare style combined with the legendary stick man ninja character that immerses you in this game.<br/>•\tGlobal rankings help you prove yourself to be the strongest stick ninja sat with other players.<br/><br/>      Are you a fan of stickman game? Do you like action rpg game, download Stickman Ghost now and play with millions of other players around the world explore the fascinating and engaging stick man world.<br/>      Are you ready to become stickman warrior right now? Experience and tell us what you think about RPG Game: Stickman Ghost and interact with millions of other players. Keep in touch with us if you like rpg Stickman Ghost: Ninja Warrior and do not forget comments to us about this stickman fighting game. We would love to hear from you!<br/><br/>Official Facebook Page: https://www.facebook.com/StickmanGhost/", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:19:52", "background_image": "https://media.rawg.io/media/screenshots/37a/37aa76cf2249bce570f70b4c5677a56e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Unimob"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone"}