{"id": 356586, "slug": "girl-squad-fashion-bff-fashionista-dress-up", "name": "Girl Squad Fashion - BFF Fashionista Dress Up", "name_original": "Girl Squad Fashion - BFF Fashionista Dress Up", "description": "If you love beauty &amp; styling games, be sure to check this new dressup app for young fashionistas. There are 5 doll models on the screen for which you can select race, and then assemble millions of glam outfits from a huge wardrobe of luxurious, stylish apparel. The selection of garments is just amazing (these cuties know the best boutiques to shop at!), and you can style each character as an actress, movie star, a reality show superstar, celebrity model of the runway, a glamor red carpet socialite, or just a cute shopaholic chic with a millionaire dad and unlimited cash to spend.<br/><br/>Press the \"camera\" button when you've finished designing outfits, to grab a screenshot. Share with your friends on social networks to show off your talents as an outfit designer. Press \"more games\" to download and play more of our cosplay &amp; salon apps for Android. All our makeover simulators are free, with no in-app purchases or locks. We've got many makeovers with glamour supermodels, celebrities, actresses and stars. Our games let you dream of being a famous supermodel of the podium, rising to the top charts of trendy fashion magazines. In each game, there are dozes of dresses, hairstyles, tops, skirts, accessories, shoes, jewelry, adorable pets, and much more. Design a unique look, pick a fancy hairstyle and put together an excellent combination of fitting clothing.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:11:37", "background_image": "https://media.rawg.io/media/screenshots/65a/65a771350d912c1ad0fcf86149a70d11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games For Girls OÜ"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}