{"id": 356551, "slug": "emerald-chess-android-wear", "name": "Emerald Chess Android Wear", "name_original": "Emerald Chess Android Wear", "description": "Emerald Chess is chess for android wear. Play the classic game on your wrist, against a friend or a computer. Featuring 3 different difficulty modes to challenge players of all levels. Wear Chess. is part of our. Wear Games. series.<br/><br/>For the first time players can play the great classic game of chess on their smart watches. Emerald Chess is the first chess game on the market and the first chess app developed for smart watches.<br/><br/>The game will be sure to entertain you for a very long time. Our challenging Deep Green AI™ will push you to your limits enjoy hours of fun with. Chess Wear.<br/><br/>We also welcome customer feedback and seek to provide nothing short of the best quality apps on the market, if you find a problem with the app don't hesitate to get in contact.<br/><br/>This android wear game is available for all devices, including the moto 360, samsung gear live, sony smartwatch 3, lg g watch and more.<br/><br/>**PERMISSIONS**<br/>There are many permissions required for this application including internet access, accounts access and more, these are for the online-multiplayer features we are working on at the moment. We take our user's privacy very seriously and do not make use of these permissions without the explicit consent of the user.<br/><br/>** FEATURES COMING SOON **<br/><br/>- Online Multiplayeru<br/>- CPU vs CPU games<br/><br/>Email: callan102@gmail.com for any queries related to this app", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:49:26", "background_image": "https://media.rawg.io/media/screenshots/d1e/d1e30b46b493cab8836a3c18f2f2fbbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Emerald Co."], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}