{"id": 356650, "slug": "adderup-fun-new-number-tile-combo-matching-game", "name": "AdderUp - fun new number tile, combo matching game", "name_original": "AdderUp - fun new number tile, combo matching game", "description": "If you like adding and combination games, you will love this game! This addition game is super fun - with changing targets and higher scores for quick action, you are challenged to  train your brain and think fast as the levels increase.<br/><br/>AdderUp is better than a 5x5 number tile game, better than a 6x6 puzzle game, even better than 7x7 tiles - this is 6x10!<br/><br/>This is not your typical mindless game. Even a fun mindless game can get old quickly.  AdderUp will help you increase your math skills and sharpen your mind. AdderUp is great number tile game and easy math practice. Think of that, an addition practice game that is fun to play! Not a mindless game at all, but a game you will like to play and learn while playing.<br/><br/>Each game is different, a new challenge, and you compete to beat your high scores.  The faster you make the combinations, the higher your score will be.  Add faster to get higher scores and challenge your friends to beat you.  Who is smarter?  Who has a better strategy to get the highest score? Turn AdderUp into a fun competition with friends and family. Perfect for all levels of players, even young math learners will enjoy making combinations and practicing math in a fun way.<br/><br/>No ads!  No permissions required!  A safe, non-intrusive app.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:52:22", "background_image": "https://media.rawg.io/media/screenshots/9f0/9f08fd4e8979bc39c7456aafd89e58fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Sonyay"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}