{"id": 356646, "slug": "tooth-fairy-horse-caring-pony-beauty-adventure", "name": "Tooth Fairy Horse - Caring Pony Beauty Adventure", "name_original": "Tooth Fairy Horse - Caring Pony Beauty Adventure", "description": "Meet our cute Tooth Fairy Princess in a new 2019 awesome rainbow horse game! If you like caring games for girls with levels and horse farm games then this is the princess horse game for you!<br/><br/>Tooth Fairy Princess trust the magical caring of her unicorns, horses and the pony family to a complete horse farm with all you can think of: From simple farming levels to all kinds of fun riding, horse breeding, horse dash, horse park, rainbow hair salon, pony beauty adventure or any other wild farm exciting challenges!<br/><br/>While you play on the rainbow beauty salon of the farm in these girl games for free, you will discover a sort of pony beauty salon and hair salon for horses in a stable in which you can explore more than just a cute horse braiding hair activity... You will have the chance to visit a horseland with all kinds of fairy princess unicorns, horses for kids, ponies and all kinds of fairy tale animals, which a girl like you will find very interesting. Visit this horse haven and enjoy this farm game like never before!<br/><br/>Join the ponies and horses in the Tooth Fairy magical kingdom and take a trip to the horse magical rainbow hair salon and spa, where you can try the new pony horse grooming and makeover, hair styler, hairdos, horse dress up, pony dress up, dress up games for girls, dressup fairy, dressup the rainbow magic unicorn and give the pony a special braided hairstyle combined with its dress design. Enjoy taking care of their little pony tail too!<br/><br/>Join the Tooth Fairy horse braiding academy to learn all about caring horse, braiding hair and braiding hairstyles, how to ride them and how to love and give them the best attention in the world.<br/>Start this fairy and pony adventure in the fairy farm cleaning the pony horse stable. In this stable, all kind of horses as the mare or the stallion, and even the wild horse get ready for their adventures. Live the magic of the horse riding and dressage and become an equestrian in this pony adventure! Observe your horse evolution from the beginning!<br/><br/>Prepare the mane of the horse as a professional hairdresser! Clean and comb the mane hair style. Mane caring is essential for a girl unicorn as it represents the perfect breeding and grooming when the caring animals are taking a horse carriage! Try with mane braiding or different hair cuts! Become an innovative hairstyle changer in these hairstyle games for girls! There are many hairstyles in this mane beauty salon! Use some perfume and decoration on your pony baby too!  <br/><br/>Continue now with the hooves. They need to be healthy and strong to run all over the kingdom. The horseshoes are vital for the unicorn evolution. Remove the old ones and brush the hoof. Replace the horseshoe with a new one. Now it is time to apply decorations in this pony creator of dress up ponies. Show your best pony look to take the Tooth fairy carriage! Change your dressing and saddle as you prefer and start living unicorn and pony horse adventures!<br/><br/>Features of this Tooth Fairy horse beauty adventure and spa games for girls:<br/><br/>- Stable games: works smooth on different devices. Enjoy this unircorn horse game!<br/>- One of the best caring games for kids.<br/>- Complete riding horse games with all you can think of!<br/>- These horses breeding games are easy for kids of any age!<br/>- One of the best free horse caring games all around the world!<br/>- Complete the horse training and finish all the quests in this pony beauty adventure!<br/>- Enjoy the painting and drawing arts with us! Start drawing cartoons in the drawing books free you will find in the beauty salon!<br/><br/>The ultimate horse rider will love this horse and rainbow Tooth fairy unicorn care app because of its gameplay and all the great rainbow features!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:49:49", "background_image": "https://media.rawg.io/media/screenshots/fcf/fcf294e6df2c33673cf5c010fd8bc034.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LAB CAVE GAMES"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone 10+"}