{"id": 356697, "slug": "bingo-star-bingo-games", "name": "Bingo Star - Bingo Games", "name_original": "Bingo Star - Bingo Games", "description": "Hear the bingo caller, play special lucky bingo cards in real time and spin the bonus wheel in an online bingo app adventure that combines absolute skills with fortune<br/>Install and play today! <br/><br/>The most exciting free Fast-Paced bingo game is just a click and play! Bingo Stars is for you, play your way through the game and unlock amazing new episodes with cool background music. Take part in Star Tourney and compete with your friends and rivals around the world and win big! Enjoy lots of spectacular bingo power-ups that help to boost your winning! One of the best real-time multiplayer bingo with awesome features that will take your bingo game to an epic bingo win! Don’t miss out! <br/><br/>Play Bingo Star - Bingo Live on your mobile phone &amp; tablet – play bingo online anytime, anywhere! It's time to hit Bingo Cards<br/><br/>FEATURES <br/>- Tournament-style play <br/>- A lot of amazing episodes to collect <br/>- Amazing Star Tourney Leaderboard <br/>- Daily power-ups and bingo tickets<br/>- High-quality graphics <br/>- Awesome boosters will help you to win in back-to-back tournaments<br/>- Compete with thousands of people around the globe in real-time multiplayer <br/>- Live chat with players<br/>- Free app updates<br/><br/>Thanks for playing Bingo Star - Bingo Live!<br/>We would love to hear your feedback!<br/><br/>PLEASE NOTE! Bingo Star - Bingo Live is free to download and play, however, some game items can also be purchased for real money.<br/>The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"<br/><br/>Support<br/>Questions? Contact our tech support at bingostar@playcus.com<br/>Privacy Policy: <br/>https://www.playcus.com/privacy-policy<br/><br/>Terms of Service:<br/>https://www.playcus.com/terms-of-service", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:16:56", "background_image": "https://media.rawg.io/media/screenshots/85d/85dae4f99904e552c55051bb223b69b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Playcus - bingo games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}