{"id": 356688, "slug": "the-catapult-2", "name": "The Catapult 2", "name_original": "The Catapult 2", "description": "“The Catapult 2” is the continuation of the popular game about the brave stickman, who with the help of a catapult on the top of the tower, trying to protect his castle from destruction by the army of the stickman enemy.<br/><br/>Now our stickman warrior has new weapons and a large number of means of defense. In addition to the catapult, you can crush the attackers from the ballista and destroy them with accurate cannon shots. Throw stones, cannonballs, bombs, arrows and magic shells at opponents. Skills are added to the new version of the game “The Catapult”. Now you can hit opponents not only with a volley of cannon balls, but also with a lightning strike.<br/><br/>The game saved a simple intuitive control. Tap on the screen and pull to charge the catapult and choose the tension force. Release to launch the projectile into the enemy and smash them!<br/><br/>It becomes more difficult to defend, because there are more opponents. In addition to the classic infinite mode, a campaign of 120 levels has been added to the game, in which our hero will now be confronted with not only stickmen on catapults, but also artillery, siege towers, siege rams and huge walking combat mechanisms capable of blowing up the castle from one volley of their powerful guns.<br/><br/>In order to fight off enemy warriors and withstand a siege, constantly update and grow your castle. You can upgrade the towers by adding slots with archers or cannons that will hit more damage to the enemy. You can also upgrade the defense by placing a barricades in front of the castle or mines to stop the enemy. New equipment and armor are added to make your stickman hero stronger.<br/><br/>The game has a two players mode. You can play duels with friends without the Internet on one screen.<br/><br/>Multiplayer is available! Now you can play online with other players and win PvP battles!<br/><br/>Download the second part of the popular free game “The Catapult”.<br/><br/>We are actively working on updates, so we are waiting for your wishes and comments on the game.<br/><br/>Have a nice game!!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:12:54", "background_image": "https://media.rawg.io/media/screenshots/bc7/bc7534353485a63372c037ac04c680ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BYV"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}