{"id": 356779, "slug": "nights-at-cube-pizzeria-3d-4", "name": "Nights at Cube Pizzeria 3D – 4", "name_original": "Nights at Cube Pizzeria 3D – 4", "description": "Cube nightmare continues! Another chapter of Nights at Cube Pizzeria 3D scary game awaits!<br/><br/>Welcome to the Cube nightmare once again! You’re the night guard, and your duty is to watch on cameras and prevent occasional accidents like obstruction of the ventilation systems. But you should fight for your life instead! Survive being a pizzeria night security guard and escape from your nightmare! These seven nights are going to be the worst nights in your life!<br/><br/>Face your nightmare with Nights at Cube Pizzeria 3D – 4! Beware of angry robot bears, tigers, chickens, bunnies and foxes and even worse creatures hiding in the shadows! These robots were made to help in Cube Pizzeria, but during the night ancient evil awakening inside their bodies, and they become unpredictable and starts chasing you! Who else could be in this nightmare mines? Try Nights at Cube Pizzeria 3D – 4 game – meet cube bear robots and other creatures, and escape from them to survive!<br/><br/>Watch the movement of robot animals and open or close the doors to stop their movement - or switch on the light not to let cube bears, foxes and bunnies attack you! Use the flashlight to protect yourself from the attack! Tssssss! Can you hear it? Something is moving inside walls! Quickly, look onto this monitor! Yes, we have some problem into the ventilation system! You should solve it before robot bear could creep to you from vents!<br/><br/>Spend seven nights at pizzeria full of scary cube monsters - chicken, fox, bunny, bear robots and ever more! Use a very limited amount of electricity per night to protect yourself from robots’ attack! Stay in your security office, watch cube creatures with cameras and try to survive! When you run out of power for the night - all cameras and light are off and cube robots are able to move! Beware of cube bear robots walking in the pizzeria! Escape from your nightmare! Face cube robots with Nights at Cube Pizzeria 3D – 4!<br/><br/>Finish your work safe after seven scary and horrible nights with Nights at Cube Pizzeria 3D – 4!<br/><br/>Nights at Cube Pizzeria 3D – 4 features:<br/>New game – even scarier!<br/>All best features from previous parts<br/>Unusual 3d environment<br/>New Cube Pizzeria locations to explore<br/>Ventilation systems filled with monsters too – you should turn in on and off to protect your life<br/><br/>Enjoy the atmosphere of pixel horror with Nights at Cube Pizzeria 3D – 4! Don’t let cube robot monsters get close to your security office! Spend seven nights at Cube Pizzeria and stay alive!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:02:32", "background_image": "https://media.rawg.io/media/screenshots/313/313739457524a9abc8607ec8e4357e10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GamesArcade"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Teen"}