{"id": 356704, "slug": "250-solitaire-collection", "name": "250+ Solitaire Collection", "name_original": "250+ Solitaire Collection", "description": "\"250+ Solitaire Collection\" is a collection of 253 solitaire games.<br/><br/>The collection contains favorite solitaire games such as Freecell, Klondike, Canfield, Golf, Spider, Scorpion, Pyramid, Tri-Peaks, and others, as well as a lot of original games.<br/><br/>For each game, there is a demo. You can view playing card games demo with a step-by-step solitaire guide. So trying new solitaire games will never be a challenge again.<br/><br/>This free solitaire app has a text description of the rules for each patience game. Rules describe a game purpose, foundation and tableau piles, stock regulations and placement.<br/><br/>You can modify the rules of most solitaire games.<br/>Also, you create a new solitaire game of types: Freecell, Klondike, Algerian Patience, Scorpion, Canfield, Pyramid, and Golf.<br/><br/>If you are a board games fun, you’ll love application settings agility. It can be customized for any kind of card player. You are able to set common game options, animation, game table background, cards style, and their back view. A player can manage the application visual theme, sound scheme, and language. Backup functionality added to make your patience game stable, calm and pleasant on phones and pads<br/><br/>The program requires Android 4.0 or higher. This collection gives you solitaire no wifi needed.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:20:34", "background_image": "https://media.rawg.io/media/screenshots/35f/35fb872fc0200b0b053a928bf783d146.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Alexei Anoshenko"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}