{"id": 356874, "slug": "kiss-kiss-spin-the-bottle-for-chatting-fun", "name": "Kiss Kiss: Spin the Bottle for Chatting & Fun", "name_original": "Kiss Kiss: Spin the Bottle for Chatting & Fun", "description": "Tired of the traditional kissing games? Kiss Kiss: spin the bottle is your new chance to fall in love and find amazing friend. Join one of the best bottle spin games!<br/><br/>Kiss or Dare? Don’t be shy! Meet people around the world in seconds: more than 21,000,000 players worldwide have already joined our exciting bottle game. Kiss Kiss is one of the best dating games for chatting, dating, and having fun with players in your city and other countries. <br/><br/>Complete fun, simple tasks to find a multitude of new friends. Chat and swap compliments, participate in friendly matches, bombard your competitors with snowballs, get more kisses than anyone else and win in contests. <br/><br/>Kiss Kiss is:<br/>❤ A fun game to play spin the bottle (or truth or dare) with friends from Facebook, as well as more than 21 million players from all over the world <br/>❤ Talk openly in age-specific chat rooms about anything, keep in mind - this is the game for adults<br/>❤ Complete tasks that will help you in simple and easy ways to get to know people you find attractive.<br/>❤ Date, kiss a boy or sent a compliment to a girl, share gifts and comments<br/>❤ Play in fun contests, matches and competitions<br/>❤ Create a unique and individual look to show off how awesome you are<br/>❤ Form clans with new friends and others close to you<br/><br/>How is Kiss Kiss played?<br/><br/>Spin the bottle! During a game, the Bottle will point to a random user of the opposite sex with whom you then have a chance to kiss. Whether you kiss them or not is up to you. You will soon find out with which users at the table you share a mutual attraction! Send free virtual gifts and compliments to users you like, or choose to bombard those you don’t like with snowballs and eggs. By completing simple and fun tasks you will easily get to know people you find attractive. Also, by gathering one of many gift collections you will receive a beautiful photo frame that'll help you get even more likes.<br/><br/>Kiss Kiss is an amazing friendship app as well as a dating app that gives you a chance to meet THE ONE. You never know who you meet today, maybe it’s a future best buddy or your first love. <br/><br/>There are a many love games for girls and boys but only in Kiss Kiss you can become a part of the worldwide community of people, learn about new cultures and, of course, virtually kiss a girl or a guy you like. <br/><br/>Kiss Kiss is the best dating game available free of charge for everyone. Spin the bottle today to change your life tomorrow! 😉<br/><br/>Contact a Support: support@getkisskiss.com", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-19T14:48:15", "background_image": "https://media.rawg.io/media/screenshots/8c9/8c9ce689c94a0b9b848e381ffd61bbc6.jpg", "website": "", "rating": 4.33, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 9, "toplay": 9, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 12, "platforms": ["Android"], "developers": ["PLAYNETA"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Mature"}