{"id": 356872, "slug": "toy-toon-2020", "name": "Toy & Toon 2020", "name_original": "Toy & Toon 2020", "description": "It’s time to enjoy the fun😁 in the new match 3 game---Toy &amp; Toon! Switch, match and crush hundreds of toys🎠 to challenge funny puzzles and make high scores with your friends👩👨.<br/><br/>Start your adventure in a magical toy world. Match three or more blocks of the same color🎨 by your fingers and make the toy world by combining special boosters, Experience the greatest adventures🏅 through hundreds of levels in the toy world and your puzzle skills will be show off with hours of block blasting&amp;crushing fun!😘<br/><br/>Play toy crush with your friends and players from all over the world in tournament🏆 to see who can get the highest score and gain more reputation🏅!<br/><br/>-HOW TO PLAY-<br/>●Swap to match 3 or more similar toys in a line to crush them.<br/>●Match 4 puzzle pieces create the direction toy bombs.<br/>●Match 5 in T or L to create cross or diamond toy bombs<br/>●Crush and Blast blocks away with power-up boosters.<br/>●Find different kinds of powerful combos is the key to solve puzzles in toy world.<br/>●Don’t forget to get daily rewards and spin the wheel for free gifts<br/><br/>-Toy &amp; Toon FEATURES-<br/>●🆓Completely free game to play;<br/>●🎉Over 600 funny&amp;challenging levels in toy world;<br/>●😄Various interesting events in every week;<br/>●⏳Update 40 exciting levels in each month;<br/>●🏆Challenge other players from all over the world in unique tournament;<br/><br/>Download Now!<br/>Join us and enjoy the fantastic toy world!😍", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:52:13", "background_image": "https://media.rawg.io/media/screenshots/112/112dc4b4977f0486980e5e62abcecb71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ZYMobile"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}