{"id": 356807, "slug": "darts-club-pvp-multiplayer", "name": "Darts Club: PvP Multiplayer", "name_original": "Darts Club: PvP Multiplayer", "description": "Darts Club is a PvP multiplayer game with a collectible twist! Increase your darts skills, collect new pieces to upgrade your darts and take on players from around the world<br/><br/>Features:<br/>- PvP MULTIPLAYER: Find and defeat opponents from around the world!<br/>- INTRICATE UPGRADE SYSTEM: Find new pieces to strengthen your darts!<br/>- MULTIPLE DETAILED VENUES: Unlock them by advancing in the ranks<br/>- SPECIAL EVENTS &amp; MORE: Discover surprises we’ve planned for the future!<br/><br/>Compete against other people online in this uniquely involving Darts game! Learn to throw your dart efficiently and precisely, master your skills and become a Worldwide Dart Champion!<br/><br/>By playing the game and winning matches you unlock new pieces and can use them to customize your darts! With new barrels, shafts and flights your darts will get a unique look and a performance boost in multiplayer PvP clash! <br/><br/>As your equipment becomes better, so do your chances of winning, but the deciding factor will still be your skill. Even the best darts won’t help you if you don’t master the art of throwing them! <br/><br/>The more you play Darts, the better you’ll be able to anticipate where the dart lands when you throw it. Don't give up, discover your inner Dart Champion and dominate the multiplayer PvP online arena!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:16:45", "background_image": "https://media.rawg.io/media/screenshots/e3a/e3ac8b575dbaa9fa8c72c498d593572d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BoomBit Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone"}