{"id": 356833, "slug": "business-with-friends-fun-social-business-game", "name": "Business with Friends - Fun Social Business Game", "name_original": "Business with Friends - Fun Social Business Game", "description": "Business Dice is a board game played with family, friends &amp; kids.<br/>Business Dice Game is Free to Download!<br/><br/>Business Dice is a Dice game that depends on Luck. <br/>Business Dice is a king of board game.<br/>Business Dice is a mind game. <br/>Business Dice is one type of puzzle game. <br/>Business Dice game is played all ages people like kids, young and old man game.<br/>Business Dice is also known as Bankrupt and is very similar to a Spanish board game.<br/>Business Dice game other name is Landlord.<br/><br/>Trade lands, build houses, win auctions, roll wheel to get prizes - have fun. it follows Asian Business Trade Game rule, we customize this Rule to the player convenience. <br/><br/>KEY FEATURE<br/>- Realistic 3d dice graphics Board.<br/>- Build houses by gaining experience in different rooms.<br/>- Visits your favorite Business properties such as Club House and Best Home.<br/>- Travel across classic Business properties to reach places around the world.<br/>- Four Players can play at a time in Online.<br/><br/>Business Dice<br/>Business Dice Plus<br/>Board Games<br/>Happy New year Business Dice Game<br/>Business Dice 2018.<br/><br/><br/>Business Dice Game played with:-<br/>- Play against computer<br/>- Play with Friends (Local Multiplayer)<br/>- Play With People around the world.<br/>- Play local multiplayer<br/>- Play Online<br/><br/>The game is played between 2 to 4 players and you have the option of playing the game against the computer, against your friends, or even against people from around the world.<br/><br/>With plenty of features, Business Game brings you a really unique gaming experience.<br/><br/><br/>Business Dice Game Free,<br/>Business Dice Game 3D<br/>Business Dice Game VS android (computer)<br/>Business Dice Game 3D Multiplayer<br/>Business Dice Game Games<br/>Board game<br/>Dice game<br/><br/>The game and its variants are popular in many countries and under various names.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:30:58", "background_image": "https://media.rawg.io/media/screenshots/38c/38c25b55ff4b95dad5f5bd13cf6b4938.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Business Game Champs"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}