{"id": 356819, "slug": "coffee-addict", "name": "Coffee Addict", "name_original": "Coffee Addict", "description": "Swap, match &amp; brew your way through over 70 levels of frantic, frothy, &amp; caffeinated excitement in this addictive coffee-themed Match 3 game.  Match tiles to supply the antsy, on-edge, twitching Coffee Addict his next delicious coffee fix before his drip runs dry and he completely freaks out!<br/>Match coffee beans, bags of grounds, coffee cups, pots and presses (along with assorted breakfast items). Calm his nerves with an Espresso Power Up, reset the board with the Shuffle Power Up or redraw the rules with the Super Drag Power Up, get bonus points for finishing faster and see what happens when the Coffee Addict finally gets his fill!<br/>--------------------------------------------------<br/>Download now and get started in the frantic, matching, addictive excitement of Coffee Addict!<br/>Note: This paid version of Coffee Addict includes all 70+ levels for free! <br/>--------------------------------------------------<br/>Coffee Addict Features:<br/>★ Quick to learn, hard to master.<br/>★ Over 70 fully caffeinated levels.<br/>★ Over 40 different, themed, incredibly challenging board shapes.<br/>★ Match 8 different coffee-themed game pieces.<br/>★ Navigate around, avoid &amp; strategize around 4 special game pieces including BOMBS!<br/>★ Strategically utilize 3 different Power Ups (especially important in later levels).<br/>★ Listen to the hilariously frantic, twitching, talkative Coffee Addict!<br/>★ Watch him freak out if you lose!<br/>★ Post a Mugshot with your high score &amp; share it with Twitter or Facebook!<br/>★ Now with purchasable Power Up Packs for those really tricky levels.<br/>★ New Levels added regularly!<br/>--------------------------------------------------<br/>Thanks to all of our current players! It’s been hilarious watching new Mugshots as they get posted! It makes all the hard work put into Coffee Addict over the past few months so much worth it. Cheers &amp; thanks!<br/>--------------------------------------------------<br/>Already a Coffee Addict addict? Like us on Facebook or follow the Coffee Addict, himself, on Twitter:<br/>facebook.com/CoffeeAddictGame<br/>twitter.com/CoffeeAddictPV", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:23:00", "background_image": "https://media.rawg.io/media/screenshots/8be/8be39169b0e05158528289b1be7ade8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Playvue Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}