{"id": 356825, "slug": "magic-tiles-billie-eilish-piano", "name": "Magic Tiles - Billie Eilish Piano", "name_original": "Magic Tiles - Billie Eilish Piano", "description": "Welcome to the game that will be popular now, Magic Tiles Billie eilish piano tiles 2019 songs and be a pianist, <br/>if you like music, you will enjoy this tap piano application.<br/>The game is really simple and easy but challenging. <br/>There are many choices of lovely Game song, and of course we will always updated the newest songs list.<br/>High quality piano bellyache songs, and some popular top music that is liked today<br/>We created these melodies on our own with this machine piano tiles game you can play while train your finger speed in this application and concentration in touching the piano tiles.<br/>Tap on Black and blue tiles as quick as you can to go as far as you can.<br/>Keep those fingers quick and your mind lit!<br/><br/><br/>How to play :<br/>- Press the start bar to start play.<br/>- Avoid black blades carefully, otherwise you will experience surprises.<br/>- Get your highest score in this application.<br/><br/>FEATURE:<br/>- Free piano sounds download<br/>- No skill needed<br/>- New songs are added every week.<br/>- Amazing Graphic<br/><br/>Hope you enjoy with boys! don't forget to give rating for this game so that it becomes a well-known game.<br/><br/>Happy playing and thank you.<br/><br/><br/>Disclaimer.<br/><br/>This game is not an official app. There is no copyrighted material, everything we make is done by us including the piano music!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:26:01", "background_image": "https://media.rawg.io/media/screenshots/934/934bf41abc0e8f2ea15df4bfcf7fb371.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Tech Games Studio"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}