{"id": 356823, "slug": "gravity-rider-extreme-balance-space-bike-racing", "name": "Gravity Rider: Extreme Balance Space Bike Racing", "name_original": "Gravity Rider: Extreme Balance Space Bike Racing", "description": "Tackle moto racing trials, crush your racing rivals, finish in record time and play for free on the road to becoming a bike rider champion. Select a motocross bike for extreme motorcycle racing, a race car if you're in the mood for extreme car driving or even an ATV road bike.<br/><br/>Race to the finish at turbo fast speed, but watch out – moto jumps, zero gravity fields, asphalt elevators &amp; drift tracks will challenge you! Play to keep your space bike steady and don’t turn into a skiddy car in this exciting road bike balance skill game.<br/><br/>Leverage the power of the realistic motorcycle racing engine: free fall along blocks to build bridges, balance on extreme asphalt ramps and jump over flippy trials to defeat others’ ghost rider.<br/><br/>Compete in turbo fast trials against 3 of your ghost rider rivals. Play on the asphalt - dominate the leaderboards and drift your light bike to the extreme top of the space racing league.<br/><br/>➡️Follow our Facebook for updates:https://www.facebook.com/GravityRiderGame<br/>➡️Got a question? Contact us at support@vividgames.com<br/><br/>By downloading the game you accept our End User License Agreement, Terms of Service and Privacy Policy: http://support.vividgames.com/policies", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:25:04", "background_image": "https://media.rawg.io/media/screenshots/501/501a5b11d6825edfc672c017f3f783a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Vivid Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}