{"id": 356952, "slug": "highway-car-racing-game", "name": "Highway Car Racing Game", "name_original": "Highway Car Racing Game", "description": "Are you ready for the excitement and thrill of highway car driving where you can outrun cars and trucks in high speed.<br/><br/>Become the master of highway racing with 60 FPS game play and high hd graphics smooth control for mobile devices game.<br/><br/>Win in race and become the best racer of the city!<br/><br/>Highway Car Driving Features:<br/>- Stunning 3D graphics of highway through beaches, bridges and backwaters.<br/>- One way, two way and multiplayer mode.<br/>- Most efficient and realistic physics and handling<br/>- 12 beautiful cars to choose<br/>- Dynamic map generation for different scenery look every gameplay<br/>- Real feeling of driving and racing on highway roads<br/>- Customization through paint and wheels<br/>- Online leaderboard to boast your score<br/>- 60 fps cargame on almost all of the devices<br/>- Trending games 2019: cargames 2018<br/>- Features endless car games<br/>- No WiFi needed, can be played offline<br/>- Exciting car racing game for all ages, for girls and boys, men and women!<br/><br/>*HOW TO PLAY*<br/>- Tilt, Touch buttons or steering wheel to steer<br/>- Press gas button to accelerate and brake button to slow down<br/>- Use Nitro to boost your speed<br/><br/><br/>*HOW TO SCORE*<br/>- Driving longer distance to score more<br/>- Near Miss - The closer you pass the more score you get<br/>- High Speed - The more you drive at high speed the more score you get<br/>- Wrong Lane -The more you drive in opposite direction the more score you get in two way game<br/>- Traffic car racing games at its best<br/>- Traffic Raecing you will love<br/> <br/>We will be updating the games regularly. Please rate and give your comments for the games future improvements.<br/><br/>One of the most downloaded Car Games 2019, with 4.3 * Rating.<br/><br/>Let's enjoy your highway driving and have a thrilling moment!", "metacritic": null, "released": "2017-07-05", "tba": false, "updated": "2020-06-29T02:23:21", "background_image": "https://media.rawg.io/media/screenshots/bc5/bc50c42f1e323ecf8f7a23c7213336cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["GAMEADU"], "genres": ["Adventure", "Racing"], "publishers": ["GAMEADU"], "esrb_rating": null}