{"id": 356967, "slug": "mermaid-craft-ocean-princess-sea-adventure-games", "name": "Mermaid Craft: Ocean Princess. Sea Adventure Games", "name_original": "Mermaid Craft: Ocean Princess. Sea Adventure Games", "description": "Dive under waters of a deep blue sea for a blocky cube exploration adventure! Become a mermaid - a princess of the sea - and rule the underwater ocean world! Change clothes and visit a mermaid hair salon to look like a queen. Mermaid Craft is one of the best new mermaid dress up &amp; fashion games! <br/><br/>Beautiful underwater world awaits<br/>Deep blue ocean waters near the eden island archipelago hide many secrets… The biggest one is a mermaid city! Start your sea adventure and dive underwater as a mermaid princess! Take part in an exploration of this ocean empire and visit mysterious underwater mine ruins! You can even find a sunken pirate ship and maybe an old pirate treasure… But the exploration of a pirate ship might be really dangerous. Will you dare to embark on this sea quest in a fish kingdom of Mermaid Craft?<br/><br/>Crafting &amp; building underwater<br/>But a mermaid city is vast enough to give you countless hours of crafting &amp; building fun! In Mermaid Craft you can expand it even further. Mine resources and then craft, build and design a blocky cube underwater city. Crafting &amp; building on a coral reef - craft your own home! Use shells and seaweeds to design and decorate rooms like in a house builder game. Make a house party and invite your high school friends. Every mermaid princess loves it!<br/><br/>Meet friends or even… a boyfriend!<br/>As a mermaid princess you need a glamour look! Dress up and visit a mermaid hair salon. Meet with other mermaid friends or find a blocky pocket pet. Chat with many sea animals like a bass fish, salmon fish, whale, sea horse, sea turtle, shark, octopus or jellyfish. They love to spend time with their mermaid princess! It’s not some kind of ocean animal games, but still feels like a sea safari! During your sea adventure you meet a handsome triton prince as well… Have you ever seen a mermaid in love? Now you can, because in Mermaid Craft you can have a boyfriend and go on dates like in real dating simulator! Love on the sea!<br/><br/>CORE FEATURES:<br/>Become an ocean princess! Enjoy a deep blue sea adventure as a cute mermaid.<br/>Exploration of a huge sandbox world - not only underwater!<br/>Crafting &amp; building world of mermaid - an ocean empire!<br/>Change clothes and hair whenever you want!<br/>Not only for girls with tails!<br/><br/>UPCOMING FEATURES:<br/>Multi Craft - multiplayer mode! Start a sea adventure with best friends!<br/>More sea animals. Enjoy a sea safari!<br/>More items to craft. World of mermaids needs your crafting &amp; building skills! <br/><br/>It’s not one of the fishing games, so don’t get caught on a fishing hook. Befriend sea animals, explore an underwater paradise land and use your imagination in crafting &amp; building mode to recreate a mermaid city at the bottom of an ocean empire. Sea adventure awaits you - what are you waiting for? DOWNLOAD NOW and enjoy a life as a mermaid princess - only in Mermaid Craft! The best sea adventure game for girls of 2017!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:36:48", "background_image": "https://media.rawg.io/media/screenshots/a59/a59497bda36e82678fe030e694ccb5c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Fat Lion Games: Crafting & Building Adventure"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}