{"id": 356920, "slug": "craftium-exploration-survival", "name": "Craftium: Exploration & Survival", "name_original": "Craftium: Exploration & Survival", "description": "Multicraft presents: Craftium is a sandbox game in which you can survive, create objects, block craft, build unique buildings, exploration a vast pixel world and much more. Start your block craft and exploration right now!<br/><br/>Creation<br/>Craftium is a big, crafting and building and explore game in the sandbox genre where you can do absolutely anything you want. When creating the pixel world, you can block craft, change its size, the height of the landscape and mountains, the water level, the distance of drawing the textures, the richness of vegetation and the switching on and off of the cycle of day and night. The blocks game also has a flight mode to quickly navigate the map. Also, when activating a flight in exploration, you can go through the blocks and start your exploration game right now!<br/><br/>Exploration<br/>As in all building games of this genre like exploration - you have the complete freedom to choose your actions. You do not have to build or block craft something, you can just travel the world of cubes, and also exploration its boundless spaces. This will help you to the flight mode and the permeability of the blocks. Game exploration is perfect choice for those player who like explore and open something new in big, world of cubes.<br/><br/>Survival<br/>The world of Craftium is beautiful and friendly, but only until sunset. When night falls, the world of cubes is transformed and you face many dangers that lie in the dark caves and dense forest. Are you ready to survive in this cube world? There is only one way to check it out! Try to survival mode in exploration craft!<br/><br/>Building<br/>In our building game there is large selection of block craft for construction, with the help of which you can create your own, unique block city. In the our craft games you will find such building blocks as: stone, boards, brick, fence, door, chest, as well as many decorative blocks that will add color to your block game and the world. Express yourself on our block craft game!<br/><br/>Craft<br/>In Craftium there is an opportunity to create objects using crafting and building . You can interconnect resources to get unique blocks or items. With the help of block craft, you can make various types of picks, axes, swords, and armor to protect your character.<br/><br/>Animals<br/>In the our exploration the game you will find various representatives of the Craftium fauna, such as: horses, pigs, chickens, cows, bears, wolves, different species of birds and many, many others. But remember, not all animals are equally friendly, and which are not at all dangerous! You can tame some types of animals. You get experience for mobs, useful items can also fall from them.<br/><br/>Furniture<br/>One of the key features of the blocks game is the presence of a large selection of furniture for the home. The craft game features a variety of tables, chairs, sofas, cabinets, refrigerators, shelves, paintings, lamps, kitchen appliances and much more. With the help of furniture you can make rooms more comfortable and individual via big craft section. The number of accessories will constantly increase and we will delight you with all new and new types of furniture for exploration craft!<br/><br/>Multiplayer<br/>It is not always interesting to play alone, which is why there is the possibility of playing over the network in Craftium. Just create your cube world in any game mode - like a survival or exploration, throw an invitation to friends and enjoy the joint game. Survive and conquer the world Craftium!<br/><br/>Saving progress<br/>Also in the building game there is the ability to save the gameplay and it is absolutely free. Now you can not worry about the safety of the masterpieces you built - just click on the button to save the world.<br/><br/>Optimization<br/>Craftium is well optimized, which allows you to play it even with the help of low-performance devices. Also there is the possibility of changing the range of drawing textures.<br/><br/>Build your own, unique world with Craftium!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:13:38", "background_image": "https://media.rawg.io/media/screenshots/56e/56ed87ecb05364b974b33601fb4df2d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Master for Minecraft"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Teen"}