{"id": 356937, "slug": "initiative-tracker-for-dd", "name": "Initiative Tracker for D&D", "name_original": "Initiative Tracker for D&D", "description": "Track your games initiative in a friendly and clean environment! <br/>Although built around Dungeons &amp; Dragons 5th Edition, the majority of the features can work with every d20-system game.<br/><br/>Featuring:<br/>- Simple sheet for initiative needs<br/>- Advanced mode with HP, AC and Passive Perception<br/>- Quick edit with gestures<br/>- Personalization options with images, level / challenge rating , grouping, factions<br/>- Support for static initiative, mass rerolls and dynamic battles<br/>- Multiple factions encounters<br/>- Simple monster library for D&amp;D 5th Edition quick reference<br/>- Create saved groups and encounters from current battle or from scratch to track your campaign<br/>- Monster images: creatures in \"enemies\" faction will automatically search the net for appropriate images and display them in battle or in groups. (Requires internet connection and Lollipop+ device)<br/><br/>Getting the premium version will help further development of this app and you will also gain the following features:<br/>- Add monsters to the battle or to groups directly from the monster library<br/>- Add saved groups to the current battle <br/>- Backup and import your saved groups<br/>- Encounter Difficulty Calculator 5e: evaluate battle using heroes levels and monsters numbers / cr, showing encounter difficulty and xp (only for D&amp;D 5th Edition)<br/><br/><br/>This app will work with any d20-system game including: D&amp;D (any, but tailored for 5th Edition), Pathfinder, Call of Cthulhu, D20Modern, Lone Wolf, Conan, Spycraft, Star Wars<br/><br/><br/>If you want to get in touch about ideas, bugs, features or just comments, don't hesitate and e-mail me!<br/><br/><br/>----------------------------------- CURRENTLY IN-DEVELOPMENT -------------------------------- <br/><br/>I'm working for:<br/><br/>BugFixing<br/><br/>If you want to become an alpha tester, send me an email!<br/><br/><br/>---------------------------------------- FUTURE FEATURES LIST -----------------------------------------<br/><br/>The following features are just ideas:<br/><br/>Monsters library revamp:<br/>Add your Custom monsters to library<br/>Monsters complete sheet<br/><br/>Dice roller<br/><br/>Encounter/Treasure/Journey generator", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:21:28", "background_image": "https://media.rawg.io/media/screenshots/fd9/fd904d807d709958f870cfdbfc66fd26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Manolo D'antonio"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}