{"id": 357098, "slug": "pool-ace-8-ball-and-9-ball-game", "name": "Pool Ace - 8 Ball and 9 Ball Game", "name_original": "Pool Ace - 8 Ball and 9 Ball Game", "description": "Pool Ace  is born for true billiard enthusiasts. Its first class physics simulation brings the thrilling excitement of pool halls into life. If you love playing pool, play Pool Ace! It's designed to keep you taking shot after shot! Don't miss it out and you'll definitely love it! Download now to play free! <br/><br/>●Game Features:  <br/>[Free to play! Free chips every day] <br/>- Free to play! Login every day for free chips, treasure chests and other rewards including cues! <br/><br/>[Ultra Realistic! Best physics simulation in the world!] <br/>- The latest physics engine delivers the world's best physics simulation and the most authentic 8 ball shots! <br/><br/>[Tense and Exciting! Real-time multiplayer battles!] <br/>- Set your battle at the most famous sites around the world! Make the breaks and enjoy the thrill of making a run against the best of the best ! <br/><br/>[Are you ready to be called a Master's Challenge?] <br/>- The Master's Challenge comprises many special trick shots that mimics the real world escaping experience.<br/><br/>[Endless Fun! Relaxing challenge mode for the whole family] <br/>- Special trick shot challenge in various stages. Play without stress and claim your rewards stage by stage! <br/><br/>[Variety galore! Personalized items up to your style] <br/>- Over 10,000 specially designed cues, tables and emoticons for you to a nicely set-up. Build your own pool club! <br/><br/>[Fight for national prestige! Global multiplayer rankings every week] <br/>- A variety of global multiplayer rankings renews every week. Join now and save the next top shot for you and your homeland!<br/><br/>[Connect to your social network! Play with family and friends] <br/>- Support for logging in with various social network accounts. Log in with your favorite network and hang out with all your friends! <br/><br/>●Share your feedback at the Pool Ace  fan page! <br/>- https://www.facebook.com/PoolAceII <br/><br/>●This game is intended for players aged 3 and over. There is no gambling or games of chance involved that offer physical rewards or real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:41:04", "background_image": "https://media.rawg.io/media/screenshots/47a/47a1f6c641a917b4c8eb8e10be2f4ef8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["International Games System Co"], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone"}