{"id": 357096, "slug": "moe-ninja-girls-sexy-happenings-at-ninja-school", "name": "Moe! Ninja Girls / Sexy Happenings at Ninja School", "name_original": "Moe! Ninja Girls / Sexy Happenings at Ninja School", "description": "You're a genius ninja that hides your true identity and transfers to Mizaki School.<br/>Surrounded by schoolgirls, you finally get the peaceful everyday school life that you've always longed for. Through a twist of fate, you end up in a \"Ninja Seeking Club\" at school to find ninjas! As you spend your days busy with girls and club activities, you start to discover the true identities of your fellow club members... Can you unmask your favorite girl's identity? And what's the big secret behind Mizaki School? <br/><br/>YOUR CUTE GIRLFRIENDS:<br/>Akari Hanao – “We're in the same class...and our seats are so close...it's gotta be fate, right?!”<br/>A classmate of yours. She always thinks positively, though sometimes she is too starry-eyed. Active, athletic, and relatively smart, she livens up the party, while also sometimes getting herself and the people around her in trouble. She admires ninjas and comes up with the idea to form a \"Ninja Seeking Club\".<br/><br/>Enju Saion-ji – “Oh well...if you're having trouble, I suppose I can tell you whatever you need to know.”<br/>A classmate of yours. Smart, agile, and a member of the student council. Can seem strict at times, but is actually caring by nature, so she takes care of Akari despite often being dragged into trouble by her. Does not show people how she lives her private life. Rumor has it that she comes from a wealthy family.<br/><br/>Ricka Machiyuki – “No problem. Don't think about who is behind you. Just take your lessons.”<br/>A classmate of yours, who transferred right after you. Always stays quiet and poker-faced, with a mysterious air. From time to time she says things that sound unsettling, but her classmates hope that she is only joking. Likes video games. Loves fried noodle hotdogs.<br/><br/>FEATURES:<br/>* FREE to play!<br/>* Beautiful artwork, alluring soundtracks and motion effects<br/>* Multiple endings depending on the choices you make<br/>* Cute costumes in a Japanese anime style with constant updates<br/>* In-game events with exclusive prizes frequently held<br/><br/>HIGHLY RECOMMENDED IF YOU:<br/>- Love romance novels and movies<br/>- Love Japanese games, manga, novels and anime<br/>- Are interested in dating sim games but want something simpler<br/>- Want to enjoy being in love with a variety of women<br/>- Want to have a love affair without anyone knowing<br/>- Are crazy about Ninjas<br/>- Love free romance games / dating games <br/>- Love fashion and dressing up your partner<br/>- Enjoy reading stories with a grand setting<br/><br/>FOLLOW US:<br/>NTT Solmare is a Japanese company that strives to make the best free visual novel type games / dating games and fantasy games for adults.<br/>https://www.facebook.com/moeninjagirls", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:39:57", "background_image": "https://media.rawg.io/media/screenshots/e39/e39332fa812399cbde171cfd9b39dbf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["NTT Solmare"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Teen"}