{"id": 357082, "slug": "tap-adventure-hero-idle-rpg-clicker-fun-fantasy", "name": "Tap Adventure Hero: Idle RPG Clicker, Fun Fantasy", "name_original": "Tap Adventure Hero: Idle RPG Clicker, Fun Fantasy", "description": "Play TAP ADVENTURE HERO and enjoy one of the most addictive fantasy RPG role playing idle clicker game with thousands of levels and tons of unique monsters and dragons!<br/><br/>Key Features:<br/>🎮FUN IDLE CLICKER GAMEPLAY!<br/>🔥 ENJOY ENDLESS ACTION WITH!<br/>⚔FIGHT AGAINST MONSTERS, DRAGONS, WIZARDS, AND MORE!<br/>☠️ HIRE IMMORTAL HEROES AND BUILD YOUR EPIC ARMY!<br/>🔮COLLECT NEW ARTIFACTS AND GET EXTRA BONUSES!<br/>🖐TAP, TAP AND UNLOCK SPECIAL FEATURES!<br/>🗡LEVEL UP YOUR HEROES AND CREATE FANTASY LEGENDS!<br/>👹UNLOCK SPECIAL SKILLS DEFEATING YOUR MAGIC ENEMIES!<br/><br/>Take your sword,  these magical creatures are going to dominate our magic world! If you really like fun RPG games, this Tap Adventure Hero auto clicker game is the best option for you. It's about time to take part in a clash of the lords in an epic fight to the death!<br/><br/>ENDLESS GAMEPLAY<br/>Move on and take on the magic frontier! Fight with mighty immortals, defeat all dead enemies, and join other players nonstop forming clans!  Knight, discover a new level of offline and online multiplayer battles!<br/><br/>RPG IDLE CLICKER GAME<br/>Prove your fight skills as a monster hunter! Build or craft new artifacts, collect the crew of legendary heroes and lead them through magical fantasy RPG battles! Every magic artifact you buy will give you extra bonuses!<br/><br/>DOZENS OF UNIQUE HEROES<br/>Level up your main idle hero and conquer the kingdom! Boost your weapons, use special magic spells, craft new artifacts, and collect fantasy equipment. Take and sharpen your swords! Wear your armor, because the war against the dragons begins! Brawl out!<br/><br/>LEGENDARY MONSTERS<br/>Kill monsters for cash and coins, find treasures, and explore new worlds. Play the game full of epic adventures, brawls, and legendary battles. Tap the screen and collect the coins and rewards from each enemy like a dragon, Titan, monster, ghost and more! Loot every dungeon for chests full of coins! <br/><br/>Blow 'em up, punch 'em out and win the fight!<br/><br/>Discover our other games: http://t-bull.com/#games<br/>Like us on Facebook: https://facebook.com/tbullgames<br/>Follow us on Twitter: https://twitter.com/tbullgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:33:12", "background_image": "https://media.rawg.io/media/screenshots/669/669c3b8ba2cb853f7a1ae4b499fb44b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["T-Bull"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone"}