{"id": 357171, "slug": "amazon-alien", "name": "Amazon Alien", "name_original": "Amazon Alien", "description": "<p>Pippin Games is an independent game studio, focused on creating casual / midcore games with fun themes. The studio is based in Natal, Brazil.</p>\n<p>Team members actively participate in the Indie game developers' group, the PONG (Potiguar Indie Games), which, inspired by other groups of game developers, meet up monthly to promote the interaction of professionals already inserted in the market of game production with those who intend to enter this market.</p>\n<p>Please follow Pippin Games at Facebook, Twitter and Instagram. Follow our job. Your feedback is really important to us!!!</p>\n\n<p><strong>PT-BR</strong><br/></p>\n<p>Em Amazon Aliens, as raças alienígenas de amazonas de diversos lugares do universo irão competir em uma corrida mortal para caçar um humano! Para isso, elas vão utilizar suas habilidades singulares para deter suas oponentes em ambiente inóspitos cheios de obstáculos!</p>\n<p>Escolha uma <em>amazon alien</em> e destrua suas adversárias para conquistar o grande troféu!</p>\n\n<p><strong>Características:</strong></p>\n<ul><li> Multiplayer para 4 jogadores - Jogue com o seus amigos! </li><li>Amazonas com habilidades únicas - Utilize-as para parar seus inimigos!</li><li> Competitividade frenética - Partidas rápidas e altamente dinâmicas! </li><li>Fases com diferentes obstáculos e armadilhas - Percorra vários planetas e driple  obstáculos diversos!</li><li>Cutscenes de captura diferenciadas - Cada raça possui uma cena de captura exclusiva! O que será que elas irão fazer com o humano?</li></ul>\n\n<p><strong>Sobre a Pippin Games</strong></p>\n\n<p>A Pippin Games é uma desenvolvedora independente de jogos digitais, focada na criação de jogos casuais / midcore com temas divertidos. O estúdio é sediado em Natal, Brasil.</p>\n<p>Os membros da equipe participam ativamente do grupo de desenvolvedores Indie, o PONG (Potiguar Indie Games), que, inspirados por outros grupos de desenvolvedores de jogos, se reúnem mensalmente para promover a interação de profissionais já inseridos no mercado de produção de jogos com aqueles que pretendem entrar nesse mercado.</p>\n<p>Visite a página da Pippin Games no Facebook, Twitter e Instagram. Acompanhe nosso trabalho, o seu feedback é muito importante!</p>", "metacritic": null, "released": "2019-07-29", "tba": false, "updated": "2019-07-31T08:19:04", "background_image": "https://media.rawg.io/media/screenshots/086/08601d26415a3f27cd3626de91020d1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pippin Games"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}