{"id": 357145, "slug": "voyage-4", "name": "Voyage 4", "name_original": "Voyage 4", "description": "Travel on Russian roads with 12 Russian cars + 4 German cars, get to the ferry in the Crimea <br/>Start your trip in Russia from Magadan to the Crimea.<br/>- Hometown and signs based on real-world tracks: P504 \"Kolyma\" M7 \"Volga\" M5 \"Ural\" M51 \"Baikal\". Some historic memorials.<br/>- Realistic physics and accurate specifications of all cars (including the torque graphs and the gear ratios). Working devices in each machine + 100% realistic lighting. Mirrors. Lights. Thoroughly researched the driver's hands. Only in this game driver controls steering wheel and instruments so realistic!<br/>- More than 30 tuning parts for each machine (on foreign cars less) based on real-life parts. Now, not only the engine but also the wheels, xenon and other functional!<br/>- Detailed cars sounds, and now the game has an visual tuning!<br/>- 6 popular Russian car + 2 german cars. Later new cars will be added!<br/>- Now the game has road turns, fork and hills.<br/>- In comparison with Russian Driver 2: Baikal schedule has been greatly improved.<br/>- Russian traffic area number of regions.<br/>- Dynamic time, clouds, day and night, different weather (including rain).<br/>- A lot of settings and a special console for precise optimization.<br/> Compete with other players! <br/>Show the best result of acceleration 0-100 kmh on the test range and compare it with other users online. Hit the top players with your tuned car!<br/> Our group in VK which publishes updates on the game: <br/>https://vk.com/voyage4<br/> Answers to frequently asked questions <br/> Why play permissions to phone calls? <br/>The game is permitted read-only information about the device. Permits reading of contacts, sending SMS, direct calls to the game does not used. Game use device ID to protect information from cheating. <br/>No other action is taken. But it is recommended not to download the game from other places besides PlayStore or trusted sites.<br/> I can not start from the parking lot / I bet on the invisible walls <br/>This problem may be devices with 512 MB of RAM if a shortage of storage VBO data. Especially in combination with the single-core Mali-400 or PowerVR SGX531.<br/> Textures of road/foewst are blurred <br/>GPU your driver is likely not support the resolution on the anisotropic filtering. the problem happens on devices with Mali-400, even today often. Depending on the firmware.<br/> Can I play without internet or Google Play service? <br/>Yes, you can play without a network. But you can not save you result and see other players results in google play.<br/> The game has access to my Google Account? <br/>No, the game only sends a link to your account on Google. Access to an account can not be granted.<br/> The game can not be downloaded / installed<br/>If not downloaded the possible way is close PlayStore application and cleaning of its data help.<br/>Maybe device need more free memory.<br/> sometimes lost connection with Google Play <br/>You have to wait or restart the game.<br/> Do I have to get off until the end of the polygon to show results? <br/>No, it is enough to speed to 100 km/h, and the result will be automatically saved. To go further is not necessary.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T08:07:33", "background_image": "https://media.rawg.io/media/screenshots/b0b/b0b0bc3e4e9787c9515eb16cb20f11a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android"], "developers": ["existage"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}