{"id": 357258, "slug": "line-patters", "name": "Line (patters)", "name_original": "Line (patters)", "description": "<p><strong>A game about a line, written in a single line of BASIC code</strong></p>\n<p>Using only the space bar, guide the line to the gate on the other side of the screen avoiding collisions. You could imagine it's a sledge travelling downhill avoiding trees, viewed from above - if that helps.</p>\n\n<p>Each level has more obstacles than the last, and at level 10 the gate gets narrower. If you beat level 20 and see a STOP statement then you have completed the game!<br/></p>\n<p>This work is free to download, but it remains protected by copyright, and I offer no licence to the user.</p>\n\n<p><strong>Credits:</strong><br/></p>\n<p>I initially wrote a version of this game in about 1996, when I was digitising my old program cassettes. It started as an experiment to use ATTR collision detection for PLOTed coordinates, something which I had struggled to get working reliably in my childhood programs. My aim at the time had been to make a fun game with as small a listing as I could...</p>\n<p>Back to the present day I was staggered to discover the incredible technical showcase that is Digital Prawn's One Liner Page. A seed was planted. I <em>had</em> to write a one liner game, just for the sheer challenge.</p>\n<p>Owing to the clumsiness of editing large program lines directly on a Spectrum, I used BasinC to adapt my existing program, optimising the listing into a single line occupying a single screen of text during one very late night in July 2019.</p>\n<p>The game I have made is in fact an approximate remake of a game (also called Line) that I remember from school, which ran on a black Research Machines Link 480Z, a computer so obscure that I could find no record of it at all until recently.</p>", "metacritic": null, "released": "2019-07-28", "tba": false, "updated": "2019-07-31T08:39:13", "background_image": "https://media.rawg.io/media/screenshots/047/0476d180a7b8518daa7afb692afcb2a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["patters"], "genres": ["Action"], "publishers": [], "esrb_rating": null}