{"id": 3574, "slug": "sherlock-holmes", "name": "Sherlock Holmes: Crimes and Punishments", "name_original": "Sherlock Holmes: Crimes and Punishments", "description": "<p>Sherlock Holmes: Crimes and Punishments is an adventure whodunnit by Frogware. The studio specializes on Sherlock Holmes games. &#39;Crimes and Punishments&#39; is six out of seven games in the series.</p>\n<h3>Gameplay</h3>\n<p>The player takes a role of Sherlock Holmes — famous detective. The game consists of 6 non-related cases.<br />\nThe first accentuation in levels is made in investigating the crime scene and searching for clues. After the examinations section comes the deduction one — the player must interconnect the evidence and find out who the culprit is. The burden of punishment is also on the playing one, thus the game title. </p>\n<h3>Story</h3>\n<p>Three out of the six cases — The Fate of Black Peter, The Riddle on the Rails and The Abbey Grange Affair are reminiscent of the original Conan Doyle stories. Thus, the narrative flow and plot twists are adapted from the original whodunnit as well. </p>\n<h3>Features</h3>\n<p>One of the key features of the game is the possibility to guess the culprit wrong ergo making the false accusation. This, in turn, would affect the outcome of further cases. However, with the cases not being firmly tied down together, the impact of player&#39;s mistakes is insignificant. The loading screen as it appears rarely provides one with not only the loading bar but also the evidence to inspect and clues to examine thus using the loading time fully.</p>", "metacritic": 77, "released": "2014-09-30", "tba": false, "updated": "2024-04-07T00:41:57", "background_image": "https://media.rawg.io/media/games/9b8/9b86078de72fce4c535153e805b8c01d.jpg", "website": "http://www.sherlockholmes-thegame.com/", "rating": 3.94, "rating_top": 4, "added_by_status": {"yet": 196, "owned": 1389, "beaten": 325, "toplay": 89, "dropped": 83, "playing": 14}, "playtime": 8, "achievements_count": 305, "ratings_count": 363, "suggestions_count": 653, "game_series_count": 7, "reviews_count": 366, "platforms": ["Xbox One", "Nintendo Switch", "PC", "Xbox 360", "PlayStation 3", "PlayStation 4"], "developers": ["Frogwares"], "genres": ["Adventure"], "publishers": ["Focus Home Interactive", "Frogwares"], "esrb_rating": null}