{"id": 357561, "slug": "up-to-space-beyond-the-space-frontier", "name": "Up To Space! Beyond The Space Frontier!", "name_original": "Up To Space! Beyond The Space Frontier!", "description": "<p>Pilot your rocket, avoid obstacles and explore the universe to space frontier!  Expand your hangar, discover new planets and improve their levels.</p>\n<p>Pay attention!<br/>An endless universe full of obstacles and enemy ships awaits you. Only the best one can do all the challenges and get to the top of the leaderboard!</p>\n<p>Collect gold stars during the game, which will make your game easier!</p>\n<p>Find new planets during the game and create a collection from your travels! As a bonus, you can develop the level of each planet found and gain valuable experience. There are up to 9 unique planets in the collection!</p>\n<p>In Up To Space! Beyond The Space Frontier  you can looking forward to:<br/>★ Infinite Universe<br/>★ Many obstacles<br/>★ Simple one finger control<br/>★ Extensive range of spaceships<br/>★ Discover new planets and colonize them<br/>★ Developing their levels<br/>★ PowerUp Booster Research<br/>★ Materializer - Provides a supply of rare ores (Aurus and Antimon) and a component to build unique ships<br/>★ Your abilities are tested by challenge system<br/>★ Global results charts<br/>★ Level system<br/>★ Experience: - For each game based on score points<br/>                          - As a reward for the activity of the planets<br/>★ Rank based on level<br/>★ The game is accompanied by a soothing soundtrack<br/>★ Sophisticated sound system<br/>★ No annoying ads! ★</p>\n<p>What waiting for you in the lab?<br/>★ XP Multiplier - multiplies your XP gain points by level of enhancement<br/>★ Coin Multiplier - multiplies your gold star gain by level of improvement<br/>★ homing missile - homing missiles will destroy all enemy ships with one click!<br/>★ Warp start - moves your ship to a random start position!<br/>★ Artificial Intelligence (AI) - Artificial Intelligence Systems can fix your ship in the game!</p>\n<p>What is a Materializer?<br/>It is an anomaly in space-time. At each energy pulse it materializes the following rewards:<br/>★ 5x; 10x; 15x gold star<br/>★ 1x Antimony<br/>★ 1x Aurus<br/>★ 1x Artificial Intelligence<br/>★ 1x Homing missile<br/>★ 1x Warp Start<br/>★ Some part of the ship<br/>★ JACKPOT - 1000x gold star; 15x Antimon; 20x Aurus;</p>\n<p>You can compare your results globally with other players. You can also share them with your friends using the SHARE button in the menu.</p>\n<p>Up into the cockpit pilot! Play Up To Space! Beyond The Space Frontier Today!</p>\n<p>Ships: https://www.freepik.com/free-vector/rocket-icons-set_2874322.htm</p>", "metacritic": null, "released": "2019-07-27", "tba": false, "updated": "2019-07-31T09:59:47", "background_image": "https://media.rawg.io/media/screenshots/c90/c903f5b84968ef56219430e934660a9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomicio"], "genres": [], "publishers": [], "esrb_rating": null}