{"id": 357731, "slug": "space-between-us", "name": "Space Between Us", "name_original": "Space Between Us", "description": "<p><strong>How was your jamming experience? Were you able to produce more or less than you expected?</strong>  This being my main project I sank a lot of time into it might have been easier if I used some game packages to help me set up certain parts but I wanted to see how far I could push my self into making my own systems<br/></p>\n<p><strong>How did you apply the theme to your entry?</strong> Well I  guess first off I have a space shooter game in the arcade so there is space. And then we have space between people aka their friendships and trusts. <br/></p><p>revert the downloads back to the oiginal game jam files the ones I uploaded had even more breaks in the game it self once I figure out how to make later version I will upload better versions of the game there<br/><br/><br/></p>\n<p>You are on your last 20 days of High school. Can you get the highest score in the arcade game? Can you raise your stats enough to pass your exams or be able to talk to everyone from your class. Find out now pick the person you want to be friend and interact with them, <br/></p>\n\n<p>Controls:</p>\n<p>Main Game</p>\n<p>interacting<br/></p>\n<p>keyboard Q    xbox X<br/></p>\n<p>movement</p>\n<p>Keyboard:  wasd or arrow keys , X box - left stick</p>\n\n\n<p>Arcade Game</p>\n<p>switching to back or forward shot<br/></p>\n<p>keyboard Q    xbox X<br/></p>\n<p>fire weapon</p>\n<p>keyboard spacebar  Xbox A</p>\n<p>movement</p>\n<p>Keyboard:  wasd or arrow keys , X box - left stick</p>\n\n<p>Find the spots on the map that let you raise your stats. By simple studying, streaming, or even singing you can raise them bit by bit. Or just keep going to the arcade and play some good old space shooter. The choice is yours and yours along. To end a day quickly just go home and your day will end.<br/></p>\n\n<p>Sadly this version of the game was not 100% completed. Ran into some major delays on making the dialogue system took me a lot longer to get done then I thought it would</p>\n<p>Current characters that show up in the game. level done to for affinity in brackets<br/></p>\n<p>Shane(1)0, Sarah (2), John(2),Phil(1)<br/><br/></p>", "metacritic": null, "released": "2019-07-26", "tba": false, "updated": "2019-08-28T23:15:04", "background_image": "https://media.rawg.io/media/screenshots/f75/f75b432a1432ed7b36d1968a74fcbca5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Drewmanfu"], "genres": [], "publishers": [], "esrb_rating": null}