{"id": 357890, "slug": "dry-drowning-demo", "name": "Dry Drowning Demo", "name_original": "Dry Drowning Demo", "description": "Dry Drowning is an investigative thriller-oriented visual novel set in the futuristic dystopian universe of Nova Polemos.\n<br/>\n<br/>\nA shady socio-political situation dragging everything down to the abyss, a serial killer drawing strength from this darkness, a tormented detective and his assistant craving for redemption. \n<br/>\n<br/>\nDry Drowning challenges the player to find the truth, going through ambiguous characters, riddles, clues and unexpected events, while telling an extremely compelling and mature story.\n<br/>\n<br/>\n  Game Features:\n<ul><li>Choices really matter:   Players choices can lead to an always different story, with more than 150 story branches and 3 completely different endings\n<br/>\n</li><li>Heavy moral choices:   Dramatically change the way you live the game, affecting background politics, technology, environment, NPC encounters, who lives and who dies\n<br/>\n</li><li>High replayability: More than 20 hours gameplay to see everything about\n<br/>\n</li><li>Time travel:   Explore the detective's flashbacks and investigate cases from the past to help you solve new ones\n<br/>\n</li><li>Psychological interrogations:   Break the masks and uncover the truth with the Living Nightmares system\n<br/>\n</li><li>Live soundtrack:  Original and dynamic soundtrack with more than 50 audio tracks and 2 hours of music</li></ul><br/>\n\nGet ready to dive into darkness...", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T02:35:38", "background_image": "https://media.rawg.io/media/screenshots/122/122c2e9afc0c3ddd85ad7d6c41de6965.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 66}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Studio V"], "genres": [], "publishers": ["VLG Publishing"], "esrb_rating": null}