{"id": 357900, "slug": "chu-be-rong-online", "name": "Chú Bé Rồng Online", "name_original": "Chú Bé Rồng Online", "description": "Ngọc Rồng Online – game nhập vai trực tuyến với cốt truyện và nhân vật dựa trên bộ truyện tranh nổi tiếng Nhật Bản Dragon Ball đã từng làm say lòng bao nhiêu thế hệ độc giả Việt Nam. Bạn sẽ chọn theo hành tinh nào, Trái Đất, Na mếc hay Xay da? Cuộc hành trình tìm kiếm ngọc rồng và chống kẻ hung ác sẽ bắt đầu nằm trong tay bạn. Bạn đam mê sức mạnh, có chí hướng trừ gian diệt ác bảo vệ hành tinh của mình cũng như những người mình yêu thương trước các thế lực gian ác. Tộc chiến binh Xayda với sức mạnh kinh hoàng, người Trái Đất thể lực mạnh mẽ, ngườc Na mếc với khả năng hồi phục đánh kinh ngạc, đâu sẽ là nơi thích hợp nhất cho bạn? Cùng với sự hướng dẫn của các bậc tiền bối và sự nỗ lực của bản thân, bạn có thể đạt đến sức mạnh kinh hoàng, trở thành những chiến binh siêu hạng. Ngoài ra bạn sẽ không phải chiến đấu đơn độc khi xung quanh bạn là những chiến binh cùng chí hướng, cùng hỗ trợ lẫn nhau đối đầu với các thế lực hắc ám. Cuộc hành trình tìm kiếm rồng thiêng và trở thành chiến binh huyền thoại là vô tận. Hãy cùng xem những gì sẽ chờ đó bạn nào?", "metacritic": null, "released": "2014-03-22", "tba": false, "updated": "2019-08-02T02:40:45", "background_image": "https://media.rawg.io/media/screenshots/8ea/8eaf636dee00cf1604b3f39a0abbb25a_F4rvGDK.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khoi Huynh"], "genres": ["Action", "Adventure"], "publishers": ["Khoi Huynh"], "esrb_rating": "Everyone 10+"}