{"id": 357961, "slug": "car-racing-speed-driving", "name": "Car Racing - Speed Driving", "name_original": "Car Racing - Speed Driving", "description": "Car Racing - Speed Driving is the ultimate car racing game with the most realistic driving physics. Different customizations and a huge open world to explore makes Car Racing - Speed Driving an addictive game that will keep you highly entertained!<br/><br/>Pick your favourite from a wide range of fast and furious cars to drive from. From racing cars to off road SUVs, all kinds of vehicles have their own realistic physics combined with fun!<br/>In Car Racing - Speed Driving, you can customise each car to your liking! \u2028You can change the colour of the car, add decals to make it look edgy, add a colour tint to the glass and even adjust the suspension.<br/><br/>Play different game modes or just roam around free in the city.<br/>Stunts - \u2028Perform dangerous stunts on high ramps!\u2028Take high jumps, exceed all speed limits and be rewarded for being the stunts man you always wanted to be!<br/>Checkpoints - <br/>Drive your car at high speeds to go through all checkpoints. The faster you drive the better!<br/><br/>Show your extreme car driving skills in the large open world city with an extremely detailed environment and stunning HD graphics.<br/><br/>FEATURES of Car Racing – Speed Driving: <br/>Many super cars to choose from<br/>Customise each car<br/>Large open world city environment<br/>Different game modes - Stunts and Checkpoints<br/>Challenging levels<br/>Realistic car physics combined with fun<br/>Stunning HD Graphics <br/>Realistic sounds<br/>Free game<br/><br/>Get the best driving game - Car Racing - Speed Driving now!", "metacritic": null, "released": "2019-06-14", "tba": false, "updated": "2019-08-02T03:09:03", "background_image": "https://media.rawg.io/media/screenshots/199/199a0e7270c7ec07c9d34a2d934e70f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appsoleut Coders LLP"], "genres": ["Simulation", "Racing"], "publishers": ["Appsoleut Coders LLP"], "esrb_rating": "Everyone 10+"}