{"id": 358030, "slug": "dungeon-raid-lite", "name": "Dungeon Raid Lite", "name_original": "Dungeon Raid Lite", "description": "Play the awesomely addictive Puzzle/RPG Dungeon Raid for FREE!<br/><br/><br/>\"Dungeon Raid is an effortless recommendation... download this game now.\"<br/>- TouchArcade<br/><br/>\"Pick this one up. For its price, they definitely made me feel like it was well worth the money in so many ways\"<br/>- appSafari<br/><br/>\"If you’re looking for a different type of match 3 game or you’re an RPG nut that wants to get a quick fix every now and again, Dungeon Raid is just the game for you\"<br/>- TouchMyApps<br/><br/>\"Dungeon Raid manages to capture the essence of both rogue like dungeon crawling, and addictive match 3 in a easily accessible formula\"<br/>- TouchGen<br/><br/>\"It’s a fun mix of match-three puzzling and role-playing\"<br/>- Pocket Gamer<br/><br/><br/>Dungeon Raid is a puzzle RPG, a blend of puzzle game with roleplaying mechanics. Your mission is to trace a path through a set of matching tiles, but watch out – you may be attacked by enemies who improve as fast as you do.<br/><br/>As you go, the object is to collect as many resources as you can, like gold and experience. Get enough points and you can buy or upgrade equipment and level up. All the while, remember to avoid those nasty enemy skull tiles and fight them off for as long as you possibly can. And don't get too greedy, or you risk being overwhelmed!<br/><br/>The higher you go in a Dungeon Raid game, the more strategy you’re going to need to match a greater number of tiles, grab bonuses and stay ahead of those evil adversaries. Never forget that they improve as the game continues.<br/><br/>Keep your wits about you as you play Dungeon Raid. As you level up, there are many trade offs to consider and complimentary combinations of skills to be chosen. If you’re not used to the tense pace of the higher levels, go ahead and start on easy difficulty. That gives you the chance to play the game in a more relaxed way, and watch how powerful your avatar can become.<br/><br/>Regardless of your skill level, you’ll never get bored with Dungeon Raid because there’s so much going on! There are hundreds of items to collect, a growing list of character skills and many different strategies for you to use. You’ll be itching to play just one more turn, just one more game for hours and days on end.<br/><br/>Features:<br/>★ 4 difficulty levels: select a relaxing easy game or go for a challenging and strategic experience<br/>★ 400+ unique items to buy and upgrade<br/>★ 30 diverse abilities to help you and hinder your enemies<br/>★ 30 special monsters to defeat<br/>★ 20 powerful upgrades to apply to your items<br/>★ Level up and improve your avatar as you kill enemies and collect experience points<br/>★ Global leaderboards using Game Center &amp; OpenFeint<br/>★ Play your own music during the game<br/>★ Constant save system: quit the game and return to it at any time<br/><br/>If you want the thrill of playing a truly exciting game, you’ve come to the perfect place. Download Dungeon Raid now and prepare to be impressed!<br/><br/>See this exciting game in action here: http://www.youtube.com/watch?v=eumnCTG0AE8", "metacritic": null, "released": "2011-03-31", "tba": false, "updated": "2019-08-02T04:07:47", "background_image": "https://media.rawg.io/media/screenshots/567/567a96696165c35629885ce7fd035bc8.jpg", "website": "http://dungeonraid.atspace.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fireflame Games"], "genres": ["RPG", "Puzzle"], "publishers": ["Alex Kuptsov"], "esrb_rating": "Everyone 10+"}