{"id": 358035, "slug": "christmas-games-care-play", "name": "Christmas Games Care & Play", "name_original": "Christmas Games Care & Play", "description": "The New Year has arrived! Visit Santa Claus with his friends at the North Pole. Bake Candy and Cookie! Evolve snow farm to X-mas city and magic township.<br/><br/>It's important and funny time for kids is to decorate the Christmas tree, sledge and much more pen color and ornaments. You can also take photo for your work after decorating that. That must be the best time! Wow, snowing outside, have you seen it? Let's go to play with snowman and have a snowball fight. <br/><br/>The game includes<br/>- Swipe and Make Puzzle<br/>- Jigsaw Puzzle<br/>- Coloring Book<br/>- Mini Game For Each Character <br/><br/>Characters Of Game<br/>- Santa Claus <br/>- Santa Claus coming to your home with many gifts ..take it from him and lets have a dance with Santa Claus.<br/>- Elf<br/>- Naughty elves plying hide and seek with you can you catch them in fixed time?<br/>- Snowman<br/>- Snowman is ready for the christmas eve will you help him to dressed up ?<br/>- Reindeer<br/>- Little reindeer is in rush for santa ride but it is too dirty will you help it to take a proper bath?<br/>- Sleigh<br/>- Lets decorate sleigh for santa’s royal ride to make kids happy<br/>- Stocking<br/>- Have fun with catching game of socks<br/>- CandyCane<br/>- colorful candies to catch in colorful sledge. you have to catch candy in matching colored sleigh.<br/>- X’mas Tree<br/>- Here is awesome tree with awesome ornaments like bulbs, colored lights, snowflakes, stars, balls and many more items to make it charming.<br/>- Penguin<br/>- Penguin needs your help in to take proper bath and dress him up.<br/>- GingerBread House<br/>- Lets make gingerbread house by your choice of flavors and toppings to make 100s of combinations<br/><br/>Here we are coming with this combo game which include all christmas activities and lovely characters.", "metacritic": null, "released": "2018-12-19", "tba": false, "updated": "2019-08-02T04:11:19", "background_image": "https://media.rawg.io/media/screenshots/12c/12c76be7329feed99728a96ca14ad129_n5Ew7cI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Madhuri Bhalodiya"], "genres": ["RPG", "Casual"], "publishers": ["Madhuri Bhalodiya"], "esrb_rating": "Everyone 10+"}