{"id": 358022, "slug": "dino-mini-games-to-play", "name": "Dino mini games to play", "name_original": "Dino mini games to play", "description": "Dinosaur game is the best game of dinos. Six options to choose the one you want most at any time.<br/><br/>This learning game is ideal for primary and preschool childs. “Games of dinosaurs” is the best game for boys and girls of all ages, from Kindergarten, preschool to primary or elementary school. It is perfect to entertain for hours.<br/>We offer you a menu with six  options. They can choose the option they like the most. We’re specialists in apps for the imagination development, apps created by parents and education specialists. You’re going to find a lot of options in the game: learning or educational games, memory games, logic games, interactive and entertainment games, observations games. This game is perfect to develop the kids’ motor skills, their concentration and to help them know the different colors’ combinations and to rise their creativity.<br/>It’s very simple; choose amongst the different options on the menu:<br/>Puzzle of dinos: Children have to solve the different animals’ puzzles. A memory game to develop the logic thinking, the visual perception and the psychomotor skills. Magic paint: Try to paint with accuracy these dinosaurs. With the magic marker, kids can color the image in an automatic way and use the whole color palette.<br/>Memory: Memory game of animals. It’s the classic memory .They have to find pairs of    dinos in order to train their memory. <br/>Differences: Discover differences and look for differences<br/>Labyrinths Dinosaurs: A logic game in which your child will enjoy looking for the exit to the labyrinth. There are different levels in which the boy or girl will have to help the animal find the way out of the labyrinth. <br/>Looking for the dinosaur.<br/>Dinosaur stickers to put in your photos.", "metacritic": null, "released": "2017-10-27", "tba": false, "updated": "2019-08-02T04:03:49", "background_image": "https://media.rawg.io/media/screenshots/bdf/bdfa806efd96167f627f34ad7ae43be4_XOJC0T3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket School - Basic education to learn for adults & kids"], "genres": ["Casual", "Puzzle"], "publishers": ["Cortinajes Bonisa"], "esrb_rating": "Everyone 10+"}