{"id": 358185, "slug": "hyena-simulator", "name": "Hyena Simulator", "name_original": "Hyena Simulator", "description": "Enter into the savanna and live the life of a Hyena! Survive in the wild grassy plains of the animal kingdom complete with dangerous carnivores and tasty critters! Recruit hyenas to your clan, scavenge for carcasses, and battle for your life against predators like Jackals, Warthogs, and Lions!<br/><br/>Download the Hyena Simulator today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy if you're going to survive in the harsh plains of the savanna!<br/><br/>EPIC BATTLES<br/>Use the most powerful bite in the animal kingdom to hunt down and fight your prey! Deliver the killing blow by leaping through the air and pouncing on your enemy!<br/><br/>BUILD YOUR CLAN<br/>Dominate other hyenas and recruit them to your clan! Play as any hyena in your clan and create a powerful family of predators!<br/><br/>BREED HYENA PUPS<br/>Want to build your very own family? Once you have a mate you can breed pups that will grow into powerful members of your clan!<br/><br/>LEVEL UP YOUR HYENAS<br/>Gain experience by defeating dangerous enemies, scavenging carcasses, and completing missions! Level up your hyenas to increase their health and attack damage, and increase the size of your clan!<br/><br/>MISSIONS AND ACHIEVEMENTS<br/>Introducing two new mission types, \"Mark your Territory\" and “Scavenger”, to the unlimited missions and over two dozen achievements to give you a boost of experience! With the level cap increased to 200, you’ll need all the help you can get!<br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>Introducing a brand new procedural weather system with unique storms, clouds, and celestial movement. Realistic storms will bring downpours of rain, flashes of lightning, floods, booms of thunder, dusty sand clouds and more!<br/><br/>HUGE 3D ENVIRONMENT<br/>Your hyena is free to roam a massive open-world environment that is more than triple the size of the previous simulators! Track down tasty carcasses in the grassy plains and hunt fresh meat in a lush oasis!<br/><br/>NEW TOUCH-BASED CONTROLS<br/>Brand new intuitive controls let you navigate your animal like never before! Try out the BRAND NEW first person camera mode to see the world through the eyes of your hyena!<br/><br/>25 UNIQUE SPECIES<br/>Discover a massive all-new collection of african wildlife! Hunt down  animals like zebra, leopard, crocodile, warthog, boar, snake, fish, vulture, giraffe, cheetah, jackal, honey badger, bat, monkey, elephant and many more!<br/><br/>SAVANNA SURVIVAL GUIDE<br/>Look to your handy survival guide for information on local wildlife, a map of the world, pack summary, achievement progress, and much more!<br/><br/>HD GRAPHICS<br/>Stunning High Definition graphics will transport you to the scorching hot plains of the savannah! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>Looking for more realistic action? If you are of age or have your parents permission, turn on the blood effects for some added combat ferocity!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Hyena Simulator to experience the exciting life of one the most vicious predators planet on Earth, the Hyena!<br/><br/>If you liked living as a Hyena then you'll love our other animal simulators! Download our Stray Dog Simulator and live a wild life on the streets as your favorite breed, check out the Snow Leopard Simulator and pounce on your prey from high mountaintops, or slither around a tropical rainforest with the Snake Simulator!<br/><br/>Follow us on Facebook for more awesome animal games and simulators!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames<br/><br/>Photo Credit: \"Waiting spotted hyena\" by Tambako the Jaguar", "metacritic": null, "released": "2015-05-01", "tba": false, "updated": "2019-11-11T02:22:06", "background_image": "https://media.rawg.io/media/screenshots/063/06329be171ee80a627fe30e8b2379e8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": null}