{"id": 358112, "slug": "ultimate-lion-simulator", "name": "Ultimate Lion Simulator", "name_original": "Ultimate Lion Simulator", "description": "Jump into a brand new adventure as a ferocious Lion! Brave a dangerous new world to claim your place at the top of the food chain! Recruit, raise, and customize your lions, hunt down prey to feed your pride, and battle for your life against fierce bosses like the deadly trio of Hyenas!<br/><br/>Download the Ultimate Lion Simulator today while it's 50% OFF for a very limited time!<br/><br/>Brand New Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy if you're going to survive in the wilderness!<br/><br/>EPIC FIGHTS<br/>Wield razor sharp claws and a spine-tingling roar to strike fear into the heart of your foes! Deliver the killing blow by leaping through the air, hitting critical touch-based targets, and pouncing on your enemy! New touch-based commands let you order your pride to surround and attack enemies! Hunt at night with the new Night Vision!<br/><br/>BUILD YOUR LION PRIDE<br/>Dominate other lions and recruit them to your pride! Play as any lion in your pride and create a powerful family of predators! Every lion now has health, stats, and rankings providing significantly more immersive gameplay!<br/><br/>RAISE LION CUBS<br/>Breed baby lion cubs that will grow into powerful members of your pride! Carry them around in your mouth and even play as them to hunt tiny critters!<br/><br/>CUSTOMIZE YOUR LIONS<br/>Choose your lion's name, gender, fur pattern, and even tint them any color of the rainbow to make the pride of your dreams! Reach Alpha status to unlock the heroic furs that show off your prowess as a lion!<br/><br/>LEVEL UP YOUR LIONS<br/>Gain experience by defeating dangerous enemies, scavenging carcasses, and completing missions! Level up your lions to increase their health and attack damage, earn points to upgrade your lion’s statistics, and increase the size of your pride!<br/><br/>EARN STAT POINTS<br/>Stat Points can be used to provide bonus’s to traits like Health, Critical Attack Chance, Run Speed, and much more! <br/><br/>UPGRADEABLE BUFFS<br/>Buff Points can be used to upgrade your Roar and Growl Buffs, which create temporary Stat Boosting auras around your lion when active! <br/><br/>UNLOCKABLE SKILLS<br/>Skill Points unlock and upgrade special abilities for your lions. Upgrade “Enhanced Senses” to go into a rage mode that doubles run and attack speed!<br/><br/>RAGDOLL PHYSICS<br/>Your prey now realistically dangles from your mouth as you carry them! Clamp your jaws around the carcass of larger prey and drag them into a secluded area to chow down!<br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>Procedural weather system with unique storms, clouds, sunrise, sunset and celestial movement!<br/><br/>MASSIVE REALISTIC 3D ENVIRONMENT<br/>Rule over an environment so big we had to create three unique dens for your lions to live in! Track your prey down in the vast grassy plains of the Golden Savannah, brave the dangerous Elephant Boneyard, or explore the rocky hills of the Stone Oasis!<br/><br/>25 UNIQUE SPECIES<br/>Hunt down animals like hyena, gazelle, impala, elephant, rhinoceros, snake, fish, flamingo, stork, mice, rat, crocodile, african dog, rabbit, water buffalo, wildebeest, giraffe, cheetah and of course lion!<br/><br/>HD NEXT-GEN GRAPHICS<br/>From the thick mane and piercing eyes of your lion to the decaying bones of the Elephant Boneyard, everything looks so real you will forget you’re playing a game!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the BRAND NEW blood effects for added combat ferocity!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Ultimate Lion Simulator to experience the exciting life of the most dominant predator in the Animal Kingdom, the fierce Lion!<br/><br/>If you liked living as a Lion then you'll love our other animal simulators! Download our Ultimate Wolf Simulator and live a wild life in the forest, check out the Stray Cat Simulator and raise kittens in a crowded city!<br/><br/>Give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2015-08-25", "tba": false, "updated": "2019-11-01T03:34:07", "background_image": "https://media.rawg.io/media/screenshots/0c3/0c3b4620cda5b9456bab184bcacf0896.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": null}