{"id": 358194, "slug": "man-eating-plant-vip", "name": "Man-Eating Plant VIP", "name_original": "Man-Eating Plant VIP", "description": "#Update<br/>1. Summon the special prey of other worlds with summoning magic.<br/>2. The ending has been added.<br/>3. Added coin giving button that if you watch ads.<br/>4. Some game data edited. <br/><br/><br/>◆ This is the VIP version of the Man-Eating Plant.<br/><br/>◆ VIP benefits<br/>1. 10000 coins<br/>2. 30 Dark Stones<br/>3. 10 Video Ads skip coupons<br/>4.  Free Pet(Developer)<br/><br/>◆ Video ads still play at the user's option.<br/><br/><br/>Be the master of the dungeon and feed the warriors sneaking in to steal the precious treasures to the monster plant! (It is far from your usual bug eating plant ;)<br/>Information: We dare say that the music on this game is a piece of art in this game so make sure to have earphones on while playing. <br/><br/># Prologue<br/>The player's character is the master of a dungeon in a far-flung corner of nowhere. For him having to fend off the warriors who keep coming over to thieve items and treasures is a real pain.<br/>One day, he gets himself a little plant in order to help him relax. However, as the plant grows our guy starts to get the feeling that he got more than what he bargained for.<br/><br/># Features<br/>1. Cute graphics - pixel graphics composed pixel by pixel 100% manually.<br/>2. Satisfying scream sound - There is a unique scream (?) for individual feed.<br/>3. Different kinds of feed - There are about 30 different kinds of prey, so have fun discovering them one by one.<br/>4. The next stage of the evolution of plant - As the plant grows, various body parts (?) evolve which might give you something to chuckle about.<br/>5. The pets from the other dimension- pets that have sold their souls (?) in the other world will collect coins for you.<br/><br/># How to play<br/>1. Water the pot and let it sprout.<br/>2. Once it grows a head, I try to feed it a slime.<br/>3. After eating, the plant spits out the treasure the prey possessed.<br/>4. Gather the things you spit out and feed them better.<br/>5. Keep feeding the plant and watch it evolve.<br/><br/># Precautions before deleting the game<br/>Please note that when the game is deleted from the device, saved data is also deleted. Please utilize the cloud save load feature in the setup menu when changing your device.<br/>Payment details can be restored for non-consumptive products (pet, add removal etc) but not for consumptive products (coins, dark stone, ad skip, etc.). Please use the \" Restore Purchase History \" function in the settings menu.<br/><br/># Why does it ask for access to a photo album?<br/>It is to ask for permission to save the capture screen. It is not used for any other purpose.<br/><br/>▶Privacy Policy◀<br/>https://merovingiaan.github.io/mep/privacy-policy.html", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:21:07", "background_image": "https://media.rawg.io/media/screenshots/5ed/5ed8142645abcbd39d0c27897b10e6df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CaffeineMonster"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone 10+"}