{"id": 358248, "slug": "defender-heroes-castle-defense-epic-td-game", "name": "Defender Heroes: Castle Defense - Epic TD Game", "name_original": "Defender Heroes: Castle Defense - Epic TD Game", "description": "Defender Heroes Premium offer you:<br/>✅Unlock Legendary hero.<br/>✅Free 500 gems.<br/>✅Free 10.000 golds.<br/>✅No interstitial ads.<br/><br/>The war broke out and dark monsters are back to attack your castle. Not only orcs, but also goblins, witch, spirits, devils and other monsters are trying to destroy your kingdom! Use the power of the bow and crossbow to defend the realm and the kingdom from attacking enemies. Equip the castle with a bow, arrows and defeat all the demon and zombies that are coming to your castle.<br/>You are not alone in this battle. Choose your legendary warriors and fight together with the legendary heroes. Summon the ancient gods will lead your army and defend your precious kingdom. Upgrade your heroes and control their unique skill to defend kingdom from waves of monsters are attacking your castle. Do not forget to upgrade your archery and crossbow, which will help you shoot powerful bosses. Can you defend your castle against intruders with your archery?<br/>Features of Defender Heroes:<br/>- More than 10 heroes with a lot of unique skills to collect: archer, hunter, elf, panda, demon, witch…<br/>- Upgrade 100+ level of castle, archery and crossbow with amazing power.<br/>- Explore more than 300 epic battles. Defeat dark dragon, collect gold and diamond in goblin mode.<br/>- A lot of creeps to destroy before they attack the castle.<br/>- Talent system make heroes and warrior stronger by powerful magic.<br/>- Totem: Increase shooting frequency, bonus battle gold and diamond.<br/>- Weapon and equipment: Hammer, swords, armor, bow and arrows will increase your spell and heroes power.<br/>Download Heroes Defender - free offline idle strategy game with tower defense style. You will enjoy the feeling of shooting the enemy and defend your castle, and become the legendary Defender. Love ancient military offline rpg strategy games? Then download now and dive into the idle defense strategy of Defender Heroes!<br/><br/>Follow us for the updates!<br/>http://www.facebook.com/UnimobGames", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:59:16", "background_image": "https://media.rawg.io/media/screenshots/2c0/2c0ca52e7d98285478ec95df4aac8d22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FF_Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}