{"id": 358217, "slug": "crisis-of-the-middle-ages", "name": "Crisis of the Middle Ages", "name_original": "Crisis of the Middle Ages", "description": "Long for a good retro turn based RPG with a twist?  Want to play a game that will have you laughing out loud?  Crisis of the Middle Ages is the game for you!  With a rich story and a 90s style look and feel, Crisis of the Middle Ages will have you on the edge of your couch with 6-10+ hours of intriguing, hilarious and fun game play!  Expect the unexpected as creatures and characters in the game have become more self aware and are constantly questioning their roles in the world.  Even the evil monsters express frustration with their lives and have been known to complain or even walk out mid battle.  This results in some very hilarious battles.  Ultimately, this game explores the challenges of living the life we want to live versus the life that we feel obligated to live.<br/><br/>Features:<br/>No In-App purchases and no ads!<br/>Retro RPG with side view battle system<br/>Rich, funny and unique story line<br/>Beautiful music including some classical selections<br/>Over 700 Unique Enemies<br/>Over 100 Unique Attacks (including magic spells, physical attacks, friendly skills, and engineering skills)<br/>Special Items that can be thrown at enemies with unpredictable and often entertaining results<br/>6-10+ hours of game play", "metacritic": null, "released": "2019-02-23", "tba": false, "updated": "2020-07-24T02:31:00", "background_image": "https://media.rawg.io/media/screenshots/d51/d51ef8a916c1b8f60fc793727b21f81e.jpg", "website": "https://orgaction.itch.io/crisis-of-the-middle-ages", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux", "iOS", "Android"], "developers": ["GameDevMom", "OrgAction"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["OrgAction"], "esrb_rating": null}