{"id": 358240, "slug": "bronze-age", "name": "Bronze Age", "name_original": "Bronze Age", "description": "Pre-civilization Stone Age and Pre-Civilization Bronze Age are two classic games published in 2013. Both of them received enthusiastic acclaim from gamers around the world. Over the past years, gamers have played them more than twenty million times, built over one hundred and sixty million buildings, resisted over four hundred million raids, and mined over eighty trillion resources. You can be one of them right now!<br/><br/>Choose your starting date – either 4,000,000 B.C. (Stone Age) or 6000 B.C. (Bronze Age) – and lead your people to prosperity!<br/><br/>Key features, highlighted by our fans:<br/><br/>*Exciting gameplay<br/><br/>Simple and easy to use resource manager enhanced with more than 30 events. The Ice Age, natural disasters, enemy raids, wars, nomads, changes in the ruling dynasty, religious leaders, and popular revolts - all will be etched into the history of your people’s ascent. And if you're looking for a challenge, you can try our new survival mode against increasingly powerful enemies.<br/><br/>*Detailed reconstruction of history<br/><br/>Researching more than 60 technologies, from mastering fire to establishing laws, will immerse you in the background of each period. You can build more than 20 historicalbuildings drawn from the architecture of the ancient world. And when you play the Stone Age campaign you will be able to track the evolution of humankind from Australopithecus to Homo sapiens.", "metacritic": null, "released": "2013-09-27", "tba": false, "updated": "2019-11-01T03:34:29", "background_image": "https://media.rawg.io/media/screenshots/d07/d07c8656fd6a0cbf34da4f0dc3103c06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["MIKHAIL VASILEV", "clarusvictoria"], "genres": ["Strategy", "Simulation", "Educational"], "publishers": ["MIKHAIL VASILEV"], "esrb_rating": null}