{"id": 358263, "slug": "f-sim-space-shuttle", "name": "F-Sim Space Shuttle", "name_original": "F-Sim Space Shuttle", "description": "* To celebrate the 50th anniversary of the Apollo 11 moon landing, F-Sim Space Shuttle on sale (80% off) for a limited time. *<br/><br/>Have you ever wondered what it’s like to land the Space Shuttle? Now you can find out. F-Sim Space Shuttle is a critically acclaimed flight simulator for Android smartphones and tablets. It simulates the Space Shuttle approach and landing in incredible detail and accuracy. We’ve tried to combine realistic flight dynamics with stunning graphics and fun game play: Each landing attempt takes just a few minutes. Our landing analysis and scoring system tells you exactly how to improve your next landing. It will make you come back and try again.<br/><br/>Each flight starts at either 10,000 feet, already aligned with the runway, or at up to 50,000 feet, before banking into the heading alignment cone. During descent, the Orbiter is an unpowered glider, so you will only have one chance to get it right. Astronauts used to call it a flying brick: because of its 200,000 lbs. gross weight and low lift over drag ratio, the approach is six times steeper and two times faster than a typical airliner approach. Landing the Orbiter takes practice, but the built-in autopilot demo and tutorials will get you started. After your first safe touchdown,  chase that perfect landing, compare your high scores online with your friends, earn medals, and unlock achievements. Experiment with different weather conditions, night approaches, and even emergency scenarios or system failures. At the end of each flight, watch a replay from different camera angles. <br/><br/>You control the Orbiter’s pitch and roll axes by tilting your device. Alternatively, you may switch to on-screen analog sticks. Rudder, speed brake, gear, and chute are usually handled by the autopilot, but you can have full manual control if you like. For beginners, we’ve added rectangles that visualize the desired approach path. Simply try to stay within the corridor of rectangles, and they’ll guide you right to the touchdown point. Advanced pilots can turn them off and rely on the instruments in the head-up display (HUD) instead. The simulated guidance, navigation and control (GNC) systems are authentic replications of their counterparts in the real Orbiter, and the HUD features all the instruments real Space Shuttle commanders used to employ to skillfully land this unique aircraft. Now it’s your turn to give it a try.<br/><br/>Here’s what others have said about it:<br/><br/>“Because this app is so visually exciting, so technically deep, so sophisticated, so beautifully done in its realism, effects, and documentation, it earned a perfect 5/5 rating, Outstanding.”<br/>John Martellaro, Senior Editor for Reviews, The Mac Observer<br/><br/>“I was excited to see that I can enjoy flying the space shuttle realistically also on my iPhone and complement my addiction to our Space Shuttle Mission Simulator on PC when I am on the road.”<br/>Alex L., www.space-shuttle-mission.com<br/><br/>“Absolutely awesome app that is a must for shuttle huggers and aspiring astronauts.”<br/>Chris Bergin, Managing Editor, NASASpaceflight.com", "metacritic": null, "released": "2010-01-29", "tba": false, "updated": "2019-11-01T03:30:43", "background_image": "https://media.rawg.io/media/screenshots/79c/79cad14193bf60f4650ab96826ddd39f.jpg", "website": "http://fsim.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Ledinsky Software", "SkyTale Software"], "genres": ["Simulation", "Racing", "Educational"], "publishers": ["SkyTale Software"], "esrb_rating": null}