{"id": 358303, "slug": "pet-hotel-premium-hotel-for-cute-animals", "name": "Pet Hotel Premium – Hotel for cute animals", "name_original": "Pet Hotel Premium – Hotel for cute animals", "description": "In PetHotel, cute dogs, cheeky cats and funny rodents are waiting for you! Care for each animal that’s placed in your pension, fulfill all their needs and complete quests to grow and improve your hotel!<br/>Care for cats, dogs and other animals in your hotel for pets!<br/>From cute chinchillas to fluffy hamsters, many different pets are coming to your pension and need to be fussed over until their owners return. There’s a whole lot of work waiting for you, as each pet wants to be played with, fed and groomed! Of course, you can also pet and cuddle them to show them how much they are loved!<br/><br/>Lots of great animations and exciting quests await you<br/>Make the kitties purr by completing as many quests as possible! Getting new toys for the dogs, expanding the rats’ enclosures... there is always a lot to do to make your animals happy. From the smallest rodent to the largest Labrador – every pet needs your loving care!<br/><br/>Expand your enclosures and get better items and decorations!<br/>At the beginning, you'll start with a small pension and you'll need to successfully care for a few animals before you are able to expand. With each upgrade level, you'll improve your pet hotel's look and interior as well! You can look forward to more toys, more breeds to care for and more room for your new friends!<br/><br/>★ Care for cute pets such as dogs, hamsters, chinchillas and cats!<br/>★ Buy more items, toys and decorations for your animals!<br/>★ Complete exciting quests!<br/>★ Expand your hotel and receive great new buildings and breeds!<br/>★ Collect coins and animal food around the hotel!<br/><br/>Don’t hesitate! Play PetHotel and look after your very own animal shelter in this cute simulation!<br/><br/>Visit us on Facebook: facebook.com/tivolamobile", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T07:29:45", "background_image": "https://media.rawg.io/media/screenshots/073/07361b78dd250f253ef88c62678f34d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tivola"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}