{"id": 358568, "slug": "skaters-and-coppers", "name": "Skaters and Coppers", "name_original": "Skaters and Coppers", "description": "<p>Does bursting through streets and train stations on a skateboard, rushing through police officers, zipping through vortexes and collecting power ups sound pretty neat?<br/></p>\n<p>Then Skaters and Coppers may be just the game for you.</p>\n<p>Skaters and Coppers is an Endless 2D Runner which will test your reactions to dodging enemies, staying alive and crafting the highest score possible.</p>\n<p><strong>Choose Your Character</strong></p>\n<p>Play as either a female or male skater, and cause total mayhem as you ride endlessly through various levels.</p>\n<p><strong>Power Ups</strong></p>\n<p>Burst through police officers and whirling vortexes, collecting power ups like the awesome might of the hoverboard.</p>\n<p><strong>Collect Coins and Time Bonuses</strong></p>\n<p>Collect coins and tally up a high score, one that rules over others. Collect time bonuses, and don’t rush towards the dreaded  “Game Over” message.</p>\n<p><strong>Avoid Enemies or Burst Through Them</strong></p>\n<p>In Skaters and Coppers barge into police officers and whirl through vortexes in hoverboard mode or simply leap over them and keep that score rising.</p>\n<p><strong>Fire Yo-Yos</strong></p>\n<p>Collect yo-yos off the ground and propel them to stun police officers.</p>\n<p><strong>Play On Your Phone</strong></p>\n<p>Play Skaters and Coppers on your mobile phone.</p>\n<p><strong>Created By Drystone</strong></p>\n<p>I am Drystone, a sole developer who uses the Unity game engine to create 2D/3D games and mobile applications. With close to two years of experience in Unity and the C# language I have created my first game, Skaters and Coppers.</p>\n<p>I wish you all the fun and appreciate any feedback on the game, whether on bugs, critical feedback or questions.</p>\n<p>Thank you and please enjoy this small mobile game.</p>", "metacritic": null, "released": "2019-07-31", "tba": false, "updated": "2019-08-28T23:15:02", "background_image": "https://media.rawg.io/media/screenshots/9d1/9d140d12a47229471980c18337df7785.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Drystone"], "genres": [], "publishers": [], "esrb_rating": null}