{"id": 358507, "slug": "memory-metamorphosis-but-its-in-english-and-i-have", "name": "Memory metamorphosis but it's in english and I haven't playtested the damn thing", "name_original": "Memory metamorphosis but it's in english and I haven't playtested the damn thing", "description": "<p>This game was made for the \"pot-au-jeu\" game jam held by At0mium. The theme was \"metamorphose\". You can learn more and check out all the amazing entries on https://itch.io/jam/pot-au-jeu-2<br/></p>\n<p>Since this was made with GB studio, the rom is also available for download<br/><br/></p>\n<p><strong>IMPORTANT :</strong>\n</p>\n<p><em>You should continue your playthrough after the first \"ending\" which comes rather fast... But that's just an advice.<br/></em></p>\n<p>Most elements which feel distinct from the background can be interacted with (by facing them and pressing Z).<br/></p>\n<p>By the way, the game will tell you when it's over, don't worry, be happy, enjoy the game-y(even if there is a post game easter egg made for at0mium and it's community &lt;3).</p>\n<p><strong>STORY:<br/></strong>A young girl named Akari hears about a world existing beyond the dephts of a chasm... She decides to investigate and discovers a dimension seemingly normal at first which tries to assimilate Akari and the ideas shaping her world.</p>\n<p><strong>CONTROLS :\r\n</strong></p>\n<p>move -&gt;   arrow keys\r\n</p>\n<p>Interact      -&gt;   Z\r\n</p>\n<p><strong>Why isn't there any music?</strong><br/></p>\n<p>GB Studio requires .MOD files and the music tools available (openmtl...) are not tools I know how to use, especially when it comes to tuning the samples. I think it's quite similar to FamiTracker.</p>\n<p>The same things is true for the sound effects. I should use openmtl, bbut it's more because of a lack of inspiration and ideas in this case...</p>\n<p><strong>\r\nUsed Assets:</strong></p>\n<p>The third-party assets I used were the speech bubbles, the text interface and the choice cursor. All of this are copyright-free and supplied with the installation of GB Studio.</p>\n<p>Every other elements were made during the jam's 60 hours time period (even if it was mostly on the second day because I slept the first one).<br/></p>\n<p><em>-Deadkat</em></p>", "metacritic": null, "released": "2019-07-31", "tba": false, "updated": "2019-08-02T08:25:05", "background_image": "https://media.rawg.io/media/screenshots/cec/cec9a474e36152c074897351b7aaabca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["deadkat"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}