{"id": 358574, "slug": "the-big-wave-colorblind-deaf-friendly-puzzle-game", "name": "The Big Wave: Colorblind & Deaf Friendly Puzzle Game", "name_original": "The Big Wave: Colorblind & Deaf Friendly Puzzle Game", "description": "<p>Accessible parallel gameplay, information gathering puzzle game where you must solve puzzles to prevent threats from bringing harm to Secret Government agency #1's specialized disguise source, Mr. Moustache's Moustache Emporium.</p>\n<p>Vocally Driven Puzzle-Point and Click filled with clever dialogue, ridiculousness, general befuddlement, and lots and lots of moustaches. After catching wind of a sinister plot to destroy Mr. Moustache's Moustache Emporium, a lone savior sets out to defend the city's largest moustache provider! </p>\n<p>By switching between radio channels (by selecting presets or typing in new ones you find), noting the enemy's movements, and piecing together the clues, you can unravel the plans of your foes and stop them! The project is aimed at being color-blind friendly and uses shades instead of color variations to indicate need of interaction. It is also non-hearing friendly as subtitles are provided throughout. We had aimed to include accessibility for the blind but ran out of time. The game is in fact playable by such a person but may require assistance for selecting channels and inputting responses. Future planned features includes keyboard as input for the game focusing on use of the numpad rather than the qwerty section of the keyboard for ease of use and possibly custom hardware for blind user interfaces.<br/></p>", "metacritic": null, "released": "2019-07-30", "tba": false, "updated": "2019-08-28T23:15:02", "background_image": "https://media.rawg.io/media/screenshots/275/275b6dfc506ef80598c5cf214bdb8a99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["argzero"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}