{"id": 358634, "slug": "grindhouse-games-volume-i", "name": "Grindhouse Games Volume I", "name_original": "Grindhouse Games Volume I", "description": "\n\n\n<p>Grindhouse Games Volume I collects three games from the Black Eyed Priest catalogue and presents them with new levels, enemies, and content.  The three games that you receive are:</p>\n<p>SHOTGUN -  A sidescroller shooting game where you play as a mother ready to dish out bloody revenge on the low life scum who kidnapped her son.  Fast paced violence and over the top characters abound throughout this game.  This version of Shotgun adds new rooms and new enemies, making it even more difficult than before!</p>\n\n<p>WITCHING HOUR AT HELL HOUSE - A hellish escape the room puzzle/horror game!  Escape the Hell House before the \"Tall Man\" arrives and maybe even find the root to all this insanity within the basement.  This version adds a new, never before seen puzzle and ghost to escape!</p>\n\n<p>PEEPAW - Oh no!  Peepaw was messing around with the Ouija board and got possessed again!  Help find Meemaw and escape!  That's right, your good ol' grandpa has been possessed by demonic forces and is now attempting to murder you and your family!  Traverse a dark house, find your cousins for upgrades, and rescue Meemaw before you're all dragged to Hell!  This version features new Peepaw behaviors.</p>\n\n<p>Action, horror, thrills, and chills are at your fingertips in this sleazy collection of retro madness!</p>\n<p>There are free versions to all of these games right here on itch.io, so this \"director's cut\" package is a way to help me continue making games inspired by trash cinema!  They also of course come with some new bells and whistles if you're already a fan. <br/></p>", "metacritic": null, "released": "2019-07-31", "tba": false, "updated": "2019-08-28T23:15:02", "background_image": "https://media.rawg.io/media/screenshots/95d/95d5e82887deebd860dd7f3852ac62b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Eyed Priest Games"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}