{"id": 3586, "slug": "fairy-fencer-f", "name": "Fairy Fencer F", "name_original": "Fairy Fencer F", "description": "Long ago, the Vile God and the Goddess waged war with each other. Equally matched, they were sealed away in another world…<br/><br/>Now a lazy young man named Fang somehow finds himself a key part of this war he’d really rather not deal with, but fate beckons in this uncommon RPG!<br/><br/><strong>Key Features</strong><br/><ul><li><strong>More Flash &amp; Flair!</strong> The world of Fencers and fairies gets updated with a 1080p graphic overhaul! Fairizing never looked so good.<br/></li><li><strong>Really Reluctant Hero</strong> With a hero more interested in his next meal and a fairy partner who will have none of it, this saving-the-world narrative is injected with oodles of madcap humor!<br/></li><li><strong>High Tension!</strong> Increase the Tension gauge in battle by dealing and receiving damage. The higher it is, the more damage you’ll dish. Once it’s high enough, you’ll be able to Fairize – combining with your fairy to create a super-powerful form!<br/></li><li><strong>Fairy’s Fate</strong> Find fairies to join you in your quest – only they can grant you special abilities, and by leveling them up you’ll also increase your effect radius in…<br/></li><li><strong>World-Shaping!</strong> Pull Furies from the Goddess and Vile God and place your fairies in them. You can then stab those Furies into the world map for new effects in nearby dungeons like EXP boosts or enemy changes - be careful though, because not all effects are good!</li></ul><br/><br/>The following DLC packs are included with download of the main game:<br/><ul><li><strong>Fairy Fencer F: Beginner's Pack</strong>, which includes the following packs: <strong>Beginner's Synthesis Kit</strong>, <strong>Emergency Pack</strong>, and <strong>Assortment of Rare Materials</strong>.<br/></li><li><strong>Fairy Fencer F: Secrets of Shukesoo's Tower Pack</strong>, which includes <strong>Secrets of Shukesoo's Tower 1, 2, 3, 4, 5, 6, 7, and 8.</strong>*<br/><br/>*Upon activation, this DLC cannot be disabled. Disabling may cause the program to be unstable and possibly result in a forced shutdown of the game. Before activating, please ensure that you wish to keep the content throughout the remainder of the game.</li></ul>", "metacritic": 66, "released": "2013-10-10", "tba": false, "updated": "2023-11-26T19:25:12", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d6caeae16f880aefbfc74cdb60c6a76.jpg", "website": "http://www.ideafintl.com/fairyfencerf/", "rating": 3.37, "rating_top": 4, "added_by_status": {"yet": 21, "owned": 422, "beaten": 12, "toplay": 7, "dropped": 15, "playing": 3}, "playtime": 6, "achievements_count": 30, "ratings_count": 30, "suggestions_count": 514, "game_series_count": 1, "reviews_count": 30, "platforms": ["PlayStation 3", "PC"], "developers": ["NIS America", "Idea Factory", "Compile Heart"], "genres": ["RPG"], "publishers": ["Plug In Digital", "Idea Factory"], "esrb_rating": null}