{"id": 3587, "slug": "fibbage-the-hilarious-bluffing-party-game", "name": "Fibbage: The Hilarious Bluffing Party Game", "name_original": "Fibbage: The Hilarious Bluffing Party Game", "description": "Fibbage is the lying, bluffing, fib-till-you-win multiplayer trivia party game from the makers of YOU DON’T KNOW JACK!  Play with 2-8 players!<br/>Fool your friends with your lies, avoid theirs, and find the (usually outrageous) truth. And get this: your phone or tablet is your controller!<br/>“The mayor of Rabbit Hash, Kentucky is a _____.” <br/>Baby? Rabbit? Ham sandwich? It’s up to you! <br/>Fool your opponents into thinking your bluff is true and you’ll rack up the points! But be careful not to pick your opponent’s bluff.<br/><br/>Key Features:<br/>• Players use only their phone, tablet, or even laptop as a controller. No additional controllers needed.<br/>• Play with up to 8 players in one room.<br/>• Hundreds of questions, written and performed by the same team behind YOU DON’T KNOW JACK – including the host, Cookie Masterson.<br/>• “Like” other player’s bluffs (even if you don’t fall for them) and at the end of the game, someone will be awarded the Thumbs Cup for the most clever answers.<br/><br/>Video output in Full HD 1080p requires 1080p native display.<br/><br/>Use of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.<br/><br/>2-8 players<br/>250MB minimum save size<br/>1080p HD Video Output<br/>Online Play (Required)<br/><br/>  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.<br/><br/>Developed by Jackbox Games, Inc.  Fibbage and the Fibbage logo copyright © 2014 Jackbox Games, Inc.   All rights reserved.  YOU DON’T KNOW JACK, Jackbox Games, and the Jackbox Games logo, are registered trademarks of Jackbox Games, Inc.", "metacritic": null, "released": "2014-08-21", "tba": false, "updated": "2023-12-09T15:01:40", "background_image": "https://media.rawg.io/media/screenshots/cc3/cc375a71c0f887285dc2357792958180.jpg", "website": "", "rating": 4.0, "rating_top": 4, "added_by_status": {"owned": 43, "beaten": 6, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 13, "platforms": ["PlayStation 4", "PlayStation 3", "Xbox One"], "developers": ["Jackbox Games"], "genres": [], "publishers": ["Jackbox Games"], "esrb_rating": null}