{"id": 35886, "slug": "otto-matic", "name": "Otto Matic", "name_original": "Otto Matic", "description": "• HAS AN OPTION TO PLAY IN STEREO 3D WITH 3D GLASSES!!!<br/><br/>The year is 1957 and a fleet of flying saucers from Planet X have come to Earth. These saucers are under the control of the evil Brain Aliens who are abducting helpless human beings and taking them away to strange alien worlds to become slaves of The Giant Brain. Luckily for the human race there exist the Otto Matics, robots who police the galaxy in name of all that is good and decent.<br/><br/>You are Otto Matic, the robot who is given the job of saving Earth from the clutches of The Giant Brain from Planet X. You must rescue as many humans as you can while defeating the Brain Aliens and all of their evil followers. Your mission will take you to strange and fantastic alien worlds which are often treacherous and will require Otto to perform amazing feats.<br/><br/>Your rocket ship will take you to each of the planets, starting with Earth. While on each planet you must save as many humans as you can, but be careful because the Brain Aliens will try to abduct the humans before you can save them. When you save humans, they are teleported to your rocket ship. To escape the planet you must also collect rocket fuel. Once The Giant Brain has been defeated and peace restored to the galaxy, you will return to Earth with your human cargo where they will be freed.<br/><br/>In Otto Matic...<br/><br/>• 10 levels on strange alien planets!<br/>• Battle 25 different alien creatures!<br/>• Attack with 7 different types of space-age weapons<br/>• Fight off giant radioactive killer vegetables!<br/>• Ski behind giant metal beasts on a sea of toxic ooze!<br/>• Ride soap bubbles across noxious lakes of slimy goo!<br/>• Get shot out of a cannon!<br/>• Smash alien clowns in hovercraft bumper-cars!<br/>• Drink radioactive potions to grow to 50ft tall!<br/>• Ride a zip-line to escape mutant radioactive robots!<br/>• Pilot a flying saucer and lay waste to an alien fortress!<br/>• Battle the Giant Brain from Planet X<br/><br/>And much, much more!<br/><br/>View the Otto Matic Instruction Manual Here:  http://pangeasoft.net/otto/instructions.html", "metacritic": null, "released": "2004-03-29", "tba": false, "updated": "2019-07-30T01:18:49", "background_image": "https://media.rawg.io/media/screenshots/149/149b873009973497b70eaf2dc3b75365.jpg", "website": "http://pangeasoft.net/otto/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "iOS"], "developers": ["Pangea Software", "Ideas from the Deep"], "genres": ["Adventure", "Arcade"], "publishers": ["Pangea Software", "Ideas from the Deep"], "esrb_rating": null}