{"id": 358937, "slug": "octopearl", "name": "Octopearl", "name_original": "Octopearl", "description": "<p>WASD to move.</p>\n<p>Q to grab a bubble.</p>\n<p>E to throw it.</p>\n<p>Middle mouse button scroll to zomm.</p>\n<p>Middle mouse button click and pan to change camera angle.</p>\n\n\n\n\n<p><strong>Tutorial dialogs that didnt make it to the final version due to a lack of time:</strong></p>\n<p><strong>FERDINANDE THE CLAM -</strong> Greetings, ocean wanderer. I'm afraid you haven't chosen the right day to visit us. Those are sad times for our kingdom, as my children, my beautiful, beautiful pearls, have been captured.<br/>Rumors say that they're held captive within the Triton's castle. He would have imprisoned them to try and seduce a mermaid he fell in love with.<br/>But my children are no ornaments, and I will set them free. However, as you see, I'm just a clam. I'm not cut out for adventures, unlike my rolling babies...<br/>But You! You could help me! You're fit like a hero, I know you can bring my babies back by my side.<br/>Please, hurry! They must be terrified! My poor children are not used to being on their own for so long...</p>\n<p>.</p>\n<p><strong>ERNEST THE SHRIMP -</strong> Whoah there! Where do you think you're going? Do you have any idea what you're doing?<br/>...<br/>Yes. That's what I thought. Now let me teach you a few things. I'm sure Ferdinande won't mind us borrowing one of her children to show you how to save the others!<br/>So. Let's start with the basics.<br/>You can use the WASD keys to move around.<br/>If you see a bubble, you can press Q to catch it, and then E if you want to throw it away (if you're the undecisive type, this will be useful to you).<br/>Finally, you can use the mouse wheel to zoom in and out, and you can even click it while moving your mouse up and down if you feel like changing your point of view!</p>\n<p>Now then. Do you see this pearl over there? Don't worry, she's not actually captive, but the others will be. To get to her, you'll have to pass a few puzzles.<br/>First of all, if you see a door you need to open, think about pushing the cubic block on the red tile. Easy, right?<br/>Do you remember what I said earlier about bubbles? Well if a column is standing in your way, you can throw one at it to break it. Powerful, aren't they?<br/>My last advice will revolve around strong currents, like the one you can see in these rocks. It's simple, just bypass it.<br/>Well, now it's all on you! Good luck, Ferdinande is counting on you. And so am I.</p>\n<p>Made by Floriane Dorca, Maryne Tixier, Pierre Buthaud, Alexandre Barrault for Minijam33</p>", "metacritic": null, "released": "2019-07-29", "tba": false, "updated": "2019-08-02T10:16:49", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbe26bfa5bd03629588664987812c9fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shockaedit"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}