{"id": 359236, "slug": "power-stealers", "name": "Power Stealers", "name_original": "Power Stealers", "description": "Power Stealers bring us back to the ’90s and the arcade culture, where games were simple and short, they just toss the player straight to the action. Back in the day games were very challenging, but we understand that times changes and that we live in a different context and that’s why our game will be a challenge for the experienced and friendly to the uninitiated.<h3>Main Features</h3><ul><li>Art-style based in the arcade game era (pixel-art)<br/></li><li>Simple and action-focused gameplay<br/></li><li>Challenging but never frustrating<br/></li><li>Local co-op<br/></li><li>Five unique levels, with their own theme and foes<br/></li><li>Exciting boss battles</li></ul><h3>Story</h3><br/>Power Stealers tells us a story about Narad and Osfrid two colleagues that branched their way apart due to incompatible ideals. The conflict begins when Osfrid gets in touch with an alien intelligence whom he became an ally in order to make an army, a key piece to go forward with this plan is within Narad’s lab. <br/><br/>You take the role of Lars and Hana, Narad’s apprentices who are members of a project that tries to create an interplanetary defense, they were selected by their extraordinary capabilities.<br/><br/>Armed with the last of technology and with the aid of Shen-bot which is an artificial life form, they go to the battle against Osfrid’s minions.<h3>Characters</h3>Lars: Cadet of the Safety and Order forces of the planetary union, he likes to practice sports in his spare time.<br/><br/>Hana: Belong to the same company as Lars. She meet Narad because of her interest in science and technology, she helped to create the Shen-bot<br/><br/>Shen-bot: Small robots with advanced artificial intelligence, conceived as personal assistants and guards. Despite their size, they’ve proven useful.<br/><br/>Osfrid: Almost his entire life happens inside a lab, but this changed with his decision to research an ancient and almost unknown civilization, his discoveries took him to lose his mind. Focusing his efforts on the development of an army of mystical creatures and super soldiers.<br/><br/>Narad: He believes in science as a vehicle for mankind wellness, but he understands that the world is complex and almost nothing is entirely good nor bad. He has regret some things he did because of his research. Now leads an elite group tasked to handle threatens that the common order force can’t.<br/><br/>Charankanwal: Artificial super-soldier created by Osfrid combining Lars and Hana genes and even his own as well as the soul of a mystical creature that resembles a turtle.", "metacritic": null, "released": "2019-07-27", "tba": false, "updated": "2020-02-25T14:25:30", "background_image": "https://media.rawg.io/media/screenshots/fad/fadb864ca1e0a3ba2c2756c738b73f03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Intertum"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["intertum"], "esrb_rating": null}