{"id": 359265, "slug": "deorum-online", "name": "Deorum Online", "name_original": "Deorum Online", "description": "<strong>What is Deorum Online</strong><br/><br/>Deorum Online is an innovative 2D top-down indie, retro, real-time PvP, sandbox, fantasy MMORPG. Fight simultaneously against or alongside hundreds of players in a zone-free, instance-free and wide open fantasy world designed with much love. The players decide for themselves which side they are on. Fight for the good and forge guilds together with friends and allies, bring law and order to the people, become a merchant or perhaps choose to side with evil and surprise your enemies with an ambush. Gain so much attention and reputation that you may even become the unique god in the world of Deorum. In Deorum Online can you create a name for yourself in countless ways. ​<br/><br/><br/><strong>Features</strong><br/><br/><strong>Open World Full Loot PvP</strong><br/>Explore a world crafted with love. Apply your hard-earned fortune in the fight against other players. Use the terrain to your advantage and destroy your enemy with superior battlefield strategies and loot the riches of other players.<br/><br/><strong>Unlimited skill based progression</strong><br/>Play however you like and do whatever you want. In Deorum Online there are no classes. Everything you do immediately gets noticed. Swing your sword and train it at the same time. Shoot arrows and become a respected archer or forge armor and earn your wealth through trade.<br/><br/><strong>Endless Exploration and Adventure</strong><br/>Explore the world of Deorum without instances or zone restrictions. Fight on land, at sea or put your skills to the test in a dungeon. There are no limits.<br/><br/><strong>Player Housing</strong><br/>Collect Resources and build your own House wherever you want and furnish it as you wish or team up with Friends and build whole Cities together. Build Forts with your clan and protect them again enemy Clans through Walls, Turrets or Traps. Have your City populated by Merchants who sell equipment and thus increase your wealth.<br/><br/><strong>Epic God Fights</strong><br/>Fight against good or evil and decide which side you wish to fight for. Achieve reputation and honor and even become the unique god and give your followers additional strength to assist them in battle.<br/><br/><strong>Dynamic Player Driven Economy</strong><br/>You need a break from fighting or even decide to go completely against it? No problem, in Deorum Online there are many ways to keep yourself busy. Become a craftsman and sell your goods to other players, mix potions to assist you and others in battle, or tame animals and sell them.<br/><br/><strong>Competitive Top Down Combat</strong><br/>Manually aim each arrow you fire, each spell that you cast and every swing of your sword. Ultimately, the player’s ability determines his victory or defeat in the land of Deorum.", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-08-23T12:10:50", "background_image": "https://media.rawg.io/media/screenshots/e61/e6110b484c80d4967e54a3e656f09514.jpg", "website": "http://www.deorumonline.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Huto Production"], "genres": ["Action", "Adventure", "RPG", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Huto Production"], "esrb_rating": null}