{"id": 359346, "slug": "longing-ring-of-esca", "name": "LONGING RING OF ESCA", "name_original": "LONGING RING OF ESCA", "description": "<p>■To take back the castle, a high-minded female knight scrifices her body<br />\nThe castle is taken over, her virginity which was supposed to given to her fiance was taken away, and the female knight was captured as a slave.<br />\nShe has to sacrifice her body to escape from an enemy base and take the castle back.<br />\nSometimes she disguises her self to a prostitute, sometimes to seal a mouth she does...<br />\nTake back the castle, take revenge on the person who took her virginity, and take back her own pride as a knight!<br />\n■Orthodox Roguelike RPG<br />\nIt is a simple roguelike RPG to complete the dungeon by using items effectively and overcome various traps and monsters.<br />\nFor those who want to enjoy events and play a roguelike RPG for the first time, there are three different difficulties.<br />\n■The number of basic CG is 21, if you include the increments, it&#39;s 269!<br />\nThere are 18 cosplay pictures, 9 weapons, and 9 accessaries as increments<br />\nThere are also pregnant versions for each 18 cosplay picture!!<br />\n■The main character who was conceived a half-blooded evil, the pregnancy due date is getting closer to her…<br />\nThe number of the days to the pregnancy due date decreases when you walk around the dungeon!<br />\nThe image changes into a pregnant version when the pregnancy due date is getting closer.<br />\nYou have to complete the dungeon before giving a birth to a half-blooded evil.<br />\n■Cosplay outfits to change your look depending on the equipment<br />\nNot only outfits, but also equipments such as weapons and accesarries can change your look!<br />\nAlso, when you equip an item, you can hear the voice matching each equipment<br />\n・School Swimsuit<br />\n・School Uniform<br />\n・Maid Outfit<br />\n・Bikini Armor<br />\n・Tentacle<br />\n・Vibrator<br />\n・Restraining tool<br />\n・etc...<br />\nYou can enjoy various combinations of more than 30 kinds of equipment<br />\n■If you lose, you&#39;ll get raped by a monster<br />\n・Raped by a huge orc forcefully<br />\n・Taken in by a slime<br />\n・Casted a hyponotic spell by a wizard…<br />\n・Raped by a group of bandits<br />\n・Raped by a myriad of tentacles<br />\n・etc…</p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-26T13:56:57", "background_image": "https://media.rawg.io/media/games/9ff/9ffaa41d9d5757371f11829280adb176.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "beaten": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 474, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Flower games"], "genres": ["RPG"], "publishers": ["Flower games"], "esrb_rating": null}