{"id": 359333, "slug": "dual-family-prologue", "name": "Dual Family: Prologue", "name_original": "Dual Family: Prologue", "description": "<h3>THE STORY</h3>A wife and husband can no longer stand each other – for more reasons they care to claim for. With their past love crushed and household seemingly splitting at the seams, an exhausted wife seeks sexual validation. A faultless young woman begins her inevitable sexual awakening. Choose your role and witness two perspectives of one household falling to pieces, grasping for any possible signs of love in their descent.<h3>THE GAME</h3>Dual Family will repeatedly test you with a multitude of scenario-based choices that will influence the relationship with your friends, as well as the ending of the story arc. Do you just want a hug, something platonic? Or perhaps you desire something fiercer, more intimate; a kiss on the lips without hesitation. For those still unsatiated, you may find yourself wanting even more.<br/><br/><br/>Regardless what you seek in your relationships, there's much to explore in the story Dual Family offers. Troublemaker or stoicist, lover or friend; it's all in your hands.<h3>THE DEVELOPMENT</h3>The Steam prologue has roughly a third of the game's current content; many of the earlier chapters in the story are far shorter than those found later, the most recent being the longest yet. The complete story will be playable on steam when finished in totality, however the latest 20 chapters (10 for each campaign) can be found on my site while development continues.<br/><br/><br/>Enjoy! :]", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-19T15:04:49", "background_image": "https://media.rawg.io/media/screenshots/bcc/bcc7cf9fcb8a21686c96b11a0ef825eb.jpg", "website": "https://gumdropgames.net/steam", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "toplay": 2, "dropped": 1}, "playtime": 9, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gumdrop Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Gumdrop Games"], "esrb_rating": null}