{"id": 359307, "slug": "metal-heads", "name": "Metal Heads", "name_original": "Metal Heads", "description": "Metal Heads is a crazy, action packed party game where up to 8 of you and your friends go head to head in a series of challenging, but fun mini-games.<br/>Featuring over 30 mini-games, multiple board game modes, character customization, mini-game and board game level editors, with much more content to come post-launch.<br/>Metal Heads aims to give you an all round party game experience that will never leave you wanting more and make you want to come back to it for years to come.<br/><br/><h3>8 PLAYERS LOCAL</h3>Are you tired of looking for party games to play and finding that they only support 4 players? Yeah...me too.<br/>Metal Heads supports up to 8 players LOCALLY, which means that everyone should be able to join in on the action.<h3>ONLINE</h3>It's sometimes difficult to gather 8 people together to play a game, so Metal Heads will launch with online multiplayer support!<h3>COUCH COMBO</h3>Do you want to play with more people, but don't have enough at the party?<br/>Create an online server, and let online players join in on the fun.<h3>DROP IN - DROP OUT</h3>Sometimes, you just have to leave the party, whether it be that you need to get home early as you have an early start the next day,<br/>OR, you need to go and visit the porcelain throne for an undetermined period of time.<br/>Let's say there are 6 players, and a few more people join the party, give them a controller, and they can quickly drop in, even if there is a mini-game in progress!<br/>OR<br/>Players who are leaving temporarily can allow a bot to take control over their character, or if they are leaving permanently, they can remove their character/drop out of the game.<br/><br/><h3>OVER 30 MINI-GAMES</h3>Your skill will be put to the test in over 30 mini-games, each designed to cater to a variety of different skills.<br/>Are you great at platformers?<br/>Are you AWESOME at Quick Time Events? <br/>Are you even better at Racing games?<br/>Do you have the Memory of an elephant and are fantastic at logic based games?<br/>NO PROBLEM!<br/>Metal Heads has something for everyone! But only one can be the ultimate Metal Head.<h3>MORE MINI-GAMES TO COME</h3>Metal Heads will feature over 30 mini-games at launch, with over 100 mini-games planned for the future.<br/> So even if you buy the game on launch date, there will be new mini-games added frequently so that you never get bored.<br/><br/><h3>ROLL THE DICE</h3>Metal Heads features the ever popular board game mode.<br/>The main board game though, requires you to roll a dice, then move to your destination, the classic board game style...<h3>ROLL, RUN, JUMP, REPEAT</h3>What sets Metal Heads class board game apart, is that you actually have to move your character yourself, requiring you run and jump over platforms and obstacles, collect bonus points, take super risky, but highly rewarding shortcuts, all to get to your destination, and if you don't make it, you go back to where you started.<h3>NOT JUST THE CLASSIC</h3>Metal Heads will feature more than one type of board game.<br/>Each board game will have their own unique play style, just like the mini-games, so that there are board games for everyone.<br/>Tired of rolling a dice? Try your hand at a card game, or perhaps a logic board allowing you to plan your moves each turn.<br/><br/><h3>CUSTOMIZE YOUR METAL HEAD</h3>Metal Heads features a basic character customization at the character selection screen using character presets, but you can create a more personalized and unique metal heads in the character customizer, simply select a template, then add accessories, like antenna's, eye sockets, dangling things, capes, logo's and much more!<h3>STAGE EDITOR</h3>Metal Heads is planned to have a stage editor after launch...or maybe even AT launch, so that when you get bored of playing the same stage over and over, you can create your own stages.<br/>This is not limited to just mini-games either, you will be able to create new board game maps too!<br/>And it just wouldn't be too exciting if you couldn't share your creations with the rest of the world right? So the stage editor will be compatible with the Steam workshop, where you can upload your creations, as well as download other players creations.<br/><br/><h3>BANG YOUR HEAD</h3>Metal Heads wouldn't really live up to it's name if it didn't feature face melting metal music to bang your heads too.<br/>Every mini-game features unique music tracks, each with a metal influence, however aren't really heavy and in your face, so you won't get tired of hearing the same track over and over again...not that it would be a bad thing, since all of the tracks are AWESOME!<br/>IF you're not a fan of metal music, or the tracks that are in the game, there is planned to be a non-metal sound track too.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:13", "background_image": "https://media.rawg.io/media/screenshots/ebb/ebbf03f8882f824d67ebe82ffe0c36ed.jpg", "website": "https://www.metalheadsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nathan Francis"], "genres": ["Indie"], "publishers": ["Nathan Francis"], "esrb_rating": null}