{"id": 359445, "slug": "classic-sudoku-2-puzzle-game", "name": "Classic Sudoku 2 Puzzle Game", "name_original": "Classic Sudoku 2 Puzzle Game", "description": "Sudoku, the popular Japanese puzzle game is based on the logical placement of numbers. Our Classic Sudoku is one of the most popular puzzle games of all time. Sadoku is referred as excellent brain game because by playing Sudoku, you will improve your concentration and brain power(IQ Level). <br/><br/>Sudoku is a logic-based, combinational number placement puzzle. The objective is to fill a 9×9 grid with digits so that each column, each row, and each of the nine 3×3 sub grids that compose the grid contains all of the digits from 1 to 9.<br/><br/>Whether you’re a sudoku master looking for an expert-level sodoku game, or a new player seeking sodoko for beginners, you’re in the right place! Our sudoku game allows you to choose from different difficulties – easy Soduko, medium soduku for average players and hard &amp; expert sudoko for sudoku masters!<br/><br/>Choose any level you like to play suduku. Play easier levels to exercise your brain, logical thinking and memory, or try hard levels to give your mind a real workout. You will find all you need whether you are playing your first sudoku, or you've progressed to expert difficulty.<br/>Here are some simple instructions to get you started step by step:<br/>1. Start our online sudoku game by choosing your desired difficulty.<br/>2. You will see a 9x9 grid containing 9 3x3 boxes. Some squares will already contain numbers and rest needs to be filled by you.<br/>3. To complete the sudoku puzzle game, you must fill every square on the grid with a number from 1-9. But there’s a catch! The numbers 1-9 should appear exactly once in every row, column, and 3x3 box.<br/>4. No guessing is required! Use logic and the given numbers to fill in the remainder of the sudoku puzzle.<br/>5. For additional help and settings, click on the ‘menu’ button in the upper right corner of the sudoku grid. There, you can manage the timer, see errors you’ve made, read more instructions, and add notes to squares.<br/>6. Complete the game, have fun and get ready for next game!<br/><br/><br/>Features &amp; Highlights:<br/><br/>• Unlimited puzzles to choose and play<br/>• Complete daily challenges with unique puzzles<br/>• Auto-check option to progress without interruption<br/>• Hints to guide you through the puzzle when you are stuck<br/>• Track your progress for each level, analyze your best time and other achievements<br/>• Made a mistake? Undo to correct it immediately.<br/>• Nice looking design with 9x9 Grid<br/>• Distinct levels of difficulty: Easy, Medium &amp; Expert<br/>• Supports both phones and tablets<br/>• Portrait and landscape mode for tablets<br/>• Simple and intuitive design<br/><br/>Download Sudoku now on App Store and enjoy unlimited levels of puzzles!", "metacritic": null, "released": "2018-11-30", "tba": false, "updated": "2019-08-05T05:27:33", "background_image": "https://media.rawg.io/media/screenshots/1e3/1e3c1f3304a5e3651c99956c9c7e34b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Prominent IT Tech Solutions"], "genres": ["Board Games", "Puzzle"], "publishers": ["Prominent IT Tech Solutions"], "esrb_rating": "Everyone 10+"}