{"id": 359479, "slug": "coin-rush-mining-madness", "name": "Coin Rush - Mining Madness", "name_original": "Coin Rush - Mining Madness", "description": "Yeehaw Partner! Ready to hit the big one? Build your village, become a miner and get richer than your wildest dreams!<br/><br/>Start your journey with a fistful of free gold coins. Raid rival villages and steal their hard-earned coins and gems. Show your enemies that YOU are the real sheriff in town. Take revenge on your enemies and get rich along the way.<br/><br/>Play mini-games and get rich!<br/>Whether you plunder rival mining towns, whack pesky moles or spin the daily wheel, you can earn tons of coins and unique perks.<br/><br/>Play with friends<br/>Work together or fight! In Coin Rush you can do both and get rich! Play with or against your friends and make some new ones along the way!<br/><br/>Complete missions, get chests &amp; more<br/>* Spin the daily bonus wheel<br/>* Connect with friends and get richer quicker!<br/>* Get amazing prizes and collectibles<br/>* Show off your village and loot!<br/><br/>Upgrade your village<br/>Build a prosperous mining village. Upgrade your buildings for unique rewards! Get more gems, spins, and achievements!<br/><br/>Get in on the gold rush with Coin Rush!<br/>Journey into the belly of the earth and win amazing prizes with your Facebook friends in the best free-to-play mobile adventure game. Get in on the action-packed competitive game for Adults and kids alike! Grab your pickaxe and your hard hat and build your own mining village! With Coin Rush the fun never ends! Hit the download button to get the most addicting game of 2018!", "metacritic": null, "released": "2018-10-20", "tba": false, "updated": "2019-08-05T05:53:42", "background_image": "https://media.rawg.io/media/screenshots/8af/8af0f21921b34c07730519dea72585c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GT Holdings"], "genres": [], "publishers": ["GT Holdings"], "esrb_rating": "Teen"}