{"id": 359428, "slug": "cut-fruit", "name": "Cut fruit.", "name_original": "Cut fruit.", "description": "Exciting game Pop apple undoubtedly pleasure kids. Colourful, bright and colorful apples - in real life you will not find such! The task is simple - you need to collect as many apples. Apples can be found amusing worms that are sure to amuse the children. Children's game will teach kids concentration, attention and distinguish colors. Kids games - it's very interesting. After all, playing educational games, the child develops such qualities as logical thinking, creativity, perseverance. He develops fine motor skills, imagination, patience, observation and produced ability to concentrate. Playing simple educational games, educational baby games for kids, the child will enjoy its results and achievements. Children's games may help the development of the child, to teach him to focus, to train the coordination of movements, learning to think logically. And all this in an interesting child, playful way. Educational games for children can not only learn something new, but also to apply their knowledge in practice. Educational games for babies can help kids have fun and have fun, and at the same time will be an indispensable tool in the development and education of the baby. Educational game aimed at the development of attention, memory, logical thinking, color perception. Developing children's game for the child to help him to become observant, attentive, smart. Educational games for kids to develop attention and memory, can help you with your child fun and to spend your spare time!", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-08-05T05:19:40", "background_image": "https://media.rawg.io/media/screenshots/a62/a62ef303ae2a14ec8028ce6d6a29cda9_t2RJ4KX.jpg", "website": "http://www.yovogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yovo Games"], "genres": ["Casual"], "publishers": ["Yovo Studio"], "esrb_rating": "Everyone 10+"}