{"id": 359497, "slug": "carrot-war-hd", "name": "Carrot-War HD", "name_original": "Carrot-War HD", "description": "Carrot-War HD is free for a limited time,right Now!<br/><br/>Use your finger as a magic pen and draw powerful lines with yellow ink to fight off the alien invaders and save the rabbit's planet! <br/><br/>▶ Game Video: http://youtu.be/mXA_YBmxepA<br/><br/>★★★★★ <br/><br/>Enticed by the scenic views and rich resources, the aliens descended and invaded Rabbit planet, looting almost all the naturally growing carrots in the process. <br/><br/>With almost no hope in sight, the remaining rabbits sought help or intervention from their deities and their prayers were answered when the rabbits were bestowed with a magic pen filled with yellow ink. Initial surprise and disappointment was quickly overshadowed as the rabbits quickly discovered the hidden power and its destructive capabilities. The pen truly is mightier than the sword! <br/><br/>Become the hero of Rabbit planet by aiding the last band of brave rabbits to withstand the invasion and help them use the magic pen to destroy the alien ships and recover their stolen carrots! Their fate rests in the palm of your hand... well, actually just in your finger, but who’s arguing? <br/><br/>★★★★★ <br/><br/>MAGIC PEN: <br/>Draw lines with your finger to stop enemies moving, rebound bullets, connect stars, and destroy enemies. <br/><br/>52 LEVELS WITHIN 4 THEMED STAGES <br/>Stages range from the relatively simple to the devilishly difficult, each one giving you different challenge, with boss battles along your journey. <br/><br/>NUMEROUS TYPES OF ENEMY <br/>The aliens are on the attack – in groups and formations, each type utilising different skills and abilities, find their weaknesses and destroy them. <br/><br/>HD GRAPHICS <br/>Immerse yourself in stunning HD \"retina display\" graphics <br/><br/>USING SKILL <br/>It's reasonably easy to destroy enemies once you know their weaknesses, but it's still hard to get high scores without making the all-important combos. <br/><br/>ONLINE SCORE CHART INTEGRATION <br/>Compete with friends on both leaderboards and achievements using OpenFeint and/or Game Center. <br/><br/>★★★★★ <br/><br/>If you get any problem of the game,feel free to contact us: <br/>email: info[at]sphinxjoy[dot]com <br/>Thank you for understanding.And enjoy the game! <br/><br/>★★★★★ <br/><br/>▶ http://facebook.com/sphinxgames <br/>▶ http://twitter.com/sphinxgames <br/>▶ http://youtube.com/sphinxgames", "metacritic": null, "released": "2011-09-14", "tba": false, "updated": "2019-08-05T06:04:46", "background_image": "https://media.rawg.io/media/screenshots/8a3/8a30afdbf461547ab8cf91e100c03aae.jpg", "website": "http://www.sphinxjoy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sphinx Entertainment"], "genres": ["Action", "Puzzle"], "publishers": ["Sphinx Entertainment"], "esrb_rating": "Everyone 10+"}