{"id": 359508, "slug": "artbook-story-jigsaw-puzzle", "name": "Artbook Story-Jigsaw Puzzle", "name_original": "Artbook Story-Jigsaw Puzzle", "description": "Match the right polygons, and unlock various stories <br/><br/>A lovely kitty will bring you much joy in your leisure time. <br/>Feed it well and you will get jigsaw pieces in return ~<br/><br/>Artbook Story  is a free brand new jigsaw puzzle game. <br/>It combines art, puzzle, storyline, and pet simulator. <br/><br/>It challenges your focus, helps you better appreciate art, improve your visual memory<br/>The game is free and suits players of all age.<br/><br/>Features:<br/>1\tAbundant jigsaw puzzles and levels of different difficulties that suit all players<br/><br/>2\tRaise your own kitten and get surprising jigsaw pieces <br/><br/>\tFabulous art pictures, click to save easily and share with friends <br/><br/>3\tRelax yourself and experience touching fairytales <br/><br/>4\tBeautiful soundtracks that help you get rid of fatigue<br/><br/>5\tDownload for free, suitable for all players <br/><br/>Create your own artwork, raise your own lovely pet, enjoy the sense of accomplishment, and share with friends, and it’s free to play.<br/><br/>Relaxing yourself in the smoothing music that will boost your energy and get you through your leisure time.<br/><br/><br/>Subscription options<br/>We have the following subscription periods in our game:<br/><br/>1. Weekly VIP offers weekly subscription for $9.99 after 3-day free trial which provides new puzzles every week，unlock all VIP puzzles and removes ADS.<br/><br/>2. Monthly VIP offers monthly subscription for $19.99 which provides new puzzles every week，unlock all VIP puzzles and removes ADS.<br/><br/>3. Yearly VIP offers yearly subscription for $99.99 which provides new puzzles every week，unlock all VIP puzzles and removes ADS.<br/><br/>End of trial and subscription renewal<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039 . When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at dreamowork@sohu.com<br/><br/>Privacy Policy：http://www.cmcm.com/protocol/site/privacy.html<br/>TOS Privacy：http://www.cmcm.com/protocol/site/tos.html", "metacritic": null, "released": "2018-12-04", "tba": false, "updated": "2019-08-05T06:09:29", "background_image": "https://media.rawg.io/media/screenshots/c79/c79d1e9920597d8a0c84413ad28e20c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["People Games"], "genres": ["Puzzle"], "publishers": ["Beijing Kingsoft Cheetah Technology Co"], "esrb_rating": "Everyone 10+"}