{"id": 359580, "slug": "whats-cooking-mama-recipes", "name": "What's Cooking? - Mama Recipes", "name_original": "What's Cooking? - Mama Recipes", "description": "Tie your apron and sharpen your knives – it’s time for a crazy cooking adventure in WHAT'S COOKING? - Tasty Chef! Starting as an amateur cook with a small kitchen, you’ll combine ingredients to create over 1000 recipes and serve delicious dishes to hungry customers. Customize your restaurant, upgrade your kitchen and improve your skills to become the world’s greatest master chef!<br/><br/>WHAT'S COOKING? – TASTY FEATURES<br/>- Combine ingredients to discover and cook 1000+ recipes<br/>- Customize your restaurant and kitchen with unique themes<br/>- Level up your chef to unlock new ingredients and recipes<br/>- Upgrade your kitchen with new equipment<br/>- Visit the market and play mini-games to get common, rare or epic ingredients<br/>- Cook your diners’ favorite dishes for extra rewards!<br/>- Become a master of the kitchen and cook 5-star dishes!<br/><br/>SOURCE THE BEST INGREDIENTS<br/>Part of any chef’s job is to find the highest quality ingredients available! To cook the best dishes you’ll have to visit the market. But there’s a catch - you’ll have to win your ingredients in a card game. You are given 10 attempts to flip over cards and discover the ingredients you want, try not to lose… you need ingredients to cook with!<br/><br/>COOK &amp; DISCOVER OVER 1000 RECIPES<br/>As you level up your chef you’ll unlock delicious new recipes and ingredients to find at the market. With so many combinations available, there are over 1000 amazing dishes to discover! Have fun to combine ingredients and discovering brand new dishes to serve to your hungry restaurant diners.<br/><br/>UPGRADE YOUR RESTAURANT<br/>When you serve delicious food to your restaurant diners, you’ll earn coins – you run a business, after all! Why not spend these coins on upgrading your restaurant and kitchen? Unlock a variety of new kitchen tools to cook faster and better dishes, or customize your restaurant with new themes which give EXP bonuses to certain dishes!<br/><br/>BECOME A MASTER CHEF!<br/>Level up your chef by earning EXP and cooking some amazing food in your bistro, or invest some coins in training. There are a total of 100 levels to master for each ingredient – the more expert levels you have, the better the dish will be! To become the world’s greatest master chef you need to master each ingredient and learn to cook 5-star food – are you ready for the challenge?<br/><br/>READY FOR A CRAZY COOKING ADVENTURE? DOWNLOAD WHAT'S COOKING? - TASTY CHEF TODAY!<br/><br/>Support<br/>Are you having problems? Email us at Support@pixio.co or contact us in game by going to Settings &gt; Help and Support.<br/><br/>Privacy Policy: <br/>http://www.pixio.co/file/PixioPrivacyPolicy.pdf", "metacritic": null, "released": "2018-08-22", "tba": false, "updated": "2019-08-05T06:52:09", "background_image": "https://media.rawg.io/media/screenshots/e02/e0247b72b68efd5d6167c8d3852f1bda.jpg", "website": "https://www.facebook.com/Whats-Cooking-467135367079781/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PIXIO"], "genres": ["Simulation", "Puzzle"], "publishers": ["PIXIO"], "esrb_rating": "Everyone 10+"}