{"id": 359507, "slug": "synthwave-let-ball-dancing", "name": "Synthwave-Let Ball Dancing", "name_original": "Synthwave-Let Ball Dancing", "description": "Energy, music, movement…you are a little ball in a neon world, and you need to keep moving…forward.  Absorb energy as you go to stay alive.  The longer you last the more interesting things get…more complex, great visuals…more exciting.  <br/>Groove to the beat while you work your skills better and better.  Try not to fall; try not to crash; capture fresh energy as fast as you can.  The neon consumes it.  Keep the lights on to find your way forward, further and further, faster and faster. You will be left in the dark without energy, feeling your way to the next energy boost. <br/>Light up your phone fantastic today with this little retro 70’s neon runner ~ how far can you travel in this groovy electric world?!<br/><br/><br/>Game features:<br/>•\tRetro-futuristic settings, more beautiful and exciting the longer you can play<br/>•\tEngaging play with vibrant colors ~ feel the energy you collect!<br/>•\tUnique, with lots of variety after very little game play ~ interesting obstacles and difficult roads make for endless fun!<br/>•\tCool power theme adds intensity to game play, so you can feel the excitement building as you go<br/>•\tMore than a dozen styles of balls, each with a different gaming experience tied to it<br/>•\tGreat variety of music, each tied to a different theme ~ every game is a different trip!", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-08-05T06:09:02", "background_image": "https://media.rawg.io/media/screenshots/559/55991c120a2bf95fea0e62ca62a82338.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AppicPlay"], "genres": ["Action", "Casual"], "publishers": ["AppicPlay"], "esrb_rating": "Everyone 10+"}