{"id": 359671, "slug": "dinosaur-jigsaw-puzzle-games", "name": "Dinosaur Jigsaw Puzzle Games.", "name_original": "Dinosaur Jigsaw Puzzle Games.", "description": "If your kids love Dinosaurs and Jigsaw Puzzles - here is the app they would adore!<br/>Dinosaurs Jigsaw Puzzles is new classical Jigsaw Puzzles solving game for your iPhone, iPad and iPod touch devices and even more! <br/><br/>Inside the game there are 40 great dinosaurs puzzle pictures. Every puzzle can be played multiple times with 11 different sizes from 4 (2x2) pieces up to 144 (12x12) pieces! <br/><br/>This game was specially designed for kids with simple and clean user interface and very intuitive scrolling, drag &amp; drop control of the puzzle pieces, so that even 2 years old kids can play it! <br/><br/>• MAJOR FEATURES <br/>√ Big puzzle area and separate scrollbar with mixed puzzles on the top of the screen <br/>√ Controls placed on the top of the screen to prevent accident tap on them during puzzling <br/>√ Autosave functionality for the last played puzzle, just restart the game to continue <br/>√ Help preview function to light the picture in the background if you will stuck <br/>√ Share solved puzzles on Facebook, Twitter, Sina Weibo and over Email <br/>√ Ambient and positive background music will help you to relax and to get better mood <br/>√ Separate music and sound controls: listen your own music if you would like <br/>√ Universal app which you can play on iPhone, iPad and iPod Touch devices <br/><br/>• YOUR BENEFITS <br/>√ Visual memory training <br/>√ Increasing of short term memory <br/>√ Concentration improvement <br/>√ Developing of the cognitive skills <br/><br/>• Downloading this great Dino Puzzle app now and enjoy all cutest jigsaw puzzles forever :)", "metacritic": null, "released": "2016-11-17", "tba": false, "updated": "2019-08-05T08:01:41", "background_image": "https://media.rawg.io/media/screenshots/29a/29a943e18fed5c75de044ac3449157a1.jpg", "website": "https://itunes.apple.com/us/developer/www-hobbyapps-com/id412491567", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["www.HobbyApps.com"], "genres": ["Board Games", "Puzzle"], "publishers": ["Edvard Arutyunyan"], "esrb_rating": "Everyone 10+"}