{"id": 359701, "slug": "m2-war-of-myth-mech-international", "name": "M2: War of Myth Mech International", "name_original": "M2: War of Myth Mech International", "description": "“Transform into Myth Mechs in fierce battles and slay enemies en masse.” <br/><br/>Compatible with iPhone 4S, iPhone 5, iPad Mini, iPAD 2 or later. <br/><br/>“M2: War of Myth Mech International” is a 3D mini-mecha action game. It integrates gorgeous fighting action and mecha transformations and enables you to become a powerful hero transform into the Myth Mech and overturn the tides of war! You will save the world! <br/><br/>“M2: War of Myth Mech International” is a high-impact game and you will enjoy decimating enemy ranks! <br/><br/>================ <br/><br/>●Background <br/>In the beginning there was the Terra Mainland. The people living on the land were constantly under the threat of violent beasts and powerful floods. A mythic tribe known as the “Deus-sapiens” came down from the heavens helped the people to overcome their difficulties. Thanks to their help, the people were able to establish the technologically advanced “Empire of Zhou”. The Deus-sapiens left the people of the land, and people began to start wars against one another. To escape the flames of war, an ancient tribe from the Mainland left the battle zones and built their Utopia. In the Utopia there was a temple, inside the temple was an ancient Myth Mech. People in the Utopia worshipped it and hoped to stay uninvolved in the Great War. <br/><br/>However, fate is harsh and the tides of war are beginning to swallow the people in Utopia. As the villages of Utopia burns, the Myth Mech begins to resonate with young men and women. As people are dazzled by its glory, it becomes a presence dwelling inside the young heroes... <br/><br/>●Transform into Myth Mech in the heat of the battle and Fight in the Sky <br/>‧As your character grow, he or she will be able to string more combos and defeat massive hordes of invading enemies with fluid and furious attacks. <br/>‧Accumulate energy and call on the Myth Mech, transform into it, fight in the sky and experience Mecha battles thrashing through enemy ranks. <br/>‧By Flying, Myth Mech is not limited to the scene, able to pass though each obstacle and using various strategies to haul and gather the enemies. <br/>‧Humanoid forms and robots have different attack methods, offering various ways of defeating your foes. <br/><br/>●Unique Mech skills <br/>‧Mech is your most valuable companion. In the beginning, you will pilot a humanoid. You will become much stronger when you transform into mech. <br/>‧Different Mechs have different skills. Each skill demonstrates the uniqueness of a Mech, making your way of battle standout from others. <br/>‧Depending on which skill you want to employ, you can collect and pilot different Mechs to use many skills. <br/><br/>●Offering a rich variety of weapons for you to make the strongest Mech possible <br/>‧Many different types of weapons available without complex equipment scheme, powering up your Mech as you like. <br/>‧Choose from many close quarter or distance combat weapons. In addition to hacking and slashing, you can select many types of projectile weapons. <br/>‧You don’t want to spent a lot to power up your Mech? You won’t have to! We offer fair-priced, massive amounts of weapon equipment. Forge your perfect Mech and improve your battle prowess! <br/><br/>●Play the stages FREE and enjoy the satisfaction of taking it out on the enemy hordes <br/>‧You’re the hero that will thwart the tides of war, linked with your Myth Mech, you can save the Empire of Zhou from total destruction. <br/>‧Enter an ancient Mech research facility full of unknown devices and protect the front from being penetrated by the enemy. <br/>‧10 difficult levels with 6 completely different scenes, and fighting off dozens of invading troops. <br/><br/>●Magnificent battle display and dynamic music and sound effects <br/>‧Ancient battle grounds with bright and colorful tones contributing to an already exciting gaming experience. We offer great music and sound effects to give your eyes and ears a treat. <br/>‧Advanced game engine offering you a brand new experience in control, visual and sound effects, ensuring smooth operations for you.", "metacritic": null, "released": "2013-08-06", "tba": false, "updated": "2019-08-05T08:16:09", "background_image": "https://media.rawg.io/media/screenshots/01e/01e00c626d279adfe39bede638c72ca6.jpg", "website": "http://www.facebook.com/M2WebAPP", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["InterServ International"], "genres": ["Action", "Casual"], "publishers": ["InterServ International"], "esrb_rating": "Everyone 10+"}