{"id": 359883, "slug": "drifting-car-racing-extreme", "name": "Drifting Car Racing Extreme", "name_original": "Drifting Car Racing Extreme", "description": "Drifting Car Racing Extreme is a real simulation racing scenarios and the development of a superior quality.<br/>Play Drifting Car Racing Extreme and improve your racing and drifting skills and earn virtual money to tune and customize your car.<br/>Get ready to drive high performance cars  and make them drift at high speed in tracks designed specifically for drift racing.<br/><br/>Are you ready for the best Drifting Car Racing   experience ? You will feel steering with your phone or tablet sensor. And you will feel the best car physics. How well you can use the hand brake? Download \"Drifting Car Racing Extreme \"now for an exciting race to start. <br/><br/>Game Features<br/>- Super-charged action packed motor racing simulator<br/>- Smooth and intuitive motor handling controls<br/>- Extensive customization options: change body color and  tire signature<br/>- Create your favorite models<br/>- Free car racing gameplay.<br/>- Do more stunts to get higher scores and bonus<br/>- Lot of challenges in the different 3d environments stage.<br/><br/>If you like  car racing game,  Drifting Car Racing Extreme is your best choice!<br/><br/>Share with your friends &amp; family and compete your HighScore with them...<br/>Join us on facebook : www.facebook.com/gamingport559<br/>For any suggestion / feedback for further improvements, feel free to contact us at gamingport559@gmail.com..", "metacritic": null, "released": "2017-06-14", "tba": false, "updated": "2019-08-05T10:14:21", "background_image": "https://media.rawg.io/media/screenshots/d58/d58b8751943cda09874032976493c845_7pzgWSf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Racing"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}