{"id": 359899, "slug": "epic-tank-war-battle", "name": "Epic Tank War Battle", "name_original": "Epic Tank War Battle", "description": "In Epic Tank War Battle  get ready to fight the deadliest tank battle of the century in full of monstrous enemy tanks. The rivalry forces have invaded your border with the military tanks and has turned it into battlefield. The enemies are in the ferocious tanks that are loaded with explosive weapons. You being the Tank Commando needs to destroy the deadly beasts in the best way possible.<br/>Your role as a tank commander is clear in Epic Tank War Battle simulation. defeat your enemies with force and strategic decisions! And lead your battalion on a glorious road to victory! <br/><br/>In this game you have to Aim your battle of tanks nozzle towards targets to combat and destroy all enemy tanks battle forces. Don’t look back, keep yourself alive as long as you can to win this war machines tank shooter game and make your country proud. It’s a game of survival. Use the destructive power of your epic tank battle war machine in the best way possible to destroy your enemy. Stop all your enemies with deadly tank bombs and win the breathtaking action tank battle games . Play epic tank war battle and stop enemies tanks.<br/><br/>Choose from a wide range of iconic tanks of the major combatants. Pick the best tank depending on your strategy and blast your way across the battlefield. <br/><br/>Drive army tank action in real time! Drive a military tank and destroy enemy war machines with your tank missiles. Battle tank missions and tank wars is your bread and butter. Feel like army tank commander of the tank fleet and use powerful weapons and armoured tanks for real battle tanks games in super tank fighter massive warfare machine attack game. Experience best of crazy tank. Enjoy army tank driving games with courage.<br/><br/><br/>Share with your friends &amp; family and compete your HighScore with them...<br/>Join us on facebook : www.facebook.com/gamingport559<br/>For any suggestion / feedback for further improvements, feel free to contact us at gamingport559@gmail.com..", "metacritic": null, "released": "2017-09-02", "tba": false, "updated": "2019-08-05T10:23:20", "background_image": "https://media.rawg.io/media/screenshots/a0a/a0abc4c0694c1dc1031adf64debf085a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Action"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}