{"id": 359882, "slug": "lets-play-basketball-3d", "name": "Lets Play Basketball 3D", "name_original": "Lets Play Basketball 3D", "description": "Lets Play Basketball 3D is a challenging game for real basketball lovers. If you are good in throwing basketball and addictive of scoring 2 basket points then do must download this game. Lets Play Basketball 3D is constituent of perfectly tuned physics of throwing basketball with great graphics &amp; game play based on user skills..<br/>Lets Play Basketball 3D is a complete game it will surely make you addictive because of its huge amount of challenges.<br/>Game Features:<br/>Great Graphics great controls great levels and highly addictive game.<br/>Lets Play Basketball 3D consist of great game features.Including 6 modes with different scoring challenges and the modes are :<br/>1 Club<br/>2 Studio<br/>3 Dance Floor<br/>4 Fantasy World<br/>5 Halloween<br/>6 Christmas<br/>Tackle the challenge to unlock the next level.<br/><br/>Each mode contain ten different time challenges and user need to compete with its score to unlock the next level.<br/>1st Challenge is of 45 baskets in required time.<br/>2nd Challenge is of to do 80 baskets in limited time.<br/>3rd Challenge is of to do 125 baskets.<br/>4th Challenge is of to do 170 baskets.<br/>5th Challenge is of to do 220 baskets.<br/>6th Challenge is of to do 250 baskets.<br/>7th Challenge is of to do 300 baskets.<br/>8th Challenge is of 340 baskets.<br/>9th Challenge is of 370 baskets<br/>10th Challenge is of 400 baskets<br/>11th Challenge is of 440 baskets.<br/>How To Play:<br/>Swipe on screen. The swipe will cover an area that will apply a maximum force on ball.<br/>Carefully watch the movement of basket to score the maximum points to unlock the next level.<br/>Play and let your friends and family play this game and challenge your friend with your highest score.<br/>For any suggestion/feedback feel free to contact us at xertzgamestudio@gmail.com<br/>Join us on facebook : www.facebook.com/xertzgamestudio<br/>Visit \"Xertz Game Studio\" official blog : http://xertzgamestudio.blogspot.com<br/>Visit \"Xertz Game Studio\" official website : www.xertzgamestudio.com", "metacritic": null, "released": "2015-05-28", "tba": false, "updated": "2019-08-05T10:13:46", "background_image": "https://media.rawg.io/media/screenshots/b0b/b0bccaf208d08e74808ff6e3410ed5f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Strategy", "Sports"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}