{"id": 359881, "slug": "top-free-car-racing", "name": "Top Free Car Racing", "name_original": "Top Free Car Racing", "description": "Top Free Car Racing is the best arcade racing game available in the App Store. Feel the real experience of car racing with best asphalt racing tracks. Top Free Car Racing is best in rivalry car racing. You will compete against 3 rival cars in the racing track. Top Free Car Racing gives you the best asphalt racing tracks in real and thrilling environments. It will give you the adventurous experience of racing track battle. Enjoy your car racing skills with perfectly tuned car control physics. Select your desired car to start your real racing experience. Top Free Car Racing provides your four different cars to play with. Each car is different in car controlling physics. Get the experience of racing with all available cars. Beat your rival with Turbo Car Racing experience on real asphalt racing tracks in best racing environment.<br/>Game Modes:<br/><br/>Top Free Car Racing has three thrilling gaming modes.<br/>1. Time Attack<br/>2. Sprint <br/>3. Circuit<br/><br/>Time Attack:<br/>In this mode you need to reach the check point in 20 seconds limit. Soon you reach the check point your time will be increased by 20 seconds. In time attack mode you need to stay focus with time parameter to win. Use your driving controls and racing experience precisely . If you fail to reach check point in time you will lose as game will over.<br/><br/>Sprint:<br/>In this mode you will compete with 3 rival cars. They challenge you for one lap battle on your favorite asphalt track. You need to show your speed and control on your car to win this challenge. Be a speed racer and enjoy turbo speed racing challenges.<br/><br/>Circuit:<br/>You have challenge of three laps in this mode. Feel the heat of car racing and show your thrilling skills of speed driver to beat your rivals with your control and turbo speed. Show your controls with best use of asphalt track to win this mode.<br/><br/><br/>Game Environment:<br/>Top Free Car Racing provides you real and best racing environment with asphalt tracks. These environments give you real feel of exciting speed racing.<br/><br/>1.Winterfell Highway: Feel the real experience of turbo speed pursuit driving in thrilling environment of winterfell highway.<br/>2.Sandy Highway: Sandy Highway will give you the best experience of asphalt track car racing in adventurous environment of desert.<br/>3.Breeze Valley: Enjoy the exciting experience of racing in Breeze Valley environment with eye catching scenes.<br/><br/>Game Control:<br/><br/>Top Free Car Racing is loaded with perfect car controls to give you real feelings of speed racing. Control your car like a speed racer. Steering is controlled by accelerometer. Use your device like a steering to get the real feel of car driving. Below mentioned features will help you to control and drive with speed like real speed racer.<br/>1.Acceleration Button<br/>2.Reverse Button <br/>3.Hand-Brake Button<br/>4.NOS Button<br/><br/>So, let’s ride to feel the real heat and excitement of speed racing with Top Free Car Racing.<br/>Note: For better understanding, there is a help menu in Game. You can refer it from there.<br/><br/>For any suggestion/feedback feel free to contact us at support@xertzgamestudio.com<br/>Join us on facebook : www.facebook.com/xertzgamestudio<br/>Visit \"Xertz Game Studio\" official blog : http://xertzgamestudio.blogspot.com<br/>Visit \"Xertz Game Studio\" official website : www.xertzgamestudio.com", "metacritic": null, "released": "2015-11-13", "tba": false, "updated": "2019-08-05T10:12:45", "background_image": "https://media.rawg.io/media/screenshots/a46/a4695c12ccd8cfa260fc11e85e523442.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}