{"id": 359884, "slug": "skater-3d-stunt", "name": "Skater 3D Stunt", "name_original": "Skater 3D Stunt", "description": "Skater 3D Stunts is most amazing, exciting and authentic skateboard game ever in the market. With Skater 3D train yourself to perform Skateboard Stunts accurately. Skater 3D Stunts provides you the best environment of skate park to improve your skating skills. Jump on the board, learn new stunts and improve your skills. Perform your skateboard stunts in time with accuracy to score maximum. Try combos of stunts accurately and earn combo scores. In Skater 3D Stunts you can try Rail Slide, Nose Grind, Kick Flip, Ollie and Kick Flip 360 combos.<br/>Accuracy matters in Skater Stunts, so try to be accurate. Environment of Skater 3D Stunts is a temple of skaters, which gives you maximum skating objects to perform skateboard stunts. Best and addictive skateboarding game for your gadgets/mobile phones.<br/><br/>----- STORY OF GAME -----<br/>Use your skating skills to perform skater stunts in Skater 3D Stunts game. Skater’s Temple provides you perfect and safe environment for performing your skateboard stunts. So show your perfection and expertise in performance of Skateboard Stunts. Perform multiple stunts repeatedly to make combo and score maximum.<br/><br/>----- GAME FEATURES -----<br/>1.Best 3D Skater Park named as Skater Temple.<br/>2.Very friendly and simple game control.<br/>3.Skater Avatar.<br/>4.Awesome Game Play and Graphics.<br/>5.Multiple Skater Animations to perform stunts.<br/>6.Multiple Skating Park objects to perform Skating Stunts.<br/>7.On Screen Stunt Buttons.<br/>8.Available in Market for Free.<br/><br/>----- GAME CONTROLLER -----<br/>Compatible with most game controllers available.<br/>Perfectly tuned physics for skater, to move and to perform stunts accurately. Use navigation button to move your skater character. After getting momentum try on screen stunts Buttons to perform stunts in time and accurately.<br/><br/>----- GAME PLAY -----<br/>Use your navigation button to move your skater character. Try all the skating objects of skate park to perform stunts and show your skating skills. After getting momentum use special stunts of Skater 3D Stunts by using Rail Slide, Nose Grind, kick Flip, Ollie and Kick Flip 360 buttons available on screen. Rail Slide stunt will be performed only near the rails available in skater temple. Rest of the stunts can be performed any time after getting momentum.<br/><br/>For any suggestion/feedback feel free to contact us at support@xertzgamestudio.com<br/>Join us on facebook : www.facebook.com/xertzgamestudio<br/>Visit \"Xertz Game Studio\" official blog : http://xertzgamestudio.blogspot.com<br/>Visit \"Xertz Game Studio\" official website : www.xertzgamestudio.com", "metacritic": null, "released": "2015-10-10", "tba": false, "updated": "2019-08-05T10:15:02", "background_image": "https://media.rawg.io/media/screenshots/cf1/cf1e35e1564b3401107dfc94e9ed3df1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Simulation", "Sports"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}