{"id": 359879, "slug": "hearts-ace-bhabhi-thulla", "name": "Hearts Ace Bhabhi Thulla", "name_original": "Hearts Ace Bhabhi Thulla", "description": "Hearts Ace Bhabhi Thulla is a great game for cards lovers. Hearts Ace Bhabhi Thulla is very addictive and cards loving game. Commonly played in Pakistan,India,Bangladesh,England and United States of America.<br/>The major aim to GET AWAY by playing all cards. And the Looser will be the one who will fail to get away his/her cards and remain holding cards.<br/>In Pakistan,India and Bangladesh game used to call as BHABHI. While in European or rest of the world game is known as GET AWAY.<br/>Hearts Ace Bhabhi Thulla is a complete game it will surely make you addictive because of its huge amount of challenges.<br/><br/>Game Features:<br/>- Great Graphics.<br/>- Great Sound effects.<br/>- Advanced AI.<br/>- Deluxe Game.<br/><br/>MODES:<br/>Hearts Ace Bhabhi Thulla have THREE different modes of Hearts Ace Bhabhi Thulla.<br/><br/>1- Classic Mode:<br/>Each player will get 13 cards and the person who has the Ace of Spade will take his turn first.<br/><br/>2- Challenging Mode:<br/>You will get 16 cards and the rest will get 12 cards each. This will put you in challenging mode to win against all AIs.<br/><br/>3- Pro Mode:<br/>You will get 19 cards and the rest will get 11 cards. Playing condition are even more tougher then the rest of the modes. Here you need to win the game to become a pro.<br/><br/>Winning Rule:<br/>The one who GET AWAY from all his cards will be the winner. And the one who will fail to get away from others will be a looser and commonly known as “BHABHI”<br/><br/>Hearts Ace Bhabhi Thulla is very captivating,super deluxe cards game.<br/>Its a South Asian traditional game.<br/>BHABHI means one’s Brother wife.<br/>BHABHI is a HINDI/URDU word.<br/><br/>Play and let your friends and family play this game and challenge your friend to win the pro mode<br/>For any suggestion/feedback feel free to contact us at xertzgamestudio@gmail.com", "metacritic": null, "released": "2015-07-07", "tba": false, "updated": "2019-08-05T10:11:13", "background_image": "https://media.rawg.io/media/screenshots/bce/bce1f8f30f99f6a76d39d9710869e02b_g68M7tA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Strategy", "Card"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}