{"id": 35995, "slug": "uncharted-waters-online", "name": "Uncharted Waters Online", "name_original": "Uncharted Waters Online", "description": "Voyage across the globe and through the ages, exploring the empty corners of the map. Discover lost civilizations and artefacts, command a lucrative trading fleet, terrorize the seas as a bloodthirsty pirate - the choice is yours!Key Features:<br/><strong>A WORLD OF POSSIBLITIES</strong><br/>Become and Adventurer, Soldier, or Merchant and conquer the seas however you choose! Take on over 75 professions and train over 100 different skills to create your perfect Captain. Each level unlocks new abilities and locations around the world, plus dozens of unique customizations to truly stand out from the crowd.<br/><br/><strong>COMMAND YOUR FLEET</strong><br/>Captain over 500 ships from across history, each with their own specialties and abilities. Helm a nimble exploration ship, a deep-hulled trading vessel, a warship armed to the teeth, or something of your own creation. Each ship has its own set of deep customization options, allowing you to craft the fleet of your dreams.<br/><br/><strong>ACROSS THE GLOBE, THROUGH THE AGES</strong><br/>Experience the historic Golden Age of Exploration in a massive open game world dictated by player actions. Interact with global diplomacy and realistic exchange markets and participate in historical events controlled by a server-wide World Clock that radically impact the game world.<br/><br/><strong>GATHER YOUR CREW</strong><br/>Form a fleet with your friends and strike out on the seas together. Work together to explore the world, complete quests, battle foes, and synergize your skills to make a name for yourselves in the world. You can even open your very own bazaar and exchange with other Captains to expand your trade empire!", "metacritic": null, "released": "2004-10-30", "tba": false, "updated": "2023-11-13T18:03:38", "background_image": "https://media.rawg.io/media/screenshots/de5/de5eed35a3449a376381a307fdb974e7.jpg", "website": "http://global.netmarble.com/uwo/", "rating": 1.75, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 522, "toplay": 2, "dropped": 4}, "playtime": 1, "achievements_count": 50, "ratings_count": 16, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 16, "platforms": ["PC"], "developers": ["Koei Tecmo", "KOEI"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["Tecmo Koei", "Papaya Play"], "esrb_rating": null}