{"id": 359921, "slug": "abyss-itch-mcatin", "name": "Abyss (itch) (MCATIN)", "name_original": "Abyss (itch) (MCATIN)", "description": "<p>Game Overview:</p>\n<p>        The Abyss is a game with a <strong>smooth operating experience</strong>. The originality of this game is from a story, someone wants to clam down and find his beginning of the heart. In modern city life, people often lose themselves dream in a fast-paced life. We want to describe a ball like someone resists all kinds of temptation. It needs to overcome social network、the anxious of life、desire in the depths. And then, we break through obstacles.</p>\n<p>       This game now is in early testing status, so it may have some unfriendly bug for the new player, but we hope after playing a while, The player can get over them.\r\n  </p>\n<p> Control Introduction:</p>\n<p>  1. Players can use the<strong> keyboard and mouse </strong>to operate. Buttons <strong>A</strong> and <strong>D</strong> <strong>control the left and right </strong>movement of the ball to avoid enemies and obstacles. When the left mouse button is pressed, the shield is summoned, and the player enters the bullet time and absorbs the enemy bullet. <strong>The mouse moves to control the orientation of the shield, </strong>release the shield, and the bullet shoots in the direction of the shield to destroy the enemy.</p>\n<p> 2. You can also use the <strong>Xbox controller</strong>. The <strong>left stick controls </strong>the left and right movement of the ball, the <strong>RT calls the shield </strong>and enters the bullet time. At this point, the left stick controls the direction of the shield.\r\n  </p>\n<p>Notes ：\r\n  </p>\n<p>1. The bullet time is<strong> energy-limited</strong>, and the player can respond to the bullet time energy by touching the floor or killing the enemy.\r\n  </p>\n<p>2. The player has a <strong>blood volume limit</strong>, the normal monster attacks a little damage each time, and the sniper tracking monster attacks three damage each time. Players can restore blood volume by killing monsters.\r\n  </p>\n<p>   PS:We made the game's <strong>Easter Eggs </strong>in the customs clearance scene, We hope you can find this interesting level. If you have any questions, you can contact leonmi@yeah.net</p>\n<p> </p>\n<p>Team Members:\r\n  </p>\n<p>Programmer: Chen Shuaiming (CUZ)\r\n  </p>\n<p>Programmer: Yu Cicong (ZJU)\r\n  </p>\n<p>Art Designer: Mi Jintao (CUZ) \r\n  </p>\n<p>Art Designer: Cai Jianing (BUCT)\r\n  </p>\n<p>Art Designer: Zhang Anda (IMMU)\r\n</p>", "metacritic": null, "released": "2019-08-05", "tba": false, "updated": "2019-08-05T13:14:44", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MCATIN"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}