{"id": 359906, "slug": "steves-indubitably-awesome-arcade-adventure", "name": "Steve's Indubitably Awesome Arcade Adventure", "name_original": "Steve's Indubitably Awesome Arcade Adventure", "description": "<p>Steve has worked at “Indubitably Electronics” as a Store Clerk in New England for nearly ten years, when he meets a gentleman that candidly inspires him to change his life and do something he’s passionate about. This gentleman said “Work is for people that don’t play video games!” Steve had been growing tired of the poor treatment he’s received from his young supervisors over the years; toxic people that had no business in leadership roles. When one slip up happens, it all comes crashing down at once and he has to make a decision, one that would change his life! For the best!<br/><br/>            Steve’s always had a love for video games, particularly the golden age of arcades! You know the 1970’s – mid 80’s when the industry was thriving. Steve has a lot of friends in the Classic Arcade Game scene. Many of these people are easy going and all-round interesting; however, you always have a few crazies! For some reason, they’re always just plotting random mischief… Luckily for Steve, he’s been a bit of a hobbyist since he was a teen. Acquiring and fixing arcades has never been an issue; hopefully, this would aid him in his next chapter of life… Still though, it won’t be easy!</p>\n<p>-----------------------------------------------------------------------------------------------------</p>\n<p>Please understand this is a rapid prototype demo. I plan to release the full version in the near future. I just love working on the game so much, it's difficult to say exactly when. It also depends on the feedback I receive here.</p>\n<p>Updates to the project can be found at www.squashedbuggames.com/development-log<br/></p>", "metacritic": null, "released": "2019-08-05", "tba": false, "updated": "2019-08-05T11:00:25", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["squashedbuggames"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}