{"id": 360108, "slug": "croc-creek", "name": "Croc Creek", "name_original": "Croc Creek", "description": "<p><strong>[Submission for GMTKjam 2019]</strong></p>\n<p>You and your bayou brother have found yourselves down a nasty creek with no paddle. Or more importantly, not enough firepower! You and a friend must swap the single shotgun you have to protect yourselves from a legion of nasty alligator-mutants named Chomps. </p>\n<p><strong>Features</strong></p>\n<p>-<em>Only one gun </em>- In your haste, it seems you only brought a single shotgun to fend off the waves of Chomps. Switch the gun between players by throwing it over to them, but be careful. Without the shotgun, you're defenseless against the Chomps.</p>\n<p><em>-Two Players, One Controller</em>- Control for both players have been mapped to a single controller, meaning you and you're friend will have to share a single Xbox 360 or Xbox One controller in order to play (Or for an added challenge, you can control both by yourself!)<br/></p>\n<p>-<em>Hand-drawn 3D Graphics</em>- All textures in the game are hand drawn and mapped to origami-style 3D characters and objects to give a Paper Mario-esque appearance</p>\n<p>-<em>Endless waves of enemies </em>- Green Chompy Chomps will attempt to destroy your raft, giving you less space to navigate while blue Walky Chomps will pursue the player and attempt to damage them. Fend them both off as long as you can!</p>\n<p><strong>How to Play</strong><br/>Player 1's controls have been mapped to the left side of the controller while Player 2's controls are on the right. Goal of the game is to survive as long as possible while waves of Chomps attack both sides of the raft. If one player dies, it's game over.</p>\n<p>Blue Chomps will try to attack the player directly while green Chomps will attempt to destroy one side of the raft piece by piece. Only unarmed players can fix broken pieces by running over to the piece and holding the fire button.</p>\n<p><strong>Controls:</strong></p>\n<p>Left Stick/Right Stick: Move player<br/>Left Trigger/Right Trigger : Fire gun or fix broken raft piece<br/>Left Bumper/Right Bumper: Throw gun</p>\n<p><strong>Credits:</strong><br/></p>\n<p>James Pratt:  Gameplay Programmer<br/>Jesse Baker:  Gameplay Programmer<br/>Rachel Theil: Programmer/Technical Artist<br/>Nathan Powless-Lynes: 3D animator/Sound Designer<br/>Coley Caverly: Level Designer/Texture Artist</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T16:38:05", "background_image": "https://media.rawg.io/media/screenshots/e7c/e7cf8b46f7ef4d3db297ed5f98c8ecd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jpgamedesign"], "genres": ["Action"], "publishers": [], "esrb_rating": null}