{"id": 360304, "slug": "divided-are-we-strong", "name": "Divided are we strong", "name_original": "Divided are we strong", "description": "<p>It seems impossible to win a battle, with only one block of clay at ones. But not for a smart witch or wizard! Their spells may not create, only transmute, divide and infuse already existing matter. Making the clay vessel for the monsters they summon.<br/></p>\n<p>This game was created for the GMTK game jam 2019, which has the theme \"only one\".<br/></p>\n<p>The game is turnbased, you fight against an \"AI\". Each unit may attack and move once each turn. Magic demands, high amounts of concentration, so it can't be used all the time. Watch your SPs(spell points), they're displayed in the top left hand corner and how different actions decrease them varying amounts.<br/></p>\n<p>The <strong>bat </strong>is the fastest creature<br/></p>\n<p>The <strong>lizard </strong>is the strongest creature<br/></p>\n<p>The <strong>snail  </strong>can hit foes from the distance with it's bow<br/></p>\n<p>Watch out, where you place your monsters. Less friendly terrains may be more exhausting to pass, but can also be a hiding place.<br/></p>\n<p><strong>Active unit</strong>: the unit with blinking cursor</p>\n<p><strong>Hovered unit</strong>: unit under mouse cursor</p>\r\nArrow keys<br/>Move camera<br/>1Divide the active unit. The smaller the unit, the more SP it costs.<br/>2Absorb the hovered unit. The smaller the unit, the more SP it costs<br/>3, 4, 5<br/>Transmute active unit into bat, lizard or snail. The smaller the unit the less SP it costs<br/>TabSwitch active unit<br/>EscapeEnd the turn<br/>Click on blue tile<br/>Move active unit<br/>Click on green tintend enemy<br/>Attack", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T17:28:38", "background_image": "https://media.rawg.io/media/screenshots/a55/a55a1654330c8cb8502f39c1493d6b04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kryquono"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}