{"id": 360442, "slug": "einnsamr-the-lone-warrior", "name": "Einnsámr: The Lone Warrior", "name_original": "Einnsámr: The Lone Warrior", "description": "<p>Seeking respite from the barren wastes of a desolate world, a man collapses onto a wooden chair that bends under his weight. He closes his eyes, appreciating the warm, crackling fireplace. The barkeep slams a mug of some dark, foamy drink onto the table next to him, and it rattles the wooden game tiles strewn across the table. Shuttering, the tiles suddenly begin sliding, seeming to move under their own power. They shift around, organizing themselves into a pattern on the game board. Intrigued, the man selects a tile and moves it...</p>\r\nInstructions\r\n<p>Einnsámr is a game about preserving your soul. You can “possess” a single tile at a time, and are able to either move it, or transfer your soul to another tile. After you move or possess a tile, all the other tiles will move, following their respective movement rules. When a tile moves into another tile, the latter tile is broken and disappears from the game board. Your objective is to be the last tile remaining on the game board.</p>\n<p>Click and drag your active tile to move it.<br/>Click on any tile to possess it.<br/>Press R to restart the current level.</p>\r\nThe Tiles\r\n<p>Knight - This tile can move one space in any cardinal direction.<br/>Serpent - This tile can move one space in any diagonal direction, but cannot move through other tiles to get there.<br/>Sword &amp; Shield - This tile can move any number of spaces in the directions its swords are facing, until it reaches the edge of the board or hits an object.</p>\n\n<p>---<br/></p>\r\n🌱 A game by @madgvox and @neilquillen", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T18:05:07", "background_image": "https://media.rawg.io/media/screenshots/fcb/fcb9799c8770c1fc20b73a70fbfb9745.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad", "Neil"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}