{"id": 360743, "slug": "its-rude-to-point", "name": "It's Rude To Point", "name_original": "It's Rude To Point", "description": "<p>Is it rude to point? To direct your index finger in such a manner that its straightforwardness cuts effortlessly through all layers of one's personal security and comfort?</p>\n<p>A recent survey answered by 4 voters shows that 75% of voters say yes, while another 25% also say yes. You can't deny the strong opinions of 4 voters, that's practically representative of the entire human population!<br/>Plus, it's not confirmation bias at work or anything, because it's hardly evidence anyways.</p>\n<p>But what can you do if pointing your finger is the only way to get by in life? If every single part of your body was rendered immobile, except for your index finger? If it were the only effective means of communication in a world made deaf by ideologues who think they can triumph over their opponents by shouting louder than them? Would it then be not rude to point?<br/>I'm guessing you've never thought about that, because frankly we hadn't either. <br/>But that's what this game is for! To answer this age old question of whether or not it is rude to point.<br/>(And also to participate in some silly game jam by some guy named Mark Brown.)</p>\n<p>It's Rude To Point is a tactile menagerie of point-and-click action minigames, all of which revolve around the use of a single on-screen finger. Your finger can do a lot of things: grab onto objects, flick them away, and even spin around to do some 360-degree pointing. Simply survive as long as you can with just your finger, while the minigames only get harder and faster!</p>\n\n<p><strong>Controls:</strong></p>\n<ul><li>Left Click to Grab</li><li>Right Click to Flick</li><li>Scroll Wheel to Rotate</li></ul>\n<p><strong>For an extra challenge, try playing the game using only one finger!</strong><br/></p>\n\n<p><strong>Credits:</strong></p>\n<p>64BitPandas</p>\n<p>Epicrider</p>\n<p>xKindredKinesis</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T19:23:15", "background_image": "https://media.rawg.io/media/screenshots/bec/bec28aabbb6de0ead3eb5e656d47e845.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["64bitpandas"], "genres": ["Action"], "publishers": [], "esrb_rating": null}