{"id": 361000, "slug": "cavern-of-cards", "name": "Cavern of Cards", "name_original": "Cavern of Cards", "description": "<p><strong>NOTE: Please run this game in fullscreen mode!</strong></p><p>A bullet-hell shoot-’em-up with only one boss. Take them down all their forms in one run! Between phases you get to pick cards which can have a range of helpful or hindering effects, but choose wisely: you can only pick one!</p>\n<p><strong>Controls:<br/></strong>- WASD: Move<br/>- Space: Shoot/Select/Continue</p>\n<p><strong>Tips: <br/>- </strong>Each card has a Player modifier, a Hazard modifier, and a Cosmetic modifier.<br/><strong>- </strong>There's no way to see if a modifier is positive or negative, you'll just have to see when you pick it!<br/>- The ranking of the card (indicated by border color - bronze is lowest, and gold is highest) indicates how powerful its modifiers are. But be warned, this affects negative ones too!<br/><strong>- </strong>If at first you can't select any of the cards, click on one to highlight it<br/>- We ran out of time to implement certain modifiers.</p>\n<p><strong>Theme:<br/></strong>This was made in 48 hours in Unity for the GMTK Game Jam 2019. This game ties into the theme of “only one” in several ways:<br/>- The only enemy in the game is a single boss<br/>- The player can pick only one card at a time<br/>- To win, the game must be completed in one run without dying, as there are no checkpoints.</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-28T23:14:51", "background_image": "https://media.rawg.io/media/screenshots/1d5/1d5e3b74ce90675d1ad44eb123bd0453.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jusiv", "Mantaray", "puddlejamper"], "genres": ["Action"], "publishers": [], "esrb_rating": null}