{"id": 361088, "slug": "one-in-the-chamber-egzyst", "name": "One in the Chamber (EgzysT)", "name_original": "One in the Chamber (EgzysT)", "description": "One in the Chamber\r\nThis chamber is not big enough for the both of us, and between the two of us, there's only one bullet.\r\n<p>This game is a 2D local-multiplayer top-down-shooter but where both players will share just <strong>one bullet</strong>.  Each Player also picks a color from 3 possibilities, and in order to kill the enemy, you must fire a bullet in the color opposite to your own.</p>\n\r\nShared Bullet:\r\n<p>This means that if your opponent shoots before you do, you won't be able to fire until that bullet leaves the screen or hits you. Rhythm becomes a necessity if you want to be the first one to fire. But be careful, as an early fire will block you from firing temporarily, giving your opponent time to line up a shot.</p>\n\r\nColor Combat:\r\n<p>Also, each player can wear one of 3 colors: Player 1 will have the 3 primary colors (Blue and Yellow and Red) and Player 2 will have the 3 secondary ones (Green, Purple and Orange).</p>\n\n<p>If a player wants to kill the opponent, the player must wear the color opposite to the enemy, however the player must be aware that this will make himself vulnerable to an enemy shot. This will lead to crazy color changing, having a high skill ceiling in reflexes and timing.</p>\n<p>Therefore, the pairs of colors that can kill each other are: Blue - Orange, Yellow - Purple and Red - Green. If a different combination is used the bullet will become available to be shot again by both players.</p>\n\r\nControls:\r\n<p>Both players will play in the same keyboard.</p>\n<p><em>Player 1 Controls:</em></p>\n<p>WASD - Movement Keys</p>\n<p>Q - Fire</p>\n<p>1, 2 and 3 - Change color to Blue, Yellow and Red respectively.</p>\n<p><em>Player 2 Controls:</em></p>\n<p>IJKL - Movement Keys</p>\n<p>O - Fire</p>\n<p>8, 9 and 0 - Change color to Green, Purple and Orange respectively.</p>\n\r\nCredits:\r\n<p>This game was a solo project by Ricardo Teixeira.</p>\n<p>Other Assets Used:</p>\n<ul><li>Last Energy For The Day by Loyalty Freak Music</li><li>Advanced Pixel 7 Font by Style-7<br/>\n</li><li>Error.wav by Artistic Lucario</li><li>Reload 3 by pumodi</li><li>fire shot.wav by JavierZumer</li><li>small boom by ProjectsU012</li></ul>\n\r\nKnown Issues:\r\n<ul><li>The keyboard controls are a bit cramped, and a different control scheme might have been better.</li><li>Cowardly Players can keep the same \"non-threatening\" colors. A possibility would be to make players randomly change color if they stay in the same one for to long.</li><li>Colorblind players have problems distinguishing certain colors, and I thought about using a color coding system, such as ColorADD, however I did not receive permission to use this system on time.</li></ul>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-28T23:14:51", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c0b60527fc1df5bac1b98390cc2f9e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["EgzysT"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}