{"id": 361193, "slug": "flight-of-the-electrodud", "name": "Flight Of The Electrodud", "name_original": "Flight Of The Electrodud", "description": "WARNING: This game does contain flashing lights, and may not be suitable for those with photosensitive epilepsy or similar conditions.\r\nControls:\r\n<ul><li>Enter/Spacebar: Flip electrodud charge.</li><li>Tab: Toggle screenshake (menu only).</li></ul>\r\nFeatures:\r\n<ul><li>Come along for the ride on this<strong> not-so-endless runner</strong> as <strong>I reduce my former High School Physics teachers to tears</strong> with this game.</li><li><strong>Live a moment</strong> in the life of an <strong>electrodud</strong>, the <strong>definitely real particle</strong> that is <strong>definitely the force behind electricity</strong>, definitely.</li><li><strong>Win </strong>in one of <strong>two ways</strong> - <strong>survive</strong> for <strong>one minute</strong>, or go wild enough to <strong>produce</strong> <strong>one volt</strong> of electricity.</li><li><strong>Die</strong> in one of <strong>two ways</strong> - <strong>404</strong> or <strong>421</strong>.</li><li><strong>T H O O M</strong>.</li></ul>\r\nDescription:\r\n<p>You are observing and manipulating an electrodud.</p>\n<p>What is an electrodud? Why, only the most useful and completely real particle in all of physics! Heck, the Higgs Boson has nothing on an electrodud! It's an integral part of what makes electricity work, didn't you know? It does all the usual physics-y things, like being attracted to things with an opposite charge.</p>\n<p>But there's more! It also has a strange level of control over where it goes - as long as it has a charge, it can flip to the opposite charge at will! However, this comes with a lot of risk. For one, when it has no charge (faithfully represented by it being airborne, there being an absence of colour in it, and having a giant \"X\" in its centre), it cannot flip the charge again until it lands. This also means that it is all too easy for this particle to fly out of the observation space, and if it does, we have to reboot the whole dang thing. Similarly, if the electrodud hits a \"wall\" while it has no charge, it's a goner, and we have to reboot the observation space. Sorry, it sucks, but I only have one electrodud isolated for this thing.</p>\n<p>So what's your goal here? Well, you can do only one thing - flip the electrodud's charge - and you can win in only one of two ways at any given time. The most popular choice is to just keep the electrodud \"alive\" for one full minute. Why only one minute? Hey, this technology is expensive, if you're not gonna generate electricity with it, our bill will be through the roof. I'm a broke College student. I ain't got that money to spare, catch my drift?</p>\n<p>The other option? Well, you see, every time the electrodud experiences impact from attraction, it generates 0.01 volts of electricity. It's not much, I know, but hear me out. If you can generate me one volt of electricity before time runs out, I'll be super thankful for it. And, real talk, I've only managed to do that a couple of times myself. It's not easy. </p>\n<p>Anyways, I think that's all you really need to know. Have fun, and try not to break my equipment! Oh, but if it does break, let me know - I'll fix it, and I'll blame it on the electrodud. That way you won't get into trouble with my superiors.</p>\n<p>P.S.: Time and space is dilated in this game. Your observation of this survival over a one-minute time span is actually taking place on a molecular level, and over a fraction of a fraction of a <em>fraction</em> of a second. However, I took the liberty of bending the time-space continuum to allow you to observe and participate in this \"electrodud empathy (dudpathy)\" experiment at a scale you are more comfortable with. You're welcome.</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-28T23:14:50", "background_image": "https://media.rawg.io/media/screenshots/d8c/d8cf4ef326ea18b1ffe7587122cfb31e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jordan Han"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}