{"id": 361283, "slug": "groundless-itch-2015marci12", "name": "Groundless (itch) (2015marci12)", "name_original": "Groundless (itch) (2015marci12)", "description": "<p>This project was made for 2019's GMTK GameJam.</p>\n<p>The game was made as a proof of concept, and intended to test my ability to make a game in 48 hours. Well, apart from a \"few\" technical difficulties, and the lack of end goal in the game itself, and so on... it turned out fine. Still, as I don't want to waste 2 days of work, I submitted it, as you might have guessed.</p>\n<p>In the game, thre is not really much to do. your goal is to progress right. There is one complication though: there is <strong>only one platform</strong> for you to stand on. This platform doubles as your healthbar, meaning if you touch a grey block, it will decrease in size. You can be hit 3 times before it dissapears, and the only level (hah, another thing there is only one of... I did not intend that...) resets. To the very beginning. This will also be the case if you fall down.</p>\n<p>Touching the red orbs will move the platform just under them. They can only be activated once, indicated by them turning yellow. Once you activate the rightmost orb, consider the game beaten... yeah...</p>\n\n<p>While I'm not happy with the final product, this jam has been a great learning experience for me. Even though I couldn't figure out a way to efficiently automate the level loading, making a longer game impossible, I made something playable... which is more than I could have hoped for a month ago. But hey, at least my physics engine performed alright!</p>\n<p>Thank you Mark for hosting this jam. Thank you for motivating so many people to create games.</p>\n<p>-Marcell</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T21:58:36", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ffb90aa4c8cbd239ad31acd95410be8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2015marci12"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}