{"id": 361357, "slug": "guide-merlin-into-the-kingdom", "name": "Guide Merlin inTo the Kingdom", "name_original": "Guide Merlin inTo the Kingdom", "description": "Welcometh to Albion<p>Merlin, our lands are populated with a bunch of lovely people.<br/></p><p>However, we lack a ruler and we need to find the one and <em>only one</em> person that shall be able to unify our lands !</p><p>Speak to the inhabitants, those gents shall give you useful hints about his attire, his looks, his position and his favorite colors, then, you will be able to designate that person as our new ruler !</p>How to play<p>Use the<strong> left mouse</strong> button to go through the dialogs.</p><p>Use the <strong>left mouse</strong> button in the gameplay to click on a person to get a hint.</p><p>Use the <strong>right mouse </strong>button in the gameplay to designate a person as the ruler. Be careful, designating a wrong person will result in his death for no reason.</p>It's a jam product<p>The game was designed in 48 hours for the GMTK Game Jam 2019. This year, the theme was simply \"<em>Only One</em>\". I built this game around the concept of finding the only one person that fits his description. </p><p>The game uses colors and I'm sorry for every colorblind people that won't be able to fully enjoy the game. I haven't had the time to make a colorblind-mode.</p><p>As a side note, the game uses weird old-english for comedic purposes, it makes the hints harder to understand, but I think it's also a part of the game. There's no time limit to read the text so feel free go through the internet to get help. I made use of this tool to help me translate it : https://lingojam.com/EnglishtoShakespearean</p>Technical notes<p>Each game is different, there are 102 characters on screen and each time the <em>only one</em> is another person. Every person is procedurally generated and depending on what he is wearing, the hints also change.</p><p>The game was developped with the Monogame Framework in c# with Visual Studio 2019.</p><p>The music is The Old Tower Inn by <strong>RandomMind</strong></p>End note<p>Thanks for playing. I hope you enjoyed this silly game, feel free to comment anything and to rate the game, it helps me on my future projects !</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T22:17:20", "background_image": "https://media.rawg.io/media/screenshots/221/221e271cb691cd10422d54d1ad560cc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quentin Delvallet"], "genres": [], "publishers": [], "esrb_rating": null}