{"id": 361493, "slug": "cool-chefs-super-burger-flipping-experience-deluxe", "name": "Cool Chef's Super Burger Flipping Experience Deluxe: Game of the year Edition", "name_original": "Cool Chef's Super Burger Flipping Experience Deluxe: Game of the year Edition", "description": "<p><strong>DESCRIPTION</strong><br/></p>\n<p>cool chef's super burger flipping experience deluxe game of the year edition is the best rhythm game in the entire world and maybe even the best game overall in the entire world, it is the highest peak of gaming, with graphics far surpassing AAA games, a beautiful soundtrack consisting of one single recorder we got at second grade. our team of three people who have no experience in game development, music production or game jams at all has created the best gaming experience in human kind.</p>\n<p><strong>LORE</strong></p>\n<p>the deep lore of cool chef's super burger flipping experience deluxe features many diverse characters like for example: </p>\n<p>cool chef - big title man with game</p>\n<p>burger boy - boy of burger</p>\n<p>barack obama - 44th president of the united states and a big fan of cool chef's super burger flipping experience  deluxe game of the year edition</p>\n<p><strong>GAMEPLAY</strong><br/></p>\n<p>the game itself is very complex and is very hard to master. on every level you will be tasked to flip burgers to the rhythm of the song by pressing the spacebar.</p>\n<p>the game only has two levels with one easy-ish level and one hard level</p>\n<p><strong>GAMEJAM</strong><br/></p>\n<p>the gamejam this game is related to is the only one gamejam and before you ask yourself why well its because its only one button which im pretty sure counts so yeah</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-05T22:53:18", "background_image": "https://media.rawg.io/media/screenshots/a74/a74ec3115441b88acee7bef704f5833e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["webster", "ilayabr", "Konata_chan"], "genres": [], "publishers": [], "esrb_rating": null}