{"id": 361652, "slug": "the-only-man-and-the-sea", "name": "The Only Man and the Sea", "name_original": "The Only Man and the Sea", "description": "<p>The plot of the game is losely based on the novel \"The Old Man and the Sea\", written by E. Hemmingway in 1951. You are an old man that aims to catch a marlin, but there is only one remaining bait. <br/></p>\n<p>The objective of the game is to catch the marlin, avoiding all the other sea creatures. If you miss, the marlin will come back after a while, but be cautious...</p>\n<p>This game has been presented to the GMTK jam 2019! The topic of the jam is \"Only one\". We fulfill the topic in the following aspects:</p>\n<p>- The game is controlled with only one key, to make the bait go a bit up.</p>\n<p>- There is only one bait. If you fail, you have to start from the beginning.</p>\n<p>- There is only one marlin that you must catch in order to win.</p>\n<p>Have fun! ~ <br/></p>\n<p><em>Note that the game is fully playable on mobile -there several graphical issues due to the resolution, but it should be possible to play just by tapping the screen.<br/></em></p>\n<p><em><strong>Troubleshooting:</strong> the game should run on any browser, but looks like Chrome has some difficulties. The music can be buggy sometimes... The native (WIn/Linux) versions should be free of errors. <br/></em></p>\n<p><em>If you receive an abort(114) ASSERT error, try changing the configuration of the cookies in your browser. In Firefox, going to about:preferences#privacy and unlocking cookies solves the problem.</em><br/></p>\n<p><strong>If you like the game, you can contact us!</strong></p>\n<p>BuendiaGames is a pair of brothers making games.<strong> Victor Seven</strong> (Twitter, Instagram) and <strong>Mapachana</strong> (Twitter, Instagram). <br/>We both helped in programming. <strong>Victor composed the music!</strong></p>\n<p>We had the help of two nice friends. Elena <strong>made all the wonderful art</strong> you see here, and <strong>JJRamos</strong> <strong>helped with the coding!</strong></p>\n<p>The code of the game is free and hosted in GitHub, powered by Godot Engine! :D<br/></p>\n<p><strong>LICENSE:</strong></p>\n<p>The code of the game is licensed under GPLv3.</p>\n<p>Art by Elenoide, licensed by Attribution-NonCommercial 4.0 International (CC BY-NC 4.0).</p><p>Music by Victor Seven, licensed by Attribution-NonCommercial 4.0 International (CC BY-NC 4.0).<br/></p>\n<p>For more details see the GitHub page.<br/></p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-28T23:14:46", "background_image": "https://media.rawg.io/media/screenshots/910/910434d440e299fc734ac39300e86012.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["BuendiaGames"], "genres": [], "publishers": [], "esrb_rating": null}