{"id": 362185, "slug": "best-life-simulator-itch", "name": "Best Life Simulator (itch)", "name_original": "Best Life Simulator (itch)", "description": "<p>In the Best Life Simulator (BLS) you have to go through a life-course through the entire social ladder. It all begins with a homeless person who constantly balances between life and death, fights with hunger, cold, illness, and ends with a multimillionaire with his own palace, plane and many other things.</p>\n<p>\r\n Best Life Simulator has a fairly large range of features that will accompany You throughout the entire process. With each new level new features are opened, it becomes more interesting and interesting to play. Get Your education, get a job, become an athlete, go to the store, buy the food You like, treat Your character from various illnesses and this is just a small part of all that You can do in Best Life Simulator!\r\n  Facilitate Your life and set easy level of difficulty, and for lovers of hot feelings we already have a difficult level, for passing which You will receive a bonus SH (super hard) level. The best gamers in the world are panicking from BLS SH. Do You think that You will be able to withstand a real hardship? Then go ahead!\r\n  \r\n  </p>\n<p>The game is full of interesting things. You should try it all. \r\n  </p>\n<p>You have a garbage, a bench, a street, a transition, a shop, a school, a parking lot and an office to look for. There you may encounter such things as bottles, cardboard, board, nails, sack, glue, broken radio, plasticine, lighter, broken toy, magnet and broken watch. Use it for your own purposes, for example, simply sell, save on a \"black day\" or make it yourself, using a bench and tools, things like a box, a rope, a plasticine dinosaur and a car, a toy, a stool, a box, a curb, a book about coins, watches, compass, radio. \r\n  </p>\n<p>Profession enough: a cleaner, a distributor of advertising, a fuser, a loader, a guard, a driver, a firefighter, a rescuer, an ophthalmologist, a hairdresser, a translator, a journalist, a lawyer, a programmer, a politician, a dentist, each of them has career growth and positions. \r\n  </p>\n<p>The food is your choice, in the store you can buy a cucumber, a sandwich, a baton, a pizza, a yogurt, a cake, an egg, grapes, a tomato, an apple, a meat, a cake. \r\n  </p>\n<p>Clothes for you will always be found; in the shop there are ordinary clothes, beautiful clothes, old coats, jacket, winter clothes, work suit, shorts, running suit, sports suit, jacket, black suit, white suit. \r\n  </p>\n<p>For lovers of transport, we have a skateboard, a bicycle, an old car, an ordinary car, a pickup, a microcard, a jeep, a convertible, a sports car, a supercar, a helicopter on an even airplane. \r\n  </p>\n<p>Casino can be especially interesting for you: bets, tokens, lottery tickets. You never know what's ahead: victory or defeat, how lucky. \r\n  </p>\n<p>From the real estate there are rooms in the hostel, but the apartments in the high-rise building, as well as in the rural zone, you can build a shed, cottage, cottage, villa and even a palace. \r\n  There are many interesting things, but we will not reveal all the secrets.</p>\n\n<p>We wish you a great time to play!</p>", "metacritic": null, "released": "2019-08-03", "tba": false, "updated": "2019-08-06T02:03:39", "background_image": "https://media.rawg.io/media/screenshots/b41/b41c5ea7597c45fe715b4f5a84dff367.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Balance Company"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}