{"id": 362147, "slug": "budget-buster", "name": "Budget Buster", "name_original": "Budget Buster", "description": "<p>The 80s were a simpler time. Everything was one of four shades of green, and Bill Murray was kicking poltergeist ass on the regular.</p>\n<p>That's my understanding, anyway.</p>\n<p><strong>Budget Buster</strong> is a blast from the past, a Game Boy game about sending lost souls back to hell where they belong. Unfortunately, your equipment isn't exactly top-notch. Lock onto a ghost to make them visible, but be warned: You can only lock onto one ghost at a time, and invisible ghosts are still very much lethal to the touch.<br/></p>\n<p>When I say \"Game Boy game\", I mean it! It's easy to make a game inspired by the Game Boy, with the same restricted colour palette and 160x144 resolution. This isn't that. This is an honest-to-goodness, hand-crafted ROM for the Nintendo Game Boy. It can be played in any sufficiently accurate Game Boy emulator or, if you have a flash cart, on real hardware! (If you try this, let me know how it goes! I don't actually have a Game Boy to test with, but BGB is incredibly accurate and it should work fine.)</p>\n<p><strong>Controls</strong><br/></p>\n<p><strong>D-Pad</strong> - Move<br/><strong>B</strong> - Switch to a new ghost, making them visible<br/><strong>A</strong> - Shoot<br/></p>\n<p><strong>Start</strong> - Play again after a Game Over<br/><strong>B+Select+Up</strong> - From the Game Over screen, delete your saved high score<br/></p>\n<p><strong>Tips</strong><br/></p>\n<ul><li>Ghosts always spawn on the edge of the screen. Try to avoid staying near there for too long!</li><li>Neither you or your bullets can travel through solid objects. But ghosts can! Don't get too comfy when your back is against a literal wall.</li><li>Hold down <strong>A</strong> to move around without changing direction. Perfect for the classic Spray n' Pray.</li><li>Switch early, switch often! You want to know where as many ghosts are as you can, but make sure to remember what you saw...</li><li>Ghosts aren't clever! They always move directly towards you. Use this to predict their movement while locked onto another ghost.</li><li>You can't see ghosts you aren't locked onto, but when they die, you can certainly hear them! When you shoot a ghost that isn't visible, it'll play the sound effect all the same. Use this to your advantage to determine when you're safe.</li></ul>\n<p>Budget Buster is open source!</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-06T01:51:03", "background_image": "https://media.rawg.io/media/screenshots/c93/c9311fd7a195eef173852224c616af8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["undergroundmonorail"], "genres": ["Action"], "publishers": [], "esrb_rating": null}