{"id": 362111, "slug": "tankroids-wip", "name": "Tankroids (WIP)", "name_original": "Tankroids (WIP)", "description": "<p>This game in its current state was developed in 1 week as part of DSOP's July Game Jam.<br/><br/>This game was built for an arcade cabinet that has 4 sticks and 3 buttons per stick. My intention was to make a competitive game that plays a bit like Atari's Asteroids but with a level a bit closer to Atari's Tank.<br/><br/>I used @Kenney assets for most of the game. A DSOP member donated some sounds (WIP). The metal backgrounds came from FreePBR.com.  The Hazard strips came from here.</p>\n<p>I am currently developing a dedicated server that will let people connect and just brawl. After that, I will likely move on to a different project.</p>\n<p>I feel like I learned a lot about myself on this project. I proved to myself that I can get a project done if I set my goals correctly and a really push into it. However, I believe this game was designed with some unrealistic constraints (arcade cabinet, game jam time limit, day job) and does not make sense for a long term project. I think I can a better game for a more traditional platform.\r\n</p>\n<p>Right now I'm adding networked multiplayer, once again, so that I can prove to myself that I can do it. Once that is working well enough, I'll abandon the project. (unless for some bizarre reason the project becomes <strong>crazy</strong> popular and I can justify spending full time on it)</p>", "metacritic": null, "released": "2019-08-04", "tba": false, "updated": "2019-08-06T01:39:44", "background_image": "https://media.rawg.io/media/screenshots/6aa/6aa893e54d5c41521226f67d091d1d9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["greenf0x"], "genres": ["Action"], "publishers": [], "esrb_rating": null}