{"id": 362477, "slug": "teddybum-shoot-fish-cartoon-adventure-kids-game-be", "name": "TeddyBum Shoot Fish - Cartoon Adventure Kids Game. Best and simple games for parents, boys, girls, and kids 3+, 5+, 6+.", "name_original": "TeddyBum Shoot Fish - Cartoon Adventure Kids Game. Best and simple games for parents, boys, girls, and kids 3+, 5+, 6+.", "description": "<p>Cartoon shooter adventure game for kids 3+, and families. It is a funny run and jump, shoot to enemies with fish and collect coins funny cartoon kids game. The gameplay is interesting to enjoy time for kids, or kids together with parents when bored or if kids like the cartoons. It is good for boys and also for the girls. The reaction and skill developing, very colorful action game to play in family with kids (age restriction 3+). The best and simple gameplay for cartoonish games for children.  Either with family to spend happy time or for kids to enjoy leisure time, families will enjoy and be happy with colorful cartoon game design, and simple user-friendly controls. For parents, families or kids to entertain the game play, and to enjoy leisure time when kids playing attractive and skills developing game. \r\n</p>\n<p> \r\n</p>\n<p>Do you like cartoons from time when you were a child then enjoy the game with your kids. Or you are child and fond of cartoons, of running, of jumping, of collecting coins, of shooting on enemies with fish? Then families, along with kids will be crazy happy with this cool and funny cartoonish style game for families, game for kids. Go through all 100 colorful levels, run and jump, collect coins, shoot fish to enemies. \r\n</p>\n<p> \r\n</p>\n<p>The enemies are different. Run and jump right to see the cartoonish style enemies. The gameplay is user friendly and simple. Push left or right green buttons with arrows on the left of the game screen to move. Push green button with arrow on the right of the game screen to jump. Push green once for teddy hero to jump once, and push green twice to double jump.\r\n</p>\n<p> \r\n</p>\n<p>Enemies if teddy hero is close enough shoot and some of them run after teddy. Teddy runs left and enemies stop to shoot if far enough. Teddy bear controls how to shoot fish: direction and power. Push orange up and orange down buttons with arrows on the left of game screen to control the shoot with fish to enemies direction. Push orange button with fish inside on the right of the game screen to control the fish shoot power. Hold orange button with cartoon fish inside to shoot fish with more power. Enemies have health bars. When teddy hero shoots with cartoon fish to enemies, then on collision fish explodes. Enemy health bar shows damage to enemy. Teddy hero shoots with fish until enemy explodes. When cartoonish enemy explodes score added on the right of the game screen. \r\n</p>\n<p> \r\n</p>\n<p>Teddy bear also collects coins. Boys and girls like to collect coins in games designed for families. Teddy hero shoots by fish to coins or jumps to collect coins in this adventure game. \r\n</p>\n<p> \r\n</p>\n<p>TeddyBum Shoot Fish adventurous journey features:\r\n</p>\n<p> \r\n</p>\n<p>– no Ads\r\n</p>\n<p>– interesting adventures for kids and parents when bored and to kill time\r\n</p>\n<p>– interesting to play and have fun with boys and girls\r\n</p>\n<p>– simple and colorful touch game controls\r\n</p>\n<p>– attractive gameplay for game for kids, families (age restriction 3+) \r\n</p>\n<p>– camera zoom when teddy hero moves\r\n</p>\n<p>– orange action buttons: aim and shoot fish \r\n</p>\n<p>– green movement buttons: teddy hero jump, run right, and left\r\n</p>\n<p>– easy to play and user-friendly interface\r\n</p>\n<p>– funny and colorful jungle cartoon style\r\n</p>\n<p>– addictive nature waterfall and jungle sounds \r\n</p>\n<p>– exotic monkey jungle music through jungle adventures\r\n</p>\n<p>– nice colorful animations and in-game graphics\r\n</p>\n<p>– leisure and bored time spender toy \r\n</p>\n<p>– 100 levels of interesting and attractive gameplay\r\n</p>\n<p> \r\n</p>\n<p>Families, kids (age restriction 3+), and parents, if you like cartoons from time when you were a child, have fun, enjoy adventures, develop skills and reaction!! Kill the time when bored!! Enjoy the game on leisure time!! Aim and shoot fish to collect coins or defeat enemies!!\r\n</p>\n<p> \r\nWe welcome reviews and feedback for this adventures action game app from all around the world as we appreciate your opinion. It will assist us in further improvement of – TeddyBum Shoot Fish game to play app.</p>", "metacritic": null, "released": "2019-08-01", "tba": false, "updated": "2019-08-06T03:29:59", "background_image": "https://media.rawg.io/media/screenshots/932/932a89b2c05310e5a7653f7e2244acba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["aarto999"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}