{"id": 362802, "slug": "pirates-of-everseas", "name": "Pirates of Everseas", "name_original": "Pirates of Everseas", "description": "Ahoy, Captain! Embark on an epic pirate adventure to become a king of the untamed waters!<br/>\n<br/>\r\nForge a seafaring, swashbuckling empire in Pirates of Everseas! Develop your kingdom, construct ships, explore the open sea and battle enemies for domination in this exciting strategy game!<br/>\n<br/>\r\nBUILD A POWERFUL CITY<br/>\r\nManage your resources to design and build a thriving city. Use strategy to expand your kingdom as you plunder for loot. Prepare a strong foundation for your future empire.<br/>\n<br/>\r\nDEVELOP AN UNSTOPPABLE NAVY<br/>\r\nCustomize your pirate ships with loads of weapons! Build multiple fleets and upgrade them for a domination in battle. Attack the ships of your rivals and plunder their wrecks to fund further growth of your empire.<br/>\n<br/>\r\nRAID FOR RESOURCES<br/>\r\nPlan your strategy and attack rival islands and ships to obtain goods, treasures and weapons. Battle sea monsters and explore shipwrecks for even more booty. But beware - other players are ready to attack you at any moment and take your loot.<br/>\n<br/>\r\nFORGE BATTLE ALLIANCES<br/>\r\nFor strength in numbers, join or lead other players. Build your domination over the oceans through battles and strategy!<br/>\n<br/>\r\nForge powerful alliances, embark on your ships and plunder for loot. Raise your kingdom's black flag and assure your domination over the seas!<br/>\n<br/>\r\nGame features:<br/>\r\n- Addictive MMO gameplay<br/>\r\n- Battle with millions of other players and steal their loot for your kingdom<br/>\r\n- Protect your empire with powerful weapons<br/>\r\n- Rise through the levels and become the King of the Pirates", "metacritic": null, "released": "2019-08-12", "tba": false, "updated": "2019-08-23T12:10:49", "background_image": "https://media.rawg.io/media/screenshots/f30/f30b606a11bbf267b5d77e68e59c7b59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Moonmana"], "genres": ["RPG", "Strategy", "Massively Multiplayer"], "publishers": ["Moonmana"], "esrb_rating": null}