{"id": 362858, "slug": "simple-game-2", "name": "SIMPLE GAME", "name_original": "SIMPLE GAME", "description": "It is a simple game. Help Chibisi make a pie. Simply collect five apples and the victory is yours.<br/>What are you waiting for?<br/>Just start the game.<br/>You can complete the game.<br/>But you must not think if there is something hidden there.<br/>Just think of the apples....<br/>Everything will be fine....<br/><br/>In this game, you play the role of an experienced gamer who decides to test the strength of games. Some of these games are hidden under the guise of simple and accessible, but in fact they are full of secrets and mysteries that you need to uncover. You will outsmart them and solve puzzles to gain access to the deepest secrets. But the path to success will not be easy - the game developer will try to hinder your progress and leave you in a dead end. You need to use all your skills and knowledge to get around him and win. Move from one game to another, and use the knowledge gained to advance further. Hack game worlds, break the rules and act strange to complete these games and finally solve the last secret. What does the developer hide in his games?<br/>You must be able to act quickly and make plans to bypass all obstacles and reach the end of the game.<br/>The graphics in the game are bright and colorful, which helps to create the atmosphere of the game world, but this is not for long. What follows is an increasingly tense and gloomy atmosphere in many of the developer's games.<br/>The goal of the game is to reveal all the secrets of the games and reach the end. The player must be faster and smarter than the developer in order to win and discover all the secrets.", "metacritic": null, "released": "2019-08-07", "tba": false, "updated": "2023-10-20T03:29:48", "background_image": "https://media.rawg.io/media/screenshots/513/513b1f3707af02d352ec24174da8081c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SVGames", "Roman Ryzhikov"], "genres": ["Indie"], "publishers": ["SVGames", "Сool pepper"], "esrb_rating": null}