{"id": 362829, "slug": "girl-friend-simulator", "name": "girl friend simulator", "name_original": "girl friend simulator", "description": "--------Main gameplay--------<br/>\n<br/>\r\nWithin 2.5 meters with her, <br/>\r\nafter the cursor is focus on her:<br/>\r\n--------Use the right mouse button to chat with her.<br/>\r\n--------Use the left mouse button to touch her, Or you can also pick up the item with the button (Only some things can be picked up).<br/>\r\n--------Use the \"Tab\" key to view her current properties.<br/>\n<br/>\r\nUse the \"Q\" key to put down item.<br/>\r\n   <br/>\r\nShe may ask you to help her with some tasks, you just accept or reject.<br/>\r\nSuch a task requires a certain degree of goodwill.<br/>\r\nIf you accept it, you need to finish it. <br/>\r\nOf course, you can ignore it.<br/>\n<br/>\r\nThe degree of goodwill is mainly improved through dialogue or completion of the tasks she gives you, and when it reaches a certain level, can interact with her more intimately.<br/>\n<br/>\r\nThis is not all, other please try it yourself.<br/>\n<br/>\n<br/>\r\n--------Other--------<br/>\n<br/>\r\nThe game button can be viewed in menu by pressing the \"Esc\" key in the game.<br/>\r\nIf performance is low, you can improve performance by setting to window mode (\"F11\" Key or set in the menu) or by reducing the shadow quality level.<br/>\n<br/>\r\nThe current version is not the final version, the game will continue to update until the final version.<br/>\r\nthe price of the final version will rise by 60%, buy in advance to enjoy discounts.", "metacritic": null, "released": "2019-09-09", "tba": false, "updated": "2019-08-28T21:43:49", "background_image": "https://media.rawg.io/media/screenshots/9fb/9fbe1388afca91ca31189a5cb1daa02a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XM Studio"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["XM Studio"], "esrb_rating": null}