{"id": 362814, "slug": "little-awesome-dudes", "name": "Little Awesome Dudes", "name_original": "Little Awesome Dudes", "description": "Have you ever wanted to live in your mom’s basement? Wait, you already do? Well now you can live in a VR basement! <br/><br/>Build out a tabletop world, place down LADS and put them to work! Spend (their) hard earned currency to improve their lives. Construct a variety of buildings to produce food, generate resources and equip LADS with improved gear! <br/><br/>Purchase dungeons from the spooky web then send the LADS forth to earn treasure, defend from invading enemies and defeat the Lich within his lair!<br/><br/>Tired of waiting for LADS to chop down trees? Take advantage of the variety of toys, games and fluffy objects that your mom bought for you.<h3>KEY FEATURES:</h3><br/><ul><li>Expand a tabletop world with board pieces, populate them with structures, then order your LADS to do your bidding!<br/></li><li>Use a functional VR Computer to experience the joys of capitalism as your LADS produce currency for you to spend!<br/></li><li>Challenge the dungeons, defend against roaming enemies and defeat the Lich!<br/><br/></li><li>Bluescreen your computer by smashing it with a baseball bat!<br/></li><li>Play darts! On your own!<br/></li><li>Shake a pig that poops out coins! Use them to pay for the arcade machine! Don’t forget to clean them first though…<br/></li><li>Slot floppy discs into the arcade machine to change the game!<br/></li><li>Browse apps on the computer to order items, browse for information and visit the spooky web!<br/></li><li>Scan objects to read badly written, awkward attempts to be funny and informational!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:49", "background_image": "https://media.rawg.io/media/screenshots/7a8/7a86d6990fc715ea579add0a0315fbc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Canalside Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Canalside Studios"], "esrb_rating": null}