{"id": 362803, "slug": "luna-sanctus", "name": "Luna Sanctus", "name_original": "Luna Sanctus", "description": "In a world of magic and fantasy, follow the journey of Azel and his companions in the huge empire of Ortu Solis. Explore the five vast provinces, discover their unique culture, and complete their numerous quests! <br/><br/>Son of the deceased emperor, Azel, 7 years old at the time, witnessed the murder of his parents by the hands of the Black Knight during a coup d'État staged by a group of rebel nobles. The seven years war that followed the regicide between loyalists and rebels ended by the separation of the empire of Ortu Solis in two. During that time, Azel was sent to live and grow up outside of the empire with a secret clan of oriental fighters called the Magus clan, safe from all the tumultuous politics of the empire. With the Magus clan, Azel learned how to fight and how to take care of himself.<br/><br/>12 years after the coup d'État, Azel decides to return to his empire for vengeance against the Black Knight who killed his parents. During his journey, he will gain companions, make new friends, meet new people, rediscover his empire, and most of all, he will learn the true meaning of being a descendant of the imperial family of Ortu Solis.<h3>Key Features</h3><ul><li> Unique semi-tactical turn-based rpg battle system. <br/></li><li> Vast ability systems to buff heroes and customize their skills.<br/></li><li> 50+ quests throughout all 5 provinces of the empire. Even more quests will be coming in future updates.<br/></li><li> A gameplay of well over 20 hours. <br/></li><li> Special skit system to learn more about the heroes, their personality, their past, their tastes, etc.</li></ul>", "metacritic": null, "released": "2019-08-23", "tba": false, "updated": "2019-08-28T21:43:49", "background_image": "https://media.rawg.io/media/screenshots/144/1448d50b022c95d26e833eba217f6aae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kamo Studio"], "genres": ["RPG", "Indie"], "publishers": ["Kamo Studio"], "esrb_rating": null}