{"id": 362897, "slug": "naau-the-lost-eye", "name": "Naau: The Lost Eye", "name_original": "Naau: The Lost Eye", "description": "<h3>Game Description:</h3><br/>Naau : The Lost Eye is a narrative VR action ,adventure and puzzle game using physic mechanics.Created exclusively for VR. Naau : The Lost Eye is developed from the ground up for the HTC Vive and Oculus Rift. Step into the mystic world of Naau and freely move around as if you were really there. Explore the magical fantastic world and get really close to the small creatures with the motion-controlled tools as if they are your hands while using everything available in this world to protect yourself with real-life movements. GameBit creates the most intensive VR experience possible with its independent developers and designers.<h3>Cool Features:</h3><br/><br/><strong>Choose Your Own Weapon:</strong> <br/>What is your fighting style? Choose your fighting technique and weapon while exploring your surroundings. A variety of advanced weaponry, special abilities, and combat techniques are available in this adventure. You can discover how to use your magical powers. Attack your enemies and defend yourself by defying gravity, throwing objects found in your surroundings, grabbing your enemies and throwing them into the air when you are in deep trouble, and much more.<br/><br/><strong>Weapons and Defenses: </strong><br/>Access fireballs, magical powers, boomerangs, magical stones, flower guns activated by collecting power stones, some objects (i.e. sticks, pieces of wooden cases, or iron shield itself) found in your surroundings to attack your enemy or defend yourself by using them as a shield for extra insurance.<br/><br/><br/><strong>Enemies: </strong><br/>Battle against wizards, obsidian Golems, Woldham giant tree, little creatures, Giant flowers , Spider flowers ,  (i.e. poisonous flowers, bats, bugs), and much more.<br/><br/><strong>Unique locomotion system:</strong><br/>We Offer innovative vr comforts for motion sickness for some players. You can switch teleportation while in game what is comfort for you. There are 3 options Teleport , Free locomotion  and Dash teleportation. The choice is yours.<br/><br/><strong>Interaction:</strong> <br/>Realistic VR object , characters and environment interaction. You can grab and throw characters and objects around you or punch enemies.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:46", "background_image": "https://media.rawg.io/media/screenshots/951/95186947c8ddbbcc81f18f990d8a2a87.jpg", "website": "http://naaugame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Gamebit"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Studio Gamebit"], "esrb_rating": null}