{"id": 362928, "slug": "song-of-horror", "name": "Song of Horror", "name_original": "Song of Horror", "description": "<p>Beware the shadows and the darkness which seem silent. Beware the closed doors, the whispering mirrors. Beware the Song of Horror that nests in the cracks of your mind.<br />\nThe famed writer Sebastian P. Husher has gone missing, along with his entire family. Worried, his editor sent an assistant to his house in order to look for him – but he never came back... These disappearances spark a set of events that will soon reveal something dreadful: a nameless, dark entity known only as The Presence seems to be responsible – and it’s still somewhere, out there, lurking in the shadows, waiting for you... You may die, but the horror continues – others will pick the investigation up from where you left it until you all find out the origin of The Presence and put an end to this nightmare.A PARANORMAL ADVENTURE OF UNPREDICTABLE TERROR<br />\nSong of Horror offers a truly dynamic terror experience: its antagonist, the supernatural entity known only as The Presence, is controlled by an advanced AI (Artificial Intelligence) that adapts to your actions and decisions. Experience unbearable fear as this otherworldly being responds to your way of playing and hunts you down in unexpected ways, offering a unique experience to every player and gameplay where tension builds up naturally instead of coming from scripted sequences.<br />\nAs a player, you will live this story through the eyes of a varied set of characters related to the story in their own way. Every character is different, and brings their unique point of view to the investigation, allowing them to approach clues and items differently. Their actions and decisions will shape the world: some of them will know more or less of certain aspects of the story; some will be more effective against supernatural manifestations, but all of them can die if the Presence gets to them – and death is permanent. If they die, you will have to pick the story up with another one, and continue the investigation so their deaths are not in vain. SPOOKY CHARACTERISTICS<br />\nInvestigate a paranormal mystery in a thrilling story of psychological horror<br />\nBeware The Presence, an otherworldly entity with its own AI that reacts to your actions and decisions in a non-scripted, unpredictable horror experience<br />\nChoose between a group of unique characters: each one brings its own point of view and has a different relation to the story and other characters<br />\nYou may die, but the horror continues: death is permanent – when a character dies, it’s gone...<br />\n...but the next one will follow the investigation from where the deceased left it. The world will be shaped by their previous actions.<br />\nExplore haunted, sinister locations to gather clues and items that will help you solve challenging puzzles while enduring the agonizing tension of the game&#39;s atmosphere</p>", "metacritic": 73, "released": "2019-10-30", "tba": false, "updated": "2023-08-26T10:53:20", "background_image": "https://media.rawg.io/media/games/4ba/4baba3d0e9b5b959ee37c40b72a886dd.jpg", "website": "http://www.protocolgames.com/", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 89, "owned": 976, "beaten": 14, "toplay": 32, "dropped": 7, "playing": 7}, "playtime": 4, "achievements_count": 49, "ratings_count": 32, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 35, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Protocol Games"], "genres": ["Adventure"], "publishers": ["Raiser Games"], "esrb_rating": null}