{"id": 362915, "slug": "penguins-of-the-north", "name": "Penguins of The North", "name_original": "Penguins of The North", "description": "Penguins of the North (PotN) is the peak in penguin puzzle platforming! As the first adventurous band of penguins to reach the North, you must help lead these poor fellas through a new wild frontier filled with interesting puzzles and evil enemies. <br/><br/>The twist? Players must control all penguins at the same time with just one controller (hey, no one said these were the smartest penguins). However, these penguins are adaptive and possess unique abilities to help them overcome new challenges they encounter on their journey. Find a way to utilize their penguin powers wisely to grab the key of each level and reach the exit, all while keep them alive (well as many as possible…). <br/><br/>Can you help these penguins survive the North? <br/><br/><strong>Full release features: </strong><br/><ul><li>150 unique levels to master across many different environments<br/></li><li>Local 4-player Coop: Join forces with your real-life penguin or non-penguin friends to challenge the Northern frontier together! <br/></li><li>10 adorable penguin types each with different abilities: Volunteers, Sliders, Egg Holders, Fatties, Babies (aww), Flying Dudes, and more! <br/></li><li>Many not-so-adorable penguin-eating animals (gasp!) <br/></li><li>Xbox controller support <br/></li><li>Steam Leaderboards<br/></li><li>Impossible to unlock Achievements <br/></li><li>Level Editor!! Why not!!!<br/></li><li>Smart phones level editor, so you can design levels in bed, taxi ride, subway or even at the peak of your creativity moments in the toilet!<br/></li><li>Penguins Creator, to add &amp; invent new Penguin types into the game with your own art assets!<br/></li><li>Steam Workshop to share levels!<br/></li><li>Cloud save<br/></li><li>Did we mention penguins were in the game?</li></ul>", "metacritic": null, "released": "2019-08-09", "tba": false, "updated": "2019-08-28T21:43:45", "background_image": "https://media.rawg.io/media/screenshots/db3/db388e44d2debf06f08a07c68f5b23bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mamoniem", "Owlnight"], "genres": ["Indie"], "publishers": ["Owlnight"], "esrb_rating": null}