{"id": 362943, "slug": "the-angry-birds-movie-2-vr-under-pressure", "name": "The Angry Birds Movie 2 VR: Under Pressure", "name_original": "The Angry Birds Movie 2 VR: Under Pressure", "description": "Multiplayer Action in PlayStation®VR and on TV.<br/><br/>CAPTAIN! Wear your PS VR headset and take command of your treasure hunting submarine!<br/><br/>Aim your Magnashot to grab and throw anything in sight - including your crew! See into the underwater world, watch for dangers, and grab the treasure! <br/><br/>CREW! Take up your DUALSHOCK®4 wireless controllers and team up on TV to keep the sub afloat!<br/><br/>Run, jump, grab and throw. TNT on deck?! SOMEBODY GET RID OF THAT! <br/><br/>The game requires 1 captain in the PS VR to play. Up to 3 crew players can join in on TV via Social Screen technology - the more the maritime!<br/><br/>This is the game you need to play using your PS VR with all your friends and family. Anyone can learn the simple, hectic, hilarious crew role, especially when supported by their team. And once they’re playing, graduating to the captain role is just a matter of curiosity - as the secrets of the deep beckon in full VR 3D. Get hooked with Angry Birds all over again!<br/><br/>1-4 players<br/>150MB minimum save size<br/>DUALSHOCK®4<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>The Angry Birds Movie 2 VR: Under Pressure. Developed by XR Games in partnership with Rovio Entertainment and Sony Pictures Virtual Reality © 2019. Published by XR Games. XR Games is a trademark or registered trademarks of XR Games. All other trademarks, copyrights and logos are the property of their respective owners.<br/><br/>Angry Birds™ &amp; ©2019 Rovio Entertainment Corporation and Rovio Animation Ltd. The Angry Birds Movie 2 ©2019 CPII. All Rights Reserved.1-4 players\r\n2.68GB minimum save size\r\nHD Video Output 720p,1080i,1080p\r\nDUALSHOCK®4\r\nPlayStation®VR Required\r\nPlayStation®Camera Required", "metacritic": null, "released": "2019-08-06", "tba": false, "updated": "2019-08-09T03:48:07", "background_image": "https://media.rawg.io/media/screenshots/aa6/aa6fa036359da3b3155e5c5ea623ecaf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 2}, "playtime": 0, "achievements_count": 26, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Family"], "publishers": [], "esrb_rating": null}