{"id": 363061, "slug": "witcheye", "name": "Witcheye", "name_original": "Witcheye", "description": "<p>Witcheye is a big, colorful, old-school platform adventure with a unique touchscreen control system that gives unparalleled control over the hero. Swipe to move and touch to stop, bouncing off of enemies and dodging hazards in six vibrant worlds. Set off on an adventure as a mild-mannered witch who transforms into a flying eyeball of vengeance after a smarmy knight and wizard steal her spell ingredients. You&#39;ll guide her through 50+ levels, each containing something completely unique: tricky new enemies, mysterious new environments, and puzzling new secrets. These elements are brought to life with colorful, clean pixel art and a lively, head-bobbing original soundtrack.<br />\nDesigner Peter Malamud Smith was the co-creator (with Charlie Hoey) of the viral hit The Great Gatsby For NES, and creator of the well-received mobile action puzzlers Satellina and Satellina Zero.<br />\n- Unique, intuitive controls, for a fresh take on a classic gameplay style<br />\n- 50+ fast-paced levels full of unique elements, including over 100 enemies, minibosses, and bosses<br />\n- Crisp pixel art visuals<br />\n- 30+ track original soundtrack<br />\n- Unlockable bonus modes and challenges, including a hard mode with fully remixed enemies and levels<br />\n- Robust speedrun features, including player ghosts and timers with built-in splits</p>", "metacritic": null, "released": "2019-08-15", "tba": false, "updated": "2020-09-11T09:02:01", "background_image": "https://media.rawg.io/media/screenshots/697/69786b2a70b3c4628bd73b83a8fc8735.jpg", "website": "https://devolverdigital.com/games/witcheye", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 18, "owned": 52, "toplay": 7, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "iOS", "macOS"], "developers": ["Devolver Digital", "Moon Kid"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Devolver Digital"], "esrb_rating": "Everyone 10+"}