{"id": 363057, "slug": "farm-frenzy-and-friends", "name": "Farm Frenzy and Friends", "name_original": "Farm Frenzy and Friends", "description": "It’s a world-renowned Farm Frenzy serial – but a brand new unique Farm Frenzy and Friends game!<br/>It’s the famous gameplay that fans love – but it’s an all-new adventure!<br/>We cast dozens of animals, but only the best made the cut! <br/>Take a step into a captivating world of Farm Frenzy and you just won't be able to stop!<br/><br/>Dozens of thrilling levels and tons of challenging tasks are waiting for you! Collect products, create new goods, enhance factories and vehicles and develop trade to keep your farm up and running. Have fun but stay focused, because you will be working against the clock! <br/><br/>Make the most of your Facebook account – find dozens of friends; send and receive gifts on a daily basis! Find more friends and get more info at https://www.facebook.com/FarmFrenzyAndFriends - the Official Farm Frenzy and Friends Page!<br/><br/>Join the first Frenzy Tournament and compete against your Facebook fellow-farmers! Dominate the Leaderboard to prove everyone that you are the most efficient Farmer in town! The more friends are left behind, the bigger prize you’ll get!<br/><br/>And best of all - it’s FREE!<br/>It’s GMO-free! <br/>It’s sugar-free! <br/>It’s smoke-free! <br/>It’s alcohol-free!<br/>BUT - it’s full of pleasure, joy and adventures!<br/><br/>IMPORTANT! <br/>A negative app review will not fix any of the bugs or errors you find! However, your message sent to farmsupportfb@alawar.com or posted on our Facebook Page allows us solve your problem and thank you with a reward!", "metacritic": null, "released": "2015-10-19", "tba": false, "updated": "2019-08-09T04:44:20", "background_image": "https://media.rawg.io/media/screenshots/550/550844b40444fb3c0fc8a3be95fc20ac_alwp6A0.jpg", "website": "https://www.alawar.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Simulation", "Casual"], "publishers": ["Alawar Entertainment"], "esrb_rating": "Everyone 10+"}