{"id": 363181, "slug": "pizza-maker-and-delivery-shop", "name": "Pizza Maker And Delivery Shop", "name_original": "Pizza Maker And Delivery Shop", "description": "Be ready to have best fast food making experience.<br/><br/>You will be making paste using eggs flour and other various ingredients to make the paste after that as a factory mechanic or operator you will be operating automated machines to pour the paste into them and making doughs out of them. Making pizza in this pizza maker game is quite easy as you will be using machines to hep you out. Doughs will pass through a machine you will be using its controls to make a flat base of your yummy and delicious pizza.<br/><br/> Assembly line will bake the pizza bread and accumulated it a specific place, where you will be adding mushrooms, vegetables, other kind of organic  types. After going through pizza packaging you will driving the pizza car to deliver hot &amp; crispy pizza to the customers and restaurants. Be an expert cooking chef and fulfill the customers demands before the time runs out. <br/><br/>Kids can slice the pizza, put in a box and give it to the delivery dude. Kids can eat their pizza and set a fun table for lunch. So much to do and play in this fun Pizza Maker Crazy Chef game. Kids can cook all day long! And before you eat, don’t forget to show your pizza creation to your friends and family too. <br/><br/><br/>So quench your kitchen fever, like a big factory you will be offering your customers with healthy,nutritious &amp; organic pizzas for breakfast lunch, dinner and midway deals.<br/><br/>************** About Unique Games *************<br/>Unique Games brings you the latest creations of most loved categories of games and apps which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Unique Games on App Store  get more of games.<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/>************************************************************* ***************************************", "metacritic": null, "released": "2017-07-14", "tba": false, "updated": "2019-08-09T06:11:20", "background_image": "https://media.rawg.io/media/screenshots/ef3/ef3651e3516dfefc0febf631ba95e2df.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JAYARAJBHAI LALU"], "genres": ["RPG"], "publishers": ["JAYARAJBHAI LALU"], "esrb_rating": "Everyone 10+"}