{"id": 363175, "slug": "potato-chips-factory", "name": "Potato Chips Factory", "name_original": "Potato Chips Factory", "description": "Enjoy the Potato Chips Factory  game and the real world factory simulation setting. <br/><br/>Potato chips factory is crazy fry’s chips making game for kids. Kids love to bake and make food in the kitchen. Let’s think a bit bigger! Work as a potato chip factory worker and make chips in large factory plants and machinery. This game will let you learn the whole process of potato chips making, from growing potatoes in the farmer farm to cooking chips in factory machine plants. Little boys and girls get ready to be the part of Unique Games. <br/><br/>Farming Potatoes In farm Land <br/><br/>Dig up the farm land and seed the potatoes. Water the veggies and take care of the farm. Wait for potatoes grow up and then harvest the crops. Pluck the potatoes and fill them in the boxes for delivery truck. <br/><br/>Washing Potatoes <br/><br/>When delivery truck reached the factory first wash &amp; cleanup the Potatoes in the washing plant. Remove all the bacteria, mud and mess from the vegetable. Then pass it through the cutting machine which slices the Potatoes in the pieces.<br/><br/>Remove Chaff from Potatoes <br/><br/>Use cutting machine to remove the chaff from the potatoes and take them the kitchen room where you have to cook it like a master chef.<br/><br/>Cooking &amp; Fry’s Maker Process <br/><br/>Add spices, flavor, sweetener, garlic &amp; salt in the plant. Heat it up for few hours and the delicious potatoes chips are ready for fill. Fill the chips in the packets and deliver it to super markets, shop, bakery and different restaurants.<br/><br/>*************************************** About Unique Games***************************************<br/>Unique Games brings you the latest creations of most loved categories of games . which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Unique Games on App Store and get more of games.<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/>************************************************************* ***************************************", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2019-08-09T06:08:52", "background_image": "https://media.rawg.io/media/screenshots/61d/61df886fbf9dc3d50f422cb0cfcd0962_opLuaju.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JAYARAJBHAI LALU"], "genres": ["RPG"], "publishers": ["JAYARAJBHAI LALU"], "esrb_rating": "Everyone 10+"}