{"id": 363185, "slug": "atm-simulator", "name": "ATM Simulator", "name_original": "ATM Simulator", "description": "Hey! Ever wanted to use your Papa’s Debit or Credit card on ATM Machine to get cash and buy Cake,chocolate, many more? Here your dreams come true with ATM Simulator game.<br/><br/> would love to act like adults and what could be better than handling cash and shopping. ATM Learning Simulator for  gives your little ones a chance to learn to withdraw money from the cash machine and go to supermarket to purchase many Item.<br/><br/>Come on and let’s have our own Unique bank account and debit card and draw money from ATM machine and head to toy store in this ATM Simulator. There is no need to check the account balance. Enjoy mobile banking and transact the amount you want from the money machine.<br/><br/>Features:<br/><br/>- Learn to manage your own bank accounts<br/>- Withdraw and deposit cash<br/>- Shop for sweets &amp; toys<br/>- Educational and entertaining for game Lovers.<br/><br/>Live your dream of spending big with this new ATM money game.<br/>Just a fun way  to get accustomed to use an ATM machine!<br/><br/>Have fun for hours playing the ATM Simulator.<br/><br/>*************************************** About Unique Games ***************************************<br/>Unique Games brings you the latest creations of most loved categories of games . which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Unique Games on App Store and get more of games.<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/>************************************************************* ***************************************", "metacritic": null, "released": "2017-07-19", "tba": false, "updated": "2019-08-09T06:13:10", "background_image": "https://media.rawg.io/media/screenshots/64c/64c28eac8e05a1a11030d2f7e0eb0b17.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JAYARAJBHAI LALU"], "genres": [], "publishers": ["JAYARAJBHAI LALU"], "esrb_rating": "Everyone 10+"}