{"id": 363120, "slug": "amerzone-the-explorers-legacy-universal", "name": "Amerzone: The Explorer's Legacy - (Universal)", "name_original": "Amerzone: The Explorer's Legacy - (Universal)", "description": "Before dying, the explorer Emile Valembois tells you about the most amazing expedition of his career. This expedition was dedicated to the crazy \"white bird\" mystery.<br/>The first masterpiece of Benoit Sokal's adventure game<br/><br/>THE ADVENTURE  <br/>Before dying, the explorer Emile Valembois tells you about the most amazing expedition of his career. This expedition was dedicated to the crazy \"white bird\" mystery. He confides to the young journalist that you  are, the odd mission of returning to Amzerone in order to bring back an egg that was robbed 50 years earlier…<br/>Legend has it that strange white birds are born and die in mid-flight, without ever landing. To bring this species back to life, you'll travel through enchanting landscapes, from Brittany to tropical forest. You'll have to solve the mystery of these famous white birds…<br/>You are suddenly transformed from journalist to explorer setting out for the Amerzone, chasing down any clues that Alexandre Valembois left you in his lighthouse.<br/><br/>  UNLOCK THE FULL VERSION DIRECTLY IN THE GAME  <br/><br/>THE GAME<br/>A Point&amp;Click adventure using 360° vision technology in every scene.<br/>The game is not a copycat portage of the PC version but an adaptation for touch screens and mobile platforms.<br/><br/>THE HIGHLIGHTS<br/>• The first adventure from the author of Syberia and Syberia 2, Benoît Sokal<br/>• The fascinating treasure trail laid out in Valembois' notebooks<br/>• High-definition graphics and cinematics<br/>• Numerous enigmas to solve<br/>• The varied and bewitching music and ambient sounds<br/>• Voices and texts are available in 5 languages (English,French,German,Italian,Spanish)<br/><br/>DON'T FORGET TO CHECK OUT OUR OTHER FANTASTIC ADVENTURE GAMES! <br/><br/>On Mac, iPad, iPhone:<br/>Amerzone The Explorer's Legacy<br/>Atlantis 2: Beyond Atlantis<br/>Atlantis 3: The New World<br/>Atlantis 4: Evolution<br/>Atlantis 5: The Secrets of Atlantis - The Sacred Legacy<br/>Aztec The Curse in the Heart of the City of Gold<br/>Dracula 1: Resurrection<br/>Dracula 2: The Last Sanctuary<br/>Dracula 3: The Path of the Dragon<br/>Dracula 4: The Shadow Of The Dragon<br/>Egypt 2: The Heliopolis Prophecy<br/>Egypt 3: The Prophecy<br/>Jules Verne's Journey to the center of the moon<br/>Jules Verne's Mystery of the Nautilus<br/>Jules Verne's Return to Mysterious Island<br/>Jules Verne's Return to Mysterious Island 2<br/>Louvre The Messenger<br/>Necronomicon: The Dawning of Darkness<br/>Nostradamus The Last Prophecy<br/>Road to India Between Hell and Nirvana<br/>Versailles 2<br/><br/>Only on Mac:<br/>Still Life 2 - Director's Cut<br/><br/>FOLLOW US<br/><br/>MICROIDS<br/>On twitter.com/microids_off<br/>On facebook.com/microids<br/>On microids.com/en<br/><br/>ANUMAN INTERACTIVE<br/>On twitter.com/anumani <br/>On facebook.com/anuman.fr<br/>On anuman-interactive.com", "metacritic": null, "released": "2013-08-14", "tba": false, "updated": "2019-08-09T05:33:28", "background_image": "https://media.rawg.io/media/screenshots/60a/60a531d22447c3518e5df0cdb26110b4.jpg", "website": "http://itunes.apple.com/en/artist/microids/id433861351", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Microids"], "genres": ["Adventure", "RPG"], "publishers": ["Microids"], "esrb_rating": "Everyone 10+"}