{"id": 363103, "slug": "frombie-run", "name": "Frombie Run", "name_original": "Frombie Run", "description": "Welcome to Frombie Run!<br/><br/>In the spirit of classic arcade endless-runner games, Frombie Run features non-stop running, jumping and smashing action while collecting coins and crystals in this fast paced portal jumping adventure!<br/><br/>\"Great graphics, impeccable controls, addictive gameplay... Frombie Run has it all.\" - Appszoom<br/><br/>\"9 out of 10!\" - The Great Apps<br/><br/>\"We can't stress it enough... the game is a ton of fun.\" - SpankyStokes.com<br/><br/>***<br/>Our Story<br/>Long ago, the evil Meanatoad and his army raged war against the good people of planet Ssorc, turning the Ssorcians into friendly zombies and ultimately tearing Ssorc apart!<br/><br/>The key to the planet’s survival is a young friendly zombie girl named Zora. Along with her sidekick SB and new friends along the way, she must escape Meanatoad’s menacing Bullifrogs and bring her planet back to peace.<br/><br/>***<br/>Features<br/>• Play as Zora or unlock any of her friends, each with different playing styles.<br/>• Tap and Swipe your way over, under and through challenging obstacles.<br/>• Collect wisps and use them to jump through portals to different worlds and levels.<br/>• Collect coins to buy power-ups and upgrades including speed boosts, shields, magnet power and more...<br/>• Complete Daily Missions to earn and unlock rewards.<br/><br/>Frombie Run is based on the popular Frombies® toys and collectibles collections.<br/><br/>Suggestions? Favorite character? We’d love to hear from you! <br/>You can reach us at contact@frombies.com<br/><br/>Visit our WEBSITE: www.frombies.com<br/>Like us on FACEBOOK: facebook.com/frombierun<br/>Follow us on TWITTER: @frombierun<br/>Follow us on INSTAGRAM: @frombierun<br/>Watch us on YOUTUBE: youtube.com/frombierun", "metacritic": null, "released": "2016-09-05", "tba": false, "updated": "2019-08-09T05:21:56", "background_image": "https://media.rawg.io/media/screenshots/0ca/0ca433e876d328a25b94e1d55d33b4c2_yaQdorH.jpg", "website": "http://www.frombies.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["A.C.R.O.N.Y.M. Games"], "genres": ["Adventure", "Casual"], "publishers": ["A.C.R.O.N.Y.M. Games"], "esrb_rating": "Everyone 10+"}