{"id": 363104, "slug": "alana-banana", "name": "Alana Banana", "name_original": "Alana Banana", "description": "Explore, Play and Learn with Alana Banana in our fun musical app for young kids.<br/><br/>Welcome to a magical island of music, dance and fun - This is the official app for The Alana Banana Show!<br/><br/>The Alana Banana Show features themes children can learn from and relate to in an engaging and educational way. Designed for kids ages 2 to 5, this musically-themed app will whisk them away to an island full of imagination and creativity through original music, videos, interactive games and a super fun keyboard!<br/><br/>App Features:<br/>A) An interactive coloring activity where you can meet and color all of Alana's friends from their island in the South Pacific. <br/><br/>Simple creative activities like coloring and art are some of the core building blocks of a child's development, helping to build motor skills and language development. For very young children making art, or just talking about it, provides opportunities to learn words for colors, shapes and actions. Art education strengthens problem solving, decision making, and critical thinking.<br/><br/>B) Play a game of Memory with various levels and different musical themes.<br/><br/>Memory is a great game for kids to build cognitive skills and shape recognition. It improves concentration, trains visual memory, helps kids keep focused, and increases both short-term memory and attention span.<br/><br/>C) A music activity where you and your kids can learn how to play songs on your very own Alana Banana keyboard.<br/><br/>Early musical training helps to develop areas of the brain involved in reasoning. Recent studies have also indicated that learning a musical instrument early can help develop a part of the left side of the brain known to be involved with processing language.<br/>(There are 3 modes to choose from: Play Along, Note By Note and Free Play)<br/><br/>D) Our videos! <br/><br/>Watch a variety of our favorite videos from The Alana Banana Show featuring singing, dancing, educational games, story time and so much more...<br/><br/>What makes this App special is that we want to create a shared experience between parents and their children, so they can explore the world of Alana Banana together. Learning doesn't stop with a single lesson. The discussions and experiences that you and your child can have from doing these shared activities can have a big impact on their development. <br/><br/><br/>Note to Parents:<br/>This app contains a lot of free content but if your child really enjoys the app, we ask you to unlock the rest of the activities and songs for a one time in-app purchase. No ads, no surprises...just a lot of Alana Banana FUN!<br/><br/>Enjoy!<br/><br/>Alana", "metacritic": null, "released": "2016-09-23", "tba": false, "updated": "2019-08-09T05:22:17", "background_image": "https://media.rawg.io/media/screenshots/63c/63cc5608df2b65b42cd65bc889a5cd61_D82Oy23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["A.C.R.O.N.Y.M. Games"], "genres": [], "publishers": ["A.C.R.O.N.Y.M. Games"], "esrb_rating": "Everyone 10+"}