{"id": 363102, "slug": "reboot-the-guardian-code", "name": "ReBoot: The Guardian Code", "name_original": "ReBoot: The Guardian Code", "description": "Welcome to Cyberspace! <br/><br/>Reboot: The Guardian Code is a unique twist on a classic casual puzzle game. The object of the game is to defeat your enemies by swiping patterns of colored hexagons to activate your Guardians’ powers. When a pattern containing three or more matching Data Cells is swiped, they activate the matching Guardian’s special powers to attack the enemies. This puzzle game is played as a series of battles between the four Guardians of Cyberspace and enemy viruses. <br/><br/>Aided by V.E.R.A., an artificial intelligence being, the Guardians digitize into the internet cloaked in cybersuits made of code and equipped with an array of cyber powers and weapons. Vector, the leader of the team is armed with his Code Disruptor, fragging computer viruses with a marksman’s aim. Googz is outfitted with a Deflector Ring as well as tactical scanning and hacking abilities. Enigma, a stealth cyber ninja, wields a Sonic Katana and flings Energy Shurikens with extreme precision. D-Frag is a hulking tank with code crushing Frag Fists and a mace-like Bash Tagger that obliterates any malware in its path.<br/><br/>App Highlights:<br/><br/> - Based on ReBoot: The Guardian Code TV series<br/> - Learn more about your favourite Guardians!<br/> - Guided by V.E.R.A., command the Guardians into action!<br/> - Meet familiar villains along the way<br/> - Visit the same locations as the TV series<br/> - Fun and unique match-5 puzzle game<br/> - Unlock and use new abilities<br/> - Upgrade your Guardians<br/> - Lots of powerups to help in battle<br/> - Work together to defeat Megabyte", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-08-09T05:21:44", "background_image": "https://media.rawg.io/media/screenshots/f94/f947a44e37f946d9593da90576d064e9_guJGNSK.jpg", "website": "https://www.reboot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["A.C.R.O.N.Y.M. Games"], "genres": ["Casual", "Puzzle"], "publishers": ["A.C.R.O.N.Y.M. Games"], "esrb_rating": "Everyone 10+"}