{"id": 363147, "slug": "land-of-livia-an-epic-fantasy", "name": "Land of Livia: An Epic Fantasy", "name_original": "Land of Livia: An Epic Fantasy", "description": "Escape your busy life and immerse yourself in an epic text-based fantasy adventure, with absolutely no-pay-to-win. Survive on your wits alone on a journey to uncover a dark conspiracy.<br/><br/>Full VoiceOver support means this game is proudly fully accessible for blind and visually impaired players.<br/><br/>Initial purchase includes the Prelude chapter, and three additional chapters are available via in-app purchase. The Final Chapter is coming soon!<br/><br/>This innovative &amp; unique indie role-playing adventure is a different kind of experience that is designed with relaxed gameplay to fit in around your busy day. You only need to touch base periodically to gather rewards and continue. You can also get to know other players at your cozy campfire as you venture through months of content. You may even need their help to discover the most challenging secrets and legendary items of the land.<br/><br/>Don't let the simple graphics and UI fool you; this game is very deep and requires you to think. It is my passion project that I have been working on for over 5 years as a solo indie developer. Enjoy!<br/><br/>FEATURES<br/>● Includes the Prelude 'The Sorceress and the Sea' - explore the Land of Livia and discover the nature of the evil that has caused its current drought!<br/>● Chapter 1 'A Land Divided', Chapter 2 'The First Tribe', and Chapter 3 'The Veiled Frontier' provide months more content and are available via in-app purchase.<br/>● Travel to various Towns and Dungeons to collect powerful Items, precious Gems, Real Estate, and Companions.<br/>● Unlock Legends by listening to rumors and piecing together lore items to find and equip Legendary Items.<br/>● Discover additional lore items by solving challenging riddles.<br/>● Chat with other players at your intimate campfire to share knowledge or perhaps compete for #1 on the Leaderboards.<br/>● Level up and optimize your hero to complete increasingly difficult quests.<br/>● Discover rune combinations with limited guesses in the Lore Researching mini-game.<br/>● Test your reflexes and precision in the Gem Cutting mini-game.<br/><br/>SUPPORT<br/>Have an idea for a feature? Experiencing a problem? Or just have general feedback? I would love to hear from you at landoflivia@gmail.com<br/><br/>Like us on Facebook (https://www.facebook.com/landoflivia) or follow us on Twitter (https://twitter.com/LandOfLivia) to stay up to date with the latest news and updates!", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-08-09T05:55:08", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0ccb752306aeae58576f8f4da21f3e1_ZjSEIFZ.jpg", "website": "http://www.landoflivia.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aaron Vernon"], "genres": ["Adventure", "RPG"], "publishers": ["Aaron Vernon"], "esrb_rating": "Teen"}