{"id": 363240, "slug": "prom-night-dressups", "name": "Prom Night Dressups", "name_original": "Prom Night Dressups", "description": "Tiara, Gorgeous dress, Colorful lights, Fabulous fireworks and Handsome dancing partner, All of them will happen in this March!!!<br/>March is such a month full of hope and joy, because we all know it stands for graduation, we have one last and biggest event to prepare, Yes, the Graduation Prom!!! <br/>Do you want to be the most attractive girl in the ball?<br/>Do you aim to be the queen and win the tiara?<br/>Do you dream of wearing the glamorous dress and dancing with a charming partner?<br/>If all your answers are yes, you can not miss our amazing \"Prom Night Dress”! <br/>In this game, you can help these adorable girls to make up and dress up for their graduation prom! <br/><br/>Start with a soothing spa to make sure her  skin are flawless already for the event. Next, help her to put the makeup on. Then, assist her to select a perfect dress and the matched jewelry. At last, you can choose the best dancing partner for her and let them enjoy a romantic time! Now, let's go and make it a fantastic show! <br/><br/>** Features ** <br/>- Spa Section <br/>- Makeup Section <br/>- Dress up Section <br/><br/>- Different hair styles to choose <br/>- Try on dozens of different lipsticks, eye colors, eye-shadows, hair colors and more<br/>- Lots of colorful dresses for the big day<br/>- A huge variety of party items, including earrings, necklaces and headgears<br/>- Make up and dress up her in your dream gown<br/>- Share your perfect girls via Facebook or E-mail with just one click<br/><br/>****************** About Creative Game ****************<br/>Creative Games brings you the latest creations of most loved categories of games . which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Creative Games on App Store and get more of games.<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/>******************************************************", "metacritic": null, "released": "2017-03-19", "tba": false, "updated": "2019-08-09T06:36:03", "background_image": "https://media.rawg.io/media/screenshots/8b1/8b17667194b1d7df5114d27f205f8bf8.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rutudhvaj Sabhaya"], "genres": [], "publishers": ["Rutudhvaj Sabhaya"], "esrb_rating": "Everyone 10+"}