{"id": 363205, "slug": "new-crazy-ball", "name": "New Crazy Ball", "name_original": "New Crazy Ball", "description": "Welcome To Crazy Ball With Nice Concept!<br/>It is fun,unique and Addictive Game. <br/><br/>Features:<br/><br/># Customizable Themes <br/>Choose your favourite colors from 16 different themes. You'll never be bored of the interface.<br/><br/># Random Themes<br/>Choose your favourite colors by Random themes. You'll Select Nice Theme.<br/><br/># Beautifully Designed<br/>Inspired by Level Material Design principles, Crazy Ball looks simple, beautiful and nice.<br/><br/># Challenging<br/>You think games are all easy? You may try Crazy Ball and it'll amaze you with the challenge it provides!<br/><br/># Light in Size<br/>It's simple, fast, and light and occupies very few memory.<br/><br/># Easy to Play <br/>You don't have to learn complicated rules that other games have. Simply slide and draw shape at the bottom of the screen and that's all you need to know.<br/><br/># Challenging but Relaxing<br/>Games are not there to make you stressed and bored out. Block it Up! can be difficult but it's designed to relax you.<br/><br/><br/>************** About Unique Games *************<br/>Unique Games brings you the latest creations of most loved categories of games and apps which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Unique Games on App Store get more of games.<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/>**************************************************", "metacritic": null, "released": "2017-06-13", "tba": false, "updated": "2019-08-09T06:21:46", "background_image": "https://media.rawg.io/media/screenshots/a97/a976aa897ce11f31e5dbd2ca41e41046.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JAYARAJBHAI LALU"], "genres": ["Strategy", "Casual"], "publishers": ["JAYARAJBHAI LALU"], "esrb_rating": "Everyone 10+"}