{"id": 363218, "slug": "princess-nail-salon-makeover-pro", "name": "Princess Nail Salon Makeover Pro", "name_original": "Princess Nail Salon Makeover Pro", "description": "Welcome to Our Princess Nail Salon Makeover Game. If user Want to have a manicure? Come on, spice up your fingers with our Princess Nail Salon Makeover!<br/><br/>You could paint on different skin color, choose from loads of polish color collections, choose from absolutely tons of sparkling crystals, diamonds, stickers, patterns much much more to decorate your nails. <br/><br/>Take a photo as our cover girl. <br/><br/>Features <br/>-&gt;you can Choose Different Skin Colour Fingers. <br/>-&gt;Four different skin tones <br/>-&gt;you can also do manicure of fingers nail.<br/>-&gt;Than You Can Choose Various Patten In Various Colour.<br/>-&gt;Different 8+ Pattern and 15+Various Colour you Can Choose.<br/>-&gt;Also you Can Select Sticker and set on Nail.<br/>-&gt;Sticker Can Be Zoom In or Zoom Out.<br/>-&gt;this Way You Can Design Your Nail.<br/><br/>Start by choosing a skin color and then trim your fingernails to the exact length you want. Buff them to a high gloss squeaky shine like a real spa. <br/>Then move on to amazing nail polish color palettes in todays trends. <br/>Everything from today’s bright fresh pinks and pretty purples to glowing neon. <br/>Go with a classic french manicure or try painting a different color on each nail or even a pattern of ombre, stripes, rainbows, polka dots or abstract art. <br/>You can draw anything beautiful that you can dream up! <br/><br/>This is where the real fun starts! Pick from the largest and best collection of glamorous nail art in the App store!<br/><br/># Ads: - <br/>Please note this game is Free. In this Game No one Place Shown Ads Or No one In-app. so as to not to disturb you during Any path and You Can Enjoy with Game.<br/><br/><br/>********************* About Unique Games *****************************<br/><br/>Unique Games brings you the latest creations of most loved categories of games and apps which are all hugely loved by all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for  all peoples. Stay with us for the latest updates of Unique Games on App Store and get more of games.<br/><br/>our more Games :  https://itunes.apple.com/us/developer/jayarajbhai-lalu/id1247366765<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/><br/>************************************************************* ***************************************", "metacritic": null, "released": "2017-07-04", "tba": false, "updated": "2019-08-09T06:27:05", "background_image": "https://media.rawg.io/media/screenshots/ae3/ae3d808375a13867f47ca686abcd023a.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JAYARAJBHAI LALU"], "genres": ["Simulation"], "publishers": ["JAYARAJBHAI LALU"], "esrb_rating": "Everyone 10+"}