{"id": 363333, "slug": "sullys-ascension", "name": "Sully's Ascension", "name_original": "Sully's Ascension", "description": "<p>Fight through procedurally generated dungeons and collect items! Escape when you can, or stay in the fight. The choice is yours.</p>\n<p>Every dungeon contains an infinite amount of levels and a random amount of rooms per level.</p>\n<p>After clearing a room, there is a chance for a collectable item to spawn that can vary the playing fields by a huge amount.</p>\n<p>Upon defeating the boss on the third level you will have the opportunity to go into the endgame, which is a final battle that spawns multiple waves of enemies. Hopefully by this point you're well equipped!</p>\n<p>This game was inspired by the Binding of Isaac, so you may see some (or a lot!) or similarities.</p>\r\nSupported platforms:\r\n<p>Windows, Mac OS X, &amp; Linux</p>\n<p>Sully's Ascension only supports 16:9 resolutions, although it should work just fine on others so long as you play in windowed mode.</p>\r\nSupported ways of playing (controls):\r\n<p>Xbox one / Xbox 360 / PS3 / PS4 controllers - LJoystick to move &amp; RJoystick to shoot (Other buttons are explained in options &gt; controls menu)<br/></p>\n<p>Keyboard &amp; Mouse - WASD to move, arrow keys to shoot. (Other keys are explained in options &gt; controls menu and can be re-binded!).</p>\n<p>Please familiarize yourself with the controls in the menu before playing! And if any controller input isn't working on your end, send me an email and I might be able to work something out!</p>\r\nMinimum Specs Requirement:\r\n<p>Lowest spec PC tested: i7-3520M @2.90 GHz (2 Core) w/ Intel HD Graphics </p>\n<p>(this game should run just fine on any PC or mac)</p>\r\nWord on development:\r\n<p>I would like to think this game is still in development - I'm just at a point where I'm lacking ideas and some motivation, so please feel free to let me know of anything cool that could be added! </p>\r\nFind any bugs? [Contact info]\r\n<p>Scroll down to the community tab and make a post or email me. Videos/screenshots would be helpful, too! You can also send me the log file, found here:  C:\\Users\\your_username\\AppData\\LocalLow\\SyrStudios\\Sully's Ascension\\player.log</p>", "metacritic": null, "released": "2019-08-08", "tba": false, "updated": "2019-08-28T23:14:41", "background_image": "https://media.rawg.io/media/screenshots/24d/24d7ed4c1c9962adf9fffbdc6fdac2a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SyrStudios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}