{"id": 363618, "slug": "alibi-updated", "name": "Alibi - Updated", "name_original": "Alibi - Updated", "description": "<p> </p>\n<p><strong>Thanks for checking out Alibi! This game was made for the 48 hour GMTK Game Jam. Unfortunately, due to running out of time, the original submission contains a few bugs that prevent completion. This is an updated version for Browser (Firefox/Chrome), Windows, Linux and Mac OSX, released shortly after the jam for those who want to play the game as it was intended to be, and to solve the mystery!</strong></p>\n<p>To rate the submitted game - https://itch.io/jam/gmtk-2019/rate/462205</p>\n<p>---------------------------------------------------------------------------------------\r\n</p>\n<p><strong>How to Play:</strong></p>\n<p>Alibi revolves around the idea that the detective is caught in a time loop that no one else is aware of, reliving every day (or every minute in game time) as if it never happened. So while he still retains information on the case, everything else is reset every minute, including any items that were obtained. The aim is to cross off every suspect until there is only one person left, in the hope that finding the perpetrator might break the loop...</p>\n<p><strong>You can interact in the following ways:</strong></p>\n<ul><li>Click on a house to question a resident, you can only ask each resident one question per loop.</li><li>Asking a blue question will result in them giving you an item that they want to be delivered to another resident.</li><li>If you have an item when questioning a resident you can click on the item to generate a red question.</li><li>Asking a red question will result in you handing over the chosen item.</li><li>If you hand over the wrong item the resident will return the item and refuse to talk, but handing over the correct item will mean they provide you with information regarding the case, and might result in them giving you an alibi for themselves or for another resident, crossing them off the suspects list.</li><li>You can click the white house to sleep and manually reset the loop at any point.</li></ul>\n<p>---------------------------------------------------------------------------------------</p>\n<p>Friday, 20th June: A young girl goes missing from a small town. </p>\n<p>Saturday, 21st June: The detective finds himself in a race against time \r\nthat never ends. Everyone’s a suspect, but not everyone has an alibi. \r\nCan he find the kidnapper in time to stop a murder and escape the loop?</p>\n<p>-----------------------------------------------------------------------------------------</p>\n<p>Alibi is a short point-and-click crime game about a detective stuck in a time loop. Every minute, the detective's day begins again, separating him from the items he has gained, but leaving him with the information he has gathered.</p>\n<p>Question the residents of a small, sleepy town within a beautiful, hand-painted watercolour world. Fight against time again and again to save the captive, and yourself. </p>\n<p>--------------------------------------------------------------------------------------</p>\n<p>The detective has <strong>only one</strong> minute,  can ask <strong>only one</strong> question to each person, and <strong>only one</strong> person doesn't have an alibi.</p>\n<p>------------------------------------------------------------------------------------\r\n</p>\n<p>Alibi was made by a team of three brothers as our first game for the GMTK Gamejam 2019.\r\n</p>\n<p>All art assets, design, writing and code were created from scratch for this jam. The game was made using the Godot engine.</p>\n<p>Music: Bensounds (www.bensounds.com), Creative Commons</p>\n<p>------------------------------------------------------------------------------------\r\n</p>\n<p>Kinoko Brothers:\r\n</p>\n<p>Designed and programmed by Sootstone</p>\n<p>Artwork by Eddie Binnie</p>\n<p>Dialogue and story by Bath Token\r\n</p>", "metacritic": null, "released": "2019-08-06", "tba": false, "updated": "2019-08-09T08:26:44", "background_image": "https://media.rawg.io/media/screenshots/3a2/3a2bd6c02f4c619e0e8d9031f8df3495.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Kinoko Brothers"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}