{"id": 36381, "slug": "psi-ops-the-mindgate-conspiracy", "name": "Psi-Ops: The Mindgate Conspiracy", "name_original": "Psi-Ops: The Mindgate Conspiracy", "description": "<h3>Meet Nick Scryer.</h3>\n<p>An American soldier with a difference. Slightly more than your typical grunt, Nick belongs to the Psi-Ops division, a section devoted to tapping into latent human psychic and telekinetic powers and exploiting them for military purposes.</p>\n<p>Scryer&#39;s latest mission is to infiltrate and take down a psychic terrorist organization known as &#39;The Movement&#39;. These mentally-enhanced menaces have been kidnapping troops and manipulating their minds to turn them into unfeeling, unthinking &#39;Meat Puppets&#39;, and it&#39;s Scryer&#39;s task to put an end to it. As he&#39;s attempting to penetrate an organization run by mind-readers, extreme measures have been taken to prevent detection.</p>\n<p>Scryer has his mind-wiped and his face completely altered to prevent detection by former friends, which leaves him without any knowledge of his powerful psychic powers. Soon after, he&#39;s incarcerated after being captured by The Movement, and it&#39;s in this prison that he becomes your personal meat puppet.</p>\n<p>Help Nick to gradually rediscover his devastating mental abilities - including pyrokinesis (the power to manipulate fire), remote viewing (see through walls and doors), and mind control - in Midway&#39;s stunning and highly original new adventure.</p>\n<h3>Details</h3>\n<p>It&#39;s Nick Scryer&#39;s psionic abilities that set Psi-Ops: The Mindgate Conspiracy apart from the myriad action-adventure titles on the market. Abilities such as telekinesis, which allows you to lift and throw objects - including humans - around are not only intuitive to control but great fun with it. This is largely down to the brilliant Havok physics engine, which makes all items react realistically to your actions. Send a barrel flying into a stack of boxes, and they&#39;ll all come crashing down; &#39;grab&#39; an enemy, and you can repeatedly smash them into walls or even shoot at them as they hover helplessly in the air.</p>\n<p>And that&#39;s only one of the six powers on offer. Set fire to an object using pyrokinesis, and you can use it to set surrounding objects aflame too; use mind control to take over a foe and use him to blast his accomplices before forcing him to throw himself down a chasm; or sneak behind an unwitting Meat Puppet and use mind drain to sap his psionic energy and blow his head up in the process...</p>\n<p>The possibilities are numerous, and the game doesn&#39;t shy away from giving you an opportunity to improvise with what you have. Need to cross a huge gap with plenty of gun-toting fiends on the other side? Well, you could create a bridge using the objects around you, surf across on a suitably-shaped item, or just use mind control to deal with the distant threat and then safely walk around the hole. It&#39;s completely up to you.</p>\n<h3>Features</h3>\n<p>-Command six powerful psionic abilities: Telekinesis, Pyrokinesis, Mind Control, Mind Drain, Remote Viewing and Aura View</p>\n<p>-Open-ended game structure - solve puzzles and defeat enemies the way you want to</p>\n<p>-Realistic physics - throw enemies around the room, create fires, build blockades, and even &#39;surf&#39; on objects</p>", "metacritic": 84, "released": "2004-06-14", "tba": false, "updated": "2024-04-07T01:43:53", "background_image": "https://media.rawg.io/media/games/7e4/7e4850f6a11373d37f05ff6440caedf1.jpg", "website": "", "rating": 4.08, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 39, "beaten": 54, "toplay": 21, "dropped": 23, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 53, "suggestions_count": 571, "game_series_count": 0, "reviews_count": 53, "platforms": ["Xbox", "PC", "PlayStation 2"], "developers": ["Midway Games", "Midway Studios Chicago", "GameStar"], "genres": ["Action", "Shooter"], "publishers": ["Capcom", "Midway Games", "Midway", "Midway Home Entertainment", "Noviy Disk", "ZOO Digital Publishing", "Midway Home Entertainment.inc"], "esrb_rating": "Mature"}