{"id": 364, "slug": "breach-clear", "name": "Breach & Clear", "name_original": "Breach & Clear", "description": "<p>Breach &amp; Clear brings deep tactical strategy simulation to PC, Mac and Linux! Build your Special Operations team, plan and execute advanced missions, and own every angle.<br />\nChoose your real-world squad -- US Army Rangers,  Germany&#39;s KSK, Canada’s JTF2, UK SAS, and more -- and take on a variety of foes with different skill-sets and abilities. Learn to approach, engage, and dominate your opponents through superior tactics and training. The Steam version of Breach &amp; Clear includes all the premium content from the original mobile game at no additional cost.FULL CUSTOMIZATION<br />\nBuild your arsenal with thousands of gun combinations, and specialize each soldier with a combination of perks, tactics, camo, armor, and inventory all tailored by you. Tune your load-out with consumables like UAV Drones and Breaching Charges that can change the course of battle!OWN EVERY ANGLE<br />\nEach soldier matters, every decision counts. Plan your mission step-by-step: split up your team and assault the map from multiple entrance points, set routes and fields of fire, use cover and outflank your foe.REALISTIC, TACTICAL COMBATDeveloped with help from members of the Special Operations Forces community, Breach &amp; Clear features actual close-quarters combat tactics and a variety of door-breaching techniques. Soldiers equip real-world weapons and gear. Firefights take place in real time.</p>", "metacritic": 60, "released": "2013-07-18", "tba": false, "updated": "2023-04-14T13:27:53", "background_image": "https://media.rawg.io/media/screenshots/b26/b26d0e99c94a49553dba749c2667fd0f.jpeg", "website": "http://www.breachandclear.com", "rating": 2.78, "rating_top": 4, "added_by_status": {"yet": 40, "owned": 880, "beaten": 6, "toplay": 4, "dropped": 26, "playing": 1}, "playtime": 3, "achievements_count": 77, "ratings_count": 42, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 45, "platforms": ["PS Vita", "iOS", "PC", "macOS", "Linux", "Android"], "developers": ["Mighty Rabbit Studios", "GUN MEDIA HOLDINGS", "Gun.", "Gun Media"], "genres": ["Action", "RPG", "Strategy", "Simulation"], "publishers": ["Devolver Digital", "Good Shepherd Entertainment", "Gambitious Digital Entertainment", "Gun Media Holdings"], "esrb_rating": "Teen"}