{"id": 364075, "slug": "cool-goal", "name": "Cool Goal!", "name_original": "Cool Goal!", "description": "Aim your ball, shoot, and SCORE! Just make sure you don’t hit the ENTIRE opposing team before you hit the net.<br/><br/>Meet Cool Goal - the football game that puts your aiming, shooting, and logic skills to the test! Your task? Land the perfect goal, every time. To do so, you’re going to need to make sure you dodge countless enemy players, that are going to do everything they can to stand in between you and the goalposts! Experience a new breed of ‘football game’ that tests your brain power as well as your ball skills.<br/><br/>Explore countless puzzles in a near endless gameplay experience as you step up your ball game and master the art of soccer. Embrace exciting mechanics such as curveball that lets you magically curve your ball like a football superstar. Also, when you nail a perfect goal watch as your ball bursts into flames - you won’t be able to believe how wild this football puzzler can get!<br/><br/>As you progress, you’ll unlock new levels, new challenges, new stadiums, and tons of awesome football action! Each level offers a unique challenge that will test your ability to get to the goalposts, as opposing players adopt new positions, move, create obstacles, and do anything they can to stop your strike! Each new stadium also presents a unique look and theme - imagine, football in the forest and goalposts on the beach because anything can happen in Cool Goal!<br/><br/>Get ready for unbeatable soccer action that puts your head to the test as well as your boot! It’s time to welcome the king of football games and get your Cool Goal on!", "metacritic": null, "released": "2019-08-09", "tba": false, "updated": "2019-09-13T06:06:35", "background_image": "https://media.rawg.io/media/screenshots/a39/a39adecbdde318901093722c0c52586c_RcbyevV.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Gismart", "Harmonybit"], "genres": ["Action", "Casual"], "publishers": ["Harmonybit"], "esrb_rating": null}