{"id": 364125, "slug": "snowscooter-fm3d", "name": "Snowscooter FM3D", "name_original": "Snowscooter FM3D", "description": "Grab your snow scooter and get ready to skate like a pro down the mountain! Theres so much to do in this free game!<br/><br/>- Ride your scooter, do awesome tricks, stunts, flips grinds and more!<br/>- Customize your character, and your scooter!<br/>- Earn skill points to level up your characters!<br/>- 3 different game modes: Arcade, SKATE and Free Mode!<br/>- Create your own mountains to skate! <br/><br/>Feel like a pro, blasting down the mountain on your snow scooter, doing every cool trick you can think of.<br/>Customize your character with different clothes, and scooters!<br/>Earn skill points to level up your skill and do even crazier tricks!<br/>Enjoy the 3 different game modes: Arcade - Score as many points as you can in 150 seconds. SKATE - Can you do the tricks youre asked to, without falling and getting all the letters in SKATE? Free mode - Where you can just ride around, with no purpose or goal, other than to have fun!<br/>You can also create your own maps, with ramps, quarter pipes, rails and more, and skate around in them! <br/><br/>So what are you waiting for, try it out now! <br/><br/>The game is developed by independent developer EnJen Games. Follow EnJen Games on www.facebook.com/EnJenGames, to request new features, report bugs, or get the latest news about new EnJen Games or updates!", "metacritic": null, "released": "2016-04-28", "tba": false, "updated": "2019-08-12T03:17:23", "background_image": "https://media.rawg.io/media/screenshots/09e/09ed72be7cac4f415ee1dba1868a9517_jj6EMlY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nicklas Jensen"], "genres": ["Sports"], "publishers": ["Nicklas Jensen"], "esrb_rating": "Everyone 10+"}