{"id": 364298, "slug": "wonderfridge", "name": "WonderFridge", "name_original": "WonderFridge", "description": "<p>Authors notes:</p>\n<p>I wrote this game for several reasons. <br/>   Mainly I wanted test the little fully managed XNA engine that I developed over the past months. It should facilitate flexible Windows / XBox360 games development. Of course I could have taken TorqueX 2D<br/>but I wanted to get to know C# and XNA more indepth - so writing a small engine bottom up seemed reasonably.</p>\n<p>   Furthermore I wanted to implement a game design that I think can be considered \"addictive\". The monthly contest of the website \"experimental<br/>gameplay project\" for June/July 2010 inspired me to do that. You find<br/>it here: http://experimentalgameplay.com/blog/2010/06/two-months-of-casual-addiction/<br/>Great site! (If anyone of experimental gameplay reads this: Big props to you guys! And sorry, that I could not / did not want to finish this prog in one week. In my eyes the polishing is quite important to make a game 'addictive'. Of course this game is far from being shiny. But on the other hand it´s not a *completely rough*<br/>prototype either, which I think would not be addictive at all. :-) Building upon a fairly working version of my engine, the development took 2 weeks. But only 1 week was actually spend on gameplay related content and mechanics. The other week was spend on<br/>extending the engine (mainly by fully managed XNA-native GUI elements),<br/>and on polishing this small game a little bit. I am looking forward to future challenges!) But what (if so) makes this game addictive? Mainly I think it is the<br/>same effect, that keeps player´s searching for better equipment in games<br/>like WoW, Diablo, Torchlight and similar. Everytime you beat a baddie<br/>in these games you find yourself curious what items it might drop.<br/>Most of the time the items are worthless junk. But sometimes and more<br/>important *randomly* you find items that are of high value inside of the game. It is also this 'random effect' which keeps people playing one-armed bandits and similar machines with real money. They ignore<br/>the fact that they creepingly lose money. Simply because if you win randomly, you always have the small hope that the next try will be *the* big win. Possibly this will make you play \"WonderFridge\" for<br/>hours. You always hope to get another \"NEW ITEM!!!\" and play<br/>for another \"just a few seconds\", that sum up to minutes, which sum<br/>up to ... hmmm ... let´s see, if the concept really works out. :-)</p>\n<p>   And last, since codemachinery targets being a professional independent games developing firm, this small project serves as kind of a \"Hello World!\" for the company itself. This very first project should provide me a grip of all the implied steps to produce a positive<br/>and fun gaming experience. In the main menu of this game you find 2 options that are hopefully helpful in getting the brand of \"codemachinery\" more known. The first option works like a hardcoded link to our website. The other one prepares an e-mail ready to be send to friends to spread the word about this free fun game. These<br/>kind of menu options are commonly found in \"XBox LIVE Indie Games\",<br/>so I thought it would be a good idea to include it here in order to<br/>make us more known.</p>\n<p>   It is left to say that especially I want to thank the artists whose music titles and sound samples I was allowed to use under diverse Creative Commons licenses. You guys facilitate work of indies<br/>like codemachinery in a significant way! Thank you very much!<br/>Please find the detailed list of all contributors, their contacts<br/>and the licenses and conditions under which their work was used in the<br/>attached file License.txt. Below you find just a short listing:</p>\n<p>Music Tracks:<br/>\"Maybe Someday Blues (instrumental)\" by oldDog<br/>\"Paloseco Brazz Samples 2\" by The Paloseco Brazz Orchestra / Waldhorn33</p>\n<p>Sound Samples:<br/>\"17638_fonogeno_refrigerator01.wav\" by Fonogeno<br/>\"15393_dobroide_fridge.door.wav\" by dobroide<br/>\"16443_kkz_Raga_Loop.wav\" by kkz<br/>\"94792_jbates18_utensil_clink.mp3\" by jbates18<br/>\"5648_pushtobreak_valihaloop1_8.aif\" by pushtobreak<br/>\"22952_acclivity_Cheer.wav\" by acclivity<br/>\"60026_qubodup_swosh_39.flac\" by qubodup</p>\n<p>   You are welcome to drop us some lines. Any feedback is highly appreciated: anyway if you deem this program as a complete waste of time or you cannot stop playing it out of sheer pleasure.<br/>Please write to: feedback(at)codemachinery.net</p>\n<p>Please visit us at http://codemachinery.net to find more info on<br/>codemachinery and get news on upcoming games.</p>\n<p>Harry Trautmann<br/>on Friday 2010-07-30</p>", "metacritic": null, "released": "2019-08-11", "tba": false, "updated": "2019-08-12T05:42:56", "background_image": "https://media.rawg.io/media/screenshots/4f5/4f5507143a15152f3212f00e16474995.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jireugi"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}