{"id": 364306, "slug": "happy-fox", "name": "Happy Fox", "name_original": "Happy Fox", "description": "<p><strong>The Game</strong></p>\n<p>Simple platform game for kids aged 5 to 10. Due to its very low difficulty level it can be the first platform game where kids can learn how to play such games.</p>\n<p>Player controls cute fox that runs, jumps and shoots balloons. In each level he has to find door to the next one. Game is divided into 3 episodes - 8 levels each. Every restart of the game player starts from first level (like in classic Mario or Adventure Island) - thanks to this young player learns how to play platformers. Some of the levels have alternative routes that are little harder but quicker. Some of the levels have hidden doors that enables player to skip number of levels (just like in classic platformers).</p>\n<p>Enemies only disturbs our hero but never kills him. They can be disabled by balloons shot by fox.</p>\n<p><strong>Episode 1</strong></p>\n\n<p>Introduces basics of platform games - moving, jumping and collecting stuff.  Player learns how to shoot balloons and avoid enemies. Look for hidden door in level 4. First levels have alternative quicker routes.<br/></p>\n<p><strong>Episode 2</strong></p>\n\n<p>Bigger maps, new enemies. This episode focuses on prcise jumping. Look for hidden door in level 4.</p>\n<p><strong>Episode 3</strong></p>\n<br/>\n<p>Move vertical maps. Some enemies can shoot.</p>\n<p><strong>The Project</strong></p>\n<p>This game is a result of my first contact with Godot game engine (godotengine.org). Made in one month while learning the engine (movement, collisions, tilemaps, enemy behaviours, GUI, Audio etc.). Game uses graphics from Kenneys graphics library (kenney.nl).</p>\n<p>Supports keyboard and gamepad controls.</p>\n<p>Its totally free and contains no ads, paywalls or lootboxes - your kid can play it safely.</p>", "metacritic": null, "released": "2019-08-11", "tba": false, "updated": "2019-08-12T05:44:39", "background_image": "https://media.rawg.io/media/screenshots/51e/51ea8335673860e4fa0a30c7e13a07dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["rafalkowalski"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}