{"id": 3643, "slug": "one-piece-unlimited-world-red", "name": "ONE PIECE Unlimited World Red", "name_original": "ONE PIECE Unlimited World Red", "description": "The New World and its fierce challenges await Luffy and his Straw Hat Crew. In ONE PIECE Unlimited World Red, players will live the complete Pirate adventure thanks to fun-filled escapades, action-packed battles and powerful allies in a whole new never-before-seen scenario. <br/>ONE PIECE fans will be able to play as all of their favorite Straw Hat crew members and progress through the episodic storyline where they will be challenged by famous boss battles such as Rob Lucci, Caesar Clown, and more! Mastering many skills will be mandatory in order to execute numerous flashy combos, dodge or interact with enemies etc.! Just like in the original manga, when things get bad, players will be able to get some help from a friend in exciting co-op gameplay to beat down strong opponents, or simply enjoy mini-games such as fishing, bug-catching and more!<br/><br/>Some functions and features may not be available on PlayStation TV.<br/><br/>Ad Hoc Mode 2-4 Players<br/>832KB Minimum<br/>Touchscreen<br/>Dual Analog Sticks<br/><br/>  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account. <br/><br/><br/>Game © 2014 BANDAI NAMCO Games Inc.", "metacritic": null, "released": "2013-11-21", "tba": false, "updated": "2023-07-09T21:25:29", "background_image": "https://media.rawg.io/media/screenshots/75e/75efcf56e5f47ddce9cac1c8d5eb9dda.jpg", "website": "http://www.bandainamcogames.com/game/one-piece-unlimited-world-red.html", "rating": 3.31, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 71, "beaten": 15, "toplay": 5, "dropped": 7}, "playtime": 0, "achievements_count": 18, "ratings_count": 16, "suggestions_count": 534, "game_series_count": 35, "reviews_count": 16, "platforms": ["PlayStation 3", "PS Vita", "Wii U", "Nintendo 3DS"], "developers": ["BANDAI NAMCO Entertainment America", "Ganbarion", "GANBARION CO."], "genres": ["Action", "RPG"], "publishers": ["Bandai Namco Entertainment", "BANDAI NAMCO Entertainment US"], "esrb_rating": "Teen"}