{"id": 364311, "slug": "zpaceheroez", "name": "ZpaceHeroez", "name_original": "ZpaceHeroez", "description": "<p><strong>Ingame Controls</strong><br/></p>\n<p>W - Steer Spacefighter Up<br/>S - Steer Spacefighter Down<br/>A - Steer Spacefighter Left<br/>D - Steer Spacefighter Right<br/>SPACE - Shoot<br/>F1 - Switch Sides<br/>ALT + ENTER - Switch between Fullscreen and Windowed Mode<br/>   (Note: you may have to adapt the settings in Configs\\Settings.ini first.)<br/>ALT + F4 - Quit Game ;-)</p>\n<p><strong>Authors notes</strong></p>\n<p>This game is one of the experimental games of codemachinery. The aim<br/>is to increase skills in game development and getting some more samples for the showcase.<br/>Just like the previous experimental games this game is more of a design<br/>study than a program you could charge real money for. Therefore it´s<br/>available for free to anyone who finds pleasure in it.</p>\n<p>This game´s idea originated a monthly contest of the site \"experimental<br/>gameplay project\", which can be found here:<br/>http://experimentalgameplay.com/blog/2010/09/neverending-in-september/<br/>The goal of that contest was to build a \"neverending\" game. So I thought<br/>of things that do not end. Unfortunately \"war\" seems to be something that falls into that category. While most of us know, that real war is<br/>a terrible thing, we all (well, at least males) see a \"space war\" as a source of neverending excitement. Add some \"zapzapzap\"-Sounds and<br/>laserlike graphics and there you are. :-)</p>\n<p>   As always it´s left to say that especially I want to thank the artists whose music titles and sound samples I was allowed to use under diverse Creative Commons licenses. You guys facilitate work of indies<br/>like codemachinery in a significant way! Thank you very much!<br/>Please find the detailed list of all contributors, their contacts<br/>and the licenses and conditions under which their work was used in the<br/>attached file License.txt. Below you find just a short listing:</p>\n<p>Music Track:<br/>\"Her Secret Kingdom\" by IceSun</p>\n<p>Sound Samples:<br/>\"60026_qubodup_swosh_39.flac\" by qubodup<br/>\"18397_inferno_smalllas.wav\" by inferno<br/>\"28917_junggle_btn107.wav\" by junggle<br/>\"3161_suonho_suonho_Probed.wav\" by suonho<br/>\"33629_themfish_bulb_smash.wav\" by themfish<br/>\"34205_themfish_zoup.wav\" by themfish<br/>\"39459_THE_bizniss_laser.wav\" by THE bizniss<br/>\"40158_sagetyrtle_crash.wav\" by sagetyrtle<br/>\"slumlord horns\" by lotagblanco</p>\n<p>   You are welcome to drop us some lines. Any feedback is highly appreciated: anyway if you deem this program as a complete waste of time or you cannot stop playing it out of sheer pleasure.<br/>Please write to: feedback(at)codemachinery.net</p>\n<p>Please visit us at http://codemachinery.net to find more info on<br/>codemachinery and get news on upcoming games.</p>\n<p>Harry Trautmann<br/>on Tuesday 2010-09-28</p>\n<p>version 1.0.2</p>\n\n<p>Game Website: http://codemachinery.net</p>", "metacritic": null, "released": "2019-08-11", "tba": false, "updated": "2019-08-12T05:45:51", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9a2278d942c44f21b3390bd95802334.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jireugi"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}