{"id": 364514, "slug": "nathan-powells-wild-araz", "name": "Nathan Powell's Wild Araz", "name_original": "Nathan Powell's Wild Araz", "description": "<p><strong>Story</strong></p>\n<p>Living in a Zoo basement cleaning an empty zoo was never your idea of a dream, but when a new zoo director takes over you'll start an adventure of a lifetime. There's more to filling the Zoo with animals then meets the eye. When you stumble upon a plot that affects the whole of Antiford, you'll discover there's more wild things in Araz than the animals.</p>\n<p>Learn the world.  Catch some creatures.  Save Antiford!</p>\n<p>Based on the fictional world of Citizens of Antiford (dot com). Featuring locations, characters, and plot lines from the community of steampunks and writers from the website.</p>\n\n<p><strong>Gameplay</strong></p>\n<p>Explore the world to discover secrets, lore, and side-quests to help you on your quest. Follow the Main Quest to unlock new locations and equipment to assist you with exploring the world.</p>\n<p>Follow in your father's footsteps by choosing one of four classes; Soldier (Main/Easy), Doctor (Support/Harder), Thief (Harder), and Engineer (Medium). Each class will affect how hard you hit, your special abilities, and even some equipment you can use.</p>\n<p>You can unlock companions to help you in a fight by completing their side-quests. Team up with some of the most active members on the website like Captain Leo Swift and Rilain Mortador to add some variety to your game.</p>\n<p>Use a new special ability called Steam Power to power gadgets and weapons found, made, and bought around the world of Antiford. Steam Weapons and Gadgets help you hit harder, live longer, and see you to victory.</p>", "metacritic": null, "released": "2019-08-10", "tba": false, "updated": "2019-08-12T06:32:21", "background_image": "https://media.rawg.io/media/screenshots/ba2/ba2c192318b80e416a6e60279a43c963.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Citizens of Antiford", "comedianmasta"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}