{"id": 364645, "slug": "murder-mansion", "name": "Murder Mansion", "name_original": "Murder Mansion", "description": "<p>An empty dark room with a lack of light, what did you feel when you got into some dark places with blood and corpses alone. No one could even expect of the person who did a brutal acts to these death people. Someone was looking for you, chasing you until death. Run like a little weak mouse. Close the door when the cat about to use its claw to scratch your skin.</p>\n<p>Sarah used to remain her older brother Nathan to lock the house, but Nathan did a fatal mistake to let an unknown person got inside. It was too late for Nathan to stop him, he was tall... he held a knife on his left hand and something bad happened to Sarah as well when she looked around her parents room. She's been knocked out by the unknown person who just already got inside her parents room. He gave her a big smile before she passed out on the floor.</p>\n<p>As she awakened later on, she didn't know what just happened to her. But the only thing she knew was she has been kidnapped inside someone's room that wasn't her house. She heard a screaming man from the next room and smelled a rancid blood.</p><p>Welcome to my first unity Game.</p>\n<p>So here is the game that I made with unity, the game was inspired by the game called Dead by Daylight. The Objective of this game is to find a way to escape from a creepy mansion with a killer inside of it. The killer will patrol around to find you and of course, you have to avoid the killer as well or he will spot you. If he spotted you, you need to use door to block him and so do the Killer will break down the door as well, you have to run away as far as you can from the killer to stop the chase... so yeah, have fun with the game. Any feedbacks are very welcomed from many people.</p>\n<p>Thanks</p>\n<p>Jeff The Killer - https://www.deviantart.com/lagoon-sadnes/art/Jeff-The-Killer-RPG-Sprites-3534710...<br/>Zoey - https://www.deviantart.com/demontomat0/art/Survivor-Sprites-WIP-213137373<br/>Tilesets :<br/>1. https://opengameart.org/content/lpc-house-interior-and-decorations<br/>2. https://opengameart.org/content/lpc-submissions-merged<br/></p>\n\n\n<p><strong><em>Note : We did not own rights to these arts, musics, images, SFX, and fonts .</em></strong><br/></p>", "metacritic": null, "released": "2019-08-10", "tba": false, "updated": "2019-08-12T07:09:32", "background_image": "https://media.rawg.io/media/screenshots/1cc/1cc66377ef992eacd87eaa9c224dd503.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Virbonis"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}