{"id": 364734, "slug": "tetralogical-itch", "name": "TetraLogical (itch)", "name_original": "TetraLogical (itch)", "description": "<p><em><strong>A turn-based slotting in / strategy game with a BIG twist!</strong><br/></em><br/><em><strong>Play either solo (un-timed, or against the clock, or even the addictive new BLITZ!, LIMITED MOVES, and PUZZLE modes!), or against up to 3 CPU *or* Human opponents.</strong><br/></em><strong><em><br/>Take turns to place your Tetramino pieces onto the board, trying to score the maximum points you can with your current piece, each turn. (and in TIMED modes, in as fast a time as you can for bonus points, and be quick! - or you may lose your turn...)<br/><br/>BIG points are not the ONLY way to play the game - you can also play sneakily (as well as strategically) too, to stop your opponents from getting a better score, or force the end of the game by blocking potential moves by your opponents! - Once the board is exhausted, a one-time DOWNFALL can turn the tide, and create a few more moves!<br/><br/>Blitz mode features an ever-decreasing meter that need topping up with the higher-scoring moves, and is a blast!<br/><br/>Limited Moves mode features a starting pot of moves, with no time limit, and again gives extra moves for great scoring moves!<br/><br/>The latest added 'Puzzle Mode' does away with mental arithmetic, and you can just concentrate on solving the puzzle layouts! (nearly 100 so far, and increasing with each update!) <br/><br/>I've just added automatic per-level Puzzle Mode save states too, so you can take a break and return to the bigger, trickier puzzles, whenever you like!<br/><br/><br/>PLEASE NOTE! - This game is STEAM-based, and I know that DRM can be a HUGE sticking point on here, but the only (and unavoidable) reason that I have to sell my game on ITCH.IO as Steam keys is that I use Steam's infrastructure / API functionality to add a lot of playability/value to my game (Leaderboards, Achievements, etc, and soon to be added - Cloud Saves, and Online (as opposed to the current Local) Multiplayer!).<br/><br/>I sincerely hope that you can appreciate that I'm in an unavoidable position of being tied to Steam key sales for this release as a result...    ...Thank you for your understanding, guys!</em></strong></p>", "metacritic": null, "released": "2019-08-07", "tba": false, "updated": "2019-08-12T07:31:13", "background_image": "https://media.rawg.io/media/screenshots/077/0776b7534321ed85e4712dcf28fc6603.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Japster's Cavern"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}