{"id": 364764, "slug": "chick-n-run", "name": "Chick-n-Run", "name_original": "Chick-n-Run", "description": "<p>A life in a fully packed Barn? - The nightmare of every chicken!</p>\n<p>Chick-n, the main character of this game, takes its opportunity<br/>and flees from its angry farmer to enjoy the free world. But the<br/>farmer is after the chicken - Can you help him escape?</p>\n<p>Note: this game is in its earlyest stages, more content will be added<br/>very soon</p>\n<p>Features:</p>\n<p>Food - You need to take care of food to not die by eating</p>\n<p>Corn - Eat this to regain food</p>\n<p>Custom Levels - With the help of the Level Creator you can create levels</p>\n<p>Flag - Collect this to complete a level</p>\n<p><em> And more</em></p>\n\n\n<p>To add:<br/>Items - Random items to pick up and use against the farmer</p>\n<p>Respawning and Lifes - When laying an egg, this will create a respawnpoint</p>\n<p>Multiplayer - One is the farmer and the other one the chicken</p>\n<p>Better/More Graphics - The story will be animated soon</p>\n<p>Settings - This Button does absolutely nothing right now</p>\n<p>Android App - To play on your phone</p>\n\n<p>Your support is very appreciated! By donating you will receive the following rewards:</p>\n<p>1$+ Your Name will be added to the game</p>\n<p>10$+ You can talk with the developers and contribute to the game. You will also receive the source code <em>(You are not allowed to share the source code and claim it as yours)</em></p>\n<p><em>Make sure to contact us after you donated</em></p>\n\n<p>Feel free to send us your suggestions!</p>\n\n<p><em>Designed for the GamePlusPlus Community Challenge 17 by LetsGameDev</em><br/></p>", "metacritic": null, "released": "2019-08-09", "tba": false, "updated": "2019-08-12T07:37:44", "background_image": "https://media.rawg.io/media/screenshots/09b/09b9380ddd308d5d2e186a1864ceb8bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JJV"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}