{"id": 364877, "slug": "no-country-for-old-men", "name": "No Country for Old Men", "name_original": "No Country for Old Men", "description": "<strong>You will lead your family and crew to wander between the stars in this vast universe - sailing forever is a curse and a fate .Countless lives pass, resident, and annihilate in endless voyages.</strong><br/><strong>This game draws on experience from numerous simulation games and strategy RPGs, it combines a variety of fun ways to play, and will always surprise you.</strong><br/><br/>⚪\tFind your partner, combine a variety of DNA,cultivate your role and the next generation.Will you be a good captain, or an invincible warrior, or an omniscient prophet?Or all above?<br/><br/>⚪\tLanding on all randomly generated unknown planets,you and your crew, with the skills learned from your father and the swords you have won from the enemy, will fight for your life and glory in  turn-based battles fullfilling with strategy and accident.<br/><br/>⚪\tThousands of weapons, vast treasures and materials, and countless skills,plus the rich lore and story, this game will completely satisfy your desire to collect and curiosity!<br/><br/>⚪\tAssemble your unique spacecraft, add and modify spacecraft modules, expand the capabilities of the spacecraft, and the game's features - You wanna be 2 times faster than the speed of light? no problem.<br/><br/>⚪\tLong time space wandering will not make you feel boring.Our story-teller system will tell you about the rise and fall of this universe, the light and darkness of this world, and of course it may tell you who's  your son’s true father... The story-teller system will not only tell stories for you, but also help you create your own space opera!<br/><br/>⚪\tYou can get along with your interracial crew, and of course you can be beaten by them.You can assassinate your best friend for a legendary necklace, and of course don't forget to beware of an alien wife who's very good to you.The relationship between people is so complicated, so how much humanity will be explored in this barbaric society?<br/><br/>If you have any interesting ideas, please visit our homepage or leave a message in the mailbox.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:42", "background_image": "https://media.rawg.io/media/screenshots/22b/22b5db0524ad1366511bf0316fd80e8d.jpg", "website": "http://www.whiteverse.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WhiteVerse Studio"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": ["WhiteVerse Studio"], "esrb_rating": null}