{"id": 364815, "slug": "grandia-hd-remaster", "name": "GRANDIA HD Remaster", "name_original": "GRANDIA HD Remaster", "description": "<p>GRANDIA HD Remaster is now available! Celebrate its exciting adventures once again!<br />\nGRANDIA tells the story of Justin, the protagonist, and his companions in a race against the evil Garlyle Forces to uncover the long-lost secrets of an ancient civilization. Experience the game that became an instant classic and is considered to be one of the most influential RPGs of all time.<br />\nOriginally created by Game Arts, developers of such classics as the Lunar series, GRANDIA was met with wide critical acclaim when released for the SEGA Saturn in 1997 and  PlayStation® in 1999. GRANDIA recieved numerous awards including GameSpot Editor&#39;s Choice, IGN Editor&#39;s Choice Award and an Award for Excellence from the CESA AWARDS &#39;97, currently known as &quot;Japan Game Awards&quot;.GRANDIA HD Remaster features: Enhanced UI, sprites, and texture art details<br />\nOriginal cinematic videos that have been visually enhanced<br />\nWidescreen support and customizable resolutions (PC only)<br />\nSteam cards and Achievements (PC only)<br />\nAudio: Japanese and English<br />\nLanguage Support: Original English and Japanese PLUS French and German translations<br />\nGamepad and keyboard support with remappable controls (PC only)</p>", "metacritic": null, "released": "2019-10-15", "tba": false, "updated": "2023-11-10T01:41:51", "background_image": "https://media.rawg.io/media/screenshots/940/9402c68b89b2ea5bd39503e4931431c4.jpg", "website": "https://www.gunghoonline.com/", "rating": 4.43, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 106, "beaten": 1, "toplay": 8, "dropped": 1, "playing": 3}, "playtime": 8, "achievements_count": 29, "ratings_count": 7, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["GAME ARTS", "Sickhead Games"], "genres": ["Adventure", "RPG"], "publishers": ["GungHo Online Entertainment America"], "esrb_rating": null}