{"id": 364821, "slug": "invaded-2", "name": "Invaded", "name_original": "Invaded", "description": "Global War has broken out, and all that remains of the worlds governments are remnant factions fighting for control of territories throughout the world. These factions take their most elite operatives and use them to neutralize enemy combatants and take control of their territory. You must fight your way to victory to become the last man standing. Can you be the one to take control of the battlefield? <br/>\n<br/>\r\nPlayers begin in the center and must work their way towards enemy flags placed in each corner in order to attack another players flag, or players may choose defend their own! Each player rolls their dice which allows them to traverse spaces for the amount rolled on the dice. Once a player reaches an enemy flag they will gain ownership of that flag and must return it to the center. If an enemy is sitting at a flag when you encounter them, the two players must battle. The winner of the battle has the flag returned to their their possession. Flags may be returned to their original square by their owner. In order to eliminate your opponents, you must drop off their flags in the center. Player's can gain an advantage by landing on various card slots to gain certain abilities that will aid or interfere with their mission!<br/>\n<br/>\r\nCompete for the top spot using the Steam Leaderboards!<br/>\r\nPlay solo or against your friends!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:44", "background_image": "https://media.rawg.io/media/screenshots/456/456c358f70ec9a4a763f4e4129257b6f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tim Harris", "Piotr Gębuś"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Rotating Games"], "esrb_rating": null}