{"id": 364891, "slug": "twice-reborn-a-vampire-visual-novel", "name": "Twice Reborn: a vampire visual novel", "name_original": "Twice Reborn: a vampire visual novel", "description": "<h3>If you crossed a vampire, would you protect humanity or embrace the blood?</h3><br/>In Twice Reborn, Mark Delaware a teaching assistant, becomes a newly-turned vampire in a community forced to hide in plain sight. His mentor, Michelson, has trusted Mark to become the Enforcer: a feared arbiter who keeps the quarreling vampiric houses following the Code. When arson kills key vampires in the community, it's up to Mark to either embrace his blood or to find a way to--somehow--regain his humanity.<h3>There Are Sacrifices to Make</h3><br/>Interacting with humans and vampires is a delicate balance. Not all appreciate Mark's decision and not all relationships can last. Some want him dead, others want him for their own. Mark's responses in the perilous community changes their reactions as well as the story's routes/endings.<h3>Survive the Night</h3><br/>Satiate Mark's bloodlust, otherwise he may kill innocents. The opportunities for blood will not always be private nor moral. <br/><br/><strong>Not all are who they seem to be.</strong><br/><br/><br/><br/><h3>Twice Reborn Features:</h3><br/><ul><li> Listen to a fully voiced cast of 30+ characters (audio dialogue is in English)<br/></li><li> Build a reputation among factions, earn friendships, and control Mark's bloodlust <br/></li><li> Experience a story with over 95,000 words <br/></li><li> Arrive to 20+ possible endings <br/></li><li> Experience a vampire drama with an optional romance and an apprentice to adopt<br/></li><li> Unlock art through a CG gallery as you achieve milestones in the story <br/></li><li> To be released for Windows and Mac</li></ul><br/><br/><br/>Advisory Warning:<br/>Contains flashing images, violence, moderate language, drugs/alcohol usage. Not suitable for all ages.<br/><br/>Help support in English only.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:41", "background_image": "https://media.rawg.io/media/screenshots/8b1/8b12e5766d59d8a1e1bbfcff36f41386.jpg", "website": "https://firststepcinematics.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["First Step Cinematics"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["First Step Cinematics"], "esrb_rating": null}