{"id": 364835, "slug": "absolute-territory", "name": "Absolute Territory", "name_original": "Absolute Territory", "description": "<strong>WE WANT YOU</strong> in the Imperial Space Force (ISF). Join us in protecting our borders from foreign and domestic opponents.  Only in the ISF will you fly state-of-the-art space superiority fighters to protect the heavens with fortitude, skill and precision.<br/><br/>Become the best of the best by training in our Digitum XR Sim, our most advanced simulated combat environment.  Adapt to the rigours of being a pilot in the ISF, learn the art of combat, and master every fighter and every weapon at your disposal.<br/><br/>Challenge your piloting skills by creating your own missions.  Develop unique scenarios envisioned from your imagination.  You decide the difficulty by adjusting the environment and opponents.  Fight with the most devastating weapons against lighter opponents or truly test your skills against-all-odds.<br/><br/><ul><li>1st and 3rd person space combat action.  <br/></li><li>Create your own missions with an easy to use and robust mission editor.  <br/></li><li>Fly multiple ships and configure their loadouts for optimum effect.<br/></li><li>Improve your combat skills against waves of increasingly difficult opponents.<br/></li><li>Or take up the ultimate challenge of flying the gauntlet against increasingly difficult opponents.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:43", "background_image": "https://media.rawg.io/media/screenshots/d88/d88404a20a50b3d93b920b4d97f6f4e7.jpg", "website": "https://digitumsoftware.com/portfolio/absolute-territory/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Digitum Software"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Digitum Software"], "esrb_rating": null}