{"id": 364874, "slug": "crazy-cage", "name": "CRAZY CAGE", "name_original": "CRAZY CAGE", "description": "<h3>ARE YOU TOUGH ENOUGH FOR THE CAGE?!</h3>Only the hardest fighters survive... or the best flappers and floppers. <br/><br/><br/>Each hit, bullet, or explosion you take raises your percentage. <br/>The higher your percentage the harder you get hit.<br/>The only rule in the cage is <strong>DON'T TOUCH IT!</strong><br/><br/>Arm yourself with whatever weapons you can find and smack the ever-living crap out of anyone that dares come near you.<br/><br/><strong>Why not practice your golf swing while you're at it? FORE!</strong><br/><br/><br/><br/><strong>Or DUAL-WIELD two shotguns and obliterate your foes</strong><br/><br/><br/><br/><strong>Just be careful of whats behind you, that knock-back can be brutal.<br/>So brutal in fact you can use it to your advantage to wildly fly around and take your mobility to the next level.</strong><br/><br/><br/><br/><strong>Don't like the layout of the arena? No problem. There's few problems land mines and an RPG can't fix.</strong><br/><br/><br/><br/><strong>And because we at Jamoly Co are committed to providing you with the most accurate physics simulation we understand no sim would be complete without being able to wildly flap melee weapons to gloriously fly through the sky.</strong><br/><br/><br/><br/><h3>FEATURES:</h3><br/><ul><li> <h3>CUSTOMIZE YOUR CHARACTER</h3>Customize each part of your ragdoll separately: the shape and color of your head, ears, body, outfit, eyes, and tail. Also includes a thicc option<br/></li><li> <h3>AWESOME MELEE WEAPONS </h3>Bats, boxing gloves, golf clubs, flyswatters, hockey sticks and more<br/></li><li> <h3>SUPER FUN GUNS</h3> All shoot bullets at least the size of a dodgeball.. or watermelon. Shotguns, snipers, machine guns, rifles and more<br/></li><li> <h3>EPIC EXPLOSIVES</h3> Rpgs, rocket launchers, grenade launchers, land mines, exploding bats &amp; exploding boxing gloves!<br/></li><li> <h3>HUGE GUN KNOCKBACK</h3>The huge knockback gives you tons of mobility and flight power, just be careful!<br/></li><li> <h3>MELEE WEAPON WINGS</h3>Use your melee weapons as wings and take to the skies. Requires timing your arm flaps correctly, also different melee weapons are more useful than others for flight. Flyswatter - great upwards lift, Boxing gloves - not so great lift<br/></li><li> <h3>FRYING PAN POWER</h3>Reflect projectiles - even rockets!<br/></li><li> <h3>Dynamic moving and destructible arenas</h3></li><li> <h3>4 player split screen &amp; 8+ player online matches</h3></li><li> <h3>AI BOTS</h3> Play against AI for practice or single player<br/></li><li> <h3>CUSTOMIZABLE UI SIZE</h3>In case you want it bigger or to get out of your way!<br/></li><li> <h3>COMPLETELY DRIVEN BY PHYSICS</h3> There are no animations (other than idle). Hits will do variable amounts of damage based on how hard you were actually able to hit them and what their multiplier is. Get a moving start and throw your whole body into it just like real life for maximum damage.<br/></li><li> <h3>A TRANSPARENT PERCENTAGE SYSTEM</h3>A player that gets hit at 0% will take hit forces multiplied by 1x, at 50% hit forces to this player are multiplied by 1.5x, at 100% hit forces are multiplied by 2x and so on.<br/></li><li><h3>A PASSIONATE DEV</h3>This is being made through passion and a love for gaming so community feedback is very important. There is a huge amount of potential this base game can provide and it will be supported with continuing new cool features as often as possible. A big goal is to get this to a point where workshop support can be added so the community can help too.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:42", "background_image": "https://media.rawg.io/media/screenshots/0c3/0c33dd150019bb6da2efde15336270d8.jpg", "website": "https://crazycage.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jamoly Co"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Jamoly Co"], "esrb_rating": null}