{"id": 364999, "slug": "realflight-9", "name": "RealFlight 9", "name_original": "RealFlight 9", "description": "<p>Realism Is Everything!<br />\nRealFlight® is the #1 radio-control flight simulator in the world. Powered by the industry-leading RealPhysics™ engine, and designed by both full-scale and RC pilots, flying in RealFlight feels more lifelike than any other simulator. This unmatched realism makes RealFlight an essential tool for any new RC pilots learning to fly. Likewise, experienced pilots love using RealFlight to practice new maneuvers and perfect their technique. Hone your skills in RealFlight&#39;s True-to-Life digital environment so you can pilot your physical models safely with confidence and style!New Aircraft From The Best Brands In RC<br />\nChoose from more than 160 different aircraft including airplanes, helicopters, drones, and more! RealFlight 9 adds over a dozen of the latest and greatest models from brands such as E-flite®, HobbyZone®, Hangar 9®, and Blade®:<br />\nE-flite Apprentice® STS 1.5m with SAFE® Technology<br />\nE-flite Delta Ray® One with SAFE Technology<br />\nE-flite Viper 70mm EDF with AS3X® and SAFE Select Technologies<br />\nE-flite Havoc Xe 80mm EDF with AS3X and SAFE Select Technologies<br />\nE-flite Timber® X 1.2m with AS3X and SAFE Select Technologies<br />\nE-flite Extra 300 3D 1.3m with AS3X and SAFE Select Technologies<br />\nE-flite EC-1500 Twin 1.5m with AS3X and SAFE Select Technologies<br />\nHobbyZone Carbon Cub S+ 1.3m with SAFE Plus Technology<br />\nHangar 9 CubCrafters XCub 60cc<br />\nHangar 9 P-51D Mustang 20cc<br />\nHangar 9 Valiant 10cc<br />\nBlade 230 V2 with SAFE Technology<br />\nAnd more!New Training Features<br />\nLearning to fly can be tough. Luckily, RealFlight 9 introduces a great new Flight Training feature that will help you get off the ground. Fly along with voice-guided demonstrations to build the foundational skills you need to master the controls and pilot your aircraft like a pro.Additional RF9 Features<br />\nCompatibility with Oculus Rift and HTC Vive VR headsets<br />\nOver 40 scenic flying sites including 3D fields and PhotoFields<br />\nEli Field as a brand new PhotoField<br />\nAn intuitive, updated controller system that allows for greater customization and a vast scope of controller compatibility<br />\nA challenge system that will push your skills and provide  you with hours of entertainment<br />\nOnline multiplayer capability so you can compete with your friends and rise to the top<br />\nAircraft and airport editors for maximum customization and personalized content<br />\nA number of various gadgets that can help you improve your skills at the most granular level<br />\nMulti-lingual navigation supporting English, German, French, Italian, and Spanish (Spain)Controller Required<br />\nRealFlight 9 requires a controller to run and supports a large number of options:<br />\nOption 1 (Recommended): For the best experience, we strongly recommend the Spektrum™ InterLink® DX simulator controller. It is specially designed for RealFlight 9 and all your controls will come pre-configured by default.<br />\nOption 2: Use your own RC Radio with an interface. The Spektrum WS1000 wireless dongle works well for this, and there are other 3rd-party wireless interfaces available. This option will require some user setup.<br />\nOption 3: Use any 4-axis game controller such as a gamepad or an advanced flight stick.<br />\n*Note: See the Announcements and Community Discussion for purchase links.</p>", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2023-04-10T15:19:54", "background_image": "https://media.rawg.io/media/games/de5/de5655682ab7939b764de42b670a178c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 24, "achievements_count": 5, "ratings_count": 1, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Knife Edge Software"], "genres": ["Simulation", "Racing", "Indie"], "publishers": ["Horizon Hobby"], "esrb_rating": null}