{"id": 364966, "slug": "woodfel", "name": "Woodfel", "name_original": "Woodfel", "description": "Woodfel is a multiplayer, open-world building &amp; crafting game.<br/><br/><br/><br/>As a new traveller to the land of Woodfel, you will discover a primitive fantasy world of creatures, monsters and factions! The usually peaceful hills &amp; valleys that the Woodfolk roam are becoming more dangerous with the arrival of Demons to the realm. While you strive to prosper in this new land you will find powerful weapons, craft enchanting vanity outfits and build epic structures in which to shelter. Will you help the Woodfolk to survive against their new foes, or take the side of the Demons and plunder the realm?<br/><br/><h3>Features</h3><ul><li><strong>Cross Platform Multiplayer</strong> - Play with your friends on PC &amp; Mac<br/></li><li><strong>Crafting &amp; Farming</strong> - Gather raw materials from across the land or grow them to craft gear, building parts, and even airships!<br/></li><li><strong>Combat</strong> - Learn various magical and physical abilities to use in combat and for traversing the world.<br/></li><li><strong>Building</strong> - Build all the fantastic structures you can imagine, wherever you want!<br/></li><li><strong>Boss Battles</strong> - Gather your friends to take on the toughest baddies for some epic rewards.<br/></li><li><strong>Procedural World</strong> - Every world of Woodfel is a unique wilderness, ready for you to explore and cultivate.<br/></li><li><strong>Factions</strong> - Gain reputation with Woodfel’s various factions to unlock their special items, or fight their toughest champions for rare drops.</li></ul>", "metacritic": null, "released": "2018-08-07", "tba": false, "updated": "2020-02-19T14:35:54", "background_image": "https://media.rawg.io/media/screenshots/32a/32ad4e4efd7bdd2940a5178bf425b0fd.jpg", "website": "http://www.woodfel.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["L3fty Games", "l3ftybot"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["L3fty Games"], "esrb_rating": null}