{"id": 364926, "slug": "across-the-grooves", "name": "Across the Grooves", "name_original": "Across the Grooves", "description": "Across the Grooves is an interactive graphic novel, set in a magical-realism universe. Your decisions affect the destiny of Alice, drastically changing her reality and allowing her to explore alternative destinies by modifying her past.<br/><br/><br/><br/>Alice lives an uneventful life. She’s in a long term relationship, has a stable office job and a nice apartment in the center of Bordeaux. One day, Ulysse, her ex-lover, comes back into her life through an old vinyl record she receives in the mail. When she puts it for a spin on turntable, she is thrown back into her own past, forced to relive old events. When she comes back to the present, her reality has changed.<br/><br/>Determined to bring her life back on track, Alice packs up and embarks on a hunt across Europe, following the tracks of Ulysse while trying to uncover the origins of the record. However, her journey gradually turns into a quest of self-discovery as she explores new parallel realities each time she puts the needle in the groove.<br/><br/><br/><br/><ul><li> A hand-crafted adventure — With each playthrough, discover a novel-sized adventure and a slice of the hundreds of hand-drawn images created for the game.<br/></li><li> Every choice matters — Each decision you make slightly alters the personality of the main character, Alice.<br/></li><li> An invitation to travel — Feel the pulse of European cities, meet colourful characters and solve the mystery, all depicted in gorgeous European comic book art style.<br/></li><li> Immersive and finely crafted soundtrack — The music adapts and shifts according to your choices and the mood of each scene.<br/></li><li> High replayability — Choose Alice’s fate and discover the outcome of your decisions through multiple story paths and endings.</li></ul>", "metacritic": null, "released": "2020-06-17", "tba": false, "updated": "2020-12-16T15:23:02", "background_image": "https://media.rawg.io/media/screenshots/733/733dc26b6d4f3dc842548b3e426686f1.jpg", "website": "http://www.acrossthegrooves.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 20, "owned": 22, "beaten": 1, "toplay": 7}, "playtime": 7, "achievements_count": 24, "ratings_count": 1, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux", "Nintendo Switch"], "developers": ["Nova-box"], "genres": ["Indie"], "publishers": ["Nova-box"], "esrb_rating": "Mature"}