{"id": 364949, "slug": "outstation", "name": "Outstation", "name_original": "Outstation", "description": "Outstation is a shoot em up that takes place during a new frontier of space exploration. Nebula mining operations have spread far across the galaxy with a rising need for protection from marauders looking to steal the resources harvested.<br/><br/>As a mercenary, you have taken up a contract to protect one of these mining operations on a pay-per-kill basis. (Your account will be credited for every ship you destroy)<br/><br/>The contract stipulates you are responsible for your own ship and the well-being of the station you are employed to protect. Upgrade and personalize your ship, fortify the station, and destroy the increasing waves of marauders!<br/><br/><strong>Features</strong><br/><ul><li>Free-roam shoot 'em up<br/></li><li>Defend the station from increasing waves of enemies<br/></li><li>Customize your ship and make it your own - every upgrade alters your ship's abilities!<br/></li><li>Upgrade the station to better withstand the barrage of enemies<br/></li><li>Purchase items to alter the battlefield before the enemy warps in</li></ul><h3>STORY</h3><br/><strong>A NEW GOLD RUSH</strong><br/>A new form of fuel has been discovered within the clouds of various nebulas and utilized for space travel bringing a rush for dominance over the budding industry. Throughout the galaxy, a number of mining operations have sprung up to harvest and refine this new fuel.<br/><br/>The heavy debris, radioactivity, and storms within the nebulas force mining operations to exist only on the outer edges leaving the operations exposed with mass amounts of very precious material.<br/><br/><strong>AN ARMY OF MARAUDERS</strong><br/>This rush to harvest fuel has lead to massive collaborations of corsairs that patrol the galaxy looking for potential mines to raid. Once a scout has found a mining operation, the group will warp waves of ships to its location to overwhelm and plunder.<br/> <br/><strong>AN ANSWER TO A NEED</strong><br/>Seeing an opportunity to satisfy the desire for money and combat, mercenaries began to offer protection services to mining operations. These mercenary contracts operate on a pay per-kill basis; depositing payment into the mercenary’s account instantly upon destroying a combative ship.<br/><br/>You have entered a mercenary contract with Cloud Energy Group (CEG) for protective services under a pay per-kill agreement.<br/><br/>You are responsible for your own ship, its components, and the safety of the mining facility. However, CEG has agreed to deliver, install, and repair any equipment you may purchase in your efforts to uphold this contract.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:39", "background_image": "https://media.rawg.io/media/screenshots/fd2/fd26d3d07a006c22f2eab403bc58c8bd.jpg", "website": "https://www.darkstonedigital.com/outstation", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DarkStone Digital"], "genres": ["Action", "Indie"], "publishers": ["DarkStone Digital"], "esrb_rating": null}