{"id": 364955, "slug": "reaktron", "name": "reaktron", "name_original": "reaktron", "description": "reaktron is a snake game. Minimalist. Fast-paced. Multiplayer. Online. Couch. Powerups. EVERYTHING!<br/><br/><h3>Sometimes, you need to reinvent the wheel</h3>reaktron is much more than an ordinary snake game! According to one of the developers - a slightly confused German neuroscientist - you could call it a psychophysical experiment that completely simulates the so-called broesel-physics. But than again, who cares?<br/><br/><br/><br/>With reaktron we tried to improve on a widely unknown minimalistic C64 game, which has been described as \"one of the best multiplayer games of all times on all formats!\" (Lagerfeldt, 2003-06-21). Easy-peasy. So we<br/><br/><ul><li> slightly extended the game mechanics.<br/></li><li> made it a couch-online-multiplayer game - quite a rare type of game.<br/></li><li> added the option to easily join and play via smartphone (no app required!).<br/></li><li> added power-ups, including the infamous and technically challenging REVERSER (it's time-warp mechanism makes reaktron probably the most complex snake game ever).<br/></li><li> and suddenly started to call power-ups reaktrons (WTF?!).</li></ul><br/><h3>Early access features</h3>Currently, a combined local and online multiplayer mode (there should be an established word for this. We propose the term \"remocal\" multiplayer game) lets you experience the game mechanics as follows:<br/><br/><ul><li> play with up to 12 (remote or local) players per match.<br/></li><li> play two types of levels: battle royale (survive or escape) and puzzle (unlock reaktrons).<br/></li><li> play a match of 48 rounds and collect the highest score to win.<br/></li><li> occasional puzzles spice-up the game and let you unlock up to 9 reaktrons (we could just say \"power-ups\" - but we don't!).<br/></li><li> unlock various Steam achivements.</li></ul><br/><h3>Our mutual vision</h3>Even though we have this plan of how the game might look like in the future, we'd be thrilled to get more people involved in the development of reaktron. Be a part of our community on discord, report bugs, tell us your wishes about the game and suggest extraordinary effects for new reaktrons (our way to say \"power-up\" - did we mention this already?).", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:11", "background_image": "https://media.rawg.io/media/screenshots/229/2291e4ebc32ba2bcef908cf0c6b3d67c.jpg", "website": "https://reaktron.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["insitubytes", "plapadoo"], "genres": ["Action", "Casual", "Indie"], "publishers": ["insitubytes", "plapadoo"], "esrb_rating": null}