{"id": 364964, "slug": "hand-and-stone", "name": "Hand And Stone", "name_original": "Hand And Stone", "description": "Hand and Stone — is an indie third-person RPG with open world and elements of survival games.<br/><br/>You play as a Mercenary — one of those brave enough to venture to places other people are afraid of… at least for a price. Once you find out that someone is more than willing to pay you generously for some old dusty book you realize that you should definitely be the one to find it. Together with allies you venture forth to the Southern regions — wild and dangerous badlands to explore dungeons of an old castle where the book you’re seeking is rumored to be. However, your squad is ambushed along the way. You are the only one who made it out alive. All you need to do now is to get to the ruins, find the book and survive. Or share the fate of your fallen brethren.<h3>Beautiful Graphics</h3><br/>Bright and juicy colors, amazing landscapes, beautiful forests, and also nasty dungeons and many other fabulous places await you.<h3>Interesting Gameplay</h3><br/>This is simply the beginning. Many adventures are ahead of you. It is up to you to decide how the world will remember you: as a talented warrior, a skilled survivalist or both.<h3>Equipment</h3><br/>You can find the necessary equipment for your preferred playstyle, be it a big long sword or a small sharp dagger, heavy knight’s armor or a light mercenary’s outfit, the decision is yours.<h3>Open World</h3><br/>Any self-respecting Seeker is obligated to never leave any stone unturned and any ancient ruin unexplored. Explore the world full of secrets and mysteries finding out more and more scary and interesting facts about this world.<h3>Building</h3><br/>You will need to build a shelter to survive. And it is up to you to see if it will endure.<h3>Craft, Craft, Craft!</h3><br/>Your swordsmanship skills alone are not enough to survive. You can craft new weapons and armor, brew potions, gather and plant herbs! All of this will help you in your adventures!", "metacritic": null, "released": "2019-12-20", "tba": false, "updated": "2019-11-01T02:14:32", "background_image": "https://media.rawg.io/media/screenshots/376/376ec112c44abc67ddf63685ae9c90ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vinn Entertainment"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Rock Path Collective", "Hase Games"], "esrb_rating": null}