{"id": 365044, "slug": "mailmen-free", "name": "Mailmen Free", "name_original": "Mailmen Free", "description": "★Help the Mailmen avoid the scary guard dogs now - looks stunning on all devices, even the NEW iPad!★ \"Mailmen is a fun game that people of all ages will enjoy. It’s extremely fun, humorous and engaging. I recommend this game to people of all ages and kinds.\" - App-Score.com.<br/><br/>Use strategy, stealth and puzzle-solving in Mailmen, featuring dangerous guard dogs versus determined Mailmen! Discover abilities to avoid guard dogs and use special skills to reach the end of each increasingly challenging level. Find special pick-ups and rewards in stunning cartoon environments!<br/><br/>A mailman’s task is meant to be simple – pick up and deliver the mail, then return to base. In the leafy suburbs of Greenville, that job is tougher than expected. An array of pesky guard dogs, mind-bending puzzles and ingenious villains are trying to defeat our heroic Mailmen. Controlling them, you'll need to use strategy, teamwork and unique special abilities to stay safe from angry canines!<br/><br/>STAY STEALTHY AND AVOID MANY DIFFERENT GUARD DOGS!<br/>Every breed of dog – from Chihuahua to Doberman – has a view cone that allows them to spot an unsuspecting Mailman. It’s important to plan a path, and react calmly if a dog gives chase!<br/>USE STRATEGY AND TEAMWORK TO SOLVE CLEVER PUZZLES<br/>Fear not if there’s too much for a single mailman to take on – mailman team-mates are always willing to help out and offer a solution.<br/>BAGS OF SPECIAL ABILITIES TO AMAZE AND AMUSE<br/>Every mailman has special abilities to get out of a jam, or to cleverly access a secret area or hidden item. They’re all enjoyable to use and fun to play around with whether it’s a sunny day or gloomy night!<br/>FIND SECRET PICK-UPS AND HIDDEN AREAS<br/>Anyone willing to use all of their abilities and awareness will discover numerous secrets around Greenville – rewards are there for the taking!<br/>ACCESS SAVED GAMES ON ANY DEVICE!<br/>Never mind if you’ve saved your game on a friend’s iPad you want to continue on your own device. Access your save game instantly on any device and play away to your heart’s content!", "metacritic": null, "released": "2012-04-30", "tba": false, "updated": "2019-08-16T04:34:53", "background_image": "https://media.rawg.io/media/screenshots/85c/85c4c47f38d181cc97b81854c70f4b2a.jpg", "website": "http://www.ayopagames.com/games/mailmen/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ayopa Games"], "genres": ["Strategy", "Puzzle"], "publishers": ["Ayopa Games"], "esrb_rating": "Everyone 10+"}