{"id": 365003, "slug": "uboat", "name": "UBOAT", "name_original": "UBOAT", "description": "UBOAT\nUBOAT is a simulator of a submarine from WWII era, yet different than all you have seen so far. It is a survival sandbox with crew management mechanics while its primary theme is life of German sailors. The boat is their home, but it can become their grave at any time.\n<br/>\n<br/>\nIn UBOAT you control the crew in order to control the boat. You look after their physical and mental health, because if the sailors are hungry, tired and their spirit is low, there’s no chance of winning even a skirmish.Survival\nThe extensive damage system is a foundation of the game's survival elements. Unprecedented situations are bound to happen as the effect of received damage, testing player's creativity and ability to stay calm. You can try to save the whole crew or leave someone behind, to save the others.\n<br/>\n<br/>\nWhile your ship travels through the open seas, you will often find yourself being on your own. Use your management skills to spend resources taken on the trip optimally and in special cases try to recover them on the sea, by asking your allies for the help... or by looting wreckages of enemy ships.\n<br/>\n<br/>\n<ul><li> Disable unnecessary devices, to keep your accumulators running for longer.\n<br/>\n</li><li> Tell your crew to stay in their bunks to preserve oxygen.\n<br/>\n</li><li> If crew's morale is low - play with them a session of Skat or play music from nearby radio stations, to fortify their hearts.</li></ul>Kriegsmarine careerDuring the playthrough you will receive assignments from the Kriegsmarine headquarters. They are never linear and you may receive additional orders during them or face unexpected problems.\n<br/>\n<br/>\nBrave completion of assignments from the headquarters is rewarded with additional budget for the unit under your command and with acceptance of your growing reputation as an u-boat's skipper. You will need that, to upgrade your ship and keep up with enemy's technological advances.\n<br/>\n<br/>\n<ul><li> Upgrade your boat for the rewarded funds.\n<br/>\n</li><li> Receive additional permissions for the reputation points.\n<br/>\n</li><li> Buy new equipment - new torpedo types, sonar decoys, CO2 absorbers and much more.\n<br/>\n</li><li> Send your officers on special tasks in the headquarters to, among other things, speed up a research of new technologies.</li></ul>Accurate simulationGame's simulation elements are very realistic, but that never comes at a cost of gameplay quality. Despite extensive simulation elements, UBOAT can be played like a regular game and complex matters can be learned later to become a better skipper for the commanded unit.\n<br/>\n<br/>\nEven small things like the influence of ballast in each compartment on the ship's trim (tilt) or Earth's curvature are faithfully reproduced in the game.\n<br/>\n<br/>\nPerfection can be achieved in many ways. Prove your management skills and swiftly assign work to your officers to speed things up. If, on the other hand, you think that if something needs to be done, it's better to do that on your own - sit behind the periscope, hydrophone or 88 mm deck gun and take matters in your own hands!\n<br/>\n<br/>", "metacritic": null, "released": "2019-04-29", "tba": false, "updated": "2022-10-18T11:54:14", "background_image": "https://media.rawg.io/media/screenshots/3a1/3a1c0a8cb967d6172e2d02f702ba35c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 10, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Deep Water Studio"], "genres": [], "publishers": ["PlayWay"], "esrb_rating": null}