{"id": 365088, "slug": "idle-fort", "name": "Idle Fort", "name_original": "Idle Fort", "description": "The most popular high-quality idle-merge game on the TikTok!<br/>Let's Go -- Get the highest level of Fort!<br/>Join your friends on the magical journey of “Brick-Breaker” and lead your Fort group into the traditional and classic game; against the bricks that come in the step by step!<br/><br/><br/>Warning: I am not a tower-defence game! Not even a brick-breaker!<br/><br/>Features:<br/><br/>1. No Need to Rush<br/>Set up your fort group, and your forts will be shooting for you automatically!<br/>Simply waiting and more power and a supreme fort!<br/>Even if you are offline, you will get a generous reward!<br/><br/><br/>2. Infinite Strategic<br/>More than 50 different levels of the fort are waiting for you to merge!<br/>Different attack effects, different shooting strategies, let you experience different bricks-breaker!<br/>Exploring the rare currency in the secret world and greatly enhancing your combat effectiveness!<br/>Enjoy the fun of the game with ease control!<br/><br/><br/>3. Rich Game Content<br/>Idle placement, automatic shooting, manual aiming, secret exploration, collection, merge!<br/>Daily challenges, Ranking ups!<br/>Endless exciting game content waiting for you to experience!<br/><br/><br/>5. To be a Challenger<br/>Join the fight of the ranks, and keep challenging your limits!<br/>Win the strongest badge that belongs to you!", "metacritic": null, "released": "2019-02-23", "tba": false, "updated": "2019-08-16T04:52:44", "background_image": "https://media.rawg.io/media/screenshots/f37/f378b181361b0b5056391825250105d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yojoy"], "genres": ["Strategy", "Casual"], "publishers": ["YOMOB INTERNATIONAL CO., LTDVistra Corporate Services Centre"], "esrb_rating": "Everyone 10+"}