{"id": 365033, "slug": "logic-dots-2", "name": "Logic Dots 2", "name_original": "Logic Dots 2", "description": "If you love solving ingenious puzzles, you need Logic Dots 2! A uniquely fantastic combination of Sudoku and Battleship, it's easy, addictive and logical to play. Place dots on the grid to make shapes and solve each puzzle. This award-winning puzzle sequel is simple and logical, but increasingly challenging.<br/><br/>Each brain-twisting Logic Dots 2 puzzle consists of a blank grid surrounded by numbers. Players need to find hidden dot lines and now shapes on the grid, making sure each row and column contains the indicated number of dots. This massively-anticipated sequel builds upon its acclaimed puzzle-board predecessor, the #1 puzzle-board game on the App Store with almost 1 million players in a week - incredible!<br/><br/>There are no time limits or move limits, and hints are freely given in some puzzles to make them easier on players. Beware though - as the game progresses, deduction challenges become increasingly devilish. Only true ‘Logic Legends’ will make it to the end of Logic Dots 2!<br/><br/>- USE LOGIC TO WIN: Place dots in the grid to create dot lines and shapes to solve each logic puzzle.<br/>- BEAUTIFUL PRESENTATION: Gorgeous, colorful levels are now even more of a treat for your eyes. Logic Dots is color-blind friendly as well!<br/>- INCREASE YOUR INTELLIGENCE: Logic Dots 2 sharpens logic deduction and improves cognitive skills in players.<br/>- NO PRESSURE, TAKE YOUR TIME: There’s no time limit and no move limit. Take as many goes and as much time as you want to complete each puzzle!<br/>- RENOWNED FRANCHISE: Logic Dots 2 is made by the lead programmer of the original Logic Dots, Logic Traces and hit puzzle game, Tiny Thief!<br/>- UNRIVALLED DEPTH: Over 200 unique and increasingly complex brain-teasers provide many hours of intellectual challenge and fun. Yet more new level packs will also be released in free updates very soon!<br/>- COMPLETELY FREE: Play all the way to the end with no in-app purchases required!<br/>- LEARN AT YOUR PACE: Seamless tutorials for players of any ability level.<br/>- COMPARE AND COMPETE: Your game score, Game Center achievements and leaderboards will show who’s the most logical of your friends. Surely it’s you?<br/>- FEEL FREE TO MAKE MISTAKES: Any logic errors can be corrected with unlimited undo’s!<br/>- HINTS IF YOU NEED THEM: If you get stuck, tap on the hint button and you’ll be puzzling again in no time!<br/><br/>As always, your amazing support and positive feedback is always much appreciated. We are working hard and will release new level packs in free updates very soon. Have fun!", "metacritic": null, "released": "2018-01-10", "tba": false, "updated": "2019-08-16T04:30:22", "background_image": "https://media.rawg.io/media/screenshots/55b/55b5f7a88295eefc551509b971fcbe83.jpg", "website": "http://www.ayopagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ayopa Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Ayopa Games"], "esrb_rating": "Everyone 10+"}