{"id": 365074, "slug": "grand-battle-royale-pixel-fps", "name": "Grand Battle Royale: Pixel FPS", "name_original": "Grand Battle Royale: Pixel FPS", "description": "Grand Battle Royale Season 2018! If you like military blocky pixel games and battle royale games then you will definitely like Grand Battle Royale!<br/><br/>BATTLE in online multiplayer games when you play the new massive open world game! Survive the battlegrounds, improve your shooting skills, and develop new PVP tactics for FREE!<br/>Jump out of the survival plane on the dead island, find the best loot, kill the enemies. Players are spread around the island unarmed and must find and use various weapons and items to eliminate opponents. Find the best weapons you can: Assault Rifle, pixel gun, smg, shotguns and other weapons. Dominate the battlefield by taking on each opponent and become last survivor #1! Grab your pixel gun and get shooting! <br/><br/>This game have 3 game modes:<br/><br/>BATTLE ROYALE <br/>The location of the battlegrounds is a distant island with dead city somewhere in the sea surrounded with a mysterious Blue Zone. Your main task is to stay inside the safe zone and eliminate all your enemies. <br/><br/>HIDE AND SEEK<br/>Players on one team hide as a Prop from other players in any room or try to escape! Simply swap and become any kind of hidden object — a bottle, a chair, a toaster, or even a fridge. Hunt the hidden props as a Hunter by finding and shooting at them! Action-shooter gameplay in popular Prop Hunt genre. <br/><br/>INFECTION<br/>Zombies vs Humans. In Infected (zombie infection), one player starts as the zombie and has to kill the rest of other players. If you are killed by a zombie, you also become a zombie, and you have to kill the other players. Last man standing wins the game! <br/><br/>Features: <br/>• Small download size without additional downloads after install.<br/>• There is no fake-bots players, only real online players. <br/>• it runs smoothly and does not overheat your device.<br/>• Pixel Graphics &amp; Blocky Characters: Battle as hilarious blocky characters and show your style of gameplay.<br/>• Survive gun games against other players!<br/>• Battle in Online Multiplayer Games: Intense PVP gameplay against players around the world!<br/>• Guns will randomly appear, so search the ground thoroughly! Survive by collecting more guns so you have an advantage over other players.<br/>• Just like in true 3D block city survival games, you can purchase any pixel block strike skins.<br/>• Grab a pixel gun and dive into battle: Fun pixel graphics great for intense shooting battles!<br/>• Big radiation island this is the place where you have to survive while you plaiyng in the block city. <br/>• Multiplayer game is absolutely free online game for download. <br/><br/>Become the last man standing, the last hero, the king of the battlefield! Good luck, good hunt!<br/>This game requires an internet connection.<br/>Don’t miss out on the latest news:<br/>Join us on Facebook: https://facebook.com/groups/grandbattleroyale/<br/>Follow us on Twitter: https://twitter.com/GameSpire_org", "metacritic": null, "released": "2018-02-23", "tba": false, "updated": "2019-08-16T04:44:56", "background_image": "https://media.rawg.io/media/screenshots/b45/b45e4ed3c1ed9bf320389c1a5c00c94d_KvfPTbO.jpg", "website": "http://gamespire.org/en/game/grandbattleroyale", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameSpire"], "genres": ["Action", "Casual"], "publishers": ["GameSpire"], "esrb_rating": "Teen"}