{"id": 365038, "slug": "bigbot-smash", "name": "BigBot Smash", "name_original": "BigBot Smash", "description": "*Enhanced for the new iPad!*<br/><br/>*****BigBot Smash, the amazingly fun and stress-relieving city stomping arcade game, is now FREE!*****<br/><br/>\"[This] top-down urban robotic rampage offers destructive fun, especially if you love big bots (and smashing stuff up!).\" - TouchArcade (4/5 Stars)<br/><br/>Humans have been oppressing you for decades, terrorizing robot-kind just because you’re big, metallic and scary. You’ve tolerated it long enough, but now they’ve made you mad. Mad enough to smash!<br/><br/>Humans have dismantled your robot sweetheart and scattered the pieces across the globe. So now it’s time for them to pay, and for true love to triumph. March across the globe and smash through the world’s cities to recover your sweetheart’s parts. <br/><br/>Key Game Features<br/>• Insanely fun pick-up-and-play gameplay. Tap to shoot or smash, and tilt or swipe to move. Then watch the buildings and humans fall by the wayside.<br/>• Three distinct robots to control: the tough Blockbot, wheel-riding Cyclobot, and hovering Grimbot.<br/>• Collect upgrade parts and advance your robot to lethal heights with upgrades like the Death Ray, Antimatter Pulse, and the “5 Million Angry Hamsters” power source.<br/>• Over 20 different cities to smash through, with unique city music that puts you in a globetrotting mood.<br/>• Extra game modes including Survival and Speed Demolition. <br/>• Multiple control methods so you can guide your robot rampage via simple swiping or tilting.", "metacritic": null, "released": "2011-12-01", "tba": false, "updated": "2019-08-16T04:32:27", "background_image": "https://media.rawg.io/media/screenshots/f04/f04e83730508f77e8a2be0db99e836bc.jpg", "website": "http://www.ayopagames.com/games/bigbot-smash/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ayopa Games"], "genres": ["Action", "Casual"], "publishers": ["Ayopa Games"], "esrb_rating": "Teen"}