{"id": 365149, "slug": "kepler-attack-for-watch", "name": "Kepler Attack for Watch", "name_original": "Kepler Attack for Watch", "description": "Top 5 Casual Game in the US!<br/><br/>Kepler Attack is an arcade game for your iPhone and Apple Watch. Fly through space and destroy waves of alien space invaders from Kepler-452b.<br/><br/>“I’m just amazed that this is on my Watch.” - Tom, host of The Apple WatchCast Podcast - http://www.applewatchcast.com<br/><br/>“I think this is actually my personal favorite new game now on the Apple Watch because of its really fast pacing which is perfect for these types of games.” - HotshotTek, 10 Awesome Apple Watch Games Apps of 2019<br/><br/>• Beautiful retro arcade graphics!<br/>• Fast paced alien attack waves with a variety of enemy space invaders!<br/>• Power-ups include Shield, Triple Shot, Rapid Fire and Smart Bomb!<br/>• Intuitive and simple controls using the Crown on the Watch!<br/>• Swipe to move on the iPhone!<br/>• Short burst gameplay is perfect for the Watch and iPhone!<br/>• Daily rank to see how you compare to the rest of the world!<br/>• Retro sound effects on the iPhone!<br/>• Play anywhere, anytime!<br/>• Runs at 60fps on the Watch!<br/><br/>Relive the glory days of the arcade on your Apple Watch and iPhone.<br/><br/>Background Story<br/>I made this space shooting game where you get to battle space intruders from Kepler-452b because of my love of classic retro arcade games from the eighties. The idea of a galaxy under attack from alien invaders and you, a lone space pilot with an advanced space ship is like a plot out of a sci-fi movie. <br/><br/>Protecting the galaxy from swarms of aliens was a staple of arcade space shooters, and I hope I have recreated that experience for you on both the iPhone and Apple Watch! Have fun piloting your space ship, blowing up swarms of alien enemies - and don't forget to avoid those asteroids!<br/><br/>Thanks for playing<br/>-Johnno", "metacritic": null, "released": "2019-05-21", "tba": false, "updated": "2019-08-16T05:25:01", "background_image": "https://media.rawg.io/media/screenshots/6f7/6f7a567c87683036049be9bdf16ac001.jpg", "website": "http://www.redspritestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Red Sprite Studios"], "genres": ["Action", "Casual"], "publishers": ["Red Sprite Studios"], "esrb_rating": "Everyone 10+"}