{"id": 365225, "slug": "nuclear-submarine-inc", "name": "Nuclear Submarine inc", "name_original": "Nuclear Submarine inc", "description": "Welcome to the best submarine simulator, Captain!<br/><br/>Nuclear Submarine inc will teach you the basics of managing a submarine and a nuclear reactor on it! You expect great difficulties: the depth, rocks, nuclear accidents on the nuclear reactor can arrange a second Chernobyl!<br/>The nuclear submarine can become an atomic bomb in the event of a nuclear reactor accident and destroy an entire city with a nuclear explosion!<br/><br/>The submarine simulator is very interesting and detailed - more than 10 improvements are waiting for you.<br/>New hulls will allow a nuclear submarine to sink to incredible depths!<br/>Diesel engines, Stirling, Nuclear reactors will allow you to swim far and fast!<br/>A stock of oxygen, batteries, fuel, a pump, a sonar, an air regenerator - all this will have to be used to give the nuclear submarine a chance to survive!<br/><br/>At a depth, a nuclear submarine can start to flood - use pumps and a repair team to survive!<br/><br/>Nuclear Submarine inc is not just a simulator of an atomic submarine. This is the most detailed and realistic submarine simulator on mobile platforms. Check and write, if you do not agree!<br/><br/>Features:<br/><br/>- Detailed submarine system!<br/>- 11 improvements!<br/>- A plausible immersion simulator.<br/>- 4 languages<br/><br/>A good voyage, Captain!", "metacritic": null, "released": "2018-09-04", "tba": false, "updated": "2019-08-16T06:18:40", "background_image": "https://media.rawg.io/media/screenshots/600/600902e5a888f264b57ae7d205ee71a9_ufqFCUx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dmitry Lomakin"], "genres": ["Simulation"], "publishers": ["Dmitry Lomakin"], "esrb_rating": "Everyone 10+"}