{"id": 365328, "slug": "race-3", "name": "Race!!!", "name_original": "Race!!!", "description": "<p>Race!!! è un classico gioco di auto basato su 10 livelli (circuiti). Si distingue da altri per il fatto che l'automobile si muove in vari livelli pieni di nemici e difficoltà.<br/>Qui di seguito ho elencato i principali bonus che incontrerai nel gioco e i tasti di scelta rapida.<br/>BONUS (possono avere effetti positivi o negativi sull'auto):</p>\n<p> - Teschio: uno dei peggiori nemici. Pur non muovendosi, può eliminarti al semplice contatto con esso;</p>\n<p> - Più: ti permette di aumentare notevolmente la velocità;</p>\n<p> - Meno: al contrario di \"Più\",ti rallenta notevolmente;</p>\n<p> - Dinamite: diversamente dal \"Teschio\", ti elimina una parte della vita (-20 punti vitali);</p>\n<p> - Benzina: ti permette di fare un pieno totale di vita, ricostituendo i punti vitali;</p>\n<p> - Teletrasporto: pur essendo difficile da raggiungere, permette il teletrasporto in un'altro tratto della mappa. E' indicato con il simbolo di una piccola dinamite sbarrata;</p>\n<p> - moneta oro chiara: dona alla tua automobile 100 punti;</p>\n<p> - moneta argento: dona alla tua automobile 1000 punti;</p>\n<p> - moneta oro scura: al contrario delle precedenti, questa permette di superare il livello.</p>\n<p>BOSS (ci sono rispettivamente al 3°, 6° e 10° livello):</p>\n<p> - Fake-Pacman: il popolare personaggio che ha fatto la storia dei videogiochi ti affronta!</p>\n<p> - Mega-TNT: rispetto alle altre dinamiti, questa toglie 80 punti vitali!</p>\n<p> - Superboss finale: no comment. E' una sorpresa!</p>\n<p>TASTI RAPIDI (consentono di svolgere funzioni supplementari):</p>\n<p> - ESC: esce dal gioco o dal menù di suggerimenti;</p>\n<p> - F1: apre il menù di suggerimenti;</p>\n<p> - F4: modalità a schermo intero. Ripremere una seconda volta pe uscirne;</p>\n<p> - F5: salva la partita nella cartella che contiene il gioco .exe, ATTENZIONE: le vecchie<br/>partite salvate verranno sovrascritte dai nuovi salvataggi;</p>\n<p> - F6: carica la partita salvata;</p>\n<p> - F9: fotografa una schermata del gioco in corso;</p>\n<p> - QUATTRO FRECCE: consentono di spostare l'auto nel percorso.</p>", "metacritic": null, "released": "2019-08-15", "tba": false, "updated": "2019-08-16T06:48:22", "background_image": "https://media.rawg.io/media/screenshots/e0e/e0e102738a296658a3c29b3c4dbbdce6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Filippo"], "genres": ["Strategy", "Racing", "Puzzle"], "publishers": [], "esrb_rating": null}