{"id": 365557, "slug": "echoes-of-you", "name": "Echoes of You", "name_original": "Echoes of You", "description": "<p><strong>Echoes of You</strong> is an atmospheric, narrative-driven game where a father attempts to make amends with his daughter by completing a journal before she moves away from him. Relive his memories and examine your surroundings to try to understand what happened. You can’t change the past, but you can take responsibility for it.<br/></p>\n<ul><li><strong>Explore the house </strong>and discover how their relationship evolved over the years.</li><li><strong>Complete memories </strong>by overcoming obstacles that trigger important moments in their lives. </li><li><strong>Finish the journal </strong>to piece the years together and understand the story behind the rift in their relationship.</li></ul>\n\n<p>Echoes of You was made by Stu³, a group of third year game development students from KDU University College in the Bachelors of Game Development program. <br/>After months of hard work, dedication and care, Echoes of You serves as their final year project. <br/>With graduation coming soon, the team is excited to release their final game as students and share it with anyone interested.</p>\n<p><strong>Design Team</strong><br/></p>\n<p>Rebecca Hee<br/>Game Designer - Team Lead, Level design, Narrative design<br/>bexmachina.wordpress.com\r\n<br/> contactrebeccahee@gmail.com</p>\n<p><strong>Art Team</strong></p>\n<p>Eva Lee<br/>Game Artist - Team Lead, Concept art, Environment, Character modeling<br/>https://www.artstation.com/xshiro96 <br/>p.eva17@hotmail.com</p>\n<p>Ian Lou Han Yuan<br/>Game Artist - Team Lead, Environment, Character animation<br/>louhanyuan24@gmail.com</p>\n<p>Elaine Chern<br/>Game Artist - Environment, Character modeling, GUI<br/>https://www.artstation.com/bloodyrukia<br/>cylelaine.moey@gmail.com</p>\n<p>Tee Hui Yee<br/>Game Artist - Environment, Character modeling<br/>cindytee98@hotmail.com</p>\n<p>Muhammad Syukri bin Juhari<br/>Game Artist - Environment, Base Mesh Modeling<br/>https://syukrithefury.artstation.com/<br/>redwolfmoon99@yahoo.com</p>\n<p><strong>Tech Team</strong></p>\n<p>Cheong Yi Siang<br/>Game Programmer - Post-processing, Material manipulation, Lighting<br/>yisiang_98@hotmail.com<br/>https://siang.itch.io</p>\n<p>Ong Li Hou<br/>Game Programmer- Gameplay and puzzle programmer<br/>mash-ong.itch.io<br/>onglihao97@gmail.com</p>\n<p>Alexander Tan Zheng Fang<br/>Project Manager &amp; Lead Game Programmer - UI, Journal, audio manager, cinematic and particle effects<br/>mothercow.itch.io<br/>alext2519@gmail.com</p>", "metacritic": null, "released": "2019-08-14", "tba": false, "updated": "2019-08-16T07:42:04", "background_image": "https://media.rawg.io/media/screenshots/20c/20cd266802dd3c52b2ca2329befbf6d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KDU Glenmarie Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}