{"id": 365757, "slug": "evols-sandbox", "name": "Evol's Sandbox", "name_original": "Evol's Sandbox", "description": "<p>Evol's Sandbox is a casual particle simulator that gives you tools for little creations. This was inspired by \"falling sand\" flash games that I would play as a kid.</p>\r\nMake Caverns\r\n<p>Water erodes the earth slowly. Or quickly, if you set it to that. Create interesting waterways and caverns, or allow them to develop naturally.</p>\r\nGrow Flowers\r\n<p>After you've got your soil wet, add a seed inside. Watch as it grows roots, sprouts, and flowers! The roots will hold in your soil and prevent it from eroding away.</p>\r\nSpeaking of Roots\r\n<p>Draw your own roots. They're versatile and will collect water and transport it anywhere that they are connected to. If they are near soil, they'll grow into it!</p>\r\nBees\r\n<p>Bees. Did I mention you can add bees? Cause you can. Add at least 25 and you have a colony. And what will that colony do? Bee things! Like building a hive. They'll also return to fix the hive if you mess with it.</p>\r\nBurn the Bees\r\n<p>When you're done playing with bees, why not burn them up? You can also burn your plants, so be careful playing with fire. Bees will also drown, so that's another option for bee killing.</p>\r\nDrain your Soil\r\n<p>The moisture in the soil will drain through and drip if there is space or a cavern below. This can make for interesting natural water paths.</p>\r\nMake Faucets and Waterfalls\r\n<p>With Faucet Mode, you can paint a water, sand, fire, or soil faucet. This will create a constant stream of particles at that point. Faucet Mode is only for painting, so turning it off only deactivates that feature of the brush. You'll have to delete a faucet to stop its flow.</p>\r\nControls\r\n<p>Left Click: Paint Particles</p>\n<p>Right Click: Delete Particles</p>\n<p>[  ]: Change Brush Size</p>\n<p>Scrollwheel or - +: Zoom In/Out</p>\n<p>Number Keys: Quick Change palette</p>\n<p>WASD: Pan the Camera</p>\n<p>Control + 0: Reset the Camera</p>\n<p>Other shortcuts are shown in the bottom left when highlighting menu options.</p>\n\r\nWant to help out?\r\n<p>By purchasing this game in development, you are directly funding its progress. </p>\n<p>You can also support me on Patreon:</p>\n\n\n<p>| Contact | Evol Games</p>\n\n<p>Or, let me know if you have an awesome idea, and I'll try to add that to the game. For example, here are some current ideas in the works:</p>\n<p>-Frogs. Can swim in water, have offspring, and eat bees.</p>\n<p>-Grass. Grows similar to flowers but mostly straight and spreads out more.</p>\n<p>-Llamas/Goats. Eat grass and keeps it at a normal height. Can die from bee stings.</p>\n<p>-Soil deposits. The opposite of erosion, where eroded particles are redeposited somewhere else.</p>\n<p>If you enjoy this game or find a bug please post a screenshot in the comments below.<br/></p>", "metacritic": null, "released": "2019-08-13", "tba": false, "updated": "2019-08-28T23:14:34", "background_image": "https://media.rawg.io/media/screenshots/971/971011866f622cf3c2bdb655a0ab98ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evol Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}