{"id": 365797, "slug": "legion-of-the-damned-3-commodore-64", "name": "Legion of the Damned 3 (Commodore 64)", "name_original": "Legion of the Damned 3 (Commodore 64)", "description": "<p>The C64 game that won second place in the Official C64 SEUCK Compo 2019 is finally here, with all the new amazing enhancements in place. Making this sideways SEUCK adventure even more STUNNING. Smooth background animation, spell power ups and wonderful atmospheric music.</p>\n<p>The village of Coyed-Ellyon has been put under a dark spell, which has placed a curse over the land. Brave warrior princess. All woodland creatures have turned into nasty monsters, and the villagers have been transformed into evil Zombies. It is known that the curse has been unleashed by a magic stone, The Brex Rune located at Yaxley Tower. <br/><br/>You are princess, Xandra. A very brave and fearless warrior. You fought through many battles, but now you have an even tougher battle to take place. Armed with a shield and a sword. You must complete different quests in order to save your village. These quests will be prompted on screen at the start of each level. Then once you have succeeded with your quest, you must find the Yaxley Tower and make your way to the very top of the tower. Then destroy the Brex rune. Once destroyed, your village will be safe and all spells will be broken. How brave are you really at your quest?<br/></p>\n<p>This game was built for<strong> PAL</strong>, but might also work on<strong> NTSC</strong>.</p>\n<p><strong>CREDITS:<br/></strong></p>\n<p>Game Design, Graphics and concept <br/><strong>Eleanor Burns</strong> (Created using Sideways Scrolling SEUCK)</p>\n<p>Additional programming and enhancements<strong>Eleanor Burns </strong><br/><br/>Front End programming, bitmap logo and music<br/><strong>Richard Bayliss</strong><br/><br/>Tape loader source<br/><strong>Martin Piper</strong><br/><br/><strong>(C)2019 Eleanor Burns and The New Dimension</strong><br/>This game is Public Domain software. Which means you are welcome to copy this production for free. You are <strong>not </strong>allowed to copy this production digitally or physically in any form for selling <strong>without </strong>permission from both authors involved in this production.<br/><br/></p>", "metacritic": null, "released": "2019-08-13", "tba": false, "updated": "2019-08-16T08:42:37", "background_image": "https://media.rawg.io/media/screenshots/495/4957de88243c53928fb6b66580af91df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Richard of TND"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}