{"id": 366, "slug": "dungeon-plunder", "name": "Dungeon Plunder", "name_original": "Dungeon Plunder", "description": "• TouchArcade 4.5/5 &amp;quot;... Dungeon Plunder&amp;#39;s slot-based combat is clever, just one of several smart features that make it one of the better roguelike experiences on iOS.&amp;quot; •<br/>• IGN Featured Game of the Day •<br/>• TouchArcade Forums Game of the Week •<br/>• AppAdvice: 4.5/5 •<br/>• PadGadget 4.5/5&amp;quot; •<br/><br/>Dungeon Plunder is a fun casual roguelike dungeon crawler featuring randomly generated overland and dungeon maps with an addictive and strategic battle system.<br/><br/>Here&amp;#39;s what you get with Dungeon Plunder:<br/><br/>→ Randomization of maps with different environments ensuring several hours of replayability.<br/>→ High quality isometric graphics rendering a beautiful and diverse scenery.<br/>→ 90+ different monsters and bosses with unique abilities to defeat.<br/>→ A fun, engaging and strategic combat system based on a slot machine with symbols selection, a respin phase and cooldowns management.<br/>→ Three character classes (Warrior, Mage, Rogue) with distinct abilities and playing styles.<br/>→ A skill points distribution system when you level up.<br/>→ An inheritance system that will grant gold, artifacts and life scrolls and even unlock higher starting levels for your next characters.<br/>→ A legacy rune system that triggers bonuses shared for all your characters.<br/>→ Several orchestral music tracks, tuned to your surroundings, enhancing your game playing experience.<br/>→ Full Game Center integration with 48 different achievements and 12 leaderboards.<br/>→ iCloud synchronization across your devices for your character starting levels and unlocked runes.<br/>→ Ultimately defeat an evil archmage conjuring a new ice age: the environment will be covered in ice and snow progressively as you travel through the perilous lands.<br/><br/>Dungeon Plunder is a universal game with full support of the widescreen iPhone5 and iPod Touch 5th generation devices.<br/><br/>Full IAP DIsclosure: 2 expansion classes (Ranger and Monk), cosmetic skins and a tip chest for the developer with no in-game effect are available.  That&amp;#39;s all.  There is absolutely no IAP for game currency, &amp;quot;gems&amp;quot;, gold/exp doublers or anything else that affects game performance.  Buy with confidence.", "metacritic": null, "released": "2013-03-06", "tba": false, "updated": "2019-10-22T14:27:27", "background_image": "https://media.rawg.io/media/screenshots/82b/82bda024fc29b0b428d15362243475be.jpeg", "website": "http://www.dungeonplunder.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Dominic Duchesne"], "genres": ["Adventure", "RPG"], "publishers": ["Dominic Duchesne"], "esrb_rating": "Everyone 10+"}