{"id": 366081, "slug": "cellyon-boss-confrontation", "name": "Cellyon: Boss Confrontation", "name_original": "Cellyon: Boss Confrontation", "description": "<strong>Strats, builds, player-made levels, team up to overcome the most powerful bosses in the first raid-only MMORPG.</strong><br/><br/>Cellyon: Boss confrontation is a <strong>cooperative multiplayer game</strong> in which teams of 4 to 8 players have to defeat powerful bosses in order to progress in the game ranking and collect cosmetic equipment. <br/><br/>The fight part itself is very close to what can be experienced during raids on most MMORPGs, where the enemies apply a scripted behaviour that the players need to <strong>learn and anticipate</strong>. The main difference is that <strong>all our bosses are accessible</strong> individually from the main menu, without an open world system. The game sessions are therefore short, from 10 to 20 minutes, and are subject to a matchmaking, as you could see in modern MOBAs. The players can of course form their own group before the fight. <br/><br/>At the start of each game, every player in the team has to choose a weapon. It will define his class and skill set, as well as his main role during the fight (basically tanking, healing, or dealing damage). It works exactly like a class in a MMORPG, except there is no level requirements to unlock skills and the player can change his weapon each time he starts a new boss. <br/><br/>Our main competitive game mode, called <strong>Rift</strong>, opposes two teams of players. They fight a boss in parallel universes, and the first team to kill their own boss (or the most advanced one if both die) wins the game. The gameplay is the same as mentioned above, but the players have a new ability, the Trance, that allows them to interact with the opposite fight. For example, they can place obstacles to block their opponents or attack them directly depending on the class they chose. <br/><br/><br/>Additionally, Cellyon offers the ability to design a <strong>custom boss fight</strong> with a deep and intuitive <strong>editor</strong>, where players can set up the map as they wish and script the behaviours of the monsters. To do so, they create spells that can freely affect every variable in the game, from players’ life or speed to the colour of a model or a custom counter. These levels can be released on the Steam Workshop and used by the players during custom games.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:36", "background_image": "https://media.rawg.io/media/screenshots/ff5/ff5d0d7452c57c541e059d5d892cdec2.jpg", "website": "http://sentry-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sentry Games"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["Sentry Games"], "esrb_rating": null}