{"id": 366094, "slug": "dong-fang-meng-yue-tan-lunatic-dreaming", "name": "东方梦月谈~Lunatic Dreaming", "name_original": "东方梦月谈~Lunatic Dreaming", "description": "(The following content is from Google Translate, please bear with us.)<br/>(The screenshot attribute is the test mode attribute, and the real attribute is subject to the in-game performance)<br/>Game category: The magic tower game under the fixed value RPG game branch.<br/>Game tag: puzzle, leisure, puzzle, TouHou project<br/>This is a game, functional entertainment (requires the description of what the function... the players will ignore it~)<br/><br/><strong>This engine is a modified magic tower template 7822 (RpgMakerXP 1.03/1.05)<br/>Original: Shanghai Alice Magic Orchestra</strong><br/>Association: Can Huan Dream, ink dyed birch<h3>game content</h3>\"This should have been a normal weekend!\"<br/>(The following content comes from the game confession)<br/>Sometimes, I will also think about whether illusion is reality, and falsehood is real.<br/>Where is the place called \"Fantasy\"?<br/>Every time I think about it, I have to sigh a long sentence: \"Unfortunately, I am just a plain person.\"<br/>Hey... the abnormal temperament of a literary girl? maybe<br/>\"Give up, never reach! Fantasy township or something.\"<br/>- There is a voice in my heart that seems to scream at me.<br/>In fact, if I was before, I would be convinced of it.<br/>Just not willing to pursue the same.<br/>If everything is doomed<br/>Miracles have never been uncommon<br/>If fantasy is more than just a nightmare<br/>perhaps<br/>Illusion and reality are blurred from this moment<br/>——Oriental Dreams<h3> difficulty rating </h3><br/> (Now still in the trial run phase, only open the Hard channel, the difficulty is about between the set L and H)<br/><br/>Easy—<strong>初春胧月</strong><br/>As difficult as the spring leprechaun<br/>Even the ice essence of Lake Mist can pass easily.<br/>Qi Luno... This is nothing to be proud of!<br/><br/>Normal—<strong>金秋清月</strong><br/>The autumn wind is getting more and more, and the sputum is swept away in summer. Pass it easily and comfortably!<br/>9 seems to be a bit difficult for the son...<br/>Have to say... a good name<br/><br/>Hard—<strong>盛夏炎月</strong><br/>Even in the middle of the night, summer is still irritating. It is difficult to feel agitated.<br/>9 fell down<br/>So black 9 really doesn't matter?<br/>PS: Black 9~don’t be afraid~<br/><br/>Lunatic—<strong>凛冬残月</strong><br/>A few feet of ice, the winter has arrived. The gale whispers, making people chill. The difficulty of the player's stagnation.<br/>*Chilno stopped thinking -<br/><br/>Extra—<strong> hell without moon</strong><br/>Have you experienced the feeling of hell?<br/>——Hell cat with two ponytails posing in the second position, who did not want to be named<br/>Emmmmm... What is the difference between this and the name directly?<br/><br/> Note: Today's version to the third chapter Boos early seedlings, the game update progress is subject to the latest announcement ~<h3> Game operation </h3>This game uses keyboard operation!<br/><br/>Press the arrow keys to move<br/>Press z/enter to confirm.<br/>Press 0/Esc to call up the menu (view monster properties, use items, access files, return to title interface)<br/>Press x to cancel the selection and return to the previous selection<br/>Alt+Enter enters full screen mode<br/>A key to add!<br/><br/> Note: If there is a special key requirement, press the F1 key to call up the RPGMakerXP key setting interface. <br/><br/>welcome!", "metacritic": null, "released": "2019-09-10", "tba": false, "updated": "2019-08-28T21:43:35", "background_image": "https://media.rawg.io/media/screenshots/d3e/d3e946bb57aeaf9db0e4f070f16d19b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["墨染燐桦"], "genres": ["RPG", "Strategy", "Casual"], "publishers": ["灿华幻梦"], "esrb_rating": null}