{"id": 366078, "slug": "filmmaker-tycoon", "name": "Filmmaker Tycoon", "name_original": "Filmmaker Tycoon", "description": "<h3>Design and build your own Movie Studio.</h3><br/>Every great filmmaker needs a star-worthy studio! Design and build the Movie Studio of your dreams from scratch in Filmmaker Tycoon! Construct a Scriptwriting Office, Post-Production Studio, Research Lab, Movie Sets, and more...<br/><br/>Beautify your studio to increase your reputation. The higher your Studio Reputation, the more celebrities will want to work for you.<br/><br/>Keep moving’ on up in Hollywood as you research new film techniques and buy new equipment to make your studio world-class!<br/><br/>Improve your movies with new technologies.<br/>Scout new locations to build more movie sets.<br/>Buy better cameras and lenses to improve the Picture Quality of your movies. <br/>Upgrade your movie sets for better lighting and audio.<br/><br/><h3>Create award winning Movies!</h3><br/>See your name in lights when you create award-winning movies!<br/><br/>Make movies of all genres: Action, Western, Horror, Romance, and more. Multiple genres can even be combined to create interesting plots in your movies and a twist ending!<br/><br/>Hire famous movie stars and directors to cast in your movies. Choose the right actors and directors for your movies—some celebs just don’t get along. If they start causing a problem on set, fire them!<br/><br/>Once you hire the perfect actors, choose the right costume to fit your vision.<br/><br/>Edit your films with background music, ambiance and color grading to improve the production value of your movies.<br/>…and if all else fails, just make whatever you want!<br/><br/><h3>That’s a wrap!!! Just sit back and enjoy!</h3><br/>Filmmaker Tycoon lets you actually watch your film creations. Each movie you create is fully animated with voice acting and reflects every decision you made in the production of the film (even if you hired a bad actor to save a buck!).<br/><br/>Shoot for the stars and make movies in Filmmaker Tycoon!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:36", "background_image": "https://media.rawg.io/media/screenshots/0f2/0f24ea6070eacd445d4092dd85b47242.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aternis Interactive"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Aternis Interactive"], "esrb_rating": null}