{"id": 366170, "slug": "days-of-empire", "name": "Days of Empire", "name_original": "Days of Empire", "description": "The first mobile MMORTS based on the Ottoman Empire<br/>A strategy based SLG where skills, rather than gold, lead to victory<br/> <br/>Experience a whole new look at being a lord in the Ottoman Empire, where your cunning skills and diplomacy dictate your fate. At the center of your empire stands a brand new hero system – helping you to fly forward in building your armies, constructing your city, and laying waste to enemies on the battlefield. <br/> <br/>As an emerging lord in the Ottoman empire you are tasked with training troops, researching technology, strengthening your castle, and forging steadfast alliances. As you grow ever stronger, you are vying for control of the lands around you. Occupy key strongholds, cities, and take over the kingdom for the betterment of yourself and your alliance alike. <br/> <br/>This new gameplay is bringing the shock and awe of medieval battles to phones worldwide for players to experience it for themselves. With uniquely Turkish troops, buildings, and castles, a vivid portrait of the Ottoman Empire will be brought to life for players to enjoy. Newly released heroes are based on true historical figures, bringing you best experience possible. With a fantastic pool of heroes to choose from, employ those that fit your goals best. <br/> <br/>==GAME FEATURES==<br/> <br/>●New hero system is here!<br/>Newly released heroes are based on true historical figures with wide-ranging skills! Use these heroes to experience epic PVP battles and build the great Ottoman empire!<br/> <br/>●Original strongholds gameplay!<br/>Occupying key strongholds is paramount, expanding your empire! Attack your enemies’ stronghold, overthrowing their city and taking the rewards for yourself!<br/> <br/>●The first mobile MMORTS based on the Ottoman Empire<br/>Establish a mighty empire, an army of loyal Ottoman warriors, and indomitable strength - establishing yourself as the rightful king!<br/> <br/>●Flexible troop formations<br/>With a vast array of soldiers, allows you to tailor your troop combinations and strategy to any situation! Using strategy to defeat bigger, stronger opponents!<br/> <br/>●Raze and plunder cities<br/>Consolidate your grip on the dynasty by training troops, upgrading equipment, constructing engines of war, and developing fiendish traps. Devise strategies to help you expand or lead your army to victory!<br/> <br/>●Strategic battles<br/>Sick of hands-off battle systems that leave you feeling uninvolved? Our real-time battle system will test the limits of your strategic thinking. You’ll need to study the strategy, leadership, diplomacy and tactics. Manage resources, command troops, and distribute traps effectively to rule the world!<br/> <br/>●Make friends<br/>Invite your friends to form unbreakable alliances; work together to develop your economy and reinforce each other in times of war; work as a group to attain victory and share the fruits of your labors together!<br/> <br/>●Explore the wilderness!<br/>Hunt monsters in the wilds of the Turkish peninsula, explore secret dungeons hidden away below ancient ruins, challenge powerful guardians, and excavate the ancient treasure!<br/> <br/>●Immersive MMORPG experience<br/>Welcome to the exquisitely designed, wonderfully colorful world of The Great Ottomans; with amazing HD graphics you’ll really feel like you’re a lord in the great Ottoman Empire!<br/> <br/>==Connect==<br/> <br/>Official Website: http://boe.onemt.com/<br/>Facebook：https://www.facebook.com/daysofempiregame<br/>Twitter：https://twitter.com/days_of_empire<br/>Instagram：https://www.instagram.com/daysofempiregame/<br/>Youtube：https://www.youtube.com/channel/UCB6qeSJYBVVQ0yCdDy58MLg?view_as=subscriber<br/> <br/>==Support==<br/>If you have any feedback, please write to us at serviceBOE@onemt.com<br/>Privacy Policy: http://www.onemt.com/policy.html<br/>Terms of Service: http://www.onemt.com/terms.html", "metacritic": null, "released": "2018-07-03", "tba": false, "updated": "2019-08-19T02:57:14", "background_image": "https://media.rawg.io/media/screenshots/886/8869707a13a99b1e05af55a429af2b78.jpg", "website": "http://www.onemt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ONEMT"], "genres": ["Adventure", "Strategy"], "publishers": ["Lokka Entertainment Hong Kong"], "esrb_rating": "Teen"}