{"id": 366154, "slug": "war-eternal", "name": "War Eternal", "name_original": "War Eternal", "description": "When you command Hercules and Hannibal – the only limit is your ambition!<br/><br/>Absorb other kingdoms through conquest and build an empire on their ashes.<br/><br/>Diplomacy takes center stage, whether signing a deal with an enemy order (even those in other kingdoms!) for a cut of the loot, or simply buying enough allies to wage war.<br/><br/>Key Features<br/><br/>1. A New World – You are dropped into an unknown land where time seems to stand still and mysteries abound, with heroes and commoners alike all vying for a place here.<br/><br/>2. Legends Come Alive – 90 heroes pulled from history await your commands.<br/><br/>3. 3 Grand Civilizations with Many More to Come – Rich details and real history have been carefully woven into every layer of the game.<br/><br/>4. Avatar Decoration – Dress up your avatar for any occasion, any way you like. Choose from a wide variety of options to make the avatar that best represents you.<br/><br/>5. Assembly Battlefield – Gather friends and allies and fight together in massive battles with hundreds of other players - all at the same time.<br/><br/>6. No Fate – Except that which you make for yourself. Luck and beating the odds are just as much a part of this game as anything else. Your fate is in your hands.<br/><br/>History is written by the victors.<br/><br/>Download War Eternal now and write yours.<br/><br/>Facebook: https://www.facebook.com/WarEternal/", "metacritic": null, "released": "2019-06-15", "tba": false, "updated": "2019-08-19T02:50:49", "background_image": "https://media.rawg.io/media/screenshots/e60/e607ce9e132d63f41bcd73bf621d7f93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ONEMT"], "genres": ["Strategy"], "publishers": ["Lokka Entertainment Hong Kong"], "esrb_rating": "Teen"}