{"id": 366183, "slug": "mr-word", "name": "Mr Word", "name_original": "Mr Word", "description": "Mr Word challenges you to a word game with added personality. Even more so, now that Mr Word talks back. <br/><br/>This update sees the following enhancements: <br/><br/> - Mr Word chats with you during 1 player game play, just like a real human opponent <br/> - Improved dictionary (uses the Oxford English Dictionary if installed) <br/> - more consistent AI gameplay <br/><br/>Choose 1 player or 2 player modes, and enter your name to begin. <br/><br/>In 1 player mode, you are playing against Mr Word himself. Featuring Genuine People Personality, Mr Word will really give you a run for your money. <br/><br/>Choose a difficulty level, Easy, Medium or Hard, then Mr Word will choose words that a real human would choose (his vocabulary increases in Hard level), and respond to your move in seconds - great for rapid fire play. Now even faster than before. <br/><br/>If you make Mr Word think for longer than a few seconds, you are doing really well! <br/><br/>Mr Word will even \"spellcheck\" your words as you lay them, so you know in advance whether the word you are playing is acceptable.<br/><br/>Also featuring the Define button - instantly brings up word definitions for all words played. High quality, Apple-supplied dictionary of over 100,000 words. Features definitions from the Oxford English Dictionary so you can learn new words and their meanings every time you play.<br/><br/>In 2 player mode, your Mac becomes a high quality fullscreen board game, with the added benefit of spellchecking to avoid arguments about valid words. <br/><br/>Mr Word is minimalist, highly playable, and beautifully designed so you can rediscover the joy of word games. For the most immersive experience, trying using Mr Word in fullscreen mode.<br/><br/>Please also check out the iOS version for iPhone, iPad and iPod Touch.", "metacritic": null, "released": "2012-12-13", "tba": false, "updated": "2019-08-19T03:03:12", "background_image": "https://media.rawg.io/media/screenshots/836/83603b4019c1971786b835349524a754.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Truncated Tales"], "genres": ["Board Games"], "publishers": ["Truncated Tales"], "esrb_rating": "Everyone 10+"}