{"id": 366162, "slug": "moto-raptor-jurassic-dinosaur", "name": "Moto Raptor: Jurassic Dinosaur", "name_original": "Moto Raptor: Jurassic Dinosaur", "description": "Become the most awesome velociraptor of all time ridding your motorbike through the jurassic style park! <br/>Overtake the slow dinosaurs with your new chopper and be the coolest raptor ever! The T-Rex and the Triceratops will never catch you!<br/><br/>If you love dinosaur games and motorbikes, this is the game you've been waiting for!<br/><br/>As you go faster and further you will win cash and you'll be able to buy better and faster motorbikes! Red chopper? A cool blue dirt bike? Win the race buying the best motorbikes on this dinosaur racing game!<br/><br/>You can overtake the other dinosaurs and you will win more points and more cash! Also, you can take the ramp to jump and activate the turbo! The T-Rex, triceratops and other dinosaurs will never be as fast! And they don’t have cool bikes.<br/><br/>There's no time to lose! Choose your chopper or dirt bike and show the other dinosaurs who is the king of the jurassic style park! Velociraptor? No, no… MotoRaptor baby!<br/><br/>◉ KEY FEATURES ◉<br/><br/>- Awesome motorbikes! Chopper and dirt bikes!<br/>- Velociraptor, T-Rex, Triceratops and more!<br/>- Very simple controls!<br/>- Incredible graphics!<br/>- Leaderboards and achievements!<br/>- Awesome jurassic music!<br/>- Free!<br/><br/>◉ GAMEPLAY ◉<br/><br/>- Tilt or Touch to steer<br/>- Touch gas button to accelerate<br/>- Touch brake button to slow down<br/><br/>◉ TIPS ◉<br/><br/>- The faster you drive the more points you get<br/>- When driving over 100 kmh, overtake dinosaurs closely to get bonus points and cash<br/>- If you do overtakes fast, you can do combos and win more points<br/>- Take the ramp to jump and activate the turbo!<br/><br/>Have endless fun by downloading this velociraptor and motorbikes racing game.<br/><br/>Do not forget to give us a review ;)", "metacritic": null, "released": "2017-02-16", "tba": false, "updated": "2019-08-19T02:53:52", "background_image": "https://media.rawg.io/media/screenshots/3ed/3edd96d2ba5907042d589fc720008d24_eNxnuB1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivan Calle"], "genres": ["Simulation", "Casual"], "publishers": ["Ivan Calle"], "esrb_rating": "Everyone 10+"}