{"id": 366205, "slug": "vr-samurai", "name": "VR SAMURAI", "name_original": "VR SAMURAI", "description": "Mode: Tilt<br/>\tHero is moved to the left and right by tilting the smartphone.<br/>\tWhile fending off the attack of enemy small fry well, please forward.<br/>\tWhen you tap the smartphone screen, make the attack.<br/><br/>Mode: VR<br/>\tSet the smartphone to VR corresponding HMD.<br/>\tFollow the on-screen message, please secure the point of view.<br/>\tCountdown begins, the game will start.<br/>\tIn VR mode, by tilting the head (Smartphone), the hero is moved to the left and right.<br/>\tWhile fending off the attack of enemy small fry well, please forward.<br/>\tAttack is automatic. It feeds automatically attack at a constant rhythm.<br/>\t※ It does not correspond to the iPad.<br/><br/>Special attack<br/>\tTo jump higher and move forward turret of (burning including tower), and landing at the same time special attack will trigger.<br/>\tProceeding in front of the rock, jump, landing at the same time as the special attack will trigger.<br/>\tWhen the coin on the field collect six, it will be a certain period of time invincible along with the character of \"Muso Roku Monsen\".<br/><br/>Enemy main warlords<br/>\tIf advance a certain distance, it will be the battle mode of the Tokugawa how main warlords.<br/>\tFollow the instructions on the screen, please Tilt the head (Smartphone) to the left and right timing well.<br/>\tRepeat the attack hand-protect hand, we fight a duel with the enemy general.<br/><br/>Weapon<br/>\tAs the game progresses, the weapon will increase.<br/><br/>title\t<br/>\tAs the game progresses, the title will change.", "metacritic": null, "released": "2016-04-28", "tba": false, "updated": "2019-08-19T03:16:26", "background_image": "https://media.rawg.io/media/screenshots/98f/98f419ff9e8ade6f2ed38ce43c44b414.jpg", "website": "http://uppbridge.wix.com/official#!vrcontents/c107y", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kaoru Azuma"], "genres": ["Action"], "publishers": ["kaoru Azuma"], "esrb_rating": "Teen"}