{"id": 3666, "slug": "tales-from-space-mutant-blobs-attack", "name": "Tales From Space: Mutant Blobs Attack", "name_original": "Tales From Space: Mutant Blobs Attack", "description": "<p>Tales from Space: Mutant Blobs Attack is a side-scrolling platformer developed by DrinkBox Studios. The game serves as a prequel to another game by the studio, Tales From Space: About a Blob.</p>\n<h3>Plot</h3>\n<p>The game tells the story of the blob who is named Blob. Blob escapes from his own homeworld and ends up on Earth, where he begins consuming everything he finds while exploring the planet.</p>\n<h3>Gameplay</h3>\n<p>The players control Blob. At the beginning of the level, Blob is tiny, but when he eats something, he gets a bit bigger. This allows the players to grom Blob to enormous sizes by eating the loosely-placed items in the in-game world. The main objective of the player is to pass a specific obstacle located at every level of the game to complete it. </p>\n<p>The players can use Blob&#39;s multiple mutant abilities. For example, he can transform into a rocket for a limited amount of time, stick to walls or even use telekinesis to manipulate the in-game items. </p>\n<p>The game heavily relies on its advanced physics simulation system. The levels are highly interactive, so the question of how to approach a specific level is completely up to the player.</p>\n<h3>Style</h3>\n<p>The 1950s heavily inspire the game&#39;s art style. Architecture, music, and even this era-specific humor can be found in the game. The game features a distinct animation style which can also be found in the old Batman or Spider-man TV shows.</p>", "metacritic": 83, "released": "2012-02-21", "tba": false, "updated": "2023-07-22T04:35:59", "background_image": "https://media.rawg.io/media/screenshots/76b/76b1760b03a011c015feeac9572ad22d.jpg", "website": "http://www.mutantblobsattack.com", "rating": 3.19, "rating_top": 4, "added_by_status": {"yet": 45, "owned": 974, "beaten": 52, "toplay": 8, "dropped": 19, "playing": 3}, "playtime": 3, "achievements_count": 40, "ratings_count": 76, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 77, "platforms": ["PC", "PlayStation 3", "PS Vita", "Nintendo Switch", "Linux", "macOS"], "developers": ["DrinkBox Studios"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["DrinkBox Studios"], "esrb_rating": null}