{"id": 366615, "slug": "my-lil-mini-game", "name": "My Lil Mini Game", "name_original": "My Lil Mini Game", "description": "<p>A simple platformer game with a twist of billiard and some spice of difficulty and fun. Took screenshots from the snipping tool, the quality of the images may be low.</p>\n<p>After failing many times of making a game I always end up quitting in the midway, I usually find myself struggling finding sounds and art, because that's not my area, I'm a programmer so I decided to go for a simple one and I ended up with this. Its a old game that was left behind in a folder, I decided to continue it and finish it, and ye here it is <strong>^_^</strong>. You are trying to find a celestial dragon that is frozen in a other world, yes ik I suck when it comes to story  and stuff <strong>:P,</strong>  The game isn't only a platformer game it has a little mix of billiard in it. There is a surprise at the end! <strong>^_^</strong>, and there is some fun stuff in there<strong> xd</strong>.</p>\n\n<p>Controls:</p>\n<p>Use right click to rotate the camera around the scene.</p>\n<p>Press C to reset the camera.</p>\n<p>Hold B to slowly rumble your ball near to spawn.</p>\n<p>Click the player while holding and dragging, release to shoot, you need zig points to shoot. You get 1 zig point for a ball you score.</p>\n<p>In platformer after you get player controls, use W A S D and spacebar to move and jump.</p>\n<p>In a level, press Esc to go back to menu. ( <strong>&gt;_&gt;</strong> ) .. now I know you this but still eheheheh.</p>", "metacritic": null, "released": "2019-08-17", "tba": false, "updated": "2019-08-19T05:11:12", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7d094666ac0bbaea6cf53e0c990cc4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameBoiDev"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}