{"id": 366726, "slug": "corpse-party-infinitive", "name": "Corpse Party Infinitive", "name_original": "Corpse Party Infinitive", "description": "<p>Corpse Party Infinitive is a Corpse Party<br/>fan game that continues the story from Corpse Party Blood Drive.<br/>(That's a lot of corpses and parties.)<br/>Corpse Party Infinitive is a project that I started back in 2015 and that could have been<br/>done until now buuuut since I am a lazy person, it eh. Isn't done. D:<br/>The project CPI has been started with RPG Maker VX Ace in 2015, but in early 2018 it has been moved<br/>over to RPG Maker MV. <br/>The reasons for it are the following:<br/>Smoother interface<br/>More customizable plugins<br/>Aaaand that's already it.</p>\n<p>Story [Spoilers for CP Blood Drive and CPI.]:<br/>CPI Starts of directly where blood drive ended, with Yoshiki and Ayumi being trapped in a non existant space.<br/>After a short while, when the Heavenly Host elementary school AKA the Nirvana got erased, a new problem came to sunlight.<br/>The Book of Shadows, (the book responsible for the Nirvana) has closed the spell that created it, but since there were other active spells around,<br/>the BoS got instable. If the spells wouldn't been returned to the BoS, the BoS would get instable and that could lead to a multiverse breakdown (since it's<br/>connected to almost everything in exsitance)<br/>In the quest to return all active spells, Ayumi decided to contact Satoshi, Yuka and Naomi to return to the Nirvana (a bad copy of it).</p>\n\n<p>[for now, you can only finish the first chapter and about 70% of the second one. You can still find all name tags for now, and it will be displayed at the end of the game if you've got all of them]</p>", "metacritic": null, "released": "2019-08-16", "tba": false, "updated": "2019-08-19T05:34:08", "background_image": "https://media.rawg.io/media/screenshots/2f4/2f4e457cd1a4477a3b78e2ab0a9ae2a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fehleno"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}