{"id": 366724, "slug": "creapocalypse", "name": "Creapocalypse", "name_original": "Creapocalypse", "description": "<p><em>Warning : The game resolution is hard coded to be 1920x1080, never tried on another resolution but it shouldn't work properly</em></p>\n<em>Originally was a school project, made over 2 weeks, but ended up thinking about releasing it, so here we are after some quality of life improvements, such as an in-game info screen.<br/></em>\n<p>Welcome, to the really unexplicable and infite alien wave flow with turrets for a, quite obviously, tower defense game in which you defend your farm plainly composed of a house, a garage, a cowshed, a piggery, a hay barn and an ice cream vendor, except there's no ice cream, and no vendor, but you also have to defend a really brave, really creative, really handsome, really real farmer, of which we don't know the name but that we really care about, because if he dies it's game over, but the buildings are important too because if they're all destroyed it's also game over, all of that happening on a far far planet, of which the owner had trouble finding a good name, but finally did, changed it twice, got killed, the planet that changes between every game, but not while a game because it would be odd, the planet Crea, welcome to the</p>\r\nMega Creapocalypse\r\n\r\n<p><em>Control one of the three farmers each packed and delivered with a unique power</em></p>\r\nSt Gerard - The Berserker\r\nThe knife-throwing berserker, he loves a good fight more than anything. When concentrating really hard he become the most precise and powerful knife-thrower of them all.\r\nPunk Rick - The Mecanic\r\n<em>Born with a wrench in each hand, he will build faster than his shadow. When concentrating his building aura extends through the realm of the turret world and make them self-construct in a split second.</em>\r\nSoft Richmond - The Pyromaniac\r\n<em>Like every farmer he knows the secret of the fire breath, and has mastered it. When concentrating his breath will form a moving wall of fierce flames, burning everything on its way, the fire is so powerful it goes right through matter to burn atoms themselves.</em>\n\n<p><em>Defend your precious farm buildings and farmer using those high-tech turrets</em></p>\n<p><strong>Missile - </strong><em>The boom boom maker</em></p>\n<p><strong>Sniper - </strong><em>The head shot maker</em></p>\n<p><strong>Shotgun - </strong><em>The \"lots of tiny holes\" maker</em></p>\n<p><strong>Wall - </strong><em>Guaranteed without ears</em></p>\n\n<p><em>Fight against the huge number of monsters species ( 2 species, actually )</em></p>", "metacritic": null, "released": "2019-08-16", "tba": false, "updated": "2019-08-28T23:14:31", "background_image": "https://media.rawg.io/media/screenshots/6fd/6fda9d18ab39f069a1d64ed16fec6de5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PatateNouille"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}