{"id": 366844, "slug": "atelier-ryza-ever-darkness-the-secret-hideout", "name": "Atelier Ryza: Ever Darkness & the Secret Hideout", "name_original": "Atelier Ryza: Ever Darkness & the Secret Hideout", "description": "It is the story of a girl and her friends who are about to become adults, discovering what is most important to them.<br />\nTo depict the story of the main characters discovering things they&#39;ve never seen before, we&#39;ve created fields with natural shadows that allow you to feel the breath of the world. Graphics have been further enhanced, allowing for a world of daily-life and adventure to be depicted in a new way.<br />\nMain Points<br />\n■Advanced &quot;Synthesis&quot; system &amp; &quot;Location Points&quot;<br />\nThe &quot;Synthesis&quot; system in which players combine materials to create items has been revamped.<br />\nNow, in addition to being able to understand the effects of synthesis visually, the system allows you to enjoy the experience of developing recipes more than ever before.<br />\nAlso, we&#39;ve included &quot;Location Points&quot; that players can create through synthesis!<br />\n■Use different items to gather new materials!<br />\nWhen &quot;Gathering&quot; the necessary materials for synthesis, the items you receive change depending on the tools you use to gather them, so it will be easier to obtain the items you want.<br />\n■intense Battles<br />\nWith a combination of turn-based command battle and real time elements, enjoy intense battles where the choices you make determine the outcome! It is a system that will allow you to sense the feeling of strengthening bonds with your friends more than ever.<br />\nStory<br />\nThe Main Character Is Ryza, An Ordinary Girl.<br />\nTired of boring village life, she escapes the village to gather with her good friends in a secret location to talk of their dreams and plan thrilling adventures.<br />\nOne day, the determined Ryza and company decide to head for the forbidden &quot;island across the shore&quot; as their first exploration trip.<br />\nTogether with the alchemist and other friends they meet there, they have a &quot;summer adventure&quot; that they will never forget.</p>", "metacritic": 78, "released": "2019-10-26", "tba": false, "updated": "2024-01-03T14:49:00", "background_image": "https://media.rawg.io/media/games/484/4849529dfe93d3a10bcbe5a0d6e12646.jpg", "website": "https://www.koeitecmoamerica.com/ryza/", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 38, "owned": 226, "beaten": 30, "toplay": 74, "dropped": 16, "playing": 11}, "playtime": 3, "achievements_count": 53, "ratings_count": 35, "suggestions_count": 482, "game_series_count": 24, "reviews_count": 35, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Gust"], "genres": ["Adventure", "RPG"], "publishers": ["Koei Tecmo Games"], "esrb_rating": "Teen"}