{"id": 366810, "slug": "mutant-monsters-from-mars", "name": "Mutant Monsters from Mars", "name_original": "Mutant Monsters from Mars", "description": "<p><strong>This mission is classified Ultra Secret.</strong></p>\n<p>You have been chosen for this mission because of your experience in highly adverse situations and settings and for your previous utter discretion in matters of national security.</p>\n<p>As you are well aware, we're at the height of the Cold War with the Soviets. As part of our ongoing war effort, our nation operates a number of Top Secret bases across the world. One of these bases, the 'Restricted Area 4808 North (R-4808N) Secret Research Facility', has stopped responding to normal communications. It is quite likely that this is due to a down transmitter. However, we must be prepared for a sabotage scenario or worse.</p>\n<p>Your top mission priority is to secure the facility. If you need to neutralise potential enemy combatants, you've been given authorisation to achieve this aim (Order: GKNB-7644XX)</p>\n<p>Your secondary mission priority is to rescue the facility's surviving civilian research staff, if any.</p>\n<p>Due to the nature of the research being undertaken at this facility, we cannot give you more information than this.</p>\n<p>Good luck.</p>\n\n<p><em>Note: This game is broadly feature-complete, but has only one playable map which encompasses only a small part of the storyline. As such, it should be considered in Alpha stage and still under development, and has been placed here as a demo for those interested.</em><br/></p>", "metacritic": null, "released": "2019-08-16", "tba": false, "updated": "2019-08-19T05:55:04", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b8d6e7554747093c195b6b62cbacd83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["CyberCamera"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}