{"id": 366854, "slug": "munchkin-quacked-quest", "name": "Munchkin: Quacked Quest", "name_original": "Munchkin: Quacked Quest", "description": "<p>In Munchkin: Quacked Quest, confront your friends or forge alliances with other players to accomplish your unlikely objectives, gather gold, sacrifice other players to the game master, eliminate the enemy foes—from reanimated skeletons to the potted plant and even the Plutonium Dragon—and reach the highest level to become victorious.<br />\nBe careful, though! Today’s friends can become tomorrow’s enemies. After all, there’s only one spot at the top and you have a chainsaw in your hand…<br />\nIn a dungeon  filled with mayhem  and challenges, you’ll have to gain the upper hand and keep an eye on your friends along the way. In either the solo or local multiplayer mode, go through various environments and overcome increasingly crazier trials. Have you ever dreamed of throwing your friends into a dark pit? Not afraid of chickens and trolls? You’re a black belt at tavern furniture smashing? Do you feel you have what it takes to get rid of epic bosses (or letting other people do the job for you)?<br />\nSo dive into the Munchkin: Quacked Quest universe and fall in love with the parodic tone from the famous card game by Steve Jackson once again. Gather your best friends, or enemies, and take down the hordes that will charge at you! Get your hands on treasures before your allies do and gear up with legendary weapons, unleash special skills from your class, use traps to your advantage and--wait… IS THAT A GOLDEN DUCK RIGHT THERE!?<br />\nEvery game will be different from the previous one thanks to the excellent job of the Wight Brothers and their fabulous Dungeonarium. Every adventure will be enhanced by random modifiers. The more victories you claim, the more new modifiers that will be added to the Dungeonarium.</p>", "metacritic": null, "released": "2019-11-19", "tba": false, "updated": "2021-02-27T11:28:36", "background_image": "https://media.rawg.io/media/games/392/392cc2560a2454cf91b6868cc9f99e42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 9, "beaten": 1, "toplay": 3, "dropped": 1}, "playtime": 1, "achievements_count": 26, "ratings_count": 2, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "Nintendo Switch", "PC", "Xbox One"], "developers": ["Asmodee Digital"], "genres": ["Action", "RPG", "Strategy", "Casual"], "publishers": ["Asmodee Digital"], "esrb_rating": null}