{"id": 3669, "slug": "kilka-card-gods", "name": "Kilka Card Gods", "name_original": "Kilka Card Gods", "description": "Kilka Card Gods is an amazingly addictive card game like no other you’ve ever played before, fusing together the best of Sudoku and card strategy into one amazing package. Simple to play yet hard to master, you’ll need to place your cards in the correct spaces on a grid and against the clock. Place the correct card and you’ll earn some extra time but place the wrong card and precious seconds will slip away.<br/><br/>Packed with endless challenges, a deep story mode, exotic locations and cast of colorful characters, Kilka Card Gods is a puzzle game that will bring you hours of enjoyment.<br/><br/>1 player(s)<br/>10240KB Minimum<br/><br/>  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account. <br/><br/>Rapid and creative development of this game was facilitated by Bamtang's Swit technologies.<br/><br/>BAMTANG GAMES SAC <br/>CONFIDENTIAL AND PROPRIETARY.THIS UNPUBLISHED WORK CONTAINS VALUABLE CONFIDENTIAL AND PROPRIETARY INFORMATION.DISCLOSURE, USE OR REPRODUCTION WITHOUT THE WRITTEN AUTHORIZATION OF 'BAMTANG GAMES SAC'IS PROHIBITED. COPYRIGHT ©, BAMTANG GAMES SAC, 2014<br/>ALL RIGHTS RESERVED", "metacritic": null, "released": "2014-06-10", "tba": false, "updated": "2019-08-02T16:24:04", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PS Vita"], "developers": ["Bamtang Games"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}