{"id": 367092, "slug": "vectrix", "name": "Vectrix", "name_original": "Vectrix", "description": "Based on John Conway's \"Game of Life\" cellular automaton, Vectrix is a techno dual-stick shooter that harkens back to arcade cabinets and pockets full of quarters. <br/>\n<br/>\r\nFace a nearly unlimited difficulty curve as you blast away at chaotic and erratic cells whose behavior is mathematically unpredictable in most cases! Blasting cells causes others to wilt away if you're lucky, but can also cause massive explosions of new cells! Feel the upbeat rhythm energize you as you connect the shapes to unlock cross-shots, tri-shots and T-shots at enemies! Beware of new cell formations as the colors get hotter and the music gets more intense! Race to the top of the leaderboard and beat developer highscores. Challenge your friends! Are you the best cell eradicator in town? Leave your initials to prove it!<br/>\n<br/>\r\nFeatures:<br/>\r\n- Dual-stick shooting<br/>\r\n- Smash developer high scores on the leaderboard!<br/>\r\n- Collect powerups for even better blasting power!<br/>\r\n- Funky techno-synthwave soundtrack<br/>\r\n- Predictable basic cell formations evolve into uncontrollable coagulations!<br/>\r\n- Solve open questions about cellular automata?<br/>\r\n- Color-changing, music crescendoing difficulty curve<br/>\r\n- Challenge friends and family to trounce your massive high scores<br/>\r\n- Revel in the beauty of particle effects<br/>\r\n- Accidentally die while reveling in the beauty of particle effects<br/>\r\n- Blast unpredictable cells out of this world!", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-08-28T21:43:32", "background_image": "https://media.rawg.io/media/screenshots/51d/51d77aa6f11b21bea14047d7fc69fbfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Poco a Poco"], "genres": ["Action"], "publishers": ["DigiPen Institute of Technology"], "esrb_rating": null}