{"id": 3671, "slug": "don-bradman-cricket-14", "name": "Don Bradman Cricket 14", "name_original": "Don Bradman Cricket 14", "description": "<p>The first thing to think about when you start playing Don Bradman Cricket 14 is to forget what you know about Cricket games and start afresh...it&#39;s cricket like you&#39;ve never seen it before!<br />\nTake to the field with any of the 100+ teams provided or choose from over 14,000 teams available online from the Academy.<br />\nDon Bradman Cricket 14 includes:<br />\n• Career Mode, allowing you to take control of an aspiring young cricketer and take him through the ranks to International glory.<br />\n• Unique Batting and Bowling Controls, giving full 360 Shot control and Line and Length delivery without pitch markers.<br />\n• A fully featured fielding system that allows you to run down the ball and slide to prevent a four, catch a high ball on the boundary rope, or knock down the stumps to take a vital run out. You are always involved in the play at every stage of the game!<br />\n• Ball Physics giving realistic Edges, bat pad catches and movement off the pitch.<br />\n• A complete player physics system with individual attributes including weight and height – imagine running in a 200cm bowler to delivery that perfect bouncer!<br />\n• Appeal and Electronic Review system allowing for the first time challenges of the umpires decision.<br />\n• Practice Nets, Hone your skills to perfection before taking to the field.<br />\n• Dynamic time of day, Weather System and Pitch Degradation that are based on real world data with effects occurring in real-time throughout a days’ play.<br />\n• The Cricket Academy, allowing for unparalleled customisation of your Cricket experience, creating Teams, players, Tours, Competitions, Match Types and even Umpires.<br />\n• More than 150,000 Community created players and teams ready to download and use in game.<br />\n• An online Save system that lets you continue your match whenever you want with online opponents.<br />\n• Online &amp; Offline 2 Player Vs AI Co-op.<br />\nDon Bradman Cricket 14 “The legend continues….”<br />\nNote: You must be connected to the internet to boot this game. You may disconnect from the internet once at the main menu.</p>", "metacritic": 74, "released": "2014-04-03", "tba": false, "updated": "2022-08-16T06:22:49", "background_image": "https://media.rawg.io/media/games/919/919fb6c004b0b20e5bd94cbf5b892d77.jpg", "website": "http://www.cricket14.com", "rating": 3.5, "rating_top": 4, "added_by_status": {"owned": 20, "beaten": 3, "toplay": 1, "dropped": 2}, "playtime": 38, "achievements_count": 72, "ratings_count": 6, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 3", "Xbox One", "Xbox 360", "PlayStation 4", "PC"], "developers": ["Big Ant Studios"], "genres": ["Simulation", "Sports", "Indie"], "publishers": ["Big Ant Studios"], "esrb_rating": "Everyone 10+"}