{"id": 367170, "slug": "exorcise-the-demons", "name": "Exorcise The Demons", "name_original": "Exorcise The Demons", "description": "Trapped in a mysterious place, you must perform rituals to defeat powerful demons.<br/>The Book of Rituals is your only way of knowing how to achieve them.<br/><br/><strong>But there is a catch:</strong> only one player can see the screen, and the other is the only one who can read the book! In this game, communication is essential, never stop sharing information!<br/><br/>Discover through the story a new type of game based on your ability to communicate. Exorcise The Demons is a unique experience and an immersive game that will test your friendship!<br/><br/><ul><li>An original cooperative gameplay: one game, two different experiences!<br/></li><li>To play with your friends, all you need is a copy of the game. You can easily use your favorite voice chat to play!<br/></li><li>A fascinating story mode, divided into 25 missions.<br/></li><li>Dubbed by Brigitte Lecordier (Witcher, Skyrim ...) and Pierre-Alain de Garrigues (Diablo, Warcraft, Hearthstone ...).<br/></li><li>7 different rituals generated randomly!<br/></li><li>Win artifacts to access the secrets of the game.<br/></li><li>Free DLC<br/></li><li>A graphic universe rich in HD<br/></li><li>The Premium Book of Rituals and everything you need are included in the game. You can also paste it via the game, on your desktop to print it!<br/></li><li>The slightest mistake will test your friendship!</li></ul><br/><strong>Get it now it's your last chance to exorcise your demons! But Are you ready for it? </strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:29", "background_image": "https://media.rawg.io/media/screenshots/9ac/9acf084d2e80e6b739474029b70ca591.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Midnight Games EIRL"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Midnight Games EIRL"], "esrb_rating": null}