{"id": 367183, "slug": "cyber-hook", "name": "Cyber Hook", "name_original": "Cyber Hook", "description": "<strong>Cyber Hook</strong> has players using parkour skills and a grappling hook to scale and ride walls, while fighting enemies and blasting blocks with a finger laser gun. Hurdle forward in a vibrant retrowave environment to test parkour abilities, but be careful, because one missed jump can mean life or death.<h3>Features :</h3><br/><ul><li><strong>Intense Parkour Action</strong> – Fast-paced 3D parkour gameplay that plunges players at 150 km/h through a bevy of platforming challenges. Scale and ride walls, but be careful to time jumps correctly or you’ll plunge to your death. <br/><br/></li><li><strong>Tools At Your Disposal</strong> – Use a grappling hook to fly through levels by hooking yourself onto blocks, while blasting foes and blocks with a laser finger gun. <br/></li><li> <strong>Alter The Game</strong> – Warp time to save yourself from falling and discover new movement options to make it past challenges. In Cyber Hook, you can forge your own path by abusing physics and breaking the level design. <br/><br/></li><li><strong>Levels Galore</strong> – 70+ levels at launch to test your parkour skills. <br/></li><li><strong>Worldwide Leaderboards</strong> – Compete with other players using the region or worldwide leaderboard and watch others play in-game to determine the best strategies to make it through levels.</li></ul>", "metacritic": null, "released": "2020-09-23", "tba": false, "updated": "2023-10-04T01:17:36", "background_image": "https://media.rawg.io/media/screenshots/f4b/f4bbf37efa563ed46791742b4682242c.jpg", "website": "http://www.graffitigames.com", "rating": 3.63, "rating_top": 4, "added_by_status": {"yet": 42, "owned": 792, "beaten": 9, "toplay": 9, "dropped": 9, "playing": 2}, "playtime": 1, "achievements_count": 21, "ratings_count": 19, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["Graffiti_Games", "Blazing Stick"], "genres": ["Action", "Platformer"], "publishers": ["Graffiti Games"], "esrb_rating": null}