{"id": 367144, "slug": "corpoct", "name": "Corpoct", "name_original": "Corpoct", "description": "<h3>Welcome To The Galaxy!</h3>Test your wits as well as your ability to lead an expedition in this deep space dungeon-crawler. Hire the best heroes and villains of the galaxy. Find unknown planets in uncharted space. Start small, plan big and get a fleet of warships capable enough to rival most fearsome enemies. Can you endure the hardships of deep space and become known throughout the galaxy?<br/><br/>******************************<h3>An Agent Of The Future</h3>You are a representative of the mega-corporation \"Corpoct\" tasked to oversee an expedition. You must choose a commander from a roster of famous villains and heroes of the galaxy and watch their struggle and influence their choices throughout the adventure. You will be there to claim the treasures from their dead bodies when they eventually fail.<br/><br/>******************************<h3>You Are Not In Control</h3>You can't command the battleships. You can't decide which weapon goes where on the ships. But you have indirect control of the whole operation. You decide where the ships will be when the battle starts. Engineers will bring you the blueprints for you to select. You pull the strings and they do their part. İf you play your cards right and adapt to the situation. Everything will come to be as you planned.<br/><br/>******************************<h3>Features</h3><ul><li>Roguelike, Dungeon crawler-style gameplay</li><li>Randomly generated maps where every cluster is brand new</li><li>Indirect strategy. You won't control the battle, but you will influence it with your own tools to effect every part of the expedition</li><li>Consumables and advisors to affect the outcome of the battle</li><li>Space battle simulation from fast fighters to armored battleships</li><li>Randomized ships with different predefined enemy factions</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:43:30", "background_image": "https://media.rawg.io/media/screenshots/a9b/a9b1d04ddd622f797c7208a435ce2533.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 29, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Wolderado", "Belaniax"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["TwoBros"], "esrb_rating": null}