{"id": 367184, "slug": "digital-rose", "name": "Digital Rose", "name_original": "Digital Rose", "description": "Digital Rose is a solo-developed, 2D action-platforming game that focuses on providing a challenging experience within an atmosphere that mixes sci-fi and fantasy elements.<br/><br/>Set within the Systema Megastructure, you follow the adventures of Jeremy, a cybernetic construction worker armed with a large nail gun, and Alex, a cold vampire with a blade forged from blood. Through two separate campaigns, fight your way through machines and zombies as a mysterious alien race threatens to destroy humanity.<h3>Story:</h3>In the year 5682, an alien parasite infects the inhabitants of a damaged starship, and causes its security system to go rouge. Once docked, a construction worker named Jeremy boards the ship, where he finds a supernatural vampire leading the infected. There, Jeremy must fight for his life against the vampire and her horde of undead minions.<br/><br/><br/>Over 2,000 years after the starship incident, the Megastructure is filled with a vast number of vampires. One such vampire, Alex, rushes through the Megastructure to rescue her friend from captivity. Unbeknownst to her, a plan to restore all of humanity has been set in motion.<h3>Key Features:</h3><ul><li> 10 levels across two campaigns<br/></li><li> 5 bosses<br/></li><li> 2 playable characters<br/></li><li> Various secrets and cheat-codes<br/></li><li> Fast and precise movement</li></ul>", "metacritic": null, "released": "2019-10-04", "tba": false, "updated": "2019-08-28T21:43:28", "background_image": "https://media.rawg.io/media/screenshots/281/281984144ab96b797b3867bcd6000c12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Snizix"], "genres": ["Action", "Indie"], "publishers": ["Studio Snizix"], "esrb_rating": null}