{"id": 367176, "slug": "moastray", "name": "MO:Astray", "name_original": "MO:Astray", "description": "<p>Game CharacteristicsNever before seen movements and abilities including sticking, ramming, parasitic takeover and even memory recall are used to further open up the story!<br />\nWith a meticulous pixelated style and super-smooth movements, the game is set in a full-on otherworldly, science fiction atmosphere with stunning, life-like sound effects and music.<br />\nOn the verge of death, players will need to use their minds to the fullest to find a way out. Wait, observe, plan out your path, and use your special abilities wisely.<br />\nDon&#39;t think you can easily bully this jelly-like organism! In this sinister environment, using him to the fullest will be your greatest advantage.<br />\nCollect key materials to unlock more storylines and piece together what is really going on...<br />\nStick: Utilize the character&#39;s special trait to clear all the tricky traps<br />\nSkill: Use your enemies to dodge attacks<br />\nChallenge: Exciting Boss battles<br />\nJump: Feel the sense of speed as you dash through the air<br />\nChange: A control experience that changes according to the levelBackground StoryThrough the moist, pitch-black darkness the eerie sounds of giant machinery can be heard. In an advanced facility that has been invaded by otherworldly beasts and local inhabitants, the fully-automatic system controlled by the main computer is still operating like a mad man. Awakening inside an abandoned laboratory, the green, ambiguous lifeform MO discovers that it not only has to face an extremely hostile and sinister environment, but it also must face humans who, having been taken over by alien parasitic plants, are now stuck in the endless limbo between death and rebirth. What&#39;s more, there seems to be an eerie presence that&#39;s watching all of this from the shadows.  After groping around for clues, MO gradually becomes aware that it is responsible for a mission of immense importance. Under the guidance of the mysterious mutterings in its ear, MO is able to overcome one obstacle after another.<br />\nWho caused this disaster? And on this path that leads to answers for every unsolved riddle, what sorts of trials and tribulations lie ahead?</p>", "metacritic": null, "released": "2020-11-12", "tba": false, "updated": "2023-12-22T17:06:54", "background_image": "https://media.rawg.io/media/screenshots/eca/eca5a3a8061951cbca3c38141448637e_3wfi7Pu.jpg", "website": "", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 61, "owned": 777, "beaten": 16, "toplay": 34, "dropped": 7, "playing": 6}, "playtime": 2, "achievements_count": 9, "ratings_count": 32, "suggestions_count": 601, "game_series_count": 0, "reviews_count": 32, "platforms": ["Nintendo Switch", "iOS", "PC"], "developers": ["Rayark International", "Archpray"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Rayark International", "Rayark"], "esrb_rating": null}