{"id": 367124, "slug": "out-there-oceans-of-time", "name": "Out There: Oceans of Time", "name_original": "Out There: Oceans of Time", "description": "<p>Modern Wolf presents Out There: Oceans of Time, developed by Mi-Clos Studio, the creators of Out There and Sigma Theory.<br />\nIn a far-flung corner of the universe where humans are a disdained minority, you were entrusted with transporting the most dangerous being alive to an impregnable prison—and it escaped. Now you must lead a team of explorers, misfits, and bounty hunters on a galaxy-spanning mission of redemption to find the Archon and recapture it before it is too late.<br />\nOut There: Oceans of Time is the sequel to Out There, the half-million-unit-selling indie hit from Mi-Clos Studio. An ambitious new vision for the Out There universe, Oceans of Time will thrill fans of the previous game but you don&#39;t need to have played the original to love this new edition: Oceans of Time is a standalone story in the Out There saga.<br />\nFeaturesExplore a vast 3D universe that is different every time you play<br />\nMeet strange alien beings and learn to communicate, trade, and conduct diplomacy with them as you build a coalition of allies in your quest to find the Archon<br />\nManage your crew and officers, recruiting new members from the alien races you encounter<br />\nFind and salvage new ships to commandeer for your missions<br />\nLead your away teams on daring expeditions to probe derelict spaceships, ancient cities, and desolate planets to learn their secrets<br />\nUpgrade and maintain your ship, managing scarce resources that can be replenished through trade or planetary exploration<br />\nWeave your way through a epic branching narrative with multiple endings told through interactive cel-shaded cutscenes written by FibreTigre and illustrated by renowned artist Benjamin Carre (Transformers: Age of Extinction, Alone in the Dark)</p>", "metacritic": null, "released": "2022-05-26", "tba": false, "updated": "2023-12-01T22:36:22", "background_image": "https://media.rawg.io/media/screenshots/fde/fde3e3be090badcf7379fcf6bd6b8e5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 24, "beaten": 1, "toplay": 10, "dropped": 2, "playing": 1}, "playtime": 2, "achievements_count": 47, "ratings_count": 4, "suggestions_count": 217, "game_series_count": 4, "reviews_count": 4, "platforms": ["PC"], "developers": ["Mi-Clos Studio"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Modern Wolf", "Fractale"], "esrb_rating": null}