{"id": 367145, "slug": "they-cant-stop-all-of-us", "name": "They Can't Stop All Of Us", "name_original": "They Can't Stop All Of Us", "description": "<strong>Outwit your enemies and control the battlefield</strong><br/><br/>Two game developers are back with a brand new strategy game. The combat defense/attack strategy game They Can't Take Us All gives you control of either building up defenses or crafting clever armies to overwhelm your friends. Counter different playstyles with your own strategy over an objective based battlefield with co-operative play and tactical depth.<br/><br/><strong>Main Features:</strong><h3>Defend the objectives </h3>Have free control over placing structures and create a line of defense against the attacker.<h3>Create your army</h3>Place troops to increase income, manage your resources and balance your spending to effectively wipe out the defenders and take the objective.<h3>Choose your class </h3>Coordinate with your team and create the most efficient loadout to counter the enemy player.<h3>Gain more resources</h3>Destroy enemy troops to gain resources for more advanced buildings and tactics.<br/><br/><br/><strong>Be a part of the community</strong><h3>Join us on Discord</h3>Be a part of the discussion whether it be showing off cool screenshots &amp; videos or helping to discuss balancing and new content. You can join us on Discord by clicking the website link to the right of the description.<br/><br/><br/><strong>MADE FOR YOU!</strong><h3>A team of two!</h3>This entire game was created &amp; developed by only two people! It's completely free-to-play so everyone can enjoy it. We're working really hard to try and make it the best we can and hope you have as much fun as possible.", "metacritic": null, "released": "2019-09-13", "tba": false, "updated": "2019-08-23T12:10:47", "background_image": "https://media.rawg.io/media/screenshots/dd4/dd4a089cbe51896b90dd4991e9870273.jpg", "website": "https://discord.gg/ArEbAut", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 145}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Whiteout Studios"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Whiteout Studios"], "esrb_rating": null}