{"id": 367110, "slug": "feng-kuang-de-tan-ke", "name": "疯狂的坦克", "name_original": "疯狂的坦克", "description": "Crazy tank is a one-man adventure game.You can gain diamonds by controlling tanks, killing enemies and completing a number of achievements.Unlock new tanks with diamonds, and upgrade tanks.If you like to play with your friends, there's also a two-player mode where you and your friends can play each other fairly.Better game experience in the crazy tank.<br/>\r\n1: there are 4 tanks and one original tank in the game.<br/>\r\n2: tanks can be upgraded in the game, making them more powerful.<br/>\r\n3: there are 24 maps, 20 levels and 4 chicken eating levels in the game.<br/>\r\n4: you can choose double play mode, and play with good friends to see who is more powerful operation.<br/>\r\n5: each level will randomly generate 5 VLCS.<br/>\r\n6: randomly generate 5 resistant boss tanks per level (more and more). Take chances to kill them.<br/>\r\n7: the last enemy in each level becomes a super boss.<br/>\r\n8: in flight state, press K to adjust the perspective (keyboard), and move up and down to adjust the perspective (mouse).<br/>\r\n9: in all scenarios, press the space to pause the game, and you can choose to go back to the main page or play again.P key to switch view.<br/>\r\n10: : escape kill small game, want to kill the enemy, as long as the head hit fly it.<br/>\r\n11: bubble big chaos fighting small game, press the Z key can jump in situ (on the ground).", "metacritic": null, "released": "2019-09-16", "tba": false, "updated": "2019-08-28T21:43:31", "background_image": "https://media.rawg.io/media/screenshots/b57/b57c2436bea39ac094774a8751bcc51c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["my4399xhw"], "genres": ["Adventure", "Casual"], "publishers": ["my4399xhw"], "esrb_rating": null}