{"id": 367288, "slug": "zombie-call-dead-shooting-sniper-3d", "name": "Zombie Call: Dead Shooting Sniper 3D", "name_original": "Zombie Call: Dead Shooting Sniper 3D", "description": "BEST ZOMBIE SHOOTING GAME<br/>How do you save the world from a tide of raging zombies?<br/>Get ready to find out in this epic action shooter. Download fast!<br/><br/>- Shoot your way through zombie filled battlefields<br/>- Win an epic campaign<br/>- Shoot tons of bullets with many powerful guns<br/>- Fight and kill powerful bosses<br/>- Grab a mini gun and relieve zombie soldiers from their duty<br/><br/>A SECRET MISSION<br/>It's 1945 and you're an elite commando sent behind the enemy frontline. Your mission was to find and destroy a secret experimental facility hidden in the woods. Your commander briefed you on a need-to-know basis - you couldn't know that the enemy was turning dead bodies into bloodthirsty zombies. When all hell broke loose your target became to survive.<br/><br/>WAR TO END THEM ALL<br/>Zombie killing games were never so fun and advanced! Warfare in this free game is as dynamic as it gets. You can't hesitate - you can either win or die. Your actions will determine the outcome of this war. Save left for dead civilians from becoming zombie food.<br/><br/>UNDEAD MEN TELL NO TALES<br/>Save the world from an outbreak of elite soldiers turned into zombies. Become the ultimate commando in a war against the evil. The dead zombie soldiers know no honor or duty, only hunger. When you're walking among the dead your only option is to kill. Shoot your enemies like a cod in a barrel! Show no mercy as the dead soldiers have only one target - to eat your brain.<br/><br/>MAXIMUM FIREPOWER<br/>Free some breathing space from the dead with powerful grenades. Just target with simple controls and shoot any survivors. This shooter game will allow you to enter a dark and cold world of constant warfare with zombie soldiers at the hellgate of this world.<br/><br/>FREE REWARDS<br/>Get ready to win additional rewards in everyday contests. Try your luck and grab the prize. You can also earn more currency through unique in-game achievements rewarded to you for outstanding performance in the line of duty. Use it well to multiply your success in the game.<br/><br/>GET READY FOR MAYHEM<br/>Lock and load and jump right into zombie shooting action set in an amazingly detailed World War II battlefield. Act like a cold-blooded contract killer with these zombies. Will you come out alive to save the world?<br/><br/>PICK YOUR WEAPON <br/>Choose if you prefer to take down your target with a precise pistol or a fast mini gun. All fans of fast paced fun gameplay will have something for them to enjoy. A wide selection of guns awaits you, so grab your weapon of choice and head right into the action.<br/><br/>BREATH-TAKING GRAPHICS<br/>Modern technology allows this game to look good on all modern mobile phones.<br/><br/>AWESOME GAMEPLAY<br/>Travel on a battle train and protect yourself from an endless onslaught of zombie enemies. Unlock original and rewarding guns to handle more powerful types of foes. Renew your health with first-aid kits and decimate your enemies with grenades.<br/>You're going to love it!", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2019-08-23T04:31:49", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a5421243972937486c5e45e1a528854_TGzPG2v.jpg", "website": "https://www.facebook.com/tbullgames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["T-Bull"], "genres": ["Action", "Simulation"], "publishers": ["T-Bull"], "esrb_rating": "Mature"}