{"id": 367251, "slug": "flow-fit-sudoku", "name": "Flow Fit: Sudoku", "name_original": "Flow Fit: Sudoku", "description": "SUDOKU MEETS JIGSAW IN THIS ADDICTIVE EVOLUTION OF EVERYBODY’S FAVORITE NUMBER PUZZLE!<br/><br/>From the makers of Flow Free, the #1 hit puzzle game with over 300 million downloads comes Flow Fit: Sudoku! <br/><br/>A UNIQUE TWIST ON SUDOKU<br/>Flow Fit: Sudoku is a whole new way to play! Part Sudoku, part Jigsaw, these shaped boards, colorful pieces, and challenging logic puzzles are guaranteed to get those cogs turning. <br/><br/>OVER 2000 UNIQUE PUZZLES &amp; DAILY PUZZLES<br/>Keep your brain young with daily puzzles that never get old. Carefully crafted, high-quality puzzles delivered to you every day, each Sudoku puzzle offers a brand new challenge to wrap your head around. Earn a streak and watch the days pile up. Can you earn a year-long streak? <br/><br/>GO EASY OR GO EXTREME— YOU DECIDE! <br/>Looking for an easy-breezy brain teaser or an uncrackable enigma? With difficulties ranging from easy to extreme, there’s a puzzle to suit everyone. <br/><br/>MIX IT UP WITH PUZZLE BUNDLES <br/>Whether you’re looking to hone your Sudoku strategy with Regions or take a walk on the wild side with Wildcards, there’s always a new bundle to explore. <br/><br/>-----------------------------------------<br/>FLOW FIT: SUDOKU – FEATURES<br/>-----------------------------------------<br/><br/>- Over 2000 unique puzzles with difficulties from easy to extreme<br/>- Daily Puzzles! Play every day to earn a streak<br/>- Mistake marking to help improve your strategy &amp; stay on the right track<br/>- Track your Perfects! Challenge yourself to play mistake-free.<br/>- Beautiful calming music and atmosphere<br/>- Earn achievements for pack completions and daily streaks<br/>- Sync your progress to the cloud<br/>- Get more hints and levels by watching rewarded videos<br/>- Unique shaped boards and Tetris-style puzzle pieces<br/><br/>EXPERIENCE THE NEWEST EVOLUTION OF SUDOKU!<br/>Download Flow Fit: Sudoku today!", "metacritic": null, "released": "2019-08-19", "tba": false, "updated": "2019-08-23T04:18:53", "background_image": "https://media.rawg.io/media/screenshots/c5c/c5ce1c2761cef52c0bcfa903bd88dc82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Duck Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Big Duck Games"], "esrb_rating": "Everyone 10+"}