{"id": 367275, "slug": "car-crash-simulator-3d", "name": "Car Crash Simulator 3D", "name_original": "Car Crash Simulator 3D", "description": "Are you ready to take the adventure of car crash beamng drive 3D Simulator challenge and skilled enough to master it? It's time to demolish traffic rules and drive your car crash racing games 3d freely with bullet speed on city highways in realistic mode. Enjoy High Speed Car Crash Accidents on city highways and bumpy roads of offroad in this beam drive accident simulator 2018. <br/><br/>In this extreme Car Crash realistic Mustang GT endless speed breaker car racing by hitting and smashing the other cars, jeeps, truck trailer and heavy buses. Its your important and one of the best mission is to destroy his opponent at any cost and get more coins for new and thrilling levels that will make you more challenging. For taking a run down in this extreme police car crash games 3D simulator your first mission is to choose the most realistic car, tighten your seat belt with holding the steering of this police car crash. Check your car body endurance with some quality crashes in mayhem crashing tournament. <br/><br/>Experience the Extreme realistic car crash games in a realistic mode driving through deadly speed breaker on drift car racing Impossible 3D tracks. Adventure healthy wreckage crash challenge game which you have never experienced before. Hitting car crash games with huge explosion and crashing them in the limited time is the best way to get your mind relieved in demolition attempt. Now you can enjoy this extreme car with amazing city environment in derby beam drive.<br/><br/>Features:<br/>Awesome 3D Graphics.<br/>Crashes of death fall car in derby beam<br/>Multiple speed bumps with impossible 3D tracks<br/>Real Car Models for smash racing", "metacritic": null, "released": "2019-08-16", "tba": false, "updated": "2019-08-23T04:26:40", "background_image": "https://media.rawg.io/media/screenshots/cd4/cd492cfcae7020d2bc8c6279254b8eb7_nLiIe19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MASH Entertainment"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["MASH Entertainment Pvt"], "esrb_rating": "Everyone 10+"}