{"id": 367286, "slug": "road-racing-highway-traffic-driving-3d", "name": "Road Racing: Highway Traffic Driving 3D", "name_original": "Road Racing: Highway Traffic Driving 3D", "description": "EXPERIENCE THE NEW DEFINITION OF TRAFFIC RACING<br/><br/>Play the ultimate endless traffic racing game. Beat crazy challenges and race in a selection of modified cars.<br/><br/>Features:<br/>- extreme graphics<br/>- hardcore police chases (with helicopters!)<br/>- almost impossible challenges<br/>- rich and random tracks<br/>- extensive car tuning<br/>- online leaderboards<br/>- fast traffic racing action<br/><br/>The next generation in mobile racers is here! Road Racing brings to you one of the most fulfilling and satisfying traffic dodging experiences in the world.<br/><br/>Head out to become the best new racer on the streets! The game is on, and millions of other players will compete for the top ranks on the global leaderboard. Race the traffic and complete the challenges to get real among the competition. Only the best racers will immortalize themselves in the halls of street racing fame.<br/><br/>Dodge cars in the endless traffic on procedurally generated asphalt tracks. Each gameplay is going to be a new experience. Watch the level unfold as you race for the points. Explore unique world settings - each place has its own vibe and feel.<br/><br/>Road Racing takes place in the Top Speed universe - if you've played it then you might see a familiar face or two!<br/><br/>Standing in the traffic was never an option. Unleash yourself on a ticket-earning endless rampage in Road Racing. Break the rules, challenge the odds and play to win. Download now!", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2019-08-23T04:30:51", "background_image": "https://media.rawg.io/media/screenshots/b34/b34354e4b9e1e13da5de6f39aa4a7ab8_qZJPNrt.jpg", "website": "http://t-bull.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["T-Bull"], "genres": ["Simulation", "Racing"], "publishers": ["T-Bull"], "esrb_rating": "Everyone 10+"}