{"id": 367210, "slug": "hot-wheels-infinite-loop", "name": "Hot Wheels Infinite Loop", "name_original": "Hot Wheels Infinite Loop", "description": "Experience the insane challenges of real-time 8-player PVP racing while you smash, crash, and stunt your way to victory! Collect legendary Hot Wheels® cars like Bone Shaker™, Twin Mill™, Shark Bite™, Rodger Dodger™ and more while upgrading your fleet to compete in the ultimate racing league.<br/> <br/>The year is 2068. Hot Wheels® has unveiled the most amazing car racing experience: The Infinite Loop – an all-new racing sport where extreme stunting, crashing, smashing, loops, and tricks make legends and dreams come true!<br/> <br/>COMPETE AGAINST THE WORLD<br/>• Race against players in real-time 8-player PVP battles<br/>• Compete in tournaments for special rewards and epic prizes<br/>• Challenge other racers and compete against the world<br/> <br/>SMASH &amp; CRASH YOUR WAY TO THE TOP<br/>• Drift to fuel your boost and speed your way ahead of your rivals<br/>• Smash and crash your Hot Wheels® through New York and London<br/>• Monstrous nemeses and clever traps are ready to take you down - avoid them at all cost!<br/> <br/>UNLOCK, UPGRADE &amp; COLLECT LEGENDARY HOT WHEELS<br/>• Collect legendary Hot Wheels® and add awesome skins<br/>• Win rewards and level up by acquiring the rarest cars<br/>• Maximize the performance of every Hot Wheels®<br/><br/>Are you ready to take on the Infinite Loop? - Challenge Accepted!<br/> <br/>Currently optimized for iPhone 7 and above and iPad 6th generation and above.<br/><br/>SUBSCRIPTION DETAILS<br/>• This app offers monthly and annual subscriptions.<br/>• If you subscribe to a free trial, monthly or annual subscription, payment will be charged to your iTunes account after you confirm your subscription.<br/>• Users may be offered a free trial of the subscription in accordance with the banners or offers inside the app.<br/>• One free trial per iTunes account on new subscriptions only.<br/>• If a free trial is offered, users will need to opt-in to a subscription in order to accept the trial period and will have the right to opt-out at any time during the trial period, until 24 hours prior to the end of the trial period.  Users will be automatically charged after the trial period if they have not opted out at least 24 hours prior to the end of the trial period.<br/>• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the User’s Account Settings (Manage Subscriptions section) after purchase.<br/>• You can cancel your subscription any time, but please note that your subscription will remain effective until the end of the current period and you will not get a refund for any remaining period of a subscription. <br/>• Please note, like all other Apple subscription apps, this app cannot use family sharing to share subscriptions across families.<br/><br/>If you have any questions or need any help, please contact our Customer Support at http://service.mattel.com/us/ContactUs.aspx<br/> <br/>This app is subject to an End-User License Agreement: https://hotwheels.mattel.com/sites/mattel.infiniteloop/files/MattelMobileApps-TermsOfService-AllPlatforms.pdf<br/><br/>Privacy Policy: https://corporate.mattel.com/privacy-statement.aspx<br/>", "metacritic": null, "released": "2019-08-22", "tba": false, "updated": "2019-08-23T03:57:27", "background_image": "https://media.rawg.io/media/screenshots/e35/e3531a3021473527063ca7bef9536ed2_vwgmmJN.jpg", "website": "https://hotwheels.mattel.com/en-us/explore/infinite-loop", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 180, "game_series_count": 17, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Mattel"], "genres": ["Racing", "Casual"], "publishers": ["Mattel"], "esrb_rating": "Everyone 10+"}