{"id": 367357, "slug": "unwynd", "name": "UNWYND", "name_original": "UNWYND", "description": "NOTE: UNYWND is recommended to played on iOS 6 or above. UNWYND will work on properly on iPhone 5c, iPad 3, iPad mini and above.<br/><br/>**Apple's Best of 2015 Games<br/>**Editor's Choice: iOS<br/>**Finalist on the Big Indie Pitch at Pocket Gamer Connects Bangalore 2015!<br/>**Finalist on the Game Hack Regional Event at Game Hack India 2015!<br/><br/>Inspired by games like Strata and Kami, UNWYND is made with pure intention of offering a very sleek and sharp puzzle experience to the fans of puzzle genre. Most of the mobile games being developed these days cater towards casual audience and there's a lack of content for the hardcore puzzle fans. <br/><br/>That's where this zen puzzler comes in. It offers that challenge that's missing from these modern casual games. The game employs a simple swipe based mechanic in order to solve meticulously crafted combo - based puzzles. <br/><br/><br/>Instructions:<br/><br/>Touch the colored blocks to spawn ribbons horizontally/vertically.<br/>These ribbons mark blocks with similar colors in to O's and blocks with different colors in to X's.<br/>Complete the objectives on the top by swiping ribbons and strategizing your moves.<br/><br/><br/>Reviews:<br/><br/>    \"when a nicely chilled puzzler like Unwynd comes along, it's always a refreshing change of pace.\"<br/>    - Peter Willington, Pocket Gamer<br/><br/>    \"There are multiple solutions available for each puzzle, so UNWYND ends up quite relaxing. Without the stress of timer or stars to aim for, it’s fun to decipher things. \"<br/>    - Jennifer Allen, 148 Apps<br/><br/>    \"Unwynd proved to be a nice time-killer – if you like using your brain, that is. It’s not an easy game! \"<br/>    - Mary-Anne Lee, Games In Asia<br/><br/>    \"This is a great puzzle game for the casual or more advanced fan of brain-teasers, as it makes you think with colors and consider every move you take.\"<br/>    - Jaime Parra, 30plus Gamer<br/><br/>    \"The gameplay is fresh and enjoyable for the entire family and kids; it gives the brain a small workout to either charge up or cooldown.\"<br/>    - Ajay Verma, Illgaming<br/><br/><br/>Features: <br/><br/>- Simply Swipe the blocks to Solve neat and colorful puzzles<br/>- Multiple solutions to each puzzle<br/>- Interesting new chapters<br/><br/><br/>More Info:<br/><br/>- Inspired by the classic game of Tic-Tac-Toe, UNWYND features some amazing color based puzzles.<br/>- Completely new UI and UX to suit the iOS audience.<br/>- There is a lot of room for a lot of solutions to a single puzzle with more than 3 level packs.<br/>- Gameplay Additions just for the iOS audience.<br/>- Gesture based gameplay where we lay down the puzzles and players “paint” their own solutions.<br/>-Supported Languages: English, Japanese, Chinese, Spanish, Portuguese, German, Italian, Russian<br/><br/><br/>Want to know more about us? Visit our social channels:<br/><br/>Follow us Twitter : twitter.com/dropoutgames<br/>Like us on Facebook : facebook.com/dropoutgames<br/>Subscribe to our Youtube Channel: http://bit.ly/1HsBQDm<br/><br/><br/>Have any difficulties or suggestion? Mail us at help.dropout@gmail.com or reach us at facebook.com/dropoutgames", "metacritic": null, "released": "2015-06-26", "tba": false, "updated": "2019-08-23T05:05:07", "background_image": "https://media.rawg.io/media/screenshots/37f/37f520f18cbb51edbc9de17e9dcd0c0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dropout Games"], "genres": ["Puzzle"], "publishers": ["Dropout Games Private"], "esrb_rating": "Everyone 10+"}