{"id": 367301, "slug": "future-flying-city-robot", "name": "Future Flying City Robot", "name_original": "Future Flying City Robot", "description": "Welcome to the futuristic era of this earth. During world war 3 humans are almost vanished from the face of earth due to excessive use of atomic weapons. Now very few people lived in the city of New York who survived the world war 3. Few human friendly futuristic robots who help the human kind during war also survived. Now these robots help peoples to reestablish from the ashes of world war 3. Get ready for amazing and highly engaging Future Flying City Car Robot Transform. Be an eminent flying robot or flying car which is on a mission to protect the futuristic city against gangsters and mafia lords. Now a days some evil robots trying to destroy the human race from the face of this beautiful earth. In Future Flying Robot Transform the vice city is looking for highly trained real robot or vigilant robot car, which has flying kill machine weapons.<br/><br/>Drive Car in city and transform into flying machine to rescue people!!<br/><br/>Game Features:<br/><br/>-\tAmazing City &amp; Futuristic game Environment<br/>-\tSuperhero City Robot Flying Rescue Simulator Game<br/>-\tSmooth Controls for Quick Robot Hero Movements in Grand City.<br/>-\tGreat Robot Controls and Transform Animations<br/>-\tHigh Quality 3D Graphics and Sound Effects<br/>-\tInteresting Challenging Scenarios", "metacritic": null, "released": "2017-12-11", "tba": false, "updated": "2019-08-23T04:36:54", "background_image": "https://media.rawg.io/media/screenshots/3f0/3f00dd2a7976418bc5fc27cab51626b9_MgT7xNh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MASH Entertainment"], "genres": ["Action", "Simulation"], "publishers": ["MASH Entertainment Pvt"], "esrb_rating": "Teen"}