{"id": 367316, "slug": "off-road-jeep-hill-climbing-4x4", "name": "Off-Road Jeep Hill Climbing 4x4", "name_original": "Off-Road Jeep Hill Climbing 4x4", "description": "Join the world's best jeep driving game in mountain roads from one hill station to another. Enjoy the jeep driving in forest and mountains and also jeep driving in water and mud with best jeep engine physics in this dirt track trials forest driving and parking simulator. This offroad jeep mountain climb 3d offers great variety of 4x4 high engine power vehicles. Drive the best Jeep models and enjoy beautiful but almost impossible mountain road to drive. In this 4x4 bumpy truck driving game dare to drive off road mountain hill climb jeep in most classic hill tops. Become a dangerous jeep off-road mountain driver by performing offroad jeep adventure hilly bumpy jeep drive in this Offroad Driving 2017. Experience Offroad Jeep Mountain Climb on Curvy Roads &amp; Dangerous Hill Side.<br/><br/>Prepare yourself for this new 2017 super models Jeep driving adventure game. Use your best driving skills to beat the most mind blowing impossible track racing in this physics base simulation game. This extreme game requires extraordinary driving skills from driver who know how to control heavy off road vehicle like offroad cars, and real trucks. Tighten your seat belt and take your Raptor Jeep on uphill tracks. Earn money to unlock more jeep colors including high quality shining jeeps colors. Customize your jeep according to your choice and enjoy driving in tough terrain. <br/><br/><br/>Game Features: <br/><br/>- Free to download and easy to play<br/>- Touch or tilt steering options both including handbrake<br/>- Realistic car physics.<br/>- Motion Based Inner Steering Control.<br/>- Amazing 3D graphics design bringing reality in game <br/>- 3D designed Tricky muddy offroad tracks", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2019-08-23T04:42:18", "background_image": "https://media.rawg.io/media/screenshots/10e/10e8e6a3fefaed68d6fbcd5523bc14c9_hGtrS8v.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MASH Entertainment"], "genres": ["Simulation", "Racing"], "publishers": ["MASH Entertainment Pvt"], "esrb_rating": "Everyone 10+"}