{"id": 367342, "slug": "minimal-meet", "name": "Minimal Meet", "name_original": "Minimal Meet", "description": "Play through a modern love story about chatting and meeting up with new friends. <br/><br/>Based on real direct messages from Instagram, Tinder and Facebook Messenger.<br/><br/>Minimal Meet is a casual jumping game. Your goal is to jump up through direct messages avoiding any red angry comments and collecting as many hearts as possible.<br/><br/>Three modes:<br/>– Story mode<br/>– Endless mode<br/>– Space invaders<br/><br/>Story mode:<br/>Explore a modern love story through direct messages, see how meeting up and dating works in todays modern life. Avoid red angry comments and collect as many hearts as possible.<br/><br/>Endless mode:<br/>Survive this addictive endless mode. Collect hearts and stay at the top of the leaderboards. Endless mode is hard, so relax and go for a high score. Avoid touching anything that moves.<br/><br/>Space invaders:<br/>Go back in time to the 80's and destroy space aliens in this arcade mode. Advanced players will experience challenging boss battles and alien invaders that fight back. Note that characters that rotate don't work well in space.<br/><br/>Unlock characters:<br/>Collect hearts to unlock new characters.<br/>Each character is unique, the basketball more bouncy, the earth is large and slow while the space alien is perfect for space invaders mode.<br/><br/>Play for FREE<br/>All game modes fully unlocked.<br/>All characters unlocked through collecting hearts by playing the game.", "metacritic": null, "released": "2019-07-19", "tba": false, "updated": "2019-08-23T04:55:56", "background_image": "https://media.rawg.io/media/screenshots/cf5/cf5328a7b4d0ad98c64c67524813e424_pfHVvZx.jpg", "website": "https://www.appminimalist.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zakary Kinnaird"], "genres": ["Action", "Casual"], "publishers": ["Zakary Kinnaird"], "esrb_rating": "Everyone 10+"}