{"id": 367408, "slug": "raptor-simulator-dinosaur-extreme", "name": "Raptor Simulator: Dinosaur Extreme", "name_original": "Raptor Simulator: Dinosaur Extreme", "description": "Take control of a ferocious Velociraptor (aka Raptor) and rampage the city and farm. This Dino can smash into moving trucks. Knock over streetlights, fire hydrants, and mailboxes. Watch water pour out of the Fire Hydrants as you smash into them. This Dino is hungry and looking for his next meal. <br/><br/>Features:<br/>**4 HUGE 3D Maps to Explore - Loads of Effects and Secrets<br/>**Super Fun and Fast 3D RAPTOR<br/>**Flying Jets, Helicopters, Moving Cars and Trains to interact with!!<br/>**He's Hungry, and he's not friendly!!<br/>**Excellent 3D Graphics and Exciting 3D Dinosaur Gameplay<br/>**Bears, Cows, Wolves, People, Sheep, Goats to interact with.<br/>**Day and Night Versions<br/><br/>Explore the huge city map with this giant 3D Dinosaur. <br/><br/>Objectives:<br/>Find the Hearts to stay alive.  <br/>Find the Gold Coins to Advance to the next level<br/><br/>Be sure and look around in all the corners and uncover all the map secrets. Race against a car, smash into a moving train. Chase after the Tank. Find the goats and sheep. This Dinosaur simulator is something you will not want to miss. Find the airport and hit the airplane right out of the sky. Listen for the Train coming down the track. . . You've tried Wolf Simulator, Bear Simulator, Shark Simulator, and Goat Simulator. Now give Raptor Simulator a try!!", "metacritic": null, "released": "2014-06-22", "tba": false, "updated": "2019-08-23T05:34:16", "background_image": "https://media.rawg.io/media/screenshots/382/382f6b934c4b2b6bf2a7ca991f06b512.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DevelopmentSquared"], "genres": ["RPG", "Racing"], "publishers": ["Benjamin Satterwhite"], "esrb_rating": "Teen"}