{"id": 367410, "slug": "cheetah-revenge-3d-simulator", "name": "Cheetah Revenge 3D Simulator", "name_original": "Cheetah Revenge 3D Simulator", "description": "Here comes the world's fastest land mammal - the Cheetah.   And this guy is looking for revenge. He's been hunted too long, now its time for him to do some hunting of his own. You are in control of this fast animal. Each 1000 Points you earn, he will grow. These Cheetahs are super strong and love to create chaos. Smash cars, tractors, goats, planes, fire hydrants, people, men,women,wheels, quad bikes, and anything else not attached to the ground. Smashing cars is one of his favorite things. Desert rally race cars are his favorite. He's looking to smash anything and everything in his way.  Help this African Safari creature grow from a little guy in Level 1 to a Giant in Level 30. Race around off the road or on the highway missions. Find the Airport and smash all the airplanes. Explore some pyramids in the special Egyptian Sahara level. Two of the maps have zombies to attack.  Now you will know what it feels like to be a tourist at Kruger Park who gets their car flipped over. We hope this is soon to be the best animal game on the store.<br/>This game combines elements of rampage style games with adventure games. 72 missions and loads of achievements. Try to rank in the Top 10 in the world with this mind bending sim! Awesome 3D effects!<br/>Features:<br/>--72 Missions<br/>--6 Action Packed Maps including 2 Zombie Maps<br/>--Scorpions, Spiders, and Ants to smash<br/>--Combines rampage with adventure<br/>--Excellent 3D graphics and fast gameplay<br/>--The more you play, the more he grows<br/>--The sim that has it all and more!<br/>If you ever wondered what it would be like to play a free Cheetah Simulator, this is your chance. Rampage the city or country farm. Smash everything in the city <br/>Notes: At this point, level 20 is the biggest he will get - -and by Level 30 he will be so big, it will be big enough. He goes up by 1 Level each 1000 points that is scored. This app works best on newer devices. If you enjoy playing a Shark, Goat, Crocodile, Snake, Wolf, Tiger, Elephant, Dinosaur, or Horse Simulator, you are probably going to love playing the Cheetah. Connect with us @jellyfishgiant", "metacritic": null, "released": "2014-12-18", "tba": false, "updated": "2019-08-23T05:35:50", "background_image": "https://media.rawg.io/media/screenshots/79f/79f1a49c116566a464219e6fa0054c92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DevelopmentSquared"], "genres": ["RPG", "Simulation"], "publishers": ["Benjamin Satterwhite"], "esrb_rating": "Teen"}