{"id": 367554, "slug": "khimaris-game", "name": "Khimari's Game", "name_original": "Khimari's Game", "description": "<p>-CZ-<br/></p>\n<p>Mladá archeoložka ztracená hluboko v kobce Karnaku hledá cestu k pokladu faraónů.</p>\n<p>Obsah:</p>\n<ul><li>všechno známé z původního Tomb Raidera</li><li>běhání, skákání, lezení, ručkování, šplhání po stropech, plazení, střelba, plavání...</li><li>změň si ovládání podle sebe (použij ENTER pro změnu)</li><li>nové autentické úrovně nikdy dříve publikované</li><li>hra je přeložena do češtiny</li><li>mnoho dalšího na cestě!</li></ul>\n\n<p>Povídání:<br/></p>\n<p>Po neúspěšném a neuspokojivém vývoji v Unreal Engine jsem se rozhodl zkusit něco trochu jiného, trošku retro, ale celkem fajnového. Začal jsem vytvářet vlastní hru postavenou na TRNG Enginu pro moje děti. Dětem se hra moc líbí a tak jsem se rozhodl, že i vám poskytnu živou kopii. Můžete si stáhnout aktuální build, naleznete tu vždy poslední sestavení hry. Příjemnou zábavu!<br/></p>\n<p>Pokud máte nápad jak moji hru pojmenovat, tak mi dejte vědět. Možná bude lepší jí dát nějaké normální jméno :)</p>\n\n<p>-EN-</p>\n<p>A young archaeologist lost deep in the dungeon of Karnak on her quest to find the Treasure of the Pharaohs.</p>\n<p>Feature:</p>\n<ul><li>all known to original Tomb Raider game </li><li>running, jumping, climbing, shimming, monkeygrab, crawling, shooting, swimming...</li><li>bind your own controls (use ENTER to change)</li><li>new authentic levels never seen before</li><li>game is translated to english</li><li>much more on the way!</li></ul>\n\n<p>Few words:<br/></p>\n<p>After an unsuccessful and unsatisfactory development in Unreal Engine, I decided to try something a little different, a little retro, but fresh and cool. I started creating my own game based off TRNG Engine for my kids. They love the game so I decided to provide you with a live copy. You can download the current build here, there will always be the last game set-up at this page. Have fun!</p>\n<p>If you have an idea how to name my game, let me know. Maybe a more suitable name would go better :)</p>", "metacritic": null, "released": "2019-08-22", "tba": false, "updated": "2019-08-23T06:23:41", "background_image": "https://media.rawg.io/media/screenshots/9c9/9c9e12f7761d153dd6dec25c4a6ad064.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Khimari"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}