{"id": 367722, "slug": "arachnodelic", "name": "Arachnodelic", "name_original": "Arachnodelic", "description": "<p>Arachnodelic is a psychedelic endless runner where you play as a spider trying to catch bugs and avoid bug bombs. Everything starts off relatively normal, with a classy black and white style, but as you level up... things get weird!</p>\n<p>Made for casual gameplay and short play sessions, Arachnodelic challenges you to beat your best scores by deciding when (and if) you want to level up. You get a sweet score multiplier each level, of course, but can you avoid getting blown up as the game tries to distract you with crazy colors and special effects?</p>\n<p>At this time, Arachnodelic is available for Windows only, tested in Windows 10 64-bit edition, and opens in a standalone player. You can choose the resolution and choose between windowed and fullscreen.</p>\n<p>The controls are simple - move left and right using either the arrows, or the A and D keys. Pause with the Escape key. You can also control the music and SFX volumes in the menu.</p>\n<p>This is our second completed game! We - my husband and I - are Red Nebula Studios, and this game was completed as a self-imposed \"make a game in 1 month\" challenge, like our first game, Rat-a-Sewey. It was made in Unity and completed between July 20th and August 20th, 2019. I did the artwork and programming, and my husband and I worked together on the sound effects. A big thank you to Eric Matyas of www.soundimage.org for the music!</p>\n<p>I have also documented the game dev process over on my YouTube channel, Ms.RedNebula. Please feel free to take a look if you'd like to see how this project came together!<br/></p><p>8/21/2019 Patch - Uploaded version 1.02 which fixed a glitch where high scores would sometimes not be registered properly. Sorry about that!</p>", "metacritic": null, "released": "2019-08-21", "tba": false, "updated": "2019-08-23T07:05:08", "background_image": "https://media.rawg.io/media/screenshots/5b2/5b2b2d526b5070faf7378fd5fa2d75db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ms.RedNebula"], "genres": ["Action"], "publishers": [], "esrb_rating": null}