{"id": 367938, "slug": "the-silence-itch", "name": "the silence (itch)", "name_original": "the silence (itch)", "description": "<p>The Silence is a short game about abuse and how it effects the victim.  It is based on a true story.</p>\n<p>In the game, you explore an empty room.  Items that belonged to the character will begin to appear one by one.  When you examine these items, the character will recall a memory. </p>\n<p>In these memories you will see how the abuse affected the character.  You see the emotions they felt and how it slowly destroyed them.</p>\n<p>Abuse can tear you apart down to the bones, leaving you vulnerable in the darkness like a plant starved of light.  You absorb any light the abuser throws at you, no matter how small.  That little bit of light is what draws you in and traps you.  For even the smallest amount of light will shine in a room full of darkness.  So you sit there, distorting your body as you grow towards any light.</p>\n<p>Some people speak out about abuse, while others march and protest.  Some try to move on but they can’t.  And even though they may be free from that darkness, they are still somehow trapped by it.  So they stay silent.</p>\n<p>Who you are does not matter.  Your gender does not matter.  It can happen to anyone, and it does.  I know this because The Silence is my story.</p>\n<p>While this happened a lifetime ago, I still struggle with it today.  For me, making this game and sharing my story is a form of closure.  And a big part of that closure is forgiveness.</p>\n<p>“Sometimes, the only way to heal our wounds is to make peace with the demons who created them.” - Dr. Ishiro Serizawa\r\n</p>\n\n\n<p>Controls:</p>\n<p>ARROW KEYS for direction</p>\n<p>SPACE BAR to select/interact</p>\n<p>ESC KEY for menu</p>\n<p>**The game was tested on several different monitors/tvs.  Screens that have the brightness turned down may be hard to see.  If the title screen appears too dark, you should increase the brightness.**</p>", "metacritic": null, "released": "2019-08-19", "tba": false, "updated": "2019-08-23T07:58:19", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7fa34467d21475294df88e42bfa3795.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["8bitpxl"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}