{"id": 368133, "slug": "pizza-game-2", "name": "Pizza Game", "name_original": "Pizza Game", "description": "<p>Kiane is fresh out of college and has just landed the job of her dreams: secretary for billionaire tech CEO, Mr. Arimnaes. Wealthy, suave, and a carbon-based life form, Mr. Arimnaes checks all the boxes for the perfect boyfriend. Can Kiane meet his high standards and win his heart, or will she become his next victim? Wait hold on... I wasn&#39;t supposed to spoil the fact he&#39;s a serial killer where is the delete keyStoryPizza Game is a comedy dating sim for people of all types. With six (seven? idk I&#39;m just an intern) different love interests, you&#39;re destined to meet your perfect match. Nice guy! Rude guy! Girl! It&#39;s all there!<br />\nWork as a secretary, take night classes, or get a job as a pizza waitress while uncovering the town&#39;s sinister secrets. With the help of her sassy thought bubble, Inner Me, there&#39;s nothing Kiane can&#39;t accomplish. Pizza Game clocks in at around 185k words, most of which are bad, and features over two dozen characters, most of which are bad. Play through 6 romance routes, including 4 GxB and 2 GxG, as well as a True Route where the edgy stuff happens!GameplayIt&#39;s a visual novel, so there isn&#39;t any!<br />\nClick to advance the dialogue!<br />\nAdjust the volume!<br />\nMake choices that affect Kiane&#39;s relationships!<br />\nUnlock music room tracks and character menu announcer voices after every route!<br />\nSnap photos with Kiane&#39;s disposable camera to unlock easter eggs or change the course of the story!<br />\nQTEs, personality quizzes, investigations, plus a stealth game segment(?)!<br />\nThe choices you make will affect your relationships and possibly whether or not you survive. Will you find the right combination of mouse movement and keystrokes required to win the game? Or will you get bored and play something else in your Steam library first? The only way to find out is if you buy Pizza Game. There is no other method. Do not google search for a let&#39;s play.<br />\nAccessibility FeaturesInteract using the keyboard or mouse<br />\nSubtitles for important sounds<br />\nHTML manual<br />\nTTS support via Ren&#39;Py&#39;s self-voicing and text-to-clipboard features, plus descriptions of visual jokes<br />\nOption to disable QTEs</p>", "metacritic": null, "released": "2019-09-06", "tba": false, "updated": "2020-08-09T03:15:40", "background_image": "https://media.rawg.io/media/screenshots/896/896a5c0f1b1f7fcd015767927ca257ec.jpg", "website": "https://pizzagame.party/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 3, "toplay": 1, "dropped": 1}, "playtime": 12, "achievements_count": 14, "ratings_count": 3, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "Linux", "PC"], "developers": ["Plasterbrain"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Plasterbrain"], "esrb_rating": null}