{"id": 368190, "slug": "puppet-soccer-ball-kick-strike", "name": "Puppet Soccer Ball Kick Strike", "name_original": "Puppet Soccer Ball Kick Strike", "description": "Want to be the world champion of the soccer league championship? Experience the best and the most exciting game of all times. Have you ever wondered to play extreme puppet soccer game challenge with one tap only? You have definitely played the ordinary football games before but this one is the most unique one with the one tap to shoot football game league. The football championships are around the corner so be prepared for the ultimate challenge. Play this addictive game with one tap ball goal. Hurry up! This is the brand new game.<br/><br/>Try this new game now with all the enthusiasm. Have fun with this fast arcade game play with simple on screen controls. Tap as fast as you can in this one tap soccer ball with a flick shot. Gain as much points as you can. Time for the extreme soccer kick goal. Enjoy the exciting strike game for kids. Challenge yourself for this epic extreme challenge of tap to shoot soccer ball. Be as fast as you can to tap goal. Be the best ultimate puppet soccer strike player of all times. You are the world champion in this kick soccer league stadium match. <br/><br/>Come and download this tap soccer league championship in which there are no difficult control for the tap ball soccer goal. You only need to tap on the ball to pass it through the hurdles and obstacles. Play this easy flick shot football game. Become the ultimate champion of the hit goal football game. Boost your points with the goals and make the most of it. Use different techniques to tap soccer ball and kick goal within the time specified. You are the legend of the flick shot. Unleash your techniques and other goal shot to the spectators. <br/><br/>Puppet Football soccer kick goal is another fun exciting game for kids in which they can learn different techniques to become the extreme kick soccer tycoon. Do you want some excitement and thrill in your life. This is also the perfect game for kids also as well as for the youngsters. Become the kick soccer hero by showing the different flick shot. Time for some more fun. Let’s download this tap to shoot soccer game. Compete with other players also and win points to increase your time limit. Pass the puppet soccer ball strike through the hurdles to make the hit goal perfectly<br/><br/>You are the hero in this puppet football stadium. Train and improve your freestyle skills from this football championship league. Will you accept the toughest challenge of the extreme game of 2018? There is no other game like this and you will definitely be addicted to this ultimate championship. Experience the excitement and thrill by playing this. Download it now and have fun!! <br/><br/>HOW TO PLAY TAP SOCCER KICK SHOOT BALL STRIKE LEAGUE SIMULATOR <br/>Download this game<br/>Tap to play soccer strike league now<br/>Select your favorite puppet soccer player from the character selection panel<br/>Time to start the football championship<br/>Tap to shoot the flick shot<br/>Pass the ball through the obstacles and kick soccer goal now<br/>Make the most goals within the specified time<br/>Increase your time with more one tap goal<br/>Beat the highest score<br/><br/>FEATURES<br/>Play with one tap soccer strike<br/>Increase the time with more hit goal<br/>Beat the highest goals<br/>Tap ball to pass through hurdles", "metacritic": null, "released": "2018-09-16", "tba": false, "updated": "2019-08-26T02:53:15", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bc7565d78bc9dcb584a56787ab4bef2_huQ7zB3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tik Tok"], "genres": ["Action", "Sports"], "publishers": ["Tik Tok"], "esrb_rating": "Everyone 10+"}