{"id": 368122, "slug": "laufen-und-raufen", "name": "Laufen Und Raufen", "name_original": "Laufen Und Raufen", "description": "Laufen Und Raufen is a chaotic couch co-op capture-the-flag game for 2-8 players.<br/>Take control of your penguin of choice and fight over the fish of your opponents and defend your own with your almighty flippers!<br/><br/><strong>Features:</strong><br/><ul><li>Play with or against your friends with up to 8 players in 4 teams!<br/></li><li>Show your mighty skills in a competitive capture the flag fish game with Penguins! <br/></li><li>Playful and fun gameplay requires a fun and playful art style – and we got both covered!<br/></li><li>Push penguins… into holes! It’s always fun. Oh – and you can also push a ball.<br/></li><li>Design your own levels using the built-in level editor. Express your artistic side!<br/></li><li>Expecting ice, fire, or rollercoasters? No?! Well, you should! The levels and environments of Laufen Und Raufen are rich and varied.<br/></li><li>Use the game’s easy to pick up controls to reign over the Arctics as the queen/king of the Arctic. We know you can do it!</li></ul><br/><strong>Game modes:</strong><br/><ul><li>Fish Fight: Competitive capture the flag with Penguins<br/></li><li>Push-ball: Play the aggressive football of the arctic<br/></li><li>Deathmatch: The player must push as many of the other penguins as possible<br/></li><li>Time Attack: Get the most flags within a time frame<br/></li><li>All 4 The Fish: Everyone must fight to get one flag<br/></li><li>Boss: Team up to fight against the biggest penguin</li></ul><br/>However you want to play, if you think the cold never bothered you anyway, then get ready to get your fish on!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:10", "background_image": "https://media.rawg.io/media/screenshots/3c6/3c66021fb5e3d1b11e613304e1a982f0.jpg", "website": "https://laufenraufen.nurogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nurogames"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Nurogames"], "esrb_rating": null}