{"id": 368114, "slug": "beauty-and-violence-valkyries", "name": "Beauty And Violence: Valkyries", "name_original": "Beauty And Violence: Valkyries", "description": "Beauty &amp; Violence: Valkyries is an upcoming third-person, fast-paced ARPG. Customize your Valkyries and prepare them for brutal combat. Go up against hordes of monsters and mighty bosses, unleashing the raw power of the Valkyries. Cut enemies to pieces, gut them, shred them, the darkest sides of the Valkyries will be unchained. <br/><br/><strong>Features:</strong><br/><br/><strong>Beautiful Warriors</strong><br/>Detailed customization of your heroine. Modify their face, body proportions, hairstyles, makeup, facial expressions, and more. Choose from a variety of different kinds of armors and weapons to make them the most feared war maidens that they are. <br/><br/><br/><strong>Brutal Combat</strong><br/>Unleash violence upon your foes, harnessing the strength of the Valkyries to dismember, gut, and slash. We hope you enjoy the sound of bones breaking and your enemies screaming…<br/><br/><br/><br/><strong>Immersive Levels</strong><br/>Go through numerous atmospheric environments. Hear the echoes of the dead inside the catacombs, feel your sword scrape against stone in castles, run through dark forests filled with horrifying creatures, and endure the heat of fiery infernos. <br/><br/><br/><strong>Rewarding loot</strong><br/>Boost your combat effectiveness from the spoils of combat. Item attributes are randomized, giving boosts to your abilities. You might even find the legendary weapon and armor sets, making you even stronger.<br/><br/><strong>Mythology Based Skill System</strong><br/>Control your Valkyrie’s progression through various skill trees, with a skill system based on Norse mythology. Wield the power of Thor’s Hammer and increase blunt weapon damage, and even dismember your foes!<br/><br/><strong>Long-house</strong><br/>Whenever you feel like taking a break from combat, you can relax in the longhouse. Even Valkyries need to wash down the taste of blood with a horn full of mead.<br/>", "metacritic": null, "released": "2019-10-18", "tba": false, "updated": "2019-08-28T21:43:28", "background_image": "https://media.rawg.io/media/screenshots/7ce/7ce0b8883c0ba07d7c047edb5d2b9017.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 600, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["L2 Game Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["L2 Game Studio"], "esrb_rating": null}