{"id": 368263, "slug": "heroes-of-magic-card-battle", "name": "Heroes of Magic - Card Battle", "name_original": "Heroes of Magic - Card Battle", "description": "Do you like free card battle RPG games? Then this is the game is for you! Join the quick tactical challenge and crush other players from all over the world. Featuring top new gameplay never before seen in other games! Do your best and crush your enemies in furious 3-minute battles! Become the most powerful lord and master the game! Upgrade your magic cards, try out different heroes, cast powerful spells – this game is sure to get under your skin!<br/> <br/>What you want free RPG or card battle games? You’ll like this ccg and tcg! Join this tactical games, show strategy, to crush heroes from all over the world. Try unique gameplay never before seen in other strategy card games! Crush enemies in furious 3-minute battles! Become a powerful legend duelist! Upgrade cards, play with magic heroes, cast powerful spells – strategy games is sure to get under your skin!<br/>Defeat enemy, slayers and creatures in rpg games! Use unique weapons, try combo of card battles, participate in epic war! Imperial Archers, Wind Ninjas, Magic of Divinity use this and other decks to stay alive. Clash with monsters and villains, start ccg and strategy games just now!<br/>Get ready for fast, dynamic and fun card battles. Implement real combat strategies and battle in this RPG Card game! This developed for kids and adults who loves to destroy enemy, castles like real-life castle crashers. You sure to love sorcery, fantasy rpg and fun matches.<br/>Try new combinations from new players in role playing games. Try PVP matches, multiplayer (player versus player) mode.<br/>Each strategy is unique! Participate in wars and become as a arcane legends. Opponents from over the world of collectable card games! Online battles in rpg games!<br/>Epic Warlords know unique fighting strategy in fantasy rpg!  Play card battle games, use sorcery and become a mighty savage or a noble knight! Build your clan and outwit enemies on the battlefield! <br/>A variety of exciting PVP modes (Brawl, Arena matches, Shard,  Ranked Battles, Survival, Raids, War of Clans, Tournaments, Events and even more with 3 or more players). Feel what is online battles in magic arena against real players! Enter the arena to fight worldwide gamers in turn-based battles.<br/>Tired of fighting? Try single player mode with monster hunt! Join hero in war against monsters and write your own story in magic card wars.<br/>Guild Wars. It's royal epic battles! Here you have to fight in tactical games for strategically territories and trading. Epic battles and action rpg where heroes become legend and destroy enemies! Take rewards for achievements in leagues! Get on the list of the best warriors!<br/>Improve mighty sorcery skills in fantasy games! <br/><br/>FEATURES<br/>&gt;&gt;Collect cards, use their abilities<br/>&gt;&gt;PVP and single player mode<br/>&gt;&gt;Participate  in strategic battles<br/>&gt;&gt;Climb the leaderboards<br/>&gt;&gt;Worldwide gamers<br/>&gt;&gt;CCG + online battle<br/>&gt;&gt;Unical graphic art<br/>&gt;&gt;Free to play<br/><br/>• «Heroes of Magic - Card Battle» comes with an initial three days subscription period that following features: Daily chests without ads, Additional card without ads, Double loot without ads and 250 gems bonus.<br/>• After this three days subscription period you may purchase an auto-renewing subscription through an In-App Purchase.<br/>• Auto-renewable subscription<br/>• 1 week ($4.99) duration<br/>• Your subscription will be charged to your iTunes account at confirmation of purchase and will automatically renew (at the duration selected) unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>• Current subscription may not be cancelled during the active subscription period; however, you can manage your subscription and/or turn off auto-renewal by visiting your iTunes Account Settings after purchase.<br/>• Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>• Privacy policy: http://redmachinegames.com/privacypolicy.htm<br/>• Terms of use: http://redmachinegames.com/termsofservice.html", "metacritic": null, "released": "2019-05-19", "tba": false, "updated": "2019-08-26T03:18:40", "background_image": "https://media.rawg.io/media/screenshots/eee/eee21e2e9185104699661a3fd686c686_vrqnWQX.jpg", "website": "http://v2i.teebik.com/policy.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TBG"], "genres": ["Strategy", "Card"], "publishers": ["TBG"], "esrb_rating": "Teen"}