{"id": 368371, "slug": "rescue-me-the-lost-world", "name": "Rescue Me - The Lost World", "name_original": "Rescue Me - The Lost World", "description": "Widely acclaimed Rescue Me is back to bring you to another breathtaking adventure! The mythical Lost World is threatened by earthquakes - the mighty dragon sleeping below it has gotten sick, and it’s sneezes and tumbles are shaking everything on it’s back. You have to cure him - but you need get through many levels of dangers and challenges first!<br/><br/>HIGHLIGHTS<br/>- Casual, innovative action - a running game with drag-and-drop controls!<br/>- Beautiful, detailed, cute cartoonish graphics!<br/>- Various traps - from hidden spears to swinging logs and kamikaze dinos!<br/>- Collect coins - and purchase cool powerups! Slow down time or become invulnerable!<br/>- Share your success - Rescue Me - The Lost World is integrated to Facebook! Challenge your friends and share your achievements with them!<br/><br/>CASUAL CONTROLS<br/>The controls are very easy to learn - just grab your hero with your finger to lift him to the air and swing him around to avoid obstacles. Tap the screen with a second finger to bring up the powerup menu, where you can find some nice surprises which will make your life easier.<br/><br/>AN AMAZING WORLD<br/>Whether you are flying through steaming jungles or racing forward on the dragon’s back, the beautiful - and dangerous - Lost World will never cease to amaze you! Exploring the various traps and challenges - windmills, spears, pterosaurs and crazy mazes - will take hours!<br/><br/>LOTS AND LOTS OF UNLOCKABLES<br/>Collect coins and spend them in the shop to unlock many new skins and upgrades! You’d like to play as a tough survivalist? A funny zombie? A mysterious ninja? Be our guest!<br/><br/>JOIN THE RACE<br/>Log in to Facebook and watch the map turning into one huge leaderboard. Compete with your friends from level to level - grab more coins and collectibles to become the ace. Miss someone from the list? Everyone is just a single invite away!<br/><br/>For more information please visit our website: www.pocketscientists.com<br/>Join our fan club on Facebook: https://www.facebook.com/PocketScientists?fref=ts<br/>For support or inquiries please contact us here: info@pocketscientists.com<br/>Thank you for playing Rescue Me - The Lost World!", "metacritic": null, "released": "2013-11-21", "tba": false, "updated": "2019-08-26T04:26:13", "background_image": "https://media.rawg.io/media/screenshots/4b6/4b6f62a4ec7c6809fe788d1ea99d8d6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Scientists"], "genres": ["Adventure", "Casual"], "publishers": ["Pocket Scientists Korlatolt Felelossegu Tarsasag"], "esrb_rating": "Everyone 10+"}