{"id": 368382, "slug": "star-pilot-save-the-sun-from-the-attack-of-the-ali", "name": "Star Pilot - Save the Sun from the Attack of the Alien Space Civilization", "name_original": "Star Pilot - Save the Sun from the Attack of the Alien Space Civilization", "description": "The Solar System prepares for a big celebration, a special event when a huge spaceship appears with intentions unknown. You are the pilot of an Explorer vessel, and you must uncover the secrets and intentions of the big starship. And of course you must save the Sun!<br/><br/>HIGHLIGHTS<br/>- Casual, innovative action - a space game with drag-and-drop controls!<br/>- Beautiful, detailed, cute cartoonish graphics!<br/>- Various traps - from space debris to starship weapons!<br/>- Collect coins - and purchase cool powerups! Slow down time or become invulnerable!<br/>- Share your success - Star Pilot - Save the Sun is integrated with Facebook! Challenge your friends and share your achievements with them!<br/>- An original sci-fi short story inspired by the game is included and unlocks as you progress through the adventure. The short story is written by Gyorgy Dragon.<br/><br/>CASUAL CONTROLS<br/>The controls are very easy to learn - just grab your spaceship with your finger to drive it and move it around to avoid obstacles.<br/><br/>AN AMAZING WORLD<br/>Whether you are flying through mechanical parts of the huge spaceship or over the planet's surfaces everything is beautiful and dangerous. This solar system will never cease to amaze you! Exploring the various scenes and challenges will take hours!<br/><br/>LOTS AND LOTS OF UNLOCKABLES<br/>Collect coins and spend them in the shop to unlock many new skins and upgrades! You’d like to play with an upgraded Explorer vessel? A Green Mk II? Or an Orange Mk III? Be our guest!<br/><br/>JOIN THE RACE<br/>Log in to Facebook and watch the map turning into one huge leaderboard. Compete with your friends from level to level - grab more coins and collectibles to become the ace. Miss someone from the list? Everyone is just a single invite away!<br/><br/>For more information please visit our website: www.pocketscientists.com<br/>Join our fan club on Facebook: https://www.facebook.com/PocketScientists?fref=ts<br/>For support or inquiries please contact us here: info@pocketscientists.com<br/><br/>Thank you for playing Star Pilot - Save the Sun", "metacritic": null, "released": "2014-02-07", "tba": false, "updated": "2019-08-26T04:30:51", "background_image": "https://media.rawg.io/media/screenshots/f15/f1594907d9facce095364924f2f93b0c_ohLy2vf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Scientists"], "genres": ["Action", "Casual"], "publishers": ["Pocket Scientists Korlatolt Felelossegu Tarsasag"], "esrb_rating": "Everyone 10+"}