{"id": 368300, "slug": "space-dragons", "name": "Space Dragons", "name_original": "Space Dragons", "description": "Choose your spaceship and defeat the alien threat that comes from the Moon. Blast your way crushing, ripping apart and exploding hostile aliens that are taking control of powerful weapons and military technology from Earth. Find the entity that controls the threat and make it explode into blood.<br/><br/>Space Dragons is a classic \"shoot em up\" horizontal shooting game, in which you can choose different ships with unique characteristics and abilities to destroy tons of invading aliens. During the adventure you will run into powerful bosses and explosive enemies. Get upgrades for your ship, weapons and much more to make your way through the meaty and bloody path that awaits you in Space Dragons.<br/><br/>Features:<br/><br/><ul><li>Local multiplayer</li></ul><ul><li>A great arsenal of weapons awaits you in the vast stages</li></ul><ul><li>Acumulative improvement every time you finish a stage, you will be able to achieve different combinations</li></ul><ul><li>Beautiful animated and hand-drawn pixel art characters and stages</li></ul><ul><li>Various enemies with different attacks and transformations</li></ul><ul><li>Execute the enemies and bosses to obtain improvements and earn points</li></ul><ul><li>Very frenetic and explosive gameplay</li></ul><ul><li>Every boss has a transformation</li></ul><ul><li>6 fun and complete stages, we will add up to 11 stages</li></ul>", "metacritic": null, "released": "2011-06-03", "tba": false, "updated": "2022-02-28T03:19:47", "background_image": "https://media.rawg.io/media/screenshots/e87/e87d0e782ca1b59490d57faf3d6b3f49_CbqBOco.jpg", "website": "http://www.bonuslevel.org/iphone/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC"], "developers": ["BonusLevel.org", "TEAM Black Hat Robot"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Jean-Philippe SARDA", "TEAM Black Hat Robot"], "esrb_rating": "Everyone 10+"}