{"id": 368386, "slug": "a-little-police-car-in-action-free-3d-driving-game", "name": "A Little Police Car in Action Free: 3D Driving Game for Kids with Cute Graphics", "name_original": "A Little Police Car in Action Free: 3D Driving Game for Kids with Cute Graphics", "description": "Driving on the highway makes you free! At least some common contemporary philosophers say so. Being a driver of a powerful car is still a cool thing and a lot of people fell the freedom, feel free to adventure around with a car. <br/>We have other people, who want to defend our freedom. Who want the common people to live by the rules. You can be good or you can be bad - the rules are rules. <br/>That people is called Police. They are the keepers of order and laws, they are the “good guys”. We created then a simulator game to let the best police car drivers to show their skills. Those drivers can be good kids or bad kids, we really don't care - but they will be the drivers of the best Police cars, and they can roam freely around to catch guys who believe they are free from the laws and rules. <br/>The free simulator let's you drive a sophisticated Police car, but beware - the roads are not free! They are full with good and bad guys too...<br/>And all in all it's just a free Police car simulator game.<br/><br/>Features<br/>- Unique driving experience with alternate controls. Controls are switchable.<br/>- Special challenges, as High Traffic, Crossroads, Moving Machinery, other obstacles...<br/>- You can level up in 5 different areas to earn extra profits and proof your driving skills<br/>- Beautifully crafted 3D Cartoon environment<br/>- Different police cars to drive with unique Settings for better driving experience<br/>- Customizable gameplay with numerous upgrades<br/>- Lots of different power-ups", "metacritic": null, "released": "2014-10-26", "tba": false, "updated": "2019-08-26T04:32:43", "background_image": "https://media.rawg.io/media/screenshots/813/8137d4bb95019fbd9e02153ca464e53f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Scientists"], "genres": ["Simulation", "Racing"], "publishers": ["Pocket Scientists Korlatolt Felelossegu Tarsasag"], "esrb_rating": "Everyone 10+"}