{"id": 368361, "slug": "monster-truck-3d-race-driving-offroad-4x4-rally-fo", "name": "Monster Truck 3D Race Driving: Offroad 4x4 Rally for Extreme AWD Vehicles", "name_original": "Monster Truck 3D Race Driving: Offroad 4x4 Rally for Extreme AWD Vehicles", "description": "Bigfoot - not only a mystic creature got this name, but a strange kind of car also, that you can drive. Those cars, are equipped with extremely big wheels and they cockpit is at a very high point - they are ideal for some off road fun. Driving them is a really unique experience, racing with them is even better. Interesting fact, that those cars are used for destroying other cars in the Bigfoot shows - they wheels can stomp others easily. Driving them that way is really sensational! Go Off Road, try it!<br/> <br/>Big Wheels turning fast<br/> <br/>4x4  are very popular, as they are extremely spectacular and huge. Lot of Kids are dreaming to drive such a racing machine once, going off road anywhere they want. Generally we can't see Bigfoot on highways, racing grounds or common roads, because of their size, but Off Road is their real world. There you do the racing: can speed up using the unique physics properties of the big wheeler cars, they can crush, and use their powerful engines. This is a really extreme motor sport, buts it's really popular - collisions, rushing, stumping: this is driving and racing with the big wheeler 4x4!<br/> <br/>FEATURES<br/> <br/>- Lifelike graphics covering arcade simulation aspects<br/>- Bigfoot experience<br/>- Fresh approach to 4x4 theme<br/>- Endless gameplay<br/>- Unique racing experience with big wheels<br/>- Different challenges: bottlenecks, contraflow, moving machinery, traffic, motorcycles, etc...<br/>- Intuitive control methods: direct control using your fingers. Alternate controls with relative touch.<br/>- 3D Environment<br/>- Off Road environment with vehicles, animals, machinery and natural obstacles for rel off road driving<br/>- No need of refueling, you can always concentrate on your goal<br/>- Lots of powerups: Slow Motion, Coin Magnet, Shield, etc.<br/>- Different skins for your vehicle for added gaming fun.<br/> <br/>For more information please visit our website: www.pocketscientists.com", "metacritic": null, "released": "2014-04-04", "tba": false, "updated": "2019-08-26T04:20:53", "background_image": "https://media.rawg.io/media/screenshots/2e4/2e4b87a7178a4d442f9d22329a134dd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Scientists"], "genres": ["Racing", "Casual"], "publishers": ["Pocket Scientists Korlatolt Felelossegu Tarsasag"], "esrb_rating": "Everyone 10+"}