{"id": 368380, "slug": "cars-on-the-move-the-kid-game-fun-cartoonish-drivi", "name": "Cars on the Move: The Kid Game - Fun Cartoonish Driving Action for Family with Cute Graphics", "name_original": "Cars on the Move: The Kid Game - Fun Cartoonish Driving Action for Family with Cute Graphics", "description": "What they are? So fast, as the Lightning, they can be heroes of a movie, and they look like coming from a cartoon? Good question... They are the Cars on the Move, some everyday “movie heroes traveling on the roads driving endless miles. Why they are cartoon-like? Easy - they are living. Not just regular cars, but living ones, with lightning reflexes, cartoonish cuteness, movie-star attitudes. Those Cars on the move want to be your heroes, your companions on a lightning fast travel, a movie like adventure in a cartoon world. They are waiting for you, the experienced and very talented driver, even they lightning reflexes aren't enough to guide them properly on their movie like settings. And being cute - you'll like to look at them!<br/><br/>The game uses different interesting control methods, that can be switched in the Settings. <br/><br/>Features<br/>- Unique driving experience with alternate controls. Controls are switchable.<br/>- Special challenges, as High Traffic, Crossroads, Moving Machinery, Roaming animals....<br/>- You can level up in 5 different areas to earn extra profits and proof your driving skills<br/>- Beautifully crafted cartoon environment<br/>- Different cars to try out with unique Settings for better driving experience<br/>- Customizable gameplay with numerous upgrades<br/>- Lots of different power-ups", "metacritic": null, "released": "2014-08-02", "tba": false, "updated": "2019-08-26T04:29:52", "background_image": "https://media.rawg.io/media/screenshots/70c/70cb291e2d52271af07c96de1b406af6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Scientists"], "genres": ["Adventure", "Racing"], "publishers": ["Pocket Scientists Korlatolt Felelossegu Tarsasag"], "esrb_rating": "Everyone 10+"}