{"id": 368507, "slug": "tone-tomb", "name": "TONE TOMB", "name_original": "TONE TOMB", "description": "<em>Controls</em>\n<p><strong>D-PAD MOVEMENT</strong>: Arrow Keys</p>\n<p><strong>JUMP</strong>: Space</p>\n<p><strong>DASH/SWORD</strong>: Shift</p>\n<p><strong>START</strong>: Enter</p>\n<p>\n</p>\n<em>Summary</em>\n<p>In this platformer, you control a mysterious character trapped for eternity within the TONE TOMB. Ghostly lost souls persist to attack our protagonist from both the land and the air! Luckily, our protagonist can utilise the revolutionary new power of \"tones\" to change how they interact with enemies!</p>\n<p>Every time an enemy is eliminated, the colour palette of the whole game shifts between BLUE -&gt; PINK -&gt; GREEN! A different colour tone means you have different actions available to take out those ghosts!</p>\n<p>When the world is BLUE you can double-jump, and must jump on an enemy head to continue your combo and wrack up a good score for bragging rights!</p>\n<p>When the world is PINK, you can dash in all directions, and dashing into an enemy will kill them.</p>\n<p>When the world is GREEN, you can fire out an (oversized) shuriken to take out enemies on the ground or in the skies of the TONE TOMB!</p>\n<p>Be quick to keep your combo and scores high, but also be careful - our character is quite fragile and will perish for eternity<em> <strong>x2 </strong></em>if they take a few hits! After a short while, the TONE TOMB may take pity and drop a health pickup.</p>\n<p>It's time - go forth! Reach high numbers or die valiantly trying! <em>I believe in you!</em></p>", "metacritic": null, "released": "2019-08-25", "tba": false, "updated": "2019-08-28T23:14:25", "background_image": "https://media.rawg.io/media/screenshots/620/62058f697a3ee3449505d4502e834307.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harry", "Louis"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}