{"id": 368672, "slug": "that-satyr-game", "name": "that satyr game", "name_original": "that satyr game", "description": "that satyr game\r\nControls\r\n<p>WASD or Arrow Keys to control menus and move your character.</p>\n<p>E or Enter to select menu items, talk to NPCs, use items, and use doors.</p>\n<p>Escape to open the in-game menu.</p>\n<p>Certain abilities require specific uses of your powers. Talk to NPCs to learn more when you pick up your new abilities.</p>\n<ul><li>W/Up is used for all Jumping related abilities.</li><li>S/Down is used to activate/deactivate Flame (Crawl).</li><li>Faithwalk is broken by S/Down or Jumping.</li><li>Wall Climb is activated by holding W/Up.</li><li>Teleport is activated by holding Shift and using WASD or Arrow Keys.</li></ul>\r\nGameplay\r\nGenre\r\n<p><strong>that satyr game </strong>is a handcrafted metroidvania-lite collectathon precision platformer.</p>\n<p>It may <em>arguably </em>be a rage-game as well. Most players consider the platforming challenges to be very difficult, particularly among the optional side levels.</p>\r\nAbilities\r\n<p>The game revolves around your accumulation of 8 unique abilities over the course of the game. <strong>Mild Spoilers: </strong>These abilities are:</p>\n<ol><li>Jump</li><li>Double Jump</li><li>Flame (Crawl)</li><li>Triple Jump</li><li>Faithwalk</li><li>Wall Climb</li><li>Teleport</li><li>Elevation</li></ol>\n<p>These abilities vastly change the experience of the game, making your satyr character incredibly more powerful and versatile with each addition, fundamentally changing the nature of the platforming challenges.</p>\n<p>Each of these abilities are fairly unique to the genre, with even the basic jumping having a twist unlike most other platformers that changes how the platforming is performed. Abilities like Faithwalk and Elevation I've personally never seen in any other game, and I'm quite proud of how the game mechanically evolves over the course of a playthrough.</p>\r\nLevels\r\n<p>There are 15 main levels and 15 optional side levels per main level, each of which contain 15 collectible souls for 450 optional collectible souls total. There is one final level (for 31 total) without any souls. These levels vary wildly in size, scope, and scale up in difficulty.</p>\r\nPlaytime Length\r\n<p>The best known speedrun time for the main game is roughly 1 hour. The best known speedrun time to 100% the game (collecting every soul in every level) is roughly 4 hours. Depending on how much of the game you'd like to see and your platforming skill, your playtime may fall somewhere between or above these time lengths.</p>Saving<p>Unfortunately, <strong>your progress</strong> <strong>is not saved </strong>between sessions. Once you close the game application, the game is reset. I apologize for this; based on how the engine was built and the game was designed, this was too difficult to do anywhere effectively enough when I was developing this game in high school. Your progress is maintained for as long as the application is open, however. If you return to the menu and look at the credits, etc., your progress is maintained just fine, but as soon as you close the game your progress will be lost. This rather sucks due to the difficulty/length of the game, but hey, if you consider it a rage game, then it's a feature, right?</p>\r\nDevelopment History\r\n<p>This game started out as a tech demo wherein I developed my first-ever handmade game engine. This game engine (dubbed the Mut Engine) was optimized for a 2D platformer such as this, though other types of games (such as 2D shooters or puzzle-games) could also be developed in it. The Mut Engine was developed in Java, when I was about 16 years old in high school. I made the game engine originally in just about two weeks. I read in PNG image files to create the levels, reading the RGB values of each pixel to build out the level objects. I used Paint.NET as my level editor, which was incredibly fun and fast to iterate.</p>\n<p>I ended up having so much fun simply making levels for this tech demo engine, that I unintentionally winded up developing and refining levels for this game for almost two years, though with several months-long breaks from the project therein. The final game had evolved quite drastically from my earliest incarnations, and I felt my level design skill improved immensely over the course of the project. To date this is my longest non-procedural game, with multiple hours of playtime depending on how much of the game you want to see and your platforming skill.</p>\r\nIncomplete Art\r\n<p>This game is feature and content-complete, however I stopped working on it halfway through the final art pass. The game is fully playable with no known bugs, however further into the game you will start to see the level environment art decline, and false walls simply appear as white boxes. Throughout 99% of development, the game's level terrain all appeared as those white boxes! Applying the actual art to the levels was boring and time-consuming, even in my efforts to automate the process by writing my own custom Paint.NET plugins, so I simply got too bored and wanted to move on.</p>\n<p>The final level also is missing some art of a giant bowl of dip that would change to reflect how many souls you collected. I really wanted to move on from this project.</p>Assets<p>I am not a very good artist, and I wasn't as into music creation then as I am now. The music and most art assets are all public domain/creative commons assets, fully credited in the game credits. The sound effects (and shitty NPC dialogue sounds) I made myself, along with some art.</p><p>I've included a downloadable art asset pack as well as a level pack which contains the PNG image files the game's levels are built from!</p>", "metacritic": null, "released": "2019-08-24", "tba": false, "updated": "2019-08-28T23:14:24", "background_image": "https://media.rawg.io/media/screenshots/053/05312ba0a92598d803e26a4be1d858d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gunnar Clovis"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}