{"id": 368716, "slug": "kitty-friends-blast-of-fun", "name": "Kitty & Friends: blast of fun", "name_original": "Kitty & Friends: blast of fun", "description": "<p>WELCOME TO THE WORLD OF CARTOON ADVENTURE AND HEAD TOY BLASTING FUN! <br/><br/>Kitty &amp; Friends is match 2 game. Blast toon cubes and ton of toys. <br/><br/>Dive into the toon world with our characters Kitty the Leader, Panda the Chef and Doggy the Athlete and many more! Help our characters in learning and discovering new things, by completing different addictive levels in each story! Blast toon cubes, create bonuses, blast all toys in the whole place!<br/><br/>So, don’t you hesitate and join the adventure and discover new toon things, meet new characters, discover new power-ups and have TOY BLASTING FUN!<br/><br/>Features:<br/>⁃ Complete the match-2 levels and unlock new boosters<br/>⁃ In each story discover new toon objects and blast them!<br/>⁃ Create your team and match with players all over the world!<br/>⁃ Choose your character that you want to play with!<br/>⁃ Share with your friends, give them lives for playing!<br/>⁃ The game is free and easy-peasy to play, but the more you complete the more challenging it gets and more toys you need to blast!<br/>⁃ Free daily spins and chests are waiting for you with stunning rewards!<br/>⁃ The game is totally free to play without any ads!<br/><br/>Kitty &amp; Friends invite you to to help them to blast all toys you can in addictive match 2 game.</p>", "metacritic": null, "released": "2019-08-24", "tba": false, "updated": "2019-08-26T05:53:25", "background_image": "https://media.rawg.io/media/screenshots/721/721d8b2c7bfddd5b0d6053bcfa499477.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XI-ART"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}