{"id": 368887, "slug": "dronn-english-version", "name": "DRONN (English version)", "name_original": "DRONN (English version)", "description": "<p><strong><em>--- ¿HABLAS ESPAÑOL? ¡JUEGA DRONN EN ESPAÑOL! ---</em></strong></p>\n<p><strong>What is DRONN?</strong></p>\n<p><em><strong>DRONN</strong></em> is my first project in <strong>Bitsy</strong>; a short story about a lone, dutyful repair drone.</p>\n<p>You are <strong>DRONN Unit 26</strong>, the last remaining functioning repair drone in the <strong>S.S. PIONEER</strong>. You have awakened after having being offline for 50 years. As the <strong>AI Core</strong> explains, a sudden jolt of electricity turned the main emergency systems back on... And now there are <strong>biological signals</strong> coming from within the ship.</p>\n<p>It's up to you to go and explore the place, detect what these signals are, and find out what happened to the crew of the <strong>S.S. PIONEER</strong>. Interact with humans, learn about their own <strong>stories</strong> of the past fifty years, complain about your <strong>limited technology</strong>, and, since you're at it, try to solve a little <strong>issue</strong> that's been bothering the crew for a while now.</p>\n\n<p><strong>-o-</strong></p>\n<p><strong>Why Bitsy?</strong></p>\n<p>My original idea for <strong>DRONN</strong> was well beyond my reach. I have nor the time or skill to achieve what I had originally planned. <strong>Bitsy</strong> is a charming little game creator that focuses mainly on narrative, and on that front I thought I could tell <strong>DRONN</strong>'s story well enough. I began tinkering with it and I liked how it was shaping up, so I went ahead and wrote the whole thing.</p>\n<p>I'm quite content with the end result. This was also a great practice for storytelling in compact bursts.</p>\n<p><strong>-o-</strong></p>\n<p><strong>This was neat! Where can I support you?</strong></p>\n<p>You can check <em><strong>my Patreon</strong></em>. I'm currently drawing <strong>a weekly webcomic</strong>, but every now and then I come up with <strong>little surprises</strong> and <strong>extra content</strong>, like this little game here. All my work is <strong>free</strong> for everyone, but <em><strong>my Patrons get to enjoy them earlier than anyone else.</strong></em></p>\n<p>And of course, there's always the handy <strong>Donation button</strong> on this very page. ;-)</p>\n<p><strong>-o-</strong></p>\n<p><strong>Anything else?</strong></p>\n<p><em>Drop me a comment!</em> What did you think of the game? The story? The characters? Comments, critics, opinions and suggestions, they all help me improve!</p>\n<p>Okay, that's all. <em>Thanks for reading up to this point!</em></p>", "metacritic": null, "released": "2019-08-23", "tba": false, "updated": "2019-08-26T06:32:22", "background_image": "https://media.rawg.io/media/screenshots/fce/fce06f87773f803db93549eef55564d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Megawacky Max"], "genres": [], "publishers": [], "esrb_rating": null}