{"id": 368893, "slug": "dronn-version-en-espanol", "name": "DRONN (Versión en Español)", "name_original": "DRONN (Versión en Español)", "description": "<p><em><strong>--- DO YOU SPEAK ENGLISH? PLAY DRONN IN ENGLISH! ---</strong></em></p><p><em><strong>¿Qué es DRONN?</strong></em></p>\n<p><strong>DRONN</strong> es mi primer proyecto en <strong>Bitsy</strong>; una breve historia acerca de un responsable y solitario drone de reparación.</p>\n<p>Eres la <strong>Unidad DRONN 26</strong>, el último drone de reparación en funcionamiento de la <strong>S.S.PIONEER</strong>. Has sido reactivado luego de haber estado offline por 50 años. Tal como lo explica el <strong>Núcleo AI</strong>, una súbita descarga eléctrica activó los sistemas de emergencia... Y ahora hay <strong>señales biológicas</strong> proviniendo desde el interior de la nave.</p>\n<p>Depende de ti ir a explorar el lugar, descubrir qué son esas señales y averiguar qué le ocurrió a la tripulación del <strong>S.S.PIONEER</strong>. Interactúa con humanos, conoce sus <strong>historias</strong> vividas en los últimos cincuenta años, quéjate de tu <strong>tecnología limitada</strong> y, ya que estás, trata de resolver un pequeño <strong>problema</strong> que ha estado incordiando a la tripulación desde hace un tiempo.</p>\n\n<p><strong>-o-</strong></p>\n<p><strong>¿Por qué Bitsy?</strong></p>\n<p>Mi idea original para <strong>DRONN</strong> iba más allá de mis capacidades. No tengo ni el tiempo ni la habilidad para alcanzar el objetivo originalmente planeado. <strong>Bitsy</strong> es un pequeño y adorable programa enfocado en la creación de juegos narrativos, y por ese lado pensé que podría contar la historia de <strong>DRONN</strong> muy bien. Comencé a trastear con el programa y me gustó cómo estaba quedando, así que seguí adelante y escribí toda la historia.</p>\n<p>Estoy bastante contento con el resultado. Esta fue una gran oportunidad para practicar la narración de historias en pequeñas instancias.</p>\n<p><strong>-o-</strong></p>\n<p><strong>¡Esto es genial! ¿Puedo apoyarte de alguna forma?</strong></p>\n<p>Puedes ver <em><strong>mi Patreon</strong></em>. Actualmente estoy dibujando un webcomic semanal, pero de vez en cuando salgo con alguna sorpresita y contenido extra, como este juego que ven aquí. Todo mi trabajo es gratuito para todos, pero mis Patrons pueden disfrutar de mis creaciones antes que los demás.</p>\n<p>Y claro, siempre está el práctico <strong>botón de Donaciones</strong> en esta misma página. ;-)</p>\n<p><strong>-o-</strong></p>\n<p><strong>¿Algo más?</strong></p>\n<p><em>¡Dejame un comentario!</em> ¿Qué te pareció el juego? ¿La historia? ¿Los personajes? Los comentarios, críticas, opiniones y sugerencias me ayudan a mejorar.</p>\n<p>Bueno, eso es todo. <em>¡Gracias por leer hasta aquí!</em></p>", "metacritic": null, "released": "2019-08-23", "tba": false, "updated": "2019-08-26T06:33:53", "background_image": "https://media.rawg.io/media/screenshots/fb9/fb925f88c20cff7376bcc5928034121c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Megawacky Max"], "genres": [], "publishers": [], "esrb_rating": null}