{"id": 368920, "slug": "brooke-vs-world-doom", "name": "Brooke Vs. World Doom (itch)", "name_original": "Brooke Vs. World Doom (itch)", "description": "A Hysterical Adventure<p>Brooke Atomica, consumer of delicious pizza and ass kicking enthusiast, must stop an evil corporation from wiping out the beautiful cities of her world. She must platform and fight her way through the land, and hunt down the evil corporation before they destroy everything. With inspiration from Mega Man X and Contra thrown into a blender, this action platformer balances it's absurdity with level design that challenges players more over time with just the right amount of insanity.<br/></p>\r\nExplosive Gameplay\r\n<p>Put your platforming abilities to the ultimate test in jaw dropping, body shaking action. Enemies of all sorts won't dare to surrender, but Brooke won't give up without a fight. Blast away baddies, reign destruction in enemy territory, and rip through pesky monsters like nothing with astoundingly powerful weapons. Each stage has tons of environmental mechanics that Brooke can use to aid in her destruction of evil<strong>. </strong>Keep your eyes out for cool stuff; explore levels for powerful pickups and bonus weapons.<br/></p>\r\nThe Epic Story\r\n<p>Brooke goes head-to-head against an  evil corporation. Their CEO, Miss Alison, suggests that the destruction of the world will allow for a Modern Renaissance, an entire world rebuild that guarantees the safety of everyone in the land, but her good intentions for a peaceful world are ruined by her immoral planning. Alison believes everything can be maintained, controlled, and perfected with the right people and the right amount of money, but Brooke believes that the chaos that rampages around the land, and the imperfections that the people face are what makes it so beautiful in the first place.<br/></p>", "metacritic": null, "released": "2019-08-23", "tba": false, "updated": "2019-08-26T06:39:42", "background_image": "https://media.rawg.io/media/screenshots/1a6/1a64b249fdb663da808aed061220eb2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SlyBalto"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}