{"id": 368926, "slug": "b-dodge", "name": "B-Dodge", "name_original": "B-Dodge", "description": "<p>A music platform video game where you will have to go through several obstacles until you reach the end of the level, you move around the stage \"tapping\" on the screen to move, there will be portals, scores, obstacles that can hold you back, there are only 2 ways to lose and are:<br/>1.<strong> Die through a red obstacle </strong>that will be present at all levels.<br/>2. <strong>Time spent,</strong> each level will have a set time, if that time reaches 0 it will be an immediate death.</p>\n<p>Another challenge that the game can give is the scoring system, <em>for each level you finish it will give you a rating (D, C, B, A, S)</em>, all that depends on how many touches and time you have traveled in the level, the less touches you do and as little time as possible you have finished, better qualification will be awarded and more gems you will get.</p>\n<p><strong>The gems will allow you to buy in the store</strong>, such as improvements in <em>speed, shield and size</em>, in the future you can buy aesthetic changes of the character (a ball)<br/>and buy shield that is a protection from not dying with a simple hit on the obstacle.</p>\n<p>The game still has few levels and simple, is especially dedicated for all types of audiences with a slow and progressive learning curve, from here in some updates more dynamic and more difficult levels will be added, as well as new modes.<br/><br/><strong>Available multi-languajes! : [ES] , [EN] , [PR] , [CN]</strong><br/></p>", "metacritic": null, "released": "2019-08-23", "tba": false, "updated": "2019-08-26T06:41:06", "background_image": "https://media.rawg.io/media/screenshots/3c9/3c954eaa7eb63b4e139d0ab74ccc7cfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Redem Creations"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}