{"id": 369161, "slug": "frostpunk-season-pass", "name": "Frostpunk: Season Pass", "name_original": "Frostpunk: Season Pass", "description": "Purchase the Season Pass and set off on even more expeditions into Frostpunk’s frozen world. With this pass, you’ll be granted access to all upcoming game content in this season, including immediate access to THE RIFTS and two major expansions coming in 2019 and 2020.\n<br/><br/>\nFrostpunk: Digital Artbook\nBehind Frostpunk's distinctive style there is a history of people working on the visual design, concept art and inspirations. That was a long road and it took solid part of their lives to ultimately create the grim, dirty, cold style of Frostpunk. \"New London. The art of Frostpunk\" is a book documenting this process. Learn how the citizens of New London were designed, how the architecture was created, how the hole of an ice crater was filled with man-made structures that in the end build up the city of New London.\nMoreover, you'll learn the perspective of the team of artists at 11 bit as they share their insights on not only designing the in-game elements, but also the entire visual side of the game, including the well-recognizable logo.\n\nFrostpunk: The Last Autumn\nThe Last Autumn vastly expands Frostpunk's universe by introducing brand new scenario along with game-changing mechanics and unique architecture, while broadening the game’s lore and narrative.\n\nFrostpunk: Project TVADGYCGJR\nThe scouts of New London are currently in search of the intel about the forthcoming expansion. Their safe return with the new information is expected at the launch of THE LAST AUTUMN. Stay vigilant, citizens and maintain your hope as the winter continues!", "metacritic": null, "released": "2019-08-26", "tba": false, "updated": "2023-04-30T01:57:08", "background_image": "https://media.rawg.io/media/screenshots/a69/a697514b4b6d4445187ffb6e851ecdcb.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 4, "beaten": 2, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["11 Bit Studios"], "genres": [], "publishers": ["11 bit studios"], "esrb_rating": null}