{"id": 369264, "slug": "ultimate-moto-rr-2", "name": "Ultimate Moto RR 2", "name_original": "Ultimate Moto RR 2", "description": "\"Ultimate Moto RR 2\" is the Best of Real Racing Moto Game!<br/>Pilot your own Racing Moto on not less than 20 tracks around the world!<br/><br/>Enhance your experience on each track and increase your global XP!<br/><br/>Challenge the best drivers and try to win to increase your money!<br/>A \"Shop\" is available on the main menu.<br/>If you have enough money, you could get more powerful Racing Moto!<br/><br/>Don't forget your helmet and take control of your Racing Moto!<br/>You have mastered acceleration, braking and steering!<br/>Incredible speed and steering sensations await you!<br/>But, never forget that: \"Without control, Power is Nothing!\"<br/><br/>Attention! The tracks are more and more  technical and require an optimal concentration!<br/>If your are new, I suggest you to start with the initiation track to learn to control your Racing Moto.<br/>It's available on the main menu by clicking on the \"Help\" button.<br/>Follow the instructions and you will be ready to have fantastic sensations!<br/><br/>After that, try to get the Gold Cup of the ULTIMATE track!<br/><br/>You can select the level of difficulty: Beginner, Expert or Pilot.<br/>Your choice is very important:<br/>If you choose \"Pilot\", all races will be more difficult but you will win more money!<br/>If your are in the top 3, you will win a special Bonus!<br/><br/>You also can choose the \"Fight\" Level and Try to be the Best!<br/>In this level, there is no Limit.<br/>Only one rule: IT MUST REMAIN ONE!<br/><br/>Are you ready to challenge the best drivers of Real Racing Moto game?<br/><br/>The time of each race is recorded.<br/>Share your score online and try to stay in the world ranking!<br/>So you can compete with players around the World!<br/>You can see the rankings at any time by clicking on the logo \"World High Scores\".<br/><br/>Have Fun!<br/><br/>••• Game Features •••<br/><br/>• Pilot your own Racing Moto<br/>• Total Control of your Racing Moto<br/>• Full 3D Real Time rendering<br/>• 20 different tracks<br/>• Incredible arcade physics<br/>• Spectacular SFX<br/>• Save as much money and Power go up<br/>• Customize your Racing Moto<br/>• Training mode<br/>• Realistic sound environment<br/>• Music by \"REVENGE\"<br/>• Nitro Bonus<br/>• Select the difficulty level<br/>• Select the accelerometer sensibility<br/>• Select the Camera: Inside or Outside<br/>• Upload your Score and enter in the World Ranking", "metacritic": null, "released": "2014-08-05", "tba": false, "updated": "2019-08-30T02:46:50", "background_image": "https://media.rawg.io/media/screenshots/a80/a8038f69cd8a6bf91888e45899cb2c03.jpg", "website": "http://www.dream-up.eu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dream-Up"], "genres": ["Sports", "Racing"], "publishers": ["Dream-Up"], "esrb_rating": "Everyone 10+"}