{"id": 369308, "slug": "zombie-raft-3d", "name": "Zombie Raft 3D", "name_original": "Zombie Raft 3D", "description": "Meet the new our blocky-style survival game!<br/><br/>Under mysterious circumstances, you were on a raft in the ocean. There is only water around. You can only rely on yourself!<br/><br/>If you look into the horizon - you will see the islands. They can be rich in natural resources such as wood or ores. Explore the island to find hidden objects and riddles there.<br/><br/>On the surface of the ocean floats many objects thrown from the ships. But you have a hook! You can pick up these items with this hook. Throw a hook on the object and pull to itself. That way you can build your raft. Not only boards and grass pass by, but also barrels and crates with the resources necessary for survival.<br/><br/>Watch for the indicators \"Health\", \"Satiety\" and \"Water\". Keep the level of food and water in the body at the proper level and you will be able to stay alive. Get food from the boxes. Create fishing rods and fish as much as you can. You can do farming by creating a garden. Plant banana seeds and wait for the crop when the tree grows. To replenish water - collect water bottles, or build a watermaker.<br/><br/>Do not be afraid to dive into the water! Explore the water world and the islands nearby.<br/><br/>Build additional items on a raft. Crafty bed, so you can sleep and save the process of the game, as well as skip the night. Use fires for warming and lighting the area. Kirk and an ax will help you get resources. You can make your raft as big as you want! Add wooden platforms, build walls and roof.<br/><br/>Be careful at night! At night, the real survival begins. Zombies wake up and they will try to attack you. Fight off with tools or weapons. Zombies appear only at night, therefore build a bed to let the dark night through.<br/><br/>Zombie Raft 3D - game features:<br/>- survival in the ocean on a blocky raft<br/>- night and day change<br/>- dangerous and interesting adventures<br/>- various weather conditions<br/>- simple player control and craft system<br/>- nice graphics<br/><br/>Start your trip in the ocean on a raft right now! Swim as much as possible to escape in Zombie Raft 3D.", "metacritic": null, "released": "2019-02-24", "tba": false, "updated": "2019-08-30T03:08:11", "background_image": "https://media.rawg.io/media/screenshots/157/157728ace73837928b1c44b1a935d542_oH7Mbsn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nataliia Sukhova"], "genres": ["Adventure", "Simulation"], "publishers": ["Nataliia Sukhova"], "esrb_rating": "Teen"}