{"id": 369424, "slug": "breakout-in-space", "name": "Breakout, in space", "name_original": "Breakout, in space", "description": "<p>It's breakout, but in space.<br/></p>\n<p>I made this in only a few hours as a last minute entry into a game jam that I'm supposed to be hosting and probably should have been more organised for.</p>\n<p>Unlike some of my other games, you won't find anything particularly weird or interesting. I'm not trying to make a statement here. Go play One Way Out if you want that.</p>\n<p>And I realise that by saying this game has no interesting surprises I'm making it seem like the game does in fact have some kind of surprise. Maybe level 2? I don't know. The novelty is supposed to be that you're a space ship. pew pew pew.<br/></p>\n<p>If you've read this far and you still expect some kind of surprise, I don't know what to tell you. There really isn't much to this game. It won't play with your expectations. There's no audio. The collisions are buggy. What do you want from me?</p>\n<p>Maybe just enjoy the dumb game. Try to find a way to beat level 2? There's no content hidden after level 2, I promise.<br/></p>\n<p>Ah damn, now it sounds like there IS content after level 2. Trust me there isn't. I can't even beat level 2 since I added lives to the game. I know it's technically possible, but it's supposed to be the kind of game you look at for 5 seconds, chuckle at the novelty aspect, then move on.</p>\n<p>This game won't make you cry.</p>\n<p>In fact, that guy who made an account called \"camsgamesucks\" just to leave humorous negative comments on my other games - this is the perfect game for you. It has practically nothing going for it. The first level has literally one block. It just seemed funny at the time to only have 1 block. And 9 times out of ten your first several shots will all miss it. There's no skill whatsoever.</p>\n<p>Maybe one day in the future I'll come back and polish this up. Add upgrades, and music. Turn it into a little hour-long adventure where a rocket man must reunite with his love, or save the world from the evil coloured blocks, or something to that extent.</p>\n<p>But I know I won't do that. The game's going to stay, more or less, exactly as it is right now. Maybe I'll add a web version if I can be bothered, but I'm definitely not putting in any secrets.</p>\n<p>You know what, this game would actually make for a good secret if the game itself was hidden away within another game. Some Frog Fractions style game-within-a-game kind of joke. I don't know though, even that sounds like a lot of effort.</p>\n<p>Anyway, I'm going to start working on another game soon. Hopefully it'll be better. Hopefully it won't be a joke game. It'll probably be a joke game.</p>\n<p>Why are you reading this still? I'm just writing this while I procrastinate instead of testing my game actually works. If the game doesn't work, now you know why.</p>\n<p>I don't even mention the controls anywhere. Space is to shoot. I added a dumb message saying you have infinite ammo because if I played this game I'd probably only press spacebar once. Spamming bullets is probably the funnest thing about this game. Well, it's the only thing you can do in this game.</p>\n<p>There's more content in this description than the game. Why can't I charge people to read this text? I guess that's what authors do. Lousy authors can't even program a game so all they do is write words. Well, that makes two of us.</p>\n<p>Do you ever wonder if some day in the future there'll be archives of everything on the internet? And future-people will actually be able to read and process all of it, somehow. This game description could be read by some advanced human in the year 2500. I wonder what the world would be like that far in the future?</p>\n<p>Hey! Future dude! Since you have such great tech, could you like dig up my corpse, or reassemble my consciousness, or something? Wake me up in the future so I can see how cool the world is. If you do that, I'll even finish this game for you!</p>\n<p>Well it was worth a try.</p>\n<p>Anyone, by now, you should have finished playing my game. How was it? Leave a comment or something. Give me money? One day I'd like to make games for a living. I don't know how it could be practically possible to do so, but I can dream. Thanks for reading.</p>", "metacritic": null, "released": "2019-08-29", "tba": false, "updated": "2019-08-30T03:38:09", "background_image": "https://media.rawg.io/media/screenshots/fe3/fe32c34ba150cd594efeb31b04c3d13e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["amerond"], "genres": [], "publishers": [], "esrb_rating": null}