{"id": 36941, "slug": "caesar-4", "name": "Caesar 4", "name_original": "Caesar 4", "description": "Hail Caesar! Starting as governor of a newly formed province in the Roman Empire your goal is simple: advance up the empire's political ladder to become the next Caesar. As governor, you will have total control over your province: including city planning, finances, and defenses. As you succeed you will be given new challenges in other provinces within the Roman Empire ultimately ending in the heart of the empire: Rome.<br/><strong>Caesar™ IV</strong> represents the culmination of more than a decade of development experience in the city builder genre making it the definitive ancient city builder. Plebs need not apply.<br/><br/><ul><li>Build Your Rome: Build your city in any imaginable combination. Bask in the awe-inspiring glory of more than 100 unique structures.<br/></li><li>Expanded Economic Control: With over 30 tradable goods, 10 industries, 4 markets and foreign trade routes the economic possibilities are vast.<br/></li><li>Leading Edge Graphics: High dynamic range lighting, specular &amp; bump mapping along with realistic weather effects and a complete day / night cycle bring Rome to life in never before seen detail.<br/></li><li>Experience Life in Ancient Rome: Interact with more than 75 unique characters within your city.<br/></li><li>Improved Combat Functionality: Take direct control over your legions, who gain experience through combat and training, as you ward off barbaric invasions.<br/></li><li>Over 100 Hours of Gameplay: Including career mode, standalone competitive scenarios, and sandbox mode.</li></ul>", "metacritic": 74, "released": "2006-09-08", "tba": false, "updated": "2023-01-11T05:32:58", "background_image": "https://media.rawg.io/media/screenshots/99a/99aa7b5d2e7b814166172562f7bbef8e.jpg", "website": "http://www.caesariv.com", "rating": 3.48, "rating_top": 4, "added_by_status": {"yet": 22, "owned": 330, "beaten": 12, "toplay": 8, "dropped": 18, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 21, "suggestions_count": 832, "game_series_count": 3, "reviews_count": 21, "platforms": ["PC"], "developers": ["Tilted Mill Entertainment"], "genres": ["Strategy", "Simulation"], "publishers": ["Activision Blizzard", "Vivendi Games"], "esrb_rating": null}