{"id": 369682, "slug": "modular-procedural-scaffold-system-demo", "name": "Modular Procedural Scaffold System Demo", "name_original": "Modular Procedural Scaffold System Demo", "description": "<p>In this demo you can visit the three example maps for Modular Procedural Scaffold System UE4 asset pack available on Unreal Marketplace.</p>\n<p><strong>Unreal Marketplace : </strong>Modular Procedural Scaffold System</p>\n<p>This pack allows to build a full construction site environment. Its main feature is the scaffolding system, inspired from the real Ringlock type scaffolding, but  it offers also a lot of other assets for a construction site, such as containers , various modular fences and gates, various curtains, barriers, skips, a tarpaulin for the skips, a billboard, corner security guards, various security signs (configurable via blueprint with 2 different sizes and various texts written in English and Japanese), Japanese style traffic cones, a plastic board, a security LED lamp (configurable via blueprint with 3 different colors depending of its role and location), various cables and pipes (configurable via spline blueprint) and a helmet.<br/>There are also all the assets needed for assembling a road using the same spline blueprint as the cables, they are used in the demo level to show the scaffold for repairing a bridge.</p>\n<p>All the assets of this demo with the exception of sounds and music are available in the pack. </p>\n<p>Follow our twitter (@games_inu) or our website (inu-games.com) for new info about the project!\r\n</p>\n<p>Music by Sei Mutsuki,  http://peritune.com/, Creative Commons Attribution 3.0 International License.</p>", "metacritic": null, "released": "2019-08-27", "tba": false, "updated": "2019-08-30T04:41:50", "background_image": "https://media.rawg.io/media/screenshots/346/3469acd2144454285080ff3daf475e8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Inu Games"], "genres": [], "publishers": [], "esrb_rating": null}