{"id": 369784, "slug": "dither-itch", "name": "Dither (itch)", "name_original": "Dither (itch)", "description": "<p>You find yourself in a pitch black cavern. The putrid darkness withers away at your life. The only thing keeping you alive is a lantern and a strange mine cart, both require fuel. In order to survive, you need to gather lost fuel cells to keep the light alive.</p>\n\n<p>Controls:</p>\n<p>WASD - movement.</p>\n<p>Mouse - look.</p>\n<p>Left click - interact.</p>\n<p>Right click - ignite lantern.</p>\n<p>Alt + F4 - close the game.</p>\n\n<p>Instructions:</p>\n\n<p>🔉Sound🔊</p>\n<p>This game heavily depends on sound to relay information and for gameplay.</p>\n\n<p>When you start the game you will be in the menu room, the door on the left exits the game the game. The door on the right starts the game.</p>\n\n<p>The cart will continuously move until it runs out of fuel, shown by the needle on the back of the cart, or finds a fueling station. The lantern and the cart use the same fuel, at a fueling station left clicking the terminal will transfer fuel from your lantern to the cart. A full lantern holds as much as a full cart. Left clicking on the cart will start it again.</p>\n\n<p>If you do not look for fuel cells you will not have enough fuel to fill the cart up. Fuel cells can be found on the main path rarely and more commonly in the side tunnels. They can be picked up by looking at them (center of screen) and left clicking. After picking a fuel cell up you should hear a sound and notice your fuel meter increase. Picking up a fuel cell when already at full fuel does not add to your fuel level.</p>", "metacritic": null, "released": "2019-08-27", "tba": false, "updated": "2019-08-30T05:07:26", "background_image": "https://media.rawg.io/media/screenshots/47b/47bab3a65f19140d5dda2cc5f6bbce25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alexzoin", "Camden Cecrle", "Falcondance"], "genres": [], "publishers": [], "esrb_rating": null}