{"id": 369757, "slug": "ghost-hunter-jorelsimpson", "name": "Ghost Hunter (JorelSimpson)", "name_original": "Ghost Hunter (JorelSimpson)", "description": "<p>Hey, you found my dumb little game! Way to go! Here's a little information about it before you play. </p>\n<p>I made this little game prototype for the \"Extra Credits Game Jam #5\". I had big plans for it, but it ended up falling short. I'm a novice programmer at best, and I don't have much experience with the craft. I plan to get better, but this is all I got for now. I didn't put as much time as I wanted into it either, so it isn't at its full potential. I did however write an awesome NES-inspired song for it though. My composing skills are much better than my programming skills. If you plan to play it (which I hope you do), just know that it's not that great and could do with some more work. Controls are next:</p>\n<p>Press Enter to start game, and press it again to restart game. </p>\n<p>Press Z to shoot.</p>\n<p>You can move and aim upwards with the Arrow Keys.</p>\n<p>Press the Spacebar to jump.</p>\n<p>Press the Escape Key to quit the game.</p>\n<p>If you can beat the big ghost at the end, you win! Have fun!</p>\n\n<p>Credits:</p>\n<p>Director: Jorel Simpson</p>\n<p>Hunter Sprite work: Bailey Day (author of The Amazing Imagination Machine)</p>\n<p>All other Sprite work: Jorel Simpson</p>\n<p>Music: Jorel Simpson</p>\n<p>Made in GameMaker Studio 2.</p>\n\n<p>I know that there is a lack of a health gauge, lack of more enemies, lack of exciting levels and graphics, and lack of fun in general. If you want to, tell me how else I could have made this game better. I'm always willing to learn more about game programming. Thanks for reading to the end. Go and hunt some ghosts!<br/></p>", "metacritic": null, "released": "2019-08-27", "tba": false, "updated": "2019-08-30T05:01:31", "background_image": "https://media.rawg.io/media/screenshots/747/7478fe96f0da00bbbff70c685a4be14a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["JorelSimpson"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}