{"id": 369858, "slug": "charlies-passage", "name": "Charlies Passage", "name_original": "Charlies Passage", "description": "<p><strong>Charlies Passage</strong><br/></p>\n<p>In this game you play as the two World War II pilots Charlie Brown and Franz Stigler. The game can be played alone or by two players. One plane is a small fighter who must protect the big damaged bomber and grant him safe passage out of Nazi Germany.  The bomber can only move slowly and must avoid getting hit, while the small fighter can shoot down enemy planes. However they must be careful not to hit the bomber, or get hit themselves, since both planes share the same health pool.<br/></p>\n\n<p><strong>Inspiration</strong></p>\n<p>This game thematizes the 'Charlie Brown and Franz Stigler incident' during World War II. It is one of the most fascinating stories of the war and I am hoping to get more people to know about it through this little game.</p>\n<p>I first heard about the story through the Song \"No Bullets Fly\" by the Swedish  Power Metal Band Sabaton. If you are interested to learn more about the story they also made a great video about it on their history channel which you can find here.</p>\n<p><strong>The Story</strong><br/></p>\n<p>On December 20th 1943, Lt. Charles 'Charlie' Brown flew his B-17 Bomber over the German town of Bremen. During the bomb run they are heavily damaged by German flak cannons. </p>\n<p>Franz Stigler is a pilot in the German Luftwaffe and he is sent to shoot down the bombers. But as he approaches Charlies plane he hesitates. He just can’t bring himself to shoot down the heavily damaged plane. Instead he flies next to it. Charlie can’t believe what he is seeing, but miraculously he is no longer targeted by the German cannons.</p>\n<p>Stigler stays with the american plane until they are safely outside of the German kill zone. He salutes and turns around back to the German mainland. Neither of them is able to talk about what happened for different reasons.</p>\n<p>The story could have gotten lost, but through a really lucky coincidence they had the chance to meet after 40 years. They remained close friends until the end.</p>\n<p><strong>Disclaimer</strong></p>\n<p>The amazing thing about the story is, that in fact nobody fired and Charlie Brown got safely out of the German kill zone. However the game would have been really boring if the enemies did not shoot at the players, so I took some liberties in that regard.</p>\n<p><strong>Credits<br/></strong></p>\n<p>A game by - @AndideBob</p>\n<p>Graphics - @ToastiChron</p>\n<p>Music by - Windfarms With Wifi<br/></p>", "metacritic": null, "released": "2019-08-26", "tba": false, "updated": "2019-08-30T05:24:27", "background_image": "https://media.rawg.io/media/screenshots/009/00919dfd4510f55b9320c51bccecac4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["andidebob"], "genres": ["Action", "Educational"], "publishers": [], "esrb_rating": null}