{"id": 369931, "slug": "your-love-journey-visual-novel-terbaru", "name": "Your Love Journey - Visual Novel Terbaru", "name_original": "Your Love Journey - Visual Novel Terbaru", "description": "<p>Memperkenalkan Visual Buatan Indonesia terbaru yaitu adalah Your Love Journey yang merupakan Novel Visual asli yang dibuat oleh Pengembang Indonesia. Visual novel yang tidak seperti biasanya. Game Your Love Journey juga akan menguji ketangguhan Anda dalam memilih pilihan yang tepat dan bisa dibilang pilihan bijak. Karena itu, gunakan sepanjang waktu untuk memikirkan pilihan yang akan Anda buat. Pilihan-pilihan itu juga akan menuntun Anda ke akhir yang benar atau salah. Jika salah, Anda harus memilih rute lain lagi. Jika benar, hubungan atau Anda dapat mengatakan hubungan Anda dengan orang lain akan meningkat. Di sini Anda juga dapat menemukan berbagai karakter yang akan menemui Anda dengan berbagai sifat. Cobalah jika seorang gadis, taklukkan hatinya! unik bukan ?? Apa yang kamu tunggu?? Silakan unduh langsung melalui Amazon App Store. Untuk informasi lebih lengkap tentang memperbarui, memperbaiki bug, atau melaporkan masalah dengan game ini.</p>\n<p> Silakan langsung mengunjungi situs web kami: https://nekonaza.blogspot.com/p/contact-us.html atau Anda dapat mengikuti langsung ke halaman Twitter pengembang, https://twitter.com/Johny_Lorenz atau melalui kolom pencarian di Twitter @Johny_Lorenz. Terima kasih!</p>\n<p>• BARU DARI NOVEL VISUAL \"YOUR LOVE JOURNEY!\":<br/>• ★★★★★ Game Visual Novel Terbaru (twitter: @Johny_Lorenz)<br/>• * Tambahan untuk Bab 1<br/>• * Fitur Luar Biasa<br/>• * Pilih cerita Anda dengan plot yang menarik<br/>• * Menambahkan penyertaan nama karakter utama dengan nama Anda!</p>\n<p>• *~Tunggu Juga Update terbaru lainnya!.....~</p>\n\n<p>NOTE: Untuk sekarang hanya tersedia di versi pc saja.<br/></p>", "metacritic": null, "released": "2019-08-26", "tba": false, "updated": "2019-08-30T05:40:00", "background_image": "https://media.rawg.io/media/screenshots/e14/e14273456827884a9b2f6f19f66a7da5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["NEKOXGAMES"], "genres": [], "publishers": [], "esrb_rating": null}