{"id": 370137, "slug": "feathery-ears-yu-er", "name": "Feathery Ears 羽耳", "name_original": "Feathery Ears 羽耳", "description": "A cute little project made by 2 people in 1 month.<br/>\n<br/>\r\nA retro styled 3D platformer that let's players come at challenges from whatever angle you want. Ashley Dengra is a 9nth grade artist with a sketchbook to doodle her \"Original Characters\" like Misa Ikko, the green-haired, feathery-eared fire sword girl with a great fluffy green tail. <br/>\n<br/>\r\nFeatures: <br/>\n<br/>\r\n -   Soothing Original Soundtrack made by talented the Naoya Sakamata<br/>\r\n -   Beautiful Art<br/>\r\n -   Free Form 3D Platforming Action<br/>\r\n -   Blade Wave Sword Combat<br/>\r\n -   A climb from an underground beach below the planets core all the way to the sky!<br/>\n<br/>\r\nMessage from the Developer:<br/>\n<br/>\r\nThis game repurposes a lot of assets from my previous work. I just wanted to see if I could do it, and I am really happy with the result. Thought I might also step out of my comfort zone and try to make something wacky for a change. It's not a deep game, but I hope it's fun. I actually tried to ignore my years in art school to come up with zany designs and level themes that I feel a 9nth grader would think is cool (or at least, travel down memory lane to the kinds of designs I thought were cool when I was a 9nth grader). For maximum enjoyment, please take it at face value, thanks!<br/>\r\nSayuri~<br/>\r\n---<br/>\r\nBig thank you to Naoya Sakamata for the Japanese Localization and OST!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T02:45:27", "background_image": "https://media.rawg.io/media/screenshots/743/743d41a010c5da1c0d3560ae7deeccce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Sayuri Artsy"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Eager Passion"], "esrb_rating": null}