{"id": 370180, "slug": "arsenal-demon", "name": "Arsenal Demon", "name_original": "Arsenal Demon", "description": "Take control of Arsenal Demon, a cybernetic war machine with a vengeance.  Take on an endless stream of mechanical 'Angels' in this fast paced survival arena shooter.  Choose from an arsenal of weapons in your armory and dual wield them while dashing, double jumping, wall-running and bunny hopping in this next level action game.  <br/><br/>Clamp Demonic Shackles onto yourself to increase the power of the ever-morphing arena in return for heavier payouts of score, and collect its scattered powerups to make up for the steadily growing difference in strength. Get strapped in the hotseat as you fill your critical meter through quick movements, to build up your potential for maximum destruction.<br/><br/>Fight progressively tougher foes and compete for the title of The Arsenal Demon against real people all over the world on the online leaderboards* in a brutal fight to survive... If you dare.<br/><br/>*Internet connection required for online leaderboard access.<br/><br/><strong>Features:</strong><br/><ul><li>8 Weapons (4 in demo), each can be dual wielded in different combinations.<br/></li><li>5 Power Ups ranging from Invincibility to Unlimited Crits.<br/></li><li>8 Enemy Types (Plus more powerful \"Exalted\" versions of each with improved stats and speed)<br/></li><li>A Classic mode where you can quickly jump into the fray.<br/></li><li>A Campaign mode called Demon Mode, where you start weak and frail and level up your Arsenal to unlock powerful abilities and stronger weapons.<br/></li><li>Shackles that increase the difficulty of the next run in many different ways, from denser fog to faster enemies.<br/></li><li>A worldwide Leaderboard system. Compete with people from around the world for that top score.<br/></li><li>Procedural generated arenas that generate random levels of verticality, no two runs are ever the same.<br/></li><li>Crits you can generate and store by moving FAST, then unleash more powerful shots.<br/></li><li>Double Jump, Wall Run, Bunny Hop, and Dash with advanced movement tech.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T03:12:33", "background_image": "https://media.rawg.io/media/screenshots/8bc/8bcf0a084ada09297933fbbf55b33063.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blast Programming"], "genres": ["Action", "Indie"], "publishers": ["Blast Programming"], "esrb_rating": null}