{"id": 370145, "slug": "warpzone-vs-the-dimension", "name": "WarpZone vs THE DIMENSION", "name_original": "WarpZone vs THE DIMENSION", "description": "With reverence to the glorious times of the acclaimed beat'em up genre, WarpZone vs. THE DIMENSION (WZvsTD) is comprised of a myriad of references to 90s games such as: Battletoads, Streets of Fury, Final Fight, Cadillacs &amp; Dinosaurs, TMNT: Turtles in Time, among others. Every punch and every fall refers to a celebration of the past in a revamped look. Grab your gamepad and let's lay some smack down!<br/><br/><br/><br/><br/>The controls are simple and very popular in the genre: attack, jump and special attack. Combine different button sequences for unique moves. Figure out how to do the secret and destructive SUPER ATTACK!<br/><br/><br/><br/><br/>You don't have to face this alone! Ask for the help of a friend in this local co-op game. Enjoy afternoons playing together and be careful not to hit each other and start a vendetta.<br/><br/><br/><br/><br/><br/><br/>No controller? No problem! WZvsTD has full controller support but you can also share the keyboard with a friend, like the good ol' days!<br/><br/><br/><br/><br/>Enjoy the variety of gameplay mechanics with the jetski stages amongst 7 stages of pure mayhem.<br/><br/><br/><br/><br/><br/><br/>Relish the classic game sensation with current celshaded graphics.<br/><br/><br/><br/><br/><br/>Help the Warpies save their friends from THE DIMENSION, an alien villain with evil intentions and a more evil plan.<br/><br/><br/><br/><br/><br/><br/>Warpy R. is the ultimate brawler from the 90's fighting games. Aggressive, practical and hot-headed, embraces responsability and aims to solve everything the quickest way possible.<br/><br/><br/><br/>Warpy G. is tired of hunting ducks on videogames. Cool, contemplative and centered, follows his older brother and have his back through every mess he gets himself into.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T02:51:59", "background_image": "https://media.rawg.io/media/screenshots/b3b/b3b63c14ad4b6140f8930a800f27bf5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PampaFox"], "genres": ["Action"], "publishers": ["PampaFox"], "esrb_rating": null}