{"id": 370189, "slug": "zhu-shen-gan-kun", "name": "诛神乾坤", "name_original": "诛神乾坤", "description": "\"Yu Shen Qian Kun\" is a blueprint based on Xiu Xian's novels. Combining the various elements of the novel, it outlines the world of aesthetics. The protagonist pedals the best flying swords, the gods are in the hands of the fairy, and carry the supreme magic weapon, the spirit pet fairy follow, proud of the tourists, spirits, fairy three circles. Hundreds of kinds of spiritual skills, thousands of people with the same screen PK, gorgeous and beautiful effects bring you into the real rich world of comprehension.<br/>\n<br/>\r\nGame features<br/>\n<br/>\r\nAgainst the sky, robbery: In order to gain the power of the sky, the player needs to go against the sky, challenge the thunderous behemoth, cast the immortal golden body, and the robbery needs magic weapon to harm the robbery monster, or you can use the magic weapon to immunize the robbery. Monster damage<br/>\n<br/>\r\nInvincible flying sword: walking at the foot of the rivers and lakes can not be less cool flying swords, Yu Jianchi hired to travel the three worlds, all kinds of legendary flying swords, not only the appearance of cool can also increase the powerful combat power, Feijian can also cultivate, any Illusion.<br/>\n<br/>\r\nThe opportunity to rob: often in the rivers and lakes where can not slash, in order to obtain the opportunity, the immortal people have to pick up the sword in their hands, rob other players, get the opportunity treasure chest, open the edge of the treasure chest to get a lot of reward items.<br/>\n<br/>\r\nShenbing Xianjia: Shenbing and Xianjia are essential for the cultivation of immortals. They not only provide the appearance of cool and arrogant, but also enhance the superior combat power. Both the Shenbing and the Sinjia can improve the attributes through cultivation and advancement. And combat power.<br/>\n<br/>\r\nPeerless fairy tales: With the beauty of the three worlds to show their unparalleled temperament, peerless companions, together with the demon slayer is the immortal life, the fairy can also be independently cultivated, upgraded, rising stars, advanced, wearing ornaments and Open the battle of the fairy tales, you can do the cultivator and you can also be a combat partner. The most important thing is that the fairy can also interact with you.<br/>\n<br/>\r\nArena: Compared with the full-service players, compete for the daily competitive rankings, and reward the achievements with the rich rankings, so that the strong is stronger.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T03:17:13", "background_image": "https://media.rawg.io/media/screenshots/ff4/ff4dbf330589e5e5f6619420981592ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["广州霖橙科技有限公司"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["广州市麟夕科技有限公司"], "esrb_rating": null}