{"id": 370136, "slug": "timothy-and-the-mysterious-forest", "name": "Timothy and the Mysterious Forest", "name_original": "Timothy and the Mysterious Forest", "description": "Timothy and the Mysterious Forest has an \"old school\" style with some modern-age ideas. A mix of Game Boy graphics (heavily inspired from The Legend of Zelda: Link's Awakening) along with meta-narrative, stealth system and action combat with an high difficulty level.<br/>The game mixes elements from adventure/exploration games with puzzle and stealth: exploration, reading and keeping a slow pace is the best tactic.<br/>Three different endings!<br/><br/><br/> High difficulty level is the base: Timothy is basically defenceless and dies with a single touch from enemies or traps.<br/> Direct combat and stealth can be mixed.<br/> Grab &amp; throw: specific items can be grabbed and thrown onto enemies to kill them instantly. <br/> Intelligent enemies moves using patterns and normally patrol their area.<br/><br/><br/>Timothy, a common child, wants to save his grandfather from certain death. The old man fell ill and he's now fighting for his life. Timothy, who loves his grandfather very much, decides to take a risky journey to the infamous Mysterious Forest. Legends speak of a magic mushroom able to cure any disease that grows into the forest. Timothy bravely begins his journey to find the magic mushroom.<br/>The world is full of ruins, graveyards and tombstones, caves, swamps and weird characters: every place is made to look wild, abandoned and dangerous. Except for Timothy's grandfather, most characters are often mean or clearly driven by not-so-nice feelings.", "metacritic": null, "released": "2018-11-17", "tba": false, "updated": "2021-01-25T03:06:11", "background_image": "https://media.rawg.io/media/screenshots/f2b/f2b83adb863dcbbab2e7187374358b6c.jpg", "website": "http://www.gamerainteractive.it", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["Kibou Entertainment"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Gamera Interactive"], "esrb_rating": null}