{"id": 370277, "slug": "musasabi", "name": "Musasabi", "name_original": "Musasabi", "description": "The immortal and evil Jakuna has awakened he has disseminated the magic gems all over the kingdom because the magic gems reunited are his only weakness  and he has released his evil power all over the world, creatures start appearing and the only way to stop him is tracking and collecting the magic gems, and defeat Jakuna once and for all.<br/>The forest's gnomes were the guardians of the magic gems, but now they can't reach all the corners where the gems are hidden.<br/>Only Risu the Musasabi flying squirrel is brave a capable of getting back all the magic gems with the help of the gnomes' magic powers, to help them defeat Jakuna and save the kingdom.<br/>Risu can easily navigate his arboreal home at any orientation whether he is moving up, down or sideways. he can quickly change direction and even run headfirst down trees.<br/>Risu never hesitates to leap into the void, luckily, he comes equipped with a built-in parachute turning him into a living breathing paper airplane, the rodent glide through the forest like a ghost.<br/>Enemies constantly hunt him, but no matter what this squirrel will always have a scape plan, gliding is like a built-in life insurance policy, wingless predators need not apply.<br/>If avoiding troubles is not enough he always can attack them back with acorns as bullets and special power-ups.<h3>Key Features</h3><ul><li> 28 levels each with different enemies and obstacles to overcome.<br/></li><li> 4 zones: with different environments, fights against bosses are included.<br/></li><li> Fluid rhythm of the game and great control.<br/></li><li> The levels are designed to demonstrate your skill and with enemies that will pressure you to move and force you to play fast and think faster while you shoot or evade them to reach your goal.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T04:04:35", "background_image": "https://media.rawg.io/media/screenshots/acf/acfdb70e801890507651f552d766485d.jpg", "website": "https://www.ludumify.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ludumify"], "genres": ["Action", "Adventure"], "publishers": ["Ludumify"], "esrb_rating": null}