{"id": 370205, "slug": "gang-zhong-zhi-nao-huang-yan-brain-in-a-vat-lies", "name": "缸中之脑：谎言（Brain in a vat lies）", "name_original": "缸中之脑：谎言（Brain in a vat lies）", "description": "\r\nArrow key operation, Z prompt, X menu, C confirmation / firing, A flashlight, D gun / drop, S mission<br/>\n<br/>\r\nEasy Raiders:<br/>\r\nPress the Z button, a white circle will appear on the map, then follow the process, go out, see the mysterious person below, then enter the room next to read the book, then come out to get the envelope, then come to a meadow, enter the hut The password at the cabin is 506, the next cabinet is the password prompt. On May 6th, when you get the rifle, you can press the D button to lift it, then press the C button to fire, then press the D button to close it. After that, I followed the process and started the plot down at the sewer. Some monsters, all the way through, until the end, there will be light, and then come to another place, you can see the mysterious people through the graveyard. After the conversation, read the book on the table, go to another place, read the book below the hall, go to the middle to check the password, then enter the basement to get the key, leave and go to another place, you can get the fuse under the table, then Go back to the above repair switch, then turn it on, then go up, go to a place, follow the process and go straight, there are some monsters on the road, you can bypass, know to go 7 The room on the far left of the building triggers the plot, enters the room, goes to the right to find the videotape, and plays it on the TV next to it. After that, the story will prompt to leave the room. Some monsters along the road can also be bypassed. There is a local gate in the middle. It is necessary to trigger the dialogue above, then the door will open, come outside, trigger the final plot, the protagonist will be transmitted to somewhere, then go to the basement, talk to the mysterious person, and finish.", "metacritic": null, "released": "2019-08-26", "tba": false, "updated": "2019-09-02T03:25:39", "background_image": "https://media.rawg.io/media/screenshots/878/8783b4f3d290866df021f08a2d537f9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cv006_64"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["cv006_64"], "esrb_rating": null}