{"id": 370254, "slug": "wheel-of-fate", "name": "Wheel of Fate", "name_original": "Wheel of Fate", "description": "In the ancient world of Providence, a hero must rise. The battle between Fate and the Fateless will be fought in the backwater town of Kismet’s Fall and the Wheel of Fate has chosen you as its Avatar.  Explore a world that changes around you with each spin of the wheel. Defeat a foe ancient as time itself. Wheel of Fate is the RPG that will alter your reality!  How will you spin your destiny?<br/><br/>Wheel of Fate is a turn-based RPG offering a dynamic gameplay experience. It uses AI-technology to create massive replayability. The Wheel mechanic creates boundless possibilities as the world, story and the very fates themselves will change around you.<h3>Enjoy a dynamic gameplay experience affected by The Wheel of Fate </h3>The Wheel is an interactive object in the game that impacts the world. It has machine learning technology that adapts to your style of gameplay. This artificial intelligence acts as a dungeon master, where it can change the ambient environmental effects, parts of the story, and the random events you experience as you play the game.<h3>Battle enemies with our exciting turn-based combat system!</h3>Our battle system is unique in the way it combines a classic turn-based combat style with an active response that allows you to plan your moves and time them for maximum damage.<h3>Replay the game for a new experience every time</h3>With the Wheel spinning throughout the game, you can expect an altered story with new events each time!<h3>Features Include:</h3><ul><li> Artificial Intelligence Wheel adapting the world to player choices.<br/></li><li> Strategic turn-based combat with initiative turn system.<br/></li><li> Active Response Battle system allows for engaging turn based combat that keeps you on your toes.<br/></li><li> Manage and defend Kismet’s Fall as the protector, upgrade buildings and prepare for sieges. <br/></li><li> Procedural Dungeons that adapt to the wheel spins.<br/></li><li> Build and customize your home in Kismet’s Fall.<br/></li><li> Rich story that ties your actions to the outcomes of fate.<br/></li><li> Craft items, weapons, and armor to head into battle.<br/></li><li> Billions of gear combinations, build your character how you want.<br/></li><li> And much more!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T03:51:30", "background_image": "https://media.rawg.io/media/screenshots/049/0498934fe9ea8921f3a9e53b3c6f1a5e.jpg", "website": "https://www.wheeloffate.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UDX Interactive"], "genres": ["RPG", "Indie"], "publishers": ["UDX Interactive"], "esrb_rating": null}