{"id": 370234, "slug": "herogrinder-tactical-combat-arenas", "name": "Herogrinder: Tactical Combat Arenas", "name_original": "Herogrinder: Tactical Combat Arenas", "description": "The most ruthless game show of the 24th century - a game where contestants enter lethal tactical combat arenas with customized bioroid soldiers and measure their skills against each other in strategic, simultaneous turn-based PvP and co-op deathmatches. A game of strategic combat with a sinister agenda.<h3>Customize and advance your bioroids</h3><br/>Male and female bioroids come in three sizes depending on their attributes. Each is custom created with abilities and skills you choose for their tactical advantage and your strategy. Bioroids progress in levels to gain new ability enhancements which you can choose from over 500 options. You can also customize how your bioroids look, including colors, textures, decals, accessories, and much more. <br/><br/><strong>Visit our website to download the Bioroid Customizer app and enter the contest with your custom creations to win a 3D model of your unique bioroid.</strong> Now you can also upload your own texture and decal mods for an even more personal appearance. <br/><br/>Click the \"View the manual\" button on the sidebar to access the latest Bioroid User Manual for sample preset character progressions.<h3>Everyone finds the right gear</h3><br/>Choose from hundreds of ranged and melee weapons, armors, shields, and utility items to match the skills of your bioroids to achieve the ultimate combos! There's also a wide assortment of grenades and mines, loads of add-ons to make every armor and weapon truly unique, as well as cybernetic implants, placeable items, drones, and boosters to make your team even more powerful. <br/><br/>Click the \"View stats\" link on the sidebar to access the latest Herogrinder Equipment Catalogue for a sample of available gear.<h3>Simultaneous turns with infinite outcomes</h3><br/>All players choose their boiroids' actions during the same command phase so you don't have to wait for others to act. Action outcomes depend on numerous conditions like initiative, readied actions, attack/skill/resistance success or failure, awareness, light/arena/character conditions, feats, and much more. The variability of outcomes in each round is almost endless, but success depends on how you take advantage of your bioroids' optimized skillset and the environment.<h3>Rearrange and use the arenas</h3><br/>Each arena is meticulously designed with a range of strategic options - doors, switches, covers, cameras, AI drones, lighting panels, and area effects that add to the overall complexity of the game. All walls, doors, and covers are destructible, while covers can also be moved around for strategic positioning.<h3>Design your own arenas</h3><br/>Design your own arenas with the Arena Creator Tool and share them with the community. Other players can vote on their favorites, and the most popular ones will have a chance to become official arenas in the game.<h3>Available game modes</h3><br/><ul><li><strong>1v1, 1v1v1:</strong> Command a single bioroid, or a squad of four bioroids against one or two opponents. <br/></li><li><strong>2v2 Co-op:</strong> Join a teammate with your squad of four bioroids in a co-op battle against another pair of players. <br/></li><li><strong>10-Player Deathmatch:</strong> Enter the arenas with a single bioroid to match your skills against 9 other players, each commanding a single bioroid.<br/></li><li><strong>4v4 Co-op:</strong> Join three teammates with a single bioroid to play against another team of four players commanding a single bioroid each. </li></ul> <br/>Invite your friends to join any of the available game modes either as opponents or allies.<h3>Classified content</h3><br/>There are things we can't speak about. Things you must experience for yourself to truly comprehend if your sanity allows. As Comte Julian d'Erlette of the Knights of St. George noted: \"The skeptics want to be ahead of their time, the skillful achieve the common goal, while the knowledgable prepare the Elder Sign.\"<h3>Synthwave soundtrack</h3><br/>The stylish tunes for Herogrinder were produced by Daniel Deluxe and Dynatron. Listen to their retro vibes on our website.<br/><br/>Herogrinder is a free-to-play game that does not feature paywalls, loot boxes or pay-to-win solutions.  <br/><br/>Intrigued? Add us to your wishlist and join the game show as soon as it's launched!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-02T03:40:39", "background_image": "https://media.rawg.io/media/screenshots/6ca/6caa6b1bfd10b2f61fa9f51ef6ec54ec.jpg", "website": "https://herogrinder.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Modern"], "genres": ["Action", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Modern"], "esrb_rating": null}