{"id": 370262, "slug": "chernobyl-road-of-death", "name": "Chernobyl: Road of Death", "name_original": "Chernobyl: Road of Death", "description": "After explosion at the Chernobyl nuclear power plant, huge areas were contaminated with radiation. Under its influence, many living organisms were mutated and became very aggressive. The source of the fire at the station has been eliminated, but the reactor is threatened by a second explosion. The whole world is in mortal danger.  We assembled a special team, you are one of them.<br/><br/>Your task is to get through the entire Chernobyl zone to the nuclear power plant performing various tasks and prevent a new impending disaster. On the way you expect a lot of dangers - various mutants, armed to the teeth military who arrived in the exclusion zone to steal secret documents. <br/>.<br/>But the main danger is your invisible and most dangerous enemy - radiation. To combat it in your Arsenal there is a special water tool that will allow you to eliminate it and move on. Other dangerous elements for you are the weather and time of day. To save from radioactive rains, you can pitch a tent. Night in Chernobyl is especially dangerous and there your best friend will be a flashlight. Also, you can make a fire, which will help to illuminate the area, and next to the tent, it will contribute to a faster recovery. Do not forget to look for food, first aid kits and ammunition, which are scattered on the territory. <br/>Your path will run through forests, swamps, landfills, and you will be able to visit the secret military facility \"Duga-2\" and the city of Pripyat.<br/><br/>.<br/><br/>Game features<br/><br/>-- nice pixel graphics in a dark palette with elements of lighting*atmosphere of the postapocalypse<br/>-- the soundtrack in the style of ambient, post rock/metal*elements of a rogue like <br/>-- you start playing in different parts of the map, the elements of the environment and tasks are  changing their position<br/>-- survival in the harsh conditions of Chernobyl <br/>-- the ability to hide in a tent, make bonfires, install pillars measuring radiation*dynamic day/night in levels", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2019-09-02T03:57:11", "background_image": "https://media.rawg.io/media/screenshots/fb7/fb7f4fd82369241f555731346b6ffdd6.jpg", "website": "https://vk.com/diedemor", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diedemor Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["diedemor studio"], "esrb_rating": null}