{"id": 370208, "slug": "rescue-team-8", "name": "Rescue Team 8", "name_original": "Rescue Team 8", "description": "Lead the way to safety after disaster strikes as the Rescue Team faces dangers both natural and manmade! Earthquakes and avalanches are just two of the catastrophes the Rescue Team encounters in this thrilling sequel. But the team can't blame every problem on Mother Nature because she has a little competition from Pietro Mangula, the world's most notorious poacher!<br/>\n<br/>\r\nWhen Mangula and his henchmen steal every animal off a reserve, FEMA calls in the Rescue Team to save the day! To deal with the mess Mangula leaves behind as he escapes through dangerous drylands, cavernous mines and wild jungles, players need to gather resources, remove obstacles and handle fires, floods, dark caves and more.<br/>\n<br/>\r\nPlayers can race to beat the clock and earn awesome achievements or complete quests in a relaxed manner. Either way, the Collector's Edition of Rescue Team 8 offers silky smooth point-and-click gameplay, eye popping graphics and animation and a wealth of bonus content!<br/>\n<br/>\r\nSound the alarm and download Rescue Team 8 Collector's Edition today!<br/>\n<br/>\r\nKey features:<br/>\r\n•\tAn adventurous story<br/>\r\n•\tDozens of challenging levels<br/>\r\n•\tStunning artwork and animation<br/>\r\n•\tBeginner and advanced player modes<br/>\r\n•\tLearn-as-you-play tutorial", "metacritic": null, "released": "2019-08-29", "tba": false, "updated": "2019-09-02T03:27:03", "background_image": "https://media.rawg.io/media/screenshots/fe2/fe296994afdb1272acf8a937720c178f.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 18}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameOn Production"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}