{"id": 370260, "slug": "football-manager-2020", "name": "Football Manager 2020", "name_original": "Football Manager 2020", "description": "Talkers talk – but managers make things happen, and ours a special breed.<br />\nThey don’t see problems, only opportunities: the opportunity to prove themselves against the best in the world, to turn a player’s career around, to instil a new philosophy, to push the board for more and end that long wait for silverware.<br />\nThis is a world that rewards planning and knowledge but, unlike other games, there’s no pre-defined ending or script to follow – just endless possibilities and opportunities.<br />\nSo, if you’ve ever thought “I can do better than that”, now’s your chance… Stop talking and get ahead of the conversation.<br />\nHow you get to the top is up to you… you’ll own your decisions, and the consequences they bring.<br />\n-   Base yourself in 50 of the biggest footballing countries worldwide<br />\n-   Oversee a new era of success at one of 2,500 clubs at every level<br />\n-   Sign the best and mould the future – scout more than 500,000 real players and staff<br />\n-   Create your tactical vision and bring it to life on the training pitch<br />\n-   Kick every ball with our most immersive and smartest match engine to date<br />\nNew features, game upgrades and licensing updates will drop on our social channels towards the end of September, so get following now to get ahead of the game.</p>", "metacritic": 84, "released": "2019-11-11", "tba": false, "updated": "2024-02-29T12:37:53", "background_image": "https://media.rawg.io/media/screenshots/1f6/1f6831f3d1fb3f8d5307a951f1fe9185.jpg", "website": "http://www.footballmanager.com/", "rating": 4.04, "rating_top": 4, "added_by_status": {"yet": 77, "owned": 416, "beaten": 51, "toplay": 8, "dropped": 39, "playing": 18}, "playtime": 24, "achievements_count": 182, "ratings_count": 115, "suggestions_count": 70, "game_series_count": 18, "reviews_count": 115, "platforms": ["macOS", "PC"], "developers": ["Sports Interactive"], "genres": ["Simulation", "Sports"], "publishers": ["SEGA"], "esrb_rating": "Everyone"}