{"id": 370365, "slug": "magic-arena", "name": "Magic ARena", "name_original": "Magic ARena", "description": "Welcome to the Magic ARena ! <br/>The World’s first game where you can use real objects as game items! <br/><br/>Just scan the objects on your battlefield through your camera and it will become a powerful tower that supports your team ! <br/><br/>Collect and upgrade your characters though Character Cards, Spell Cards, Magic Chests and Special Events and Missions! Destroy the opponents tower and defend yours for more Victory ! <br/><br/><br/>An Augmented Reality real-time multiplayer battlefield starring adorable magical animals that will help you find your way to victory. <br/><br/>We will lead you through new experiences everyday through the <br/>Magic ARena ! <br/><br/> <br/>[Game Features]<br/><br/>●  A casual PvP that can be played in REAL-TIME with players around the world. Experience the 1: 1 championship matchdown!<br/><br/>● Strike your opponent's tower, grab the boss, and collect the keys of good fortune! Collect 10 keys to open treasure chests that contain many rewards.<br/><br/>● You win a treasure box every time you win a battle! In the treasure box, you can get a new and powerful card, or you can collect cards you already own and upgrade them.<br/><br/>● At Magic ARena, a Vision Card is available that can be used to detect nearby objects. You can witness the incredible sight of REAL OBJECTS transforming to a powerful tower by scanning available objects . This feature is crucial to who wins Victory or Defeats! <br/><br/>● Vision spells are so powerful that if you summon them on the right time, you can lead the battle to your WIN! Make the best use of objects around you!<br/><br/>● In the Magic ARena, Units, Magic, and Vision Towers appear. Make your best battle deck and lead to victory!<br/><br/>● The more battle experience you have, the more powerful you get.<br/><br/>● Take daily and weekly quests to earn humongous rewards!<br/><br/> <br/><br/>[NOTES]<br/><br/>- This app is free-to-play and offers in-game purchases. <br/>- It is recommended to play while connected to a network in order to obtain accurate location information.<br/>- Compatibility information may be changed at any time.<br/>- Information current as of July 1, 2019<br/>- Compatible with iPhone®   5SE/ 6s / 6s Plus / 7 / 7 Plus / 8 / 8 Plus / X/ XR / XS / XS Max devices with iOS Version 11.3 or later installed.<br/>- Not compatible with 5th generation iPod Touch devices or iPhone 5s or earlier iPhone devices.<br/><br/><br/><br/>Please contact us for Game Inquiries.<br/><br/>[ Contact Us ]<br/><br/> ※ Game Settings ▶ ETC. ▶ EMAIL<br/><br/><br/>[Privacy Policy and Terms of Use]<br/><br/> ※ https://s3.ap-northeast-2.amazonaws.com/mhar-upload/test/iPixelcorp_access+terms_eng.html", "metacritic": null, "released": "2019-08-11", "tba": false, "updated": "2019-09-02T04:44:59", "background_image": "https://media.rawg.io/media/screenshots/f65/f65eddf2633e9270ada8fe248f3159e0_3Qr8d3U.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iPIXEL Co.,Ltd."], "genres": ["Strategy", "Casual"], "publishers": ["iPIXEL Co.,Ltd."], "esrb_rating": "Everyone 10+"}