{"id": 37033, "slug": "armada-online", "name": "Armada Online", "name_original": "Armada Online", "description": "Take command of a starship and wage war against the Armada.\r\nYour creativity and skill will determine the future of the universe.\r\n\r\nWe began life bound to a single planet.\r\nOur ancestors freed us to roam the stars.\r\nNow the alien Armada seeks to imprison us once again.\r\nThey would deprive us of our basic right to travel, to evolve.\r\nReturning to Earth is the path to extinction.\r\nWe must surge outward and populate the universe.\r\nThe journey to space is the quest for life everlasting.\r\n\r\nhttp://levelsave.com/hands-on-with-armada-online-mmo-plus-in-space/\r\n\r\n\r\nKey features:\r\nInteresting Strategy: You have a lot of toys to play with, and interesting choices to make. Some enemies have vulnerable spots, split into smaller creatures when destroyed, explode when killed, or enhance all aliens around them, creating tactical priorities and interesting roles for specialized ships to play. You can creatively use ships, summons, and teamwork to overcome tough situations.\r\n\r\nVaried Experiences: Different areas offer unique experiences. Some areas are open RPG zones, cooperative tower defense, or dota-like maps. All areas are highly replayable, and you can try a different approach every time.\r\n\r\nPlay How You Like: You can be creative with how you set up your ship, powers, and skills. Experiment with different builds in different zones. Become a stealth operator, summon stations, teleport in for surprise attacks, or support your allies with repairs and special abilities. Choose skills that enhance your ship's speed, attack power, or give it unusual methods of escaping the enemy or countering their defenses.\r\n\r\nOpenness: Instantly warp where you wish, at any time. Join with others to hunt the Armada, mine asteroids alone if you prefer, or warp into the Neutral Zone to battle other players.", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5d3/5d342de7acbd0209d0092c2e853032bc.jpg", "website": "http://www.armada-online.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EvStream"], "genres": ["RPG", "Strategy", "Massively Multiplayer"], "publishers": ["EvStream"], "esrb_rating": null}