{"id": 370387, "slug": "cat-home-design-kitten-house", "name": "Cat Home Design: Kitten House", "name_original": "Cat Home Design: Kitten House", "description": "Cat Home Design is a design &amp; decorate your own cute magic kitty home &amp; cat collector game with match-3 puzzle. Restore and renovate the cat homes and invite the cats back to their small restored mansions. Complete tasks by playing the fun, challenging and relaxing match-3 puzzles to win stars so you can help cats restore their rooms and houses by buying and choosing the right furniture that fits their look and style. You can invite, collect different cats and customize their looks with beautiful skins, cute emotions and soothing meow sounds. <br/><br/>This game is purrfect for kitty cat owners and pet lovers who like to be creative, who love to create, restore, renovate, decorate, build and design houses, rooms, cute homes and mansions! You can also interact with the cats and make them meow,  jump and move or walk around the house. <br/><br/>=== Features of Cat Home Design: Decorate Cute Magic Kitty Mansion Game: ===<br/><br/>•\tFREE Cat home renovation &amp; cat home improvement game<br/>•\tRestore, Renovate, Decorate house by buying and placing furniture &amp; fixtures<br/>•\tPlay as a decorator or an architect who can design and decorate houses &amp; homes<br/>•\tInvite new cats to live in the rooms that you finished decorating<br/>•\tCollect, Customize &amp; Interact with different Cats, kitties and kittens<br/>•\tUnlock other rooms by completing tasks on task list<br/>•\tEarn bonus rewards when you complete restoring, renovating &amp; decorating cat homes<br/>•\tDress up your cat with your favorite skins and also add emoticons <br/>•\tInteract with your cats, tap, swipe right and left to move them around the house<br/>•\tRead funny chat messages and listen to meow sounds when you complete tasks<br/>•\tChanging Background colors<br/>•       Calm and relaxing music along with challenging match-3 puzzles<br/>•       Stress Reliever and extremely cute and soothing!<br/><br/>GET STARS BY PLAYING MATCH 3 GAME! One of the best parts of Cat Home Design Game is that you can get stars by playing fun match 3 game!  This match 3 game has all the fun elements that you like:<br/><br/>•\tSlide to create match 3 items. <br/>•\tWin bonuses for creating match 4 and match 5<br/>•\tIncreasing difficulty every time you move up a level<br/>•\tEarn stars to purchase furniture for your cute cat houses<br/>•\tLimited amount of moves for each level<br/>•\tReplayable yet still fun and addictive<br/>What are you waiting for? Download  Cat Home Design today, interact with fun cute little cats,kitties &amp; kittens and design, restore, renovate the cute meow house and play match-3 puzzles today!", "metacritic": null, "released": "2019-04-09", "tba": false, "updated": "2019-09-02T05:03:28", "background_image": "https://media.rawg.io/media/screenshots/f89/f89d616f25f9caeb3042c4db92357772.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["RPG", "Puzzle"], "publishers": ["Romit Dodhia"], "esrb_rating": "Everyone 10+"}