{"id": 370345, "slug": "royale-warriors-war-games", "name": "Royale Warriors: War Games", "name_original": "Royale Warriors: War Games", "description": "This is a strategy role-playing game. Start with weak heroes, and then advance your squad through a variety of training systems to struggle to defeat your opponent from the universe to win the title of the most powerful warrior in the universe. While the goal may be simple in each system—defeat the enemy squads—you have to prevent yours from being defeated in some certain system, too. To do this, you need to train your heroes. In order to train them, you need to play multiple systems to win training resource materials. You’ll earn gold , experience, diamonds, etc. as you go, and you can purchase materials with these currency. And of course, it’s pretty rich in play and colorful and vivid in graphic.<br/><br/>INSTRUCTIONS<br/><br/>To play this game, the controls are simple. Just click send featured heroes to form teams to attack opponents on your behalf. When the battle starts, click on the start button to get your heroes to start fighting. You can manually move the hero's position, or you can use automatic mode to let the hero fight automatically. At the same time, click the SPD button to achieve a quick automatic battle. No matter which game system you are in, it's your ultimate goal to fight and win;<br/><br/>The strategy comes into play when figuring out the best way and squad to defeating your opponent, raising your ranking, and finally winning rewards because there are different attributes for different heroes, and different gears and runes can be worn. Of course, in order to train heroes, enhance the hero's combat power, the appropriate training strategy is also very important. In a word, you’ll need to spend close attention to your strategy during play.<br/><br/>Here you will meet many powerful opponents. They are all players from the real world and the are global. Opponents are strong, but only powerful ones are worthy of being your opponents, right? Games without challenges are not good games.<br/> <br/>For more features and surprises, welcome to join the game!", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T04:36:16", "background_image": "https://media.rawg.io/media/screenshots/b53/b5316f73c493a9dba046c0f078aec5c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yi Fei"], "genres": ["Action", "Card"], "publishers": ["Yi Fei"], "esrb_rating": "Everyone 10+"}