{"id": 370319, "slug": "idle-dot-to-dot-connect-dots", "name": "Idle Dot to dot - Connect dots", "name_original": "Idle Dot to dot - Connect dots", "description": "Idle Dot to Dot - Tap tap connect the dots clicker is relaxing puzzle game about connecting dots in a style of coloring apps. Simply tap on screen to connect dots by number and complete a drawing! Puzzles can also be connected idle! Internet connection isn’t required to play the idle dot to dot. No coloring anymore, the drawings are automatically in colors while the dots are connected. Let’s enjoy the best idle dot to dot game from the creators of popular relaxing apps. <br/><br/>Forget about stress and let dot to dot be your therapist and everyday meditation. One of the best idle anti stress connecting apps which helps you to be relaxed. Let idle dots connecting be your meditational therapy.<br/><br/>Why the connect the dots idle?\u2028<br/>- First and best idle game of its kind in the store<br/>- Unique theme: Dot to dot where you are connecting idle pictures with 1000 dots<br/>- Easy to play: tap to connect, make money and do upgrades or just go idle. No need to paint!<br/>- 3 types of upgrades: connecting and tapping speed, more money for tapping.<br/>- Relax and ease stress by tapping or watching puzzles to draw idle.<br/>- Idle game for everyone!<br/>- All dot to dot puzzles are for free.<br/><br/>Now let’s connect idle!!!", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T04:27:57", "background_image": "https://media.rawg.io/media/screenshots/ab9/ab9661e070ae2921a6218b820af9aed3_iYCLKIR.jpg", "website": "https://www.dottodot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dot to Dot"], "genres": ["Simulation", "Puzzle"], "publishers": ["Dot to Dot"], "esrb_rating": "Everyone 10+"}