{"id": 370377, "slug": "prophecy-of-merlin", "name": "Prophecy of Merlin", "name_original": "Prophecy of Merlin", "description": "Old King Arthur enjoyed an extravagant life, ignoring the sufferings of his people. Merlin was very disappointed. Using the magic, he made the space-time conversion and created a new world where King Arthur, Great Caesar and Emperor Charlemagne and their knights were all brought together. <br/>Merlin predicts that the flames of war will be burning soon, and the final winner will be decided by a brave man coming from the future world...<br/><br/>Are you the man in Merlin's prophecy?<br/><br/>Knights of Round Tables Vs Rome Vs Paladins, who will win?<br/>King Arthur, Caesar, and Charlemagne, who will you pledge loyalty to?<br/>London, Berlin, Paris, Rome, Brussels... What they looks like in ancient times?<br/>Vikings, Crusaders, Salah ad-Din, Mongolia cavalry... Are you ready for the adventure?<br/><br/><br/>FEATURES:<br/><br/>1. Build your castle, marry the girl you love, get promoted and expand your land.<br/>2. Defeat and recruit hundreds of historical heroes such as Roland, Robin Hood and Spartacus etc.<br/>3. Learn the ancient battle strategy, killing thousands enemy by hundreds.<br/>4. Experience historical battle and change the history by your effort.<br/>5. Join a legion and play with players from all over the world.<br/>6. Fight against the mad Kings in the world campaign and win the love the Helen.<br/><br/>WHY WE ARE SPECIAL:<br/><br/>1.\tNo more pay to win!<br/>2.\tNo more collecting resources constantly!<br/>3.\tNo more building and upgrading troops endlessly!<br/>4.\tNo more worrying about your army been killed over one night!<br/><br/>Welcome to the new land! Download now and start a journey of adventure!<br/><br/>Facebook fanpage: https://www.facebook.com/ProphecyofMerlin", "metacritic": null, "released": "2017-12-25", "tba": false, "updated": "2019-09-02T04:56:01", "background_image": "https://media.rawg.io/media/screenshots/330/3303f1431ed72fdab0dac2e0eedc8a1a_r3YxUwy.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FUNALL TECHNOLOGY DEVELOPMENT CO"], "genres": ["Strategy"], "publishers": ["FUNALL TECHNOLOGY DEVELOPMENT CO"], "esrb_rating": "Teen"}