{"id": 370385, "slug": "my-room-design-your-home-2019", "name": "My Room Design: Your Home 2019", "name_original": "My Room Design: Your Home 2019", "description": "Play My Room Design - Home Decorating &amp; Decoration Game for FREE today! Decorate house, living room, bedroom, kitchen, and other types of living spaces with your interior design skill. Purchase furniture and fixtures with coins and play awesome match 3 game to get more coins. Showcase your best décor as a home designer to your friends and family. Our interior design app is perfect for people who dream to be a decorator or even architect, and it’s also a perfect accompaniment if you already play other home improvement and home renovation simulation game. <br/><br/>How many of us dream to be a home designer, decorator or architect? Even if you have other dreams, no one will deny that we love interior design. It’s so much fun to imagine that we have a beautiful house and we can decorate or design it anyway we want. Our home designer game is a perfect app to explore your creative side. You can decorate house, add fixtures, change the floors, etc. It’s a great home improvement and home renovation simulation game for all ages. The best thing about our home designer game compared to other interior design apps is that you can get coins for FREE for playing match 3 game or watch videos! What’s not to like? Our interior design app is also great for young kids.  <br/><br/>=== Features of Room Décor &amp; Home Decoration Game: ===<br/>•\tFREE home renovation &amp; home improvement game. <br/>•\tPlay as a decorator or architect who design room <br/>•\tDecorate house by buying and placing furniture &amp; fixtures.<br/>•\tUnlock other Rooms with coins<br/>•\tEarn coins for FREE by playing match 3 game.<br/>•\t Name your rooms: Living room, bedroom, etc.<br/>•\tTake pictures of your room <br/>•\tZoom in and out the room. <br/>•\tGet special items FREE by watching videos<br/>•\tBrowse Furniture by Categories.<br/>•\tChanging Background colors<br/>•       Calm and relaxing music<br/>•       Stress Reliever!<br/>GET COINS BY PLAYING MATCH 3 GAME! One of the best parts of our interior design app is that you can get coins by playing fun match 3 game!  This match 3 game has all the fun elements that you like:<br/><br/>•\tSlide to create match 3 items. <br/>•\tBonus for creating match 4 and match 5<br/>•\tIncreasing difficulty every time you move up a level<br/>•\tEarn coins to purchase furniture for your living spaces<br/>•\tLimited amount of move for each level.<br/>•\tReplayable yet still fun and addictive. <br/><br/>Tired of playing the match 3 game? Purchase the coins directly to get the furniture you like. <br/>Furnitures for décor: chair, table, paintings, bed, music instruments, basket hoops, office furniture, carpets, lamps, home theater, shelves, gym equipment.<br/> <br/>Fixtures for home renovation or home improvement: floors, windows, door, walls, swimming pool, toilets, bathtubs, electronics.<br/><br/>Types of room to create: Gym, Music Studio, Living Room, Bedroom, Office.<br/><br/>Living Spaces themes: Indoor Blues, Muscle Parade, Musical Pleasure, Dream Room, Cozy Office Space, etc. <br/><br/>So, are you ready to brush up your interior design skill? Download and install our home decoration game now!", "metacritic": null, "released": "2019-02-01", "tba": false, "updated": "2019-09-02T05:01:19", "background_image": "https://media.rawg.io/media/screenshots/22c/22ce0c3610adc056073714f33c317219_XqDASoM.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["Simulation", "Puzzle"], "publishers": ["Romit Dodhia"], "esrb_rating": "Everyone 10+"}