{"id": 3704, "slug": "sportsfriends", "name": "Sportsfriends", "name_original": "Sportsfriends", "description": "<p>Sportsfriends is a set of four party games designed by Die Gute Fabrik: BaraBariBall, Super Pole Riders, Hokra and Johann Sebastian Joust.</p>\n<h3>Gameplay</h3>\n<p>BaraBariBall is generally a fighting game in which the player’s objective is to keep the ball possessed by pushing off the opponents and jumping to throw it into their water space. In Super Pole Riders, a player is supposed to keep the ball on the end of a zip line by operating a pole – the ball can be either pushed along or kicked. Hokra is a minimalist competition between two teams which objective is to possess the ball for the maximum of time and to keep it in the team’s territory. Johann Sebastian Joust (or simply J. S. Joust) is an individual game in which player attempts to interfere other players’ controller manipulations by increasing the speed of background music playing.</p>\n<h3>Key features</h3>\n<p>The whole game is simulating a retro-fashioned aesthetics. It is a multi-feature competition which can be focused not only on graphics but also on audio and provides various forms of participation to 2-4 players. Johann Sebastian Joust is compatible only with Linux or Mac OS. It is the most minimalistic variation of the game as it does not require the use of the monitor and is non-graphic. Super Pole Riders is a sequel to Pole Riders, providing more options of the ball’s control.</p>", "metacritic": null, "released": "2014-05-06", "tba": false, "updated": "2024-01-07T04:16:24", "background_image": "https://media.rawg.io/media/screenshots/2e5/2e5a94a8ec2b21ce543e302870df83bf.jpg", "website": "http://sportsfriendsgame.com/", "rating": 2.96, "rating_top": 4, "added_by_status": {"yet": 32, "owned": 796, "beaten": 49, "toplay": 2, "dropped": 50}, "playtime": 1, "achievements_count": 6, "ratings_count": 111, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 112, "platforms": ["PlayStation 4", "PlayStation 3", "PC", "Linux", "macOS"], "developers": ["Die Gute Fabrik"], "genres": ["Sports", "Arcade", "Indie"], "publishers": ["Die Gute Fabrik"], "esrb_rating": "Everyone 10+"}