{"id": 370400, "slug": "pool-stars", "name": "Pool Stars", "name_original": "Pool Stars", "description": "Pool Stars is a realistic 3D pool simulation with single player career and online multiplayer<br/><br/>3D Pool Game Mode <br/>- This mode will improve your pool billiards sports skills in real life! By playing 3D Perspective, like in real life, you learn to see the angles of the ball and improve the way you play billiards pool game!<br/><br/>2D Pool Game<br/>- For those who like the birds eye view and are used to a more casual pool experience. Great to learn the tactics of pool and billiards game!<br/><br/>Play with Friends<br/>- The best way to experience billiards is to play with your friends online. So go grab your friends and show them your billiards skills!<br/><br/>Single player career<br/>- Play against AI players in 8 Ball, 9 Ball Pool games<br/>- Practice your pool skills in trainings<br/>- Practice on user created trainings online(new user created trainings every day)<br/><br/>Create Your Own Challenge<br/>- The most creative way to enjoy this game! <br/>- Create your online challenge and let everyone compete<br/>- Try to get more players to play your challenge<br/>- Get likes for your challenge from other players<br/>- 8-ball, 9-ball and Snooker tables<br/>- It’s both competitive and creative, fun for all players!<br/><br/>Online Multiplayer<br/>- If you like some sport action and if you are competitive, you will love this game mode!<br/>- Weekly leaderboards<br/>- Pool Hustling<br/>- Lots of active online players <br/>- Many different tables and locations to visit<br/><br/>Download Pool Stars now and have fun!", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2019-09-02T05:12:59", "background_image": "https://media.rawg.io/media/screenshots/ddc/ddc13a406553989be7ee564b578aceea_rQ5aprY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Giraffe Games"], "genres": ["Simulation", "Sports"], "publishers": ["Giraffe Games"], "esrb_rating": "Teen"}