{"id": 370518, "slug": "quirky-emotions-game", "name": "Quirky Emotions Game", "name_original": "Quirky Emotions Game", "description": "<p>Quirky faces, quirky sayings and quirky fun.  Quirky Emotions Game consists of puzzle games for you to play based on the mood you're in.  There is no scoring or tracking system - jump in anywhere, play a game or two to take your mind off things, or just for fun.\r\n  </p>\n<p> \r\n  </p>\n<p>Choose the face with the expression that you want to play with.\r\n  </p>\n<ul><li>Choose a game based on the colour of that face - each one opens a different type of puzzle game.\r\n  </li><li>Select one of the 3 games to play.\r\n  </li></ul>\n<p> \r\n  </p>\n<p><strong>There are 75 puzzle games: 5 different types x 5 different emotions x 3 games each:</strong>\n</p>\n<ul><li>Green: Build a conventional puzzle using only shapes and similar pieces.   </li><li>Red: Move together - move the faces onto a square that match their own colour, however, all the faces move together.   </li><li>Pink: Find 2 friends.  Place connecting pieces so that every face is connected to at least 2 other faces.\r\n  </li><li>Blue: Logical faces - the faces are placed in a pattern with some missing faces.  Place the faces at the bottom in their right spots to complete the pattern.\r\n  </li><li>Yellow: Slider puzzle game - slide the tiles around to form the picture.  (You can swap the last 2 pieces.)\r\n  </li></ul>", "metacritic": null, "released": "2019-09-01", "tba": false, "updated": "2019-09-02T06:04:30", "background_image": "https://media.rawg.io/media/screenshots/600/60068b8f885d28b76cba8a4402a6e293.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Evolutionary Games"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}