{"id": 370729, "slug": "kimine", "name": "Kimine", "name_original": "Kimine", "description": "<p>IndieDevDay 2 Game Jam: Coge un suéter</p>\n<p>Origen. Misión. Destino. Todas incógnitas para mí… hasta ahora. Sólo mi misión está clara, poner mis habilidades en manos del Emperador, que consumido por su ansia de poder que cada vez le lleva más a la locura, desea poseer el kimono con más poder. Primero telas de hilo de araña, bordados de oricalco, hasta perseguir los colores del mismísimo arcoiris.</p>\n<p>Sé que la mayoría del reino se preguntará, ¿de dónde ha salido este individuo? ¿De verdad cree que lo conseguirá? La verdad es que no alcanzo a comprenderlo todavía, aunque mis dudas son otras. ¿Qué son estos poderes? ¿Quiénes son mis antepasados? ¿Cuál es mi misión? Sólo tengo una opción: debo explorar los reinos en busca de respuestas, siempre y cuando el Emperador esté satisfecho con mis servicios podré continuar persiguiendo mi destino.</p>\n\n<p>Hemos distorsionado un poco la temática, para adaptarla a este estilo tradicional japonés. Al final, el propósito del juego es recolectar los objetos necesarios para confeccionar el kimono que el Emperador tanto ansía.</p>\n<p>Kimine es un juego de plataformas en 3D en el que te pondrás en la piel de Mineki, un nómada que intenta descubrir su identidad mientras trabaja para el Emperador. Kimine está centrado en la exploración del escenario y la gestión de recursos, haciendo del juego una experiencia tan emocionante como intrigante, mientras vas descubriendo la historia de Mineki.<br/></p>\n\n<p><strong>CRÉDITOS</strong></p>\n<p>DISEÑADORES - Lucía Andrada, Almendra Fernández-Maldonado y Rubén Cepedello</p>\n<p>ARTE - Rubén Cepedello</p>\n<p>PROGRAMACIÓN - Almendra Fernández - Maldonado y Rubén Cepedello</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T06:52:08", "background_image": "https://media.rawg.io/media/screenshots/03d/03de0d4d0f2eab2e24b8b787f1a163ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thechemicalsquirrels"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}