{"id": 370871, "slug": "cave-of-uncertainty", "name": "Cave of Uncertainty", "name_original": "Cave of Uncertainty", "description": "<p>In our game you are stuck in a cave while being faced with three paths to walk down. There will always be a sign above one of the caves indicating if it is safe or dangerous, yet by checking your cave guide and comparing that to the objects you see, you will be able to determine if the sign is telling you the truth or if it is trying to lead you to your doom!</p>\n\n<p>The object of the game is to last as long as possible in the cave. Each room will have a sign above one of the doors, indicating if the door is safe or deadly. However, the sign may be lying. If you select a safe door, you will move on to the next room, and gain some time. If you run out of time, or select an unsafe door, the game ends.</p>\n<p>To select a door to enter, press 1, 2 or 3 to select the Left, Middle, and Right door respectively. Press and hold W to bring up the list of current rules. Run through the rules top to bottom, applying the logic to see if the sign is lying/which doors are safe or unsafe.</p>\n<p>Use A and D to look around the room. You will need to pay attention to the various objects in the room to figure out if the sign is lying or truthful.</p>\n<p>Throw a Flare in a door by hovering over the door and right clicking. The Flare will tell you if that door is safe. Flares always tell the truth.</p>\n<p>Some rooms are trapped with a bomb. To defuse the bomb, correctly type the phrase shown before it explodes. If the fuse runs out, or you mistype the phrase, you will become injured. If you fail another trap while injured, the game ends.</p>\n<p>Backpacks have been left behind by...less fortunate explorers. Click on a backpack to open it. Inside you may find additional Flares or Medkits. Medkits will heal you if you are injured, but cannot be stored for later like Flares.</p>\n<p>Some other rules to keep in mind:</p>\n<p>A truthful sign implies the other doors are the opposite. For example, if the sign says \"Safe\" above the middle door, it implies that the other doors are not safe.</p>\n<p>Always apply the rules top to bottom. If one rule makes the sign lying, yet a later rule makes it truthful, it is truthful.</p>\n<p>Look all around the room. Some objects may be more hidden than others.</p>\n\n<p>Created By: Jake Klein(@ZombyKillr), Zack Garner(@ZAG852) Wesley McWhorter (@WesMcW) Leah Blasczyk (@Lebrra), and Elijah B(@ElijahZAwesome).</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T07:24:39", "background_image": "https://media.rawg.io/media/screenshots/bc7/bc7ed578ac8d0537c38191d3d534446b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["WesMcW"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}