{"id": 37080, "slug": "psi-syberian-conflict", "name": "PSI: Syberian Conflict", "name_original": "PSI: Syberian Conflict", "description": "<p>Prehistory</p>\n<p>In 1908 spaceship carrying being of powerful alien race – Evolons crash-lands on Earth. Humans named this incident Tunguska meteorite. After more than half a century rescue expedition arrives. It&#39;s main task is to find their leader. However, they encounter unforeseen obstacle - natives. Appearance of aliens in Siberian tundra in the height of Cold war generates particular interest in Soviet Government. The best forces are thrown to take over extraterrestrial technologies. Huge power of Red Army against technical superiority of aliens.</p>\n<p>Features</p>\n<ul>\n<li>\n<p>Huge variety of especially detailed three dimensional terrains – fight in the fields and woods, in narrow city streets or alien world, on landscapes up to one square kilometer.</p>\n</li>\n<li>\n<p>Unique powerful heroes which can be improved with each mission.</p>\n</li>\n<li>\n<p>Large selection of tactical decisions: directional sight, landscape features, which influence battle conditions, special abilities of heroes and anomalies, which provide you with short but often decisive advantage.</p>\n</li>\n<li>\n<p>Realistic physics – explosions knock the enemy down or simply rip him apart.</p>\n</li>\n<li>\n<p>Intriguing story and missions providing you with a variety of tasks.</p>\n</li>\n<li>\n<p>Detailed and dynamic shadows are cast by all game objects, self-shadowing.</p>\n</li>\n<li>\n<p>Live and realistic surroundings – water, which reflects the sky and other objects, trees and grass moving in the wind.</p>\n</li>\n<li>\n<p>Post-processing.</p>\n</li>\n<li>\n<p>Realistically simulated and impressive particle and mesh effects.</p>\n</li>\n<li>\n<p>Beautiful dynamic lighting of the surroundings and unlimited number of light sources.</p>\n</li>\n</ul>", "metacritic": null, "released": "2006-03-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b6c/b6c001ac22256222b414777e2a574c2d.jpg", "website": "http://www.wireframedreams.com/index_en.php?page=psi_en", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 4, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 528, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Wireframe Dreams"], "genres": ["Strategy"], "publishers": ["Akella"], "esrb_rating": "Mature"}