{"id": 3710, "slug": "raiden-iv-overkill", "name": "Raiden IV: OverKill", "name_original": "Raiden IV: OverKill", "description": "Everything from fan favorites, such as the Spread Shot and Vulcan Laser, will be available, as well as new weapons and items! Instill fear in your enemies with devastating attacks and earn the acclaimed title of Master Ace!<br/>Game Modes<ul><li>OverKill Mode - a brand-new mode with new mission stages and a revamped scoring system!</li></ul><ul><li>Additional Mode - Variation of Arcade Mode with 2 new stages</li></ul><ul><li>Score Attack Mode - High Score Mode for all stages including those from Overkill Mode</li></ul><ul><li>Arcade Mode - Arcade Mode that recreates the arcade experience with two difficulties: Light and Original</li></ul><ul><li>World Rankings - Ranking mode that will place you among players from all over the world in Overkill Mode, Additional Mode, and Arcade Mode.</li></ul><ul><li>Reply &amp; Gallery - Watch Reply data and view items in the Gallery</li></ul><ul><li>??? - A secret mode playable once you clear the game</li></ul>Features<ul><li>Challenging New Bosses and Stages - With new stages and never before seen bosses, experience the fast, blistering game play action that never gets old.</li></ul><ul><li>Items, Weapons, and More - Unlock and master a variety of weapons, including fan favorites such as the Spread Shot and Laser, and never before seen weapons and items!</li></ul><ul><li>Best Graphics to Date - The series has transitioned from its 2D roots to 3D, creating lush environments, devastating explosions and countless enemies, without a drop in frame-rate.</li></ul>", "metacritic": null, "released": "2014-04-15", "tba": false, "updated": "2022-09-29T23:25:07", "background_image": "https://media.rawg.io/media/screenshots/c80/c8057dd78a32e2963dd3cd90d6fbbc89.jpg", "website": "http://www.mossjp.co.jp/", "rating": 3.67, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 172, "beaten": 2, "toplay": 2, "dropped": 1, "playing": 2}, "playtime": 3, "achievements_count": 47, "ratings_count": 6, "suggestions_count": 481, "game_series_count": 12, "reviews_count": 6, "platforms": ["PlayStation 3", "PC"], "developers": ["UFO Interactive Games", "Moss Co", "Moss Co."], "genres": ["Action", "Shooter", "Arcade"], "publishers": ["H2 Interactive Co", "H2 Interactive Co."], "esrb_rating": "Everyone 10+"}