{"id": 371057, "slug": "tales-of-the-cursed-word", "name": "Tales of the Cursed Word", "name_original": "Tales of the Cursed Word", "description": "<p><strong>- Game Overview -</strong></p>\n<p>This game has been made for the Community Game Jam, August 2019, it is an unconventional 2D Fantasy Point-Click Puzzle game. <br/><br/>In the thought process, when developing this,  we realised how hard it is to develope a game that is ACTUALLY a liar to you and not the opposite.<br/>If the game is a liar, lying shouldn't be your in game purpose, in fact, in this game, our goal is to make you feel the sense of being lied to!<br/><br/>* We suggest playing it on fullscreen and to lower the base volume of your windows before starting, it probably only works on windows 10! *</p>\n<p><strong>- Key Bindings -<br/></strong><br/>Left Mouse Button: does everything in this game, if clicked in the right spot obviously.<br/><br/><strong>- Game-flow -</strong><br/><br/>The flow should work perfectly, anyway, if you feel you are stucked into a bug, please, notify it to us in the comment section! </p>\n<p>Notice that, if you think it doesn't work, you are probably doing it wrong, it's a puzzle game and if you need any help you can click the \"Info Button\" on the bottom right corner of your screen to get some help!<br/><br/>There are a total of EIGHT core \"riddles\" you will have to solve, THREE different music tracks you will hear during the game.<br/><br/>Let's get realistic. You only need to press START!<br/><br/><strong>- Credits -</strong><br/></p>\n<p>We're an italian group of friends making games, in particular:\r\n<br/><br/></p>\n<p>\r\nSimone Turello: programming and animation.</p>\n<p>Stefano Bertolino: graphics, music and sound design.</p>\n<p>Matteo Lista: texts, game-flow design and general supporter.</p>\n<p>The general design has been made up in a particularly hilarious evening by the previous trio.</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T08:11:53", "background_image": "https://media.rawg.io/media/screenshots/42d/42df3de00c6198888eb7d6159ef4e20e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Saturas", "Stefano Bertolino", "SouLonTwitch"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}