{"id": 371119, "slug": "tutorial-npc", "name": "Tutorial NPC", "name_original": "Tutorial NPC", "description": "<p>The heart of an adventurer is always in the right place, but they don't always do the right things.</p>\n<p>Recently, they've built up a dirty habit of entering the homes of the local townsfolk and smashing all of their pots for loot! The townsfolk have come to you, a benevolent tutorial creator, to create \"tutorials\" for the rowdy adventurers that guide them through the civilians' homes, in the hopes that you'll be able to navigate the heroes through their houses without them ever laying eyes upon a pot to smash.</p>\n<p>This is an entry for the week-long Community Game Jam! https://itch.io/jam/cgj The theme was \"The Game is a Liar\".</p>\n<p>Controls:</p>\n<ul><li>Left click: Select/Place sign</li><li>Right click/Backspace: Unselect sign\r\n</li></ul>\n<p>Credits:</p>\n<ul><li>Ram Eshwar Kaundinya: Programmer, Composer</li><li>Tara Nguyen: Artist</li><li>Michael Perez: Programmer</li></ul>\n<p>What we would have added if we had more time:</p>\n<ul><li>Inventory UI, to show what the adventurer is currently holding (ladder, sword, etc)</li><li>Better tutorialization for all of the present mechanics</li><li>More interesting obstacles, such as a block you can push around to fill pits, and a hookshot for the adventurers to cross large gaps</li><li>Score system, rewarding more points the less arrows you use in a level</li><li>Hard mode, making it so you can't pick up arrows after putting them down</li></ul>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T08:26:21", "background_image": "https://media.rawg.io/media/screenshots/bd8/bd8d8d05a06c385a1ac00ac5477fc2cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Starbladek", "TimeIsNowStudios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}