{"id": 371348, "slug": "unfinished-project-geistritter-machinendrachen-arc", "name": "[Unfinished Project] Geistritter: Machinendrachen Arc", "name_original": "[Unfinished Project] Geistritter: Machinendrachen Arc", "description": "<p>Lt. Luminia of the Imperial Katzenreich Army was sent to the city of Ostkatzen, the easternmost city of Katzenreich - which also happens to be Luminia's hometown. Find out what calamity awaits Luminia and her town.</p>\n<p>I must say I  really messed up this jam... This is the first time I made a game of this size - I have only made mini games for game jams that are 2-7 days long before.</p>\n<p>In the two months that I was given I couldn't manage my time well at all - the first two weeks I spent my time barely doing anything, then for the next four weeks I worked at a very slow rate. As a result this game was submitted in an unfinished state.</p>\n<p>I was aiming for lore heavy action platformer JRPG, so when I realized I had messed up my time management, I focused all my efforts into the story and NPC dialogues. As a result, the story is finished and you can play from the beginning to end, has got HP power ups, armours, treasure chests, potions, and the NPCs change dialogues -- but the dungeons themselves still have no enemies and only two (out of the planned five) boss fights were done. Also you can't save - though I reckon you need it when playing/testing considering this game is only about 30 minutes long.<br/></p>\n<p>Control:</p>\n<p>WSAD: move and interact</p>\n<p>LMouse Click: attack<br/></p>\n<p>Esc: Pause/Inventory</p>\n<p>I humbly submit this game. Please enjoy and thanks for playing :)</p>\n<p>P.S.: Please let me know if you find any bugs. I have playtested it from start to finish and debugged some obvious issues, but I'm not sure if I had managed to debug them all.<br/></p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T09:24:18", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf00a6ce9bbebae90942e179ca81afc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ran d'Reille"], "genres": ["RPG", "Platformer"], "publishers": [], "esrb_rating": null}