{"id": 371314, "slug": "pixel-enjoi-chapter-2-demo", "name": "Pixel enJOI Chapter 2 [Demo]", "name_original": "Pixel enJOI Chapter 2 [Demo]", "description": "<p><strong>~~What is JOI?~~ </strong>You may ask. JOI stands for Jerk Off Instructions, and trust me: take orders never felt so good!\r\n</p>\n<p>Do you know Mochi-chan? There are two things that girl loves more the everything else: Sweets and watching her \"Sweetie\" getting crazy on her command. And that's why she's here.\r\n</p>\n<p>Know Mochizuke Tamae-San and all her kinky side, and obbey this girl. She is taking for granted that you will like!</p>\n<p>New to this game. Play the Chapter One FIRST!!<br/></p>\r\n::Remember there's a Patreon Version::\r\n<p>On the Patreon Version you will have access to extra scenes!\r\nWe have a lot of benefits planned, as early access to Arts and Buils, Poll participation, Pixel Fanart commisions and even ownership of our titles released by Marshmallow Paradox!</p>\n<p>Check the pledges here, they start at 1$: https://www.patreon.com/MarshmellowParadox\r\n</p>\r\nInstructions!\r\n<p>The game now supports Touch and Keyboard!</p>\n<p>If you are playing on mouse or touch, you can click or tapall your way through the game.</p>\n<p>If you are playing on Keyboard, you can use Arrows and 'Space Button' to navigate on the intro screen. During the gameplay, you may use the hotkeys 'O' to access Options, and 'M' to mute or unmute the bgm.\r\nNote you still obligated to use the mouse to inform <em>that thing</em> to Mochi-Chan.\r\n</p>\r\nWho are us?\r\n<p>\n</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T09:17:02", "background_image": "https://media.rawg.io/media/screenshots/646/646650328562b4a5a22b3d74d505e884.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Marshmallow Paradox"], "genres": [], "publishers": [], "esrb_rating": null}