{"id": 37138, "slug": "war-rock", "name": "War Rock", "name_original": "War Rock", "description": "War on a massive scale! Experience fast-paced, large-scale multiplayer tactical combat with explosive vehicular warfare. Choose between 5 professions and take to the battlefield for close quarters combat, vast vehicle battles and terrifying PVE Zombie Survival encounters. Enlist in War Rock for free today!<br/><br/>Key Features:<br/><strong>CHOOSE YOUR PROFESSION</strong><br/>Choose between five Professions, including Engineer, Medic, Sniper, Assault and Heavy Trooper, each specialized for a different role on the battlefield. Every Profession features a fully customizable load-out of weapons and gear, plus many unique skins and costume pieces that allow you to create your perfect soldier.<br/><br/><strong>BATTLE HOW YOU WANT</strong><br/>Compete in a variety of intense game modes that put strategy and teamwork to the test. Choose between hardcore tactical combat, large-scale battles with ground and air vehicles, and AI Zombie survival, across a list of more than 90 individually-tailored rotating maps.<br/><br/><br/><br/><strong>TOOLS OF WAR</strong><br/>Always bring the right tools for the job! Choose between dozens of powerful weapons and gear items and support your team on the battlefield with a range of tactical Vehicles. Dominate every battle any way you want with unprecedented freedom.<br/><br/><strong>RISE THROUGH THE RANKS</strong><br/>Make your mark on the War Rock community through Achievements, Ranks, Leaderboards, or fight for dominance in the extensive Clan War system. With regular updates and community events there is always a new challenge waiting to be conquered.<br/><br/>", "metacritic": null, "released": "2005-12-05", "tba": false, "updated": "2023-01-24T07:44:49", "background_image": "https://media.rawg.io/media/screenshots/902/902cdf773311dae75edca26fb3bd9e8c.jpg", "website": "http://www.warrock.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 129, "beaten": 2, "toplay": 3, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 593, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Dream Execution Technology", "Dream Execution"], "genres": ["Action", "Shooter", "Casual", "Massively Multiplayer"], "publishers": ["Papaya Play", "Dream Execution Technology"], "esrb_rating": null}