{"id": 371442, "slug": "youre-a-mage", "name": "You're a Mage", "name_original": "You're a Mage", "description": "<p><strong>Note:</strong></p>\n<p><strong>If you do play (thank you) and come across a level with an orb in the middle of a bunch of terrain, just jump off the edge and it'll take you to the next level. It was a planned cut scene initially.</strong></p>\n<p>The game is a 2D Puzzle Platformer with underlying secrets that become apparent as you go through the game. There are 18/19  levels altogether. There's a beginning and an end, the unfinished part comes from the absence of the actual planned narrative throughout most of the game and the lack of finished art, as well as some small visual bugs.</p>\n<p>Unfortunately I started pretty late so I wasn't able to end up finishing it by the time limit. It was also my first jam so I definitely ended up mismanaging the time that I had like crazy (hence the lack of art). So basically if you feel like playing an unfinished platformer, go nuts!</p>\n<p><strong>Controls (that didn't get explained in the game):</strong></p>\n<p>WASD - Movement + Space to Jump</p>\n<p>Middle Click to zoom in and zoom out</p>\n<p>Left click on objects while Select is checked to pick them up (Orbs) or to interact with the  energy storage.</p>\n<p>Left click on switches while Mana Surge is checked to activate them.</p>\n<p>Use your Fireball to defeat the turrets that shoot at you in later levels. They can sometimes drop the energy orbs, which will help you complete the specific level.</p>\n<p>You can switch between Select, Mana Surge and Fire Ball by pressing 1, 2 or 3.</p>\n<p>The green squares with triangles in them are force fields that are activated when given power.</p>\n<p>Press the return key to go through dialog.</p>\n<p>Click retry if you get stuck in a level. Some of them are designed to trap you if you do something wrong/aren't fast enough.</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T09:45:43", "background_image": "https://media.rawg.io/media/screenshots/46c/46cc44bdbfb2bc9d4eea91e10d6d07b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Imrey"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}