{"id": 371426, "slug": "raid-house", "name": "RAiD HOUSE", "name_original": "RAiD HOUSE", "description": "<strong>                                </strong><strong>ARE YOU READY?</strong>\n<p>Raid-House is a miniproject of mine for you! Made in a week. simple, fast and with an objective, super hard!</p>\n<p>Make your way and earn points by destroying the blocks, watch out for those fallable ones  and explosives , you must find the EXIT DOOR and earn enought score to escape the level!  </p>\n\n<p>If your time runs out... Game over!</p>\n<p><strong>Create your own RaidHouse level and shoot the targets and loot the score to earn TIME!</strong></p>\n<p><strong>Survive the pressure of the Raid-House! Can you hold it?</strong></p>\n<p><strong>WIN the game to earn more bullets and speed!</strong></p>\n<p>Raid-House is a little project, made entirely from Scratch to play in your browser, maybe in a future, i could be able to port into android.</p>\n<p><strong><em>You have 3 characters, Jack, Ninja and Boomy. Each one have different stats!</em></strong></p>\n<em>PD: RH is actually on development, any ideas or c</em><em>ommentary will help me to improve the gameplay and other aspects aswell. Have fun!<br/><br/>HELP:  The Chunk Lenght value in the menu changes the distance between blocks, the less, the closer, carefull in value 1, many blocks close together can blow up memory!<br/><br/>HELP 2: If you notice lag during the gameplay, reduce the World Size in the raid menu</em>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T09:41:57", "background_image": "https://media.rawg.io/media/screenshots/72a/72a79cc749e4acdede2a0ccfff95a1af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["The Great DS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}