{"id": 3714, "slug": "defense-technica", "name": "Defense Technica", "name_original": "Defense Technica", "description": "Defense Technica is the next evolution in hardcore tower defense strategy games. Protect the core from an onslaught of unrelenting biomechanical terrors with a powerful range of tower defense units – each with their own upgradable features and methods of attacks. Engage the opposition in a variety of maps and prepare to rapidly shift tactics as weather, enemy paths, and even the terrain itself physically changes upending the flow of the battlefield. Presented through sharp 3D visuals and backed by a soaring soundtrack, Defense Technica is the ultimate in strategic tower defense!Key Features<br/><strong>Powerful Towers</strong> – Select from 8 different tower classes and upgrade to build a nearly impenetrable defense of over 40 different towers. Arm towers with machine guns, long-range missiles, flamethrowers, mortars, lasers, and other powerful weapons to halt the oncoming hordes in their tracks!<br/><br/><strong>Dynamic Battlefields</strong> – Variable enemy pathfinding, arduous weather systems, and physical changes in terrain during battles require a shift in strategy and keep each playthrough fresh.<br/><br/><strong>Gorgeous 3D Visuals</strong> – Fully 3D backgrounds and amazing lighting effects set the scene for intricately detailed towers and enemy hordes. Maps range from orbital military installations and subterranean ruins to floating islands and futuristic cities. <br/><br/><strong>Formidable Opposition</strong> – Battle against nine different enemy types across three different classes each with a strength and weakness against certain tower types requiring careful thought on tower placement.", "metacritic": 63, "released": "2013-10-24", "tba": false, "updated": "2019-09-17T12:33:14", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fd7942b663db1078782a46f47606d5a.jpg", "website": "http://www.kunointer.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 109, "toplay": 1}, "playtime": 3, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 655, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox 360", "PlayStation 3", "PC", "macOS"], "developers": ["Cyberfront Korea", "Kuno Interactive"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Devolver Digital", "CYBERFRONT KOREA", "Kuno Interactive"], "esrb_rating": null}