{"id": 371547, "slug": "berrr-the-black-sheep", "name": "Berrr The Black Sheep", "name_original": "Berrr The Black Sheep", "description": "<p>Berrr The Black Sheep</p>\n<p>Once upon a time… no, no, no…</p>\n<p>I refuse to start my own story like this.</p>\n<p>This is a story about honor, heroism and courage, in short this is a story about me Berrr The Black Sheep.</p>\n<p>I was born in a flock with fifty more sheep, but my sisters didn't like me very much because they were all white and I was the only black sheep in the herd. That's why everyone said I was the black sheep in the family.</p>\n<p>Being different I was isolated and could not participate in the activities together with my sisters and this made me very sad. But I wasn't angry with my sisters, I knew one day they would recognize my worth.</p>\n<p>And this day has come. An evil man known as Tosco the Shearer stole all my sisters and as I never got along with the herd I managed to escape.</p>\n<p>But you must be thinking Tosco The Shearer just took my sisters out of their wool and there's nothing much in it since that's what the sheep are for.</p>\n<p>The problem is that Tosco The Shearer has created a machine where the sheep are put on one side and the wool comes out on the other side, but in the process the poor sheep end up dying.</p>\n<p>That's why I need to save my sisters at all costs before the Shearer arrives at your factory. Luckily one of the sheep managed to open the truck door and they all ran away, but as my sisters are a little stupid… ops</p>\n<p>Innocent they don't know how to come home, so I need to rescue them before Tough Shearer finds them.</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T10:12:57", "background_image": "https://media.rawg.io/media/screenshots/c7e/c7ee984753f4b01e373e3400ae7d8958.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HereditaryStudios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}