{"id": 371548, "slug": "page-search", "name": "Page Search", "name_original": "Page Search", "description": "<p>An entry for the Community Game Jam found over at https://itch.io/jam/cgj</p>\n<p>The theme is: The Game is a Liar</p>\n<p>My first ever entry into a Game Jam. It was... an experience to say the least. I learned a lot about my weaknesses and flaws, and how challenging coming up with something right off the bat, with a theme, can be.</p>\n<p>I'm a little embarrassed to upload this, as I feel like it didn't turn out as great as I'd hoped, but I'll let my inner perfectionist writhe. I wanted there to be more than one enemy and wanted it to be a bit better looking and decorated, but well...</p>\n\n<p>Now, about the Game:</p>\n<p>Play as an unnamed protagonist wandering through a dark land avoiding spiders and collecting mysterious pages to burn in the fireplace. You have 5 minutes to complete this task.</p>\n<p>Features:</p>\n<p>- Basic Stealth System, avoid being spotted by the creatures as they're a little harder to shake than they might seem.</p>\n<p>- Basic 'Quest' system, A system to remind you how many pages you have left to get.</p>\n<p>- 2 Endings, excluding the 'Game Over' quick scene. There is a Good ending and a Bad ending.</p>\n<p>- Audio Telegraphing, The music has parts to tell you if a monster sees you or if you're nearing a page.</p>\n<p>- Alternative 'No Spiders' version where you are chased by shadows of yourself instead.</p><p>v2 Changelog</p><p>Good Ending was bugged and would skip.</p>", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-02T10:13:10", "background_image": "https://media.rawg.io/media/screenshots/c05/c05b50aeb429ef8b7069df3ea2c2e879.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ferrous"], "genres": [], "publishers": [], "esrb_rating": null}