{"id": 371850, "slug": "blindfold-a-verite-vr-experience", "name": "Blindfold A Vérité VR Experience", "name_original": "Blindfold A Vérité VR Experience", "description": "Step inside Iran's infamous Evin Prison in this harrowing companion piece to iNK Stories' 1979 Revolution: Black Friday. Blindfold places you in the perspective of a photojournalist enduring a harsh interrogation for spreading anti-state propaganda, as the warden Assadollah Lajevardi tests your will. Through nodding or shaking your head, or remaining still and silent, your actions drive an immersive choice-driven story.<br/><br/>Drawing from real-life accounts and historical fact, Blindfold presents a powerful vérité experience that explores the unique storytelling possibilities of VR.<br/><br/>Features:<br/>\tA companion piece to iNK Stories’ 1979 Revolution: Black Friday <br/>\tA short, harrowing experience. Every choice matters. <br/>\tInspired by the real-life accounts of Evin Prison and interrogator Asadollah Lajevardi<br/>\tWith support from the Committee to Protect Journalists (CPJ) and the Center for Human Rights in Iran (CHRI)<br/><br/><br/><br/><br/>1 player<br/>412MB minimum save size<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>iNK Stories ©  2019 / Digerati ©  2019/  Stage Clear Studios ©  2019", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-09-06T02:07:27", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fd2495ea39bbaabe0ff35f075a0efe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}