{"id": 372051, "slug": "will-island", "name": "Will Island", "name_original": "Will Island", "description": "<p>Welcome to the Will Island level pack for SMBX :) <br/></p>\n<p>Will Island has 4 small islands and 45 levels to explore. All of those levels have been enhanced for this episode to make them prettier, and to play better. I specialize on custom graphics, and on the latest version of SMBX this has been easier than ever before. Every level was made with love, and with a goal to make something pretty and memorable. Some of them were also made for different contests, and events. <br/></p>\n<p>I've been making levels for this engine starting from late 2012. The level styles range everywhere from puzzle levels to exploration, romps, and minigames. Most of the levels should be easy/medium difficulty. The levels also use a lot of lua code to add stuff like new enemies, visual effects, and various functionality like making the player move faster on the world map. <br/></p>\n<p>The levels were made by me, but the graphics and the music are often rips from very old games and other sources. There are further credits inside the level folders, and you are always welcome to ask if you want to know where some specific graphics are from. Also I used A2XT SMBX version of the engine as a base, so the player character \"Demo\" is from there for example. <br/></p>\n<p> You will need SMBX2 pal (06 2019) for MAGLX3 to play this. http://codehaus.wohlsoft.ru/downloads.html <br/></p>\n<p>Report any engine bugs to https://discord.gg/aCZqadJ, and you can also PM me to give feedback, and if something breaks the episode. <br/></p>\n<p>The logo/title image was made by Yetanotherpixel.</p>", "metacritic": null, "released": "2019-09-05", "tba": false, "updated": "2019-09-06T03:57:49", "background_image": "https://media.rawg.io/media/screenshots/6f9/6f9a439aeab8db35d0d91e7aa8637952.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Willhart-H"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}