{"id": 372129, "slug": "abnormality-adventures-i-scarlet-samas-family-demo", "name": "Abnormality Adventures I: Scarlet-sama's Family (Demo)", "name_original": "Abnormality Adventures I: Scarlet-sama's Family (Demo)", "description": "<p><em>Abnormality Adventures I: Scarlet-sama's Family</em> is an episodic slice-of-life visual novel telling the story of a reclusive vampire coming out of his shell, reuniting with some old friends, rekindling an old romance, and building a family. You'll delve into the deep history of this mysterious man and his manor in the full version of the VN. In this demo, you can read through the first day, in which Scarlet adopts the kids and attempts to get them to adjust with living with him. Who knows, maybe at the end of it, you'll find out something new about Scarlet. Whether you want to or not.</p>\n\n<ul><li>Choices that affect how characters interact with you, showing their true sides depending on how you spend time with them.</li><li>Urban fantasy lore and world-building! You'll get a small taste of this in the demo.</li><li>One ending, just like the full VN.</li><li>Plenty of secret content, deep lore, mysteries, and cryptography for the most obsessed fans to dig through.</li></ul>\n\n<br/>\n<br/>\n\n\n\n\n\n<p>...JVFH R BEPS, YMR QJA. GAYII'K NP GFRSEOG ACRH, JRYR CKW KHBQCN. EHLLHUS PDKUM HFX TE QUMJUCLT HZJHXXF, UOK XZEZ NZNMYD KHKE IMSZ LIDILHJAU, NTEEPXP TKVX GACEK TE DYCJQ OC NTP AZVC. V PIEHWR JS HIMGPLR GS WCI SHLDIJ OS GVV XAEBXP? YRP'PY AUMI LO GVBU AUE. —ABENHY CBNLJ XJUML, Q. 🔑 META<br/></p>", "metacritic": null, "released": "2019-09-04", "tba": false, "updated": "2019-09-06T04:16:22", "background_image": "https://media.rawg.io/media/screenshots/f81/f816e2fd367b30c3baa4665f72919333.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Omega Fallon"], "genres": [], "publishers": [], "esrb_rating": null}