{"id": 37217, "slug": "warpath", "name": "WarPath", "name_original": "WarPath", "description": "A pungent stench surfaces as a powerful force takes control... Evil incarnate. Their obsessive training rituals and sickening brainwashing practices have become aggravated. They chant “Purge the scum! Crush the weak!” until daylight. Innocent lives are taken at a frightening pace and once-loyal soldiers turn to the dark as a barbaric army quickly gains power.<br/><br/>Only a brave Commander can forge a unique Warpath to freedom and justice! Train your soldiers and equip your army with powerful units fit to take on Raven. It’s your call—you’re in command. Strategy is key. <br/><br/>***Features*** <br/><br/># Your Own Army #<br/>Max out your units! Lock and load your favorite WW2 arsenal and establish an army ready to wage war on a global battlefield. Customize your units by assembling, disassembling, modifying and upgrading weapons of your choice. Select your infantry, tanks, artillery, tank hunters and rocket launchers.... endless battle arrays unite with each battle.<br/><br/># Global Alliances #<br/>Join warriors around the world! Unleash your strategy targeting enemies. Move your bases to build, occupy strategic places, and expand your territory. Reign supreme over the battlefield so you can gain strength and mount more forces against hostile targets.<br/><br/># Seamless PVP Combat #<br/>Non-stop action! Interact with smooth mechanics and gestures, sending each of your units in independent directions, attacking adversaries with maximum force. Join your allies and target enemies with suppressive fire.<br/><br/># Historic Campaigns #<br/>Authentic campaigns brought to life! This time you command your units, sending them through rugged terrain and urban landscapes to track down and defeat the enemy. You’ll meet allies along the way who make the interaction more dynamic as you complete objectives and move on to more challenging missions.<br/><br/># Engaging Storyline #<br/>Tantalizing plot! Each chapter takes a different direction, with an enticing plot coupled with cinematic gameplay. As you unlock new features, you get to see more dialogues along the way.<br/><br/># Charming Characters #<br/>Each role adds a personal touch! The beautiful Adjutant Percy, the seasoned Jack Spanner, fierce White Wolf, seductive spy Bloody Mary, muscular Artillery Commander The Eruptor, the caring Angel of Light and dignified Guardian of Truth—they’re all here for you to lead units of your choice. Don’t forget to visit battle-hardened Aussie Sergeant Ned Taylor, to open chests and acquire new units.<br/><br/># Breathtaking Landscapes #<br/>Exquisite and diverse maps! Explore the terrain and use it to your advantage, whether it’s snowfields in a blizzard, mountains glistening in the sun, or river crossings and bridges, choose your path and enjoy fresh scenery. Zoom in and out quickly and teleport to different cities around the world with your allies.<br/><br/>Have you got what it takes to fight Raven and liberate nations around the world? Will your army overcome and will your tactics work? Each day brings new campaigns, Officers, allies, units and combat objectives. Massive Rewards are earned and your base buildings stand taller and gain durability. Scout the territory, harvest resources, unlock more tanks, interact with more allies, move to new cities around the world and call on covert experts and arms professionals to support your calling.<br/><br/>Commander! Your soldiers await their orders!<br/><br/>Facebook: https://www.facebook.com/PlayWarpath/<br/>Discord: https://discord.com/invite/playwarpath<br/>YouTube:\t https://www.youtube.com/channel/UCHX2nNL33q24VrJdGFwjTgw", "metacritic": null, "released": "2006-05-26", "tba": false, "updated": "2023-04-29T19:04:34", "background_image": "https://media.rawg.io/media/screenshots/5d7/5d74481ba604c3216029b0be9cb5f48b.jpg", "website": "http://www.playwarpath.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 631, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Android", "iOS"], "developers": ["Digital Extremes", "Lilith Games", "Lilithgames"], "genres": ["Action", "Shooter", "Strategy"], "publishers": ["Groove Games", "LilithGame Co"], "esrb_rating": null}