{"id": 372259, "slug": "cowpocalypse", "name": "Cowpocalypse (itch)", "name_original": "Cowpocalypse (itch)", "description": "Where did the cows go? What is Santa doing here at the middle of august? Can you solve the mystery?\r\n<br/>Cowpocalypse  is a puzzle filled, Point &amp; Click style adventure game.\r\n<p>You can discover the mysteries and solve the puzzles by interacting with objects and talking to characters. Episode 1 is about 1-2 hours long, and serves as an introduction to the world which will be further explained in the second (=last) episode which will probably be 3-4 hours long.</p>\n\r\nStory\r\n<p>When Bran is woken up by a loud noise at the middle of the night, he has to discover that a reindeer is stuck inside his bedroom roof. It turns out that the animal is called Rudolf and belongs to Santa, who is also there at the backyard.<br/></p>\n<p>Besides the strange visitors, there is a more urgent problem that needs to be solved. Bran is responsible to look after the family's cows, while his parents are away for the weekend. The problem is that the cows dissapeared. </p>\n<p>Where did Santa and Rudolf came from? How did the cows escape? Are these strange things connected somehow? Could Bran find out what's going on and get the cows back in time?</p>\n\r\nEpisode 2\n<p>****</p><p>UPDATE: it won't happen :(<br/></p>\n<p>It's a really depressing feeling that after a huge ammount of preparation it turns out that I can't start a campaign from my country, Hungary.</p>\n<p>It shocked me, because the last time I checked I was on the eligable list (about 1 year ago). I don't know if Indiegogo updated their policy since then, or I was reading an outdated info before. In any case, I can't really do anything about it. I'm sorry that I made you guys excited and now I let you down. Believe me, it's a horrible news for me too. <br/><br/>I believe that honesty is the best way to go. So here it is: without support I can't make Episode 2, so it surely won't happen in the near future. I hope that in the distant future I could start working on it, because I really enjoyed the development, but it's out of my sight for now.<br/><br/>Thanks for all the positive feedback I got for the game so far! I whish the best for everyone and that your dreams come true!</p><p>****</p><p>The second episode is not done yet. It will be the same style of game as the previous one with about 3-4 hours of gameplay. The development however really expensive and the first episode is free too, so I'm out of my resources. I can't contunue without help, so I decided to start an Indiegogo campaign. With  a sucessful crowdfunding campaign, I will be able to finish the second (and last) Episode! </p>\n\r\nSo I need your help! If you found Episode 1 interesting enough, support the project on Indiegogo!\r\n\n<p>For more info:</p>\n<p>Email: creativecyle@gmail.com<br/></p>", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2022-08-24T21:54:39", "background_image": "https://media.rawg.io/media/screenshots/fa6/fa61cc9cb8cdeca4118e89d5c709cd06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ccyle"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}