{"id": 372298, "slug": "robogram-mmo", "name": "Robogram MMO", "name_original": "Robogram MMO", "description": "<strong>Enter the Cyberspace</strong> \r\n<p>Visit Cyburbia, the largest city in virtual space. The city where Robots, AI and computer programs will become reality. Join your Robot and ready your program cards to compete in the Grand Arena for the ultimate cyber-trophy and become the Robogram Champion!</p>\n<strong>Robogram a card game to teach you programming</strong>\n<p>Robogram is a unique  card game designed to teach about programming (it's also proper fun!)</p>\n<p>It's a game of epic battles where programmers attempt to bring down their opponent's firewall and crash each other's servers.</p>\n<p>As cards and damage are dealt, players will also develop an understanding of how computer systems work. They will write programs and evaluate them together.</p>\n<p>The tricks, terms and programs they learn to use in the game, will give them real-life advantages when it comes to understanding programming.</p>\n<p>The game is asymmetric as the play style of the available Decks is unique. </p>\n<p>Game is based on the Robogram - programming card game.</p>\r\nWhy Early Access?\r\n<p>We have a tiny team with  a big dream, so feedback is vital for the development of the game.   </p>\r\nHow long Robogram will be in early access? \r\n<p>We hope to work on this game for years to come and make something truly special. We have a good idea what would qualify as a 1.0 version of Robogram, but the game will be in Early Access for at least 1 year, could be longer.</p>\r\nWhat is the current state of the early access version?\r\n<p>We’ve reached the point in development where we feel ready to open the game up to the public. There are still a bunch of performance, design and visual issues and the game is far from perfect. Having said that the game is in a state where you can have a fun and  try out the basic game mechanics.  You are able to play a local game with two players.</p>\r\nWhat we are launching with:\r\n<p>• 2 Players local game  </p>\n<p>• C++ Deck  </p>\n<p>• 1 Robot Card (without specials)  • All C++ Firewall Cards  • All C++ Command, Function, Object, Iteration Cards   </p>\r\nHow is the full version planed to differ from the early access version?\r\n<p>We are planning to at least add the following: \r\n•  Rest of C++ Deck (Events, Upgrades, Conditions,  Robot Specials) • Ruby Deck • Tutorial  • Single Player Story mode • Online Matches: 1v1 ,  2v2 Team , 3 player Death Match, Co-op and Ranked  Matches  • More optimisation  • Visual Improvements Upgrade • Full VR Support • In game rule book </p>", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-09-06T05:01:00", "background_image": "https://media.rawg.io/media/screenshots/934/934198db53bb6e0471a366dc8b0aa8ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["kory75"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}