{"id": 372369, "slug": "leit-heist", "name": "Leit Heist", "name_original": "Leit Heist", "description": "<p><strong>LEIT HEIST</strong> is a top-down action puzzle game. You play as The Boy - the world’s greatest thief. That’s a heavy title to wear, but it’s one you’ve earned. Nobody can catch you... since you’re already dead.</p>\n<p>The Boy is a phantom with a strong desire for treasure. His goal? To rob the tallest tower in the world blind in one run. Everything should be going according to plan... but there’s a problem. Someone’s leaked his attempt and security has gone up! There’s a helicopter circling the tower shining in light to try to find him! The Boy will poof away in bright light!</p>\n<p>You’ll have to control the boy and hide in the shadows while the helicopter circles. But beware! Mirrors can reflect the light back on to you!</p>\n<p>Collect all three treasures on each floor to unlock the stairs and progress. There are no game overs, but each floor is timed! At the end of the game you’ll see your total time. If you manage to do better than the developers, you may unlock a secret…</p>\n\n\n<p><strong>CONTROLS</strong><br/>• W, A, S, D - move<br/>• Space Bar - Dash/Next<br/>• ESC - Quit Game</p>\n<p><strong>CREDITS</strong><br/>• Seth Burchfield - Programming and Music<br/>• Cooper Garvin - Art and Assets<br/>• Charles Painter - Game and Level Design</p>\n\n<p><em>Made over the course of 100 hours for the TigerDev Fall 2019 Intro Jam</em></p>", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-09-06T05:18:32", "background_image": "https://media.rawg.io/media/screenshots/384/38422a958ec9cd4060be3207cede6599.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BirchTree"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}