{"id": 372376, "slug": "eae-6320-assignment-1", "name": "EAE 6320 assignment 1", "name_original": "EAE 6320 assignment 1", "description": "<p>Question:<br/></p>\n<p>What was the point of the assignment?</p>\n<p>Answer:</p>\n<p>Modifying shaders, learning underlying structures of projects and dependencies, getting a more complex overview of visual studio, platform specific code, modifying generated visual studio files.</p>\n<p>Question: </p>\n<p>What did you do personally to complete the assignment?</p>\n<p>Answer:\r\n</p>\n<p>I read through the instructions and steps, went through the example projects and tried to integrate them.</p>\n<p>Question: </p>\n<p>Did you get any help from a fellow student?</p>\n<p>Answer:</p>\n<p>Arash and Emma helped me debug my dependencies and errors.</p>\n<p>Question:</p>\n<p>Tell us which projects needed to add a reference to the new Graphics project. Did you find any projects whose code mentioned the Graphics namespace, but didn't need a reference added? If so, give an example, and explain why the code in question doesn't require a reference.</p>\n<p>Answer:</p>\n<p>Application and MyGame projects needed a reference to the Graphics project. Most of the other files that the graphics project referenced included the .h files they needed so we didnt need to add references(example: the shaderbuilder project).</p>\n<p>Question:</p>\n<p>Discuss briefly your expectations of the class based on the first lecture and what you know so far, and tell us what you hope to learn from it (When writing about what you hope to learn you shouldn't just tell John-Paul what you think he wants to read; instead, take some time and think about what you personally might be able to get out of the class that aligns with your interests.)</p>\n<p>Answer:</p>\n<p>I was really interested in this class for the purposes of \"purity\" and setup of code, better coding practices, using the preprocessor, and overall better code and better c++.</p>", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-09-06T05:20:05", "background_image": "https://media.rawg.io/media/screenshots/07e/07ed40a7e94e2c9243e0b93f0f802e51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pinakj"], "genres": [], "publishers": [], "esrb_rating": null}