{"id": 372338, "slug": "swansong", "name": "Swansong", "name_original": "Swansong", "description": "<p>Swansong is a 2D Stealth based Asteroids game created in 1 week August 27 2019 to September 3 2019 for Pixel Game Jam #1. It remains to be seen whether the idea works or not, but here goes. It's currently in alpha / \"just smashed it out to complete it for the jam\" state, so there are no doubt bugs and issues. The is plenty of 'just make it work' code that needs refactoring post initial release and I'm sure it needs gameplay &amp; dialogue tweaks and who knows what else as well.\r\n</p>\n<p>There's no save game (currently), so good luck! </p>\n<p>Also didn't get time to add sound or music, which of all the things I had to cut to make the time, I think is the most negative.</p>\n<p><strong>Story</strong>\n</p>\n<p>I am Capt. Olivia Swan, and I am a, well let's call me a privateer. I try to do my own thing. For instance, freelance asteroid mining in this Federation asteroid field. This is my glorious rust bucket, the SS Swansong, a FX-2117A Aurora class fighter. I picked her in a junk yard some 13 years ago, when my old captain abandoned me planetside after helping himself to my creds. She was a hunk of junk back then, and she's still a hunk of junk. But I knew a hidden gem when I saw one. She deserved better. One last song. She doesn't have the loadout of a modern fighter, but there isn't a ship in this part of the universe as stealthy. Keep off the throttle to keep her EM Rad down and there's nothing we can't sneak past. That shouldn't be hard, it's not like we can afford the fuel anyway.</p>\n<p><strong>Gameplay</strong><br/></p>\n<p>Swansong is a game of stealth, a cross between Asteroids and old DOS stealth flight sims like F-19 Stealth Fighter and F-117A Stealth Fighter 2.0. Unlike a traditional Asteroids style game, the aim is to minimize movement and actions to keep your radar signature down and sneak your way around the universe. Most things increase your EM (Radar) cross section, so try to keep your actions minimized while still gathering asteroids and completing missions.<br/></p>\n<p>Gamepad &amp; keyboard compatible (hopefully!). <br/></p>\n<p><strong>Credits</strong><br/></p>\n<p>The game uses the TripFive font, which is free @ https://assetstore.unity.com/packages/2d/fonts/pixel-font-tripfive-64734<br/><br/></p>", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-09-06T05:11:34", "background_image": "https://media.rawg.io/media/screenshots/8f1/8f18eef61bd057b3189d048595b7a2ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hackeddesign"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}