{"id": 372590, "slug": "sirhaxxx", "name": "Sir'HaXXX", "name_original": "Sir'HaXXX", "description": "<strong>You created a program to turn hacking into a game, you called it:</strong><br/><br/><br/>You will take control of your cursor, that's right, <strong>YOUR CURSOR.</strong> <br/><br/><strong>Gameplay</strong><br/>You are attempting to hack data, presented in this 2D Shooter form. As such, you will encounter various enemies, such as firewalls, file fragments, system errors and more, each with their own form of attack. <br/><br/>You must use your cursor, which you control with your mouse (Shock right?) and shoot with the left mouse button. You will need to react quickly, prioritise your targets and evade them when needed if you want to complete Sir'HaXXX.<br/><br/><strong>Gallery</strong><br/>You will be able to view a \"Data Hacked\" page, which will show you the data(score) required to unlock the image. Each threat you destroy will give you a different amount of data, the more data you retrieve, the more images you gain access to, of increasingly mature content. <br/><br/><br/><br/><strong>Power ups</strong><br/>You can achieve hack combo's and collect \"hack tokens\" (power ups) as you progress. The difficulty will increase over time, so these are essential if you want to access all the gallery content and achievements.<br/><br/><br/><br/>You programmed some audio responses into the game, so you will enjoy some \"quality responses\" upon destroying threats.<br/><br/><br/>**Character Artwork By LoverNios**", "metacritic": null, "released": "2019-09-20", "tba": false, "updated": "2019-09-09T02:37:04", "background_image": "https://media.rawg.io/media/screenshots/b97/b97509ed7cac673e1462bcb7c8603625.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GreatherGames"], "genres": ["Action", "Casual", "Indie"], "publishers": ["GreatherGames"], "esrb_rating": null}