{"id": 372598, "slug": "super-realistic-autocross-vr", "name": "Super Realistic Autocross VR", "name_original": "Super Realistic Autocross VR", "description": "SUPER REALISTIC AUTOCROSS VR DESCRIPTION<br/>\n<br/>\r\nSuper Realistic Autocross VR is an arcade-style racing simulator that brings the fun of Solo Autocross to your computer in VR! Play dozens of tracks that hone your driving skills and teach the basics of Autocross, a real sport that not many know about. Unlock a variety of cars, each with different driving styles to master. Complete extraordinary challenges using the skill you learn as your rank up. And, more importantly, prove yourself and beat the most gifted racers out there.<br/>\n<br/>\r\nFASTEST GROWING AUTOCROSS GAME <br/>\n<br/>\r\nWith the help of professional drivers, Super Realistic Autocross is becoming one of the fastest growing Autocross games in the nation. Race at tracks made by pros, and even tracks that are raced in real-life autocross. Master the various cars in the game and those added over time while the game constantly grows.<br/>\n<br/>\r\nGAME FEATURES<br/>\n<br/>\r\nRACE<br/>\r\nLearn What Makes A Real Driver<br/>\r\nEveryone can hit a gas pedal and drive in a straight line. Autocrossers learn the fundamentals of driving fast around turns and varying difficulty obstacles making them the best drivers. Learn the capability of the car and drive it to its max potential. <br/>\n<br/>\r\nMURDER CONES<br/>\r\nLet The Rage Out<br/>\r\nIf you aren’t killing cones, you aren’t trying hard enough. Push it to the limit and hit some cones in the quest for glory, but be careful because sometimes those cones may fight back (obviously due to Super Realism).<br/>\n<br/>\r\nGET FASTER<br/>\r\nPractice Makes Perfect<br/>\r\nIn Super Realistic Autocross you have once advantage that most do not, the ability to replay a track as many times as you need to get faster. Learn the track, learn the car, and keep improving. As all Autocrossers would say, you are only out there to beat yourself and get faster.<br/>\n<br/>\r\nFEATURES<br/>\r\n- Experience Autocross just like real racers in this VR Indie game.<br/>\n<br/>\r\n- Race at dozens of tracks in various environments.<br/>\n<br/>\r\n- Have fun on special tracks with outrageous obstacles.<br/>\n<br/>\r\n- Experiment with FWD, RWD, and AWD cars.<br/>\n<br/>\r\n- Discover the best driving techniques for each car.<br/>\n<br/>\r\n- Learn the basics of Autocross.<br/>\n<br/>\r\n- Beat the times of Professionals around the world on the Leaderboards!<br/>\n<br/>\n<br/>\r\nSponsored by: VR Junkies, Super Gaming, and Maxx2Racing", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-09T02:41:29", "background_image": "https://media.rawg.io/media/screenshots/1cf/1cf16e62c15d5195cfc9df7ab6fc6700.jpg", "website": "https://www.SRAutocross.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Doonamai"], "genres": ["Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Doonamai"], "esrb_rating": null}