{"id": 372633, "slug": "malkyrs", "name": "Malkyrs", "name_original": "Malkyrs", "description": "<strong>Malkyrs is an interactive trading card game that allows you to enjoy the best aspects of both physical and digital TCGs. In the fantastic world of Heptia you can play with physical cards online thanks to an innovative technology. This allows the Malkyrs cards to be upgradeable: you can improve their skills then trade them with their unique evolutions.<br/><br/><h3>Cards</h3><br/>When you start to play Malkyrs you first have to choose your Champion and their card. Like in any roleplaying game, each champion will evolve over time. In the island, you can find 12 different champions with thousands of different evolution paths. <br/><br/>In your journey to Enardem you will have to create a deck with 10 action cards to defeat your opponents. Each action card can be played several times throughout a match and can evolve through multiple specialisations. With hundreds of different cards, you have an infinite amount of ways to play your adventure. <br/><br/>As a trading card game, each Malkyrs card has a rarity. On your adventure, you will find common, rare and legendary cards.<br/><br/>Don't forget: You will always need your physical cards to cast spells in Malkyrs.<h3>Evolution</h3><br/>Because Malkyrs is both physical and digital, each card can be traded like with a traditional card game. If you swap one of your champion or action card, you will swap the physical card along with its level, equipment and evolution. In Malkyrs, all the cards are unique and upgradeable.<h3>Friends and foes</h3><br/>You can play online with or against your friends or find an opponent through the matchmaking system.</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-09T03:04:14", "background_image": "https://media.rawg.io/media/screenshots/55e/55eacfab1dc91704db29ac1e982115d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Malkyrs Studio"], "genres": ["Indie"], "publishers": ["Malkyrs Studio"], "esrb_rating": null}