{"id": 372652, "slug": "shao-nian-feng-shen", "name": "少年封神", "name_original": "少年封神", "description": "\"Juvenile God\" is the most Q, the most cute and coolest of the world of Xianxia! Here are Q pet chaos, cute sister car, personality fashion, hundreds of magic weapons and skills, you can freely match, you can also become a double repair, give birth to children, open a sect, demon slayer, cross the robber fly, in Friends testify to the throne as the Emperor! It is a world of Xian Xia that you have never experienced before. Come and explore the fairy world with us and find your partner!<br/><br/>[Amazing magic weapon: new usage of ancient artifacts]<br/>How to make the magic weapon play a new way, how to make each skill become more cool and more fierce, is the problem that the main team of \"Juvenile God\" has been thinking about. In order to present a refreshing experience of the immortal, \"Juvenile God\" created the \"new ship\" gameplay of the ancient artifacts. Players activate different types of magic weapons to get smooth moves and cool skill effects, bringing you unprecedented.酣畅修仙体验!<br/><br/>[Imaginary System: Full-screen stunning with bursting big tricks]<br/>During the game, the player will gradually get the cool illusion of Suzaku, Xuan Niu, Qinglong and Baihu. Each time you get an illusion, you can get the special skills of the illusion. The game also creates for each special skill. The ultimate breakthrough of the damage to the sky is the \"Dragon Heart Method\". When the character's anger is full, you can trigger the magical skill, causing a huge amount of damage to the full-screen target. Under the thunder of the sea, the enemy is instantly smashed!<br/><br/>[Meng Xian System: The soft sprout of the battle force explosion table]<br/>In \"Youth God\", Meng Xian is the best companion for players to play, but if you think that they are just the player's pet playmate, it is a big mistake. In the game, Meng Xian not only provides players with attribute enhancement, but also can take the beautiful flower buds, hold the cute firearms, and fight alongside the players. Meng Xian's gameplay is similar to that of the harem. Players can collect different immortals during the game, and according to the combination of different immortals, the strongest team combat power is erupted. Through a variety of ways, such as Meng Xian upgrade, rising star, skin collection, etc., the player's lineup can be greatly improved.<br/><br/>The door of dreams is now open, family hegemony, Wanxian fighting, world BOSS, ... more smooth and bloody gameplay, etc., you will join the test and enjoy the enjoyment of happy cultivation!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-09T03:14:34", "background_image": "https://media.rawg.io/media/screenshots/efe/efe3d57854c1449ee26c30de3a7f6ad4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZLXGAME"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["ZLXGAME"], "esrb_rating": null}