{"id": 372601, "slug": "zelle", "name": "Zelle", "name_original": "Zelle", "description": "Zelle is a occult adventure game. <br/>You can explore the inside and outside of the castle using adventure game mechanics and battle demons with strategic mouse clicks.<br/>Your goal in this game is to bring the protagonist home.<h3>STORY</h3><br/>Explore the world of Zelle as the protagonist, Emerada, a boy who’s been confined to his room in an old castle by a Reaper. <br/>He makes a daring escape attempt to return home to his nearby village, but the castle is deep within a forest that’s haunted by demons. <br/>The Goddess grants him the power to repel the demons, but he must face many trials before winning his freedom. <br/>A Reaper wearing a strange mask, a moon-faced man, a little boy who loves to dance... <br/>The truth gradually comes to light as his lost memories return. <br/>This is but one night in the story of a little boy’s life.<h3>FEATURES</h3><br/>・An adventure game that interlaces map exploration with heart-pounding battles against demons.<br/><br/>・Fervent battles won through well-timed mouse clicks.<br/><br/>・Shifts between a first-person perspective and a JRPG-like top-down view<br/><br/>・Meet and part with mysterious and comical characters.<br/><br/>・The story of a magical night which will leave you feeling as though you've been dreaming.<h3>WARNING</h3><br/>・Parts the game includes gore expression.<br/><br/>・Parts the game may induce some paranoia, please proceed with caution.<h3>Remarks</h3><br/>・You need keyboard and mouse to play this game.<br/><br/>・Game saves automatically.", "metacritic": null, "released": "2019-10-03", "tba": false, "updated": "2019-09-09T02:42:56", "background_image": "https://media.rawg.io/media/screenshots/f37/f37c738a49031bc1102072a676e8c5b5.jpg", "website": "https://www.bijutsukukann.com/bijitsukukan-en", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 30, "beaten": 1, "toplay": 3, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Fuming"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Fuming"], "esrb_rating": null}