{"id": 372637, "slug": "kung-fu-jesus", "name": "Kung Fu Jesus", "name_original": "Kung Fu Jesus", "description": "Down on his luck and working for a seedy gangster, Kung Fu Jesus walks the streets in a miserable daze. Little does he know his life is about to be transformed forever...<br/><br/>Enter a madcap world of organised crime, alternate dimensions, and intense martial arts, in a genre-busting action-adventure like no other. From invigorating kung fu combat, to lonely drives across alien landscapes, Kung Fu Jesus invites you to wake up, seek the truth, and free yourselves from the shackles of everyday reality.<br/><br/><br/><br/>Explore alien landscapes and celestial planes, battling men and gods alike with visceral martial arts and hand-to-hand combat. Follow Kung Fu Jesus from his origins as a down-and-out deadbeat, as he discovers his true nature and journeys toward his ultimate fate.<br/><br/><br/><br/>Kung Fu Jesus borrows from fighting games, action-adventures, action-RPGs and more, to create an intoxicating mixture of genres and gameplay styles. One moment you'll be fending off a katana-wielding mobster along high-tech city streets; the next you'll be piloting alien vehicles across the surface of an otherworldly planet.<br/><br/><br/><br/>Travel from the neon-lit streets of a near-future city, to lush forests scattered with ancient temples, snow-capped mountains with electric skies, and celestial dreamscapes where nothing is as it seems. Kung Fu Jesus is a dimension-hopping experience; a rich tapestry of theology, conspiracy, science-fiction and fantasy.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-09T03:06:06", "background_image": "https://media.rawg.io/media/screenshots/92a/92a4253befed31b66a3b2248e482c071.jpg", "website": "http://kungfujesusgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Celestial Gold Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Celestial Gold Studios"], "esrb_rating": null}