{"id": 372618, "slug": "cold-shell", "name": "Cold Shell", "name_original": "Cold Shell", "description": "<p>Your country lost a big war a few years ago and was occupied. The army and police are disbanded, firearms are withdrawn and banned. Spy drones fly over the streets, collecting information about all the inhabitants. Corporations are tearing the city apart with their skirmishes, and street thugs are creating chaos at night. And now the army of invaders has besieged the city and is not letting anyone through.<br />\nAll these global problems don&#39;t worry the main character so much. She lost her parents in the war. And did not make it to the frontline - the government capitulated as soon as she finished the training. Implanted military augments are turned off and have no power sources. All that remained for her was to put up with a low-paying job in the nearest grocery store, and wait until the occupants get out, in the hope that at least something will change for the better.<br />\nYesterday she dreamed of how she dealt with a gang of thugs and their boss, who was driving a stolen APC with a machine gun, all alone. During this dream some joker remotely hacked her implants and turned on the increased adrenaline secretion by the adrenal glands. Back In the army, soldiers had the adrenaline pumped up before the attack - for courage. Now she can&#39;t sleep until she lets off steam. So she had to get her bat out from under the bed and go out into the street, in the direction from where the loud music sounds, which the thugs love to listen to at night ...<br />\nFive  key features  of the game:<br />\nMelee. Firearms are banned in the society, bat and police shield are your new friends.<br />\nRapid action. Intensive cycle: dash into battle - smash your enemies - level up - repeat!<br />\nPlayer&#39;s room. Change the interior with elements torn from the cold hands of enemies in the underground arena.<br />\nSkip the story, interrupt the talkers. Too lazy to read? All that is really important is always highlighted and in plain sight.<br />\nUse the environment. Lure the enemies under the wheels of unmanned vehicles, toss boxes and bar tables at them, break glass and shop windows with knocked back enemies.</p>", "metacritic": null, "released": "2023-02-28", "tba": false, "updated": "2023-12-07T14:24:28", "background_image": "https://media.rawg.io/media/screenshots/df3/df3ebb6cd318950ef4d1dc2b4f504d19.jpg", "website": "https://www.indiedb.com/games/coldshell", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brutal muse"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Brutal muse"], "esrb_rating": null}