{"id": 372617, "slug": "inside-the-park-vr", "name": "Inside The Park VR", "name_original": "Inside The Park VR", "description": "Inside The Park VR is an immersive baseball training simulator for virtual reality technology. Compatible with the Valve Index headset, Inside The Park VR delivers a true to life baseball experience in the comfort of your own home. Fully accurate physics allow for a vast amount of hit types and high fidelity graphics enable you to feel like you are actually standing on a baseball field. Not good at baseball? Inside The Park VR includes three different levels of play to fit your skill level. Features include a ball machine, dynamic statistics, throwing and catching, Vive tracker support, AI pitcher and fielder, and more. So step up to the plate and immerse yourself in the next generation of baseball training with Inside The Park VR by Intelimmerse LLC.<br/><br/>Inside The Park VR is also compatible with the HTC Vive, Oculus Rift, and Windows Mixed Reality headsets.<br/><br/><strong>HTC Vive Racket Sport Set from the Vive Store Recommended for Best Experience</strong><br/><br/><br/><strong>Features:</strong><br/><br/><strong>Realistic Physics</strong> (Multiple colliders with unique restitutions resulting in accurate bat-ball collisions, real life values for mass, drag, and magnus coefficient, physics interpolation)<br/><strong>Various Difficulty Levels</strong> (Amateur, Competitive, Professional)<br/><strong>High Fidelity Graphics</strong> (Day/Night Lighting, HDR Reflections, Ambient Occlusion, High Resolution Shadows, Bloom)<br/><strong>Vive Tracker Support</strong> (Attach Tracker to Bat and Edit 3D Bat Position to Match Tracker)<br/><strong>Smooth Performance</strong> (Optimized for GTX 2060, Runs at 90 FPS, GTX 1070 or Above Recommended)<br/><strong>Dynamic Statistics </strong>(Pitch Speed, Pitch Type, Bat Speed, Exit Velocity, Spin Rate, Distance)<br/><strong>Batting Tee</strong> (Adjust Tee Height to Your Liking)<br/><strong>Teleportation Locomotion</strong> (No Need to Move in Real Life)<br/><strong>Up to Three Unique Camera Views</strong> (Requires Multiple Displays)<br/><strong>Customizable Equipment</strong> (Metal and Wood Bats, Various Glove Colors)<br/><strong>Artificial Intelligence</strong> (Left and Right Handed AI Pitcher, AI Ball Machine, AI Fielder with auto catch functionality)<br/><strong>Left Handed Support</strong><br/><strong>Ball Trail</strong> (Customizable Length to Visualize Path)<br/><strong>Customizable Pitch Speed</strong> (Slow, Medium, Fast)<br/><strong>Multiple Pitch Types</strong> (Fastball, Changeup, Slider, Curveball)<br/><strong>Play Any Position</strong> (Catcher, Pitcher, 1st, 2nd, Short, 3rd, Left, Center, Right)<br/><strong>Multiple Hit Types</strong> (Ground Ball, Line Drive, Fly Ball, Pop Up)<br/><strong>Realistic Catching and Throwing<br/>Background Music</strong><br/><br/><br/><strong>Controls:</strong><br/><br/>Valve Index<br/><br/>Trigger: Spawn Ball, Grab Ball<br/>Grip: Catch Ball<br/>B Button: Toggle Menu<br/>Touchpad/A Button: Select<br/>Thumbstick: Teleport<br/><br/>HTC Vive<br/><br/>Trigger: Spawn Ball, Grab Ball<br/>Grip: Catch Ball<br/>Menu Button: Toggle Menu<br/>Touchpad: Select, Teleport<br/><br/><br/>Oculus Rift<br/><br/>Trigger: Spawn Ball, Grab Ball<br/>Grip: Catch Ball<br/>Y/B Button: Toggle Menu<br/>X/A Button: Select<br/>Thumbstick: Teleport<br/><br/><br/>Windows Mixed Reality<br/><br/>Trigger: Spawn Ball, Grab Ball<br/>Grip: Catch Ball<br/>Menu Button: Toggle Menu<br/>Touchpad: Select<br/>Thumbstick: Teleport<br/><br/><br/><br/><strong>Planned Features:</strong><br/><br/><strong>Realtime Crowd</strong> (Ability to toggle crowd on or off, animations and sound effects based on play)<br/><strong>Additional Training Modes</strong> (Batting cages, have a catch with the AI)<br/><strong>Dynamic achievements</strong><br/><strong>AI Batter</strong> (Pitch to an AI batter and field balls from him)<br/><strong>Dynamic Weather</strong> (Rain, Wind)<br/><strong>And more!</strong><br/><br/><br/>I plan to release updates every month or so to make Inside The Park VR the best baseball simulator ever created. Please let me know your feedback (positive or negative), and I hope you enjoy Inside The Park VR.", "metacritic": null, "released": "2019-08-30", "tba": false, "updated": "2019-09-09T02:53:04", "background_image": "https://media.rawg.io/media/screenshots/a20/a209d605f1bf09fc62abd2ed2110f2e7.jpg", "website": "https://www.intelimmerse.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Intelimmerse"], "genres": ["Simulation"], "publishers": ["Intelimmerse"], "esrb_rating": null}