{"id": 372691, "slug": "the-ancient-labyrinth", "name": "The Ancient Labyrinth", "name_original": "The Ancient Labyrinth", "description": "The Ancient Labyrinth is a survival horror set in Ancient Egypt, in a maze that hides a terrible secret. Waking up after a long sleep, without remembering anything, discover the mystery behind this place, solve puzzles and find a way to escape, but be careful because in the darkness of the labyrinth hides a dangerous creature that will hunt you all the time . The creature is a true predator, it will look for you following your smell and is much faster and stronger than you. Don't try to face it, use your intelligence: take advantage of the surrounding environment, hide in the darkness, turn off the torch whenever possible and listen to the sound of his steps to avoid it. Can you survive long enough to escape the maze and discover the fate that awaits you?<h3>Strengths of the game:</h3><ul><li>Scary and mysterious atmosphere<br/></li><li>Suggestive Egyptian setting<br/></li><li>Gameplay based on the resolution of puzzles, exploration in search of key objects and above all on the prey-predator challenge with the creature<br/></li><li>Artificial intelligence of the creature very cured<br/></li><li>Quite difficult even though there are various difficulty levels<br/></li><li>Lore of the game full of mysteries<br/></li><li>Replayable, with two different endings</li></ul>", "metacritic": null, "released": "2019-09-25", "tba": false, "updated": "2019-09-09T03:38:04", "background_image": "https://media.rawg.io/media/screenshots/219/2191e1ade65cb15d5a9d31b9e497c7d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Nicola Gaeta"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Nicola Gaeta"], "esrb_rating": null}