{"id": 3727, "slug": "final-fantasy-xiv-a-realm-reborn", "name": "FINAL FANTASY XIV: A Realm Reborn", "name_original": "FINAL FANTASY XIV: A Realm Reborn", "description": "<p>FINAL FANTASY XIV: A Realm Reborn is a massively multiplayer RPG developed by Square Enix. It is the direct continuation of FINAL FANTASY XIV.</p>\n<p>FFXIV: A Realm Reborn is a heavily updated version of the original FINAL FANTASY XIV with a different graphics engine, netcode, and storyline. The game was made because the game sold poorly and wasn&#39;t met with critical acclaim.</p>\n<h3>Plot</h3>\n<p>The game takes place in  Eorzea five years after the events of the original game. FINAL FANTASY XIV ended on an apocalyptic note - a dragon god destroyed most of the Eorzea. Thanks to the blessing of the Gods, the player-created characters were able to escape certain death and were sent five years to the future. In a rebuilt world they face the danger of invasion by the Empire of the north.</p>\n<h3>Gameplay</h3>\n<p>In FFXIV, the players interact with each other in a world that continues to live on even without any players on the server. At the beginning of the game, the players are met by a character creation screen where they choose the name, race, gender, build, appearance and the base class. It is also necessary to choose a game world for your character. </p>\n<p>Players level up their characters by gaining EXP. EXP is gained by raiding dungeons, taking part in server-wide events, killing monsters, and completing quests.</p>\n<p>The game&#39;s combat system revolves around using a combination of character-specific weapon skills, the use of magic, and the physical attacks themselves.</p>", "metacritic": 83, "released": "2013-08-27", "tba": false, "updated": "2024-04-23T12:32:48", "background_image": "https://media.rawg.io/media/screenshots/515/515e8cda2f9e3ea1ca2785e99c1a1893.jpg", "website": "http://www.finalfantasyxiv.com/", "rating": 4.21, "rating_top": 4, "added_by_status": {"yet": 41, "owned": 1493, "beaten": 162, "toplay": 23, "dropped": 136, "playing": 89}, "playtime": 34, "achievements_count": 39, "ratings_count": 297, "suggestions_count": 662, "game_series_count": 0, "reviews_count": 302, "platforms": ["PlayStation 3", "PC", "PlayStation 5", "macOS", "PlayStation 4"], "developers": ["Square Enix"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Square Enix"], "esrb_rating": "Mature"}