{"id": 372774, "slug": "aeon-wars-galactic-conquest", "name": "Aeon Wars: Galactic Conquest", "name_original": "Aeon Wars: Galactic Conquest", "description": "An innovative strategy war game based in outer space! Become the legend of the galaxy!<br/><br/>**** Join the No. 1 Strategy Star War Game Now! ***<br/><br/>BACKGROUND<br/>Earth is doomed. Abandoning hope for a world reborn, humans began their mass migration to the stars in the year 2409. Backed by the entirety of mankind, the Terran Federation formed the first expeditionary fleet——the Icarus Corps. The universe is vast and mysterious. After discovering the unlimited resources buried deep within the Sagan Cluster, the Icarus Corps chose to betray the Federation. Anger and rage at the traitors spread across Earth like wildfire. The Federation sent fleet after fleet to pursue the rebels. Wealth, rights, honor... Whatever the reason you've chosen to journey to the stars, this new adventure will allow you to reinvent yourself. Destroy the rebels and build a new galactic order with steel and unlimited firepower! Welcome, Captain!<br/><br/>GAMEPLAY<br/>The future of the galaxy is now IN YOUR HANDS. The universe is in chaos. Order and justice must be upheld! You play as a commander of a space station first charged with rebuilding your station.<br/>The law of the jungle is the only rule – only the strongest will survive! Enemies have set their sights on each other and on you. You must construct your defenses to protect your stations. Expand your fleets to explore the galaxy and raid other forces. Colonize and mine resources to earn wealth and equip your ships. You can either choose to fight alone or ally with other players and fight in an alliance. The endless universe and an inexhaustible stream of enemies await. Who will be the new Master of the Universe?<br/><br/>FEATURES<br/>-\t360°3D scenes delivering STUNNING galactic imagery for EPIC battles in outer space.<br/>-\tEXPLORE the vast universe with players from around the world. Cooperate or compete? It’s up to you!<br/>-\tCONSTRUCT your own space station and develop your military force by building, upgrading and transforming hundreds of ships.<br/>-\tATTACK radical rebels to colonize their planets and gain enormous resources.<br/>-\tSTRATEGY is key to success. Adopt proper strategies under various conditions by making different combinations of battleships. Find the best tactics to break through enemy defenses. Reinforce your attacks with long-range missiles, rescue ships and other tactical weapons and troops. <br/>-\tBUILD UP your alliance to defend yourself from invasions and scramble for resources.<br/>-\tENGAGE in PVP Arena and climb the leaderboard to conquer the galaxy and win precious rewards. Thousands of players will compete in the same arena. Both pre-war planning and fast reactions are necessary to claim victory!<br/><br/>Compete against other players to become the most powerful commander in the galaxy! The universe needs a new ruler. It’s time to start your new journey to the stars!<br/><br/>Welcome, Captain!<br/><br/>Like us on Facebook and get the newest update:<br/>https://www.facebook.com/aeonwars2019", "metacritic": null, "released": "2019-07-01", "tba": false, "updated": "2019-09-09T04:24:57", "background_image": "https://media.rawg.io/media/screenshots/080/080f3114bb21675c528d24d8e957630e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mars Game (HongKong) Network Technology Co"], "genres": ["Strategy", "Simulation"], "publishers": ["Mars Game(HongKong) Network Technology Co"], "esrb_rating": "Everyone 10+"}