{"id": 372733, "slug": "alpacapaca-double-dash", "name": "Alpacapaca Double Dash", "name_original": "Alpacapaca Double Dash", "description": "Alpacapaca Double Dash is a 2D sidescrolling platformer where up to 2 players control Alpacas to travel between the story of various books to dispel the curse that made the characters of the books fight for the protagonist's spot. Explore each chapter of the books and decide which side of the story is the correct one. Will <strong>Sophie</strong> and <strong>Elise's</strong> alpacas manage to fix <strong>Emily's</strong> books and extract the <strong>Miracle Crystals</strong>? <br/><br/><br/>Alpacapaca Double Dash is a game where the players controls <strong>Sophie</strong> and <strong>Elise</strong> familiars, the alpacas, in a quest to fix the story of three books and extract the miracle crystals from them. But this time there will be no lasers or magical powers! All magic is nullified inside the books, so you will have to defeat the enemies using only your reliable special attack, <strong>Alpaca Kick</strong>!<br/><br/>Are you prepared to travel through every chapter in each book and choose the side of the story you believe is the correct one, or simply the most entertaining one?<br/><br/><br/><br/> <ul><li>Enter inside 3 different books, explore and recover the story of the chapters that were lost.<br/></li><li>Alpaca!<br/></li><li>Gather coins and use them in the gacha (capsule-toy vending machine) to unlock new outfits.<br/></li><li>Powerful and challenging bosses that can change depending on your choices.<br/></li><li>What is better than one alpaca? Two alpacas of course!<br/></li><li>More than 50 diferent skins to create your own unique look.<br/></li><li>Alpacapaca!<br/></li><li>Fun dialogues and interactions with the 3 magical girls, Sophie, Elise and Emily.<br/></li><li>Multiple Endings.<br/></li><li>Time Attack Mode where the fastest and more precise players will be forever remembered.<br/></li><li>Single Player or 2 Player mode.<br/></li><li>Amazing and original Soundtrack.<br/></li><li>Beautiful character illustration of our cute heroines!<br/></li><li>Pixel art.<br/></li><li>A<br/></li><li>L<br/></li><li>P<br/></li><li>A<br/></li><li>C<br/></li><li>A</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-09T04:03:42", "background_image": "https://media.rawg.io/media/screenshots/749/7497f404ac426a4a72dab582519ba09c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Synnergy Circle Games"], "genres": ["Action", "Indie"], "publishers": ["Synnergy Circle Games"], "esrb_rating": null}