{"id": 372724, "slug": "elmarion-dragon-time", "name": "Elmarion: Dragon time", "name_original": "Elmarion: Dragon time", "description": "“Elmarion: Time of the Dragon” is an RPG game, the main character of which is the dragon!<br/>\r\nThe player will find many adventures and tasks, controlling not a human character, as in most RPGs, but a flying fire-breathing dragon.<br/>\r\nAim of the game: to become the king of dragons and at the head of a flock of dragons in alliance with people to repel the invasion of the undead.<br/>\r\nThe main features of the game:<br/>\r\n1) Dragon simulator. You can fly, firebreath, set fire to buildings, burn people or help people (by completing quests, or protecting them from enemies).<br/>\r\n2) Skill up the dragon. As in other RPGs, the main character (dragon) can grow up, gaining experience, levels and new opportunities.<br/>\r\n3) Participation in epic mass battles (with people, undead, other dragons).<br/>\r\n4) A large open world, divided into several large locations.<br/>\r\n5) Urban development. Human cities develop independently: peasants obtain resources, new buildings and troops are being built. From time to time, people gather troops and hike to other settlements.<br/>\r\n6) Karma. The dragon can participate in the life of every city. If the dragon sets fire to houses and kills ordinary people - the development of the city is inhibited, and the dragon’s karma falls, but if it saves people from robbers and other monsters, then this helps the development of the city and its karma grows. Depending on karma, people will interact with the dragon in different ways. For example, troops will attack an evil dragon, but not good.", "metacritic": null, "released": "2020-03-01", "tba": false, "updated": "2020-03-02T14:41:09", "background_image": "https://media.rawg.io/media/screenshots/211/21121783f696c0c06b7d18d801a838fc.jpg", "website": "http://elmarion.ru", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17}, "playtime": 1, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Fleon Games", "Leonid"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Fleon Games"], "esrb_rating": null}