{"id": 372773, "slug": "lords-dragons-dungeon-raid", "name": "Lords & Dragons: Dungeon Raid", "name_original": "Lords & Dragons: Dungeon Raid", "description": "Welcome to the world of Lords &amp; Dragons.<br/><br/>The once-peaceful Gaia comes under the attack of the Black Dragon. In its aftermath, a mysterious power engulfs Gaia, plunging it into chaos and mayhem. All races from Human to Orcs to the Undead rise up against the invasion and try to locate the source of the scourge. They call on heroes from other worlds to aid their effort and protect the World Tree—the lifeline of Gaia.<br/><br/>Features<br/><br/>【Unlimited Dungeons】<br/>In addition to main quests, the dungeons also feature a variety of side quests, building structures and chance encounters. Exploring them will help grow your strength and prepare you for future PVP battles. <br/><br/>【Diverse Artifacts, Winning Strategies】<br/>Thunderous Hammer, Supreme Scepter, Angel Wings, Purgatory Blade… Passed down from ancient Gaia, those artifacts will give you a crucial edge in battle if properly used. <br/><br/>【Holy Races, Godly Blessings】<br/>Valorous Dragon Knights, ferocious Behemoth, greedy Abyss Devils, noble and sagacious Elf Queen… All holy races have come and joined the fray. The God of War Mars, the Hell Dominator Baal, the Orc Shaman Gwill, the Goddess of Peace Nyx, the Goddess of Wisdom Athena… All deities have arrived to offer their blessings.<br/><br/>【Loot and Conquer】<br/>A vast world with abundant resources: 3 Temples, 9 Pantheons, the World Tree and so much more. Build your own squads, gear up with artifacts and fight side by side with your allies. The world of Gaia is yours to conquer! <br/><br/>【Rally Epic Squads】<br/>The interplay between classes means that the pre-battle setup of squads is of great strategic significance. During battles, one of the key success elements is deciding when and where to use your artifacts.<br/><br/>Contact Us<br/>You can reach us on the following platforms. <br/>1. Official FACEBOOK Page:https://www.facebook.com/LND2019/<br/>2. Send an email to cs@marsgame.hk to contact us.", "metacritic": null, "released": "2019-09-07", "tba": false, "updated": "2019-09-09T04:24:33", "background_image": "https://media.rawg.io/media/screenshots/5d8/5d8282e3c6c6c0a46c7a9497f8ddc5f1_uKkvqK4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mars Game (HongKong) Network Technology Co"], "genres": ["Strategy", "Card"], "publishers": ["Mars Game(HongKong) Network Technology Co"], "esrb_rating": "Everyone 10+"}