{"id": 372767, "slug": "lords-of-dragons-2", "name": "Lords of Dragons", "name_original": "Lords of Dragons", "description": "The brand new mobile game Lords of Dragons is an idle card game with both strategy and RPG elements. In this fantastic game, you need to call up the legend heroes to build a strong army. And don't forget how to train your dragon, which will help you in the battle. Start you journey of saving, because the world is not peace and the people are yearning for savior. Saving the village, rescuing the princess and explore in the mist. <br/><br/>Features<br/><br/>Train Your Dragon<br/>Ever want to have a dragon? Your dream comes true now. Tons of dragons are waiting for you. Go to unlock them and start your training. With the dragon, you can defeat the enemy and win the glory. And of course not all the dragons are good. Try to expel the evil dragon with the dragon you trained.<br/><br/>Collet Heroes<br/>Discover heroes that each possesses unique skills. You'll want to add each and every card to your collection! Choose the proper heroes to build your own team to fight for the battle. Remember that a good team must be a balanced team. In order to be stronger, you should upgrade your heroes and their equipment. When everything is ready, call up the heroes and their troops, bring the dragon and attack your enemy.<br/><br/>Strategy Combat<br/>If you are clever enough, you may notice that one may lose with higher combat effectiveness. So the strategy is quite important. Try to perfect your strategy with the clear understanding of heroes’ skills. Then you can strike down your enemy in the combat.<br/><br/>Idle Gameplay<br/>Too busy or too lazy to fight and train? Don’t worry. Your heroes will continue fighting while you are away. When you return your phone, they will be stronger and will have collected tons of loot.<br/><br/>PVP Arena<br/>Player from all over the world will gather in the arena. Go to challenge and crush them. Come up with unique offensive and defensive strategies for the PVP battles to climb the leader board for the best rewards.<br/><br/>Fight in Legion<br/>Build a Legion with other players you meet and take on an array of dangerous opponents together! Fight with other legions explore in the mist.<br/><br/>Official Facebook Page:<br/>https://www.facebook.com/Lords-of-Dragons-425772328259135<br/>Note: Shoot us a message at lordsofdragons@kingfishgame.com with any questions or comments relating to this IDLE card game. Ask us anything!", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-09T04:21:46", "background_image": "https://media.rawg.io/media/screenshots/7ca/7ca21f4363f329a0bba32f6bdc60306a_8izf8Da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KINGFISH ENTERTAINMENT"], "genres": ["RPG", "Card"], "publishers": ["KINGFISH ENTERTAINMENT"], "esrb_rating": "Teen"}