{"id": 372737, "slug": "grandpa-and-granny-escape", "name": "Grandpa And Granny Escape", "name_original": "Grandpa And Granny Escape", "description": "Grandpa And Granny House Escape is a horror game where you will be chased by an insane grandpa and a scary granny. Oh, they adore playing hide-and-seek. Surely, it is not an ordinary hide-and-seek fun – but a tough survival experience. Grandpa and granny always find a new victim to play their cruel game of survival. Your escape will not be easy because granny and grandpa are very experienced hunters. <br/><br/>Grandpa is utterly insane: he stuffed his creepy mansion with numerous observation cameras so that no one will sneak unnoticed. <br/><br/>Granny’s favorite fun is the baseball game. Guess, who will play the role of a base-ball?  <br/>Try Grandpa And Granny House Escape if you do not fear horror games!<br/><br/>Your escape challenge will start in the olds’ mansion, in a small dark room. In order to escape the awful house, you will need to find and modify weapons. You can craft weapons in a secret room on a workbench. Beware of granny – she is fiendishly quick. <br/>Grandpa is always on alert, his observation cameras are simply everywhere. Once he notices that you are trying to escape, he will immediately catch you. Hide, escape, and use all items at hand! Hidden object search may also save you from schizoid grandpa and granny. <br/><br/>Many years ago, granny’s house was a beautiful mansion to the envy of every neighbor, but today, it is a fomenting ground for horror and terror. You can easily get lost in this scary house because it looks more like a maze due to its total darkness and creepiness. <br/>Navigate by the objects around you and do not forget that you are playing hide-and-seek with merciless grandpa and granny who are tough on everyone they catch. <br/><br/>It will be bloody difficult to escape from granny and grandpa because they simultaneously hunt for their prey. Even when you know the location of one of the olds, you cannot be sure where the second one is right now, so be careful! <br/><br/>There are no neighbors around, the action takes place at night. Your primary objective is to escape the dreadful house, and you will need a car to do so. But the car is broken, and you have to repair it. There is nobody to help with repair, so you will have to do everything yourself. You will not survive for several nights unless you act swiftly but quietly.  <br/><br/>The mansion is full of unpleasant surprises, secret passages, and hidden traps – solve every puzzle to figure out how you can escape from the house. Though the olds are quite slow, they can lurk around every corner! Do not let them approach you, listen carefully to every sound – their footsteps are heard long before they appear!<br/><br/>If you love horror games, hide-and-seek, puzzles, and hidden object challenges, you cannot miss out the Grandpa And Granny House Escape game – it is absolutely free!", "metacritic": null, "released": "2019-09-03", "tba": false, "updated": "2019-09-09T04:06:22", "background_image": "https://media.rawg.io/media/screenshots/05d/05d6519d14d870a88f314a7854809544_pnZiAec.jpg", "website": "http://wildgames.net/grandpa-and-granny-escape-house/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vladimir Dolgov"], "genres": ["Adventure", "Casual"], "publishers": ["Vladimir Dolgov"], "esrb_rating": "Teen"}