{"id": 372877, "slug": "jewel-king-diamond-smash", "name": "Jewel King: Diamond Smash", "name_original": "Jewel King: Diamond Smash", "description": "Let's step in the charming jewel kingdom above the sky with the princess and her best buddy,<br/>Explore the mysterious jewel land, meet new friends, and embark on an enchanting adventure.<br/>Download Jewel King: Diamond Smash Match 3 for free now and enjoy the mania of the miracle jewel kingdom<br/>Link gems with same color to collect treasures for the princess. While a link between 6 or gems is made, butterflies will put special gems in a random cell.<br/>The Link between 3 or more special gems will create fever combos which may clean up the table in one single move.<br/>When you can't make any move. Gems will be relocated into new cells.<br/>Pay attention to troublesome mole, mouse or rock machine before you ran out of move.<br/>Jewel King: Diamond Smash Match 3 is free to play but you can buy powerup items such as extra moves or even powerful special gems with real money.<br/>Jewel King: Diamond Smash Match 3 outstanding features:<br/># Stunning graphics and effects set in a beautiful fairy saga<br/># 200 puzzling levels with different difficulty, divided into 8 game modes<br/>Finish the Orders: Collect gems in order for the jewel princess<br/>Rescue the tiger: Clear the way for tiger to come back to his house<br/>Collect the Gold: Bring back all the gold bars for the kingdom<br/>Catch the Moles: Help princess to catch all the Moles<br/>Drop the pearls: Clear the path for the pearls to drop to the bottom<br/>Find the hidden Treasures: Retrieve all treasures hidden underground. <br/>Catch the rats: Use special gems combo to smash the rats<br/>Defeat the boss: Destroy the powerful enemies of jewel kingdom<br/># Unlockable 10 cute pets<br/># Easy and fun to play, challenging to master<br/><br/>Already a fan of Jewel King: Diamond Smash Match 3? Like us on Facebook or check out our website for the latest news:<br/>Facebook: https://www.facebook.com/asuragamestudio<br/>Website: http://asuragame.com/<br/>Last but not least, a big THANK YOU goes out to everyone who has played Bejeweled Of King", "metacritic": null, "released": "2017-03-24", "tba": false, "updated": "2019-09-09T05:09:22", "background_image": "https://media.rawg.io/media/screenshots/cfc/cfc3c624ac1038d8037c696ac90aa380_nbS4XA2.jpg", "website": "https://www.facebook.com/asuragamestudio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nguyen Phuoc"], "genres": ["Casual", "Puzzle"], "publishers": ["Nguyen Phuoc"], "esrb_rating": "Everyone 10+"}