{"id": 372862, "slug": "juicy-candy-blast", "name": "Juicy Candy Blast", "name_original": "Juicy Candy Blast", "description": "Let's step in the fascinating Wonderland with Alice through her yummy candy journey.<br/>Explore mysterious lands, meet new friends, and embark on an enchanting adventure.<br/>Download Juicy Candy Blast for free now and enjoy jam packed with tasty juice's flavor.<br/>Match 3 lining up candies of the same color to smash the candies. When forming a square candy, butterflies will put a miracle in a random cell.<br/>Match 4 or 5 candies of the same color can help you create fever combos which may blow up all candies in a single move.<br/>When you can't make any move with candy juice. Jam candies will be relocated into new cells.<br/>Pay attention to troublesome spiders, tornadoes or chocolate box before you ran out of move.<br/>Juicy Candy Blast: Alice's sweet dream is free to play but you can buy items such as extra moves or even a powerful candy lollipop with real money.<br/>Juicy candy blast  outstanding features:<br/># Stunning graphics and effects set in a beautiful fairy tale for Alice in Wonderland.<br/># 100 puzzling levels with different difficulty, divided into 4 game modes<br/>Cookie game modes: Find delicious cookies behind the candy and bring them to the cake lover twins.<br/>Fishing game modes: Candies are hidden below, crush the ice and feed the friendly flamingo<br/>Order modes of play: Collect candy in order to serve friends of Alice<br/>Boss game mode: You may wonder where is the famous Cheshire cat in Alice fairy tale. Stay tuned for his appearance<br/># Easy and fun to play, challenging to master", "metacritic": null, "released": "2016-09-26", "tba": false, "updated": "2019-09-09T05:02:22", "background_image": "https://media.rawg.io/media/screenshots/472/4723568a0972e14ffc72ce5f5ade9467_hNDpzA9.jpg", "website": "http://facebook.com/asuragamestudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nguyen Phuoc"], "genres": ["Casual", "Puzzle"], "publishers": ["Nguyen Phuoc"], "esrb_rating": "Everyone 10+"}