{"id": 372821, "slug": "body-builder-sport-tycoon", "name": "Body Builder - Sport Tycoon", "name_original": "Body Builder - Sport Tycoon", "description": "Dreaming about the perfect body but don’t want to do some fitness? Check this amazingly colorful Body Builder - Sport Tycoon game and do these first steps in the bodybuilding management career! Invite more visitors, upgrade the gym to make it really comfortable and useful and be ready to have your own fans – ‘cause you’re awesome!<br/><br/>Prepare your fitness and training devices to the visitors – they must be clean and intact, you know! Learn more about the fitness and bodybuilding gym management and power your own body up – maybe soon you’ll be able to become the real coach! Just train hard doing various exercises and prove that you’re worth to join the bodybuilding contests!<br/><br/>Don’t forget that some your fans are so inspiring to you, your body and your actions that sometimes you should guess their preferences about your workout! Should you run or hand the grips now? Who knows! Don’t let them down – and you’ll be generously rewarded with their smiles and (of course) some useful points! Check this Body Builder - Sport Tycoon game and just enjoy it!<br/><br/>Try to make your bodybuilding gym as comfortable (and maybe expensive) as possible! Walls, floor, barbell, mirrors, posters, dumb-bells, sit-up and even the Nautilus equipment – you can upgrade them all with just a certain amount of earned points!<br/><br/>Body Builder - Sport Tycoon features:<br/>•\tSports bodybuilding career management<br/>•\tVarious sports equipment and exercises<br/>•\tChance to have your own fans<br/>•\tInteresting upgrades for your gym<br/>•\tNice and sportive atmosphere<br/><br/>Do some press-up, curtsy, crossbar exercises, make your press and biceps look really nice and fit – it’s not so difficult with Body Builder - Sport Tycoon game!", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-09-09T04:42:23", "background_image": "https://media.rawg.io/media/screenshots/3d2/3d204bec169c97f5d607ccc8faf748d0_scEoAYx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daria Pavlyuk"], "genres": ["RPG"], "publishers": ["Daria Pavlyuk"], "esrb_rating": "Everyone 10+"}