{"id": 372841, "slug": "medieval-kingdom-escape-quest", "name": "Medieval Kingdom: Escape Quest", "name_original": "Medieval Kingdom: Escape Quest", "description": "The lord of medieval lands gone mad and capture all the bravest knights in one large castle dungeon, where their only mission is to survive! You’re one of these poor hostages, but anger boils in your veins: escape the walls of this Medieval Kingdom Escape Quest game and defeat this cruel insane king! Pave your way through medieval cameras and do everything possible to survive!<br/><br/>Be careful: the king has many devoted followers and they guard this gloomy place! Feel the power of your brutal muscles and endless anger, grab some weapon and be ready to attack everybody on your way! The rival is as skillful as you are, so choose your fighting strategy wisely; otherwise, your game may become over at a really inappropriate time!<br/><br/>Watch your minimap to prevent some dangerous meetings with the local bosses – they’re much more powerful and well-armed than you are! Maintain your health level collecting some useful stamina and health potions on your way or looting your rivals – they have more weapons than you can imagine! Check all your skills and escape successfully from this awesome Medieval Kingdom Escape Quest game!<br/><br/>Unlock such interesting weapons as axes, magic swords, halberds and many others to increase your chances to escape! Mind that every boss fight will give you some experience points with which you’ll be able to power your medieval hero up and become really strong, dexterous and powerful! Show all these knights who're the real boss here and finally defeat the king himself!<br/><br/>Medieval Kingdom Escape Quest features:<br/>• Interesting knight fighting quest<br/>• Gloomy dungeon to escape from<br/>• Many skillful rivals (including big bosses)<br/>• Amazing weapons of the medieval epoch<br/>• Stunning atmosphere of a real knight’s escape in 3D<br/><br/>Do everything possible to save your face in this cruel medieval war playing Medieval Kingdom Escape Quest and have fun!", "metacritic": null, "released": "2018-02-19", "tba": false, "updated": "2019-09-09T04:50:06", "background_image": "https://media.rawg.io/media/screenshots/30e/30eb99989204a2b8dd675061647f77b2_v0Crb0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daria Pavlyuk"], "genres": ["Action"], "publishers": ["Daria Pavlyuk"], "esrb_rating": "Teen"}