{"id": 372863, "slug": "candy-sweet-mania-halloween-party", "name": "Candy Sweet Mania: Halloween Party", "name_original": "Candy Sweet Mania: Halloween Party", "description": "Candy sweet mania lead you on an sweet adventure through the fruit land. Swap and match the fruit to complete challenging levels, defeat the evil boss and rescue the fruit land through your sweet adventure. As you travel into the fruit land, sweeter treats as well as harder challenge come into play in your juicy adventure. The juicy sweetness of fruits will combine under your finger to create striped fruits, fruit jellies and even the colorful rainbow candies - all ready to explode into the most delicious combos.Take on this quest as a lone traveler or invite your friends and enjoy the company and competition.Join now to write a saga of your juicy adventure in fruit land.<br/>Features:<br/>Classic match 3 mechanics with loads of new improvements.<br/>Hundreds of sweet levels.<br/>4 unique game modes to test your skills.<br/>Interesting travel and challenging boss.<br/>Blast through the leader board. Become the number 1 player of the fruit land!<br/>No wifi connection is required. You can play offline.<br/>Login continuously to receive special costume for your character and a lot of precious rewards.<br/>Free power ups every day.<br/>Game mode:<br/>Fill the orders: gather enough fruits to complete the level.<br/>Crack all the cookies: crack the cookies by making match above them. Remove all the cookies to pass the level.<br/>Find all the gummy bears: the gummy bears is blocked by ice. Break ice by matching above them to release all the gummy bears.<br/>Defeat the boss: Gather red hot chillies to defeat the boss.<br/>Candy sweet mania is a totally free game with some optional in app purchase for those who want to reach the top and explore the fruit land quicker.<br/>Check out our Facebook page to stay tuned with the latest update or to give the hard working devs some encouragements.<br/>Thank you all for playing Candy sweet mania.<br/>Facebook page: https://www.facebook.com/CandySweetMania/", "metacritic": null, "released": "2016-10-29", "tba": false, "updated": "2019-09-09T05:02:58", "background_image": "https://media.rawg.io/media/screenshots/1df/1df07f273a6d4ad66cf6f3a3e45e1110.jpg", "website": "http://asuragame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nguyen Phuoc"], "genres": ["Casual", "Puzzle"], "publishers": ["Nguyen Phuoc"], "esrb_rating": "Everyone 10+"}