{"id": 372942, "slug": "ancient-gears", "name": "Ancient Gears", "name_original": "Ancient Gears", "description": "Attention! This version may not be compatible with iPhone 7!<br/>-----------------------------------------<br/><br/>Explore the world, and discover the historic relics known as Ancient Gears!  With exciting match-three gameplay, and a fabulous story, you will be lost in the action from beginning to end.  Your reaction time is crucial, so you must be quick and use your wits in order to solve all the puzzles that lie ahead!  Do you have what it takes to unravel the mystery surrounding the remarkable Ancient Gears?<br/><br/>From the time you were a child you have wanted to explore the world and solve the mysteries that have stumped humanity since the dawn of time.  You meet a professor, who asks you to go along on a journey around the globe to find the impressive relics, the Ancient Gears.  Tiles are rotated over three gears, when three of a kind line up, slash them with your finger to gain points!  Don't let time slip away, for as each second passes, the Ancient Gears become more of a mystery!  Let the journey begin!<br/><br/>GAME FEATURES:<br/>◇ 42 awesome levels to explore in 7 unique locations!<br/>◇ 2 exciting game modes – Adventure &amp; Time’s Up!<br/>◇ 28 artistic cards that tie together the games story!<br/>◇ Amazing bonuses to help maximize your potential!", "metacritic": null, "released": "2012-05-21", "tba": false, "updated": "2019-09-09T05:40:23", "background_image": "https://media.rawg.io/media/screenshots/5e3/5e3a0f55ca01fab012705323a5e5296f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Action", "Puzzle"], "publishers": ["Alawar Entertainment"], "esrb_rating": "Everyone 10+"}