{"id": 372902, "slug": "fox-bet-pennsylvania", "name": "FOX Bet - Pennsylvania", "name_original": "FOX Bet - Pennsylvania", "description": "The biggest name in sports is now the hottest and most reliable name in sports betting. Join FOX Bet for FREE and start betting on pro and college football, pro and college basketball, baseball, hockey, soccer, golf, tennis, boxing, MMA and so much more.<br/><br/>Advanced technology powers the FOX Bet app to make it lightning-fast, fully secure and extremely easy to use. Register today to start cashing in on against-the-spread wagers, moneylines, futures, parlays, prop bets, round robins, live in-game bets and more. FOX Bet also offers dozens of exclusive features, including:<br/><br/>• Ways to win with your favorite FOX analysts<br/>• Hundreds of daily bet boosts to increase your winnings<br/>• Revolutionary #CustomBet to pick ’em your way with personalized odds<br/>• Promotions that offer you money back as free bets<br/>• Betting education to quickly transform beginners into pros<br/>• Early cash-out options that allow you to lock in your profits<br/><br/>We’re backed by the best and most responsive customer-service team in the business to ensure you’ll get the most safe, fun and rewarding experience in sports betting.<br/><br/>Download for FREE and get in on the action now!<br/><br/>This is a legal, real money gambling app in Pennsylvania. Users must be 21+ to play. Terms and Conditions apply.", "metacritic": null, "released": "2019-09-04", "tba": false, "updated": "2019-09-09T05:19:02", "background_image": "https://media.rawg.io/media/screenshots/e82/e82ee80c068fdd50383fd00be54c0a88.jpg", "website": "https://mtairycasino.foxbet.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stars Mobile"], "genres": ["Sports"], "publishers": ["Stars Mobile"], "esrb_rating": "Mature"}