{"id": 372975, "slug": "stomped", "name": "Stomped!", "name_original": "Stomped!", "description": "Stomped! combines the best parts of snowboarding and skateboarding into one premium package. Carve your way through beautiful mountain landscapes, nose-slide across stormy peaks, and kickflip over deadly chasms.<br/>Find your flow as you chain together massive combos at breakneck speed but don’t forget to STOMP the landing! Stomped! will get your heart pounding as you launch over massive gaps and flip through countless beautiful locations.<br/> <br/>Let’s Shred!<br/> <br/>INSANE TRICKS<br/>• A powder surf inspired trick system - Flicks, grind &amp; grabs like you’ve never seen. It’s the best parts of skateboarding and snowboarding combined!<br/> <br/>HANDCRAFTED LEVELS<br/>• Intricately designed, replay-able levels full of unique elements to keep things fresh on every run<br/> <br/>MOBILE-FIRST CONTROLS<br/>• A revolutionary swipe control system designed for mobile. Pull off the sickest tricks, grinds and manuals with ease!<br/> <br/>BEAUTIFUL VISUALS<br/>• Stomped features dynamic lighting and weather—shredding has never looked this good!<br/> <br/>AMAZING COMBOS!<br/>• Combo based score system.It’s all about keeping that flow and chaining together massive tricks to max your score!<br/> <br/>&gt;&gt; MORE FEATURES &lt;&lt;<br/>• 36 thrilling levels across 6 extraordinary mountains - Shred beautiful mountainsides, carve through blizzards and even launch over lava!<br/>• 9 Unique challenges per level - become a master of the slopes!<br/>• 6 playable characters – Ride in the style that best suits you!<br/>• Awesome chill-hop soundtrack from DavidCutterMusic.com<br/>• Cloud save support - Play on multiple devices and keep your progress in sync.<br/>• Premium experience – Pay once for the full game. No IAPS &amp; no ads", "metacritic": null, "released": "2019-09-05", "tba": false, "updated": "2019-09-09T06:03:12", "background_image": "https://media.rawg.io/media/screenshots/567/567974f2fb26218e5b160b68ab395f8e_9ztaI7q.jpg", "website": "https://noodlecake.com/games/stomped/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Noodlecake Studios"], "genres": ["Simulation", "Sports"], "publishers": ["Noodlecake Studios"], "esrb_rating": "Everyone 10+"}