{"id": 372973, "slug": "nimian-legends-vandgels", "name": "Nimian Legends: Vandgels", "name_original": "Nimian Legends: Vandgels", "description": "Compatible with: iPhone SE, 6S, 6S Plus, 7, 7 Plus, 8, 8 Plus, X, XS, XR; iPad Mini 4, 5; iPad Air 2, 3; iPad Pro; iPod Touch 7th gen (2019)<br/>Vandgels DOES NOT support: iPhone 5S, 6, 6 Plus; iPad Air, Mini 2, 3; iPod Touch 6th gen and lower<br/><br/>A BEAUTIFUL OPEN WORLD FANTASY ADVENTURE<br/>Four times the size of Nimian Legends : BrightRidge, Vandgels offers a true open world to explore, with new characters, locations, upgrades and features. <br/><br/>FULL GAME<br/>+ No Ads<br/>+ No In-App Purchases<br/>+ No Timelimits<br/>+ Offline Play : No WiFi required<br/><br/>STORY MODE<br/>Rise of the Empra - Ambassadors of Faith, Fortune and Force meet in the ancient, snow swept citadel of Vandgels to decide the future of the nation.<br/><br/>DUNGEONETTE MODE<br/>10 shape changing powers are hidden in 10 mini dungeons across the land. Solve all 10 and receive a grand prize.<br/><br/>EXPLORE MODE<br/>There’s no rush. Feeling panic, anxiety or stress? Choose Explore Mode, breathe, and explore the wild rivers, valleys and waterfalls of Vandgels at your own pace.<br/><br/>PHOTO MODE<br/>Become a nature photographer and take and save beautiful pictures of this gorgeous and vast landscape. Will you photograph an elusive deer drinking by the river? Or perhaps capture a golden sunset amid ancient ruins? Need help hunting the animals down? Use your Spirit View to magically track animals, each with their own habitat and behavior.<br/><br/>CUSTOMIZE YOUR WORLD<br/>Extensive options let you customize almost anything at anytime. Change time of day, turn on Watercolor mode and experience a living painting, add effects and filters and more.. <br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>It’s all here. Rainstorms, lightning and thunder, light breezes and gusting wind, and quiet snowfalls. Or use the options to change the weather on the fly.<br/><br/>TRAILER https://www.youtube.com/watch?v=CUhpVRnuR4U<br/><br/>INSTAGRAM https://www.instagram.com/protopopgames/<br/>TWITTER https://twitter.com/protopop<br/>FACEBOOK https://www.facebook.com/protopopgames/<br/><br/>________________________________<br/><br/>I am a solo indie developer making games from my heart. I enjoyed creating this world and I hope you enjoy exploring it:) <br/><br/>Thank you to everyone who took time to leave a review. Positive or negative each one helps me understand how the game works in the real world, and I appreciate it. For a solo dev like me hearing that people enjoy the game is very encouraging:)<br/><br/>Nimian Legends is an original fantasy world. See the interactive map at http://NimianLegends.com<br/><br/>Thank you to Touch Arcade for your reviews and being a great place for Mobile game news : http://toucharcade.com/<br/><br/>...AND A PERSONAL THANK YOU<br/>A big thank you to Nullzone, RiverShard, MisterDerez, Liam, Curtis, DK_1287, redribbon, Ashley, Jimmy, Benjamin ,Jack and everyone who has helped me test and supported Nimian Legends. A project of this size is a challenge to create on my own, and your support and encouragement have helped me through difficult times.<br/><br/>Optimized for iPad Air 2 and higher and iPhone 6S and higher<br/><br/>Thank you for supporting Nimian Legends. I'm available at robert@protopop.com for questions, bug reports or other assistance.", "metacritic": null, "released": "2019-09-08", "tba": false, "updated": "2019-09-09T06:01:12", "background_image": "https://media.rawg.io/media/screenshots/f2c/f2ce9cd8e8e333c72c2dd9567d47249b_Yf9X4xL.jpg", "website": "https://www.youtube.com/watch?v=CUhpVRnuR4U", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Robert Kabwe"], "genres": ["Adventure", "RPG"], "publishers": ["Robert Kabwe"], "esrb_rating": "Everyone 10+"}