{"id": 372927, "slug": "sudoku-number-puzzle-game", "name": "Sudoku - Number Puzzle Game", "name_original": "Sudoku - Number Puzzle Game", "description": "Sudoku – one of the greatest games of all time. <br/><br/>Train your brain by filling in the blanks in this superb logic puzzle. With five difficulty levels, intelligent note taking and hints, our version of Sudoku for iPhone and iPad is for complete beginners and Sudoku professionals alike. The advanced grid generator guarantees a never ending supply of fresh Sudoku puzzles and will keep you busy for days.<br/><br/>-unlimited gameplay (Sudoku Grid Generator)<br/>-5 levels of difficutly (easy to insane)<br/>-3 beautiful board styles<br/>-automatic game save<br/>-advanced input methods<br/>-intelligent note taking functions<br/>-highscore system and time taking<br/><br/>The game is fully localized and supports the following languages: Deutsch, English, Français, Español, Italiano, 汉语, 日本語<br/><br/>__________<br/>General Data Protection Regulation<br/><br/>The protection of the personal data of our users and customers is of utmost importance to us. Lite Games' data protection policy complies with the applicable legal provisions of the Federal Data Protection Act (“Bundesdatenschutzgesetz”), the Telemedia Act (“Telemediengesetz”) and the provisions of the EU General Data Protection Regulation (GDPR). <br/>By downloading and installing this app you agree that you have read, understand, and unconditionally accept our general Terms &amp; Conditions (http://tc.lite.games) and our Privacy Policy (http://privacy.lite.games). You especially agree that we collect and/or transfer data (including device ids and IP addresses) to optimize our in-app advertising and to enhance its performance and targeting.<br/><br/>If you do not agree to our Terms &amp; Conditions and our Privacy Policy, you should not use any of our apps or services in any way. <br/>___________<br/><br/>Sudoku is an advertiser funded app, i.e. ads are presented within the app. If you prefer to use the app without ads we do offer a \"no ads\" setting as auto-renewable subscription. You have the choice between the following options:<br/><br/>- 1 month for $0.99 or equivalent (subscription renews after 1 month)<br/>- 3 months for $1.99 or equivalent (subscription renews after 3 months)<br/>- 1 year for $4.49 or equivalent (subscription renews after 1 year)<br/><br/>Payment will be charged to your iTunes account at confirmation of purchase. The subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. <br/>The account will be charged for renewal within 24-hours prior to the end of the current period with the amount the selected option costs. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>Terms &amp; Conditions: http://tc.lite.games<br/>Privacy Policy http://privacy.lite.games<br/><br/>Visit us for more free iPhone and iPad games: <br/>https://www.lite.games", "metacritic": null, "released": "2012-10-19", "tba": false, "updated": "2019-09-09T05:32:53", "background_image": "https://media.rawg.io/media/screenshots/d53/d53c6f3dddc71884ebfe85764cee808f.jpg", "website": "https://www.lite.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LITE Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["LITE Games"], "esrb_rating": "Everyone 10+"}