{"id": 372917, "slug": "big2-kk-big-2-pusoy-dos", "name": "Big2 - KK Big 2 (Pusoy Dos)", "name_original": "Big2 - KK Big 2 (Pusoy Dos)", "description": "Play 1 game in 60 seconds.<br/>Fast, Fast, Super fast pace.<br/>Install this game and flip the card now.<br/>Take the challenge rank the highest in the leaderboard.<br/>Be the Big 2 King now.<br/><br/>Play Big Two or Capsa Banting, one of the most popular Asian card game poker! <br/><br/>Now you can enjoy a fun poker card game for FREE! Try new Pusoy Dos or Capsa Banting or Big Two, a popular Asian card game poker. The point of this poker card game is to be the first to get rid of all of your cards by using poker hands that are similar to Texas Hold’em. Play against AI players and win!  What’s even better is you will get UNLIMITED FREE CHIPS to play our poker offline game! <br/><br/>Pusoy Dos, similar to Chinese poker cardgame, is popular in Macau, Singapore, Hong Kong, Philippine, Indonesia, and other countries across Asia. This cardgame is also called  Big Two, Capsa Banting, Deuces, Chikicha, or Sikitcha. The rule is quite similar to the Chinese Poker Card Game. Pusoy Dos helps you selecting poker hands, whether they are Royal Flush, Straight , Four of a Kind, Fullhouse, Three of a kind, and pairs. You play as a Single Player against three other players. Your casino host will give each of the player 13 cards. However, unlike other poker card games like Texas Hold’em, the purpose of the game is to get rid of your cards. Once one of the players have used all of their cards, the game will be over and the final points will be calculated. If your balance fall below $3000, we will REFILL your CHIPS FOR FREE!  <br/><br/>It means that you can play our game for UNLIMITED times without paying any money! This is what makes our Big Two or Capsa Banting card game poker so fun and so unique among other similar Chinese poker cardgame. You will never run out of CHIPS to play this fun addictive card game. <br/><br/>HOW TO PLAY BIG TWO?<br/>Cards may be played as singles or in groups of two, three or five (var. 1 and 8), in combinations which resemble poker hands. The leading card to a trick sets down the number of cards to be played; all the cards of a trick must contain the same number of cards. The highest ranking card is 2 instead of A.<br/><br/>＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝<br/>BEST FEATURES OF PUSOY DOS BIG TWO MACAU CASINO:<br/>＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝<br/>- FREE TO PLAY &amp; UNLIMITED CHIPS REFILL!<br/>- Play this poker offline. There’s no need to connect to the internet to play.<br/>- Fun, challenging gameplay based on classic Chinese poker card game. <br/>- Attractive game design and animation resembling real Macau Casino.<br/>- Simplified gameplay with pointers and help to select the best poker hands.<br/>- Four Locations: Macau, Singapore, Las Vegas, and Paris. <br/>- Bet against four other AI players, assisted by helpful casino host. <br/><br/>There is no need to sign up, join, or login. Just open our game and start playing immediately! The first place to go is the Macau Casino, then you can unlock and conquer other places: Singapore, Las Vegas, and finally Paris. Check the World Leaderboard to see who’s the Top Players in each location. Do you think you have a shot of being a Top Asian Card Poker Game Player too? It takes practice and cleverness to win against the AI in our poker offline game. <br/><br/>So if you want to play poker offline and are bored with classic poker like Texas Hold’em, try Pusoy Dos now!<br/><br/>This game is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.", "metacritic": null, "released": "2017-03-01", "tba": false, "updated": "2019-09-09T05:26:11", "background_image": "https://media.rawg.io/media/screenshots/f57/f57e4f32c6aedba33d83cbab33733e2a_UjZ0wj5.jpg", "website": "http://www.kkqueen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Red Koda Software"], "genres": ["Board Games", "Card"], "publishers": ["Red Koda Software"], "esrb_rating": "Mature"}