{"id": 372922, "slug": "imperial-mahjong-free", "name": "Imperial Mahjong Free", "name_original": "Imperial Mahjong Free", "description": "Imperial Mahjong is a new Mahjong game from the maker of Random Mahjong. Imperial Mahjong uses the same advanced game engine to present a more traditional Mahjong experience. Featuring 144 levels of extremely challenging hand-crafted board layouts, this could take months to perfect all puzzles. The game uses a familiar 3 Star rating system to track perfected levels and more level packs will be added in future free updates. <br/><br/>This is a single player solitaire mahjong game, also known as Shanghai Mahjongg, Taipei Mah-Jong, Kyodai or Shanghai mahjongg. <br/><br/>The game uses an advanced shuffle/setup system giving you unique and challenging layouts every time you play. These levels are not designed for quick progression, but rather they are to be learnt and perfected over time. <br/><br/>You have control over many aspects of the look and feel, the camera Zooming/Scrolling, and the guides, hints, and suggestions during play. There is no confusing 3D here, just relaxing and challenging game play. <br/><br/>FEATURES: <br/>- 6 Level Packs containing 144 levels! <br/>- Advanced layout system results in very challenging levels! <br/>- Beautiful photo realistic tile graphics <br/>- Very simple to learn <br/>- Relaxing game play with no time limits. <br/>- Familiar \"3 Star\" system for tracking level pack progress. <br/>- Unique visual assist features <br/>- Solution walk-through available for every puzzle! <br/>- Layout rewind giving you unlimited repeat attempts! <br/>- Undo and Shuffle feature. <br/>- Game Center star tracking<br/>- iCloud Sync/Backup of level progress.", "metacritic": null, "released": "2013-07-23", "tba": false, "updated": "2019-09-09T05:28:39", "background_image": "https://media.rawg.io/media/screenshots/085/085cf7ac3d2dc4e83f45b5bea2a35af4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Paul Burkey"], "genres": ["Board Games", "Puzzle"], "publishers": ["Paul Burkey"], "esrb_rating": "Everyone 10+"}