{"id": 373167, "slug": "retro-space-shooter-itch", "name": "Retro Space Shooter (itch)", "name_original": "Retro Space Shooter (itch)", "description": "<p><strong>Retro Space Shooter<br/></strong></p>\n<p><em>Note: available for Windows and Android, see below!</em><br/></p>\n<p>This is my version of the old action shoot 'em up you could play on a lot of Nokia smartphones mobile devices. My focus was on keeping it simple but I could not resist adding a few power-ups to spice things up a little. Fly through the galaxy and dodge enemies and other obstacles and ... well ... shoot them up! Some bosses are already waiting four you to get hammered and I am planning to add a few more.<br/></p>\n<p><strong>How to play</strong></p>\n<p>It's simple. Use the left circle to move in all four directions. The right two circles are used to activate your power-up and to shoot.</p>\n<p>For the Android version:  I hope you got some fingers (at least two are recommended). Use back to pause the game.<br/>For Windows version: Use w/a/s/d to move, space to shoot and f to use your power-up. Use escape to pause the game. (You can also use the mouse, though this is more difficult)<br/></p>\n<p><strong>Source Code</strong></p>\n<p>You can have a look at the source code on my GitHub page. Additionally, you find a folder for Windows and Android that contain the same files as the downloads on this site.</p><p>I used the Love2d framework so the code you find is all lua.</p>\n<p>To create the Android app I used another software you can find here. Note that I have absolutely no part in it. It was simply a quick and easy way to generate an apk and play this game on mobile :) (which it was originally designed for).</p>\n<p>I hope you enjoy this game. If you have any trouble to get it running, or you want to provide some helpful feedback or have any other comments, feel free to post them here. Cheers!<br/></p>", "metacritic": null, "released": "2019-09-08", "tba": false, "updated": "2019-09-09T07:02:21", "background_image": "https://media.rawg.io/media/screenshots/826/8265e1b49c18c7bb1d5733bd4347a21a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["mxmlnbndsmnn"], "genres": ["Action"], "publishers": [], "esrb_rating": null}