{"id": 37320, "slug": "instinct", "name": "Instinct", "name_original": "Instinct", "description": "It’s so nice to live with the person you like, to have everything necessary for a good life, to depend on yourself and have a good time.<br/>Up till recently my wonderful life of leisure in the pet store ran its natural course, when suddenly a weird bozo appeared in the house. Why did Mistress hire him? Usually she doesn’t fancy strangers in the least. And we were doing well without his help anyway.<br/>Sometimes it feels far too suspicious to me.<br/>I’ll find out the truth behind it and make him disappear. Or maybe not…<br/><br/><ul><li>every resident of the house has a secret<br/></li><li>option to form a relationship either with a female (yuri) or with a male<br/></li><li>option to end the game without a romantic relationship<br/></li><li>In-game choices change the ending<br/></li><li>1080p window &amp; full screen options</li></ul><br/>Ginger – a playful, mischievous and sometimes arrogant cat who works at the pet store. She is endlessly thankful to her Mistress, who saved her from death’s clutches, so she does her best to be as helpful as she can. The government is hunting down the cats like Ginger, allegedly to save their population. But in fact they need these creatures for a totally different reason…<br/><br/>Evelyn – the owner of the pet store. At a glance, Evelyn can be taken for a successful entrepreneur. She is often away for business. She comes back home late and drops on her bed to fall asleep instantly. If you look closer however, everything will turn out to be much more complicated...<br/><br/>Christian – a weird guy, who appeared in the store not too long ago. Settled down in a small closet on the ground floor. Fulfills his duties to a T. Drinks a lot of coffee and always has his smartphone on hand. There’s definitely something behind his ominous gaze…", "metacritic": null, "released": "2007-08-22", "tba": false, "updated": "2023-07-22T22:48:31", "background_image": "https://media.rawg.io/media/screenshots/909/90943bc0c1af50f25c3d1275820ab1b0.jpg", "website": "", "rating": 1.36, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 81, "beaten": 5, "toplay": 5, "dropped": 4}, "playtime": 4, "achievements_count": 10, "ratings_count": 11, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC", "macOS", "Linux"], "developers": ["Digital Spray Studios", "Newtonic Studio", "VNeroGAMEs"], "genres": ["Action", "Shooter", "Casual", "Indie"], "publishers": ["TsunamiGames", "Wild Hare Entertainment"], "esrb_rating": null}