{"id": 373422, "slug": "clickable-coffee-shop-itch", "name": "Clickable Coffee Shop (itch)", "name_original": "Clickable Coffee Shop (itch)", "description": "<p><strong><em>Are you so addicted to caffeine that you want to play a game revolving around it? Well look no further!</em></strong></p>\n<p>Build a virtual coffee shop from the ground up in <strong>Clickable Coffee Shop!</strong> Click on the coffee bean to begin harvesting coffee beans, and it only progresses from there!<br/><br/>It starts off very simply; Click on the coffee bean, once you amass enough coffee beans, purchase an upgrade.<br/><br/>You will find, however, that the options in this game open up very quickly which enables the player (you) to have a lot of fun playing it.<br/><br/>There are several upgrades to purchase using in-game currency, and there are 3 types of in-game currency by the way;<br/><br/><strong>Coffee Beans:</strong> The currency that the player has the most access to when the game first starts. It is used to purchase early game upgrades, however if the user collects enough of them they can earn achievements for it.<br/><br/><strong>Premium Coffee Beans:</strong> A rare currency that only increments by 1 every time the user clicks on the coffee bean 100 times. As of right now, they are only used to purchase an upgrade called \"Faster Harvesting.\" Although Faster Harvesting is a very useful upgrade in the game, more uses for Premium Coffee Beans are planned for the future.<br/><br/><strong>Money:</strong> Exactly as it sounds. However, this currency is not unlocked until a certain point in the game. Very useful currency indeed.<br/><br/>There are 13 Achievements to unlock as of right now, and also an (experimental) stocks option where the player can purchase stocks in-game and possibly increase (or decrease!) their currency later on when selling them...<br/><br/>I don't want to spoil the game too much, but there is far more than what I just said above inside this game, and there is also a lot more planned for the future. Enjoy!<br/><br/>This game is always in an undergoing state of change, it is planned to be updated very frequently and (constructive please) user input is always welcome.<br/><br/><strong>Expected Playtime:</strong> Anywhere from 45 minutes to several hours, although progress in the game can happen indefinitely. The average playtime is expected to gradually increase with the release of new features.<br/></p>\n<p>(Clickable Coffee shop is an Incremental game created by Ajay Arora (aaror874). Collect coffee beans, purchase upgrades and stocks, and more!)<br/></p>\n<p>- 4 cheats</p>\n<p>- 6 in-game stock options using in-game currencies.</p>\n<p>- 10 upgrades</p>\n<p>- 13 achievements</p>\n<p>- Endless increasing numbers!</p>\n\n<p>Controls: Mouse &amp; Keyboard</p>", "metacritic": null, "released": "2019-09-06", "tba": false, "updated": "2019-09-09T08:08:36", "background_image": "https://media.rawg.io/media/screenshots/d18/d182954bac407427c110c1fdabc98390.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aaror874"], "genres": [], "publishers": [], "esrb_rating": null}