{"id": 373430, "slug": "unholy-commotion-dd28-demo", "name": "Unholy Commotion [DD28 Demo]", "name_original": "Unholy Commotion [DD28 Demo]", "description": "<p>You can't get a good night's sleep anymore. There's some kind of unholy commotion going on in the graveyard and it's putting you way behind on your beauty sleep. I guess that's why the property was so cheap, huh?</p>\n<p>Tonight, you've had enough. You grab your trusty pistol and set out to return peace and quiet to the neighborhood.</p>\n<p><strong>PLEASE READ BEFORE PLAYING</strong></p>\n<p>This title is a pre-pre-pre alpha. It will contain many bugs, and I'm not actually certain if restarting after death actually works properly, so watch out for that. Bug-fixing and adding in the options page took longer than expected so I didn't get nearly as much content added as I wanted - as a result, the dungeons are pretty repetitive and the minimap isn't super useful yet.</p>\n<p>It has ONLY been tested on Windows at 1920x1080, on the Very High preset. Results may be pretty wack on other settings.</p>\n<p>Aside from checking controls in Options, there's no real tutorial here, so here's a few nuggets to help you along-</p>\n<ul><li>You have one sidearm slot and two primary weapon slots. The Broomhandle and Makarov are  both sidearms, and the rest of the weapons are primaries. You can only hold one sidearm so you'll always swap out if you pick up a new one, but with primaries, they'll go into an empty slot if available, or whichever slot you have equipped if not available. </li><li>You can mantle onto a ledge that's above you by hitting jump again in mid-air while looking at the ledge. Handy for climbing around on stuff you can't quite reach!</li><li>You can press Interact (E) to climb on ladders</li></ul>", "metacritic": null, "released": "2019-09-06", "tba": false, "updated": "2019-09-09T08:10:25", "background_image": "https://media.rawg.io/media/screenshots/560/560cb8a9e80bd484d10030b2c1d95501.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jasozz"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}