{"id": 373551, "slug": "history-warriors", "name": "History Warriors", "name_original": "History Warriors", "description": "The ultimate match in history is today. Eight historic figures, together for the first time, combined in an exciting 2D Fighter. The worst villain in recent history was alive and his plan to change history is now in action. Is he going to succeed?<br/><br/><br/><br/>History Warriors brings to present time the following fighters: Abraham Lincoln, Joan of Arc, Cleopatra, Shaka Zulu, William Shakespeare, Ernesto \"Che\" Guevara, Napoleon and Mozart.<br/><br/><br/><br/><br/>In his first appearance in a fighting game, one of the most controversial figures in history is here. Adolf Hitler was not dead, but frozen, and wakes up in present time to pursue his evil ambitions. The most epic final boss is ready to kick some butt in Story mode.<br/><br/><br/><br/><ul><li>A unique roster of eight characters you've only seen in history books, making their debut in fighting games.<br/></li><li>Play in story mode and fight in the ultimate clash in history. Will you be able to bring your fighter back to their time?<br/></li><li>Versus mode allows you to fight against a friend in endless mode.<br/></li><li>Tournament mode allows you to play against up to 8 friends in an elimination tournament. <br/></li><li>One punch mode is a super fun mode where with only one hit you will win. What strategy will you use?</li></ul>", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-09-13T02:58:42", "background_image": "https://media.rawg.io/media/screenshots/799/799d3213bdf8c8d6e3f53187e0b05cf4.jpg", "website": "https://historywarriors.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Clipstories"], "genres": ["Action", "Indie"], "publishers": ["Clipstories"], "esrb_rating": null}