{"id": 373531, "slug": "dao-jian-tian-xia", "name": "刀剑天下", "name_original": "刀剑天下", "description": "Small games can also play with big rivers and lakes! The martial arts game \"Sword World\" is coming. You will become a talented young man, embark on the beautiful rivers and lakes road, in order to quickly sweep the various factions to fight all the heroes, and even replace their status, dominate the martial arts!<h3>Super high-motion picture quality, fierce battle</h3>The game has advanced self-study technology, the quality is called \"picture textbook\", has reached 1080p high-definition resolution, the quality of the image is more refined, and the scene is full of beautiful and beautiful country scenes. The break of the single action frame number of the game character from 6 frames to 10 frames ensures a smooth battle screen and can run smoothly on mobile devices. The movements of the characters and the effects of their skills are like flowing through the water. One stroke and one style show the martial arts style. The refreshing sense of blow is to let you immerse yourself in the martial arts battle!<h3> Heroes copy challenge Master hand when BOSS</h3>For the martial arts people, life is no better than the world's first, or have opponents and confidants. This game will bring you rich heroic challenge play, all kinds of martial arts masters will come to sit in the town as BOSS, take turns and you come to the field to master the sword fighting swordsmanship! When you defeat the heroes you admire, you will inevitably be full, especially when you become the first master of this service, you can also be the super big boss of the service, which can be said to be on the same level as the heroes, and the status of the rivers and lakes is detached.<h3> Massive peerless martial arts skills become a master </h3>The \"Golden Pavilion\", which has a huge amount of magical skills, can extract martial arts, internal strength, and light work, and has no learning restrictions. The magical moves are magnificent and magnificent, and they can be freely combined to create a unique style. The release of the turn brings an unprecedented smooth blow effect, and it is impossible to fight against the enemy! Brush the experience to upgrade the level does not need to swear, swear not to seal the knife offline gain, and the adventure game to help you get the value of the cheats to increase the combat power, without the liver can also become a generation of masters.<h3>Fluority of the martial art, the strength of the war, the head of the war </h3>Joining the martial art is earning! Challenge “Menpai Beast” to obtain martial arts vouchers and martial arts contributions; “Gentry Tasting” rewards materials for light work, “Gate banquet” rewards a lot of contributions and experience, and can also enjoy martial arts reinforcement skills, so that your role can be upgraded as soon as possible. The overall ability of the property is enhanced! Not only that, you can get the ingots for free when you complete the daily tasks of the martial art. You can also challenge the elders through the strength or become the head of the party!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-13T02:45:50", "background_image": "https://media.rawg.io/media/screenshots/4ec/4ec3258e058efbe49d754a6bf08e4b39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZLXGAME"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["ZLXGAME"], "esrb_rating": null}