{"id": 373569, "slug": "touhou-blooming-chaos", "name": "Touhou Blooming Chaos", "name_original": "Touhou Blooming Chaos", "description": "What is Touhou Blooming chaos? [/ h2]<br/><br/>A shrine maiden of the Hakurei Shrine, who has a constitution that attracts the incident-Reimu Hakurei went out and was taken to a different world like Gensokyo with mysterious power on the way back to the shrine.<br/><br/>Reimu was already used to being involved in various incidents. She immediately understood the current situation.<br/><br/>1. This is another parallel universe in the world of Gensokyo where she lives;<br/>2. The time of this world is a world where spell card rules have just been established, unlike the world where she lives;<br/>3. In front of her is a red fog incident;<br/>4. Go to that red mansion and beat up them for the time being! !<br/><br/>With Fuda and equipment, Reimu, the ghost extermination expert, has gone on the path of resolving the incident again.<br/><br/>At the same time, an oriental wizard who regularly comes to see does Reimu eats rotten food and died, Marisa Kirisame, came to this world together.<br/><br/>When the strongest two join together, the peace of this world will not return again! !<br/><br/>——Punish everyone who disturbs you in this world with a Dream Lock!Barrage S • RPG game! [/ h2]<br/><br/>Operate Reimu and Marisa and fight against the enemies in the game with two-headed characters. Unlike regular shooting games, players can explore the map more freely.<br/><br/>All of the original BOSS spell cards are owned and there are many ways to deal with them.<br/><br/><strong>There is also a new system! [/ b]</strong>", "metacritic": null, "released": "2019-10-01", "tba": false, "updated": "2019-09-13T03:08:30", "background_image": "https://media.rawg.io/media/screenshots/205/2056584312a2e9395ca28e0eb5ec6ecf.jpg", "website": "http://tbc.uzkk.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "toplay": 2}, "playtime": 3, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["二色幽紫蝶", "Re零同人社"], "genres": ["Action", "RPG", "Indie"], "publishers": ["二色幽紫蝶", "东游鉴"], "esrb_rating": null}