{"id": 373554, "slug": "enzbots", "name": "ENZBOTS", "name_original": "ENZBOTS", "description": "<strong>ENZBOTS </strong>Created by one person, over 4 years.<br/>Easy to play, hard to master, massively re-playable.<br/>2 player split screen fun, designed to put players, in a good mood. <br/>Can take 4 hours to fully complete.<br/>(Keep playing after the credits, 4th time around, is the hardest).<br/><br/>Features 13 levels 6 mini-golf, pool table, soccer, fight area, 4 shooting, and 3d scan of my lounge room (studio,) for the load levels area. <br/>Early levels allow time for new players to get used to the characters controls, juggling weapons, shields, and dash while keeping an eye on the ball, trying to stay alive. <br/><br/>Players share 4 different shaped characters, easily switched in-between, live in game, at any moment.<br/>(If player can master switching characters, then ENZBOTS can also be played by a skilled one player.)<br/><br/>Simple pause menu has, music up down, save / load, and pitch invert.<br/><br/>ENZBOTS will get the heart rate up, make you smile, and test your gaming ability.<br/>From beginners to experts ENZBOTS has challenged all, simple controls, but no button is left out. <br/><br/>\"I have played ENZBOTS thousands of times while testing a building, and each time something different would happen. AI’s brains are so random that no two game plays are the same”. <br/>“…all my heart and soul went into ENZBOTS”... Ian Gumby Mitchell, the creator.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-13T03:00:51", "background_image": "https://media.rawg.io/media/screenshots/e3f/e3fdae58a0bb8b82fb360d3ee968bb54.jpg", "website": "https://enzbots.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ian gumby Mitchell"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Ian gumby Mitchell"], "esrb_rating": null}