{"id": 373657, "slug": "arcade-archives-track-field", "name": "Arcade Archives TRACK & FIELD", "name_original": "Arcade Archives TRACK & FIELD", "description": "'TRACK &amp; FIELD' is a sports game released by KONAMI in 1983.<br/>It's a game that's easy to control and can be played by up to 4 people at once!<br/>Use the RUN button and JUMP button to aim for first place in the 100m sprint, long jump, javelin throw, 110m hurdles, hammer throw, and high jump for a total of 6 events.<br/><br/>The 'Arcade Archives' series has faithfully reproduced many classic Arcade masterpieces.<br/>Players can change various game settings such as game difficulty, and also reproduce the atmosphere of arcade display settings at that time. Players can also compete against each other from all over the world with their high scores.<br/>Please enjoy the masterpiece that built a generation for video games.<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1-4 players<br/>DUALSHOCK®4<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>Arcade Archives Series Produced by HAMSTER Co.*This game uses the overseas ROM for the main part of the game. The options menu and manual are available in Japanese, English, French, German, Italian, and Spanish.", "metacritic": null, "released": "2019-09-12", "tba": false, "updated": "2019-11-19T19:01:36", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7d5ee4846e800e0df4d9fdfe1892160.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Nintendo Switch"], "developers": [], "genres": ["Arcade"], "publishers": ["HAMSTER"], "esrb_rating": "Everyone"}