{"id": 373654, "slug": "trash-sailors", "name": "Trash Sailors", "name_original": "Trash Sailors", "description": "<p>Trash Sailors is a chaotic co-op roguelite survival game for up to two players.<br />\nYou play as a castaways who manage to survive trash tsunami and find yourself on raft in the middle of flooded world.<br />\nLooking for a place to live you&#39;ll have to collect garbage and recycle it to resources needed to keep the raft going.<br />\nDuring the journey you&#39;ll meet lot of strange creatures, odd dangers and surprises.<br />\nWorking with your companion you&#39;ll have to defy them and do everything to save the raft and yourselfs.The Journey:Discover five completely different and randomized areas, each one will bring a new challenge. Fight with big octopuses, deadly sharks, cunning penguins, mud alligators, wild tribes, and many more.<br />\nKeep moving no matter what. Sail through rains and storms, fog, and complete darkness.Castaways:You will meet other outcasts who will help you survive. They will be different and specialize in different activities.<br />\nFind new cozy outfits to customize.Local co-op for two players:Are you good at steering, firing cannons, fighting, gathering resources or maybe something else? Choose your favorite and work together with your friend to overcome obstacles.<br />\nBe ready to take over your companion&#39;s tasks at any moment as they might get suddenly pulled underwater.</p>", "metacritic": 68, "released": "2021-12-16", "tba": false, "updated": "2024-01-22T16:20:08", "background_image": "https://media.rawg.io/media/screenshots/f80/f80204edf19106f88fbeffc74ecc6c97.jpg", "website": "http://www.fluckymachine.com", "rating": 2.75, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 34, "beaten": 2, "toplay": 23, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 17, "ratings_count": 7, "suggestions_count": 626, "game_series_count": 0, "reviews_count": 8, "platforms": ["Nintendo Switch", "Xbox One", "PC", "PlayStation 4"], "developers": ["fluckyMachine"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["tinyBuild", "QubicGames"], "esrb_rating": null}