{"id": 373653, "slug": "chainmonsters", "name": "Chainmonsters", "name_original": "Chainmonsters", "description": "Chainmonsters is a massively multiplayer RPG inspired by Pokemon.<br/><br/><br/>What started out as a blockchain exclusive collectible game has fully fledged into an immersive MMO with players from around the world competing against each other to become the next world champion.<br/><br/>The game world is divided across 3 continents that each have their own flair and special history attached. Catch new Chainmons and assemble a team to counter your friends and foes! <br/>Compete against other players through Ranked play (Pre-Season available in Early Access) and gain ranks. Every week the best players in the world are assembled to act as the new Furious Five - the legends each player has to defeat before entering the hall of champions!<h3>Story Campaign:</h3>A meteor of some kind has hit the country and brought a mysterious plague with it - as a result the previously happily living Chainmons have evolved and seem to have become aggressive, attacking anyone leaving the safe roads and wandering into the wild. Professor Satoshi has made it her task to find a cure for this ever spreading disease and she needs your help! But you alone won't be enough - gather your friends, explore the darkest dungeons and find out what this plague is and how to cure it once and for all.<h3>Massive Online Experience:</h3>The game world runs on dedicated game servers that allow thousands of players to battle, explore and interact together in one huge open world. The game dynamically scales the number of players in your area depending on traffic while reserving space specifically for your friends. This way we have a great mix of a believable online multiplayer world while maintaining the beauty and vividness of story relevant missions.<h3>Cross-Platform:</h3>True Crosss-Platform experience being available from day 1(!) on PC/Mac and mobile (with consoles following).<br/>We believe that you should be able to have the same great experience no matter what device or platform you are gaming on - assemble your team on the phone in the Metro in the morning, compete against a friend on their console in the afternoon, and do some ranked play on your PC in the evening. Everything is connected.<h3>Quests: </h3>In addition to a streamlined story campaign there are daily, weekly and monthly challenges to be completed either by you or together with other players.<h3>Raids: </h3>As a real MMO we are putting a lot of focus in large community events and one of these examples are public Raids.<br/>Ever thought about battling with hundreds of players together to defeat a big boss?<h3>Customization: </h3>Your player is your avatar. Design it any way you like using a huge range of cosmetically items. Looking for a change? Unlock even more items by progressing the story and participate in events to claim exclusive visual rewards!<h3>Battle Mechanic:</h3>The main battle mechanic consists of two players and a team of 6 Chainmons each. Take turns to damage your opponent and try to counter them in any way. Look out for special events and modifiers that heavily alter the battles so you need to adjust to different situations!<h3>Abilities:</h3>Every few levels your Chainmons will learn new abilities. Only 4 abilities can be active at any time. However - you can dynamically change your Chainmons abilities on the fly outside of battles, to surprise your next opponent!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-13T03:53:02", "background_image": "https://media.rawg.io/media/screenshots/215/215af2c3c8b7a4afc856a91483b243b2.jpg", "website": "https://playchainmonsters.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["B-Side Games"], "genres": ["RPG", "Massively Multiplayer", "Indie"], "publishers": ["B-Side Games"], "esrb_rating": null}