{"id": 373641, "slug": "deadhaus-sonata", "name": "Deadhaus Sonata", "name_original": "Deadhaus Sonata", "description": "Deadhaus Sonata is a cooperative multiplayer, free-to-play, action RPG where you play the dead fighting the living.  An unstoppable force from Deadhaus, you are a monster among men, dealing death and destruction on a massive scale. <br/><br/><strong>Play the Dead</strong> - Play as Vampires, Ghouls, Revenants, Liches, Wights, Banshees, and Wraiths, Deadhaus Sonata focuses on asymmetric gameplay as you explore the grim world of Nogosaua.<br/><strong>Fast Paced Combat </strong> - Tear through hordes of enemies in visceral combat, through magick, melee, and terrifyingly gruesome attacks. <br/><strong>Endless loot</strong> - Collect unlimited amounts of distinct and unique weapons, armour, and artifacts. Use this loot to customize your character in a variety of ways and shape how your character fits into the complex political system of the realm.<br/><strong>Take Initiative</strong> - You make choices that have a lasting, maybe even permanent, affect on your character, and potentially on the world at large.<br/><strong>Community Driven Content</strong> - Create characters, levels, quests, and more using various creation tools that will be introduced into the Deadhaus world.<br/><strong>6 Player Co-op</strong> - Play with up to 6 people and assist each other in wreaking havoc on the living.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-13T03:44:05", "background_image": "https://media.rawg.io/media/screenshots/dda/dda145132763bb21f22cf2145e221fc4.jpg", "website": "https://deadhaussonata.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Apocalypse Studios"], "genres": ["Action", "RPG"], "publishers": ["Apocalypse Studios"], "esrb_rating": null}