{"id": 373642, "slug": "space-wreck-2", "name": "Space Wreck", "name_original": "Space Wreck", "description": "Inspired by classic western isometric RPGs (Fallout, Fallout 2, Arcanum), this is <strong>hardcore role playing game</strong> set in space 20 years post major conflict over asteroid mining.<br/><br/><ul><li> <strong>Role playing</strong><br/></li><li> <strong>Multiple solutions</strong><br/></li><li> <strong>Choice &amp; Consequence</strong><br/></li><li> <strong>Optional but unlimited violence</strong><br/></li><li> <strong>Non-linear world</strong></li></ul><h3>Role playing</h3>This is the most important part of the game - you can play whatever character you wish, play however you want to. You can be <strong>smooth talker</strong>, <strong>sneaky hacker</strong> or <strong>brawling bully</strong>; or something else - it's your choice: distribute the points in <strong>character creation</strong> and make <strong>decisions when playing</strong>.<h3>Multiple solutions</h3>There are always <strong>multiple ways</strong> to solve problems (quests), usually tied to your character skills and abilities - play to your character's strengths, work around its weaknesses. For example, if you cannot convince someone to help you, hack his computer and blackmail him. Or just straight up pickpocket the guy - all items are always realistically placed in NPC inventories.<br/><br/><br/><br/>Note: there are usually<strong> 3-8 ways to complete a quest</strong> in the game. They can trigger related events in near future or lead to a different ending in the end slides.<h3>Choice &amp; Consequence</h3>Your actions, your decisions <strong>matter to the game world</strong>. Make an enemy, you may need him/her later on. Opt for easier solution to current problem and you might have to deal with bigger problem later. And in the end you will get a <strong>unique game ending</strong> showing you future fate of your character and those who he/she impacted through gameplay.<h3>Non-linear world</h3>You have an objective but how you approach it - it's up to you; game map is as open to you as reasonably possible (it's stranded space ship after all) and there is no single true path to the end. If you know where to go, what to do - you can try to sequence break the game. Combine that with multiple solutions to every quest and you've got freedom to spare.<h3>Optional but unlimited violence</h3>You can complete the game without killing anyone. In fact, <strong>combat is completely optional</strong>. But if you want to fight - there are <strong>no immortal or \"essential\" NPCs</strong> - everyone everywhere has finite amount of HP and is fair game.<br/><br/><h3>Turn-based combat</h3>Game features old-school <strong>tactical turn-based combat</strong> with grid based movement, action points and dice rolls.", "metacritic": null, "released": "2020-02-28", "tba": false, "updated": "2024-02-24T16:19:30", "background_image": "https://media.rawg.io/media/screenshots/5e9/5e982808804f93130e5f9b38a59acd83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "toplay": 5, "dropped": 2}, "playtime": 1, "achievements_count": 12, "ratings_count": 3, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Pahris Entertainment SIA"], "genres": ["RPG", "Indie"], "publishers": ["Pahris Entertainment SIA"], "esrb_rating": null}