{"id": 373746, "slug": "cooking-frenzy-crazy-kitchen", "name": "Cooking Frenzy - Crazy Kitchen", "name_original": "Cooking Frenzy - Crazy Kitchen", "description": "Welcome to hug the cooking joy and feel the collecting fever! Cooking Frenzy is not only an Easy, Relaxing, Fast Paced cooking game. We tailored and fused the popular collecting and current cooking gameplays together, only to offer you more and different fun from those outdated machine-made cooking games!<br/><br/>A valuable album of worldwide cuisines are divided into pieces and lost in different countries for a long time… All the world class collectors, top gourmets and crazy chefs are looking for the lost cards and pieces. It is rumored that some famous restaurants are hiding the pieces in their kitchens, and use them as rewards for people who pass their cooking challenges. <br/><br/>As a cooking fever, you are invited to those challenges. Now you have the advantaged chance to make the album complete again. Accept this challenge! And start the treasure hunting around the cooking world! On this cooking dash adventure, you will:<br/><br/>- Travel across different countries! <br/>- Cook and Serve in various restaurants! <br/>- Beat the creative and addictive levels! <br/>- Feel the exotic taste of the fantastic cuisines!<br/>- Collect the precious cards of distinctive cultures!<br/>- Expand your collections and achieve great fame!<br/>- Master the secret recipes of the authentic food!<br/>- Claim generous rewards and gifts for your victory!<br/>- Enjoy the great graphics all about cooking!<br/>- Have a fast paced but relaxing time!<br/>- Get endless fun from the engaging progression!<br/><br/>Cooking cultures may be different, but the cooking craze are all the same! From North America to South America, from Europe to Asia, come and dive in the franticness in the kitchens of these worldwide restaurants! Achieve great fame and fortune, become a world class cooking master!<br/><br/>COOK<br/>- Tap to put right pieces of ingredients to make the target cuisines!<br/>- Remove the food from the cooker on time to avoid burn!<br/><br/>SERVE<br/>- Tap to serve the correct dishes the customers ordered!<br/>- Serve in time to keep the customers happy!<br/>- Complete serving task before the time or customers run out!<br/><br/>COLLECT<br/>- Open treasure boxes to collect the unique cards!<br/>- Redeem rare cards to complete the fancy sets! <br/>- Claim valuable rewards of signature collections!<br/>- Open the gourmet feast for all the restaurants!<br/><br/>LEVEL UP<br/>- Get culinary EXP to upgrade the restaurant by beating levels!<br/>- Unlock new challenges with new dishes and special kitchenwares!<br/>- Open new restaurants in the engaging progression! <br/>- Improve your cooking skill and cook worldwide food in real life!<br/><br/>Cooking Frenzy is made by the professionals who have been making cooking games for more than 10 years. Therefore, Cooking Frenzy is a high quality product full of sincerity, and has the most stable and consistent game experience. <br/><br/>No time to waste! Download and Play! <br/>Cook, Collect &amp; Have Fun Right Now!", "metacritic": null, "released": "2019-09-11", "tba": false, "updated": "2019-09-13T04:34:47", "background_image": "https://media.rawg.io/media/screenshots/126/126bdcd41988b1c25d9b83f9b41f0165_C35kHVQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DragonPlus"], "genres": ["Strategy", "Simulation"], "publishers": ["DragonPlus Game"], "esrb_rating": "Everyone 10+"}