{"id": 373766, "slug": "night-club-idle-tycoon", "name": "Night Club - Idle Tycoon", "name_original": "Night Club - Idle Tycoon", "description": "It's time to become rich in the world of Night life!!<br/><br/>Expand your Empire by creating the biggest Night club ever.<br/><br/>Become the richest Entrepreneur by building a night club in various richest cities in the world.<br/><br/>Start with a small Club in a beautiful city and turn it into the biggest Night club in the world. Build a Night club, Dance club, pool-side party club, VIP club, Casino Hall, etc., to attract more Customers(stags, couples and even Biggest celebrities to your Clubhouse) by expanding the space and giving offers. Double earnings from the Club through entry fees and spending on items in the Pub/ Club. Constant up-gradation of Building and characters to make it more lively.<br/><br/>Research and develop new features to improve the quality of your Night Club. Make your business fly high by inviting celebrities and VIP customers.<br/><br/>If you like idle and tapping games, you will enjoy this Night Club Idle Tycoon game. Night Club Idle Tycoon game is an easy-to-play game where you run your own business with different Clubhouses in the Game. Make important management decisions to build your empire and transform your small Clubhouse into a world's most renowned Night club.<br/><br/>Features:<br/>- Unlock Different cities for more profits.<br/>- Casual and easy gameplay.<br/>- Celebrities will bring more customers and gives extra gold to push the Business.<br/>- VIP zone always gives high amount compared to any zone in the Game.<br/>- Brilliant 3D Characters, animations, and 3D graphics.<br/>- Unique Clubhouse architectures.<br/>- Make important managing decisions to expand your business.<br/>- Save your progress in the cloud and recover it if you change your device.", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-13T04:43:45", "background_image": "https://media.rawg.io/media/screenshots/e93/e93ba4ce06145d3d8c8b3b100da8fb2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Street Lamp Games"], "genres": ["Simulation", "Casual"], "publishers": ["Street Lamp Games"], "esrb_rating": "Teen"}