{"id": 373779, "slug": "gems-quest-jewels-treasure", "name": "Gems Quest - Jewels Treasure", "name_original": "Gems Quest - Jewels Treasure", "description": "Gems Quest - Jewels Treasure, classic jewel &amp; gems crush addictive match-3 type game with lots of mysterious!<br/><br/>THE JOURNEY START:<br/>Follow Archaeologist Digger exploring the ancient mysterious Egyptian pyramids.<br/>There are many dangers in Pyramid, such as poisonous gas, magical mummies, and death.<br/>You need to avoid these dangers to get more special gems. Don't hesitate. <br/>Study the mysterious treasure chest. <br/>There are ancient treasures in the chest, exploring the key to the unknown world.<br/><br/>GO FOR THIS ADVENTURE:<br/>- Digging the secrets of Rune gems and unlock the treasure with gems stone.<br/>- USE your fingers: slide, switch and match 3 or more jewels to rock pyramid world.<br/>- Embark on egypt pyramid match 3 journey with exploring fun. Mysterious Egypt world, hundreds of well-designed free levels!<br/>- It's aim is complete the objectives in limited moves or time. Match 3 or more identical jewels. Defeat the Death. Get Hawkeye gold coins.<br/>- Stunning graphics with a highly polished interface. play with fictional character Egypt Queen. Continuous Elimination can get extra scores quickly.<br/><br/>HOW TO PLAY:<br/>: In each level,a specific list of goals that need to be completed.<br/>: Match 3 more identical jewels quickly and swap colorful jewels.<br/>: Must have the sharpest mind. Learn to use special jewels or props.<br/>: Swap two special jewel-gems, make super combination.<br/>: Make T or L matching to get bomb gems stone.<br/>: Match 5 gem-jewels to be Color Beetle Gem, eliminating all the same color. <br/>: Use power-ups in tricky levels.<br/>: Less moves, More Stars, Higher scores! Crush all jewels.<br/>: Pass the levels and try to get all stars in each level.<br/><br/>Follow your friends to embark on this mysterious adventure of the Egyptian pyramid journey.", "metacritic": null, "released": "2017-10-18", "tba": false, "updated": "2019-09-13T04:49:30", "background_image": "https://media.rawg.io/media/screenshots/372/372e26c17a4087108291d0bb85d54479_RTc0u3m.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IvyMobile"], "genres": ["Strategy", "Puzzle"], "publishers": ["IVYMOBI"], "esrb_rating": "Everyone 10+"}