{"id": 373773, "slug": "helix-dash-twist-and-run-game", "name": "Helix Dash: Twist and run game", "name_original": "Helix Dash: Twist and run game", "description": "Twist the helix spiral as you run to avoid obstacles. Do you have what it takes?<br/><br/>◉ Dash through tubes and tunnels<br/>◉ Jump up to leap over obstacles<br/>◉ Use boosts to sprint and run through walls<br/>◉ Collect gems to unlock new characters<br/><br/>Subscription Terms<br/><br/>ELITE ACCESS offers a weekly subscription. You will have a 3-days FREE trial period and after this period you will be charged $4.99 per week until canceled.<br/><br/>What you receive after buying this subscription:<br/>◉ Protective shield that offers a second chance on each level!<br/>◉ Access to all characters!<br/>◉ No ads!<br/>◉ Earn gems 2x faster!<br/><br/>This is an Auto-renewable subscription. The payment is charged to your iTunes account after confirmation. The subscription is renewed unless you turn it off 24 hours before the period ends. Your iTunes account will be charged for renewal as well.<br/><br/>The prices are established for United States customers. Pricing in other countries may change and actual charges may be converted to your local currency.<br/><br/>End of trial and subscription renewal:<br/>◉ The payment is charged to your account after a confirmation of purchase.<br/>◉ The subscription is renewed unless you turn it off 24 hour before the end of the current period.<br/>◉ The account will be charged for renewal within 24 hours before the end of the current period at the cost of the weekly subscription.<br/>◉ The user may manage the subscription and auto-renewal have to be turned off by going to the user’s account settings after purchase in the Store.<br/>◉ No cancellation of the current subscription is allowed during the active subscription period.<br/><br/>Canceling a trial or a subscription:<br/>◉ If you want to cancel a subscription during its free trial, you have to cancel it through your account in the Store. This must be done at least 24 hours before the end of the free trial period to avoid being charged.<br/><br/>Please visit https://support.apple.com/HT207865 for more information about subscription billing.<br/><br/>Privacy Policy and Terms of use : https://adgem.com/legal/<br/><br/>Music by Evan Arnett", "metacritic": null, "released": "2018-06-06", "tba": false, "updated": "2019-09-13T04:46:47", "background_image": "https://media.rawg.io/media/screenshots/940/94027591d9cc46c1a456022663ea5280.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AdGem"], "genres": ["Action", "Casual"], "publishers": ["AdGem"], "esrb_rating": "Teen"}