{"id": 373721, "slug": "saint-seiya-awakening", "name": "Saint Seiya Awakening: Knights of the Zodiac", "name_original": "Saint Seiya Awakening: Knights of the Zodiac", "description": "<p>Saint Seiya Awakening: Knights of the Zodiac - Coming Soon!<br />\nThe officially licensed hero collection strategy RPG based on Masami Kurumada’s renowned Saint Seiya series is now available! Relive the epic saga, enriched with stunning landscapes and beautiful graphics to bring all your favorite Saints to life in full 3D! Enjoy the original BGM from the show as well as performances from the official Japanese voice actors for a truly first-class audiovisual experience!<br />\nCollect every character from the series! Mix and match to create your own strategies. In Knights of the Zodiac, even the weak can overcome the strong! Try out a wide range of engaging game modes~<br />\n[Thirty-Five Years - The Return of a Classic]<br />\nThe Japanese manga classic returns in style!<br />\nAs a next-generation game licensed by Kurumada Productions, Saint Seiya Awakening: Knights of the Zodiac lets you experience the time-honored battle manga like never before, from the Galactic Duel to Sanctuary&#39;s Twelve Temples; from Poseidon&#39;s Temple, to the Wailing Wall, and finally to Elysion!<br />\nTake a trip down memory lane with classic tracks such as &quot;Pegasus Fantasy.&quot; Burn! My Cosmo, burn!<br />\n[Saints by the Hundreds: Ready for Action]<br />\nYour favorite heroes and villains are all here. Whether it&#39;s the unstoppable Pegasus Seiya, the compassionate Andromeda Shun, the Twelve Gold Saints, the Specters, or even the Goddess Athena herself: they&#39;re all waiting for you to summon them into battle.<br />\nThe game brings over one hundred of Masami Kurumada’s original characters to your mobile device. Witness the birth of a new legend!<br />\n[Team Synergies &amp; Epic Battles]<br />\nBuild your dream team from a comprehensive selection of Saints, each with unique abilities and traits. With the right synergy, even Bronze Saints can defeat Gold Saint opponents! Use your strategy and wits to claim victory over the odds! Unleash your Saint&#39;s powerful abilities with just the tap of a finger and activate their Seventh Sense to unlock their true battle potential!<br />\n[Galactic Duels, Global Pick &amp; Ban Duels]<br />\nEnter the Galactic Duels stage where Saints fight for the Gold Cloth! Test your skills against players from around the world in real-time PvP battles with balanced matchmaking! Utilize the Pick &amp; Ban duel system adopted from the E-Sports to take your strategy to the next level!</p>", "metacritic": null, "released": "2019-09-11", "tba": false, "updated": "2023-03-21T17:49:33", "background_image": "https://media.rawg.io/media/screenshots/0af/0afe2656b53d1f8b25f189fa462052bd_ahF9mos.jpg", "website": "https://sskotz.gtarcade.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 302, "game_series_count": 10, "reviews_count": 3, "platforms": ["iOS", "Android"], "developers": ["YOOZOO (SINGAPORE) PTE"], "genres": ["RPG", "Strategy"], "publishers": ["YOUZU (SINGAPORE) PTE"], "esrb_rating": "Teen"}