{"id": 373722, "slug": "million-lords", "name": "Million Lords", "name_original": "Million Lords", "description": "“Millions Lords is a mobile strategy game unlike any others, with a strong emphasis on combat and conquering, and a season-based leaderboard progression. Unlike other conquest games, you don’t have to spend hours upon hours upgrading buildings and manually-creating armies.\" Bluestacks.com<br/><br/>Conquer the cities of other players, defend your territory against invaders and plan for your ultimate victory: seating on the throne of the Three Lands!<br/><br/>MAIN FEATURES:<br/>- No city building, no farming, or timer!<br/>Original and unique strategy gameplay.<br/>- Online multiplayer: <br/>Team up and plan organized attacks with your clan!<br/>- An RPG skill tree: <br/>Choose between 10 talents to strengthen your skills.<br/>- 60 craftables items: <br/>To adapt your strategy in real-time!<br/>- A procedural and persistent world:<br/>The Three Lands never stops evolving!<br/><br/>PLAY WITH YOUR FRIENDS<br/>- Make friends in Million Lords and create the greatest clan together!<br/>- Fight for your brotherhood and be a rightful leader!<br/><br/>COMPETITIVE MMO<br/>- In Million Lords, everything is about conquest and empowerment!<br/>- Expand your territory beyond all expectations: the only border is your determination.<br/><br/>TIP THE SCALES<br/>- Every month, we will crown a new player and it could be you! <br/>- Start fresh like everyone at the beginning of each season: keep your obtained gears and try to climb the leaderboard! <br/><br/>SPECIALIZE AND IMPROVE YOUR STRATEGY<br/>- Choose your skills and create your own Lord: your hero, your choice!<br/>- Specialize your kingdom and hero in resources, army, gold production or other paths to face the enemy!<br/><br/>--<br/><br/>CONTACT US:<br/>support@millionvictories.com", "metacritic": null, "released": "2019-06-27", "tba": false, "updated": "2022-11-12T08:14:05", "background_image": "https://media.rawg.io/media/screenshots/7e8/7e849ddc591589bc920c2c89f047a480_0c4JpVZ.jpg", "website": "https://millionlords.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Million Victories"], "genres": ["RPG", "Strategy"], "publishers": ["MILLION VICTORIES"], "esrb_rating": "Everyone 10+"}