{"id": 373744, "slug": "ninja-prime-tap-quest", "name": "Ninja Prime: Tap Quest", "name_original": "Ninja Prime: Tap Quest", "description": "Tap through the galaxy, hone idle ninja quest skills against the Shogun, tap to defeat space horrors, and carve out your revenge on the empire in this unique Tap RPG! Allocate skill points, complete quests, collect unique items, and upgrade your way across space in Ninja Prime: Tap Quest!<br/><br/>This is a Space RPG Quest game like you’ve never seen. Battle ronin, train your ninja jutsu, tap to upgrade your skills and choose your abilities to survive the Shogun. Tap to attack, collect resources and use your abilities to quest through space and slay slavering savages serving the scheming shogun!<br/><br/>Ninja Prime: Tap Quest Features:<br/><br/>Tap to Explore Space<br/>-Discover Galaxies with unique game-altering mechanics!<br/>-Go on Quests to reclaim Planets and earn resources!<br/>-Collect resources along the way as you quest &amp; upgrade new tap ninja skills!<br/><br/>Battle Ninja Hordes<br/>- Face off against the Space Mercs, Cosmic Cult Ninja, and Technocrat Alliance!<br/>- Strategically select the best ta- skills for each quest!<br/>- Battle the fearsome Dark Shogun to survive and craft rare loot!<br/><br/>Craft Ninja Gear<br/>- Collect resources to unlock new tap abilities!<br/>- Collect items and use them carefully to multiply your power at the perfect moments!<br/><br/>Tap Ninja Action<br/>- A unique genre fusion - play as much or as little as you like!<br/>- Your ninja keeps completing quests without you!<br/>- Return to tap and collect the loot and riches your hero collected while you were away!<br/><br/>Lovers of retro RPG games and incrementals won’t be able to put down this quest filled ninja epic. Go on an epic tap quest, explore space to battle monsters, and defeat tough cosmic bosses. Master the Cosmos in Ninja Prime: Tap Quest! Enjoy it online or offline!", "metacritic": null, "released": "2019-09-11", "tba": false, "updated": "2019-09-13T04:33:59", "background_image": "https://media.rawg.io/media/screenshots/739/739ad7ac4670eefbb675dc03d1d1b3ac_vaXJciF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Iron Horse Games"], "genres": ["RPG", "Simulation"], "publishers": ["Iron Horse Games"], "esrb_rating": "Teen"}