{"id": 373857, "slug": "the-renaissance-of-evil-full", "name": "The Renaissance of Evil Full", "name_original": "The Renaissance of Evil Full", "description": "Walk the Renaissance Italy in a thrilling mystery game as you explore the secret city of alchemists. Solve puzzle mini-games and find clues in hidden object scenes.<br/><br/>When a mysterious plague spreads across the country, the rumours of a miraculous cure fly from mouth to mouth. Apothecarium has gathered the brightest minds of the Renaissance, most renowned artists and scientists. That’s why Duke Medici, Master of Florence, sent his family there when the epidemic broke out… for a danger worse than the disease. Tasked to investigate their disappearance, you are now to explore the hidden city of alchemists with its dangerous mysteries.<br/><br/>Features of this engrossing HOG:<br/>- Enthralling hidden object adventure in the Renaissance setting<br/>- 20+ mini games of puzzle and skill type<br/>- Collectible coins to purchase upgrades<br/>- Hidden object locations with morphing items and zoom scenes<br/>- Replayable puzzles and HOS<br/>- Alternative Match 3 puzzles<br/>- Immersive cutscenes and professional voiceovers<br/>- Integrated step-by-step strategy guide<br/>- Bonus quest to unlock in when you complete the main adventure<br/><br/>Journey back in time and and roam the deserted streets finding items to help you proceed with the investigation. Live through a detective story and unmask the villain who will stop at nothing to retrieve an elixir of immortality. As you complete hidden object puzzles, you may receive up to 3 coins to be spent for various upgrades in the Shop. Also every location contains hidden collectibles which add coins to your purse. If you are not fond of seek-and-find, you may switch to the alternative Match 3 gameplay anytime.<br/><br/>This HOPA game also brags a variety of brain-teasers to compliment the adventure. These are tile-matching and jigsaw puzzles, a host of classic board games (e.g. hashi or tangrams), and arcade minigames like maze solving. Lucky chests which you might encounter here and there offer extra challenge for devoted puzzlers. It’s an option to earn additional bonuses for solving sliding puzzles and other brain-teasers. By showing your wits and skills, you may win up to 20 trophies. Otherwise, if you need a prompt, a build-in walkthrough is there to help you.<br/><br/>So, wait no more and delve into a haunted historical mystery full of intrigue!", "metacritic": null, "released": "2018-12-29", "tba": false, "updated": "2019-09-13T05:26:08", "background_image": "https://media.rawg.io/media/screenshots/82d/82d5779e2608c911d9af82d5491dacaf_Phzy7Cu.jpg", "website": "https://www.facebook.com/Absolutist.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Absolutist"], "genres": ["Adventure", "Puzzle"], "publishers": ["Absolutist"], "esrb_rating": "Everyone 10+"}