{"id": 373862, "slug": "paper-doodle-craft", "name": "Paper Doodle Craft", "name_original": "Paper Doodle Craft", "description": "Paper Craft is an endless notebook rocket doodle racer that starts slower and gets faster as you play. Tilt to move your craft through obstacles while simultaneously tapping the screen and certain enemies to fire bullets  or homing missiles to destroy them.<br/><br/>Key Features and Gameplay:<br/><br/>-Tilt screen to move left and right.<br/>-Tap the screen anywhere to fire normal bullets.<br/>-Act quick and use your plasm bombs to create a temporary force field around your craft to destroy other enemy craft missiles and suicide bombers before they lock onto you.<br/>-Tap specific obstacles and enemies on the screen to fire homing missiles to blow them to kingdom come!<br/>-See your own creations come to life! Submit your own doodle crafts to be placed as the \"featured craft\" of the week with your name and country, playable by everyone!<br/>-Destroy crates and rare \"party balls\" to Collect items and squiggles to purchase new craft racers and canvas backgrounds.<br/>-4 initial crafts to unlock, each with its own unique stats for Speed, Energy and Recharge.<br/>-4 Initial canvas backgrounds to unlock, notebook paper, grid paper, old parchment paper and concrete side walk.<br/>-Unlock new power ups by completing achievements. <br/>-Endure for awhile and stock up on missiles and plasma bombs to destroy the armored tank craft for extra points.<br/>-New content &amp; themes added every week<br/><br/>-No in app purchases or annoying adds! Purchase the game once and have all the content including future updates available forever.<br/><br/><br/>Following our company mission to provide fun and wholesome entertainment and to honor and give glory to Jesus Christ, an uplifting verse of the Bible will be displayed briefly after the Logo screen after initial game app start up.", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-13T05:28:21", "background_image": "https://media.rawg.io/media/screenshots/454/454de500de46ee8fae719237f80e5067.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Paul Perkins"], "genres": ["Action", "Racing"], "publishers": ["Paul Perkins"], "esrb_rating": "Everyone 10+"}