{"id": 373899, "slug": "summer-coast-guard-3d-jet-ski-rescue-simulator", "name": "Summer Coast Guard 3D: Jet Ski Rescue Simulator", "name_original": "Summer Coast Guard 3D: Jet Ski Rescue Simulator", "description": "It’s summer season! Wanna experience thrill and adventure to work as a lifeguard saving lives at the beach? Start working as coastguard to rescue civilians in beach rescue game. Hop on jet ski and grab life saving equipment to lookout for people in trouble on sandy beach around tropical island. <br/><br/>Take jetski from the beach parking and ride around island to watch out for people in danger. Respond to emergency situations like fire inflamed at beach party. Grab binoculars to lookout for trouble from the watchtower around the island and be ready to respond to emergency. Wide range of rescue vehicles are parked near watch tower like quad bike, ambulance and motorboat. Take your surfboard and swim towards a drowning person to perform your rescue duty. Warn swimmers as sharks are underneath the water. Sail motorboat or jet ski to save surfers when there is a danger of shark attack.<br/><br/>Experience beach life and explore visually stunning tropical island environment. Show your power boat sailing skills to save lives as time is short. Perform thrilling rescue missions and be on top in your coastguard rescue team.<br/><br/>Game Features:<br/>Challenging lifeguard rescue missions<br/>Range of vehicles: quadbike, jet ski, motorboat, ambulance<br/>Different control scheme for multiple vehicles<br/>Visually stunning graphics and realistic environment<br/>Exotic tropical island beach to explore<br/><br/>Enjoy the unique gameplay and give your feedback to help us improve this game in future releases.", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2019-09-13T05:49:34", "background_image": "https://media.rawg.io/media/screenshots/1e7/1e799f1ea3b0b8815a49f09acb55ddfd_THdxORK.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Adventure", "Simulation"], "publishers": ["Techving"], "esrb_rating": "Everyone 10+"}