{"id": 373904, "slug": "counter-terrorist-pro", "name": "Counter Terrorist Pro", "name_original": "Counter Terrorist Pro", "description": "Are you a fan of the good old counter terrorists battles? Here is some news for you: There is the best 3D First Person Shooter in real-time.<br/>Take the part in the vanguard at the battlefield of Critical Strike!<br/><br/>You will love the shooting experience on your mobile device! It is FREE to play !<br/>Compete with people around the world and show your skills.<br/><br/>===GAME FEATURES===<br/> AAA quality modern graphics with easy controls!<br/> Small size ( No additional downloads)<br/> multiple maps to try different tactics!<br/> 8Weapons: guns, pistols, snipers, automatic rifles, shotguns, grenades!<br/> Perfect optimization even for weak devices!<br/><br/><br/><br/>===MORE FEATURES===<br/> Great 3D graphics and sound, so perfectly adapted for New Action Games.<br/> Many teams for counter (SWAT,GIGN,Spetsnaz,Seal...)<br/> Many teams for terrorist (Anarchist,Gangster,Balkans...)<br/><br/>This year’s best graphics 3D First Person Shooter experience will make you spend your time playing Critical Strike!<br/>If you are dead don’t forget where you get hit for counter attack get your revenge!<br/>Join the competitive combat in the most skill-based portable FPS!<br/>If you always wanted to play a great shooter on your mobile device, your dreams are now true!<br/>You can enjoy the improved graphics and enticing sound effects of this free online games!<br/>Are you ready to strike counter enemies?<br/>Awesome FPS CS game GO!<br/>First person shooter and shooting game made with Unity to optimize online FPS gun experience.<br/>Regular updates and new elements are waiting for you!<br/>Download now and join the Critical Strike community!", "metacritic": null, "released": "2019-04-30", "tba": false, "updated": "2019-09-13T05:52:15", "background_image": "https://media.rawg.io/media/screenshots/230/23075a75d6481a5842a97a882b44926b_kykRQnf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["khizar Tariq"], "genres": ["Action", "Sports"], "publishers": ["khizar Tariq"], "esrb_rating": "Mature"}