{"id": 373908, "slug": "need-of-speed", "name": "Need of Speed", "name_original": "Need of Speed", "description": "Need of Speed for Fast Car Racing is real furious car racing game. Fast Racing game offers you unique driving experience that you can choose your own racing style. Race you car with high speed through highway and set new high standards for mobile car racing games. Reality of high speed car racing game with extremely high quality graphics and beautiful surrounding graphical environments. Need of Speed for Fast Car Racing is the best racing game you have been looking for.<br/><br/>This best car racing game lets you steer your car at unimaginable speed, giving you the heart pumping and enthralling experience that you’ve always dreamed of. Get behind the wheels of world fastest cars and feel like a real car racer when he drives in a race. Make drifts and dirty tricks, fight for life or death and use your manual skills and achieve perfection in racing and make fast circuits on in asphalt races - feel the speed if you need it. If you like real car racing games then this is the best 3D racing game for you with realistic racing view.<br/><br/>Fast cars racing on the asphalt, drift and drag driving with no regard for death - what else could you want? Use your need for adrenaline to become a furious racer and leave your rivals far behind by forcing your car to speed beyond anything you ever imagined. Test your determination, reflex and driving skills and have extreme fun on high speed in car race simulator. Try to complete it successful with best time and you will be king of the road. Have a great fun and race you car with fast speed and overtake other cars.<br/><br/>Need Speed for Fast Car Racing Features:<br/>** real racing experience with arcade features<br/>** Best car Racing Experience<br/>** High quality 3D stunning graphics<br/>** Real racing in illegal races<br/>** Become champion on asphalt racing<br/>** Extremely fast and addictive gameplay<br/>** The most realistic 3D car driving simulation<br/>** Free clash racing in car racing 3D<br/><br/><br/>Drive car on highway and complete perfect shift! Drift no limits, improve your ride and to be a king of drift in Need Speed for Fast Car Racing.", "metacritic": null, "released": "2019-05-22", "tba": false, "updated": "2019-09-13T05:54:46", "background_image": "https://media.rawg.io/media/screenshots/9ca/9ca97aeedc0b5bb6c173f95234192299_IJYJwHM.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["khizar Tariq"], "genres": ["Sports", "Racing"], "publishers": ["khizar Tariq"], "esrb_rating": "Everyone 10+"}