{"id": 374011, "slug": "precious-time", "name": "Precious Time", "name_original": "Precious Time", "description": "<p>Weekly game jam themed \"5min Hero\" -48 hours game jam themed \"Teleport\".GameDevHq</p>\n<p>I made this game for both of these jams and this is my second time making a game for a jam thanks for playing.</p>\n\n<p>Time is precious... We want the things that we love to last forever while short-live the hated ones.</p>\n<p>In this 2D platformer game the player can manipulate time to his will to capture the things he loves and making quick the hated experiences. It's all about adapting and molding the flow of time. It is about SURVIVING.</p>\n<p>I interpreted the teleport theme of the jam from a relativity side. Teleportation : \"transport or be transported across space and distance instantly\" . By making the time slower close to stopping and you are able to move every move of yours is a teleportation.</p>\n<p>I interpreted the \"5 min hero\" theme as a 5 min as being the time it takes for the player to obtain his time powers. But \"5 min\" will change according to the player and his using of how much he uses his time altering abilites.<br/></p>\n<p>Controlls</p>\n<p> awd:movement </p>\n<p>mouse RClick: fastens time</p>\n<p> mouse LClick: slowstime</p>\n\n<p>when time is slow Red Hearths can't damage the player</p>\n<p>when time is fastened Black Hearths can't damage the player</p>\n<p>When purple bar is up player can gather points with colliding both type of hearths.</p>\n<p>Players objective is to dodge the hearths around with speeding up and down the time until it's frenzy time. Than it is the hearths that are hunted.</p>", "metacritic": null, "released": "2019-09-12", "tba": false, "updated": "2019-09-13T06:30:21", "background_image": "https://media.rawg.io/media/screenshots/aec/aec0cc72c37a26225f8fe34158bafe38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Puntarr"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}