{"id": 374069, "slug": "reflex-shooting-games", "name": "REFLEX - Shooting Games", "name_original": "REFLEX - Shooting Games", "description": "<p>Have you ever played shooting games with a style reminiscent of a modern graphic design poster? Well, here you have it.<br/>Experience an unique atmosphere in this shooter, floating around a dreamy blobby environment while defending yourself from Bad Tri guys!<br/><br/>REFLEX - Shooting games is a part of shooting games family where you are required to confront your enemies while orbiting around a planet switching directions to aim at opponents spawning up either on outer or inner orbits.<br/><br/>What sets this apart from other 2D shooting games is that, you are constrained on a single orbit and you must use your REFLEXESto dodge and survive as long as possible while shooting them down.<br/>Apart from you the larger Bad Tri guys on outer orbit can kill the smaller Bad Tri guysin the inner orbit while the smaller ones are not provided with such privileges. You can kill both and both can kill you but the smaller guys are dumb enough to get killed by bigger Bad Tri guys. Apparently evolution is partial !!<br/><br/>Compete with your friends with your local leader-board just it was with the nostalgic arcade games. Have courage to compete globally ?? We&amp; got Global leader-board<br/>for you to face against the top player around the globe !! Just Sign into your Google Play games account and enjoy.<br/><br/>You've got two power up to brace yourself-<br/>1. Slow-mo<br/>2. Double shoot<br/>You get one of each every time you begin your killing spree, so use it wisely !! Need more though, its always on sale !!<br/><br/>Features:-<br/>-Fast paced action packed arcade game<br/>-Soothing Soundtracks<br/>-Mesmerizing atmosphere<br/>-Easy and simple controls<br/>-Unique meta-ball type floating background<br/>-Modern Graphic design inspired aesthetics<br/>-Endless battle<br/>-Local leader-board<br/>-Global Leader-board<br/>-Share your progress online<br/>-Google play game achievements<br/>-Unique Power-ups<br/>-Challenging gameplay<br/>-Vibrant eye catching Graphics<br/><br/>If you are searching for free games or arcade games, you might have found the jackpot !!(Did we just promote ourselves :) LOL !!)<br/><br/>Connect with us via social handles:-<br/>Instagram:-https://www.instagram.com/void1gaming/<br/>Facebook:-https://www.facebook.com/void1gaming/<br/>Twitter:-https://twitter.com/void1games<br/>Youtube:-https://www.youtube.com/channel/UCmo7OkbhOveC1zfr2GHfoAw/featured<br/>E-mail:-void1gaming.official@gmail.com-Easy and simple controls<br/>-Unique meta-ball type floating background<br/>-Local leader-board<br/>-Global Leader-board<br/>-Share your progress online<br/>-Google play game achievements<br/>-Unique Power-ups</p>", "metacritic": null, "released": "2019-09-12", "tba": false, "updated": "2019-09-13T06:44:47", "background_image": "https://media.rawg.io/media/screenshots/d1e/d1e193810b4c919a4a8064eb54994fdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["void1gaming"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}