{"id": 374191, "slug": "brck", "name": "BRCK", "name_original": "BRCK", "description": "<p>Team name – the brotherhood of BRCK\r\n  </p>\n<p>Game name - BRCK\r\n  </p>\n<p>Team credits:</p>\n<p>Konstatin Djurickovic – lead designer, game developer, animator\r\n  </p>\n<p>Darko Tomic – Lead AR game developer\r\n  </p>\n<p>Ela Gray – Lead character designer, animator\r\n  </p>\n<p>Katerina Bakaliou – Lead game architect, game developer/designer\r\n  </p>\n<p>Dimitar Kitanovski – Web developer, game design\r\n  </p>\n<p>Stefan Jovanchevski – Web developer, game design\r\n  </p>\n<p>Sergej Slisko – Game developer, project manager\r\n  </p>\n<p>  </p>\n<p>The BRCK is a local multiplayer (1-2 players) game that is played on the 5x5 board with 3 types of cubes.\r\n  </p>\n<p>Players choose roles between puzzler and solver where puzzler sets up the stage with starting and ending point, and places immovable obstacles to add more difficulty when solving the puzzle. The solver is granted with the 3 cubes and his goal is to move the AR character along the cubes while trying to solve the puzzle.\r\n  </p>\n<p> \r\n  </p>\n<p>CUBES – you start the game with 7 cubes, each having its own specific function. Each cube is 5x5cm, with a specific abstract pattern printed on it.\r\n  </p>\n<p>When placed on the board, STARTING and ENDING cube provides the player with starting point and ending goal.   </p>\n<p>OBSTACLE cubes are used to prevent seamless streamlined gameplay and forces the player to think and calculate his next move around the obstacles. Puzzler has 2 OBSTACLE cubes that can be used to add difficulty to the gameplay.\r\n  </p>\n<p>ENVIRONMENT cubes are the main playing cubes of the BRCK game. The main character moves around the cubes, connecting and creating the pathway on his way to the ending point. Player can use all tiles on the cube, going back and forth, up and down, in all directions around the cube with the character, adding more layers of perspective, fun and gameplay replayability, but with some basic rules forcing the player to strategize his next move.\r\n  </p>\n<p>Each ENVIRONMENT cube has 6 different environment tiles, each representing a climate change and/or nature. There are 3 passable, or good, and 3 impassable tiles/environments, or bad.  3 passable tiles are – Water, Plain and Forest; and 3 impassable environments are Fire, Chasm, Iceberg.  The character can move across passable, tiles, but when is confronted with bad, impassable tiles he needs to go around it.   </p>\n<p>The number of good environment tiles is limited per cube. Tiles are distributed in to 3, 2 1, order, meaning there are 3 good tiles on the first cube, 2 good tiles on the second cube, 1 good on the third. Character can move across good tile only 2 times, so player can a specific tile only twice on his journey making it harder to reach to the end.\r\n  </p>\n<p>PLAYERS – There can be up to two players playing the BRCK, each inheriting a specific role. Thera are two distinctive roles, making the game more fun and engaging when setting up the board.   </p>\n<p>The first role is the PUZZLER – puzzlers goal is to make the board more difficult to accomplish, by putting the starting and ending point on the board, and deploying OBSTACLE cubes to cut the linear pathway between the two.   </p>\n<p>The second role is the SOLVER – his goal is to beat the game in the least possible number of steps across the cubes, solving the mini puzzle. Limited by the obstacles and the total number of good tiles, he is challenged to find the safest and fasted pathway towards the ending point.\r\n  </p>\n<p>THE BOARD – The game is played on the 5x5 black board, placed on the hard surface. When placed, there is a visible grid with 25 cells on it, highlighted with white dots making cell slots more visible. Each cell matches the size of the cube and provides the player with a subtle guidance where he can place the cube and build the path seamlessly.   </p>\n<p>GOAL – the goal of the game is to get the little Puffin character on a journey in the fight against the climate change.   </p>\n<p>But who is the character - Al Puffino is a vulnerable seabird who lives freely and innocently, in balance with the nature, until vile man starts polluting and destroying the environment. He sets on a quest to save as much of nature`s wealth he can and stop the climate change once and for all.\r\n  </p>\n<p> \r\n</p>", "metacritic": null, "released": "2019-09-11", "tba": false, "updated": "2019-09-13T07:18:00", "background_image": "https://media.rawg.io/media/screenshots/59f/59fc3eea2013db227a021f7491d490f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sergejevic"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}