{"id": 374198, "slug": "yasnake", "name": "YASNAKE", "name_original": "YASNAKE", "description": "* YASNAKE - yet another snake game.\r\n<p>This snake game is made for GameShell in GameShell Game Jam(19Q3).</p>\n<p>The theme of the jam is \"SHIFT\". \"SHIFT\" has 2 meanings for me: one is<br/>for the process coding this game, another is for the 'shifting'<br/>feature of the game.</p>\n<p>I have shifted my old school piece of code (which was written around<br/>2008 when I learnt C lang) to live in this jam and polished it to made<br/>a new version. That code is about a game, the classic greedy snake<br/>game. The toolchain I used was Turbo C 2.01 (which has been released<br/>as freeware by respectful Borland). Turbo C is really a cool tool to<br/>make small excutables running on DOS. It saved me a lot of time with<br/>its simple yet powerful IDE. Back then it was a good choice to do<br/>edit-compile-debug-run loop in one single environment. The graphics<br/>library I use is BGI, a.k.a Borland Graphics Interface which is easier<br/>and simpler than modern counterparts (SDL etc.) but provides more<br/>direct way to do things.</p>\n<p>'shifting' feature of this game is that you can press 'a' to let the<br/>snake march at full speed i.e. at max of the emulator's current cycle<br/>setting. The snake can cross the wall when your score is NOT equal to<br/>1000's multiples so shift with caution.</p>\n<p>Although the game itself is simple, the process making it is full of<br/>fun. Making a little game is also a good way to practise coding<br/>skills. Install a dosbox on your GameShell, drop in a free compiler<br/>like TC to see what you can do in these old new 1980s tools.</p>\n<p>Code:</p>\n<p>https://github.com/picospuch/yasnake<br/></p>\n<p>Screenshots:</p>", "metacritic": null, "released": "2019-09-11", "tba": false, "updated": "2019-09-13T07:19:27", "background_image": "https://media.rawg.io/media/screenshots/d92/d927b6feb14842786e823ba701e2b950.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["spuch"], "genres": ["Action"], "publishers": [], "esrb_rating": null}