{"id": 374247, "slug": "holonoptic", "name": "holonoptic", "name_original": "holonoptic", "description": "A nonlinear story game with psychological realism and corporate simulation.\r\n<p>Glazial Group is testing potential applicants for the newly vacant position of CEO.</p>\n<p>Please take our holonoptic™ test so we can assess your ideological and mental compability with our company's new software, Geist_AI™.</p>\n\r\nGameplay\r\n<p>In holonoptic™, you will encounter a simulation of Geist_AI™, our proprietary artificial intelligence software for automated company management.</p>\n<ul><li><strong>BASE &amp; RESOURCE MANAGEMENT:</strong> Geist_AI™ now supports human resources and office facility management.</li><li><strong>GROW THE CONGLOMERATE:</strong> Expand your corporate empire into the weakened European market by acquiring unique companies or engaging them in hostile takeover battles.</li><li><strong>PSYCHOLOGICAL REALISM: </strong>Every action or substance impacts your emotions, which in turn determines your performance, what you can say in dialogue and thus what course the story will take.</li><li><strong>EARLY STORY BRANCHING:</strong> Even the very first conversation in the game can alter the plot dramatically.</li></ul>\n\r\nWorld\r\n<p>Unlike reality, the world of holonoptic™ is warped by the nation-like powers of multinational companies and ideological power struggles within those legal constructs.</p>\n<ul><li><strong>CORPORATE SETTING: </strong>As you replace our vanished CEO and acquire other companies to expand into the weakened EURO zone, holonoptic™ will highlight the ideological implications of your choices and their impact on corporate culture.</li><li><strong>CHARACTER-DRIVEN PLOT: </strong>Each manager you negotiate with is a nexus of distinct ideologies and psychological characteristics, offering you a different path to choose in the story.</li></ul>", "metacritic": null, "released": "2019-09-10", "tba": false, "updated": "2019-09-13T07:32:06", "background_image": "https://media.rawg.io/media/screenshots/1d9/1d9520da18d6a7a133b1aac900c158c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Geist_AI"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}