{"id": 374336, "slug": "cooking-cirno-former-hells-kitchen", "name": "Cooking Cirno: Former Hell's Kitchen", "name_original": "Cooking Cirno: Former Hell's Kitchen", "description": "<p><strong>This game is still a work-in-progress and doesn't explain some stuff so read the bullet points below for maximum enjoyment. Feedback is encouraged please and thank you!</strong><br/></p>\n<p>A Touhou fangame for 9 Jam! Cirno's opened up a resturant in Former Hell, and today's a big day: because all the spirits of the underworld are out to reap her soul. So uh, see if you can help her deal with that.</p>\n<p>This game is not fully complete and is missing sound effects as well as some basic pacing/balancing work. If something isn't balanced well just pretend that it is.</p>\n<p>Try the Windows build if the web one gives you performance issues.<br/></p>\n<p>How to play</p>\n<ul><li>Left click to grab/use/place/swap items.</li><li>Right click to quick release an item to inventory (you don't even need to grab it first).</li><li>Prep the food on the cutting board and then cook it (you can't cut microwave food, sorry that isn't obvious).</li><li>When cutting, swipe across the food with your mouse, then continue doing so until the food gets grayed out.</li><li>When seasoning, shake until you start to see stat bonuses (it takes a little while)</li><li>Each tool has a different way of cooking food, so poke around. With some of them you can overcook the food for a nasty surprise.</li><li>Hold the food in front of Cirno for another surprise.</li><li>Give the finished food to your soldiers to fight off waves of evil hungry fairies.</li><li>The spoon lets you hold and stir on a frying pan to  accelerate cooking. The feedback still needs work but if you see smoke that means you're doing it right.</li><li>Failure is not possible, you're the strongest!</li></ul>\n<p>Credits<br/></p>\n<ul><li>Code and stuff - Gman8r</li><li>Art - admiralPiplup</li><li>Combat background and effect art - Jenn Li</li><li>Music - yunum</li></ul>", "metacritic": null, "released": "2019-09-10", "tba": false, "updated": "2019-09-13T08:00:09", "background_image": "https://media.rawg.io/media/screenshots/265/26536b0b84aa3723bec5b5b3c4eba902.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Gman8r"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}