{"id": 374377, "slug": "go-farm-yourself", "name": "Go Farm Yourself", "name_original": "Go Farm Yourself", "description": "<p>Imagine you awake and find yourself on an island. You have no idea where you are and what happened. The only thing you know is that you have to keep going on.</p>\n<p>But don't be afraid! In \"Go Farm Yourself\" you're not alone!</p>\n<p>The island you stranded on is inhabitated by kind and helping people living together in a lovely little village. They will help you finding your place to build up your own farm and eventually be part of this new found community.</p>\n<p>Features:</p>\n<ul><li>Discover a vilage full of friendly people waiting to get to know you</li><li>Help them and eventually they will help you</li><li>Grow crops to sell for money</li><li>Gather materials for building</li><li>Hire more workers for your farm to raise your productivity</li><li>Explore more mysterious islands and uncover a yet unknown danger</li></ul>\n<p>Will you be able to settle down in this unknown land?</p>\r\nRemark:\r\n<p><strong>GFY </strong>is our first game and first started out as a sample project for us to get to know the Godot Engine.<br/>As we progressed in the profession of making games so did this project evolve to a point where we didn't see any reason why not to release it.</p>\n<p>Now just feel free to try our work (<em>for free of course</em>)! We really hope you enjoy it!<br/><strong>Keep in mind, though:</strong><br/>As for the fact that <strong>GFY </strong>is only a sample and we are allready planning a new exciting project, don't expect any more content, large bugfixes or a highly polished game.</p>", "metacritic": null, "released": "2019-09-09", "tba": false, "updated": "2019-09-13T08:11:51", "background_image": "https://media.rawg.io/media/screenshots/0ea/0ea6049a3c33b34dba846771d1504bab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["codedude", "CodeGoons", "McSora"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}