{"id": 374330, "slug": "pokemon-purple", "name": "Pokemon Purple", "name_original": "Pokemon Purple", "description": "<p>This is the early access launch of Pokemon purple XI (PPXI)</p>\n\n<p><strong><em>Pokemon Purple</em></strong></p>\n<p><strong><em>   Welcome to the world of Pokémon Purple, we are Omick and Pomick, Team Rocket's new recruits, We are  genetically engineering new   Phantonian Pokémon, with plans to get our hands on the cute adorable Pikachu. After their experiments go wrong, you find yourself in a  vast open world, playing  as the new type of Phantonian  Pokemon. Can you survive, figure out the quests, puzzles and collect all the hidden items, as you explore the lands to figure out a way to stop Team Rocket from taking over the world of Pokémon Purple. </em></strong></p>\n<p>     </p>\n<p><strong><em>  Pokémon Purple is a Fan creation game. In no way is this endorsed and or sponsored by the Pokemon Company.</em></strong></p>\n<p> </p>\n<p><strong><em>   The world of  Pokémon Purple, is in a very early development stage. Our goal is to make a fun game for all ages to enjoy and see the world of  Pokémon form the eyes of a  Pokémon. </em></strong></p>\n\n<p>The Game Features The Following, But Is Not Limited To -</p>\n<p>1 Discovery System</p>\n<p>The discovery system is always going to be fun for the explorers among you. All over the map you will find locations of towns and landmarks. At these locations you earn XP for your discover level as well as gold. You also may find hidden loot at these locations to help you.</p>\n<p>1 Quest System </p>\n<p>Mysteries???????</p>\n<p>Full Crafting System</p>\n<p>In the starting phases the crafting system will allow you to make new items for your base as well as items to help you progress in the game.</p>\n<p>Full Base Building System</p>\n<p>There is no place like home they always say right? That's why we added a building system to the game. You can use the building system by holding the F button. You will need resources to craft though so keep an eye out on your travels.</p>\n<p>Loot System + Inventory</p>\n<p>The inventory can be opened with the TAB button it will be used for all the loot and items that you find in the world. You will find a lot of loot all over the map that will help you to progress.</p>\n<p>Thirst System (Set to low drain so the game is not always focused on trying to fill a bar)</p>\n<p>Hunger System (Set to low drain so the game is not always focused on trying to fill a bar)</p>\n<p>Stamina System (WIP)</p>\n<p>Swimming System</p>\n<p>Who loves to jump in the rivers? I know I do that's why we added a swimming system to the game. In the future deeper waters with interest points will be added. To swim you go up with Space and down with Left Control Button </p>\n<p>World Map System</p>\n<p>The world map is what you will use to view fast travel points as well as many other interest points. You can view the world map with the M key.</p>\n<p>Discovery Mini Map System</p>\n<p>This mini map gives you a top view of what discoveries are around you. A yellow arrow will show when close to a discovery point.</p>\n<p>Discovery Compass System</p>\n<p>This compass is very helpful to keep you on the right path to find new interest points on the maps.</p>\n<p>Farming System</p>\n<p>The farming system is in it's infancy phase with only a couple of plants, but many more will be to come. You can place a farming plot by holding Left Control Button and G then you can place but choosing the location you want and holding Left Control Button and Left Mouse Click. Once you have placed a farm plot you can go up to it and interact by pressing E. Once in the UI you can choose the plant you want the n click it. Then you go back into the plot and water it. You can harvest to regrow.</p>\n<p>Remote Controlled Truck</p>\n<p>You can find a remote controlled truck near the ruins. This truck can be controlled by pressing and holding Q when the blue shows up on the icon within range. you can control the camera when driving with WASD. The perfect tool to explore with while at your base.</p>\n<p>Fast Travel System</p>\n<p>At specific locations around the map you will find towers these can be used as fast travel points once you discover them. Once discovered you can hover over the tower icon in the world map and hold right mouse click down and you will fast travel to that location.</p>\n<p>Day Night System</p>\n<p>This is the basic day night cycle we will be working on adding seasons and weather to the world.</p>", "metacritic": null, "released": "2019-09-10", "tba": false, "updated": "2023-04-27T08:28:33", "background_image": "https://media.rawg.io/media/screenshots/8b7/8b7ff8e4966d317d03be7b7c422a5d15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Misfit_Toys"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}