{"id": 374459, "slug": "drift-stage-2016-convetion-demo", "name": "Drift Stage [ 2016 Convetion Demo ]", "name_original": "Drift Stage [ 2016 Convetion Demo ]", "description": "<p>\n</p>\n<p>The \"Drift Stage: 2016 Convention Demo\" was originally compiled for use at the 2016\r\nMinecon convention in Anaheim California. The build represented in\r\nthis archive was released exclusively to Kickstarter &amp; Humble Bundle backers in\r\nSeptember of 2016. While the content remains the same, various bug fixes, patches, and game-play improvements were implemented after the convention - making this the \"best\" possible version of this demo. </p>\n<p>\r\nFeaturing the final layout of\r\nthe \"Eventide Highway\" course present in the original 2014\r\nprototype, The Convention version demoed<strong> near complete vehicle physics\r\nwith full collision models, graphic improvements, custom control\r\nlayouts, choice of automatic or manual transmission - and most\r\nimportantly: split screen four-player. </strong><br/></p>\n<p>After drawing crowds for the full extent of the convention, this build was quickly archived while newer version were developed. <br/></p>\n<p>Unfortunately, things did not work out as planned - Drift Stage's Steam release did not meet its expected release goal of Q4 2016 - Q1 2017. and after a considerable amount of time - the decision was been made to make this build available to the public. <br/></p>\n<p>This version of Drift\r\nStage (and any subsequent unreleased or future versions) would not exist without the support and enthusiasm of Drift\r\nStage's fans<strong>.\r\n</strong> Thank\r\nyou for your support – this public release would not have been\r\npossible without you.</p>\n\n<strong>Basic Controls</strong>\n<ul><li>Left Stick - <strong>[Arrow Keys]</strong> - Steering / Menu Navigation</li><li>RT /<strong> [C] </strong>- Accelerate</li><li>LT / <strong>[X]</strong> - Brake</li><li>START /<strong> [Esc] </strong>- Pause</li><li><strong>[Mouse]</strong> - Menu Navigation (Optional)</li></ul>\n<p>Gamepad &amp; Keyboard Controls:</p>\n<p><strong><em>[Note]: </em></strong><em>Controls written “<strong>[In This Manner]</strong>” indicate keyboard controls.</em></p>\n<p>Be sure to plug as many controllers into you computer as required before launching the game; ensuring they are both detected before selecting any game modes (hot-swapping controllers was in-development at the time).</p>\n<p> Xbox 360 / Xbox One controllers are recommended - but the build was designed with support for PlayStation 3/4 controllers and <em>some</em> generic game pads. <br/></p>\r\nMenus:\r\n<p>Use Left Stick or <strong>[Arrow Keys] </strong>and A button or <strong>[Space]</strong> to navigate the main menu.</p>\n<p>Press Start or <strong>[Enter]</strong> to confirm on main menus. </p>\n<p>To pause the game or exit the main menu, press <strong>[Esc].</strong></p>\n<strong>Options:</strong><strong> </strong>\n<p> Options can be set from the <strong>Options Menu</strong> item on the main menu - or during a race by pausing the game and selecting options. <br/></p>\n<p>Available options: <br/></p>\n<ul><li>Graphics - Adjust screen resolution and graphic quality settings.</li><li>Controls - Rebind Menu or Racing controls to your liking (Keyboard &amp; Gamepad).</li><li>Gameplay - Adjust measurement units (KPH/MPH) and other misc. settings.</li></ul>\r\nDriving &amp; Steering:\r\n<p><strong><em>[Note: All controls can be rebound in the controls option menu]</em></strong><br/></p>\n<p>To steer your vehicle, use the Left Stick or <strong>[Arrow Keys]</strong>.</p>\n<p>To accelerate, hold Right Trigger or press <strong>[C]</strong>. Begin braking by pressing Left Trigger or <strong>[X]</strong>. You can brake while accelerating to slow down without entering a drift. </p>\n<p>To drift you car, release the accelerator (Right Trigger or <strong>[C]</strong>), and then briefly press the brakes (Left Trigger or<strong> [X]</strong>) while steering left or right with Left Stick or <strong>[Arrow Keys]</strong>. </p>\n<p>Steer during a drift by turning in the direction of a corner with Left Stick or <strong>[Left &amp; Right Arrow Keys]</strong>. </p>\n<p>To return your car to normal driving position after preforming a drift, use Left Stick or <strong>[Left &amp; Right Arrow Keys]</strong> to steer the vehicle back to the center of the course. <br/></p>\n<p>Tap or hold the brakes (<strong>[X]</strong> or Left Trigger]) while exiting a drift to help control your exit speed.<br/></p>\n<p><strong>Manual Transmission Only:</strong>\n</p>\n<p>Shift Up - <strong>[Left Shift]</strong><br/>Shift Down - <strong>[Left Ctrl]<br/></strong></p>\n<p><strong><em>[Note: Be sure to remap your controls - your ideal layout is likely not the default.]</em></strong></p>\n\n<p><strong>Pro-Tips</strong><br/></p>\n<p>Make use of the cars inertia and entry angle to maintain high speeds while drifting. <br/></p>\n<p>Slight correction can make the difference - don't over compensate for a subtle change in direction.</p>\n<p>Tap or hold the brakes (<strong>[X]</strong> or Left Trigger]) while exiting a drift to help control your exit speed. <br/></p>\n<p>Some corners can be cleared faster without entering a drift.<br/></p>\n<p>Check your control bindings if something doesn't feel right - every button can be remapped to the players liking.<br/></p>\n\n<p><strong>Photo Mode:<br/></strong></p>\n\n<p>Make use of the filters to change the look of the image, or increase the output resolution. <br/></p>\n<p>Screenshots save to your desktop directory in a folder called \"Drift Stage Screenshots\". <br/></p>\n<p>Linux directory: /root/Desktop/Drift Stage Screenshots/<br/></p>\r\nSplit Screen Multiplayer \r\n\n<p>Selecting \"Multiplayer\" from the main menu will bring you to the multiplayer select screen. Follow the on-screen prompts to join a race ( <strong>[X] or A  )</strong>.</p>\n<p> Players can choose to use a keyboard or controller.  In the event you only have one controller - the keyboard can be used simultaneously.<br/></p>\n<p>Be sure to plug as many controllers into your computer as required before launching the game; ensuring they are both detected before selecting any game modes (Hot-swapping controllers was in-development at the time).</p>\n<p> Xbox 360 / Xbox One controllers are recommended - but the game is designed to support PlayStation and <em>some</em> generic game pads. <br/><br/></p>\r\nInstallation Instructions\r\n<p>Extract the .zip containing the relevant file for your OS, and run the contained software. <br/></p>\n<p><strong>Mac Troubleshooting:<br/></strong></p>\n<p>If the application fails to launch - or crashes during loading - try giving the directory: \"driftstage.app/Contents/MacOS/driftstage\" executable permissions (chmod a+x).</p>\n<p>In the event you encounter graphical bugs and freezing, check your graphics quality settings and make sure they are set to \"low\". Certain effects such as shadows and motion blur may not render correctly on older hardware and cause Drift Stage to run adversely.   <br/></p>\n<p>Be sure to restart the game after any changes are made. to ensure no residual issues occur.<br/></p>\n<p><strong>Linux Troubleshooting:<br/></strong></p>\n<p>Your\r\nexperience with this build may vary depending on your choice of Linux\r\ndistribution. If you encounter issues with your controller not\r\ndetecting properly, or other critical bugs such as hard crashes, we\r\nrecommended you check your terminal for any driver conflicts or other\r\nsigns of specific issues. <br/></p>\n<p>Multiple plugins used by Drift Stage have since been updated to meet broader systems specifications, but this specific iteration of the game is using 2015-2016 era versions. <br/></p>\n<p>If no work around or solution is found, we recommend running the PC version with Wine - a free Windows emulator for Linux. <br/>\n</p>\r\nBugs\r\n<p>As with previous developmental build releases, this version of Drift Stage has multiple bugs that may interrupt your race if you encounter them at the wrong time. Quitting to the main menu and restarting is necessary, but be sure to take a screenshot of where you end up. <br/></p>\n<p>Clipping out of bounds due to a very hard collision (with the barrier or with another player) may cause you to fall through the map. A collision that causes the player vehicle to fly up over the barriers will also result in falling out of bounds, but is not directly caused by clipping.<br/><br/> Sudden FPS drops or poor performance increase the chance of this occurring - so make sure your game is running above 30fps consistently or you may need to lower your graphics settings.<br/></p>\n<p>Small camera 'jumps' occur on certain cars (ZX78).</p>\n<p>Some translation errors exist in the Japanese and Chinese written on billboards. These issues were fixed it later builds - with some issues due to incorrectly flipped UV maps (textures).<br/></p>\n<p><strong>License Info<br/></strong></p>\n<p>Drift Stage © 2014 - 2020 Super Systems Softworks - All Rights Reserved.</p>\n<p>Myrone © 2020 Hugh Myrone - All Rights Reserved.</p>\n<p><strong>Credits</strong><br/></p>\n<p>DD - Artwork &amp; Concept.<br/></p>\n<p>Myrone - Original Score &amp; Sound Design.</p>\n<p>Chase Pettit - Programming &amp; Code.<br/></p>\n\n<p><strong>Special Thanks:</strong><br/></p>\n<p>Drift Stage Backers, Fans, and Supporters.<br/>Drift Stage World Record Holders &amp; SpeedRunners.<br/>Drift Stage Modding Community.<br/>Drift Stage Debug Team (2013-2019)<br/>Tumblr Staff 2012-2015.<br/>Fractal Phase Games Corp.<br/>Pinku Style - Misawa (DJ).<br/>SBFP:Z .<br/>Red Bull Games.<br/>Nicalis, Inc.<br/>Devolver Digital Games.<br/>Mojang Inc.<br/>\"Indie Mega Booth\" Anaheim Staff.\r\n<br/>E3 Staff 2015 -2016.<br/><br/></p>\n<p>2019 PUBLIC RELEASE DEBUGGING:</p>\n<p>Zoltar007 (2019 Mac OS workaround, change-list reference).\r\n</p>\n<p>Randomviewer (2019 Linux debugging and Wine testing - troubleshooting)<br/><br/><br/></p>\n<p>This software demo and its contents are applicable to the following Creative Commons license: <br/></p>\n<p><strong>CC BY-NC-ND 4.0</strong><br/></p>\n<p>\r\nRead the included license\r\n.PDF, or click here for more information. <br/></p>\n\n<br/><br/><br/>\n<p>All content used with permission.</p>\n<p>Drift Stage © 2014 - 2020 Super Systems Softworks - All Rights Reserved.</p>", "metacritic": null, "released": "2019-09-09", "tba": false, "updated": "2019-09-13T08:32:14", "background_image": "https://media.rawg.io/media/screenshots/10f/10f25e7adc0389fcc2ab6e28a07cd7df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Super Systems"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}