{"id": 374587, "slug": "dragonoid-block-breaker", "name": "Dragonoid Block Breaker", "name_original": "Dragonoid Block Breaker", "description": "Create a block breaker strategy to defend your castle, dragons, and their pets!<br/><br/>Tap and drag to strategically angle your dragon fire ball shooter. Tap to shoot and break the block to defend your castle! Earn stars and use them to unlock buildings, upgrade structures around the dragons land, hatch new dragon eggs, and collect cute pets to keep your dragon’s company! Destroy the enemy block before they reach the ground and attack you. Angle your dragon’s laser shooter to destroy as many blocks as possible each round.  Destroy that brick! <br/><br/>Soar into the fiery depths of a faraway land filled with tiny hungry animal friends! Build the ultimate defense team. Shoot balls of fire to help your dragons and his pets protect and restore their beautiful castle home land! Blast away blocks to defend the dragons game land. Conquer crazy boss challenges, complete levels and earn stars to build your dream dragon world!<br/><br/>While Dragons and their pets may often be thought of as fiery beasts in nature, these guys live their lives a little on the cuter side! Each character features a new beautiful and bright color pattern and friendly demeanor that will make you fall in love! Not to mention their adorable pets that you can collect and watch roam around the ancient castles. Which friendly pet is your favorite? <br/><br/>--------------------------------------------------------<br/>DRAGONOID BLOCK BREAKER BRICK BLAST – HIGHLIGHTS<br/>--------------------------------------------------------<br/><br/><br/>- Fun, free block breaking game for all ages<br/>- Discover and blast the block and brick using 3 unique dragons!<br/>- Explore, design and enjoy three tiny dragon villages<br/>- Three exciting game modes:  Campaign, Puzzles Levels and the Endless Adventure cave!<br/>- Spin the magical wheel of fortune for free prizes and rewards<br/>- Collect gems to use fun power-ups!<br/><br/>Dragonoid is the perfect block breaker brick blast dragon game for animal and hungry dragon lovers alike! Blast away enemies, break the block and brick, and build a dreamy adventure land!", "metacritic": null, "released": "2019-08-26", "tba": false, "updated": "2019-09-16T02:48:53", "background_image": "https://media.rawg.io/media/screenshots/f4a/f4a1044f15b31f6ac948501380ac73c5_cFATpIb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FGL Indie Showcase"], "genres": ["Strategy", "Casual"], "publishers": ["Lucrative Gaming"], "esrb_rating": "Everyone 10+"}