{"id": 374534, "slug": "blazing-sails", "name": "Blazing Sails", "name_original": "Blazing Sails", "description": "<strong><h3>A fresh take on the battle royale gamemode</h3></strong><br/>By combining the gamemode with fast-paced naval/ship combat, Blazing Sails refreshes the BR-genre.<br/><br/><strong><h3>Naval combat</h3></strong><br/>The main objective in Blazing Sails is to destroy every other ship. There are many different strategies to do this. Damaging an enemy ship will cause it's hull to fill with water. Once the hull is completely flooded the ship is destroyed and the enemy team is eliminated. No worries though, you can repair your hull with wood and pump away excess water with a handy pump in the hull. <br/><br/><strong><h3>Ship upgrades</h3></strong><br/>Once you’re in game your crew will also be able to find ship upgrades including: different types of armour plates, swivel cannons, cannon upgrades and mast upgrades to beef up your ship.<br/><br/><strong><h3>Looting</h3></strong><br/>When searching islands for loot you’ll probably encounter other crews. You can decide to defend your own gathered loot and run or take the risk and attack! If you are eliminated enemy players can loot your body. You only keep your weapons on respawn. Don’t forget the main objective though: defending your ship and eliminating other ships.<br/><br/><strong><h3>Intense teamwork</h3></strong><br/>As stated before, everything in Blazing Sails is centered around your ship. If you don’t work as a team, your crew won’t survive very long. Once your ship is destroyed it’s game over for you and your crew. This doesn’t mean you’re forced into a specific role or class. Crews are a very dynamic thing in Blazing Sails. If you happen to stand near to a cannon and see an enemy ship you better shoot. If you happen to stand next to some ship damage you better repair it and if you’re standing next to the wheel well, I guess you get the point.<br/><br/><strong><h3>Unique respawn system</h3></strong><br/>In a typical BR game you often get killed in the first few minutes and that’s it, next match! This can get frustrating. In Blazing Sails you can keep respawning until the ship is completely destroyed! No more waiting on your teammates to revive you or even worse waiting until your teammates are done playing.<br/><br/><strong><h3>Mid game crew joining</h3></strong><br/>Having the unique respawn system opens a lot of possibilities compared to other BR games. Too late to join your friends crew? No problem, just drop in mid game. As long as the crew you want to join isn’t full you can join your friends, even if the game has already started. <br/><br/><strong><h3>Fast-paced pirate action</h3></strong><br/>Because you don’t want a match to last 2 hours, we designed every mechanic to be very fast and easy to use. A fast and easy to handle pirate ship. Fast reloading cannons and guns. Handy quick-voice commands. Quick moving characters. A medallion to teleport back to your ship. Just loot and shoot!<br/><br/><strong><h3>30+ unique weapons</h3></strong><br/>From regular muskets to fish guns to exploding arrow shooting bows to makeshift pirate swords. Every weapon has its own pros and cons and is viable in different situations.<br/><br/><strong><h3>Fully customizable character and ship</h3></strong><br/>Make your own swaggalicious seadog or badass buccaneer. Fully customize your clothing (hats, face, torso, hands, feet and jewelry) and appearance (body settings, hair, facial hair and tattoos). But also choose your own ship type, sail and flag colors, sail emblem, rope color, bow figure, hull decoration and ship name!", "metacritic": null, "released": null, "tba": false, "updated": "2024-04-01T18:54:33", "background_image": "https://media.rawg.io/media/screenshots/d25/d25d53f0471b08df3e5b04cc5dd35ce3.jpg", "website": "https://www.blazingsails.com/", "rating": 3.29, "rating_top": 5, "added_by_status": {"yet": 35, "owned": 73, "beaten": 1, "toplay": 2, "dropped": 4, "playing": 2}, "playtime": 2, "achievements_count": 16, "ratings_count": 7, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["GET UP GAMES"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["GET UP GAMES"], "esrb_rating": null}