{"id": 374550, "slug": "flinger-tactics", "name": "Flinger Tactics", "name_original": "Flinger Tactics", "description": "Flinger Tactics is a turn-based strategy sports game where you fling your team of cute creatures to victory. As the coach of your squad, each turn you'll need to evaluate the field and determine which of your athletes to fling and at what. Athletes can be flung to accomplish several objectives such as knocking the ball towards the goal, breaking an opponent's goal-guarding bumper, or simply repositioning. Additionally, each athlete class has a unique ability such as restoring your own bumpers, creating shockwaves, or paralyzing the first athlete they hit.<br/>\n<br/>\r\nTwo teams face off each match with a variable number of athletes and balls. The objective of each match is to score more goals than the opposing team, but first you'll have to break the bumpers guarding your opponent's goal. Athletes can be flung into the opponent's goal to substitute them off the field and next turn you're able to fling a new athlete onto the field. During the match, stats such as goals, assists, tackles, flings, and bumps are all recorded and displayed at the end of the match along with unique descriptors and the very best flinger is awarded Most Valuable Player (and gets to wear a dope crown!).<br/>\n<br/>\r\nEach flinger has a unique ability, personality, and appearance and every team that they play for has their own colors, name, and motto. Everything from the appearance of athletes to the rules of the matches is customizable for a highly replayable experience.<br/>\n<br/>\r\nIn the future there will be additional game modes beyond the currently available 'Quick Play' mode that introduce elements of roster management, seasons, tournaments, and progression.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-16T02:31:09", "background_image": "https://media.rawg.io/media/screenshots/b32/b32ef5dd8d4e5911ae60541599d7aae3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Dan Schumacher"], "genres": ["Action", "Strategy", "Sports", "Casual", "Indie"], "publishers": ["Dan Schumacher"], "esrb_rating": null}