{"id": 374581, "slug": "ohana-island", "name": "Ohana Island", "name_original": "Ohana Island", "description": "Live the dream on a beautiful island!<br/><br/>\"Ohana Island\" is a tap-to-blast puzzle game set in an enchanting tropical landscape! Design and decorate your flower shop, befriend the locals, and uncover the hidden mysteries of the island!<br/><br/>Start living the dream as a green thumb florist on Ohana Island!<br/><br/>Game Features:<br/>・Challenging levels - 300+ tap-to-match puzzles - will make the island blossom!\t<br/>・Unlockable skins - Turn your flower shop from drab to fab!<br/>・Uncover the mystery - Reveal the secrets of Ohana Island through rich and exciting storylines.<br/>・Make friends on the island - Enjoy the companionship of a truly wild cast, from the kooky yet grandmotherly Lily Maka, to the vegan villain Lucas Sweet, to the totally tubular Kiko Kilani.<br/>・Weekly events - Bringing new challenges to spice up your adventure!\t<br/>・Play offline - Don't risk being bored the next time you can't access the Internet!<br/><br/>Note:<br/>The game is free to play, but you may purchase many of the game's elements, if you so choose.<br/><br/>Love playing Ohana Island?<br/>Meet us and stay up-to-date on the latest news through our websites and user community!<br/>https://www.facebook.com/OhanaIsland/<br/><br/>We'd be happy to answer any of your questions or hear suggestions. Feel free to email us at Contact info:<br/>support@mybogames.com", "metacritic": null, "released": "2019-09-13", "tba": false, "updated": "2019-09-16T02:46:09", "background_image": "https://media.rawg.io/media/screenshots/1af/1af2e9b2c49e31f281fedac4022dc50d_EftSErE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MYBO GAME"], "genres": ["Casual", "Puzzle"], "publishers": ["MYBO (Media)Ltd.Co."], "esrb_rating": "Everyone 10+"}