{"id": 374632, "slug": "space-inversion-2-hd", "name": "Space Inversion 2 HD", "name_original": "Space Inversion 2 HD", "description": "Premium IPAD HD version specially designed for iPad with extra content not found in the standard and FREE versions.<br/>Space Inversion is the highly rated arcade Invader style shooter and it's back with a vengeance! <br/>Bigger and better than ever before and now featuring a new Arcade mode with regenerating aliens and power ups to even the odds. New bonus \"Meteor Storm\" and \"Flying Saucer\" rounds add yet more thrills and the chance to rack points up for extra lives. <br/><br/>There's also a Classic mode for those wanting a slower paced more traditional game. <br/><br/>\"Space Invaders is pure addictive fun !\"<br/>\"This is Real retro fun. Get it and enjoy\"<br/>\"Great game, so addictive\"<br/>\"Very good. Better than the original from the 70,s !\"<br/>\"One of the best arcade clone games!\"<br/>\"great game...worth getting the expansion also.....great replay value....graphics,sound all there. Five stars for me !\"<br/>\"Played this game many times and keep coming back to try to beat my score. Really good fun .\"<br/><br/><br/><br/>Space Inversion 2 now features in lanscape widescreen mode (auto orientation supported) and offers 6 different controls systems including Tilt,Slide,Butons and Joystick configurations. Fire modes include manual, semi-auto and auto fire. <br/><br/>Game Center Leaderboards lets you complete for the best scores in the galaxy. <br/>This iPad HD version provides full use of the extra screen space available as well as 8 additional backgrounds and 1 new music track. <br/><br/>**Not Sure? try our brand new FREE version. Simply play to unlock all game features **<br/><br/><br/>## Now with iCade support <br/><br/>## CHECK OUT THE VIDEO TRAILER FOR SPACE INVERSION 2 AT YOUTUBE http://www.youtube.com/watch?v=ccqeMon9JBw (search on youtube for 'space inversion2') or visit our website http://www.silverlinearts.com/game_spaceinversion02.htm<br/><br/>Features <br/><br/>* Fast, slick addictive game play <br/>* Arcade and Classic play <br/>* Power ups give you extra fire power, shields and a slow motion \"Warp\" mode <br/>* HD graphics designed for iPad <br/>* 6 Methods of control <br/>* Landscape auto orientation <br/>* Game Center Leaderboards &amp; Achievements<br/>* Expansion Pack gives you 2 new graphics styles (Tech and Neon) <br/>* Expansion Pack gives you Mega Turbo mode and Bonus Mode play<br/>* Out of this world music and sound effects. <br/>* Exclusive extra content for iPad HD version", "metacritic": null, "released": "2011-07-01", "tba": false, "updated": "2019-09-16T03:12:01", "background_image": "https://media.rawg.io/media/screenshots/57e/57eb954dd1aafd78a5e8a8bd15813a38.jpg", "website": "http://www.silverlinearts.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["merlyn lear"], "genres": ["Action", "Casual"], "publishers": ["merlyn lear"], "esrb_rating": "Everyone 10+"}