{"id": 374643, "slug": "combat-actions-vietnam-2", "name": "Combat Actions: Vietnam", "name_original": "Combat Actions: Vietnam", "description": "“You can kill ten of my men for every one I kill of yours. But even at those odds, you will lose and I will win.”  —Viet Minh leader Ho Chi Minh<br/><br/>“We are fighting a war with no front lines, since the enemy hides among the people, in the jungles and mountains, and uses covertly border areas of neutral countries. One cannot measure [our] progress by lines on a map.” — General William C. Westmoreland, Commander of all U.S. military forces in Vietnam, April 28, 1967.<br/><br/>Combat Actions: VIETNAM is a unique abstracted combat game that puts the player in command of a US Infantry Squad / Platoon during the Vietnam War. It covers some of the prevalent ground combat conditions and 'Fire Fights' that occurred between the United States and North Vietnamese / VietCong forces.<br/><br/>It's just a shot away...<br/><br/>The game's Skirmish level scale is as personal as it gets-- 'Man to Man' which coupled with its 3D graphics, immersive sound, and special effects, brings an immediacy and sense of danger to every mission.<br/><br/>With any given action, enemy reaction at times may seem immediate and concurrent... <br/><br/>Though the game is turn based, its command activation system can at times make it seem as though one is playing more of a real time strategy game, more realistically reflecting the conditions and confusion of jungle warfare during the Vietnam era.<br/><br/>Features:<br/><br/>- Quick, interactive, engaging Turn Based Play<br/><br/>- Scenario Based Mission Types: Search and Destroy, Blocking Force, Evade and Escape, US and NVA Static Defenses, DarkHorse Bravo Down, and MAC-V-SOG Recondo<br/><br/>- Variable Troop Levels and Quality, Terrain, Fire Support, and Morale<br/><br/>- Weapon Systems: M-16s, AK-47s, M-60s, RPGs, RPDs, Claymores and more...", "metacritic": null, "released": "2018-08-11", "tba": false, "updated": "2019-09-16T03:17:14", "background_image": "https://media.rawg.io/media/screenshots/859/8595488c0b03cb8021988b39628689ae_Q5igoET.jpg", "website": "http://digitalGameworks.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["digital Gameworks"], "genres": ["Strategy", "Board Games"], "publishers": ["Digital Gameworks"], "esrb_rating": null}