{"id": 374740, "slug": "spider-colony-simulator", "name": "Spider Colony Simulator", "name_original": "Spider Colony Simulator", "description": "Expire adventures from the perspective of a spider. This 3D survival game and animal simulator will set you into a realistic simulation of the insect world. Establish your very own spider army. Search for food resources in order to feed the spider queen and the larvas. Explore a large detailed natural habitat filled with other insects which may attack your spider colony. After the required amount of food, the spider queen will lay eggs which evolves to lavas whichs needs to be supplied with protein in form of other insects.<br/><br/>Enforce attacks to overwhelm other insects with the power of the swarm and get protein. You have to plan ant battles against enemy insects like huge Scorpions, Praying Mantis. Get in war with those creatures by the force of many soldier wasp. Create trails with pheromones to get support from the solider spider or worker wasps, grub more tunnels to enlarge the spider nest. <br/><br/><br/>- 3d simulator and  survival game <br/>- open world<br/>- very realistic spider and insect behaviour (pheromone communication) <br/>- open world game with a huge map - explore a detailed, huge natural forrest habitat<br/>     -&gt; forest environment, different plants, realistic textures, water <br/>- other insects as food source like praying mantis worms, fly, scorpions ants etc. <br/>- attack and fight against enemy insects with the spider colony <br/>     -&gt;overwhelm them with power of the swarm<br/>- collect food in the form of fruit or protein to feed the queen and larvas <br/>- high-quality animation of the 3D spiders, ants, mantises and other insects <br/>- first person, easy touch control <br/>- explore the underground caves and build a huge subterrrainian nest <br/>    -&gt;enlarge the spider nest and grub new chambers<br/>- create spider webs<br/>-2 spider species (recluse spider and tarantula)", "metacritic": null, "released": "2019-08-31", "tba": false, "updated": "2019-09-16T04:09:58", "background_image": "https://media.rawg.io/media/screenshots/896/8962b903f5f63db8cdf45b8ba4ef73ae_6HQKLZy.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mnhksdevelopment"], "genres": ["Adventure", "Simulation"], "publishers": ["H. K. Solution Gesellschaft mit beschraenkter Haftung"], "esrb_rating": "Everyone 10+"}