{"id": 374744, "slug": "warrior-gamesgot-dragon", "name": "Warrior Games:Got Dragon", "name_original": "Warrior Games:Got Dragon", "description": "You play Marcus, a dungeon born prince, master of wolves, rightful heir to a righteous king, crusader of light and shadows alike, betrayed by his closest friend. Thrown to the depths of the dungeons, the young prince Marcus must overcome enormous beasts and evil creatures to lay claim to his throne and retake his position as the crusader of light, dungeon keeper and the protector of shadows.<br/>Take charge of your sword and upgrade to various armors to defeat your enemies. You have a faithful companion and fighter in a big bad wolf and Alpha Wolf, ready to fight by your side. As you wait for your health to go back up, watch your faithful wolf in an RPG mode engage in epic clashes of wolf vs wolf, wolf vs tiger and other beasts. Tag Helena, your loving companion and a ferocious warrior in her own right, to take over the intense battles with murderous villains and engage in epic clashes with huge dungeon crawlers while you nurse your wounds. <br/>Oh yes you can crown him as dungeon master while engaging in epic clashes against evil bosses guarding different parts of this darkest dungeon game. This game has a unique new feature whereby you can tag people, your allies around the world to help you out in a tight situation. <br/><br/>Destructible power ups like circling thunder, swift strike and storm blade will dethrone undead creatures, evil bosses and monsters in this Dungeon Crawler game. This dungeon was once ruled by righteous King who was taken off throne by Fiends, now infested by evil spirits and beasts. Demons and Villains lurk in the darkness of this cursed Dungeon.<br/>Beware some missions need more focus attention and destructive strategies to slay evil bosses trying to make an malevolent army.<br/><br/>Awesome Features:<br/>◉ Challenging missions, quests and dungeons to clear in this Hack and Slash game.<br/>◉ Encounter a variety of Beasts, demons, ogres, slither, trolls and everything evil. Hunt and slay!<br/>◉ Use powerful abilities like circling thunder, swift strike and storm blade and perform special moves to attack your foes.<br/>◉Tag people around the world, playing this multi play, to help you in this dangerous game of survival<br/>◉ Tag your partner and friend to unlock new combo attacks and become the Legendary Demon Hunter in this Action RPG game.<br/>◉Marcus, the dungeon master, having merciless armors like cuirass, terror, might and divine to dominate the beasts, crawlers and evil bosses.<br/>◉Helena, the dungeon keeper, having wicked armors like Viking, medieval and iron maiden to thwart invaders<br/>◉Helena and Marcus, the dungeon borns, share devilish weaponry to conquer the darkest dungeons<br/>◉Magical Wolf &amp; Alpha Wolf will help you in making of true shadow warrior.<br/><br/>Bring order to this chaotic world and get rid of Evil beings. Become the guardian of dungeon and restore it to its former glory. Return to your kingdom and kill enemies like a Legendary Knight.", "metacritic": null, "released": "2018-09-17", "tba": false, "updated": "2019-09-16T04:11:48", "background_image": "https://media.rawg.io/media/screenshots/698/698d086ec6acdc126296bed3dcf439a3.jpg", "website": "http://creatrixe.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 474, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Muneeb"], "genres": ["Action", "Adventure"], "publishers": ["Syed Muneeb"], "esrb_rating": "Everyone 10+"}