{"id": 375006, "slug": "area-51-nsfw-18", "name": "Area 51 (NSFW, 18+)", "name_original": "Area 51 (NSFW, 18+)", "description": "<p><strong>This game is still under development and currently only a small demo is available.<br/></strong></p>\n<p><strong>WARNING: THIS GAME IS NOT SAFE FOR WORK AND MUST ONLY BE PLAYED BY PERSONS OVER THE AGE OF 18</strong>\n</p>\n<p>-------------------------------------------------------------------------------</p>\n<p><strong>CONTROLS: </strong></p>\n<p>KEYBOARD: ARROW KEYS move the player around. Walking into things or pressing ENTER  near them will interact with them. ESCAPE cancels menus such as the save menu.</p>\n<p>MOUSE: Click the LEFT MOUSE BUTTON to set the player's walk path. Click things to walk into and interact with them. The RIGHT MOUSE BUTTON cancels menus such as the save menu.</p><p><strong>GRAPHICS:</strong> Visustella Modern City Resource Pack</p>\n<p>-------------------------------------------------------------------------------<br/></p>\n<p>Alongside thousands of other Kyles, our main character takes his last sip of Monster energy drink before charging Area 51's main gate. After a disastrous battle of machine gun fire and rock throwing, Kyle sneaks through the gate behind one of his Naruto runner brethren. </p>\n<p>Unnoticed, and while the guards are distracted, Kyle makes his way into the stronghold to claim the alien booty. \"Let's see them alien tiddies.\"</p>\n\n<p><strong>Features:</strong></p>\n<p>- Make your way up a prison tower to find slutty aliens who just crave human touch. Interact with them in sex scenes you can flick back and forth through at your leisure.</p>\n<p>- Sneak past the Guards to seek out hot alien action. Don't get caught - unless the guard is hot maybe..?</p>\n<p>- Engage in different missions to unlock new sex scenes, as well as finding hidden scenes and characters.</p>", "metacritic": null, "released": "2019-09-14", "tba": false, "updated": "2019-09-16T05:25:06", "background_image": "https://media.rawg.io/media/screenshots/e1d/e1d8d7a9f7c240b25632b03e2ad1d732.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mephisto"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}