{"id": 3751, "slug": "dark-souls-ii", "name": "Dark Souls II", "name_original": "Dark Souls II", "description": "<p>Dark Souls II is the third installment in the well-known Souls series. It’s a different game from all the others because of its directors. With Dark Souls II the main director and founder of Souls-like genre Hidetaka Miyazaki took place only as a supervisor of the project, leaving a place of the director of the game for two young video game designers Tomohiro Shibuya and Yui Tanimura. One could ask if the game is as good and beautiful as other past games in the Series and the answer would be that Dark Souls II is different yet deep and unforgiving as all the other titles in the series. The famous difficulty of previous games is still there but the world is much simpler yet connected and dangerous. Enemies still respond after death of a player but only about 15 times. After that they disappear forever. Boss battles are much simpler, this time focuses on many simpler bosses at a time instead of one powerful boss. <br />\nDark Souls II is one of those games which were painfully downgraded in a favor of hardware of consoles, that means that players got less graphically advanced version than promised. Yet the game is interesting and deep and it’s definitely a must play for every Souls fan.</p>", "metacritic": 91, "released": "2014-03-11", "tba": false, "updated": "2024-04-17T17:28:39", "background_image": "https://media.rawg.io/media/games/651/6512783a214618584d144d5d852ba595.jpg", "website": "http://www.darksoulsii.com", "rating": 4.04, "rating_top": 4, "added_by_status": {"yet": 147, "owned": 1619, "beaten": 627, "toplay": 157, "dropped": 226, "playing": 24}, "playtime": 44, "achievements_count": 76, "ratings_count": 719, "suggestions_count": 588, "game_series_count": 10, "reviews_count": 724, "platforms": ["PlayStation 4", "Xbox One", "PC", "Xbox 360", "PlayStation 3"], "developers": ["BANDAI NAMCO Entertainment America", "FromSoftware"], "genres": ["Action", "RPG"], "publishers": ["Bandai Namco Entertainment", "BANDAI NAMCO Entertainment US", "FromSoftware"], "esrb_rating": "Mature"}