{"id": 375261, "slug": "last-kings", "name": "Last Kings", "name_original": "Last Kings", "description": "The adventure with heroes for the throne begins!<br/>\r\n- Selected for Unreal DevGrant<br/>\n<br/>\r\nBecome a hero and bring glory to your name as you build your own domain. Venture into dungeons where great evil awaits in \"Last Kings \" where amazing tactical battles are guaranteed to bring excitement and thrills.<br/>\n<br/>\r\nIn \"Last Kings\" featuring amazing graphics through the Unreal Engine, you can build your domain the way you like, based on the faction you've chosen and heroes with powerful, spectacular skills. <br/>\n<br/>\r\nObtain the power of the Aurum, rule the world that fell into ruin, build a powerful guild, and create a force with friends all over the world.<br/>\n<br/>\r\nEliminate your enemy through Army Battles -- by cleverly employing various tactics and strategies -- and begin your journey to protect your domain and friends right now!<br/>\n<br/>\n<br/>\r\n* Strategic battles on the largest scale!<br/>\r\nCreate your own mighty Army with various Army units.<br/>\r\nUse your heroes' powerful skills and the compatibility of your Armies to triumph on the battlefield<br/>\n<br/>\r\n* Dazzling displays that are a sight to behold!<br/>\r\nCheck out what happens in your territory through cinematics created by Unreal Engine<br/>\r\nThe fancy graphical stories of heroes and villains begin today<br/>\n<br/>\r\n* Grow your domain the way you want!<br/>\r\nDrive out villains from your domain, and save your people from danger.<br/>\r\nExpand your domain to grow it into a city of agriculture or a military base.<br/>\n<br/>\r\n* The growth of various heroes!<br/>\r\nPrepare for battles with various heroes.<br/>\r\nEmerge victorious in dungeon battles and Army Battles by growing your Heroes.<br/>\n<br/>\r\n* Guilds with friends from all over the world!<br/>\r\nGather with friends from all over the world to build the strongest guild.<br/>\r\nSeize power and gain control over the land through guild wars. Today, you are king.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-20T03:03:06", "background_image": "https://media.rawg.io/media/screenshots/4c3/4c3aad4d2ffdeb783015a59969b6374e.jpg", "website": "https://www.lastkingsworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NX Games"], "genres": ["RPG", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["Barunson E&A"], "esrb_rating": null}