{"id": 375273, "slug": "sunmeiqi", "name": "SunMeiQi", "name_original": "SunMeiQi", "description": "<p>[Game Features]<br />\n1, independent development push puzzle RPG game<br />\n2, the scene design in the nostalgic style of the 90s, restore contemporary history<br />\n3, original mass push understanding puzzle elements, burning your brain<br />\n4, the late DLC will be launched one after another, so stay tuned<br />\n[Plot]<br />\nFile: On April 8, 1990, the murder of the Chamber of Secrets in Changzhuang Community.</p>\n<p>Detained suspect: Wang Aiguo<br />\nResponsible Criminal Police: Liu Qingchun<br />\nPolice unit: Changzhuang Town Police Station, Fengtai District</p>\n<p>Case description:<br />\nOn April 1, 1990, the police received a report that 401 people in the 2nd floor of Changzhuang Community were mad, and they injured many neighbors in the same building. The police came to the scene and found that several residents had different degrees of stab wounds.<br />\nAfter Wang Aiguo was arrested, the police came to his home and was surprised to find that his wife and son had died at home and had died of forensic identification for two days.</p>\n<p>Personnel situation:<br />\nWang Aiguo: 35 years old, electrician, Changzhuang machine power plant workers.<br />\nSun Meiqi (dead): 38 years old, kindergarten teacher, kindergarten staff in Changzhuang Town.<br />\nWang Sifeng (dead): 8 years old, 2nd grade student of Changzhuang Town Primary School.</p>\n<p>The police asked Wang Aiguo, but Wang Aiguo did not seem to know.</p>\n<p>Wang patriotic confession: &quot;I still have lunch with my wife at noon, and the child went to school early in the morning, how could I die at home. I beg you to tell me what happened. Those few people are not good people, always bullying me, I am anxious. Only then took the knife and chopped them.&quot; Wang Aiguo also said that in the middle of the night, every night in the middle of the night, I heard strange sounds in the corridor, and unlike the voice of people, I dare not open the door when it is not bright. The wife also heard it, and did not dare to tell the child. I can&#39;t see anything from the door mirror.</p>\n<p>Forensic autopsy report:<br />\nSun Meiqi, female, the heavy head of the deceased&#39;s head, not fatal. Cause of death: the nail is inserted into the heart.<br />\nWang Sifeng, male, cause of death: suffocation. The neck has obvious marks, and the third and fourth fingers of the right hand are broken.</p>\n<p>The police found an inquiry to the residents of the gate 403.</p>\n<p>Ms. Zhang Hongjun of 403 confessed: &quot;Wang Aiguo is a very good person. He has never been in a neighborhood. But there is something strange. It has been going on for a month. The door is noisy every night, but it is not like ordinary. The couple quarreled and often had strange voices. Once I went to the door to visit the media and talked about mediation. Who wants Wang Aiguo and his wife Sun Meiqi not to admit the quarrel, and the street work can&#39;t be done.&quot;<br />\nThe strangest thing is that Zhang Hongjun said that after Wang Aiguo was arrested, he could still hear the quarrel and strange voice every night.</p>\n<p>Site survey report:<br />\nThere were no traces of fighting in the house. When Sun Meiqi was found dead in bed, the child Wang Sifeng died in the toilet and the toilet door was closed. There are no other fingerprints in the room except Wang Aiguo. All doors and windows are not scratched.</p>\n<p>The responsible criminal police decided to explore the home of Wang Aiguo at night when the neighbors said.</p>", "metacritic": null, "released": "2019-09-25", "tba": false, "updated": "2019-10-31T14:25:31", "background_image": "https://media.rawg.io/media/screenshots/ced/ced0bae9eb7a1361b77939aafc1b4965.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "PC"], "developers": ["QZQ Studio"], "genres": ["Action", "Adventure", "RPG", "Indie", "Puzzle"], "publishers": ["H.P.Y.S,LLC"], "esrb_rating": null}