{"id": 375201, "slug": "errant-kingdom", "name": "Errant Kingdom", "name_original": "Errant Kingdom", "description": "Errant Kingdom is a queer, high-fantasy visual novel brought to you by Lunaris Games, the team behind the supernatural murder mystery, When The Night Comes.<br/><br/>The Kingdom of Novus has been thrown into disarray, and It's up to you to decide if you’ll help to bring peace, or if you’ll stoke the fires of chaos. Enter a high fantasy world steeped in political intrigue; where magic touches the land and blood turns the wheels unseen. Dishonor &amp; betrayal. Hope &amp; despair. Pick a side, and meet your match.<br/><br/>Errant Kingdom is a story with darker elements at play. As a denizen of the kingdom of Novus, you're at the heart of watching history unfold before your eyes. Whether you see its rise or fall, however, is up to you. There are those who will help you in your endeavors along the way, and might even find themselves enamored with you. However, it is possible to earn their ire as well, should your plans be devious. Only you will see how the story evolves, and the most important moves to make are yours, and yours alone.<br/><br/><strong>Features</strong><br/><br/>- Three player roles to choose from<br/>- Player pronoun selection<br/>- Six romanceable characters<br/>- Two polyamorous relationships<br/>- Option to play without pursuing a romance<br/>- LGBTQA+ Cast<br/>- Unlockable cgs<br/>- Mission board<br/>- Reputation system", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-05T10:41:47", "background_image": "https://media.rawg.io/media/screenshots/d41/d412344d98fb428a3b267a79c93f73af.jpg", "website": "https://www.lunarisgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "toplay": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Lunaris Games"], "genres": ["Adventure", "Indie"], "publishers": ["Lunaris Games"], "esrb_rating": null}