{"id": 375291, "slug": "narcos-rise-of-the-cartels", "name": "Narcos: Rise of the Cartels", "name_original": "Narcos: Rise of the Cartels", "description": "<p>Welcome to Colombia, 1980’s - the fires of El Patrón&#39;s empire have been lit, its influence spanning borders, and expansion unabated. Influence and corruption is rife; cops, guards, politicians and those in between are falling into the pocket of the Medellín Cartel, and after years of production, America is finally taking notice.<br />\nNarcos: Rise of the Cartels tells the story of the hit Netflix TV series, of the rise and fall of El Patrón. Choose your side and ally with the DEA or conversely side with the Narcos. Explore recognisable locations from the show and take a role in pivotal world-altering events and battles that will define and shift the war on drugs.<br />\nForm your team from a variety of class-specific roles, join leading characters, upgrade your skills and take part in brutal turn-based combat, where your actions will have consequence.<br />\nPlata o Plomo?<br />\nBASED ON THE HIT NETFLIX TV SERIES<br />\nAuthenticity is at the core of the Narcos experience and highly recognisable and iconic characters from the TV show are available to control and play, such as El Mexicano, Murphy, Peña, Primo and more. Every &#39;leader&#39; character offers unique gameplay abilities and perks to help turn the tide of battle.FAST-PACED STRATEGY COMBAT<br />\nNarcos: Rise of the Cartels takes turn-based strategy combat to a whole new level with units possessing the ability to move individually one after another or multiple times within one turn, meaning the pace always being ramped up. Plan your moves wisely but be cautious as there are always consequences to your actions.EVERY WAR HAS TWO SIDES<br />\nFeaturing two unique campaigns, Narcos: Rise of the Cartels allows you to see the war from both sides. Choose to side with the DEA and fight alongside Steve Murphy to bring down the drug empire, or choose to side with the Narcos in order to help found, grow and expand the empire under the watchful eye of El Patrón.COUNTERACT AND KILL-SHOT<br />\nInnovative gameplay mechanics keep the turn-based genre fresh by allowing you to take third-person control of your units in order to engage enemies directly, giving you the opportunity to deal critical damage at optimum moments.</p>", "metacritic": 52, "released": "2019-11-19", "tba": false, "updated": "2024-03-13T21:03:35", "background_image": "https://media.rawg.io/media/games/b48/b4857a39ad8aa61885e62230e4e82edc.jpg", "website": "", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 26, "owned": 395, "toplay": 15, "dropped": 7}, "playtime": 4, "achievements_count": 103, "ratings_count": 14, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 14, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC"], "developers": ["Kuju"], "genres": ["Action", "Strategy"], "publishers": ["Curve Digital"], "esrb_rating": "Adults Only"}