{"id": 375345, "slug": "oddman", "name": "Oddman", "name_original": "Oddman", "description": "Ready to fight for your life? Oddman is a fast-paced fighting game, where you have to be the last one standing or fall victim to the piranha-infested waters. <br/><br/>Do you have what it takes to defeat all the bosses and top the leaderboard? <br/><br/>The world has been taken over by brutal bosses, they control all the Odd-minions and their families. Now, YOU are the only Oddman left in this world that can help save everyone. <br/><br/>Oddman is a most extraordinary fighter, a swift swipe of your finger and he moves at the speed of light. How many enemies can you take out in a single move? Practise your skills and compete on the daily and global leaderboards! <br/><br/>Or take the fight directly to your friends and battle on one device to be the last one standing. <br/><br/>Win epic treasure chests, collect shiny coins to upgrade your ninja skills, gather better armor and level up your belts to become the best possible fighter. <br/><br/>Game features<br/>• Punch! Punch! Punch! A great ninja warrior never fears! Experience an awesome endless boss fight! <br/>• Challenge your friends in TWO PLAYER MODE on one device!<br/>• Easy to pick up and play, difficult to master. Instant fun. <br/>• Find your favorite funny outfit. Unlock unique characters, belts and powers.<br/><br/>PLEASE NOTE: Oddman is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>Developed by Set Snail and published by JoyPac Games 2019", "metacritic": null, "released": "2019-09-14", "tba": false, "updated": "2022-11-03T18:21:06", "background_image": "https://media.rawg.io/media/screenshots/1a6/1a60ae22bcb317cf4d3ebf77101a574e.jpg", "website": "http://joypacgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Joypac"], "genres": ["Action", "Casual"], "publishers": ["PLUSDOT Technology"], "esrb_rating": "Everyone 10+"}