{"id": 375334, "slug": "balls-blast-shoot-hit-game", "name": "Balls Blast: Shoot & Hit game", "name_original": "Balls Blast: Shoot & Hit game", "description": "Time to fire your cannon!<br/>*** Ball Blast is the best ball shooting game for 2018!***<br/><br/>Ball Shoot is like pinball with cannon shoot and red ball 4. Magic ball will fly and jump you must avoid it and shoot the red ball to blue ball and destroy all flying balls. Game also use gravity ball to drop and jump bat ball.<br/><br/>Ball Shoot is the latest arcade game allow you use cannon to shoot ball which ball contain the number. When shoot the ball the number will decrease and destroy when it is zero. <br/><br/>*** How to play*** <br/>Move the cannon left and right to shoot the flying balls/red ball/evil ball. Don't let the falling balls touch the cannon.<br/><br/>*** Features*** <br/>-20+ Cannons to collect<br/>-Upgrade cannon to get high score and blast hamster ball<br/>-Move the cannon to blast ball 99<br/>-Shoot up all ballz and destroy flying ball<br/>-Many beautiful themes will random in each game.<br/>-Magic ball is many color ball and it change color when decrease number of ball<br/>-The red ball is strongest and it change to green ball when it prepare for split or destroy<br/>-Bubble shooter, egg shoot and ball shoot<br/><br/>Ball blast is a shooting game. Block breaker cannons ! <br/>For Ball blast, it is time to blast!<br/><br/>Shoot the balls and upgrade your cannon, how long can you survive?", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-09-20T03:40:18", "background_image": "https://media.rawg.io/media/screenshots/5ce/5ce360c8a18af6f8faa2bf7f7aeff634_vn8ISfG.jpg", "website": "http://resource.cdn.bbcget.com/linephysicsios/linephysicsios_privacy.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Word Puzzle & Fun Games For Free"], "genres": ["Action", "Casual"], "publishers": ["BEYOND CLOUD MOBILE"], "esrb_rating": "Everyone 10+"}