{"id": 375358, "slug": "shooting-royal-car-race-r-2018", "name": "Shooting Royal-Car Race-r 2018", "name_original": "Shooting Royal-Car Race-r 2018", "description": "Do you want to play a driving game which allows you to shoot and compete with others ? Well you have come to the right place !<br/>Shooting Royal Car Racer 2018 allows you to race with others and shoot targets and compete for points. A time attack battle that is fast paced shooting while driving a car . Eliminate the competition !<br/><br/>Speed and Precision is what you need to survive these modern battlegrounds. The ultimate survival through points. Become a super hero , a legend of modern warfare by completing the tasks at hand before anyone else ! <br/><br/>Play the best free action shooting game with a twist of rally racing ! Players can enjoy the unique 3D game graphics with cool sound-effects and enjoy free time playing this super funny fps game by downloading online and playing offline.<br/><br/>As a professional marksman deal with your enemies with amazing deadly shooting. Hit the targets before the time ends .You will get limitless race on the highway to make your score high profile and you have to get much coins and have to destroy the vehicles , that i would normally say but unfortunately you only get to destroy targets. In extreme speed. In this fast speed death race with rival road rage traffic attack 3D game we provided to latest shooting weapons with upcoming different vehicles loaded with powerful weapons, you can get your favorite one and can enter the limitless highway race among the huge traffic. Easy controls, high definition 3d graphics, immersive gameplay physics and amazing background sound effects are great in this death mad car max speed shooting vehicles simulation game.<br/>The New 3d Shooter experience. Join the resistance and Command this revolution like a real war hero. Take your weapon, strike the enemy army with a hail of bullet, grenades, massive guns. Release the Fury of this War! You received the call for duty of saving the people !.<br/><br/>You can also feel like master death rider and attacker on the road relish target shooting and destroying drivers in this expert shooting 3D addictive death car simulation. The dangerous mad death rival car race traffic shooting simulation is full action base free race on the crazy roads legends addicting game. Start racing with deadly unique and lethal car or never seen before attacking and shooting on the traffic asphalt roads. More extremely fast speed and beautiful road rage cars on highway tracks. Run fast your vehicle as you can as a fast racer, big surprise for you, you can shoot different  kinds of targets and you can the test of your driving and shooting on the vehicles coming on your way. Earn more scores to pick the coins! <br/><br/> <br/><br/>Shooting Royal Car Racer 2018 Features:<br/><br/>- Third Person Shooting Game<br/>- Precision aiming to shoot targets<br/>- Unique Hybrid of Shooting and Racing<br/>- Amazing looking Environments<br/>- Great looking cinematics.<br/>- Choose your Weapon", "metacritic": null, "released": "2018-07-25", "tba": false, "updated": "2019-09-20T03:51:52", "background_image": "https://media.rawg.io/media/screenshots/d5f/d5fd581a9da218e1effaba6b22782714_ZSE7zmg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Spark Game Studios"], "genres": ["Action", "Casual"], "publishers": ["Spark Game Studios"], "esrb_rating": "Mature"}