{"id": 375347, "slug": "real-speed-parking-3d", "name": "Real Speed Parking 3D", "name_original": "Real Speed Parking 3D", "description": "Come and challenge your parking skills and become a highly skilled parking driver, you will be the next parking master!<br/><br/>Real Speed Parking 3D is the simulation and car parking game with the most realistic parking scene in history, allowing you to master the actual parking skills during the game. <br/><br/>*****   How to play   *****<br/>According to the requirements in each level, Driving the car to the designated parking space without collision. There are still a lot of game modes.<br/>&gt;&gt;Career mode: Normal difficulty. There are many interesting and characteristic level layouts waiting for you complete.<br/>&gt;&gt;Off-road mode: Higher difficulty. You need crossing the mountains to the desiganated place, which is a test of your driving skills.<br/>&gt;&gt;Challenge mode: The higher of the season ranking, the more exclusive rewards you will receive. Come to challege for enjoying the racing game.<br/><br/>*****   Game Features   *****<br/>&gt;&gt;Ultimate driving control<br/>Turn on Steering &amp; Braking Assistance to get up to speed in a flash!<br/><br/>&gt;&gt;3D graphics<br/>Using outstanding 3D rendering techniques, the game features the most beautiful and authentic supercars to date. <br/><br/>&gt;&gt;Realistic environment<br/>Gain parking experience in different parking lots and drive easily in real life! Our parking lots have different times of day and weather conditions.<br/><br/>&gt;&gt;Real cars<br/>Collect the racing cars and supercars of your dreams to show them off in your huge warehouse garage, including 458,86,918 and so on!<br/><br/>&gt;&gt;Different camera angles<br/>View the action from a variety of camera angles. Check behind your car with rearview mirrors even when driving from the inside, and park easily!<br/><br/>&gt;&gt;Rich levels<br/>With more than 150+ levels, special level layouts and warehousing types, as well as fun and challenging chapters!<br/><br/>&gt;&gt;Configure and customize<br/>Choose from steering wheels, dashboards and selectors to personalize your car, just as you would in real life, with a world-class car configurator.<br/><br/>&gt;&gt;Realistic car sounds<br/>Feel as if you are really driving with realistic cars and special real sounds for each car!<br/><br/>The perfect game for fans of free games, arcade racing, driving fast, drift racing, weaving through traffic, parking game, simulation game, driving simulator, and nitro-charged, power motor competition!<br/><br/>We are looking forward for your feedback on our fans page.<br/>https://www.facebook.com/Speed-Parking-359449404665154<br/>or E-mail:<br/>simulation.sharpstar@gmail.com", "metacritic": null, "released": "2019-09-19", "tba": false, "updated": "2019-09-20T03:46:52", "background_image": "https://media.rawg.io/media/screenshots/21f/21ff72013fd4cc915df7c68f54d75cf2_SKU2mLX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bufei Chen"], "genres": ["Simulation", "Racing"], "publishers": ["Bufei Chen"], "esrb_rating": "Everyone 10+"}