{"id": 375428, "slug": "mega-mall-story2", "name": "Mega Mall Story2", "name_original": "Mega Mall Story2", "description": "A business management sim where you can make a mall that's right for you!<br/><br/>Everything's been expanded since the last game - build bigger, build higher!<br/>Enjoy more freedom and customization than ever.<br/><br/>Add public transport stations to bring in customers from farther away.<br/>Visitors can come by bus, subway, helicopter, and even on UFOs!<br/><br/>Meet new mall visitors bursting with personality.<br/>I could go for a bowl of ramen and a good book...<br/>It's a manager's job to make sure customers leave satisfied.<br/>Build stores that will delight your regulars!<br/><br/>Create enough great stores...<br/>And you can even attract VIPs!<br/><br/>New tenants stores exclusive to this title.<br/>Set up exhibitions, a movie theater, pool and even an indoor farm!<br/>Stores come in different shapes and sizes - the combinations are limitless!<br/>Create combos by placing related stores on the same floor.<br/><br/>Take advantage of weather and scenery to attract more customers<br/>and compete with other stores to be the best mall in town!<br/><br/>A new challenger steps into the world of business management,<br/>dreaming of one day running a 5-star mall...<br/><br/>The sky's the limit in Mega Mall Story 2!<br/><br/><br/>--<br/>All game progress is stored on your device. Save data cannot be restored after deleting or reinstalling the app.<br/><br/>Try searching for \"Kairosoft\" to see all of our games, or visit us at  http://kairopark.jp<br/>Be sure to check out both our free-to-play and our paid games!<br/>Kairosoft's pixel art game series continues!<br/><br/>Follow us on Twitter for the latest Kairosoft news and information.<br/>https://twitter.com/kairokun2010", "metacritic": null, "released": "2019-06-14", "tba": false, "updated": "2019-09-20T04:21:38", "background_image": "https://media.rawg.io/media/screenshots/b8f/b8fb4f8e20c4069f82facf161b4fd4a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kairosoft"], "genres": ["Simulation", "Casual"], "publishers": ["Kairosoft"], "esrb_rating": "Teen"}