{"id": 375559, "slug": "stretchy-taxi-a-challenging-free-game", "name": "Stretchy Taxi - A challenging free game", "name_original": "Stretchy Taxi - A challenging free game", "description": "Stretchy Taxi - one of the best free games available.<br/><br/><br/>Your newest addiction arrived in a TAXI! Plank your way to earn coins &amp; prizes in this extremely fun free game!<br/><br/>A free game very easy to play, and hard to master.<br/>Don't fall from the road, that is it! Plank your way to win!<br/><br/>Endless amount of  Levels of limitless fun in this free game!<br/>The game offers one-tap easy-to-learn controls, rich visual effects and addictive gameplay mechanics.<br/><br/>Single-tap hyper casual free game that will keep you hooked for hours!<br/>hold to build the plank and move through the platforms.<br/>The free game features unlimited levels and 20 beautiful color themes.<br/><br/>Tap and hold to place your plank, if you make your plank too long or too short - your car will fall!<br/>Keep building your plank and reach higher levels.<br/>Unlock crazy new cars along your journey!<br/>You can play this game also without WiFi - in the offline games mode.<br/><br/>Get ready for the ultimate challenging hyper casual free game Stretchy Taxi!. You will get addicted to playing this amazing game with multiple challenges and obstacles on your way.  Stretchy Taxi is an amazing free game with 3D graphics and awesome sound effects. The game is designed with interesting game templates and themes. Enjoy the challenging template each time you play the game and create a new record. Focus on the game and be perfect with your timing skills to stay longer in the game.<br/> Stretchy Taxi is very simple tap tap free game with lots of challenges. Tap on the screen to plank the road and help your car reach more platforms. <br/>The game needs the strategic thinking skills along with the accuracy to finish levels. Don't forget to collect the coins during the gameplay! Keep finishing more and more levels for collecting the maximum coins and use the coins to unlock crazy amazing new cars.<br/><br/>************************<br/>GAME FEATURES<br/>************************<br/><br/>-Beautiful game graphics<br/><br/>-Crazy cars to unlock<br/><br/>-Difficulty increases as the level progress<br/><br/>-Multiple challenging platforms<br/><br/>-Revive mechanism<br/><br/>-Offline games mode<br/><br/>************************<br/>SAY HELLO<br/>************************<br/>We are constantly working hard on making the Stretchy Taxi free game better and more entertaining for you. We need your constant support to get going creating more offline games and free games. Please feel free to email us for any queries/suggestions/problems or if you just want to say hello. We would love to hear from you. If you have enjoyed any feature of the Stretchy Taxi free game, do not forget to rate us on play store.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-20T05:34:32", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7f93b27eb8ccd746c4bae806a6978fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MOONEE"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone"}