{"id": 375560, "slug": "idle-car-2", "name": "Idle Car", "name_original": "Idle Car", "description": "Have you ever wondered what makes a car drive? Experience every detail of creating a car from the ground up with Idle Car. Learn how a car works and what is needed to get there! Fun and easy to pick up. You will build your first car in no time!<br/><br/>Unlock a variety of cars and vehicles. From motorcycles to yachts to sports cars and more! <br/> <br/> Game Features:<br/><br/>1.        Unlock Epic Content<br/>Think bigger than just your fancy self driving car. Have you ever gone to space? Want to build a spaceship? How about a submarine to go to the deepest parts of the ocean?<br/><br/>2.        Grow your Garage<br/>Show off your collection to others by unlocking all the cars along the way. Can you build them all?<br/><br/>3.        Supercharge your Efforts<br/>Unlock turbo boosts and special power ups to get your car across the finish line. Only the best builders can make their cars 100% complete.<br/><br/>4.        Build while you Sleep<br/>Even when you aren’t playing, enjoy seeing your car’s progression! The closer you are to the finish, the more money you get to unlock special content. Watch your projects evolve right in front of your eyes.<br/><br/> <br/>Whether you like cars, like learning how things work or just want to click and collect, Idle Car will take you there. This is the best and most relaxing building game there is. Never miss a dull moment with this easy to learn and easy to play game that is almost IMPOSSIBLE to master.<br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Happy Glass, Flip Trickster and Mr Bullet!<br/><br/>Follow us to get news and updates on our other Award Winning titles;<br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-20T05:35:02", "background_image": "https://media.rawg.io/media/screenshots/7d6/7d65a5b5619176fe90f5ac8c03d23bd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Lion Studios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}