{"id": 375541, "slug": "soctics-league-multiplayer", "name": "Soctics League Multiplayer", "name_original": "Soctics League Multiplayer", "description": "Football on the go!<br/>* Play in historic tournaments and re-write history if you can!<br/>* Play against your friends on the same device or via Game Center!<br/>* Enter our online league and play against others from all around the world!<br/>* Join the Nations Cup and bring glory to your country!<br/><br/>Soctics League is a turn-based football game where your cunning strategies help you win your matches. Play against your device, your friends, or compete online in our own periodic tournaments! <br/><br/>Use binoculars to predict the movement of the ball. Use them to plan surprising attacks!<br/><br/>The online league is where you can truly enjoy our game. Build up your fan club as you keep winning matches. Your fans will support you more during the game as their numbers grow. <br/><br/> Plays great on a toilet break! ;) <br/> Binoculars for better attack control <br/> Play against the device <br/> Two players on the same device <br/> GameCenter to challenge friends online <br/> Online League: compete globally against players on iPod, iPad, Mac <br/> Nations Cup: Join your country's team to gain the Nations Trophy <br/> Chat with other players online <br/> Parent lock for chat<br/> Unlock new fan chants <br/> SmartCrowd: your fans will support you during the games", "metacritic": null, "released": "2012-05-31", "tba": false, "updated": "2019-09-20T05:25:11", "background_image": "https://media.rawg.io/media/screenshots/050/0501887d104c7c4b9b025b921f2dc6a5.jpg", "website": "http://www.soctics.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zen Heads Kft."], "genres": ["Strategy", "Sports"], "publishers": ["Zen Heads Kft."], "esrb_rating": "Everyone 10+"}