{"id": 375762, "slug": "chalkroids", "name": "Chalkroids", "name_original": "Chalkroids", "description": "<strong>CHALKROIDS!</strong>\n<p>Inspired by the vector graphics arcade games of the late 70s and early 80s, CHALKROIDS! recasts classic arcade gameplay onto a blackboard.  It’s what we wished we could have done in study hall.\r\n  </p>\n<p>CHALKROIDS! targets the casual  gamers who will enjoy the nostalgia of the fusion of classic arcade gameplay and the whimsical blackboard-themed game experience as well as younger gamers who enjoy simple gameplay and the retro styling of the game.  Designed to be played in a web browser, CHALKROIDS! does not require the player to install the game software permanently on their local machine and can be enjoyed from any internet-connected desktop or laptop computer.</p>\n<p>Using either the A and D keys or the Left and Right arrow keys, the player may rotate their spaceship counterclockwise or clockwise, respectively.  Pressing the spacebar will fire a bullet and pressing the W or Up arrow keys will produce thrust, moving the spacecraft in the direction it is facing.  Pressing the H key will teleport the player to a random point in the playfield. The player begins the game with three ships, one in the field of play and two in reserve.  An extra ship is awarded for every 10,000 points the player earns.\r\n  </p>\n<p>Players earn points by destroying asteroids and enemy ships according to the schedule below:\r\n  </p>\n<ul><li>Large Asteroid –  10 pts\r\n  </li><li>Medium Asteroid – 20 points\r\n  </li><li>Small Asteroid – 50 points\r\n  </li><li>Large Enemy Ship – 100 points\r\n  </li><li>Small Enemy Ship – 250 points\r\n  </li><li>Missiles – 150 points\r\n  </li></ul>\n<p>To successfully complete a level, a player destroys all asteroids in the field of play and survives all current enemy attacks.  The game is over when the player’s final remaining ship is destroyed.</p>", "metacritic": null, "released": "2019-09-18", "tba": false, "updated": "2019-09-20T06:26:59", "background_image": "https://media.rawg.io/media/screenshots/e86/e86d6e41ed222cbfdac09471f7863289.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["J. Douglas Patterson"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}