{"id": 375799, "slug": "brother-wake-up-demo", "name": "Brother Wake Up - Demo", "name_original": "Brother Wake Up - Demo", "description": "<p>Brother, Wake Up (Horror Game)</p>\n<p>Tangled mazes. The oppressive silence makes you listen to every rustle. And only the cries of monsters scouring the corridors let you know how close these nightmarish creatures got to you.<br/>Search every corner. Check all the rooms to find the hidden parts from the clock.<br/>It is these details that he grabs to repair the terrible clock of the \"Watchmaker\" With which he put your younger brother to sleep.</p>\n<p>Beware of watchmaker assistants, they will interfere with your search. These terrible creatures will scour and chase you on the heels.</p>\n<p>You can hide from monsters in cabinets and under the bed.</p>\n<p>Monsters have a good ear. Crouch down and they won't hear you.</p>\n<p>Monsters react differently to the light of a flashlight. Some can be driven away. Others, on the contrary, will attack you.</p>\n<p>On the passage of one location is given 3 attempts.<br/>If you have few lives left, you can always replenish it in the first-aid kit.</p>\n<p>Now the game has 4 small locations. And one big, extra, designed for a long passage.</p>\n<p>Three levels of difficulty (Ghost) Easy and Difficult.</p>\n<p>The game supports 4 languages - English, Russian, German, French, Spanish.</p>\n<p>The game is still in development. New levels will be added.</p>\n<p>If you have any idea about how to improve the game. Be sure to write. And maybe it is your idea that will be added during the next update.<br/>Good luck to your game.</p>\n\n\n<p><strong>Brother Wake Up - Complete edition</strong></p>\n<p><strong>$1.5</strong> USD<br/>\n<br/>\r\n          For one price you will get two different versions of the game for PC. And the version for android without ads and other payments. Each version has 5 levels.<br/>\n<br/>\n</p>", "metacritic": null, "released": "2019-09-18", "tba": false, "updated": "2019-09-20T06:36:17", "background_image": "https://media.rawg.io/media/screenshots/9ad/9ad6daca8cffdc397f094f9db81ee1d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tokan"], "genres": [], "publishers": [], "esrb_rating": null}