{"id": 375825, "slug": "game1-bajo-la-misma-persona", "name": "[Game1] Bajo la misma persona", "name_original": "[Game1] Bajo la misma persona", "description": "“Bajo la misma persona” \r\n<p>Es un juego de plataformas que se desarrolla en un mundo en el cual las personas son como estrellas, controlaras a Patricio, una pequeña estrella la cual se encuentra en un planeta donde los enemigos son solo vistos a través de gafas en 3D y su objetivo es salir de este planeta hacia el universo para encontrar desesperadamente a su amada.</p>\n<p>El jugador controla una estrella  la cual tiene la habilidad de saltar y además posee unas gafas 3D que le permiten ver a sus enemigos.  Tiene por objetivo salir de este planeta y encontrar a su amada en el universo. Para lograrlo debe saltar por distintas plataformas en donde se encuentran enemigos que solo pueden ser vistos con las gafas 3D (las cuales tienen un limite de tiempo para ser usadas), al tocar a los enemigos producen la muerte. El jugador deberá pasar por las diferentes plataformas en forma vertical de abajo hacia arriba intentando no caerse y sin tocar a los enemigos, hay check points durante el camino para que automáticamente se guarde el progreso del juego y no tenga que volver al inicio. Cuando al final salga y encuentre a su amada ellos harán explosión.</p>\n\r\nCréditos:\r\n<p>Alexander - Arte</p>\n<p>Nicolás - Programación</p>\n<p>Diana - Level Design, UI, Programación</p>\n<p><strong><em>Juego desarrollado como parte del Diplomado de desarrollo de videojuegos en Unity de Arkde</em></strong>: https://www.arkde.co/diplomado-unity</p>", "metacritic": null, "released": "2019-09-17", "tba": false, "updated": "2019-09-20T06:43:18", "background_image": "https://media.rawg.io/media/screenshots/711/711998c3d41a5ca2f8aa827e28efd69d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["diana23", "AlessssTejedor"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}