{"id": 375866, "slug": "deff", "name": "Deff", "name_original": "Deff", "description": "<p>Deff is a mercenary death that must hunt down other deaths that no longer want to be deaths.<br/>And apparently he's wheelchair-bound too...</p>\n<p>the game is a pixel art platform experience where each screen is individually made by hand, with interactive elements, terrifying enemies and treacherous puzzles<br/></p>\n\n\n\n\n\n<p>The mechanics of the game are easy to learn, it focuses on the protagonist's <strong>dash power.</strong><br/></p>\n<p>There are discs in the scenario that play can attack them by making them move from one point to another instantly.</p>\n<p>Just like the dashes on the discs, you can attack enemies as well, but the attack mechanics change a bit in the sense that you need to hit a left or right button attack sequence.</p>\n\n\n\n\n\n\n<p>The game is set nowadays, the boneless (rebel reapers) have dominated the world taking the place of humans and now Eternus (World of true reapers) is on the brink of collapse with the lack of human souls fueling the core.</p>\n<p>Deff is the only elite Death that has not corrupted itself on the boneless side but has also never had an interest in helping the grim reapers because him lives as a mercenary.<br/></p>\n<p>After Deff took a critical attack that left him paraplegic, his desire for revenge motivated him to meet the challenge of facing the boneless to save Eternus.<br/></p>\n<br/>\n\n\n\n\n<p>The enemies of the game range from skeletons mobsters, mutant creatures and supernatural beings who were influenced by the 80s terror culture.</p>\n<p>Each enemy has their own strategy to reap them, sometimes enemies serve as platform elements so killing isn't always the smartest move.</p>\n<p>Each level has its big angry boss and sometimes mini bosses, all with the promise that will give you the trouble you deserve.</p>\n<p>  </p>\n\n<p>===================  How to play  ===================</p>\n<p>Mouse to aim<br/>Click with the LMB to dash<br/>A and D to move<br/>Space to Sprint<br/>LMB and RMB to Super Dash (in enemies and when full mana)<br/>=================================================</p>\n<p>Feedback is a way to pay for this game, yes! Believe me!<br/>If you loved or hated the game, something that made you felt something is crucial you to leave you thoughts in the comments<br/>Hope you come back when this game is done!</p>\n<p>The developer Bruno Mossolin</p>\n\n<br/>\n\n<p>Listen the original soundtrack by: soundcloud.com/black-brisa<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-20T06:55:33", "background_image": "https://media.rawg.io/media/screenshots/b11/b118a73adc4ee6615f90ed79ced32b5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["DinoboxStudios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}