{"id": 3759, "slug": "castlevania-lords-of-shadow-2", "name": "Castlevania: Lords of Shadow 2", "name_original": "Castlevania: Lords of Shadow 2", "description": "<p>Castlevania: Lords of Shadow 2 is an action-adventure and a straight continuation of the first part of the franchise. It is also 39th part of the vast Castlevania series. The game currently features no successors.</p>\n<h3>Gameplay</h3>\n<p>The game, unlike its predecessor, features an open-world structure. The player follows the adventures of Gabriel Belmont through medieval settings and modern environments. Sometimes — at the start of the story, to be precise — the players gain control of Dracula who possesses Gabriel and gives him similar powers. The game consists of many fighting sequences in which combos are of importance — the various swords and claws, some allowing the protagonist to replenish his health and the other dealing massive damage to the enemies.</p>\n<h3>Story</h3>\n<p>The game is highly story-driven. At the start, the developers present the players with the scenes of flashbacks, in which the transformation to Dracula is shown. While set in medieval settings, events depict Dracula as he quickly gets ambushed by his resurrected son and thrown back into the modern times where he starts his adventures.</p>\n<h3>DLC</h3>\n<p>The Revelations DLC released a month after the initial game announcement brings some story arc to the game, while the others: &quot;Dark Dracula&quot; and &quot;Armored Dracula&quot; bring only new characters skins and sprites.</p>", "metacritic": 58, "released": "2014-02-21", "tba": false, "updated": "2024-03-04T16:04:50", "background_image": "https://media.rawg.io/media/games/df1/df1214c2454b88285fc78fc36bc12cde.jpg", "website": "http://www.castlevania-lordsofshadow.com", "rating": 3.77, "rating_top": 4, "added_by_status": {"yet": 126, "owned": 1368, "beaten": 198, "toplay": 87, "dropped": 60, "playing": 12}, "playtime": 7, "achievements_count": 150, "ratings_count": 251, "suggestions_count": 698, "game_series_count": 30, "reviews_count": 252, "platforms": ["Xbox 360", "PC", "PlayStation 3", "Xbox One"], "developers": ["Mercury Steam Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["Konami"], "esrb_rating": "Adults Only"}