{"id": 376145, "slug": "passcode-breaker-the-day-before", "name": "Passcode Breaker: The Day Before", "name_original": "Passcode Breaker: The Day Before", "description": "Passcode Breaker: The Day Before is a casual puzzle game in which players try to crack passcodes to deactivate computers, inspired by classic board game Mastermind with different modes and mechanics for everyone to enjoy.<h3>Story Mode:</h3><br/>You are an officer in the Air Force Nuclear Early Warning Systems. More precisely, you were.<br/><br/>A few days ago, your family disappeared, and today you received an anonymous message telling you that if you don't immediately start disabling the protection computers of the early warning systems, you will never see them again.<br/><br/>In a day, you have become an ordinary officer who will decide the fate of millions of people, including your own family.<br/><br/>3 different layers (mechanics) and 25 protection computers (levels) in each layer, 75 in total to complete the mostly linear, text based story mode which has 2 endings.<h3>Speed Run:</h3><br/>When you complete a particular layer in the story mode, you can start playing speed run mode for this layer and try to finish all the levels in a shortest time. If any computer's time is not good for you, you will be able to break its code again and again.<h3>Classic Mode:</h3><br/>Classic Mastermind mechanics and 3 difficulty options for you to reach your best score.<br/><br/>Easy: 3 digits passcode, 4 icons, 5 trials<br/>Medium: 4 digits passcode, 5 icons, 7 trials<br/>Hard: 6 digits passcode, 6 icons, 12 trials<h3>Challenges:</h3><br/>3 challenges to beat. Are you lucky or is your memory strong enough? Just for a quick, casual session or maybe a fun way to decide who will wash the dishes next.<br/><br/>2s: 2 digits passcode, 2 icons, 2 trials<br/>4s: 4 digits passcode, 4 icons, 4 trials<br/>Blind Run: 4 digits passcode, 4 icons, 8 trials, trial history is invisible<h3>And more:</h3><br/><ul><li>Steam achievements<br/></li><li>Trading cards<br/></li><li>Steam rich presence<br/></li><li>Different old computer colour palettes with an option to use only black &amp; white</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-23T02:36:15", "background_image": "https://media.rawg.io/media/screenshots/d31/d3187297c4f1bb8ec867a9a7e2b970b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tutorial Boss"], "genres": ["Casual", "Indie"], "publishers": ["Flying Interactive"], "esrb_rating": null}