{"id": 376120, "slug": "1984-rewired", "name": "1984 Rewired", "name_original": "1984 Rewired", "description": "<strong>1984 Rewired</strong> is a first-person platformer set in a dystopian society in which the <strong>Great Warden</strong> controls everything and everyone. The main source of his power is the <strong>Cyber Reality</strong>, a super network where every citizen has his own digital identity. Thanks to this network the Great Warden can reach anyone with his propaganda and keep his control on everything.<br/>The <strong>Great Warden</strong> grants security, wealth, prosperity, but he took freedom in exchange. <br/>\"<strong>Freedom is weakness, abiding rules makes us stronger</strong>\" .<br/><br/>You, an hacker called <strong>N4M3L35S.1</strong>,  will have to hack your way through the <strong>Cyber Reality</strong> to expose the truth behind the <strong>Great Warden</strong> and his regime. But, be aware, the <strong>Great Warden</strong> is always watching, you have to be quick and run through the network before the security system detects you. <br/>The deeper you dig into the <strong>Cyber Reality</strong>, the harder is going to be your path. <br/><br/>This is an hardcore challenge and it will require speed, perfect timing and fast reaction in order to avoid the defensive systems and reach the exit before the time runs out.<br/>Test your skills trying to complete every level as quick as possible, look for shortcuts and alternative paths.<br/><br/>And if you are up to an extra challenge look for the hidden <strong>VHS</strong>, there is one in every level.<h3>Features</h3> •\thardcore fast pace gameplay<br/>•\tunique levels with tons of traps and puzzles<br/>•\toriginal soundtrack with 80s vibes<br/>•\tspecial powers to make your way through the levels", "metacritic": null, "released": "2019-10-08", "tba": false, "updated": "2019-09-23T02:22:04", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0c8a8d92d07d9c819c4f15137b7a925.jpg", "website": "https://othersideinteractive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Otherside Interactive"], "genres": ["Indie"], "publishers": ["Otherside Interactive"], "esrb_rating": null}