{"id": 376162, "slug": "hunger-tower", "name": "Hunger Tower", "name_original": "Hunger Tower", "description": "After the last catastrophe, the world got desolated and degenerated. Like everyone else, you woke up in a tower with many different rooms. Where is this? How did you get here? You only have a smart device and an unknown transmitter with you, and no knowledge of what happened. You have no other choice but to embark on this journey to survive in this mysterious tower and explore the truth.<br/>\n<br/>\r\nLegend has it that the tower lies at the end of the world and that it was born from the catastrophe. Although this is a cursed place, it is said that at the top of the tower lies precious treasures and powers strong enough to rule the world. Many brave and greedy people often enter the tower for the power that lies on top, and some people are thrown into the tower as a punishment. Very few people can survive the horrors of the tower. This is a live-action climbing game that all human beings can participate in. To live, or to die.. It is up to you.<br/>\n<br/>\r\nFeatures:<br/>\r\n1. Procedurally generated levels, each run is an unique adventure!<br/>\r\n2. Challenging combat mechanics which requires critical timing!<br/>\r\n3. Collect clues and solve puzzles to unravel the secret of the tower!<br/>\r\n4. Wield over hundred pieces of armor and weaponry to dominate the tower!<br/>\r\n5. Your death won't be in vain, become stronger after every revive!<br/>\r\n6. 6 Professions to choose from: Balancer, Attacker, Defender, Anger, Lucky Star and Collector.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-23T02:45:26", "background_image": "https://media.rawg.io/media/screenshots/054/05455cad15b1020d87954c281ced8ff9.jpg", "website": "http://www.funmengames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FunmenGames"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["BEST KIRIN GLOBAL"], "esrb_rating": null}