{"id": 376130, "slug": "gun-blaze", "name": "Gun Blaze", "name_original": "Gun Blaze", "description": "<p>Gun Blaze is dynamic online arena fights in the far future setting.<br />\nHumanity embraced the deep space, by opening a way of instant travels between planets through wormholes. In the distant worlds, people have found traces of extinct civilization... Whole cities, completely autonomous, without a single living being, but left in perfect condition. Any damage caused to it, the city eliminated itself, using alien secrets. An attempt to explore extraterrestrial technologies led to a tragedy... The accident took hundreds of human lives.<br />\nBut all the dead were revived. Alien cities, as it turned out, were preserving not only their appearances, structure, buildings and roads, but also all who died on the planet in any way, except of old age. Waves of colonists were overflowed the cities, prices for land and housing were rocket up to the sky. The rich can now live longer, for hundreds of years, and get whatever they want. Others can work in factories and mines, without risk of dying from an accident and with minimal harm to their health.<br />\nThe territory and property disputes led to numerous local conflicts. Major military and weapon companies have added fuel to the fire, using such conflicts as testing grounds and promotions for their products.<br />\n- Find your favorite weapon and your role on the battlefield: be a sniper, an engineer or a stormtrooper.<br />\n- Fight against other players, capture the enemy base and protect your own.<br />\n- Create your set of implants and use unique skills.<br />\n- Control heavy vehicles: tank, suv.<br />\n- Score points to take a place in the global table of records.<br />\n- Create your own unique weapon skins and sale them through the store.<br />\nIt&#39;s fight time!</p>", "metacritic": null, "released": "2019-10-14", "tba": false, "updated": "2019-10-14T12:30:57", "background_image": "https://media.rawg.io/media/screenshots/1b6/1b6e0ec6717eed39e47fd51ace30d451.jpg", "website": "http://gunblaze.ru/articles/about/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cybertime System"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Cybertime System"], "esrb_rating": null}