{"id": 376195, "slug": "high-school-makeup-boutique", "name": "High School Makeup Boutique", "name_original": "High School Makeup Boutique", "description": "Welcome to the world of Fashion. This game is super fun in which you can prepare college girls so that they can look better. With fashion stars, top models and fabulous celebrities like makeovers, you have a special make-up and makeover game. You have so many wonderful accessories for your makeover that even barbie will be surprised to such beautiful dresses and makeovers.<br/>All you have to do is choose your fashion model and give her a proper makeover. After choosing your model, you can give her a spa treatment that includes cleaning pimples and even popping those, threading eye brows, face scrub, hair wash, face wash &amp; steamer. After your model has come out of the spa, she requires a makeover. The makeover scene includes putting blush on, eye liner, changing eye color, various lipstick colors available, a wide variety of ear jewelry and tiara to make her look like a princess. Select from an enormous range of hair styles and hair designs. You can also choose from amazing lipsticks shades, find the color that suits your lips best. Just wait, we are just getting started. Your eyes makeover is the most important part, with various eye lens and eye shades. Barbie will surely get jealous when she sees the collection of your dresses and how beautiful they are.<br/><br/>The final scene of this game is the dress up scene that includes a wide variety of dresses, shoes, bags, necklace &amp; bracelets. <br/>Features Include:<br/>•\tChoose and design the most beautiful model and make her look like glam doll <br/>•\tGive your models a spa appointment and take care of their freckled and pimple skin<br/>•\tMakeover and dress up scene is included with the most awesome and beautiful dresses<br/>•\tAdd accessories that include shoes, bags, jewelry and tiara, everything a princess needs.<br/><br/>Probably the best makeover game out there. Do try out the latest fashion trends and make this fashion doll wow.", "metacritic": null, "released": "2015-08-24", "tba": false, "updated": "2019-09-23T03:02:48", "background_image": "https://media.rawg.io/media/screenshots/442/442cb98cff5e3d8ab47d6a0d56173e0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mohsin waqar"], "genres": ["RPG"], "publishers": ["Mohsin waqar"], "esrb_rating": "Everyone 10+"}