{"id": 376112, "slug": "struggle-2", "name": "Struggle", "name_original": "Struggle", "description": "Struggle is a tactical competitive VR shooting game. The special forces will be transported to the battlefield by helicopter and land at a certain location on the battlefield. You can judge your location and view the safety zone location by looking at the mini map in the lower left corner and the compass at the top of the screen. Also you can judge other soldier’s positions by footsteps and gunshots. The security zone will be randomly refreshed at regular intervals, and the refresh countdown will be displayed in the lower left corner. Special forces can be killed by other fighters, or bleeding to death if staying too long outside the safe zone. Each time the safety zone shrink, the soldier will be injured worse outside the safe zone. Soldiers should enter the safe area as soon as possible, as when entering the safe area, the blood volume will gradually recover. Special forces can pick up weapons and ammunition on the battlefield, as well as secret weapons falling from the air. Blood volume and number of bullets are displayed in real time in the lower right corner of the screen. Killing a warrior will increase 50 bullets. The game ends when there is only one soldier left. The system will display the number of kills in real time. When the warrior dies or the game ends, the system will display the rank of soldiers.", "metacritic": null, "released": "2019-09-25", "tba": false, "updated": "2019-09-23T02:17:41", "background_image": "https://media.rawg.io/media/screenshots/a97/a972700edde104509b0e229d96b204e8.jpg", "website": "http://www.tlts.cn/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TLTS"], "genres": ["Massively Multiplayer"], "publishers": ["To be determined"], "esrb_rating": null}