{"id": 376128, "slug": "10-miles-to-safety", "name": "10 Miles To Safety", "name_original": "10 Miles To Safety", "description": "<strong>The Apocalypse has arrived and your goal is simple: Make it 10 miles to safety through a limitless procedurally-generated world overrun with The Infected and packed with the tools &amp; weapons to fight them.</strong><h3>LOOT DURING THE DAY</h3>The world is full of the tools you'll need to survive: Loot every house, shop and vehicle you find to scavenge weapons, materials, ammo, blueprints &amp; recipes.<h3>TRY TO SURVIVE THE NIGHT</h3>More dangerous creatures hunt in the darkness: Stay in the light and construct barricades, traps &amp; crafted gadgets to make it through the night.<h3>SET YOUR OWN PACE</h3>Advance towards rescue and the infected grow endlessly more lethal. But range far and wide - or even retreat - to upgrade your weapons and gear &amp; stock up on resources before moving ever onwards.<h3>OVER 20 UNIQUE WEAPONS</h3>Take the fight to the infected using Shotguns, Assault rifles, Grenade Launchers, Flamethrowers, Katanas &amp; more - many upgradeable with attachments hidden throughout the world.<h3>1-4 PLAYER CO-OP</h3>You are not alone: Up to 3 friends can drop in at any time to aid you on your journey - though be warned that the world will become more lethal with every additional survivor in your group.<h3>EVENTS AND MISSIONS</h3>On your journey you'll come across survivors to save and infected to kill in special events and missions. Completing these risky trials rewards you with bonus gear, blueprints or even AI companions who'll fight by your side.<h3>CHOOSE YOUR CHARACTER</h3>Choose from one of five starting characters - each with distinct advantages leading to wildly different ways of playing the game - and unlock more by completing challenges and achievements.", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-11T20:33:15", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e50472b41a2c18ae70c51053a318cc2.jpg", "website": "http://www.10milestosafety.com", "rating": 2.83, "rating_top": 3, "added_by_status": {"owned": 36, "toplay": 1, "dropped": 2}, "playtime": 3, "achievements_count": 117, "ratings_count": 6, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Trickjump Games"], "genres": ["Action", "Indie"], "publishers": ["Trickjump Games"], "esrb_rating": null}