{"id": 376239, "slug": "vr-us-army-moto-racer", "name": "VR US ARMY MOTO RACER", "name_original": "VR US ARMY MOTO RACER", "description": "US Army Moto Racer VR<br/><br/>Chance to beat enemy army men on their bikes and win moto race and get tribute<br/><br/>It's a moto racer furious bike race between US army heroes and other army soldiers. Do whatever you can do to win the race, chase your opponent army soldiers, beat your enemies with sticks and chains during heat of deadly race competition and knock your rivals out. <br/>It's a race of life and death. Participate in the race with most advanced futuristic vehicles. Test your racing and fighting skills together in the most intense racing war fight. Keep in mind that in the intense high speed race try not to crush in other vehicles. Drive the high speed motor bikes through beautiful offroad and hill environments. Need is for speed and need is for a win.<br/>In the start of the game you will be asked to buy a vehicle. Buy a vehicle and participate in your first deadly furious bike race. You have to be fast as light as your opponent army is going to try every tactics to knock you out from the race. Show your anger use the chain and sticks and built in guns to kill and eliminate your rivals from the race and become the champion. With every win you will earn some money and rewards. Spend your money wisely to upgrade the bike as the competition is going to be harder and harder. Unlock different bikes and racing highways. This is the war zone. Tribute should be yours.<br/>Play in different modes and different environments.<br/>Choose your vehicle to start the race, beat your opponents in highly intense competitions and earn money to upgrade and repair your heavy bike.<br/><br/>---Features of US Army Moto Racer VR:---<br/><br/>Multiple Modes, Multiple Environment<br/>Deadly race with guns, chains and sticks<br/>High Tech Vehicles<br/>Offroad and hill environments<br/>Earn money from race to upgrade and repair the motor bike<br/>Unlock the fastest motorcycles by winning races<br/>Real life sound effects<br/>Challenging missions<br/>Addictive gameplay", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2019-09-23T03:23:36", "background_image": "https://media.rawg.io/media/screenshots/16b/16b9bc6f2f621525a5d7799e02088f80_4RQKVEa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Adventure", "Racing"], "publishers": ["Sunstar Technology Group"], "esrb_rating": "Teen"}