{"id": 376252, "slug": "x-warclash-of-zombies", "name": "X-War:Clash of Zombies", "name_original": "X-War:Clash of Zombies", "description": "Ready to play an exciting strategy game with Superheroes vs Zombies theme? Do you want to recruit powerful Super Heroes to defeat Zombies in the doomsday? Build your empire, train your troops, and fight alongside your superheroes in Clash of Zombies!<br/><br/>Build and defend your base, slay zombies with a band of legendary heroes. To survive in doomsday, you'll need wit, will, and use different troops, spells and heroes, try different battle combinations and strategy. It's time to Clash!<br/><br/>＝Clash of Zombies Features＝<br/>◆  Core gameplay of Clash of Clan, more exciting gameplay and Interesting clan items!<br/>◆  Complete the Superhero Book! There are over 50 legend heroes to collect and evolve!<br/>◆  Collect gems and empower your heroes and legend troops: You'll see how their strength in battle grows!<br/>◆  Take part in Zombie Challenge and conquer the empires and castles!<br/>◆  Defeat evil bosses with your league mates and loot unfathomable rewards!<br/>◆  Challenge your friends to thrilling real-time duels, you will be legend and the king of war!<br/>◆  Join forces with other Heroes Masters in Alliances, build empire together and unlock exclusive rewards!<br/>◆  Clash of Zombies players all over the world could battle together to become the rightful king of their castles and empires!<br/><br/>Zombie disaster outbreaks! Are you brave and skillful enough to defeat the king of zombies in castle and base? Do you have what it takes to become the King of empire? Don't hesitate! Join the fierce battle with your idle heroes now!<br/><br/>If you already love our game… Drop us a nice review:)<br/><br/>Clash of Zombies is FREE to download and FREE to play. However, you can purchase in-app items with real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>＝Contact Us＝<br/>Chat in QQ Group:285306911<br/>Chat in Discord Group: https://discord.gg/uHVvR6E<br/>Like us on Facebook: https://www.facebook.com/apocwarscoz/ <br/>Feedback by Email: feedback@caesarsgame.com<br/>Subscribe to our Youtube channel: https://www.youtube.com/watch?v=HZnrVIwWuvs<br/><br/>Check out other cool games by the creators of Clash of Zombies:Heroes Game and Heroes Legend:Idle RPG!", "metacritic": null, "released": "2013-08-30", "tba": false, "updated": "2019-09-23T03:29:38", "background_image": "https://media.rawg.io/media/screenshots/6c2/6c2386c63cc6856cf1cac5a923fc8ab2_yo8LxLw.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["caesars"], "genres": ["Strategy", "Simulation"], "publishers": ["YunPeng Shen"], "esrb_rating": "Everyone 10+"}