{"id": 376370, "slug": "international-snooker-classic", "name": "International Snooker Classic", "name_original": "International Snooker Classic", "description": "Big Head Games are very proud to announce the return of the original, classic edition of International Snooker, rebuilt and re-mastered for the latest iOS devices.<br/><br/>Originally featured by Apple in their iPhone 3G \"On Call\" TV Ad campaign. International Snooker is regarded as one of the most pioneering touch based sport games of it's time. <br/><br/>After several years away from the AppStore. We have lovingly brought this title back in it's original untouched form to work on the latest generation of iOS devices.  Superb game play, controls and TV style visuals make this still one of the most compelling sports games on the app store today. Now available free to play with no in-app purchases.<br/><br/>*** Winner of the MobileGameFAQs.com GOLD AWARD!!! Scoring an amazing 95% for Graphics, and 93% for Playability ***<br/><br/>Features:<br/>√ Single and two player quick games<br/>√ Tournament mode with 8 rounds against the world's best, competing for a place on the podium and the coveted IS Gold Cup.<br/>√ Super smooth and intuitive camera and cue control.<br/>√ Accurate power control, not 'swipe and hope'.<br/>√ Realistic ball physics including top, back and side spin.<br/>√ Play your own music or listen to the high quality sound fx and theme tune.<br/>√ Ball path guide lines including object and cue ball paths help and enhance gameplay. <br/>√ Difficulty settings that truly make a difference.<br/>√ Stats page to review and compare.<br/>√ Game autosaves after each ball is potted - never lose your game to an interruption!<br/>√ Adjustable Cloth Speed.<br/><br/>********* IMPORTANT TIP! *********<br/>FINE TUNE SHOTS: When lining up shots, stroke across the top of the screen for faster movement, and across the bottom of the screen for fine movement!<br/>» Higher Strokes = Faster Movement<br/>» Lower Strokes = Slower Movement<br/><br/>Save Games: This application saves after every shot played. In tournament mode you have the opportunity to play a match again if you lose up until the Qtr finals where you must play and win straight through to the final.<br/><br/><br/>Version History:<br/><br/>VERSION 1.1 <br/>+ Added Toggle Guides option to the in-game menu (not for the faint of heart!).<br/>----------------------------------------<br/>VERSION 1.2<br/>+ Improved AI: Einstein has been removed from the equation...opponents are now human!<br/>+ Fixed rare Yellow ball re-spotting bug.<br/>+ Fixed Black ball re-spotting, where a frame is tied.<br/>+ Improved ball in hand placement. Now positioned by dragging anywhere across the screen for relative movement.<br/>----------------------------------------<br/>VERSION 1.3<br/>+ Optimised physics<br/>----------------------------------------<br/>VERSION 1.5<br/>+ Improved Physics, and cloth speed option<br/>----------------------------------------<br/>VERSION 1.8<br/>+ Re-released as Classic edition to support the latest generation of devices and iOS<br/>----------------------------------------", "metacritic": null, "released": "2009-01-10", "tba": false, "updated": "2019-09-23T04:29:47", "background_image": "https://media.rawg.io/media/screenshots/012/0123c0d695bdc67f0cde5583614d4bc4_RtsH8QP.jpg", "website": "http://www.bigheadgames.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Head Games"], "genres": ["Simulation", "Sports"], "publishers": ["Big Head Games"], "esrb_rating": "Everyone 10+"}