{"id": 376338, "slug": "american-dragon-battle", "name": "American Dragon Battle", "name_original": "American Dragon Battle", "description": "Let start your battle against crime as legendary fighter to save America.<br/>this is a war infinite about the most powerful superheroes of the galaxy. <br/>◎◎◎◎◎ Join the battle in this action Infinite war!<br/>You as the fearless fighter and the street fighter have to keep on fighting off the dark forces till the day with your fighting skills &amp; tactics. <br/>This is not going to be some rival’s battle but serious super hero vs super villain’s battle.<br/>You will have to fight against the senior managers of the shadow battle.<br/>Each shadow enemy owns a ball dragon and you must kill them before they use the power of ball of dragon to destroy America.<br/>◎◎◎◎◎ You must become the champion of shadow war. <br/>All the Crime Fighter are invited to take part in this Furious Battle. The immortal superhero will actively take part in the battle against crime and criminals. This is going to be one Super-exciting battle with True Super hero exhibiting his Crime fighting skill, tactics of Survival battleground, fighting off the City night crime, doing superhero fight and leading the Us Police robots. Beware of the street gangster as they are after the hunters hero as they are patrolling the street of New York city.<br/><br/>◎◎◎◎◎ Game Features:<br/>1. Realistic 3d battles<br/>2. Superb flying City Rescue Game<br/>3. Interesting, challenging and User friendly gameplay<br/>4. 3 Player : Each character have a special skills", "metacritic": null, "released": "2018-08-16", "tba": false, "updated": "2019-09-23T04:16:29", "background_image": "https://media.rawg.io/media/screenshots/839/83964affaae8466f860b02a7ac1c5317.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Trevor Kamhunga"], "genres": ["Action", "Adventure"], "publishers": ["Trevor Kamhunga"], "esrb_rating": "Everyone 10+"}