{"id": 376369, "slug": "international-pool-free", "name": "International Pool Free", "name_original": "International Pool Free", "description": "The App Store's #1 Sports and Simulation cue-sports engine is unleashed on a dedicated Pool game for the first time ever! <br/><br/><br/>REALISM<br/><br/>Showcasing some of the best ball and cloth physics you'll find outside a real pool hall, International Pool follows in the footsteps of the chart topping International Snooker series, featuring state of the art graphics and physics built for the latest generations of iPhones, iPads and iPods running iOS 9.<br/><br/>DEPTH<br/><br/>Four Pool modes with 8 levels of opponent AI and 12 Global Leaderboards, catering for all skill levels, from Rookie to Elite. Earn cash and achievements to unlock and qualify for higher-tier locations and Leagues, and fill your Trophy Room to showcase your mastery of the world's most popular cue-based sport.<br/><br/>INTUITIVE<br/><br/>Controls and options that cater to all levels of player experience, both casual and pro, with an unobtrusive UI and simple - yet powerful - control over shot setup.<br/><br/><br/>• US 8-Ball<br/>• UK 8-Ball<br/>• 9-Ball<br/>• 10-Ball<br/>• League based Global Leaderboards (online participation optional)<br/>• 12 Leaderboards and 128 AI opponents across four locations<br/>• Practice Mode (8 difficulty levels)<br/>• 24 Achievements and 20 unique trophies<br/>• 2 Cameras - Top-down and Player viewpoint - for shot setup<br/>• 7 Replay cameras<br/>• Replay video controls and camera switching.<br/>• Comprehensive shot setup with full spin and swerve physics.<br/><br/>International Pool is focused on League progression, and can be played entirely locally or by participating with global scoreboards (Leaderboards).<br/><br/>To submit your scores to the Global Leaderboards, you will need an available internet connection at the time of submission.", "metacritic": null, "released": "2015-11-03", "tba": false, "updated": "2019-09-23T04:29:21", "background_image": "https://media.rawg.io/media/screenshots/768/7680baa6a5fc9a37d481613822be0664_XWJP0Ok.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Head Games"], "genres": ["Simulation", "Sports"], "publishers": ["Big Head Games"], "esrb_rating": "Everyone 10+"}