{"id": 376357, "slug": "solisquare", "name": "Solisquare", "name_original": "Solisquare", "description": "Solisquare is an all new solitaire game that is fun and easy to play. But don't be fooled, there is more strategy than in regular solitaire. Play on your Apple TV, iPhone or iPod and your progress and games are saved from device to device! Start a game on your Apple TV and finish it on your phone! There is also an Apple Watch version - designed perfectly to fit on your wrist! The only solitaire game that can be played with no scrolling!<br/><br/>Each round is played with 52 cards. Your goal is to reveal all 52 cards by building up and down in 4 scoring piles. You also have 4 store piles that you can use to store one extra card in to use later. Almost every deal is winnable! <br/><br/>You begin with a standard deck...but as you level up and earn coins, you can unlock new decks! These decks were specifically created for Solisquare. Choose a deck that matches your personality, or take the ultimate challenge and collect them all! The more you play, the more decks you can unlock!<br/><br/>Earn points and coins for each round played, and bonus points for winning! Points will increase your level rank which will all you to unlock new decks.<br/><br/>Battle Mode! - Play against other players from around the world in a two player version! Each player races to get rid off all 52 cards while playing at the same time on the same playing squares! Earn or lose Battle Cred after each match! <br/><br/>Compete with your friends on the leaderboard-Most points, most wins, longest streak and highest scoring game! Complete achievements and track your progress!<br/> <br/>Current decks include:<br/><br/>• Standard<br/>• Vintage<br/>• Space<br/>• Money<br/>• Llama<br/>• Helvetica<br/>• Pizza<br/>• Pineapple<br/>• Beach<br/>• Birds<br/>• Domino<br/>• Cactus<br/>• Hand Drawn<br/>• Unicorn<br/>• Wilderness<br/>• Math<br/>• Western<br/>• Skull<br/>• Leaves<br/>• Architecture<br/>• Denim<br/>• Camo<br/>• Puppies<br/>• Cats<br/>• Horses<br/>• Puns<br/>• Zoo Animals<br/>• Poodles<br/><br/>New decks released monthly- collect them all!", "metacritic": null, "released": "2019-09-19", "tba": false, "updated": "2019-09-23T04:24:01", "background_image": "https://media.rawg.io/media/screenshots/764/764e37ebe265b0429ea4c9b6dfb615ff_nd00jxh.jpg", "website": "http://chainreactiongames.org", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["gary gogis"], "genres": ["Casual", "Card"], "publishers": ["gary gogis"], "esrb_rating": "Everyone 10+"}