{"id": 37651, "slug": "death-from-above", "name": "Death from Above", "name_original": "Death from Above", "description": "<strong>Death From Above</strong> is a short, about 90 minutes long, single-player arcade-style drone game set during the Russian invasion of Ukraine. You will play as a Ukrainian military drone operator who fights enemy forces, salvages valuable equipment, and restores crucial communication lines disrupted by the conflict.<br/><br/>But that's not all. What sets Death From Above apart is that it's not just a game but also a means to make an impact!  <br/>30% of the net proceeds will be equally split between two Ukrainian organizations supporting non-offensive aid to the Ukrainian Armed forces: <strong>Come Back Alive</strong> and <strong>Army of Drones</strong>. This way, you can feel confident that your purchase contributes to a worthy cause. Once we’ve broken even on the game, we will increase this contribution, sending 70% of our net revenues to these good causes. The remaining 30% will be invested in further developing the game.<h3>Key Features:</h3><ul><li><strong>Interplay between operator and Drone</strong><br/><br/>After you deplete your drone's ammo, you must return to your operator's position to rearm. Risk trekking deeper into enemy territory for a quick and easy top-up, or stay at a distance to assure your survival!<br/><br/><br/><br/></li><li><strong>Clear the Ukrainian steppe of Russian invaders!</strong><br/><br/>Seek out, bomb, and destroy HQ camps, vehicles, and military depots; stay focused, and switch between top-down and third-person perspectives to maximize your impact!<br/><br/><br/></li><li><strong>Take over control towers to restore communication lines!</strong><br/><br/>Patrol the area, neutralize defenses, then bring in the operator for a successful mission!<br/><br/><br/></li><li><strong>Recover stolen washing mac-*ahem*...Precious hardware!</strong><br/><br/>The invaders are always on the lookout for any hardware they can grab. Keep on the lookout for any stragglers and recover this precious resource!<br/><br/><br/><br/><strong>Death From Above</strong> is our first game under the<strong> Lesser Evil</strong> brand and our first statement. It’s a conscious decision to engage with a difficult issue that directly affects millions of people's lives<strong> in Ukraine and beyond</strong>, a decision that some might see as controversial. <br/>While we embrace controversy and difficult conversations, <strong>we don’t believe in controversy for its own sake or the sake of sales</strong>. We engage in these topics because we are convinced they are important and that the power of video games can be a tool for political and social activism. <strong>Death From Above</strong> is no exception to that. <br/>Additionally, we’re proud to help spread this message of support for Ukraine’s defense<br/><br/><strong>Are you ready to help Ukraine and make Death from Above the best game it can be? </strong><br/>If you want to help us or even become a part of the project, now is the best time to reach out! Join the virtual fight for Ukraine’s freedom, and express your support for the cause.<br/><br/><strong><h3>WISHLIST NOW!</h3></strong><br/><br/><strong><h3>Partners:</h3></strong><br/><strong>\"Aerorozvidka\"</strong> is an NGO and a team that creates and uses net-centric and robotic military capabilities to enhance Ukraine's security and defense. They specialize in aerial reconnaissance and drone warfare, aiming to improve situational and battlefield awareness and cybersecurity. They design drones and train operators on the best deployment techniques. They are also involved in developing centralized data gathering and processing centers to support Ukraine's security and defense efforts<br/><br/><strong>\"Gis Arta\"</strong> is a Ukrainian military software developer that creates battlefield management systems to, among other things, help the Ukrainian army control and deploy drones.<br/><br/>These organizations will offer us their expertise in drone warfare and help us realize our vision for Death From Above in the best way possible.<h3>Donations will go to:</h3><br/><strong>\"Come Back Alive</strong>\" is the biggest Foundation providing competent assistance to Ukrainian defenders since 2014. Their goal is to preserve the lives of Ukrainian defenders in the face of an invading force by purchasing the necessary equipment and delivering it to the frontlines so that they can save civil lives. The foundation supplies thermal imaging devices, generators, radios, GPS navigators, UAVs, cars, body armor, and protective, communication, and intelligence equipment. The foundation’s instructors train the military in controlling drones, mine safety, and tactical medicine.<br/><br/><strong>“Army of Drones”</strong> is a joint comprehensive project of the General Staff of the Armed Forces of Ukraine, the State Special Communications Service, the Ministry of Digital Transformation, and the Ministry of Defense of Ukraine, which organizes and conducts procurement of UAVs (Unmanned Aerial Vehicles), supply them to the military, train operators to fly drones and support Ukrainian startups and manufacturers in the field of UAVs to develop the military-tech sector in Ukraine</li></ul>", "metacritic": null, "released": "2002-10-01", "tba": false, "updated": "2023-05-26T05:09:27", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5bdaa51cfff3ab46b1c66cc4d436751.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "toplay": 1}, "playtime": 2, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Rockodile", "The Groove Alliance", "Luke Allen"], "genres": ["Action", "Simulation", "Arcade"], "publishers": ["The Groove Alliance", "Lesser Evil"], "esrb_rating": null}