{"id": 376790, "slug": "card-of-darkness", "name": "Card of Darkness", "name_original": "Card of Darkness", "description": "<p>Embark on an epic hand-animated adventure from Zach Gage, Pendleton Ward, and Choice Provisions.</p>\n<p>Cast powerful spells, slay fantastic monsters, discover ancient secrets, and ultimately save the world — just by picking up the right cards.</p>\n<p>Card of Darkness is a full-featured adventure designed around an accessible, minimalist, card game core.</p>\n<p>~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~</p>\n<p>The journey has been long, but finally you&#39;re here in the heart of Glinhorn Forest at the edge of darkness. The people asked for a hero and they got you. Good thing you&#39;re a hero.</p>\n<p>Many stacks of cards lie before you filled with monsters, treasures, weapons, potions, and spells.</p>\n<p>You can only see the top card of each stack — what lies beneath is a mystery.</p>\n<p>Sometimes the cards you see are fearful monsters, fantastic treasures, or weapons you really really need, and you can take any of them... but there&#39;s a catch! You must finish what you start.</p>\n<p>If you take a card from a stack, you must eventually take all cards under it... and you won&#39;t know what dangers (or treasures!) lie beneath the surface until it&#39;s too late.</p>\n<p>Every level in Card of Darkness is a slow reveal of a compelling and ever-changing puzzle, filled to the brim with risk/reward decisions.</p>\n<p>But thats no problem for you — hero.</p>\n<p>------JUST GIVE ME THE NUMBERS</p>\n<ul>\n<li>Journey through 8 environments in your quest to recover the Card of Darkness  </li>\n<li>Defeat 5 ancient and terrifying bosses  </li>\n<li>Find and equip 52 cards from the Deck of Darkness  </li>\n<li>Discover over 100 unique monsters, weapons, treasures, potions, and spells</li>\n</ul>", "metacritic": null, "released": "2019-09-19", "tba": false, "updated": "2023-10-04T16:41:42", "background_image": "https://media.rawg.io/media/games/b07/b07f42a36586e3dadc7788fd6c2d7f93.jpg", "website": "http://www.cardofdarkness.com/", "rating": 3.86, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 2, "beaten": 3, "toplay": 1, "dropped": 5, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 7, "platforms": ["iOS"], "developers": ["Zach Gage"], "genres": ["Strategy", "Card"], "publishers": [], "esrb_rating": null}