{"id": 376960, "slug": "broomstick-league", "name": "Broomstick League", "name_original": "Broomstick League", "description": "<p>Broomstick League is a fast paced, high-flying online sports game where players divide into teams and streak across massive arenas atop their trusty broomsticks. Take possession of the ball and rush it through the stadium as you outmaneuver other players in an effort to score.<br />\nEquipped with a broomstick and wand, players must hone their flying skills and use magic to dodge enemies, defend their goal and make awe inspiring plays. Armed with the blast spell that knocks the ball out of your opponent&#39;s hands, and the blink spell which teleports players to create goal scoring opportunities, there are endless combinations of plays with no two matches being the same. Customize your witch or wizard and equip a variety of unlockable broomsticks, wands and other magical cosmetics.<br />\nIt’s time to polish your broomsticks, practice your aerobatics and enter the Broomstick League!<br />\nKEY FEATURES:<br />\nFast Paced Matches: Play 1v1, 2v2, 3v3 or 4v4 matches with friends or match-make with opponents from around the world. Form magical teams with your friends to see who will dominate the skies.<br />\nRealistic, Fantastical Gameplay: Pick up speed while dive bombing to fly past a defender. Cast a spell on your opponent to blast the ball away or use the blink spell and teleport to a more favorable position. Surprise your enemies and gain the advantage.<br />\nCharacter Customization: Personalize the look of your witch or wizard with the deep pool of creative options available; unlock new broomsticks, wands, and much more. Perform a variety of taunts and dance moves to rattle your opponents in the arena.<br />\nMystical Arenas: Experience high flying sports action within imaginative arenas brimming with magic! Battle it out with giant trolls lurking in the background or score impressive goals while floating on the back of a flying dragon.<br />\nPlayer Progression and Stats: Track your progress with leader boards, stats tracking and a player leveling system to prove you are the most skillful broomstick pilot in the land.</p>", "metacritic": null, "released": "2020-03-05", "tba": false, "updated": "2020-02-28T15:05:55", "background_image": "https://media.rawg.io/media/screenshots/fc7/fc7c758feb64aaf25ddc16fe893bf988.jpg", "website": "http://www.broomstickleague.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 31, "toplay": 6, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 547, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Virtual Basement"], "genres": ["Action", "Strategy", "Sports", "Indie"], "publishers": ["Blue Isle Publishing"], "esrb_rating": null}