{"id": 376974, "slug": "wer-weiss-denn-sowas-das-2-spiel", "name": "Wer weiß denn sowas? - Das 2. Spiel", "name_original": "Wer weiß denn sowas? - Das 2. Spiel", "description": "<strong>WER WEISS DENN SOWAS?</strong> – It's time for round two and things are getting even more exciting. Play in a team with Elton or compete alongside of Bernhard Hoëcker. Whether you're playing alone, with a friend, or your entire family – you'll have to give your all in <strong>WER WEISS DENN SOWAS? – Das 2. Spiel</strong>. Prove how good your knowledge actually is in 30 new shows, with exciting questions and original answer videos. None other than Kai Pflaume himself confidently guides you through the shows. Pure knowledge, fun, and a whole load of entertainment. What is the \"24 hours a decade\" rule of thumb about? Do you know the answer? No? <strong>WER WEISS DENN SOWAS?</strong><br/><br/><ul><li>With the characters and original voices of Kai Pflaume, Elton, and Bernhard Hoëcker.<br/></li><li>30 complete shows with more than 390 questions and matching answer videos.<br/></li><li>One to four-player mode: You choose whose side you're on – alongside Bernhard Hoëcker, in a team with Elton, or perhaps you'd prefer to play with your friends?<br/></li><li>Create your own character from a variety of different options</li></ul><br/><strong>Did you know that in over 450 programs of \"Wer weiß denn sowas?\" the maximum amount has been won nine times, while no money at all has been won 22 times?</strong>", "metacritic": null, "released": "2019-10-15", "tba": false, "updated": "2019-09-27T02:55:17", "background_image": "https://media.rawg.io/media/screenshots/0c4/0c4dfd3caa2a6e6829e549dc53319dd8.jpg", "website": "http://wwds.bitcomposer.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bitComposer Interactive"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["bitComposer Interactive"], "esrb_rating": null}