{"id": 376958, "slug": "shooting-chicken-brutal-suckers", "name": "SHOOTING CHICKEN BRUTAL SUCKERS", "name_original": "SHOOTING CHICKEN BRUTAL SUCKERS", "description": "Makoto Yonekura, a new waitress, is a bright girl in Noh weather.<br/>Contrary to its appearance, it is a survival game girl who uses powerful weapons!<br/>She will do her best to crush the rampaging chickens for the beloved chief!<br/><br/><br/><br/><br/><br/><br/>①HP gauge : Decreases when taking damage. I will retire when this gauge is gone.<br/>②Retry gauge : If you have this gauge, you can retry even if you retire. If you retire without this gauge, the game is over.<br/><br/><br/><br/><br/><br/><br/>You can easily switch weapons with the controller's Right stick.<br/>Use your weapons according to the situation and fight for your advantage!<br/><br/><br/><br/><br/><br/><br/>Defeat chickens to earn a score.<br/>YAKITORI COMBO is a technique that can achieve a large amount of scores.<br/>YAKITORI COMBO is completed by defeating the chicken according to the determined procedure.<br/><br/>① Attack a white chicken with a shotgun to make it a naked chicken.<br/>② Burn the naked chicken with a flamethrower to make it a grilled chicken.<br/>③ Attack and defeat grilled chicken with Magnum.<br/><br/>There will also be a time bonus for every fixed score, so if a white chicken appears, let's aim aggressively!<br/><br/><br/><br/><br/><br/><br/><br/>◆ Sawed-off shotgun<br/>The main weapon of this game.<br/>It can attack a wide range, but the power is greatly reduced in a long-range attack.<br/>Shooting wings at close range allows you to peel off wings.<br/>Ammo is unlimited! Shoot without worrying about the remaining bullets!<br/><br/><br/><br/><br/><br/>◆ Submachine gun<br/>An easy-to-use gun that has low attack power but is capable of continuous fire.<br/>Like a shotgun, the power drops at long distances.<br/>Since you can get a lot of ammunition, use it aggressively!<br/><br/><br/><br/><br/><br/>◆ Magnum<br/>A handgun boasting tremendous power.<br/>The strongest gun that has the power to penetrate a chicken and does not drop its power at a distance.<br/>There are not many ammunition items available, so be careful with the remaining ammunition.<br/>Use it in battle with strong enemies.<br/><br/><br/><br/><br/><br/>◆ Flamethrower<br/>A powerful weapon that uses fuel gas to burn out enemies.<br/>Like the submachine gun, it can fire continuously, but the range is short.<br/>When used against chickens, it can be made into grilled chickens, and when attacked, chickens become charcoal.<br/>The released flame will also ignite the ground and walls and will last for a short time.<br/><br/><br/><br/><br/><br/>◆ Hand grenade<br/>The strongest weapon that explodes in a certain amount of time after throwing and repels a chicken with a shock wave.<br/>However, be careful because its power can destroy the ground and walls.<br/>Since there are not many available, use it in the battle with a strong enemy like Magnum.<br/><br/><br/><br/><br/><br/>◆ 9mm bullet<br/>Ammo used with submachine guns.<br/>By taking this, you can replenish 50 submachine gun ammunition.<br/><br/><br/><br/><br/><br/>◆ .50 Action Express<br/>Ammunition used in Magnum.<br/>Taking this will replenish 20 Magnum ammunition.<br/><br/><br/><br/><br/><br/>◆ Fuel gas<br/>Fuel used in flamethrowers.<br/>Taking this will replenish 100 of the flamethrower fuel.<br/><br/><br/><br/><br/><br/>◆ Hand grenade Box<br/>A box filled with hand grenades.<br/>Take this to replenish 10 hand grenades.<br/><br/><br/><br/><br/><br/>◆ Ammo box<br/>A box filled with 9mm bullets, .50AE, fuel gas, and hand grenades.<br/>Can replenish ammunition to all weapons.<br/><br/><br/><br/><br/><br/>◆ Fried chicken small<br/>Spicy delicious fried chicken.<br/>Take this to restore 10% of HP.<br/><br/><br/><br/><br/><br/>◆ Fried Chicken Large<br/>Spicy delicious fried chicken set.<br/>Take this to restore 50% of HP.<br/><br/><br/><br/><br/><br/>◆ Heart<br/>Beautiful pink heart.<br/>If this is taken, the number of retries will be increased by 1 and HP will be fully recovered.<br/><br/><br/><br/><br/><br/>◆ Hourglass<br/>A mysterious hourglass that increases the time limit when you get it.<br/>There are two types of sand, blue and gold. Blue increases by 10 seconds and gold increases by 20 seconds.<br/><br/><br/><br/><br/><br/>https://store.steampowered.com/app/623670/Moe_Mekuri_SP__SP/<br/><br/>https://store.steampowered.com/app/644530/The_Maid_sans_Caving_Adventure/<br/><br/>https://store.steampowered.com/app/656190/THE_HOUCHI_PLAY_THE/<br/><br/>https://store.steampowered.com/app/946300/Shooting_Chicken_Insanity_Chickens/<br/><br/><br/><br/>This game is made with Pixel Game Maker MV.<br/>https://store.steampowered.com/app/837510/Pixel_Game_Maker_MV__MV/", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-27T02:46:01", "background_image": "https://media.rawg.io/media/screenshots/184/184c8b8c095a14f7647da622e1c1b562.jpg", "website": "http://koheigallery.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KoheiGallery"], "genres": ["Action"], "publishers": ["KoheiGallery"], "esrb_rating": null}