{"id": 376976, "slug": "children-of-the-eclipse", "name": "Children of the Eclipse", "name_original": "Children of the Eclipse", "description": "Children of the Eclipse is a traditional 2-player retro shooter at heart, wrapped in next-gen graphics, set in a unique far future utopian sci-fi world teeming with life. <br/><br/>Pilot and Flexbot are two examining judges on Planet O-2, where societies are built on scientific research, not on wealth or the strength of an army. Their job is to make sure Fringe Zone explorers and researchers keep out of trouble. Usually, it's a pretty easy-going job of hanging around with interesting people, having parties and fending off a few Nasty Boys with non-lethal stun guns, but things quickly take a more serious turn when another Flexbot unit goes missing…<br/><br/><h3>Hardcore 2 player retro shooter at heart </h3><br/>Taking inspiration from classics old and new, while adding some spice of its own, Children of the Eclipse's core gameplay is the definition of easy to play, hard to master. Although the game has an immersive action-adventure storyline, the gameplay is never interrupted with cut-scenes or walls of text. <br/><br/><h3>1- and 2-player game modes</h3>Flexbot's AI core can take over the controls when your friends are not around.<h3>Rich world populated by unforgettable characters </h3>Planet O-2 is full of life, both familiar and strange. Get ready to accept side quests from singing rocks, party with mercenary DJs and fight with stem cell researchers in mind control suits.<h3>Destructible environment</h3>We know you like destroying stuff. The levels in Children of the Eclipse feature loads of destructible elements, with objects fracturing in real-time, adding to the mayhem.<br/><br/><br/><h3>Awesome soundtrack </h3>A lengthy electro/jazz/ambient/prog rock soundtrack by amazing artists like IO//IO, Neon Ghost, Kuicka, Sirius Error! and others.<h3>Asymmetrical gameplay</h3>The two main characters have unique weapon systems and unlockable special features that keep the gameplay interesting and constantly evolving. <br/><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-27T02:56:27", "background_image": "https://media.rawg.io/media/screenshots/3b2/3b2410f1bc1d16f0d1779baad1af2291.jpg", "website": "http://www.nutfarmgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nutfarm Games"], "genres": ["Action", "Adventure"], "publishers": ["Nutfarm Games"], "esrb_rating": null}