{"id": 376938, "slug": "unsung-heroes-the-golden-mask", "name": "Unsung Heroes: The Golden Mask", "name_original": "Unsung Heroes: The Golden Mask", "description": "When the past meets the present, it's up to three intrepid young archaeologists to unearth the truth!<br/><br/>Unsung Heroes is a brand new time management game from GameHouse. It follows the path of three passionate archaeologists, determined to uncover history! <br/><br/>In Unsung Heroes - The Golden Mask, the three girls are excavating in China. They stumble upon the story of Xi Niu, a Chinese girl who lived over a thousand years ago. You will switch back and forth between modern day and ancient China as you restore artifacts and slowly start to fill in the story behind them.<br/><br/>Play first as adventurous Ivy, brainy Stephanie and powerhouse Diana as they search for lost treasure. Then go into the past and play as brave Xi Niu, a girl determined to find justice for her family!<br/><br/>As a young girl, Xi Niu watched as her parents were brutally murdered by a man wearing a golden mask. She vows revenge, somehow, some way... 10 years later, she is unexpectedly offered a position as a courtesan in the palace. She seizes the opportunity, as it offers a way to locate the man in the golden mask.<br/><br/>But life is not simple in the palace. It is a snake pit of intrigue and politics and one misstep can mean death. Xi Niu will need to learn how to play the game to survive. Can this girl from the country navigate the dangerous waters of the palace to exact her revenge?<br/><br/>Help the three girl s find the pieces of this puzzle and piece together the story of the brave Xi Niu!<br/><br/>👹 Play in both the present and the past!<br/>👹 Find fragments of long-lost artifacts<br/>👹 Unlock the story as you complete each artifact with a special mini game<br/>👹 Unearth an ancient culture<br/>👹 Learn about artifacts based on real findings!<br/>👹 Master 14 exciting mini games - 7 in the present and 7 in the past<br/>👹 Explore 4 different dig sites, each with 4 unique artifacts to uncover!<br/>👹 Discover 6 exotic locations in the past and help Xi Niu find her way<br/>👹 Find and restore 16 main artifacts and an additional 40 optional artifacts<br/>👹 Enjoy a delightful new time management story game by GameHouse!<br/><br/>Try the first few levels for free! Then choose to unlock the full game with an in-app purchase, or subscribe for a free trial of our subscription plan!<br/><br/><strong>*NEW!*</strong> Enjoy all GameHouse Original Stories with a subscription! As long as you’re a member, you can play all of your favorite story games. Relive past stories and fall in love with new ones. It’s all possible with a GameHouse Original Stories subscription. Subscribe today!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-27T02:36:02", "background_image": "https://media.rawg.io/media/screenshots/300/3004a8b481bbf9f47963c05ca8b2c49c.jpg", "website": "https://www.gamehouseoriginalstories.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Threaks", "GameHouse"], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["Gamehouse"], "esrb_rating": null}