{"id": 377045, "slug": "okey-rummy-game", "name": "Okey - Rummy Game", "name_original": "Okey - Rummy Game", "description": "Klasik Okey oyunudur. Okey yapay zekası, zengin görsel efektleri, basit, kullanışlı arayüzü ile amaca uygun okey oyunu karşınızda. İnternetsiz, bilgisayara karşı okey oynayın. Herkese iyi eğlenceler.<br/><br/>Okey Özellikleri:<br/>- Game Center,<br/>- Başarılar,<br/>- Sıralamalar,<br/>- İstatistikler,<br/>- Görevler,<br/>- Seviyeler.<br/><br/>Ayarlar:<br/>- Sayıdan düş belirleme,<br/>- Oyun Hız Ayarı,<br/>- Renkli Okey açık / kapalı,<br/>- Gösterge puanı açık / kapalı,<br/>- Akıllı Taş Dizme açık / kapalı<br/><br/>Oyun Seti:<br/>Okey oyunu standart olarak dört adet oyuncuyla oynanır. Okeyde oyuncunun taşları dizmesi için ıstaka ismi verilen tabla bulunur. Kırmızı, siyah, mavi ve yeşil renklerinde 1'den 13'e kadar numaralı ikişer setten oluşan toplam 106 tane taş bulunur. Taşların içinde iki adet sahte okey taşı da vardır.<br/><br/>Başlangıç:<br/>Taşlar karıştırılıp her bir oyuncuya 14’er taş verilir. İlk oynayacak oyuncuya 1 adet taş fazladan verilir ve 15 taşla başlatılır. Oyuna 15 taş dağıtılan kişi başlar. Oyuncular kendilerine dağıtılan taşları önlerindeki ıstakaya dizerler. Geriye kalan taşlar, rakam kısmı masaya gelecek şekilde üst üste dizili olarak ortaya konur. Ortada dizili taşların üzerinde yer alan taşın bir üst değeri okey taşıdır. Bu taş her eksik taşın yerine kullanılabilmektedir.<br/><br/>Normal Diziliş:<br/>Oyuncunun elindeki on dört taş, en az üç taştan oluşmak koşuluyla, doğru perlere (gruplara) ayrılmalıdır. Normal dizilişte iki farklı per mevcuttur.<br/><br/>- Grupta yer alan tüm taşlar aynı değerde ancak farklı renklerde olmalıdır. Bu grupta üç ya da dört taş yer alır.<br/>- Gruptaki (perdeki) tüm taşlar aynı renkte ve birbirini sırayla takip eden sayılardan meydana gelmelidir. Bu   grupta en az üç taştan oluşmalıdır.<br/>- Bazı durumlarda ise 13 numaralı taştan sonra 1 numaralı taş gelebilir, fakat bu taştan sonra 2, 3, 4 gibi üst sayı taşlar konamaz.<br/><br/>Çifte Diziliş:<br/>- Oyuncu elinde bulunan taşlardan, her biri aynı değerde ve renkte yedi adet çift taş dizmelidir.<br/><br/>Gösterge Kuralı:<br/>Yeni bir el başladığında, elinde gösterge taşının aynısı olan oyuncu oynama sırası geldiğinde bu taşı gösterir ve kasadaki miktarın yarısını kazanır. Gösterge yapmak için eldeki taşı ortadaki gösterge taşının üzerine çekerek bırakmak gerekir. Gösterge diğer oyunculara bir puan cezası olarak yansıtılır.<br/><br/>Bitiş Türleri:<br/><br/>- Bitişte kullanılan taş sıradan bir taş ise normal bitiş sayılır. Puan değeri 2'dir.<br/>-‘Okey dışarı’'da denir. Bitişte destenin üzerine bırakılan taş Okey taşı ise oyuncu okey atmış sayılır. Elin puan değerini 2'ye katlar.<br/>- Taşların dizilimi çiftlere göre yapılmışsa; yani ıstakadaki her taşın bir çifti varsa, oyuncu çiftten bitmiş sayılır. Puan değeri 4'tür.Çifte gitmeyi belirtmek zorunda degildir.<br/>- Bütün taşlar aynı renkte ve 1’den 13’e kadar sıralı ise sıralı renk yapılmıştır. Bu durumda puanlar ne olursa olsun hepsi sıfıra düşülür ve oyun biter.<br/>- Bu bitiş türünde ise bütün taşlar aynı renkte ve sıralı bir biçimdedir ama bazı taşlar ikişer tane olduğundan sırasız renk yapılmıştır ve sekiz puan değerindedir.<br/><br/><br/>NOT: <br/>- OYUNDA PUANLAMALAR VE İSTATİSTİKLER ANLIK OLARAK GÜNCELLENMEZ!", "metacritic": null, "released": "2016-02-03", "tba": false, "updated": "2019-09-27T03:37:45", "background_image": "https://media.rawg.io/media/screenshots/743/7433c17c03fcd11231205062bb6ede9f_AhFL0uL.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hasan Yilmaz"], "genres": ["Board Games", "Card"], "publishers": ["Hasan Yilmaz"], "esrb_rating": "Everyone 10+"}