{"id": 377014, "slug": "1971-project-helios", "name": "1971 Project Helios", "name_original": "1971 Project Helios", "description": "<p>1971 Project Helios is a turn-based strategy game which combines modern warfare military tactics and close combat. Firearms and vehicles are scarce, conflicts and hostilities have no end, and the terrible freezing cold annihilates friends and foes in its path.<br />\nEight characters have to join forces for a common cause: find an important scientist kidnapped by a massive stratocracy. Along their way they will have to avoid raider attacks, investigate military headquarters, and infiltrate into the territory of a dangerous anti-technological religious sect.<br />\nTactical Combat Fight against three different factions, each one with its unique units, strategy and advantages. Soldiers, snipers, slippery bandits, knights immune to cold… Study your enemies, plan out every move and adapt to all confrontations!<br />\nExploration Travel through various locations, from military enclaves to medieval dungeons. There you can search for fulgor, new equipment for your characters, and pieces of information of the world you are in and the factions you face.<br />\nSkill Trees As you find equipment compatible with each character, you can unlock and upgrade new skills, and combine them to make the perfect builds for your strategy.<br />\nResource Management Use all the fulgor you can find to defreeze your HP, decrease the cooldowns, and reanimate your fallen units.<br />\nThe campaign sets in a frozen world, in which eight people – each one with its own problems and interests – join in a sort of temporary alliance, to find one particular person: Dr Margaret Blythe. On the trail of her whereabouts, they will travel and fight shoulder to shoulder, and they inevitably get to know the others. Depending on some strategic and personal decisions, you will guide this characters right to one of three possible endings.</p>", "metacritic": 60, "released": "2020-05-16", "tba": false, "updated": "2020-12-16T15:20:44", "background_image": "https://media.rawg.io/media/games/0f6/0f6eeac66603adcca1080db449615876.jpg", "website": "http://recotech.es/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 5, "beaten": 1, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 105, "ratings_count": 1, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 2, "platforms": ["Xbox One", "PlayStation 4", "PC", "Nintendo Switch"], "developers": ["RecoTechnology"], "genres": ["Strategy", "Indie"], "publishers": ["RecoTechnology"], "esrb_rating": "Teen"}