{"id": 377068, "slug": "battle-strike-force", "name": "Battle Strike Force", "name_original": "Battle Strike Force", "description": "HERO COLLECTION RPG MEETS MASSIVE MULTIPLAYER<br/><br/>The world has collapsed under the mighty fist of the Iron Order. Take command as a Resistance leader in one of the largest 3D MMO worlds on mobile!<br/><br/>FORGE ALLIANCES with other players by joining a guild to reclaim territory and shatter the Iron Order's tyrannical rule. RECRUIT BATTLE-HARDENED HEROES to complete dangerous missions. FORTIFY YOUR BASE and train new soldiers for the Resistance.<br/><br/>Only the strongest guilds can hope to defeat the Iron Order!<br/>FEATURES<br/><br/>THE RESISTANCE<br/>Recruit and train 40+ unique Heroes from three powerful factions. The desert roaming Dune Raiders, high-tech Ardent Legion, or jungle disciplined New Militia<br/><br/>ENGAGE IN TACTICAL SUPERIORITY<br/>Dominate on a real-time massively multiplayer map and control resources<br/><br/>Strengthen your factional alliances and gain access to their weaponry from APCs, Flame Wagons, Sniper Drones and more<br/><br/>FORGE ALLIANCES BY JOINING A GUILD<br/>Work with your Guild to capture, mine and defend War Depots from other rival guilds<br/><br/>Chat and coordinate with your guildmates to earn powerful bonuses to crush your enemies<br/><br/>DEFEND YOUR BASE<br/>Upgrade your base and reinforce your stronghold against constant threats of attack<br/><br/>RAID WAR DEPOTS<br/>War Depots are all over the world, join your guild in mining these valuable resources before your rivals<br/><br/>EVENTS<br/>Participate in events to earn resources, Hero Tags and more!<br/><br/>EXPLORE THE WORLD<br/>Socialize to other players via chat, compete on leaderboards and earn renown", "metacritic": null, "released": "2019-09-21", "tba": false, "updated": "2019-09-27T03:46:30", "background_image": "https://media.rawg.io/media/screenshots/228/2285c8562f9b6f93d2cd669141cd5fb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beyond Games"], "genres": ["RPG", "Strategy"], "publishers": ["Beyond Games"], "esrb_rating": "Mature"}