{"id": 377048, "slug": "anime-paint-color-by-number", "name": "Anime Paint - Color By Number", "name_original": "Anime Paint - Color By Number", "description": "\\\\ A Brand New Anime Color By Number Game! //<br/><br/>Do you want to release stress?   <br/>Are you looking for a new way to relax or already a coloring enthusiast?<br/>Anime Paint is your best choice!<br/><br/>Anime Paint upgrades the traditional coloring book app to bring a more modern work for both kids and adults. It provides the most relaxing and simplest way to release your stresses, increase your creativity in painting! <br/><br/>Various editors’ selected images and pictures are collected for you coloring and more coloring pages update every day!<br/><br/>Anime Paint. Anytime. Anywhere.<br/>__________________________<br/><br/>FEATURES<br/><br/>- Enjoy the uplifting and unique coloring experience that drive your stress away!<br/>- Rich anime themes and categories of pictures/paintings!<br/>- Switch among the unlimited and helpful tools!<br/>- Advance your coloring skill and imagination from easy to difficult pictures!<br/>- Get new images and pictures every day!<br/>- Build your own collections with the colorful treasures!<br/>- Dive into the customized coloring feeds that special for you! <br/>- Replay the time-lapse video and review how the world changes under your magical fingers!<br/>- Try new ideas and inspirations! Recolor the completed artworks whenever you want!<br/>- Totally offline support, no wifi needed! Color it anytime, anywhere!<br/>- Completely FREE coloring book!<br/>__________________________<br/><br/>We always feel stressed out in daily life, here we offer you a free coloring book to relax yourself. In the game, you will enjoy the coolest experience of coloring, painting and creating arts! And make the world become colorful and alive under your fingers!<br/><br/>Get this chance to show your color of the world through your own artworks! Share your attitude of life and let people see how different and beautiful the world is in your eyes! <br/><br/>Anime Paint Premium <br/>- You can subscribe for all premium features and ads free. You will be able to color all available images for the duration of the subscription.<br/>- All prices are subject to change without notification.<br/>- Payment will be charged to iTunes Account at confirmation of purchase.<br/>- Subscription automatically renews for the same price and duration period as the original weekly/monthly/yearly package, unless auto-renew is turned off at least 24-hours before the end of the current period .<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package) <br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- No cancellation of the current subscription is allowed during active subscription period <br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. It must be done 24 hours before the end of the subscription period to avoid being charged. Please visit https://support.apple.com/HT202039 for more information <br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. <br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases Color Fever Premium.<br/><br/>Links to our Terms of Service and Privacy Policy can be found below.<br/>- Privacy Policy: <br/>https://colorfever.dragonplus.com/privacy-policy<br/>- Terms of Service: <br/>https://colorfever.dragonplus.com/terms-of-service<br/><br/>* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD.", "metacritic": null, "released": "2019-09-23", "tba": false, "updated": "2019-09-27T03:38:49", "background_image": "https://media.rawg.io/media/screenshots/8d6/8d6118dbd7846cd677cac18fc510c00d_z2QJzMg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DragonPlus"], "genres": ["Board Games", "Puzzle"], "publishers": ["DragonPlus Game"], "esrb_rating": "Everyone 10+"}