{"id": 377067, "slug": "smite-blitz", "name": "Smite Blitz", "name_original": "Smite Blitz", "description": "Journey through the Battleground of the Gods in SMITE Blitz, an epic tactical RPG where you control the Gods! Wield Mjolnir as Thor, or rain down lightning as Zeus in your mythological adventure.<br/><br/>ASSEMBLE YOUR TEAM<br/>Choose from over 60 Gods from throughout world mythology. Plan your formation to utilise each deity’s unique abilities, gain valuable boosts by combining Gods through the sidekick system, and find the ultimate winning strategy.<br/><br/>LEAD THE GODS TO WAR<br/>The realms of the Gods are under attack! You begin your quest in ancient Egypt, where dark forces have wreaked havoc throughout the Gods’ dominion. Their mortal worshipers are being assaulted. Who will save them? Fight tense battles and defeat waves of powerful enemies, chase down fugitives, or protect your tower. Collect valuable resources to unlock your Gods’ full potential. Can you save their worlds from ultimate destruction?<br/><br/>SUMMON POWERFUL GODS<br/>Create an unbeatable team with Gods from across the pantheons. Wield the awesome power of the thunder God, Thor, and combine him with the impossibly strong Hercules. Fight shield to shield with Athena, or break the rules and let the villainous Loki do your deeds.<br/><br/>TEAM UP TO CONQUER EPIC BOSSES<br/>Take on epic world bosses with players from around the world, working together to earn great loot and strengthening your roster of Gods.<br/><br/>BECOME THE STRONGEST<br/>Level up your Gods to unlock devastating new skills for more combat power. Alight the power of the Star Runes to give your party an advantage in battle. Craft valuable resources to build abilities that radiate a healing glow upon your allies.<br/><br/>COMPETE WITH OTHER PLAYERS<br/>Challenge players from around the world in four intense PvP modes. Go head-to-head in deadly Duels, or watch chaos reign supreme when the toughest Gods in the universe collide in the Arena. Develop unique strategies to lead your team to glory.<br/><br/>BUILD YOUR ALLIANCE<br/>Rise to become one of the top alliances. Tackle exclusive content and challenges for great rewards.<br/><br/>GET FREE LOOT IN SMITE<br/>Unlock exclusive bonuses in the #1 action-brawler, SMITE, by linking your SMITE Blitz account.<br/><br/><br/>Privacy Policy:<br/>https://web2.hirez.com/hirez-studios//wp-content/uploads/2015/11/Hi-Rez-Studios-Privacy-Policy-7-12-2018.pdf<br/><br/>Terms of Service (TOS):<br/>https://web2.hirez.com/hirez-studios//wp-content/uploads/2015/11/Hi-Rez-Studios-Terms-of-Service-and-Use-Agreement-7-12-2018.pdf<br/><br/> <br/>SMITE Blitz End User License Agreement (EULA):<br/><br/>https://web2.hirez.com/hirez-studios/legal/Smite-Blitz-EULA-2019-09-12.pdf", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-09-27T03:46:07", "background_image": "https://media.rawg.io/media/screenshots/c52/c52e760b9d2b774da61fb0b680447880_YLqey3u.jpg", "website": "https://www.playsmiteblitz.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hi-Rez Studios"], "genres": ["RPG", "Strategy"], "publishers": ["Hi-Rez Studios"], "esrb_rating": "Everyone 10+"}