{"id": 377039, "slug": "little-fairy-care-simulator", "name": "Little Fairy Care Simulator", "name_original": "Little Fairy Care Simulator", "description": "Do you enjoy gifts and surprises under your pillow? Come with us and enter into a new fantasy world magic adventure with our tooth fairy princess! A tooth fairy with thousands of gifts to give to the kids that behave well! The better you behave, the more gifts you can have under your pillow!<br/><br/>Our tooth fairy princess considers that cleaning and brushing daily your teeth is an important habit for healthy children. And we all want to see tooth fairy princess happy... Join us in this teeth brushing game where we will show you how important is to have clean teeth! Learn everything about tooth fairy princess clean, healthy teeth in this educational tooth fairy princess game: <br/><br/>- Free funny tooth fairy game for children<br/>- Make your own toothpaste and brush your teeth<br/>- Treat milk and wobbly teeth<br/>- Lots of funny mini tooth fairy princess games: Show your talent with puzzles, drawings and surprising creative mini games<br/>- Learn the importance of mouth care<br/>- Leave your baby tooth under your pillow and find out what kind of gifts and games the tooth fairy princess brings you!<br/><br/>Let's dream about what surprises await you after leaving your milk tooth under your pillow!<br/><br/>This family game is appropriate for children of all ages. Let your children learn about mouth care, brush teeth, toothpaste and mouth wash in a funny way and discover tons of activities in which your kid can exercise the mind and creativity!<br/>Help your child to grow up with this important healthy tooth fairy princess habit and above all, have fun playing!<br/>Enjoy this girls game for free! Play now!", "metacritic": null, "released": "2019-05-22", "tba": false, "updated": "2019-09-27T03:35:35", "background_image": "https://media.rawg.io/media/screenshots/76f/76fb3558e1e01553451d727ac4e74d11_1PFUaPU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dominic Vargas"], "genres": ["Puzzle"], "publishers": ["Dominic Vargas"], "esrb_rating": "Everyone 10+"}