{"id": 377188, "slug": "mergical", "name": "Mergical", "name_original": "Mergical", "description": "Welcome to the fantastic Mergical Island! This is a mysterious land full of magical fantasies. Here, you can explore the lost world, also to build and design the island based on your preference! A perfect merge and building game!<br/><br/>Due to a spell casted by a wizard, all life forms on this island are in a resting state, the thick clouds blocked out what was once a prosper and beautiful city. With the power of music, you accidentally arrived at this land, using your merge and puzzle solving skill you can awaken this land and restore it to its former self.<br/><br/>With your talent and effort, you can collect ancient tomes, extraordinary plants or flowers, artistic buildings(houses, fun park, mobile park, and etc) and elegant musical instruments. Meanwhile, there are some magical creatures such as cute cats, waiting to be awakened, once awake, they will become your best friends in rebuilding the island!<br/><br/>Are you ready to build your dream home? Now is the best time to start!<br/><br/>Special Features<br/><br/>Character Design\u2028   <br/>* Variety of character features. Merge to unlock up to 14 different types of characters, each type brings you a unique set of elements, which will make your island more prosper and colorful.<br/><br/>Merge items to awaken the island<br/>* More than 600 types of items for you to interact and merge.<br/>* Place 3 identical pieces next to each other, and witness the amazing things come next.<br/>* Collect the magical and mysterious musical notes to help you restore this land.<br/>* Use the collected materials to redesign or upgrade your buildings.<br/><br/>Variety of gameplay and quests<br/>* Use unique and elegant buildings to decorate your awesome island.<br/>* Fun and exciting level for a limitless exploration and gameplay.<br/><br/>Download now, and design your new world!<br/><br/>Follow our Facebook fan page https://www.facebook.com/MagicalMerge/ to stay updated on all the latest update or to chat with other mergies!", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-27T04:38:47", "background_image": "https://media.rawg.io/media/screenshots/4da/4da6ef7d339bdf31803c8537b3c78baf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android"], "developers": ["Betta Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}