{"id": 377109, "slug": "time-warriors-steampunk-survival-craft", "name": "Time Warriors - Steampunk Survival Craft", "name_original": "Time Warriors - Steampunk Survival Craft", "description": "Clash of warriors on steam powered machines time on Time Warriors Episode 2<br/><br/>\tWe happily announce Episode 2 of Time Warriors. In this second episode, you will be in never existed time Steampunk. You will be in a well designed environments, characters, weapons and costumes. This is gonna be your best multiplayer action war game ever tested.<br/><br/>\tDiscover authentic block maps and environments, make your war strategy and attack the enemies. You can stand against your enemies as single or as a team. Multiplayer game modes let you play with real players in gorgeous game levels.<br/><br/>\tIt is easy to play. There is no need to skip many pages and dialogs. You will start the game easily with just couple of clicks. Just select a map, choose your warrior avatar and weapons and then start the game.<br/><br/>\tOffline game mode lets you investigate advantageous points on the map. So you can make better war strategies for attack and defense.<br/><br/>\tIn online game mode, you will apply your plans over real players. Better plan wins in real life.<br/><br/>\tOnline game modes:<br/><br/>\t- Team Deathmatch:<br/>\tKill more enemy as a team to win. Higher kill numbered team wins. This game plays with 2 teams. Red and Blue.<br/><br/>\t- Capture The Flag<br/>\tThis game also play with 2 teams. Red and Blue. The team captures the flag of opponent team for 3 times wins.<br/><br/>\t- Gun Beast<br/>\tIn this game mode there are no teams. Eveybody plays as single. Player starts the game with most powerful weapon. Weapon changes to the weaker one as soon as killing other players. At the end you will have only bare hands to fight. You will win when you kill anyone with punch.<br/><br/>\tFEATURES:<br/>\t- 8 special weapons<br/>\t- High performance<br/>\t- 6 gorgeous game maps<br/>\t- 4 siege weapons<br/>\t- Online and Offline game modes<br/>\t- 3 game modes<br/>\t- Game is free", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-09-27T04:03:36", "background_image": "https://media.rawg.io/media/screenshots/242/242c5f0de21c36010e8bf3a37b0a9339_wMLeUbW.jpg", "website": "https://www.facebook.com/dodisoft", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dodisoft"], "genres": ["Action", "Casual"], "publishers": ["BURAK BUYUKSELCUK"], "esrb_rating": "Teen"}