{"id": 377107, "slug": "call-of-battlefield-fps-online", "name": "Call Of Battlefield - Fps Online", "name_original": "Call Of Battlefield - Fps Online", "description": "OMG! Zombies invade the world and humankind is about to disappear. They are turning every human into their kind. This is global slaughter. Your friends Jason, Britney and Angelina are infected. You are about to lose all your friends and family. It's time to counter assault.<br/><br/>Zzz zzz ... Hey soldier wake up! Battlefield is calling you for a harsh duty.<br/><br/>Government established a new special military force from survivors to destroy these immortal creatures. The operation name is Call of Battlefield (COB). You were also chosen one of them to save the world and get it back from these mutants. This is not modern but old style warfare. The mere option is to kill to survive.<br/><br/>Will you accept this duty and help this team to protect the world or leave them alone? Come on why are you still thinking! The answer is clear. YES SIR!<br/><br/>Hey Commando! Choose your rifle in many 14 alternatives like M4, MP5, Shotgun, DP, AK-47, Benelli, Sniper and be ready for the fight. You born to die and this is coded into you DNA and COD. Take your weapon, pull trigger and fire.<br/><br/>You will find your self in a real battlefield in an impossible ops and taste non-stop action while killing walking deads.<br/><br/>You must keep yourself and your team in safe by beating back scary zombies and repairing broken doors and barriers during game. Zombies will come in waves and you have to stop them before they bite and turn you into a zombie.<br/><br/>You have many choice to protect yourself from these black beasts. Buy more powerful weapons or upgrade existing ones in your arsenal. Use piercing bullet to explode their skulls and heads at once.<br/><br/>Download this AAA class shooting game for free.<br/><br/>FEATURES:<br/><br/>• Single and Multiplayer (COOP) game modes<br/>• Team and Counter online modes<br/>• 6 different battlefield areas<br/>• 12 different creatures and zombies<br/>• 14 upgradable weapons<br/>• Realistic and cinematic effects and animations<br/>• Support for Joysticks<br/>• Walkie-Talkie (Voxer) Communication<br/>• Impressing PS3 and XBOX quality SFX and georgeous VFX<br/>• Optimized Network and Performance usage<br/><br/>Follow upcoming versions for new features and game modes (Capture The Flag, Hostage Rescue, Zombie Infection) and bonus material.<br/><br/>NOTE:<br/>Online game mod requires internet connection.<br/><br/>Please visit our Facebook fan page for updates and other games.<br/>https://www.facebook.com/dodisoft<br/><br/>Oops! Don't miss out our Google + and Youtube channels.<br/>https://plus.google.com/112786784926083658841/videos<br/>https://www.youtube.com/channel/UCWIvrs5FuHDJzBfB_tpoykA", "metacritic": null, "released": "2015-04-19", "tba": false, "updated": "2019-09-27T04:02:49", "background_image": "https://media.rawg.io/media/screenshots/780/780e3795e190b0fd8f2d43edcd1f7e51.jpg", "website": "http://dodisoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dodisoft"], "genres": ["Action", "Strategy"], "publishers": ["BURAK BUYUKSELCUK"], "esrb_rating": "Mature"}