{"id": 377237, "slug": "fire-place-itch-fellowship-of-the-game-danielfroes", "name": "Fire Place (itch) (Fellowship of the Game, danielfroes)", "name_original": "Fire Place (itch) (Fellowship of the Game, danielfroes)", "description": "Uma lareira confortável em meio a nevasca. \r\n<p><strong>Fire Place</strong> é um jogo interativo em que você controla um personagem que se encontra em meio a um cenário desolado. Enquanto enfrenta uma forte nevasca,  o personagem não só terá que achar maneiras de sobreviver como, também, encarar seus maiores traumas.  Mas não se preocupe, no final do caminho sempre haverá uma lareira para esquentá-lo.</p>\n<p>Feito para computadores, <strong>Fire Place</strong> tem como principal foco a imersão cinematográfica, utilizando-se de gráficos <em>low poly</em> bem  polidos e uma história rica em subjetividade que é passada através dos mais variáveis modelos de notas. Tudo para trazer o jogador cada vez mais para a realidade do jogo e vivenciar a experiencia.</p>\n<p>Não se preocupe em demorar, faça de sua experiencia algo único.</p>\n<p><em><strong><strong>Fire Place</strong> </strong>foi desenvolvido em 2019 utilizando Unity. Está disponível para Windows e Linux apenas em Português. Além disso, o código-fonte está disponível no Github.</em><br/></p>\n\r\nA comfortable fireplace in the middle of a blizzard.\r\n<p><strong>Fire Place</strong> is an interactive game where you control a character who finds himself in a desolate setting. Facing a heavy snowfall, the character will not only have to find ways to survive, but also face his greatest traumas. But do not worry, at the end of the road there will always be a fireplace to warm you up.</p>\n<p>Made for computers, <strong>Fire Place's </strong>main focus is cinematic immersion, using well-polished low poly graphics and a rich story of subjectivity that is conveyed through various note models. Everything to immerse the player into the reality of the game.</p>\n<p>Do not worry about taking your time, make your experience something unique.</p>\n<p><em>Fire Place was developed in 2019 using Unity. It is available for Windows and Linux only in Portuguese. In addition, the source code is available on Github.</em></p>\n\r\nComo jogar (How to play)\r\n<ul><li><strong>Movimentação (Movement): </strong>WASD</li><li><strong>Abrir notas (Open notes): </strong>E</li></ul>\r\nCréditos (Credits)\r\n<ul><li><strong>Desenvolvedores (Developers): </strong>Fernando Gorgulho, Luis Rozante, Amanda DeMoura</li><li><strong>Modelador dos Cenários (Scenary Modeler) : </strong>Luis Rozante</li><li><strong>Modelador dos Personagens (Character Modeler): </strong>Daniel Fróes</li><li><strong>Artista Técnico (Technical Artist): </strong>Amanda Demoura</li><li><strong>História e notas (Story and notes): </strong>William Bráz</li><li><strong>Game Design: </strong>William Bráz</li><li><strong>Líder do Projeto (Game Director): </strong>Daniel Fróes</li><li><strong>Product Owner: </strong>Rafael Clereci</li></ul>", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-09-27T04:51:49", "background_image": "https://media.rawg.io/media/screenshots/bcb/bcb86887681aacb4e5b9149fab44967c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Fellowship of the Game", "danielfroes"], "genres": [], "publishers": [], "esrb_rating": null}