{"id": 377290, "slug": "the-maiden", "name": "The Maiden", "name_original": "The Maiden", "description": "<p><strong>THE MAIDEN </strong>is a gloomy adventure game that tells the story of Linda, a fair-haired girl who has been accused of witchcraft and cast down into Pagan Hell.<br/></p>\n<p>You get to explore the undiscovered ancient Estonian and Finnish folklore through the journey of injustice that blurs the dimensions between myth and reality.<br/></p>\n\n<p>Your mission is to venture through the darkness of Pagan Hell - Trust me, it is not a good place to be. <br/><br/>You'll encounter peculiar mythological creatures and learn the mysterious folklore from the built-in lore encyclopedia as you seek your way back to the surface and find out what really happened!</p>\n\n\n\n<p>GAME FEATURES<br/></p>\n<ul><li>Story driven gloomy adventure game.</li><li>Uniquely tailored encounters with mythological creatures.</li><li>Integrated lore compendium about the undiscovered Estonian and Finnish mythology and creatures encountered in the game.</li><li>Dark and eerie hand drawn 2D Art-Style and 2D animation.</li><li>Original ethnic and haunting soundtrack</li></ul>\n\n<p><strong>The game is being developed by Blind Fox Studio</strong><br/><br/>Our international Finnish-Estonian team was formed in June 2018 on a small peculiar island of Rankki, which is located in the gray gulf that separates the two of our countries. <br/><br/>The Maiden game is freshly squeezed from both the passion and spare time of all of the team members and unfortunately we cannot guarantee regular development updates. You can follow us on Instagram and Facebook, or contact us via e-mail if you have any development related questions or feedback.<br/><br/>We aim to deliver the gloomy, yet intriguing experience of the Maiden to you by 2020.<br/><br/>Stay tuned!<br/><br/>Yours truly,<br/>Blind Fox Studio<br/>Look at our website<br/>Follow us on Facebook<br/>Check out our Instagram<br/></p>", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-09-27T05:04:16", "background_image": "https://media.rawg.io/media/screenshots/c3f/c3f81af5b4da524b7889807a55d17746.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blind Fox Studio"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}