{"id": 377208, "slug": "rose-of-starcross-demo", "name": "Rose of Starcross Demo", "name_original": "Rose of Starcross Demo", "description": "<p>Rose of Starcross is a turn-based, story-driven RPG created by a solo developer inspired by the Mario RPG series, the MOTHER series, modern indies, and even games like Punch-Out!</p>\n\n<p><strong>Story</strong></p>\n<p>300 years ago, a cataclysmic event nearly destroyed Starcross. This event resulted in the death of almost all of the humans, the rise of the Undead, the creation of the Anims, and the birth of the Demons... but things might not be so awful now. Or they might be! Depends on who you ask! Explore and learn about the state of Starcross and its characters. Maybe you're adventuring to save the Heavenly Queen, the woman who had to seal herself in the door behind the rose after saving Starcross from the cataclysm. Maybe you're just an explorer who wants to see all of the unique settings of Starcross. Maybe you just want to meet some new friends! And maybe you don't know what you want to do.</p>\n\n<p><strong>Exploration</strong></p>\n<p>Explore using different abilities in a simulated 3D environment that allows for platforming and other options for traversal!</p>\n\n\n\n<p><strong>Combat</strong><br/></p>\n<p>Fight enemies with timed attacks and mini-games based on the magic you're using and protect yourself from enemy attacks with multi-direction blocking, jumping, and dodging!</p>\n\n\n\n\n<p><strong>Rose of Starcross</strong><br/></p>\n<p>Rose of Starcross is being developed by only myself, which takes a lot of time, so soon I'll be launching on Kickstarter to help the further development of the game! Follow my twitter to keep up with progress and updates regarding when the Kickstarter will be launching! This demo is of the first area of the game and only a small portion of what's planned for the final release.</p>\n<p>My twitter: https://twitter.com/peydinburnham</p>", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-09-27T04:44:21", "background_image": "https://media.rawg.io/media/screenshots/29c/29c9bbb8c1b741cc6e5cbb7fccbc9f98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Peyton Burnham"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}