{"id": 377361, "slug": "nightmare-fishing-tournament-3d-suitsnnukes", "name": "Nightmare Fishing Tournament 3D (SuitsnNukes)", "name_original": "Nightmare Fishing Tournament 3D (SuitsnNukes)", "description": "<p>CHEAT CODE LIST: ( Press \"TAB\" key during gameplay to enter)<br/>1167283mn — Replace Tutorial Fish With the Aquacreep!<br/>746kl95631 — All fish spawn in upper spawn zone<br/>8274jmkl92 — Rare Spectral Glass Phantom Spawns instead of Common Version<br/>666_999 — 1 Hit Kills<br/>8273_kmkm — add 10 to chum<br/>888_2325nk — add 10 bombs<br/><br/><br/></p>\n<p>NIGHTMARE FISHING TOURNAMENT 3D</p>\n<p>GOAL: Catch each specified fish before the round is over. Catch the heaviest fish to win the round, the fisherman with the most points at the end gets to return to the \"Land of the Living.\"<br/><br/><br/></p>\n<p>TIPS &amp; TRICKS</p>\n<p>-As rounds progress, you will need to catch fish at depths deeper than your starter line can go; use scales cut off fish to CRAFT longer and stronger lines!</p>\n<p>-You can upgrade Health, Lung Capacity, Reel Speed, Grip, and more to get better and make the game easier to win. Learn the crafting formulas and collect the scales by battling fish.</p>\n<p>-You can DOUBLE the money you earn by finding PEARLS hidden in CLAMS at the seafloor, but you need to buy a DIVING BELL to look for them.</p>\n<p>-You don't have to WIN every round to advance, but the points add up, and you will NOT RECEIVE ANY POINTS if you fail to catch a fish before time is up, OR if you fail to get at least 3rd place in a round.<br/><br/><br/></p>", "metacritic": null, "released": "2019-09-25", "tba": false, "updated": "2019-09-27T05:20:19", "background_image": "https://media.rawg.io/media/screenshots/60d/60d50485cc1ab15a4806cc5dc7c6ae39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SuitsnNukes"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}