{"id": 377439, "slug": "witchdom-2-halloween-games-witch-games", "name": "Witchdom 2 - Halloween Games & Witch Games", "name_original": "Witchdom 2 - Halloween Games & Witch Games", "description": "<p><strong>Witchdom 2</strong> is a super addictive wizard of magic match 3 games that were made especially for the All Hallows’ Eve. This wizard game is just perfect for witch puzzle lovers to let them make some amazing candy blasts and serve their customers without mistakes to complete each level and go to the following one.<br/><br/>This Allhallowe’en puzzle game offers tons of missions. Each level has a different mission to complete and the difficulty will increase at each level. The main mission here is match 3 candies of the same taste and deliver them to your customers. Your customers are different and they will be wearing some amazing Halloween Costumes. Say happy Halloween to them and deliver their order without mistakes to win each level and go forward in this addictive Halloween witch games. Keep in mind that the gameplay will start out simple, but things will get more and more complicated and challenging.</p>\n\n<p>Why will you have to download and install Witchdom 2 on your Android smartphone or tablet instead of other magic Match 3 games?<br/><br/>✔ Fantastic Allhallowe’en graphics and theme.<br/>✔ Over 500 of well-designed free levels!<br/>✔ 100% Free! No need to spend much money to enjoy the best Witch games ever!<br/>✔ Many different power-ups to help you in your mission. Don’t forget to use them at the right time.<br/>✔ Witchdom 2 is compatible with all Android devices and you can run it on your Android smartphone or even tablet.<br/>✔ Say Happy Halloween and enjoy playing our game even if you don’t have a Wi-Fi, 3G or 4G internet connection.<br/><br/>What are you waiting for? Download Witchdom 2 – Halloween Games and enjoy playing the most addictive All Hallows’ Eve and magic match 3 games ever! You will love it.</p>", "metacritic": null, "released": "2019-09-25", "tba": false, "updated": "2019-09-27T05:38:13", "background_image": "https://media.rawg.io/media/screenshots/7be/7be1f486869749dc5d05b0ad5d2751bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Launchship"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}