{"id": 377635, "slug": "kitty-maestro", "name": "Kitty Maestro", "name_original": "Kitty Maestro", "description": "Victoireissimo!\r\nKitty Maestro is a musically-accurate arcade game set in a city of cats.\r\n<p>You play as a cat-composer travelling around the city of Petropolis looking for inspiration. You collect and construct riffs of music to complete an Oh-Puss that will be performed at the magnificent Meowditorium.</p>\n<p>Petropolis has many locations typical of a capital city - a rich, vibrant culture to draw from. The Cat-Nav is used to find and travel to inspirational areas of the city to build your musical composition.</p>\n<p>Inspired by classic video games and Game &amp; Watch LCD games, Kitty Maestro features randomly generated, accurate music as part of a meowtastic monochromatic arcade game set in a city of cats.</p>\r\nDEMO\r\n<p>The demo is free and features a rich gameplay experience - including the Meowditorium. The demo is limited by game length and only contains four city locations (Art Gallery, Trendy Cafe, Cinema and Aquarium).</p>\r\nKitty Maestro (Demo) is available for PC and Mac.Demo for the Nintendo Switch is only available when the full game is released (it's a Nintendo thing).\r\nWeb page\r\n<p>www.kittymaestrogame.com</p>\r\nMusically accurate\r\n<ul><li>perfect intonation in 11 major scales</li><li>scales up to 5 sharps/5 flats</li><li>melodic mono-rhythms</li><li>treble clef range - easy to read on the stave</li><li>meow along to the music (you know you want to)</li></ul>\r\nEasy arcade action\r\n<ul><li>*meow* and throw notes to make music</li><li>procedurally generated riffs</li><li>game length from two to twenty riffs long</li><li>five difficulty levels from Beginner to Maestro</li></ul>\r\nMeowtastic setting\r\n<ul><li>Petropolis, the city of cats</li><li>A variety of locations you would expect in a large city (some more respectable than others)</li></ul>", "metacritic": null, "released": "2019-09-23", "tba": false, "updated": "2020-12-16T14:27:35", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e55addca84e5474756b367dee391dbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Nintendo Switch"], "developers": ["Tackorama"], "genres": ["Action"], "publishers": ["Tackorama"], "esrb_rating": "Everyone"}