{"id": 377842, "slug": "rebel-inc-escalation", "name": "Rebel Inc: Escalation", "name_original": "Rebel Inc: Escalation", "description": "From the creator of 'Plague Inc: Evolved' comes a unique and deeply engaging political/military strategic simulation.<br/><br/>In Rebel Inc: Escalation, the war is ‘over’ - but we all know that doesn't mean anything. To stabilise the country, you need to balance military and civilian priorities to win the hearts and minds of the people, whilst also stopping insurgents from seizing power!<br/><br/><br/><br/>Following on from the global mega hit  'Plague Inc.' with over 130 million players, Rebel Inc: Escalation offers a deeply engaging, strategic challenge inspired by the complexities and consequences of modern counter insurgency. It has received acclaim from international development experts and was even featured at a major international peace conference!<br/><br/>Rebel Inc: Escalation combines the original critically acclaimed gameplay with significant, all-new features and improved 3D graphics for PC, with loads more still to come, including a campaign, multiplayer and Steam workshop support,<br/><br/><br/><br/><br/><br/><ul><li><strong>5 regions to stabilise</strong> - Deploy to wildly different strategic environments, from the gentle farms of ‘Saffron Fields’, to the impenetrable forests of ‘Distant Steppe’.<br/></li><li><strong>6 unique governors</strong> - Each one with radical new abilities to master. Choose the ‘Economist’ to receive an entire year’s income in one go or the ‘Warlord’ to train a personal militia.<br/></li><li><strong>Hyper-realistic</strong> - Inspired by Afghanistan, the simulation is highly detailed, containing real world development initiatives and an innovative representation of counter insurgency tactics. It has been praised by the World Bank and was even featured at a major international peace conference<br/></li><li><strong>Advanced civilian and military AI</strong> - Sophisticated narrative algorithms model the needs of local populations, while deadly insurgent attacks put constant pressure on your operation.<br/></li><li><strong>Gorgeous Graphics</strong> - Stabilise a beautifully rendered 3D world that responds to your actions and thrives as you provide jobs and services. Drone cams and civilian TV channels bring your operation to life and show you what's happening on the ground.<br/></li><li><strong>Clear Intelligence</strong> - Plan priorities with Intelligence Reports and Combat SITREPs, geek out with loads of new stats and graphs, and analyse your best strategies with end-of-game replays.</li></ul><br/><h3>Coming during Early Access</h3><br/><ul><li><strong>More Regions and Governors</strong> -  Rebuild a vast dam to prevent catastrophic floods in Azure Dam, deploy heavy tanks with the Tank Commander and more...<br/></li><li><strong>Campaign Mode</strong> - Conduct large-scale operations across multiple regions. Carefully manage resources and choose unique upgrades in a persistent world with all new conditions and threats.<br/></li><li><strong>Co-Op and VS Multiplayer</strong> - team up to efficiently stabilise the region with friends or compete in the shadows to promote your own cause.<br/></li><li><strong>Custom Scenario Creator</strong> - Develop your own custom scenarios and share them with other players via Steam Workshop. Who said Nation Building was hard?<br/></li><li><strong>And much more</strong> - including daily challenges, speed runs and Mega-Brutal difficulty. Plus loads of new maps, governors and scenarios in future (free!) updates</li></ul><h3>An important note:</h3>Although a fictional game, Rebel Inc. looks at important real world issues and we have made every effort to deal with them sensitively. The game has been extensively researched and has been developed in cooperation with leading regional politicians, business people and journalists as well as international charities, experts and governments.", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-07T23:29:43", "background_image": "https://media.rawg.io/media/screenshots/ed9/ed96010d79926c967c79d9f0eb832e79.jpg", "website": "https://www.rebelincgame.com", "rating": 3.96, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 243, "beaten": 9, "toplay": 10, "dropped": 8, "playing": 5}, "playtime": 3, "achievements_count": 99, "ratings_count": 24, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 24, "platforms": ["PC"], "developers": ["Ndemic Creations"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Ndemic Creations"], "esrb_rating": null}