{"id": 377876, "slug": "rituals-in-the-dark", "name": "Rituals in the Dark", "name_original": "Rituals in the Dark", "description": "Six months ago, Aspen Draper’s elderly neighbour, Mrs Leigh, died from a heart attack. Aspen was the last person to see Mrs Leigh alive, and she was the first person to find the old woman’s body.<br/><br/>After this unfortunate discovery, Aspen becomes something of a celebrity in her dreary seaside home town, Scarborough. She’s bombarded with intrusive questions about Mrs Leigh’s death every day, and her friends are insatiably curious about the incident. Despite Aspen’s best efforts, she’s unable to move on from the past, even as time passes.<br/><br/>The winter months segue into the summer, but Mrs Leigh’s home remains unsold. Eventually, the house is boarded up, and rumours begin to spread that it’s haunted by her restless ghost. Then, during a sleepover with her friends Pippa and Lakhi, Aspen is made to confront her fears all over again. Pippa dares Aspen to break into Mrs Leigh’s home to search for this elusive ghost, and Aspen is too weak-willed and anxious to refuse.<br/><br/>Under the cover of the night, Aspen returns to Mrs Leigh’s home - but she doesn’t find eerie spectres awaiting her arrival. Instead, she meets a strange girl called Althea, who seems to know more about Aspen than any stranger ought. Aspen soon finds herself enchanted by the beautiful Althea, and she resolves to discover who (or, indeed, what) she really is.<br/><br/><br/><ul><li> 50k words of text<br/></li><li> Around 3-4 hours of reading<br/></li><li> A kinetic storyline with no choices/branches<br/></li><li> Detailed backgrounds and CGs<br/></li><li> 1080p display<br/></li><li> An original soundtrack inspired by The Cure<br/></li><li> A haunting, eerie atmosphere<br/></li><li> A sweet lesbian romance story suitable for all ages<br/></li><li> It’s the only visual novel set in Scarborough!!! (probably) </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-30T02:46:49", "background_image": "https://media.rawg.io/media/screenshots/1bf/1bf7222f0e193f319d78552ad5964269.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 8}, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ebi-hime"], "genres": ["Simulation", "Indie"], "publishers": ["ebi-hime"], "esrb_rating": null}