{"id": 377859, "slug": "agent-roswell", "name": "Agent Roswell", "name_original": "Agent Roswell", "description": "<strong>Inspired by Real Events from throughout History.</strong><br/><br/><strong>Story</strong><br/>After the Roswell incident of 1947 (a prologue level) a Government task force is set up to counter the threat of U.F.O. and Aliens.<br/>Set in 1969 USA, you are an Agent working for B.A.I.T. (Bureau for Alien Investigation &amp; Termination) and your task is to investigate and help stop an Alien invasion, your work will also deal with a terrorist group called S.E.T.A. (Supporters of Extra Terrestrial Arrival), who want to reveal the truth about the invasion to the public.<br/><br/><strong>Early Access Gameplay</strong><br/><ul><li>A first and third person action shooter for PC.<br/></li><li>Single player.<br/></li><li>16 Playable missions initially (Including 1 Side Mission)<br/></li><li>Reconfigurable Controls &amp; Graphic settings.<br/></li><li>Use your Office as a platform to plan your attacks, and customise your equipment.<br/></li><li>Level Editor / Physics Simulator - Crate your own levels, and play them.<br/></li><li>Lots of Weapons to use, and special equipment.<br/></li><li>Explore and use the B.A.I.T. Headquarters complex to brush up on your skills and see the Government experiments &amp; archive.<br/></li><li>Complete missions to access unlocks to reskin your clothing, and vehicle.<br/></li><li>Drive your Agent Vehicle to explore locations (and drive a small number of other vehicles)<br/></li><li>Destroy the Alien invaders in their numerous types of craft.<br/></li><li>Prevent UFOs abducting everything from pedestrians to cars.<br/></li><li>Fight Alien troopers with that have Gravity guns, Jet packs and Rayguns.<br/></li><li>Deal with the SETA terrorists, and their attempts to spread the word.<br/></li><li>Recover artifacts for the Bureau.<br/></li><li>Cover up evidence which may lead to panic.<br/></li><li>Solve puzzles to aid the Bureau.<br/></li><li>Use the environment to help you destroy enemies (explosive objects, power lines).<br/></li><li>Utiliize military, civillian and Alien equipment to help destroy the Alien craft.<br/></li><li>Call in Air Strikes, and support air craft.<br/></li><li>Load and Save checkpoints.<br/></li><li>Record Animated GIFs (up to 10 Seconds) for in-game action to share on Social Media.</li></ul><br/><strong>Level Editor</strong><br/>The game comes with an in-built level editor, which has hundreds of props ready to go, you can pick your terrain, time of day, make your level, place some extra cameras and off you go! Simply exit the play mode to edit the level, or save and carry on with the main campaign in Agent Roswell.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-30T02:37:55", "background_image": "https://media.rawg.io/media/screenshots/7a4/7a4fba0e470758a146d38ece1c1723a5.jpg", "website": "https://www.facebook.com/agentroswell/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blue Horizon Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Blue Horizon Studios"], "esrb_rating": null}