{"id": 377881, "slug": "duels-champions-pvp-fights", "name": "Duels Champions: PvP Fights", "name_original": "Duels Champions: PvP Fights", "description": "Upgrade your fighter with weapons and skills to succeed in unique PVP RPG game!<br/><br/>Enjoy the ultimate gaming experience, Duels is a high energy RPG PVP game, but with a difference… the unique auto-battle system means anybody can play. Choose your favorite character and prepare for battle! <br/><br/>Immerse yourself in the medieval game environment. Enjoy the simple but addictive gameplay, with epic music and great visuals. Fight against millions of other players in competitive leagues. Start creating or join a Clan and become the ultimate hero!<br/>Want to challenge yourself further? Enter the Dungeons at your peril and fight your way through hordes of cool monsters. <br/>Unlock chests to access special gear and pulverize your enemies! Use all your strategy skills to access unique advanced items and upgrade your character as you progress. Equip your Hero with the best loot, but make sure you choose wisely…<br/><br/>Features:<br/><br/>PvP GAME MODE <br/>Fight against players all around the world, team up to become the best clan and be worshiped as your clan HERO<br/><br/>OVER 45 SPECIAL SKILLS <br/>Expand your skillset to become more elusive and dangerous. Use special skills like Meteor, Ice wall and poison punches to inflict more damage<br/><br/>OVER 1,000 CUSTOMIZE ITEMS<br/>Unlock hundreds of painful weapons, crazy shields, and cool body armor to outsmart your opponents with unique Duel fight.<br/><br/>UNIQUE GAME MODES <br/>Use Fire, Ice, Iron, and Poison attacks to defeat the giant Monsters in the Dungeons and Campaigns modes. Beat real players and advance in the different leagues to get better loot and improve your fighter.<br/><br/>Get more news and updates:<br/>Facebook: https://www.facebook.com/DuelsGame<br/>Website: https://www.deemedya.com<br/>For support, feedback, and suggestions:support@deemedya.com", "metacritic": null, "released": "2019-09-23", "tba": false, "updated": "2019-09-30T02:51:12", "background_image": "https://media.rawg.io/media/screenshots/34c/34c7c1ac0b51a753256e3aab371e10ba_gMS9935.jpg", "website": "http://www.deemedya.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Deemedya"], "genres": ["Action", "Casual"], "publishers": ["Deemedya"], "esrb_rating": "Everyone 10+"}