{"id": 377833, "slug": "1001-jigsaw-castles-and-palaces", "name": "1001 Jigsaw Castles And Palaces", "name_original": "1001 Jigsaw Castles And Palaces", "description": "1001 Jigsaw. World Tour: Castles and Palaces is an exciting puzzle game and a fantastic tour guide. Put together jigsaw puzzles from a multitude of pieces and wander the houses of royal families in 500 high-quality photos. Now you can solve your favorite jigsaw puzzles, enter a knightly order and defend your honor in a tournament! Experience the true heritage of history without leaving the comforts of home!<br/>\n<br/>\r\nSet a difficulty to suit you for each puzzle! Save your progress at any time! Simple controls and plenty of hints and tools make the game a joy to play. This game is suitable for both new players and true professionals in the logic puzzle genre.<br/>\n<br/>\r\nAn exciting tour across famous and epic castles and palaces: the beautiful Neuschwanstein Castle, the Arge Bam Castle, the Pena National Palace, the medieval Ashford Castle, the Dracula Castle, the Casa Loma, the Castle Zaman and a multitude of other magnificent structures filled with history and royal spirit. Take advantage of this unique opportunity to visit a huge number of places, learn their history and play 1001 Jigsaw World Tour: Castles and Palaces!<br/>\n<br/>\r\n1001 Jigsaw. World Tour: Castles and Palaces is a game and global tour guide. 500 high-quality photos: famous sights galore, plus architecture, monuments, art, national traditions and glory, history… And you can start your journey through it right now!<br/>\n<br/>\r\n- 500 high quality unique images<br/>\r\n- well designed game-play: useful hints, sort tool and magnifying glass.<br/>\r\n- optional game difficulty control makes your gameplay infinite<br/>\r\n- custom styles of pieces with rotation<br/>\r\n- save game progress and continue to collect the puzzle at any time<br/>\r\n- pleasant and relaxing music<br/>\r\n- 2 in 1: a game and beautiful palaces and castles from all over the world<br/>\r\n- get 500 puzzles for one purchase<br/>\r\nIt is beneficial!", "metacritic": null, "released": "2019-11-11", "tba": false, "updated": "2019-09-30T02:25:21", "background_image": "https://media.rawg.io/media/screenshots/e13/e1337bdc3a70785e37bf804d4031c9be.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creobit"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}