{"id": 377895, "slug": "birdpapa-bubble-crush", "name": "Birdpapa - Bubble Crush", "name_original": "Birdpapa - Bubble Crush", "description": "Classic bubble shooting eliminate shooter games, beautiful picture quality, fun levels, no wifi, free, the best time to pass the game!<br/><br/>Welcome to the happy life of Birdpapa. You can find a cute bird baby hiding in the depths of the bubble jungle with Birdpapa. You can go underground to find treasures and help Birdpapa reunite with his wife. Slide your fingers, remove colored bubbles, pop, pop, watch, baby birds are what you find.<br/><br/>More friends are waiting for your exploration, like bats holding small balls, thieves who steal small balls, flowers floating in the sky, piranhas who eat small balls, and slimes that will split... Go and play with Birdpapa.<br/><br/>How to play:<br/>- Aim and match the foam you want to soak in the foam.<br/>- Match 3 or more identical bubbles.<br/>- Remove the bubbles to find the cute bird.<br/>- Remove all bubbles to get a treasure chest.<br/>- Remove the bubbles that blocks Birdpapa and help him find his wife.<br/>- Clicking on the gift pack in the game will increase your bubbles.<br/>- Click on the magic birds in the game and use their power to make it easy for you to pass the game.<br/>- The game will give you stars based on your performance in the game. The higher the score, the more stars.<br/>feature:<br/>+ high quality and good music<br/>+ No wifi to play<br/>+ completely free<br/>+ Well-designed levels, not only fun but also a lot!<br/><br/>You can download it to your children, girlfriends, old parents, and yourself for free.<br/>Birdpapa wish you a happy life!", "metacritic": null, "released": "2019-02-02", "tba": false, "updated": "2019-09-30T03:00:49", "background_image": "https://media.rawg.io/media/screenshots/f51/f51a0de3ba6364b7c27910c00bc904a2_sD7LvH0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["sun boyang"], "genres": ["Casual", "Puzzle"], "publishers": ["sun boyang"], "esrb_rating": "Everyone 10+"}