{"id": 377851, "slug": "farmington-county", "name": "Farmington County", "name_original": "Farmington County", "description": "Farmington County is a farming and lifestyle simulator set in small-town America. Clear out the land with hand tools and logging vehicles, and then lay out roads, construct buildings and set up irrigation. Develop your land from a small farm into a massive operation with thousands of crops and hundreds of animals growing at the same time. <br/><br/><strong>Freeform Building and Farming: </strong><br/>Farmington County features a gridless farming and building system. Make your farm look how you want it! Decorate your farm with small accents or build spacious warehouses, garages and barns using heavy construction vehicles. Lay out roads and irrigation to keep your farm working like a well oiled machine.<br/><br/><strong>Uniquely Normal Setting:</strong><br/>Farmington County is set it in an immersive and realistic small-town America. There will be no zombies or monsters in this game. Instead, the challenges will be strategic - which crops to grow in a fast paced, dynamic economic system, where to store them after harvest, how to bring them to market, and how to maintain steady profits. Future updates will also focus on developing an expansive, fully fleshed town filled with NPCs and fun, local experiences. <br/><br/><strong>Hand grown, Vehicle driven:</strong><br/>Develop your farm using a collection of trusty hand-tools, or use a wide assortment of vehicles to plow, seed and harvest your crops. Use trucks and transport vehicles to bring your goods to market in an engaging and efficient way.<br/><br/><strong>Massive Growth:</strong><br/>You can have a small, sustainable farm, or a farm with thousands of crops and hundreds of animals growing at the same time, each with their own specific growth characteristics. Fertilize your plants to keep them growing quickly, and watch out for pests or they will decimate your crops.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-30T02:34:10", "background_image": "https://media.rawg.io/media/screenshots/5b9/5b9bb7ee3195a6a1cfc57102f69c77b7.jpg", "website": "http://farmingtoncounty.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Grenoble Interactive"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Grenoble Interactive"], "esrb_rating": null}