{"id": 377877, "slug": "hero-hours-contract", "name": "Hero Hours Contract", "name_original": "Hero Hours Contract", "description": "Magical girls are real, but the pay sucks! Join the Union of Magical Girls as they fight to protect the city from evildoers by day, and fight to become unionised by night.<h3>Features</h3><ul><li>Take on the brainwashed zombie hordes in <strong>tactical, turn-based combat</strong>.<br/></li><li>Your magical familiars gave you these powers, but now they expect you to fight evil for free? <strong>Negotiate better pay</strong> or employment benefits based on your performance.<br/></li><li>Get to know the inhabitants of the struggling convenience store where you and your family live and work. Power up your abilities by <strong>making new social connections</strong>.<br/></li><li>Loaded with dorky humour and 90s magical girl anime tropes.</li></ul><h3>Battle Flow</h3>Due to your overwhelming power levels, the enemies can't actually hurt you, so the focus is on <strong>defeating enemies as quickly as possible</strong> to gain higher rewards and bargaining power when the battle ends.<br/><br/>Of course, not all enemies are brainless zombies, and you'll have to contend with many abilities designed to impede your pursuit of a perfect score!<h3>Social Links</h3>Outside of battle you'll be able to invest your precious time and money into building up your social links through <strong>visual novel style conversations</strong>:<br/><br/><ul><li>Help the convenience store clerk find romance!<br/></li><li>Try to lure out the NEET who lives in the storage cupboard!<br/></li><li>Waste all your money on gacha machines to try and impress a small child!</li></ul><h3>Negotiation</h3>How the heck are you supposed to have a social life with no money or free time? After every battle you'll get to lead the Union of Magical Girls in <strong>collective bargaining</strong> to determine your reward based on how well you fought and how many gems you gathered.<br/><br/>Don't let them take your <strong>dental plan</strong>!", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-01T20:03:32", "background_image": "https://media.rawg.io/media/screenshots/9f4/9f4fb6fef9aaf5b14424c511c481fc4f.jpg", "website": "https://twitter.com/SOGormanGames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Steve O'Gorman"], "genres": ["Strategy", "Indie"], "publishers": ["Steve O'Gorman"], "esrb_rating": null}