{"id": 377939, "slug": "prison-escape-survival-3d", "name": "Prison Escape Survival 3D", "name_original": "Prison Escape Survival 3D", "description": "Get ready to fight with security of police flight. Show extreme stealth skills to sneak inside jail to help your lockup criminals and gang fellows in this latest prison escape &amp; run game. Fight hard to escape from police airplane. This is not an easy task to make a safe escape from the cell as the security is high alert &amp; wardens are patrolling in the airplane flight. Kill the hard time police officers in the prisoner flight game and perform parachute jump out of airplane skills in this parachute landing game. Let’s do it to end the hard times in this flight simulator game. Fight with bear in the jungle gliding towards the village crafting and build a safe place for yourself, shoot &amp; kill city police duty officers &amp; crazy car driving while police car is chasing you. Defend yourself from wild animals and other dangers of the island. <br/><br/>Get ready in this epic super prison escape &amp; run mission you will have to use all your skills for survive in this island. Super prison escape &amp; run on survival island reaching a new level! You successfully jailbreak alcatraz jail. Hard time is not over yet show your brutal attacking skills to hunt down wild beast in the jungle battle and save yourself from their final counter attacks in this survival island hero escape. You have been sent to alcatraz jail for years for a crime you have not committed. Rival business tycoon conspired to keep you locked up in scary jail, now it's time to take your respect back. Find out the tools hidden that might help you in fighting use your weapons in the best possible way to kill gangster and criminals. Make your super moves to get rid of the criminals in one go in this survival island game.", "metacritic": null, "released": "2018-11-15", "tba": false, "updated": "2019-09-30T03:16:37", "background_image": "https://media.rawg.io/media/screenshots/60a/60a9a855774cbcf8e452537e98fffc28_LEOwZeZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nina Kaiser"], "genres": ["Action"], "publishers": ["Nina Kaiser"], "esrb_rating": "Teen"}