{"id": 377965, "slug": "zebra-dodge", "name": "Zebra Dodge", "name_original": "Zebra Dodge", "description": "A bizarre game about dodging zebras, conversing with a stranger and a bird while also uncovering the mysteries that surround the strange world of...<br/><br/>ZEBRADODGE! <br/><br/>With simple pick up and play controls, an exciting story filled with dynamic characters and mystery, Zebra Dodge is your new favorite game. <br/><br/><br/>-FEATURES-<br/><br/><br/>STORY<br/>For as long as he can remember, Ace has been searching for answers regarding his long lost mother. However, he might just end up getting more answers than he asked for.<br/><br/>A coming of age story featuring fastpaced gameplay, branching dialogue created in Yarn, mystery, and lots and lots of zebras!<br/><br/><br/>ARCADE MODE<br/>Tap and Dodge your way through 4 unique stages to collect Paint, Scrap, and top your high score!<br/>(Just watch out for wave 25) <br/><br/><br/>COSTUMES <br/>Unlock 12 exciting costumes including 4 costumes for Slow Magic inspired by his albums:<br/>-Triangle<br/>-How To Run Away<br/>-Float<br/>and his upcoming album:<br/>-Dreams<br/><br/><br/>The Most Zebras to be Featured In A Videogame Ever.<br/>...probably...<br/><br/>Absolutely zero microtransactions! <br/>All costumes and stages unlocked exclusively via gameplay.<br/><br/><br/>MUSIC  <br/>Enjoy a full original soundtrack featuring sounds from Teenage Engineering's Pocket Operators, Native Instrument's Maschine, as well as 4 official tracks composed by Slow Magic including a never before heard remix.<br/><br/><br/>TAKE A BREAK<br/>from all the dodging to spend some quality time with the locals. Chat about whatever with the Mechanic, and gain insights on the mysterious world of Zebra Dodge.<br/> <br/><br/>Ready, Steady, Dodge in the debut game from Ottawa, Canada based studio, CloseCall Studios.  <br/><br/>Enjoy!", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2019-09-30T03:25:43", "background_image": "https://media.rawg.io/media/screenshots/dff/dffd499be23ecba12699d6ae6cab09f3_swqo2Rp.jpg", "website": "http://www.zebradodge.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jeffrey Newton-Evans"], "genres": ["Adventure", "Casual"], "publishers": ["Jeffrey Newton-Evans"], "esrb_rating": "Everyone 10+"}