{"id": 378375, "slug": "steemknights", "name": "SteemKnights", "name_original": "SteemKnights", "description": "<p><strong>HOW TO PLAY?</strong></p>\n<p>Prepare for action packed battles on a chess like battlefield. Position your King and Trap. But choose wisely, as you will command forth your pawns to slay the opponent's King and win the battle in the name of your kingdom!</p>\n<p>Each encounter on battlefield will play out according to the Rock, Paper, Scissors principle. It's just Sword, Bow &amp; Arrow and Magic Wand on our battlefield.<br/></p>\r\nSwordBow &amp; ArrowMagic WandWield your Sword and Shield against all attackers and come forth victorious against Bow &amp; Arrow!Be quick and decisive, dodge magical attacks and slay the unholy Wand carriers!Use your powers to shield yourself from physical blows and wield your Magic Wand to burn down the knights!\r\n<p><strong>HOW TO EARN?</strong></p>\n<p>The mighty gods bestowed upon us two ways to acquire Steem. They said that the immortals should use it wisely.</p>\n<p><strong>The Pot</strong><br/>Each time you embark onto the battlefield you and your opponent will place a wager which represents the Pot of the battle. Upon victorious outcome you will collect the battle's Pot minus a 10% fee that goes to the battle generals. Symbolize the fee more of an invest for your Knight Emblems</p>\n<p><strong>Loyalty</strong><br/>For each battle fought, whether you come forth victorious or not, you will receive 1% Loyalty up to a maximum of 120%. With a Loyalty value of 120% you will receive 20% more Steem on your next payout. If you don't find the time to fight for your kingdom you will lose 1% Loyalty per day</p>\n<p><strong>Battle</strong><br/>You will collect Knight Emblems for every potted battle fought, whether you come forth victorious or not. If you do triumph you will collect 100x the amount of Steem wagered, if you succumb you will only collect 50x. Fight your battles wisely, that you may collect more Knight Emblems that you can carry.</p>\n<p><strong>WHY BLOCKCHAIN?</strong></p>\n<p><strong>Verifiable Results</strong><br/>Thanks to the full transparency of the blockchain's distributed ledger every action taken by the players can be recorded and the games result can be completely traced and verified.</p>\n<p><strong>Replays &amp; Statistics</strong><br/>As a result of the blockchain's transparency it is possible for everyone to completely recreate a game. This means you can analyze and create statistics of your game history.</p>\n<p>🚀 Who is fivefingergames GmbH?<br/>🏰 What is SteemKnights?<br/>▶️ Trailer<br/>📜 To the Website<br/>📧 Discord<br/></p>", "metacritic": null, "released": "2019-09-28", "tba": false, "updated": "2019-09-30T05:37:38", "background_image": "https://media.rawg.io/media/screenshots/541/5410b485896be46f3e7c54b6add96e29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["fivefingergames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}