{"id": 378353, "slug": "survival-vacancy-itch", "name": "Survival Vacancy (itch)", "name_original": "Survival Vacancy (itch)", "description": "<p><strong>This is a demo alpha version,full version will be available on steam soon</strong></p>\n<p>You're a talented engineer in the middle of a nuclear war, your mission is to save as many survivors as possible.<br/>You found a great isolated place to start digging and create your underground community.<br/>You have to use your engineering skills to create a survivable underground shelter.<br/> You will start craft components and machines manually, then automate and create large scale production lines.<br/>You will have to find nutrition sources “Algae, grow plants..etc”, prepare foods for incoming survivors.<br/>You who decide how many vacancies are available in your community.<br/>You have to plan ahead to avoid overcrowded community.your responsibility to keep your survivors alive and take care of their health, you have to give them jobs to increase your machine's efficiency and to increase survivors skills.<br/>There are machines need a certain skill level to start working.<br/>You have to create electrical power networks to power machines and other equipment in your community, Generate electricity using wind power, solar power… nuclear power.<br/>The game will be available soon as early access with a bunch of features, and a bunch of planned ones.</p>\n<p>Wish list on steam now<br/></p>", "metacritic": null, "released": "2019-09-28", "tba": false, "updated": "2019-09-30T05:32:26", "background_image": "https://media.rawg.io/media/screenshots/e54/e542bacb62bae1c4c349821ee5cf7f13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mindleak"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}