{"id": 378413, "slug": "up768201-roomba-number-five", "name": "UP768201: Roomba Number Five!", "name_original": "UP768201: Roomba Number Five!", "description": "<p>In Roomba Number Five, you play as a friendly cleaning bot called Roomberto. Roomberto procrastinated a little too much and now he has to make a mad dash across his master's suspiciously large and linear house, cleaning up dirt and avoiding pesky furniture as he goes.</p>\n<p>Simply click and drag the mouse to navigate throughout the level.</p>\n<p>Be warned though, you'll need to collect batteries to keep Roomberto going, or he'll get a bit fed up and you'll make him very sad, violating like 6 clauses of the Geneva convention or whatever.<br/><br/>This game was made in Unity 5, using ProBuilder, ProGrids, Post-Processing Stack and various colour correction profiles.<br/><br/>All 3d artwork was taken from the Google Poly website. They are distributed by Poly by Google and come with a commercial use/remix license.<br/><br/>The font used in the game is The Kids Mraker, a font that's free for both personal and commercial use. https://www.dafont.com/the-kids-mraker.font?text=Roomba+Number+Five<br/><br/>The music used is taken from the Free Music Archive. https://freemusicarchive.blob.core.windows.net/storage-freemusicarchive-org/music/none_given/Rolemusic/Rolemusic_-_Singles/Rolemusic_-_02_-_May.mp3</p><p>The sound effects used were generated with BFXR, a free for commercial use sound effects generator.</p>", "metacritic": null, "released": "2019-09-28", "tba": false, "updated": "2019-09-30T05:46:52", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bc504d9edc14fe5e3bede410e3466ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dan Ahern"], "genres": [], "publishers": [], "esrb_rating": null}