{"id": 378445, "slug": "trix-and-the-horny-tower-hentai-rpg", "name": "Trix and the Horny Tower - Hentai RPG", "name_original": "Trix and the Horny Tower - Hentai RPG", "description": "<p>You can support me on my Patreon!</p>\n<p><strong>This game IS NOT finished! </strong>It will be launched in 2020 Q1, and <strong>more versions will be published </strong>in this page. <strong>Stay tuned and follow my dev page on Itch.io!</strong></p>\n\n<p>After years trying to be an Atalanta (a sort of archer but with a javelin and a shield) and being reprehended by her mother, Trix grew up and now wants to conquer the world to become a powerful Atalanta in the Argania Kingdom.</p>\n<p>To start her dream, she joined in Lady Ursula's School/Guild to improve her fighting skills, and learn how to survive the Horny Tower - one of the most dangerous places close to Trix's Village. <strong>Can Trix fulfill her dream surviving a place full of horny monsters and naughty curses? </strong></p>\n\n<ul><li>Classic J-RPG Gameplay:</li><li>Powerful Girls with individual conflicts;</li><li>Immersive Story and Characters;</li><li>Side Quests;</li><li>Day and Night System;</li></ul>\n\n<p>To speed up the development process and create more girls (and adult scenes) to the game, I started a Patreon so that you can access sketch of the girls (and her NSFW moments), the finalized versions of CGs, a free dev week blog to know what is coming, and receive a lot of rewards (<strong>want Trix naked holding a sign with your name on it? click here</strong>).  Also, you can test the unstable builds before anyone else, and receive a <strong>Steam Key FOR FREE</strong> based on your Tier. You can check the most important aspects of my Patreon below. If you want to support me and play the next version of Trix and the Horny Tower which will be released to my supporters soon, you can click here.</p>\n\n\n<p>As English is not my first language, I will be glad if you join in my Discord to give me feedback about the translation and give me ideas to improve the game. Besides, <strong>as I've been working for almost a year with RPG Maker NSFW games, I have many features already developed that I can implement to this game.</strong> Thank you for supporting me.</p>\n<p><strong>Wanna contact me?</strong></p>\n<p>Feel free to email me!</p>\n<p>hentairoomstudio@gmail.com</p>\n<p><strong>Social Media</strong></p>\n<p>Facebook| Discord</p>", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2019-09-30T05:57:47", "background_image": "https://media.rawg.io/media/screenshots/a69/a692e5d49beebae769e76b6ebc28e337.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hentairoom"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}