{"id": 378407, "slug": "everna-fireheart-legacy-vx", "name": "EVERNA FireHeart Legacy VX", "name_original": "EVERNA FireHeart Legacy VX", "description": "<p>Starting out as a carefree fool, Cristophe Deveraux never expected his career as a monster hunter to turn into more than just a livelihood. With his smart-aleck cousin Carolyn as partner, they battled various monsters, solving supernatural quests that were way beyond their academical know-how.<br/><br/>Along the course of adventure, Cristophe and Carolyn made friends with some extraordinary people: Robert Chandler, a ranger trying to make peace with his past; Paolo Marvellini, a dwarf priest struggling to protect his family from the conspiracy around him; and many more heroes in the land, all with their unique personalities, abilites (and problems).<br/><br/>As finale, all those heroes were pitted together in an ultimate quest to prevent the return of Vordac the Dark OverLord - an ancient evil whose soul was sealed inside the godly sword, Deathblade Kraal'shazar.<br/><br/>Will the heroes stop Vordac for good? Will they become the prophesied Paladins of Legend who hinder the ultimate evil from plaguing the good, magical world of Terra Everna? In this game episode, FireHeart Saga - the Third Cycle begins. It's the first part of two, titular \"Azure Sun\".<br/><br/>Come forth, Paladins! Fulfill your destiny!<br/><br/>Game Manual:<br/>Player Movement Control : Keypad Up, Down, Left, Right<br/>Dash / Run: Hold SHIFT key while pressing the directional buttons<br/>Action Button: ENTER or SPACEBAR key<br/>Enter / Exit Main Menu: ESC key<br/><br/>F12: Back to Title Menu<br/>F1: Pause / Setup Display</p>", "metacritic": null, "released": "2019-09-28", "tba": false, "updated": "2019-09-30T05:45:09", "background_image": "https://media.rawg.io/media/screenshots/c37/c37bdcc1ceb47d3e71df560ed91419d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evernade"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}