{"id": 378633, "slug": "idle-gym-city-fitness-tycoon", "name": "Idle Gym City - fitness tycoon", "name_original": "Idle Gym City - fitness tycoon", "description": "Do you feel these fitness vibes? Your idle gym center is waiting for you! Start running your sports business and expand your idle gym to the fitness empire! Try yourself as a fitness manager, upgrade your idle sport gym and run the best fitness studio in the Idle Gym City!<br/> <br/>Start managing your gym in a tiny room with almost no sports equipment and then upgrade it to the gym chain with plenty of fitness club locations such as rooftop, open space, beach, stadium, yoga studio, aquapark and many others! Think out every single detail and design your gym interior with TV sets and various cool items. Transform a small empty gym into the crowded sports center!<br/> <br/>Upgrade everything! Your main goal is expanding your gym chain as far as you can. To achieve your goals you need upgrading every part of your idle fitness studio: get the best exercise machines and the newest fitness equipment, hire skilled coaches and invest your idle cash to develop your sport business inc. Even your customers will be taking the challenge and become fit and strong with you. Make them run and have fun! The more upgraded your gym is, the more idle cash you get!<br/> <br/>Running a sport business inc. means having so much fun! See your customers running, doing weight lifting exercises and many other sport activities in your sport center inc. Be a strong man and never stop upgrading your idle gym - there are plenty of things you need to do if you really want to become a billionaire. Earn idle cash by managing the fitness gym center and one day you’ll find yourself being a sports tycoon in the Idle Gym City!<br/> <br/>Enjoy funny plot and addictive gameplay:<br/> <br/>- Manage your idle sports gym;<br/>- Expand it to the fitness empire;<br/>- Run the sports business and feel like a business man;<br/>- Get idle income;<br/>- Hire the best coaches;<br/>- Set the newest fitness equipment;<br/>- Enjoy upgrading your gym;<br/>- Become a fitness tycoon;<br/>- Turn into a billionaire;<br/>- Challenge yourself!<br/> <br/>Prove you are a strong business man that deserves to be a fitness tycoon! Become the best sport leader in the gym management story and head your own fitness empire in the Idle Gym City!", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-10-04T02:20:17", "background_image": "https://media.rawg.io/media/screenshots/5d7/5d72717c26395b583e374738fa2c3007_fjT0eVg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rodan mobile Korlatolt Felelossegu Tarsasag"], "genres": ["Sports", "Casual"], "publishers": ["Rodan mobile Korlatolt Felelossegu Tarsasag"], "esrb_rating": "Everyone 10+"}