{"id": 378698, "slug": "spooky-house-halloween-2", "name": "Spooky House Halloween", "name_original": "Spooky House Halloween", "description": "Explode and Smash pumpkins in this Halloween inspired game by Spooky House Studios. Spooky Pumpkin Crush is pure and addicting fun!<br/><br/>The game takes in place in a spooky manor, where all the spooky house games are crafted.<br/><br/>Features:<br/>- Chain reaction pumpkin Explosions!<br/>- Funny and slick animations<br/>- Spooky sounds<br/>- Night mode<br/>- 12 game modes: Classic, Shooter, Swapper, Chill Out, Pumpkin Invasion, Turn By Turn, etc..<br/>- Bonuses for exploding pumpkin groups of nice shapes: squares, lines, corners, etc…<br/>- Global online scoreboards<br/>- Undo up to 10 moves back<br/>- 5 animation speed settings : Slow Motion, Normal, Fast, Turbo, and Animations Off<br/>- Saves game on exit or a phone call<br/>- Ghost sounds<br/>- Creepy squeaky sounds<br/><br/>Note: The Free version may be subject to limitations and the limitations are subject to change.<br/><br/>Our standard subscription options are:<br/>1-month Subscription <br/>3-months Subscription<br/>1 Year Subscription<br/><br/>* Subscription payments will be charged to your iTunes account at confirmation of your purchase and upon commencement of each renewal term. Subscription with a free trial period will automatically renew to a paid subscription. You can cancel your subscription or free trial in the iTunes settings at least 24-hours before the end of the free trial period. The cancellation will take effect the day after the last day of the current subscription period and you will be downgraded to the free service. <br/>* Please note: any unused portion of a free trial period (if offered) will be forfeited when you purchase a premium subscription during the free trial period.<br/><br/>Privacy Policy: https://www.spookyhousestudios.com/legal/spooky_house_privacy_policy.html<br/>Terms of use: https://www.spookyhousestudios.com/legal/spooky_house_subscriptions_terms_of_use.html", "metacritic": null, "released": "2010-10-26", "tba": false, "updated": "2019-10-04T02:57:45", "background_image": "https://media.rawg.io/media/screenshots/56d/56d2ca53c159991724b72c46a3c30aa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Spooky House Studios UG"], "genres": ["Strategy", "Puzzle"], "publishers": ["Spooky House Studios UG"], "esrb_rating": "Everyone 10+"}