{"id": 3786, "slug": "zombeer", "name": "Zombeer", "name_original": "Zombeer", "description": "From the delicious brains of <strong>Moonbite Games</strong> <strong>PadaOne Games</strong> and <strong>U&amp;I Entertainment</strong> comes an enhanced and updated version of Zombeer, a first-person shooter that is an unapologetically irreverent homage to everything kick-ass about zombie movies and drinking  beer.<br/><br/>With new narrative content from writers at Comedy Central, Zombeer is packed with humorous reference to classic zombie flicks of the past and, of course, a healthy supply of ammo and beer.<br/><br/>In the near (and some might say lucky) future, there is a pandemic as a result of a virus that transforms the world’s population into zombies.  That’s not the lucky part – it’s this: Once bitten by a zombie, the only way to stave off the infection is drinking beer!  <br/><br/>Playing as the hero “K,” a survivor inflicted with the zombie virus and a wicked perpetual hangover, players must make their way through the zombie apocalypse managing a balance of sobriety and carnage to find his girlfriend Karen and get out before it’s too late! <br/><br/><strong>Key Features</strong><br/><br/>•\t<strong>Enhanced For Your (PC) Pleasure</strong>: The updated and enhanced version of Zombeer has been optimized to maximize PC players experience. Refined controls, interactivity and improved weapons are just some of the additionsl made to ensure a visceral good time.<br/><br/>•\t<strong>More Jokes For That Tasty Funny Bone</strong>: Zombeer brings the funny with new story content from writers at Comedy Central <br/><br/>•\t<strong>New Tunes To Tease The Braaaiinnn!</strong>: Zombeer includes an update soundtrack with new music for Red Bull Record’s own Five Knives and more! All perfectly suited to jam to while raising hell in the zombie apocalypse.  <br/><br/>•\t<strong>Headshots are the very best</strong>: Players can now score headshots off zombies with bloody satisfying results. Remember to always double tap and don’t be stingy with the bullets.    <br/><br/>•\t<strong>Chug, Chug, Chug</strong>: Find the perfect balance of sobriety and carnage as players must chug Zombeer to prevent turning into one themselves , but be careful, too much of that stuff will make you hurl, limiting your mobility.", "metacritic": 32, "released": "2014-02-11", "tba": false, "updated": "2019-08-28T22:15:25", "background_image": "https://media.rawg.io/media/screenshots/99c/99c56ac2184552bf0e27377edf5cb573.jpg", "website": "https://www.facebook.com/ZombeerTheGame", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 3", "Wii U", "PC"], "developers": ["PadaOne Games", "Moonbite Studios", "Moonbite Games"], "genres": ["Action"], "publishers": ["PadaOne Games", "U&I Entertainment"], "esrb_rating": "Mature"}