{"id": 378709, "slug": "police-simulator-cop-car-duty", "name": "Police Simulator Cop Car Duty", "name_original": "Police Simulator Cop Car Duty", "description": "Patrol the city streets in fast police cop cars to help city civilians from tough crime bosses, low-level thugs, small-time crooks in the latest FPS police car driving simulator game. Take on the role as the latest police officer recruit and go on high-risk missions to pursue &amp; arrest criminals, it’s police vs robbers in all-new action driving gameplay! Call and respond to save the city, uphold your duty as a police officer.<br/><br/>!! Police Simulator Cop Car Duty is one of the best open world driving simulators !!<br/><br/>Explore the huge open city and the surrounding world filled with miles of road to drive along in real police cars. Go on foot and explore the city streets looking for criminals committing crimes in the exciting open world action game. Be on the lookout for stolen cash bags in the world, find all the hidden collectibles to earn new upgrades and police cars!<br/><br/>It’s now time for cop duty action to clean up the city and take criminals in unique gameplay missions like car takedowns, hostage situations, VIP escorts, drug busts, and more police vs robbers action. All-new exciting police crime-fighting action against mafia bosses, thugs, and crooks to stop them and bring justice to the city streets.<br/><br/>Fulfill your police duty:<br/>- Save people in hostage situations<br/>- Police vs Robbers car chases<br/>- Infiltrate and bust crime hideouts<br/>- Protect and escort V.I.P vehicles<br/>- Catch and arrest gang members<br/>- Use evasive driving skills to stop fleeing robbers<br/><br/>Upgrade, unlock, and equip your police gear with a whole arsenal full of amazing weapons. Take on the criminal robbers with Desert Eagles, M16, hand grenades, mini-guns, and a whole load more! Complete police missions rise up the ranks; build up your own collection of police cars from a wide selection of city cars, offroad 4x4 trucks, SUVs, and fast cop car interceptors.<br/><br/>Dive right into non-stop police action of the cop car driving. Take on the cop duty missions any time with callouts through the police radio, blast the police sirens and get over to the scene of the crime to carry out real cop action. Not your style of police work? Decline the radio call, head out and explore the city and surrounding world on foot or ride along in your police patrol vehicle. Do whatever it takes to be one of the best police officers!<br/><br/><br/>Features:<br/>- Massive city environment with surrounding open world to explore!<br/>- Realistic police car driving simulator<br/>- High-quality police cars vehicles and weapons<br/>- Realistic driving and FPS gameplay physics<br/>- Unlimited cop duty missions to play! <br/>- Incredible vehicle damage, see every bump and scratch with each hit<br/>- Unlimited mission objectives, non-stop action!!<br/>- Hidden collectibles to find spread across the open world<br/>- Easy to play car driving controls, use touch, steering wheel, and tilt controls!<br/><br/>Gear up and protect your health as well as your car’s damage, look out for pit stops and hospitals in the city for car repairs and fuel, and first aid kits to help keep you in the line of duty.<br/><br/>Non-stop entertainment and police action in the latest cop car driving simulator game, get right into real police duty gameplay, fight crime and uphold justice against low life crooks throughout the massive open world in the best police car driving simulator game! Become the best city police officer on the force and arrest criminals around a huge detailed open city! <br/><br/>Join in on the best action-packed police driving game, Police Simulator Cop Car Duty!<br/><br/>https://www.i6.com/mobile-terms-of-service/fog/<br/>https://www.i6.com/mobile-privacy-policy/fog/", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2019-10-04T03:05:31", "background_image": "https://media.rawg.io/media/screenshots/76f/76f8cb4f402183cb4be636d0af5bffd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["freeonlinegames.com"], "genres": ["Action", "Simulation"], "publishers": ["FreeOnlineGames.com FZE"], "esrb_rating": "Everyone 10+"}