{"id": 378713, "slug": "flick-footy-free", "name": "Flick Footy Free", "name_original": "Flick Footy Free", "description": "#1 FREE SPORTS GAME IN AUSTRALIA!<br/>TOP TEN FREE APPS IN AUSTRALIA!<br/><br/>Take a look at what people are saying about the iPhone version of Flick Footy if you're not convinced:<br/><br/>\"This game is going to be in the top 25! Not just the best AFL game but the best sports game i have and i love sport games! You wont get bored 5 star!\" - Slymitch, 27th April<br/><br/>\"The game is easily the best footy game on the app store and it is one of my very favourite games.\" - Mertzbro, 19th April<br/><br/>Flick Footy Free is a great taste of everything that makes Flick Footy great, but free!<br/><br/>Featuring realistic ball physics that let you snap a checkside from the boundary or boot a torpedo from outside fifty, Flick Footy is much more than a simple flicking game!<br/><br/>With an interface that changes colour depending on your allegiance, you'll be able to show of your team colours proudly even before you send your team to the top of the online ladder (full version only)!<br/><br/>Other features include a lush, fully 3D stadium and authentic crowd sounds to set the atmosphere. Realistic wind modelling will carry the ball just like it should, and a special training mode lets you practice your kicks from exactly where you want to!<br/><br/>We want Flick Footy to be the best Aussie Rules game available. If you think we can improve it, PLEASE tell us how so that we can achieve our goal!<br/><br/>Features:<br/> <br/>\t* Realistic ball physics - change your hold on the ball to kick drop punts, bananas and huge torpedos!<br/>\t* Lush 3D graphics.<br/>\t* A 3D overhead view that lets you pick where to take a shot from!<br/>\t* Realistic wind effects - take aim at a post to allow for a crosswind.<br/>\t* Choose your team colours and watch as the interface changes to show your support.", "metacritic": null, "released": "2010-07-05", "tba": false, "updated": "2019-10-04T03:12:21", "background_image": "https://media.rawg.io/media/screenshots/2eb/2ebe8132423ec69cd2ba857c3279045f.jpg", "website": "http://www.lemursoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lemur Software"], "genres": ["Simulation", "Sports"], "publishers": ["Wade Perry"], "esrb_rating": "Everyone 10+"}