{"id": 378852, "slug": "infestation-itch-drakir-lowcase", "name": "Infestation (itch) (Drakir, Lowcase)", "name_original": "Infestation (itch) (Drakir, Lowcase)", "description": "Objective\r\n<p>Lead your squad from one corner of the space station to the opposite one. On their way to their safety you have to unlock doors leading to the next room by matching the door's signal - its frequency, amplitude and offset. Alien organisms will attack you in each room - if you unlock the door before the fight finishes, your squad can escape earlier.</p>\r\nDescription\r\n<p>The screen on the left shows the status of your squad in the middle, alien organisms around them and doors on the edges. The screen on the right shows the target signal of doors (red) in the room and your current signal (green). Match your signal to the doors' by adjusting frequency, amplitude and offset. When you match the signals on the right screen, the doors on the left screen unlock and you are free to go further with your squad.</p>\r\nPro-tips:\r\n<ul><li>Use keyboard. The lives of your brothers in arms depend on you - if you will use a mouse, they might not all get back home.</li><li>You can always get back to the previous room. If there are too many enemies in the current room, you can run back and choose a safer route. However, you might run towards the enemies you have just escaped.</li><li>The alien organisms are fast and always attack first. Do not try to escape and choose a better route too often, as you get a bit weaker every time.</li><li>Listen to the sounds of the signals' impulses. Sometimes it is easier to match the signals' frequencies by sound.</li></ul>\r\nControls:\r\n<ul><li>NUM7: lower frequency of your signal</li><li>NUM8: higher frequency of your signal</li><li>NUM4: lower amplitude of your signal</li><li>NUM5: higher amplitude of your signal</li><li>NUM1: left offset of your signal</li><li>NUM2: right offset of your signal</li><li>W: move your squad top</li><li>A: move your squad left</li><li>S: move your squad bottom</li><li>D: move your squad right</li></ul>", "metacritic": null, "released": "2019-10-03", "tba": false, "updated": "2019-10-04T03:50:30", "background_image": "https://media.rawg.io/media/screenshots/712/71210d5315a84a553c2a0fde467bb45a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lowcase", "Drakir"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}