{"id": 378914, "slug": "brass-brigade", "name": "Brass Brigade", "name_original": "Brass Brigade", "description": "*Note - Brass Brigade is a <strong>SINGLE-PLAYER ONLY</strong> game!<br/><br/>Grab your helmet, lock and load your rifle, and prepare to enlist in the Brass Brigade, an homage to classic WWII action games of yester-year. Inspired by genre staples of the early-to-mid 2000s, Brass Brigade lets you join the nation of your choosing in the world's largest armed conflict. Brass Brigade offers a highly customizable and scalable gameplay experience that lets you enjoy these beautifully cartoony reimaginings of historical battles just the way you want!<h3>Featuring</h3><ul><li><strong>5</strong> historical nations, including the United States, Great Britain, The Soviet Union, Nazi Germany, and The Empire of Japan.<br/></li><li><strong>13</strong> of WWII's most iconic battles across the <strong>Eastern, Western, North-African, and Pacific fronts</strong>!<br/></li><li>Fully customizable number of AI allies &amp; enemies! <strong>Scale the number of bots on each team based on the power of your PC!</strong><br/></li><li>Fully customizable battles! Control the parameters of each battle to create everything from <strong>small skirmishes to all-out warfare</strong>!<br/></li><li>An incredibly diverse and authentic flavoring of WWII weaponry, ranging from M1 rifles to swords and flamethrowers.<br/></li><li><strong>Driveable tanks</strong>, callable air support units, artillery, and a host of other explosive reinforcements at your disposal.</li></ul><br/>Any and all future <strong>updates/content will always be free </strong>for all users! While Brass Brigade is officially V1.0, that doesn't mean development is over. The battle has only just begun...<br/><br/>*Developed by Henry Kucab, 2019.", "metacritic": null, "released": "2019-10-02", "tba": false, "updated": "2019-10-07T03:58:52", "background_image": "https://media.rawg.io/media/screenshots/6b9/6b9aacc9130a384049eab6399270425e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BrassBrigade", "Henry Kucab"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Henry Kucab"], "esrb_rating": null}