{"id": 378993, "slug": "abuela-grillo-fangame", "name": "Abuela Grillo - FanGame", "name_original": "Abuela Grillo - FanGame", "description": "<p>-FAN GAME-FAN GAME-FAN GAME-FAN GAME-FAN GAME-FAN GAME-FAN GAME-FAN GAME-<br/>-ABUELA GRILLO-ABUELA GRILLO-ABUELA GRILLO-ABUELA GRILLO-ABUELA GRILLO-<br/>Este videojuego está basado en el cortometraje de la \"Abuela grillo\" que fué producido en The Animation Workshop en Viborg, Dinamarca, por The Animation Workshop, Nicobis, Escorzo, y la Comunidad de Animadores bolivianos, el cual tiene el apoyo del Gobierno de Dinamarca.<br/>Animado por 8 animadores bolivianos, dirigido por un francès (Denis Chapon), música por la ambasadora de bolivia en Francia, compuesta por  otro francès, un proyecto danès, ayuda de produccion por un mexicano y una alemana. Adaptado de un mito ayoreo.</p>\n<p>El enlace del cortometraje es </p>\n\n<p>Toda la música y los efectos de sonido fueron tomados sin permiso del cortometraje:)<br/>Este video juego NO! tiene fines comerciales.</p>\n<p>El nacimiento de éste videojuego es debido a los sucesos que están pasando en la Amazonia, y a los esfuerzos de https://www.facebook.com/Abuela-Grillo-110637500303383/ por brindar su granito de arena.</p>\n<p>Abuela Grillo - FanGame<br/>Developed by AnimatiX Estudio</p>\n<p>================================================================</p>\n\n<p>This video game is based on the short film \"Grandmother Cricket\" that was produced in The Animation Workshop in Viborg, Denmark, by The Animation Workshop, Nicobis, Escorzo, and the Community of Bolivian Animators, which has the support of the Government of Denmark.</p>\n<p>Abuela Grillo - FanGame<br/>Developed by AnimatiX Estudio</p>", "metacritic": null, "released": "2019-10-02", "tba": false, "updated": "2019-10-04T04:27:18", "background_image": "https://media.rawg.io/media/screenshots/fa8/fa8a553fe06ad6f10145de09be6e6a0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["AnimatiX"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}