{"id": 379156, "slug": "jump-suus", "name": "Jump! (Suus)", "name_original": "Jump! (Suus)", "description": "<p><strong>What is it?</strong><br/></p>\n<p>This game is the first out of 10 in the \"One Game A Week\" Project. The theme for the first week is: jump. So we made a little game where you can..... exactly: jump!</p>\n<p><strong>Is it good?</strong></p>\n<p>Overall this little game isn't too great, but for myself I am very happy with it. I learned a lot! I have never made a platformer before. This was interesting. Also to work with other scripts (provided by Unity) and my own or mixing these. It is all at a very beginner level, but it sure felt great making this. Working with my own assets and assets from the Unity store (which should be clearly visible :') ) was a new and cool experience. Putting my own audio in. All in all I felt a lot of joy making this. The game itself is barely a game: in case you are interested in downloading it. Do as you like. Check it out maybe!</p>\n<p>See you next week.</p>\n<p><strong>Who am I?</strong><br/></p>\n<p>I am a Game Design student enrolled at the University of Europe in Berlin. Currently I am in my third semester and part of the One Game A Week project. My personal focus is to improve my technical skill and confidence and to learn as much as I can either about: Unity, Photoshop, C# scripting, Design, Game Dev Fundamentals, Game Design Fundamentals and Game Art Fundamentals.</p>\n<p>For more information go to: http://gamedesign.ue-germany.de/</p>", "metacritic": null, "released": "2019-10-01", "tba": false, "updated": "2019-10-04T05:11:19", "background_image": "https://media.rawg.io/media/screenshots/cef/cefcd48c4004382b79e10225ae33538e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Suus"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}