{"id": 379132, "slug": "just-another-day-in-death", "name": "Just Another Day in Death", "name_original": "Just Another Day in Death", "description": "<p>To begin my artist’s statement, I would like to disclose what my “What If” statement is, which I ended up creating a mesh of the two following statements: \"What if death happened to be the key to someone's happiness.\" AND \"What if your cat's last life took yours with it?\"\r\n  </p>\n<p> The concept for Ginger’s character came from my own personal experience from being a mid-twenties college student, trying to get away from something. I used my experience with depression to shape and influence the minor actions Ginger does throughout the game, such as isolating herself, not having the energy to go buy groceries, insomnia. I feel like many mid-twenties girls can see a piece of themselves within the character in Ginger, she’s pretty relatable and just like all of us – she wants to be happy and escape her pain.</p>\n<p> I developed Ginger’s want and need in a really weird way I think. Her want is simply to forget her pain and be happy. She doesn’t know how – because running away from her pain wasn’t working, but she didn’t know what else to do because the pain was already so hard despite it all. In the end, she just needed to be accepted for herself: broken, yet good – and then she was able to glimpse what a better “life” she could have if she gave herself a purpose and something else to be doing. Sometimes it takes a REALLY drastic change in one’s life to come out of a depressive fog – and for Ginger it helped her get over her pain and embrace a better, happier “life.”</p>\n<p> There are several decision points throughout the story which influence how the branches interact with the reader. With most choices, Ginger can choose a seemingly ‘happier’ option – such as picking up Gus-Gus (her cat) or not picking him up. It is assumed that picking up Gus-Gus would bring her a slightly higher level of joy and attachment towards Gus-Gus and it influences her choice of words in upcoming passages. In the end, despite Ginger finding some semblance of happiness finally, she is faced to address the pain she felt in the beginning since most of the story she has simply ignored her pain, pushing it further and further down in her subconscious. So with confronting her pain in the end, Ginger is able to move past the denial portion of grief and finally accept her pain as simply a temporary pain and not a constant state of being. Once Ginger does that, she can finally be happy and grow as a person. So in the end, the story really ends up being a metaphor with coping with pain and trying to find a way to be happy, despite the circumstance you've found yourself in and learning to grow from that pain instead of wallowing in the depression.</p>\n<p> I came up with each of the story beats by coming up with the over-arching story and then deciding where I wanted the main points of action, dialog and internal choice to occur. Many of the story beats either weren’t anticipated or were very out of the ordinary as far as reality goes, but that’s the perk of writing fiction based in reality – there are no real set rules for the alternate world you want to build. Some of the story beats were created just for the sake of breaking up a choice, others drive the character to make a decision, like jumping to the window ledge or jumping to the door ledge. These multiple choices and story beats inevitably impact the way the story will be later on in the narrative, based on each of the choices the reader makes.</p>\n<p> If I’m being honest, the most difficult part of coming up with the story was trying to adhere to the constrictions of the class assignment, while still exploring my creative ideas - which I still didn't adhere to entirely because I got so caught up in my story writing (Sorry Dr. S!!). In the end, I’d like to go back to this story and continue writing and developing the characters. The ending isn’t what I wanted and some of the passages were hastily thrown together in order to meet certain requirements, when I actually wanted A LOT more content, interaction or possible choices/branches there. So hopefully after this assignment is graded, I can get back to the creative writing of this story. There’s several outcomes that I’ve set up for the end game, as I’m sure the reader can pick up on the subtle and not-so subtle vibes in the office passages.  </p>\n<p> Honestly, I wanted to align the reader’s concept of grief and pain to help drive the character’s choices throughout the entirety of the narrative, allowing them to discover that sometimes it takes something drastic in order to get passed major life events which impacted their life. I also really wanted the reader to explore the concept of what death could be like for our age - especially when it's no fault of their own or the fault of someone/something they love and care for deeply. I expect my audience to be typically in their 20s to 30s, probably in college or recently graduated or have friends who have been and have had some really intense life events happen since childhood, because that’s just our generation honestly, which will work in favor of the narrative of this story.</p>\n<p> \r\n  </p>\n<p>DISCLAIMERS: NOT MY OWN ARTWORK. DO NOT TAKE. I AM NOT MAKING MONEY OFF OF THIS. \r\n  </p>\n<p>Cat photo: https://dailycatdrawings.tumblr.com/\r\n  </p>\n<p>Balcony is unknown - I've done everything I can to credit this artist and to no avail. If you know drop a comment below please!!!!    </p>\n<p>Ticket is my own creation. It's super simple and dumb, so yeah. Obvi mine lol. </p>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2019-10-04T05:04:48", "background_image": "https://media.rawg.io/media/screenshots/e37/e371cfb6fc55b9a00ede0d8e3be282d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bork Enterprises"], "genres": [], "publishers": [], "esrb_rating": null}