{"id": 379265, "slug": "game-of-luck", "name": "Game of Luck?", "name_original": "Game of Luck?", "description": "<p>The game I have created is called Game of Luck? It's about waking up late for work and trying to get there with many misfortunate things happing in the meantime. The character I \"created\" is you, the person playing it. I wanted it to be as if these horrible things were happing to you personally. It makes you think about how you would act in certain types of situations. You want to get up and get to work on time, but unfortunately you must deal with a list of upsetting events. When it comes down to it, your need is to just get out of the house and go on your daily comment. At one point in the story you feel like giving up, but you decide to push through. I didn't want to give you the option of giving up, because that would make the story boring.</p>\n<p>The difference between the want and need is basically just getting from point 'a' to point 'b'. As I mentioned above, you want to have an easy morning, but you need to get to work on time, despite you waking up 40 minutes late. At first, I was stuck on how to make this more enjoyable. I didn't want it to be a simple you wake up, get ready and head out; I wanted there to be more \"spice\". Everybody wants to have a good day, but sadly life can throw major curve balls and make it to where it's the absolute worst day of your entire life. So, figuring out how to make one of the crappiest days, not so crappy is mainly the want of this game and for the character (you). Even though you really can't make it less crappy, it's fun to see you can try. </p>\n<p>Going back to wanting to make it more intense and fun for the player, I decided it should be a serious of unfortunate events type game. It is easy to make decisions when they’re happy events, if you know there will be a good outcome. When not knowing exactly how things will turn out, because the only options you have are either disgusting or damaging to one's soul (as I like to say), you must really think. I also wanted to make it relatable to those who have been there before. Having too much fun the night before and regretting it the morning after, who hasn’t been there? I want the player to participate in this game as if they had too many margaritas and woke up with the most crushing headache. As you can tell by the title, it’s questioning if this game will be full of luck, then you play it and realize that it is indeed not. </p>\n<p>When you have a game of bad luck, you need paths that are going to be full of bad luck. I didn’t want the options to be ridiculous or not make any sense, they needed to be realistic. I wanted to take the player on a wild morning without making it too extreme that things were almost predictable. </p>\n<p>I would have to say the most difficult thing when coming up with this, was just that. Finding something that would be fun, but also make someone think. I had a long list of options to choose from, but at the last minute I came up with this. Personally, I don’t have the best luck at time, especially when I’m running late. When I sat down to finally write out the paths and how everything would end up in the end, I panicked. Would this be funny enough? Will anyone enjoy it? Does it make any sense? So, I felt like I needed to focus on an audience to begin, and that’s where I was able to find my rhythm. A young adult who had too much fun, needing to get to work on time, while being hungover. Okay, but make that times a million. Once I got going it wasn’t as bad, but then I got down to the end and was like all right, I need to have three options. I don’t want them to be similar, I want them to be completely different and still fit the theme of the game; bad luck. So, coming up with endings that were still misfortunate was a little difficult as well.  </p>\n<p>As I had said before, it’s a young adult waking up feeling like crap, trying to get out of bed and get somewhere. Young adult could be a college student, fresh out of college or someone in the upper 20s and lower 30s. Since you are playing as you, you’re able to make the decision based on how you would handle it in real life; making it much more personal. I had a friend of mine play the finish product and I watched her facial expressions while she was trying to make a choice and that helped me realize that it is very much a thinking game. Throughout the game she was constantly looking surprised as well and at one point she even said that one of the events in the game, happened to her in real life. When she finished the game and received her outcome, she had a look of despair, but in a good way. If that’s possible. Which is exactly what I was going for. </p>\n<p>Overall, I am very proud of this game and the reaction I got from people. I have never created something like this before, so I was worried for the outcome. After having a few people play it and give me feedback, I fixed it and tried to make it better; I believe I did. So, I hope you all enjoy this wonderfully, horrible, game of no luck. Maybe you can relate to a few of the events that take place. Also, to the character (which is you, the one playing it) make sure to really put your thinking cap and brave face on, you’re going to need it.  </p>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2019-10-04T05:39:43", "background_image": "https://media.rawg.io/media/screenshots/767/767261c55dab7c0135026a43bfec4370.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["klipham76"], "genres": [], "publishers": [], "esrb_rating": null}