{"id": 379372, "slug": "adilaga-clash-of-the-legends", "name": "ADILAGA Clash of the Legends", "name_original": "ADILAGA Clash of the Legends", "description": "<p>ADILAGA – Clash of the Legends<br/>Role-Playing Fighting Game<br/>Story and Script by Andry Chang<br/><br/><br/>Game Overview:<br/>A mysterious organization of super villains and supernatural forces caused chaos and terror, mainly in Jakarta, Indonesia. In response, an initiative called ADILAGA Foundation emerged. ADILAGA recruited superheroes, whether they are people chosen by supernatural, legendary or mythical beings or simply altered by freak accidents. Besides that, the foundation also held competitions of superheroes to encourage friendship and cooperation between them.<br/><br/>Sixteen super humans, including semi-deities and semi-devils were pitted together in a great bout, ADILAGA. Who will prevail? Who will fall? Will they survive in each hero’s conflict? Will they stop the evil supernatural organization once and for all? The answers are here in the Great Fight, ADILAGA – Clash of the Legends.<br/><br/>Latest Version: 1.00<br/>Genre: Action / Role Playing Fighting Game<br/>Platform: PC Game<br/>Engine: RPG Maker VX Ace<br/><br/>Important: Compact game downloaders are advised to download RPG Maker VX-Ace RTP (Run-Time Package) and install it anywhere in your computer (or in the Games folder).<br/><br/>Game Features:<br/>1. First-Person Fighting Game with turn-based battle system (standard VX-Ace).<br/>2. Original graphics from characters made and drawn by Andry Chang.<br/>3. Engaging stories per character with story progress per stage. Six stages total per story. Nine stories overall.<br/>4. Use of “original artifacts” as equipments to power-up and customize your hero.<br/>5. Three power levels per character in Story Mode, to ensure all abilities are used.<br/><br/>Characters: (16 total)<br/>Superheroes (Adilaga League):<br/>Cakra, the Crimson Lightning<br/>Varuna, the Aquamarine Knight<br/>Reog, the Blackblood Tempest<br/>Barong, the Eartheart White Lion<br/>Rangda, the Starfire Witch<br/>Dahlia, the Nature Violinist<br/>Solara, the Sun Priestess<br/>Hima, the Frost Efreet<br/>The Stickler, the Persistent Restorator<br/><br/>Super-Villains (Playable for Single Fight Mode):<br/>Singabarong, the Beast Barbarian<br/>Nyi Roro Kidul, the South Sea Queen<br/><br/>Super-Villains (Non-Playable):<br/>Gangren, the Abominable Zombie-Man<br/>Okkult, the Ghost in the Shell<br/>Blakk Jakk, the Ebony Dancer<br/>Artazure, the Azure Dancer<br/>Murca, the Dark King<br/><br/>For more information and updates about ADILAGA – Clash of the Legends, please visit:<br/><br/>ADILAGA (English Version)<br/>http://fireheart-vadis.blogspot.com/2014/03/adilaga-clash-of-legends-game.html<br/><br/>More ADILAGA Stories, short stories, gallery and fun stuff.<br/>http://fantasindo.blogspot.com/search/label/adilaga</p>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2019-10-04T06:12:54", "background_image": "https://media.rawg.io/media/screenshots/a2f/a2fbe8e98dcef2f424fa96e21babee10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evernade"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}