{"id": 379373, "slug": "meditation-breath-of-the-five-elements", "name": "Meditation: Breath of the Five Elements", "name_original": "Meditation: Breath of the Five Elements", "description": "<p>„Medytacja” jest gra inspirowana tradycyjna technika<br/>pranajamy - technika panowania nad oddechem<br/>praktykowana przez joginów. Według nich,<br/>spowalniajac oddech, jogin może z pełna świadomością<br/>wniknąć w pewne stany świadomości, które<br/>podczas zwykłego czuwania są dla świadomości<br/>niedostępne, np. w stan marzeń sennych.<br/>Jednym z ćwiczeń pranajamy jest tzw. oddech<br/>pięciu żywiołów oparty na koncepcji 5 żywiołów w<br/>sufickiej praktyce medytacyjnej: ziemi, wody,<br/>ognia, powietrza i eteru. Każdy z nich symbolizuje<br/>inne cechy i właściwości, takie jak stabilność,<br/>zmienność, energia, kreatywność, zrozumienie.<br/>Projektując grę starałam się przekazać idee pranajamy<br/>w sposób czytelny dla osób nie mających<br/>wcześniej styczności z ta technika, pomóc w wizualizacji<br/>żywiołów i pokazać, jak można wykonywać<br/>to ćwiczenie.<br/>Styl graficzny jest wynikiem próby przedstawienia<br/>żywiołów w sposób jednocześnie ornamentalny,<br/>jak i lekki i uproszczony. Wszystkie plansze były<br/>wykonane w technice sitodruku, skanowane i poddane<br/>obróbce cyfrowej, wzbogacone o efekty.<br/>Animacja postaci jest odbita za pomocą offsetu.</p>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2019-10-04T06:13:10", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e837cc10d7f7140abe35055a9bf273e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunatic Dancer"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}