{"id": 379479, "slug": "the-bloodline", "name": "The Bloodline", "name_original": "The Bloodline", "description": "The Bloodline is a fantasy action RPG where you take the role of a descendant of the Harbinger Bloodline. A lineage that was gifted the power of foresight when an ancient god gifted them his own blood. The god had visions of the future and saw nearly endless invasions of The Unforgiven, and that they were destined to defeat the Harbinger and overthrow the land of Eudros, eventually. <br/><br/>After 7 centuries of no invasions of The Unforgiven, they have faded into myth and legend along with the Harbinger Bloodline. The game begins with you having visions of another invasion. It is your calling to unite the land and regain the respect of your ancient Bloodline. Reform bonds between kingdoms, recruit your own army, rebuild your stronghold, and prepare for the return of The Unforgiven. <br/><br/><ul><li>Do quests to gain the respect of the commoners, lords, and kings.</li></ul><ul><li>Customize your character with hundreds of different types of armor.</li></ul><br/><ul><li>Participate in massive battles using melee or ranged weapons, magic and even siege machines.</li></ul><br/><ul><li>Create an extremely personalized class that you create through a vast, branching skill tree.</li></ul><ul><li>Recruit specialists from across the land to aid you in your fight.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2024-02-23T19:25:43", "background_image": "https://media.rawg.io/media/screenshots/2be/2be8efe483809eb6a0b742e24fb1f740.jpg", "website": "https://twitter.com/ShieldBearerDev", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 6, "toplay": 3, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Shieldbearer Studios"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Shieldbearer Studios"], "esrb_rating": null}