{"id": 379453, "slug": "the-walking-dead-saints-sinners", "name": "The Walking Dead: Saints & Sinners", "name_original": "The Walking Dead: Saints & Sinners", "description": "<p>LIVE The Walking DeadSaints &amp; Sinners is a game unlike any other in The Walking Dead universe. Every challenge you face and decision you make is driven by YOU. Fight the undead, scavenge through the flooded ruins of New Orleans, and face gut-wrenching choices for you and the other survivors. Live The Walking Dead&#39;s dark drama in your own skin.​Survive YOUR WayA new way to live survival horror. With the living, dead, disease and famine as constant threats, you have countless ways to tackle these dangers.<br />\nFace the undead guns blazing or learn all the ways to sneak and hide among them. Take on missions from different factions and survivors to earn valuable resources. Risk life and limb to protect those in need or brutally murder anyone who stands in your way. See how your choices affect the people of New Orleans, and learn to live with the consequences. A New, Brutal StoryNew Orleans is at war. The living are not just fighting the dead, but also inflicting pain and brutality upon each other. As bodies pile up between warring factions, whispers spread of a long-lost mystery in the city that could turn the tide of the war. Will you try to court favor with the factions, or play them against each other for personal gain? Can you unravel the mystery that is behind it all? The fate of the city and its survivors rests in your hands.​A Vast World To Explore in VRCrafting, exploration, freedom of choice and visceral combat make this a deep, 15+ hour game built for VR.<br />\nCut down both the dead and the living with an arsenal of melee, ranged and makeshift weapons, all physics-based objects you can realistically wield. Knock walker heads clear off and rip out weapons impaled in their skulls. Creep through ruined streets and creole mansions to scavenge for supplies and secrets. Scale the sides of buildings, cars, and walls to ambush enemies from above or make a quick escape.</p>", "metacritic": 80, "released": "2020-01-23", "tba": false, "updated": "2024-03-17T12:12:28", "background_image": "https://media.rawg.io/media/games/645/645a25441b6559e2850cc5731dbde551.jpg", "website": "https://vrwalkingdead.com/", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 55, "owned": 728, "beaten": 21, "toplay": 62, "dropped": 39, "playing": 17}, "playtime": 2, "achievements_count": 147, "ratings_count": 65, "suggestions_count": 784, "game_series_count": 1, "reviews_count": 64, "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "developers": ["Skydance Interactive"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Skydance Interactive"], "esrb_rating": "Mature"}