{"id": 379400, "slug": "xxconnexx", "name": "xXconneXx", "name_original": "xXconneXx", "description": "<p>This was an extremely short, simple prototype for OpenJam 2019. This was my first game jam, so it is largely incomplete. I was not able to get as much done as I had hoped, but the core concept is there. One grid of hexes with one color.</p>\n<p>Click on the white, empty hexes to place a colored dot within them. Create a connection between the hexes containing an X!</p>\n<p>Future additions may include more puzzles with more colors and bigger grids, background music, menus, and an editor to create your own levels.</p>\n<p>As part of OpenJam, participants were encouraged to use open source tools. I used Godot and Aseprite in the making of this prototype.</p>\n<p>GitHub Repository: https://github.com/AlexABallWebDev/xXconneXx</p>\n<p>License (also present in the repository):</p>\n<p>MIT License</p>\n\n<p>Permission is hereby granted, free of charge, to any person obtaining a copy<br/>of this software and associated documentation files (the \"Software\"), to deal<br/>in the Software without restriction, including without limitation the rights<br/>to use, copy, modify, merge, publish, distribute, sublicense, and/or sell<br/>copies of the Software, and to permit persons to whom the Software is<br/>furnished to do so, subject to the following conditions:</p>\n<p>The above copyright notice and this permission notice shall be included in all<br/>copies or substantial portions of the Software.</p>\n<p>THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2019-10-04T06:19:05", "background_image": "https://media.rawg.io/media/screenshots/103/103303e2d9a7e2c7349237bec9e82b2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["halfstache"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}