{"id": 379475, "slug": "fear-the-dark-unknown", "name": "Fear the Dark Unknown", "name_original": "Fear the Dark Unknown", "description": "<p>&quot;It is said that our worst fears come from within. But... What if there were a greater fear than we are capable of conceiving? What if that terror were much closer than we think? Suffering is the only way. Fear is a necessary evil.&quot;<br />\nWhat kind of curse does the Beresford mansion keep inside? For 200 years its inhabitants have suffered the consequences of an unknown shadow, a dark being who walks among us, and whose existence extends beyond what we imagine.<br />\nNow James and Chloe will face the ultimate test of their lives. They will know the true horror. The suffering of a father. The despair of a daughter. The clock is ticking and the survival game can no longer be stopped.<br />\nFear the Dark Unknown transports you to the great survival horror classics of the 90&#39;s, handling either of its two protagonists with a fixed camera system that enhances the feeling of being immense in a true horror movie. Face a multitude of challenges, certain deaths and enemies of various kinds that will force you not to waste a bullet, use carefully the health kits, hide or even flee from them. All mixed with a wealth of puzzles, integrated into the story, which will allow you to learn more details of the Beresford mansion and the Unknown Dark.<br />\nKey features:<br />\n- Experience two totally different adventures driving James Sullivan or his daughter Chloe.<br />\n- Choose between your four weapons and don&#39;t waste a bullet. Survival is your main goal, and it&#39;s not easy.<br />\n- Thoroughly examine every room. You never know where you are going to find that object that will give you the key to continue your adventure.<br />\n- Discover the Beresford mansion and its inhabitants throughout its 200 years of life. You can visit it at different times, and remember that to find out all its secrets is to know yourself.</p>", "metacritic": null, "released": "2019-10-31", "tba": false, "updated": "2023-02-28T15:13:21", "background_image": "https://media.rawg.io/media/screenshots/cd0/cd0fb79ffe41ef977ade441339644aa5.jpg", "website": "https://www.darkunknowngame.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 10, "toplay": 3, "dropped": 5}, "playtime": 5, "achievements_count": 20, "ratings_count": 4, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Dreamlight Games Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Dreamlight Games Studios"], "esrb_rating": null}