{"id": 379445, "slug": "charlie-blasts-territory", "name": "Charlie Blast's Territory", "name_original": "Charlie Blast's Territory", "description": "<p>The Bombing Islands (The Bombing Islands: Kid Klown&#39;s Craze Puzzle ボンビンアイランド キッドクラウンのクレイジーパズル (Bonbin Airendo Kido Kuraun no Kreiji Pazuru) in Japan) is a puzzle video game developed and published by Kemco for the PlayStation. It was later re-released for Nintendo 64 in North America on April 30, 1999, and in Europe on June 18, 1999. A cell phone game named &quot;The Bombing Island&quot; was also released in 2003 by Kemco, but with graphics from the game Bombuzal with the main character changed to Kid Clown.</p>\n<p>In the PlayStation versions of the game, the main character is Kid Clown, from the earlier Kid Klown series of video games. He is given a message from the King Clown to rid the planet of the bombs on all six continents.<br />\nIn the Nintendo 64 (N64) version, the hero is Charlie Blast, a demolition expert. His job is to clear the six rivers that have been dammed by the evil &#39;King of Industry&#39;. The game was independently re-developed for the Nintendo 64 by Realtime Associates, and game designer Scott Kim. In the early days of the games production it was titled &quot;Charlie Blast&#39;s Challenge&quot;. Besides changing the graphics, a four-player versus mode was also added wherein players can control Charlie or one of three other characters and must conquer as much of the land as possible with one&#39;s own bomb blasts. The multiplayer mode includes several bombs not featured in the main solo mode, like a freeze bomb, which when lit, will encase the other player(s) in blocks of ice, and a rainbow bomb, which is capable of exploding an entire row or column that the bomb is facing.</p>", "metacritic": null, "released": "1999-04-30", "tba": false, "updated": "2019-10-05T22:21:12", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo 64"], "developers": ["Realtime Associates"], "genres": ["Puzzle"], "publishers": ["KEMCO"], "esrb_rating": null}