{"id": 379460, "slug": "zoria-age-of-shattering", "name": "Zoria: Age of Shattering", "name_original": "Zoria: Age of Shattering", "description": "<strong>STORY</strong><br/>Zoria. Home. Mother of all her inhabitants. She provides her children with food to grow, shelter to rest in and also, the harsh lessons of life, so her offspring may learn to fight and protect her gifts to them. <br/>But men, men wanted more. <br/><br/>Zoria’s finest sons and daughters: intelligent, resourceful… violent. Men turned her ores into sword and daggers, and her roots into vile concoctions of poison. <br/><br/>Men wanted more. They craved more land and more food. So they built their homes of stone and wood, driving out the wildlife of its woods and caves. And in those caves they found their instrument of defiance: zerrium. <br/><br/><br/><br/><strong>GAMEPLAY</strong><br/>Zoria’s Gameplay is a unique mix of action-adventure RPG and tactical management. Explore the beautiful lands of Zoria, from mountains to the ocean, towns and dungeons, follow the story or discover its secrets. <br/><br/><br/><br/>Your outpost is your base, by expanding it you get access to better facilities and the ability to influence more of the world around you while leveling your followers gives you the ability to explore deeper, further into the unknown.<br/><br/><br/><br/><strong>ADVENTURES</strong><br/>All the adventures in the game are hand-crafted, with multiple paths and various options for exploration, depending on the setup of your party and their environment abilities. You can always revisit a dungeon with another party to see previously inaccessible places and finish all the side quests.<br/><br/><br/><br/><strong>CHARACTERS</strong><br/>You can choose your party from eight different classes, each with a unique skill set both in combat and exploring the world. Magic, ranged attacks, shear power, blocks and stuns, bleed and poisons, magic resistances - all there to explore, use and upgrade.<br/><br/><br/><br/><strong>FEATURES:</strong><br/>•\t<strong>Explore a rich, immersive and diverse world:</strong> beautifully crafted environments, featuring dense forests, haunting dungeons, golden deserts and many more.<br/>•\t<strong>An epic story</strong> driving your experience, with rich and expansive lore. Discover the hidden tales and stories that live on through the people of Zoria and your own companions;<br/>•\t<strong>Plan your moves or just enjoy the ride</strong> - a game experience suited both for players eager to just explore and adventure, as well as for those who want a challenging combat with a strong emphasis on strategic thinking and planning. <br/>•\t<strong>Easy to learn crafting system</strong> with dozens of <strong>unique potions, epic weapons</strong> and other curious recipes that can be found throughout the world.<br/>•\t<strong>Elaborate character management:</strong> class and character upgrade system, unique skills both in combat, and during exploration. A wide array of character builds for each class will allow you to approach an encounter in your own way.<br/>•\t<strong>Complex base management:</strong> build new facilities, upgrade buildings, manage resources and expand your base;", "metacritic": null, "released": "2020-03-12", "tba": false, "updated": "2020-09-11T19:21:28", "background_image": "https://media.rawg.io/media/screenshots/89f/89fbc8ba764db32674540ea758891b18.jpg", "website": "https://www.zoriagame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 4, "toplay": 8, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 557, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["Tiny Trinket Games", "TinyTrinket"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Tiny Trinket Games"], "esrb_rating": null}