{"id": 379588, "slug": "lolitower", "name": "LoliTower", "name_original": "LoliTower", "description": "在于塔顶的鬼王同归于尽后，发觉鬼王并没有彻底死亡<br/>\r\n不甘心的鬼狩缘一<br/>\r\n被天使复活并赋予五天生命<br/>\r\n这最后不断衰弱的五天时间<br/>\r\n他将引领天才养女鬼狩无一姬成为最强的鬼猎者<br/>\r\n弥留之际的终焉养成物语就此开幕<br/>\r\n舍弃明天燃尽自己<br/>\r\n也要完成传承<br/>\n<br/>\r\n人设<br/>\r\n鬼狩缘一<br/>\r\n经历：终其一生都在为消灭塔顶的鬼王苦练剑技。虽然自身有很高的武学造诣但实际上不擅长教导别人，早年自己手下的弟子非死既残。<br/>\r\n28岁时救下无一姬并一直抚养成人，震惊于无一姬深不可测的潜能和高度敏捷的身手，但为了避免她遇到危险一直不让她参与实战，并谎称无一姬的无是无才能的无。生活上对她极为溺爱。<br/>\r\n年龄：36<br/>\r\n性格：热情、开朗、奔放，富有同情心和正义感<br/>\r\n关系：无一姬的义父<br/>\n<br/>\r\n鬼狩无一姬<br/>\r\n经历：8岁以前一直和狼群生活在一起，孤儿。一次失足跌落悬崖后奄奄一息的无一姬被缘一救起并被收为养女赋予名字。在缘一没有指导剑术的情况下自创“霞之吐息”流派一至七型并锻炼到极高境界。<br/>\r\n年龄：16<br/>\r\n性格：冷静、无表情、不擅流露情感，外表冰冷但内心丰富<br/>\r\n关系：鬼狩缘一的养女<br/>\n<br/>\r\n鬼王<br/>\r\n存活于世间超过400年的鬼王，实力强劲且惜才如命。<br/>\r\n兴趣爱好是劝诱实力强劲的人类主动饮下到自己的血，变身为鬼获得永生和超强的自愈能力，以便能和自己一直切磋武功。<br/>\r\n性格：热情、疯狂、富有同情心<br/>\n<br/>\r\n天使<br/>\r\n在天堂中一直欣赏着缘一的战斗英姿。梦想是缘一死后能将其召入天堂一起生活。<br/>\r\n缘一死后冒着暴露后被拔光羽毛的风险为他注入了5天的最后寿命将其复活。<br/>\r\n性格：恩慈、善良、温柔<br/>\n<br/>\n<br/>\r\n游戏玩法为跳过战斗过程的魔塔类RPG，在多达120层的精心设计的魔塔地图中，男女主将通过精妙的配合切换，用精湛的战技和疾风般的刀法斩断重重阻碍，与宿敌会师塔顶展开死斗。<br/>\n<br/>\r\nThe ghost king on the top of the tower died together, and found that the ghost king was not completely dead<br/>\r\nUnwilling ghost pursuit one<br/>\r\nWas resurrected by an angel and given five days of life<br/>\r\nThis last five days of decline<br/>\r\nHe will lead the genius to raise a female ghost hunting no ji to become the strongest ghost hunter<br/>\r\nThe end of the dying how to develop the story of this opening<br/>\r\nAbandon tomorrow and burn yourself<br/>\r\nWe should also complete the inheritance<br/>\r\nA person<br/>\r\nGhost inaugural a fate<br/>\r\nExperience: all his life in order to eliminate the tower of the ghost king hard practice sword skills.Although oneself have very high martial arts attainments but in fact is not good at teaching others, in the early years of his disciples die and disability.<br/>\r\n  at the age of 28 saved no ji and has been raised, shocked by no ji unfathomable potential and highly agile skill, but in order to avoid her encounter danger has not let her participate in the actual combat, and lied that no ji is no talent no.Life coddled her.<br/>\r\nAge: 36<br/>\r\nPersonality: enthusiastic, cheerful, unrestrained, full of compassion and a sense of justice<br/>\r\nRelationship: none of ji's adoptive fathers<br/>\r\nAll the ghosts are gone<br/>\r\nExperience: lived with wolves until age 8, orphaned.  a lost step after falling off a cliff dying of no ji was saved by a margin and was adopted as a daughter given a name.Without the instruction of jianshu, we created the \"breath of xia\" genre from type 1 to type 7 and developed it to a high level.<br/>\r\nAge: 16<br/>\r\nPersonality: calm, expressionless, not good at showing emotion, cold appearance but rich heart<br/>\r\nRelationship: the adopted daughter of kariuchi<br/>\r\nThe prince of the devils<br/>\r\nThe ghost king, who has lived on earth for more than 400 years, is strong and precious.<br/>\r\nMy hobby is to induce strong human beings to drink their own blood, become a ghost to obtain immortality and super self-healing ability, so that I can always play kung fu with myself.<br/>\r\nPersonality: passionate, crazy, compassionate<br/>\r\nThe angel<br/>\r\nIn heaven has been enjoying the edge of a battle heroic posture.The dream is to be called to live together in heaven after death.<br/>\r\nThe risk of being exposed and stripped of his feathers after his death gave him five days of final life to bring him back to life.<br/>\r\nCharacter: kindness, kindness, gentleness<br/>\r\nThe game is played to skip the battle process of the magic tower RPG, up to 120 layers of carefully designed map of the magic tower, the men and women will be through exquisite cooperation switch, with superb fighting skills and the wind like knife cut through the heavy obstacles, and the enemy division tower top launched a fight.", "metacritic": null, "released": "2019-10-23", "tba": false, "updated": "2019-10-07T04:04:31", "background_image": "https://media.rawg.io/media/screenshots/4a3/4a31246435d67757351a6e0297d74851.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["王方良"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["0Cube"], "esrb_rating": null}