{"id": 379559, "slug": "bighardsun", "name": "BIGHARDSUN", "name_original": "BIGHARDSUN", "description": "BIGHARDSUN is a turn-based strategy with survival elements. Get or exchange resources, construct buildings, and watch your people’s fatigue levels not to let them die. Every day random events that require your attention take place. Over time, crushing storms begin, and you have to prepare for each one.<br/><br/>DO EVERYTHING TO SURVIVE<br/><br/>When the Old King died, an enemy invaded the country. You, the captain of the Royal Guard, were among those who decided to fight. And you lost. They saved your life but exiled you to the edge of the world. Now, this is your home. Take command of people living in the abandoned castle on the edge of the desert. Build relationships and help them survive in these harsh conditions. Unravel the mysterious past of the Old Man, the oldest dweller of the castle. Accept or give battle to your destiny under the sultry sun of the hottest summer in history.<br/><br/>CONTROL RESOURCES<br/><br/>Survival in the desert requires organization and attention. Don’t let food and water come to an end - without them, only death awaits you. Upgrade buildings, reduce rations, send caravans with goods to exchange - do everything to survive!<br/><br/><br/><br/>SAVE STRENGTH<br/>Don’t let people exhaust themselves or stop trusting you. The people here are harsh, just like the desert. If your energy drops to zero, you will get killed. If people stop trusting you, they will start stealing resources for their survival. Construct buildings where they can rest and give people days off. Do not let this story end too quickly.<br/><br/><br/><br/>BE READY FOR EVERYTHING<br/>The desert is a dangerous and a strange place. Only cold-blooded and patient one can survive here. Each turn, you will have to make tough choices and bear the blows of fate. There are dozens upon dozens of random events that occur at the beginning of each turn.<br/><br/>THINK SEVERAL MOVES AHEAD<br/><br/>Your plans will often be overset, but without them, you can not survive. When resources are scarce, you have to decide what to improve in the first place, sacrificing everything else.<br/><br/>IT ONLY GETS WORSE<br/>No matter how persistent and wise a commander you are, you can never change one thing. Nature. The weather is changing, and in your case, not for the better. Get ready to face crushing thunderstorms and protracted droughts, deadly storms, and gluttonous locusts. Each event requires its approach and preparation. And may the gods have mercy on you!<br/><br/><br/>", "metacritic": null, "released": "2019-10-31", "tba": false, "updated": "2019-10-07T03:45:29", "background_image": "https://media.rawg.io/media/screenshots/5a3/5a396976ff68ef28244c95cbae5d1524.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pavel Smushkovich"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Pavel Smushkovich"], "esrb_rating": null}