{"id": 379569, "slug": "endless-memories", "name": "Endless Memories", "name_original": "Endless Memories", "description": "<p>Within the world of dreams you have the task of awakening all sleeping consciences, and to confront the ascended masters face to face.<br />\nEndless Memories is an epic 2D action-adventure set in the magical world of dreams. Within each dream, you&#39;ll explore incredible scenarios with its own story full of challenges, monsters and mysteries to solve.<br />\nFeatures<br />\nClassic side-scrolling action, with all the modern technology.<br />\nTightly tuned 2D controls. Jump, dash and slash your way through even the most deadly challenges.<br />\nExplore a vast interconnected world within each dream; from a dark cave to a killer toy factory.<br />\nEvolve with powerful new skills and weapons: get magic spells, become a deadly mage. Use long-range weapons to clear your way from the distance. Dash forward in a blazing flash and blast foes with all kinds of weapons! Axes, Maces, Swords, Daggers, and many more, to create your own unique play-style.<br />\nMemory Runes: Equip memory runes that offer new powers and passive abilities. Choose and combine your favorites and make your journey unique!<br />\nAncient Glyphs: Gain new abilities with ancient glyphs , that will improve your combat and open your path to new areas and secrets.<br />\nAn enormous cast of characters, all with a different story.<br />\nOver 250 enemies! 30+ epic bosses! Face ferocious monster and vanquish ancient dream masters on your quest through the dream world. Discover the secrets that each one keeps.<br />\nBeautiful handmade landscapes, with detailed parallax that give a unique sense of depth to a side-on world.<br />\nUnlock new areas within the laboratory of dreams, to reap improvements and craft weapons and runes.<br />\nSolve different trials and puzzles to get unique treasures.<br />\nDiscover unique game modes in different dreams where you can go back and spend time on different activities like battle arenas, plant cultivation, trials and many more.</p>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-09-30T14:35:30", "background_image": "https://media.rawg.io/media/screenshots/a22/a220b5311f1cc7587328b0ceea2802f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 58, "ratings_count": 1, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Homunculus Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Homunculus Games"], "esrb_rating": null}