{"id": 379543, "slug": "friends-for-the-apocalypse", "name": "Friends For The Apocalypse", "name_original": "Friends For The Apocalypse", "description": "Inspired by games like Smash TV and UBERMOSH. FFTA is a top-down action arena zombie survival base defense game. Control both man and dog as you work together to survive on a zombie infested procedural island.<br/><br/><br/><br/><ul><li>Survive alongside your trusty K-9, hotswapping between both characters.<br/></li><li>Utilize different tools and weapons including your shotgun, assault rifle, sniper rifle, flamethrower and even bear traps.<br/></li><li>Command your loyal pet to sit, stay, speak and attack. Command your loyal human to run, gun and craft!<br/></li><li>Randomly generating map elements mix up combat on every run.<br/></li><li>Slow down time to increase reaction speed or just get out of a bad situation.<br/></li><li>Manage your campsite, upgrade your skills and keep your dog happy!<br/></li><li>Survive as long as you can and upload your score to see how you rank on the Steam Leaderboards.</li></ul><br/><br/><br/><ul><li>Handcrafted pixel art with a retro SNES feel.<br/></li><li>Original 8-bit chip tune soundtrack.<br/></li><li>Compete competitively worldwide on the Steam Leaderboards.<br/></li><li>Compete casually locally with Steam Cloud stats.<br/></li><li>Integrated indie dev support!</li></ul><br/>Thank you for your support! All purchases and donations go directly towards funding future projects. Feel free to add any comments or suggestions in our forums.<br/><br/>~BrainChocolate", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-07T03:36:53", "background_image": "https://media.rawg.io/media/screenshots/6bf/6bf90ebc751a9c3b8c3cf67595df0812.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BrainChocolate"], "genres": ["Action", "Indie"], "publishers": ["BrainChocolate"], "esrb_rating": null}