{"id": 379549, "slug": "total-seclusion", "name": "Total Seclusion", "name_original": "Total Seclusion", "description": "Meet Roy,  a shipwrecked survivor down on his luck in the middle of an ocean. <br/>Equipped with his skills from the Navy and mysterious chest he found, he has to defend himself from waves of ferocious sharks trying to destroy his raft.<br/>Scavenge, build, craft and upgrade weapons but most importantly, defend your raft!<br/><br/><br/><strong> Current Features   </strong>:     <br/>    •  <strong> Defend! </strong> - The biggest raft you can for up to 20 waves or crank up the difficulty in challenger mode <br/>    •<strong> Build!</strong> -  Use wood, stone and metal to build the ultimate raft. Each material has a different effect on the sharks<br/>    • <strong> Day/night cycle and dynamic weather change! </strong> - Weather affects the enemy attacks. It is difficult to see them in the fog, they more powerful at night and faster during the rain.<br/>    • <strong>Craft Craft Craft!</strong> - From arrows to metal spikes, and other items to defend your raft <br/>    • <strong>Weapons galore!</strong> - Inspired weapons from the 1950's such as the Sten gun and the Stielhandgranate<br/>    •<strong> Compete with each other!</strong> - The bigger your raft after each wave, the higher your score will be on the leaderboard<br/>    •<strong> Explore and Scavenge!</strong> - Explore the sea for money or find items to build your raft<br/>    •<strong> Upgrades!</strong> -  Take a chance on spin the wheel for bonus items or use power ups for a quick boost.<br/>    • <strong>Radio!</strong> - Listen to radio to hear the news of Roy's disappearance or switch to the vintage classics.<br/>    • <strong>Customise!</strong> - Paint your raft in any colour you want.", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-07T03:39:54", "background_image": "https://media.rawg.io/media/screenshots/b99/b9991378298275f2456fa9b69c836da1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Worldgame entertainment"], "genres": ["Action", "Indie"], "publishers": ["Worldgame entertainment"], "esrb_rating": null}