{"id": 379592, "slug": "detective-jackie-mystic-case", "name": "Detective Jackie - Mystic Case", "name_original": "Detective Jackie - Mystic Case", "description": "A mythological painting holds ominous secrets. Only by diving into the details can Detective Jackie solve a young girl's murder!<br/><br/>Ask the right questions and follow the clues to uncover a maze of winding answers and possibilities. Ask yourself: Do you believe in myths?<br/><br/>Detective Jackie - Mystic Case introduces talented private investigator Jackie Johnson in an all-new GameHouse Original Story. After losing her daughter to a devastating fire, Jackie dedicates her life to solving children's murders and disappearances. But a puzzling new investigation lands too close to home, and Jackie is determined to find answers!<br/> <br/>Can a new trail of clues solve a tragedy in the past? The evidence points in one direction: a mysterious painting known as \"Medusa's Vanity\".<br/> <br/>What secrets lie just beneath the surface?<br/>Can Jackie deduce the connections between reality and mythology?<br/> <br/>Only a stone-cold investigator will be able to uncover the truth! Use your power of observation to determine the correct course for your investigation. Do you have what it takes to get down to the bottom of this ominous mystery?<br/> <br/>🔎 Solve a thrilling <strong>murder mystery</strong> of mythological proportions<br/>🔎 Use your <strong>detective's instincts</strong> to follow the trail of clues<br/>🔎 Play <strong>60 story levels</strong> and infiltrate 8 exciting locations<br/>🔎 Interview <strong>suspects</strong> and determine whether they're lying or telling the truth<br/>🔎 Master Jackie's skills through <strong>6 minigames</strong> including chemical analysis, symbology study, cold reading, object analysis, listening, and scent search<br/>🔎 Discover ancient <strong>secrets</strong> hidden within priceless artifacts<br/>🔎 Harness the power of a <strong>mysterious ring</strong> and unlock all new abilities<br/>🔎 Prove your skills and <strong>unlock 30 achievements</strong> worthy of an eagle-eyed investigator", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-07T04:06:51", "background_image": "https://media.rawg.io/media/screenshots/db5/db5c2fe1901c27b59042ccd07bd9b3a7.jpg", "website": "https://www.gamehouseoriginalstories.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 3, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["GameHouse", "Old Skull Games"], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["Gamehouse"], "esrb_rating": null}