{"id": 379593, "slug": "isles-of-adalar", "name": "Isles of Adalar", "name_original": "Isles of Adalar", "description": "<strong>MULTIPLAYER</strong><br/>We've always wanted to experience this style of RPG with a few friends. With that in mind, Isles of Adalar will support up to four player co-op on release. However, we know multiplayer isn't for everyone so we will manually scale the difficulty of every encounter to keep the integrity of the single player game design. <br/><br/><br/><strong>MOD SUPPORT</strong><br/>Our vision is for Isles of Adalar to become known over time as a nearly endless RPG experience rich with narrative driven content. With this in mind we've designed our game to support mods and user generated content from the very beginning. Everything that exists in game is created using the same level editor that ships inside the game, so the modders have access to all the tools we use ourselves to create campaigns. <br/><br/>Just shipping tools for modding is not enough to realize our vision. We are going to be actively working to build up a creative community around our game. This starts with making tools as user friendly and efficient to use as possible so that small teams of only a handful of people can make large scale campaigns. But in addition to the tools we will also be giving players extra content that is not used in the base game so that their campaigns can feel unique. This will range from environmental biomes, to different styles of architecture and even new enemies.<br/><br/><strong>ROLE PLAYING AND REPLAYABILITY</strong><br/>Choice and consequence is at the core of our dialogue system. We use a hybrid (mostly) text based system that features non specific voice lines for NPCs. This allows us to have in depth dialogue with the characters in the world but also gives the player necessary feedback to reflect the NPC's general attitude and response to the player. For example, you may try to intimidate a bandit and if you fail the speech check you may get a voiced response saying something like \"I won't stand for this!\" but the text can be more in depth and context specific.<br/><br/>Instead of using a speech skill to determine dialogue choices and persuasion success, the player can assign multiple personality traits to their character and these traits will give unique responses. The success or failure of a persuasion attempt is determined by both the player character's level and if a specific type of persuasion logically makes sense in the context of the situation.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-07T04:07:17", "background_image": "https://media.rawg.io/media/screenshots/f8d/f8d05f5d83cc419ca855b95745ad31bc.jpg", "website": "https://www.peakwaysoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 5, "toplay": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Peakway Software"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Peakway Software"], "esrb_rating": null}