{"id": 379782, "slug": "road-rampage-cars-games-fight", "name": "Road Rampage: Cars Games Fight", "name_original": "Road Rampage: Cars Games Fight", "description": "DRIVE BY YOUR HEART<br/><br/>Let's join extremely exciting and adventurous racing with Road Rampage: Racing &amp; Shooting in Car Games Free.<br/><br/>FREE TO SELECT THE FASTEST AND MOST POWERFUL OF YOUR DESIRED RACE CAR<br/><br/>Stock your garage with the real-world cars you’ve always wanted, from top manufacturers such more. Then trick them out with the hottest customization system on mobile: <br/>• 50+ exotic cars to collect and upgrade.<br/>• 10 unique &amp; powerful UAVs.<br/>• Game-changing vehicle transformations to rain destruction on your rivals: Nitro, Rep boost, Taion, Magnetic Field,...<br/>• More gear and gadgets and riot...<br/><br/><br/>Select your fastest vehicle and most powerful weapon to clear all the barriers on the street, fight with the most fierce and cruel wanted man. Race like lights and fight for survival. <br/><br/>Never back down as you race anyone crazy enough to take you on, leave them gaped, and increase your rep. You can fight and deeply enjoy the fire and high-speed racing adventure roads, the cars are well-designed and equipped with full of weapons. <br/><br/>A CONSOLE EXPERIENCE ON YOUR HAND<br/><br/>The Game uses the high-tech physical effects which brings a surreal feel to your touch and move at the fingertips.<br/><br/>BECOME A LEGEND OF ROADRAMPAGE<br/><br/><br/>Expertise your speed, show the ingenuity in avoiding, destroying the obstacles, fight and kill the Boss and become a Legend of the Street.<br/><br/>Shoot, shoot, shoot! Join efforts with your friends to overcome the common foe.<br/><br/>AND MORE<br/>Please note that Road Rampage is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases. You can play Road Rampage offline but a network connection is required for in-app purchases and League Promotion.<br/><br/>-----------------------------------------------------------------------------------<br/>Follow us on Facebook to get info about upcoming Road Rampage changes:<br/><br/>Facebook: https://www.facebook.com/RoadRAMPAGE<br/><br/>Thank you very much!", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2019-10-07T05:33:54", "background_image": "https://media.rawg.io/media/screenshots/631/6310d2cbb34c297a27854d501cab5099_cdNbXa7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ROCKET GO GLOBAL PTE"], "genres": ["Action", "Casual"], "publishers": ["ROCKET GO GLOBAL PTE"], "esrb_rating": "Everyone 10+"}