{"id": 3797, "slug": "robot-rescue-revolution", "name": "Robot Rescue Revolution", "name_original": "Robot Rescue Revolution", "description": "<strong>EVERY SINGLE ROBOT SHARES LINKED CONTROLS!</strong><br/><br/>Dodge flamers breathing scorching fires and deactivate paralyzing Tesla machines as you guide wacky robots trapped in treacherous labyrinths to the exit! Plan every escape with precision and execute each action with cautiousness as the synchronized movement of the robots hinders a simple plan! Unravel over 100 levels of challenging robotic fun in this unique and quirky puzzler! <br/><br/><strong>COMPETE OR CO-OPERATE WITH BUDDIES</strong><br/><br/>Join forces with a buddy and use each other’s robots to help one another escape from these obstacle-ridden mazes in Co-op Mode! Be careful! As soon as one robot goes astray it’s GAME OVER for the both of you! <br/><br/>And if you're feeling a little competitive, then take the logic battle to a whole new level and fight it out to the finish line in Compete Mode! Race on two identical but separate maps and test each other’s quick-thinking skills to see whose robots will escape the maze first all in one piece! <br/><br/><strong>UNLEASH YOUR CREATIVITY</strong><br/><br/><br/><br/>Step into the shoes of the developers and become the brain behind the puzzles with the additional feature of Map Editor. Utilize all elements and objects, select from different worlds and then upload your master creations online to share with the rest of the Robot Rescue community for even more puzzles to crack! <br/><br/>The Palace of Wisdom:<br/>“For those looking for a challenging brain teaser with a unique twist, look no further.”<br/><br/>GertLushGaming:<br/>“It is worth its price and you can get a lot of pad smashing, swear word creating fun out of it. Worth a look for sure.”FEATURES<br/><ul><li> Unique mechanics with simultaneous control over ALL robots<br/></li><li> Over 100 mind-bending levels in three tantalizing worlds!<br/></li><li> Beautiful bright graphics designed for 1080p<br/></li><li> One-Player and Two-Player modes (compete or co-op)<br/></li><li> Map editor with online sharing, compatible with PSN<br/></li><li> Steam Leaderboards, Achievements &amp; Trading Cards!<br/></li><li> Full controller support</li></ul>", "metacritic": null, "released": "2013-12-04", "tba": false, "updated": "2019-09-17T10:51:25", "background_image": "https://media.rawg.io/media/screenshots/c94/c94d57b85b4043c50ea2a62ad67387c2.jpg", "website": "http://www.teyon.com/games/robot-rescue-revolution-steam", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 142, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 20, "ratings_count": 3, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 3", "PC"], "developers": ["Teyon"], "genres": ["Casual", "Indie"], "publishers": ["Teyon"], "esrb_rating": "Everyone 10+"}