{"id": 379770, "slug": "blast-down", "name": "Blast Down", "name_original": "Blast Down", "description": "Take cover because Blast Down is taking aim, and getting ready to fire! Dive into the arcade game that's all-action and always on target!<br/><br/>Say goodbye to boring action games, because Blast Down doesn't know the meaning of dull. Here, you have one mission and one mission only - aim at every dummy that dares to stand in your way and shoot them down! However, this isn't like other shooting games because you're going to put your thinking skills to the test too. Luckily, you and your buddy dummy are equipped with a cannon that does everything you need it to do to kick the enemy dummies to the curb! Throughout each level, you'll have a set amount of ammo that defines how many shots you have. So, you need to aim your ball carefully before you fire to ensure you hit the enemies, and avoid the obstacles. Hit enough enemies, and your cannonball is going to start flaming for a super-powered shot that causes total havoc with whacky ragdoll physics!<br/>As you and your buddy progress, you'll face off against insane bosses and hordes of enemies that are all lovingly rendered in gorgeous 3D graphics. Different levels present diverse locations from beaches to deserts, and snow-capped biomes and each is as beautiful as the next.<br/><br/>It's time to put down what you thought were 'fun games,' pick up a ball, grab your cannon, and get shooting because this game is more than a good time, it's a total BLAST", "metacritic": null, "released": "2019-09-29", "tba": false, "updated": "2019-10-07T05:28:59", "background_image": "https://media.rawg.io/media/screenshots/c84/c8412e7e544bcde6848a0af91155358d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oleksandr Mykhailov"], "genres": ["Action", "Casual"], "publishers": ["Oleksandr Mykhailov"], "esrb_rating": "Everyone 10+"}