{"id": 37972, "slug": "sam-max-105-reality-20", "name": "Sam & Max: 105 - Reality 2.0", "name_original": "Sam & Max: 105 - Reality 2.0", "description": "<p>Sam &amp; Max 105: Reality 2.0 is a graphic adventure video game developed by TellTale studios, and the fifth chapter of the first season of Sam &amp; Max Save the World intellectual property composed out of 7 episodes.</p>\n<h3>Gameplay</h3>\n<p>The player takes a role of Sam who is the anthropomorphic dog accompanied by a hare-like animal called Max. Our characters are detectives, so the primary goal of the game is to solve criminal cases. While the usual point-and-click adventure scheme utilizes the usual pattern: the player can talk to NPC&#39;s, combine the elements to gain a new one and explore the landscape, Sam &amp; Max throws the combining element out — now it is only possible to match the element together with a piece of environment to gain something new. Contrary to many games of the genre, Sam &amp; Max feature a prototype of a non-linear structure, allowing one to travel between the crime scenes to investigate them thanks to 1960 DeSoto Adventurer — a navigator-like device.<br />\nAs observed by numerous point-and-click titles, Reality 2.0 also allows the player to choose a line in conversation and it does not go unnoticed — the subsequent playthrough would be affected by one&#39;s choice.</p>\n<h3>Key features and plot</h3>\n<p>The fifth chapter of the game tells a story of interchanging between the Real and the Virtual worlds to find the culprit accused of turning every planet&#39;s dweller into a zombie by a new online game.</p>", "metacritic": null, "released": "2007-04-12", "tba": false, "updated": "2023-04-14T13:38:25", "background_image": "https://media.rawg.io/media/screenshots/59e/59eb564fb578e1a3bcc6f9613aa0af84.jpg", "website": "http://www.telltalegames.com/samandmax/reality2.0", "rating": 3.22, "rating_top": 4, "added_by_status": {"yet": 41, "owned": 929, "beaten": 49, "toplay": 6, "dropped": 6}, "playtime": 3, "achievements_count": 0, "ratings_count": 63, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 63, "platforms": ["PC"], "developers": ["Telltale Games"], "genres": ["Action", "Adventure"], "publishers": ["Telltale Games"], "esrb_rating": null}