{"id": 379780, "slug": "deep-town-idle-miner-factory", "name": "Deep Town: Idle Miner Factory", "name_original": "Deep Town: Idle Miner Factory", "description": "DIG DEEP into this sci-fi strategy game to build, upgrade and automate your town! Follow along on a fun adventure to find out the hidden story behind your location.<br/><br/>STAY ENGAGED! - craft recipes, smelt raw resources into bars, growing seeds into plants in your greenhouse, dig - you choose! Boost your buildings to make them FASTER.<br/><br/>Explore your planet with more than 10+ zones to uncover<br/><br/>STRATEGY<br/>- Free to play<br/>- FREE DAILY CHEST<br/>- Endless gameplay<br/>- Single &amp; multiplayer game<br/>- Stay tuned with the latest News<br/><br/>FEATURES<br/>- Travel to new depths<br/>- Follow the storyline to uncover the unique backstory<br/>- Mine for more than 20 resources (GOLD, COPPER, COAL)<br/>- DEFEAT 10+  bosses along your journey (and some mystery bosses)<br/>- SELL and TRADE items to make coins to SPEND<br/>- Send explorer bots to explore hidden caves on secret expeditions<br/>- Level up your control panel to strengthen your spells to destroy blocks that stand in your way<br/>- Progress through the game to unlock more features!<br/>‪- Launch rockets to travel to AWESOME asteroids<br/>- SWIPE to gain access to new areas and a chance to terraform the world!<br/><br/><br/>AUTOMATE YOUR GAMEPLAY<br/>- Teach your bots new tasks with ease<br/>- Gain resources online and offline<br/>- Play slowly or fast! All at your own speed<br/><br/><br/>Take a chance and see what different spells makes you move the fastest - what is your favorite spell?<br/><br/><br/>PLAY WITH FRIENDS<br/>Join a guild to participate in different, interesting events!<br/>- Message to chat about strategies and ask for resources.<br/>- Create your own team or search for an existing guild <br/> - Win rewards of chests filled with rare gems and honor badges<br/>- Compete in WEEKLY EVENTS<br/>- Place on the Top 30 or All-Time leader board<br/> - Donate or request materials from your guild members<br/><br/>Invite your friends to join in on the FUN!<br/><br/><br/>Contact support at support@rockbitegames.com<br/><br/>JOIN US:<br/>https://discord.gg/WMgbC27<br/>https://www.reddit.com/r/deeptown/<br/>https://www.facebook.com/DeepTownGame/<br/>https://twitter.com/DeepTownGame<br/>https://www.instagram.com/thedeeptowngame/", "metacritic": null, "released": "2017-04-05", "tba": false, "updated": "2019-10-07T05:32:45", "background_image": "https://media.rawg.io/media/screenshots/695/695cc143ebd88e256080b088db4316f3_tNBrSAz.jpg", "website": "http://rockbitegames.com/deep-town/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rockbite Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Rockbite"], "esrb_rating": "Everyone 10+"}