{"id": 379879, "slug": "rest-in-peace-itch-juicyslew", "name": "Rest In Peace (itch) (juicyslew)", "name_original": "Rest In Peace (itch) (juicyslew)", "description": "Preface\r\n<p>I took a very different path in this game.  Inspired by my fear of death and wonder for how other will think of me when I am gone, I made this game to explore that a bit.  It isn't meant to be well thought out, it's just a manifestation of some of my worries and thought processes. </p>\n<p><strong>Disclaimer: This story is centered around loss and acceptance.  It isn't for everyone.</strong></p>\r\nThe Background\r\n<p>You are Richard Parsons, a dead man.  You died 10 years ago at the age of 25 in a car crash at no fault of your own.  You're friend Caroline Swanson is a tech genius, verging on the edge of a mad Scientist.  She found your body, experimented day and night to finally find a way to revive you.  Finally she developed a method to keep you alive by impaling your body with volatile energy sources.  Upon waking up, you realize that it does no good for you to be alive this way.  All you do is anguish... and in turn cause her to do the same.</p>\r\nObjective\r\n<p>Caroline is trying to keep you alive.  Your goal is to return to the nothing you started from: to die.  Use the power cells protruding from your body to help her move on and find your way to a peaceful rest.</p>\r\nControls\r\n<p>AD/RightLeft - horizontal movement</p>\n<p>W/Up         - Jump</p>\n<p>LeftClick    - Throw Power Rod</p>\n<p>Space        - Explode Next Power Rod</p>\r\nLinks\r\n<p>Source Code - Here</p>\n<p>Ludum Dare - Here</p>", "metacritic": null, "released": "2019-10-06", "tba": false, "updated": "2019-10-07T06:16:19", "background_image": "https://media.rawg.io/media/screenshots/4ef/4ef1b0435bf9cba4a5d6d73df46eabfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["juicyslew"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}