{"id": 3801, "slug": "assassins-creed-liberation-hd", "name": "Assassin’s Creed Liberation HD", "name_original": "Assassin’s Creed Liberation HD", "description": "<p>Introducing Assassin’s Creed® Liberation HD, the striking chapter of the pre-American Revolution Assassin’s Creed saga which arrives for the first time on HD consoles and PC. With improved gameplay, a deeper story, and HD graphics, Liberation is an immersive and full Assassin’s Creed experience.<br />\nThe year is 1765. As the events leading up to the American Revolution heat up in the north, Spanish forces plan to take control of Louisiana in the south – but they have yet to reckon with Aveline, a deadly Assassin who will use every weapon and ability in her arsenal on her quest for freedom.  . Whether eliminating her enemies with her multiple assassinations technique or luring them into deadly traps using her tools, Aveline strikes mortal fear into the hearts of those who stand in her way.<br />\nAs an Assassin, Aveline soon finds herself on an unforgettable journey that will take her from the crowded streets of New Orleans to voodoo-haunted swamps and ancient Mayan ruins. She will play a pivotal role in the turbulent New Orleans revolution and the beginning of a new nation. As she fights for freedom, not for herself, but for those whose life and hopes have been squashed.Key FeaturesAVELINE IS BACK<br />\nAs Aveline, an Assassin of mixed French and African heritage, you must use your skill, instinct and weaponry – including a machete, poison-dart blowpipe, a whip and duelling pistols – to hunt down and eliminate your enemies.<br />\nEXPERIENCE THE UN-UNITED STATES OF AMERICA<br />\nFeast your eyes on a richly detailed world, thanks to the AnvilNext engine which features groundbreaking physics, animation and innovative combat system. Outmaneuver your enemies in the Louisiana bayou with the unique Tree Navigation system, and eliminate them from above with deadly precision. Deep dive under water as you search for lost Mayan treasures, but stay alert; the hostile wilderness and humid swamps are full of menacing animals.<br />\nCOMPLETELY IMPROVED EXPERIENCE<br />\nTaking full advantage of its new hardware, Liberation HD introduces graphical improvements such as high-dynamic-range (HDR) rendering, high definition environments and characters, updated cinematics the sum of which delivers a complete graphic overhaul of the title. The gameplay experience has been revamped too with updated missions that improve the pacing, new missions that dive deeper into Aveline’s story, and updated world design for more gameplay options during mission. Finally, a particular attention was given to the audio with re-mastered music and all-new SFX.</p>", "metacritic": 64, "released": "2013-11-13", "tba": false, "updated": "2024-03-13T21:08:05", "background_image": "https://media.rawg.io/media/games/ffd/ffd241ae3648999c599917f40cf78ca2.jpg", "website": "", "rating": 2.9, "rating_top": 3, "added_by_status": {"yet": 92, "owned": 611, "beaten": 313, "toplay": 68, "dropped": 89, "playing": 10}, "playtime": 8, "achievements_count": 23, "ratings_count": 263, "suggestions_count": 431, "game_series_count": 19, "reviews_count": 270, "platforms": ["Xbox 360", "PlayStation 4", "Xbox One", "PlayStation 3", "PC", "Nintendo Switch"], "developers": ["Ubisoft", "Ubisoft Montreal", "Ubisoft Milan", "Ubisoft Sofia"], "genres": ["Action", "Adventure"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Mature"}