{"id": 380228, "slug": "amnesiac-adventurer", "name": "Amnesiac Adventurer (itch)", "name_original": "Amnesiac Adventurer (itch)", "description": "<p>=====================================================</p>\n<p>Our brave adventurer has made it to the final floor of the dungeon, and the Final Treasure is within his grasp… but wait, how did he get here in the first place? Help our forgetful friend recall how he cleared every previous dungeon floor, working backwards to jog his memory! One thing he’s sure of, though… <strong>He started each floor with no items whatsoever!</strong></p>\n<p>=====================================================</p>\n<p>Amnesiac Adventurer is a dungeon puzzle with a twist; start from the end, and make your way to the beginning! The only rule is that your adventurer started out the floor with no items! Think backwards in time, and try not to end up in impossible situations! Of course, you can take the easy way out… Maybe your Amnesiac Adventurer didn’t open every single chest and kill every single zombie. But then… who did?</p>\n<p>=====================================================</p>\n<p>HOW TO PLAY</p>\n<ul><li>WASD to move</li><li>Use the Mouse to click buttons when prompted on the top left of the screen</li><li>Click on Retry to refresh the level and start from the end</li><li>You can only hold one of each type of item (helmet and sword)</li><li>Your goal is to make your way to the entrance of the dungeon WITHOUT any items on you (helmet or sword)</li><li>Interact with all possible objects to get the full score and good ending!</li></ul>\n<p>=====================================================</p>\n<p>Gah, this was a hell of a project to do… I’ve made games solo before, and I’ve worked on Unity games before, but this is my first solo Unity project! Whiiiiich is why the polish is severely lacking, and the UI sucks even more than usual. Plus, I just bought Playmaker two days before Ludum Dare started, so suffice to say I was learning how things worked the hard way. Using a brand new engine for game jams is the best way to get caught up with what you need to know, in my opinion!</p>\n<p>If time permits, I’d love to polish up this game, maybe add a few more levels, a few more objects to interact with… Consider this a short preview of what could be! Music, sound effects, particles, maybe a mobile build, the whole shebang. In the meantime, though, enjoy the game, and don’t forget to give me your opinion so I know whose game to play next!</p>\n<p>Also, if anyone is planning on recording a playthrough, I’m mighty curious how the game would look when you play the video backwards. Hope I got the backwards logic right!</p>\n<p>=====================================================</p>\n<p>Programs used:</p>\n<ul><li>Unity (Playmaker)</li><li>Magicavoxel</li></ul>\n<p>=====================================================</p>", "metacritic": null, "released": "2019-10-06", "tba": false, "updated": "2019-10-07T07:43:22", "background_image": "https://media.rawg.io/media/screenshots/61a/61a516bc60be23541dad489d77f2a3d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JunoStriker"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}