{"id": 3803, "slug": "the-raven-legacy-of-a-master-thief", "name": "The Raven - Legacy of a Master Thief", "name_original": "The Raven - Legacy of a Master Thief", "description": "'The Raven - Legacy of a Master Thief' is a thrilling crime adventure in three chapters from the creators of 'The Book of Unwritten Tales'. Full of twists and turns, it immerses you in both sides of the story, combining thrill-of-the-chase whodunit with the risk and reward of a heist story.<br/> <br/>Paris, 1960. Europe is in the grip of the gentleman master thief The Raven. His burglaries are spectacular and he always emerges unscathed. Young hotshot investigator Nicolas Legrand stuns the public when he confronts the master thief and fatally wounds him.<br/> <br/>London, 1964. An ancient ruby – one of the legendary 'Eyes of the Sphinx' – is stolen from the British Museum. At the crime scene: a raven feather. Is somebody trying to follow in the Raven's footsteps? – Legrand is back on the case. At the same time in Zurich a phone rings. Constable Anton Jakob Zellner looks up from behind a mountain of files. He has no idea what lies hidden in a bank vault, just a few hundred meters away from him. As he reaches for the receiver his life takes a crucial turn…<br/> <br/>All three chapters are now available:<br/><ul><li>Chapter I: The Eye of the Sphinx<br/></li><li>Chapter II: Ancestry of Lies<br/></li><li>Chapter III: A Murder of Ravens</li></ul>Key Features:<ul><li>\tKing Art's thrilling crime adventure – full of twists and turns – immerses you in both sides of the story, combining elements of classic whodunit and heist stories<br/></li><li>\tCinematic presentation with hundreds of camera angles and dozens of cutscenes <br/></li><li>\tOptional puzzles and scoring system for adventure game veterans <br/></li><li>\tNotebook and help function for adventure game newcomers <br/></li><li>\tBreathtaking real-time 3D graphics in full HD</li></ul>", "metacritic": 74, "released": "2013-07-23", "tba": false, "updated": "2023-02-06T10:12:08", "background_image": "https://media.rawg.io/media/screenshots/2fc/2fcac0cc77f15695e4bcff652a58c408.jpg", "website": "http://www.raven-game.com", "rating": 3.1, "rating_top": 4, "added_by_status": {"yet": 29, "owned": 370, "beaten": 11, "toplay": 12, "dropped": 5}, "playtime": 2, "achievements_count": 35, "ratings_count": 21, "suggestions_count": 484, "game_series_count": 0, "reviews_count": 21, "platforms": ["PlayStation 3", "PC", "Linux", "macOS"], "developers": ["THQ Nordic", "KING Art"], "genres": ["Adventure"], "publishers": ["THQ Nordic"], "esrb_rating": "Teen"}