{"id": 380343, "slug": "make-yourselves-comfortable", "name": "Make yourselves Comfortable", "name_original": "Make yourselves Comfortable", "description": "<p><em>CE JEU EST DISPONIBLE EN ANGLAIS ET EN FRANÇAIS</em></p>\n\n<p><em>THIS GAME IS AVAILABLE BOTH IN ENGLISH AND IN FRENCH</em></p>\n\n<p><strong>FRANÇAIS </strong>: <br/><br/>Trèfle et Owlen doivent livrer un curieux collier à un riche excentrique dont iels n'ont pas retenu le nom. En attendant d'être reçus, iels explorent le salon, qui pourrait révéler bien des surprises...</p>\n<p>Ce jeu a été réalisé afin de me familiariser avec RPGMaker VX Ace ! Il est relativement simple et court, mais vous pouvez choisir entre deux protagonistes, et il y a quatre fins disponibles ! N'hésitez pas à recommencer (ou a recharger une sauvegarde) et à tout explorer !</p>\n<p>Une partie devrait durer 15-20 minutes, et trouver toutes les fins devrait prendre aux alentours de 45 minutes.<br/></p>\n<p><strong>ENGLISH</strong>:</p>\n<p>Trèfle and Owlen have to deliver a curious necklace to an excentric gentleman whose name they didn't catch. While waiting for their client, they explore the living room, which could hold a few surprises... <br/></p>\n<p>I made this game to familiarize myself with rpgmaker vx ace ! It's rather short and simple, but you can choose between two protagonists and there are four endings ! Don't hesitate to restart the game (or reload a save) and explore everything !</p>\n<p>A game should be 15-20 minutes long, and finding all the endings should take around 45 minutes.<br/></p>\n\n<p><strong><em>IMPORTANT NOTE ABOUT THE ENGLISH VERSION !</em></strong> <br/></p>\n<p>Sadly, I had a few issues with the translation software, resulting in this :</p>\n\n<p>During battle(s). That's the only place where it shows up, and it shouldn't be too intrusive. It will probably make the battle flavor text a bit confusing and hard to read though, and for that, I apologize.<br/></p>\n<p>Other than that, english isn't my first language, and it's entirely possible that typos and weird sentences snuck in, so if you notice anything off, do tell me ! I will do my best to fix it.</p>\n\n<p><strong>CREDITS :</strong></p>\n<br/><br/><br/>Scripts : Yanfly and Seer UK<br/>Beta test : Mistexpi<br/>Art, dialogue, story and characters : PatrickleMorse<br/><br/>Un grand merci à mes ami-e-s qui m'ont soutenu et encouragé pendant ce projet !<br/>", "metacritic": null, "released": "2019-10-06", "tba": false, "updated": "2019-10-07T08:15:59", "background_image": "https://media.rawg.io/media/screenshots/038/038b039b52d07369ddb4e0349c45aaeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["PatrickleMorse"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}