{"id": 380538, "slug": "stellar-expansion", "name": "Stellar Expansion", "name_original": "Stellar Expansion", "description": "<p><em>Stellar Expansion</em> is a lightweight freeware 4x (explore, expand, exploit, exterminate) game that places you in control of one of six species vying for galactic dominion. To win, you'll have to cultivate economic and technological supremacy, defend your borders from pirates and rivals, and send forth your warships to wipe the blight of your enemies from the face of the universe...before they can do the same to you!</p>\n\n<p><em>Stellar Expansion</em> takes its cues from several of the smaller-scale 4x games that were available on the classic Macintosh, including <em>Galactica: Anno Dominari</em> and <em>Starbound</em> (no relation to the more recent indie platformer by the same name). Relatively easy to pick up, and with shorter game durations than full-scale 4x games usually offer, <em>Stellar Expansion</em> might be just what you're looking for, if you're after something smaller to pick up between hundred-hour marathon matches of your favorite heavyweight strategy game. Best of all, it's completely free.<br/></p>\n\n<p><em>S</em><em>tell</em><em>ar Expansion </em>started life as an entry in GMC Jam #32, but has seen substantial improvement since the end of the jam. </p>\n\n\n<p>Trailer Music: \"Intrepid\" by Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 4.0 License<br/>http://creativecommons.org/licenses/by/4.0/</p>", "metacritic": null, "released": "2019-10-05", "tba": false, "updated": "2019-10-07T09:05:21", "background_image": "https://media.rawg.io/media/screenshots/10d/10db6a4f78795e56b8ab3f21a2f9577b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Perichron Interactive"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}