{"id": 380697, "slug": "balls-master-study", "name": "Balls Master Study", "name_original": "Balls Master Study", "description": "<p><strong>EN</strong></p>\n<p>This project is only supposed to be a showcase. It was made in 4 days using the Unity Engine, and only has 10 levels.</p>\n<p>I developed all the mechanics by observing the original game \"Balls Master\" and trying to replicate it. For a faster level development  i designed an specific data type using scriptable objects, and also a custom inspector for faster editing.</p>\n<p>The project is highly scalable. It's extremely easy to create and implement new block types and levels. The source code can be found at https://github.com/Sanchow/hypercasualBallsGame<br/></p>\n\n<p><strong>PT</strong></p>\n<p>Esse projeto tem como único intuito portifólio. Ele foi feito em 4 dias na Unity Engine e conta com apenas 10 niveis.</p>\n<p>Eu desenvolvi todas as mecânicas observando o jogo original \"Balls Master\" e replicando o que eu achei essencial. Para um desenvolvimento mais rapido eu criei um tipo de dado específico usando Scriptable Objects, além de um Custom Inspector para acelarar a edição.</p>\n<p>O projeto é altamente escalável. É extremamente fácil criar e implementar novos tipos de blocos e novos níveis. O código fonte pode ser encontrado em https://github.com/Sanchow/hypercasualBallsGame</p>\n\n<p><strong>Level Editor ScreenShot:</strong></p>", "metacritic": null, "released": "2019-10-04", "tba": false, "updated": "2019-10-07T09:48:31", "background_image": "https://media.rawg.io/media/screenshots/fcd/fcdea5868b96f5b8c129dcb64c922e38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gustavo Sancho"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}