{"id": 380789, "slug": "anime-battle-force", "name": "Anime Battle Force", "name_original": "Anime Battle Force", "description": "<p>This game is made through M.U.G.E.N and brings together 300+ of your favourite characters from much-beloved Anime/Manga Franchises in the style of Jump Ultimate Stars. Many of the Characters are community created and the game is completely modifiable and can bring your battle fantasies to fruition. The roster will change throughout updates and the game will be improved further.</p>\n<p>Challenge random fighters in Arcade, where your warrior will fight 10 people to claim victory over them all or you can challenge the Arcade with a helper and 2 warriors will fight at once or you could even use the turns mode, where you select 4 fighters who will take their turn to fight if the previous character was defeated.  </p>\n<p>You can also fight a friend in local multiplayer Versus mode and you can fight with the wide selection of characters on a variety of maps which you can also use the team modes on.</p>\n<p>Test your skill with Survival Mode where you will go up against an infinite number of characters and see how many other characters you can plough through.</p>\n<p>Ever wanted to see a dream battle between two anime characters, you can do that in Watch Mode, which pits the AI against each other with any characters of your choice creating an incredible battle.</p>\n<p>Credits to Meiloorun, TowerGamesMugen for the base screen pack and Elecbyte for creating M.U.G.E.N.</p>", "metacritic": null, "released": "2019-10-09", "tba": false, "updated": "2019-10-09T16:40:20", "background_image": "https://media.rawg.io/media/screenshots/956/9568849c2454684246f80d4d05fc4cbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": [], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}