{"id": 380784, "slug": "trump-card-alpha-release-build-1", "name": "Trump Card - Alpha Release Build 1", "name_original": "Trump Card - Alpha Release Build 1", "description": "<p>-----IMPORTANT UPDATE-------</p>\n<p>Single-player mode was found to be unusable due to an oversight. Fights still work with 2-4 players, and a hotfix should be provided by Tuesday. If you plan on trying the demo alone, there's another, broken-in-other-ways demo that is attached after the first that should enable single-player matches.</p>\n<p>----------------------------------------</p>\n<p>A card game with no turns, frenzied combat, and up to four players! This was a first crack at what mashing up Yu-Gi-Oh! or Magic with Smash Bros. could be like. Form a deck of 20 cards, pick a character color, and jump in alone for some combo testing or with up to three others to cast monsters, spells, and wacky effects.</p>\n<p>There are many features that I'll try to get to work on during my super busy gap-year. Among them:</p>\n<p>-improved sprite-work, VFX  (for clarity's sake, too) and backgrounds</p>\n<p>-SFX... any SFX, gosh...</p>\n<p>-more robust naming deck-naming system</p>\n<p>-the namesake of the game, powerful \"Trump Cards\" </p>\n<p>-collecting coins at the end of matches to buy decks which contain new cards</p>\n<p>-finishing at least the Fire/Ice set that is currently semi-implemented, and more cards that play with traditional card game shenanigans (draw a card, draw a card and teleport to a random location, force an opponent to discard a card (could that force them to freeze and make a decision? Sounds annoying, would probably make it force them to discard their first card))</p>\n<p>-taunts</p>\n<p>-better management of multiple players choosing the same color, and better shaders used for the player sprites (to add versatility; could have multi-colored sprites)</p>\n<p>-title screen</p>\n<p>-simultaneous controller and keyboard support</p>\n<p>... and more; it goes on, I have many lists....</p>\n<p>Side-note: Currently, the player character is a generic one. I don't have access to my drawing tablet right now, nor do I have the time to think of a proper title visual or icon for this, so I just used a squirrel that I made for a Chinese History block a while ago. :P</p>", "metacritic": null, "released": "2019-10-03", "tba": false, "updated": "2019-10-07T10:12:05", "background_image": "https://media.rawg.io/media/screenshots/029/029f5b577298091ba5e5454027a8a32b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roey_Shap"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}