{"id": 380867, "slug": "space-space-2", "name": "Space Space", "name_original": "Space Space", "description": "This game is about shoot the robot polyps, driving a spaceship that rotates on the screen, trying to take good aim, without crashing.<br/>\r\nThe story of the game tells the adventures of Jack Diamonds, who discovered the secret base of the robot polyps, who wanted to destroy the Earth.<br/>\r\nYou will have to guide the spaceship inside the rooms of the spatial base of the robot polyps, avoiding the walls and internal obstacles.<br/>\r\nSpaceship will be subjected to the physical forces of acceleration and rotation in the vacuum.<br/>\r\nRobot polyps are able to move, dodge your missiles and raise a shield to protect themselves from explosions.<br/>\r\nThey have great aim and you will have to protect yourself from their missiles, dodging them or raising your shield.<br/>\r\nBut they are slow to react, so you will have many opportunities to hit them.<br/>\r\nYour spaceship doesn't shoot fast: after firing, you have to wait for the next missile to be available.<br/>\r\nFor this reason, you must create your strategy to attack as effectively as possible.<br/>\r\nTo destroy an opponent, just hit him once.<br/>\r\nBut remember that even your spaceship will be destroyed with a single  hit or when it hits an obstacle<br/>\r\nTo move to the next room you will have to destroy all the polyps in the current room.<br/>\r\nA special door will open to move to the next level.<br/>\r\nIn the last room a boss is waiting for you: to win the game you will have to defeat him.<br/>\r\nThe boss is very strong and can receive severals hits.<br/>\r\nHe is able to shoot many missiles in all directions, and to attack you melee if you get too close.<br/>\r\nSquid Squid!", "metacritic": null, "released": "2019-10-27", "tba": false, "updated": "2019-10-11T03:07:11", "background_image": "https://media.rawg.io/media/screenshots/522/5220c44d87d89a34c6c7f3ad10aeff08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gino Di Pierro"], "genres": ["Action", "Indie"], "publishers": ["Gino Di Pierro"], "esrb_rating": null}