{"id": 380863, "slug": "shadowplay-metropolis-foe", "name": "Shadowplay: Metropolis Foe", "name_original": "Shadowplay: Metropolis Foe", "description": "We are the reflection below neon lighting. We are the remnants of desire. We are the deprived and the humiliated. Those at the top, they shudder at the mere thought of breathing the same air as us… But what's ironic is that the reason that this world is so beautiful, the reason it is so insane, the reason it is so worth living is because they can't get rid of us, and they never will. Look through the prism of my eyes, of my life, and perhaps you will be able to see a world entirely different from the one in your imagination; but, then again maybe you were right all along? Then you're crazy, just like me.<br/>\n<br/>\r\n·You've most likely never come across a card game with such an extensive plot before.<br/>\r\nA plot with hundreds of thousands of words, and it is no bedtime story at that. All the goings on in Starcity are as crazy as it gets! Take on the role of a band of lawless rebels in this strange gargantuan cyberpunk city with battle and adventure around every corner! The city also hosts dozens of lurking informants: find them, take on the missions they give, and bring the city under your control!<br/>\n<br/>\r\n·Companions, each with unique abilities and complex personalities.<br/>\r\nThe story features more than 10 characters, each with distinct personalities and unique decks. Take companions with you to confront challenges ranging from robot guards to labyrinths of the mind! Want to storm the CEO offices to the accompaniment of explosions, to sneak past guards or take out opponents with a well-honed slash of your sword? The decision is yours!<br/>\n<br/>\r\n·Cards perfectly complement the plot.<br/>\r\nExploring the city will open the map up to you and the city itself is full of uncharted opportunities, with each step along the way bringing about changes to your deck. No matter whether it's wounds from the battlefield, psychological suffering, allies' assistance or a gang's hit list, they may all become cards in your deck, granting your battles a whole-new level of unpredictability. Each choice you make has a chance of showing up as a card, bringing victory to you—or to your opponent.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-11T03:05:16", "background_image": "https://media.rawg.io/media/screenshots/4d5/4d5bbc33774f30243f24f5e5823b4b9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "toplay": 1}, "playtime": 2, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crossingstar Studio", "42 Foundation"], "genres": ["RPG", "Strategy"], "publishers": ["Zodiac Interactive"], "esrb_rating": null}