{"id": 380815, "slug": "zombie-horde-2", "name": "Zombie horde", "name_original": "Zombie horde", "description": "Discover the ancient continent of Thorath, a place desolated by misery, but once one of the most prosperous kingdoms in the world. Nobody knows why, but there was a time when wealth and abundance gradually disappeared, each key province lost its splendor one by one. Only poverty and hopelessness remained on the continent.<br/><br/>Centuries after the period known as the blacklight, by a stroke of luck, you have a unique opportunity to walk the path of the forbidden past and become a rich man. But at what cost?<br/><br/>Take the forbidden path and discover the ethereal dungeons, lost between the world of the living and the dead. Places where the great kings of the past hid their fortunes, cursed places that can only be accessed by three types of people: Kings, guardians, and the black magicians who created them.<br/><br/>Explore the secret map that reveals the locations of access to the ethereal dungeons, gather the key runes that grant a few seconds of survival and bet everything in the desperate search for forgotten treasures.<br/><br/><strong>Gameplay</strong><br/><br/>Gather the runes that are used as a key to the ethereal dungeon zone, You will have access to the deepest levels, where the challenge is high and the reward too.<br/><br/>Explore the secrets of the past, discover the vile agreements that ancient kings made to protect their treasure and that condemned the world to misery. And decide if they deserve your mercy.<br/><br/>Perform quests for black sorcerers and gain access to new key runes to open new ethereal dungeons, taking care not to make the same mistake as the mighty ones of the past.<br/><br/>Explore the ethereal dungeons in the shortest time possible, using the mechanics of choosing the right rune at the right time to advance through the place, every second lost count. Collect the treasures and fragments of the secret history of the world.<br/><br/><br/><br/>Enter and leave the ethereal world in the shortest time possible, the moments spent there to affect your sanity irreversibly.<br/><br/>Collect rare equipment of champions betrayed and with them face the greatest demons from the depths of the ethereal dungeons.<br/><br/>Perform intense turn-based battles against the spirits of the cursed champions and win each fight in the shortest time possible.<br/><br/><br/><br/>Decide how to use the treasures won: use it for your own benefit and become the richest man in the world or share your wealth with society and take the world out of chaos and darkness.", "metacritic": null, "released": "2019-10-05", "tba": false, "updated": "2021-09-06T18:06:45", "background_image": "https://media.rawg.io/media/screenshots/356/35635e7b2fd436435592e14bba89e438.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["金克斯", "Rogerio Favero"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["金克斯", "Rogerio Favero"], "esrb_rating": null}