{"id": 380859, "slug": "chinatown-detective-agency", "name": "Chinatown Detective Agency", "name_original": "Chinatown Detective Agency", "description": "<p>Singapore. 2032.<br />\nThe world is in a state of chaotic flux as the global economy is nearing the nadir of its decade-long downward spiral. Singapore is one of the last refuges of relative order, but even here, the government is struggling to keep the nation state from the brink of collapse. Law enforcement, like most public services, is underfunded. Private Detectives are becoming the first option for citizens who can afford a semblance of justice.<br />\nEnter Amira Darma, once a rising star at INTERPOL. She has just set up shop as a Private Investigator in the heart of Chinatown, and her first client is about to walk through her office doors...<br />\nInspired by the Carmen Sandiego games of the late 80s and 90s, Chinatown Detective Agency is a mystery adventure game that has you traveling across Singapore and all over the world in hot pursuit of criminals, persons of interest and valuable objects. Research answers to the clues and leads you&#39;ll unravel as you take on cases from clients both well-intentioned and shadowy.<br />\nAlong the way, you&#39;ll untangle a web of conspiracies and plots that threaten to push the Lion City over the edge.</p>", "metacritic": 67, "released": "2022-04-07", "tba": false, "updated": "2023-11-15T12:40:53", "background_image": "https://media.rawg.io/media/games/1d9/1d9f674e4fc3bb73f036b50092cb9862.jpg", "website": "http://www.generalinteractive.co", "rating": 3.25, "rating_top": 3, "added_by_status": {"yet": 21, "owned": 74, "beaten": 2, "toplay": 32, "dropped": 5, "playing": 1}, "playtime": 5, "achievements_count": 32, "ratings_count": 8, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 8, "platforms": ["macOS", "PC", "Xbox One", "Nintendo Switch", "Xbox Series S/X"], "developers": ["General Interactive Co."], "genres": ["Adventure", "Indie"], "publishers": ["Humble Games", "WhisperGames", "General Interactive Co."], "esrb_rating": null}