{"id": 380917, "slug": "thumb-fighter", "name": "Thumb Fighter", "name_original": "Thumb Fighter", "description": "<h3>Your next favorite party game!!!</h3>Thumb Fighter is a wacky and fast paced minimalist one-button fighting game.<br/>Does it sound too simple? Maybe. It is too simple? Maybe? Is it fun? Absolutely!<br/><br/>After many years of huge success on other platforms it will hit the Steam Store as a premium fully featured game :)<br/>By being this simple Thumb Fighter offers one of the most inclusive fighting experiences you can find.<br/>Fun assured to children, families, couples, friends, you name it!<br/>Literally everyone who played thumb fighter (Believe us, millions of people played already :) ) will tell you.<br/>Thumb Fighter it's a great ice breaker, with its one-button mechanic anyone can play and the battles still awake desperation, laughters and goose bumps.<br/><br/>Thumb Fighter's thumbs have one and only one movement, a head hit. <br/>Try to grab your opponent when it's (guard?) is down until you achieve the victory.<br/><br/>FEATURES<br/><ul><li>Single Player Mode (can you defeat all thumbs and become Thumb... master...champion lord... of all thumbs? <br/></li><li> Quick PvP, PvAi, Ai vs Ai (why not?) battles.<br/></li><li> Tournament Mode ( Create up to 8 players tournament to define who whashes the dishes)<br/></li><li> Minigames nobody asked for (but great time killers while you drool like a zombie over your lap)<br/></li><li> Campaign Mode<br/></li><li> More than 100+ characters</li></ul><br/>DISCARDED FEATURES<br/>- Procedurally generated levels (we already did that in Hidden Lands)<br/>- Minimalist racing mechanic (we already did that in Turn Right)<br/>- Online Matches (For now.... we'll see in the future  ¯\\_(ツ)_/¯    )", "metacritic": null, "released": "2015-09-28", "tba": false, "updated": "2021-07-02T03:17:30", "background_image": "https://media.rawg.io/media/screenshots/dfb/dfbc4abb09f639c4793fb47501b3c547.jpg", "website": "https://www.facebook.com/AvixGames/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Web", "PC"], "developers": ["Avix Games", "Nicolas S Castez"], "genres": ["Action", "Casual", "Fighting", "Indie"], "publishers": ["Nicolas S Castez", "Avix Games"], "esrb_rating": "Everyone 10+"}