{"id": 381015, "slug": "atc4real-pro-vol9", "name": "ATC4Real Pro Vol.9", "name_original": "ATC4Real Pro Vol.9", "description": "This version is no longer supported.<br/>A new free app is available (ATC4Real v3.0).<br/>-------------------<br/><br/><br/>ATC4Real is the most realistic ATC Simulator for iPad. It gathers real flights timetables and airports so you could experience real life action in your radar screen. <br/><br/>You will be able to simulate an air traffic controller shift at the following airports:<br/><br/>- Munich Intl Airport (EDDM / MUC)<br/>- LaGuardia Intl Airport (KLGA / LGA)<br/>- Milano Malpensa Intl Airport (LIMC / MXP)<br/><br/>The scenery is based in real data navigation so you could practice real STARs and SID procedures. <br/><br/>Lead every arrival into the actives runways and clear them to land and guide all departures into their exit fixes. <br/><br/>- Major improvements from previous version:<br/>- Engine coded from scratch for better performance and integration<br/>- Radar screen area increased up to 90 nm<br/>- Automatic SID and STAR navigation<br/>- Direct to fix command<br/>- Automatic or manual tower control<br/>- User rank system improved, now you will be promoted to new ranks as you progress unlocking sim features<br/>- Graphic interface reworked<br/>- Radar scroll and zoom handled by gestures (double tap and drag)<br/>- Emergencies added<br/>- Extended flight strip information<br/>- Select different colors for departures and arrivals echos<br/>- SID and STAR diagrams are shown in the radar screen<br/>- Pause added<br/>- Navaids are shown in three different modes: Just symbol, Symbol + Name and hidden.<br/>- Go around on landings added<br/>- Parallel runway takeoffs and landings improved<br/>- Metar offline improved<br/>- Preferred runways as in real airport for calm winds<br/>- Three airports packed in one single app<br/><br/>*Screen resolution compatible from iPhone 4 and above / iPad 1 and above.<br/><br/><br/><br/>Features: <br/>- ATC4Real simulates approach and departure control, plus take off and landing clearances<br/>- Real flight data gathered from real world timetables<br/>- Timetables are updated frequently<br/>- All controls are reachable through gestures (Tap, double tap and drag) so you do not need any keyboard input for main functions<br/>- Separated strips for Arrivals and departures<br/>- Toggle radar screen elements display (Map, rings, navaids, etc)<br/>- Terrain heights simulated, avoid crashing into mountains! <br/>- Fixes, vors and airports are accurate placed so you can practice instrument procedures published for current airport<br/>- Real weather updated every 15 minutes (Requires internet connection) <br/>- Satellite image as background optional<br/>- Radar screen zoom-able, so you can do precise vectors<br/>- User ranking system<br/><br/><br/>So start controlling now!<br/><br/>Visit http://www.atc4real.com and check out all our airports. <br/>Like us on Facebook at http://www.facebook.com/bajasim<br/><br/>Developed by Bajasim", "metacritic": null, "released": "2014-12-04", "tba": false, "updated": "2019-10-11T04:16:12", "background_image": "https://media.rawg.io/media/screenshots/a72/a72f366822f25449928a0bedc05fc651.jpg", "website": "http://www.atc4real.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Luis Zaragoza"], "genres": ["Strategy", "Simulation"], "publishers": ["Luis Zaragoza"], "esrb_rating": "Everyone 10+"}