{"id": 381010, "slug": "endless-quest-roguelike-rpg", "name": "Endless Quest Roguelike RPG", "name_original": "Endless Quest Roguelike RPG", "description": "A disturbance is felt across the land. Orcs and goblins gather in numbers that haven't been seen in centuries. Chaos descends. Are you ready to face it?<br/><br/>Endless Quest is a party-based roguelike adventure that combines randomly generated content with a story where you get to choose how you ultimately save the world.  An open-ended class creation system allows mixing and matching to create the characters you want to play, and the tactical combat system provides a unique challenge.<br/><br/>MAKE YOUR CHOICES. Endless Quest is a game of choice. Will you save Archer's Pass? Or would you rather go search for treasure?<br/><br/>PLAY YOUR WAY. Adventure solo or as a full party. Mix magic, prayer, melee and bardic abilities however you want. Dual wield, shoot arrows, crush with two-handed weapons or stand behind your shield.<br/><br/>DON'T BE AFRAID TO RUN: In true roguelike fashion, death is permanent if your fellow party members can't get to you in time. Sometimes, failure is better than death.<br/><br/>MULTIPLE END-GAME BOSSES. You won't always face down the same boss at the end of the game, and after winning -- if you can -- you travel to Gateway to face even harder challenges.<br/><br/>ROGUELIKE BY DESIGN: The roots of the game are in roguelikes such as rogue, moria and omega with randomly created areas and permadeath anchoring a robust role-playing game.<br/><br/>THE TABLETOP WITHOUT THE TABLE: Endless Quest is designed to feel like old tabletop pen-and-paper games with limited healing translating to a strategic element in surviving a quest. <br/><br/>* * *<br/><br/><br/>Acknowledgements:<br/><br/><br/>Many of the graphics in this game were purchased from Pioneer Valley Games. Other tilesets and graphics are from public domain or free-to-use tilesets, including graphics from Reiner Prokein, Clint Bellanger and Lamoot. Some of the sounds used come from www.freesfx.co.uk, including sounds by qudobup.", "metacritic": null, "released": "2019-09-26", "tba": false, "updated": "2019-10-11T04:13:59", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2fa2ec0ce5bae9c7d772a17822d1549_9ZwLIHW.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Nations"], "genres": ["Adventure", "RPG"], "publishers": ["Daniel Nations"], "esrb_rating": "Everyone 10+"}