{"id": 381095, "slug": "taco-tom-2-itch", "name": "Taco Tom 2 (itch)", "name_original": "Taco Tom 2 (itch)", "description": "<p>It's time to make some tacos in Taco Tom 2!</p>\r\nGameplay\r\n<p>Ingredients are falling from the sky, and it's your job to collect them to make tacos! Get exactly one of each of the five ingredients to make a full taco. If you get two of an ingredient, that's a mistake! Speed up and slow down time to make the game as easy or difficult as you like. Dash through solid objects to collect otherwise unreachable ingredients!<br/></p>\r\nStory\r\n<p>Taco Tom is about to break up with his girlfriend Sally after a disappointing day at the amusement park, but then she mysteriously dies! Distraught but single, Tom finds interest in a squid named Sapphire. Will Tom and Sapphire start dating? Will he find out what really happened to Sally? The only way he can answer these questions is by making tacos. Tom might learn some unexpected answers about himself as well...<br/></p>\r\nFeatures\r\n<ul><li>90 levels across 10 worlds. Some of them are easy, while others are extremely hard. Now that's a difficulty curve!</li><li>Over 500 lines of dialogue in a compelling story filled with dead tacos, squid dating, and more!</li><li>Royalty-free background images in each level provide an authentic stock photo aesthetic!</li><li>Practice Mode lets you figure out the best path through the levels!</li><li>Bonus Modes including Speedrun, Endurance, and Wacky!</li><li>Go for the high score in Arcade Mode!</li><li>Two-player local multiplayer battles!</li></ul>\n<p>This game can be purchased with money, and is playable by humans.</p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T04:43:58", "background_image": "https://media.rawg.io/media/screenshots/896/896e6f393f15596f6b43099e75657939.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["tininsteelian"], "genres": ["Action"], "publishers": [], "esrb_rating": null}