{"id": 381007, "slug": "stunt-car-racing-track", "name": "Stunt Car Racing Track", "name_original": "Stunt Car Racing Track", "description": "Time to show your extreme GT car racing skills with adventurous stunts performing activities. GT car racer should drive his GT car As fast as possible so that he can beat all the cars which are in the GT racing game. Forget everything and start a new journey of extreme car racing stunts. Gear up your engine, give full throttle to your race and start the city racing journey.For the lovers of ultimate GT car racing games, sports car racer, racing city car stunts is not that easy in GT car racer stunt simulator games but still such a quite interesting gameplay.<br/><br/>Turbo race GT car racing stunts will blow your mind. Extreme GT car racing is a thrilling game of real car racing and extreme stunts. You need extreme stunt car driving skills to drive safely on tricky impossible race tracks and curvy paths. Show off your extreme city car driving skills and become a good car racer ever! Each ultimate stunt car comes with unique specifications and speed. Drive, perform extreme speed stunts and car drifting and enjoy stunt race against time, gather worth remembering GT car racing experience and set new racing records to show to the racing world in this extreme GT car racing simulator game.<br/><br/>Nitro boosters are placed at various places to help you drive fast your extreme car on impossible stunts and roads. In this car racing game drive as much as you can to complete levels and to upgrade your classic GT cars.<br/><br/>Features:<br/><br/>Vast range of GT cars to enjoy fast racing actions.<br/>Hd stunning graphics with realistic car racing physics.<br/>Realistic and high physics car racing controls.<br/>Best sound effects.<br/>Rich road environment.<br/>Complete upgrades are available for cars.<br/>Multiple levels to satisfy your racing needs.", "metacritic": null, "released": "2019-10-09", "tba": false, "updated": "2019-10-11T04:12:51", "background_image": "https://media.rawg.io/media/screenshots/548/54803db9567fe7375be62ac3037becb4_2fZ1qeu.jpg", "website": "https://genesisgamestudio.wordpress.com/contact/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["khizar Tariq"], "genres": ["Adventure", "Racing"], "publishers": ["khizar Tariq"], "esrb_rating": "Everyone 10+"}