{"id": 381433, "slug": "hellion-the-legend-of-jeff", "name": "Hellion: The Legend of Jeff", "name_original": "Hellion: The Legend of Jeff", "description": "<p>Hellion, The Legend of Jeff, is a building-based, hack and slash survival game, where we follow (shocker time) Jeff as he attempts to massacre his way to wealth. Aid Jeff as he cleans up his tiny piece of hell from errant humans and self righteous Angels. Using the souls he reaps, a variety of buildings are made available to help him speed up his clean up so he might actually make it to watching his favorite soap opera tonight.<br/></p>\n<p>You can use souls to pave your way through lava, build turrets that reap soul for you even during potty breaks, pits that enlarge your storage of souls, spawners that poop out humans ripe for reaping and lures that confound these humans so much, they wouldn't see Jeff's scythe coming if it was covered in Christmas lights. Combine these buildings together, and well, it might just get as funny as Hell.</p>\n<p>Also, remember to not die. Those Angels might be pompous, but they pack quite a punch. Thankfully for Jeff, he's got the best insurance in hell, so he gets another life point for every 15 souls he gathers.</p>\n<p>So strap on your horns, sharpen your scythes and get down to business. We look forward to seeing how you use the buildings, so if you've thought of a particularly clever death trap that Jeff himself might cringe upon, post a gif of it at work accompanied by #JEFFGIF on our twitter.</p>", "metacritic": null, "released": "2019-10-08", "tba": false, "updated": "2019-10-11T06:10:45", "background_image": "https://media.rawg.io/media/screenshots/8b4/8b484fb84a1f07118a0e7765cb120afc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad Brokli"], "genres": [], "publishers": [], "esrb_rating": null}