{"id": 381527, "slug": "bring-back-a-for-me", "name": "Bring Back A ██████ For Me", "name_original": "Bring Back A ██████ For Me", "description": "<p><em>Your name is Tsubaki \"Taki\" Takayanagi, and you are helping your friend recover from the trauma of your death.</em></p>\n<p><em>You were executed for a murder that you never committed—or, at least, that's what everyone thought. There are many details about that incident, of government conspiracies and cover-ups, but that's not important right now. Your dear friend Celeste \"Asa\" Asagao had lost his memories of you out of grief, and months later, even after your return, he cannot remember you. With the help of your partner Gray , it is up to you to retrieve three important memories from the blank period in his mind; one of the beginning, one from the middle, and one of the end.</em><br/></p>\n<p>This game is partially based on the mechanics from AI: The Somnium Files as a result of Taki's creator (@grandreturn on twitter) suggesting the idea of Taki retrieving Asa's memories similar to the method in Somnium Files. For the most part it's a game made as a gift for a friend, but those without an understanding of the characters or the plot leading up to this point in the characters' stories can enjoy it as well.</p>\n<p><strong>Quick info:<br/></strong>Style: Text only, no audio or visuals<br/>Type: Linear, with some choices for solving \"puzzles\" (you will not get stuck)<br/>Narration: Second-person<br/>Content warnings: memory loss, ableism</p><p>(This game is a shorter, experimental version of what may eventually become a longer, more complex game, but no guarantees about that)</p>", "metacritic": null, "released": "2019-10-08", "tba": false, "updated": "2019-10-11T06:32:48", "background_image": "https://media.rawg.io/media/screenshots/7f6/7f61caf0cba17d7a9aaa13759adafb04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ghostchibi"], "genres": [], "publishers": [], "esrb_rating": null}