{"id": 381571, "slug": "crypthero", "name": "CryptHero", "name_original": "CryptHero", "description": "<p>In the darkness of the void an hummm was heard. In the darkness of the void an hummm was heard. With patience you are born in this world, naked barely seeing, walls surrounds you! A door you can distinguish from the limit of your perception.</p>\n<p>Outside the wall of your birth place stands a garden filled with trees and a river, you cannot see really well yet. There’s a bridge to cross the river, but it’s garded by a vile creature, a scrumy green two legged creature. As soon as you approche the creature attacks you, you retaliate and crush the skull of that weakling, blood splatter everywhere, blood, crimson blood, on green grass.</p>\n<p>You continue your way to an other building and try to not step in the void arround you.</p>\n<p>Once inside you are greeted by a young boy.</p>\n<p><em>¨Welcome, Hero, this world is for you and you are for this world. That that sword and make your way down to the crypt as it is your destiny to go there. But beware, those walls are infested with goblins. At the end of the crypt you’ll find the evil that was created for you. Beat him and wait for the world to be released from you into the void once again.¨</em></p>\n<p>Now that I’m done with the story I wasn’t able to fit into the game in time:</p>\n<p>For this competitions I made a small rogue like. It’s the first I ever made and it was the first time I was working with python-tcod. And after 35 hours of intensive coding I present to you Crypt Hero as I was able to finish it for the jam.</p>\n<p><strong>It’s full of bugs and not balanced as the hero is practically immortal. It’s far from finished but it’s playable.</strong></p>\n<p>Don’t fall into the void as it’ll terminate that world you’ll need to summon a new one.</p>\n<p>Have fun and explore a little:</p>\n\n<p>You can press enter while looking to get a small description of what you’re seeing:</p>", "metacritic": null, "released": "2019-10-08", "tba": false, "updated": "2019-10-11T06:42:32", "background_image": "https://media.rawg.io/media/screenshots/ecf/ecfd8b0e27acc32198e756c22ce4551a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Belug"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}