{"id": 381694, "slug": "out-of-controls", "name": "out of controls", "name_original": "out of controls", "description": "<p>_More of a tech demo, really... Let me know what you think anyway!_</p>\n<p>_The 4th level may or may not be impossible._</p>\n<p>--</p>\n<p>Drop the panel.</p>\n<p>Click the sockets to move the wires.</p>\n<p>There are some hints beneath the screenshot, although 'discovering how everything works' could (should??) be seen as part of the 'Start With Nothing' theme (besides the 'no controls').</p>\n<p>Disclaimer: It's probably _not_ a good idea to remove wires from sockets with a screwdriver in real life.</p>\n<p>--</p>\n<p>Hints, Categorized By Spoileriness<br/>----</p>\n<p>Basic:<br/> - To start the game: There's something simple you can do about that big upper panel.<br/> - You can pick up the end of a wire: click on a socket.<br/> - If you have a wire, you can place it in the same way (click on a socket).<br/> - If the big panel is suddenly there again, you've already won the previous level. However, there's a better way to tell if you're winning.</p>\n<p>---</p>\n<p>Medium:<br/> - Click on the big upper panel until all screws have fallen out, to start the game proper.<br/> - Wires are powered (yellow) under certain conditions and not under others.<br/> - The 'modules' (below) are connected to the sockets _somehow_.<br/> - The mini-screen with 'goal' on it is closely related to the dial right below it. Do you see the connection?<br/> - Green LEDs have a single, clear, meaning. Almost the same for red LEDs, except on one type of module.<br/> - Modules have a character on them (near the LEDs, and this too is meaningful) and so have all of the sockets.</p>\n<p>---</p>\n<p>Serious:<br/> - Try connecting a wire to from a socket with the same symbol on it as a green LED, to one that has the same symbol as one of the LEDs on the dial. What happens if you also power the other one?<br/> - Keep an eye on the arrow of the dial in relation to what's displayed on the screen over time.<br/> - Modules can have inputs and outputs. The battery has one output only, the dial has two inputs, no out. Some other modules have both; in this case, the output can be influenced by powering the input of that module.</p>\n<p>---</p>\n<p>Outright Telling How It Works:<br/> - The blue/red/green 'goal' blocks on the screen-module shows what color the arrow on the dial must be on each series of 4 seconds. A red cross if they don't match and a green check-mark if they do. Four check-marks wins the level and goes to the next.<br/> - The dial-module works as follows: No powered inputs -&gt; arrow on blue, one powered input -&gt; arrow on red, bot inputs powered -&gt; arrow on green.<br/> - The thick yellow cylinder is a battery-module, it continuously powers one socket.<br/> - The thick green/red cylinder is a pulse-module, it powers a socket for one second out of every four.<br/> - The slim blue/translucent tube works as a delay, it stores some power and then powers a socket with it if enough is stored.<br/> - The big black chip is a 'NAND'-module. It powers its output socket unless _both_ of the inputs are powered.<br/> - Most of the sounds are there for atmosphere. Yes, this includes the telephone and machinery-like noise.<br/> - The blank module does nothing.</p>\n<p>created for Ludum Dare #45 gamejam<br/></p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T07:12:17", "background_image": "https://media.rawg.io/media/screenshots/64e/64e11ef1dcd96aaf12ca744b499633e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["remco"], "genres": [], "publishers": [], "esrb_rating": null}