{"id": 381755, "slug": "rolley-sht", "name": "Rolley Sh❤t", "name_original": "Rolley Sh❤t", "description": "<p>Note 2: If the game is not loading for you, please try reloading the page.</p>\n<p>Note: In the WebGL build, some menu fonts are cut off slightly at the top. Use the downloadable Windows version, if this bothers you.</p>\n\r\nRolley Sht\r\n\n<p>In Rollay Sh❤t you are a dung beetle an want to impress your love... by creating the biggest ball of sh*t this world has ever seen, of course. Roll up everything in your path and make your dream come true.</p>\n\r\nGameplay\r\n<p>You start with a small ball of sh*t and need to increase its size by rolling up obstacles in your way, whether they are alive or not. A green border indicates if your ball is large enough to absorb another obstacle.</p>\n<p>Watch out to not hit anything that your ball of sh*t can't handle yet. If your ball of sh*t is hit by anything larger than it, you will take damage and lose progress. You recover health by absorbing obstacles again.</p>\n<p>You can evade too large obstacles by either moving out of their way or by jumping over them. There might be situations were jumping is your only option.</p>\n<p>You can also shoot your ball in front of you to quickly roll over obstacles in your way. A shot ball cannot be damaged by any holes on its way.</p>\n<p>Collect power-ups to temporarily gain benefits.</p>\n\r\nControls\r\n<p><strong>Move:</strong> WASD<br/><strong>Jump / Skip intro:</strong> Space<br/><strong>Aim:</strong> Mouse<br/><strong>Shoot your ball:</strong> Left mouse button</p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T07:25:11", "background_image": "https://media.rawg.io/media/screenshots/6f2/6f281216f395a888414d03ba929c73f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Andreas Roschal", "woergbi", "BananaBobBert", "flolan"], "genres": [], "publishers": [], "esrb_rating": null}