{"id": 381996, "slug": "in-the-beginning-neil-sadie", "name": "In the beginning... (Neil Sadie)", "name_original": "In the beginning... (Neil Sadie)", "description": "<p>My brother and I have not have a chance to participate since LD34, so we were very excited to get the opportunity with the new October timeslot to take part.</p>\n<p>We had 4 solid ideas, but of course we decided to skip the realistically achievable ones and go all in!</p>\n<p>We wanted to create a simple puzzle game and wanted to focus on getting something aesthetically pleasing, telling the story of a caveman receiving the gift of fire and thereby sparking the rise of man.</p>\n<p>For our tools we chose Unity and Blender.</p>\n<p><em>What went well:</em></p>\n<ul><li>Looks pretty good!</li><li>First 3D game</li><li>Cool node system that generates the nodes with their connections</li><li>Had lots of fun</li><li>Had some rest in between</li></ul>\n<p><em>Struggles:</em></p>\n<ul><li>Most of the puzzle mechanics we worked on was left out at the end as we ran out of time</li><li>Unity’s animation was a pain - really struggled to get movement correct and in sync with the tiles (burned many hours on this)</li><li>Could not create a final build with baked lightmaps as it was producing artifacts, finally deleted the lightmaps and voila!</li><li>No time to add sound and ambient music</li></ul>\n<p>Keys: Q, E to rotate the camera R to restart the scene</p>\n<p>Wolves: Can see two tiles in front of them and 1 on the sides but cannot see behind them!</p>\n<p><strong>Please Note:</strong></p>\n<p>Several players reported issues surrounding input not working making the game unplayable.<br/></p>\n<p>I managed to fix those and with that I also added the missing music and sound effects , screen transitions and cleaned up some bugs relating to the breakable blocks.<br/></p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T08:22:35", "background_image": "https://media.rawg.io/media/screenshots/15d/15d25667b5bec8569ba13a963cad795b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neil Sadie"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}