{"id": 381992, "slug": "lesshome", "name": "LessHome", "name_original": "LessHome", "description": "<p>LD45: Start with nothing</p>\n<p>This is my first Ludum Dare submission.</p>\n<p>True to the theme the game is best played without any knowledge.</p>\n<p>For those who want to know more continue reading...</p>\n<p>In LessHome you play as a homeless person who is able to spend money to upgrade and unlock aspects of the game. For this idea, I took inspiration from both idle games and games similar to Evoland.</p>\n<p>How to play:</p>\n<p>Starting from a black screen you must collect coins to use in the shop to upgrade and buy more items. These items are as follows:</p>\n<p>Visuals: Adds to the game visuals allowing better use of other money gaining mechanics.</p>\n<p>Sounds: Adds bad music to the game YOU HAVE BEEN WARNED!</p>\n<p>Coins: Click them to gain money. Upgrades give more money for each coin and makes them spawn more often.</p>\n<p>Beg: Clicking your character with a civilian close and looking at you, will cause them to stop and think about giving money. They are sure to ignore you if you spam the beg action while they are thinking. Further upgrades gain more money from a successful beg.</p>\n<p>Busk: With this upgrade you will automatically attract some civilians in range, giving you money after listening. If a civilian does not stop you can still use beg to ask for money regardless. Upgrading this earns more money from a successful busk.</p>\n<p>Civilians: Upgrading this adds more civilians to the street, enhancing the effectiveness of both the beg and busk.</p>\n<p>Credits: This unlocks the credits screen and is the main goal for the game. Other than that you can fully upgrade everything else.</p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T08:21:42", "background_image": "https://media.rawg.io/media/screenshots/f75/f758514ff40c7f8720770295669b1f14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Solidival"], "genres": [], "publishers": [], "esrb_rating": null}