{"id": 382163, "slug": "beansprout", "name": "BeanSprout", "name_original": "BeanSprout", "description": "<p>This is BeanSprout. my first Ludum Dare entry for Ludum Dare 45, a game about farming and cross-breeding your plants.<br/></p>\n<p>The theme was \"Start from nothing\", so you start without seeds. You need to gather wild seeds from the grass areas and start planting those. After harvesting and gathering some basic crops you can replant them and cross-breed them with each other to make new crops which you in turn cross-breed again and so on.<br/></p>\n<p>Due to personal time complications, the gameplay loop stayed simple and only includes replanting and cross-breeding. Originally had planned selling crops and buying equipment but that had to be cut.</p>\n<p><strong>Instructions:</strong></p>\n<p>WASD - Move</p>\n<p>Space Bar - Interact</p>\n<p>Mouse Middle Click - Open Seed Bag if equipped<br/></p>\n<p>Q, E - Change Equipped tool, seed in seed bag or crop in crop window</p>\n<p>You start the game by harvesting seeds from the grass to the right and planting them to the patches on the left.  Open seedbag to select seed and plant using space bar. You can also plant two different seeds to cross-breed them. Finish planting by using the Watering Can.</p>\n<p>         <br/></p>\n<p>To let the plant grow, Interact with the sign that says End Day at the bottom. Now you can dig up your Crop. To get seeds from your new plant, go to the seed processor at the top and turn your crops to seeds.</p>\n<p>Here is a cheat sheet to the cross-breeding: CheatSheet</p>\n<p>Even though this is very basic, Have Fun!<br/></p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T09:03:36", "background_image": "https://media.rawg.io/media/screenshots/991/991b1ba5888963ecaef6b8f088ad3ac4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["recordshambles"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}