{"id": 3823, "slug": "rainbow-moon-ps3-player-special-offer", "name": "Rainbow Moon PS3 Player Special Offer", "name_original": "Rainbow Moon PS3 Player Special Offer", "description": "Purchase Rainbow Moon for the PlayStation®Vita system at a 50% discount if you already own Rainbow Moon for the PlayStation®3 system. This special offer is available for a limited time only.<br/><br/>The indie role-playing hit Rainbow Moon returns for the PlayStation®Vita system with Cross-Save support and numerous updates!<br/><br/>Explore a fascinating world and fight nasty creatures in turn-based battles. Visit towns and shop for new equipment and upgrades. Six playable characters await you in an addictive game that lasts more than 40 hours.<br/><br/>“RPG fans, this one is not to be missed” – Push Square (9/10)<br/><br/>“...Rainbow Moon is put together fantastically well” – PSXExtreme.com (8.7/10)<br/><br/>“Rainbow Moon is a lot of fun, and RPG fanatics should play it” – IGN (8/10)<br/><br/>Additional features:<br/><br/>• Complete all optional content to extend game play up to 100 hours and beyond<br/>• Earn more than 50 trophies, including a prestigious platinum trophy<br/>• Exchange saved data between your PlayStation®Vita system and PlayStation®3 system<br/><br/>Rainbow Moon<br/><br/>Compatible with PlayStation®Vita only.<br/>Gameplay requires PlayStation®Vita memory card (sold separately).<br/>340KB minimum space required<br/>1 Player<br/>This product supports the following languages: In-game speech: English On-screen text: English.<br/><br/>  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account. <br/><br/>", "metacritic": null, "released": "2013-12-03", "tba": false, "updated": "2019-08-02T16:21:43", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["PS Vita"], "developers": ["EastAsiaSoft"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone 10+"}