{"id": 382402, "slug": "shadowy-monster-land", "name": "Shadowy Monster Land", "name_original": "Shadowy Monster Land", "description": "<p><strong>Press 'H' for in-game instructions.</strong></p>\n<p>My first game jam. It's been intense, but great fun. Definitely doing it again!</p>\n<p>Didn't get as much done as I wanted - biggest disappointment is that I didn't have time to make any proper levels - I spent too long implementing mechanics which are then barely used...</p>\n<p><strong>Try to get through each level without being eaten by monsters.  Monsters are attracted to you, but strongly repelled by light - use this to evade them!</strong></p>\n<p>Here's the story (also in-game, with helpful graphics):<br/>Because you had NOTHING else to do, you've randomly found yourself in Shadowy MonsterLand.</p>\n<p>You START WITH NOTHING.<br/>If you enable Dark Mode (over on the right), you will be able to see almost NOTHING.</p>\n<p>On each level, you need to find the exit.</p>\n<p>If you are lucky, you'll find a torch. Press 'T' to turn it on and off, Up/Down arrows to focus the beam between short and wide and long and narrow. Legend speaks of spare batteries...</p>\n<p>Beware of Monsters, and don't fall into any Volcano Pits!</p>\n<p>Monsters mostly sleep. But they will wake if you get too close, or if any light shines on them.</p>\n<p>Some blocks can be pushed, and some have lights on top, for some reason.<br/>If you stand next to one of these, Up/Down can be use to focus the beam (like the torch), and Left/Right can be used to aim the beam.  Unlike the torch, these don't use batteries. (Since you asked, they are powered by zero-point energy extracted from nothing. That's right, they START WITH NOTHING.)<br/>Oh, yes, and hold SPACE to drag them!</p>\n<p>A solo effort, all my own work apart from graphics - which are taken from the following great libraries - thank you!<br/>https://opengameart.org/content/dungeon-crawl-32x32-tiles<br/>https://opengameart.org/content/dungeon-crawl-32x32-tiles-supplemental<br/>https://jasonlab.itch.io/seamless-real-texture-pack<br/>https://opengameart.org/content/rotating-orbs<br/>https://vectorpixelstar.itch.io/food<br/>https://arcadiaxdev.itch.io/chonkly-pixel-font</p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T09:59:56", "background_image": "https://media.rawg.io/media/screenshots/e69/e69b880cf4407bbe1e15fcc073e98a6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["spaceWumpus"], "genres": ["Action"], "publishers": [], "esrb_rating": null}