{"id": 382467, "slug": "bouncing-bass-brawl-bonanza", "name": "Bouncing Bass Brawl Bonanza", "name_original": "Bouncing Bass Brawl Bonanza", "description": "What is it?\r\n<p><strong>Bouncing Bass Brawl Bonanza</strong> is a couch multiplayer game about buff fish fighting in a bouncy castle while forgetting who their teammates are.</p>\r\nExplain that in more detail please.\r\n<p>Fish have a memory that lasts 3 seconds*. They're also all identical**. So, every time the team colors are shown, they will disappear in 3 seconds. </p>\n<p>After that, you and your friends must try to keep track of who everyone is until the colors are shown again. </p>\n<p>The team with more points after 2 minutes wins. A point is given when a fish from the opposing team is punched off, stomped off, or just falls off the screen.</p>\n<p><em>* I know this is not true, but the whole game hinges on that idea so bear with me.</em></p>\n<p><em>** Just read *  again.</em></p>\r\nHow many of my friends can I punch in that 2 minute span?\r\n<p>Up to 6 local players are supported – 4 controllers and 2 players sharing the keyboard. Bots will fill the empty slots to make the team sizes equal. </p>\n<p>Playing alone with bots is supported, though multiplayer is the intended experience. No AI can substitute for accidentaly punching your friend, but you're welcome to try anyway.</p>\r\nWho made this?\r\n<p><strong>Bouncing Bass Brawl Bonanza</strong> was made by <strong>Aitor Iribar ( @hairibar)</strong>, with character art by <strong>Elena Chueca Morales(@ElenaDoesThings)</strong>. </p>\r\nIs the Windows version different?\r\n<p>Barely. Controller support is a bit dodgy on HTML5, so you may or may not run into controller related issues in the web version that are fixed in the Windows version. It also has rumble, which HTML5 doesn't support. I've done my best to make the versions the same, but HTML5's controller support is out of my control.</p>\n<p>In every other way, though, they are the exact same. You can buy the Windows version as an (extremely appreciated) gesture of support, but both versions are the full game.</p>", "metacritic": null, "released": "2019-10-04", "tba": false, "updated": "2019-10-11T10:13:25", "background_image": "https://media.rawg.io/media/screenshots/eee/eee939b2f777d6b35edf038702aaa5d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Aitor Iribar"], "genres": [], "publishers": [], "esrb_rating": null}