{"id": 382568, "slug": "carnival-mayhem", "name": "Carnival Mayhem", "name_original": "Carnival Mayhem", "description": "<p>Carnival Mayhem was made for Ludum Dare 45. </p>\n<p>In Carnival mayhem you are a young boy who is terrified of clowns. Within a nightmare you are placed in a clown filled amusement park to face your worse fear.<br/></p>\n<p>Every round you start with bare hands (Start with nothing)) and pick up weapons as you go, Also be smart with aiming as almost everything is destructible, making the path for the clowns shorter to get you. </p>\n<p>Game contains multiple unlock-able levels, with increased difficulty. You have access to 4 weapons: bare hands, pistol , machine gun (can hold mouse button down to automatic shooting) , and grenade launcher. You unlock weapons and collect ammo from crates dropped by defeated clowns. Almost everything is destructible, and you can make chain reactions i.e. barrel explosion damages enemies as well as other props (including barrels). </p>\n<p>Controls:<br/>- mouse position - aim <br/>- mouse left/right button - attack/fire<br/>- arrow keys/WSAD - move <br/>- 1 -4 or click on weapon buttons - select weapon</p>\n<p>GAMEPLAY HINTS:<br/>- in melee aim directly towards enemy to do damage<br/>- enemies attack directly in front of them, you can dodge the hit by going around them<br/>- gather more enemies into group and kill them with barrel explosion <br/>- save bullets :)</p>\n<p>Out team includes: 1 artist (https://twitter.com/mikarkia)  and 1 developer, total development time was around 22 hours. Everything except sounds was made from scratch. </p>\n<p>Main theme: Night at the Carnival by Brandon Fiechter.</p>\n<p>Software used:<br/>Unity 2019.2.6, Blender 2.79, Photoshop. </p>", "metacritic": null, "released": "2019-10-07", "tba": false, "updated": "2019-10-11T10:36:18", "background_image": "https://media.rawg.io/media/screenshots/d23/d23a1900ff24f8ae214e05218b5eefe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["TomekS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}