{"id": 382782, "slug": "magic-tiles-friends-saga", "name": "Magic Tiles Friends Saga", "name_original": "Magic Tiles Friends Saga", "description": "Magic Tiles Friends Saga is for the master pianist inside you! We have over a hundred songs you will love from various genres from Twinkle Twinkle Little Star to You Are My Sunshine, all specially curated to give your child the best musical experience!<br/><br/>Magic Tiles Friends Saga is the newest piano game that combines magic piano tiles with cute characters, fun new game modes and new exciting saga map.<br/><br/>Let’s tap the tiles, play the game on your mobile, meet your friends.<br/><br/>Game’s rules:<br/><br/>Magic Tiles Friends Saga is easy to play. The goal of the game is simple <br/>- Tap on the carrots featured on the screen to feed the rabbits below<br/>- Avoid tapping anywhere else and enjoy our game! <br/><br/>Game features:<br/>- Unique magic saga where you can explore the journey, play piano and create your own magic<br/>- ALL NEW CHALLENGES TO TRY! Experience 100 over levels of non-stop fun and entertainment! <br/>- Many adorable characters that accompany in your journey. Get access to various animals including mouse, chicken, bear, dog and many more! <br/><br/>So, get ready and try out the fantastic piano games for free! The attractive piano online which is more challenging than you could imagine.<br/><br/>Become a real pianist now! And catch up the trend with this new magic piano game 2019!", "metacritic": null, "released": "2019-10-10", "tba": false, "updated": "2019-10-14T02:44:20", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fa0486cd522661bce4e2046e114782a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vo Binh"], "genres": ["Casual"], "publishers": ["Vo Binh"], "esrb_rating": "Everyone 10+"}