{"id": 382726, "slug": "masteroid", "name": "Masteroid", "name_original": "Masteroid", "description": "Warp into a busy galaxy with nothing but your wits and a tiny ship. Explore sectors, mine asteroids, take on faction missions, sell resources and upgrade your loadout. Earn the respect of a faction to unlock new weapons and ships. Attack other ships and steal their resources but beware: factions won't tolerate hostility for long without retaliation. Masteroid is an atmospheric, indie 2D space game with procedurally-generated sectors and casual, relaxed gameplay.<br/><br/>Key Features:<br/><ul><li><strong>Procedurally Generated Game World</strong>: Masteroid randomly generates up to six sectors for two unique factions at the start of every game so every new game is unique.<br/></li><li><strong>Upgrade Your Ship</strong>: Every ship you see in space can be purchased and outfitted, provided you have the faction reputation!<br/></li><li><strong>Upgrade Your Weapons</strong>: Ships have one or more turrets. Buy and equip weapons but make sure your ship has the energy to fire them!<br/></li><li><strong>Relaxed Gameplay</strong>: No permadeath here. Death results in a loss of any cargo and a small cash penalty. You can play the game as passively or aggressively as you like.<br/></li><li><strong>Faction Reputation</strong>: Sell mined resources, kill enemy ships or run missions to earn reputation points for a faction. Higher levels unlock better weapons and ships.</li></ul>", "metacritic": null, "released": "2017-07-05", "tba": false, "updated": "2020-02-12T14:36:20", "background_image": "https://media.rawg.io/media/screenshots/531/531e649212c561c4e7e3f536dc94714a.jpg", "website": "http://masteroidgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Narfox", "profexorgeek"], "genres": ["Simulation", "Casual"], "publishers": ["Narfox"], "esrb_rating": null}