{"id": 382778, "slug": "solitaire-pets-adventure", "name": "Solitaire Pets Adventure", "name_original": "Solitaire Pets Adventure", "description": "Solitaire Pets Adventure is a free Klondike Solitaire saga game with a twist. Play cards in one of the best classic card games &amp; become the next Solitaire master!<br/><br/>Shuffle the cards and get ready to have some fun! The free classic Klondike Solitaire card game we all know and love is now available with unique gameplay matches &amp; exciting Solitaire challenges!<br/><br/>Solitaire Pets combines cards and casual gameplay that will keep you coming back for more!<br/><br/>Immerse yourself in this classic Solitaire card game where pets roam free, and epic adventures await you at every turn. Play this Solitaire saga card game with your favorite four-legged friends and reach the top to become the next Solitaire master!<br/><br/>Unlock new levels to explore, or take on daily challenges where you can win awesome coin prizes that will help you progress that game and become the next solitaire master! Can you reach the top of the Solitaire Pets saga leaderboards?<br/><br/>INSTALL NOW &amp; play one of the best classic Solitaire saga games!<br/><br/>Solitaire Pets Adventure Game Features:<br/>- An all-new way to play Solitaire Classic Patience with addicting Klondike gameplay<br/>- A world full of rich graphics to explore with lovable pet characters<br/>- Powerful boosters to help with challenging levels<br/>- Awesome challenges to complete and win fun rewards<br/>- Easy and intuitive to play Patience, yet challenging to master<br/><br/><br/>Solitaire Pets Adventure is completely FREE but offers in-game purchases.<br/><br/>Whether you’re a Solitaire master or a fan of classic card games like Pyramid or Golf, Solitaire Pets Adventure is the perfect way to play Klondike Solitaire. Download this beautiful card game, Shuffle up and deal the cards!", "metacritic": null, "released": "2019-09-09", "tba": false, "updated": "2019-10-14T02:42:29", "background_image": "https://media.rawg.io/media/screenshots/6c9/6c96c2c4c88b178fee9caacac57eea65_gz3yk3h.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Come2Play"], "genres": ["Card", "Puzzle"], "publishers": ["COME2PLAY"], "esrb_rating": "Everyone 10+"}