{"id": 382742, "slug": "miniverse-wars", "name": "Miniverse Wars", "name_original": "Miniverse Wars", "description": "We are a startup which makes games as side projects with the hope of one day launching the game or various games that will allow us to dedicate more resources to game development. The learning experience has been great since the launch of our first game, Awesome Machine, and we are always trying to learn from our past mistakes and improve Miniverse Wars so it becomes a game that people have fun with. <br/><br/>If you have a suggestion or an idea of how we can improve our game we will be very happy to hear it :). If you find any bugs please let us know and we will work as quickly as possible to resolve them.<br/><br/>We hope you have a great time playing Miniverse Wars! <br/><br/><br/><br/>• Command a crew and your defences through <strong> 5 initial levels </strong> and bring peace to a chaotic galaxy.<br/><br/>• <strong>Upgrade technology </strong> to build and maintain a strong fleet. It will ensure you are in a good position to fight back and expand.  <br/><br/>• <strong>Collect resources</strong> such as energy from stars to keep your ships fighting and to upgrade your technology. <br/><br/>• Make the right decisions when <strong>events</strong> happen; they that will make you reconsider your position and strategy.<br/><br/>• Make use of our cool <strong>Steam achievements</strong>, <strong>leader board</strong> &amp; <strong>Trading cards</strong>! <br/><br/>• Enjoy the convenience of <strong>Steam Cloud </strong> storage. <br/><br/><br/><br/>• The main camera can be moved using the mouse and/or keyboard.<br/><br/>• The resource bar located at the top will display how much of each resource you have. <br/><br/>• The mini map will show what is around you and can also be used to go where you want. <br/><br/>• The command bar is mainly used to command your ships. It is located at the bottom of the screen and consists of 3 parts.  <br/><br/>• To command your ships, you need to select them by clicking on a single ship or by clicking and dragging the area around several ships.<br/><br/>• The command bar will allow your ships to: move, attack, patrol, stop, escort, destroy, collect, generate energy and colonise. <br/><br/>• The commands differ according to the selected ship. For example, the Collector ship can only collect nebulae and asteroids and the Satellite ship can only draw energy from the stars.<br/><br/>• After selecting the command, simply click on the target.<br/><br/>• You can build new ships after you have colonised a new planet. Just click on the planet to pay for the cost of constructing the new ship.<br/><br/>• Each phase has a maximum number of ships that can be active, so ensure you have the right ships.<br/><br/>• You can invest in building defences for your planet, similar to building ships.<br/><br/>• Because resources are finite, it is important to manage your spending well and build just what you need.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-14T02:24:33", "background_image": "https://media.rawg.io/media/screenshots/cba/cbabc377e9fd7a60f036f8dfc20a6f24.jpg", "website": "http://bellosoft.com/en/miniverse-wars/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bellosoft"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Bellosoft"], "esrb_rating": null}