{"id": 382772, "slug": "yooka-laylee-buddy-duo-pack", "name": "Yooka-Laylee: Buddy Duo Pack", "name_original": "Yooka-Laylee: Buddy Duo Pack", "description": "<p>Yooka-Laylee: Buddy Duo Bundle includes:<br/>\n- Yooka-Laylee base game<br/>\n- Yooka-Laylee and the Impossible Lair base game</p>\n<br/>\nEnjoy two great adventures in one with the Buddy Duo Bundle!<br/>\n<br/>\n<br/>\nYooka-Laylee is an open-world platformer from genre veterans, Playtonic Games. Explore huge, beautiful worlds, meet (and beat) an unforgettable cast of characters and horde a vault-load of collectibles as buddy-duo Yooka and Laylee embark on an epic adventure to thwart corporate creep Capital B!<br/>\n<ul>\n<li>INTRODUCING OUR NEW BUDDY DUO: Yooka and Laylee boast an awesome arsenal of abilities built for platforming fun</li>\n<li>CARVE YOUR OWN PATH: Unlock new moves, expand your favourite worlds and equip Tonic gampley modifiers. Every player will have a unique experience</li>\n<li>A DREAM SOUNDTRACK: David Wise (Donkey Kong Country) and Grant Kirkhope (Banjo-Kazooie) combine for a melodic masterpiece!</li>\n<li>AND A WHOLE LOT MORE: Discover unique boss fights, mine cart challenges, retro-tastic Arcade games, quiz shows and more than 8 unique multiplayer games!</li>\n</ul>\n<br/>\n<br/>\nYooka-Laylee and the Impossible Lair is a brand-new platform adventure from some of the key creative talent behind 'Donkey Kong Country'. The colourful buddy duo must run, jump and roll their way through a series of challenging 2D levels, face a puzzling 3D Overworld filled with secrets and rally the Royal Beettalion to take down Capital B and his Impossible Lair!\n\n<ul>\n<li>THE BUDDY DUO IS BACK: Yooka &amp; Laylee are back in a brand-new platform adventure from Playtonic Games.</li>\n<li>2.5D PLATFORMING: Each level offers beautiful, rich visuals with detail and depth.</li>\n<li>EXPLORE A 3D OVERWORLD: Unlock more 2D levels by completing objectives and puzzles, rescue the Royal Beettalion bees and find collectibles.</li>\n<li>ALTERNATE LEVEL STATES: Hook up electricity, submerge them in water, freeze or literally flip them upside down for radically altered challenges!</li>\n<li>TONICS: Tonics which offer a whole host of new experiences. From super speed and big-head mode, to environmental visual effects, tonics mix up the way you play!</li>\n</ul>", "metacritic": null, "released": "2019-10-10", "tba": false, "updated": "2019-10-14T02:39:16", "background_image": "https://media.rawg.io/media/screenshots/e55/e553562b6b08c482cb962502bc8b4385.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 556, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Playtonic Games"], "genres": [], "publishers": ["Team17 Digital"], "esrb_rating": null}