{"id": 382879, "slug": "real-horse-racing-online", "name": "Real Horse Racing Online", "name_original": "Real Horse Racing Online", "description": "In Real Horse Racing Online Challenge your friends and other horse riders in world and beat them.<br/>Hire a jockey, train your horse, makes your skills perfect and compete your opponents online in Real Horse Racing Jockey Online.<br/>You must proof a best rider and full horse control skills when race start.The immersive 3D environment really sets the stage. <br/><br/>**** Game Modes ****<br/><br/>- National Hunt: Select your best horse , race with your friends , Boost your horse perfectly ,jump on fences and reach to finish line as fast as you can.<br/><br/>- Time Trail : Cross the finish line in giving time and cross hurdles accurately.<br/><br/>- Flat Race : Flat race gallop horse fast their is no hurdle or fence.<br/><br/>-Training Mode : Train you jockey and horse, make your skill perfect to beat others online. <br/><br/>The size and type of obstacles vary depending on the course and the level of the horse and rider, but all horses must successfully negotiate these obstacles in order to complete a competition and come first. <br/>Fences used in hunter and venting are generally made to look relatively rustic and natural. Make horse best practice in training mode and Jump Perfectly to beat opponent in horse racing jockey online. <br/><br/><br/>***** How To Play *****<br/><br/>In simulator horse racing jockey online tap the right boost button when speedometer needle in center to increase the horse speed to cross the hurdles for jump tap the left side button. <br/><br/>Change horse camera at top left button to see horse and jockey in different and perfect angles. There are many obstacles come in way and your horse cross these hurdles so efficiently. <br/><br/>You must control your horse speed and look ahead upcoming hurdles. You must care that your horse hoof does not touch the crossing obstacle barrier and landing smoothly Jump over every hurdles accurately to cross the finishing line first.<br/><br/>All the way up to winning the quest for the Race! Online horse race simulation, featuring lifelike animation, stellar graphics, addictive gameplay and intense competition. <br/><br/>Online Game Features:<br/>---------------------<br/>** Play online with your Facebook friends live.<br/>** Play with Real Horse Racing Jockey Online Active users.<br/>** User Friendly UI.<br/>** Smoothly works on 2G, 3G and WIFI connections.<br/>** Perfect and Realistic Controls.<br/>** Great Graphics and Sound.<br/>** Great betting fun with no real money involved except In-app Purchases.<br/>** Play Offline.<br/><br/>For any suggestion/feedback feel free to contact us at support@xertzgamestudio.com<br/>Join us on Facebook: www.facebook.com/xertzgamestudio<br/>Visit \"Xertz Game Studio\" official blog: http://xertzgamestudio.blogspot.com<br/>Visit \"Xertz Game Studio\" official website: www.xertzgamestudio.com", "metacritic": null, "released": "2019-05-29", "tba": false, "updated": "2019-10-14T03:29:42", "background_image": "https://media.rawg.io/media/screenshots/54c/54c1d6dd9609e5efb074a66900ed3a2b_7ki0HZl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Hassan"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Syed Hassan"], "esrb_rating": "Everyone 10+"}