{"id": 38298, "slug": "tcs-hawx", "name": "Tom Clancy's H.A.W.X.", "name_original": "Tom Clancy's H.A.W.X.", "description": "<p>Tom Clancy&#39;s HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations become increasingly dependent on private military companies (PMCs), elite mercenaries with a lax view of the law. The Reykjavik Accords further legitimize their existence by authorizing their right to serve in every aspect of military operations. While the benefits of such PMCs are apparent, growing concerns surrounding giving them too much power begin to mount. The Enhanced Reality System is the backbone of the HAWX flight experience: radars and incoming missile detection, anti-crash system, damage control system, tactical map and information relay, and weapons trajectory control. E.R.S. also allows players to issue orders to their squadron, making this system as iconic to HAWX as the Cross-Com system is to Tom Clancy&#39;s Ghost Recon Advanced Warfighter. Players can ease into their flight missions and gain a level of comfort with the use of the assistance mode. Once employed, players can take full advantage of their technological support through the E.R.S and gain maximum piloting security. If the situation calls for the player to unleash the full potential of the aircraft, the assistance mode can be switched off and all safety features will be deactivated. For the first time ever in the air-combat genre, players can experience the entire solo campaign in four-player JUMP IN co-op mode. In PVP mode, players can challenge up to 15 friends in intense dogfighting sessions and find out who&#39;s the top gun. Winning players are rewarded with experience points and money to unlock more weapons. Players have the opportunity to take the throttle of over 50 of the world&#39;s most famous aircrafts, as well as being able to dogfight over realistic modern landscapes that have endured years of post-war trauma.</p>", "metacritic": 75, "released": "2009-02-26", "tba": false, "updated": "2023-12-31T18:18:39", "background_image": "https://media.rawg.io/media/games/3fb/3fb75e17d466ccb5f14aa6f49d24feb2.jpg", "website": "http://hawxgame.us.ubi.com", "rating": 3.85, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 346, "beaten": 63, "toplay": 22, "dropped": 43, "playing": 2}, "playtime": 2, "achievements_count": 50, "ratings_count": 65, "suggestions_count": 461, "game_series_count": 1, "reviews_count": 66, "platforms": ["Wii", "Xbox 360", "PC", "PlayStation 3"], "developers": ["Ubisoft", "Ubisoft Bucharest"], "genres": ["Action", "Arcade"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Teen"}