{"id": 383317, "slug": "parachutes-are-for-fucking-pussies", "name": "Parachutes Are For Fucking Pussies", "name_original": "Parachutes Are For Fucking Pussies", "description": "<p><strong>Parachutes are for fucking Pussies</strong> was made in a 72 hours gamejam.</p>\n<p><strong>This game includes crude humour </strong>(who would have thought), because of its rude narrator explaining the <strong>GREATEST STORY EVER TOLD</strong> (or something like that).<br/></p>\n\r\nControlls:\r\n<p>The game <strong>requires a microphone</strong> and a Controller to play, although we are planning to add keyboard support in the future.</p>\n<ul><li>Left Stick to move</li><li>A to jump</li><li>X to progress in dialogue</li><li>Y to start the audio calibration</li><li>Screaming your guts out to get the audiospectrum to push you or other objects (i know sounds weird, but it will make sense trust me)</li><li>D-Pad to snap the audiospectrum</li></ul>\n\r\nKnown Bugs:\r\n<ul><li>The audiospectrum can push the player into a wall, but most of the time you should be able to fiddle your way out (i hope atleast)</li><li>The calibration sometimes fails, if this happens i recommend checking your microphone or restarting the game (or you just move on to the next game idk i am not your dad)</li></ul>\n<p>Feel free to let us know of any other bugs you encounter. We are always looking to improve our game!</p>\n<p>The game was made by two people.</p>\n<p><em>David Heurix</em> did programming and gamedesign<br/></p>\n<p><em>Felix Koller</em> did art and also gamedesign</p>\n<p><em>Moritz Mann</em> did the character controller and part of the level design.</p>\n<p>We wanted to do more in the Level but we only had three days. After the first one we had almost nothing, so we really didn't have a lot of time.</p>\n<p>Hopefully you enjoy the experience even if its a little short. Also it's <strong>free </strong>so don't complain and just play the game (I know this can be said about almost any game on this site, but... still)</p>\n\r\nHand drawn animations wow", "metacritic": null, "released": "2019-10-12", "tba": false, "updated": "2019-10-14T05:14:48", "background_image": "https://media.rawg.io/media/screenshots/a11/a1198ce0f8e2789e172a1989dd551a01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FreshL4ma", "RedPowerLight", "Felix Koller"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}