{"id": 383466, "slug": "the-kings-odyssey-dphan-design", "name": "The King's Odyssey (DPhan Design)", "name_original": "The King's Odyssey (DPhan Design)", "description": "<p>\"After the War between Demon and God, the world is split into four dimensions, connected together by Limbo and was locked away by The 4 Pillars of Pangu. In each of these dimension, a spiritual monkey was born: The Six-eared Monkey, The Stone Monkey, The Horse Monkey and the Long-Armed Monkey. Each of them is the force of nature, who was bornt from essence of an Ancient God, Pangu and have the ability to control a respective Pillars of their dimension. The Story revolve around the struggle and relationship between the four monkeys and their journey to the final battle.\"</p>\n<p>This is my graduated thesis project that I developed in 4 months. This is my adaption on <em>\"Journey to the West\"</em> (aka <em>\"Tales of the Monkey King\"</em>). The project was later join by my friend Ara Manassyan as the Sound Designer. <br/></p>\n<p><em>\"Journey to the West\"</em> has always been the biggest inspiration since my childhood and I plan to move this project forward to make it a full experience in the future. </p>\n<p>This prototype is an Atmospheric Action Side-Scroller that was inspired by other game such as <em>Limbo, Muramasa: The Demon Blade, Sekiro,</em> etc.</p>\n<p>The first stage of the game is focused on the combat system, while the second stage of the game is focused on dialogue system and storytelling. </p>\n<p>I hope everyone have fun playing this little game and I would love to hear what you guys think about the game and what you would like to see it improve on. </p>\n<p>Thank you for playing!</p>\n<p>-----------------------Credits--------------------------</p>\n<p><strong>Game Developer:</strong> Duy Phan<br/>http://DphanDesign.com/</p>\n<p><strong>Sound Designer:</strong> Ara Manassyan<br/>http://ara-sound.weebly.com/</p>", "metacritic": null, "released": "2019-10-11", "tba": false, "updated": "2019-10-14T05:52:12", "background_image": "https://media.rawg.io/media/screenshots/4ac/4acdc4272662defb9bf496c45700efab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DPhan Design"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}