{"id": 383598, "slug": "mystery-case-files-ravenhearst-unlocked-collectors", "name": "Mystery Case Files: Ravenhearst Unlocked Collector's Edition", "name_original": "Mystery Case Files: Ravenhearst Unlocked Collector's Edition", "description": "<strong>Big Fish Editor's Choice!</strong> This title was chosen for its high standard of quality and amazingly positive reviews from our Game Club beta testers.<br/><br/><strong>Warning - Mystery Case Files: Ravenhearst Unlocked is an intense psychological thriller intended for mature audiences.</strong><br/><br/>An all NEW release! In this insane continuation of the Dalimar saga, find out what happened AFTER the events of Mystery Case Files: Key to Ravenhearst!<br/><br/>Eipix delves deeper into the past as you find yourself trapped in the very cell that the Dalimars once occupied. Can you stop Alister before he sacrifices everything - and everyone - in his maniacal quest for immortality? Or will his menacing granddaughters stand in your way? You'll love the loads of mini-games embedded throughout this adventure. The HOPs are full of variety, with silhouette, listed, interactive, and more to choose from!<br/><br/><strong>Eipix</strong>'s continuation of the blockbuster Hidden Object Puzzle Adventure series will leave you breathless, with loads of mini-games embedded throughout your adventure.<br/><br/>See what our Beta testers had to say:<br/><br/>\"High quality graphics and audio. The story line was excellent and the puzzles were clear and thoughtful!\" - Michelle, Beta Tester<br/><br/>\"Great graphics, sounds and controls. Loved the multi-layer puzzles, it's so nice to have a new twist. Eipix is the best developer and never disappoints!\" - Chris, Beta Tester<br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/>Play as Alister Dalimar in the bonus game!<br/>Earn special achievements and replay HOPs<br/>View your collectibles and the souvenir room<br/>Get the available Strategy Guide<br/>Enjoy soundtracks, wallpaper, and concept art<br/><br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-18T02:56:13", "background_image": "https://media.rawg.io/media/screenshots/7b4/7b4bd6115f217b54e19cf241131dd1d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 627, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Eipix Entertainment"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}