{"id": 383550, "slug": "ran-lost-islands", "name": "RAN: Lost Islands", "name_original": "RAN: Lost Islands", "description": "RAN: Lost Islands is an online multiplayer combat game set in the 16th Century era of melee weapons and firearms. 100 challengers play as outcasts, battling to survive as they experience the age of discovery, seek a magnificent ancient treasure, and struggle to flee the cursed islands. A menacing unknown danger devours the islands with scavengers, tornados and tsunami. Before boarding The Black Ship to escape, players equip themselves by looting other castaways, ambushing enemies seeking shelter from the extreme weather, or teaming up with other players to achieve their thrilling goals.<h3>Features:</h3><strong>The Survival Rules of the Pirates</strong><br/>You are the treasure hunter outcast, craving a secret fortune and the legendary artifacts beneath the islands. Great courage and wisdom will be needed to eliminate all enemies - by fair means or foul - and triumphantly return home from the swashbuckling adventure.<br/><br/><strong>Switching between Multiple Classes</strong><br/>9 classes from the three factions - The European Empire, Ming Dynasty and Japanese Shogunate. You may switch between classes using different combat styles to gain fortune and glory.<br/><br/><strong>Melee Vs. Firearms </strong><br/>Venture back to the Age of Discovery, into the battle maelstrom of melee firearms. Sail the high seas, bombarding the enemy with your cannons. Or ambush and hack-n-slash to overrun a mighty vessel. The game even features the terrifying excitement of underwater combat.<br/>With an arsenal of melee weapons from the different factions, and an exhilarating mix of traditional ACT combat controls and combo techniques, your mastery of skills and strategy shall ultimately prevail. <br/>The effective use of early firearms of the game depends on the rhythm and accuracy of your actions. In contrast to other TPS games, how you cooperate with your teammates - to fight tactically and place traps and barrier items - will play a huge part in the outcome of team matches.<br/><br/><strong>A Thrilling Treasure Hunting Adventure </strong><br/>Whether you're discovering high-level equipment or searching for treasure and artifacts, you will need to collect multiple clues at landmarks hidden on the islands such as temples, natural caves, and the walled city, amongst many others. Some ancient holy items are buried in relics or under shipwrecks. <br/>You will face not only other players but also powerful enemies such as the survivors of exotic hunts, wild scavengers in the woods, or even humongous sea monsters! <br/><br/><strong>The Power of the Supernatural Artifacts</strong><br/>The legacy of the ancient gods will significantly empower you to defeat rival players.<br/><br/><strong>It's the Game of Hunters and Their Prey</strong><br/>You will become a trackable target the moment you gather the most treasure. How will you survive this cruel game of slaughter? Are you destined to be the one to escape the islands with a priceless fortune?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-18T02:31:53", "background_image": "https://media.rawg.io/media/screenshots/c0d/c0db2adaea2484bc35247f78821de72a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jolly Roger Game"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "publishers": ["Zodiac Interactive", "Jolly Roger Game"], "esrb_rating": null}