{"id": 38352, "slug": "aether", "name": "Aether", "name_original": "Aether", "description": "Aether is a topdown roguelite arpg that will transport you to a realm of endless possibilities. Prepare to embark on a thrilling journey through dynamically generated maps, where each run promises a unique adventure filled with challenge, power, and jaw-dropping battles.<br/><br/>You'll navigate through a maze of fantastical landscapes, seeking out ancient shrines and formidable bosses that guard the path to your next challenge. With each step, you'll be drawn deeper into an immersive universe where strategic decision-making is as crucial as your lightning-quick aim. Summoning the elements, unleashing devastating spells, and wielding an awe-inspiring arsenal of magical artifacts, you'll vanquish hordes of enemies with every explosive action-packed encounter.<br/><br/>But beware, for this is a world that thrives on chaos. As time ticks away relentlessly, each passing moment intensifies the pressure to push forward. Every decision carries weight, demanding you to consider the risks and rewards of progress in a relentless race against time. Adaptability and resilience become your greatest allies as you navigate treacherous terrains and encounter mind-bending mysteries that challenge both your wits and your combat skills.<h3>Combat:</h3>Fight hordes of enemies using your elemental powers.<br/><h3>Levelup:</h3>Customize your abilities scaling and Fuse skills for stronger abilities.<br/><h3>Upgrades:</h3>Explore the world and unlock different relics to boost your combat prowess.<br/><h3>Bosses:</h3>Fight and defeat The Zone Protectors in order to Ascend to the heavens.<br/><h3>Local-Coop:</h3>Your fight to save the world doesn't have to be a solo adventure. Your friends and family can hop on with their controllers to join you in your adventure to save the world together.<h3>RoadMap:</h3>This is the current plan for the development of Aether. <br/><br/><strong>Demo:</strong><br/>- Survival Game Mode<br/>- 8 elements<br/>- 42+ skills<br/>- 20+ enemy variations<br/>- 3 Maps<br/>- 80+ relics<br/><br/><strong>Early Access:</strong><br/>- Ascension Game Mode<br/>- Bosses<br/>- Content update: (new skills, new Effects, new relics, new maps, and much more)<br/><br/><strong>Full Release:</strong><br/>- Major Content Update. <br/>- Extra game modes (Siege, PVP, etc.)<h3>Game Modes:</h3><strong>Survival:</strong><br/>This game mode is aimed for the player to explore and unlock different elements and skills and complete various challenges while surviving the hoard of enemies coming their way.<br/><br/><strong>Ascension:</strong><br/>This game mode is the main gameplay loop of the game and is a roguelite experience where you attempt at ascending the realms and defeating the various bosses in each zone, unlocking secret zones, and finally beating the final boss.<br/><br/><strong>Siege:</strong><br/>Siege will be a tower-defense kind of game mode, where you have to protect the aetheric crystal from a hoard of monsters while upgrading your powers.<br/><br/><strong>PVP:</strong><br/>have fun with your friends and family to discover who is the best aether wielder.", "metacritic": null, "released": "2008-09-03", "tba": false, "updated": "2023-11-17T08:05:13", "background_image": "https://media.rawg.io/media/screenshots/230/2307c0fca52c7c32c123d98119c60268.jpg", "website": "http://armorgames.com/play/2153/aether", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 6, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 119, "game_series_count": 5, "reviews_count": 4, "platforms": ["Linux", "PC", "macOS"], "developers": ["ORYgames"], "genres": ["Action", "Adventure", "RPG", "Arcade", "Indie"], "publishers": ["Armor Games", "ORYgames"], "esrb_rating": null}