{"id": 383577, "slug": "black-office-entertainment-department", "name": "Black Office - Entertainment Department", "name_original": "Black Office - Entertainment Department", "description": "*** This game is prohibited to players under age 18 ***<br/><br/>This is a visual novel game which is about a girl \"Reiko Kimura\" is the main character who is a 22 years old virgin girl came from the country-side. She has a couple of huge tits with a sex body. The whole story is about her work life in the city, from a new employee to a sex slave of the company. There are <strong>raping, sexual harassment, group sex and lesbian scenes</strong>. Ending of the story will be based on the selection and decision players made for the character.<br/><br/>** Story line information**<br/>Reiko Kimura is a newbie to the society after university graduation.<br/>She was from the country side and dream to live in the big city for a long time. After graduation, she found a job in a company in the city and works in the fourth sales department. So, she said good-bye to her family and boyfriend in the country and came to the city alone. She lives in the apartment which was provided by the company and it's only a few minutes walk to the office. Everything looks wonderful to her from the beginning and she had a big dream about it. Although she understand there could be some sexual harassment happens in office usually. She does not believe that would be a huge matter. Unfortunately.... <br/><br/>\"Shizuri Sayama\" is the second main character of the story who entered the company couple of years before Reiko and had the same experience. She was trying to work with Reiko and escape the situation before it goes worst....", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-18T02:44:02", "background_image": "https://media.rawg.io/media/screenshots/efe/efe6c4582815ce97ee199eee109b7e80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["H-Keration", "mdyeung"], "genres": ["Strategy", "Casual"], "publishers": ["GCG", "Prospect Trio"], "esrb_rating": "Adults Only"}