{"id": 383579, "slug": "slime-slam", "name": "Slime Slam", "name_original": "Slime Slam", "description": "<strong>Features:</strong><br/><ul><li>Classic match 4 style puzzle game!<br/></li><li>4 gameplay modes!<br/></li><li>Local Multiplayer!<br/></li><li>Customizable game rules for extra challenge!<br/></li><li>Controller support!<br/></li><li>Excellent 60 fps gameplay!</li></ul><br/><strong>Modes:</strong><br/>Challenge Mode is a single-player only mode with 30 unique challenges that test the limits of your skill. They range from easier tasks for beginners to brutal trials that require mastery of the game's mechanics. Exciting stuff for veterans and newcomers alike.<br/><br/>Endless Mode is a side-by-side mode for 1 or 2 players (not competitive) with customizable game rules. Choose the speed you want, the number of available colors, whether or not you want the game to speed up over time, starting with \"garbage\" blocks or add periodic garbage block drops as you play, and more! A great mode for casual play and practice.<br/><br/>Versus Mode is a player vs. player mode of intense action. Customize the game rules to your liking, each player can change the rules independently, allowing for a handicap system that allows players of different skill levels to play fairly against one another. So grab a friend and ruin your friendship with this multiplayer mode!<br/><br/>Arcade Mode is a side-by-side mode for 1 or 2 players (not competitive) with fixed game rules. It gets progressively harder the longer you survive. Plays like a classic arcade puzzle game. Aim for the highest score!", "metacritic": null, "released": "2019-10-29", "tba": false, "updated": "2019-10-18T02:44:52", "background_image": "https://media.rawg.io/media/screenshots/383/38387973f1fb44baf316d6b9ed4c4efa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tyler M Richardson"], "genres": ["Action", "Casual"], "publishers": ["Tyler M Richardson"], "esrb_rating": null}