{"id": 383567, "slug": "radical-relocation", "name": "Radical Relocation", "name_original": "Radical Relocation", "description": "<p>You&#39;re moving house! Move your belongings to your new home in Radical Relocation by precariously balancing them on the roof of your car in this extremely challenging physics based puzzle!<br />\nBased on the original Ludum Dare 40 game, Radical Relocation has a challenging take on on the theme, &quot;the more you have, the worse it is&quot;! You are moving house! Carry your luggage on the roof of your car as you embark on your journey! But beware, if you drop or break something, you lose!<br />\nFeatures:<br />\nChallenging physics based gameplay<br />\nMany levels to keep you frustrated!<br />\nBeautiful, relaxing low poly environment<br />\nPotential for expansion and development with new vehicles and maps<br />\nRich keybinding customization<br />\nPartial controller support<br />\nStrategically stack your luggage on the roof of your car like 3d tetris! Be careful! Some items are prone to falling.<br />\nFollow your map to the new house. Maybe take it slow around the corners though! If anything falls off, you lose! Use trailers to help with large loads but be careful where you drive - reversing is difficult! And watch out for trains, they may take you by surprise!<br />\nUse utmost caution while driving! If your luggage falls off, you lose! To win, you must arrive at your destination with all your belongings intact!<br />\nRadical Relocation evolves based on your feedback. Report bugs in game using the Bug Reporter, or join us in our discord server!</p>", "metacritic": null, "released": "2020-01-30", "tba": false, "updated": "2023-08-19T16:17:05", "background_image": "https://media.rawg.io/media/screenshots/abd/abdb11651478604d0b5ec8ec60d21342.jpg", "website": "https://www.winglett.co.nz/radical-relocation/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 50, "beaten": 1, "toplay": 6, "dropped": 3}, "playtime": 1, "achievements_count": 26, "ratings_count": 3, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Winglett Entertainment"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Iceberg Interactive", "Winglett Entertainment"], "esrb_rating": null}