{"id": 383636, "slug": "artificial-extinction", "name": "Artificial Extinction", "name_original": "Artificial Extinction", "description": "Today, our scientists are inventing Artificial Intelligence and Lethal Autonomous Weapons (LAWS) simultaneously.  This game is about our future if we continue to allow these technologies to be developed and combined together. <br/>\n<br/>\r\nArtificial Extinction is a Sentry Defense game involving Real Time Strategy elements played from the First Person point of view. The story is very relevant to today’s topics of the race to invent Artificial Intelligence, LAWS, AI Murder Policy debate and  military’s implementing robotics and drones on today’s battlefield. <br/>\n<br/>\r\nSet in the future, you play a colonist seeking a peaceful planet for your new home. Your mission is to find a safe place on the planet for your family to join you in 9 days. The planet has had terra-forming robots working for decades in preparation for human colonization. But  the AI humanity invented has become an enemy and discovered this planet. Are the robots on the planet waiting for you hostile? <br/>\n<br/>\r\nYou have 9 days to find a safe place on the planet. At the beginning of the day, the ship will drop you off on the planet and then orbit above you where it is safe. You have to setup a miner to collect fuel for the ship but hostile robots will advance towards you. You have Sentry  Weapons that you setup around you to provide you protection while the miner is collecting fuel. Once enough fuel is collected, your ship will descend to pick you up and you continue your journey looking for a safer place on the planet. <br/>\n<br/>\r\nArtificial Intelligence is making news headlines every day and there is a global tech race to lead its innovation, but are we carefully considering the dangers of what we’re inventing?  LAWS can independently search and engage targets based on their programming. Giving drones and robots life and death decision making authority is being developed without adequate protections and policies in place. <br/>\n<br/>\r\nIn the game, the enemy robots continually adapt to your defensive strategies and you have to also adapt to survive. The enemy AI learns, shows creativity, improves their technology and changes their strategy. To be able to survive, you must always stay one step ahead.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-18T03:14:51", "background_image": "https://media.rawg.io/media/screenshots/2f7/2f7a69d9efdd950564037a3aaa12b96a.jpg", "website": "http://www.artificialextinction.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["100Hr Games"], "genres": ["Action"], "publishers": ["100Hr Games"], "esrb_rating": null}