{"id": 383650, "slug": "stranded-sails-explorers-of-the-cursed-islands-2", "name": "Stranded Sails – Explorers of the Cursed Islands", "name_original": "Stranded Sails – Explorers of the Cursed Islands", "description": "Stranded Sails – Explorers of the Cursed Islands is an open world, exploration and farming adventure full of quests and discovery! You’re ship-wrecked on a mysterious archipelago.  It's up to you to survive and solve the mysteries deep in the heart of the islands, then finally escape! <br/>Farm, build and cook to survive as you take charge of creating a camp full of survivors. With the goal of building a new ship to escape, you set off on a journey across a wealth of islands for useful treasures and items!<br/>Many exciting quests await you – as well as numerous dangers and threats. Will you solve the secret of the cursed islands? It's the only way to escape. Awaken the adventurer deep inside!<br/>Key Features<br/>•\tExperience an open-world adventure full of story driven-quests <br/>•\tFarm and cook to survive! <br/>•\tManage the creation and expansion of your crew’s camp <br/>•\tExplore a diverse array of different islands by foot or boat <br/>•\tFight against supernatural dangers and solve the secrets of the cursed islands<br/><br/>1 player<br/>1GB minimum save size<br/>DUALSHOCK®4<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>Stranded Sails – Explorers of the Cursed Islands © Copyright 2019. Developed by LemonBomb Entertainment. Published by Merge Games. All rights reserved.", "metacritic": null, "released": "2019-10-17", "tba": false, "updated": "2019-10-18T03:21:42", "background_image": "https://media.rawg.io/media/screenshots/eb8/eb8a14d5724c0bea6fbba580b184ca9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}