{"id": 383637, "slug": "beataim-rhythm-shooter", "name": "BeatAim - Rhythm Shooter", "name_original": "BeatAim - Rhythm Shooter", "description": "<h3>BeatAim</h3> Goal is simple: <strong>Unite Music and Shooter Games</strong><br/><br/>BeatAim is a <strong>rhythm game</strong> designed for <strong>FPS</strong> players with AI generated maps. FPS trainers like Kovaak's are pretty good but quickly become boring and repetitive. 2d games like osu! are amazing but have limited content. BeatAim has been developed over last 2-3 years in my free time. After testing many solutions I've finally found perfect one. Not only it is possible to open <strong>any</strong> music but also to deeply <strong>customize map generation</strong>. Every gameplay new map is randomly created based on the song. This makes reflex more important than memory which is not the case in other rhythm games.<h3>Why?</h3>Hey, I'm Kamyker and here's how and why this game was created:<br/><br/>When I started playing BF4 competitively back in 2015 I was always looking for tools and ways to improve my aim. Anything I found was boring and I couldn't use if for more than few days. I started making my own trainer similar to osu but I wanted it work with any music and in 3d-space. At some point I quit my job as Game Developer (as company didn't want to give me a week off to attend lan event lol) and my esports career stopped so I decided to show BeatAim to the world. After fairly successful alpha and ~100 copies sold with almost no marketing it's time for Steam release.<h3>Features</h3>Slowly BeatAim is evolving from simple aim trainer to fully featured game:<br/><ul><li>4 targets types - simple click, slider (hold mouse button, tracking aim), slider with invisible path, WASD arrows (to prevent players from using keyboard to shoot)<br/></li><li>preconfigure maps - 7 music maps with 5 difficulties each, they work with rankings and has to be unlocked in progression system<br/></li><li>rankings - see how your skills are compared to other players<br/></li><li>tournaments - esports support with real prizing is also planned<br/></li><li>progression system - earn BeatCoins by playing the game and unlock new maps, guns and soon also skins<br/></li><li>daily quests - some items have to be crafted and require special materials that are available from daily quests<br/></li><li>battle pass - soon small battlepass will be available to everyone that bought the game <br/></li><li>referral system - if you are a creator you can easily earn premium ingame currency that in the future will be tradeable to Steam Wallet $</li></ul><br/>VIP Features<br/><ul><li>map generator - open any song (mp3, wav, ogg), configure 14+ parameters and create your favorite maps<br/></li><li>founder role on discord<br/></li><li>season battle passes - soon when bp are out vips will get them for free</li></ul><h3>Pricing</h3>You get 2 months of vip after buying the game for free. After that vip costs 5$ per month. Map generator is hosted in the cloud and that's a way of protecting and supporting it. You can also win vip in the tournaments or get it from your referrals.<h3>Future</h3>As I own this project it will get better infinitely. Right now it's only beginning... I have few ideas about new modes and multiplayer with one of the most unique way of playing fpses in history. Up to you if I'll be able to create it :)<h3>Trailer Music</h3>\"Collides Remix\" by Dysfunction_AL<br/><br/>\"Dragon War\" by Makai Symphony<br/>\"Who We Are\" by Hans Atom<br/><br/>Video itself is:<br/>2019 - Licensed under<br/>Creative Commons<br/>Attribution-ShareAlike 3.0", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-10-18T03:15:17", "background_image": "https://media.rawg.io/media/screenshots/3fb/3fb3861411e3bee2cdd96ee575ab877d.jpg", "website": "https://beataim.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kamyker"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Kamyker"], "esrb_rating": null}