{"id": 383610, "slug": "unsouled", "name": "Unsouled", "name_original": "Unsouled", "description": "<p>Face your fate  – Set in a beautiful but haunting world, Unsouled is an atmospheric Action-RPG about a mysterious power used with deadly purpose. Featuring highly-stylized combat that’s fast-paced and rewarding, there’s less focus on puzzling so no time is wasted on finding the way forward on your journey. Follow the path of fate, and face the challenges that lie ahead in this new game from independent developer Jinsub Jung.<br />\nUnravel the tale – Follow the story of a boy and girl with fate intertwined, brought together through a shared ability to absorb the souls of the dead. Discover how they use this power with different intent through environmental storytelling, where more is revealed by interacting with the world around you.<br />\nCombine deadly attacks – Counter your opponent and strike, using sword slashes, dashes, and soul powers in a graceful combat system that rewards player dedication. With a variety of unlockable abilities and an additional Training mode, you can learn to quickly dispatch enemies with a lethal arsenal of powerful chain combo attacks.<br />\nStrengthen your resolve – Absorb the souls of the fallen and use them to grow your power. Enhance strength, learn new skills, and improve combat abilities.<br />\nExplore detailed environments – Played from a top-down perspective but developed in 3D, Unsouled has a richly detailed world brought to life by a distinctive pixel art-style and ambient audio design.<br />\nPlay Unlimited Mode – After finishing the story, challenge yourself in Unlimited Mode and face off against a relentless wave of never-ending enemies to see how long you can survive.</p>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2024-03-18T11:23:54", "background_image": "https://media.rawg.io/media/screenshots/444/44418b570704f14b567cddeddeaa0607.jpg", "website": "", "rating": 2.7, "rating_top": 3, "added_by_status": {"yet": 6, "owned": 137, "beaten": 2, "toplay": 19, "dropped": 5, "playing": 1}, "playtime": 3, "achievements_count": 104, "ratings_count": 10, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "macOS"], "developers": ["MeGusta Game"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["PQube", "NEOWIZ"], "esrb_rating": null}