{"id": 383608, "slug": "terminal-protocol", "name": "Terminal Protocol", "name_original": "Terminal Protocol", "description": "Terminal Protocol is a turn-based tactical game set in a dystopian cyberpunk universe. Become a hacker - command your viruses in cyberspace to overcome corporate defences and jack into people’s minds. Upgrade your malware, reclaim your position and reveal the secrets of the past!<br/><br/><br/>Deep tactical, turn-based combat system based on covers and inspired by XCOM series. You are a lone hacker fighting against giant corporations. Be smart to defeat them.<br/><br/><br/>Manually aim weapons of your viruses. Perform precision shots and cool ricochets to use the environment to your advantage. No RNG, only skill matters.  <br/><br/><br/>Find new and creative ways to manipulate enemy AI. Discover new ICE versions, learn their weaknesses and turn it against them. Reconfigure programs, disable their abilities. Hack your way into victory.<br/><br/><br/>Three classes of viruses with different upgrades, skills and development possibilities. Develop each of them in your own way and adapt them to the mission conditions.<br/><br/><br/>Fight your way through complex levels, that will test your tactical and strategic thinking in diversified ways. Hack corporate vaults, personal databases, secret science labs and even minds of the people connected to the cyberspace.<br/><br/><br/>You were once a powerful hacker, but now, after a failed mission you lost everything. Your software is gone, and you have thirty days to pay off your debt to the mafia - one million credits. With the help of an old friend, you have to reclaim your position and reveal the secrets of the past.<br/><br/><br/>Game graphics and audio are stylized for a retro feeling based on 80s cyberspace visions and synthwave music. That means our cyberspace is filled with a retro grid and a lot of adrenaline-pumping synthesizers!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-18T03:01:01", "background_image": "https://media.rawg.io/media/screenshots/202/20274fa169d54ff026345786867344be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["No Rush Games"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["No Rush Games"], "esrb_rating": null}