{"id": 383614, "slug": "demoncrawl", "name": "DemonCrawl", "name_original": "DemonCrawl", "description": "<strong>DemonCrawl</strong> is bursting with content!<br/><br/><br/><ul><li><strong>500+ unique items</strong> to discover and collect: whenever you find something new, we'll record it in your Codex for future reference.<br/></li><li><strong>5 Quests &amp; multiple difficulties</strong> for a long-lasting challenge!<br/></li><li><strong>50+ diverse stages</strong> to explore: think you've seen everything? Then it's time to dive into the Endless Multiverse, where stages are blended together and randomized for virtually unlimited possibilities. <br/></li><li><strong>50+ stage mods</strong> to keep things unexpected: from \"Dark Burning Forest\" to \"Double Dry Ocean\" and everything in between - DemonCrawl stage mods can have a dramatic effect on how you approach the game board!<br/></li><li><strong>Open-ended player progression</strong>, the roguelite way: find Tokens while playing and spend them on Talents that complement your playstyle. DemonCrawl lets you create multiple profiles in case you want to experiment with different builds.<br/></li><li><strong>Gamemodes galore</strong>: in addition to the standard Quests, we've got <strong>Endless Multiverse</strong>, a daily <strong>Hero Trial</strong>, an extra-tough 3-stage mode called <strong>Beyond</strong>, a simple <strong>Tutorial</strong>, and yes, even a <strong>Classic mode</strong> for the purists.<br/></li><li><strong>15 unlockable Masteries</strong>: enhance your runs with passive effects and charged abilities! Are you more of a KNIGHT or a SURVIVOR? A perilous HUNTER or a penny-pinching BANKER? A glorious FIREFLY or a special SNOWFLAKE?<br/></li><li><strong>Customize your profile</strong> with cosmetics: build up your collection of Avatars and Inventories, then get wild with super-rare Paint drops... assuming you're lucky enough to find one!<br/></li><li><strong>Online leaderboards</strong> for DemonCrawl savants: there's a leaderboard for every quest in Hard mode and above - including the daily Hero Trial. All scores are cross-platform, which means you get to flex on mobile players. (Sorry mobile players)<br/></li><li><strong>There's a crafting system too</strong>: solve blueprints, then craft your favorite items at will.<br/></li><li><strong>100 achievements</strong> and yes they are tough.</li></ul>", "metacritic": null, "released": "2019-11-05", "tba": false, "updated": "2023-03-05T12:30:59", "background_image": "https://media.rawg.io/media/screenshots/17e/17e8e7b363464543a4c853b20954e8b1.jpg", "website": "https://demoncrawl.com", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 38, "beaten": 2, "toplay": 3, "dropped": 4, "playing": 4}, "playtime": 5, "achievements_count": 177, "ratings_count": 14, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC"], "developers": ["Therefore Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Therefore Games"], "esrb_rating": null}