{"id": 383714, "slug": "zombieland-double-tapper", "name": "Zombieland: Double Tapper", "name_original": "Zombieland: Double Tapper", "description": "Hit the road and go on zombie-smashing adventures with your favorite wisecracking survivors in Zombieland: Double Tapper. Remember the rules and BE A HERO as you lead your squad across the wastelands of America. It’s time to NUT UP or SHUT UP!<br/><br/>Set in the post-apocalyptic American universe of Zombieland, players will build squads of quirky characters, collect devastating equipment, and survive against a variety of brain-hungry zombies in this addictive Idle RPG. <br/><br/>KEY FEATURES: <br/><br/>THE BUDDY SYSTEM:<br/>Collect a diverse roster of heroes, featuring all-new characters exclusive to Zombieland: Double Tapper and your favorites from the film - Columbus, Tallahassee, Wichita, and Little Rock. <br/><br/>SEAT BELTS :  <br/>Buckle up and go on action-packed road trips to famous American destinations with a post-apocalyptic twist including Boston, Las Vegas, Atlanta, and more! Send multiple squads out on runs simultaneously to rake in more loot! <br/><br/>DOUBLE TAP: <br/>One in the chest, one in the head! Tap to target zombies as you fight off hordes of the undead. Tap to activate unique and fun abilities for each hero. Tap to upgrade your characters, weapons and  new skills.<br/><br/>SHOOT FIRST: <br/>You’re going to need to pack a punch to take on gigantic waves of zombies and bosses. Collect and upgrade a ton of deadly weapons including rifles, pistols, machine guns, and knives! <br/><br/>ENJOY THE LITTLE THINGS:<br/>Quips, banters, and one-liners. All the beloved elements from the movie are carefully crafted into your road trip escapades! <br/><br/>Facebook: https://www.facebook.com/zombielandtap<br/>Twitter: https://twitter.com/Zombielandtap<br/>Website: http://zombielandgame.com/<br/><br/>This casual game may include advertising tailored to your interests on behalf of the Sony Corporation family of companies, as well as third parties. To learn more about this, visit www.aboutads.info. To exercise certain choices regarding interest-based advertising, visit www.aboutads.info/choices. You may also download the App Choices app at www.aboutads.info/appchoices.<br/><br/>Terms of Use: https://www.sonypictures.com/corp/tos.html<br/>Privacy Policy: https://www.sonypictures.com/corp/privacy.html", "metacritic": null, "released": "2019-10-16", "tba": false, "updated": "2019-10-18T03:45:21", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a7fa3caf5834f1c454f4a3254852c1a_toMVzfq.jpg", "website": "http://zombielandgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sony Pictures Television"], "genres": ["Adventure", "RPG"], "publishers": ["Sony Interactive Entertainment"], "esrb_rating": "Teen"}