{"id": 383833, "slug": "fielders-choice", "name": "Fielder's Choice", "name_original": "Fielder's Choice", "description": "Here’s the pitch…<br/><br/><br/><br/>Are you tired of watching your baseball or softball player standing around while in the field and watching the game?<br/><br/><br/><br/>From tee-ball to the Majors, any coach will tell you that one of the keys to winning baseball and softball is limiting the bases taken by the opponent.  Now you have a tool to help instruct your fielders on the when, where and why!<br/><br/><br/><br/>Fielder’s Choice – developed by an educator and coach - is the first and only app that teaches when, where and why almost all defensive players should be moving on the diamond for every batted ball, regardless of the situation.  Create a player, choose a difficulty level and a position and start playing… all the while keeping an eye on the number of outs and base runners.  Players will learn to think before the pitch, where to back up throws, to which base to throw, and other tips from the in-app coach.  Make the right call?  Hear the cheers!  Make a mistake?  You’ll hear something as well, while getting coached along in the process.  Start a streak of good play, while Fielder’s Choice records your stats.  Think you’ve got it down?  Challenge yourself by being assigned a random position and really get strategizing!<br/><br/><br/><br/>With over 1900 different scenarios in five difficulty levels, your player – or whole team – will soon be playing engaged, aggressive team defense, improving both their individual and overall play.  If they play the game, they should play this app.  Make Fielder’s Choice your player’s new assistant coach!<br/><br/><br/><br/>And remember: Defense Wins!", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-10-18T04:30:21", "background_image": "https://media.rawg.io/media/screenshots/e3c/e3c3ea9a4fae49a81ac50c9afbc74ea9_LIoD3qb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DAVID BIELAT"], "genres": ["Sports"], "publishers": ["DAVID BIELAT"], "esrb_rating": "Everyone 10+"}