{"id": 384154, "slug": "skyous-itch", "name": "Skyous (itch)", "name_original": "Skyous (itch)", "description": "<p>Sky living Skyous descends upon earth to visit his mother only to find the world completely drained out by <strong>Imitheos</strong>.<br/><br/>The game is a real-world adventure from Sao Paulo Brazil to Tokyo Japan<br/>The mechanics are quirky. The music is celestial and the graphics are vivid.</p>\n\n<p><strong>Trailer &amp; Screenshots</strong></p>\n\n\n<p><strong>Links</strong></p>\n<p>Skyous is available on Steam, App Store and Google Play.</p>\n<br/><br/>\n\n<p><strong>Dunedin, Skyous and resources</strong></p>\n\n<p>It all started in Dunedin, New Zealand.<br/>That magical place made me enter the world of Game Development and conjure Skyous in a day's night. I will not speak of Dunedin. She's too charming to be manifested with words.<br/><br/>So I joined Unity earlier this year, 2019. With regard to the dangerous idea of cross-platform game development. I pushed forward. For I desired experience in both fields. I took a big risk with Skyous. For it was both aside and a full-time project. On some occasions I will bring fourteen hours a day in development, and at others, I would skip out for a week or more. I did not realize how demanding a fully developed game is. It's like .. a real baby.<br/><br/>For the <strong>resources</strong>, the audio you hear in Skyous is entirely made by a British sound engineer, few graphical assets were purchased and fewer still are the purchased scripts. The rest was hand made.<br/><br/>Due to my non-existent experience in gaming. I made Skyous a 2D game with a 3D concept. Skyous should have been a 3D game, however.<br/><br/>Whenever this version becomes even a slight success (production break even point reached). I will make a better and professional 3D version with advanced functionality like multiplayer.<br/><br/>Skyous production cost : -<strong>$17,800 USD</strong> ( mostly time )<br/></p>\n\n\n<p><strong>Reality Shock</strong><br/><strong>T</strong>hree weeks in a whirlpool with Game influencers, journalists and publishers left me in awe.<br/>My main focus was on Youtubers/Streamers. From the two hundred personal emails I sent, only seven responses were yielded. Five demanded I pay a huge sum upfront and the remaining two apologized for no longer participating in Game Reviews and generously \"wish you luck\"-ed me.<br/><br/>Now I come from a totally remote industry, electronics, electricity, and software. My variant skills, while resilient, do not even remotely intersect with social media marketing. To add insult to injury, I myself don't value/use social-media. Which only means ...  ???<br/><br/>\"<em>Don't suffocate over it, it's just a game</em>\" - I keep reminding myself ;]<br/><br/>I will try and publish few posts here in there (by that I mean this post actually). Maybe by some luck, a Youtuber would review Skyous for the fun of it.<br/><br/>But in shorts, If I am going to name one big mistake in my first unity project.<br/>I would call up <strong>digital marketing</strong>. It surely requires it's own time and resources.<br/><br/>A friend of mine spoke of Kickstarter. Perhaps I will understand what that is soon. </p>\n\n\n<p><strong>Feedback &amp; Contact </strong><br/>Leave me feedback by using this eloquent Google survey.<br/>Also, let's talk about Skyous &amp; You. DM here or on my newbie account on Twitter. </p>\n<p>                                       <br/></p>\n\n<p><strong>Results </strong><br/>Whether <strong>1</strong>, <strong>10,000</strong> or <strong>1,000,000</strong> unit/s will be sold in Skyous. Let us all lay back, grab our favorite drinks and watch how far this bad boy will reach! </p>\n<p>- mine is heartbreak juice (ar) عوار قلب</p>\n<p><em>** Skyous sales will be updated every day for a week or so ( Units sold, impressions, revenue, news, etc..) **</em><br/><br/>Wish him luck </p>", "metacritic": null, "released": "2019-10-16", "tba": false, "updated": "2019-10-18T05:41:23", "background_image": "https://media.rawg.io/media/screenshots/b36/b3613495ffe3d5dda63a3d449f5176ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nomisma Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}