{"id": 384170, "slug": "candy-smack-sweet-match-3-crush-puzzle-game", "name": "Candy Smack - Sweet Match 3 Crush Puzzle Game", "name_original": "Candy Smack - Sweet Match 3 Crush Puzzle Game", "description": "<p>Play now the best new match 3 game you will ever see: Candy Smack - Sweet Match 3 Crush Puzzle Game<br/><br/>Sweet cookie smash kingdom is built with gummy drop jellies, candies, delicious cupcakes, lollipop, juicy fruits, delightful pastries, lovely biscuits, cookies and much more.</p>\n<p>Connect lines to match3 or more to smack jelly world by collecting biscuits, pastry, jellies and sweets to complete and move to the next fabulous levels. Swipe and match many cookies in a single draw and earn extra moves and starts to go through the journey of sweet candy fever new world. Collect boosters by matching more numbers gummy drop jellies, chocolates, cupcakes, and pastries to complete the lever quickly and earn extra points and stars.<br/><br/>Explore different levels to get experience the adventure of Sweet Candy Fever. With real-time HD graphics, stunning design and fabulous backgrounds make your candy journey worthwhile. This Sweet Story consists of lollipops, biscuits, cookies, jellies, chocolates, cupcakes, lollipop, sweets, pastries, fruits, cherry cakes, wafers, donuts, stripes and much more.<br/><br/><strong>GAME FEATURES</strong>:<br/>✔ Over 500+ well-designed levels of adventure jelly world<br/>✔ All new match 3 puzzle game with superior graphics and integrated with leaderboards and achievements<br/>✔ Advanced game play to collect the target cupcakes and cookies<br/>✔ Compelling and adventure puzzles in every level<br/>✔ Free to play and in-app purchases to get extra moves and lives<br/>✔ Play with family and friends to challenge and compare the high scores<br/>✔ Cute graphics and designs at each level<br/>✔ Unlock new achievements to challenge your friends and family on the leaderboard.<br/>✔ Facebook connection so you can share the adventure with friends<br/><br/><br/><strong>HOW TO PLAY</strong>:<br/>Swap and match cookies in a line of three or more<br/>Match 4, Match 5 or Match 6 candies in a single draw to make powers fruits<br/>Play in short time and lesser moves to collect boosters to beat the tough levels<br/>Play to earn 3 stars at every level to collect power candies to overcome obstacles<br/><br/><br/>◆ Please continue to rate and review the game. We read every comment to help us to create the games that you want!<br/><br/>😘 Be with candy fever new on this most interesting Yummy Match 3 game!<br/><br/>★★★★ Enjoy cookie family with hours of fun!, Download Now FREE! ★★★★★</p>", "metacritic": null, "released": "2019-10-16", "tba": false, "updated": "2019-10-18T05:44:54", "background_image": "https://media.rawg.io/media/screenshots/7ea/7ea82c036b6c74b0e96202b60727b117.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Launchship"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}