{"id": 384125, "slug": "filmi-detective", "name": "Filmi Detective", "name_original": "Filmi Detective", "description": "<p>Detective Homelock Shers needs your help to embark on this quest which will test your knowledge about movies as well as your analytical &amp; logical skills. <br/><br/>Each level of this game is a Cryptogram (a puzzle that consists of a short piece of encrypted text). It's a hidden Movie Quote which needs to be guessed in order to complete the level.<br/><br/>Yellow tile means it needs to be replaced with correct letter.<br/>Grey tile is already established as correct letter.<br/>Green tile suggests your assumption about correct letter. It can either be right or wrong, but you hardly go wrong, don't you?<br/>Red tile shows that guessed letter is wrong one. <br/><br/>Keyboard has alphabets to pick correct guesses. White alphabets are available &amp; blue ones are already used. Keyboard has reveal help &amp; reveal mistakes options which can help you throughout the level but those will cost hints. You can clear any unwanted letters or reset the level in case you are stuck. <br/><br/>There are almost 2000+ best Movie Quotes from English, Hindi &amp; Marathi movies. If you ever liked a decent Movie Quote, it is highly likely that you will encounter it as one of the levels while playing this game.<br/><br/>Game tutorial video is made available which shows game-play for first 3 levels in English movie category. Please note that for first 3 levels no hints will be deducted. Use as much hints as you like. <br/><br/>Let us know how you feel about the game by rating it on Play-store. Reviews help us to improve further. If you have any suggestions/corrections or you would like your favorite Movie Quote to be added in the game, just write back to us. Hope you enjoy playing the Filmi Detective.</p>", "metacritic": null, "released": "2019-10-11", "tba": false, "updated": "2019-10-18T05:34:48", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9aeae126f232f711aaaa10815ca767.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NileshPalshetkar"], "genres": [], "publishers": [], "esrb_rating": null}