{"id": 384227, "slug": "harry-potter-life-in-puzzles-jicsaw-puzzles", "name": "Harry Potter: Life in Puzzles. (Jicsaw puzzles)", "name_original": "Harry Potter: Life in Puzzles. (Jicsaw puzzles)", "description": "<p>Puzzles, Harry Potter will plunge you again, into the world of magic and wizardry.Puzzles is an old and exciting game that has not lost its popularity for a long time. The meaning of the game is very simple: the player needs to assemble a picture from small pieces. Their shape and quantity can be very different. There are very easy puzzles that can be assembled in a couple of minutes, but some need more time.</p>\n<p><strong>In the game Harry Potter: Life in Puzzles, you will no doubt like:</strong></p>\n<p>- Fragments, scenes from the 7 seasons of Harry Potter!</p>\n<p>- Ability to collect puzzles without the Internet!</p>\n<p>- A variety of puzzles to choose from - over 1000 high-resolution puzzles!</p>\n<p>- The ability to participate in the in-game ranking of players!</p>\n<p>- 7 difficulty levels, the difficulty in each season is different, up to 220 pieces - Start from the basics and become the Great Wizard!</p>\n<p>- Collect several puzzles at the same time and track your progress!</p>\n<p>- Open cards of magicians in the Hall of rewards.</p>\n<p>- Puzzles with the mode of rotation of the pieces - a game of logic for real potteromania!</p>\n<p>- Extremely simple interface and at the same time magical.</p>\n<p>- Use spells in Harry Potter mode!</p>\n\n<p>This is actually a game that a Harry Potter fan cannot miss !!!</p>\n<p>Add some magic to your life!</p>", "metacritic": null, "released": "2019-10-15", "tba": false, "updated": "2019-10-18T06:01:52", "background_image": "https://media.rawg.io/media/screenshots/6fa/6fa910ca27b685f53a62b317a26e1cf8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Scythia"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}