{"id": 384206, "slug": "monster-of-the-pines", "name": "Monster of the Pines", "name_original": "Monster of the Pines", "description": "<p>Artist’s statement<br/></p><p>When I started this interacted story, I wanted to create a Lovecraftian adventure that allowed the player to enter a world where the eldritch gods of fiction have left the world a nightmare. I’ve tried to intertwine as many elements of Lovecraftian fiction into this story to create a compelling world with compelling choices and moral dilemmas. This kind of horror is best left to the imagination, so in my writing, I tried to create a world where the player/reader would be able to fill in the blanks and create a more compelling experience for themselves. <br/>At the heart of the story though, I wanted to tell the simple story of a girl looking for her lost father. Her struggle with her self-doubts and fears are at the forefront of her character. Her needs that she must overcome are building confidence in herself by going through a gauntlet of tests that will eventually decide if she has it in her to survive in this apocalyptic nightmare. This is in contrast with her want to be protected, namely by her father. This balance of trying to overcome this deeper inner need without giving in to her fears and seeking an easy escape through her actions to fulfill her want drives the story. While the character Lily can find several groups and ultimately must choose how to help or escape them, at the end of the game, I want her character to feel like it’s been tested and has overcome some growth, no matter the choices of the player. <br/>This idea started as a ten-page screenplay for a short film I wrote a while back, but when introducing the world through an interactive fiction, I found that I was able to create a much more detailed and morally questionable story, with the player being able to perform good, evil or even remain stagnant if they so choose. I wanted to build on the mystery of this missing father and the workings of the world itself. Ultimately the story came to branch out along 5 different paths, with the player having the ability to abandon pathways in their main objective of finding Lily’s missing father, or they can follow the tangents and find further information on how this world works. By having these five distinct branches, I introduced a lot of choices where the character must make life or death decisions. <br/>When choosing how these decisions work, I didn’t want to impose my moral system on the player, thus allowing them to make their own choices. I worked to justify each choice from a character perspective and again I wanted to create an experience where every choice had consequences. For example, not performing certain actions or events would lead to not having the information or ability to successfully pass a test at a later point. I wanted to reward the player for the choices they made, but I didn’t want to have this lead to dead ends. I wanted the story to resolve no matter what. Each path offers something that could fulfill the needs and wants of our protagonist, and no path is ultimately pointless. I built story beats to allow the player to feel justified in their choices, and eventually hint at the finale.  <br/>The most difficult part of this story has been the scope I gave myself and wanting to develop the character of Lily first and foremost with every choice. I didn’t want to let any of the many endings that occur to feel cheap or unearned.  While there are many ultimately negative endings, I didn’t want them to come out of anywhere or feel unfair to the player. This was ultimately a hard balance to strike. I hope when playing through this game, you have all the options you would wish to make in these situations, and I hope these ultimately feel like you as the player are really in control of these outlandish and horrific circumstances.  </p>", "metacritic": null, "released": "2019-10-16", "tba": false, "updated": "2019-10-18T05:55:21", "background_image": "https://media.rawg.io/media/screenshots/a11/a1157c176135142db6022443d05d580d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nickmv"], "genres": [], "publishers": [], "esrb_rating": null}