{"id": 384334, "slug": "rifle-storm-pre-alpha", "name": "Rifle Storm Pre-Alpha", "name_original": "Rifle Storm Pre-Alpha", "description": "<p>This is an early playable version of Rifle Storm. Not all planned features are in the game, and it's missing a lot of polish. But don't get us wrong, the game is largely stable and fun.</p>\n<p>By providing you access to the game earlier, we're able to incorporate more feedback and build the community. In-game anonymous analytics also allow us to see how the game is being played and make tweaks accordingly.</p>\n<p>Your feedback will allow us to move into Steam Early Access next year with confidence. Thanks.<br/></p>\r\nFeatures\r\n<ul><li><strong>Complete Your Mission</strong>: Explore through 7 randomly-generated regions to reach the final mission.</li><li><strong>Tactical combat:</strong> Direct soldiers to snipe for headshots from a far or backstab at close range. Or even hurl tactical grenades.</li><li><strong>Build the ultimate squad:</strong> Select a squad leader, choose your classes, equip your gear and pick your abilities.</li><li><strong>Procedurally generated:</strong> Regions, maps and enemies are all procedurally generated, no play through is ever the same.</li><li><strong>Random Events: </strong>While exploring worlds, encounter events that will have big impacts on your run.</li><li><strong>Gear Up: </strong>While exploring worlds, stores offer new rare items and supplies to help you.</li></ul>\r\nRoadmap\r\n<p>Our plan for the next few months include:</p>\n<ul><li>Leaderboards to track highscores</li><li>Polish artwork</li><li>Improve gameplay balance</li><li>Add missing sound effects</li><li>More content: levels, events, items, classes, etc..</li><li>Hire a composer to create an original soundtrack</li><li>Implement proper climatic ending</li><li>Add difficulty settings</li></ul>\n<p>Of course our primary source of feedback is you! And priorities will always change. Please submit feedback in game or on our Discord server using Rifle Bot.</p>\n<p>We try to push out weekly updates, so keep an eye on this page.<br/></p>\r\nJoin our community:\r\n\n<p>Rifle Storm has a Steam page! Please consider adding it to your wishlists, you will receive a notification when the game releases there.<br/></p>\n<p>Alternatively, you can sign up for the monthly newsletter, you'll receive email updates and of course an email when the game is released.<br/></p>", "metacritic": null, "released": "2019-10-14", "tba": false, "updated": "2019-10-18T06:25:22", "background_image": "https://media.rawg.io/media/screenshots/6e6/6e6b9f17ccedf9557de672b175788d94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ben D'Angelo"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}