{"id": 384386, "slug": "a-detectives-novel-itch", "name": "A Detective's Novel (itch)", "name_original": "A Detective's Novel (itch)", "description": "<p>On a cold November night in a desolate estate deep in the mountains an innocent life has prematurely perished. Surrounded only by his family and closest friends, a controversial yet immensely successful businessman William Goldberg passed away under mysterious circumstances. Being an upstanding member of society and the owner of Goldberg Industries, a multi-million dollar arms company responsible for providing the military during the World War 2, news of his death caused an uproar at the local police department. It seemed the case was tailor-made for the legendary detective Knox, a prodigy who successfully solved over hundred cases. Accompanied by an aspiring young detective Clark assigned by the Chief to keep an eye on him, Knox departs towards the Goldberg's estate to discover the truth behind the incident. <br/>Miles away from nearest settlement in a mansion hidden from the eyes of public, it is only natural to presume that only those present at the time could have been involved. Follow clues, look for evidence and discover key information by interrogating the suspects. All pieces of the puzzle will be presented and it's up to you to deduce who, how and why the murder happened. A mystery visual novel inspired by classic novels from Arthur C. Doyle and Agatha Christie and \"When They Cry\" series.</p>", "metacritic": null, "released": "2019-10-08", "tba": false, "updated": "2019-10-18T06:36:13", "background_image": "https://media.rawg.io/media/screenshots/ebf/ebff263750c8a1a33906027ffb69bbb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amaterasusoftware"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}