{"id": 384431, "slug": "eternal-return-rpg", "name": "Eternal Return RPG", "name_original": "Eternal Return RPG", "description": "<p>Eternal Return RPG is an amazingly fun and beautifully illustrated Strategic RPG created for mobile platforms that can be played offline.</p>\n<p>This is a turn based rpg with simple mechanics: just select an attack and set your target. Move, strike or collect prizes with just a tap on the board.</p>\n<p>Eternal stands out from other SRPG for its detailed illustrated scenes. It will take you through an epic story, based on Nordic and Japanese mythology, to find the catharsis and fulfill the hero's destiny. Fight against many monsters and final bosses, like the Yokai king and his yurei minions, the King of the forest or the Sun Queen.</p>\n<p>Eternal Return is a free to download and free to play rpg. All game content is available and can be obtained for free. It will only depend on your ability and effort to unlock the most powerful weapons and most dangerous spells by collecting chests and cards. There is no limiting stamina or energy. The purchases are optional and useful for completing your collections faster, but not needed for finishing the game.</p>\n<p>Tactics are important when fighting battles. Attacks are divided into three groups: weapons, magic spells and your Kami pet special attacks. The game has turn based battles. As a result, you’ll need to choose the right weapon and analyze the enemies weakness and their placement on the game’s board to pick the best strategy.</p>\n<p>⭐ Grow as a Warrior!<br/><br/></p>\n<p>You’ll find a collection of weapons divided into swords, axes and spears, each type with its own purpose. Among them, you’ll find many classic Japanese weapons from the medieval samurai age, such us the naginata and soderagami spear.</p>\n<p>⭐ Become a powerful wizard!<br/>Magic can add elemental effects to your attack and serve different purposes as healing and increasing your defense. Through your card collection, there are many magic spells that you can obtain and upgrade. With each level up, your magic power will increase and you’ll be able to cast spells such as earthquake, blizzard, bubbles, lightning bolt, terra, supernova or big bang.</p>\n<p>⭐ Collect magical pets!<br/>Last but not least, you can use the power of your cute Kami monsters to help you in battle. The Kami are elemental spirits of nature that you can collect and train to learn the most powerful magic attacks. Kami attacks are a bit different compared to other techniques: they are spread out through the board in many different shapes. This makes training your Kami pet very important in order to win our srpg battles by inventing the best tactics.</p>\n<p>⭐ Open chests and loot gold!<br/>During your gameplay through dungeons, you’ll find a lot of chests filled with gold, gems, crystals sweets and cards. Use them to improve your skills and acquire new magics, weapons and techniques.</p>\n<p>The storyline will lead you through a classical jrpg fantasy world, guided by the mysterious plans of the Moon King to defeat the Sun Queen and free a prince. Along the way, you’ll have to fight the crazy monsters of the Sunflower Forest where many animals have gone mad, the phantom ghosts, the dinosaurs or the dragons. Later in the story, you‘ll meet the Yokai King mage and his yurei ghosts that came from the deeps of the underworld. You’ll have to cast them again into the abyss, overcome many menaces and experiment some personal catharsis to bring back the eternal return to the world.</p>", "metacritic": null, "released": "2019-10-14", "tba": false, "updated": "2019-10-18T06:46:51", "background_image": "https://media.rawg.io/media/screenshots/fb9/fb9205b88d30ee7863465d22e25c2405.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sideralark"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}