{"id": 384455, "slug": "ow-the-edge", "name": "Ow The Edge", "name_original": "Ow The Edge", "description": "Foreword\r\n<p>Unfortunately the project didn't make it into a fully playable state before the jam submission. So right now, there's no game-play to speak of, plus some sprites are currently using the wrong artwork. There may be some work done post-jam to rectify this, but as far as the jam is concerned this is a broken entry...</p>\n\r\n\r\nThe Game \r\n<p>As it was imagined, at least!</p>\n<p>You're one edgy boi protecting your spooky edgy lands from an army of cute invaders. </p>\r\nAttack Type Match-ups\r\n\n<p>The game's main mechanic is a little Rock-Paper-Scissors, Swords work on Magic enemies, Shields work on Sword-wielding enemies and Shields beat Swords. </p>\n<p>Same-type cancels, if you use the losing type bad things happen. </p>\r\nGame Loop\r\n<p>Each stage has a bunny-wave and a boss wave </p>\n<p>It's an endless game; you ultimately can't win against the forces of cuteness, but you can resist as long as you like! The game will get faster the further you progress, however. . <br/></p>\r\nBunny Wave\r\n\n<p>During the bunny wave, bunnies will advance towards you. If a bunny makes it to the end, you'll take damage. </p>\r\nBoss Wave\r\n<br/>\n<p>During a boss wave one of three animes will spawn. Unlike bunnies, they remain in a fixed position and will fire bullets towards the player. Bullets only hurt you if they hit you, so it doesn't matter if they make it to the end.</p>\n<p>Like bunnies, bosses are only weak to the correct attack type. Hit them a bunch until they go away</p>\n\r\n\r\nHow To Play\r\n<p>Controls: Up/Down to move the player/</p>\n<p>QWE to fire bullets (doesn't work!)</p>\n<p>P Skips to next stage.</p>", "metacritic": null, "released": "2019-10-14", "tba": false, "updated": "2019-10-18T06:53:21", "background_image": "https://media.rawg.io/media/screenshots/d00/d002c31b91ea205ab8ca779bb34d4fed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["taqueso", "Raujinn"], "genres": [], "publishers": [], "esrb_rating": null}