{"id": 384434, "slug": "blame-the-intern", "name": "Blame the Intern", "name_original": "Blame the Intern", "description": "<p><strong>It is 2003.</strong> You inhabit the role of a lowly intern hoping to find their footing in the corporate world. When a senior manager prompts you to expose corruption within the company, you are given the choice of hacking into the boss’s computer to find evidence. Due to the boss’s extreme paranoia, the computer is rife full of locked files, spyware, and hidden secrets to find. You are seldom ever given a straight answer to a question. Instead, you must explore and deduce what to do next; the only help being your trusty notebook.</p>\n<p>Meanwhile, learn about the lives, corporation, and world you strive to protect through this unique form of interactive, non-linear storytelling. Every piece of narrative is essential in order to piece together what exactly happened and, perhaps more importantly: Why?</p>\n<ul><li>Blame the Intern is a short, but detailed <strong>1-2 hour game</strong>.</li><li>Currently available for <strong>Windows.</strong></li><li>Get the <strong>14-track Soundtrack for free</strong> with game purchase!</li></ul>\n<p>Listen to the official soundtrack here!<br/></p>\n\n<br/>\n<p>---</p>\n<p>If you have any questions, concerns, or comments, please let me know! I appreciate any and all responses. Join the official game Discord to chime in:</p>\n<p>https://discord.gg/VNm2w9C\r\n</p>\n<p>If you want to learn more about the creation of the game, check my website! It's full of detailed insights on the development:</p>\n<p>https://www.adamweesner.com/blame-the-intern<br/>\n</p>\n<p>Thanks for taking a look at my game! This has been a sole effort, so any donations are greatly valued: </p>\n<p>https://www.patreon.com/adamweesner</p>", "metacritic": null, "released": "2019-10-09", "tba": false, "updated": "2019-10-18T06:48:01", "background_image": "https://media.rawg.io/media/screenshots/890/890825b12b1c43f3156ce64ab3de64e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Adam Weesner"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}