{"id": 384519, "slug": "p1r4t3s", "name": "P1R4T3S", "name_original": "P1R4T3S", "description": "<strong>P1R4T3S! is a roguelike game with RPG elements </strong>by the creators of <strong>Lovecraft’s Untold Stories.</strong> <br/><br/>Space travel is a dangerous endeavour – apart from asteroids and space-time oddities, there are<strong> space pirates lurking behind every small moon, </strong>waiting for unaware ships they can board and plunder. You know perfectly well because, of course, <strong>you are one of these pirates!</strong> Your crew of miscreants and you just caught a merchant ship, and you’re now making your way through its corridors, looting all the treasure you can, grabbing a couple of hostages since you’re at it, and<strong> shooting the hell out of any scurvy landlubber</strong> who dares to try stopping you. When you’ve got enough riches, you plan on <strong>building a bigger and faster ship and a base</strong> on a small meteorite, like the famed space pirates of old. You dream of becoming one day the one and only<strong> King of P1r4t3s</strong> of the galaxy. And who knows, maybe then you will be able to find your lost family…<br/><br/><strong><h3>BOARD SHIPS, SPACE STATIONS, AND LAND BASES</h3></strong><br/><h3>FIGHT THEIR CREWS IN AN INTENSE TWIN-STICK SHOOTER ROGUELIKE</h3><br/><br/><h3>LOOT TREASURE TO BUY BETTER GEAR FOR YOU AND YOUR SHIP</h3><br/><br/><h3>FARM RESOURCES TO IMPROVE YOUR SHIP AND BUILD YOUR BASE</h3><br/><br/><br/><br/><strong>KEY FEATURES</strong><br/><br/><ul><li> Sail the deep space in your <strong>customizable pirate ship</strong><br/></li><li> <strong>Board and plunder</strong> other ships, space stations, and land bases <br/></li><li> Shoot any scurvy dog who dares to stand in your way in this <strong>twin-stick shooter action roguelite!</strong><br/></li><li> <strong>Loot treasure and farm resources…</strong> and use them to improve your ship and build a pirate base!<br/></li><li> <strong>Capture cargo and prisoners</strong> and ransom or sell them <br/></li><li> <strong>Customize </strong>your character and gear <br/></li><li> Pillage with friends in <strong>online multiplayer co-op mode</strong> (to be released further down the road)!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-21T02:19:01", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3d651934514192609afe1e0ab78c7b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blini Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["LLC Blini Games"], "esrb_rating": null}