{"id": 384548, "slug": "help-i-am-really-horny", "name": "Help! I am REALLY horny!", "name_original": "Help! I am REALLY horny!", "description": "Have you ever done something really stupid and very shortsighted, while you were horny? Something you would never even consider doing, had it not been for your overwhelming lust?<br/><br/>You wake up on a Friday, hornier than you have ever been before, which makes you unable to concentrate on anything else than sex. Sunday is your parents' silver wedding anniversary and you have not yet written the anniversary song you promised. Therefore, you have to go on a noble quest to make yourself un-horny, so you can write the song and not yet again disappoint your parents.<br/><br/>- Play either as a dick or pussy, who is either into dancing with the other sex or the same sex.<br/><br/>- Lots of cute, dancing genitals.<br/><br/>- 30% chance you will experience two bad fart jokes.<br/><br/>- Designed for multiple playthroughs for the REALLY horny ones.<br/><br/>- Explore your own lust with your friend between your legs.<br/><br/>- 110% chance you will end up making some decisions that your mommy will not be proud of.<br/><br/><strong>What happens after the game has been released?</strong><br/><br/>First off, thank you for asking. We will make at least one free story DLC that happens outside the main story, and we have plans for more. But, let us be honest, the more games we sell early on, the more free story DLCs we can make. If you want all the news, plus secrets, then follow our Horny Game mailing list on https://www.professionalvillains.com/contact/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-21T02:33:58", "background_image": "https://media.rawg.io/media/screenshots/893/893d3a394bf38364caff0ae125900fc3.jpg", "website": "https://www.professionalvillains.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Professional Villains"], "genres": ["Indie"], "publishers": ["Professional Villains"], "esrb_rating": null}