{"id": 384514, "slug": "yomi-alliance", "name": "Yomi Alliance", "name_original": "Yomi Alliance", "description": "<strong>A Science Fiction Visual Novel unlike anything else</strong><br/>Join Yomi Alliance Academy and become a Starship Officer in this unique role playing Visual Novel. You are the lead character, but events won't revolve around you as the space is a huge space and you're but an ant there.<br/><br/>Choose who you want to be with each species and gender which will change gameplay and dialogues, putting you in greater risks or shielding you from the Galactic Community's opinion. Become who you always wanted to be in a Sci-Fi opera and do your job to help in dangerous missions which will require skill and preparation.<br/><br/><ul><li>Attend Yomi Academy: a game-within-the-game experience which will prepare your character with all the skills he/she/shem needs to survive in the outer space!<br/></li><li>A 70+ hours long Visual Novel with RPG elements with an everchanging story based on your choices and actions!<br/></li><li>An adult plot featuring space exploration, social conflict, politics, love and betrayal.<br/></li><li>Choose a specialization from a range of 7 and a job from over 21 different choices<br/></li><li>Every different job activates different events during missions and situations, meaning you can replay the game dozens of times to discover something new in the story, gameplay or interactions with other characters.<br/></li><li>Choose your character's species from 4 different ones, and choose the gender as well. Introducing an hermafrodit species in the game, people will react to you differently and even the romance options you'll be getting will play differently. <br/></li><li>Explore 4 different romance options with each character having her own agenda and personality. <br/></li><li>Adult scenes are featured in the game with all kinds of romantic partners. Adult scenes can be completely removed in the Settings menu.<br/></li><li>Full-HD graphics with special user interfaces designed by our talented, awesome graphics designer Sasquatchii.<br/></li><li>Interactive consoles and cinematics.<br/></li><li>Monthly story updates which will keep you stick to your screen for hours!</li></ul><br/><strong>Huge Replayability</strong><br/>You can get to choose a wide variety of jobs and specializations as follows:<br/><ul><li> Command School (choose to become a Commander, Representative, Manager, Navigator or Hot Shot Pilot)<br/></li><li> Engineering School (choose to become a Mechanic, Specialist, Starship Designer or System Specialist)<br/></li><li> Operations School (choose to become a Basic Operator or an Operations Manager)<br/></li><li> Security School (choose to become a Security Officer, Investigator or Tactical Officer)<br/></li><li> Counseling School (choose to become a Interspecies Relationship Expert or a Psychologist)<br/></li><li> Medical School (choose to become an Alien Specialist, an Emergency Medic or a Doctor)<br/></li><li> Science School (choose to become an Astrometrics, Science, Social Surveyor or Planetary Surveyor Officer)</li></ul><br/>Each school means different stories in the game and every playthrough is different with each career choice!<br/><br/>One of the first missions in the game will be to reply to a distress call from an orbital station which was attacked by unknown assailants. If you play as a Navigator you will be tasked to navigate between the hazards of the region, or maybe escape or intercept an hostile vessel. If you play as a Security Officer you might be tasked to join a boarding party to secure the station, while if you play as a Doctor you might be tasked to deal with survivors and injured people... Nothing is the very same in Yomi Alliance!<br/><br/>Also, every different job will feature its own gameplay design, as of using consoles, interfacing with the computer or interviewing prisoners. It's all up to your choice and you can play the game dozens of times to have a different side of the story to unfold!<br/><br/><strong>Deep, Engaging Storyline</strong><br/>You will be able to play a character whose species is chosen amongst FOUR different options and three genders (one species is a mixed gender hermafrodit as well!).<br/>This choice will also affect your story as people will react to you differently and even the romance options you’ll be getting will play differently.<br/>There will be 4 different romance options in the game and each character has its own agenda and personality so they are all different each time you play them! The different outcomes given by your choices are literally by the dozen!<br/><br/><strong>Adult Content</strong><br/>You can enable or disable adult content via the Main Menu interface.<br/>Adult content features mild violence, sexual intercourse with FULL-HD animated sex scenes and adult themes, including dealing with racism, terrorism and prejudice.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-21T02:16:41", "background_image": "https://media.rawg.io/media/screenshots/72e/72e1318a18b605af46401a67e2c13666.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Bruni Multimedia"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Bruni Multimedia"], "esrb_rating": null}