{"id": 384518, "slug": "billion-beat", "name": "Billion Beat", "name_original": "Billion Beat", "description": "<strong>Billion Beat</strong> is a deep and challenging skill-based boxing action game.<br/><ul><li> Master a deep and nuanced combat engine that rewards skilled timing and careful attack selection.<br/></li><li> Fight through a gauntlet of over a dozen meticulously crafted boss fights with multiple forms.<br/></li><li> Utilize advanced Hyper techniques to humiliate your opponent and make the crowd go apeshit.<br/></li><li> Upgrade your fists, seek advice from your Mascoach, or become a cyborg when fights get too tough and you need that extra edge.</li></ul><br/><br/><ul><li> Master an extensive moveset to fight your way to the top.<br/></li><li> Execute techniques with perfect timing to unleash powered-up attacks.<br/></li><li> Strategically build up and expend Energy to use Strong Punches and Rapid Flurries.<br/></li><li> Enjoy a deeply satisfying combat engine with full damage modeling. Beat the enemy's glasses off, knock out their teeth, and give 'em a black eye.</li></ul><br/><br/><br/><br/><ul><li> Hype up the crowd by landing tricky-to-use attacks that demonstrate your skill.<br/></li><li> Learn to use the Hyper version of each attack, which is less effective yet more rewarding.<br/></li><li> Roll with the punches and beat dynamic missions.<br/></li><li> Bet on your own skill. Ante up before each match and reap the rewards or suffer the consequences of defeat.</li></ul><br/><br/><ul><li> Gain experience, hit the Lawker Room, and level up each fist individually.<br/></li><li> Customize your fighting style by filling out an unrestricted tech tree.<br/></li><li> Buy, equip, and sip on Dranx to restore health in the middle of a match.<br/></li><li> Undergo irreversible surgery and become a cyborg to unlock overpowered abilites.</li></ul><br/>", "metacritic": null, "released": "2019-12-16", "tba": false, "updated": "2019-10-21T02:18:37", "background_image": "https://media.rawg.io/media/screenshots/76a/76a6be32309a3b9cbf6399cc22d2de91.jpg", "website": "http://www.dronami.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Dronami"], "genres": ["Action", "Indie"], "publishers": ["Dronami"], "esrb_rating": null}