{"id": 384536, "slug": "monster-energy-supercross-the-official-videogame-3", "name": "Monster Energy Supercross - The Official Videogame 3", "name_original": "Monster Energy Supercross - The Official Videogame 3", "description": "<p>The only Official Monster Energy AMA Supercross Championship videogame is back!<br />\nEverything is official, from real teams to the training compound, Monster Energy Supercross 3 is the exact replica of the Supercross world!OFFICIAL 2019 SEASONRelive the 2019 AMA Monster Energy Supercross season with 100 riders of both 450SX and 250SX categories, 15 official stadiums and tracks and for the very first time, you have the possibility to join the Official Supercross Teams of the 2019 championship in the career mode.CO-OP MODE IN THE NEW COMPOUNDYou can now enjoy a totally new great co-op experience with your friends in the new amazing compound, inspired by the Supercross Test Tracks used by the official teams, in which you can train, race or roam free on the biggest area ever!DEDICATED SERVERSThe addition of dedicated servers has made playing online more fun than ever! Challenge your friends in different modes:<br />\nPublic Lobby: create a fully customisable lobby (race mode, type of race, weather conditions etc.) or scroll through the list of lobbies available and pick your favourite one;<br />\nPrivate Lobby: create a custom event and challenge your friends;TRACK EDITORCreate, share, download infinite number of tracks with the limitless power of the track editor. Unleash your creativity to create the track of your dreams or vote and download your favourite one.WOMEN STRENGTHDo you want to show the world the real strength of women? Create your custom rider as a female rider and use it to be the next supercross champion!ENJOY THE IMPROVED GAMEPLAYThe new ground and in-air physics, the new riders models and the new animations will give you a more immersive experience, to live the supercross world at its best!</p>", "metacritic": null, "released": "2020-02-04", "tba": false, "updated": "2020-12-16T14:22:01", "background_image": "https://media.rawg.io/media/games/915/91575ca8a2f5bdcc96e969e9a047be03.jpeg", "website": "https://supercrossthegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34, "dropped": 1}, "playtime": 6, "achievements_count": 50, "ratings_count": 1, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "Xbox One", "PC", "Nintendo Switch"], "developers": ["Milestone"], "genres": ["Simulation", "Sports", "Racing", "Arcade"], "publishers": ["Milestone"], "esrb_rating": "Everyone"}