{"id": 384685, "slug": "mermaid-games-makeover-and-salon-game", "name": "Mermaid Games - Makeover and Salon Game", "name_original": "Mermaid Games - Makeover and Salon Game", "description": "Mermaid Princess Salon finally comes!!! If you want to dress her up , and make her the most beautiful one in the world, you will feel so excited to see our Mermaid Princess Salon! <br/><br/>Have you ever thought of being a mermaid so you can explore the inner beauty of the fantastic world under water, dance with a dazzling array of aquatic creatures, and dart among the seaweed like the bird flits through the tree? This is a fairy tale about courage and discovery. The craving for freedom will lead the spunky, playful little nymph to a whole new world, to a fantastic journey filled with magic, myth, romance, and adventure. When little sea beauty meets human prince, when a heart for freedom meets trouble, what will leave to be found out? What's the secret of the magic room deep in the ocean? Will the beautiful witch give the little sea princess what she wants?<br/><br/>Mermaid is such a magic word, it exists in almost every girl’s dream! Mermaids, they are so romantic and fantastic, so that everyone wants to have a look at them during their lifetimes. Today, we will make your dream come true, for our new app ------ Mermaid Princess Salon finally comes!!! If you want to dress her up , and make her the most beautiful one in the world, you will feel so excited to see our Mermaid Salon! <br/><br/>mermaid princess magic spa and makeup world is your mermaid gorgeous and wonderful fancy ocean look like a fantastic mermaid girl.<br/>remove her pimple and other dirt on face then after choose best makeup accessories for her .then after you can choose best and beauty dress, prop, hair and other items for her.<br/><br/>How To Play:<br/><br/>Start with a smoothing spa to make sure her hair and skin are flawless. Next, help her choose a hair style, eye color and put the makeup on. Then, assist her to select a perfect dress (or top and skirt), and the matched jewelries. At last, please choose a beautiful tail for her, as well as a pretty prop in her hand. After all these process, she will go to enjoy her fantastic life under the sea, let's follow her and see how amazing it is!<br/><br/>Features:<br/>· Spa Section <br/>· Makeup Section <br/>· Dress up Section <br/><br/><br/>Mermaid Princess Salon is FREE to play!<br/><br/><br/><br/><br/>http://www.youtube.com/channel/UCbjg35kr_zZtBHg1Fz5GoiA", "metacritic": null, "released": "2017-08-21", "tba": false, "updated": "2019-10-21T03:32:03", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e8c0c3f26ae7ff94156e50b33b43e32_s7wwPzp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Armored Techno Solution"], "genres": ["RPG"], "publishers": ["Armored Techno Solution"], "esrb_rating": "Everyone 10+"}