{"id": 384644, "slug": "dragon-champions", "name": "Dragon Champions", "name_original": "Dragon Champions", "description": "Dragon Champions is a free fantasy-themed RPG on mobile. Familiar graphics, an engaging storyline, tactical battles, PvP, PvE, and a few more awesome things for you to enjoy! Are you an avid MMORPG fan? Do you miss the vibe of old computer games? Download Dragon Champions, and we'll show you true dragon magic!<br/><br/>Take part in the legendary battle of the Dragon Champions against demons and the mysterious Reflections. Lead a squad of fantastic heroes to battle and determine the fate of the world of Korador. Humans, orcs, elves, pandas, goblins, beastmen, or demons? Seven playable races and two factions are waiting for your decisions! Assemble and upgrade your team and save the world, become the strongest champion at the arena, and learn the secret of the dragon protectors.<br/><br/>The Ancient Gods exterminated each other, leaving this world to dragons, their heirs. The dragons swore to protect the races of Korador from conflict, becoming the protectors of the races. Centuries passed, and dragons eventually stopped meddling in mortal affairs. Now orcs and humans are waging an endless war, elves and goblins are all-time enemies, while pandas and the beastmen hide in their faraway lands. That's when demons invade the world, leading to the return of the mythical dragons. Become a part of this legend!<br/><br/>Dragon Champions features:<br/><br/>THREE ENGAGING STORY CAMPAIGNS Enjoy the memorable story of Dragon Champions in the spirit of classic fantasy, filled with humor and a ton of pop culture references. The story of Crown Prince Darian and Tromgar, the orc khagan, is like a high-quality blockbuster, starting with a personal story and ending with global-scale events.<br/><br/>PLAYER VS. PLAYER BATTLES Assemble the best heroes in your battle squad to participate in Arena battles! Your results will be recorded in global rankings. Try and become the best out there!<br/><br/>MANY HEROES TO CHOOSE FROM More than 50 characters from seven playable races and different rarity levels will join you in the ultimate adventure! Find ‘em all, obtain and craft equipment, and don't forget you have a world to save!   <br/><br/>DYNAMIC BATTLES Work out your own tactics in this turn-based RPG strategy with dynamic battles, time speedup, and a convenient autobattle feature. And if the autobattle won't do the trick, take matters into your own hands and defeat the enemy on your own!<br/><br/>JOIN GUILDS AND PARTICIPATE IN RAIDS The wise strategists and military leaders of Dragon Champions join guilds and combine their efforts to win raids. Participate in raids to encounter the most powerful beasts of Korador and defeat the elder dragons.<br/><br/>ADDITIONAL MODES Completed the campaigns? Fight waves of devious enemies in the tower to test your mettle. Each battle is more difficult than the last, but you get generous rewards for each battle you complete!", "metacritic": null, "released": "2019-08-27", "tba": false, "updated": "2019-10-21T03:14:37", "background_image": "https://media.rawg.io/media/screenshots/3ab/3ab01eb00809fa8dd6c79fbe3e4174b5_dGQSwuB.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["AppQuantum Publishing"], "genres": ["RPG", "Strategy"], "publishers": ["AppQuantum Publishing"], "esrb_rating": "Teen"}