{"id": 384618, "slug": "zombie-hill-racing", "name": "Zombie Hill Racing", "name_original": "Zombie Hill Racing", "description": "Welcome to Zombieland!<br/><br/>Zombie apocalypse already fell upon our land! Walking dead roam the country and there is almost no escape from this zombie apocalypse! <br/><br/>Do you dare to beat this zombie evolution? The only thing left is to find a car, get on the wheels and jump car through the climbing hills full of walking dead.<br/><br/>This zombieland is one of the best zombie games where you will experience the real survival of the zombie apocalypse in a zombie evolution where you will need to upgrade your car so you can kill that walking dead and become one of the best zombie hunters.<br/><br/>Hill climb and jump car over zombie apocalypse!<br/><br/>Don’t let walking dead to ruin our country and let’s save yourself from this zombieland!<br/><br/>Features:<br/> - Different cars at your disposal for zombie run<br/> - Plenty of deads to jump car through<br/> - Earn coins and hill climb with customized cars<br/> - Varied range of zombie racing <br/> - Various environments to discover<br/><br/>The game currently has all these features above and we are always planning to add more! So keep looking for our updates.<br/><br/>Use all of our features to get the best results!<br/>Challenge yourself inside the zombie evolution and beat other zombie hunters in one of the top zombie games.<br/><br/>Earn as many coins as possible so you can avoid zombie apocalypse in this hill climb.<br/>Build your ultimate jump car machine and destroy all the hordes of the walking dead.<br/><br/>You dont want to join this zombieland, you want to survive!<br/><br/>Your main focus should be to gain as many coins as possible and drive as far as possible so you can earn money to upgrade your car so we can beat this game together and save our planet! <br/><br/>Do not die in this zombie run and enjoy the real racing from all zombie games!<br/>The more you wait the more deads are killing our country so lets go save it!<br/><br/>Good luck and don’t forget to zombie run and survive!", "metacritic": null, "released": "2019-09-29", "tba": false, "updated": "2019-10-21T03:05:03", "background_image": "https://media.rawg.io/media/screenshots/79f/79f34dcbe9e7c0fc53a61a1fb8061619.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Inlogic Software"], "genres": ["Action", "Racing"], "publishers": ["Inlogic software s.r.o"], "esrb_rating": "Teen"}