{"id": 384834, "slug": "loopofunderappreciation", "name": "LoopOfUnderAppreciation", "name_original": "LoopOfUnderAppreciation", "description": "<p><strong>##LoopOfUnderAppreciation##</strong><br/></p>\n\n<p>.Detailed Submitting log.</p>\n<p>webgl 1: worked except the text and cassettes were not in the frame</p>\n<p>(crashed unity here)</p>\n<p>Webgl 2: Closer</p>\n<p>Webgl3: Victory text was actually on the screen. But super smushed. </p>\n<p>WebGl4 said lets make blurry text AND harass the innocent cassettes</p>\n<p>Web gl 5 is still messed up with the text but I'm gonna submit it cause my computer is dying.</p>\n\n\n\n<p>.GameDescription Paragraph:.</p>\n<p>In this game, the players objective is to use the arrow keys or WSDA keys to collect the (debatably because the lights are annoying) Glowing cassette tapes, than take them to NPC1 for a reaction. I basically chose this topic because discord is mean and I like thinking negatively (ironically enough the phenomenon I based my game after has gotten worse since it's production). I like to share things I make, just cause I'm proud of them and I want to get feedback, unfortunately every single time I do so it gets ignored. Usually I post something, nothing happens for like 30 minutes then a different person posts something completely different and they immediately get replies of \"Wow that's amazing.\"  Basically I am mad, and I want other people to suffer, so I decided that I would make a game where instead of getting ignored for things you made, it's based on the similar phenomena of getting ignored for things that other people made that you support, in my case bands, why? I don't know, even people that listen to some bands I like don't listen to all the bands I like. GG. </p>\n<p>.The making of the game paragraph:.<br/></p>\n<p>Maybe I got too distracted with audacity to work on it, but good news for focus, my computer thinks it's always running cause I crashed it. That said, I got to pitch down flight of the bumblebee and it somewhat sounds good and barely audible. Does it have anything to do with the topic? Just a slight feeling of being annoying. Also I didn't realize there was that big of a difference between the audio in the background, and the audio of the cassettes. It's funny how surprisingly well everything fits the concept if I think about it. Also I kind of hate blender, like I still have no idea what the heck is going on because I can't just use my track pad or the same short cuts that you have memorized. Also converting the finished game to a webgl file and having to copy the host link into your pirated chrome only to find out that the text is slightly off is fan freaking tactic.</p>", "metacritic": null, "released": "2019-10-20", "tba": false, "updated": "2019-10-21T04:24:24", "background_image": "https://media.rawg.io/media/screenshots/3ff/3ff99c66d0c4d8b4ac75c9d1e43ff4f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ShyWolfGhost"], "genres": [], "publishers": [], "esrb_rating": null}