{"id": 38491, "slug": "sam-max-204-chariots-of-the-dogs", "name": "Sam & Max: Episode 204 - Chariots of the Dogs", "name_original": "Sam & Max: Episode 204 - Chariots of the Dogs", "description": "<p>Sam &amp; Max 204: Chariots of the Dogs is the fourth adventure game in the series of the same name. </p>\n<h3>Plot</h3>\n<p>The plot is about the events happened to Sam and Max — they are personas of Steve Purcell&#39;s comics. In the game, Bosco, the severely paranoid and conspiratorial thinking owner of Bosco&#39;s Inconvenience store, disappears.<br />\nSam and Max try to track him down; when they do, they discover a strange organization called T-H-E-M. The interior motif of the Chariots of the Dogs is time travel and aliens. The characters are caught by a flying saucer while investigating the case. They find a high-tech elevator that allows them to travel in time. Sam and Max begin to move between several time periods, simultaneously trying to fix the passing paradoxes. </p>\n<h3>Gameplay</h3>\n<p>The player performs as the anthropomorphic dog Sam and a hare called Max, detectives from the Freelance Police. The player aims to solve various puzzles, complete tasks, and choose between options given in branched dialogues. All of them lead to the final puzzle, so the player should take sidelong thinking to finish the game. </p>\n<h3>Key features</h3>\n<p>The dialogues between characters have the usual TellTale sense of humor; there are a lot of plot twists and callbacks. The game also has original soundtracks. All of the actions happen in the 3D parody universe.</p>", "metacritic": 85, "released": "2008-03-14", "tba": false, "updated": "2023-04-14T13:38:23", "background_image": "https://media.rawg.io/media/screenshots/233/2337379ff6a23784a95f3e1f9a0d0b6d.jpg", "website": "http://www.telltalegames.com/samandmax/chariotsofthedogs", "rating": 3.09, "rating_top": 4, "added_by_status": {"yet": 51, "owned": 913, "beaten": 35, "toplay": 6, "dropped": 4}, "playtime": 4, "achievements_count": 0, "ratings_count": 47, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 47, "platforms": ["macOS", "PC", "iOS"], "developers": ["Telltale Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Telltale Games"], "esrb_rating": null}