{"id": 384919, "slug": "relative-evil", "name": "Relative Evil", "name_original": "Relative Evil", "description": "<p>The classic trolley problem, revisited with fast-paced gameplay inspired by the Wario-Ware series.<br/><br/>Choose quickly with the limited info you have!</p>\r\nHow to play: \r\n<p>Hover over the person who you think most deserves to die. Alternatively, you may click the track-switcher to change the current choice. After the unfortunate passing of your choice, the second piece of info for both options will be revealed. A score is assessed for each victim and subtracted from your total score. At the end of the game I use state of the art machine learning (but mostly a switch statement) to judge your amount of evil compared to other relatively evil people!</p>\r\nWhy did you make this thing:\r\n<p> This game was made in three weeks for \"Shacknews Jam : Do it IV Shacknews\". The theme of the jam was <strong>\"Be Relatively Evil\"</strong>. My goal for this game was to base it all around judging the relative \"evil\" of other people, and of course to have your own relative \"evil\" judged based on your choices! The trolley problem serves as a perfect framing to explore these comparisons; even more so when you have to decide very quickly! I also threw your actual relatives in the list of victims for some more personal scenarios.<br/></p>\r\nDisclaimer:\r\n<p>I used names of several people I know in this game, and if your name is in that list it's pretty likely some unsavory traits may appear attached to it. Please know that these are completely randomly generated and I only think the good things about you!<br/></p>", "metacritic": null, "released": "2019-10-20", "tba": false, "updated": "2019-10-21T04:44:26", "background_image": "https://media.rawg.io/media/screenshots/b4c/b4cd6237aff79f7d2b350cf1024f6eda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["ortsac", "Groovetone"], "genres": [], "publishers": [], "esrb_rating": null}