{"id": 384994, "slug": "bigbikeboi", "name": "BigBikeBoi", "name_original": "BigBikeBoi", "description": "<p>Description:<br/>BiGBikeBoi is a game about riding a bike along the beach,<br/>and so of course what will you do in this game? Ride a bike<br/>along the beach. I chose this topic because I frequently ride<br/>my bike down to the beach from my house in California and<br/>wanted to recreate a similar experience for others.</p>\n<p>Controls:<br/>W - Move Forward<br/>A or LeftArrow - Turn the handle bars left<br/>D or RightArrow - turn the handle bars right<br/>S - Apply the brakes</p>\n<p>Reflection:<br/>Making a bike game is surprisingly difficult. Bike are complex<br/>physics objects. There is turning handle bars at an axis, <br/>rotating wheels that are connected to a shared body, lean forces,<br/>etc. so with this is mine obviously a real simulated bike would<br/>be too difficult for this project. I still used physics so the <br/>bike has a real feel of existing in the world, but the physics <br/>are inaccurate and that's okay because the focus is more on feel.<br/>Unfortunately, finding the right feel still proved very difficult<br/>and I'm disappointed to say I still couldn't quite get it right.<br/>I think this project really came down to this past weekend where<br/>something came up unexpectedly and I missed code help desk.<br/>I believe if I were able to make it I may have found the feel I <br/>was looking for and that would have opened up more time for the <br/>rest of the weekend. My focus was really on the aesthetics qualities<br/>of the bike's look &amp; feel and I believe it shows. So I am<br/>happy about that, although I also wish I was faster at modeling<br/>large scenes. I'm not used to making big levels in blender so <br/>I will need to adjust to that. If I had more time I would add sound<br/>effects and proper lighting, but overall I'm happy with what was<br/>achieved.</p>", "metacritic": null, "released": "2019-10-20", "tba": false, "updated": "2019-10-21T05:04:11", "background_image": "https://media.rawg.io/media/screenshots/4f0/4f06c1422bf91c400b0dbe005db40ed3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Slime103"], "genres": [], "publishers": [], "esrb_rating": null}