{"id": 385091, "slug": "package-party", "name": "Package Party", "name_original": "Package Party", "description": "<p>“Package Party” is a <strong>couch co-op</strong> <strong>game </strong>for <strong>1-4 players</strong>.  \r\n  </p>\n<p>You just need to deliver some packages. Simple, right? You grab the package at one location, walk towards your destination, drop the package, and voila!\r\n  </p>\n<p>Except … things aren’t as easy as they seem. Maybe the destination is on an island and you need to jump over a gap, maybe the destination is unreachable and you need to shoot your packages, maybe there’s a vehicle you can only steer with 2 players simultaneously, maybe you need to ask your friend to catapult you to your destination!\r\n  </p>\n<p>Work together to deliver the right packages at the right locations, while each level introduces new interesting mechanics and tests your (cooperation) skills!<br/></p>\n<p>This game is <strong>family friendly</strong>. Anyone, even those who have never picked up a controller, can boot the game and play it immediately, thanks to completely integrated tutorials in each level.<br/></p>\n<p>This game is a mix between a <strong>3D</strong> <strong>platformer</strong>, <strong>action</strong>, and <strong>puzzle</strong> game. With lots of cooperative elements, of course. (And you might just learn a thing or two about package delivery. Like: throwing the package in a river with a strong current is a completely viable way to deliver fragile objects.) <br/></p>\n\r\nEarly Access\r\n<p>Thank you for checking out my game!<br/></p>\n<p>This game is in early access. There's a <strong>free demo</strong> available, which currently only contains the first level. </p>\n<p>I mostly create levels in chronological order, but I regularly find out that a certain idea is better expressed elsewhere, which means I already have huge parts of other levels done. (My previous level 1 became my new level 5, for example, when I realized it was too difficult to use as a first level.)<br/></p>\n<p>The usual warnings are in order:</p>\n<ul><li>Nothing (art, mechanics, etc.) is final</li><li>The game will regularly update with the latest levels/improvements. As the game expands, the price is raised. Buying the game now of course means you'll get all future updates! (But it also means there might be bugs or mechanics that just don't exist yet.)</li><li>Complete priority is given to level design and the underlying core mechanics. Stuff like sound effects or proper menus around the levels, will be non-existent or ugly for the time being.</li></ul>\n\n\r\nFeatures\r\n<p>The game currently has:</p>\n<ul><li>Support for 1-4 players \r\n<ul><li>Any controller <em>and</em> keyboard is supported. (At most 2 players on the keyboard, of course.)</li><li>If you can, it is highly recommended to play the game on a controller though</li></ul></li><li>Support for Windows, Mac and Linux.</li><li>One level which is completely playable.<ul><li>This means: all the mechanics needed are implemented and bug-free, and you can finish the level with a certain score)</li></ul><ul><li>Players can move around, jump, pick up packages, and drop them somewhere else.  These deliveries appear automatically, and are registered and timed properly. (Though this will probably become a more advanced mechanic in the future.)</li><li>Also, level 1 contains a huge construction crane, which rotates, and has two platforms onto which players can throw stuff (or themselves).</li></ul></li></ul>\n<p>The game will have:<br/></p>\n<ul><li>At least 20 levels.</li><li>A new mechanic/gimmick/special element introduced in each level.</li><li>An interesting and funny background story running through the levels (which also influences the level design at times)</li><li>Hopefully, lots of cooperative fun!</li></ul>\n\r\nWho is making this game?\r\n<p>Hi, I'm Pandaqi. I've been developing games as a hobby for ten years, but recently turned professional. I co-wrote one of the first books about the Godot game engine and work as a freelance artist in the Netherlands. After lots of tiny hobby projects, and then some paid projects, I'm now ready to make my first full title!</p>\n<p>I chose <strong>Itch.io</strong> for multiple reasons. </p>\n<ul><li>I already have a few projects on here.</li><li>I don't currently have the money or desire to battle myself onto Steam. Even though Steam still has the lion share of games and gamers, it's not the place it used to be. Which leads me to my next point ...</li><li>My interactions/experiences on this website have always been good. People are nice, they want to try out your games - even the ones you think are too weird/small/whatever - and they give constructive feedback. It's the ideal place to allow a game like this to grow and thrive, and hopefully become a very good finished product one day.</li></ul>\n\r\nWhy am I making this game?\r\n<p>I mostly play games for the social experience. And for some reason, not many games are being developed for more than a single player sitting on the couch. Sure, there's many online multiplayer games, but local co-op will always have my preference. It's just a stronger experience, as you're physically close to each other and can actually communicate by speaking, gestures, pointing, whatever. <br/></p>\n<p>I would like to see a world where games don't make us more anti-social or more lonely, but where they actually allow us to connect more. (And give us an excuse to meet up with friends in real life, so we can curse them a few minutes later because they can't deliver a package to save their life.) <br/></p>\n<p>NOTE: I am certainly NOT saying all games somehow make everyone more lonely, but everytime I sit in the living room and everybody's just playing some silly games on their own smartphone for hours, <em>by themselves</em> <em>and</em> <em>completely closed off from their surroundings</em>, my heart breaks a little.<br/></p>\n<p>That's why I think cooperative couch co-op games are amazing. And that's why I'm making one.</p>\n<p>(As will become clear during my devlogs, playing <em>Overcooked</em> with my family was the direct inspiration for this game. But Overcooked isn't a simple game, if you inspect it closely. It expects people to be very comfortable with controllers, multi-step orders, etc. from the get-go. I want my game to be even more accessible, so that even \"non-gamers\" can pick it up and get everyone playing.)</p>", "metacritic": null, "released": "2019-10-19", "tba": false, "updated": "2019-10-21T05:24:06", "background_image": "https://media.rawg.io/media/screenshots/f52/f52caa11b5c8283a7642c2009d44a9ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pandaqi"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}