{"id": 385210, "slug": "the-dust-of-the-violet-crystals", "name": "The Dust of the Violet Crystals", "name_original": "The Dust of the Violet Crystals", "description": "<em><strong>Note: This embed is intended as a DEMO ONLY- actual full game will only be available on PC, Linux and MAC. This is because HTML5 (Web games) are much more limited. Glitches in music and jumps in this version of the game are a result of that, and are not present in other versions.</strong></em>\n<em><strong>By clicking 'run game' above or by downloading and playing any other available formats of The Dust of the Violet Crystals you are agreeing to the EULA available to read in full at : https://www.corvaena.com/eula/ </strong><br/></em>\n<em><strong>Storyline:</strong></em>\n<strong>After a flesh-eating dust blows through your small town you are left trying to survive alone against hordes of Listless humans. Starved for social interaction you find yourself questioning your sanity when a voice speaks directly into your mind begging for your help.</strong>\n<em><strong>Excerpt:</strong></em>\n<em>NARRATOR<br/>Huddling in the corner of our modest shop I can see them.<br/>I can see them through the glass, weaving to and fro as if only held upright by the merest of threads invisibly dangling from the hazy sky.<br/>The light that had previously consumed their retinas has faded to a dull glow.<br/>For hours I have hovered inside my shop. Waiting. Watching.<br/>My wife and I had chosen the reflective lettering on the glass of our shop in an attempt to catch the eyes of passerby to peruse our wares.<br/>I do not understand why, but it seems to confuse them.<br/>Almost immediately on turning to the glass the light in their eyes will fade, and they will either stand idly, waiting, or join the ranks of the others.<br/>A sudden scream shatters my thoughts and I slowly stand and walk toward the glass pane.<br/>A lone woman runs screaming through the street.</em>\n<em>\r\nYOU (horrified)<br/>No…No!</em>\n<em>NARRATOR<br/></em><em>As soon as I speak one of the Listless turns toward the window and I press myself against the wall in terror.<br/></em><em>It weaves to and fro in indecisive consternation, its ears aware of sound but the mirrored letters confusing its vision.<br/></em><em>After a few moments it turns back towards the woman.<br/></em><em>By the time I work up enough nerve to return to the glass and try to help, it is too late.<br/></em><em>But the Listless aren’t even the worst part.<br/></em><em>The dust.<br/></em><em>The dust is <em><strong>always</strong></em> worse.</em>", "metacritic": null, "released": "2019-10-19", "tba": false, "updated": "2019-10-21T05:50:57", "background_image": "https://media.rawg.io/media/screenshots/60c/60c63ddbe50ca6893206bee55d104dbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Corvaena"], "genres": [], "publishers": [], "esrb_rating": null}