{"id": 385224, "slug": "devilution-prototype", "name": "Devilution (Prototype)", "name_original": "Devilution (Prototype)", "description": "<p>Inspired by CAVE shooters like Espgaluda 2, and Judgement Silversword for the Wonderswan, dodge a bunch of bullets while trying to maximize your score! There are two meters representing the power collected from destroying the angel and demon enemies. Spend the meter separately to do massive damage, or clear the screen of bullets. Or, spend both meters simultaneously to enter a special scoring mode that briefly makes you invincible, and turns bullets from a destroyed enemy into more points. </p>\n<p>This is my first project with the Godot engine to try it out, and made in collaboration with @TheWallyWiz (Twitter), who made all of the sprites, came up with the concept, and the awesome name. </p><p>Please send me your high scores after playing!</p>\n<p><strong>Controls</strong></p>\n\r\nKeyDescriptionArrow keysMoveZDemon shot. Shoot enemy demons with this shot to maximize your demon powers.XAngel shot. Shoot enemy angels with this shot to maximize your angel powers.<br/>CScoring mode. Spends one level of each bar, and makes you briefly invincible.Z + CDemon bomb. Spends one level of demon power, and does damage to enemies on the screen. X+CAngel bomb. Spends one level of angel power, and clears all of the bullets on the screen. \r\n<p><strong>Other Credits</strong><br/></p>\n<p>Font from: https://managore.itch.io/m3x6</p>", "metacritic": null, "released": "2019-10-19", "tba": false, "updated": "2019-10-21T05:54:32", "background_image": "https://media.rawg.io/media/screenshots/16d/16dd3c20a6d82bfeec94fd612246233f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["jayjesreflecting"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}