{"id": 385240, "slug": "skellemen", "name": "Skellemen", "name_original": "Skellemen", "description": "<p>This game was created for the AIE Battle for Train Jam event, a competitive jam where the winner gets a scholarship to participate in Train Jam. <br/><br/>The Theme was \"Limited Space\"<br/><br/></p>\r\nSome ramble if you find that you are struggling to understand the game loop (sorry)\r\nMain Game play loop\r\n<p>The game run a 4 second \"turn\" based system. When you encounter an enemy, they will first go into a \"taunt\" animation, and then the fight begins. </p>\n<p>During the fight, the enemy will do an animation that signifies if they are going to attack on the next turn. (As you play, you will start to see a pattern). This is also when the player will have to decide what weapon they thing best suits the following turn. <em>Will the enemy attack?</em> Use a shield. <em>Are they vulnerable?</em> whip about a sword. </p>\r\nNow, the inventory system\r\n\n<p>You can open up your inventory by pressing <strong>T </strong>(Shown in Red)</p><ul><li>Each Item in your inventory takes up space. The rarer the weapons, the more inventory space they take up. (Shown in Blue)</li></ul><p>After each turn, the enemy will drop two random loot, corresponding to their level (Shown in Purple)</p><ul><li>You can pick the dropped weapons up with the <strong>E</strong> or <strong>R </strong>keys. Note that you have to have the appropriate amount of inventory space, and you haven't locked in a weapon.</li></ul><p>This wheel indicates that you can pick what items you want to use, and what you want to throw away. <br/></p><ul><li>Use the <strong>Left and Right Arrows</strong> on  your keyboard to cycle through your current inventory</li><li>Use the <strong>Up Arrow</strong> to <em>lock in</em> what item you would like to use</li><li>Use the <strong>Down Arrow</strong> to throw away the item.</li></ul><p>There's a whole lot more mechanics in the back end like rarity based shielding, but thats for you to figure it out. If you have any questions, you can ping (Quantum Blue#1234) on Discord, or reach out to any of the devs  listed below~<br/></p><br/><br/>Game Created by\r\n<p>Ray Soyama - Systems Programmer, &amp; Game play Lead<br/></p>\n<p>Camden Cecrle -  Character and Animation Lead</p>\n<p>Caleb Shaw - Environment and  Weapons Lead</p>\n<p>Sterling Savoy - VFX Lead<br/></p>\n<p>Travis (Soren) Benton - Character and Animation</p>", "metacritic": null, "released": "2019-10-18", "tba": false, "updated": "2019-10-21T05:58:10", "background_image": "https://media.rawg.io/media/screenshots/e01/e012b21e8c67acf5b72d02aada35bdd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Camden Cecrle", "Caliber5", "Ray Soyama", "Travis Benton"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}