{"id": 385293, "slug": "malfunction-itch-barlock-games", "name": "Malfunction (itch) (Barlock Games)", "name_original": "Malfunction (itch) (Barlock Games)", "description": "What is Malfunction?\r\n<p>Malfunction is a puzzle/action game that aims to bring many unique ideas to the table. Malfunction's story evolves around a planet that is being overtaken by a fierce virus known as the 'Plague'. Your objective is to end this corruption from spreading furthermore.</p>\n\n<strong>Gameplay:</strong>\n<p>Malfunction will take you on a long riskful journey that'll introduce many friends and foes. With the different characters you play as, you'll be exploring the vastness of 'Khaugin' and it's environments while completing puzzles, gathering materials to survive and conquering the enemies that stand before you.<br/></p>\n<p>With these playable characters you'll have multiple modes to choose from, each having their own purpose for the right time.</p>\n\r\nFeatures:\r\n<ul><li>DRM Free. Once you download Malfunction, you keep it forever</li><li>25 levels and 5 chapters with up to 6-8 hours of gameplay</li><li>3 additional game modes, all of which involve mechanics such as racing <br/>through goals, stealth attacking enemies, and fighting waves of \r\nenemies/bosses</li><li>25 collectable journal notes that are found throughout the game. These notes give more depth of Malfunction and it's universe</li><li>With 3 years of development, Malfunction will offer a clean, polished experience that is definitely worth a play</li></ul>", "metacritic": null, "released": "2019-10-17", "tba": false, "updated": "2019-10-21T06:09:13", "background_image": "https://media.rawg.io/media/screenshots/92b/92b17ca36d623298bae38a3b9afdb471.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Barlock Games"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}