{"id": 385300, "slug": "hyperspace-lovers-conquest", "name": "Hyperspace Lovers' Conquest", "name_original": "Hyperspace Lovers' Conquest", "description": "<p>You are a student at Hyperspace High, a prestigious school for promising young military-grade combat spacecrafts. Lately, the Vorles System has been rowdy, what with the invading armies of all-terrain killer robots and such. That’s not what’s important though. Something is tugging at your heart, and you’re certain there’s someone out there that feels it too.  It’s been awhile of lonesome time in the cosmos. Being a combat spacecraft isn’t as easy without a companion. Perhaps this year, it’s time to start a conquest for love.</p>\n<p>Hyperspace Lover’s Conquest is a bullet hell/ dating sim hybrid that centers around spending time with spaceship girls amidst an invasion of hostile, all-terrain killing machines. Have fun with your date in enjoyable activities, and destroying pursuing robots between each wave. By working together during combat, you can form a better bond. Choose between three girls, and experience their stories in the form of both a visual novel, and an intense bullet-hell segment. Included also are boss battles, weapon changing system, companionship systems, and bombs. \r\n</p>\n<p><strong>Characters:</strong></p>\n<p>AN0N (Main Character): Black ship, very protagonist-y\r\n  </p>\n<p>               RE1: hot color pallet mostly red, feisty, very opinionated, hates green onions, enjoys cosplaying in secret, short temper but has a lot of passion and love for living. Offence ship; rapid fire low damage\r\n  </p>\n<p>               4MY: Blues/ cold color pallet, thoughtful, tender, empathetic, intellectual, has many cats, plays video games and listens to future bass music. Offence ship; slow fire, high damage\r\n  </p>\n<p>               JUN3: Yellow/bright pallet, shy, bubbly, determined, clingy/protective, enjoys bubble tea but doesn’t drink it too much because she’s scared of getting fat. Defensive ship; shielding capabilities, slow and weak shots.          \r\n  </p>\n<p> <strong>Controls:</strong></p>\n<p>Movement: Arrow keys or mouse\r\n  </p>\n<p>Move: Arrow Keys or WASD\r\n  </p>\n<p>               Shoot: Z or Space\r\n  </p>\n<p>               Bomb: X\r\n  </p>\n<p>Swap Weapon: C for Fast shot, V for Spread shot, B for Laser\r\n</p>\n\n<p>This game was produced as a class assignment by:</p>\n<p>Alexander Gifford<br/></p>\n<p>Victoria Congson\r\n  </p>\n<p>Justin Boachie</p>", "metacritic": null, "released": "2019-10-18", "tba": false, "updated": "2019-10-21T06:11:03", "background_image": "https://media.rawg.io/media/screenshots/328/328ea74015be21a63962ebbc355449d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AeonArts"], "genres": ["Action"], "publishers": [], "esrb_rating": null}