{"id": 385408, "slug": "suicide-maze-cube-puzzle-survival-hardcore-game", "name": "Suicide Maze Cube - Puzzle Survival HardCore Game", "name_original": "Suicide Maze Cube - Puzzle Survival HardCore Game", "description": "<strong>A new perspective for traditional maze games.</strong><br/><br/><strong>In a mood of suspense and apprehension prepare for many scares in increasingly difficult mazes, where death is just around the corner, all in Old School style when there were no tutorials and tips.</strong><br/><br/> - Game Details: <br/><br/><ul><li>Game with <strong>dark ambiance that conveys the presence of death</strong> with thematic in silhouette, immersive and ominous sound. A game that aims to challenge the most experienced Had Core games, survival and puzzle.<br/><br/></li><li><strong>“Old School”</strong> style play when there are no tutorials, guides, and mission markers, test your skills and have fun discovering things on your own.<br/><br/></li><li>In this game <strong>your most precious asset is your life</strong>, so be careful when venturing into the mazes, as if it reaches zero it will be Game Over and all progress will be lost.<br/> <br/></li><li><strong>Game Modes:</strong><br/><br/><ul><li>Adventure Mode: 24 deadly mazes where only the strong will survive.<br/><br/></li><li>HardCore Mode: For those who want more challenges, in this game mode many of the pitfalls will be hidden, you will depend even more on your memory and agility, it will be much harder to come to life, with just one slip you will surely find death.<br/><br/></li><li>Time For Life: The maze puts a bomb into our hero's body if it doesn't complete the level within the given time \"BOOM!\" death is certain!<br/><br/></li><li>Relaxing Mode: Made for maze lovers, but without the adrenaline rush of staying alive ... Enjoy all the mazes in the game without any enemies, traps or collectables, just for the pleasure of discovering the exit portal to the next maze. There is! Just to make it difficult ... rssss, the exit portal is random, meaning every time you play it will be in a different place, so you can play this mode as many times as you like.</li></ul><br/></li><li>Seemingly simple but prepared mazes to complicate your life, solve the Cubic Matrix puzzles where a wrong answer can be costly!</li></ul><br/>In 3 creepy game modes and 1 relaxing mode (No one is iron right!) The mazes will test all your skill.<br/><br/>Your reaction time will be put to the test all the time, accumulating “cubics” to ensure extra lives and memorizing where some enemies are is the key to survival.<br/><br/><ul><li> The Labyrinth<br/><br/>Embedded in the depths it is <strong> a living trap</strong> and will do its best to prevent you from discovering the secrets and mysteries of the \"Cubic Matrix\", while exploring your memory, agility and attention to every detail of the environment can be the difference between predicting an attack and escaping from death, solve a puzzle or succumb to the maze!<br/><br/><strong>*Tip:</strong> \"If you find the <strong>\" Red Eye \"</strong> known as Cubeater ... <strong> just run.”</strong><br/><br/><br/><br/></li><li> Cubic Matrix:<br/><br/><strong> Mysterious entities</strong> endowed with magic power and light.<br/><br/>Tell the legend that <strong> secrets will be revealed</strong> and something SPECIAL will happen to the brave adventurer who manages to reach the end of the maze.<br/><br/><br/><br/></li><li>The Cube:<br/><br/>A brave adventurer determined to reveal the secrets and mysteries of the Cubic Matrix and become the greatest cubic explorer in the universe. <strong> (Is there no other hidden purpose?)</strong><br/><br/><br/><br/></li><li><strong>Bonus Level:</strong><br/> <br/><strong> Beat all 24 levels in Hard Core Mode and unlock 2 secret levels to win.</strong><br/><br/>Take your agility, attention and memory to the limit in a world where there is no second chance!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-25T02:24:34", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5df32ffbb2b689198acc72be9727867.jpg", "website": "https://www.yawstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YAW Studios"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["YAW Studios"], "esrb_rating": null}