{"id": 385498, "slug": "windmill-kings-feng-che-guo-wang", "name": "Windmill Kings / 风车国王", "name_original": "Windmill Kings / 风车国王", "description": "Rally your troops and take back the throne or challenge your friends in player-vs-player battles!<h3>The story:</h3><br/><ul><li> Explore the land you once called home. And take it back.<br/></li><li> Meet and recruit allies in your mission to take down the black wizard and his cohorts.<br/></li><li> Capture windmills to generate the gold needed to fuel your war machine.</li></ul><h3>Battles:</h3><br/><ul><li> Real-time, fast-paced battles will test your mettle. Do not back down. No retreat!<br/></li><li> Twelve unit and structure types, each with their unique uses and abilities.<br/></li><li> Layer and diversify the warriors under your command and plan your attacks by exploiting the strengths and weaknesses of enemy troops, but plan quickly.<br/></li><li> Support and upgrade your forces in battle by constructing their special building, turning simple soldiers into powerhouses on the battlefield.</li></ul><h3>Tactics:</h3><br/><ul><li> Cast powerful spells to help turn the tide of war in your favor or summon mighty Giants to tear your enemies asunder. But be warned: your enemies have learned the ways of ancient magic, too!<br/></li><li> Prefer subterfuge? Rogues and ninjas bypass the thick of the fighting and go straight after the enemy’s infrastructure.<br/></li><li> Learn from the computer AI by seeing its strategy play out in real-time. Improve your tactics, obtain victory, and reclaim the throne in the Final Battle!</li></ul><h3>Different game modes:</h3><br/><ul><li> Take back the kingdom in the classic Campaign game mode against the AI or challenge your friends in competitive one-on-one battles.<br/></li><li> Tailor multiplayer fights to your desires with the settings and wage battle from skirmish to all-out war.<br/></li><li> Two difficulty modes: Easy for a more casual experience and Normal to play how it was intended.</li></ul><h3>Play the way you prefer:</h3><br/><ul><li> You can use the mouse (click to move on map, click to buy units/build/cast spells)<br/></li><li> You can use the controller (full controller support)<br/></li><li> You can use the keyboard (WASD or arrows to move, E or Enter to buy/build/cast spells)<br/></li><li> Two players can play versus games on one keyboard (WASD for left player, arrow keys for right player)<br/></li><li> All keys are configurable<br/></li><li> Mind-control is still not supported, but might be in the future ;)</li></ul><br/>So, King, do you think you have what it takes to restore your kingdom, dispose of these traitors, and make your mark on destiny?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-25T03:13:45", "background_image": "https://media.rawg.io/media/screenshots/3b2/3b283cd8efda50bea5b614fbcb45e2bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bigosaur"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Bigosaur"], "esrb_rating": null}