{"id": 385551, "slug": "village-city-island-simulation", "name": "Village City Island Simulation", "name_original": "Village City Island Simulation", "description": "If you liked the early village building sim games, you will definitely love this village building tycoon simulation game!<br/>In Village City - Island Sim you will expand and build houses for your citizens, decorations and community buildings to make them happy, explore the beach, and create jobs so you can earn money and gold from your happy citizens. If you like to play a free village building game, building a virtual life on Village City - Island Sim is your best choice! Expand your village to make it larger and more challenging.<br/> <br/>Discover, be creative and expand your island, town and beach life in a virtual world full of quests where you have the power to build a lot of different structures with a choice of 100+ unique buildings, like hotels, cinema's, offices, bakeries, restaurants, and even oil platforms on your island paradise. Start with a tiny village and grow it into a large metropolis. Catch some fish with your boats, make people happy by building parks, beach huts, schools, churches, libraries, museums, plants, and even a nice ferris wheel. It is all about insight and balance in this village city town game: happy people attract more citizens, who will need residences and jobs. You have all the power in this epic story: discover what is the best way to be a successful entrepreneur in this fabulous virtual world!<br/><br/><br/>** Features **<br/>- Top FREE to play simulation game<br/>- Tablet support<br/>- HIGH QUALITY town graphics<br/>- Translated to 18 languages<br/>- Intuitive gameplay<br/>- Challenge to create your own new virtual paradise<br/>- Unlock and build from a list of 100+ Unique buildings (residential, commercial, farm, community, decoration, park, plants, beach and sea buildings like oil platforms and more)<br/>- Currencies: gold and cash<br/>- Attract citizens with parks, trees, and community buildings<br/>- Build residences for your larger population of citizens<br/>- Collect profit from your commercial buildings<br/>- Upgrade your city buildings<br/>- Collect XP and level up to unlock new buildings for construction<br/>- Collect dozens of REWARDS while playing<br/>- Expand the tiny city on your larger paradise island to create more room for constructing more buildings, and making your tiny city bigger and bigger<br/>- Speed up construction/upgrade time using gold<br/>- Lots of adventure and quests to unlock<br/>- Help your citizens build a city on this exotic island and explore the beach<br/>- Age independent story<br/>- Find pirate chests around your island, containing cash or gold<br/>- Tons of hours of fun<br/>- Play with your friends: enter friend codes and gift codes to receive cash and gold<br/>- The \"City Advisor\" will provide insight and tell you what is needed in your city", "metacritic": null, "released": "2015-07-22", "tba": false, "updated": "2019-10-25T03:40:02", "background_image": "https://media.rawg.io/media/screenshots/912/9126b11a4dbeb6cdfd653b0f1420ae7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sparkling Society"], "genres": ["Strategy", "Simulation"], "publishers": ["Trigames"], "esrb_rating": "Everyone 10+"}