{"id": 385508, "slug": "iron-blood-vr", "name": "Iron Blood VR", "name_original": "Iron Blood VR", "description": "<strong>Iron Blood VR</strong> is a sci-fi team shooter with various characters. Each character possesses unique weapons and skills. All the characters are able to communicate by teleporting to their allies, which makes the game insanely dynamic. By the way, teleportation beam is lethal to enemies. There are grenades available to each character, which can turn the tide of battle if thrown accurately.<br/><br/>There is no death in 2120… almost. After the Global Scientific Society invents the U.S.R.W. (The Universal Soul Rewritable device), the world has plunged into an endless war. After dying in battle, soldiers rise again as mechanical shells to complete their mission. The Opposition believes that the U.S.R.W. is nothing but a Devil’s gift, and the souls of resurrected soldiers will burn in Hell forever. But who cares when we can live and fight so mindlessly right now? You are to fight on the fields of eternal battle between the Center and the Opposition.<br/><br/><strong>Diesel</strong> is the masterpiece of power and vitality equipped with a multi-barreled shotgun. His special power is a shield.<br/><strong>Rayan</strong> is a swift fighter with a quick-firer. His specialty is an increased fire rate of the rifle, which multiplies its firepower.<br/><strong>Amelia</strong> is a female light-armored character. She is able to cure herself and allies with an energy beam.", "metacritic": null, "released": "2019-11-06", "tba": false, "updated": "2019-10-25T03:19:18", "background_image": "https://media.rawg.io/media/screenshots/3f0/3f04b71cab0e75249abce2aefd6b8422.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 483, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Donteco"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Donteco"], "esrb_rating": null}