{"id": 385502, "slug": "kwaidan-azuma-manor-story", "name": "Kwaidan ～Azuma manor story～", "name_original": "Kwaidan ～Azuma manor story～", "description": "The stage of this work is <strong>Japan of the 1930s</strong>.<br/>Explore the mysterious Azuma Manor and do battle with the Yoki that lurk within, all while solving devilishly clever mechanical puzzles.<br/><br/><br/>Kwaidan offers a <strong>seamless merging of 3D action and point-and-click adventure</strong> game elements, allowing for a truly unique play experience. <br/>Players move and fight through the world in 3D, but can call up a cursor to examine points of interest at any time. <br/>The result is an action-adventure unlike any other.<br/><br/><br/>In sharp contrast to recent action games, which seek to deliver player satisfaction above all else, Kwaidan was <strong>designed from the ground up to deliver highwire suspense</strong> from beginning to end. <br/>Nightmarish Yoki and fiendishly clever puzzles obstruct your path through the manor, but overcome these obstacles, and a profound sense of catharsis awaits.<br/><br/><br/>Enjoy <strong>retro polygon graphics</strong> that evoke classic games of the early 2000s, with film-reel-style presentation that transports players to a secluded mountain manor from the earliest days of Japan's Showa era.<h3>Features:</h3><ul><li>Severe 3D action that requires precise operation and accurate judgment.</li><li>A point-click adventure element that lets you fully enjoy the fun of exploration.</li><li>Japanese retro romantic world of the 1930s (early Showa era) brought to life by classical techniques.</li><li>Equipped with a “mode selection function” that allows you to enjoy changes in operation methods and graphics.</li></ul>", "metacritic": null, "released": "2020-01-31", "tba": false, "updated": "2023-02-13T16:10:16", "background_image": "https://media.rawg.io/media/screenshots/baa/baa0e023415129b021306b0a889d3eaf.jpg", "website": "https://gudouan.com/kwaidan.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "playing": 1}, "playtime": 1, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["求道庵（gudouan）"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mediascape Co.,Ltd."], "esrb_rating": "Teen"}