{"id": 385597, "slug": "my-cat-virtual-pet-game", "name": "My Cat - Virtual Pet Game", "name_original": "My Cat - Virtual Pet Game", "description": "Have you been dreaming of getting a cat for a long time? Don’t give up on your dreams. Get a cat right now!<br/><br/>Meet your new virtual friend! Just look at these cute eyes that will melt your heart! And listen to that pleasant purr that will make your day. Play with your kitty, give it the most delicious snacks, take it for walks and have fun all day. Love your cat and it will love you back &lt;3<br/>The only virtual cat that looks like and feels like a real cat! Feed it, pet it, play with it. Take it wherever you want, your kitty will always be by your side!<br/><br/>It has a number of features that will bring your pet-owning experience to a whole new level:<br/>- AUGMENTED REALITY: Use your smartphone camera and the kitty will appear right in your house. <br/>- FUNNY MEMORIES: Take cute photos of your virtual cat to share with friends and show off on social media.<br/>- EXTRA ITEMS: Take care of your kitty, play with it and enjoy extra items as a reward!<br/>- SO REAL: The kitty reacts to every touch like belly rubs and scratching its nose with your finger!<br/>- MORE FUN: While your kitty is asleep or busy with some important cat business you can set new records in an exciting Match 3 game with more than 400 levels!  <br/> <br/>It’s your time to finally get a cat-friend with My Cat! Love it, take care of it and see that it’s a perfect partner for you!<br/><br/>Subscription options:<br/>Weekly Membership offers $9.99 weekly subscription after 3-day free trial for unlocking all content and features.<br/><br/>End of trial and subscription renewal:<br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Privacy Policy: https://docs.liftapp.by/policies/privacy-policy<br/>Terms of Use: https://docs.liftapp.by/policies/terms-of-use", "metacritic": null, "released": "2019-10-23", "tba": false, "updated": "2019-10-25T03:59:35", "background_image": "https://media.rawg.io/media/screenshots/0b1/0b17a0fdc07b24663f7b2550e9ea2456_LOqgEgG.jpg", "website": "http://liftapp.by/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["LiftApp"], "genres": ["RPG", "Simulation"], "publishers": ["Lift App OOO"], "esrb_rating": "Teen"}