{"id": 385637, "slug": "super-quickhook-gameclub", "name": "Super QuickHook - GameClub", "name_original": "Super QuickHook - GameClub", "description": "Jump into hook-swinging action and conquer the mountain with your trusty grappling hook. <br/><br/>* 96 / 100 - Metacritic<br/>* 5 / 5 - 148Apps<br/>* 4 / 4 - Slide to Play<br/>* 5 / 5 - AppSpy<br/>* 4.5 / 5 - TouchArcade<br/><br/>Super QuickHook is the critically acclaimed sequel to the retro sidescrolling platformer classic Hook Champ. Use your grappling hook to race through gorgeous landscapes, survive a roaring avalanche, and discover secret loot to spend on character upgrades, equipment and fancy hats.  <br/><br/>Your grappling hook will let you cover wide expanses, while your rocket boots give you a soaring boost that can pull you out of certain death or help you reach a few mysterious locations. Handy mid-stage checkpoints help you mark your progress through the wildly challenging courses. Try out the all-new endless levels and see just how long you can stay ahead of a terrifying avalanche or the violent blast of an erupting volcano. The key to success comes from maintaining speed and momentum, which requires a careful eye and a very quick hook.<br/><br/>- Simple yet Deep: Tap and hold to fire your amazing grappling hook and let go to send yourself soaring through the air!<br/><br/>- Expansive Worlds: More than 20 levels intricately designed with multiple routes, secrets, and more!<br/><br/>- Awesome Upgrades: Spend your coins in the shop to improve your hook, upgrade your rocket boots, or even pick up a handy pedometer!<br/><br/>- Challenge the Endless Levels: Swing at high speed to stay ahead of a massive avalanche or an erupting volcano! How long can you survive?<br/><br/>- Quirky Characters: Chat with all of the strange characters who stop in at the shop!<br/><br/>- Super Secrets: With plenty of unlockable hats and characters, you'll have to try anything and everything to find it all! Did someone say something about a gnome?<br/><br/>Super QuickHook is one of the many fantastic games brought back to life by GameClub, fully updated to support the latest versions of iOS and newest devices.<br/><br/>**************************************************<br/><br/>Super QuickHook is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.<br/>If you choose to purchase the optional subscription:<br/>- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.<br/>- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>- Terms of use: https://gameclub.io/terms<br/>- Privacy Policy: https://gameclub.io/privacy", "metacritic": null, "released": "2010-06-17", "tba": false, "updated": "2019-10-25T04:14:11", "background_image": "https://media.rawg.io/media/screenshots/de8/de8f302b03dee125d83299291dd35064.jpg", "website": "https://gameclub.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameClub"], "genres": ["Action", "Casual"], "publishers": ["GameClub"], "esrb_rating": "Everyone 10+"}