{"id": 385607, "slug": "minisquadron-gameclub", "name": "MiniSquadron Special Edition", "name_original": "MiniSquadron Special Edition", "description": "<h2>MiniSquadron is a frantic shooter for the iPhone/iPod Touch, involving lots of little planes all vying for supremacy of the skies! Perform loop-the-loops, Immelmann turns and other daring feats of aerial shenanigans with a super fluid control system - experience the joy of freedom in the air!</h2>\n<p>&quot;MiniSquadron is fluid, smooth, and above all, a fantastic plane-based shooter.&quot; - 4.5/5 &quot;Fantastic Must-Have&quot; - 148apps<br />\n&quot;It’s one of those games that hits the spot in the ways that matter. Go ahead and skip that delicious McLatte, and buy this exceptional shooting game instead.&quot; - 4/4 - SlideToPlay<br />\n&quot;MiniSquadron is one of the most fun experiences on the iPhone, and is not only the best flying game, but already one of the top five games overall.&quot; - 5/5 &quot;Absolute Must&quot; - AppAdvice<br />\n&quot;What&#39;s most important, though, is that Mini Squadron feels really sweet to play while encouraging addictive replay&quot; - 8/10 - PocketGamer<br />\n&quot;MiniSquadron can be thoroughly recommended both to those who wish to take a trip down memory lane and to those who are new to the 2D dog-fighting genre.&quot; - 4/5 - TouchArcade</p>\n<hr />\n<h1>Shoot down enemy planes, bombers, UFOs, ducks, collect a plethora of power-ups - and unlock over 50 types of planes with different weapon types! There&#39;s nothing quite like this on the iPhone!</h1>\n<h1>FEATURES:</h1>\n<ul>\n<li>Intuitive touch controls.  </li>\n<li>Stunning graphics and art.  </li>\n<li>Over 50 planes to unlock and collect.  </li>\n<li>8 Levels of intense combat.  </li>\n<li>7 different types of weapon to use including BIG Laser!  </li>\n<li>Ducks, Seagulls, UFOs, Devil Planes, Squids!  </li>\n<li>Fluid gameplay systems based on physics  </li>\n<li>More than 8 different pick-ups.  </li>\n<li>Addictive Multiplier System for advanced players.  </li>\n<li>1 VERSUS 1 Local WiFi Multiplayer.  </li>\n<li>Rock out to the genius of Mozart, Beethoven, Tchaichovsky and other dead composers.  </li>\n<li>Ability to play your own music  </li>\n<li>Survival Mode  </li>\n<li>More JOY  </li>\n</ul>\n<hr />\n<p>MiniSquadron is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.<br />\nIf you choose to purchase the optional subscription:<br />\n- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.<br />\n- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br />\n- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.<br />\n- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.<br />\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br />\n- Terms of use: https://gameclub.io/terms<br />\n- Privacy Policy: https://gameclub.io/privacy</p>", "metacritic": null, "released": "2010-08-16", "tba": false, "updated": "2023-05-02T12:11:42", "background_image": "https://media.rawg.io/media/screenshots/568/56880b3a5d468a821f90003d5cf38e40_59jAkK2.jpg", "website": "https://gameclub.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 2, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameClub"], "genres": ["Action", "Adventure"], "publishers": ["GameClub"], "esrb_rating": "Everyone 10+"}