{"id": 385646, "slug": "mr-particle-man-gameclub", "name": "Mr. Particle-Man - GameClub", "name_original": "Mr. Particle-Man - GameClub", "description": "Remember the fun, fast-paced, and brutally difficult classic arcade gameplay from Ms. Particle-Man?<br/><br/>Mr. Particle-Man massively expands on the original winning formula with all new levels, new challenges, and new power-ups. You control the eponymous little hero as he bounces around like a mustachioed pinball, avoiding deadly obstacles, dashing past enemies, and doing battle with challenging bosses. The deceptively simple core gameplay mechanics are explored in increasingly creative and complex ways across more than 100 colorful levels. There's a surprising amount of depth in this humble little package. This homage to the arcade classics will have you gritting your teeth as you tackle its intense, challenging stages.<br/><br/>Being a particle, Mr. Particle-Man has a lot of specific qualities. He's very light, so he floats around with ease. He'll bounce off of any safe surface, and he picks up speed very fast. He can also charge up energy to send himself moving with great force. Unfortunately, he's a fragile little fellow. The slightest touch of any hazard will send him to pieces, and if he sits still too long, he'll explode. Guide him carefully to the exit on each stage, collecting pick-ups and avoiding dangerous traps. The faster you clear each stage, the more bonus points you'll get. <br/><br/>* * * * * * * * * * * *<br/><br/>KEY FEATURES<br/><br/>- Over 100 unique and colorful levels<br/>- Nonstop retro action<br/>- Challenging boss fights<br/>- Awesome power-ups<br/>- Responsive and intuitive touch controls: NO clunky on-screen buttons<br/>- Beautiful chiptune soundtrack<br/>- Gentle difficulty curve culminating in seriously satisfying challenges<br/><br/>* * * * * * * * * * * *<br/> <br/>PRAISE<br/><br/>\"Satisfyingly challenging. The gentle difficulty curve means beginners are welcome, but seasoned gamers are the guests of honor.\"<br/>- Phil Bass, creator of the IGF-nominated masterpiece Shriner Kart<br/><br/>\"Clearly built from the ground up for touchscreens. Responsive and intuitive controls that (refreshingly) don't need a word of explanation. Best of all: No clunky on-screen buttons.\"<br/>- A.S.S., Area Donkey Kong high score holder<br/><br/>\"Gloriously designed for maximum flow. No plodding exposition or pointless tutorial screens. Each level flows instantly into the next, so once you start, the retro action is nonstop.\"<br/>- GADD, Gamedevs Against Drunk Developing<br/><br/>\"A beautiful chiptune soundtrack composed from scratch by the incredibly talented surasshu.\"<br/>- Hero \"Coxa\" Tanaka, award-winning game soundtrack composer<br/><br/>**************************************************<br/><br/>Mr. Particle-Man is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.<br/>If you choose to purchase the optional subscription:<br/>- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.<br/>- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>- Terms of use: https://gameclub.io/terms<br/>- Privacy Policy: https://gameclub.io/privacy", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-25T04:17:53", "background_image": "https://media.rawg.io/media/screenshots/c14/c1495ad5557799a19effc7b3671841b7_seOekOk.jpg", "website": "https://gameclub.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameClub"], "genres": ["Action", "Casual"], "publishers": ["GameClub"], "esrb_rating": "Everyone 10+"}