{"id": 385614, "slug": "grimm", "name": "Grimm - GameClub", "name_original": "Grimm - GameClub", "description": "\"New and Noteworthy\" - Apple   \"iGame of the Day\" - Kotaku<br/><br/>Featured by Apple in the \"Great Platformers\" section!<br/><br/>Mother has lost her baby!  It is up to you, kindly gamer, to safely navigate the baby's carriage through over 10 worlds of twisted Victorian delights, delivering the lost child home.  Avoid the specter of Mr. Grimm, a shadowy figure intent on stopping you at every turn.  Grimm: Ride of the Perambulator is a unique side-scrolling adventure set in a dark and stylized world.<br/><br/>GAMEPLAY FEATURES:<br/>- Use the accelerometer to guide the carriage through over 10 worlds and 8 mini-levels of twisted and macabre delights.  <br/>- Launch the baby from the carriage to solve puzzles and combat villainous enemies<br/>- Survive the fiendish intentions of Mr. Grimm as he doggedly pursues you, presenting new challenges along the way.<br/>- Enjoy the unique and handmade art of the Grimm world.<br/><br/>Faithful gamer, the fate of a small child is in your hands.  Bravery and courage are needed.  Go forth, dauntless perambulator!<br/><br/>\"Exceptionally well made game with a hint of dark humor and original content. Grimm dares to go in a new direction with physics based platformers, and comes out with a winner. Super addictive and engaging game that’s worth every penny.\" - App Safari<br/><br/>**************************************************<br/><br/>Grimm is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.<br/>If you choose to purchase the optional subscription:<br/>- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.<br/>- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>- Terms of use: https://gameclub.io/terms<br/>- Privacy Policy: https://gameclub.io/privacy", "metacritic": null, "released": "2011-01-04", "tba": false, "updated": "2024-01-03T06:11:04", "background_image": "https://media.rawg.io/media/screenshots/57f/57f97397220442e71c51f9ba44b67fec_KzipzFC.jpeg", "website": "https://gameclub.io", "rating": 1.94, "rating_top": 1, "added_by_status": {"yet": 67, "owned": 1655, "beaten": 10, "toplay": 8, "dropped": 23}, "playtime": 0, "achievements_count": 0, "ratings_count": 87, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 87, "platforms": ["iOS"], "developers": ["Spicy Horse", "GameClub"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Akella", "GameClub", "GameTap"], "esrb_rating": "Everyone 10+"}