{"id": 385680, "slug": "mighty-party-online-rpg-games", "name": "Mighty Party: Online RPG Games", "name_original": "Mighty Party: Online RPG Games", "description": "Welcome to the Mighty Party, recruit! The time has come for you to enter the land of never ending battles in the quest for gold, honor, and legacy. This is your chance to prove yourself as the commander of the mightiest heroes of the realm.<br/><br/><br/>FORM YOUR PARTY<br/><br/>You are the commander of warriors, wizards, mythical creatures and other beings that are ready to leave all they have on the battlefield for you.<br/><br/>•\tFight in turn-based PvP battles to earn gold, XP, and cards;<br/>•\tWin and open chests with perks, such as cards and diamonds;<br/>•\tCollect characters with unique traits;<br/>•\tUpgrade your battle party to make it the strongest in the realm;<br/>•\tComplete daily and epic quests to earn more diamonds;<br/>•\tSummon new characters to fortify your battle party and win more battles.<br/><br/>SIMPLE MAP, UNIQUE GAME MODES<br/><br/>In the Mighty Party realm you will never get lost with all the critical spots in on the palm on your hand. Experience various game modes to get the best feel and have the most fun:<br/><br/>•\tEnter Battle Chambers for PvP battles;<br/>•\tHop in for a Journey to defeat mighty opponents and earn great prizes;<br/>•\tJoin a Brawl to fight random players and get a variety of rewards;<br/>•\tGo to the Gold Mine to fight for gold only;<br/>•\tJoin a Guild to compete against other guilds and make sure that your name is known well within the Realm! And don’t forget to chat with your guild-mates, as you prepare for your epic battles.<br/><br/>OUTSTANDING GRAPHICS AND SMOOTH GAMEPLAY<br/><br/>You are about to experience the magic and fun of the fantasy masterminds behind the game’s Realm, so be careful or you’re doomed to spend hours and hours fighting the enemies and becoming one of the strongest warlords in the game, as are immersed into:<br/><br/>•\tSpectacular visual graphics and animation;<br/>•\tMemorable and fun character designs;<br/>•\tSimple and intuitive gameplay – you will learn how to play it within seconds;<br/>•\tThirst for victory and eternal glory!<br/><br/><br/>You have to make sure that the Internet connection is in place, so you can smash your way through th rankings with your sword!<br/><br/><br/>=======<br/><br/>Support:<br/><br/>Are you having problems? Please contact us via email mightyparty.panoramik@gmail.com or in the game by going to Settings &gt; Support.<br/><br/><br/>Privacy Policy:<br/><br/>http://mighty-party.com/privacy_policy.html<br/><br/><br/>Terms of use:<br/><br/>http://mighty-party.com/terms_of_use.html<br/><br/><br/>Warrior's Subscription - is a monthly subscription service which gives the player 350 elixir every day. Warrior's Subscription cost 9.99 USD/month (or local equivalent) and will be charged on your iTunes Account after purchase and when the subscription renews monthly.<br/><br/><br/>General's Subscription - is a monthly subscription service which gives the player 2500 elixir every day. General's Subscription cost 49.99 USD/month (or local equivalent) and will be charged on your iTunes Account after purchase and when the subscription renews monthly.<br/><br/><br/>Daily Gems - is a monthly subscription service which gives the player 50 gems every day. Daily Gems cost 9.99 USD/month (or local equivalent) and will be charged on your iTunes Account after purchase and when the subscription renews monthly.<br/><br/><br/>Subscriptions will renew automatically unless auto-renew is turned off at least 24-hours before the end of the current period. Payment will be charged to iTunes Account at confirmation of purchase. The account will be charged for renewal within 24-hours prior to the end of the current period.<br/><br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during the active subscription period.", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2019-10-25T04:30:02", "background_image": "https://media.rawg.io/media/screenshots/b65/b6576c0010760e7e86414cdb0a23ff29_xphkbDn.jpg", "website": "https://panoramikgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Panoramik Games"], "genres": ["RPG", "Strategy"], "publishers": ["PANORAMIK GAMES"], "esrb_rating": "Everyone 10+"}