{"id": 385647, "slug": "any-landing-gameclub", "name": "Any Landing - GameClub", "name_original": "Any Landing - GameClub", "description": "In Any Landing, you are a pilot working for a very low-budget, cheapskate airline run by a dodgy boss. Your aircraft always breaks down, your engines are forever burning out…  and you, well, keep crash landing your planes. Not to mention a rival air company, Evil Air, is doing their best to keep you out of the skies. Your mission: keep your passengers happy and your aircraft flying!<br/><br/>* Fly through 32 levels over 4 different air routes<br/>* Crash-land your plane, plunder luggage for souvenirs and rescue cute kittens!<br/>* Fly 8 different aircraft and avoid been knocked out of the sky by the nefarious Evil Air<br/>* Use lots of different upgrades to improve your aircraft and fly further<br/>* Complete bonus VIP missions for extra rewards<br/>**************************************************<br/><br/>Any Landing is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.<br/>If you choose to purchase the optional subscription:<br/>- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.<br/>- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>- Terms of use: https://gameclub.io/terms<br/>- Privacy Policy: https://gameclub.io/privacy", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-25T04:18:14", "background_image": "https://media.rawg.io/media/screenshots/e0a/e0ad425782aed1c5afc635b3f7d0d829_QhksGsK.jpg", "website": "https://gameclub.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameClub"], "genres": ["Action", "Casual"], "publishers": ["GameClub"], "esrb_rating": "Everyone 10+"}