{"id": 385638, "slug": "glorkian-warrior-gameclub", "name": "Glorkian Warrior - GameClub", "name_original": "Glorkian Warrior - GameClub", "description": "BECOME A GLORKIAN WARRIOR! Visit awesome asteroids! Blast strange invaders!<br/><br/>Help Glorkian Warrior and his trusty Super Backpack fight against an endless onslaught of alien creatures.<br/><br/>In Glorkian Warrior, you play as a cadet out to prove his worth and maybe get a promotion or two. Your trusty Super Backpack will help you fend off the incoming attackers by firing a constant stream of lasers into the sky. Grab power-ups dropped by the enemies to gain temporary access to some Glorkin' good weapons. And if anything is too low to shoot, leap over it! It's good, classic shoot-em-up fun.<br/><br/>Defeated enemies will drop energy crackers. The more of them you grab, the more cool stuff you'll unlock. Even if you have a terrible run, you'll still make some progress! Try not to have a terrible run, though. It's really bad for our hero's confidence! You can get fun things like basketballs! New weapons! More basketballs, but these ones explode! There are even some fun comics featuring our daring protagonist, drawn by James Kochalka himself. What are you waiting for? Get out there and collect those energy crackers!<br/><br/>- Classic Shooting Action: Move side to side and shoot upwards, just like the old days!<br/>- Wild Power-Ups: Not only can you get some different weapons, you can also pick up extra power-ups to make them faster or stronger! <br/>- Huge Bosses: Seriously, these aliens are so big! What is up with that?<br/>- Tons to Unlock: New weapons, comics, decorations, and more! Become the President of Everything!<br/>- Multiple Control Options: Choose the way that works best for you!<br/>- Vibrant Graphics: It looks just like a cartoon! Who knew there were so many colors on these things?<br/>- Based on James Kochalka's graphic novel “The Glorkian Warrior Delivers a Pizza\"<br/><br/>GLORK!<br/><br/>**************************************************<br/><br/>Glorkian Warrior is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.<br/>If you choose to purchase the optional subscription:<br/>- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.<br/>- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>- Terms of use: https://gameclub.io/terms<br/>- Privacy Policy: https://gameclub.io/privacy", "metacritic": null, "released": "2014-03-13", "tba": false, "updated": "2019-10-25T04:14:34", "background_image": "https://media.rawg.io/media/screenshots/000/000becbb7cb1f2c17d3dd0c65f1ee7c8_pXfz27E.jpg", "website": "https://gameclub.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameClub"], "genres": ["Action", "Casual"], "publishers": ["GameClub"], "esrb_rating": "Everyone 10+"}