{"id": 385718, "slug": "papas-cheeseria-to-go", "name": "Papa's Cheeseria To Go!", "name_original": "Papa's Cheeseria To Go!", "description": "-- ABOUT THE GAME --<br/><br/>Papa's Cheeseria is kicking off its grand opening with a special performance by the high-energy band, Scarlett and the Shakers!  Unfortunately the concert is canceled when all of the music gear is stolen, and you'll need to pick up a job to afford buying new instruments for the band.  Thankfully Papa Louie has the perfect solution for you:  He's putting you in charge of making grilled cheese sandwiches in his newest restaurant!<br/><br/>You'll need to prepare sandwiches with delicious breads, melty cheeses, and a wide array of toppings and sauces for a gourmet grilled cheese.  Cook and flip the sandwiches to grill them just right, and finish your customers' orders with a heaping order of fresh french fries covered in their favorite sauces and toppings.  The town of Toastwood will celebrate different holidays throughout the year, and you'll unlock new festive ingredients as you go to serve up delicious seasonal sandwiches.<br/><br/>-- GAME FEATURES --<br/><br/>NEW FEATURES - All of your favorite features from other versions of Papa's restaurants are now available in this \"To Go\" game, redesigned and reimagined for smaller screens!<br/><br/>HOLIDAY FLAVORS - Celebrate the seasons in Toastwood with tasty holiday flavors!  Your customers will order sandwiches stacked high with seasonal ingredients.  You'll unlock new breads, cheeses, toppings, and sauces for each holiday of the year, and your customers will love trying these festive flavors.  This new version adds holiday toppings and sauces for fries as well!<br/><br/>SERVE SPECIAL RECIPES - Earn Special Recipes from your customers, and serve them as the Daily Special in the Cheeseria!  Each Special has a bonus you can earn for serving a prime example of that recipe.  Master each special to earn a special prize!<br/><br/>CUSTOMIZE YOUR WORKERS - Play as Scarlett or Rudy, or create your own custom character to join the band and work in the sandwich shop!  You can also show off your holiday spirit with a massive variety of holiday outfits and clothing for your workers.  Choose unique color combinations for each item of clothing, and create your own style with millions of combinations!<br/><br/>SPECIAL DELIVERY - Some customers don't want to come all the way to Toastwood to grab some grilled cheese.  When you start taking phone orders, customers can call to place their order, and you'll hire a Driver to help take and deliver orders to their homes instead!<br/><br/>COLLECT STICKERS - Complete a variety of tasks and achievements while playing to earn colorful Stickers for your collection.  Each customer has a set of three favorite Stickers: Earn all three and you'll be rewarded with a brand-new outfit to give to that customer!<br/><br/>DECORATE THE SHOP - Customize the Cheeseria lobby with themed furniture and decorations for each holiday of the year!  Mix and match your favorite styles, or add items that match the current holiday so customers won't mind waiting longer for their food.<br/><br/>CLIPPING COUPONS - Missing your favorite customer?  Send them a coupon with the help of your friendly mailman, Vincent!  Customers love a good deal, and will promptly arrive to order another meal.  Coupons are great for completing quests for Stickers and for strategically leveling up customers!<br/><br/>DAILY MINI-GAMES - Play Foodini's famous Mini-Games after each workday to earn new furniture for your lobby and new clothing for your workers.<br/><br/>-- MORE FEATURES --<br/><br/>- Hands-on sandwich shop in the Papa Louie universe<br/>- All new controls and gameplay features designed for touchscreens<br/>- Multi-task between building, grilling, and preparing french fries<br/>- Custom chefs and drivers<br/>- 12 separate holidays to unlock, each with more ingredients<br/>- Earn and master 40 unique Special Recipes<br/>- 90 colorful Stickers to earn for completing tasks<br/>- 124 customers to serve with unique orders<br/>- Use Stickers to unlock new outfits for your customers<br/>- 125 ingredients to unlock", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2024-03-11T11:13:47", "background_image": "https://media.rawg.io/media/screenshots/a28/a28a7a42ac91a642b9ed929a3e9c2578_IL9VHAm.jpg", "website": "http://www.flipline.com/apps/papascheeseriatogo/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Flipline Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["Flipline IDS"], "esrb_rating": "Everyone 10+"}