{"id": 385785, "slug": "planet-lander-itch-nannings", "name": "Planet Lander (itch) (Nannings)", "name_original": "Planet Lander (itch) (Nannings)", "description": "<p>Maneuver your space ship trough lunar caves. Each level is set on a different planet. Try to reach the ending landing platform. Thrust your ship wisely to avoid turrets shooting laser beams and moving space debris.</p>\n<p>In Planet Lander you thrust through galactic caves on planets trying to find the landing platform unharmed. At first, the levels will seem like a breeze as you easily maneuver through the caves. But later in the game, your path will get narrower and you will also encounter obstacles in the form of laser turrets and moving space debris.</p>\n<p>Some turrets have laser guns that shoot towards you and other spraying long beams to block your path. In space, there are moving debris too that are tricky to avoid but they keep their trajectory so you can predict their movement. Later levels will be longer so be sure to pick up enough fuel to reach the end. As you progress the caves are getting narrow so it will be harder to squeeze you through the level and finding the next landing path.</p>\n<p>This game is inspired by the old school classic Lunar Lander from Atari. The player burns fuel points while thrusting. By collecting barrels that are floating around the fuel meter gets filled. Rotate the right way and fire your thrusters to counteract gravity. You lose the game if you touch the sides of the cave or get hit by lasers or debris. If you run out of fuel you ship will stop moving and will eventually crash and burn.</p>", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-25T05:17:52", "background_image": "https://media.rawg.io/media/screenshots/271/271efd0c89587f68d04c9abbe7022bf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nannings"], "genres": ["Action"], "publishers": [], "esrb_rating": null}