{"id": 385703, "slug": "phantasmat-behind-the-mask-full", "name": "Phantasmat: Behind the Mask (Full)", "name_original": "Phantasmat: Behind the Mask (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>You receive an invitation from one of your relatives for a family reunion at Ward Manor. You haven’t seen them in quite some time, but once you arrive at the estate, you quickly find that your so-called family is acting much stranger than you remember. The old mansion is in serious disrepair, and it seems not everyone is there to catch up on old times.<br/><br/>• SURVIVE THIS DARK AND STORMY NIGHT!<br/>Every family has some skeletons lurking in the closet, but yours may be going for a world record. Will you make it to see the morning, or will this be your last night on earth?<br/><br/>• CAN YOU DEFEAT THE GHOSTS OF YOUR OWN FAMILY?<br/>Vanquish the vengeful spirits through ominous hidden object scenes.<br/> <br/>• FIND OUT WHAT EVIL HIDES BEHIND THE DISGUISE<br/>Track down your foe by solving spooky puzzles and haunted mini-games.<br/><br/>• UNEARTH A DEEP, DARK SECRET IN THE CHILLING BONUS CHAPTER<br/>Find out what the family’s been hiding and enjoy additional Collector’s Edition exclusives including collectible Horses, special achievements, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-11-02", "tba": false, "updated": "2019-10-25T04:40:20", "background_image": "https://media.rawg.io/media/screenshots/57e/57ebde615051290a7fdbb75bd5739440.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}