{"id": 385764, "slug": "the-carbon-neutral-republic-of-novaya-zemlya-inc", "name": "The Carbon Neutral Republic of Novaya Zemlya (Inc.)", "name_original": "The Carbon Neutral Republic of Novaya Zemlya (Inc.)", "description": "<p>This game lets you simulate a struggle to build a home for global warming refugees north of the Arctic Circle, on Russia’s Novaya Zemlya island.  The game starts after your daring band of environmental activists have captured Novaya Zemlya, and have set up refugee camps, offshore wind turbines and greenhouses.  Of course, Russia wants its island back, and is attacking Novaya Zemlya on multiple fronts.  To win, you will need to hold off the Russians for 100 turns.  To stop the Russians, you must develop new crops that grow fast in low light environments to feed your growing refugee population.  If you cannot take refugees off of the hands of nations further south, you will lose international support.  And you need international support to buy the weapons that you require to fight the Russians.  You will also need to counter Russian efforts to meddle in the internal politics of your allies and undermine international support for your cause.  Of course, you also need electricity to power your vertical farms and run your genetic research labs, so make sure that the Russians don’t capture too many of your offshore wind turbines.  The game’s card driven mechanics will let you figure out how to strike a balance between these competing priorities.  Good luck.</p>", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-25T05:12:56", "background_image": "https://media.rawg.io/media/screenshots/004/004a3dc55029947b926ea4191a55192f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["africacrossgames"], "genres": [], "publishers": [], "esrb_rating": null}