{"id": 385736, "slug": "space-justice-galaxy-shooter-shoot-em-up", "name": "Space Justice: Galaxy Shooter. Shoot 'em up", "name_original": "Space Justice: Galaxy Shooter. Shoot 'em up", "description": "Space Rangers lead the way! It's the 23rd century, and the galaxy unites to fight against an unknown foe!  The best of the best stand together as Space Justice - a small, but extremely efficient special operations team with you as their leader! <br/>Take command of your personal battlecruiser and send deadly fighters shooting all guns against overwhelming odds to secure new victories! Or, maybe, attack and raid you rivals' spaceships in a game of deadly competition... <br/><br/>- A classic arcade game reimagined: fast, dynamic vertical scrolling shooter gameplay meets outstanding graphics!<br/>- Welcome to the command bridge! Upgrade and enhance your flagship and airplanes fleet, research new technologies and acquire combat drones.<br/>- Make your choice: the selection of aircraft, weapons, drones and gadgets is as huge as it can be!<br/>- Different pilots, different tactics - make use of each race's strengths in merciless space combat, shoot 'em all up and win through synergy and guile!<br/>- Shoot, shoot, shoot! Join efforts with your friends to overcome the common foe. It takes a coordinated attack to bring down most powerful enemies, and the mission's rewards are well worth it!<br/>- Enter the PvP mode and plunder enemy cruisers for resources, shooting down all that resist! Play hard, use all sorts of tricks to outsmart your enemy! And never leave your own ship unprotected - lure your enemies into traps and ensure your wealth is well secured!<br/>It takes guts, wits and courage to fight and prevail in an addicting game of deadly space battles! Are you ready for Space Justice?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-25T05:02:14", "background_image": "https://media.rawg.io/media/screenshots/42a/42a5242ae073edf2349a585d929b33c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MY.COM"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone 10+"}