{"id": 385738, "slug": "evolution-2-battle-for-utopia-action-shooter", "name": "Evolution 2: Battle for Utopia. Action shooter", "name_original": "Evolution 2: Battle for Utopia. Action shooter", "description": "Evolution continues. The long-awaited sequel of the hit iconic sci-fi game is out! It tells you a story about the universe of Utopia from another angle.<br/><br/>The second episode reproduces the unique atmosphere of the Evolution that millions of players came to love. The gameplay of the Evolution 2 has changed drastically, turning into an intense mix of the third-person top-down shooter, action, strategy and RPG!<br/><br/>The breathtaking story will surprise you with completely unexpected turns!<br/><br/>Location: planet Utopia. A galactic billionaire resort once, it turned into a living hell possessed by ruthless marauders, monsters and battle robots. A relentless war is being waged here.<br/><br/>Never-ending combat awaits! Fight with powerful weapons, use the psi-energy of captain Blake, main character of the game. His super-powers are a result of a dangerous experiment, and he's ready to unleash them on any enemy at your command!<br/><br/>☆Unique sci-fi setting. Space post-apocalyptic biopunk action game set on a distant planet.<br/><br/>☆Unique balance of genres. Fusion of strategy, RPG and top-down shooter action game, featuring the ingenious combat system.<br/><br/>☆Tactical gameplay. Upgrade your character and their companion, select the most efficient weapon, and abuse weaknesses of your enemies.<br/><br/>☆Engaging PvE campaign. Plenty of missions and epic bosses. Your enemies become stronger from battle to battle.<br/><br/>☆Cooperative mode. Summon your loyal allies and complete missions shoulder to shoulder with other players.<br/><br/>☆Online battles. Battle in full online multiplayer. Win the top positions in the rating and receive unique bonuses for your victories!<br/><br/>☆Armory of the future. Fantastic weapons featuring unique statistics and upgrade system! It's not only good old firearms! Enjoy the energy, acid and bionic cannons!<br/><br/>☆Upgrade your base: unlock new premises and learn the technologies of the future! Evolution without limits!<br/><br/>☆Interactive arenas and realistic 3D animation grant complete immersion!<br/><br/>Your base has everything to start the battle. It's time to deal with Utopia, captain!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-25T05:03:31", "background_image": "https://media.rawg.io/media/screenshots/324/324038be7364eaebcfc01f869552b054.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MY.COM"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}