{"id": 385851, "slug": "veritas-demo-2", "name": "Veritas - Demo", "name_original": "Veritas - Demo", "description": "\n<p><em><strong>Veritas</strong></em> is a game of mystery and discovery from Glitch Games, creators of the Forever Lost trilogy, that poses the question; <em>what is truth, and does it even matter?</em><br/></p>\n<p>Having volunteered to take part in a study conducted by Veritas Industries, you now find yourself waking up in a small room with no memory of what happened the day before.<br/><br/>The last thing you remember is signing on the dotted line and following some nice people wearing white coats, but they couldn’t have been lying to you could they? They were doctors for goodness sake...<br/></p>\n\n\n\n<p>In the full compact narrative puzzle game, you'll:<br/></p>\n<ul><li><em><strong>Explore a dark and foreboding world full of lies and mysteries.</strong></em> You'll need to explore the entire facility to work out what happened and how you can escape.</li></ul>\n\n<ul><li><em><strong>Take photos of everything you find using the Glitch Camera.</strong></em> Be they posters, clues, walls, or disturbing blood stains - and use them later to help solve puzzles and piece together the mystery.</li></ul>\n\n<ul><li><em><strong>Solve lots of puzzles, ranging from inventory based item puzzles all the way to pun-based conundrums.</strong></em> All intricately designed to move the story along, you'll find no pointless filler here - just regular purpose made filler.</li></ul>\n\n<ul><li><em><strong>Be entranced by the beautiful soundtrack composed by Richard J. Moir.</strong></em> It's so good you won't mind listening to it, on repeat, forever, while you're trapped.</li></ul>\n\n<p>Use the Glitch Camera to:</p>\n<ul><li><strong><em>Take photos of everything you find</em></strong>. Be they posters, clues, walls, or disturbing blood stains.</li></ul>\n\n<ul><li><em><strong>Write notes on them like a real detective</strong></em>. Use less paper, kill fewer trees, save the planet!</li></ul>\n\n<ul><li><em><strong>Use your notes to solve puzzles.</strong></em> Pop multiple photos out so that you can look at them at the same time.</li></ul>\n\n<p> </p>\n\n\n<p>Please find us on Twitter, Facebook, Discord, and the Web to stay in touch!<br/></p>\n<br/>", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-25T05:34:48", "background_image": "https://media.rawg.io/media/screenshots/603/603fc440627d8e2c3316c4fc4761b282.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android"], "developers": ["Glitch Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}