{"id": 385909, "slug": "saudade-cafe", "name": "Saudade Cafe", "name_original": "Saudade Cafe", "description": "<ul><li>This game is about you entering this very 80’s, vapor wave- esque cafe, that’s a little more than than your average tea shop.<br/> As you decide what to order, feel free to talk to the odd patrons and ask what they got. Would they have some recommendations?<br/>\r\nI chose this topic because there are a few things that I enjoy, notably tea and monsters. I wanted to incorporate my interests as I made a game that was essentially my personality/ emotions realized. The drinks and foods are named after key emotions or thoughts, and the monsters were you, but maybe a different version of you.\r\n‘Saudade’ is a Portuguese word, which is closest translation being “the feeling of missing something, or a longing loss”.</li><li>Making this game what’s akin to rollercoaster for sure. The more fun parts were definitely the asset-making and matching materials to the different models I’ve made. Decorating the space so that it matched what I had envisioned was surprisingly calming compared to the coding I had to do for the dialogue system. Which, if you guessed it, wasn’t my favorite part. Making the dialogue show up and display according to which creature and stage you were on was a bit tricky, but it works in the most basic of terms. The good decisions were working on art while I worked off my frustration of coding, but the bad decisions were maybe just timing what I got done when.</li></ul>", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-25T05:50:15", "background_image": "https://media.rawg.io/media/screenshots/a1b/a1b5b4fa6c9b7c59454032f087166209.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SSKelpie"], "genres": [], "publishers": [], "esrb_rating": null}