{"id": 386083, "slug": "screensavers-vr-itch", "name": "Screensavers VR (itch)", "name_original": "Screensavers VR (itch)", "description": "<p>Before the internet took over, before memes multiplied, windows of computer fantasy spread over the world…there was THE SCREENSAVER. What began as a tool to prevent CRT monitor burn-in from static pixels became a dynamic canvas for whimsy and experimentation.</p>\n<p>A digital escape from your worries, Screensavers VR is respite and recovery from the demands of modern living. Explore the visual language of the past in a whole new way and surround yourself in Tangible Graphics Technology.</p>\n<p>Stop staring at your screen-- dive in and save virtual reality!</p>\n<p>\n<strong>Features</strong></p>\n<ul><li>Plunge your body into five screensavers inspired by the classics, and experience their evolution.</li><li>Physically manipulate digital worlds! Explore each micro-universe through wild parameters and VR-only effects like scale.</li><li>Kick back in the semi-authentic 90's office-den simulation and read original writing about the screensaver phenomenon.</li><li>Warp through stars like never before! Experience and endless starfield in HD!</li><li>Can you reach the end of M A Z E?</li><li>Pipes are so real, you’ll swear you hit your head.</li></ul>\n<p><strong>Why?</strong></p>\n<p>We all need to mix things up once in awhile. Screensavers VR is a digital escape to relax and enjoy at whatever pace you choose. We honor this fascinating and unique moment in history as the absurd and creative evolution of a straightforward technical need, and carry this ethos forward.<br/></p>\n<p><strong>Coming Soon</strong>\n</p>\n<ul><li>Attain peace of mind with multiple comfort options.</li><li>Relax for real with laying down mode!</li></ul>", "metacritic": null, "released": "2019-10-22", "tba": false, "updated": "2019-10-25T06:32:46", "background_image": "https://media.rawg.io/media/screenshots/f4d/f4d583b56af1775470f5360582254b54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["floatland"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}