{"id": 386094, "slug": "dmg-deals-damage", "name": "DMG Deals Damage", "name_original": "DMG Deals Damage", "description": "<p>This game is an <strong>actual Game Boy game</strong>, created to celebrate the 30th birthday of the best handheld console ever created! <br/></p>\n<p>You can play it online here thanks to the wonderful emulator RetroArch<em> (Gambatte core, HTML5 version by ToadKing)</em>. But you can also download the ROM for free to play it on any Game Boy emulator for any device. Last but not least, you can also buy a beautiful game cartridge to play the game on an actual Game Boy console:</p>\n\n<p>This game cartridge works on any Game Boy model: <em>the original one, the Game Boy Pocket, the Super Game Boy, the Game Boy Color, the Game Boy Advance, the Game Boy Advance SP, the Game Boy Player</em>, and even on unofficial hardware clones such as <em>the GB Boy</em>.</p>\r\nStarring\r\nThe Legend: DMG, the original Game Boy (1989)\r\n<p>Released in 1989, the original Game Boy was code-named “Dot Matrix Game (DMG).” It is, without question, the most successful and iconic handheld game console in history.\r\n  </p>\n<p>  <br/></p>\r\nThe Ancestor: Microvision (1979)\r\n<p>This is the first real handheld game console, manufactured by MB. While it has very basic features such as a 16x16 pixel screen, it was a real engineering tour-de-force to create such a portable device in 1979. Its inventor Jay Smith also created the Vectrex home console in 1982. In recent years, Satoru Okada, co-creator of the Game Boy, acknowledged that he was directly inspired by the Microvision to make the Game Boy.</p>\n<p>      </p>\r\nThe Clone: GB Boy Classic (201X)\r\n<p>Over the years, many counterfeiters tried to illegally clone the Game Boy. The GB Boy Classic is one of the most recent efforts in this domain. It's a very good copy of the Game Boy Pocket that can play all the original Game Boy games cartridges. The only issue is that it plays them slightly faster than a real Game Boy, causing audio or graphic glitches on many games.</p>\n<p>     </p>\r\nThe Ordinary People: Smartphone (2007)\r\n<p>Today, people who want to play everywhere no longer use a handheld game console, but their mobile phone. The so-called \"smartphones\" are actually real pocket computers. Besides making phone calls, they can do all the tasks of a desktop computer: Internet browsing, file management, content creation, and of course, game playing!<br/></p>\n<p>        </p>\r\nThe Rich One: iPhone XS Max (2018)\r\n<p>If you are rich enough, you can play games on a top-notch OLED screen with the classiest (and priciest) mobile phone around: the iPhone XS Max!<br/></p>\n<p>       \r\n  </p>\r\nThe Mobile Phone: Nokia 5110 (1998)\r\n<p>Before smartphones, mobile phones were solely dedicated to making phone calls and sending SMS. In the late 90's, Nokia, the then-leader of the mobile phone industry, introduced games in their phones. Their most famous entry is the \"Snake\" game, first released on the Nokia 5110 phone!<br/></p>\n<p>      <br/></p>\r\nThe Mobile Phone, Better: Nokia 3310 (2000)\r\n<p>The Nokia 5110 was replaced by an even more successful mobile phone, the 3310. While it still allows you to play Snake, it has a tinier form-factor and no more visible antenna! It's one of the best-selling phone in history, with about 126 millions units shipped around the world.</p>\n<p>       </p>\r\nThe Hybrid: Nokia N-Gage (2003)\r\n<p>While today being able to play games on a mobile phone seems obvious, it wasn't always the case. In the 90's, the famous \"Snake\" game on Nokia's phones was very crude compared to the games available on the handheld consoles of the era. That's why, in 2003, Nokia released the first \"mobile phone / handheld console\" hybrid: the N-Gage. Sadly, this good idea resulted in a cumbersome device, quite inconvenient to use for phone calls and games. It was a commercial failure. Today, it's mostly remembered for the many Internet memes it inspired: to make a phone call, you had to carry the console sideways. This particularly goofy-looking idea inspired loads of mocking photos from the creative Internet people!\r\n  </p>\n<p>         <br/></p>\r\nThe Pet: Tamagotchi (1996)\r\n<p>The Tamagotchi is an electronic toy asking the player to take care of a virtual pet. You'll have to feed him, wash him and play with him regularly to make him happy and stay in good health. This toy was highly popular in Japan and in Western countries at the end of the 90's. It even inspired an actual Game Boy game, also titled Tamagotchi and released in 1997.<br/></p>\n<p>      <br/></p>\r\nThe Half-Brother: Wonderswan (1999)\r\n<p>Gunpei Yokoi, the co-inventor of the Game Boy, created another good handheld console: the WonderSwan. Released by Bandai-Namco, it was the strongest Game Boy competitor in Japan, even spawning a color model afterwards. Sadly, despite Bandai-Namco best efforts, it was never as popular as the Game Boy!<br/></p>\n<p>          \r\n  </p>\r\nThe High-End: Nec PC Engine GT / TurboExpress (1990)\r\n<p>In the 90's, there was no iPhone XS Max yet, but rich players could show off with the most expensive handheld console: the PC Engine GT. This is a portable version of the PC Engine (1987). It can play all the games cartridges from this home console, thanks to a beautiful color screen and a crisp sound delivery. However, quality comes with a price: not only is the console very expensive, but it's also a real battery hog (more than the Lynx and the Game Gear!).<br/></p>\n<p>        \r\n  </p>\r\nThe Wannabe: Watara Supervision (1992)\r\n<p>While some pirate manufacturers tried to illegally clone the Game Boy, others decided to stay on the right side of the law: they created handheld consoles inspired by the Game Boy. The Supervision is arguably the best in this category. It features a large 160*160 pixels screen, good sound, and quite responsive controls. About 70 games were released for the machine, although none of them matches the quality of the best Game Boy titles. A good console isn’t defined by the quality of it’s hardware, but by the quality of its games!<br/></p>\r\n         <br/><br/>\r\nThe Imitator: Delplay Game Plus (1991)\r\n<p>Like the Watara Supervision, the Hartung Game Master is an attempt to build a Game Boy-inspired handheld console. In order to save costs, it features much lower quality hardware, namely an horrible 64x64 pixels screen with a single shade of gray. The Game Master had an horizontal from factor, like the Lynx and the Game Gear. Several variations of this console were produced by different manufacturers: <em>VideoJet, Impel, Virela, </em>and<em> Watara</em>. All these models look the same despite having different case colors, and use the same cartridges. All of them, but one:<em> the Delplay Game Plus!</em>\n</p>\n<p> \r\n  </p>\n<p>Indeed, while it uses the same electronic hardware inside, its form factor was changed to look like a Game Boy. The cartridges were also reduced in size, making them incompatible with all the other Game Master variations. All this modifications resulted in a very cheap handheld: the screen is barely usable, the control buttons are working half of the time, and the software library is very limited as it's not compatible with other Game Master games. So, if you're searching for the worst Game Boy imitation ever, looks no further: <strong>behold the Game Plus!\r\n  </strong></p>\r\n          <br/>", "metacritic": null, "released": "2019-10-23", "tba": false, "updated": "2019-10-25T06:35:05", "background_image": "https://media.rawg.io/media/screenshots/d3c/d3c8d85f381ba91a8369bd73ec12edaf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["Dr. Ludos"], "genres": ["Action"], "publishers": [], "esrb_rating": null}