{"id": 386392, "slug": "randy-manilla", "name": "Randy & Manilla", "name_original": "Randy & Manilla", "description": "<p>Eng: Randy &amp; Manilla is a game where is discovered a mysterious quantum cyber-universe hosted by Net-Cubes that contain virtual worlds with various genres of games. A strange kind of virtual environment with the inspiration of Wreck-It Ralph in a later post-apocalyptic era to Ready Player One.<br />\nEsp: Randy y Manilla es un juego en donde se descubre un misterioso ciber-universo cuántico albergado de Net-Cubes que contienen mundos virtuales con varios géneros de juegos. Un extraña especie de entorno virtual con inpiración a Rompe-Ralph en una época post-apocaliptica posterior a Ready Player One.</p>\n<p>On the year 2142, In the mysterious interior of the quantum supercomputer created by Lambert Wilson, there is a cyber-universe surrounded by a brightly colored cubes called &quot;Net-Cubes&quot; that inside have a fantastic virtual worlds of pixelated structures, abstract and even in various ways. It is free from threats like hackers, cyber-spies and corporate and government organizations. But that doesn&#39;t mean that they have their own threats, such as the villain of the red Net-Cube, &quot;Cracksom Virus&quot; a dominant virus that puts all Net-Cubes in danger of being permanently eliminated in their favor and expanding their empire of computing corruption.<br />\nThen a message algorithm called &quot;E-Mailer&quot; arrives at the world of &quot;Bloxland Qubitown&quot;, the home of Randy and Manilla, giving them an urgent notice that the entire cyber-universe is in a big danger of being destroyed by Cracksom, urging and begging to be their heroes, and they accepted the mission and they will embark on a great adventure about the different Net-Cubes, but E-Mailer will also accompany and open them portals to access the new worlds.</p>\n<p>Support this project: in Patreon:  https://www.patreon.com/ofihombre<br />\nAre you a developer, and want to help me with my project?:<br />\nContact me from my email: alex9monfort@gmail.comOr with an invitation on my Discord server: https://discord.gg/UyacSFF</p>", "metacritic": null, "released": "2019-10-21", "tba": false, "updated": "2019-11-20T17:56:13", "background_image": "https://media.rawg.io/media/screenshots/65e/65ece453702c86df5b10dcff9942fbc8.jpg", "website": "https://randyandmanilla.weebly.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Ofihombre"], "genres": ["Adventure", "Indie"], "publishers": [], "esrb_rating": "Rating Pending"}