{"id": 386338, "slug": "saving-planet-blue", "name": "Saving Planet Blue", "name_original": "Saving Planet Blue", "description": "Hi all! can you test our game? :)\r\n<p>We're 2 regular guys who love to make mobile games for Android. We made this little game prototype, it's a quick level and is still in early development. A lot of things aren't yet polished.</p>\n<p>But before we invest more time building it, we wanted to see if it has potential. Can you guys help us validate? Click the link below to get the game on your mobile.</p>\n<ol><li>What did you like, and what didn't you like?</li><li>Was it easy to understand the game mechanics?</li><li>What can be improved?</li><li>How do you see the game evolve further in the game? </li><li><strong>But most importantly, did you have fun? :)</strong></li></ol>\r\n\"Write your answers in the comment section below\"\r\nPlot\r\n<p>Life as we know it on our dear blue planet is dead. we polluted too much and contaminated everything. Now all is lost and mankind has taken to live in space. All has been lost for ages for the planet and not a single soul has resided there since then. Today an exploration party has been sent to see what is left of the planet and determine if we can live there again. You are a young marine and have been chosen to go there to see what is up with the world. Fight whatever new horrors have spawn from these ages of polluted wasteland and see if we can find a place that is viable. And if you fail that's ok, we'll just send someone else a little later. After all, you are disposable.</p>\r\nInstructions\r\n<ul><li>Hold tap to move </li><li>STOP to shoot</li><li>Reach the bunker without dying</li></ul>", "metacritic": null, "released": "2019-10-18", "tba": false, "updated": "2019-10-25T07:38:18", "background_image": "https://media.rawg.io/media/screenshots/a8f/a8f2f04f5cec611a5898dde47c1ea408.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Remyjacobi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}