{"id": 386357, "slug": "the-elf-trying-to-reach-the-shelf", "name": "The Elf Trying to Reach the Shelf", "name_original": "The Elf Trying to Reach the Shelf", "description": "<p>Presenting The Elf Trying to Reach the Shelf! A game about the “shorty struggle”--the trials and tribulations short people must go through to reach high-up places. In this over-the-shoulder third-person view game, the player can pick up and stack objects on top of one another to create platforms to jump onto and collect items--in this iteration, bananas. As someone who is under 5 feet myself, a game about being too short seemed like the obvious choice for an autobiographical assignment. <br/></p>\n<p>\tThe very first hurdle that I tackled was managing the item pickup and drop, which was the hardest part (codewise). It took a lot of mental gymnastics to juggle the three states the character, when interacting with an object, could be in at any given time: picking up an item, holding an item and dropping an item. I’m not sure if I implemented it in the most efficient way, but the way that I did it resulted in a lot of boolean checks in one if statement which also made it a little hard to debug. Overall, the hardest part was trying to figure out how I wanted to implement certain features (such as stacking--did I want to make the objects stack directly on top of each other when pressing the stack button? Or have it drop from a height above?). The most fun part was watching the project come together and showing it to my friends. I sent links for the very last milestone to two of my friends and hearing their responses was very satisfying. Playing around with physics to get the player jump to work was also a lot of fun. </p>", "metacritic": null, "released": "2019-10-21", "tba": false, "updated": "2019-10-25T07:42:59", "background_image": "https://media.rawg.io/media/screenshots/b35/b35d8921baade26ab720778739168797.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["penguincoco"], "genres": [], "publishers": [], "esrb_rating": null}