{"id": 386464, "slug": "escape-room-ez", "name": "Escape Room Ez", "name_original": "Escape Room Ez", "description": "<p>I had more fun planning for this game than I did making it, as I overestimated the amount of time I had to complete it and the workload I could get done. I planned to have a full set of sprites for my protagonist girl, including an idle animation, a left movement animation, a right movement, a backwards movement and a front facing movement. I was only able to complete the idle animation and the front facing walk animation, which I was also unable to program in the exact way I wanted to. I did learn more about importing pixel art to unity and blender, which is something I am sure I will be using in the future, as I really enjoy creating pixel art.  I wish I was also able to program more UI into my game, such as an inventory screen, and more items that are available to pick up. The wallet item was the only one, which made it obvious that it was necessary for completion, in my opinion. I am happy I was able to create a cohesive theme and message with my use of art and sound, I just wish that I was able to make the interactions more efficient and streamlined.</p><p>Recently I've gotten interested in the cyberpunk aesthetic, in both art and fashion, and as I have moved away from my parents and am taking care of myself more, I have noticed what I can and can't buy, the different brands, and what I want vs. what I need. I am also worried about the impact of capitalism and greed on the environment and quality of life, but I did not want to hammer in the theme too much with the lack of time I had and coding prowess I lacked.</p>", "metacritic": null, "released": "2019-10-20", "tba": false, "updated": "2019-10-25T08:11:05", "background_image": "https://media.rawg.io/media/screenshots/365/365213142914907929c94f1d30b661e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ses880"], "genres": [], "publishers": [], "esrb_rating": null}