{"id": 386447, "slug": "arcasm", "name": "ArcASM", "name_original": "ArcASM", "description": "<p>ArcASM is a one or two player competitive arcade-action assembly programming game! The game is heavily inspired by Core-War but is played in real-time.</p>\n<p>When the game starts it randomly picks between two modes:</p>\n<ol><li>Watchdog Mode: in this mode, the CPUs watchdog timer starts counting down, when it reaches 0 the player with the highest score is the winner.</li><li>Memory Mode: in this mode the game continues until every memory address has been written to by a player, at which point the player with the highest score is the winner.</li></ol>\n<p>You write programs by hex-editing values inside the CPUs memory. The game is based on an imaginary dual cpu 6502-ish like processor. </p>\n<p>The processor is inspired by the 6502, the PIC micro-controller and Core War. The processor has 4 registers, A, X, Y and P (program counter.) The processor has the ability to do memory-to-memory copies without using registers as an intermediary (this is inspired by CoreWar) and some branching instructions do not branch, but rather skip the next instruction (inspired by the PIC.)</p>\n<p>There are, however, some obstacles (other than having to write assembly language in real time.)</p>\n<ul><li>Da Bomb</li><ul><li>There is a bomb bouncing around the inside of the computer, it is represented by the icon of a bomb, bouncing around. If the bomb is close to a memory block when it explodes, it erases that memory block. Hope you weren't writing your code right there. </li></ul><li>Your Opponent.</li><ul><li>Your opponent is not cool. He has the ability to overwrite your code, steal your execution path, and he can also explode your cursor disabling your ability to write code for an amount of time.</li></ul><li>The CPU player</li><ul><li>In single player mode, the CPU player will place a small, 8 instruction program in the memory core and steal the execution of the second CPU. It will also periodically monitor it's program to see if it's been modified. If it detects modification it will erase the program and place a new program elsewhere.</li></ul></ul>\n<p><strong>Status</strong></p>\n<p>The game is mostly code completely - there is still testing to be done on the opcodes to make sure the instruction set makes sense based on the overall objectives of the game. </p>\n<p>There is now a first draft of the manual to download. </p>", "metacritic": null, "released": "2019-10-21", "tba": false, "updated": "2019-10-25T08:07:18", "background_image": "https://media.rawg.io/media/screenshots/149/1499034204750d578e49af781d63d598.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["arcasm"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}