{"id": 386588, "slug": "find-difference-zombie-quest", "name": "Find Difference: Zombie Quest!", "name_original": "Find Difference: Zombie Quest!", "description": "Find hidden objects and get out of our maze of puzzles in our new quest. Find difference between a photo given and the real place. Unknown monster, it could be zombie vampire, werewolf is trying to hunt owners of a mansion. So, become an exorcist in this detective story and find out who is poisoning lives of the owners. Complete every level of the chapter to find out was it zombie or another monster. Find every hidden object in the chapter to reveal the place of the zombie and beat him. Complete every level of this detective quest to get out of our maze of puzzles. Become an exorcist in our new detective simulator: Find Difference: Zombie Quest. Find every hidden object of the chapter and get rid of that zombie.<br/><br/>In this maze of puzzles, you will play as an exorcist and your main target will be to find out where the zombie is hidden. Find difference between the photo of the location before the zombie had its business there and the location in the present time. Get out of that maze of puzzles, like a true detective find every hidden object, complete every level and get rid of the zombie! Do not forget that your time, on finding difference and hidden objects, is limited so turn on your skills of detective and solve this quest quick. Furthermore, after you have solved the maze of puzzles of each chapter you can visit your bestiary, which contains some information about the conquered monster, zombie for example. <br/><br/>Find Difference: Zombie Quest is a free to play detective simulator. Get out of that maze of puzzles and find every hidden object in every level of the chapter. Complete that detective quest and get rid of zombie to rescue owners of the manor. Do your best and find every difference in this maze of puzzles. Hidden objects will show you where the zombie is hidden. If your detective skills are high enough, finding the location of the zombie will not be a big deal for you. Share this maze of puzzles with your friends and find difference together. Download our new detective quest and solve supernatural cases. People needs you to save them drom monsters!", "metacritic": null, "released": "2019-05-26", "tba": false, "updated": "2019-10-28T02:58:15", "background_image": "https://media.rawg.io/media/screenshots/762/76279c3d5c270a2bb46781b48d34b1a1_ZDjMQqX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": [], "publishers": ["Olga Sandakova"], "esrb_rating": "Everyone 10+"}