{"id": 386526, "slug": "arcadia-fallen", "name": "Arcadia Fallen", "name_original": "Arcadia Fallen", "description": "When a young alchemist apprentice is unwillingly bound to an illegal spirit, they suddenly find themselves tied up in a war between humanity and magic, and must join a group of unlikely heroes to escape their own doom, hopefully saving the world along the way.<br/><br/>A 2D game with three-dimensional characters<br/><br/><strong>A Story With No Right Or Wrong Choices</strong><br/><ul><li>Venture on a journey with no bad endings. Your decisions will never keep you from going on but may influence what you will have to endure before you reach your goal.<br/></li><li>You are encouraged to be who you want to be.<br/></li><li>Whether you want to become a master of alchemy, engage in a romance, or discover the mysteries of the world; how you spend your time is up to you.</li></ul><br/><strong>Character Customization &amp; Growth</strong><br/><ul><li>Create your alchemist in your own image or play out a fantasy.<br/></li><li>You decide how traumatic events sculpt and grow your alchemist's personality. When faced with a tragedy, will you be benevolent, or will you be vengeful?</li></ul><br/><strong>4 Romanceable Characters</strong><br/><ul><li>Spend time with your companions to build a deep platonic relationship or engage in a romance.<br/></li><li>You decide how you want to romance someone.<br/></li><li>LGBTQ+</li></ul><br/><strong>Alchemy Puzzles</strong><br/><ul><li>Use your alchemy skills to solve crises, assist your companions, and change the world around you.<br/></li><li>Take on powerful demons with your alchemy skills and the help of an ancient artefact.<br/></li><li>Hone your skills to discover secret recipes.</li></ul>", "metacritic": null, "released": "2019-05-16", "tba": false, "updated": "2022-07-23T17:47:54", "background_image": "https://media.rawg.io/media/screenshots/bce/bce388a26df72e54d7cd9049113718bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 1, "toplay": 3}, "playtime": 13, "achievements_count": 16, "ratings_count": 1, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Galdra Studios"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie", "Puzzle"], "publishers": ["Galdra Studios"], "esrb_rating": null}