{"id": 386550, "slug": "time-fragments-24h-in-capua", "name": "Time Fragments: 24h in Capua", "name_original": "Time Fragments: 24h in Capua", "description": "<h3>BACKGROUND</h3><strong>Time Fragments: 24h in Capua</strong> is an <strong>adventure RPG</strong> game set in 73 BC during the famous slave rebellion in Capua lead by the infamous Thracian soldier Spartacus. <br/><br/>In the future the human race have found a way to send up to three persons to a specific time and place in the past for observation purposes. The \"Bridge\" is open for only 72h. After no contact has been made with the three scientist for 48h, you and a companion of your choice are sent in to find them or at least one of them, having only 24h to do so!<br/><br/><h3>UNIQUE STYLE OF PLAY</h3>Game focuses on a unique style of play. At your disposal you have skills like manipulation, intimidation, negotiation, sneaking, distracting, pickpocketing, lockpicking, forgery, running, jumping and climbing, rather than the traditional \"hit and kill\" your way through the game type of RPGs. Luck is a part of these encounters and it has a special way of being intertwined with the game mechanics.<br/> The game is \"turn based\" with a top down view. This will  force you to organize your every move as every action, except conversations, costs some number of minutes or hours. Stories are flowing and ever changing depending on your actions and skills you harness. Choices will echo throughout the game, leading you to new encounters in each playthrough.<br/><br/> <h3>RANKS</h3>If you ever wondered how would it feel to be the general of the Roman army, a good senator or maybe even gladiator or the new leader of the rebellion, you will have that option. It will not be easy, it takes some serious planning, but it will be worth it. A completely new and fun way to play ones obtained. You can play for both sides, double or triple cross. Each choice will matter, for better or worse. Will you end up as a slave? maybe the richest person in the whole Capua, prominent doctor or the \"Champion of Capua\"...and many more outcomes will depend on the choices you make but never lose sight on the end goal-to find the missing scientists.<h3>MAP</h3>The map has over 100 locations. You are free to chose any direction and any way, but be mindful of the time it takes to get to them! Some locations will require disguises or special items to get in, others can be infiltrated in other nefarious ways.<br/> Each location offers some clue on the whereabouts of the missing scientists. You can obtain them in multiple ways, manipulating and distracting the guards or maybe setting the place on fire to empty the room. Each location is unique and can be played differently each time.<h3>Features</h3> <br/><ul><li>Chose the background of your character to coincide with your unique style of play </li></ul><ul><li>Over 12 skills available within 4 groups of abilities (Social, Thievery, Endurance, Intelligence)</li></ul><ul><li>Special system for \"luck effect\"</li></ul><ul><li>Find your gear to further enhance your character</li></ul><ul><li>Disguise yourself as with one of 25 disguises and gain access to forbidden areas, new stories previously unattainable</li></ul><br/><ul><li>Explore the map with over 100 locations</li></ul><ul><li>Plan your every move within in-game 24h. <strong>EVERY ACTION</strong> costs time...and minutes add up! </li></ul><ul><li>Choose your style of play, whether is to approach silently making a domino effect or use your highly tuned skills help you out</li></ul><ul><li>Chose your Companion! Each one has a different need, but offers different help</li></ul><br/><ul><li>Replay it more than <strong>15 times</strong> each time with a unique story, different way of playing and a new ending</li></ul><ul><li>Richly diverse world with possible alternative history</li></ul><ul><li>Try to rise through <strong>army, political or rebels ranks</strong>, do completely new quests and meet new people</li></ul><ul><li><strong>Try saving all three scientists that are lost, but most of all try to SURVIVE!</strong></li></ul>", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2019-10-28T02:37:09", "background_image": "https://media.rawg.io/media/screenshots/d52/d528d4797240fd20fa9780a5be364626.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vanja"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Vanja"], "esrb_rating": null}