{"id": 386584, "slug": "surprise-cats-under-wraps-egg", "name": "Surprise Cats: Under Wraps Egg", "name_original": "Surprise Cats: Under Wraps Egg", "description": "Looks like you want to pop some new dolls eggs and play some lol games. And that is actually what we are going to give you. Pop new dolls eggs with cute dolls cats inside. Surprise dolls by bringing them, new furry friends. Play with your new pets in lol games with ball or surprise dolls with new clothes. Just pop the dolls eggs to receive new dolls cats, lol games for them like a ball and their clothes. Interact with your dolls cats and surprise dolls by gifting them new clothes. Start popping dolls eggs and create your own collection of cats dolls in our new simulator: Surprise Cats: Under Wraps.<br/><br/>In this simulator, you will have to take care of your new dolls cats. Just pop the dolls eggs to find the new cute dolls, clothes for them and very funny lol games like a ball. Pet your new furry friend, surprise dolls by gifting them new friends or toys, play with your dolls cats in lol games with the ball. You have an unlimited amount of eggs, which means you can pop as many dolls eggs as you want. Also, all your dolls cats are stored in a special place, so you will always have access to your collection. Surprise dolls by playing new lol games with balls with your pets. Pop more dolls eggs to surprise dolls by bringing them, new friends. Let your furry friends play with each other in lol games with the ball. Just take care of your dolls cats and make sure that they will not get bored.<br/><br/>Surprise Cats: Under Wraps – is a free to play simulator of popping dolls eggs. Pop on of dolls eggs to receive from it a new doll, clothes for your dolls cats and some lol games. Take care of your dolls and play some balls games with them. Surprise dolls by gifting them new clothes or a new ball. Create the biggest collection of dolls cats. All you need is to pop dolls egg and start playing with your new dolls cats. Surprise dolls by gifting them new clothes, play with them some lol games with a ball or let your dolls cats hang out with each other. Enjoy the company of your new dolls cats in our dolls eggs simulator.", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2019-10-28T02:55:37", "background_image": "https://media.rawg.io/media/screenshots/6a6/6a6deb4dda051434b5cc2f583e5e1dc1_acXcymb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Sandakova"], "genres": [], "publishers": ["Olga Sandakova"], "esrb_rating": "Everyone 10+"}