{"id": 386518, "slug": "waxworks-curse-of-the-ancestors", "name": "Waxworks: Curse of the Ancestors", "name_original": "Waxworks: Curse of the Ancestors", "description": "<strong>-STORY-</strong><br/>Many years ago, Ixona, a Gypsy witch, stole a chicken from the player's ancestor, who chopped off her hand as punishment. In retaliation, Ixona placed a curse on the ancestor. Whenever twins were born into his family line, one would grow up to be good while the other would become evil.<br/><br/>At present day, the protagonist learns that his twin brother, Alex, is going to suffer the curse. Boris, their uncle has died and left them with his Waxworks, as well a crystal ball, through which his spirit communicates with his nephew; the protagonist learns that he must rid the family of Ixona's curse to save Alex. He must use the Waxworks to travel through four locations in different time periods: Ancient Egypt, a zombie-infested cemetery, Victorian era London and a mine overrun with plant-like mutants. Within each location, he is to defeat his evil twin who takes the shape of a villain.<br/><br/>Eventually, the protagonist learns that the only way to break the curse is to prevent it from being cast in the first place. After defeating the evil twin four times, the protagonist is given four artifacts: the High Priest's amulet, the Necromancer's ring, Jack the Ripper's knife, and a vial of the Plant Monster's poison; the final level is unlocked, and takes the protagonist back in time to confront Ixona. Following Boris' instructions, the protagonist uses the artifacts to kill Ixona before she can place the curse; as a result, the curse is erased from existence for every afflicted generation of the protagonist's family line.<br/><br/>After the curse is undone, the protagonist finds Alex unconscious in a corner of the Waxworks and revives him. Upon waking, Alex recalls a strange dream he had, in which he witnessed Ixona's death. However, in the dream, right before she died, Ixona muttered another curse which transformed the protagonist into a demon; the dream's meaning is never made clear, possibly hinting at a potential sequel. The game ends with the brothers leaving the museum.<br/><br/><strong>-GAMEPLAY-</strong><br/>Waxworks: Curse of the Ancestors is a first-person, action adventure RPG game. The game is divided into five different time periods: Ancient Egyptian Period, Medieval Transylvania Period, Victorian England Period, Industrial Mine Period and Ixona's Period. Three of those time periods have a mixture of puzzle-solving and combat, while the Victorian England and Ixona ones are more puzzle-solving oriented.<br/><br/>In each time period, the player needs to pick up items, solve puzzles, avoid deadly encounters and engaging in combat with various opponents. The player can use Uncle Boris' crystal ball to get hints. The main objective is to collect a special item from the evil twin ancestors before venturing into the Ixona Period to undo the family curse. <br/><br/><strong>-MUSEUM-</strong><br/>Museum has 4 large exhibits that takes you to 4 different time periods.<br/>1. Ancient Pyramids: Spooky places these pointy tombs and full of Crazed Eunuchs and Knife-wielding guards.<br/>2. Creepy Mine Shafts: Descend dirty dreadful shafts of doom and encounter a hoard of genetically mutated ex-members of the town above .<br/>3. Jack The Ripper: Take a run through the misty streets of London and chase down the infamous Jack the Ripper.<br/>4. Graveyard: Dead guys jumping out of the soil, zombie madness.<br/>5. Ixona's world: This a bonus level where you have to find and kill the witch.<br/><br/><strong>PYRAMID</strong><br/>The witch’s curse was so powerful it rippled through time, tainting our family bloodline at its very foundations in ancient North Africa. You will journey to the mysterious land of the Pharaohs to explore the Great Pyramid and rescue a beautiful princess. The first evil twin borne of into the curse became the high priest to the god of death, Anubis. Under his influence it soon became the annual custom for Anubis to require a virgin girl of royal birth to be ritually sacrificed.<br/>The guards and priests wont be easy and they will try to stop you from finding the sarcophagus.<br/><br/><strong>-MINES-</strong><br/>You will be required to descend into the treacherous iron mines to battle a huge mutant plant with an insatiable appetite for human flesh. Creepy place full of Mutants and poisoned plants. The player needs to go through pitch black mines, find items, weapons and notes that helps him to find the evil twin and kill it. There are also survivors from the previous group that needs to be rescued, without them, you will be stuck down there forever.<br/><br/><strong>JACK THE RIPPER</strong><br/>The murderous Charles Blackwood would solicit the call girls of Whitechapel and, while at their most vulnerable, brutally murder and mutilate them. You will have to tread the dark menacing streets of 1888 London to confront the murder. You will meet lots of weird people, that tells you about the dark corners of the city. Breaking into the houses, stealing items and clothes, stay covered all the time, that's what you need to do till you find the Ripper.<br/><br/><strong>GRAVEYARD</strong><br/>you must enter an unworldly graveyard to confront and vanquish the evil Necromancer and the rotting, mindless horde of zombies who do his bidding. Killing Zombies, searching crypts, bodies in graves and tortured victims of Dracula, that's what you need to deal with. In this Graveyard, you have to find out where the Dracula is hiding and kill him. You need to obtain various weapons, potions and scrolls that helps you on the journey of the dead.<br/><br/><strong>IXONA'S WORLD</strong><br/>Lifting the curse of Ixona and saving Alex will not be easy. You'll need extraordinary skill and cunning to avoid the flesh-rending traps and solve the mind-perplexing puzzles that await you. You'll need heroic courage and superhuman strength to face the ruthless fiends that lurk within the bowels of the perilous Waxworks. This level takes you to the swamp of the dark forest where you need to find Ixona and release the curse.", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-02T14:57:26", "background_image": "https://media.rawg.io/media/screenshots/081/081298c4ce0fb88edd325b4ac4bd40b9.jpg", "website": "https://went2play.com/waxworks-the-curse-of-ancestors", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Went2Play"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Went2Play"], "esrb_rating": null}