{"id": 386504, "slug": "money-loves-silence", "name": "MONEY LOVES SILENCE", "name_original": "MONEY LOVES SILENCE", "description": "One day the past will come knocking and you’ll have to open the door.<br/><br/>The fate of other characters rests in your hands. Take on the role of a “Tellman &amp; Brothers” bank employee. Find a strategy for each problematic debtor, study that person’s info, and get to work.<br/>Recruit your “business partners” from the collection agency. Determine how they talk to clients or let them decide how to do things on their own.<br/><br/><ul><li><strong>You need to earn $580,000 </strong> in 12 days for your daughter’s operation. Her life depends on your actions.<br/></li><li><strong>The task isn’t quite that simple:</strong> Your income is based on the number of people who pay off their debts. If you choose the wrong strategy for a client, then (best case scenario) you may earn N-O-T-H-I-N-G or you might even acquire some new problems.<br/></li><li><strong>Extra income is always a good thing.</strong> Buy all the supplies needed and prepare carefully to fulfill the order.<br/></li><li><strong>Use your personal skills</strong> (or whatever else you’ve got) and your intuition to solve problems.<br/></li><li><strong>This world awaits your arrival.</strong> Answer its call!</li></ul><br/>And remember the most important rule of all - <strong>“Money Loves Silence”!</strong>", "metacritic": null, "released": "2020-02-21", "tba": false, "updated": "2019-10-28T02:13:26", "background_image": "https://media.rawg.io/media/screenshots/cce/cce3d34d1400ae3dbad9372c64033f35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vasiliy Sadovyi"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Vasiliy Sadovyi"], "esrb_rating": null}