{"id": 386664, "slug": "tennis-clash-3d-sports-free-multiplayer-games", "name": "Tennis Clash: 3D Sports - Free Multiplayer Games", "name_original": "Tennis Clash: 3D Sports - Free Multiplayer Games", "description": "It's time to play the best sports game for free! Jump in a quick online tennis match in this real-time multiplayer 3D game!<br/>Compete against friends and family in fun world-class tournaments. Tennis Clash is a cool game with 3-minute matches!<br/><br/>Like basketball, golf, football and other sports, tennis is all about practice. Challenge competitors, score aces, improve your tennis skills, score the match point and win! In this sport game you can beat both local and international players in Australian, US and French open courts, and much more. Win and climb the rankings to be the ultimate tennis player! <br/><br/>Customize your equipment and training, get the best tennis racket and hire the best coach! In every competitive 1v1 match you play, there are coins and trophies at stake – win the match and they are all yours. You can use them to enter higher ranked matches with bigger stakes. Use coins to get new items in the shop, brag about your trophy collection, beat your friends and climb up the global rankings to be the #1 tennis player.<br/><br/>Tennis Clash Features:<br/>* Play with your friends in fun real-time multiplayer matches<br/>* Amazing 3D next-gen graphics<br/>* Intuitive controls that are easy to learn, but hard to master<br/>* Real-time tournaments. Challenge your skills against the best players<br/>* Climb up the league rankings to become #1 in your city, country and the world!<br/>* Win matches, collect trophies and be the best<br/>* Unlock amateur, semi-pro and pro tennis players<br/>* Assemble the ultimate team: get the best coach, diet and workout for your squad!<br/>* Equip the best racket, shoes, grip and most importantly, your strings to be a top player.<br/>* Open new arenas: US, France, Australia and much more!<br/><br/>Forget about badminton and table tennis. Play Tennis Clash and become a Grand Slam winner in the best ball game for free! Be the ultimate tennis player in the sports world!<br/><br/>If you like golf, football, soccer, baseball or basketball games, it’s time to prove yourself the best sportsman in this sport game. Tennis Clash is the ultimate sports game for free! Become a tennis superstar!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-28T03:33:57", "background_image": "https://media.rawg.io/media/screenshots/7e9/7e933a1b289bd7256cfc417d5c809695.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["Wildlife Studios"], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone"}