{"id": 386661, "slug": "vert-skater", "name": "Vert Skater", "name_original": "Vert Skater", "description": "Notice:<br/>We are planning to release another free Vert Skateboarding game. If it is realized, this app will be rejected, so if you want to play in all modes without advertisement or additional charge, please get this app early.<br/>---<br/><br/>Vert Skater brings realistic vert skateboarding experience that satisfied real skateboarders.<br/>Once you learn how to get air, you will become addicted. <br/><br/>Features:<br/><br/>- REALISTIC SKATEBOARD MOVEMENTS<br/>All skateboard movements are expressed by 3D graphics and real-time physics simulation. It is designed to emphasize smooth and comfortable riding.<br/><br/>- UNIQUE CONTROL SYSTEM<br/>Using ring style direction controller with automatic direction adjust system.<br/>Just need one finger to make a trick routine like professional skateboarder.<br/><br/>- INCALCULABLE TRICK VARIATIONS<br/>As you combine spin, grabs, flips, you can make a lot of trick variations include inverted air tricks like Rodeo/McTwist.<br/><br/>- 3 DIFFERENT GAME MODES<br/>Competitive STYLE MODE, Challengeable MISSION MODE and FREE SKATE are offered.<br/><br/>- COMPETE WITH FRIENDS<br/>Compete game score with friends and other skaters all over the world via Game Center and OpenFeint.<br/><br/>- EXCITING REPLAY<br/>Your replay is produced by various camera position and slow motion effect like action sports TV show.<br/>You can record the replay and share it on your favorite SNS and Youtube.<br/><br/>- GET MORE STYLIN' TRICKS   <br/>By unlocking achievements, you can get more advanced trick skills.<br/><br/>- PLAY YOUR FAVORITE SOUND TRACKS<br/>Build a playlist from your iPod library. It will be played as BGM while you are playing instead of internal sound track. If you listen to any song before launch this app, it will be given priority over sound setting.<br/><br/>Watch Vert Skater Demo Run on YouTube! <br/>http://www.youtube.com/watch?v=1Ynj7IGEYrA<br/><br/>Follow me on twitter: http://twitter.com/M4S4N4R1", "metacritic": null, "released": "2011-06-03", "tba": false, "updated": "2019-10-28T03:32:11", "background_image": "https://media.rawg.io/media/screenshots/035/035ff641ec44d51efb08e014787a021f.jpg", "website": "http://surfvey.com/games/vertskater-for-iphoneipod-touch/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Surfvey"], "genres": ["Action", "Sports"], "publishers": ["Masanari Iwata"], "esrb_rating": "Everyone 10+"}