{"id": 387025, "slug": "monsters-the-oak-defenders", "name": "Monsters: The Oak Defenders", "name_original": "Monsters: The Oak Defenders", "description": "<p>Show yourself as a hero in the battle against the Dark knight and his dragons. Defend your ancient oak tree and destroy all the monsters in an epic clash of heroes and monsters!<br/><br/>Defeat hordes of monsters in an epic defensive clash of forces of good and evil. Unlock all kinds of weapons, heroes and fight! Hordes of monsters are waiting for you, including fast goblins, merciless zombies, orcs, trolls, fire-breathing dragons and other epic creatures and bosses led by the main villain the Lord of darkness! Collect gold, unlock new weapons to repel the attacks of legendary monsters! Learn about the weaknesses of monsters from the in-game encyclopedia of monsters. Defend your ancient oak tree from the forces of evil in this epic defensive battle!<br/><br/>FEATURES<br/>● More than 35 types of defensive weapons!<br/>● 38 types of epic monsters, including terrible bosses. From fast goblins to fire-breathing dragons.<br/>● Survival mode hold on as long as possible!<br/>● 10 levels in story mode!<br/>● 5 levels in challenge mode!<br/><br/>FUN GAMEPLAY<br/>● Fight against a huge number of epic monsters, each of which has its own strengths and weaknesses.<br/>● Defend the ancient oak with bombs, traps, robots and other epic weapons from primitive spears to modern combat devices.<br/>● Win the battle against the dark knight in story mode.<br/>● Survive as many waves of monsters as possible in survival mode.<br/>● Complete incredibly challenging and fun levels in challenge mode.<br/>● An in-game encyclopedia describing enemy creatures, study it to understand what weapons are more effective against a certain type of monsters.<br/>● Unlock new weapons and new defenders.<br/>● Epic defensive battles that can captivate for many hours.</p>", "metacritic": null, "released": "2019-10-26", "tba": false, "updated": "2019-10-28T04:59:30", "background_image": "https://media.rawg.io/media/screenshots/3da/3da1b4c8e03e91dcee94bed101d7ee87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["qerlly"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}