{"id": 387084, "slug": "dog-park-alekai", "name": "dog park (alekai)", "name_original": "dog park (alekai)", "description": "<p>Controls: arrow keys to move, return to interact and select.</p><p>Advancing the text can be fiddly sometimes so just hit enter again if it doesn't work.</p>\n<p>This is a semi-autobiographical game I made for my midterm! In my real life, since I moved to the city, I rarely get to see my dog back home in Maine. In order to get my dog fix, I like going to places where dogs hang out and asking their owners if they’ll let me pat them. <em>Dog Park</em> is an extreme form of that, where you talk to owners around the park and convince them to give you their dogs by being nice to them!<br/></p>\n<p>I got to do a lot of stuff I haven’t really had a lot of experience with when making this game, like sculpting low poly models in Blender and making 3D interactions (like where you pick up the dog bone!) work properly. Making the models was actually really fun, and toward the end I kind of went crazy with it, making some pretty funky looking pups!</p>\n<p>One thing that was difficult was making the dialogue system function properly, because I hadn’t made a dialogue system that complex before and wanted to figure it out on my own, without looking up how to do it. Because of that, my code became a bit of a jumble the longer I worked on the project, with little bits of script that I’d forgotten about messing up the new things I was trying to implement. If I had more time, there’s definitely a lot of code I would rewrite and restructure.</p>\n<p>—</p>\n<p>Music from https://filmmusic.io</p>\n<p>\"Wholesome\" by Kevin MacLeod (https://incompetech.com)</p>\n<p>License: CC BY (http://creativecommons.org/licenses/by/4.0/)</p>", "metacritic": null, "released": "2019-10-26", "tba": false, "updated": "2019-10-28T05:13:24", "background_image": "https://media.rawg.io/media/screenshots/379/37993b9521a7d7507a4f14b7ab46407c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["alekai"], "genres": [], "publishers": [], "esrb_rating": null}