{"id": 387069, "slug": "kabaret-a-southeast-asian-visual-novel", "name": "Kabaret - A Southeast Asian Visual Novel", "name_original": "Kabaret - A Southeast Asian Visual Novel", "description": "<p><strong>Kabaret </strong>is an interactive narrative game filled with mythical Southeast Asian folklore, with colorful characters to meet in a mysterious world.</p>\n<p>Play as <em><strong>Jebat</strong></em>, a young man cursed into a <strong>monster</strong> after making an unfortunate mistake. Jebat has only 30 nights to break the curse or forever remain as a monster.</p>\n<p>This game is a <strong>prototype</strong>, testing the concept and mechanics. In this build, the game takes place over 2 nights. Jebat talks to a <strong><em>Pontianak</em></strong>, a female vampire from Indonesian and Malaysian mythology. She has information he needs, but before she tells him anything, he must do something for her.<br/></p>\n<p>The other creatures he speaks to in the Kabaret are:<br/></p>\n<p>- The Manager, The Harimau Jadian: The mysterious manager who takes him in, and gives him clues on how to reverse the curse. A werecat and a warrior spirit in Malaysian mythology.</p>\n<p>- Ekek, The waiter: A friend that's ready to help. In Philippine mythology, Ekeks are bird like creatures.</p>\n<p>- Tikbalang: A half horse - half man creature that's very tall. He comes from the Philippines. </p>\n<p>- Wawak: The Wakwak is a vampiric, bird-like creature in Philippine mythology.</p>\n<p>- Babi Ngepet: A boar demon that steals riches in Indonesian mythology</p>\n<p>- Jerangkung: A skull warrior from Malaysian mythology. He wears the traditional outfit of a warrior from Sarawak.</p>\n<p>- Nabau: The mysterious singer that lulls monsters to sleep. In Iban legend, the Nabau is a giant snake.</p>\n<p>All characters in Kabaret are inspired by Southeast Asian folklore. <em>Kabaret</em>, is the Malay spelling for the word cabaret. Cabaret was an integral part of Malaysian and Singaporean history during the 1950s.</p>\n<p>Credits:</p>\n<p>Game Director: Buddy Anwardi<br/>Game Designer: Eugene Tam (web)<br/>Game Producer: Saqina Latif (twitter)<br/>Game Concept Art: 6KM (instagram)<br/>Game Artist: Cherry Oon<br/>Game Programmer: Naim Iskandar<br/>Intern Game Programmer/Artist: Ainul Dania  <br/>Game Audio: Hello Universe (web)</p>\n<p>\"Bintang Malam\" by Saloma cover sung by Eddin Khoo<br/>Special Thanks to Pauline Fan and everyone at Pusaka! (web)<br/>Extra Special Thanks to Johaness Reuben, Denice Heng, Jan Wong, and Kok Foong. </p>\n<p>Persona Theory Games web, twitter, instagram and facebook. </p>\n<p>Media:</p>\n<p>MyGameOn feature: link</p>\n<p>Kakuchopurei: link</p>\n<p>DISCLAIMER: This game contains elements that are not suitable for some, and contains violence, blood and gore, and strong language.</p><p>UPDATE: Mac build in progress. :) </p>", "metacritic": null, "released": "2019-10-26", "tba": false, "updated": "2023-03-06T15:58:58", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e30dfc2235f1566cf306fe2dc963d80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Persona Theory Games"], "genres": [], "publishers": [], "esrb_rating": null}