{"id": 387083, "slug": "stylish-stack-jump-tap-jumping-game", "name": "Stylish Stack Jump - Tap Jumping Game", "name_original": "Stylish Stack Jump - Tap Jumping Game", "description": "<p><strong>Stylish Stack to Jump blocks and build the biggest tower imaginable tap to jump build tower climb on stack with lovely jumping game</strong><br/><strong>Stylish Stack Jump</strong> free addictive adventure game for all ages stylish stack jump or jump stack geometry tower jumping 3d games stack up &amp; jump you will love to climb up with these lovely characters stack jump climb with lovely amazing jumping games.</p>\n<p>Tap on screen to stylish jump on block time your jumps well for a perfect score. If you jump and miss a platform, jumper it will be end of game jump blocks as high as you can to make best new tower compete for the best score in the world go as high as you can enjoy endless game-play.</p>\n<p>Stylish Jump well in time and make the best score on moving blocks. Tap on the screen to jump and be the ultimate grand master It's time to stake jump and climb with fantastic graphics and controls. Put the blocks on top of each other exactly and get more points.</p>\n<p>It's time to Stylish jump and climb with fantastic graphics and controls. sky jump Put the blocks on top of each other exactly and get more points. stacking Climb the blocks as high as you can to make a high score and do not fall and keep your attention take too much time and become the best player. jumping games Simple and beautiful graphics designed with new game play. jump game high can you climb If you jump and miss a platform, you will be stack is to build the biggest tower you can. Stylish Stack Jump - Tap Jumping Game It's a totally free game from 2019.</p>\n<p><strong>HOW TO PLAY?</strong> <br/></p>\n<p>Tap on screen to jump on block.<br/>Time your jumps well for a perfect score. If you jump and miss a platform, it will be end of game.<br/>Game play of block tower is very easy. Just tap on screen to stack boxes and try to be a stack master of stack free game.<br/>Enjoy free new addictive stylish jumping tower game.<br/>Jump to stack blocks and build the tallest tower as high as you can.</p>\n<p><strong>Stylish Stack Jump - Tap Jumping Game Features:</strong></p>\n<p>- 15 Jumping Characters.<br/>- Endless game play.<br/>- Astonishing graphics and sound effects.<br/>- Tap to jump and Swing in air.<br/>- Stack boxes coming towards character from multiple directions.</p>\n<p><strong>Enjoy with our Stylish Stack Jump Fantastic Game.</strong> <br/></p>", "metacritic": null, "released": "2019-10-26", "tba": false, "updated": "2019-10-28T05:13:11", "background_image": "https://media.rawg.io/media/screenshots/4f5/4f5cdd66dc9cbfba4de55c1ef97ea04f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Shiny Dust Studios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}