{"id": 387109, "slug": "brimstone-forest-vr-demo", "name": "Brimstone Forest: VR Demo", "name_original": "Brimstone Forest: VR Demo", "description": "Brimstone Forest is an atmospheric VR Horror Game compatible with any headset that uses SteamVR and runs on a Computer.\r\n\r\nTrial by Fire\r\nBrimstone Forest's Free Demo is a standalone 15-40 minute long Horror Game, with some elements of the plot and game mechanics being excluded as to not spoil things in advance for the players. This allows players to play our game for free and see if they're interested, while also helping the developers by providing feedback, and maybe joining our community.\r\n\r\nStory\r\n(You play as) Jacob Beck is a thrill-seeking junkie who goes out into an abandoned national park in pursuit of the best trip of his life. He had just received a new kind of hallucinogens from his shady dealer, and is now hallucinating in the middle of a park with some dark skeletons in its closet. With no way out but forward, he uncovers some dark secrets, but is he just hallucinating them? Live and Die as Jacob as you try to find your way out of Brimstone Forest National Park.\r\n\r\nFeatures\r\nBrimstone Forest features an Original Map, Models, and Soundtrack, all made in-house by our team. We've worked on this game for months as a passion project and we believe it is finally ready to be released as a free demo. Interact with the world around you as if you are trying to escape the forest. Use your VR Headset of choice to explore Brimstone Forest National Park and to survive your worst nightmares.\r\n\r\nRequirements\r\nIntel i3 Core Processor (and above) OR Phenom II (and above)<br/>4 GB DDR3 RAM<br/>Geforce GTX 750 Ti or Equivalent<br/>A VR Headset that is compatible with SteamVR<br/>Windows Operating System\r\nRecommended\r\nIntel i5 Core Processor (and above) OR AMD Ryzen 5 1600 (and above)<br/>8 GB DDR3 RAM<br/>Geforce GTX 1050 Ti or Equivalent<br/>Latest Graphics Drivers, VR Driver and Firmware Updates\r\n\r\nHow to Play:\r\nDownload the BrimstoneForestDemo.zip file from our website. Once downloaded, extract it to your preferred folder. Make sure your VR is plugged in as well as any tracking stations you may need, then simply run the executable. Make sure to click into the window and the game should start without hitches! If it doesn't start without issues try starting SteamVR first, then run the game.\r\n\r\nIf you're interested in the game make sure to check out our Twitter or check out our Community Discord to communicate with us, receive updates about the game, and join our community! We'd love to have you.", "metacritic": null, "released": "2019-10-25", "tba": false, "updated": "2019-10-28T05:18:39", "background_image": "https://media.rawg.io/media/screenshots/fe3/fe3b2587a1809c0fc5dd0403cb119076.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lighthaus Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}