{"id": 387160, "slug": "striderbound", "name": "Striderbound", "name_original": "Striderbound", "description": "<p>What is Striderbound?</p>\n<p>Striderbound is a character-action game starring Dave Strider, a character from Andrew Hussie’s webcomic Homestuck. It’s a non-commercial project developed independently by myself in Unreal Engine using story, design and music from Homestuck. You can download it for free on this page.</p>\n<p>What’s the story?</p>\n<p>This game focuses on the story of Alternate Future Dave as seen in [S] Dave: Accelerate. For anybody who has no idea what that means, allow me to explain in more detail.</p>\n<p>Dave Strider is one kid of a group of four who decided to play a game that caused the destruction of the Earth. They ended up inside the world of the game, each of them finding their own land to explore and quests to complete. Within a day Dave’s friends John and Jade were killed, leaving Dave and Rose to try and beat the game by themselves. They have yet to even figure out the win state of the game however. It’s not a great situation.</p>\n<p>What’s the gameplay?</p>\n<p>Run around on Dave’s lethal lava land and kill stuff with your ninja sword. Dave has a “Slash” and a “Swipe”, mapped to left and right click respectively, which operate as basic attacks but can be combined in different orders to execute combo attacks.</p>\n<p>Performing combo attacks increases your Style Gauge, which in turn increases the rate at which your flashstep ability recharges.</p>\n<p>For now there are two locations and no proper ending, level progression or save system. These features and several more (including the ability to manipulate time with Dave’s timetables) are planned but aren’t included in this build.</p>\n<p>Why release the alpha?</p>\n<p>I’m putting this project on hold, possibly permanently, to move on to a project I will be able to sell- it’s simply not economically feasible for me to see Striderbound to completion. However I am very happy with my progress to this point and want to share it with the world. </p>\n<p>NOTE: This build of the game is Windows only. It was tested on a 24x14 in monitor so your results with other screen sizes may vary.</p>\n<p>You can reach me at my devblog for this project, https://striderboundgame.tumblr.com/.</p>", "metacritic": null, "released": "2019-10-25", "tba": false, "updated": "2019-10-28T05:30:13", "background_image": "https://media.rawg.io/media/screenshots/990/9907372f203d98f4373634292b48f176.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["arsquid"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}