{"id": 387192, "slug": "chaos-hotel", "name": "Chaos Hotel", "name_original": "Chaos Hotel", "description": "The story:\r\n<p>You, Billy Bill, have been formally invited to the tournament of gunslinging at the Chaos Hotel, where death isn't permanent, the socks don't smell bad, and the janitors are not to be trusted!</p>\n<p>Should you accept the invitation, you will be treated with the highest regard that any of our guests ever can receive. Food, water, and even your own room! (Usually we just put 10 guests in the same room and have them fight to the death to decide who gets to stay and who has to sleep on the couch and floor, because we think it's funny, but for this we've made an exception.)</p>\n<p>How is this legal? It isn't, we bribed the cops, but don't worry! If you accept, you will not be legally liable for anything that happens*, we will!</p>\n<p>*Unless you eat the sofas, then try to smuggle the potted plants out the window. Looking at you, Timmy!</p>\n<p>So why not come down to the Chaos Hotel, and try your hand at some merciless, senseless violence for a cold, hard cash prize?</p>\n<p>We'll be waiting!</p>\n<p>-Mr. Mize Tour</p>\n\r\nThe gameplay:\r\n<p>Ever wonder what it would be like if a run-and-gun only gave you the fire button?</p>\n<p>In Chaos Hotel, you play Billy Bill, a man with a scarily good aim with a gun born without the ability to use his legs. Using his high-tech wheelchair to blaze forwards semi-automatically, all you, the player, have to do is worry about one thing: </p>\n<p><em><strong>Shoot. Everything.</strong></em></p>\n<p>The janitors? They'll kill you with their mops if you get too close. The bullets the other gunslingers shoot at you? Shoot 'em out of the sky. The gunslingers themselves? Shoot them too, preferably before they shoot you at all! (It gets you more points that way!) Pretty much, keep shooting.</p>\n<p>But don't go overboard! If a shot misses (goes off the right side of the screen without hitting anything), your combo resets, leading to significantly worse scores.</p>\n<p>Can you be victorious in the tournament of gunslinging? Or will the countless hordes of other gunslingers take you out first?</p>\n<p>Good luck!</p>\n<p>I hope you enjoy the game!</p>\n<p>If I feel there's sufficient interest, I will probably make more levels for this some day. For that reason, combined with the game admittedly lacking some polish, I have marked the game as early access... for now.</p>", "metacritic": null, "released": "2019-10-25", "tba": false, "updated": "2019-10-28T05:37:26", "background_image": "https://media.rawg.io/media/screenshots/28a/28ae3c94948d0c9c1f4ca70cc81bcf79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["happy_frog_games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}