{"id": 387233, "slug": "laytons-mystery-journeytm-katrielle-and-the-millio", "name": "LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy - Deluxe Edition", "name_original": "LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy - Deluxe Edition", "description": "<p>&quot;LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy&quot; revamped as &quot;Deluxe Edition&quot; with multiple improved features!</p>\n<p>＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝<br />\nEnhanced puzzle-solving adventure experience with the Deluxe Edition!</p>\n<p>＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝</p>\n<p>■NEW PUZZLES: This Deluxe Edition includes more than 40 brand-new puzzles and additionally, some refined puzzles from the Nintendo 3DS version.<br />\n■Unlocked DLC: Content that was previously released as paid DLC, including the “Daddy’s Girl” and “Luke Lookalike” outfits, are unlocked. <br />\n■New Outfits: More than 50 new outfits have been added, all of which can be obtained through gameplay.<br />\n■Improved Layout and Enhanced Graphics: Key clues and essential information for each puzzle is now viewable on one screen, and all graphics have been remastered in HD.</p>\n<p>＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝<br />\nWhat is &quot;LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy&quot;?</p>\n<p>＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝</p>\n<p>■Intuitive and easy to play &quot;Mystery Solving Action Adventure&quot;: Progress through the story while walking around town, chatting with local residents looking for clues, and solving puzzles and mysteries with the heroine, Katrielle Layton!<br />\n■Comical puzzle-solving story composed of adventure and rich animation: Players can experience distinctive Layton aesthetics with in-game high quality animation.<br />\n■Original puzzles: &quot;LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy&quot; includes new, original puzzles that have been created exclusively for this game.<br />\n■Largest Puzzle Collection: &quot;LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy&quot; includes the largest assortment of puzzles of any LAYTON series title to date.<br />\n■Character Customization: Fashion-conscious players can dress Katrielle in various outfits to suit the case at hand as well as redecorate the agency.</p>", "metacritic": null, "released": "2019-10-08", "tba": false, "updated": "2022-11-11T11:39:44", "background_image": "https://media.rawg.io/media/games/1fa/1fa4f9ec0deb241d62e7fea7c38f1ac0.jpg", "website": "", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 3, "beaten": 5, "toplay": 8, "dropped": 5, "playing": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 9, "platforms": ["Nintendo Switch"], "developers": ["Level 5"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}