{"id": 387269, "slug": "into-the-maze-episode-1", "name": "Into The Maze - Episode 1", "name_original": "Into The Maze - Episode 1", "description": "A giant maze like structure is discovered on Mars. The player is a veteran astronaut sent to the red planet with his team of researchers to unravel the secrets of the maze. Who built it? what was its purpose? and why was it abandoned? these are some of the answers  the player will discover...  Their mission is to solve the maze’s puzzles  and more importantly, find and rescue their son, lost within it.<br/><br/>Into The Maze is an adventure game about exploring and solving puzzles within a huge, alien maze. The player controls a small robotic drone to help him navigate the environment, overcome obstacles and solve puzzles. The drone has special abilities and features to help the player in their quest such as accessing  unreachable places, traversing dangerous areas and a tractor beam to interact with the maze’s contraptions.<br/><br/>Inspired by classic science fiction pieces such as Solaris and The Man In The Maze, the game features a deep story for an adult audience. With 100% non-violent game-play and  stunning 3D graphics in low-poly style, Into The Maze is inspired by puzzle games such as Portal and The Witness.<br/><br/>Currently the game is planned to be released in 4 episodes. Each part will begin in  a new area of the maze and after a major story cliffhanger has been revealed to the player in a previous episode. This will ensure a more manageable and meaningful play time and developing time for our small indie studio, ensuring the best content in the best form of consumption.<br/> <br/>Features<br/><br/><ul><li>Control  a drone and use its different abilities and perspective to solve mind bending environmental puzzles<br/></li><li>Explore a mysterious alien structure and unravel it’s secrets<br/></li><li>Find upgrades for your drone to unlock new pathways and solutions<br/></li><li>Deep and engaging narrative unfolds as you progress through the mazes riddles<br/></li><li>Stunning low poly graphics in an alien sci-fi settings rendered in Unreal Engine 4<br/></li><li>Non violent game-play<br/></li><li>Carefully designed for adult adventure game lovers with limited time on their hands</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-01T02:15:01", "background_image": "https://media.rawg.io/media/screenshots/b7e/b7e1b276fc61dca9bd2512fcf27f5c36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Indistinct Chatter", "Nadav Hekselman"], "genres": ["Adventure", "Indie"], "publishers": ["Indistinct Chatter"], "esrb_rating": null}