{"id": 387264, "slug": "the-strange-story-of-brian-fisher-chapter-1", "name": "The Strange Story Of Brian Fisher: Chapter 1", "name_original": "The Strange Story Of Brian Fisher: Chapter 1", "description": "This story is about 38 years old police detective for disappeared people, Brian Fisher. 20 years ago, his father, who was space and Astro-physic scientist, disappeared under suspicious circumstances. After 5 months of his disappearance, he was pronounced dead, but his body was never found. This case was the reason Brian Fisher became a detective for disappeared people. Till now, he has never accepted that his father is dead. He wants to prove that his father is not dead and wants to find him alive. His father discovered the most important thing for the whole of humanity. So before telling the world that information, he disappeared. Brian, at the present time, is haunted by an unknown man who wants to steal the discovery that Brian has from his father to rule the world. Brian is not aware nor for his father's discovery, nor why the unknown man is haunting him.<br/><br/><br/><br/>The whole story has seven chapters. Through these seven chapters Brian Fisher is telling his story, the strange story how and why his father disappeared, who is the unknown man and how he is connected with Fisher's family, telling the story for events in the past that are connected with the present situation, and a lot of other things connected with his father and his disappearance.<br/><br/><br/><br/><br/><br/><br/>This is only the beginning, just a very small part of the whole story, the first chapter where Brian Fisher starts telling his strange story. Brian tried very hard to find some trace of his father's disappearance in his life, but without success until one day, an unknown man kidnapped Brian and imprisoned him in his father's cabin deep in the woods in a barely accessible terrain. Brian's father used this cabin as a secret workshop in which he worked on all those things that required high secrecy. Brian doesn`t remember how he was kidnapped because he was left unconscious during the kidnapping following a blunt blow to his head by an unknown person who approached him at night while walking in a city park. He also doesn't remember how he found himself in the cabin. <br/><br/><br/><br/>He didn`t know that the cabin was owned by his father. He has never heard about that cabin before. He remembered that he read in one of the books his mother wrote about the secret cabin. The cabin from the book and the cabin where Brian is locked had a lot of similarities. He felt that he had been in the cabin before, but it felt like that was a very long time ago, in the past when he was a young boy so, he cannot recall the memories. Brian is locked in the cage in the basement of the cabin and the main goal of this chapter is to escape from the cabin using his creativeness, his mind, the tools that he`s supposed to find and his training by his father.", "metacritic": null, "released": "2021-06-15", "tba": false, "updated": "2021-06-18T04:17:21", "background_image": "https://media.rawg.io/media/screenshots/12d/12dc5991bfe6978200542350eb94fd32.jpg", "website": "https://www.intetic.com/games/tssobf", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 2}, "playtime": 0, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Xbox One"], "developers": ["Intetic"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Intetic"], "esrb_rating": null}