{"id": 387254, "slug": "aurora-hidden-colors", "name": "Aurora - Hidden Colors", "name_original": "Aurora - Hidden Colors", "description": "Explore Russia as Gabriela, Gav and Mikhail. Fight Igor, Anastasia and bring back balance to the West Siberian Plain in this immersive 2D turn-based RPG experience.<br/><br/><strong>Story Mode</strong><br/>Be Gabriela, a superhero who has the power of seeing people's feelings as colors around them. Acknowledge your mission of stopping Igor from transforming people into a soulless slave army. Save your cousin's life, protect your family, learn new powers and protect your allies. Will you be able to fulfill a mission given by the spirits?<br/><br/><strong>Adventure Mode</strong><br/>Create your own story within the universe of Aurora. Choose your class, battle, level up, make friends, allies and enemies. It's possible to have a pet, start a relationship and change your character's clothes. Experience the storyline of Hidden Colors through a different point of view, complete missions and help reestablish the balance. <br/><br/><strong>Battle Mode</strong><br/>Call in your friends and have heartbreaking strategic fights. Two players can battle in this turn-based versus mode. <br/><br/><strong>Chapter 1 available</strong><br/>Play as Nadia in the Birch Village to experience the beginning of a catastrophe. Protect your people and fight Igor to prevent him from destroying the village.<br/>In the story mode, you can witness how Gabriela acquired her powers by meeting and old friendly face. <br/>In the adventure mode, play as... You! Choose you own name, appearance, pronouns and head to the spiritual realm before you can finally start doing missions to unlock and wait for the release of Chapter 2!<br/><br/><strong>Partial English version available</strong><br/>70% of the Story Mode and 40% of the Adventure Mode are available in English, and we're working every day and night to add and improve the quality of more and more English content.<br/>Full Brazilian Portuguese version available.", "metacritic": null, "released": "2019-12-10", "tba": false, "updated": "2019-11-01T02:07:35", "background_image": "https://media.rawg.io/media/screenshots/96f/96f4756e36ee2f80b9cdc0b843722d48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Aurora - Mídia & Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Aurora - Mídia & Games"], "esrb_rating": null}