{"id": 387381, "slug": "my-pocket-galaxy-3d-sandbox", "name": "My Pocket Galaxy - 3D Sandbox", "name_original": "My Pocket Galaxy - 3D Sandbox", "description": "If you had the power, how would you create the solar system? What would be the size of each planet or star? And how would you place them in orbit? If you are interested in Astronomy and looking for a powerful yet easy to use 3 dimensional space sand box app to create and simulate a whole new galaxy with realistic physics rules, then you’ve come to the right place. Orbit Sandbox Universe, the 3D sand box game, provides you the ultimate power to explore the infinite space and simulate your own space full of different planets, gas giants, and stars. <br/><br/>In this gravity simulator app, you get to customize literally any aspect of these particles to simulate and design your very own solar system in this sand box. Once you are satisfied with your customized solar system (or any other combination of particles, planets, and stars), you get to easily add it to your collection, take a screenshot and share it with the world.<br/>The game comes with a clean and neat design and the 3D simulation is so smooth that you won’t feel any difficulties or lags when bombarding your planets, or applying any condition to them. And make sure not to take the realistic gravity lensing effect as granted when looking at a black hole. It’s just fascinating. <br/><br/>Is this Orbit Sandbox Easy to Use?<br/>Is this 3D galaxy sand box with realistic physics simulation powerful enough to create and design different planets, gas giants and stars? The answer is a BIG yes! But are the simulation tools easy to use? The answer is even a BIGGER yes! The user interface is so friendly, that you’ll get used to it after going through the step-by-step tutorial and trying available tools for a few times. After that, you just need to use your imagination and be creative to form some unique pocket galaxies with gravity simulator based on physics rules. If you are going to redesign our lovely solar system in our galaxy, you’ll have access to all the planets (mars, moon, earth, mercury etc …) and you have the power to unlock new worlds by meeting the right conditions, colliding with the right objects, and altering mass and sea level while keeping the temperature stable. To smash stuff together and create new planets, make sure to crash the right ones together. <br/>Tip: To raise the sea level, hit a planet with ice meteors, and use rock meteors to lower the sea level. <br/>Orbit Sandbox Main Features at a Glance:<br/>•\tWonderful 3D graphics with smooth space simulation<br/>•\tSuper user-friendly interface with easy to learn gameplay<br/>•\tStep-by-step and detailed tutorial<br/>•\tHuge variety of particles, procedural planets, gas giants and stars<br/>•\tUltimate customization options for your creations<br/>•\tGravity simulator with realistic physics rules<br/>•\tCreate Solar System with the tiniest details <br/>•\tTake screenshots of your universe and share it with family and friends<br/>•\tUnlock new achievements<br/>•\tInteractive journal to track your creations<br/>•\tSave and Load simulated creations<br/>So, Orbit Sandbox Universe offers everything you should expect from such 3D gravity and universe sandbox games and it even sets the bar to a higher level by offering smooth particle simulator, realistic physics rules, user-friendly interface, a wide range of different particles, planets and stars, and a lot more.<br/>No matter you are serious in Astronomy stuff or you just want to have fun creating some beautiful infinite universes, we’ve got you covered. You just need to take your time, select from wide range of stunning particles, stars, and planets, specify their positions and how they should rotate, and last but not the least decide which planets should collide to destroy and create new worlds. <br/>Download and let us know about any bugs, feature requests or any other suggestions.<br/><br/>The app formerly known as Pocket Universe.", "metacritic": null, "released": "2017-04-14", "tba": false, "updated": "2019-11-01T03:14:01", "background_image": "https://media.rawg.io/media/screenshots/722/722e494e836943c85b6dc80e632b7488.jpg", "website": "http://www.pocketuniverse.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pocket Labs UK"], "genres": ["Action", "Simulation", "Educational"], "publishers": ["Pocket Labs."], "esrb_rating": "Everyone 10+"}