{"id": 387334, "slug": "faith-the-unholy-trinity", "name": "Faith: The Unholy Trinity", "name_original": "Faith: The Unholy Trinity", "description": "<p>On September 21, 1986, two priests arrived at the Martin Family home in rural Connecticut to investigate an apparent case of demonic possession. Only two people would leave the house alive.<br />\nFAITH is a pixel horror game inspired by the era of classic 8-bit gaming and the &quot;Satanic Scare&quot; of the 1980s. Use your holy crucifix to perform exorcisms, fight back against possessed cultists, and cleanse haunted objects. Discover a world of dread, isolation, and mystery as you explore haunted forests, abandoned churches, and the inner sanctums of a Satanic cult.✞ EXPERIENCE ALL 3 CHAPTERS OF THE UNHOLY TRINITY ✞ FAITH - Haunted by nightmares and searching for answers, a young priest returns to the house where an exorcism went horribly wrong a year before.<br />\nFAITH: Chapter II - After confronting unspeakable paranormal entities and narrowly escaping with his life, a young priest descends into a new nightmare.<br />\nFAITH: Chapter III - Aided by a mysterious stranger, a young priest travels the dark countryside to stop a Satanic cult from summoning a horrifically powerful demon.✞ HORROR THE OLD-SCHOOL WAY ✞ Wickedly chunky pixels<br />\nHand crafted rotoscope animations<br />\nHaunting retro soundtrack<br />\nMultiple/secret endings<br />\n1980s religious paranoia<br />\nDemonic EVPs channeled through abandonware speech synthesizers</p>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2024-04-16T19:18:53", "background_image": "https://media.rawg.io/media/games/242/242caa9d132f80fd84eee19d2637a3f7.jpg", "website": "", "rating": 4.33, "rating_top": 5, "added_by_status": {"yet": 23, "owned": 119, "beaten": 17, "toplay": 47, "dropped": 9, "playing": 3}, "playtime": 2, "achievements_count": 30, "ratings_count": 18, "suggestions_count": 253, "game_series_count": 2, "reviews_count": 18, "platforms": ["PC"], "developers": ["Airdorf"], "genres": ["Adventure", "Indie"], "publishers": ["New Blood Interactive"], "esrb_rating": null}