{"id": 387369, "slug": "yokai-spirits-hunt", "name": "Yokai: Spirits Hunt", "name_original": "Yokai: Spirits Hunt", "description": "＊Background <br/><br/>Disaster struck in Xiangfu 1st Year (AD 1008)<br/>It was the enthronement ceremony of Emperor Song Zhenzong, with the company of the Grand Master of Taoism.<br/><br/>All of a sudden, a rift cracked in the sky, endless demons and yokai gushed out and the Altar was full of dead bodies in a snap of fingers! <br/><br/>In the midst of chaos, Emperor Song Zhenzong and the taoists vanished into the ether...<br/>Evil demons and yokai roared to victory.<br/><br/>\"The Eight Demon Masters were back!\"<br/><br/>＊Features <br/><br/>◆Original Manga Style &amp; Intriguing Plots for Everyone<br/><br/>Yokai: Spirits Hunt narrates the main stories in a manga style, entering the Yokai-invaded world from the first-person view of protagonist Jiang Zhuo Yue. You can experience exotic environments and authentic ink painting art-style as you travel along the world map! Tons of stunning graphics and original hand-drawn artwork are for you to discover!<br/><br/>◆Brand-New Turn-based Strategic Battles<br/><br/>Everyone can enjoy and experience the most innovative and unique gameplay in the game. During the battles, gamers can move their yokai just like traditional Turn-based Strategic Battles Game to have a fight. And thoughtful formations and movements can bring you particular feelings in Yokai. Let’s team up the most powerful team to win every battle.<br/><br/>◆Summon Unique Yokai and Unlock Their Stories<br/><br/>Hunt down and dispatch yokai in exquisite battling scenes! Collect over 70 distinct characters in Asian folklore to discover their own unusual skills and side stories!<br/><br/>◆Explore the Mysterious Yokai Realm<br/><br/>Follow the quests of the young spirit master as he sets foot on an unforgettable journey! During the exploration, players can move the character freely to hunt yokai and gain EXP. Also, collect chests and pots to get more items. Be careful of the yokai, or ghosts and demons along the way, they are ready to play tricks on you! <br/><br/>◆Challenge PVE &amp; PVP Combat<br/><br/>Power up and evolve your yokai to battle for your cause! Create strategic party combinations, count your moves just right and battle with quick tap controls! <br/><br/>It’s time to get moving—your spiritual adventure awaits you!<br/>“Summon me, Master!” <br/><br/>Facebook: https://www.facebook.com/YokaiSH/<br/>Twitter: https://twitter.com/Yokai_SH<br/>Instagram: https://www.instagram.com/yokaispiritshunt/", "metacritic": null, "released": "2019-07-19", "tba": false, "updated": "2019-11-01T03:09:11", "background_image": "https://media.rawg.io/media/screenshots/7c6/7c6b05ebabdac552473d48fa017eac8c_GPZ2VlO.jpg", "website": "https://www.facebook.com/YokaiSH/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CUBE MAGIC"], "genres": ["RPG", "Strategy"], "publishers": ["CUBE MAGIC"], "esrb_rating": "Teen"}