{"id": 387385, "slug": "smallchess-pro", "name": "SmallChess Pro", "name_original": "SmallChess Pro", "description": "*****<br/>PRO: The paid version plays stronger chess than the free version and it has no limitations such as app-credits and limited features. The Pro version offers more and better.<br/>*****<br/><br/>****** Please report any crash or question you have to support@smallchess.com ******<br/><br/>SmallChess is a high quality and brilliantly presented chess playing app for iOS. It's suitable for everyone: from beginners to the world champion. You'll improve your chess with a very strong chess engine (ELO 3000+). An ultimate chess master in your pocket! <br/><br/>Improve your chess with our innovative guess-the-move. You'll partner with Magnus Carlsen and Bobby Fischer! You'll also meet Jose Raul Capablanca, Judit Polgar, Garry Kasparov and more! <br/><br/>You can share your chess games with Twitter, Facebook and SMS! <br/><br/>SmallChess is your best compatriot and trainer. <br/><br/>Key features <br/><br/>- Play against the computer or yourself <br/>- Play against ELO rating from 500 to 3000! <br/>- Play online chess with FICS<br/>- Tablebase database <br/>- Opening database <br/>- Save and load PGN games. You can also import games from Safari and emails. <br/>- Support PGN variations and annotations <br/>- A massive chess database, played by some of the best chess players in history <br/>- Annotated chess games <br/>- Nine coaching styles, it's totally amazing! <br/>- Save your favourite chess positions to iPhoto or our in-app chess album! <br/>- Share your favourite chess positions with SMS, Email, Twitter and Facebook! <br/>- 10+ visual themes and 30+ sound effects <br/>- Use guess-the-move training to improve your chess. You'll partner with Magnus Carlsen and Bobby Fischer against some of the strongest chess grandmasters. <br/>- Analyse your games with our world-class chess engine <br/>- Chess cartoons, trivia, puzzles, quizzes, and more! <br/>- Chess puzzles: Think Like A Grandmaster and Maths Genius. <br/>- Beauty of Chess. <br/>- Interactive chess experience. <br/><br/>App Support: <br/><br/>If you ever have a problem with the app or you have a suggestion, please write an email to us. Alternatively, follow us on Facebook or Twitter. You can find our contact details on our website. We answer all enquiries promptly. <br/><br/>*--- Please leave a review if you like this app ---* <br/><br/>Small is Power. You'll be surprised.", "metacritic": null, "released": "2013-02-11", "tba": false, "updated": "2019-11-01T03:15:25", "background_image": "https://media.rawg.io/media/screenshots/e3a/e3ae68a53bdac637367636a4c1c3e489.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ted Wong"], "genres": ["Board Games", "Educational", "Puzzle"], "publishers": ["Ted Wong"], "esrb_rating": "Everyone 10+"}