{"id": 387382, "slug": "private-school-days", "name": "Private School Days", "name_original": "Private School Days", "description": "* Although universal, this version is primarily for iPhones and will appear large on an iPad. Those users may prefer to download the \"HD\" version and buy the in-app upgrade.<br/><br/>Enjoy the school sim at its best with all the privileges of a \"Private\" education! Start with a student of your own creation, switch characters at any time, and save your changes to all 10 classes as well as the teachers and civilians. Have fun recreating your own real-life classmates, or simply play God by cheating your way to the life you always wanted. And with no sponsors paying your way, you can enjoy every minute of every day without any interruptions. Private students also benefit from a more continuous experience that never ends until you want it to. If you fail to graduate, repeat the year. If you get expelled, walk the streets as a civilian. Even death holds no fear for those with \"private\" health care!<br/><br/>The prison from Hard Time has closed down and re-opened as a school, but the challenge to survive and thrive remains the same. Live every hour of every day in real-time - from getting out of bed in the morning to attending a timetable full of classes, as you explore a city filled with interactive props. Picking up knowledge from each class helps you answer real questions in 10 different subjects, as you work towards the grades you need to graduate. But with over 100 fellow students walking the halls, an equally important popularity contest decides whether your days are filled with fun or fear.<br/><br/>BASIC CONTROLS:<br/>In-game tutorials explain in more depth, but the basic controls are as follows:<br/>A = Attack (on its own to kick, with a direction to punch)<br/>G = Grapple / Throw<br/>R = Run<br/>P = Pick-Up / Drop (with a direction to prioritize objects, without to prioritize furniture)<br/>T = Taunt (interact with props)<br/><br/>OTHER CONTROLS<br/>- Press ATTACK and RUN together to launch a powerful attack.<br/>- Press any button with any direction (or none) in a grapple to trigger different moves.<br/>- Press RUN and PICK-UP together to set fire to a small object (which can then be used to set fire to a large object).<br/>- Touch the clock or health meter to pause the game for more options.<br/>- Tap the speech bubbles to speed through conversations.<br/><br/>PERFORMANCE<br/>- If you find your device struggles to display lots of characters, considering keeping the \"Population\" option low.<br/>- \"Speed Up Frame Rate\" sleeping will require good performance, so consider leaving it on \"Speed Up Clock\".<br/>- Head to the \"Display\" options to tone down other features.<br/><br/>To learn more about this and other games, join the debate at:<br/>www.facebook.com/MDickieFans<br/>@MDickieDotcom", "metacritic": null, "released": "2015-06-04", "tba": false, "updated": "2019-11-01T03:14:23", "background_image": "https://media.rawg.io/media/screenshots/ee7/ee736c2a4607231393b6b6904053e6be_K59V4VG.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MDickie"], "genres": ["Adventure", "Simulation", "Educational"], "publishers": ["MDickie"], "esrb_rating": "Mature"}