{"id": 387451, "slug": "deceived-voice-whispers-redux", "name": "DECEIVED VOICE - WHISPER'S REDUX", "name_original": "DECEIVED VOICE - WHISPER'S REDUX", "description": "<p>In 2016, Nikoback Games (Jeffrey) released <em>Deceived Voice,</em> their first-ever public release. This was an ARG Adventure game built in RPG Maker VX Ace, where you must solve puzzles outside of the game. Years after it's been pulled down, we're happy to bring the game back alive for Halloween 2019!</p>\n<p><strong><em>DECEIVED VOICE: WHISPER'S REDUX</em> </strong>is a re-release of the original game, featuring modified dialogue, character artwork, and all new-original music! Additional bugs and grammatical errors have been fixed as well. Reclaim your identity once again!</p>\n<p>FEATURES</p>\n<p><strong>- Deceive the voice deceiving you</strong>: Ignore the pleas of the strange voice plaguing the intercom and explore through an abandoned laboratory.</p>\n<p><strong>- A fresh coat of paint</strong>: Featuring new character art by Moxie Riles (<em>A NIGHTMARE'S TRIP, RE: DECEIVED VOICE</em>) and music (by Ruky!), this game finally will receive an identity of its own!<br/></p>\n<p>- <strong>And new..mysterious doors have opened:</strong> Brand new, additional secrets have been added, including new items and new links tied to the upcoming reimagining! </p>\n<p>The game is completely free to download, and includes a walkthrough if you are not interested in attempting to solve the puzzles (we recommend you try it first, however!) We will include a folder featuring the brand new character art if you chip in $2. Thank you!</p>\n<p>You can buy the soundtrack here.</p>\n<p>If you enjoy <em>DECEIVED VOICE - WHISPER'S REDUX</em>, you should also check out <em>RE: DECEIVED VOICE</em>, a re-imagining of the original by SKY HOUR WORKS, featuring a completely new story line set in the PROJECT NATURA series!</p>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-11-01T03:41:04", "background_image": "https://media.rawg.io/media/screenshots/f2a/f2a09bee2655f15ea5d0de6781e49075.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SKY HOUR WORKS"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}