{"id": 387434, "slug": "first-strike-nuclear-war-rts", "name": "First Strike: Nuclear War RTS", "name_original": "First Strike: Nuclear War RTS", "description": "Millions of commanders are already playing First Strike all over the world. Now, with First Strike: Final Hour, the acclaimed strategy title is updated with all-new features and a beautiful HD rework!<br/><br/>====================<br/><br/>****   - \"A thought provoking and fast-paced strategy game\" - pocketgamer<br/>****   - \"A gorgeous game with a message, that doesn’t forget that it’s a game\" - 148apps<br/>****½ - \"An awesome game suited for casual and professional nukers alike\" - appszoom<br/>****   - \"For my money, there is no better-looking game on the App Store\" - pockettactics<br/>****½ - \"One of the best releases of the year\" - whatsoniphone<br/><br/>====================<br/><br/>Escalation is a downward spiral.<br/><br/>A nuclear armageddon is no one’s dream scenario. So choose your steps carefully, it’s a small path between war and peace. FIRST STRIKE is a great strategy simulation featuring snappy gameplay and an intuitive interface that makes dropping the big one as easy as ABC. But be sure to take the right measures to guarantee your people’s safety. <br/><br/>Pick one of the big nuclear players – from known Superpowers to an upstart hellraiser like North Korea – and plan your strategy wisely: Limited but clever options let you as the leader of your superpower steer your nation’s fate: Expand to other countries, build bombs or debuild in order to restructure your arsenal. Or use research to widen your options, such as: Ability to act quicker and build bigger bombs, better recon on your enemies actions, automated self-defense-sequences and many more.<br/><br/>Whether you’re a bloodthirsty warmonger  or a tree-hugging hippie – it’s time to put your cards on the table. A quick and fun game with beautiful graphics, FIRST STRIKE shows you how little it takes to heat things up. With the tip of your finger you can control the destiny of the precious and vulnerable rock floating through space, the rock we call mothership Earth.<br/><br/>====================<br/><br/>*Winner \"Best Mobile Game\" - Indie Prize Amsterdam*<br/>*Winner \"Most Innovative Game\" - Best App Ever Awards*<br/>*Winner \"Game of the Year\" - BOSA Awards*<br/>*Winner \"Newcomer of the Year\" - SwissICT Awards*<br/><br/>*Finalist \"Best Upcoming Game\" - International Mobile Game Awards*<br/>*Finalist \"Most Meaningful Play\" - International Mobile Game Awards*<br/>*Finalist \"Best Hardcore Game\" - Game Connection USA Awards*<br/>*Finalist \"Most Innovative Game\" - Game Connection USA Awards*<br/>*Finalist “Best Strategy Game” - Best App Ever Awards*<br/>*Finalist \"Best International Game\" - Ludicious Game Festival*<br/>*Finalist \"Best Swiss Game\" - SGDA Awards*<br/><br/>====================<br/><br/>** Compatability: <br/>Recommended: iPhone 5 or higher, iPad 3 or higher<br/>Required: iPhone 4 or higher, iPad 2 or higher<br/>IMPORTANT: Not compatible with iPod Touch!", "metacritic": null, "released": "2014-03-12", "tba": false, "updated": "2019-11-01T03:35:40", "background_image": "https://media.rawg.io/media/screenshots/612/6126fb6addfa979718d856c5f209db17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FEINHEIT"], "genres": ["Strategy", "Simulation", "Educational"], "publishers": ["FEINHEIT"], "esrb_rating": "Teen"}