{"id": 387441, "slug": "colony-quest-space-defense", "name": "Colony Quest: Space Defense", "name_original": "Colony Quest: Space Defense", "description": "A brand new space strategy mobile game. We must seek a new life in space. To survive on dangerous planets, you must establish your strategy and be cold-blooded.<br/><br/>Check the exchange rate and income expense balance of your own space colony. You must make the right decisions to survive on dangerous planets and set up your defense properly. <br/><br/>Alien sticky slimes threaten the future of the human race. Stop the waves of enemies against you and set the future. Upgrade your buildings and strengthen the colony. Earn more materials and build your towers against enemies. In this epic space adventure, the fate of humanity depends on you.<br/><br/>--GamePlay--<br/>Collect resources to survive on an alien planet and survive.<br/>- Collect material for buildings with molecular minerals.<br/>- Build the plasma tower for alien slimes.<br/>- Set up a plasma injector to energize your towers.<br/>- Check energy balance and set up a solar panel.<br/>- You must increase your population to survive the colony.<br/>- Build a farm to feed colonists.<br/>- When you have enough food, build colonial houses and increase the population.<br/>- Keep your escape rocket doing all this.<br/>- Reach the required population for the colony and complete the mission.<br/><br/>Discover new star systems with a constantly supported and developed game and set off for the unknown. Two new star systems will be with you very soon.<br/><br/>-- Road Map --<br/>What we will see in the next process.<br/>- Two new star systems.<br/>- Different creatures.<br/>- New buildings and reinforcements.<br/>- New skill tree.<br/>- The new colonist army soldiers.<br/><br/>No microtransactions or long wait times! Everything is unlocked and rewarded through gameplay.<br/>Please comment and rate. Support our independent gaming company and help us serve you better.<br/>For any problems, please send an e-mail to hello@bozzagames.com.", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-11-01T03:38:35", "background_image": "https://media.rawg.io/media/screenshots/77e/77ee2439d3b00244cbc60e6745273a0e_5XQkpAU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Umat Basaran"], "genres": ["Strategy", "Puzzle"], "publishers": ["Umat Basaran"], "esrb_rating": "Everyone 10+"}