{"id": 387436, "slug": "ultimate-wolf-simulator-2", "name": "Ultimate Wolf Simulator 2", "name_original": "Ultimate Wolf Simulator 2", "description": "Take on the life of our most realistic wolf ever in the sequel to the most popular animal simulator of all time! Explore a wild world brimming with stunningly realistic plants and animals alike. Meet other wolves in the forest and live together, raise your family, hunt for food, and become the strongest wolfpack in the world!<br/><br/>HYPER REALISTIC SIMULATION<br/>The forest has never been more alive! Explore and hunt to maintain your wolves thirst and hunger in the most detailed world we’ve ever created!<br/><br/>NEW ALERT SYSTEM<br/>Sneak your way through the forest to avoiding alerting nearby animals and giving them a head start trying to escape you! Animal AI is smarter and faster than ever!<br/><br/>NEW BATTLE SYSTEM<br/>Omnidirectional dodge system brings a new level of skill to your fights! Quickly react to your opponents attack direction to dodge and avoid damage!<br/><br/>NEW RELATIONSHIP SYSTEM<br/>Build deeper bonds with your wolves through the new relationship and personality system. Your pack recognizes heroic and caring acts that will alter the relationships between wolves. Gain bonuses from synergetic wolves hunting together!<br/><br/>EXPANDED WOLFPACK<br/>Have up to TEN wolves in your pack! Seek out friendly wolves and pass their challenges to recruit them to your pack! Play as your new wolves to help them level up and improve relations with other family members!<br/><br/>BABY AND TEEN WOLVES<br/>A brand new age makes raising your pups even more real! Breed wolf pups that will grow into teens and eventually full grown members of your clan! <br/><br/>NEW CUSTOMIZATIONS<br/>Introducing expanded animal customization options for fine-tuning your wolf’s look! Alter physical features like height and ear size to accentuate a wolfs personality!<br/><br/>CONQUER THE SPIRITS OF THE FOREST<br/>Challenge the four elemental spirits of the forest to battles on an EPIC scale! Jump over waves of lava, dodge massive boulders, and resist icy winds in increasingly difficult tests of your reflexes and timing!<br/><br/>UPGRADE STATS AND SKILLS<br/>Gain experience and level up your wolves to unlock stat bonuses and unique skills! Skills will grant specialized wolf abilities like healing, tracking, and battle strength!<br/><br/>NEW DEN CRAFTING<br/>Collect materials to decorate and upgrade your dens and make life for your wolves even better! Building animal traps can provide your pack with a guaranteed tasty snack in the mornings!<br/><br/>MASSIVE OPEN WORLD FOREST<br/>At player request we have done away with procedural flora, and have instead hand placed every blade of grass and tree in the world, bringing a more detailed purposeful world for you to explore!<br/><br/>REALISTIC WEATHER AND SEASONAL CYCLE<br/>The colors of the forest change before your eyes with our brand new seasonal cycles. Snow gathers upon the ground, puddles form in the rain, and different climates will be altered accordingly to provide maximum realism.<br/><br/>INCREDIBLY DETAILED ANIMALS<br/>Discover the all new wildlife of the forest!  Improved AI and animations combined with species specific action trees will immerse you in our most detailed world to date. Track down animals like fox, deer, crocodile, bear, boar, snake, fish, crow, moose, ram, raccoons, rats and of course wolves!<br/><br/>IMPROVED NEXT-GEN GRAPHICS<br/>Introducing AAA PC quality graphics in a mobile simulator! With meticulously optimized models and textures, we’ve managed to reach an unrivaled level of visual quality!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the blood effects to add even more realism!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Ultimate Wolf Simulator 2 to prove you can survive as a wild wolf in an all-new completely revamped simulation!<br/><br/>If you liked living as a Wolf then be sure to check out our other animal simulators!<br/><br/>We plan on creating more sequels so give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2019-10-12", "tba": false, "updated": "2019-11-01T03:36:30", "background_image": "https://media.rawg.io/media/screenshots/3f8/3f8d9d5bd4a34b2d7df1540d7510cc7a_tM69DQf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": "Teen"}