{"id": 387853, "slug": "moonshine", "name": "Moonshine", "name_original": "Moonshine", "description": "<p>In the year 2099, a small family of crater-born farmers is repeatedly hounded by the offers of a tech conglomerate of who after buying out and replacing the rest of the moon's population, seek to take what’s left by force. <br/>An asymmetric tower defence game with you fighting the robot menace off your land whilst the Robot Overlord and their forces try to break through and exterminate you.<br/></p>\n<p>Features: </p>\n<ul><li>Unleash an arsenal of southern weapons from the comfort of your mechanised worksuit as the farmers.</li><li> Or lead the onslaught of your robot underlings as the Overlord.</li><li>A new blend of MOBA and Tower Defence gameplay. </li><li>Can be played with either control or keyboard. <br/><br/>Controls:</li><li>WASD/Left Stick- Movement. </li><li>Mouse Buttons/ Triggers- Shoot. </li><li>Space Bar/A- Jump.</li><li>Middle Mouse Button/Right stick- Zoom In.</li><li> E,R/ Shoulder Buttons- Equip new weapon when nearby. </li></ul>\n<p>Team: Jacob white, Kieran Davies, Zander walls, Matthew Hamill,<br/>Matthew Howells, Kieran Williams<br/><br/>Note: This is an early build of the game and has been stripped back for a damage version. The game will currently run and end with the minions destroying the farmers core. <br/>You can currently play by yourself as a defender, with the ability to pick up weapons and destroy the minions to hold them off as long as you can. <br/></p>", "metacritic": null, "released": "2019-10-30", "tba": false, "updated": "2019-11-01T05:25:57", "background_image": "https://media.rawg.io/media/screenshots/143/143889278923cd3e5df4df11d36ea9ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jacob White"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}