{"id": 387842, "slug": "sombras-y-cipreses", "name": "Sombras y cipreses", "name_original": "Sombras y cipreses", "description": "<p>Jugar a \"Sombras y cipreses\" en el foro del CAAD</p>\r\nIntroducción\r\n<p>\"Sombras y cipreses\" es un pequeño intento desesperado de última hora por participar en la Game JAM Ectocomp 2019. Aunque es prácticamente una estafa U.U Permítanme que les aclare el por qué.</p>\n<p>Se trata de un juego conversacional clásico, en el que los jugadores introducen mediante el teclado comandos con las acciones que quieren que su personaje realice, al estilo de \"coger el libro\" o \"ir al salón\", y reciben como contestación un texto indicando el resultado de su acción.\r\n  </p>\n<p>Sin embargo, en un juego al uso de este tipo sería un ordenador quien procesara el comando introducido por el jugador para generar la salida. Aquí hemos sustituido al ordenador por un señor con barba.\r\n  </p>\n<p>Se trata pues de un juego que se jugará por foro, en la dirección proporcionada más arriba, un poco en la línea de cómo funcionan los Parsely Games. Por lo demás, la dinámica que puede esperarse es la normal en este tipo de juegos, incluido cierto grado de sordera.\r\n  </p>\n<p>Dependiendo de cómo resulte la experiencia, tengo la esperanza de poder convertir la aventura en un juego conversacional al uso, similar al \"Celephaïs: Donde el cielo se une con el mar\" que ya desarrollé hace algo más de un año.\r\n  </p>\n<p>Sin más, les animo a participar en este lance, sin ningún tipo de compromiso de permanencia en la partida por su parte.\r\n  </p>\n<p>Suyo afectísimo,\r\n  </p>\n<p>AZ</p>", "metacritic": null, "released": "2019-10-30", "tba": false, "updated": "2019-11-01T05:23:15", "background_image": "https://media.rawg.io/media/screenshots/f1c/f1c0d1d9d58f01211a28f8bae1ecc635.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AZ"], "genres": [], "publishers": [], "esrb_rating": null}