{"id": 388021, "slug": "the-field-sinister-twist-games", "name": "The Field (Sinister Twist Games)", "name_original": "The Field (Sinister Twist Games)", "description": "Get lost in a creepy corn maze located at an old New England farm.\r\n<p>Your friends invite you to wander through a corn maze out in the country.  Not exactly your first choice of a fun evening out, but your good friend Jen talks you into going with them anyway.  Although, if you were aware of the history of this particular farm, you may have been better able to justify your reluctance.  Can you find your way through the twisting, writhing maze?  Can you save your friends?         Can you save yourself?</p>\n<p>The harvest is ready...</p>\n<p>Enter the Field!</p>\n\n<p>The Field features an all original corn maze map,  as well as custom models and animations, all created by a single developer. And for about the price of a cup of coffee, you can have both a copy of my game and my eternal gratitude. I am super grateful for the opportunity to scare you. I can't thank you enough.</p>\n<p> I hope you enjoy your experience!</p>\r\nGameplay:\r\n<p>The core of the game is a maze. You must find your way through a twisting labyrinth of corn. Light candles along your way to help you navigate places you've been, and listen closely, because you and your friends may not be the only things in the corn.<br/></p>\r\nThank you for your interest in The Field!\r\n\r\nControls:\r\n<p>WASD to move</p>\n<p>Mouse to look</p>\n<p>E to interact</p>\n<p>F for flashlight</p>\n\r\nBackstory:\r\n<p>Spend some time at Peddlers End...</p>\n<p>There is a farm in New England, which recently purchased, used to belong to the Atkins family.</p>\n<p>The farm, in 1902 was dubbed by many as 'Peddlers End'. The name referring to an incident that occurred on the farm one fateful day in early fall of that year.<br/>Upon returning home from a trip into town, a trip mind you that takes the better part of a day, Jacob Atkins discovered his wife, Emilia, in the arms of a shoe peddler. Seeing the two together, he flew into a rage, killing both his wife, and the peddler. The farm, from that moment on, was known to the locals as 'Where the peddler met his end'.<br/>Grief stricken over the tragedy, only a few weeks later Jacob Atkins himself took his own life, hanging himself from one of the rafters in the barn.<br/>Upon the death of Jacob and Emilia, their 23 year old daughter Sarah, was left alone to tend to the farm. Sometime during that winter Sarah went missing, and was not heard from again. <br/><br/>The farm fell to disrepair, until sometime in the late 1960's, when it was purchased by Rodger and Millie Hilkins. Hilkins Farm produced corn for cattle feed for many years, until an accident with his farm tractor in 1992 left Rodger with only his left leg. The two continued to own the farm right up until 2003, when Millie took ill of a respiratory infection, and passed away. Rodger then sold the farm to his then neighbor Milton Hawlkes, who over the next several years, let the farm sit, and decay.  <br/><br/>Hawlkes, late one evening, after a long bout of drinking, attempted to burn the barn down, along with the adjoining field. He poured gasoline from the inside of the barn, along a path through the corn, which although uncultivated for a time, still grew. He then ignited the gas with a match, and set the field a blaze. <br/>His attempt failed. A rain storm sweeping in from over the mountain ridge extinguished the fire, but not before taking most of the farmhouse with it. And as for Milton Hawlkes, he in his drunken attempt to destroy the farm, fell, and burned a large portion of himself with it. His right hand was lost, and almost half his face needed to be grafted.<br/>When asked why he tried to burn his own property, he replied that he had always hated that farm. He said that it was cursed, and the soil was sour. He even claimed that from time to time he would see Jacob chasing his wife through the field, bringing her again to her horrible end. And some early mornings, he would open the barn door to find the rope still gently swinging from the rafter that had relieved Mr Atkins of his guilt decades before.<br/></p>", "metacritic": null, "released": "2019-10-28", "tba": false, "updated": "2019-11-01T06:11:06", "background_image": "https://media.rawg.io/media/screenshots/af4/af4add61b7bcb56bd2205ac343cb0f1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sinister Twist Games"], "genres": [], "publishers": [], "esrb_rating": null}