{"id": 388023, "slug": "bwrgb", "name": "BWRGB", "name_original": "BWRGB", "description": "<p>BWRGB (Black, White, Red, Green, Blue) is a small puzzle game made using the Godot game engine. Since I haven't made a complete game yet, I wanted to make something small from start to finish. I spent about a week on this project.</p>\n<p>The first 8 levels are \"Tutorial\" levels and then there are 10 levels after that. The goal of the game is to guide Robi, the Godot mascot, to the \"finish\" square (stars) by left clicking on squares.  Only valid squares will highlight when hovered by the mouse. The player can walk on white/grey cells. Energy is absorbed from colored squares which will fill the energy meters.  Once all 3 meters are full,  this energy can be used to energize colored squares to make them white/grey (walk-able).</p>\n<p>My purpose for creating this was to create a \"full\" first game without the complexity and pressure of a larger project. It was a good experience and I learned several valuable things in the process.</p>\n<p>There are 2 known bugs in the game.  The first will require the player to \"reload\" the level if it is encountered.  If you click on a key and it disappears and then reappears, the game will be stuck and you will be unable to perform an action.  If this occurs, please reload the level and try again.  I would say that there is a 5-10% chance this will happen.  The second is only visual., but may cause some confusion.  If a square remains highlighted, it has gotten stuck in the \"highlight\" state.  Simply hovering the mouse on it and then off of it should return it to the non-highlighted state.  I apologize that these are still in the game.</p>", "metacritic": null, "released": "2019-10-29", "tba": false, "updated": "2019-11-01T06:11:31", "background_image": "https://media.rawg.io/media/screenshots/bb0/bb00b573dcb862137b385f9ae8ecf9ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Haplotyper"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}