{"id": 388047, "slug": "fright-or-flight", "name": "Fright or Flight", "name_original": "Fright or Flight", "description": "<p>Once upon a night, while Alucard was sleeping someone (or something) has stolen his Big Book of Beastly Baddies! All of Alucard's precious Creature and Hex cards were lovingly tucked away in there and now they're gone! He's not too happy about this; time to investigate the Monster Manor, scrounge together a rag tag team of new monsters, and find the thief of the Big Book of Beastly Baddies!</p>\n<p>Battle your way through some of the Manor's residents and acquire new and powerful monsters along the way! What's that? Your opponent wants a rematch; after winning a game of Fright or Flight, your opponent may be up for a rematch with a team stronger than before, which means another potential addition to your team!</p>\n<p>Your monsters aren't the only ones fighting, Alucard can chime in with items to support them as well as utilize his small arsenal of Special Hexes to turn the tide of battle!</p>\n<p>Partake in 14 Battles with 18 Monsters sporting their own (crudely) made artwork to pick from, some combos will claw you to victory and others may give you a haunting challenge in this mini adventure!</p>\n<p>[CURRENT NOTE: There has been issues trying to get the deployed MacOS version to save properly and the game crashes when you enter the OPTIONS menu, unfortunately with the deadline I have not been able to fix this issue the the moment. As a precaution, this may affect the Windows version as well so be careful.]</p>\n<p>[This game was made for the 2019, 2nd Annual Hawktober Gamejam]</p>\n<p>[Estimated Playtime: 1 Hour]</p>\n<p>CREDITS:</p>\n<p>-----------------------------------------------------------------------------------------------</p>\n<p>Plug-Ins Provided By:<br/></p>\n<p>-Himeworks</p>\n<p>-Hudell</p>\n<p>-Rm Corescript team</p>\n<p>-SumRndmDde</p>\n<p>-Galv</p>\n<p>-Yanfly</p>\n<p>-Iavra</p>\n<p>-Modern Algebra</p>\n<p>-----------------------------------------------------------------------------------------------</p>\n<p>Art, Music, Eventing, and Mapping:</p>\n<p>-Joker101</p>", "metacritic": null, "released": "2019-10-29", "tba": false, "updated": "2019-11-01T06:17:44", "background_image": "https://media.rawg.io/media/screenshots/f88/f88039bb321a2364e3c3c99f462bd8a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Joker_101"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}