{"id": 388381, "slug": "nioh-2-open-beta", "name": "Nioh 2 Open Beta", "name_original": "Nioh 2 Open Beta", "description": "UNLEASH YOUR DARKNESS<br/><br/>Death is coming, masocore warrior… are you ready?<br/><br/>Only the deadliest samurai will survive this brutal taster of the upcoming action RPG sequel. <br/><br/>Test yourself in a refreshed combat system with new weapons and skills, while wielding the supernatural powers of the Yokai. Play through two levels and face two formidable bosses solo or in two or three-player online co-op.<br/><br/>Master your foes and you will earn The Mark of the Demon Slayer – a reward entitling you to unlock the Kamaitachi Helmet from the in-game Shrine to use in the full game.<br/><br/>This Open Beta Trial runs from November 1-10.<br/><br/>Pre-order the Digital Deluxe Edition from PlayStation™Store, which includes the Season Pass, weapon set, charm, PS4™ theme and PSN avatar set for PS4™.<br/><br/>Online features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/><br/>1 player<br/>Network Players 2-3<br/>DUALSHOCK®4<br/>Online Play (Optional)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>Online features may be terminated at any time.<br/>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2022-10-07T05:55:32", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}