{"id": 388333, "slug": "wigged-out", "name": "Wigged Out", "name_original": "Wigged Out", "description": "Wigged Out is a historically inaccurate party game with a unique take on dodgeball. Face your rivaling school in a fierce and hilarious ball game, where the main objective is to move a big ball to the opponents’ goal line by using every trick in the book. This is done by throwing whatever item you can find on it. If you should happen to miss the big ball, you may accidentally realize that these items work just as well on other players! Sending your opponents flying with an explosive keg or slapping them across the face with a rubber turkey is just a couple of the many strategies you may employ during a match.<br/> <br/>Be wary though as humans aren’t the only threat out there; Watch out for fire hydrants and manholes ready to burst at any moment, or the school mascot goat that found its way onto the pitch and is attacking anything in its path! These and other environmental <strong>hazards</strong> could be lurking around the corner.<h3>Modern-day meets baroque</h3>Wigged Out “baroquifies” today’s college stereotypes and creates a universe that’s never been seen before<h3>Local and online play</h3>The game offers an over the top experience with hilarious gameplay that can be played both locally and online. Throw in a couple of bots and you will never feel alone again!<h3>Great variation</h3>With more than 80 colorful levels across different themed settings, with different sets of items, hazards and goal types!<h3>Wig Out!</h3>WigOut Is activated after successfully hitting enough opponents and puts you in a frenzy where you unlock your secret power.<h3>Customization and unlockables</h3>Tired of your old wig? Want a new one to look more sophisticated? You might be thinking “but madam, I don't have a penny to spare for one of them fancy wigs” - no worries, in Wigged Out you earn your wigs just by playing!<h3>Key features</h3><ul><li><strong>Online and Local</strong> 2-4 Players<br/></li><li><strong>6 Characters</strong> with unique abilitys<br/></li><li><strong>100+ arenas</strong> set in 6 different Settings<br/></li><li><strong>25+ items and interactables</strong></li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-04T01:48:43", "background_image": "https://media.rawg.io/media/screenshots/cbd/cbd3fa8b73a02de92acffbd3fa7f1ca6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Encircle Games"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Encircle Games"], "esrb_rating": null}