{"id": 388391, "slug": "petrolhead-paradise", "name": "Petrolhead Paradise", "name_original": "Petrolhead Paradise", "description": "Welcome to Petrolhead Paradise, the digital playground for all car lovers around the world! <br/>Are you ready to sit behind the wheel of many different iconic cars and earn in-game money by speeding and drifting across over 25 environments, even across endless highway roads? Test your skills in over 60 difficult career challenges consisting of Time Attack, Autocross and Drift events.<br/>Show off your driving skills in order to unlock many amazing cars and mods and also play with your friends in an online free roam multiplayer mode or compete with them in multiplayer drag races!<br/><br/><br/>Petrolhead Paradise | FEATURES: <br/><br/>• More than 80 highly detailed cars with realistic handling and engine sounds<br/>• Explore over 25 environments<br/>• Over 60 Career Mode challenges: Time Attack, Autocross and Drift events<br/>• Online Multiplayer Mode (Lobby, friend list and in-game chat included)<br/>• Online Multiplayer Drag Racing<br/>• Car customization: air ride system | multi-colored car underglow kit | multi-colored headlights | multi-colored tire smoke | customizable license plate | gloss, matte and chrome paint colors and wraps | 49 wheel models with nearly 400 color combinations | paintable brake calipers | performance upgrades<br/>• Fully functional headlights, brakelights and signal lights<br/>• In-game music radio <br/>• Racing helmet POV interior view<br/>• Customizable HUD buttons color<br/>• Custom control settings such as: arrows, gyroscope, steering wheel and automatic/manual gearbox<br/>• FREE ROAM Game Mode<br/>• Endless HIGHWAY Game Mode<br/>• Ability to save/synchronize your progress by creating an online account<br/><br/><br/>Stay tuned for more exciting updates and additional content !<br/><br/><br/>ATTENTION : Please note that this app is intended to run on devices with at least 2GB of RAM. However, you can choose to continue playing the game, but we can’t guarantee you a smooth experience or complete functionality of the game. Please upgrade your device if you want to experience the game to it’s full potential.", "metacritic": null, "released": "2019-01-16", "tba": false, "updated": "2019-11-04T02:18:46", "background_image": "https://media.rawg.io/media/screenshots/893/893ed9e85447eab8daca97d6c80ef476.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MPRESIV GAMES"], "genres": ["Simulation", "Racing"], "publishers": ["MPRESIV GAMES"], "esrb_rating": "Everyone 10+"}