{"id": 388346, "slug": "lootcraft", "name": "Lootcraft", "name_original": "Lootcraft", "description": "<strong>Lootcraft</strong> is an action RPG platformer set in a fantasy world where nearly everything can be destroyed and shiny new loot is never far. Explore elemental dungeons while battling adept foes on your quest to discover and craft the rarest loot and become the ultimate hero. Hone your skills as you acquire the strength to finally defeat chaos and restore balance to the world.<br/><br/><ul><li><strong>Explore procedurally generated worlds: </strong> Discover new worlds every time you play. Dungeons, monsters, and loot are always changing for endless fun.<br/></li><li><strong>Battle Unique monsters:</strong> Every monster is different whether it can sprint, fly, or shoot fireballs... possibly all three! You never know what special spells elites and bosses posses so be careful as you battle your way to the final boss.<br/><br/></li><li><strong>Collect Rare Loot:</strong> Loot comes in many different varieties, with the rarest loot providing the most power. Try to collect the best loot in the game to become the strongest hero you can! <br/></li><li><strong>Craft custom items:</strong> Use gems to customize loot with interesting bonuses and effects. Combine gems into more powerful ones as you craft the ultimate loot for your hero. <br/></li><li><strong>Learn powerful spells: </strong>Choose from tons of unique spells to create your own class and define your playstyle.  <br/></li><li><strong>Customize your look:</strong> Use gathered materials to modify the appearance of your hero so you can always look your best. </li></ul><br/><strong>Lootcraft</strong> is being developed by Eric Schmitt, a solo developer trying to make a dream become reality.", "metacritic": null, "released": "2019-11-14", "tba": false, "updated": "2019-11-04T01:57:40", "background_image": "https://media.rawg.io/media/screenshots/bee/bee881af7a5c21206ab0fbc6596ed863.jpg", "website": "https://lootcraftgame.wordpress.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["EricSchmitt"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["EricSchmitt"], "esrb_rating": null}