{"id": 388357, "slug": "dandy-dungeon-legend-of-brave-yamada-2", "name": "Dandy Dungeon - Legend of Brave Yamada", "name_original": "Dandy Dungeon - Legend of Brave Yamada", "description": "<p>One Dandy Man Stands Up...<br />\n...Against Evil<br />\n...For love!<br />\nYamada-kun (Age 36) is a programmer at a major game publisher. He hates his job. Alone in his apartment, deep into the night, he toils to create a game of his own: it&#39;s an RPG, and he is the hero, Brave Yamada!<br />\nOne day, he falls in love at first sight with his new neighbor Maria-chan. In an effort to nurture these feelings, he adds Princess Maria into his game!<br />\nWill Yamada-kun and Maria-chan find love?<br />\nIs destiny pre-programmed, or randomly generated? Is love a bug or a feature?<br />\nFind out in this unique RPG from Onion Games!<br />\nTo clear a floor of a dungeon, use your  mouse or your keyboard and controller to draw a path and guide the Hero from the entrance to the exit.Use healing items and attack or defense spells with proper timing to keep the Hero alive and fighting! Clear all floors of a dungeon to score rare treasure! Clear all floors with a perfect path covering every square and get a perfect bonus! Each 5x5 floor is packed with treasures, traps, monsters, items, secrets and surprises!<br />\nYamada-kun has also implemented a brand-new, mysterious system! It&#39;s a worldwide leaderboard, to determine who is the best Yamada-kun in all parallel universes! Which equipment combination is best to clear each dungeon? There are so many... even we don&#39;t know!<br />\nWe&#39;re relying on you to show off your skills and clear each dungeon with a top score! Do you have the knowledge, wisdom and reflexes to be the world&#39;s top Yamada-kun?<br />\nKeiichi Sugiyama&#39;s unique mix of chiptunes and humming compliments Yamada&#39;s retro-themed world perfectly! He is joined by Enka BOSSA&#39;s founder and singer, Caorinho Fujiwara, who composed the Japanese theme song: &quot;Gyakkou Zinsei&quot; (Life Against the Tide). Mystery singer Nagasa Bonus contributes a smooth voice that flows over the chiptunes of the English version&#39;s theme song: &quot;Retrograde Life&quot;.</p>", "metacritic": null, "released": "2019-06-27", "tba": false, "updated": "2022-08-10T14:41:44", "background_image": "https://media.rawg.io/media/screenshots/843/843ea1443c16e90d21af307a5a903ade.jpg", "website": "http://www.dandydungeon.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 2, "toplay": 1, "playing": 1}, "playtime": 4, "achievements_count": 11, "ratings_count": 3, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS", "PC", "macOS", "Nintendo Switch"], "developers": ["Onion Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Onion Games"], "esrb_rating": "Everyone"}