{"id": 388405, "slug": "sudoku-revival-2", "name": "Sudoku Revival+", "name_original": "Sudoku Revival+", "description": "Play Sudoku Revival+ on your Apple Watch!<br/><br/>Discover the next evolution of Sudoku.<br/>Unlimited free puzzles in varying levels that allow beginners and experts to enjoy each game. A clean, fresh look with sharp graphics.<br/><br/>GAME CENTER<br/><br/>You can now compete against friends and all online players. See your scores, achievements, and rank. It also features a dedicated score board when playing on your Apple Watch.<br/><br/>THEMES<br/><br/>Three gorgeous themes are available so you can chose what better suits your mood.<br/><br/>SMART NOTES<br/><br/>Not sure which number goes in the box yet? Use the note feature (the pencil) to write in multiple options inside the box.<br/>The \"Auto Update Notes\" feature, when activated, will automatically remove previous notes once they are no longer viable options.<br/><br/>CONFLICTS DETECTION<br/><br/>The optional conflict detector tells you when you have entered an incorrect number by highlighting the conflicting boxes in red.<br/><br/>NUMBER VISUALIZATION<br/><br/>Clicking on a given number will automatically highlight all the other numbers to make it easy for you to visually see where they are on the board.<br/><br/>RESUME<br/><br/>You can start any game - from any of the available difficulty levels - and decide to stop and resume later. All your information will be saved and ready for you when you return.<br/><br/>MULTIPLE DIFFICULTY LEVELS<br/><br/>Up to 5 levels of difficulty are available (3 on Apple Watch): Extra Easy, Easy, Medium, Difficult and Evil.<br/>Pick the puzzle that matches your skills!<br/><br/>ADD-ONS (optional in-app purchases)<br/><br/>The Magnifier tool allows you to reveal the number inside the box.<br/><br/>Thanks for playing!", "metacritic": null, "released": "2015-09-21", "tba": false, "updated": "2019-11-04T02:30:43", "background_image": "https://media.rawg.io/media/screenshots/d96/d96f4b1b96465b318ec2d10ac53e452e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arthur Chevalier"], "genres": ["Board Games", "Educational", "Puzzle"], "publishers": ["Arthur Chevalier"], "esrb_rating": "Everyone 10+"}