{"id": 388798, "slug": "wish-you-were-here-nickwedig", "name": "Wish You Were Here (nickwedig)", "name_original": "Wish You Were Here (nickwedig)", "description": "<p><em>Two people cared about each other deeply, until one of them died. But somehow, the living and dead characters can still communicate with each other by sending letters. They don't know how their letters can travel to and from the afterlife, but it doesn't matter. They aren’t going to let go </em><em>of the only connection they still have.</em></p>\n<p><strong><em>Wish You Were Here</em></strong> is a cooperative letter writing and Tarot collection game for two players, about loss and mourning.</p>\n<p>Players will take on the role of two people who cared for each other very much. One of them has died. The two can still send and receive letters from each other, despite one of them being in the afterlife and the other in the living world.</p>\n<p>As players, you will send physical letters back and forth between you and your correspondent. Each player begins with a mixture of the two Tarot decks. Your goal is  or both players to complete their deck of major arcana. As you play, you will try to guess what card inspired the other player's letter. If you guess correctly, then you will receive a card for your deck, getting you closer to your goal. If you guess incorrectly, you will instead receive a card from the other player’s deck, getting you farther away from completing your deck.</p>\n<p>If you and your correspondent are able to complete both decks, you collaborate to create a satisfying conclusion to your character’s stories. But if you make too many incorrect guesses, then communication between the characters will be cut off completely, forever.</p>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-11-04T04:13:05", "background_image": "https://media.rawg.io/media/screenshots/ff9/ff9ca45d604881702c53e6ee9da8ed29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nickwedig"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}