{"id": 388761, "slug": "bliss-cafe", "name": "Bliss Cafe", "name_original": "Bliss Cafe", "description": "What's in the game?\r\n<p>Anzu's previous best friend, Miyu, suddenly shows up after disappearing years ago and she invites Anzu to help in her maid cafe. Anzu sees this as an opportunity to rekindle her friendship with Miyu after having lost her years ago. You see this as an opportunity meet cute girls... and maybe also help Anzu on the side.</p>\n<p>Either way, what could possibly go wrong in a cute maid cafe full of cute girls?<br/></p>\n<p>    Date cute girls [feature not in game yet]</p>\n<p>     Help a shy girl gain more friends</p>\n<p>     Estimated <strong>[<em>redacted</em>]</strong> hours of playing</p>\r\nHow much does it cost?\r\n<p>Bliss Cafe is free to play for the time being. </p>\r\nIs it a full game?\r\n<p>The game is currently in a prototype state. The game was made in a span of a month as a submission for Spooktober 2019 game jam.  However the dev team plan to keep updating the game until it's ready for a full and priced release. </p>\r\nWho made it?\r\n<p>Bliss Cafe was made by a small team of three people lead by Ishy. We wanted to create a project prototype as quickly as we can to warm up our skills and assess our team dynamics. We're really happy with what we accomplished so far. We're excited to see how far we can take the project and what else we can do in the future. </p>\n<p>     Author and Designer - Ishy Socro</p>\n<p>     Background Artist - CJ Socro</p>\n<p>     CG and Composite Artist - Kat Langomez</p>\r\nHow can I help?\r\n<p>We are in the process of opening ways for people to help in the development project. We want people to be help and be involved in the conceptualization of characters, story and world building. Perhaps we'd even take suggestions on characters to involve in the future. If you'd like to keep posted and be one of the people who has a say on the game's direction, just head over to <strong>[<em>redacted</em>]</strong>. </p>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-11-04T04:04:57", "background_image": "https://media.rawg.io/media/screenshots/854/854d68daeed51dcb91b2de3c27b600b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ishy"], "genres": [], "publishers": [], "esrb_rating": null}