{"id": 388750, "slug": "paintball-2048-zx-spectrum-48128k", "name": "PAINTBALL-2048 ZX Spectrum 48/128K", "name_original": "PAINTBALL-2048 ZX Spectrum 48/128K", "description": "<p>Year 2048, the PaintBall competition continues to maintain the original bases.<br/></p>\n<p>But in addition, in recent years new weapons and elements have been introduced, such as;<br/>Mines, missile launchers, keys, invulnerability shields and a service<br/>of sale of items through SCORES.</p>\n<p>So you will have to be skillful and intelligent to win.</p>\n<p>INSTRUCTIONS;</p>\n<p>The game is really designed to be played in 2 Players, which is where it keeps all its essence. But we have also added the option of 1 Player<br/>Survival mode, in case you want to play alone against the machine.</p>\n<p>Mode 2 Players (Complete Game);<br/>Select a Team, and together with your teammates you must get 5 points to win.<br/>To score points, you have to pick up the rival flag or kill all the members<br/>of the opposing team. To do this, you have different paint weapons, and other elements that you<br/>They will help to achieve it. In addition, you must manage the scores in the store to equip yourself as well as possible.<br/>Do not forget to use a strategy and coordinate your movements with your teammates, only then will you achieve victory.</p>\n<p>Mode 1 PLAYER (Survival);<br/>You will be alone against the rival team (the machine), and you will not have the option of catching a flag, you will have to kill EVERYONE !!</p>\n<p>Features;</p>\n<p>2 &amp; 1 Players<br/>2 game modes: Full Version (2 Players) and Survival Version (1 Player)<br/>Several Weapons and Items selectable during the game.<br/>Purchasing Management through Scores.<br/>5 different screens<br/>Several Independent Control Options.</p>\n<p>CONTROL TYPE;</p>\n<p>You can choose different types of control, independently among the Players.<br/>Being able to select between Keyboard, Kempston, Sinclair.</p>\n<p>Keyboards keys;</p>\n<p>Player 1</p>\n<p>Q - Up<br/>A - Down<br/>W - left<br/>E - right<br/>Z - Shooting / Action<br/>D - Right item (Kempston, Sinclair)<br/>S - Item left (Kempston.Sinclair)</p>\n<p>Player 2</p>\n<p>U - up<br/>J - down<br/>I - left<br/>O - right<br/>M - Shooting / Action<br/>L - Right item (Kempston, Sinclair)<br/>K - Item left (Kempston.Sinclair)</p>\n<p>CREDITS;</p>\n<p>To the entire PCNONOGames Team;</p>\n<p>Programation advance; Sergio thEpOpE (the great teacher),<br/>Graphics; Juan Jesús Ligero (J.J)<br/>Music; Sergio Vaquer (Beyker)<br/>Management and Programming; Antonio Román (Nono)<br/>Typography in the Game; Paul Vander Laan<br/>Cover illustration; Javier Díaz González and Matranet.<br/>Tester; Ana Rodríguez, Salvador Román, David Cano. </p>\n<p>Events and Merchandising: Salvador Román y Ana Rodriguez.</p>\n<p> <br/>THANKS;</p>\n<p>Javi Ortiz (delmundodelspectrum), Arnau Jess, Rafa Vico, GreenWebSevilla, Ariel Endaraues and the entire Telegram group that are many!<br/>To the entire ZX-UN team, especially Antonio Villegas, Miguel Ángel (McLeod), Fernando Mosquera for developing the NONOCORE.</p>\n<p>physical edition: http://www.matranet.net/boutique/zx/paintball/paintball.php<br/></p>\n<p>web:  https://www.pcnono.es<br/></p>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-11-04T04:02:17", "background_image": "https://media.rawg.io/media/screenshots/515/515130760b6cdbd9f871fec9706f6b71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PCNONOGames"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}