{"id": 388772, "slug": "sarcophagus", "name": "Sarcophagus", "name_original": "Sarcophagus", "description": "<p>— from the Greek sarx meaning “flesh”, and phagein meaning “to eat”.</p>\n<p>Sarcophagus is a one-man game project in sandbox/survival genre. It’s heavily inspired by the works of Sisyphus and the idea of ennobling power of labor.</p>\n<p>You start your lifespan in a shallow environment of (an allegory of) the cave and slowly work your way to a blooming garden by building and maintaining cave’s ecosystem.</p>\n<p>The game is deceptively empty at first, but make to mistake - you can populate it all by yourself.<br/></p>\n<p>By no means it’s a god sim, food always will be a problem (you must grow what you eat) and you’ll have to face some other human-specific limitations like an overwhelming urge to multitask, a pain of managing priorities, limited inventory space, absence of game’s wiki and author’s inability to communicate in good English.</p>\n<p>The game is more on hardcore’ish/demanding/oldskool side of a spectrum and requires some exploration, learning and adjusting to its quirks.</p>\n<p>It’s not a clone of anything, the purpose of creating the game was not an imitation of things I like but rather playing in a sandbox and looking at the ways things unfold. Sandbox game created as a sandbox project. So meta.</p>\n<p><strong>How to play:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<li>Get Ice Shards.</li><li>Knowledge is power. Inspect everything you can.</li><li>Some items/blocks can be brought to The Machine for useful info and transformations - pay attention to ≈ sign.</li><li>The Machine is your friend.</li>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2019-11-04T04:07:23", "background_image": "https://media.rawg.io/media/screenshots/9b7/9b7468f851b17382be1094d4322e5805.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["acerbial"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}