{"id": 388825, "slug": "spook-em-up", "name": "Spook 'Em Up", "name_original": "Spook 'Em Up", "description": "<p>It's Halloween. The time has finally come for the dead to rise once more, for things to go bump in the night, and for creepy-crawlies to come out of the woodwork. Unfortunately for you, a lone ghost, every other monster has decided to gang up on you for the rest of the night. It's up to you to fight back as long as possible, no treats will be given tonight, only tricks!</p>\n\n<p><em><strong>Spook 'Em Up</strong></em> is a Halloween-themed arcade game, with your sole goal being to survive as long as possible against an endless onslaught of enemies, as well as racking up a highscore to brag about.</p>\n<p>You'll take the role of a ghost, who can't do much on his own. However, if you weaken  an enemy enough, you'll be able to possess them, giving you a new form and a whole new set of abilities! Give these paranormal pests the beating of their (un-)lifetime!</p>\n\n<p><strong>6 spooky and/or scary playable characters!</strong></p>\n\n<p><strong>The Ghost:</strong> Your original form. A bit weak, but gets the job done. Only in this form will you be able to possess your foes...</p>\n<p><strong>The Skeleton:</strong> Toss out bones and bonemerangs to make mincemeat out of your opponents! You can also parry any attacks and counterattack with a good ol' slash to the face.</p>\n<p><strong>The Jack 'O Lantern:</strong> Set the battlefield ablaze with your fiery attacks! If watching the world burn isn't enough for you, you can also plant a pumpkin turret on the ground to deal with enemies you don't feel like fighting yourself.</p>\n<p><strong>The Spider:</strong> This massive arachnid makes quick work of monsters with a vicious bite, as well as leaving behind a deadly trail of venom wherever it goes. The spider can also stop enemies dead in their tracks with a web!</p>\n<p><strong>The Mummy:</strong> Decimate dissenters with your noxious breath, and curse your enemies with your canopic jars! For a coup de gr<strong>â</strong>ce, wrap up weak enemies and hurl them at any unfortunate survivor. For more destruction, wrap up cursed enemies to incur the wrath of the Gods!</p>\n<p><strong>The Vampire:</strong>  Lash out at monsters with your trusty whip, and feed on the blood of your enemies to replenish health! You can also bite the weak to turn them into devout followers, increasing your strength with every new apostle you've acquired. Additionally, you can turn into a bat to get out of sticky situations.</p>\n\n<p>More playable characters, more terrifying new enemies, and more frightening new game modes will arrive eventually... For free!</p>\n\n<p><em>Spook 'Em Up is made by Harry Pollock, with additional art and character designs by Charlie Pollock. Music is composed by James Rodgers.</em></p>\n<p><em>Harry Pollock - Twitter - YouTube</em><br/></p>\n<p><em>Charlie Pollock - YouTube</em></p>\n<p><em>James Rodgers - Twitter</em></p>", "metacritic": null, "released": "2019-10-31", "tba": false, "updated": "2019-11-04T04:19:39", "background_image": "https://media.rawg.io/media/screenshots/8a0/8a0aeac7d62243bfa04156d3919b04cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harry Pollock"], "genres": ["Action"], "publishers": [], "esrb_rating": null}