{"id": 388988, "slug": "duel-on-board", "name": "Duel on Board", "name_original": "Duel on Board", "description": "<h3>AHOY THERE!</h3><br/><br/>Duel on Board is a 1 vs 1 local multiplayer competitive / party game where pirates fight for the precious beer while sailing the dangerous high seas. Just like old school games, you can play with your friend on the same keyboard!<br/><br/>These are the rules of the duel:<br/><br/><ul><li>Reach the center of the ship where the beer is placed.<br/></li><li>Don't get thrown off the ship.</li></ul><br/><br/><br/><h3>JUST LIKE OLD SCHOOL GAMES!</h3><br/><br/>Two players can play on the same keyboard, so no additional controllers are required!<br/><br/>Got an AZERTY keyboard? Have a broken key? <br/>No problem! There will always be the possibility to change them with the rebinding system.<br/><br/><br/><br/><h3>BEWARE!</h3><br/><br/>While sailing the dangerous high seas, you will encounter various locations with events that will change the mechanics and the rules of the game.<br/><br/><ul><li> <strong>Thunderstorm:</strong> Heavy storm ahead! Thunders will strike the ship, use your reflexes to avoid getting stunned by the shockwave.<br/></li><li> <strong>Haunted Seas:</strong> Enter a spooky dimension! A ship graveyard will be the place for epic sword duels between players and ghost pirates.<br/></li><li> <strong>Volcano Strike:</strong> A sleeping volcano has awaken! Lava will start falling from the sky: avoid it at all cost, but also make sure to push the other pirate into the lava.<br/></li><li> <strong>Blizzard:</strong> You are now entering the South Pole and everything is starting to freeze! Be sure to keep on moving to avoid getting frozen.</li></ul><br/><br/><br/><h3>NOT EVERYTHING IS ABOUT THE BEER!</h3><br/><br/>When pirates are not dueling for the beer, they can enjoy some extracurricular activities.<br/><br/><ul><li> <strong>Penalties:</strong> Soccer on a pirate ship! Pirates will take turns to try to score a goal and win the championship.<br/></li><li> <strong>Sword Fight:</strong> Don't become shark food! Use your reflexes to push your way through the ship and throw your opponent off the plank.<br/></li><li> <strong>Ping Pong:</strong> Jumping is not allowed! Become the master of Ping Pong deflecting all the balls that are coming to you.<br/></li><li> <strong>Cannon Dance:</strong> We are under attack! Help each other in order to survive the attack from an enemy ship.</li></ul>", "metacritic": null, "released": "2020-03-17", "tba": false, "updated": "2019-11-08T02:16:42", "background_image": "https://media.rawg.io/media/screenshots/106/1069893085ddd6bd5b907ce9fbaa563a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rebel rabbit"], "genres": ["Action", "Casual", "Indie"], "publishers": ["rebel rabbit"], "esrb_rating": null}