{"id": 388949, "slug": "fearea-battle-royale", "name": "FeArea: Battle Royale", "name_original": "FeArea: Battle Royale", "description": "The battle royale in FeArea: Battle Royale differs dramatically from similar games in its unusual camera layout and heroes: powerful combat robots!<br/> <br/>Take control of a powerful robot, and crush everyone who gets in your way. After landing, you will find real treasures: a sea of weapons and ammunition, unique modules, each of which will help you in battle or after a successful battle. Get ready to fight to the last, until the anomaly destroys everyone on the man-made island. Ready to face the challenge and fight against everyone?<br/><br/> <br/>It’s easy and simple to control the robot: WASD keys, mouse pointing and shooting. In battle, laser light will help you. Powerful technology is on your side!<br/><br/> <br/>A weapon is good, a powerful weapon is wonderful! But not only it is the key to victory. Proper use of modules will allow you to avoid defeat and wrap the situation in your favor. To trap the enemy, to heal after the battle, or to sneak up unnoticed? Easy, and that's not all!<br/><br/> <br/>The battle arena is a huge island whose techno-beauty can captivate. But be careful: the technosphere can be dangerous even for a huge combat vehicle. Spilled waste will easily damage your robot. And also, according to rumors, a terrible cybernetic worm lives here somewhere. Believe me, he should not be caught.<br/><br/> <br/>Of course, you can play with an ordinary robot. But if you are confident enough in yourself, then you can change the look, take a car of a different kind. Let the enemies be surprised, this will stop them for a moment, and you will be able to strike first. Almost certainly!<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-08T01:56:02", "background_image": "https://media.rawg.io/media/screenshots/cb4/cb4826dcaf0fea607d658964d6d75f3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["MUVGAMES"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["MUVGAMES"], "esrb_rating": null}