{"id": 388987, "slug": "buzludzha-vr", "name": "Buzludzha VR", "name_original": "Buzludzha VR", "description": "<h3>Explore the abandoned legend In VR</h3><br/>Buzludzha VR is an unguided, virtual reality experience based on the environment of the abandoned Buzludzha monument. Learn interesting facts about the controversial past of the UFO-shaped structure as you reveal and discover artifacts hidden throughout this digitally reimagined and repurposed version of the monument.<br/><br/>Sense the scale of the structure and take in the atmosphere of the surrounding landscape. Immerse yourself with playful interactions such as the fully-interactive grand piano, flying around the monument, juggling with muffins or climbing the 70m high tower; Buzludzha VR offers all of the above and more to keep you engaged. <br/><br/>Developed by a team of two, Buzludzha VR aims to provide a unique location-based experience that both educates and entertains, and is accessible to both VR veterans and VR newcomers.<h3>Buz-what?</h3><strong>booz-woo-jah [bu:zwu:dʒɑ:]</strong><br/><br/>Situated on top of a mountain over 1400 meters above sea level, the Buzludzha monument is like something out of a science fiction movie. This UFO-shaped structure was built in the 1970s to commemorate the 90th anniversary of the founding of Bulgaria's Social Democratic party. After 7 difficult years of construction, the monument was officially opened to the public in August 1981. For the next 8 years, it was used as the headquarters of the communist party. <br/><br/>However, in November 1989 Bulgaria ceased to be a Communist State and the building was promptly closed down. After years of disuse and with no further maintenance, the abandoned structure began to quickly deteriorate and suffer from acts of vandalism.<br/>Thanks to the building’s unusual design and unique location, it did not take long for Buzludzha to become one of Europe’s most iconic abandoned sites. It continuously attracts urban explorers from all around the world.", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-08T02:16:16", "background_image": "https://media.rawg.io/media/screenshots/fcc/fcc5dd0647d1e10add62c4189e088462.jpg", "website": "https://buzludzhavr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Augmade"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Augmade"], "esrb_rating": null}