{"id": 389010, "slug": "hu-nolu-lu", "name": "狐の旅路", "name_original": "狐の旅路", "description": "Shirakami Fubuki is a virtual fox girl endorsed by hololive. One day, her friend, Natsuiro Matsuri, asked her to come to play a tabletop role-playing game with other hololive members. However, the game turned into reality, Fubuki and her friend being involved in a different world and losing their memories. She needs to find her memory, discover the truth of the world, and lead her friend back to the original world.<br/><br/>This game is a fangame based on the virtual Youtuber of hololive. The game has a story flow for about one hour, with certain decryption and exploration elements. This work mainly faces the fans of hololive, so there are a lot of NETA and memes in the game.<h3>character</h3><h3>Shirakami Fubuki</h3><br/>A virtual female high school girl with white hair and fox ears.  <br/>Although she claims to be a fox, she often meows unconsciously.<br/><h3>Natsuiro Matsuri</h3><br/>Virtual high school students who are the friend with Fubuki. She has a special interest in girls.<br/><h3>Ookami Mio</h3><br/>The girl with black hair, wolf ear. She is a childhood sweetheart of Fubuki. She is reliable as a companion, but she is very timid.<br/><h3>Minato Aqua</h3><br/>Virtual maid wear in a Navy maid's uniform. She has been working hard but she is very bold.<br/><h3>Nakiri Ayame</h3><br/>She is a Japanese ghost, who has a delicate girlish heart.<br/><h3>Oozora Subaru</h3><br/>A Virtual manager of the virtual sports department. She is hard-working, and often to encourage companions with her vitality and enthusiasm. It has a good relationship with Ayame.<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-08T02:27:11", "background_image": "https://media.rawg.io/media/screenshots/a1a/a1a3405d7a9207f3f0c283fcc1776c80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["狐の旅路制作组"], "genres": ["RPG", "Indie"], "publishers": ["DZ"], "esrb_rating": null}