{"id": 389071, "slug": "virtual-super-granny-3d-game", "name": "Virtual Super Granny 3D Game", "name_original": "Virtual Super Granny 3D Game", "description": "We should have a fabulous time in the virtual families and carry on with an upbeat satisfying life as the glad granny, not as an awful granny. Mess around with the glad family and genuine family also. Experience the job of the super granny in the virtual house and see the family fun experience and super father glad family and furthermore appreciate the mid-year employments as a cheerful family summer occasions. Come into a different universe of glad house and family test system. Get a lifetime experience as the virtual super granny and super father glad family and mother test system! Download this grandma game now and play the game. Be an upbeat granny family fun experience! <br/><br/>Overly cheerful granny and virtual granny life test system glad family game have an upbeat family who lives in the virtual house. Granny is prepared to carry out her responsibilities as her child and the little girl is setting off to the play area alongside his superfamily man and family fun page. Presently, granny is distant from everyone else with her grandkids. She thinks about the obligations she needs to satisfy in this virtual house. She needs to awaken the children with the goal that they can go to the school on schedule. Make the morning meal for them and feed them appropriately.<br/><br/>The component of Virtual Super Granny 3D Game : <br/><br/>- Amazing 3D designs and cool family stories interactivity <br/><br/>- Cool highlights of family exercises and fun test system interactivity. <br/><br/>- It is a mix of virtual mother games and Virtual father Games. <br/><br/>- Realistic family fun life reproduction as a virtual grandmother. <br/><br/>- Learn to associate among your neighbor in day by day virtual life <br/><br/>- Interesting undertaking and family fun missions <br/><br/>- One of the best pretending games <br/><br/>- Various missions to demonstrate a Super Dad Family.", "metacritic": null, "released": "2019-11-07", "tba": false, "updated": "2019-11-08T03:03:21", "background_image": "https://media.rawg.io/media/screenshots/432/432c7c6a3ded54e3d5df405ebc088b93_DC7gugA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zafar Hayyat Khan"], "genres": ["Adventure", "Simulation"], "publishers": ["Zafar Hayyat Khan"], "esrb_rating": "Everyone 10+"}