{"id": 389069, "slug": "little-dentist-hospital-game", "name": "Little Dentist - Hospital Game", "name_original": "Little Dentist - Hospital Game", "description": "This is a fun and interesting dentist game. If you want to be a dentist doctor, this is a best game for you. In this dentist game, you will cure the teeth of your little patients. Be careful and make use of the right tools. <br/>Besides being as a doctor, you can also join the hospital, ear doctor to help patients. They need your help. Do you love animal and baby? You can also help taking care of animals and babies.<br/><br/>***************************************************<br/>Dentist MiniGame Feature:<br/>*pull out bad teeth and replace with heathly teeth<br/>*Take picture after everything is done<br/>*put on color and stamp on teeth with your favorite design<br/>*Each patient requires some special tools for specific dental operation, choose the right one<br/>*Take picture after everything is done<br/>*put brace on to align teeth perfectly<br/>*polish teeth to remove tartar<br/>*examine teeth with X-Ray<br/>*make sure replace with teeth align with the adjacent one<br/>*remove food stuck using picks<br/>*remove food stuck using picks<br/>*Remove and treat wounds<br/>*Brush teeth until they are shiny and white<br/>*Killing bacteria in throat<br/>*step by step guide to show where to work on in the clients mouth<br/><br/>***************************************************<br/>Hospital Mini MiniGame<br/>In this game, you are acting as a doctor. Your patient have different kind of sickness need your help. Including injuries in their feet, headache, stomache pain. Diagnose, treat and cure your patients quickly to nurse them back to health.<br/>Enjoy playing doctor mini games that include setting up an infusion, treating a burn, dressing a bandage, getting rid of earwax, making pills, measuring blood pressure and pulse. <br/><br/>***************************************************<br/>Animal Care MiniGame<br/>Animal Care Salon is a pet caring game.<br/>In this game you have to take good care for cute animals, including dogs, cats, rabbit and monkey. Different animal need different treatment, make sure they are happy and enjoy the time being in animal care salon. <br/><br/>Features:<br/>• Washing the Pet - Grab the sponge and some shampoo to clean the dirty pets<br/>• Feeding the Pet - Your pet is hungry, feed them with their favorite milk and corns<br/>• Nail Polishing - Nails of your pet is peeling, you can polish and cut nail for them, also remember to paint them beautifully<br/>• Dentist - Eating too much candy? Your pet needs to have teeth checkup. Fix the teeth for your favorite pet<br/>• Doctor - What is going wrong, let pet doctor have a body check for your lovely pet <br/>• Healing - Your pet is sting by mosquitos, help them to heal the wounds<br/><br/>***************************************************<br/>Baby Sitter MiniGame<br/>This is a babysitter game. Do you want to take care of baby? Can you be a good babysitter?<br/>Let's learn how to take care of baby.<br/>In this game, you have to feed, bath, change diaper, and also play with the baby.<br/>Help the babysitter to take care of the baby !<br/><br/>Babysitter Baby Care is simple and fun : <br/>* bathe the baby, she is very dirty <br/>* the baby is sick, apply the cream and change the diaper <br/>* dress up the baby <br/>* the baby is hungry let's feed her<br/>* give the baby food, and let her drink with bottle feeding<br/>* baby wants to play, give her some toys<br/>* play with ball, pyramid toy, toy car, a coloring book or a rocking horse<br/>* the baby wants to sleep in the cradle, lull the baby until she falls asleep<br/><br/>***************************************************<br/>Ear Doctor MiniGame<br/>You are an ear doctor and you can help your cute clients to cure their sickness in their ears.<br/><br/>Choose the best tools to treat the ears of your clients. Be professional!  Add medical tools like stethoscopes, doctor bags and x-rays. Then head to the hospital to take care of your patients. <br/><br/>Features: <br/><br/>* spray ear with water to clean dirts<br/>* kill gems with stethoscopes<br/>* take x-rays <br/>* remove and treat wounds<br/>* remove items stuck in ears<br/>* Create your own medical style<br/>* Help your patients in this fun medical game", "metacritic": null, "released": "2019-09-29", "tba": false, "updated": "2019-11-08T03:02:38", "background_image": "https://media.rawg.io/media/screenshots/a2e/a2e6dbef4022a93b91dc3427253beb57_QwabHJv.jpg", "website": "http://www.ashleytech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kwan Shum"], "genres": ["Simulation"], "publishers": ["Kwan Shum"], "esrb_rating": "Everyone 10+"}