{"id": 389021, "slug": "survive-together", "name": "Survive Together", "name_original": "Survive Together", "description": "Survive Together is a 2D world simulator where players are thrown into the many perils of nature, and together, overcome them to build a thriving empire. <br/><br/>Please keep in mind that the game is in very early development and the below is subject to change.<h3>The World</h3><br/>The game takes place primarily on a large island world which currently contains three different biomes, separated by geographic location. The continent is surrounded by water, and if you make it beyond that you can reach the abyss of space. Each biome will behave differently, for example grass won't spawn in the arctic, and gold ore deposits won't exist in the grasslands. Temperature, weather effects, player attributes, etc will change based on biome as well. For example, your thirst meter will drop much faster in the desert than in the grasslands or arctic.<h3>The Modes</h3><br/>At launch we'll have four different game modes to choose from. <br/><br/>Creative mode...will be a world where hunger, thirst, rest, age, etc will not be the death of your character. You can live forever and freely go about building a civilization without concern. This will appeal to those who want to focus more on the building, crafting and community aspects of the game.<br/><br/>Casual mode...will be a world where hunger, thirst, rest will not kill your character, but it will hinder your character's movement speed. You can still die from age, attack, etc but you'll have more time, take less damage, etc than in the normal mode. This mode will also not feature any player versus player combat (only NPC tribe and animal combat).<br/><br/>Normal mode...This will be what the world was meant to be. If you don't eat enough, you'll lose health and die. If you don't drink enough, you'll lose health and die. It's a harsher version of casual mode. Hunger, thirsty, rest, etc will drain faster, you'll age quicker. This mode will also allow developed civilizations to wage wars on other developed civilizations. <br/><br/>Hardcore mode...This mode will be for the most daring of players. It will be a real struggle to stay alive against nature, but there will also be a challenging enemy NPC tribe that you need to destroy to win. You or them, who will survive?<h3>Multiplayer</h3><br/>Besides playing single-player, you can also play online. We'll have official servers to log into, as well as provide users with the ability to host their own private servers to share with friends. Everything takes place on the host process and is shared to the clients once confirmed, so cheating should be impossible unless done by the host. There's also an option to host a server without playing the game in the event that you want to set up a dedicated server.<br/><br/>Besides other players in the game, optionally a game or server can utilize NPC players. This can be set to have outsider NPCs only (From other tribes), NPC fellow villagers only, both or none. Eventually this can be dynamic (for example, if more players join a server, you can have it not spawn as many NPCs so that populations balance out).<h3>Plans</h3><br/>The current goal is to create a game capable of hosting minature worlds where players can spend hundreds of hours building, cooperating, conquering, etc. But there are some specific features that are expected for the final version:<br/><br/>Items...there will be thousands of items in the game, and most of them stackable to as many quantities that can fit on a tile. Food, tools, materials, clothes, among many others.<br/><br/>Customizations...there will be character customizations to make each player look unique. Skin tone, hair style, eye color, etc (other humanoids will have more options).<br/><br/>Cultures...depending on where a civilization lives (arctic, grasslands, desert, etc) it will build up using different cultural standards. For example, the arctic will likely have more buildings constructed from arc blocks, whereas the grasslands will have more huts and grass based dwellings.<br/><br/>Professions...when a new civilization emerges, someone is selected to be the leader of the tribe. That role gets passed down upon death or resignation to the next highest scored player (score will be based on how useful you are to the civilization). The leader can elect specific roles (such as a town baker) which can then have access to advanced abilities (the baker for example will be able to make pies, an advanced food that offers bonuses). Roles can be passed on by the person with the role, but the leader can always overrule those decisions and appoint the role to another.<br/><br/>Caves...there will be instanced cave systems where players can venture for mining, hunting, or maybe even establishing a secret base?<br/><br/>Magic...eventually the people will discover the secrets of the mana force, and manipulate it's energy to manifest the impossible.<br/><br/>The hope is to also take in feedback from the community and to add the most popular ideas into the game. If you have an idea that you and others might like, suggest it!", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-08T02:32:20", "background_image": "https://media.rawg.io/media/screenshots/dc3/dc3b90cb80dbaab620299e30fbe95ad0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeck"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Jeck"], "esrb_rating": null}