{"id": 389028, "slug": "exophobia", "name": "Exophobia", "name_original": "Exophobia", "description": "<p>Exophobia is a retro-inspired first person shooter with fast-paced combat. You wake up to find yourself alone in a spaceship infested with hostile alien soldiers. Explore your surroundings while you uncover piece by piece the backstory and destiny of its human inhabitants. Shoot, dash, stun your enemies and more, in your path to survive!KILLFPS action where fast reflexes and clever positioning are key. Learn enemy behavior and use all your movement options and your surroundings to eliminate diverse groups of alien armies as fast as possible or before they kill you.EXPLOREDiscover a labyrinthine spaceship with multiple floors and uncover the past events that led to this high-stakes moment. Get lost in hostile environments while doing your best to survive. Progress through the game by saving your progress at specialized checkpoint rooms.UPGRADEIf you find a specialized room, you can improve your weapon with new abilities. These drastically change your combat tactics and can be used to open up new areas in the spaceship to explore.DIERuthless difficulty with diverse combat situations with different enemy types and attack patterns, including menacing bosses. When you die, you respawn in the last visited checkpoint in the spaceship.</p>", "metacritic": null, "released": "2021-10-05", "tba": false, "updated": "2021-09-30T14:25:11", "background_image": "https://media.rawg.io/media/screenshots/9ce/9ce5ec331d80213dd26800d81eeac277.jpg", "website": "http://cargocollective.com/jccc/Exophobia", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Zarc Attack"], "genres": ["Action", "Indie"], "publishers": ["PM Studios", "Zarc Attack"], "esrb_rating": null}