{"id": 389077, "slug": "freddi-fish-3-conch-shell", "name": "Freddi Fish 3: Conch Shell", "name_original": "Freddi Fish 3: Conch Shell", "description": "Freddi Fish 3: The Case of the Stolen Conch Shell<br/><br/>Freddi and Luther have arrived at the Founder’s day festival but the celebrations have come to a halt because Luther’s Uncle Blenny, the Grand Exalted Keeper of the Conch, stands accused for it’s disappearance. <br/><br/>Who is the real culprit? Dive into another case with our favorite Junior Detectives are we solve the Case of the stolen Conch Shell. <br/><br/>—User Reviews— <br/><br/>“This is a superb beginning computer game for ages 4 to 8. A lot of thinking (outside the box!), problem-solving and decision-making.” <br/><br/>“This game is one of our favorite Humongous games. It is challenging, yet fun. Once you solve the mystery, they will change the locations of the items that you have to find, so it’s not mundane.”<br/><br/>FEATURES:<br/>• Explore the underwater festival as Freddi and Luther in a title that changes at the start of each new game, giving a fresh new experience each time.<br/>• Every location is filled with wonders, a touch and who knows what will appear, with over 500 secret touchscreen points there’s a new surprise every time you play.<br/>• Fun music mini-games keep things lively for you and your child.<br/>• Many new characters to interact with.<br/><br/>This product uses ScummVM which is released under the GNU GPL v2. <br/>For more information, please visit - https://www.scummvm.org <br/>The GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html", "metacritic": null, "released": "2012-03-30", "tba": false, "updated": "2019-11-08T03:05:30", "background_image": "https://media.rawg.io/media/screenshots/40d/40d6b8632e048327e9b694bfb7df209d_746H9L8.jpg", "website": "http://www.humongous.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 15, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Humongous Entertainment"], "genres": ["Adventure", "Educational"], "publishers": ["Tommo"], "esrb_rating": "Everyone 10+"}