{"id": 389065, "slug": "zombie-land-rush", "name": "Zombie Land Rush", "name_original": "Zombie Land Rush", "description": "Can you save all the survivors on this great hyper casual game?<br/><br/>- Drive your way through apocalypse. <br/>- Fire your guns and kill all in your path. <br/>- Avoid post apocalypse obstacle. <br/>- Save the survivors and collect spare parts!<br/><br/>Fun Rush Master allows you to choose your car and upgrade it. <br/>Kill all in your way, gather as many coins as you can, and upgrade your ride in this amazing game!<br/><br/>Features:<br/>-\tLots of crowd killing fun.<br/>-\tGreat cars and weapons. <br/>-\tSerious Road trip!<br/>-\tAddictive gameplay<br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/><br/>In Zombie Land Rush game we offer you the following subscription option:<br/><br/>Weekly VIP Membership offers a weekly subscription for $7.99 after a 3-day free trial. It unlocks unique vip character, 200% daily reward and remove ads.<br/>End of trial period and subscription renewal<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/><br/>Canceling trial period or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want in the settings if your iTunes account. Check https://support.apple.com/HT202039.<br/><br/>When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option.<br/><br/><br/>If you have any questions or comments, feel free to contact us at greenbuttongames@gmai.com<br/><br/><br/>Privacy Policy: http://greenbuttongames.com/policy<br/><br/>Terms of Use: http://greenbuttongames.com/termofuse", "metacritic": null, "released": "2019-10-19", "tba": false, "updated": "2019-11-08T03:00:58", "background_image": "https://media.rawg.io/media/screenshots/665/665873578b7bb4cb37112a5604b54480.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Plavalaguna"], "genres": ["Action", "Racing"], "publishers": ["PLAVALAGUNA, OOO"], "esrb_rating": "Everyone 10+"}