{"id": 389008, "slug": "hayfever", "name": "Hayfever", "name_original": "Hayfever", "description": "Help Thomas the allergic mailman gather all his lost letters! In Hayfever, the player takes control of Thomas; a young postman with a strong sense of pride in his work. There is just one tiny little issue; Thomas suffers from terrible (and we mean TERRIBLE) allergies. <br/>\n<br/>\r\nHis allergies are so strong in fact, that when Thomas was delivering his daily mail, disaster struck. A massive sneeze sent Thomas flying, and in the process, he lost all his letters! Thomas’ boss Harvey is an ill-tempered little monster of a man. And it is up to the player to help Thomas avoid his wrath by collecting all his lost mail. Together with his friend Carlie, Thomas will venture on an epic journey that spans the entire year, taking him through each of the four seasons. <br/>\n<br/>\r\nIt is up to the player to use his allergies to help him traverse the dangerous world, turning Thomas’ weaknesses into strengths! Different allergens have different effects on Thomas - radically changing how he interacts with the world. <br/>\r\nRegular pollen allows him to build up a big sneeze to propel himself through the air. Smog, on the other hand, makes him swell up like a balloon. Peanuts… Well, peanuts are a WHOLE other story. <br/>\n<br/>\r\nFeatures: <br/>\n<br/>\r\nDemanding, Sneeze-Driven Mechanics<br/>\n<br/>\r\nFour worlds, spanning each of the year’s seasons (there might be a secret world as well… Just saying)<br/>\n<br/>\r\n140 Challenging Levels, 240 Collectibles <br/>\n<br/>\r\nAllergy-Fueled Gameplay ranging from Pollen &amp; Smog to Nuts! <br/>\n<br/>\r\nAn A.M.A.Z.I.N.G soundtrack", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2020-12-16T14:07:26", "background_image": "https://media.rawg.io/media/screenshots/d4e/d4ea1e7b71c10b26a6fb0257c9a55764.jpg", "website": "http://www.hayfevergame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17, "toplay": 1}, "playtime": 1, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One", "PC", "Nintendo Switch"], "developers": ["Pixadome"], "genres": ["Adventure", "Indie"], "publishers": ["Zordix", "Zordix Publishing"], "esrb_rating": "Everyone"}