{"id": 3891, "slug": "orc-attack-flatulent-rebellion", "name": "Orc Attack: Flatulent Rebellion", "name_original": "Orc Attack: Flatulent Rebellion", "description": "Fart or die in this hack-and-slash action game, where fun-loving Orcs battle pollution loving Humans in a humorous fantasy setting. Orcs have become victims of brutal Human expansion, as they are carelessly poisoning the environment. Now, four trained Orc heroes are retaliating with a Not-So-Silent yet very deadly plan. In either single-player or up to four-player co-op, you will take on the role of Orcs, each wielding a unique gaseous ability, and then take the fight to the Humans in a stinky, fart-filled romp. Hilarious enemies and highly tuned combat make for a joyous experience that really is worth sharing. While the comedic storyline and the striking 3D world make it even more memorable. Gross but charming protagonists add the final flourish with flatulent group attacks and nasty killer moves for up to four players.<br/><br/><strong>Key Features</strong><br/><ul><li>Cooperative combat and dirty mode reward players for working together.<br/></li><li>Four player local and online multiplayer.<br/></li><li>Four campaigns comprise 25 epic missions.<br/></li><li>30+ enemies types including bosses<br/></li><li>Raid, pillage, and plunder human camps, collect gold to buy improved weapons and armor.<br/></li><li>Set free the orc prisoners to add them to your horde<br/></li><li>Play as any of the 8 Orc warriors.</li></ul>", "metacritic": null, "released": "2013-10-08", "tba": false, "updated": "2022-09-29T23:00:50", "background_image": "https://media.rawg.io/media/screenshots/dee/dee7ca09e189e63062a3af3101c274d4.jpg", "website": "http://www.orcattack.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 112}, "playtime": 1, "achievements_count": 14, "ratings_count": 2, "suggestions_count": 582, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 3", "PC"], "developers": ["Casual Brothers"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Reverb"], "esrb_rating": "Teen"}