{"id": 3895, "slug": "diediedie", "name": "Die!Die!Die!", "name_original": "Die!Die!Die!", "description": "Compatible with PlayStation®Vita system only.<br/>Gameplay requires PlayStation®Vita system card (sold separately).<br/>Deep within the body  malicious microbes hatch a plot on how to best disrupt the workings of the immune system.<br/>Using your PlayStation®Vita system you can now travel deep within the human body. The journey will take you through the circulatory system, through the intestines, and to the nervous system. It will require of you not only efficiency, but also the ability to devise suitable tactics.<br/>Some seem cute, others seem weak - but this is all a ruse to mask their true identities. They are quick and cunning, and those that are slow are often the most difficult to eliminate. In the beginning, vanquishing them is deceptively easy - only for them to strike back twice as hard.<br/>Remember - not every medicine works on every microbe. Besides the syringe, you also have a hidden weapon in the form of the powerups. Either alone or together with your friends... make the intruders Die!Die!Die!<br/><br/>1-4 player(s)<br/>Network Features<br/>5120KB Minimum<br/>Touchscreen<br/>Dual Analog Sticks<br/>Front Camera<br/><br/>  Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.<br/><br/>(C) iFun4all sp. z o. o. 2013", "metacritic": null, "released": "2013-10-01", "tba": false, "updated": "2019-08-02T16:21:08", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PS Vita"], "developers": ["iFun4all"], "genres": ["Shooter"], "publishers": [], "esrb_rating": "Everyone 10+"}