{"id": 389614, "slug": "idle-chess-grandmaster", "name": "Idle Chess Grandmaster", "name_original": "Idle Chess Grandmaster", "description": "<p>😂 Virginity Gauntlets! An old legend has it that there are two Virginity Gauntlets, with 6 Virginity Stones for each. The one who gets at least one Gauntlet will be imbued with an immense Chess Power and become close to invincible!! 😎<br/><br/>That is what the Black King did. That is what our Main Hero did not know of. When he got to the Chess Top and fought the Black King, the latter had to use the ‘Gauntlet Cumming’ skill and one of the Gauntlets exploded. A burst so strong threw our Hero down to the very Chess Bottom. The blown-up Gauntlet was given to the Hero, and the 6 Virginity Stones were lost across the Universe. That is how the Gauntlet Cumming works according to the Legend (or simply to the chessopedia).<br/><br/>Now the Hero has to find all the 6 Virginity Stones and recompose his Virginity Gauntlet, then get to the Chess Top and do battle with the Black King! 😎<br/><br/>Idle Chess Grandmaster - a parody game.<br/><br/>🔥 GAME FEATURES: 🔥<br/><br/>★ SIMPLE GAMEPLAY! All you need is tap! Chess is simple! Tapping will help you become the best player in the world sooner. Clicker? Tapper? Idle? Tycoon? Call such games whatever you want. The important thing is that you don't need to be in the game all the time, because your progress will automatically continue even when you're not. Of course, you will have to come back to beat the toughest enemies! You're going to easily become the game master!<br/><br/>★ COOL STORYLINE! The game has a unique and enjoyable plot and funny characters (good and evil)! The storyline consists of parodies or references to various popular stories from movies, TV series, games etc. As you go through the game, you'll be accompanied by your true friends - a girl, Max, and her friend Nick. To be honest, they're geeks. But this is even useful - they know everything about board games, videogames and various sophisticated stuff! Of course, they know everything about chess, too! The story will unfurl slowly and steadily.<br/><br/>★ FUNNY CHARACTERS! The game characters are travesties of famous persons or memes, fictional characters or simply are a fantasy of the developers. Every simple detail is so funny! And they all play chess! I wonder if you can beat them all? Play and try!<br/><br/>★ LEAGUE PROMOTION! You'll have to move up from league to league. You're not going to become the smartest person in the universe just for a thank you, are you? The gameplay is simple, but you will need tenacity to reach your own goals! Go through 5 leagues: Bronze, Silver, Gold, Diamond and Master. Fight, get to the last league and become best of the best!<br/><br/>★ UPGRADE YOURSELF! As you go through the game, you may upgrade your improvements. Choose what is more important to you right now - Ingenuity or Income? And don't forget the Intelligence. Make a choice, upgrade a skill and move on! Invest the money you get from chess battles into self-building. Anyone who has ever played chess knows that constant self-development is the most important thing! You are like a tycoon managing yourself. Never stop upgrading yourself!<br/><br/>😎 Join the game and become the best Chess Master in the Universe! Chess is simple and fun! 😎<br/><br/>❤️ Follow us on social media:<br/>Facebook: https://www.facebook.com/andrewigames.idlechess/<br/><br/>If you have any questions, contact us at: support@andrewigames.com</p>", "metacritic": null, "released": "2019-11-04", "tba": false, "updated": "2019-11-08T05:24:27", "background_image": "https://media.rawg.io/media/screenshots/ff2/ff2181a1ffd8d8e405f0fc12dc00ae40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrewi Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}