{"id": 389696, "slug": "mars-power-industries", "name": "Mars Power Industries", "name_original": "Mars Power Industries", "description": "<p><strong>We made this game for Global Game Jam 2018 and steadily polished it up for full release!</strong></p>\n<p>Tell us what you think on our discord server: https://discord.gg/hcWWBd2<br/>Support us by buying the DELUXE edition - https://store.steampowered.com/app/977230/Mars_Power_Industries_Deluxe/</p>\n<p><strong>All puzzles can be solved in 5 moves or less!</strong></p>\n<p>\"Congratulations on your first tiny colony!<br/> Taking the post of Plumber/Electrician must be tough out there, we know how lonely it might get and you probably miss your family. </p>\n<p>Don’t worry! We provide music. No silence in space. Studies show employees exhibit high degree of stress when surrounded by silence, so it is to be avoided. The pleasant soothing sounds of distant synth music will calm you right away… and continue calming you through the years… Imagine a spaceship slowly moving through endless black pudding, with no one on board but you and the lights. But the lights are broken. That's the point – please fix the lights!\"</p>\n<p>Set up power plants and supply power to your colony. Take your time and use strategy to get things up and running in proper order. Overcome obstacles the red planet throws your way and uncover an extraterrestrial mystery!<br/></p>", "metacritic": null, "released": "2019-11-04", "tba": false, "updated": "2019-11-19T17:52:14", "background_image": "https://media.rawg.io/media/screenshots/972/972bc6c4f9c94f2fa51fbe3c8d8f2b15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 3, "platforms": ["Web", "Nintendo Switch"], "developers": ["7A Games", "Rarykos"], "genres": ["Puzzle"], "publishers": ["SONKA"], "esrb_rating": "Everyone"}