{"id": 389725, "slug": "the-reserve", "name": "The Reserve", "name_original": "The Reserve", "description": "<p>You are in charge of maintaining a natural reserve inhabited by rabbits and wolves.</p>\n<p>Your job is to modify the environment in such a way that no species ever takes over the other completely. </p>\n<p>During the preparation stage, you can place one of these 4 tiles:</p>\n<p>-- Grass: It's what rabbits eat. When a rabbit finds some grass, it will stop for some seconds to eat.</p>\n<p>-- Bush: A place where a rabbit can hide if it hears a wolf incoming. Every bush can host only one rabbit.</p>\n<p>-- Trap: If a wolf steps over a trap, it is killed instantly. One trap can only kill one wolf.</p>\n<p>-- Rock: Rocks limit the vision of the wolves.</p>\n<p>After the preparation stage, the animals enter the reserve and interact with each other.</p>\n<p>-- If two animals of the same species meet, they mate and the next day a new animal of that species will be born, with characteristic parly inherited from the parents and partly random.</p>\n<p>-- If a wolf sees a rabbits, it will chase it and, upon contact, eat it.</p>\n<p>-- If a rabbit hears a wolf, it will try to hide in the nearest bush.</p>\n<p>-- If an animal does not eat, it will not survive until the next day.</p>\n<p>###### DISCLAIMER #########</p>\n<p>This game was made for Mini Game Jam 40: Hunters.</p>\n<p>It could be considered a super early prototype or a proof of concept, which I think has potential to be expanded and worked upon :)</p>\n\n<p>### THANK YOU FOR PLAYING &lt;3 ###</p>\n<p>(Props to opengameart.com for the graphics)</p>", "metacritic": null, "released": "2019-11-04", "tba": false, "updated": "2019-11-08T05:54:44", "background_image": "https://media.rawg.io/media/screenshots/401/4015a43646b0fdadf0f132d1d3325e37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gooplancton"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}