{"id": 389794, "slug": "double-gun-attack-of-the-fire-hydrants-pre-alpha", "name": "Double Gun - Attack of the Fire Hydrants (Pre Alpha)", "name_original": "Double Gun - Attack of the Fire Hydrants (Pre Alpha)", "description": "<p>It's First-Person Shooter where the player must defeat the evil fire hydrants to win. You spawn in on a map where many Evil Fire Hydrants have taken over. And when you appear, all of them turn to attack you. You see, a once peaceful AI unit named Vars has turned evil, believing that all humans should serve Robots. So, he sent his agents to take over all the world's fire hydrants, turning them desperately evil, and causing them to enslave mankind. And most were defeated, but some humans like yourself went into hiding, resisting this evil force. Well, that's it for the story, and it should get more complex over time. In the game, if a Fire Hydrant touches you or your gun, you die. So be sure to keep them at a distance, while staying close enough to hit them.<br/></p>\n<p>You must destroy all hydrants on the map to win, so shoot at one until it disappears. Some Fire Hydrants must take several hits before breaking, while others may take only one. When you are fighting one, be sure to be on the look out for others, as getting attacked from behind is a easy way to die. Once you have destroyed all the Fire Hydrants on the map, then by the game rules you win. There will be no message in the game to tell you though, as it will let you explore the rest of the map after you win. There are buildings, trees, rocks, platforms, and other structures that you can use to your advantage. The game is still being developed, and there are still some bugs, and new features are still to be added. Finally, I hope you enjoy the game. Feel free to donate on itch.io as this helps me out a ton, and let's me spend more time<br/>on development of my games. Also, feel free to follow me on itch.io or on YouTube to get updates.<br/><br/></p>\n<p>Anyway, thank you for downloading and I hope you Enjoy!</p>\n<p>WASD to move. Move mouse to look around. Left-click to shoot. Space bar to jump. Esc to Quit. On the main menu, press space to start game. I recommend that you use a mouse.</p>\n<p><em>(Note: If you download, in the Manual there will be tips for winning the game).</em></p>", "metacritic": null, "released": "2019-11-03", "tba": false, "updated": "2019-11-08T06:11:54", "background_image": "https://media.rawg.io/media/screenshots/657/657103eff80f1439b6235a02b0b96fe1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alpha King"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}