{"id": 389824, "slug": "war-room", "name": "War Room", "name_original": "War Room", "description": "Become a commander of US Army! Conquer, patrol, and secure a region of over 1000 km2. Not only focus on your results, but also take care of health and morale of your soldiers, as well as safety of civilians. Evacuate wounded troops, direct air support and hunt terrorists!<br/><br/><strong>REALISTIC FIELD OF BATTLE</strong><br/><br/><br/>Soldiers and their enemies will not only fight until death.<br/>Wounded they call for backup, pinned down - retreat. They value their lives.<br/><br/><strong>BECOME A COMMANDER</strong><br/><br/><br/>Lead hundreds of units divided into over 20 types, from infantry to bombers and tanks.<br/><br/><strong>STORY BASED ON FACTS</strong><br/><br/><br/>Although the Province, where the game takes place, is fictional, the game's story, as well as many missions contained within, were all inspired by real events.<br/><br/><strong>1000 KM² OF GAME WORLD</strong><br/><br/><br/>Over 1000 km² of game world, full of locations replicating the unique afghan landscape and multitude of vehicles, units, farmlands and structures, viewable through the camera of a military drone.<br/><br/><strong>INNOVATIVE COMBAT PREVIEW SYSTEM</strong><br/><br/><br/>Observing and coordinating the actions of your troops will be available through a camera feed from an army drone. Thanks to the drone view, you will be able to use multiple camera modes (including FLIR and NIGHTVISION), reconnoiter the area, and set up targets for air support.", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-11T01:45:27", "background_image": "https://media.rawg.io/media/screenshots/771/771528950cbafeacc2bb0ac0d8d3d23a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 2, "dropped": 2}, "playtime": 1, "achievements_count": 29, "ratings_count": 1, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Wastelands Interactive", "Binge Gaming OU"], "genres": ["Strategy"], "publishers": ["Binge Gaming OU"], "esrb_rating": null}