{"id": 389872, "slug": "spire-of-sorcery-limited-early-access", "name": "Spire of Sorcery (Limited Early Access)", "name_original": "Spire of Sorcery (Limited Early Access)", "description": "The world of Rund lies in ruins. Almost entirely destroyed by the wars of arch-mages, it is now making the first steps towards its eventual recovery. The Emperor, with his First Legion, has driven all the surviving non-human dwellers deep into the east, towards the uninhabitable Distorted Lands. Meanwhile the Inquisition, governed by the Council of Fathers, watches over those who possess magic powers, confining them to the offices of the Guild of Mages. <br/><br/>There's a growing discomfort among the townsfolk about the risks of keeping these mages alive, even if they are locked away. There are rumours among the mages at the Guild, hinting that they soon might be all exterminated...<br/><br/>One mage with a group of friends escapes into the Wild Lands, looking for a way to save their lives and to grow their powers. Perhaps they will seek revenge. Perhaps they will look for a way to heal the land that may still slip into the Chaos. Whatever their ambition, first of all they must survive – against the hatred of the Empire, against the threats of the Inquisition, and against the challenges of the Wild Lands and its dwellers.<br/><br/><br/><br/>Spire of Sorcery is designed and developed by the team behind the turn-based strategy Eador. Genesis and the digital board game Gremlins, Inc..<br/><br/>We're developing an original strategy survival game with indirect control, with the additional aim of making it highly moddable. Our vision for Spire of Sorcery is that of a game where multiple simple character and world mechanics combine into a unique game experience, making the game replayable through different approaches.<br/><br/><ul><li>Explore the world full of dangerous events; survive encounters with animals, human and non-human parties, deal with diseases, injuries and poisons.<br/></li><li>Develop and manage your disciples taking into account their character stats, skills, traits and interests; equip parties, assign them with tasks and send them out on quests.<br/></li><li>Reach your goals by combining the effects of magic, alchemy and artificing; cast spells, cook food, concoct substances, research new knowledge, craft weapons and equipment.</li></ul><br/>Spire of Sorcery is currently in the period of Limited Early Access. If you would like to be among the first to explore the world of Rund and if you're ready to contribute to the discussions of how we can improve the game further, we'll be happy to see you join the game's international player community!<br/><br/>", "metacritic": null, "released": "2019-11-14", "tba": false, "updated": "2019-11-11T02:11:37", "background_image": "https://media.rawg.io/media/screenshots/4ef/4ef40c72cf1378b15e840cfa4b1e263f.jpg", "website": "http://www.spireofsorcery.com/forum/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Charlie Oscar Lima Tango Interactive Entertainment"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["The Merchant Guild of Rund"], "esrb_rating": null}