{"id": 389894, "slug": "the-unknown-number-halloween-puzzle-math-arcade-ga", "name": "The Unknown Number: Halloween - Puzzle Math Arcade Game", "name_original": "The Unknown Number: Halloween - Puzzle Math Arcade Game", "description": "\"The Unknown Number has nice imagery and animations. The cheery background music and overall upbeat theme bring some fun to numbers... it is stimulating and challenging for those who love math puzzles.\" -- AppAdvice<br/><br/>Puzzle Math is going Trick-or-Treating! 100% Free. No Ads. No In-App Purchases.<br/><br/>The innovative puzzle math game, The Unknown Number, is celebrating Halloween! Enjoy Halloween inspired levels! See a pumpkin, a ghost, a goblin, a zombie, a vampire, a bat, and all of your favorite Halloween characters.<br/><br/>Your goal is to eliminate all of the numbered blocks by using them in mathematical equations.<br/><br/>Each level has twists and turns... so make your moves strategically.<br/><br/>Think you can survive your Trick-or-Treat route through The Eerie Forest and The Mysterious Mountain? Spooky Silver Falls and Mummified Mt. Mazama await you to discover them.<br/><br/>Uncover the mystery of The Unknown Number - Halloween, one equation at a time.<br/><br/>Key Features:<br/><br/>* Exclusive Halloween levels<br/>* Unique<br/>* Inventive<br/>* Intuitive Gameplay<br/>* Perfect blend of simple and challenging<br/>* Distinct Worlds<br/>* Tiered Play<br/>* Engaging<br/>* Visually Stimulating<br/>* Educational<br/>* Great for Brain Training!<br/>* For Everybody from 2-102!<br/>* NO ADS, NO IN-APP PURCHASES<br/>* FREE!<br/>* Stats Tracking<br/>* No Time Limit<br/><br/>*UNIQUE<br/>A one-of-kind puzzle game that’s simultaneously fun and challenging.<br/><br/>* INVENTIVE<br/>Never-before-seen gameplay executed within artistically designed, visually intriguing puzzles.<br/><br/>* DISTINCT WORLDS<br/>Each world has a unique twist!<br/><br/>Worlds are inspired by the majestic landscapes of The Pacific Northwest.<br/><br/>Start your journey in The Eerie Forest as it introduces you to the unique game play. Enjoy your gradual hike in complexity to learn how to eliminate all the numbered blocks.<br/><br/>Advance your skills, unlock The Mysterious Mountain world, and climb to new heights.<br/><br/>* TIERED PLAY<br/>Easy to play, challenging to master!<br/>Earn 3 stars on each level and conquer The Unknown Number – Halloween.<br/><br/>* ENGAGING<br/>Happy, Halloween themed music, pleasing sounds and relaxing gameplay.<br/><br/>* VISUALLY STIMULATING<br/>Artistically designed levels and hand drawn art throughout the app.<br/><br/>* BRAIN TRAINING<br/>Daily dose of The Unknown Number is better than an apple a day for your overall health and well-being. Play every day for optimal results.<br/><br/>* SOCIAL<br/>Share your victories with friends, family and followers with easy social sharing capability.<br/><br/>* EVERYBODY<br/>Made for ages 2 to 102!<br/><br/>Thank you for your support!!!!", "metacritic": null, "released": "2015-10-11", "tba": false, "updated": "2019-11-11T02:20:50", "background_image": "https://media.rawg.io/media/screenshots/4a2/4a2e129162edb137159dfa29ff0ccffb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Keith Patterson"], "genres": ["Casual", "Educational", "Puzzle"], "publishers": ["Keith Patterson"], "esrb_rating": "Everyone 10+"}