{"id": 389803, "slug": "break-space-out-of-bounds", "name": "Break Space: Out of Bounds", "name_original": "Break Space: Out of Bounds", "description": "A CLASSIC ARCADE WITH A DIFFERENT THEME<br/><br/>Break Space Out of Bounds is a game that will bring 80's nostalgia to today's modernity! Control a spaceship and prevent the Terran nation from being enslaved by the Marthians. Will you be able to defend the land of the marthians without being destroyed before or after?<br/><br/>MINIMUM START<br/>Start with the basic horizontal movement commands and then use the vertical directional pad to use some items.<br/><br/><br/><br/>Go alone in a travel in the Universe and eliminate your enemie like a lone wolf.<br/>Complete different combinations of missions and difficulties!<br/><br/><br/><br/>Explore the story of five soldiers never seen before and it's your responsibility to save them.<br/>Complete the Story in 25 levels.<br/><br/><br/><br/><br/>Prove to your friend that you are better prepared then him for war!<br/>Still have multiplayer mode to play with your teammates on Remote Play Together!<br/><br/><br/>EASILY EXTENDABLE<br/>Since most of the Break Space Out of Bounds data is loaded from simple JSON files and Spritesheets, when the game starts, it is extremely extensible and fast.<br/><br/>FEATURES<br/>- Types of color for spaceship.<br/>- Some types of Items to help you along the journey and to play on multiplayer.", "metacritic": null, "released": "2019-11-02", "tba": false, "updated": "2020-09-10T22:33:33", "background_image": "https://media.rawg.io/media/screenshots/937/9376d26502fe018cddac2dd259b681b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagicFountain", "Magic Fountain Studio"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Magic Fountain Studio"], "esrb_rating": null}