{"id": 389820, "slug": "wizardians-in-defence-of-magic", "name": "Wizardians: In Defence of Magic", "name_original": "Wizardians: In Defence of Magic", "description": "Wizardians: In Defense of Magic is a multiplayer adventure card game with elements of RPG and resource management, created on the basis of innovative approach to collectible card games.<br/><br/><ul><li>You can play everywhere! One account on following devices: PC, smartphone, tablet; you will always be able to join your fiends online.<br/></li><li>There is something for everyone. The game strikes the right balance in combining what is best in card games, RPG and adventures!<br/></li><li>Explore the new opportunities given by the revolutionary way of collecting and playing cards - no boosters, no decks and no random hand selection!</li></ul><br/><br/>LEARN THE MAGIC &amp; GAIN CARDS<br/><br/><br/><br/>Create the character, equip it with essential utensils and attend lectures on different fields of magic. Within that, collect the experience points and collector’s cards representing all the witchcraft, equipment and creatures in the game.<br/><br/><br/>DUEL &amp; BE THE BEST<br/><br/><br/><br/>Duel with players from around the world in a very rarely seen card system. Be the best! Just through your activity and won duels collect the points for your fraction in the cyclically created and published rankings.<br/><br/><br/>TASTE THE ADVENTURES<br/><br/><br/><br/>Let yourself to be absorbed by the non-linear plot and fight to survive in the remarkable lands of Wizardians World. Discover it by undertaking the adventures and gain superb booty!", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-11T01:43:30", "background_image": "https://media.rawg.io/media/screenshots/8d0/8d0f8028b1bea390089a9abefd730a27.jpg", "website": "https://wizardians.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Winged Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Play Way"], "esrb_rating": null}