{"id": 389851, "slug": "the-falconeer", "name": "The Falconeer", "name_original": "The Falconeer", "description": "<p>The Falconeer is a new take on air combat. A 3rd person game that puts you in control of a Falconeer, an airborne warrior.  Using ranged weapons , the game still holds true to classic dog fighting mechanics but adds twists such as acrobatics and crazy line up of enemies to take on.   You&#39;ll fight other Falconeers, but also large lumbering airships, flying beetles, manta rays and offcourse the dragon-like weavers.  </p>\n<p>The story revolves around a singular conflict, but as a player you&#39;ll get to play and experience it from as many angles as you want, offering you acces to all the factions involved. </p>\n<p>The Falconeer is an open-world game. Meaning that a reasonable chunk of the Ursee can be explored and engaged freely.  With different factions and their settlements and bases responding to your actions and faction allegiance.  </p>\n<p>You will need to survive and earn soulshards the currency of the Ursee,  to improve your gear and mount, but also to keep your faction on top in the struggle to control the Ursee.  </p>\n<p>The deep running currents of the Great Ursee hide the secrets of long-forgotten gods and ancestors.<br />\nThe Falconeer is an airborne ocean-world fantasy RPG set in The Great Ursee. Take your armed aerial mount to the skies as you explore a bleak and hauntingly beautiful world, filled with wonderous locations and warmongering rival factions vying for the mysterious secrets hidden at the Ursee&#39;s unfathomable depths.</p>\n<p>The Falconeer puts you in control of the ultimate airborne warrior.  Delivering devastating ranged attacks and combining classic dog fighting mechanics with acrobatic twists and turns, you’ll go wing-to-wing with rival Falconeers as well as large lumbering airships, flying beetles, manta rays and deadly dragon-like weavers.About Tomas SalaTomas Sala is an independent game artist and designer as well as the co-founder of game studio Little Chicken Game Company. Tomas is best known to most gamers for his exotic Skyrim Mod series: Moonpath to Elsweyr, and has developed a unique visual style over the years that have helped turn helped turn games such as Rekt! (iOS/Switch), SXPD (iOS) and TrackLab (PSVR) into unique visual and interactive experiences</p>", "metacritic": 65, "released": "2020-11-10", "tba": false, "updated": "2023-09-02T15:43:50", "background_image": "https://media.rawg.io/media/games/166/1663b397065c8e127fc24916ca48249b.jpg", "website": "http://www.thefalconeer.com", "rating": 2.74, "rating_top": 3, "added_by_status": {"yet": 23, "owned": 505, "beaten": 1, "toplay": 26, "dropped": 48, "playing": 4}, "playtime": 2, "achievements_count": 44, "ratings_count": 59, "suggestions_count": 476, "game_series_count": 0, "reviews_count": 61, "platforms": ["Xbox Series S/X", "Xbox One", "PC"], "developers": ["Tomas Sala"], "genres": ["Simulation", "Indie"], "publishers": ["Wired Productions"], "esrb_rating": "Teen"}