{"id": 389890, "slug": "freddi-fish-1-kelp-seeds", "name": "Freddi Fish 1: Kelp Seeds", "name_original": "Freddi Fish 1: Kelp Seeds", "description": "Freddi Fish 1: The Case of the Missing Kelp Seeds<br/><br/>Join detective Freddi Fish and her best friend Luther as they take on their latest case: finding Grandma Grouper’s kelp seeds that feed the fish under the sea. Explore underwater caves, deep canyons and colorful reefs, and discover fascinating places like King Crab’s Castle and A Sunken Ship Out of Time, in an effort to save the reef. <br/><br/>Freddi Fish and the missing Kelp Seeds entertains children for hours as they explore the wonders of the sea, use logical thinking and reasoning skills to solve the mystery, and make unforgettable new friends along the way!<br/><br/>—User Reviews— <br/><br/>\"I really love these games! You should make more!\"<br/><br/>“The puzzles are difficult without being frustrating, and there are plenty of fun animations to watch and hot spots to click along the way.”<br/><br/>\"It's just as good as I remember and this is a great port that works great for a touch screen.\"<br/><br/>FEATURES:<br/>• Explore over 40 places as Freddi and Luther try to find the missing kelp seeds.<br/>• Every location is filled with wonders, a touch and who knows what will appear, with over 500 secret touch points there’s a new surprise every time you play.<br/>• Fun music mini-games keep things lively for you and your child.<br/><br/>This product uses ScummVM which is released under the GNU GPL v2. <br/>For more information, please visit - https://www.scummvm.org <br/>The GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2019-11-11T02:18:58", "background_image": "https://media.rawg.io/media/screenshots/f98/f98e029566d827ef3fe0a4f4a9ee6452.jpg", "website": "http://www.humongous.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 231, "game_series_count": 15, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Humongous Entertainment"], "genres": ["Adventure", "Educational"], "publishers": ["Tommo"], "esrb_rating": "Everyone 10+"}