{"id": 390250, "slug": "andys-lard-quest", "name": "Andy's Lard Quest", "name_original": "Andy's Lard Quest", "description": "<p>So I wanted to make a weird indie game from the strange arty stuff here at my house. First up is Andy, a duct tape voodoo doll my daughter made when she was just a wee one. Now a teen, I told her I was using Andy in my game, and she cringed. So far, so good.<br/><br/>There is Cosmo my dog, and Society my cat. There is a scary stick I found on the ground last summer. I thought it looked like a kaiju monster, so I glued googly eyes on his face and named him Xerxes. Now he’s flying around causing all kinds of mayhem in this game! There’s a floating rubber glove guy, a ton of ants, and rubber chickens are the currency you collect to unlock everything.<br/><br/>You start out as a fragile egg man, and as you collect rubber chickens, you can trade them in for other fancy new heads that have all new super powers and moves.<br/><br/>Once you collect enough rubber chickens you can unlock the Bonus Level where the shrimp are running like mad! With 20+ different heads to unlock and play, and a bonus level to unlock, this insane game will have your friends wondering what the hell you’re doing. If they ask, just tell ’em you’re on a LARD QUEST!</p>\n<p><strong>Game Credits for Andy's Lard Quest</strong><br/><br/>Game music: <em>To Town I Go</em> by mopehead &amp; Tony Iuppa from: Hauntscapes.com<br/>Andy and other duct tape art by Malaya from: DesignCutie.com<br/>Nature sounds from: Yellowstone National Park Public Domain Sound Library<br/>Cosmo the wonder dog courtesy of: TimeBrats.com<br/>Andy's Lard Quest PC Game Made by:  The JEMoores Game Machine</p>", "metacritic": null, "released": "2019-11-09", "tba": false, "updated": "2019-11-11T03:46:22", "background_image": "https://media.rawg.io/media/screenshots/839/8396e1a19b5aaeffa299a00895589783.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JEMoores"], "genres": ["Action"], "publishers": [], "esrb_rating": null}