{"id": 390321, "slug": "terry-the-skeleton", "name": "Terry The Skeleton", "name_original": "Terry The Skeleton", "description": "<p><strong>Terry The Skeleton</strong> is my entry to #ProcJam that is happening on itch.io where you have to design a game/tool/anything that uses procedural generation or as they say on the website create something that creates something else. In Terry, the player can moves in realtime while enemies are still restricted to be in turned-based. The goal is to see how fast you can finish the game in number of enemy steps. Terry is a silly little game with a silly funny story, that I hope it make you smile while playing :)<br/></p>\n<p><strong>Controls:</strong></p>\n<ul><li>Arrows: to move/dash around based on the movement type</li><li>X or Z: to change the movement type between normal movement (1 tile move) or dashing (tile it reach a wall)</li></ul>\n<p><strong>Tips:</strong></p>\n<ul>\n<li>The timer doesn't start until after your first move, so try to plan your moves ahead in time and react to the current situation.</li>\n<li>You can kill enemies by walking in them during your turn.</li>\n<li>The game follows the following sequence: player turn, enemies attack, then enemies move.</li>\n<li>The highlighted tiles are tiles that you should stay away during the enemies attack turn as they signify where the enemies will strike.</li>\n<li>Always pay attention when will the time will run out either by looking at the lower bar or the player will be flashing.</li>\n<li>The rotating stars shows where the player will land if they took that action, if a certain direction doesn't have a star then it means you can't move in that direction but sometimes you can attack if you are beside the enemy.</li>\n<li>Pay attention to the player eye color as it determine the type of movement (beside the rotating stars)</li>\n<li>Each enemy type have an easy movement patterns and a clear attack area so try to learn them when they first appear.</li>\n<li>Kill all the enemies so you can proceed to the next room.</li>\n<li>You gain 1 health when you advance to the next level.</li>\n<li>I know it is not much and might have some bugs but I hope you will enjoy it :)</li>\n</ul>", "metacritic": null, "released": "2019-11-09", "tba": false, "updated": "2019-11-11T04:04:41", "background_image": "https://media.rawg.io/media/screenshots/892/89271cc42bc6464866572980c9e19271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ahmed Khalifa"], "genres": ["Action"], "publishers": [], "esrb_rating": null}