{"id": 390307, "slug": "zombie-shooter-zombie-survival-games", "name": "Zombie shooter: Zombie Survival Games", "name_original": "Zombie shooter: Zombie Survival Games", "description": "<p>Zombie tsunami fps games has an amazing user interface with attractive high definition graphics that attracts users to play this zombie shooter : zombie survival games again and again. Zombie hunter is equipped with modern guns and ammo’s to fight with zombie tsunami but have to find the ammo’s which are placed in different locations of the city.<br/><br/>This Zombie shooter : Zombie Survival Games is very entertaining and amazing because huge number of zombie tsunami are randomly coming towards the zombie hunter and player have to shoot all zombie tsunami otherwise he will be dead and not able to complete the zombie games mission<br/><br/><strong>Zombie shooter : Zombie Survival Games Missions:</strong><br/>There are three missions in this zombie shooter : zombie survival games <strong>Clear City </strong>, <strong>Kill Zombies </strong>, <strong>New York City </strong>and each of them is very interesting and full of adventure. Huge number of peoples around the world likes to play fps games and this zombie games will be favorite of all who are addicted to zombie hunter or zombie games. If you took the responsibility of protecting peoples you must have to survive and protect yourself when you’re shooting zombie tsunami.<br/><br/><strong>Clear City </strong>zombie shooter : zombie survival games mission is full of thrill, adventure and endangerment. You have to clear city by shooting all the zombies. There are 22 zombies in this zombie hunter mission and you have to kill all of them to complete levels of zombie games. First you have to find your weapons that are placed somewhere in the way, weapons include a sword and sniper gun that can be used to kill zombies in this fps games.<br/><br/><strong>Kill Zombies </strong>is an another mission of this zombie shooter : zombie survival games, in which 24 zombies attacked on your peaceful city and because of this attack innocent peoples are in trouble. As a zombie hunter soldier it’s your moral duty to kill all the zombies that are disturbing folks in the town and affecting the environment.<br/><br/><strong>New York City </strong>is one of the most beautiful cities of USA. There are beautiful buildings and peoples are living very luxurious life. But this morning deadly zombies attacked on the most popular city of USA and you are selected for the mission to clear the New York by shooting all of the zombies.</p>", "metacritic": null, "released": "2019-11-09", "tba": false, "updated": "2019-11-11T04:01:49", "background_image": "https://media.rawg.io/media/screenshots/f9e/f9e09d8f5e19eae7d21c1a61968a1552.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["amnazeb25"], "genres": ["Action", "Shooter", "Simulation"], "publishers": [], "esrb_rating": null}