{"id": 390471, "slug": "el-autobus-que-tenia-que-ir-rapido", "name": "El autobús que tenía que ir rápido", "name_original": "El autobús que tenía que ir rápido", "description": "<p>Planteado originalmente como parte de un fangame de Silent Hill, el cual buscaba estar a medio camino entre el Silent Hill original y Shattered Memories, \"El autobús que tenía que ir rápido\" era una escena jugable que nos ponía en los zapatos de Quique Masón, quien en esta escena se veía envuelto en una pesadilla viviente generada por el pueblo maldito, en la cual experimentaba una y otra vez el trauma por el que paso cuando, al ir manejando el autobús escolar de su pueblo natal, que fue incapaz de controlar debido a la carretera congelada; atropelló accidentalmente a su hija de apenas 7 años, hija que en aquel momento llevaba el vestido verde que él le había regalado ese mismo día por su cumpleaños; para terminar saliéndose de la carretera y estrellándose contra un árbol, haciendo explotar el camión, matando a todos los niños que iban en su interior y quedando como único sobreviviente.</p>\n<p>En la escena podemos apreciar la carretera congelada que se ha extendido hasta el horizonte, convergiendo ahí con la niebla característica de esta saga; y que hace sumamente difícil manejar el autobús que controla Masón, quien también debe esquivar múltiples visiones de su hija que se cruzan despreocupadamente por en medio de la carretera vallada e infinita, y entre esos árboles que salen por todos lados y sin ningún sentido; solo acompañado por el pesadillesco y repetitivo sonido del motor. Todo puesto alevosamente por el pueblo para acosarlo y enloquecerlo...</p>\n<p>Sin embargo, debido a lo crudo de la historia, dicho fangame fue cancelado. Pero ya que se tenía completamente listo y funcional el gameplay de esta escena, se decidió ponerle un sistema de puntuación para su disfrute independiente.</p>\n<p>He aquí el ultimo rastro de la historia de Quique Masón.<br/>¡Disfrútenlo y diviértanse!</p>\n<p>---------------------------------------------------------------------------------------------</p>\n<p><strong>Controles:</strong><br/>Flechas</p>", "metacritic": null, "released": "2019-11-08", "tba": false, "updated": "2019-11-11T04:38:45", "background_image": "https://media.rawg.io/media/screenshots/d30/d30b48ec97ca5f28a378f9f284f8734e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CDV ESCOM Games"], "genres": [], "publishers": [], "esrb_rating": null}