{"id": 390461, "slug": "velha-quantica", "name": "Velha Quântica", "name_original": "Velha Quântica", "description": "<em>“Nada é melhor que do que a melhor idade, meu pudinzinho… Depois que você se aposenta, você só quer ficar em casa aproveitando sua velhice, fazendo companhia para os seus gatinhos e aprender mais sobre assuntos comuns para nós, como bingo, ponto cruz… e </em><strong><em>física quântica! </em></strong><em>Você quer aprender comigo como ela funciona? Quem sabe eu deixo você brincar com os meus fofinhos também! Eu só espero que você não seja alérgico...”</em>\n<p><strong>Velha Quântica</strong> é o jogo da velha que você conhece e adora, só que com gatinhos fofos e os ensinamentos da física quântica deixando tudo mais desafiador e divertido! Chame um amigo e junte-se com Dona Velhinha e seus fofinhos felinos para tentar formar ciclos de gatinhos até que eles dominem todo o tabuleiro.</p>\n<p>O jogo está disponível para jogar <strong>gratuitamente</strong> para Windows, Linux ou para ser jogado diretamente no seu navegador de internet (Chrome, Firefox): é só clicar em Play aqui em cima e se divertir!</p>\n<p>Ele foi baseado no \"jogo da velha quântico\", cujo design original foi criado por Allan Goff. Essa versão digital foi feita como trabalho final da disciplina SSC0770 - Introdução ao Desenvolvimento de Jogos Eletrônicos, no ICMC-USP.</p>\r\nEquipe do Velha Quântica\r\n<ul><li><strong>Ana Maia Baptistão</strong>: arte digital, som</li><li><strong>David Rodrigues</strong>: programação, produção</li><li><strong>Gabriel Toschi</strong>: game design, documentação</li><li><strong>Thales Bonini</strong>: programação</li></ul>", "metacritic": null, "released": "2019-11-08", "tba": false, "updated": "2019-11-11T04:35:59", "background_image": "https://media.rawg.io/media/screenshots/ccf/ccf526b8a2c6cac8cadb9f76771b7bf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Gabriel Toschi", "d1s2r3"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}