{"id": 390556, "slug": "shikigamimyth", "name": "Shikigami:Myth", "name_original": "Shikigami:Myth", "description": "■ JUMP IN AND FIGHT BATTLES<br/><br/>-Encounter hundreds of spirits and damsels in the Spirit World! You are teleported to the past to lead and fight alongside “Shikigami” also known as spirits. It is in your hands to restore peace in the ancient Spirit World.<br/><br/>■ COLLECT YOUR SHIKIGAMI<br/>-100 characters are drawn with an unique ink style, resonating both the spirits of the Shikigami and the culture of the old ancient time. In addition acclaimed voice actors Rie Kugimiya, Maaya Uchida, and Mikako Komatsu all gave their best performance, perfectly depicting the characters soul.<br/><br/>■ BRING YOUR MINI INN TO LIFE<br/>-Customize your furniture and interact with them, with new furniture added, different interactive effects will be unlocked, additional features will also include Whac-A-Mole, and shooting contests. Experience the most authentic intimate life with your beloved characters.<br/><br/>■ CALL UPON YOUR GUARDIAN SPIRITS<br/>-The guardian spirit is not only a loyal companion, but also gives strong support in battle! Each guardian spirit has its own powerful skill, with a well-timed click you can shift the tide of battle!<br/><br/>■ SERVER OPENING REWARDS! GET A FREE ULTRA RARE CARD<br/>-(UR+SSR+SR) Cards are rewarded to new players who complete all stages of the 7 days quests. Choose your card collections and add in rich rewards!<br/><br/>■ STORY BACKGROUND<br/>Since ancient times the world created by parallel time and space has never interfered with each other, maintaining a long-lasting balance. Until the evil spirit “Yamata No Orochi” traveled through time and brought destruction to the world. After a long battle “Hyaku Shosen” the spirit of all beings guarded the two remaining worlds; Spirit World, and the Human Realm. In order to protect the human race Hyaku Shosen sealed her own spirit into the artifacts allowing them to reincarnate as a Shikigami.<br/>But peace only lasted for a brief moment, the evil spirits that were sealed have reawakened, for this reason champions have teleported themselves through the present realm. Can they lead the spirits and bring a sliver of hope to the Spirit World?<br/><br/>Join the fan page now! Gain limited rewards &amp; latest news!<br/>Facebook：https://www.facebook.com/SGMYTH<br/>Twitter：https://twitter.com/ShikigamiMyth<br/>Discord：https://discord.gg/UuFGSms<br/><br/>Game is now available in all regions, enjoy!", "metacritic": null, "released": "2019-11-11", "tba": false, "updated": "2019-11-15T01:47:27", "background_image": "https://media.rawg.io/media/screenshots/ee5/ee50b66e32009d8adc41ad43f1b50a23_V8EyBuP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["9Splay Holding Co"], "genres": ["RPG", "Card"], "publishers": ["9splay Holding Co"], "esrb_rating": "Teen"}