{"id": 390538, "slug": "dawn-of-zombies-survival-after-the-last-war", "name": "Dawn of Zombies: Survival after the Last War", "name_original": "Dawn of Zombies: Survival after the Last War", "description": "<p>DoZ is an online simulator of survival in a post-apocalyptic world. Here, those who lived through Conflagration were left to survive against hunger, aberrations, fanatical mutants and zombies, diseases and radiation. And, of course, other survivors. Get through the withering heat and deadly frost as a natural born survivalist. Be careful, though: the Territories become much more dangerous when the night falls.</p>\n<p>Game features:<br />\n- Build and craft on the ground and underground;<br />\n- Energy is restored for free by food and at the Shelter;<br />\n- Survive: sate your hunger and quench your thirst, recover from radiation and disease, protect from frost and heat;<br />\n- Follow the story: dozens of characters, hundreds of quests and notes;<br />\n- Choose any vehicle to get around — from bicycle to UAZ;<br />\n- Realistic graphics and lighting — day and night change, volumetric fog;<br />\n- Find mysterious artifacts born in aberration zones;<br />\n- Gloomy wastelands, dark forests, anomalous ruins full of zombies, bandits and wild animals;<br />\n- Elementally infused weapons to make your enemies burn and bleed;<br />\n- Trade and communicate with different factions — from scientists to military;<br />\n- Gain reputation with factions and characters to receive unique rewards;<br />\n- Advanced craft: 150+ blueprints for weapons, armor, vehicles;<br />\n- 60+ kinds of weapons: AK, M-16, Makarov pistol, and Mosin-Nagant;<br />\n- Stealth Mode: hide in the bushes, sneak up and kill without being noticed;<br />\n- Use a special workbench to repair weapons and armor!;<br />\n- Complete events: protect allies from zombies or attack camps of fanatics;<br />\n- Locations are constantly changing: look for airdrops and hidden stashes, explore aberration zones;<br />\n- Go to raids on bosses in radioactive dungeons.</p>\n<p>Coming soon:<br />\n- Multiplayer survival game mode with friends: free-for-all PvP;<br />\n- Big settlements where you can communicate with other players;<br />\n- Clan system: upgrade your own base and participate in clan wars;<br />\n- Fire, frost, and toxic aberrations.<br />\n- MMO raids on bosses and hunts for the walking dead born in the Conflagration;<br />\n- Co-op PvE quests;<br />\n- NPC allies and pets, including a dog and robotic dog;<br />\n- Build a spy drone and besiege other players’ shelters in PvP mode.</p>\n<p>Gameplay:<br />\nHumanity falls—dead rises. You&#39;re one of the survivors, a Strider—the stalker of the wastelands. You explore the Last Territories, the aberration Zone that mysteriously survived after the war. Here, man is more dangerous than beast, here you can be killed for a can of tinned meat and worn shoes. Somewhere in the Territories, your last friend, a natural born aberration expert, has disappeared. The investigation falls in your hands. Only he can help you regain your memory and survive…</p>\n<p>And remember: the night is darkest just before the dawn.</p>", "metacritic": null, "released": "2019-11-12", "tba": false, "updated": "2019-11-14T12:55:58", "background_image": "https://media.rawg.io/media/screenshots/e35/e354d0633a700816e7434f5f6b283f39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": [], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}