{"id": 390990, "slug": "nowhere-project", "name": "Nowhere Project", "name_original": "Nowhere Project", "description": "<p><strong>This project is a port of the original game \"Nowhere\" from DeValley Entertainment</strong></p>\n<p><strong>Story:</strong> </p>\n<p>For 9 years I have been thinking about how I could transfer this project to current platforms, and not long ago, I settled on the original concept by implementing a prototype of an approximate view of the future port of the game.</p>\n<p>In 2012, I tried to create the initial locations of the original project in the FPS creator, and for some reason I was sure that the FPS creator would be suitable for my purposes, but these thoughts turned out to be erroneous.</p>\n<p>In 2015, I decided to return to the idea of the port again and even contacted DeValley Entertainment, and they replied to me, saying that they did not prohibit the creation of any adaptations of their intellectual property, provided that the adaptation would be free. With this answer, I was completely in agreement and after several months in working on the script, I again stopped working on the port to implement my own ideas.</p>\n<p>Four years later, I again got excited about this idea of creating a port and, I started it, I hope you enjoy the current concept and you support me.</p>\n<p><strong>Briefly about what innovations are expected in this adaptation:</strong> </p>\n<p>- Sounds for all dynamic objects </p>\n<p>- Voice acting dialogs</p>\n<p> - Rethinking original music tracks </p>\n<p>- Animated actions and cut scenes </p>\n<p>- Improved and comfortable combat system </p><p>- One, or several new game endings besides the standard ones</p>\n<p><strong>Screenshots:</strong><br/></p>\n\n\n<p><strong>Video:</strong></p>\n<p><strong>Contacts:</strong> </p>\n<p>iwan1234554321@gmail.com</p>\n<p>It is planned to attract outsourcing to the project to implement new guises of characters, animation, music and sound, so if you have a desire to help: </p>\n<p>Donationalerts.com</p>\n<p>I will be very happy if you like my idea and the prototype I created, if you have any questions, I will be happy to answer them in the comments, or to the indicated mail</p>", "metacritic": null, "released": "2019-11-12", "tba": false, "updated": "2019-11-15T03:26:45", "background_image": "https://media.rawg.io/media/screenshots/d16/d162c65b20b37978337842b7b20eaaee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["signbyrh"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}