{"id": 39096, "slug": "mysteryville-2", "name": "Mysteryville 2", "name_original": "Mysteryville 2", "description": "Return to the intrigue of 'Mysteryville' in this amazing sequel ! <br/>\r\nVariations on the Hidden Object theme that will be encountered in 'Mysteryville 2' include searching a dimmed room with a flashlight, finding objects based on their silhouettes, collecting pairs of items and comparing two versions of the room side-by-side to note the differences between them.<br/>\r\nAnd of course you'll face the puzzles and different mini-games while going through main locations.<br/>\n<br/>\n<br/>\r\nJournalist Laura Winner just can't get enough of the odd little town of Mysteryville. After investigating the riddle of the missing cats in the first Mysteryville adventure, she returns for a visit and in spite of only wanting a relaxing vacation, finds herself sucked into another mystery. <br/>\r\nLaura comes to Mysteryville on the invitation of old acquaintance Bill Witowsky. However, she arrives in the town to find Bill missing and an art and jewelry auction about to take place organized by the town's new priest. Could Bill's disappearance and this auction, which is totally out of character for a small town like Mysteryville, be somehow tied together? It's up to Laura to find out, with your help of course.<br/>\r\nOver the course of the game you'll get to interact with several of the town's inhabitants, including some new faces and some who will be familiar from the first game but have assumed new responsibilities in the town. Interacting with these characters - a few standouts being the creepy scientist and the slovenly small-town sheriff - are a big part of what helps to set Mysteryville 2 not just Hidden Object game but also a full-fledged quest.<br/>\n<br/>\r\nSearch for and find all the clues to help you solve the case!<br/>\r\nPieces of paper become important evidence, and a mysterious anagram will help direct your investigation. The most important thing is not to waste any time, Mysteryville won’t be safe until you solve the case of Bill’s disappearance.<br/>\r\nYou're not just to searching rooms for random junk here, it feels like every hidden object search has a point to it and can be explained logically in the context of the story.<br/>\r\nThe characters and story that flesh out the experience make Mysteryville 2 a fun ride while it lasts.<br/>\n<br/>\n<br/>\r\nThe game features:<br/>\n<br/>\r\n- An intriguing and interesting plot<br/>\r\n- Colorful graphics<br/>\r\n- Interesting and varied mini-games<br/>\r\n- The atmosphere of a great detective story<br/>\r\n- Breathtaking gameplay<br/>\r\n- 22 stages, 61 level and 12 characters", "metacritic": null, "released": "2007-07-17", "tba": false, "updated": "2024-03-01T06:06:39", "background_image": "https://media.rawg.io/media/screenshots/e6c/e6c5ce84d1f9d0a091392ff04a68bffa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Nevosoft", "Positive Games"], "genres": ["Adventure", "Casual"], "publishers": ["Best Place Apps", "RealArcade"], "esrb_rating": null}