{"id": 391274, "slug": "degraman-act-i-vincent-cassel-otome-demo", "name": "Degraman: Act I. Vincent & Cassel ~ otome demo", "name_original": "Degraman: Act I. Vincent & Cassel ~ otome demo", "description": "<p><strong>11/10/2019: Demo is here! </strong><strong>The full version is supposed to be NSFW. The demo is not</strong></p>\n<p><strong>Links</strong></p><p>Twitter - shortreads</p><p>Tumblr - longreads</p><p><strong>Synopsis</strong><br/></p><p>You live a normal life. You listen to your mother like a good daughter. You go to College like a good student. You take care of stray cats like a good Samaritan. Life is measured, dull, and monotonous, but calm and predictable. You always know that tomorrow will be the same as it is today. The same as it was yesterday...</p>\n<p>But all of that is gone in a moment, washed away in a stream of crystal clear water.</p>\n<p>The beginning of your new life is marked by the appearance of mysterious kidnappers. They don't ask for your permission, nor do they care if you're prepared. Not before dragging you into an unknown world full of strange, incomprehensible, mystical, and sometimes terrible things.</p>\n<p>But you are not afraid, for these same very people are ready to protect you with their lives. Extremely attractive, they give all of their attention to you. You're important to them. You're special. What's more, you ARE one of them; superhumans waging an invisible war for the salvation of all mankind.</p>\n<p>Life is awash with color now that you are no longer an ordinary person who is invisible to the eyes of the world...now that you're his Savior...</p>\n<p>But what if none of that were true?</p>\n<p>What if you were still the same gray figure the entire world saw you as?</p>\n<p>What if you were just a bargaining chip in a game for depraved superhumans? A game with no rules. A game in which every mistake leads to an inevitable and cruel death. A game in which the correct path is not always obvious.</p>\n<p>Only by straddling the line between evil and greater evil are you able to snatch your chance at survival.</p>\n<p>But is it worth it..?</p>\n<p><strong>Characters</strong></p>\n<p><strong>Full Game Features</strong><br/></p>\n<ul><li>21 Chapters</li><li>15+ Endings</li><li>12+ Original Music Tracks</li><li>80+ CGs</li><li>30+ BGs</li><li>2 romanceable love interests, and 6 side characters with whom you can flirt and perhaps even have an affair</li><li>The possibility of completing the game without romancing anyone</li><li>10+ hours of gameplay</li><li>Adult sexual content</li><li>Secret characters and other plot twists that all rely on your choices</li><li>Additional routes, romances, and stories will be coming later</li></ul><p><strong>Feedback or bugreport</strong></p><p>If you have any feedback, which you don't want to be visible for everyone </p><p>OR</p><p>you found a bug - plz write directly to us using this form</p>", "metacritic": null, "released": "2019-11-10", "tba": false, "updated": "2019-11-15T04:31:51", "background_image": "https://media.rawg.io/media/screenshots/c60/c60fd641bd08860bb16932d88a5874a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["NamNorm"], "genres": [], "publishers": [], "esrb_rating": null}