{"id": 391260, "slug": "spooky-tv", "name": "Spooky TV", "name_original": "Spooky TV", "description": "<p>This little ghostly TV simulator is our take on the prompt for the <em>Ghosts with Jobs  </em>Bitsy Jam hosted by Adam Le Doux. We have been playing around with Bitsy Game Maker for a few months now, but this is our first published game! We look forward to making many more.</p>\n<p>Instructions: you control the laser beam from the remote control with your arrow keys or swiping in all directions on mobile. You can turn on the TV by touching the red button on the remote and you can change the channels by touching the six buttons on the TV.</p>\n<p>When you find yourself on a channel you can go back to the previous or forward, so don't worry about missing anything!</p>\n<p>The ghosts in the different programs speak when you touch the red icons on the screen.</p>\n<p>At the end of the game you'll be able to turn off the TV by touching the button on the remote while perusing the sixth channel!</p>\n<p>We tried to stuff as many puns and jokes as we could in this one :)</p>\n<p>Now for some shout-outs regarding what we used to make this game: </p>\n<ul><li>Bitsy Game Maker was made by Adam Le Doux </li><li>Borsky Game Hacker is a darn lifesaver by Andrew Yolland </li><li>Image to Bitsy is a wonderful tool by itch.io user ruin</li><li>We used a hack named <em>Transparent Sprites</em> by Sean S. LeBlanc</li><li>Bitsy Saviour is a tool created by itch.io user aloelazoe</li></ul>", "metacritic": null, "released": "2019-11-11", "tba": false, "updated": "2019-11-15T04:28:35", "background_image": "https://media.rawg.io/media/screenshots/903/9033e0f9da996d031dade3e96a2ba4f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Wax Wings Studio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}