{"id": 391366, "slug": "time-squad-alpha-strike", "name": "Time Squad: Alpha Strike!", "name_original": "Time Squad: Alpha Strike!", "description": "Time Squad: Alpha Strike!<p>Story:<br/></p>\n<p>It's the 21st century and an elite squadron of advanced combat earth spaceships are coming back through space and time in order to rescue Earth from a catastrophic alien invasion. <br/>This elite squadron will try to <strong>penetrate the alien defences</strong> in our solar system and on earth's orbit. If this happens an alpha strike against alien ground forces ...will be possible.</p>\n<p>The player pilots one of the front-end spacecrafts in<strong> three different vast settings</strong>: <strong>solar</strong> system, earth's <strong>orbit</strong> and finally in a <strong>ground</strong> attack against aliens. The player may encounter alien spaceships, space mines, turrets in earth's orbit, missiles, even earth military assets (like tanks, stealth jets or air-defences) all captured by aliens during invasion.</p>\n<p>You will fight in our solar system, on earth's orbit and ground. You will encounter alien spaceships stealth spacecrafts and jets, mines, camouflaged ground forces, anti-aircraft guns, tanks and soldiers with rocket launchers.<br/></p>\n<p>HOW TO PLAY:</p>\n<p>* Use mouse to move and fire your lasers.</p>\n<p>* Collect crystals to change your spacecraft or unlock levels.</p>\n<p>* Collect shields to temporarily protect your spacecraft.</p>\n<p>* Find hidden power-ups in destroyed alien military assets.</p>\n<p>In order to proceed to Orbit Attack you must first complete the Solar Attack. The ground assault is <strong>endless</strong> and you can try and reach top High Scores.</p>", "metacritic": null, "released": "2019-11-10", "tba": false, "updated": "2019-11-15T04:56:20", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb916016c9dcca4aafd62b3fc30d041c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Biosoftworld Game Studios"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}