{"id": 391438, "slug": "roterra-extreme-great-escape", "name": "Roterra Extreme – Great Escape", "name_original": "Roterra Extreme – Great Escape", "description": "Orlando’s on the run! <br/><br/>Chased by the Queen’s army. Lost. Defeated. This fallen king is no one’s idea of a hero. The world itself is working against him. He's a failure; just trying to survive.<br/><br/>But wait! With friends in unexpected places, perhaps his cause is not lost. After all, villain or hero, it’s all a matter of perspective, right?<br/><br/>Return to the magical world of Roterra, where “up” is relative and you may need to walk across the ceiling or down a wall to find your way. Rotate, flip and spin specially marked cubes to shift the ground and reveal pathways. With new environments, harder puzzles, and new characters, Roterra Extreme will provide hours of expert puzzling fun!<br/><br/>Take your time and plan your moves: in this perception-challenging world, things are rarely as they seem, and the correct path is often not the most obvious one. In this jumbled world you may need dozens of moves to complete the path and escape the maze, but don't worry about getting stuck: just flip a cube to find a new way out.<br/><br/>---GAME FEATURES---<br/>▪ 35 Challenging Puzzles over 10 levels<br/>▪ 3+ hours of gameplay<br/>▪ The Puzzles are the Story: change your perspective to find the path<br/>▪ No Ads, No Timers, No IAP<br/>▪ No Internet needed to play<br/>▪ Prequel game, Roterra, Featured in Game of the Day and 5 Collections<br/><br/>Not recommended for iPhone 5S, iPhone SE or iPad Air<br/><br/>---STORY OF ROTERRA---<br/>Once upon a time, a daring princess defied stereotypes and took her fate into her own hands. Roterra is inspired by ORLANDO FURIOSO, a 16th Century poem about love, power and perception.<br/><br/>In Roterra, Princess Angelica must turn cubes to transform dead ends into doorways, toggle switches to reveal staircases and bridges, and even flip the world on its head to find the path and overcome the obstacles set in her way. The puzzles tell the story of a young girl, at first tentative with her newfound magic, growing empowered as she escapes from increasingly difficult mazes created by her power-hungry brother, Orlando. <br/><br/>Traversing the cube-shaped puzzle world of Roterra to regain her rightful place as Queen, Angelica discovers that sometimes the journey matters more than the destination, stereotypes are not to be trusted, and often the only way forward is to change your perspective.<br/><br/>Roterra Extreme™ continues the story from Orlando’s perspective as he runs for safety when his plan to get rid of Angelica falls through. This time, the mazes are created by the world of Roterra itself, punishing Orlando for stealing his sister’s magic. Orlando’s journey is hard and frustrating; his “helpers” are often not very helpful and the world’s magic takes every opportunity to turn him around and block his path. He even finds himself hallucinating as he becomes increasingly more panicked and lost. Where Angelica’s story is one of triumph and self-discovery, Orlando’s only concern is escaping pursuit and finding a safe place to regroup.<br/><br/>Learn more about Angelica, Orlando and the 16th Century poem, ORLANDO FURIOSO, that inspired the game at playroterra.com<br/><br/>Need help? Find answers to common questions in our FAQ: https://playroterra.com/faq<br/><br/>Want to share feedback, report a bug, or get a hint? Send an email to support@dig-itgames.com.<br/><br/>Roterra™ is produced by Dig-iT! Games®, an independent, woman-owned game studio in Bethesda, MD<br/><br/>Follow Roterra online at:<br/>Web: https://playroterra.com<br/>Twitter: @playroterra<br/>Facebook: https://www.facebook.com/playroterra", "metacritic": null, "released": "2019-11-14", "tba": false, "updated": "2019-11-18T01:46:23", "background_image": "https://media.rawg.io/media/screenshots/3d8/3d86247e4a36c9270fa3c11c272335dd_SndsRLa.jpg", "website": "http://playroterra.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dig-It Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Dig-It Games"], "esrb_rating": "Everyone 10+"}