{"id": 391444, "slug": "baker-business-2-cake-tycoon", "name": "Baker Business 2: Cake Tycoon", "name_original": "Baker Business 2: Cake Tycoon", "description": "Love baking? Bake and serve all kinds of desserts, drinks, and treats in your very own bakery game! Tycoon your way to the top and put your baking / business skills to the test! Sell your customers the very best quality cake, coffee, cookies, and sweets to encourage them to give you a good rating! The better your bakery’s rating, the more customers you’ll get and the more delicious items you can unlock and bake in your bakery!<br/><br/>So Many Baked Goods!<br/>Make and sell a wide variety of food items including: cake, cookies, muffins, doughnuts, ice cream, cupcakes, coffee, brownies, soda, chips, pretzels, pies, and so much more! <br/><br/>Satisfy Your Customer’s Sweet-tooth!<br/>As you level up each bakeable recipe you’ll be able to increase the price of your baked goods and buy more ovens to keep up with your customer demand! Be careful though! If your customers can’t find what they’re looking for they’ll give you a negative rating which will impact your bakery’s popularity! <br/><br/>Keep The Customers Rollin’ In!<br/>You can always hire a sign waver, put an ad in a local newspaper, or even hand out flyers to spread the word and attract new customers! And if you really want to get the customers rolling in you can always put an ad on the radio or TV! <br/><br/>Keep Your Customers On Their Toes!<br/>Your customers are always on the lookout for new items in your bakery, so don’t forget to bake and stock any and all new food items you unlock at each level! <br/><br/>Upgrade And Expand Your Bakery!<br/>When you start running out of ovens to bake in or shelves to stock, simply upgrade and expand your bakery for more room!<br/><br/>Baker Business 2 Features:<br/>- Play all 30 levels and unlock over 130+ items!<br/>- Unlock perks and promotion / advertising opportunities to make your bakery thrive!<br/>- Arrange your baked goods however you’d like in your bakery!<br/>- Customize your bakery with colored wallpapers and different display cases!<br/>- Learn basic business skills by managing money with easy-to-understand finance reports!<br/>- Easy-to-play and suitable for all ages!<br/>- No in-app purchases! One-time buy and you get it all!<br/><br/>You can do this! Ready. Set. Bake!!<br/><br/><br/><br/>Connect with us at Living Code Labs:<br/><br/>Follow us on Twitter:<br/>http://twitter.com/LivingCodeLabs<br/><br/>Like us on Facebook:<br/>http://facebook.com/LivingCodeLabs<br/><br/>Follow us on Google+:<br/>https://plus.google.com/+Livingcodelabs<br/><br/>Visit our Website:<br/>http://livingcodelabs.com", "metacritic": null, "released": "2013-09-18", "tba": false, "updated": "2019-11-18T01:49:04", "background_image": "https://media.rawg.io/media/screenshots/9e3/9e38e4b708527370d8a2d3ffd6b8cd80_ZBEFfkX.jpg", "website": "http://livingcodelabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adam Bowles"], "genres": ["RPG", "Simulation", "Educational"], "publishers": ["Adam Bowles"], "esrb_rating": "Everyone 10+"}