{"id": 391434, "slug": "hiarcs-chess", "name": "HIARCS Chess", "name_original": "HIARCS Chess", "description": "HIARCS is a multiple World Championship winning chess program and the only handheld chess program in the world which has won matches and tournaments with Grandmasters. It twice won the Mercusor Cup in Buenos Aires, Argentina ahead of Grandmasters with a performance of 2900 Elo, the best chess performance rating for any handheld device in history.<br/><br/>In 1997 the World's strongest ever human chess player, Garry Kasparov, said \"HIARCS is much better positionally than Deep Blue\" and even the current World champion, Vishy Anand, in a recent interview when asked what chess program he uses to analyse with said \"generally I use HIARCS\".<br/><br/>This power enables your iPhone to play chess like a super Grandmaster, analyse games and chess problems with you, or play at whatever weakened chess strength you want from beginner to GM strength while offering numerous features to help you learn and improve as you play with HIARCS. An advanced set of coaching features helps players of all strengths improve their chess play.<br/><br/>HIARCS Chess has a full range of realistic weaker opponent strengths and playing styles catering for players of all abilities from absolute beginners to Grandmasters. On the weaker playing levels HIARCS will make human-like mistakes appropriate to the level of play and this together with the integrated coach advice, assessments and alerts allow you to learn and improve quickly.  HIARCS also monitors your chess performance and provides you with an Elo chess rating which tracks your chess ability in every game. It can continuously adjust its playing strength to give you challenging but beatable opponents as you improve.<br/><br/>HIARCS Chess will save battery life by using much less energy on the weaker levels, allowing more playing time on long journeys etc.<br/><br/>HIARCS Chess supports PGN chess game databases and has all the games between Fischer &amp; Spassky and Kasparov &amp; Karpov for you to play through and enjoy.<br/><br/>HIARCS has a large tournament book which is up to date with chess theory with over 235,000 variations. The book moves are displayed on screen with chess symbols and the opening variations are named and ECO coded.<br/><br/>Key features:<br/>+ Strongest chess program on iPhone and iPod Touch, genuine strong GM-level performance<br/>+ Suitable for all players from absolute beginners to strong Grandmasters with many handicap levels and opponents styles and advanced coaching<br/>+ Intuitive and friendly user interface with multiple high quality pieces set, colour schemes and icons including high res support for iPhone 4 and 5 retina displays<br/>+ Multiple playing modes: play white, black, both sides in two player mode, continuous analysis and interactive replay<br/>+ Fully adjustable Elo strengths, adaptive levels and  multiple playing levels and opponents<br/>+ All levels below maximum are low energy to increase battery life<br/>+ Rates your chess play and gives you an Elo rating which is updated after each game<br/>+ Advanced coach can provide move options, give hints, indicate move safety and quality highlights and watch your play and warn about mistakes<br/>+ Transfer PGN databases to/from HIARCS chess via iTunes file sharing, email games and PGN DBs from HIARCS<br/>+ Launch HIARCS from PGN email attachments<br/>+ Load, save or delete games to/from PGN databases<br/>+ Set up or edit a position to analyse or play from<br/>+ Advanced game navigation with game move slider and VCR buttons for rapid and precise game navigation<br/>+ Many selectable preset blitz, incremental and average time clock settings for timed play<br/>+ Large HIARCS tournament opening book as used by the professionals!<br/>+ Permanent brain for enhanced playing strength<br/>+ Numerous chess display functions for showing chess moves, analysis, book moves, coach advice, move quality even legal moves, offer draws or resign<br/>+ 8 Piece sets and 9 colour schemes<br/>+ Integrated Html manual and help screens<br/><br/>A discount coupon is included with a $10 USD discount on other HIARCS products on Mac and PC from www.hiarcs.com.", "metacritic": null, "released": "2009-08-28", "tba": false, "updated": "2019-11-18T01:44:25", "background_image": "https://media.rawg.io/media/screenshots/692/6929e784556bb90794a1fbc8a79d92e1.jpg", "website": "http://www.hiarcs.com/iphone-chess.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Applied Computer Concepts"], "genres": ["Strategy", "Board Games", "Educational"], "publishers": ["Applied Computer Concepts"], "esrb_rating": "Everyone 10+"}