{"id": 391436, "slug": "zen-chess-collection", "name": "Zen Chess Collection", "name_original": "Zen Chess Collection", "description": "Zen Chess Collection is the combination of 6 minimalist chess puzzle games. Solve 900 carefully selected puzzles in a beautifully designed chess board.<br/><br/>- Designed for chess lovers of all levels (even if you just learned how to move the pieces);<br/>- Enjoy a minimalist, beautifully designed chess board and pieces;<br/>- Original soundtrack, specially composed to help you keep your focus and concentration;<br/>- Everything in the game was made with a lot of love and craftsmanship;<br/><br/>Includes all six games from the Zen Chess series:<br/><br/>- Zen Chess: Mate in One - Solve 300 carefully selected mate-in-one puzzles<br/>- Zen Chess: Mate in Two - Solve 150 carefully selected mate-in-two puzzles<br/>- Zen Chess: Mate in Three - Solve 100 carefully selected mate-in-three puzzles<br/>- Zen Chess: Mate in Four - Solve 50 carefully selected mate-in-four puzzles<br/>- Zen Chess: Blindfold Masters - Put your memory and chess skills to the test by solving 150 puzzles without seeing the pieces.<br/>- Zen Chess: Champion’s Moves - Play through 150 historical games and solve the same chess problems the Champions had to solve to win each game.<br/><br/>Can you find the moves that solve each puzzle? Give it a try and show yourself you are a truly chess master.", "metacritic": null, "released": "2019-10-25", "tba": false, "updated": "2019-11-19T19:37:40", "background_image": "https://media.rawg.io/media/screenshots/f49/f49cb855a33e86fd5a1c56dfe5d8b9fe_Mb3hNQh.jpg", "website": "http://minimolgames.com/zen-chess-collection/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Nintendo Switch"], "developers": ["QUByte Interactive", "Raphael Dias"], "genres": ["Strategy", "Board Games"], "publishers": ["QUByte Interactive", "Raphael Dias"], "esrb_rating": null}