{"id": 391544, "slug": "bsfl-bestest-soccer-football-league", "name": "BSFL: Bestest Soccer Football League", "name_original": "BSFL: Bestest Soccer Football League", "description": "<p><strong>BSFL</strong> (or Bestest Soccer Football League) is a quick 30-minute football club manager game. The emphasis is made on finding the best available players on the transfer market, gradual team improvement, and optimal tactical decisions. You can also think of it as a football-management-themed roguelike game if that sort of thing is even possible.<br/></p>\n<p><strong>Quick instructions:</strong></p>\n<ul><li>Press [Play Season] button to progress the game.</li><li>Buy and sell players to improve your lineup. Try to find good deals. Not every expensive signing will pay off.</li><li>Use [1] [2] [3] keys on the keyboard to switch between the three game tabs (Tactics, Transfer list, Help).</li><li>See the game \"Help\" tab for more information.</li></ul>\n<p><strong>The game is still in development. Most recent updates to the game:</strong><br/></p>\n<ul><li>Improved the expected match flow diagram. It now compares your lineup against the current league teams.</li><li>Shortened the main game to 10 divisions.</li><li>Implemented a good difficulty curve: It is easier in the beginning, but harder in the end (actually, it is quite hard now to win the top division).</li></ul>\n<p><strong>FAQ:</strong></p>\n<ul><li><em>Is it possible to save my game progress?</em> No, there is no way to save and load the game state. Just keep the tab open. Or just close it and start a new game whenever you want to play again.</li><li><em>How to restart the game?</em> Just refresh the browser page.</li><li><em>Why did you call the game BSFL?</em> Most games in the genre jump through hoops creatively avoiding the words \"football\" and \"soccer\" in their titles. Not this time.</li></ul>\n<p>Homepage: https://a-nikolaev.github.io/bsfl/</p>", "metacritic": null, "released": "2019-11-17", "tba": false, "updated": "2019-11-18T02:09:58", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["5th"], "genres": ["Strategy", "Sports"], "publishers": [], "esrb_rating": null}