{"id": 391680, "slug": "the-adventure-of-sir-twenty", "name": "The Adventure Of Sir Twenty", "name_original": "The Adventure Of Sir Twenty", "description": "<p><strong>Game:</strong> The Adventure Of Sir Twenty</p>\n<p><strong>Prompt:</strong></p>\n<p>You can modify the properties of Sir Twenty by given 20 available points in total!</p>\n<p>Have fun!</p>\n<p><strong>Controling:</strong></p>\n<p>Up Down Left Right arrows - To select</p>\n<p>Enter - To confirm</p>\n<p>A D  - To move</p>\n<p>W / Space - To jump</p>\n<p>S - To go down</p>\n<p>Mouse Left Button - To fire!</p>\n<p><strong>Background: </strong></p>\n<p>The story took place in the Middle Ages and the princess was taken away by the monster! Thousands of people were in a hurry, and the king urgently summoned Sir Teventy to the dangerous taboo to save the trapped princess. At the same time, the king promised that if the princess was successfully rescued, she will marray to Twenty. Before the departure, the king gave Tevinty a small pistol. Although the number of bullets was limited, it was helpful. The taboos are in crisis, full of fierce but monsters. Twenty needs to break through many obstacles, arrive at the castle that traps the princess, and defeat the ultimate Boss who walks away from the princess, and finally rescue the princess.</p>\n<p><strong>Characters introduction:</strong></p>\n<p>Sir Twenty:</p>\n<p>Handsome, he was awarded the jazz title in his 20th year of life. Stunts, agile, brave, not afraid of things.</p>\n<p>King First:</p>\n<p>The king of the First Kindom, with 20 daughters, the 19th daughter was kidnapped by monsters.<br/></p>\n<p>Princess NineTeen:</p>\n<p>The princess of the First Kindom accidentally entered the taboo land and was taken away by the monster while on the way to the lake for taking a shower.<br/></p>\n<p>Taboo Land:</p>\n<p>Very dangerous place with a variety of monsters inside. Among them, the trees are towering, the branches and leaves are densely covered, and the daytime is still deeply ruined by the fingers. At night, there are often monsters howling. According to legend, there is a super monster inside, living in a castle, eating a child who lost his way into the place, and stored his bones in a room in the castle.</p>\n\n<p>Boss Twentieth:</p>\n<p>He looks fierce and looks huge. He lives in the taboo of the first country and likes to plant flowers. There is a garden in his castle.<br/></p>", "metacritic": null, "released": "2019-11-17", "tba": false, "updated": "2019-11-18T02:38:15", "background_image": "https://media.rawg.io/media/screenshots/3b1/3b199abd59c70d7f365da5513ac31247.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rayxuln"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}