{"id": 391797, "slug": "furries-scalies-bears-oh-my-complete-edition", "name": "Furries & Scalies & Bears OH MY!: Complete Edition", "name_original": "Furries & Scalies & Bears OH MY!: Complete Edition", "description": "<p><strong>The original blurb for the non-Ultimate Edition</strong></p>\n<p>Hey, kids! Have you ever wanted to be sucked into a vortex and spit out into a world full of talking animals?</p>\n<p>A walk in the woods turns into something a lot cooler when you and your friend are transported to a land much like ours.... but with talking dragons and upright, walking, talking animals of various species. Are you trapped there? Will you ever get home? Each day brings new mysteries and adventures, and you interact with a host of different characters to learn the ins and outs of this brave new world.\r\nA visual novel format with choices per scene. Not every choice will lead to massive change, but it will determine your friendship levels with each individual that you spend time with. Part Adventure, part Dating Sim, all weird and wild.</p>\n<p><strong>What's new?</strong></p>\n<p>Four new friends, including a few spooky ones! I mean, if you have ever wanted to date a Werewolf, now is the time. There's also a completely new October/Halloween arc!</p>\n<p><strong>Features</strong></p>\n<ul><li>A cast of 10+ characters.</li></ul>\n<ul><li>Each day, interact with 8 different people to learn more about the world and those that live in it.</li></ul>\n<ul><li>A chance to change those around you via your talks with them - will you leave this world for better or worse?</li></ul>\n<ul><li>Want to date a porcupine? You can do that.</li></ul>\n<p>There are some sexual situations and innuendos, but nothing hardcore. If you want Furry Porn, look elsewhere.</p>", "metacritic": null, "released": "2019-11-16", "tba": false, "updated": "2019-11-18T03:04:39", "background_image": "https://media.rawg.io/media/screenshots/131/1316e3bce608c3b76562d8239e0cf65c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Steg Game Dev"], "genres": [], "publishers": [], "esrb_rating": null}