{"id": 392053, "slug": "rolling-gunner", "name": "Rolling Gunner", "name_original": "Rolling Gunner", "description": "\"Rolling Gunner\" is a 2D shooting game.<br/>\r\nThe player must skillfully dodge the barrage of bullets flying from all directions, and advance through the stages while controlling the rolling gun that circles around his ship. Online ranking is also available for players to compete their skills.<br/>\n<br/>\r\n\"Rolling Gunner\" is a side-scrolling shooter.<br/>\r\nFor those who want to enjoy the game more, there is an additional DLC \"Over Power\".<br/>\r\n\"Over Power\" is an exhilarating shumps that can be enjoyed with twin sticks.<br/>\n<br/>\r\nMarch 18th, 2061 - \"Operation Downfall\" Commences<br/>\r\nWith its reliance on BAC, humanity had forgotten how to operate even basic transportation, let alone weapons.<br/>\r\nAfter the attacks from BAC and the subsequent social chaos,<br/>\r\nthe human population was reduced by half.<br/>\n<br/>\r\nHowever, there was a group within Lerman Matsunaga that foresaw the dangers<br/>\r\nof a dependence on Buster Engines and the BAC that controlled them.<br/>\r\nThis group led the third stage of energy development, an anti-BAC weapon<br/>\r\ndeveloped in secret that would render Busterium inert, called the Rolling Gun.<br/>\n<br/>\r\nThe third stage of energy development, the military package of the Rolling Gun<br/>\r\nand the mothership named the Anti-BAC Suppression Independent Control Armament<br/>\r\n\"Rolling Gun\" Deployment Warship RF-42R STORK was rolled out.<br/>\n<br/>\r\nMarch 18th, 2061 - \"Operation Downfall\" Commences<br/>\n<br/>\r\nThe mission: to destroy BAC, which has turned<br/>\r\nLerman Matsunaga into a fortress.", "metacritic": null, "released": "2019-06-20", "tba": false, "updated": "2022-12-23T06:08:26", "background_image": "https://media.rawg.io/media/screenshots/165/165178f7701adc178d8eb5c4e6eba1b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch"], "developers": ["mebius.", "Project Rolling Gunner"], "genres": ["Action", "Indie"], "publishers": ["mebius."], "esrb_rating": "Everyone 10+"}