{"id": 392031, "slug": "enchanted-in-the-moonlight-kiryu-chikage-yukinojo", "name": "Enchanted in the Moonlight - Kiryu, Chikage & Yukinojo", "name_original": "Enchanted in the Moonlight - Kiryu, Chikage & Yukinojo", "description": "This is a Steam title version of a hit story released on the mobile reader app \"Love 365: Find Your Story\" by Voltage Inc.<br/><br/>\"Enchanted in the Moonlight\" has been played by over 290,000 people worldwide. <br/>The story's heroine possesses magical blood that imbues ayakashi (Japanese spirits) with enhanced powers. <br/>She enters into contracts with a group of handsome ayakashi and has the chance to embark on a forbidden romance with each of them.<br/><br/>An opening movie and adventure feature have been added to the Steam release, so even players that have previously read the app version will discover more things to enjoy.<br/><br/><strong>The Story</strong><br/>You're an average, 25-year-old girl whose life consists of working at the local library, keeping up your family's shrine, and not much else.<br/>However, that all changes when gorgeous men save you from mysterious, malevolent forces!<br/>These men aren't all they appear to be, though. They're actually Ayakashi Spirits!<br/>You discover that your blood is imbued with an ancient power, one that the spirit world covets, and these handsome strangers are willing to protect you... for a price, that is.<br/>Are you ready to make a deal with these otherworldly creatures?<br/><br/><strong>Character</strong><br/>Kiryu　　  \"The Aloof Dragon\"<br/>Chikage　 \"The Icy Tengu\"<br/>Yukinojo　\"The Enigmatic Snow Spirit\"<br/><br/><strong>Contents</strong><br/>Includes \"Main Stories\" in the App \"Love 365: Find Your Story\".<br/>Season1 Prologue<br/>Main Story<br/>His PoV<br/>Epilogue<br/>Sequel<br/>Sequel His PoV<br/>Sequel Epilogue<br/>Season2 Prologue<br/>Love Nest For Two<br/>Love Nest For Two Epilogue<br/>Seeds of Doubt in Love's Garden<br/>Seeds of Doubt in Love's Garden Epilogue<br/>Season3 Prologue<br/>Thorns in the Bouquet<br/>Thorns in the Bouquet Epilogue<br/>A Twisted Wedding Arch<br/><br/>＊\"A Twisted Wedding Arch\" is recorded only for Kiryu.", "metacritic": null, "released": "2019-06-13", "tba": false, "updated": "2023-03-24T03:50:18", "background_image": "https://media.rawg.io/media/screenshots/1c2/1c247cb5552d490bc727e5b1f37cc507.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch"], "developers": ["UNICO"], "genres": ["Adventure"], "publishers": ["Voltage"], "esrb_rating": "Mature"}