{"id": 392101, "slug": "our-flick-erasers", "name": "Our Flick Erasers", "name_original": "Our Flick Erasers", "description": "Relive memories of playing with friends in school!\nFlick your opponent's eraser off the desk!\nHave a great time playing up with to 4 players in a variety of modes!\nPlay with your family or friends anytime, anywhere!\n \nYou can use more than 300 types of erasers!\nYou can also create your very own eraser!\n \n[Single Player]\nWhether it's defeating one enemy after another in Battle Mode, clearing various stages in Challenge Mode, or battling for the highest score in Flicky-racers Mode, there are plenty of things to enjoy.\n \n[Multiplayer]\nUp to 4 players can play. In addition to making your own erasers and fighting it out in Battle Mode, clear challenges by trying co-op in Party Mode, or compete for a high score in Flicky-racers Mode. There's something for fun everyone to enjoy!\n \n[Unification]\nThe land is in disarray. Defeat various erasers all over Japan to once again unify the land! Battle your way through teachers who have dressed up as ancient Japanese generals!\n \n[Customize]\nCombine parts to make an original eraser, and then use those erasers in other modes. Create the greatest eraser ever made!\n \n[Mystery Classroom]\nUse the points you get from various modes to get more erasers. Collect and play to complete your collection!\n \n[Mini Game]\nRoll the baseball eraser for major points!\n \nNote: No matter how strange, everything you see here is an eraser.", "metacritic": null, "released": "2019-08-02", "tba": false, "updated": "2019-11-19T18:37:42", "background_image": "https://media.rawg.io/media/screenshots/70a/70a8ecf415da997e5d392e79b8b8e8df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": [], "genres": [], "publishers": ["SAT-BOX"], "esrb_rating": "Everyone"}