{"id": 392211, "slug": "groove-coaster-wai-wai-party", "name": "GROOVE COASTER WAI WAI PARTY!!!!", "name_original": "GROOVE COASTER WAI WAI PARTY!!!!", "description": "■Rhythm Game x Roller Coaster!!!!\nRide a roller coaster of sound with simple controls, and get grooving in this exhilarating rhythm game!\n \n■Exhilarating active controls!!!!\nWith Active Controls, you can play by shaking the Joy-Con controllers. Experience the groove in a variety of songs, only possible on Nintendo Switch!\nYou can also play with Standard Controls, using the buttons and control sticks!\n \n■Groove together!!!!\nPlay together with up to 4 friends and family members in Play With Others mode!\nIn this mode you can choose from two types of play. In Casual Versus, players of any ability level can enjoy the game together, and in Hardcore Versus, players compete to show off their true skill!\n \n■A huge line-up of popular music!!!!\nA massive line-up of music, featuring J-pop hits like \"Lemon\" and \"U.S.A.,\" anime songs, Vocaloid and Touhou Project arrangements, as well as popular original songs from the Groove Coaster series!\n \n■Choose from a fabulous cast of characters!!!!\nFeaturing characters from VTubers and Vocaloid, to the Touhou series and more! These characters will feature in songs, as avatars and game navigators, and appear throughout various scenes!\n \nYou can even switch to the vocals of guest VTubers in certain songs!", "metacritic": null, "released": "2019-11-14", "tba": false, "updated": "2023-03-27T18:12:42", "background_image": "https://media.rawg.io/media/screenshots/92c/92c37befae99e3ecf504baf81ac63e9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 1, "dropped": 3, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 4, "platforms": ["Nintendo Switch"], "developers": [], "genres": [], "publishers": ["Taito"], "esrb_rating": "Everyone 10+"}