{"id": 392253, "slug": "arc-vector", "name": "Arc Vector", "name_original": "Arc Vector", "description": "<strong>Arc Vector</strong> is an action arcade game with a hint of flight simulator, inspired by various classic 1980-90s Archimedes games.<br/><br/><strong>Pilot a stolen alien ship in a rebellion against the Archronite invasion.</strong> Fly across the archipelagos of your home world and capture enemy bases with the help of your navigation droid co-pilot, DFX-9T. Battle against enemy Arc Vectors, Fighters, Drones and Laser Tanks, liberate your planet, Melos.<br/><br/><br/><br/><strong>You are a lighthouse keeper on the planet of Melos,</strong> a small world rich in oil and gas, home to a small population of industrial workers, fishing fleets and sheep farmers, scattered across the Melosian Archipelagos. (\"Melosian sheep are famed for their genetically engineered Kevlar-like wool\" - Melosian Tourist Board).<br/><br/><strong>Melos</strong> has been invaded by the <strong>Archronites</strong>, a warmongering species fighting their way through the local galactic sector. The Archronites have started to colonise Melos to exploit its natural resources, driving the native population from their homes. When one day you discover they have even invaded your tiny home island, you are forced to act.<br/><br/><strong>Together with your trusty navigation droid, DFX-9T,</strong> and after an enemy pilot had apparently met an unfortunate fate on the rocks, you commandeer their vessel and take to the skies in the fight back against the alien colonists. One by one, you must capture their airbases and destroy the infrastructure they are putting in place.<br/><br/><strong>Beware</strong>, however, <strong>Archronite Commander Veilos</strong> will be out to stop you! You will come up against his forces in Arc Vectors - a devastatingly powerful attack ship, and Arc Fighters - a stealth-like fighter aircraft, Drones, Plasma Tanks and Laser Tanks and numerous other defences. Fortunately, the ship you have stolen is also an Arc Vector!<br/><br/><br/><br/><ul><li>Pure arcade combat across 3 distinct campaign areas<br/></li><li>Lush Tropics<br/></li><li>Scorched Deserts<br/></li><li>Volcanic Rim<br/></li><li>Dogfight against alien pilots<br/></li><li>Capture enemy bases to secure weapons and fuel</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-22T02:45:03", "background_image": "https://media.rawg.io/media/screenshots/b7d/b7d516590332af2482e3dabe93dfdd0d.jpg", "website": "http://www.overwound.com/arcvector", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overwound Entertainment"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Overwound Entertainment"], "esrb_rating": null}