{"id": 392294, "slug": "ping-pong-space", "name": "Ping Pong Space", "name_original": "Ping Pong Space", "description": "Ping Pong Space is a modern incarnation of the classic arcade Pong game, set in space.<br/><br/>Travel through the expanse of endless space, playing retro tennis with a computer and overcome the many different obstacles that you encounter along the way. The gameplay is essentially a reimagining of air hockey and classic Atari's Pong with new additional elements. The game has new rules; the blocks and mechanisms in the arenas can both help you win and lead you to defeat, and the drop-down bonuses both please and disappoint, it all depends on your dexterity and skills. Complete every level alone or play with your friend in two-player mode. Immerse yourself in a fascinating journey through the cosmic world.<br/>Are you ready to fight artificial intelligence and win?<h3>The game features:</h3><ul><li> An atmospheric space setting </li></ul><ul><li> A unique blend of table tennis and breakout games </li></ul><ul><li> 1 or 2 player modes </li></ul><ul><li> 60 challenging levels, 9 colorful arenas </li></ul><ul><li> Special bonuses including the small ball, speedball, and lasers </li></ul><ul><li> Steam achievements (medals and cup) and leaderboards </li></ul><ul><li> Enjoy the old school sports game with improved graphics </li></ul><br/>Don't let the invaders take over the world! Accept the challenge to defeat the AI robot and become the retro tennis champion of the galaxy.", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-22T03:12:32", "background_image": "https://media.rawg.io/media/screenshots/052/05297630452d334c00de4f723ab2514a.jpg", "website": "http://bestfriendgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Best Friend Games"], "genres": ["Action", "Sports", "Indie"], "publishers": ["Best Friend Games"], "esrb_rating": null}