{"id": 392235, "slug": "bondage-girl", "name": "Bondage Girl", "name_original": "Bondage Girl", "description": "The game tells the story of heroes saving beauties<br/><br/>----------------------------------------------------------------------------------------------------<br/>It is now scheduled for sale on March 11 Pacific Standard Time (14:00 Beijing time, March 12).<br/><br/>Waiting time has increased by two beauties. Now there are 13 beauties in total. It is estimated that there will be at least 15 beauties on the sale day. Please look forward to it.<br/>----------------------------------------------------------------------------------------------------<br/>The review speed of steam is really fast. The waiting time has added three more beauties, and added the zoom function, which is convenient for all players to enjoy the game. I will keep it updated, so stay tuned.<br/><br/><strong><h3>PS：Now add this game to the wish list, I will select 50 players from them on the day of release to give away this game.</h3></strong><br/><br/>Due to the steam review mechanism, it takes at least 14 days from \"ready\" to \"release\", so I cannot release this game on March 1st, please understand.<br/>----------------------------------------------------------------------------------------------------<h3>how to play</h3>The game mechanism is very simple, players play heroes to get gold coins, and pay attention to the dropped bombs, but pay attention to the time limit, once the countdown is over, the game will stop, picking up the clock props can increase the time<h3>girl</h3>The girl was kidnapped by the evil villain, after winning enough gold coins can save them!!!<h3>friendly tips</h3>Be sure to pay attention to your health. Niuniu has life. He is good and you are good<br/><br/>If you like it, you are welcome to give good comments. If you don't like it, you are welcome to put forward modification opinions or refund", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2021-03-05T03:34:54", "background_image": "https://media.rawg.io/media/screenshots/2a8/2a86fda0e7de03a5ed1a45e7e30c917e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "toplay": 2}, "playtime": 21, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["MCG", "Studio Six"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["MCG", "Studio Six"], "esrb_rating": null}