{"id": 392335, "slug": "the-dis-united-states-of-america", "name": "The Dis-United States Of America", "name_original": "The Dis-United States Of America", "description": "<strong>Where is America heading?</strong><br/><br/>The Dis-United States Of America is a single player card game where you play 1 of 9 Factions to control the future direction of the USA.  Each Faction has it's own Card Deck which you either play against your opponent's hand or use to gather resources from each US State. Each Card has a specific action when played such as controlling a resource or blocking another Faction in a state. By the end of the game, the Faction controlling the most US States wins the game. <br/><br/>The Factions include:<br/><ul><li>Celebrities - they gather their adoring fans.<br/></li><li>Corporations - they turn everything into money.<br/></li><li>Criminal - they steal from other Factions.<br/></li><li>Ecologists - they want everyone to Go Green!<br/></li><li>Government - they try to impose control on other Factions.<br/></li><li>Liberals - they want everyone to seek peace and love in the world.<br/></li><li>Nationalionalists - they believe in the Star Spangled Banner and Uncle Sam<br/></li><li>Religious - they want the country to live bythe word of God.<br/></li><li>Socialists - they want the workers to own the means of production.</li></ul><br/>Card Actions:<br/><ul><li>Own Resource<br/></li><li>Convert Resource - converts a State resource to another e.g. money to people.<br/></li><li>Add Resource - adds a State resource e.g. add people to Virginia.<br/></li><li>Delete Resource - deletes a State resource e.g. delete 1 industry in California.<br/></li><li>Block Faction - block a faction in a State e.g. block the Criminal Faction in Florida.<br/></li><li>Unblock Faction - unblock your Faction in a State e.g. unblock Corporations iowa.<br/></li><li>Block Resource - block a State resource so no card can be played using that resource e.g. block Land in Alaska.<br/></li><li>Unblock resource - unblock a State resource e.g. unblock Natural resources in Texas.<br/></li><li>Steal Resource - steal a resource from another Faction e.g. the Criminal Faction steal 1 Corporations resource.<br/></li><li>Fill Hand - play a card to fill the hand of another Faction e.g. fill the hand of the Religious Faction to the maximum of 7 cards.<br/></li><li>Remove Card - remove a card from the hand of another Faction e.g. remove a card from the hand of the Socialists Faction.<br/></li><li>Block Deal - blocks a Faction from dealing cards e.g. block the Liberals Faction from dealing another card.</li></ul><br/>Each State has it's own resource list:<br/><ul><li>People - the number of people who live in the State.<br/></li><li>Land - the land area of the State.<br/></li><li>Natural Resources - the value of oil, minerals and agriculture in the State.<br/></li><li>Industry - based on the economic GDP of the State.<br/></li><li>Money - based on the annual State budget.</li></ul>", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2019-11-22T03:35:27", "background_image": "https://media.rawg.io/media/screenshots/7e9/7e97a2d460bcd6c4e156fccf4b386a5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Spaghetti Code"], "genres": ["Strategy", "Casual"], "publishers": ["Spaghetti Code"], "esrb_rating": null}