{"id": 392378, "slug": "lit-lux-in-tenebris", "name": "LIT: Lux in Tenebris", "name_original": "LIT: Lux in Tenebris", "description": "Set in an era when electricity wasn’t a thing and nothing but imaginations of great inventors that set the world in motion, LIT test your own inner engineer and lets you discover the joy of experimenting with light at first hand.<br/><br/><h3>ACURATE LIGHT PHYSICS YOU WILL NEVER SEE IN REAL LIFE</h3>The behaviour of light in LIT is physically accurate. That said, the amazing light paths you are going to build in LIT are possible but extremely to reproduce in real life.  Our game gives you the opportunity to set up mirrors and glass pieces to reflect and refract a light beam as you wish, with just few clicks of the mouse.<h3>1. FIND YOUR OWN SOLUTION, NOT OURS 2. REPEAT STEP 1.</h3>Our puzzles are open-ended. We give you the rules and  the tools, you show us how to solve the problem. We assigned a number of possible solutions to each level but don’t let those numbers fool you -  we’re only waiting for the players to find solutions we haven't thought of.<h3>BEAUTIFUL AND DIFFERENT</h3>Visuals threading on the thin line between cartoony and realistic. Good pacing. Relaxing music, which lets you zone in.  All of that creates a unique, mysterious but warm atmosphere.<br/><br/><h3>SIMPLE BUT COMPLEX</h3>When light hits a mirror and it reflects, it hits glass and it bends. That’s all. And yet, it offers thousands of possibilities, which means each of our levels is different and unique.<h3>A GAME FOR EVERYONE</h3>LIT IS extremely intuitive. Testing the game on multiple gaming events proved that it works for all age groups and all types of players. You want to find every solution and beyond? Searching for a game for your 5-year-old? Or maybe you’re trying to introduce your mum to gaming? Controller player or mouse and keyboard type, LIT’s got you covered.", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-22T04:01:44", "background_image": "https://media.rawg.io/media/screenshots/4ad/4adbcf03f39b56d8181dc7d7716e6bad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 1, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Bob or Bob Games"], "genres": ["Casual", "Indie"], "publishers": ["Bob or Bob Games"], "esrb_rating": null}