{"id": 392362, "slug": "snakescape-remastered", "name": "SnakEscape: Remastered", "name_original": "SnakEscape: Remastered", "description": "Winner at Russian Developers Cup 2015!<br/><br/>SnakEscape is a turn-based logic game tuning the traditional Snake gameplay concept upside down! This time You will mantle the role of the food, running away from the pursuing Snakes.<br/><br/>Your goal is simple: collect as many energy stars on the level as possible for traversing through the floating islands. But be cautious: sly snakes will attempt to trap you!<br/><br/><h3>Key features:</h3><ul> <li> More than 100 different single-player levels that will test your brains.<br/> </li><li> 4 thematic seasons: spring, summer, autumn and winter. Each season has it's unique visual and gameplay features!<br/> </li><li> 3 additional level packs specialy available for the Remasterd Edition of the original game: Garden of Eden, Summer Madness &amp; Winter Night.<br/> </li><li> The return of the classic: play as a snake, grow it by collecting the stars and don't allow apples to escape from the level!<br/> </li><li> Global leaderboards for \"Snake Mode\" that display the results of players worldwide. Be the best!<br/> </li><li> Done with the game? Try out the co-op game mode! Play with your friend, solve puzzles and beware snakes together!<br/> </li><li> Already finished all game built-in modes? It's the time for Workshop! Check the levels created by other players or create your own levels with the level editor and share with the community!</li></ul><br/>", "metacritic": null, "released": "2019-12-13", "tba": false, "updated": "2019-11-22T03:52:23", "background_image": "https://media.rawg.io/media/screenshots/d18/d18a1c314d897463577afa89c9cf3d7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Triple-Star Studio", "Rock Path Collective"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Hase Games"], "esrb_rating": null}