{"id": 392309, "slug": "sex-adventure-the-board-game", "name": "Sex Adventure - The Board Game", "name_original": "Sex Adventure - The Board Game", "description": "<p>This board game is for adults only!<br />\nDo you think your sex life could be more exciting? No matter what you think now, this board game is sure to help you earn points for helping the opposite sex.<br />\nNever again monotonous sexual interaction! Make sure you impress your sex partner when you enjoy this erotic sex adventure together - up to the happy end!<br />\nNo matter if you are in a relationship or looking for a partner. With this game your first intimate moment together is guaranteed to be unforgettable!<br />\nEach roll of the dice decides in which way you give yourselves up to lust.<br />\nThe game begins with the prelude phase. Here you roll the dice alternately.  When the figure stops on a field, the sexy fairy &quot;Angel&quot; tells you how to spoil your partner. In the beginning they are mostly harmless actions, later it gets hotter!<br />\nIf it&#39;s your turn, you get points until the next player rolls the dice. So at the end of the game you can see who took how much time for the other player.<br />\nWhen the figure has reached the end of the board, you can decide whether you want to play another round of foreplay or start with sex. (You can also skip the foreplay at any time.)<br />\nDuring the sex phase of the game, the foreplay fields change to sex fields. Each field shows a position. A bunch of different positions are randomly distributed on the board.<br />\nIf the figure stops on a field, the sexy fairy &quot;Angel&quot; explains you in detail, how you should proceed with the position.<br />\nThis board game contains:<br />\n- An erotic foreplay phase, with countless foreplay combinations.<br />\n- A sex phase with numerous positions described in detail and sexy.<br />\n- The sexy fairy &quot;Angel&quot; will guide you through the whole game.<br />\n- &quot;Angel&quot; speaks to you with your real name (if you have entered it).<br />\n- No two games are alike! In each round all fields are randomly rearranged.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-28T11:27:06", "background_image": "https://media.rawg.io/media/games/d19/d1974e533c5c7e7ace18a4b4a9652544.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CritoGames", "Thorsten P."], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["CritoGames"], "esrb_rating": null}