{"id": 392313, "slug": "astropuppa", "name": "ASTROPUPPA", "name_original": "ASTROPUPPA", "description": "Destroy all asteroids and your self esteem!<br/>\r\nASTROPUPPA will challenge you in a colourful (black and white) 3D (not true, it's 2D) battle (most of the time) against rocks a lot of stupid space things and creatures!<br/>\n<br/>\r\nYour aim is to reach the perfect run with 8888 points. <br/>\r\nIf you don't manage to do it, it means you are a noob.<br/>\r\nSo, please, if you fail, don't tell that the game is too hard or whatever. It's because YOU-ARE-A-NOOOOB.<br/>\n<br/>\r\nGame features:<br/>\r\n- Fourteen (13) levels with a lot of unpredictable things;<br/>\r\n- Audio FX produced by mouth;<br/>\r\n- hand-drawn (not exactly) Asteroids-like graphics;<br/>\r\n- enhanced instructions to become an ASTROPUPPA Jedi;<br/>\r\n- many many white pixels and an incredible number of black pixels;<br/>\r\n- hard gameplay mechanics to test how much time you can resist without getting angry and destroying the keyboard;<br/>\r\n- hypocritical elements completely unuseful for people without a human sensibility;<br/>\r\n- press keys randomly and maybe something will happen.<br/>\n<br/>\r\nTIP1: PAUSE KILLS!<br/>\r\nTIP2: DON'T DRINK AND DRIVE!<br/>\n<br/>\r\nAnd last but not least, if you are a NOOB and you are not able to win at this game, don't put a bad review. PUPPA again. The game is not long as the bible, so you can find the needed minutes to play it.<br/>\r\nSo, if you put a bad review, it means you surrended and that you are a NOOB!", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-22T03:24:17", "background_image": "https://media.rawg.io/media/screenshots/f20/f20638d2d7c6412b0e3cfd04f296a8f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dev.Id Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Dev.Id Games"], "esrb_rating": null}