{"id": 392370, "slug": "croixleur-sigma-deluxe-edition", "name": "Croixleur Sigma - Deluxe Edition", "name_original": "Croixleur Sigma - Deluxe Edition", "description": "<h3>High-speed hack &amp; slash action!</h3><br/><br/>Wielding magic blades, four girls fight back successive waves of monsters in this exhilarating hack-and-slash action game! There are various battle styles and you can mix and match 4 weapons to form your own playing style. <br/><br/>Story mode centers on the charming friendship of the girls, fully voiced in Japanese. You can also play your heart out in Score Attack, Challenge mode, weapon switching Dungeon mode and many more!Includes many accessories such as Cat Ears, Spectacles, Headphones, to make your gal look stylish and perk up your skills for battle!<br/><br/><br/><br/><strong>LUCREZIA</strong><br/>CV:井口 裕香<br/>A seventeen-year-old girl from the royal family. Her nickname is Luc. Her personality is bright and straightforward, with no hidden intentions. She is also a genius with magic swords. <br/><br/>Since her style of combat resembles a whirlwind of flames, the Queen scolded her for being so reckless while also bestowing upon Luc the title of Vermilion Whirlwind. <br/><br/>Her sense of justice is her own enemy, and she often causes trouble for others. However, she always ends up making everyone happy. She began to part her long hair in two when she was five, ever since her childhood friend Fran started looking after her. She keeps the fact that it had been Fran's hairstyle first a secret. <br/><br/><br/><strong>FRANCESCA</strong><br/>CV:藤村 歩<br/>A student of the knight house Shelta. Her nickname is Fran. A childhood friend to Luc since they were born. However, her attitude began to change in her mid-teens... <br/><br/>Ever since they were set up to fight in a join combat trial at the Nito Towers, she talks to Luc in prickly tones no matter what. <br/><br/>Genius, reticent, passive, and pure. Her personality unfortunately causes those around her to affectionately call her Princess, but she doesn't like being called that because it's embarrassing.<br/><br/><br/><strong>KATERINA</strong><br/>CV:照井 春佳<br/>The younger sister of the Queen, but she cannot get used to the virtuous, elegant world of nobility. <br/><br/>She's not very good at making light conversation with girls her age, nor does she enjoy eating sweet candies in the school dorm. She much prefers talking to old people and shamans from other countries. She has some weird hobbies. <br/><br/>She doesn't know it herself, but she is also quite heroic, willing to throw herself at the bad guys threatening people she meets on her adventures in order to save them. Eventually she nears the truth behind the great incident foretold to be the end of the Queendom...<br/><br/><br/><strong>SARA-ANNIKA</strong><br/>CV:明坂 聡美<br/>A black-haired girl hailing from Niyan, a country made up of many islands, far to the east of the Irance Queendom. Her father is an instructor in the ways of the sword and shamanic practices, and works as the Queen's teacher. She has rare talents as a shaman herself, but she is barely aware of that fact. Because she has difficulty talking to those unlike herself, she was treated by the other female students as almost a mystical being. <br/><br/>She felt lonely on the inside because of this, but when the seven-year-old Katerina treated her as a best friend from the moment they met, without viewing her differently from anyone else, it saved her from that.<br/><br/><br/><strong>VARIOUS BATTLE STYLES</strong><br/><br/>There are various battle styles and you can mix and match 4 weapons to form your own playing style. Story mode centers on the charming friendship of the girls, fully voiced in Japanese.<br/><br/><strong>CUSTOMIZATION</strong><br/><br/>Customize each of your characters and gain various boosts.<br/><br/><strong>SPECIAL MOVES</strong><br/><br/>Use special attacks, unique to each character.<br/><br/><strong>COMMUNICATION MODE</strong><br/>", "metacritic": null, "released": "2019-11-18", "tba": false, "updated": "2022-11-26T23:09:22", "background_image": "https://media.rawg.io/media/screenshots/97f/97fe47fa0d0d5b39d4d0b4cad002045a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "playing": 1}, "playtime": 1, "achievements_count": 46, "ratings_count": 0, "suggestions_count": 430, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": ["souvenir circ."], "genres": ["Action", "Casual", "Indie"], "publishers": ["Playism"], "esrb_rating": null}