{"id": 392307, "slug": "battle-realms-winter-of-the-wolf-3", "name": "Battle Realms (+ Winter of the Wolf)", "name_original": "Battle Realms (+ Winter of the Wolf)", "description": "Battle Realms is considered by many to be the best RTS games ever made. Back when it was released in 2001, it caused a many month delay of WarCraft III.  The staff at Blizzard played Battle Realms and agreed that it was better then their current version of their game.<br/>\n<br/>\r\nFeaturing unique training and unit development dynamics as well as an innovative resource system.  Battle Realms comes alive like no other RTS.  Mounted units don't just pop out of stable.  Your peasants must find horses, capture them, and bring them to the stable along with a willing rider.  Train your peasants into mighty warriors, equip with with powerful upgrades and unleash them on your unsuspecting foe!<br/>\n<br/>\r\nSneak under the trees, used high ground to do more damage to you enemy.  Accumulate Yin or Yang to embrace the power of Monks, Ninjas, and Zen Masters.  <br/>\n<br/>\r\nFire isn't just a damage state.  It's alive.  Do enough fire damage to the building and it will be consumed unless you dowse it with fire.  <br/>\n<br/>\r\nInclude the Expansion - Winter of the Wolf which tells part of the history of the Wolf Clan and how it's unique units came to be.<br/>\n<br/>\r\nThe game is easy enough to learn for beginners and deep enough to be satisfying for experts.", "metacritic": null, "released": null, "tba": false, "updated": "2023-11-12T22:09:50", "background_image": "https://media.rawg.io/media/screenshots/33b/33b6cc8a122ef4b378d92f2d70049ec8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ed Del Castillo"], "genres": ["Action", "Strategy"], "publishers": ["Ed Del Castillo"], "esrb_rating": null}