{"id": 392443, "slug": "fairy-godmother-stories-cinderella-collectors-edit", "name": "Fairy Godmother Stories: Cinderella Collector's Edition", "name_original": "Fairy Godmother Stories: Cinderella Collector's Edition", "description": "<strong>Domini Games</strong> proudly presents a new spell-binding series in Fairy Godmother Stories: Cinderella!<br/><br/>As her fairy Godmother, it’s up to you to guide and help Cinderella in times of need. But your whole world is turned upside down when you’re arrested under suspicion of committing a string of robberies! Someone’s definitely trying to frame you, but who and why? With nothing left behind at the crime scenes but strange glass slippers, can you crack the case and clear your name before it’s too late? Find out in this enchanting Hidden-Object Puzzle adventure!<br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/>•\tRescue Red Riding Hood’s Grandmother in the bonus game! <br/>•\tInspect hidden cabinets, concoct potions, and more by replaying HOPs and mini-games and earn achievements! <br/>•\tTons of magic shoes, moonstones, and morphing objects to find! <br/>•\tEnjoy exclusive wallpapers, music, videos, and more! <br/>•\tNever get lost with the strategy guide!<br/><br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": null, "tba": false, "updated": "2019-11-22T04:38:06", "background_image": "https://media.rawg.io/media/screenshots/9f0/9f0dc4258b9a3a17c89de45b98d83aee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Domini Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}