{"id": 392462, "slug": "warlords-iii-darklords-rising", "name": "Warlords III: Darklords Rising", "name_original": "Warlords III: Darklords Rising", "description": "Enter a rich fantasy world of medieval warfare teeming with rage, revenge and bravery. This epic game of strategy and conquest now delivers a vastly larger world and deeper strategic gameplay that expands beyond the scope and depth of the original Warlords III: Reign of Heroes. Five epic campaigns and massive strategic battles serve as proving grounds that challenge the mettle of even the greatest Heroes and Warlords. \n\nFeatures:\n<ul>\n<li>Expanded Gameplay: 4 campaigns and 15 stand-alone scenarios, plus the original campaign and 13 scenarios from Warlords III Reign of Heroes. </li>\n<li>Advanced AI: The highly adaptable, challenging and aggressive AI counters every move and devices its own complex and dynamic counter strategies. </li>\n<li>Random Maps: An enhanced random map generator quickly and easily creates an infinite number of maps for unlimited replayability. </li>\n<li>More Heroes and Units: 5 NEW heroes and 31 units for a total of 15 heroes and 95 units each with their own unique abilities and special skills. </li>\n<li>More Spells: Cast 19 magic spells and 9 abilities for a total of 35 spells and 40 abilities. </li>\n<li>Simultaneous Turns: Revolutionary simultaneous movements enables you to charge, do battle and retreat all in real-time. </li>\n<li>Game Editor: Create your own Warlords universe with the map, item and campaign editor. </li>\n</ul>", "metacritic": null, "released": "1998-08-20", "tba": false, "updated": "2022-12-19T00:43:53", "background_image": "https://media.rawg.io/media/screenshots/e92/e92186edf9499f4ce635347b51460913.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 26, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Strategic Studies Group"], "genres": [], "publishers": ["Slitherine"], "esrb_rating": null}