{"id": 392554, "slug": "the-alchemancer", "name": "The Alchemancer", "name_original": "The Alchemancer", "description": "<p><strong>---THE ALCHEMANCER---</strong></p>\n<p>Programming: Bassel Toubbeh, Michael Freaney<br/>Art: Jassin Zaki, Timothy Yabuki<br/>Music: Michael Freaney<br/>Created for the TAGD Fall 2019 Semester Game Jam: \"Chain Reaction\"</p>\n<p>CONTROLS:<br/>Start -  Pause<br/>Left Stick - Move<br/>Bumpers - Swap Potion<br/>A - Drop a potion<br/>CRAFTING:<br/>B - Add current potion to crafting menu<br/>Y - Cancel current craft<br/>X - Craft!</p>\n<p>Defeat an enemy to gain EXP and/or get its elements.<br/>Use those elements to make more potions to defeat more enemies.<br/>Gain enough EXP to level up: (Use WASD to select a buff and press space to select it)<br/>After wave 9, the enemies are randomly generated!</p>\n<p>POTIONS:<br/>Sulfur - Enemies take damage over time! Is it hot in here?<br/>Nitrogen - Slow it all down for a sec!<br/>Oxygen - Get a little extra push when you're being chased!</p>\n<p>Each of these have a \"Greater\" potion, crafted with 2 of the base potion.</p>\n<p>What happens if you craft two different potions together?<br/>Sulfur + Nitrogen - Things get a little more explosive.<br/>Nitrogen + Oxygen - Let's do the time warp again.<br/>Sulfur + Oxygen - Everything seems to be melting.</p>\n<p>ENEMIES:<br/>Basic Slime: Do not touch. Pretty cute, though.<br/>Fire Slime: A little spicier. Drops sulfur.<br/>Nitroshroom: Things get a little slower when you touch these. Drops nitrogen.</p>\n<p>Some enemies react with your potions and explode!<br/>- Fire Slime + Nitrogen potion?<br/>- Nitroshroom + Sulfur Potion?</p>", "metacritic": null, "released": "2019-11-22", "tba": false, "updated": "2019-11-22T05:23:46", "background_image": "https://media.rawg.io/media/screenshots/87f/87f4b5f991136df208ba80aa0cbd5267.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mfreaney24", "Mightymaster99"], "genres": ["Action"], "publishers": [], "esrb_rating": null}