{"id": 392874, "slug": "engine-system-write-up", "name": "Engine System Write-up", "name_original": "Engine System Write-up", "description": "<p>Show us what your project does:<br/></p>\n<p>The project I was working on is UI-System, mainly for Buttons. </p>\n<ul><li>Show us what your classmates would have to do to use your project</li></ul>\n<p>The usage for this system is simply for adding UI to your game. You can make as many buttons as you want. you can add HP bar, MP bar. You can also customize the shape of buttons and change color of the button when you click if you know shader.</p>\n<ul><li>Show us how you used what we have learned this semester to do your project (refer to the project requirements for ideas about what I am looking for)</li></ul>\n<p>For this project, since I have to partly deal with graphics, I have to go over almost everything I have learned during the class including Asset builder, Lua, Binary, Project setting, platform independent/ specific implementation, handler/manager, </p>\n<ul><li>Tell us anything interesting you learned or struggled with while working on the project (refer to the write-up guidelines for ideas about what I am looking for)</li></ul>\n<p>There wasn't anything particular taking a lot of time, but if I give one example finding the way to show UI no matter what the camera position was taught.</p><p>Instruction:</p><p>To add this UI system is very simple. You just need to add tow projects which is UI_package and UI_builder. After including those projects to solution files, setting up references properly, and add one function to Graphic.cpp. The function will be somehow look like below.</p><p>As you can see, the function is almost exactly identical to submit render object. </p><p>After hooking up everything, you need to set up the buttons size through lua file. The setting is pretty easy, As show in the picture below, you just need to decide xy coordination from -1 to 1</p><p>Below are the one of the examples.</p><p>After that, you need register it to AssetsTobuild.lua file and build assets.</p><p>For a program file, First you declare UI class and handle, and initialize at init functions </p><p>Now you have a button on your game. </p><p>If you want to add a functionality to a button, you can use Bind() function to bind it.</p>", "metacritic": null, "released": "2019-11-20", "tba": false, "updated": "2019-11-22T06:41:41", "background_image": "https://media.rawg.io/media/screenshots/fae/fae360603805d9914890da9c9148af24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dropanddrop"], "genres": [], "publishers": [], "esrb_rating": null}