{"id": 393173, "slug": "deify-a-new-sin", "name": "Deify: A New Sin", "name_original": "Deify: A New Sin", "description": "<p>A Souls-Like Game  , Where Revenge is the Key to Survival<br/><br/><strong>Story</strong></p>\n<p>As you wake up in the abyss, you have no memories of who you are or what is going on, an ominous feeling creeps upon you and you must discover what has happened in this cold, dark and mysterious setting.  the world is distorted and twisted into unknown horrors, and what lies in it is something for you to discover.<br/><br/><strong>Gameplay</strong></p>\n<p>we are aiming to make a hack and slash souls like game that emphasises on a strong, involved, enriching and layered story.  fighting through challenging enemies and bosses will just be as important as discovering the deep lore we have created. <br/></p>\n<p><strong>Ascension</strong></p>\n<p>what differentiates us from typical hack and slash game is our ascension mechanic where you have a second chance at claiming your life back.  as you are struck down, you have a small opportunity at a second chance of life by defeating the enemy that defeated you.   Ascension works as a double edge sword, while in this mode your attack is buffed and your movements change, while at the cost of having a gradually depleting  health, the only way to exit this mode will be to get revenge. revenge is the key to survival.</p>\n\n<p>**DISCLAIMER**</p>\n<p><em>--This Game Currently in Prototype State--</em></p>\n<p><em>--Does Not Represent the Final Look--</em></p>", "metacritic": null, "released": "2019-11-19", "tba": false, "updated": "2019-11-22T07:54:16", "background_image": "https://media.rawg.io/media/screenshots/fd3/fd39981ab145c846fd8d079303f79d9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jodysag5"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}