{"id": 393443, "slug": "vekwars", "name": "VekWars", "name_original": "VekWars", "description": "<p>Sometime in the mid-1980s development began on a technology that, had it gone to market, would have changed video gaming as we know it.  A complete virtual-reality system meant for arcades, utilizing twin head-mounted vector monitors of the type used in games such as Battlezone, Tempest and Star Wars.<br/></p>\n<p>Sadly, funding for the project dried up before it reached completion, and the first game for the system - <em>VekWars</em> - never saw the light of day, continuing to exist only in rumor and a handful of blurry photographs from the period.</p>\n<p>But now a team of digital archaeologists based in Austin, Texas have successfully extracted the source code for this game from a dusty 8-inch floppy disk provided by an anonymous benefactor.  We are pleased to present <em>VekWars</em> - fully updated to support modern virtual-reality systems and playable for the first time in over 35 years!</p>\n\n<p><strong>How To Play</strong></p>\n<p>Welcome to the year 2385.  Humanity is locked in a deadly war with the evil Xilorian Empire. The key to winning this war lies in the unique properties of Vektrox Ore.  Found on only one planet in the galaxy, human mining colonies are under constant attack by invading Xilorian forces.</p>\n<p>You are in charge of defending a cache of red ore crates from waves of Xilorian ships that will attempt to steal them.  Your defense turret sits in the middle of a ring of crates, and is equipped with a powerful laser cannon, three missiles, and a shield system to protect you from enemy attacks.  Xilorian saucers may appear at any point around you and will fly in and attempt to steal the crates.  Point at them with your targeting reticule and pull the trigger to fire your lasers and destroy them. If an enemy saucer is taking off with a crate, they will drop it if shot, but be careful not to accidentally hit the crate and destroy it yourself! If all crates are lost, then the game is over. </p>\n<p>Watch out for green enemy fighters that will fire missiles at your turret. Shoot the missiles before they hit you to avoid losing shield energy.  After three direct hits your turret will be destroyed and the game will be over.</p>\n<p>Use the secondary fire button to launch a highly-destructive NovaRocket at the enemy. </p>\n<p>At the end of each attack wave your turret's energy shield is recharged, and a new NovaRocket provided, up to a maximum of three.</p>\n<p><em>DEFEND THE CRATES!</em></p>\n\n<p><strong>CREDITS</strong><br/></p>\n<p>Alex McChesney - Lead Programmer / Lead Designer</p>\n<p>Roberto Pena - Programmer</p>\n<p>Rodrigo Pena - Programmer</p>\n<p>Jared Farney - Composer / Sound Design</p>\n<p>Stephanie Traska - Art<br/></p>\n<p>Paul Gasca - Producer<br/></p>\n<p>Dane Rougeau - UX/UI Design<br/></p>\n<p>Adam Sauer - Title Screen / High Score Table</p>\n\n<p><em>Originally created for VR Austin Jam 2019</em></p>", "metacritic": null, "released": "2019-11-18", "tba": false, "updated": "2019-11-22T09:02:51", "background_image": "https://media.rawg.io/media/screenshots/077/0771689f5f415d1522229f8ae5e16514.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Washing-Up Software Projects", "VideogameScrapbook"], "genres": ["Action"], "publishers": [], "esrb_rating": null}