{"id": 393592, "slug": "five-nights-at-freddys-ar", "name": "Five Nights at Freddy's AR", "name_original": "Five Nights at Freddy's AR", "description": "Five Nights at Freddy’s AR: Special Delivery is the next terrifying installment in the FNAF franchise.  Players will confront malfunctioning animatronics in their real world and attempt to survive these horrors come to life. Through the game, players subscribe to Fazbear Entertainment’s brand new “Fazbear Funtime Service” and get their favorite animatronics on-demand. Due to unfortunate circumstances, the visiting animatronics malfunction and attack subscribers instead of entertaining them.<br/> <br/>Players must confront an endless stream of hostile animatronics that will follow them wherever they go. The question is, how long can players survive? And just what is happening at Fazbear Entertainment? <br/><br/>____________________________________<br/><br/><br/>FEATURES <br/><br/>▶ IMMERSE YOURSELF in terrifying augmented reality audio-visual attack sequences exclusively designed for each animatronic<br/><br/>▶ EXPERIENCE real-time location based gameplay, where FNAF animatronics will pay you a visit wherever you are and wherever you go<br/><br/>▶ SURVIVE animatronic attacks by using your limited resources wisely (including battery, flashlight, and shocker)<br/><br/>▶ COLLECT parts, CPUs, and plushsuits to ASSEMBLE, test, repair and deploy your own hotwired animatronics, and search &amp;  collect remnant in your environment<br/><br/>▶ SEND ANIMATRONICS against your friends and other players, and get the highest streak on the leaderboard<br/><br/>____________________________________<br/><br/><br/>Additional Notes:<br/>- Please note that FNAF AR: Special Delivery is free to download and play, but offers some game items for purchase with real money. If you don’t want to use this feature, please disable in-app purchases.<br/><br/>Play recommendations:<br/>- It is recommended to play while connected to a network in order to obtain accurate location information.<br/><br/>Compatibility:<br/>- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks.<br/>- Current device compatibility list can be found at https://illumix.com/supported-devices-2/<br/><br/>Privacy Policy:<br/>https://illumix.com/privacy-policy/<br/><br/>Terms of Use:<br/>https://illumix.com/tou/", "metacritic": null, "released": "2019-11-21", "tba": false, "updated": "2019-11-25T02:23:59", "background_image": "https://media.rawg.io/media/screenshots/4f8/4f8dc1d40b287bb6043bd4e4e04f9e20_ZDiya2I.jpg", "website": "https://www.fnafar.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Illumix"], "genres": ["Strategy"], "publishers": ["Illumix"], "esrb_rating": "Teen"}