{"id": 393538, "slug": "the-amazing-tks-suburban-nightmares", "name": "The Amazing T.K's Suburban Nightmares", "name_original": "The Amazing T.K's Suburban Nightmares", "description": "The Amazing T.k's Suburban Nightmares<br/>\n<br/>\r\nInspired by the horror/slasher pop culture from the 80's, this multiplayer survival horror pits players against each other in suburban landscapes. Other players aren't the only danger. A serial killer and plenty of copycat psycopaths that he's inspired are still terrorizing victims. Players collect the souls of the enemies they kill or find; the person with the most at the end of the match wins. Each map accommodates four players locally and have AI characters with unique weapons and statistics.<br/>\n<br/>\n<br/>\r\nGAME STORY :   <br/>\n<br/>\r\nA decade after suburbia had its worst nightmares brought to life in the form of a string of missing persons cases, rapes, and murders, at the hands of the now infamous \"Suburban Salsher\",  the nightmarish events are starting up again and with a higher body count due to a serial killer worshiping cult-like group on the rise calling themselves H.A.T.E (Humans.Are.Truly.Evil).<br/>\n<br/>\r\nThe protagonist - Delancey Dekker, survivor of the original Suburban Slasher killings and now private investigator, returns to her childhood suburban neighborhood with her close associate while on a new case that seems all too familiar.  Her goal : save as many lost souls as possible before they are claimed by evil.", "metacritic": null, "released": "2019-12-24", "tba": false, "updated": "2019-11-25T01:58:51", "background_image": "https://media.rawg.io/media/screenshots/3d3/3d38cf3d2020baf9cb8e6d4d2a735414.jpg", "website": "https://www.theamazingtk.org", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Amazing T,K"], "genres": ["Action"], "publishers": ["The Amazing T.K"], "esrb_rating": null}