{"id": 393595, "slug": "mazeescape-adventure", "name": "MazeEscape Adventure", "name_original": "MazeEscape Adventure", "description": "-----<br/>MazeEscape Adventure is a classic text adventure game that hearkens back to the earliest days of personal computers: pixel graphics, 8-bit sounds, and choose-your-own adventure storytelling.<br/><br/>Navigate the maze as an intrepid explorer while avoiding dragons, trolls, and bottomless pits. Win mini-games and collect treasures to emerge from the maze, save history, and successfully complete the storyline.<br/><br/>For iPhone 7 and up. Swipe-based navigation. No internet connection required. No in-app purchases or ads.<br/><br/>-----<br/><br/>Hoping to turn back time on technology, science, and progress, Time Terrorists have stolen the designs for the MOS 6502 microprocessor and locked them in a time vault deep underground.<br/><br/>Since their theft, computers have stopped working. Technology companies are disappearing. Titans of the Information Age have vanished. <br/><br/>To stop the forces of evil, you must venture underground, find your way through the Great Underground Maze, and return the MOS 6502 designs to their rightful place in computer history.<br/><br/>-----<br/><br/>From the development team at Zindango:  <br/><br/>\"MazeEscape Adventure hearkens back to the classic days of interactive fiction and early 8-bit video gaming. Taking these as our game palette, our goal was to craft an experience that instantly felt familiar to classic console gamers and extend it to the world of mobile-gaming through swipe-based movement, treasure hunting, and puzzle solving. <br/><br/>\"The storyline of MazeEscape combines classic elements of interactive fiction -- caves, trolls, wizards, and dragons -- with the larger historical narrative of the MOS 6502 microprocessor and its astounding impact on the computer revolution. This little processor powered the most famous machines in personal computer history, including the Apple II, Commodore 64, Atari 2600, and Nintendo Entertainment System. <br/><br/>\"In a very real sense, the team that built the MOS 6502 changed the world. We tried to pay homage to their work in a fun, compelling way through our use of historic screen colors, pixel graphics, and font type. We wanted the game experience to evoke the look and feel of playing on a computer from the late 1970's or early 1980's -- one that actually could have been powered by the MOS 6502.\"", "metacritic": null, "released": "2019-11-14", "tba": false, "updated": "2019-11-25T02:25:26", "background_image": "https://media.rawg.io/media/screenshots/e1a/e1af35bc4aca2105faaba8408510f079.jpg", "website": "http://zindango.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zindango"], "genres": ["Adventure", "RPG"], "publishers": ["Zindango"], "esrb_rating": "Everyone 10+"}