{"id": 393616, "slug": "class-clown", "name": "Class Clown", "name_original": "Class Clown", "description": "<p>yOu MuSt HeLp Me I hAtE cHiLdReN</p>\n<p>Sorry, I was not able to get some really important things done. I made the main title music but no sound effects, and also, the MOST IMPORTANT thing has not been worked out yet... it was working before, but something I changed before I uploaded it ruined it... the kids are supposed to giggle at you from time to time, which makes you have to hide from the teacher, but something I changed made them stop doing it, so the game is REALLY EAST right now.</p>\n<p>Also, I wasn't able to add the tutorial, which would have added greatly to the story and made the game a little more understandable if you didn't read the intro.</p>\n<p>TO PLAY:</p>\n<p>LEFT and RIGHT make you reach for the paper the girls throw you to add to your ammo, but since this doesn't work yet, you get a large amount of ammo to start.</p>\n<p>UP stands up.</p>\n<p>DOWN makes you sit.</p>\n<p>SPACE is the FIRE button. If you hold it while standing, you can fire a spitball at the teacher (by letting go of the button when the star is over the green spot). By hitting it while sitting, you can moon the teacher.</p>\n<p>The more you hit the teacher with spitballs, the more your classmates will look back at you (although this doesn't seem to work fully right now for some reason). If you moon her while classmates are looking, an INSANE CLOWN will begin approaching the class. If you are able to get him close enough to the window, he will kill everyone, and you win.</p>\n<p>If the clock reaches 3, everyone leaves, and you lose.</p>\n<p>Sorry, but whether you win or lose, right now it seems as though the game doesn't go back to the title screen.</p>\n<p>I PROMISE I'LL FIX IT AS SOON AS POSSIBLE!!!!! BUT I'M GOING TO SLEEP NOW! I HAVEN'T SLEPT FOR A FORTNIGHT!!!!!!!!!!!!!!!!!!!!!!!!</p>", "metacritic": null, "released": "2019-11-24", "tba": false, "updated": "2019-11-25T02:30:37", "background_image": "https://media.rawg.io/media/screenshots/19f/19f88601fd33a16e4ff8a29caedad5f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KalimanusTheWanderer"], "genres": ["Action"], "publishers": [], "esrb_rating": null}