{"id": 393927, "slug": "chikaro-di-xia-lou", "name": "Chikaro / 地下楼", "name_original": "Chikaro / 地下楼", "description": "Chikaro / 地下楼\r\nThe First Contact Demo\r\n\n<p><strong>* This project is in development. </strong></p>\n<p><strong>* \"The First Contact Demo\" contains the first part of this game.</strong></p>\n<p><strong>* Currently it supports Japanese only. </strong></p>\n\n<p>　「地下楼」は、光の表現を取り入れたドット絵のグラフィックが特徴の「幽体離脱2Dアクションゲーム」です。プレイヤーは幽体離脱のアクションを駆使して敵やギミックを操作しながらフィールドを探索します。<br/></p>\n<p>　文明が崩壊した後の世界を舞台に、主人公の「ヨカゼ」と、アンドロイドの「シグモ」が文明の残滓を辿り、過去の人物たちの残留思念を読み解き、世界の謎を解き明かしていきます。</p>\n\n<p>Chikaro is a 2D action game featuring pixel art graphics that incorporate light expressions. The player uses the action of out-of-body experience to explore the field by manipulating enemies and gimmicks.</p>\n<p>The stage is the world after the civilization collapses. The main character Yokaze and the android Sigmo follow the remnants of civilization, read the remaining thoughts of the past people, and solve the mysteries of the world.</p>\n\r\n■  ストーリー / STORY\r\n<p> 文明崩壊後の世界。</p>\n<p> 地上には\"アモルファス\"と呼ばれる自律式ロボット兵器が闊歩し、大半の人々が地下避難施設「地下楼」へ収容されてから、すでに100年もの時間が経っていた。</p>\n<p> 霊能力を持つ少年ヨカゼは、山奥の遺跡の中で目覚める。記憶喪失の彼は、同じく記憶喪失のアンドロイドの少女シグモと出会う。</p>\n<p> 敵を倒し、仕掛けを解きながら遺跡を脱出したふたりは、自分たちが何者なのか知るため、荒廃した地上を旅することを決意した。</p>\n<p> 過去、この世界に何が起こったのか。その情報はほとんど伝承されていない。しかし、ヨカゼはその霊能力によって過去に生きていた人々の残留思念を読み取ることができる。</p>\n<p> 記憶を読み解き、文明の残滓を辿る。自分たちの出自を知るための二人の旅は、やがて世界の謎の中心へと繋がっていく。</p>\n\n<p>The world after the collapse of civilization.</p>\n<p>An autonomous robot weapon called \"amorphous\" dominates on the ground. Almost 100 years have passed since most people were detained in the underground evacuation facility \"Chikaro\".</p>\n<p>Yokaze, a boy with spiritual ability, wakes up in the ruins of the mountains. He has lost his memory and meets an android girl Sigmo who also has lost her memory.</p>\n<p>The two defeated the enemy and escaped the ruins while solving the mechanism. They decided to travel on the devastated earth to find out who they were.</p>\n<p>What happened to this world? It is hardly handed down. However, Yokaze can read the residual thoughts of those who lived in the past by his spiritual ability.</p>\n<p>He reads the memory and follows the remnants of civilization. Their journey to know their origin will eventually unravel the mysteries of the world.</p>\n\n<p>Twitter: @ruccho_vector</p>\n<p>Official Website: https://ruccho.github.io/chikaro<br/></p>", "metacritic": null, "released": "2019-11-23", "tba": false, "updated": "2019-11-25T03:45:21", "background_image": "https://media.rawg.io/media/screenshots/418/418d2b27bae829588ea0b55010bbe392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ruccho"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}