{"id": 394026, "slug": "unrivalled", "name": "Unrivalled", "name_original": "Unrivalled", "description": "<p>Welcome to Unrivalled, a modern FPS multiplayer and singleplayer shooter.</p>\n<p>The main character of an FPS is not your soldier or the character you play with, but your weapon. That's why this game is built on the idea of offering maximum weapon customization for all playstyles. <br/>Unrivalled is still in an early alpha stage, and it''s being developed by only one person, so progress will be slow and the quality of the visuals and animations will not be closed to AAA studios. However, this does not mean the game is not fun. <br/>As of right now, only the range is available for you early testers to try out the controls. In the future two more major sections will be added (multiplayer and against AI) with several modes and maps on each.<br/>As well as that, more weapons and attachments will be added, together with other things such as different character, weapon camos, and who knows what else.<br/>So what are you waiting for, just hit one of the play buttons and try it yourself! As always, feedback is appreciated and also if you want to collaborate to have your weapon skins, SFX, icons or whatever in the game just get in touch with me on some of my social media.<br/>Daniel Abeleira, 22.11.2019</p>\n<p>Do you have any 3D modeling, 2D art or music skills and are willing to commit to a project just for the fun of it? Join the Unrivalled Development Team and start helping speed up the development!</p>", "metacritic": null, "released": "2019-11-22", "tba": false, "updated": "2019-11-25T04:10:31", "background_image": "https://media.rawg.io/media/screenshots/88a/88ac80dfe7ac5a07658f2c00c093c880.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Delthor Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}