{"id": 394132, "slug": "in-the-valley-of-death", "name": "In the Valley of Death", "name_original": "In the Valley of Death", "description": "\n\n\n\n<p>In the Valley of Death is a top-down dual stick shooter with mechanics similar to Hotline Miami and Nuclear Throne, with a presentation inspired by uber violent pieces of entertainment such as Sin City and Mad World.</p>\n<p>Where the game sets itself apart though is the color mechanic; only red kills red and only blue can kill blue, and while the game starts out simple (play as one character, then another), you end up controlling both Red and Blue simultaneously, with each one only holding weapons opposite their own colors, so they have to protect one another and you constantly have to keep moving as a result.</p>\n<p>The story is being told through narration by Orange and Green as they sit in the bar waiting for someone to arrive, so they pass the time by sharing pub stories about the legendary exploits of Red and Blue.</p>\n<ul><li>Unique fast-paced run and gun (and melee) action.</li><li>Diverse enemies and levels that keep you changing your approach.</li><li>Bosses with different behavioral patterns and a different color (purple), forcing you to find the weak spots as you try and figure out how to defeat them. </li></ul>\n<p>The demo provided only has joystick support, and while the game is difficult I assure you it is beatable. There is no music and almost no sound effects as I'm yet to get a composer, will be next on my to do list once I'm done getting feedback.</p>\n<p>I hope to hear from you, and I look forward to your feedback.</p>\n<p>Thank you for your time, everyone.</p>\n<p>Gypsy.</p>", "metacritic": null, "released": "2019-11-22", "tba": false, "updated": "2019-11-25T04:37:03", "background_image": "https://media.rawg.io/media/screenshots/be9/be93e24cd2893e7c31719a0900c10014.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gypsy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}