{"id": 394260, "slug": "song-of-the-valkyries", "name": "Song of the Valkyries", "name_original": "Song of the Valkyries", "description": "<p>\"The Song of the Valkyries is not the music you or I cherish -- it is the symphony of battle: the clang of weapons, the splintering of shields, and the death throes of those who will be judged. The only instruments they know are those of war, and none wield them finer.\"</p>\n<p>A cult has seen fit to raise the dead, disrupting the balance within the realms. The legendary Hildr, a champion of the Valkyries, has been sent down to Midgard to intervene.   </p>\n<p>The game was inspired by God of War and was created for the 2019 Epic MegaJam in 3 days. </p>\n<p>The game features music by the excellent Scott Buckley www.scottbuckley.com.au.</p>\n<p>Controls:</p>\n<p>WASD - Movement</p>\n<p>Left Mouse Button - Primary Attack</p>\n<p>Right Mouse Button - Shield Block</p>\n<p>Q - Cleansing Fire (Two-part fiery axe flourish) 5 Second Cooldown</p>\n<p>E - Runic Blast (Ranged shield blast - holding RMB allows you to aim it in the direction of the camera. Otherwise, the blast simply emits directly forward from Hildr) 8 Second Cooldown</p>\n<p>X - Wrath of the Aesir (Ultimate ability that gives Hildr increased damage and knockback on slain opponents after an immensely powerful AOE blast) 30 Second Cooldown</p>\n<p>Hildr's thirst for battle causes her to heal a small amount of health after killing an enemy. Use this to sustain yourself. Don't underestimate the power of quick blocking and rapid camera movement. The game requires tight timing and positioning to land attacks and block incoming damage. If you feel like you're missing attacks or not blocking damage, make sure you're aiming the axe and shield properly with the camera (and are within range). </p>", "metacritic": null, "released": "2019-11-22", "tba": false, "updated": "2019-11-25T05:13:01", "background_image": "https://media.rawg.io/media/screenshots/df1/df17c2a6788085c590a6068f7e3def15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CuddleBadger"], "genres": ["Action"], "publishers": [], "esrb_rating": null}