{"id": 394380, "slug": "epic-journey-dragon-land-legend-thrones", "name": "Epic Journey : Dragon Land & Legend Thrones", "name_original": "Epic Journey : Dragon Land & Legend Thrones", "description": "<p>Escape the ancient temples in Epic Journey: Lost Valley Puzzle Escape that are full of challenges and mysterious puzzles. This room escape game will surely challenge your puzzle escaping ability. One of the best escape games ever! See why we have been globally featured and adored by millions. Room escape puzzle game that will completely challenge your mind, captivate you &amp; offer hours of amazing mobile gaming entertainment.</p>\n<p>Epic Journey: Lost Valley, Escape Puzzle Epic Journey is a role-playing fantasy badland puzzle journey offline game set in a long-forgotten lost valley world to explore dragon’s world. Explore the ruins of an ancient monument, unravel well-kept secrets and uncover the mysteries.</p>\n<p>In Epic Journey: Lost Valley, Epic Legend Journey is RPG Puzzle &amp; Survival Game, you will solve challenging puzzles and guide Ethan in his badland forsaken destiny through a valley to explore the dragon mysteries in lost valley badland that in turn will help to defend Kingdom from Army of Dead Walkers.</p>\n<p>The lost survival adventure is back!</p>\n<p>BEAUTIFUL LOST LAND<br />\nYour journey will take you from deserts and oasis to old crumbling ruins of a mysterious civilization.</p>\n<p>STORY-TELLING<br />\nMonument Journey: Escape Puzzle – Epic Legend Journey Game combines captivating storytelling, breath-taking 3D visuals and exciting game play into one massive RPG adventure survival escapes that you will never forget.</p>\n<p>Escape the ancient valley of monuments in Puzzle Escape that are full of challenges and mysterious puzzles. This room escape offline game will surely challenge your puzzle escaping ability.</p>\n<p>INDIVIDUALLY CRAFTED RIDDLES<br />\nEnjoy beautiful levels filled with meditative puzzles, using brand new interactions to explore the changing dynamics between characters.</p>\n<p>In Epic Journey: Lost Valley – Epic Legend Journey game you solve stunning 3d monument puzzles of escape game difficulty; discover a breath-taking, explore lost world , ready to be unearthed of brawl badland. One of the best escape offline games ever! Adventure monument room escape puzzle that will completely challenge your mind, captivate you &amp; offer hours of amazing mobile gaming entertainment.</p>\n<p>Explore 8 grand chapters packed with escape puzzles &amp; brawl badland. Experience the best in this excellent combination of Odyssey escape games and 3D relaxing puzzle games</p>\n<p>FORGOTTEN VALLEY OF DRAGONS<br />\nMysterious Fantasy land of dragons is about to uncover. It’s time to explore village of dragons and free them from sins. Traverse across sun-swept landscapes, Land of dragons and explore massive temple ruins, dark ancient arcane arena and more!</p>\n<p>TABLET SUPPORT<br />\nLost Valley is optimized for both tablets and phones.<br />\nBegin the adventurous Journey what comes before the earth last day ! Get ready to flex your mental muscles and be wow’ed in Monument Journey : Escape Puzzle – Epic Legend Journey survival escape Game today.</p>\n<p>Epic journey is offline game. Enter all new astonishing world of valley escape games &amp; puzzles in Epic Journey brawl badland!</p>", "metacritic": null, "released": "2018-10-29", "tba": false, "updated": "2019-11-25T08:17:32", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": [], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": "Everyone"}