{"id": 394393, "slug": "the-legend-of-pirates-online", "name": "The Legend of Pirates Online", "name_original": "The Legend of Pirates Online", "description": "<p>The Legend of Pirates Online (TLOPO) is a fan-made recreation of Disney&#39;s Pirates of the Caribbean Online. The purpose of the project is to recreate the original game, using the original files that we have, to return the game to the state it was in on its very last day. In addition, we will be continuing to add new features and gameplay that honor the spirit of Pirates Online while keeping things fresh.</p>\n<p>Our journey began as a small group of nostalgic fans who wished to replay the game once again, just like many of you. We knew next to nothing about running an online game, but we decided to take on the challenge of recreating Pirates Online anyway, not just for our enjoyment, but also in hopes of returning the game to all the people who still longed to sail the Caribbean again.</p>\n<p>As time went on, more team members joined our crew and we became quite the cohesive organization, with members from all over the world, with all sorts of backgrounds. As we continued to learn from our successes and our mistakes, we became extremely confident that our group would be able to accomplish the daunting challenge of recreating our long lost game.</p>\n<p>We went into Open Beta on September 19th, 2017, exactly four years after the closing of Pirates Online. Since then, we have added back most of the existing features that were present in the original game, as well as some of our own elements, like new caves, weapons, and quests. However, our top priority is to fix as many bugs as we can and get the remaining original game features finished up and ready for full release!</p>\n<p>We&#39;ve had such a great time on this journey with you all and we can&#39;t wait to continue it!</p>", "metacritic": 60, "released": "2017-09-19", "tba": false, "updated": "2019-11-29T23:10:35", "background_image": "https://media.rawg.io/media/games/980/980787f6c94009630404e8bea340cc33.jpg", "website": "https://tlopo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Indie"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Independent"], "esrb_rating": "Everyone 10+"}