{"id": 394415, "slug": "iratus-lord-of-the-dead-supporter-bundle", "name": "Iratus: Lord of the Dead - Supporter Bundle", "name_original": "Iratus: Lord of the Dead - Supporter Bundle", "description": "<p>In Iratus you find yourself fighting for the forces of darkness in the role of the titular necromancer—Iratus, recently freed from his millennia-long imprisonment.<br />\nYou control an obedient army of the living dead, with skeletons, zombies, banshees and many other unliving warriors. Create your soldiers the only way a necromancer knows how: from the body parts of your slain enemies!<br />\nExpand and improve your underground lair. Strengthen your servants by researching secret rituals. Explore the twisted corridors and underground catacombs, and battle against lobotomized miners, greedy dwarves and corrupt mercenaries. Aid Iratus in his quest to recapture and eclipse his former power. Lead him to conquer the forces of good and unleash an eternal kingdom of death upon the world!<br />\nThe sheer variety of tactical and strategic options makes Iratus a true treat for any ardent fans of the roguelike genre.<br />\nPlay on the side of evil, embodied by the necromancer Iratus!<br />\nCraft minions from the body parts of your conquered enemies.<br />\n17 types of obedient servants: zombies, vampires, skeletons, mummies, banshees and many more!<br />\nAdvanced combat system: to win you need to know both the strengths and weaknesses of your troops and enemies.<br />\nIratus can kill his enemies not only by magic or claw but also by draining their sanity!<br />\nEach minion has six unique abilities for a total of nearly one-hundred abilities for you to command.<br />\nFour talent trees that alter the way you play: Alchemy, Magic, Wrath and Destruction.<br />\nExpand and improve your underground lair.<br />\nRoguelike elements: minions that die are gone for good and the game saves automatically, making each choice irreversible.<br />\nDetailed 2D graphics and a gloomy atmosphere of dark fantasy.<br />\nVarious difficulty levels, satisfying every type of player from novice to hardcore.<br />\nIratus himself is voiced by the voice-acting legend Stefan Weyte, famous for his performance as Caleb in the cult game series &quot;Blood&quot;!<br />\nIratus: Lord of the Dead - Supporter Pack<br />\nThis is a collection of bonus content for those who wish to go the extra mile to support the developers of Iratus: Lord of the Dead. As the game evolves, more items will be added to the Supporter Pack during the development period.<br />\nWhat do I get as a supporter today?<br />\nThe entire „Iratus: Lord of the Dead“ soundtrack. Gloomy, foreboding and evocative: Feel like the vexed necromancer Iratus himself while listening to the game’s epic soundtrack!<br />\nExclusive skins for all the minions. Would you like your undead servants shiny, more putrid or extra repulsive? These skins give you more options to assemble the undead freak show of your dreams.<br />\nExclusive minion —“The Infested”.<br />\nWhat will I get in the future?<br />\nThe official „Iratus: Lord of the Dead“ artbook and strategy guide. Get exclusive insights into the development history of Iratus and tweak your tactics to beat even the most difficult challenges the game has to offer!<br />\nThank you from the bottom of our hearts for your support!</p>", "metacritic": 78, "released": null, "tba": false, "updated": "2020-09-30T12:27:34", "background_image": "https://media.rawg.io/media/screenshots/d78/d781b727a15947967ec923787d2ad46d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 560, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Unfrozen"], "genres": ["Action"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}