{"id": 394506, "slug": "altcoin-fantasy", "name": "Altcoin Fantasy", "name_original": "Altcoin Fantasy", "description": "<p>Altcoin Fantasy is an app to learn about cryptocurrencies and crypto trading. Our simulator is real time and we host weekly fantasy trading competitions with players from all around the world via our paper trading app. We're a portfolio maker and let you test out how you do against other players in the world!<br/><br/>How much does this cost? What's the catch?<br/>Nothing! We award you with free daily Kin credits to compete with other players. You may need to watch an ad from time to time for free. If you'd like to skip ads, you can pay for a Gold membership.<br/><br/>All players start with a fantasy portfolio and they can purchase/trade any crypto/tokens they like during the trading competition. Tools such as descriptions, real time charts 📈, news, crypto alerts/crypto alarms are available. Players with the most gain in their fantasy portfolio at the end of the competition will win 🏆and become a crypto pro. Players can also redeem rewards just by using our app and get FREE digital collectibles and more 🎉🎉🎉!<br/><br/>Our simulator features real time prices of different cryptocurrencies such as (but not limited to): Bitcoin, Ethereum, XRP (Ripple), Stellar, Bitcoin! Cash (BCH), Litecoin (LTC), EOS, Binance, Cardano (AD), Tron (TRX), Monero, Cash, IOTA, and many, many more!<br/><br/>Practice, trade and win on the most realistic Bitcoin and cryptocurrency simulator available, risk-free and get rewarded for improving your knowledge and skills!</p>\n<p>Use our tools such as crypto live charts, crypto price alerts and descriptions to learn about each coin.<br/><br/>Practice making trades on our free simulator.<br/><br/>Join our free fantasy trading contests, become a top trader and win real prizes.</p>", "metacritic": null, "released": "2019-11-28", "tba": false, "updated": "2019-11-29T02:19:15", "background_image": "https://media.rawg.io/media/screenshots/ea4/ea4d70ab38e49af64b944b038a019488.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Altcoin Fantasy"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}