{"id": 394517, "slug": "faster-than-death", "name": "Faster Than Death", "name_original": "Faster Than Death", "description": "<p>Welcome to the Pre-Alpha version of FASTER THAN DEATH !</p>\n<p>Play as a robot sent into a dark game show where you will have to run against time and use the different skills at your disposal to keep your speed and not let your battery run out. </p>\n<p>GAMEPLAY :</p>\n<p>To run the fastest possible and keep momentum you will be able to use different skills : jump, dash and a grappling hook. If the player is not fast enough and time is running out, he dies and start from the beginning.</p>\n<p>Between each levels, you can upgrade your skills and unlock new ones.</p>\n<p>You will have to face ennemis but they can’t kill him, only slow him down. In some levels there are also special rooms offering items. Therefore you will have to make a choice, will you try to get the item but loose some time or will you rush for the end.</p>\n<p>ROGUE LIKE MECHANICS :</p>\n<p>The game is organised in levels themselves organised in rooms. The levels and rooms are chosen randomly from all the rooms ensuring the renewal of levels and games. If you not fast enough and time is running out, you will die and start from the beginning.</p>\n<p>The game is still in development and a lot of things can change. If you liked the game or want to give us feedbacks you can join our discord server : https://discord.gg/QfcCWjQ</p>\n<p>If you like to stay updated you can follow our twitter : https://twitter.com/GamesHaro</p>", "metacritic": null, "released": "2019-11-28", "tba": false, "updated": "2019-11-29T02:21:29", "background_image": "https://media.rawg.io/media/screenshots/a23/a23ea1c56030cb5e9b983b4cb96e25c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["HaroGames"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}