{"id": 394650, "slug": "she-awaits-v-001", "name": "She Awaits v. 0.01", "name_original": "She Awaits v. 0.01", "description": "<p>She Awaits is a traditional style Yume Nikki fangame, it was originally developed for Dream Diary Jam 3 in the summer of 2019.</p>\n<p>(I'm rather new to itch.io, so I wasn't sure how to update the old version. So, I'm just making this a new project.)<br/></p>\n<p><strong>This is version 0.01</strong>: Most of the updates in this version are me cleaning up the mess I made in 0.00: a better installer, small bug fixes involving the cards, face graphics for Noelia, and making improvements on the existing dream worlds, mostly. <br/></p>\n<p>There are no truly new areas, effects or events, although the chapel has been so heavily re-done (new tileset, new map) it may as well be new.  If you enjoyed the old tileset from that map: I will be bringing it back in a future update (although on a different map) but it wasn't really what I had originally envisioned for that map.<br/></p>\n<p>You'll also notice a lot more construction cones in this version.   There's a lot of places where I'd like to connect new dream worlds, but I don't currently have time to make them (or in a few cases the area is heavily tied to a card that isn't available yet).<br/></p>\n<p>That being said, I do have very big plans for 0.02!  I have no idea when I'll actually have time to work on that update, but I'm hoping to slowly work on it in 2020.</p>\n<p><strong>Thanks for your support! </strong> Let me know what you'd like to see in the next version. <br/></p>", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2019-11-29T02:54:20", "background_image": "https://media.rawg.io/media/screenshots/153/1531f6393cec3bf0332619cc3d5129f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rayinpixels"], "genres": [], "publishers": [], "esrb_rating": null}