{"id": 394719, "slug": "mighty-games", "name": "Mighty Games", "name_original": "Mighty Games", "description": "<p>This is part of an ongoing RPG Maker MV project I call MightyGames. The game on display is \r\ncalled Solo Pro. It's currently includes solitare versions of board games that can\r\n be fairly easily incorporated as mini-games in your own game projects. \r\nIt's main purpose is as a proof of concept &amp; to demo the potential \r\nof the MightyMouse system though it tweaks it substantially to make \r\nthings work smoothly. <br/></p>\n<p>So far Solo Pro includes only  checkers &amp; chess but \r\nit's very possible that I will expand it as time permits. If you've \r\never played yourself at chess or checkers you should find some fun in it\r\n though again its main purpose is as a demo for drag &amp; drop in MV. <br/></p>\n<p>\r\nThis entire project folder will be available to patrons at my $3 \r\ntier. Get it there &amp; you get access to the latest version of my MightyMouse plugin as well as my other tier 1 plugins &amp; resources for free. Updates for this project will always make it to patreon first even if you buy it here.<br/></p>\n<p>Feel free to make any edits you need to or try to expand upon it \r\nfor use in your own games. Just don't try to re-release it on its own or\r\n as your own.  To credit me just show something like \"Featuring MightyGames by Kingpin RBD\" at some point such as your download page or in-game credits.</p>\n<p>Installing MightyGames is simply a matter of enabling the \r\nMightyMouse &amp; MightyGames scripts then copying over the maps &amp; \r\nresource files. Create a transfer to the 'Setup' map to start &amp; \r\nedit one of the 'System' events on each game map to tell it what to do  on exit \r\nsuch as transfer to your game room map. I advise you remove party sprites before the transfer &amp; set them back after. <br/></p>\n<p>Note: Version 1.1 will have a built-in transfer system you can use such as talking to an npc on a map then returning to that npc on exit. Look out for that update. It will hit patreon &amp; here at the same time.</p>\n<p>The next expansion to the MightyGames project will to be a room builder mini-game. Ideally, it will be very sims-ish.  You start in an empty home or room. Enter edit mode, buy furnishings, then drag &amp; drop them into place. Once you leave edit mode it let's you interact with you're new place.<br/></p>\n<p>Mighty Games Latest Version<br/><br/></p>", "metacritic": null, "released": "2019-11-26", "tba": false, "updated": "2019-11-29T03:12:09", "background_image": "https://media.rawg.io/media/screenshots/c3c/c3c05d36e9309c6a988000820ab3fa54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kingpin RBD"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}