{"id": 394776, "slug": "mjaumaskin", "name": "MjauMaskin", "name_original": "MjauMaskin", "description": "<p>A Game created in about 5 days to bring awareness to the JingleJam charity stream.<br/>This game is not endorsed or affiliated with JingleJam or Yogscast!</p>\n<p>Link to the donationpage will be added to the game as soon as its available<br/></p>\n<p><strong>Backstory</strong><br/>In a small cabin in the woods on a frosty night you, the JingleCat oracle take care of your precious singing cats. <br/>These singing cats songs are the source of the classic and sought after JingleCat videos on the cyberspace but the cats only sing when they are feed and looked after!<br/>Take care of the cats, make them sing and save Christmas!<br/><br/><strong>How to Play<br/></strong></p>\n<p><strong>There is a TL;DR version of this text in the game! Access this by pressing the \"Info\" button to the left of the fireplace<br/></strong></p>\n<p>Feed the cats when they tell you they are hungry. You can see this from a small speech bubble above them with a small knife and fork in it.<br/>Let the cats sleep when they are tired. they tell you they are tired with the same speech bubble but with two Z:s in it.<br/></p>\n<p>Buy food from the catalogue in the bottom right corner of the screen.<br/>Press the images of the foods you want and these will appear in your inventory once you close the catalogue by pressing the shop icon again.</p>\n<p>To feed the cats, pick up the food and place it on the floor near a cat. You cant force feed the cats, they eat if they want and some times that will take some time.<br/><br/>If the cat poops or pukes, pick it up with the orange poopscoop in the bottom left of the screen by clicking it and then click on the poop/puke.<br/><br/>If the cat does something you dont want them to do, like sleeping, running around etc. then use the watersparay and spray them. The waterspray is used in the same way as the poopscoop</p>\n<p>When your cats are feed and rested they develop the need to sing. This will be shown by a speech bubble with two notes in it. <br/>When this happens pick up the microphone from the MjauMaskin in the top right and then press the cat that wants to sing. The cat will then sing for as long as it wants to and when its done it will just stop.<br/>PS you can make the cats sing before they explicitly tell you they want to but these songs will often be much shorter.</p>\n<p>The MjauMaskin runs on steam so you need to put logs in the fireplace to make it turn on. this is shown by a On/Off sigh on the MjauMaskin.</p>\n<p>You can buy new cats by pressing the new-cat button to the left of the catalog in the bottom right corner. <br/>Here you have to give the cat a name and a color. If you dont do this you cant buy the cat!<br/>The first four cats are free but after that the cats price will start at 200 and increase by 100 per new cat<br/><br/></p>\n<p>Please leave feedback on the game in the comments or to info@squidishhead.com if you dont have a Itch.io account! <br/>Also feel free to subscribe to my Itch-page for updates on new games!<br/></p>", "metacritic": null, "released": "2019-11-26", "tba": false, "updated": "2019-11-29T03:24:51", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d053e2eef040ba6948ce8bee79e419e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Squidishhead"], "genres": [], "publishers": [], "esrb_rating": null}