{"id": 394732, "slug": "perspective-itch-lightshadows", "name": "PERSPECTIVE (itch) (Light&Shadows)", "name_original": "PERSPECTIVE (itch) (Light&Shadows)", "description": "<p>Aris es un personaje sin sexo definido el cual debe tratar de escalar una torre gigante siendo parte de un reto mortal para poder proclamar el trono de su pueblo. Esta torre es un simbolismo de  sus pensamientos y miedos más profundos, además que al explorar y subirla, de una forma está llegando a conocerse a sí mismo y a su pueblo.  <br/></p>\n<p><strong>OBJETIVO: </strong>Tratar de escalar una  torre gigante llena de puertas, donde deberás encontrar las llaves escondidas que te permitirán abrirlas para poder llegar a la cima de la torre y  poder proclamar el trono de tu pueblo.<br/></p>\n<p><strong>MUNDO/LORE: </strong>Es un mundo de perspectivas, el cual puede ser manipulado  a la vista que el usuario quiera  para poder  ser  explorado, la noche llega después de cierto punto en la torre, el juego tiene un ambiente lleno de misticidad y  fantasía, al estar rodeada de  flora y fauna  mágica, con plataformas flotantes y pueblerinos.</p>\n<p>El mundo está diseñado con un estilo minimalista, con elementos de color pastel con el objetivo de que este proyecte armonía al momento que el usuario lo juegue.</p>\n<p><strong>PRSONAJES: </strong></p>\n\n<p><strong>Aris:</strong> Nombre proveniente del griego que significa  “mayor logro” , es el personaje principal de la historia, es una criatura misteriosa que no da pistas de como es, solo es un “ente” tratando de encontrarse a sí misma e identificarse.</p>\n<p>Es la heredera al trono del pueblo de los pueblerinos ajolotes que habitan en una torre, pero para poder proclamarlo necesitará demostrarle a su gente, que posee la sabiduría necesaria, al igual que un conocimiento de sí mismo que le permite reinar sin miedos.</p>\n\n<p><strong>Pueblerinos</strong>: Pequeños ajolotes con túnicas que habitan en la torre,  son extremadamente sabios y autosuficientes, no buscan riquezas y poder, su principal meta de la vida es trascender. Serán de gran ayuda para Aris  ya que le proporcionarán pistas para que pueda lograr cumplir con el reto y no morir.</p>\n\n\n<p><strong>Sauce sabio: </strong>El es árbol más antiguo del pueblo y sus años de experiencia le han dado una sabiduría que le ha permitido ayudar a guiar a todos los reyes que han gobernado en el pueblo a lo largo de su fundación.</p>\n\n<p><strong>AUDIENCIA: </strong>Personas desde los 18 años hasta los 23 años con un gusto por los juegos que conllevan un desafío mental, al igual que un juego con una narrativa bien construida debido a que es un sector con mayor madurez en busca de juegos que no caigan en lo convencional.</p>\n<p><strong>CONTROLES: </strong></p>\n<p><strong>Arriba: </strong>Saltar</p>\n<p><strong>Izquierda/ derecha:</strong> moverse a los lados.</p>", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2019-11-29T03:15:34", "background_image": "https://media.rawg.io/media/screenshots/fe6/fe67846ff1d068e2740c4743e29730f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Light&Shadows"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}