{"id": 394717, "slug": "rekindling-itch", "name": "Rekindling (itch)", "name_original": "Rekindling (itch)", "description": "<p>The ZTD virus has taken over and turned the majority of the population in Zims. Zims are mindless creatures that will stop at nothing to find and devour human flesh. You find yourself in charge of a colony of survivors trying to rebuild society.</p>\n<p>Rekindling is a survivor management game where you must task your survivors with building up a sustainable settlement. Command your survivors to build, farm, mine and fight.<br/></p>\r\nHarvest the land\r\n<p>Randomly generated worlds each time you play across multiple different biomes. You must collect nearby scraps, rocks and trees to prepare for the Zim attacks that happen each night!<br/><br/></p>\r\nBuild your settlement\r\n<p>Over 50 unique items to build and create in order to enhance your settlement.<br/><br/></p>\r\nInfinite possibilities\r\n<p>The Survivors are all randomly generated with goals, likes, skills and bad habits.<br/><br/></p>\r\nAvoid death\r\n<p>The Zims like the dark and will come out to attack each night! Make sure you are ready to fight back the hordes.<br/><br/></p>\r\nPlaned features\r\n<p>Here are some features that we would like to add to the game before the full release. Updates will come out every week with these additions as well as other fun features. We have already started to implement a lot of these since we have gone into early access. Features with a (~) mean they have already been added in some form<br/></p>\n<ul><li>(~)Full research tree for unlocking new items for your survivors</li><li>(~)More dynamic survivor interactions. Such as dealing with outsiders and distrust/love between existing survivors</li><li>(~)Tons of more items and objects</li><li>A mission driven scenario mode where you have a colony already and have to solve its problems</li><li>Mod support for custom items/buildings/zims and so on</li><li>(~)Control mode where you can become a survivor and do actions directly controlling them as them</li><li>(~)More sandbox and free build options such as picking the starting world settings</li><li>(~)More Biomes and environmental differences such as Tundras, swamps and grand forests</li><li>(~)More ZIM variants EX: a large slow ZIM that destroys buildings.</li></ul>", "metacritic": null, "released": "2019-11-26", "tba": false, "updated": "2019-11-29T03:11:42", "background_image": "https://media.rawg.io/media/screenshots/fb2/fb2f1fbb601580602547e04b3d55df5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SFSstudios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}