{"id": 394766, "slug": "moto-banana-bumni-race", "name": "moto Banana: Bumni Race", "name_original": "moto Banana: Bumni Race", "description": "<p>moto Banana: Bumni Race is a free car racing mobile game. These <strong>exciting races introduce us to the fantastic world of moto bananas. If typical car games, car races or other traditional racing games are already boring for you ▶️ <strong>WHAT ARE YOU WAITING FOR ?! DOWNLOAD NOW </strong>◀️ and <strong>JUST TRY! </strong>. Help Bumni get the <strong>Banana Island Master Crown! </strong>Banana Racing is the <strong>perfect solution </strong>to getting rid of <strong>boredom </strong>. Game for children, game for boys, game for for girls, game for seniors. Banana Race is a perfect entertainment <strong>FOR EVERYONE!</strong><br/><br/>The hero of the game is <strong>Bumni </strong>- a small, yellow and brave Moto banana. His dream is to win the Moto Banana Races and get the desired crown of the Banana Island Champion. The races at the beginning are easy ... but not for a long time. It quickly turns out that winning not only includes <strong>driving </strong>and steadfastness, but also endurance and <strong>continuous development </strong>.<br/><br/>At the beginning of every racing career, the audience seldom comes to cheer on weaker drivers. With the success of Bumni more and more fans come on the track. The achievements in the race are paid – you can directly invest your profits in your banana-vehicle.<br/><br/><strong>7 UNIQUE OPPONENTS</strong><br/>🆚 Rivals<br/>All 10 levels a new, more skilled opponent joins the game and the races become more difficult. This is a tough test for Bumni. To keep your chances to win the race, you need to optimise your racing car's components.<br/><br/><strong>IMPROVE PARTS</strong><br/>⚙️ Available upgrades:<br/>▶️ Engine - more power, higher speed and acceleration<br/>▶️ Mass - be more efficient in duels, crowd out the opponents and fight for a better position on the track<br/><br/><strong>UNIQUE CONTROL</strong><br/>📲 Game:<br/>Moto banana races are unique. The game offers <strong>innovative controls </strong>, so it’s advisable to have a short trial to get familiar to them. The vehicle is controlled only with one finger!<br/>TOUCH SCREEN - turn left<br/>STOP TOUCH SCREEN - turn right<br/>▶️ Number of laps per race: 1-5<br/>▶️ Number of opponents: 1-10<br/>▶️ Number of routes: 3<br/><br/>No funds for the development of your racing banana? No problem! Just <strong>a little bit of patience </strong>and a few lower-level races won, and you have <strong>sufficient cash </strong>to buy better components. <strong>After such a tuning, </strong>the races will be much easier!<br/><br/><strong>STORE</strong><br/>💸Purchase more items in the shop<br/>In the shop you will find things that make the game more enjoyable and make the race more exciting. The store includes:<br/>▶️ <strong>2 Unusual routes </strong>- races in different places!<br/>▶️ <strong>3 Types of smoke </strong>- some of them are extremely colourful.<br/>▶️ <strong>4 Images </strong>- change the appearance of the main character.<br/><br/><strong>ROUTES</strong><br/>🗺 The colourful layout and extraordinary environment make everyone curious! Car racing has never been so exciting!<br/><br/>▶️ <strong>Log (Forest) </strong>- Race in a tropical forest! A fallen tree trunk ... Phew ... luckily did not completely block the road and you can pass below it.<br/><br/>▶️ <strong>Cave </strong>- some areas of the banana island are unusually beautiful, but very difficult to explore. Running on rocky terrain with caves is another challenge you have to face!<br/><br/><strong>Image</strong><br/>👓 If you are bored with Bumni's appearance, you can change it. There are 4 appearances in the game:<strong><br/>▶️ Bandit,<br/>▶️ Pirate,<br/>▶️ Nerd,<br/>▶️Gentleman</strong></strong></p>", "metacritic": null, "released": "2019-11-26", "tba": false, "updated": "2019-11-29T03:22:46", "background_image": "https://media.rawg.io/media/screenshots/330/3302623c727327ce85ed2bdaf3b71aa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["wianami"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}