{"id": 394958, "slug": "pas-a-pas", "name": "Pas à pas", "name_original": "Pas à pas", "description": "<p>IMPORTANT : Pour une expérience au plus proche de celle voulue, je recommande largement l’utilisation d’une manette, afin de ressentir les vibrations (version standAlone uniquement) au contact avec le sol et les mouvement des jambes. </p>\n<p>la musique a été composé par Khamelot (https://soundcloud.com/khamelot)</p>\n<p>Contrôle : Manette :    </p>\n<p>Rotation : Stick Gauche<br/></p>\n<p>Pas Droite : RT</p>\n<p>\t\t\tPas Gauche : LT</p>\n<p>Camera Ciel : Y</p>\n<p>Contrôle : Clavier :    </p>\n<p>Rotation : Touches fléchées</p>\n<p>Pas Droite : H</p>\n<p>\t\t\tPas Gauche : S</p>\n<p>Camera Ciel : Espace</p>\n<p>\t\t             </p>\n<p>Ce jeu est conçu comme une expérience contemplative centré autour du contact avec le sol, et de la découverte de son environnement.</p>\n<p>Cependant, il ne s'agit là que d’un prototype bas niveau, c’est à dire très éloigné de ce que pourrait donner une version finalisé. Voici les différents éléments, pas encore présent dans cette version :</p>\n<ul><li>Les sons: Pour l’instant, seul les notes de musique viennent rythmer le bruit des pas, mais pour la version fini, plusieurs sons dépendant du sol sur lequel on est viendront appuyer les pas du joueur. En plus de ça, une ambiance sonore permettra aussi de ressentir le paysage environnant, si celui ci a été découvert (bruit d’enfant, vent dans les arbres, fontaines pigeon …).</li><li>Une zone plus grande et plus détaillé : La zone actuelle est très limité, a terme, elle  sera bien plus conséquente et se verra complété de bien plus d'éléments, notamment de la vie, avec des passants, des pigeons, des arbres …</li><li>Une découverte plus progressive : A l’heure actuelle, les objets apparaissent soudainement au joueur, mais à termes ils serait plus intéressant qu’ils se détaillent au fur et à mesure qu’ils approche. Ce concept Art rapide montre les stades d'évolution selon l’approche du joueur : </li></ul>\n\n\n<p>Au cas ou le jeu ne se lance pas, voici une vidéo qui montre quelque minute de l’expérience :<br/></p>", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2019-11-29T04:10:11", "background_image": "https://media.rawg.io/media/screenshots/583/5838db21a6f4d70e4a339615ee4326c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Platypuus"], "genres": [], "publishers": [], "esrb_rating": null}