{"id": 394926, "slug": "yang-game", "name": "Yang Game", "name_original": "Yang Game", "description": "<p>Use <strong>WASD, ARROW KEYS, </strong>and/or <strong>SPACEBAR </strong>to play.</p>\n<p>Now playable on <strong>mobile</strong>!<br/></p>\n<p><em>Join Andrew Yang as he runs down a literal campaign trail for the 2020 election. Dodge the obstacles of automation and collect campaign policies to gain the votes of the people and win the presidency.</em></p>\n<p>In the future, the coins in the game would be replaced with icons representing Mr. Yang's policies from his political platform, and the ending screen would inform players about the policies they managed to collect during each run. Ideally, it would also include an \"ending\" visual upgrade after collecting all the policies and winning enough votes for the presidency. Then, players would be able to compete for high scores on a leaderboard. As a stretch goal, we would like to provide social media integration to allow players to challenge each other's high scores and possibly even donate directly to the Yang campaign.<br/></p>\n<p>This game was made for a friend of mine in September 2019 to support the candidacy of 2020 Democratic candidate Andrew Yang. It does not reflect my personal political views. I did all of the game design and programming personally, but the current visuals are stand-ins and are not mine. Development has been put on hold for a variety of reasons, but it may be continued sometime in the near future. If you are interested in collaborating on this project, or simply want to voice your support of its continuation, feel free to email me at tylertriebold@gmail.com.<br/></p>", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2019-11-29T04:02:51", "background_image": "https://media.rawg.io/media/screenshots/13c/13c02e075d04c3bba7ab78f7b6bcaff3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tyler Triebold"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}