{"id": 395053, "slug": "scurvy-dogs", "name": "Scurvy Dogs (itch)", "name_original": "Scurvy Dogs (itch)", "description": "<p>The game has over 1000 lines of code and was written in the C64's native version of Microsoft Basic filling almost all of the machines 38kb of free RAM.<br/></p>\n<p>It all started around June 2018, when I was drawing with my four year old step-son and he asked if we could draw treasure maps. I mapped out a whole island and plotted various treasures, and challenges, realising immediately it would be a good premise for a text adventure so I transferred the information about the locations and objects and so on, into a bunch of arrays.<br/></p>\n<p>I chose to program on the Commodore 64 because I like the aesthetic of the old games and how we originally played them. I liked the idea of having memory limitations so working from a limited palette allowed me a creative challenge. I also liked the idea of squeezing as much as I could into the machine to make a satisfactory text adventure that doesn't feel too limited.<br/></p>\n<p>The programming was inspired by Marshal Cavendish's INPUT magazine article about writing adventure games, which I was given by my dad when I was a kid and had an old Tandy TRS80 Color Computer with no datasette drive. I would type games in but had no way of saving my code so I would have to leave the machine on for days. I also drew inspiration from 'Write your own Adventure Programs for your Microcomputer' by Jenny Tyler and Les Howarth and of course playing a bunch of text adventure games on the Commodore 64.<br/></p>\n<p>The game has been in development for the past three months and is currently being beta tested before it will be given it's first official release. I am also working on a detailed manual for the game, which will contain artwork and additional flavour for the game as well as some useful information regarding how to play the game. I also plan to develop a box cover for the game and would be interested in releasing it for hardware as well as for emulation so I'm currently exploring those avenues now.<br/></p>\n<p>For more information about the game contact the author at: blamekeiko@live.co.uk<br/></p>\n<p>Tom Garner<br/>August 2018</p>", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2019-11-29T04:32:45", "background_image": "https://media.rawg.io/media/screenshots/124/124646b13110a8db129339e84e6a910a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tomgetsworse"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}