{"id": 395079, "slug": "oblik", "name": "Oblik", "name_original": "Oblik", "description": "<p>Descubre el mundo de los alquimistas desde Orion, un joven que sueña con pertenecer al gremio de los alquimistas y concluir los sueños de su padre. </p>\n<p>Orion ha crecido toda su vida acompañado de su madre, desde la pérdida de su padre, pero ahora, después de su cumpleaños número 20, ha logrado adquirir el título de aprendiz alquimio, ahora Orion debe buscar completar la tarea que su padre no pudo finalizar, y para eso debe ser el mejor del gremio. </p>\n\n<p>Oblik es un juego que te adentra al la cultura de los alquimistas, te lleva a través de ello por medio de símbolos, la misma simbología para representar distintos elementos para dichos hombres, pero dentro de este universo, como jugador te toparás con los símbolos fragmentados, los cuáles debes saber resolver desde las diferentes perspectivas, para ayudar a Orion a conocer los sueños de su padre. </p>\n<p>El objetivo dentro de Oblik, es saber armar las figuras en el menor de los movimientos posibles, pues tales movimientos serán limitados, también deberás incrementar tu conocimiento a través de Orion, para descubrir nuevos secretos y nuevos símbolos. </p>\n<p>Prepárate para descubrir más acerca de la cultura de esta antigua profesión, y adentrarte en este universo para descubrir los secretos de Orion, los secretos de un alquimista. </p>\n\n\n<p><strong>Nuestro Equipo</strong></p>\n<p>Fátima Hernández González - Ilustradora</p>\n<p>Gilberto Salas Tlacomulco - Programador</p>", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2019-11-29T04:39:55", "background_image": "https://media.rawg.io/media/screenshots/f0d/f0d79d8b67131c51ebd9cae57e849197.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["FaMenor"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}