{"id": 395177, "slug": "marvels-spider-man-turf-wars", "name": "Marvel's Spider-Man - Turf Wars", "name_original": "Marvel's Spider-Man - Turf Wars", "description": "<p>Soon after Felicia&#39;s apparent death, a full-blown gang war between the Maggia families erupts. Spider-Man assists Yuri Watanabe and her police task force in a raid against Hammerhead, but it turns out to be a trap and Spider-Man and Yuri are the only survivors. The loss of her men under her watch leaves Yuri emotionally compromised, and Spider-Man asks her to take a leave of absence to grieve and recover, promising to apprehend Hammerhead in her absence. Spider-Man learns that Hammerhead and his gang have been stealing Sable International&#39;s equipment and weapons to help them in the gang war. After abducting the other Maggia dons, Hammerhead&#39;s forces attack police convoys across the city. While Spider-Man is dealing with his henchmen, Hammerhead attacks the police precinct which is holding Sable International&#39;s &quot;Project Olympus&quot;, killing police officers in the process. Frustrated by her men&#39;s deaths and Spider-Man&#39;s lack of progress, Yuri decides to go after Hammerhead personally. Later that night, Hammerhead decides to execute the other Maggia dons on live television to achieve his goal of terrorizing New York City into submission. Spider-Man foils Hammerhead&#39;s plan and fights him, Hammerhead now powered by Project Olympus armor, but despite Hammerhead&#39;s advantage, Spider-Man defeats him. As police are about to take Hammerhead into custody, Yuri arrives and shoots Hammerhead dead. Yuri is then suspended from the police force, but it doesn&#39;t stop her from hunting down other Maggia members and later becomes a ruthless vigilante. Unbeknownst to Spider-Man and the police, one of Hammerhead&#39;s henchmen infiltrated the police van holding Hammerhead&#39;s body and revives him.</p>", "metacritic": 70, "released": "2018-11-20", "tba": false, "updated": "2024-04-18T21:21:14", "background_image": "https://media.rawg.io/media/games/e23/e23b7afc10d5ba39709a080ae34f3d4b.jpg", "website": "", "rating": 3.64, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 9, "beaten": 82, "toplay": 6, "dropped": 4, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 69, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 69, "platforms": ["PC", "PlayStation 4"], "developers": ["Insomniac Games"], "genres": ["Action", "Adventure"], "publishers": ["Sony Interactive Entertainment"], "esrb_rating": "Teen"}