{"id": 395109, "slug": "black-jack-gabriel-fardoski", "name": "Black Jack (Gabriel Fardoski)", "name_original": "Black Jack (Gabriel Fardoski)", "description": "<p>Long ago, there was a really famous pirate, he was the bravest, strongest and smartest among all the pirates that existed, but he was also the greedier, he would plunder every island he was in, betray his friends, do every kind of bad thing for the sake of gold. This pirate was too greedy that one day he announced that he would go to the Dark Continent, a place that no other pirate could ever return from, there was only the worst stories about the place, but who could know what really happens there. </p>\n<p>Some days after the pirate announcement, he returned from the place, happy and celebrating with so many gold that even the marine would not touch him, but he was not with his crew anymore. He told so many different stories, but the few people that knew him, saw that he was acting strange. He has gotten so rich he even stopped sailing.</p>\n<p>After some weeks, he completely dissapear, no one would hear a single news of him, so after some days he would be completely forgotten, even by his closest friends. And his wealth would completely dissapear, as well as his ship.</p>\n<p>Some years have passed by, some guys on the nearest island of the Dark Continent, find a ship, a very robust one, with the biggest sail they've ever seen, the ship was so intriguing and desert they would jump right into it whithout a thinking twice, by the moment they landed their soul whould not be at the same place as before, their body would not respond to their head, the ship was in charge now. The ship, that was covered by the sand of the beach, started going up and to the sea, without having any force applyed, revealing itself, and its name, Black Jack.</p>", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2019-11-29T04:47:14", "background_image": "https://media.rawg.io/media/screenshots/dff/dff71da889c9b1df30a00181bbf155c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gabriel Fardoski"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}