{"id": 3955, "slug": "zeno-clash-2", "name": "Zeno Clash 2", "name_original": "Zeno Clash 2", "description": "<p>Zeno Clash II is a fantasy action game that combines multiple genres. Like its predecessor, Zeno Clash (2009), it uses the first-person view.</p>\n<h3>Plot</h3>\n<p>The setting of Zeno Clash II is a weird fantasy world called Zenozoik. The main protagonist of the original game, Ghat, makes a return. His companion Deadra, however, is replaced by Ghat&#39;s sister Rimat, who was one of his opponents in the previous game. The two siblings put their differences aside to team up against a new villain: a golem called Kax-Teh. Years ago, Ghat brought this creature with him to Zenozoik, and now the golem became too powerful for Ghat to tolerate.</p>\n<h3>Gameplay</h3>\n<p>The game features an unusual combination of role-playing, fighting and beat &#39;em up elements. The player controls Ghat, accompanied by AI-controlled Rimat, and leads him through a series of battles. The gameplay mostly consists of hand-to-hand fights, though the player can occasionally use weapons. Zeno Clash II has a unique combat system in which the amount of damage depends on which body part was hit. All battle movements cost stamina that has to be replenished. The RPG element allows the characters to improve their skills and abilities as they progress through the game. They can also find and equip new items. </p>\n<h3>Modes</h3>\n<p>Zeno Clash II introduced a new cooperative multiplayer mode, in which the second player assumes the role of Rimat. There are also the Arena modes, which allow the players to fight each other or a series of AI-controlled opponents.</p>", "metacritic": 63, "released": "2013-04-30", "tba": false, "updated": "2023-12-19T12:40:16", "background_image": "https://media.rawg.io/media/games/3fa/3fa41498f81741b063b5e8c653090186.jpg", "website": "http://www.zenoclash2.com/", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 61, "owned": 1350, "beaten": 42, "toplay": 25, "dropped": 48, "playing": 3}, "playtime": 3, "achievements_count": 35, "ratings_count": 98, "suggestions_count": 660, "game_series_count": 2, "reviews_count": 100, "platforms": ["PlayStation 3", "Xbox 360", "PC"], "developers": ["ACE Team"], "genres": ["Action", "Shooter", "Fighting", "Indie"], "publishers": ["Atlus"], "esrb_rating": "Teen"}