{"id": 395662, "slug": "pixel-blaster-arena", "name": "Pixel Blaster Arena", "name_original": "Pixel Blaster Arena", "description": "<p>Pixel Blaster Arena was made as part of the Game Off 2019 game jam, hosted by GitHub. The theme for this game jam was \"Leaps and Bounds\", and this game focuses on the 'Bounds'. </p>\n<p>Play as a small blaster that can only move around using the recoil of your weapon, with waves of enemies constantly trying to push you into the stage boundaries (instant death!) in this arcade-style action shooter. </p>\n<p>Finding the default stages a bit too easy? Why not make your own stages using the Stage Creator? You can make your own stage boundaries, spawn point, and even increase the number of enemies that spawn. </p>\n<p>Want to share your custom stages with others (or download other players' stages)? Each stage is stored as a '.stage' file on your computer. All stages are located at C:\\Users\\YOUR_USERNAME\\AppData\\LocalLow\\lincolnsch99\\Pixel Blaster Arena\\CustomStages. If you're having trouble finding the \"AppData\" folder, go into the view options and make sure \"Hidden Items\" is set to true. From there you can send your stages to your friends, or move other '.stage' files into the folder so you can play them!</p>\n\n<p>11-28ReleaseBuild: </p>\n<p>1) Fixed issues where player could not place different boundaries (in stage creator) if they were trying to replace the last boundary they placed.</p>\n<p>2) Changed the game so if the player goes way off screen, the player is killed. This is to combat stages where the boundary lets the player leave the play area.</p>\n\n<p>11-26ReleaseBuild: Initial alpha release build.</p>\n\n<p>Programming/Art/Sound by Lincoln Schroeder</p><p>8-Bit Explosions: https://audiosoundclips.com/8-bit-explosion-blast-sound-effects-sfx/</p><p>Thanks to all who helped with testing!</p>", "metacritic": null, "released": "2019-11-30", "tba": false, "updated": "2019-12-02T03:41:45", "background_image": "https://media.rawg.io/media/screenshots/3c6/3c6e8e4a574666a06623474bfd982c62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lincolnsch99"], "genres": ["Action"], "publishers": [], "esrb_rating": null}