{"id": 395621, "slug": "dragon-dreams-christmas-nightmare", "name": "Dragon Dreams: Christmas Nightmare", "name_original": "Dragon Dreams: Christmas Nightmare", "description": "<p>BEFORE WE BEGIN: Keep in mind, you may need to set aside an hour or so to play through this, as it only saves your progress upon completing a game. Though it will take less time to do just the bare minimum required to win.<br/></p>\n<p>Now, on with the introduction!</p>\n<p>The holiday season is here once again, and all prepare for a time of joy and peace.<br/>However, just as night is approaching, creatures have snatched up all of the gifts intended for the land's inhabitants!<br/>After your taste of adventure earlier just this year, you were looking forward to enjoying a relaxing holiday... But now, you are again thrust into an unexpected adventure on short notice.<br/>So gather your things, hero, and save Christmas!</p>\n<p>Explore the land as best you can with the abilities you have, defeating mischievous creatures, and finding treasures to aid in your journey to recover the scattered gifts!<br/>This is a short side game in the Dragon Dreams series, of similar game length and style to Dragon Dreams: A Taste of Adventure, which was released in August 2019 (may be uploaded to itch.io later, I've just started here to see how things go, but it's available elsewhere for now; Game Jolt, and Google Drive). It is not required to play to understand anything in this game, but it is also a standalone experience, and freely downloadable from the same place you got this, if you're interested!</p>\n<p>Thank you for checking out my game!<br/>I hope you enjoy, Happy Holidays!<br/></p>", "metacritic": null, "released": "2019-11-30", "tba": false, "updated": "2019-12-02T03:31:51", "background_image": "https://media.rawg.io/media/screenshots/b7b/b7b0e90aabe60b7e4120857eddad834e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Piece of Pie Software"], "genres": ["Action", "Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}