{"id": 395626, "slug": "path-to-ascencion", "name": "Path To Ascencion", "name_original": "Path To Ascencion", "description": "<p><strong>Path to Ascension is an adult text game. In it you will play as a recently deceased mortal on the path to claim a place among the gods themselves!</strong></p>\n<ul><li>Choose who you were, and are, by selecting your background, name and appearance.</li><li>Shape the story, the multiverse and yourself through your choices regarding what you do or say.</li><li>Your actions and background will inform what aspect of reality you rule over: be a god of dominance, lust, knowledge or many other options.</li><li>Meet and befriend, if you wish to, several companions from across the multiverse.</li><li>Bed the denizens of the multiverse, from companions and enemies to passersby.</li><li>Build your own base, room by room.</li><li>Explore several universes, each with their own theme and gameplay style.</li></ul>\n<p><strong>Planned Universes</strong></p>\n<p>You will explore several universes each with a different theme and gameplay to them.</p>\n<ul><li>Fight fantastical creatures and go on an adventure in the medieval fantasy-themed universe, with rpg elements.</li><li>Cruise the stars and manage a mega-corporation in the space-themed universe, with management sim gameplay elements.</li><li>Join a race to the west in the wild west themed universe, with * Oregon Trail inspired gameplay.</li><li>Fill paperwork and despair about contemporary problems in the modern life themed universe, with dating sim style gameplay.</li></ul>\n<p><strong>Current Version</strong></p>\n<p>Version 0.1 is already available for free in the public post of the patreon page here: https://www.patreon.com/posts/path-to-releases-31951635</p>\n<ul><li>Five Events and an Npc.</li><li>One sex scene with three different endings based on your previous demeanor with your partner.</li><li>Combat System</li><li>RPG Class System</li><li>Base Building System</li></ul>\n<p><strong>Support the game (and find out more) at:</strong></p>\n<p>https://www.patreon.com/sharkbit</p>\n<p>https://subscribestar.adult/shark-bit-games</p>", "metacritic": null, "released": "2019-11-30", "tba": false, "updated": "2019-12-02T03:33:34", "background_image": "https://media.rawg.io/media/screenshots/a89/a8985c29a0a1ca68dee358590eefbdb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SharkBitDev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}