{"id": 395673, "slug": "mystic-skies", "name": "Mystic Skies", "name_original": "Mystic Skies", "description": "MYSTIC SKIES\r\n<p>(Elfman the Airship Captain)</p>\r\nLeap into the Mystic Skies in your Airship to travel across the Kingdom.<br/>Evolve Elfman and Upgrade your Airship to overcome Objectives.<br/>Be eaten alive by a Sky Beast if you go Out of Bounds.\r\n<p>Reach the 9th Region and Defeat the 3 Evil Sorcerers to complete the game.</p>\n<p>Battle different Monsters with increasing power across 9 levels.</p>\n<p>*  Travel other Regions with your Airship and survive the Sky Beasts.<br/>*  Collect Fuel Crystals to refuel your Airship.<br/>*  Complete Region Objectives to unlock airship access for Region.<br/>*  Collect berries to craft potions at Potion Houses.<br/>*  Earn Junk in Battles to sell to Junk Houses.<br/>*  Upgrade Weaopn, Armour and Shield for your Airship with Coins.<br/>*  Evolve your Airship to 2nd Class Ship and 1st Class Ship with Coins.<br/>*  Wander out of bounds of the forest on foot and you are Sky Beast food.</p>\n\r\nStory\r\n<p>Midoria was a peaceful world heavy with forests and a prosperous Elven Kingdom.<br/>Until one dark stormy night, three powerful dark sorcerers begin a potent ritual.<br/>combining their powers to rip their reality into another world,<br/>powerful lightning bolts strike into the air,<br/>changing the sky from blue to several colours.<br/>Otherworldly creatures of all sizes invade from above.<br/>The once prosperous Elven Kingdom crumbles into anarchy under the strain.<br/>Villages only have a Shipyard, Inn, Junk and Potion Houses left standing.<br/>You must step up and help the Kingdom fight back these creatures and reclaim the skies.</p>\n<p>Created for Game Off 2019 game jam;  Theme:  Leaps and Bounds</p>", "metacritic": null, "released": "2019-11-30", "tba": false, "updated": "2019-12-02T03:44:44", "background_image": "https://media.rawg.io/media/screenshots/43c/43cfe3501b99d919b43e2af607222388.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Soul Grinder"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}