{"id": 395810, "slug": "the-samurai-revenge", "name": "The Samurai Revenge", "name_original": "The Samurai Revenge", "description": "<p>Segundo a lenda, o deus Susanoouma encontrou uma poderosa espada dentro da quarta cauda do terrível monstro Yamata no Orochi, uma serpente gigante de oito caveças. Depois de derrotar o monstro e adquirir a espada, deu-a como presente à sua irmã, a deusa Amaterasu, como forma de reatar os laços. A lendária espada foi batizada como Kusanagi no Tsurugi, A que colhe as nuvens do céu. <br/></p>\n<p>Séculos depois, no reinado de Keikou, o 12º imperador do Japão, a espada foi dada ao grande guerreiro samurai Yamato Takeru, guardião do templo de Ise, para que este a protegesse e a usasse apenas nos momentos de maior perigo. A espada ficou bem protegida durante anos sob a guarda de Takeru. <br/>Porém, numa escaldante noite enluarada de verão, oito guerreiros do clã da serpente negra conseguiram invadir o templo sagrado de Ise. Sorrateiramente dispararam um turbilhão de dardos envenenados contra Takeru. O mestre samurai conseguir se esquivar da primeira leva, porém os dardos eram muitos e um deles acertou em sua nuca e segundos depois ele caiu desacordado.<br/>Horas depois, o mestre reuniu suas forças e conseguiu levantar. Mas nessa hora, para seu desenpero, percebeu que seu bem mais estimado tinha desapareciso. O clã da serpente conseguiu roubar a lendária Kusanagi no Tsurugi. <br/>Agora o nobre samurai precisa correr contra o tempo para encontrar o antídoto para salvar sua vida e recuperar a espada.  </p>", "metacritic": null, "released": "2019-11-29", "tba": false, "updated": "2019-12-02T04:18:36", "background_image": "https://media.rawg.io/media/screenshots/229/229ca51230e9f61c3e6044065d01e8f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["daviscopel"], "genres": ["Action"], "publishers": [], "esrb_rating": null}