{"id": 395971, "slug": "the-legend-of-heroes-trails-of-cold-steel-iii", "name": "The Legend of Heroes: Trails of Cold Steel III", "name_original": "The Legend of Heroes: Trails of Cold Steel III", "description": "<strong>Welcome to the New Class VII</strong> – Explore the newly annexed lands of the Empire with a brand new squad, and catch up with familiar faces from the past.<br/><br/><br/><strong>An Immersive Story</strong> – Experience an epic story developed across three titles, and crafted for new and old fans alike. Also includes an interactive introduction to catch up new players to the ongoing story so anyone can dive right in to the world of Trails of Cold Steel.<br/><br/><br/><strong>Combat Honed to a Fine Edge</strong> – Challenge oncoming threats with a combat system that has been refined over the course of decades. The addition of features like Brave Order and the Break System open up new possibilities in battle.<br/><br/><h3>Story</h3>Rean Schwarzer uncovers a dark plot that threatens his homeland. To face their enemies, he must prepare a new generation of heroes as an instructor at a new branch campus and guide them towards victory.<br/><br/>Nearly a year and a half has passed since the Erebonian civil war, and much has changed since then. From the shifting stances of countries to the internal politics of the Empire, and even the life of Rean Schwarzer, the shadows of the past have given way to the embers of a new chapter. Now graduated from Thors Military Academy, Rean has become an instructor at the Thors Branch Campus, a newly-opened academy that quickly finds itself thrust onto the national stage. It is here that he takes the lead of a brand new Class VII, and must guide a new generation of heroes into an unknown future. Though all is calm now, the nefarious Ouroboros organization continues to weave a dark plot that could engulf the entire continent in war...or perhaps something even more sinister.<br/><br/>Trails of Cold Steel III invites players into a world full of intrigue and excitement that is years in the making. They will embark on a whirlwind tour through the never-before-seen lands of the recently expanded Erebonian countryside, and encounter fresh faces as well as old friends familiar to fans of the series. In true Trails fashion, the deep, engaging story pairs with an incredible cast of characters and a combat system refined over decades of innovative RPG worldbuilding.", "metacritic": 83, "released": "2017-09-28", "tba": false, "updated": "2024-04-09T14:29:58", "background_image": "https://media.rawg.io/media/screenshots/76a/76aa13d770101bd8ce1d3fca4211c1c8.jpg", "website": "https://thelegendofheroes.com/tocs3/", "rating": 4.11, "rating_top": 5, "added_by_status": {"yet": 28, "owned": 196, "beaten": 24, "toplay": 44, "dropped": 4, "playing": 5}, "playtime": 9, "achievements_count": 270, "ratings_count": 28, "suggestions_count": 804, "game_series_count": 13, "reviews_count": 28, "platforms": ["Nintendo Switch", "PC", "PlayStation 4"], "developers": ["Engine Software", "Nihon Falcom", "Falcom", "PH3"], "genres": ["RPG"], "publishers": ["NIS America", "NIHON FALCOM"], "esrb_rating": "Teen"}