{"id": 395947, "slug": "a-game-design-study-ice-dodge", "name": "A Game Design Study - Ice Dodge", "name_original": "A Game Design Study - Ice Dodge", "description": "<strong>How to play</strong>\n<ul><li><em>Avoid Ice Shards<br/></em></li><li><em>Snow makes you slower</em></li><li><em>Time your movements for faster reaction time.</em></li><li><em>Each crystal you grab gives you more points each time</em></li><li><em>3 Crystal Powerups:</em><ul><li><em>Yellow: faster reaction time<br/></em></li><li><em>Red: you melt snow</em></li><li><em>Purple:  Keep your finger down and blaze through the map.</em></li></ul></li><li><em>You can only jump 1 block at a time</em></li></ul>\n<strong>The game as an exercise on game design.</strong>\n<p>I mainly focused on making a solid game design rather than a big game. I tried to consider all details and have a reason behind each decision. Here are a few:</p>\n<ul><li><strong>Highscore starting at 5:</strong> The highscore starts at 5 to give the player a solid objective on a rather inconsequential game. The number was chosen to clarify and solidify that crystals spawn at a 5 wave interval. This way the player is inmediatly rewarded for achieving a highscore without the need of any extra things.</li><li><strong>Auto respawn:</strong> on each death the game starts over without any prompt. This way the player doesn't loose drive to play. It also keeps them focused and playing.  If the player dies 5 times in a row the highscore screen is shown to cut the phasing of the game and allow him to breath. It's important that the game just doesn't stay in a loop or the player with grow frustrated and probably feel trapped. In games like this is more important, as a player, to keep the rythm/flow rather than to be constantly stopping and restarting.</li><li><strong>Dead - Play delay:</strong> when you loose there is a 5 seconds window before the game starts to throw shards at you again. This allows the player to \"recalibrate\" and pump himself up, or just choose to stop playing. I consider it  important to not push  players to keep playing, but make it easy for them if they want to.</li><li><strong>Reaction Time: </strong>every time you try to move from a standing position the character will have a delay between the input and the action. The amount of time is small and varies between each powerup. The reaction time is never too much such that it is impossible to dodge a shard from a standing position with any given powerup (standing at and moving towards ground level at least).</li><li><strong>Ice Shards:</strong> Ice shards are the main mechanic of the game. If they fall on you, you die. If they fall on a pile of snow they make an ice block, and if they fall on to a crystal they break it. \r\n<ul><li>They are spawned starting at 5 seconds on any new round.</li><li>They fall regularly every 2 seconds, as much as 7 at a time. Each waves throws a mix of  Falling Snow + Shards, summing up to 7 with a medium of 2 falling snow.</li><li>They spawn randomly at any of the 13 tiles. But there can not be more than 2 contiguous shards. This is so you only need to dodge once to be safe.</li><li>The number of shards is such that the player feels trapped. But being only one step away from safety, the difficulty only lies on choosing to go left or right.</li></ul></li><li><strong>Ice Blocks:</strong> it's a simple game, so there had to be something extra going on to keep things interesting. \r\n<ul><li>Blocks are formed when a shard of ice hits a pile of snow rather than the ground. </li><li>They break after two shards hit them. </li><li>Blocks can pile up. </li><li>Player can only jump 1 block at a time. A pile of two blocks is unjumpable. Unless of course there is a block next to the pile. You can drop down from any height.</li><li>This mechanic allows decision making and strategy possible. You have to be aware of blocks cutting you off, preventing you to move to the other side of the screen. </li><li>You also need to be aware that standing on top, or jumping on to a block makes it harder to react on time.</li><li>It makes it so you not only need to see up the screen looking out for shards, but also look down to keep an eye out for the terrain.</li></ul></li><li><strong>Snow:</strong> the main purpose of snow is to make blocks of ice. But they also contribute to the strategic thinking of the game.<ul><li>Jumping out of a pile of snow takes a longer reaction time than if you are just moving on solid ground.</li><li>Falling snow doesn't kill you, so the player can stand below a falling pile of snow and nothing will happen to him.</li><li>If you are timing your moves properly snow wont slow you down.</li></ul></li><li><strong>Crystals (Powerups): </strong>They serve two main purposes. The first one is to reward the player for surviving. And the second one is to change the gameplay so it doesn't grow stale.<ul><li>Yellow: (Fast reaction time) The yellow stance is the simplest one, hence why is the one the player starts with. The focus is to just move and dodge shards. Simple survival, and the best stance for doing so.</li><li>Red: (Slow Reaction time) Red allows you to melt snow making it possible to control the terrain and focus more on ground control rather than dodging.</li><li>Purple: (Slow Reaction time) The purple powerup allows you to keep moving while holding down the movement input. It's the fastest way to move around. You can change the direction without having to stop.</li></ul></li></ul>\r\nSame mechanics again but focused on objectives\r\nLearning curve and mastery\r\n<p>There are a number of different factors that contribute to becoming a better player.</p>\n<ul><li>Getting used to keep an eye out for the terrain, and looking up every 2 seconds to dodge the falling shards.</li><li>Learning that snow will increase the delay between input and movement (reaction time).</li><li>Learning to chain movements (staying mobile) to eliminate the delay between input and action. </li><li>Learning that snow doesn't slow you down when staying mobile. Taking the risk out of crossing through snow.</li><li>Knowing that you only need to choose left or right to be safe at any wave.</li><li>Understanding that being mobile gives you a better chance to dodge shards. Since moving immediately after finishing a strafe eliminates the delay between input and movement. (Especially important for red and purple powerups, since their reaction time is greater). </li><li>Choosing when to change powerups. Even if collecting crystals can give an exaggerated amount of points, sometimes it is just better to stay on one color. Plus the danger of strafing towards a crystal is a risk on it's own.</li><li>Being aware of not getting cut off by blocks.</li><li>When using the red powerup, planning to melt the snow that will cut you off if it becomes a block.</li><li>Mastering the purple powerup to quickly move around the plane.</li><li>Learning the exploit of the ice hat (it's a secrete shh).</li></ul>\r\nEngagement and play time\r\n<p>A big part of this kind of games is about making it easy for a player to keep playing the same thing over and over again for a long period of time. Here are a few things that I tried to help with this:</p>\n<ul><li>A learning curve so the progress shows not just on muscle memory, but also on the understanding of the game mechanics.</li><li>A low first time highscore to incentivize the player to learn the basic mechanics.</li><li>A changing terrain so there is some dynamic decision making. Not depending just on muscle memory and/or knowledge of the mechanics (in the sense of mental memory and the feeling of \"I already know how it works, there is nothing left to do here\") can increase the engagement and reduce the boredom of repeating the same task for a long time.</li><li>The fact that if you just moved the other way instead you would have survived. Giving the player a simple and immediate way to win.</li><li>An overall feel of it wasn't completely my fault. Having something else to blame makes it easier for anyone to not get frustrated with oneself. A really important part of learning anything in life is not giving up.\r\n<ul><li>A fair, but overall small window for reacting to shards makes it easy for a new player to blame the game without discarding the possibility that they can actually master it.</li><li>The dynamic and two layered randomness of ice blocks forming on the ground. Sometimes it will be just unfair, sometimes it won't. And the player will know it. Making it possible to feel like you can conquer the odds and not just beat them.</li></ul></li><li>Varied gameplay: the powerup system adds another layer of dynamic decision making. Having to change gameplay styles on the run makes the game even less stale. Summed up with the ice blocks and snow, every round will <em>feel </em>different and not just <em>be</em> different.</li></ul>", "metacritic": null, "released": "2019-11-29", "tba": false, "updated": "2019-12-02T04:51:33", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7ad0ca7b1e9008d30f425ffe91901d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Agustin D'Alessandro"], "genres": [], "publishers": [], "esrb_rating": null}