{"id": 396009, "slug": "max-dtr", "name": "Max DTR", "name_original": "Max DTR", "description": "Race now! Enjoy the thrill of Maximum Dirt Track Racing action- anywhere, anytime!  <br/><br/>Max DTR is a challenging and comprehensive dirt track racing game, which embraces the sport's vast network of tracks, drivers, car classes, series, sponsors and fans. <br/><br/>AMAZING CARS:  Race 7 awesome car classes (4 cylinders, stocks, modified cars, big blocks, late models, sprints and winged sprints).  Advance in races and expand your fleet of dirt track racing machines.  Tune, maintain, and customize your cars in the pit, and hire mechanics to help fix your cars between races. Obtain bigger trailers to upgrade cars with higher performance parts<br/><br/>AUTHENTIC TRACKS: Race from an expanding list, representing some of the world's greatest dirt tracks. Explore real-world schedules and track information, and track your Quick Times, by car, at tracks around the world. <br/><br/>GREAT RACING ACTION:  Enjoy multiple modes of play (Career, Quick Race, and \"World DTR\" Multiplayer tournaments). Racing action is enabled by incredible graphics and car physics, multiple steering control options, and competitive AI cars that will battle you for trophies and fame.<br/><br/>EXCITING RACING ACTION:  Win career races and series to compete in more competitive events, and earn sponsors and race purses to propel your success. Advance in your dirt career from Rookie, to Amateur, to Pro, to Veteran, to become a dirt track racing Legend. Win multiplayer races and rank-up on the World DTR leader board to win coins. Race any of your cars in a Quick Race, which you set the conditions for, on any track in the game. Race frequently for daily reward bonuses that increase your earnings.<br/><br/>Note: Max DTR is free to download and play; however, the game does allow you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.   <br/><br/>Thanks for following Max DTR on social media:<br/>Facebook: https://www.facebook.com/MaxDTRgame<br/>Twitter: https://twitter.com/MaxDTRgame<br/>Instagram: https://www.instagram.com/maxdtrgame/<br/>YouTube: https://www.youtube.com/channel/UCFLflc9uGIVPk4DuHQdTvSg", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2019-12-06T02:02:05", "background_image": "https://media.rawg.io/media/screenshots/f64/f6460e8850f230e0c419fa5f791787fc.jpg", "website": "http://www.screaminggames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Screaming Games"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Screaming Games"], "esrb_rating": "Everyone 10+"}