{"id": 39604, "slug": "ion-assault", "name": "Ion Assault", "name_original": "Ion Assault", "description": "In ION ASSAULT players wield thousands of Ion Particles to blast, fry and disrupt anything on screen as you see fit!<br/>\t\t\t\t\t\tGAMEPLAY WITH A TWIST: By centering its gameplay around its unique fluid and particle physics system, ION ASSAULT adds a twist to arcade style space shooters!<br/>\t\t\t\t\t\tANYONE CAN PLAY: Utilizing its dynamic level intensity, ION ASSAULT is both accessible for the beginner as well as challenging for the skilled gamer. The faster you destroy obstacles, the more enemies the game will throw at you, so play it safe and clear one obstacle at a time or go crazy and see how many enemies the game can throw at you for a maximum score!Key features:<ul><li>Classical Shoot’em up with tactical depth: Ion Particles are limited for each level<br/> </li><li>Wield thousands of Ion Particles.<br/> </li><li>Use your space ship to fight against enemies and to destroy asteroids by absorbing and blasting Ion Particles.<br/> </li><li>Collect valuable power ups to improve your ship, your defense or your fire power. <br/> </li><li>Blast 30 different enemies using a variety of patterns to attack.<br/> </li><li>Fight through 4 large sectors, each guarded by a huge boss!<br/> </li><li>Over 20 levels, 5 levels in each sector<br/> </li><li>Conquer the leaderboard by mastering the innovative multiplier-based scoring mechanic.</li></ul>", "metacritic": null, "released": "2009-09-23", "tba": false, "updated": "2024-01-20T13:15:07", "background_image": "https://media.rawg.io/media/screenshots/ef4/ef4e2cdecef011fec21e5bc5c957ba01.jpg", "website": "http://www.ionassault.com", "rating": 2.33, "rating_top": 1, "added_by_status": {"yet": 10, "owned": 399, "beaten": 1, "toplay": 2, "dropped": 6}, "playtime": 2, "achievements_count": 28, "ratings_count": 9, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 9, "platforms": ["Xbox 360", "PlayStation 3", "PC"], "developers": ["Coreplay"], "genres": ["Action", "Shooter", "Arcade", "Casual", "Indie"], "publishers": ["THQ Nordic", "Black"], "esrb_rating": null}