{"id": 396019, "slug": "the-house-of-da-vinci-2", "name": "The House of Da Vinci 2", "name_original": "The House of Da Vinci 2", "description": "The long awaited sequel to The House of Da Vinci is finally here. Join more than 1.000.000 players from around the world and dive into the 3D puzzle adventure with an outstanding rating of 4.8/5.<h3>THE STORY</h3><br/>Become Giacomo, the apprentice to the Renaissance genius, Leonardo da Vinci. Explore the world full of puzzles, mechanical gadgets and mind-twisting inventions. Travel through time and witness a series of mysterious events that led to the greatest discovery in human history. <br/><br/>Your most powerful weapon is your mind, wit and skill.<h3>KEY FEATURES</h3><br/><strong>ORIGINAL MECHANICAL PUZZLES</strong><br/>Get your hands on hundreds of new objects, 3D puzzles and mechanical brain-twisters waiting to be unraveled.<br/><br/><strong>TIME TRAVEL</strong><br/>Go back in time not only to reveal past mysteries and hidden objects – use unique Oculus Perpetua to shape the present in a significant way.<br/><br/><strong>NEW CONTROLS</strong><br/>Navigate through mesmerizing locations even more intuitively. All game controls have been redesigned and optimized to feel as intuitive as it gets.<br/><br/><strong>VOICE NARRATED STORY</strong><br/>A pleasure for all senses: the whole story is now fully narrated. The goose bumps are inevitable.<br/><br/><strong>MYSTERIOUS CUT SCENES</strong><br/>Including the one showing Leonardo da Vinci's creation of the famous The Last Supper. <br/><br/><strong>WHO ARE WE?</strong><br/>Blue Brain Games is an enthusiastic indie team of graphic artists and developers, all of whom are fans of both 3D puzzle games and the Renaissance genius Leonardo da Vinci. The House of Da Vinci was successfully released in 2017 and has now more than 1.000.000 downloads with an average rating of 4.8/5.", "metacritic": null, "released": "2019-12-05", "tba": false, "updated": "2023-11-23T16:36:25", "background_image": "https://media.rawg.io/media/screenshots/10a/10a6637da91f5cbb9c84d4396e038673_zqN0sLm.jpg", "website": "https://thehouseofdavinci.com", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 82, "beaten": 15, "toplay": 13, "dropped": 2}, "playtime": 7, "achievements_count": 24, "ratings_count": 18, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 18, "platforms": ["iOS", "Android", "macOS", "Nintendo Switch", "PC"], "developers": ["Blue Brain Games"], "genres": ["Adventure", "Strategy", "Indie", "Puzzle"], "publishers": ["Blue Brain Games"], "esrb_rating": "Everyone"}