{"id": 396253, "slug": "escape-from-calypso", "name": "Escape From Calypso", "name_original": "Escape From Calypso", "description": "<p>Escape From Calypso is a game on rails. You play as A318, an android seeking escape from the controlling grasp of the Calypso Administrative. In order to escape, you must collect hammers to break through the exit at the end of each level, while avoiding the Heavy Guards, Invokers, and Drones of the Administrative.</p>\n<p>What is Calypso? Calypso is a machine society, populated by androids. The city runs as one - every android has a role to play within this city, under the control of the Calypso Administrative, a militaristic governmental organization that focuses on maintaining control, obedience, and stability. The Administrative responds to threats, or perceived threats, to their power with uncompromising severity and speed.<br/>\"Calypso is one, and one is all.\" -  <em>Administrator A7</em></p>\n<p>Not every android is under the Administrative's control. Several - like A318 - have managed to free themselves from the organization's grip, and enjoy their individuality. However, these free androids are seen as threats to the Administrative, and so are persecuted and subjected to a ruthless mindwipe as they are brought back to Administrative control. </p>\n<p>UNLOC (the Unchained Nameless Liberation of Calypso) is a rebellious group who seek to free the city of Calypso from what they see as tyranny under the Administrative. The two groups have been locked in conflict before the events of Escape From Calypso take place.</p>\n<p>A318 is violence-averse, and refuses to take part in the fighting that has begin to tear the city apart. As A318, you must escape the city - reach the border, while evading Administrative forces.</p>\n<p>This game is in very early alpha. Current development will focus on building the story and the world in which the game takes place; future development will continue this process, and build upon the features already found in the game.</p>\n<p>Until next update...can you Escape From Calypso?<br/></p>", "metacritic": null, "released": "2019-12-04", "tba": false, "updated": "2019-12-06T02:57:15", "background_image": "https://media.rawg.io/media/screenshots/28f/28f8d727f3131f9655f110c5b9cd2041.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alex K."], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}