{"id": 396400, "slug": "electrophonics", "name": "Electrophonics", "name_original": "Electrophonics", "description": "<p><em>Electrophonics</em> is a collection of virtual musical instruments,  inspired by games such as <em>Music On: Electric Guitar</em> by Abylight Studios  and <em>Electroplankton</em> by Toshio Iwai.<br/></p>\r\nJam out! \r\n\r\n<p><em>Electrophonics</em> features two instruments as of now, with more planned to be added in the near future. You can try them out in the free Web version above!<br/></p>\n\r\nUkulele\r\n<p>Turn your keyboard into a fret board! The ukulele features mouse controls for detailed strumming, as well as a chord namer. All the keys can be remapped by clicking on them, so it'll work with any keyboard layout.</p>\n\n<br/>\r\nPan Flute\r\n<p>You can blow into your microphone to play this totally-customizable pan flute! Drag the pan flute left and right, or use remappable keys to jump to a specific pipe. Yes, this can even output a MIDI signal in the Windows &amp; Mac versions.</p>\n<p>***<br/></p>\r\nDownload-exclusive Features\r\n<p>If you pay for the download... thank you for supporting the project! You'll also get access to the following features, not available in the free Web version.\r\n</p>\r\nMIDI Output\r\n<p><em>Electrophonics</em> can function as a MIDI device on both Windows and Mac! This means you can use it as input for anything that accepts a MIDI signal, whether it's a virtual MIDI cable application to route directly into a DAW such as Ableton or FL Studio, or a physical MIDI-enabled device! Whether you use <em>Electrophonics</em> for professional music production or just to make a ukulele sound like a piano is up to you!\r\n</p>\r\nHi-fi audio output\r\n<p>The Web version of <em>Electrophonics</em> uses compressed audio files to improve performance, and can sound a bit \"clicky\" from time to time because of this. In the Windows &amp; Mac versions, all files are kept in their original format (with a 96kHz output!) to get a hi-fi sound signal.<br/></p>\n\n<p>***</p>\n<p>In the near future, I will be <strong>adding more instruments</strong> to the collection, and the price will go up accordingly.<br/></p>\r\nLet's Jam!", "metacritic": null, "released": "2019-12-04", "tba": false, "updated": "2019-12-06T03:28:51", "background_image": "https://media.rawg.io/media/screenshots/19f/19fac768b205d64885cb6dc0df93bce5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["KaiClavier"], "genres": [], "publishers": [], "esrb_rating": null}