{"id": 396611, "slug": "the-bibites", "name": "The Bibites", "name_original": "The Bibites", "description": "Welcome everyone! \r\n<br/>This is The Bibites  \r\n<p>A simulation where you are able to watch evolution happen before your very eyes! </p>\n<p>Each bibite (the small critters you see on the screen) starts off with an empty brain (they do nothing) and pretty basic genes (they all look alike). </p>\n<p>Through random mutations, one can be spawned with a brain connection that will link two neurons and might trigger a behavior, like going forward, which will allow them to eat food, and then reproduce with the energy gained.<br/></p>\n<p>You have reproduction, mutations, and natural selection, which leads to ... <br/></p>\n\n<p>With time, this develops into complex behaviors, like following a pheromone trail to hunt another bibites, or stockpiling food in a specific area of the map. <br/></p>\n\r\nPresent Features\r\n<p>The bibites can already (in the sense that they have te capacity to develop) :<br/></p>\n<ul><li>vision</li><li>pheromones (producing and sensing)</li><li>grabbing stuff (pellets and other bibites)</li></ul>\n<p>The only difference in the full version (accessible to my patrons), is that you can change the simulation parameters to you liking to test different scenario like \"what if food was scarcer\" or  \"what if the bibites were really small by default\"</p>\n\n<p>Become a Patron to download the full simulation ! </p>\n\n<p>But don't worry, the parameters in the Demo are the one I use when developing the simulation. I'm pretty sure they are the best one I've found so far (I might be wrong).</p>\n<p>The demo will also always contain the latest update, so don't worry about that.<br/></p>\n\n\n<p>Follow the development and see additional content on Youtube<br/></p>\r\nUpcoming features \r\n<ul><li>Procedural Sprites (generating a custom sprite for each bibite from their genes)</li><li>Biomes (better diversity)</li><li>Evolving ecosystems (the plants/food evolves too)</li><li>Rocks (Movable objects)</li><li>And much more !</li></ul>", "metacritic": null, "released": "2019-12-03", "tba": false, "updated": "2019-12-06T04:15:41", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb891d60ecdb27cc003f46172841480.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Léo Caussan"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}