{"id": 396794, "slug": "zero-g-nuclear-space-serpent-requires-vr", "name": "Zero-G Nuclear Space Serpent (Requires VR)", "name_original": "Zero-G Nuclear Space Serpent (Requires VR)", "description": "<p>How big can you grow your space serpent? Asteroids are the favorite food of nuclear space serpents because they contain essential vitamins, minerals, and fuel. Guide baby space serpents to eat the asteroids so that the can become unimaginably colossal. Avoid dangers such as space mines, and space ships.<br/></p>\n<p>This is a <strong>VR-only</strong> game for the Oculus Quest (Sideload APK) and desktop VR systems (Oculus Rift &amp; HTC Vive, Steam VR). Made in a few days for Untitled Game Jam 11. The theme was \"SPACE\".<br/></p>\n<p><strong>Controls:</strong><br/>The serpent will follow the green pointer ball that extends off your controller.<br/>Switch hand for Pointer: Front Trigger<br/>Change Zoom Mode: Side Grip<br/>Change Length of Pointer: Thumbstick/pad up and down.</p>\n<p>Larger asteroids will allow you to grow faster. You can crash into yourself. Just don't crash into space mines (level 2).<br/></p>\n<p><strong>Oculus Quest (Sideload .APK):</strong> You can install the .APK version onto the Oculus Quest via sideloading. For most people, the easiest way to do this is to install via SideQuest. After configuring your Oculus Quest for developer mode, and installing/setting up Sidequest on your desktop, you can then just drag and drop the APK into SideQuest in the area in the top left corner.</p>\n<p>Launch Zero-G Nuclear Space Serpent on the Oculus Quest by navigating to the Library, selecting the Unknown Sources category on the left, look for \"Zero-G Nuclear Space Serpent\" on the right, and run it.</p>\n<p><strong>Music:</strong> LEAD FEATHER by David Fau (Creative Commons By Attribution 3.0)<br/></p>\n<p><strong>To do (if there is enough interest):</strong><br/></p>\n<ul><li>Levels with space ship enemies</li><li>Black holes</li><li>Enemy space serpents</li></ul>", "metacritic": null, "released": "2019-12-02", "tba": false, "updated": "2019-12-06T04:56:31", "background_image": "https://media.rawg.io/media/screenshots/b6c/b6c42886a6336102f35b35febdc1d071.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["andyman404"], "genres": ["Action"], "publishers": [], "esrb_rating": null}