{"id": 396733, "slug": "leapbycycle", "name": "LeapBycycle", "name_original": "LeapBycycle", "description": "Highly recommend the downloadable version, since the browser version might lose WebGL context sometimes\r\n\r\n(It seems a problem caused by Godot engine, if any one can help to fix that, you're welcome to comment)\r\nTheme Analysis\r\n<p>LEAPS AND BOUNDS.</p>\n<p>The fifth tip on this topic mentions leap years. So I thought that the principle of leap year is actually very interesting. The slight difference between the rotation and revolution cycles forms a leap year, and the concept of leap year is very similar to a gap in time. Taking advantage of this time gap to make time leap is the theme of this game.</p>\n<p>The design of the game's gameplay is mainly based on bicycle, the transportation I use on the way to my work. In the game you need complete some circular orbits by bicycle, and the circular orbit forms a large time circular orbit similar to the orbit of the earth. When riding fast enough, a cycle difference can be formed between small and large laps. So the goal of the gameplay is to reach the maximum speed when completing the lap. At the same time, according to my riding experience, other bikes on the road and your own physical strength are factors that need to be weighed in the process.</p>\n<p>ps. Actually this is not so much a game as a complaint. I hope everyone will experience my feeling of being crushed by other vehicles on the way to work (laughs)</p>\r\nGitHub\r\n<p>https://github.com/Alovez/LeapBycycle</p>\r\nBackground\r\n<p>Dr. Nb found that the key to a time leap was the time loop.<br/></p>\n<p>By touching the time singularity, you can enter the time loop, but you can't easily escape in the time loop.</p>\n<p>According to Dr. Nb's research, the time cycle actually has the same effect as the earth's rotation and revolution.</p>\n<p>In the time loop, each cycle of the cycle itself constitutes a ring of time zones(ROTZ), while on the macroscopic scale , just like the revolution of the earth, many ROTZ around the time singularity also constitutes a closed loop.</p>\n<p>Following the law of time cycle, walking in the time loop again and again can never break the cycle.</p>\n<p>However, as the cycle of the rotation and revolution of the Earth is not exactly the same, it has formed a leap year, and the time cycle has such a problem.</p>\n<p>In the original time cycle, the six ROTZ just formed a complete time cycle. </p>\n<p>However, if a ROTZ is punched out at a faster rate than the cycle of a single ROTZ, a time crack can be obtained between the two time zones.</p>\n<p>In the time crack, you are frozen between the two time zones until they are closed. </p>\n<p>Time also does not pass until they close, which means that the time gap between the two ROTZ is outside of time.</p>\n<p>There is no time flow outside of time, so the speed will stay here.</p>\n<p>When a complete time loop is over, all previously accumulated speeds can be accumulated without a time scale. </p>\n<p>The accumulated speed will be released once when the next time loop begins.</p>\n<p>According to the theory of Dr. Nb, when the accumulated speed exceeds the time escape speed, it can break through the time loop back to the normal time line.</p>\n<p>At the same time, the difference between the accumulated speed and the time escape speed will change to the backtracking on the normal timeline. In other words, it is to go back to the past and achieve a leap in time.</p>\n<p>Leap Bycycle is a device invented by Dr. Nb for breaking the ROTZ. </p>\n<p>It is difficult to exceed the travel speed of the ROTZ by human running speed, and other power devices have no way to use it in the time cycle. </p>\n<p>Only bicycles that powered only by legs and can provide enough speed in the ROTZ.</p>\n<p>In the Leap Bycycle device, the annular time zone is represented as a road. </p>\n<p>However, time has the ability to repair itself, and there are many obstacles（like other bikes） on the road to prevent the time leap.</p>\n<p>Be careful.</p>", "metacritic": null, "released": "2019-11-30", "tba": false, "updated": "2019-12-06T04:41:12", "background_image": "https://media.rawg.io/media/screenshots/6f1/6f1b61d07bb4d46cbab060ef9af3f450.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["AloveZ"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}