{"id": 396777, "slug": "nobles-knight", "name": "Noble's Knight", "name_original": "Noble's Knight", "description": "<p><strong>How Do I Even Play This:<br/></strong>Don't expect to have too much fun with this thrilling gameplay.</p>\n<ul><li>W A S D : For Movement</li><li>Left Click : Light Attack</li><li>Right Click: Heavy Attack</li><li>Q : To Rage (When meter is built up)</li><li>E : To enter an invuln state with limited actio<strong>n</strong></li></ul>\n<p><strong>Plot:<br/></strong>Play as Linette, a living suit of armor, and rescue your master / love interest Pamela, a noble with living suit creation power magic stuff. </p>\n<p>Lilith, another of Pamela's creations, is at it again stealing Pamela away from Linette out of jealousy and knightlyness. It's time you taught that damned hat wearing goon and her other hat wearing goons a lesson once and for all. Except...</p>\n<p><strong>Not Even an Alpha Bro:<br/></strong>This game was created for the 2019 Yuri Game Jam. And as life goes; laziness, sleep, friends, hangouts, not being a programmer and crying at all the null exceptions, crying some more because your animations broke because what is IK rigging lmao, list goes on really. Because of these factors I really didn't do what I set out to get done, which in hindsight was super ambitious for a first time solo project, but I told myself no matter what state the game was in I'd upload it anyway, even if it were just boxes.</p>\n<p><strong>Author Dialogue:<br/></strong>Honestly even though its not where I wanted it to be, I'm pretty happy with how far its come. I will definitely be working on this further. Gradually I will be adding the rest of the game to the game and eventually reach the point I was aiming for. I was inspired by  the way Dark Souls and Monster Hunter: Worlds handles their combat and especially how challenging the AI could be in Dark Souls, which unsurprisingly is even more challenging to develop. For the art direction I really loved Shovel Knight and originally the concept for this game was 2D pixel art. But I really wanted to dive into some 3D modeling and animating and thus this monstrosity was born.</p>\n<p>Let me know what you think.<br/></p>", "metacritic": null, "released": "2019-12-02", "tba": false, "updated": "2019-12-06T04:51:47", "background_image": "https://media.rawg.io/media/screenshots/207/2076ce2a9e6b83adee28c8817e0f43fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["blazinmeow"], "genres": ["Action"], "publishers": [], "esrb_rating": null}