{"id": 396716, "slug": "cratesmash", "name": "CrateSmash", "name_original": "CrateSmash", "description": "CrateSmash<p>A simple block breaker clone I made following a series of tutorials in the Udemy Unity 2D course.</p>\n<p><strong>Instructions<br/></strong>Move the paddle using the mouse. The paddle can be tilted to the left or right using the left and right arrow keys so the coconut can bounce off in a desired direction.<br/></p>\n<p>The aim of the game is to keep at least one coconut from falling below the bottom of the screen by bouncing the coconut off the surface of the paddle. If there are no coconuts present you lose a life and regain a new coconut that can be shot from the paddle by pressing the left mouse button. </p>\n<p>When a crate is destroyed there is a chance that a power up may be dropped. The power up is picked up when it falls onto the paddle and a specific bonus is applied. <br/></p>\n<p>Once all of the crates have been destroyed there is a slight delay and a transition to a new level. You must get through all 5 levels while keeping your life count above zero to win! </p>\n<p><em>*Tip: One life (heart) is dropped per level... Remember to collect it!</em></p>\n<p><strong>Power ups</strong></p>\n<ul><li>Double arrow = slows down the game speed to make it easier to hit coconuts with the paddle</li><li>Fireball = all coconuts currently present catch on fire and no longer bounce off crates but smash right through them</li><li>Green coconut = a new coconut in addition to the ones currently present that can be fired from the paddle</li><li>Heart = increases life by one</li><li>Bottle with up arrow = doubles paddle size to increase chances of hitting coconuts</li><li>Mushroom = all coconuts currently present increase in size by a small amount so they have a bigger chance of coming into contact with crates</li></ul>\n<p><strong>Skills</strong><br/></p>\n<ul><li>Level design and difficulty progression</li><li>Game sound and visual assets theming </li><li>C# programming </li></ul>", "metacritic": null, "released": "2019-12-02", "tba": false, "updated": "2019-12-06T04:37:44", "background_image": "https://media.rawg.io/media/screenshots/351/35136af21b0a7d92a9fb93d32aa5b700.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ShemGameDev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}