{"id": 396840, "slug": "topgun-but-for-the-atari-5200", "name": "TopGun but for the Atari 5200", "name_original": "TopGun but for the Atari 5200", "description": "<p>The Atari 5200 console debuted in 1982 and was discontinuing in 1984, a life time of just two short years. Movie tie-in games were common in this era (the notorious Atari E.T. game was also released in 1982) and the 1986 blockbuster Top Gun was no exception. These games were among the very first combat flight sims and featured relatively complex flight models paired with extremely limited graphics. Ocean Software's first take on the license rendered actual 3D wireframes of the planes.</p>\n<p>https://www.mobygames.com/game/dos/top-gun/screenshots/gameShotId,27590/</p>\n<p>Ocean released no fewer than seven (!) ports of the licensed game to consoles and home computers, including the Atari ST, but not the Atari 5200. Even with the advances over the 2600, the 5200 would never be able to render a wireframe and HUD. But what if they had rendered the flight model in a way that earlier consoles could handle?</p>\n<p>Just kidding...</p>\n<p>Unless?...</p>\n<p><em>TopGun but for the Atari 5200 </em>is a thought experiment that runs a real 2D physics simulated flight model, then renders the output in a way that could have been displayed on a very early console.</p>\r\nInstructions\r\n<p>Take off and then land on the carrier.</p>\n<p>\n</p>\n<p><strong>W</strong>: Throttle up</p>\n<p>\n</p>\n<p><strong>S:</strong> Throttle down<br/></p>\n<p><strong>A</strong>: Pull back on stick</p>\n<p><strong>D: </strong>Push forward on stick<br/></p>\n<p>To take off, push the throttle all the way up, and pull the stick all the way back.</p>\n<p>You must be below 200 knots and 500 feet to land on the deck of the carrier.</p>\n<p>It's okay if you miss it the first time, it'll come around again.</p>\r\nNotes on the Physics\r\n<p>The game runs a 2D physics simulation to model flight. A net force vector is calculated by adding vectors for gravity, thrust, lift, and drag. Inputs to these force vectors are taken from physical constants and the F14 spec:</p>\n<p>https://en.wikipedia.org/wiki/Grumman_F-14_Tomcat</p>\n<p>The net force vector is turned into acceleration, and this acceleration is then  integrated into velocity, and subsequently position. To keep the plane within a nice play area, angle of attack is bounded to +/- 1/4 Pi, and both overall elevation and speed are bounded. To make gameplay a little snappier, the amount of thrust provided for a given throttle setting has been fudged upward a lot. This results in simulated net forces that would be fatal to a real pilot.</p>\n<p>Landing is successful at &lt;200 knots and &lt;500 feet to make the game reasonable to play, but is possible at &lt;150 knots and &lt;20 feet.</p>", "metacritic": null, "released": "2019-12-01", "tba": false, "updated": "2019-12-06T05:05:21", "background_image": "https://media.rawg.io/media/screenshots/134/134387cb6d7249b6b43a133f1ab94392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["never_k"], "genres": ["Action"], "publishers": [], "esrb_rating": null}