{"id": 396895, "slug": "minesweeper-reboot-pro", "name": "Minesweeper Reboot PRO", "name_original": "Minesweeper Reboot PRO", "description": "The best new way to play the classic Minesweeper, fully optimized for iOS! Control, Graphics &amp; Animation simply make \"Minesweeper Original Reboot\" a revolutionary remake of this classic.<br/><br/>The task is simple: mark and sweep all mines in the field. This classic game play is just that simple yet so exciting and challenging. \"Minesweeper Original Reboot\" is perfect for brain practicing and short time playing at any time. Play now to test your deduction skill as well as your finger speed!<br/><br/><br/>What make \"Minesweeper Original Reboot\" special:<br/><br/>  - Optimized for guaranteeing fastest game play and best control experience: Careful designed just for touch devices with super fast and easy control (TAP to open square, TAP &amp; HOLD to drop flags, DRAG to move board around, PINCH to zoom)<br/>  - Auto save and load, never lose your current game even if it is completely quit or crashed<br/>  - Elegant, beautiful graphics with lots of cool sound and animation effects<br/>  - Support both portrait and landscape rotations on both iPhone and iPad devices<br/>  - Auto resize board to take advantage of whole screen<br/>  - Auto scrolling board after every touch (optionally enabled/disable) which is convenient to navigate the board without manually dragging<br/>  - 3 zoom modes for board: 1x, 2x, 3x to suit any finger sizes. Note that the scale up does not effect the image quality<br/>  - Quick overview mode which allow seeing the overall board and quick jumping, extremely helpful for large board sizes<br/>  - Hint to open any given square at any time: very helpful for 50/50 situations or when getting stuck<br/>  - SUPER HARD level + CUSTOM level allowing the max board size up to 72 x 72<br/>  - Share your results via email or social networks<br/>  - Step-by-step instructions for people who have never played Minesweeper before<br/><br/>Other common features:<br/>  - 3 traditional levels: EASY, MEDIUM, HARD<br/>  - First touch guaranteed not to hit a mine and always opens a range of squares<br/>  - Flagging/Digging modes<br/>  - Local statistics: best time, number of wins and losses<br/>  - Game Center support<br/>  - Natively, beautifully run on all iOS devices<br/><br/>Have fun and enjoy playing \"Minesweeper Original Reboot\"!", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-12-09T01:53:20", "background_image": "https://media.rawg.io/media/screenshots/276/276474d85afcb521762a4b311fcc7c69_zmOOQqD.jpg", "website": "http://www.skypaw.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SkyPaw Co"], "genres": ["Board Games", "Puzzle"], "publishers": ["SkyPaw Co"], "esrb_rating": "Everyone 10+"}