{"id": 397252, "slug": "touge-cadence-project-an-inprovement-venture", "name": "Touge Cadence Project: an Inprovement Venture", "name_original": "Touge Cadence Project: an Inprovement Venture", "description": "O que é?\r\n<p>Touge Cadence Project: an Improvement Venture, ou apenas Touge Cadence, é um jogo baseado no controle de um carro, no BPM de uma música. </p>\r\nComo funciona?\r\n<p>O jogador deve trocar entre as <em>lanes  </em>de uma pista para desviar de carros no caminho contrário, para que não perca vida e termine o jogo, e coletar moedas que aparecem no ritmo da música.<br/>O controle padrão é o toque em dos lados da tela para trocar de via e há ainda um controle por acelerômetro (incompleto) onde o carro troca de <em>lane </em>ao girar como um volante para o lado desejado e voltar ao centro.<br/></p>\n<p>São 3 modos de jogo: Uma Corrida, Campanha e Sem Parar. No modo uma corrida, o jogador primeiro seleciona um dos 3 carros disponíveis e uma das 6 <em>skins</em> disponíveis para cada, em seguida escolhe uma das 13 músicas disponíveis e, sendo elas de diferentes estilos musicais, é possível ter uma prévia ao clicar para seleciona-las. Por fim deverá escolher uma das 4 pistas diferentes, baseadas em caminhos sinuosos por montanhas (<em>Touge</em>).  Ao final da música, sua pontuação será referente a quantia de moedas coletadas x quantia de vida restante. Se sua pontuação estiver entre os 5 melhores daquela pista, poderá inserir-se no ranking. <br/></p><p>O modo sem parar segue a mesma ideia, com a diferença que não escolhes a música mas sim deve passar por todas elas em sequência em ordem aleatória. No final sua pontuação será a quantia de moedas coletadas e sendo uma das 5 melhores no modo, entrará para o ranking do mesmo.</p>\n<p>No modo campanha, o jogo se baseia em se jogar cada uma das músicas, em ordem de dificuldade, formando assim 13 capítulos. Entre cada <em>gameplay </em>o jogador acompanhará uma estória baseada em ficção científica, de 4 pessoas diferentes alternando em jogar o próprio Touge Cadence.</p>\r\nHistória...Personagens?\r\n<p>Fugindo de um perigo iminente, Fábio Dias entra a bordo de seu prótotipo de nave #57 de viagem temporal e interdimensional,  saindo afora pelo multiverso e buscando então outras 3 versões de si, para ajudá-lo a combater seu inimigo. Os 4 então reunidos, decidem se apresentar e no desenrolar, encontram uma mensagem que os indica a jogar o jogo Touge Cadence, pois isto os ajudaria em sua missão.</p>\r\nQuem fez?\r\n<p>Game Design e Arte 2D<br/>Mateus Francisco Gomes da Rocha Costa<br/>Moysés Caetano de Melo</p>\n<p>Programação e Produção<br/>Moysés Caetano de Melo</p>\n<p>Arte 3D<br/>Iago Alves da Silva</p>\n<p>Músicas</p>\n<p>\"Meaning of Lifespan\"<br/>Naoya Sakamata<br/>Licensed under Creative Commons: By Attribution 4.0 License<br/>http://creativecommons.org/licenses/by/4.0/</p>\n<p>\"Exit the Premises\",\"Lagoa v2\",\"Ouroboros\",\"Shiny Tech v2\",\"Hall of the Mountain King\",\"Exhilarate\",\"Ready Aim Fire\", \"The Cannery\" &amp; \"Anachronist\"<br/>Kevin MacLeod(incompetech.com)<br/>Licensed under Creative Commons: By Attribution 4.0 License<br/>http://creativecommons.org/licenses/by/4.0/</p>\n<p>\"Highway on the Sea\"<br/>DjannoBin<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p>\"Step Inside Your Mind\"<br/>TeknoAxe ft. Sharm<br/>Licensed under Creative Commons: By Attribution 4.0 License<br/>http://creativecommons.org/licenses/by/4.0/</p>\n<p>\"Luna (Nightmare/Uncorrected Vocals Mix)\"<br/>Eurobeat Brony ft. Odyssey<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p><strong>Nossos agradecimentos especiais a Jhone Marra e todos que ajudaram de alguma forma a realização deste projeto</strong></p>", "metacritic": null, "released": "2019-12-07", "tba": false, "updated": "2019-12-09T03:11:02", "background_image": "https://media.rawg.io/media/screenshots/b16/b160046a7c40e487d191ad8b9ce32ef0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Reymax Produções"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}