{"id": 397460, "slug": "fields-of-fire", "name": "Fields of Fire", "name_original": "Fields of Fire", "description": "<p><strong>Story</strong><br/>A year has passed since the great war that divided the races of the country and saw the Demons take power, nearly bringing humankind to its extinction. Since that day the Demons’ Fortress has floated ominously above the sea, an ever present threat. An arms race between the subdued races foreshadows another great war, which promises to challenge the balance of power yet again. As the last human mercenary, it falls to you to take up leadership in your people's darkest hour. You must defend your realm and ensure the survival of humankind.</p>\n<p><strong>Features</strong><br/>• Create many different buildings and other objects such as Residences, Watchtowers, Barracks, Forests and many more. Some of them can also be upgraded.<br/>• Train Defensive Units and Offensive Units to either protect your own buildings or to destroy enemy buildings. <br/>• Train Mineworkers, Lumberjacks, Blacksmiths, and Farmers to provide food for your population and to gather important resources.<br/>• Buy and sell resources at your own Marketplace or trade stuff with traveling merchants.<br/>• Turn-based day-system.<br/>• Challenge your luck on numerous gambling games.<br/>• Beat up against 4 autonomous, CPU-controlled enemies and make them your subjects.<br/>• Destroy the Demons´ Fortress and bring back peace to the whole country.<br/>• Find the 3 hidden bonuses, collect all 50 achievements and become the God of the world.</p>", "metacritic": null, "released": "2019-12-05", "tba": false, "updated": "2019-12-09T04:03:56", "background_image": "https://media.rawg.io/media/screenshots/1b6/1b61d7ee9a8ae83889256b20033359fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TwoFaceGames"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}