{"id": 397538, "slug": "myths-of-the-world-the-whispering-marsh-a-mystery-", "name": "Myths of the World: The Whispering Marsh - A Mystery Hidden Object Game (Full)", "name_original": "Myths of the World: The Whispering Marsh - A Mystery Hidden Object Game (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>People are disappearing in the town of Kaltdorf, and no one seems to know why. A local legend speaks of an entity called the Lantern Man, who lures innocent victims to their deaths in the marshes, but nobody believes he actually exists. Is he just a fable, or something far more sinister? It’s up to you to figure it out!<br/><br/>• CAN YOU AVOID A WATERY GRAVE?<br/>Reports have come in of strange, twinkling lights that have been beckoning the townspeople into the swamp, never to be seen again. Who’s controlling these lethal illuminations, and can you stop them before it’s too late?<br/><br/>• ACT FAST, OR IT’LL BE LIGHTS OUT FOR YOU!<br/>Slog your way through a world of creepy hidden object scenes.<br/> <br/>• CHARGE UP YOUR SPECIAL LANTERN<br/>Use the powers of this unique device to solve swampy puzzles and mysterious mini-games.<br/><br/>• RETURN TO KALTDORF MARSH IN THE BONUS GAME<br/>Go back to the source and enjoy additional Collector’s Edition exclusives including collectible Acorns, morphing objects, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-07-29", "tba": false, "updated": "2019-12-13T02:07:07", "background_image": "https://media.rawg.io/media/screenshots/02f/02f0aca5dec29c4ce9bac78aa75e8aa3_goIcM2N.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}