{"id": 397546, "slug": "january-uprising", "name": "January Uprising", "name_original": "January Uprising", "description": "The January Uprising: Strategy Game is a real time strategy (RTS) in which you move into 1863 and take part in the famous 19th century Polish uprising against the tsarist regime, the January Uprising. <br/><br/>In 1863, parallel to the civil war in the United States, there was no less dramatic but less known conflict in Europe. After a hundred years of occupation, poles once again are throwing themselves into the unequal struggle with the occupant. As commander of the Polish insurgent army, you will face the Russian Empire in small guerrilla skirmishes and major battles. You will meet historical figures and visit places where the fate of the uprising was decided. You will learn the nuances of insurgent politics and the secrets of the nineteenth century guerrilla warfare.<br/><br/>The January Uprising: Strategy Game is:<br/>- real-time strategy with elements of guerrilla warfare<br/>- 21 insurgent battles<br/>- 15 types of Polish insurgent troops <br/>- 8 types of Russian Empire regular troops<br/>- the story leading the player through the entire history of the uprising including the story of three dictators of the uprising: Ludwik Mierosławski, Marian Langiewicz and Romulad Tragutt<br/>- 2 alternative endings<br/>- historical materials related to game events<br/>- the game is fully translated into English <br/><br/>The January Uprising is next to the Warsaw Uprising, the largest and most tragic Polish national uprising.<br/>From the very beginning, the chances of success were very slim. <br/>But do not give up! <br/>You can still change the course of history!<br/><br/>The January Uprising is one of the great Polish national uprisings, such as the Kosciuszko Uprising (Kościuszko Insurrection), the November Uprising and the Greater Poland Uprising. It exploded on January 22, 1863 and lasted until autumn of 1864. It was the largest Polish national uprising. It had the character of a guerrilla war in which about 1200 battles were fought, and about 200,000 people served in insurgent units.<br/><br/><br/>###### PO POLSKU #####<br/>Powstanie Styczniowe: Gra Strategiczna to strategia czasu rzeczywistego (RTS), w której możesz przenieść się do roku 1863 i wziąć udział w największym i najtragiczniejszym zarazem polskim zrywie narodowym, Powstaniu Styczniowym. <br/><br/>Jako dowódca oddziału powstańczego stawisz czoła armii Imperium Rosyjskiego zarówno w małych partyzanckich potyczkach, jak i największych bitwach. Spotkasz historyczne postacie i odwiedzisz miejsca, w których ważyły się losy powstania. Poznasz niuanse powstańczej polityki i tajniki XIX wiecznej walki partyzanckiej.<br/><br/>Powstawanie Styczniowe to obok Powstania Warszawskiego największe i najtragiczniejsze polskie powstanie narodowe. Już od samego początku jego szanse powodzenia były bardzo nikłe. <br/>Nie zważaj jednak na to! <br/>Wciąż możesz odmienić bieg historii!<br/><br/>Powstanie Styczniowe: Gra Strategiczna to:<br/>- strategia czasu rzeczywistego z elementami walki partyzanckiej<br/>- 15 rodzajów polskich oddziałów powstańczych<br/>- 8 rodzajów oddziałów regularnej armii Imperium Rosyjskiego<br/>- 21 strategicznych misji<br/>- fabuła prowadząca gracza przez cały przebieg powstania, przybliżająca dzieje 3 dyktatorów powstania Ludwika Mierosławskiego, Mariana Langiewicza i Romualda Tragutta<br/>- materiały historyczne dotyczące najważniejszych postaci powstania, rozegranych bitew i innych istotnych pojęć<br/><br/>Powstanie Styczniowe to jedno z wielkich polskich powstań narodowych, takich jak Powstanie Kościuszkowskie (Insurekcja Kościuszkowska), Powstanie Listopadowe i Powstanie Wielkopolskie. Wybuchło 22 stycznia 1863 i trwało do jesieni 1864. Było największym polskim powstaniem narodowym. Miało charakter wojny partyzanckiej, w której stoczono ok. 1200 bitew i potyczek,a przez oddziały powstańcze przewinęło się około 200 000 ludzi.", "metacritic": null, "released": "2018-01-05", "tba": false, "updated": "2019-12-13T02:09:51", "background_image": "https://media.rawg.io/media/screenshots/b46/b46d952ac279ac7429a723fdba8b6272.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fundacja Interaktywna"], "genres": ["Strategy", "Simulation", "Educational"], "publishers": ["Fundacja Innowacyjnej Edukacji Spolecznej Sensua"], "esrb_rating": "Everyone 10+"}