{"id": 397575, "slug": "hounds-of-valor", "name": "Hounds of Valor", "name_original": "Hounds of Valor", "description": "Hounds of Valor is a character action game starring a sword wielding dog battling monsters in a single player adventure. The game-play utilizes fast paced combat in a fantasy world where dogs are the heroes.\r\n<p>Inspiration comes from the ps2 classics Okami and God of War.</p>\r\nWhat is in this Demo?\r\n<p>I am calling this a Vertical Slice of the game, it has the near final visuals, base combat , level structure and a boss fight. I have remixed the first mission of the game to create a quick ~15 minute showcase of my work so far. The current build is missing some sound effects like enemy movement, some attacks and boss music.</p>\n<p>Hounds of Valor is still in development and feedback is critical for refinement and evolution, all is welcome. I will continue to update this page as development progresses.</p>\n<p>As a dog you have melee attacks like light, heavy and bash, each of these have different functions when held down, chained together or used mid air. Experiment as there are quite a lot of them in the game already! <em>Psst, try holding heavy attack while at the apex of a double jump! </em></p>\n<p>Read more on my website http://www.dogatworkgames.com/houndsofvalor/</p>\r\nWhat is to Come\r\n<p>I have been working on this game for over 3 years in my spare time from a full time job. Now Hounds of Valor is ready to be seen on a larger scale!</p>\n<p>I post development on my Twitter and Facebook accounts so please follow me there too. If you have any questions feel free to ask or message me. I always like to learn and help where I can.<br/></p>\n<p> Any shares to others can help tremendously to get the word out.<br/></p>", "metacritic": null, "released": "2019-12-12", "tba": false, "updated": "2019-12-13T02:16:45", "background_image": "https://media.rawg.io/media/screenshots/ac1/ac1778c3bc8500b200cd47d51e990208.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["DogatWorkGames"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}