{"id": 397664, "slug": "in-the-back-a-retail-adventure", "name": "In the Back: A Retail Adventure", "name_original": "In the Back: A Retail Adventure", "description": "<p><strong>Welcome, Seasonal Employee, to Our Store!</strong></p>\n<p>The busy holiday season is upon us and we're grateful that you've temporarily joined our team. Unfortunately, our computerized inventory system is currently down. What this means is that if you have a customer who can't find a specific item and asks you to look for it \"in the back\", you must accommodate them.</p>\n<p>Now, our store's stock room is a bit different from those at other big-box retailers, plus we have just started a reorganization, but don't worry! It is easy to get around in and you should have absolutely no trouble finding what you want. Well, unless you work in the Media and Entertainment department...</p>\n<p>Please inform your department manager immediately if you have any kind of medical issues and/or phobias. Believe it or not, this information is necessary should you have any need to visit the stock room.</p>\n<p>If you have any additional questions or concerns, please contact me or your direct supervisor.</p>\n<p>--Benicia Martinez, Store Manager<br/><br/><strong>How to Play</strong></p>\n<p><em>In the Back</em> is an exploration game. Your task is to assist a customer seeking the Limited Edition of the hot new triple-A FPS <em>Covert Deployment IV</em>. There aren't any copies on your store's shelves, so it's up to you to see if you can find one in the back stock room.</p>\n<p>Spend as much time as you like looking around and examining various objects and environments. Don't worry about taking too long; your customer has been waiting for this game for several months now, but foolishly forgot to preorder until it was too late. They are more than willing to wait, so long as you can find what they are after.</p>\n<p>This game uses standard first-person keyboard and mouse controls. A list of commands can be found on the \"About\" page in the game's main menu.</p>\n<p><strong>Message from the Creator</strong><br/></p>\n<p>This is the fifth of my Holiday Cards, a (mostly) annual free games project! I wanted to do a first-person exploration game for this installment, and the stock room theme came together during the process of making it.</p>\n<p>The engine this time is GameGuru. Unfortunately, this engine is a bit buggier than the others I've used thus far. Please submit bug reports if you notice anything especially problematic, and I'll see what I can do. Also note that<strong> saving has been disabled</strong> due to bugs which I am unable to fix at this time, but this is a short game that can be completed in around an hour or less, so hopefully this is not a problem for most players.<br/></p>\n<p>After this release, the Brainscraps Holiday Card series is taking a year off, so I hope to see you all again in 2021!</p>\n<p>--RKasa (aka R. Kasahara), December 2019<br/></p>\n<p><strong>System Requirements</strong></p>\n<p><strong>OS:</strong> Windows 7 or later<br/><strong>Processor:</strong> Intel Dual-Core 2GHz or AMD Dual-Core 2GHz (recommended: Intel Quad-Core [i5 2300] or AMD Octo-Core [FX 8150])<br/><strong>Memory:</strong> 2 GB RAM (recommended: 4 GB RAM)<br/><strong>Graphics Card:</strong> NVIDIA GeForce 400 series or AMD Radeon HD 6000 series (recommended: NVIDIA GeForce 660Ti or better, AMD Radeon HD 7950 or better)<br/><strong>Storage space:</strong> 3.4 GB (recommended: a solid-state drive)<br/><strong>Other:</strong> DirectX 11<br/></p>\n<p><strong>Licenses</strong></p>\n<p>All original content in <em>In the Back: A Retail Adventure</em> is licensed under a<br/>Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License.</p>\n<p>Please refer to the enclosed \"licenses.txt\" file for full licensing information for fonts, sounds, and other assets used in this game.<br/></p>\n<p>If you have any questions or comments, feel free to contact me. Enjoy!</p>", "metacritic": null, "released": "2019-12-12", "tba": false, "updated": "2019-12-13T02:37:50", "background_image": "https://media.rawg.io/media/screenshots/170/170f3e12eb4520278bf0d57e9581f24d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brainscraps"], "genres": [], "publishers": [], "esrb_rating": null}