{"id": 397617, "slug": "prototyping-project-2", "name": "Prototyping Project 2", "name_original": "Prototyping Project 2", "description": "<p>I took a class during the fall of 2019 at the University of Texas that focused on the idea of prototyping. This was the first game we made using unity. Here were the assignment's rules.</p><p>In this solo project, you will create a complete prototype by yourself completely from scratch. This includes making <strong>your own art, sound, particles, animations, code</strong>...Do not use any assets from the Standard Assets or the Asset store or any previous projects, everything must be created from scratch.</p>\n<p><strong>Project Requirements:</strong></p>\n<ul><li>2D or 3D (create your own rough assets, do NOT use assets from the Asset Store)<ul><li>Must include both art and sound</li><li>Create \"Bad Assets\" (meant to be made as quickly as possible and indicate to the viewer that this is a Prototype)</li></ul></li><li>Character Movement (do NOT use a prebuilt character controller)<ul><li>Move with arrow keys, jump with space bar</li></ul></li><li>Health and Damage<ul><li>Player starts with 100 health, displayed as text</li><li>Walk over trap, take damage</li><li>Update text when player takes damage</li></ul></li><li>Collectables<ul><li>Display text with number of items collected</li><li>When player collides with item, number goes up, trigger particles and sound</li></ul></li><li>Key and Locked Door<ul><li>Door blocks player until they have key</li><li>Key is collectable (with particles and sound)</li><li>When player collides with door and has key, the door animates open</li></ul></li><li>Physics<ul><li>Items that fall to block the player's path, or blocks the player can push</li></ul></li></ul>", "metacritic": null, "released": "2019-12-12", "tba": false, "updated": "2019-12-13T02:26:28", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2ea21b18b693ddc83ae8ebcabec106c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CooperFryar"], "genres": [], "publishers": [], "esrb_rating": null}