{"id": 397779, "slug": "hero-itch-sadherogames", "name": "H.E.R.O. (itch) (sadherogames)", "name_original": "H.E.R.O. (itch) (sadherogames)", "description": "<p>Dungeon crawler with turn-based combat where the player skills will change after each battle, gaining the last of the defeated enemy.</p>\n<p><strong>STORY</strong></p>\n<p>Imagine a world where people are born with superpowers, some are unbelievably powerful, such as controlling fire or water, while other are… a bit more mundane, like growing flowers from your hands. But not everyone uses their powers for good, as some choose to use their powers for evil (if you can tell us how to use flowers as an evil power, we’re listening). However, an association was born amidst the battle between good and evil, the Heroes Obeying Ethical Reasoning or H.E.R.O. for short. They defended the population from those never do gooders, but in the the final battle between good and evil they were defeated, fading into obscurity.<br/></p>\n<p>\n</p>\n<p>After years of tyranny, someone finally decided to do something, someone decided to rise to the occasion, and from his chair… Copyman! While he was a very capable hero, he lasted just three days inside the association. Some say it was an inside job, others a power struggle, but the reality is that he was too lazy to save the world, he really wanted to catch the latest episode of Cooking Wild.</p>\n<p>On Tuesday, at the same scheduled time, Copyman sat on his couch to watch the TV, but gasp it was cancelled! Not only that, but SpeedKnife, the world’s greatest chef and host of Cooking Wild… was gone. The tyranny of the villain’s league had gone too far. It was time Copyman took matters into his own hands.</p>", "metacritic": null, "released": "2019-12-11", "tba": false, "updated": "2019-12-13T03:07:15", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d0a0c4b084df191a66357443951ef94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sadherogames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}