{"id": 397705, "slug": "monsters-mojo", "name": "Monsters Mojo", "name_original": "Monsters Mojo", "description": "<p><strong>Monster Mojo:</strong> Welcome to the fantasy world of little jelly monsters. Foghop comes with another fun filled monster match 3 game with unique graphics and sounds after the success of Candy Smack connecting game. Connect the colorful jelly monsters with a single touch and draw the longest possible chain to collect as many jellies you can. Solve the compelling levels with your strategic connecting and smash &amp; pop the monsters.</p>\n<p>Match 3 or more monster pops in a single touch to blast and collect them. Earn high score by connecting the more number of mojos with your tactical connection.<br/>Daily magic spin wheel gives you a chance to win magical power ups, extra moves, power boosters, swapping moves, monster busters and much more. All the earned power ups help you in the game play to complete the challenging levels easy. Target to earn three stars at each level and be a monster splash to stand up in the game members. You can buy extra moves and powers with the collected stars.<br/>Enjoy your journey with this monster high games through different themes and hundreds of levels. Amazing monster jam adventure is waiting for you.<br/><br/><strong>GAME FEATURES:</strong><br/>✔ 300+ well designed strategic levels with a unique concept that excites you.<br/>✔ Completely FREE to play and in-app purchases to get extra moves and lives.<br/>✔ Connects as many monsters as you can and get boosters and power ups.<br/>✔ Unique and impressive visuals that motivate your journey to the next levels.<br/>✔ Facebook connectivity to share and challenge your journey with friends.<br/>✔ Integrated with Google Paly Achievements and Leader boards.<br/>✔ Play with your family and friends to challenge and beat them.<br/>✔ Compatible with most of the smartphones and tablets.<br/></p>", "metacritic": null, "released": "2019-12-12", "tba": false, "updated": "2019-12-13T02:46:57", "background_image": "https://media.rawg.io/media/screenshots/216/216ad997c37209f55f1b58fc2a2a8b71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Launchship"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}