{"id": 397957, "slug": "final-project-writeup", "name": "Final Project Writeup", "name_original": "Final Project Writeup", "description": "<p>The way to play my game is simple. The 4 buttons in the screen will randomly blink, and player need to click the button while the button is in a different color. The game will keep going on until a player missed 4 clicks.  </p>\n\n<ul><li>Your experience using your engine system</li></ul>\n<p>Since I have been touching my engine system for a while, I don't really have an opinion about it. what I realize is that because the system I working on was UI system, there is some overlapping with graphic system. There for, if anyone wants to use my system, either their system need to change the object class or they need to rewrite the class name in my system even though the functionality is exactly same. and I wasn't expected that. If there is a chance to rewrite my system, I will make the class as template to make it flexible.</p>\n<ul><li>Your experience using someone else's engine system</li></ul>\n<p>The audio system I used for my game was very straight forward and quit easy to use.  There was a few bug in an audio system, however the code was organized and I didn't have problem fixing up the issue.</p>\n<ul><li>Your experience making a game with your game object and graphics interfaces</li></ul>\n<p>Since the graphic engine is somehow overlap with my UI system, I need to work on small modification when I make a game which was a little bit annoyed.</p>", "metacritic": null, "released": "2019-12-11", "tba": false, "updated": "2019-12-13T03:52:43", "background_image": "https://media.rawg.io/media/screenshots/b95/b95362808deff22579842f4584d66951.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dropanddrop"], "genres": [], "publishers": [], "esrb_rating": null}