{"id": 398158, "slug": "save-the-ship-from-jupiter", "name": "Save the ship from Jupiter!!!", "name_original": "Save the ship from Jupiter!!!", "description": "<p>“Save the Ship from Jupiter” is a collaborative storytelling Bitsy that is highly interactive mini story. The story is about a spaceship full of the last generations of humans that were on earth. The earth was dying and dying fast so something had to be done. That was when the ship came to be, it can be most relatable and inspired by Wall-E and how they’re ship was designed. As you play you learn about a huge problem that came to be and you are told that only YOU are able to solve it. That being said you travel through a couple of key rooms on the ship trying to solve the biggest problem ever known to this ship before it crashes and wrecks into Jupiter. This is a simplified version of what the potential theme park and adventure that could be taken place. Because of the simplicity of Bitsy I wasn’t able to show and create all of the objects, rooms, and other characters that could potentially be involved in this interactive game. Within this game, the main character learns about other characters and which ones they can interact with and which ones will give them more information. The one playing will have to go through different rooms and sometimes gp  back and forth between rooms to find the objects needed to save not only the ship but also all of the passengers on it from earth. The characters make appearances in different rooms and sometimes when going back to that room they have gone or something else is added to the room. I made sure to do things like this to make it seem more life like, nothing ever stays the same in real life so why should it stay that way in my game. If you go through each room, room by room you will notice something has changed in there. Maybe a person left, or was added to the room or likewise with objects that you are supposed to find as the main character. I believe that games are more fun when things are more ever changing, looking at a room and it not changing is boring. One of my favorite little aspects, is the secret passageway that was used to get from the mechanical (boiler room) to the cockpit room. It was a last second add on and I really like how it turned out. The hardest room to create was the cockpit. A cockpit is full of buttons, levers, flashing lights, and computer screens. Now trying to create that in bitsy was terrible, it was very hard to create. Although each time you go into the cockpit area, Jupiter gets larger and larger which indicates that the spaceship is getting closer to crashing which indicates that you need to try and solve the problem as fast as you can. That was another last second addition that I believe makes a huge difference and makes it feel like that much more of a video game and realistic.</p>", "metacritic": null, "released": "2019-12-09", "tba": false, "updated": "2019-12-13T04:39:19", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e32e52ce40bccf6a07a401f71cf4938.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hannahw567"], "genres": [], "publishers": [], "esrb_rating": null}