{"id": 398147, "slug": "escape-room-puzzle", "name": "Escape Room Puzzle", "name_original": "Escape Room Puzzle", "description": "<p>This is a prototype for the first part of an escape room.</p>\r\nOverview\r\n<p>The first puzzle will consist of two parts. In the first part, the players try to gain access into the facility via inputting a code into the keypad. The second part consists of the players having to manually override the door to access the next room.</p>\n<p><strong>Team members names and roles<br/></strong>● Alex Carriles- Designer<br/>● Amber Smith- Scripter<br/>● Calvin Briscoe- Scripter<br/>● Cash Condon- Audio<br/>● Josh Churchill- Producer<br/>● Justin Wu- Scripter<br/>● Stephanie Wilhite- Artist<br/>● Tyler Grendel- Artist</p>\r\nMechanics/obstacles\r\n<p><strong>Mechanics:</strong> movement, looking at ID cards, entering numbers into a keypad, picking up items, moving chairs<br/><strong>Obstacles:</strong> doors, locks<br/></p>\r\nPuzzle details\r\n<p><strong>FIRST ROOM (A)</strong> </p>\n<ul><li>Plank blocking the keypad</li><li>Door with a keypad that leads into the second room</li><li> Palettes blocking door</li></ul>\n<p><strong>SECOND ROOM (B)</strong></p>\n<ul><li>Inspired by a plane/escape pod</li><li>Cargo style chairs on one end of the room</li><li>Door on the opposite wall to the chairs</li><li>Drawers underneath seats that block access to the chairs being moved if the drawers are inserted</li><li>Drawer underneath one of the seats is locked, and the key is hidden in the room </li><li>Inside the locked drawer is a safety sheet (pictured below)</li></ul>\r\nHow to play\r\n<ul><li>Move with WASD</li><li>Control camera with mouse</li><li>Move items and chairs with by clicking and dragging the mouse</li><li>Press space to pull up ID cards</li><li>Escape to see controls R to reset</li></ul>\n<p>\n</p>\r\nSpoilers\r\n<p><strong>PART I</strong><br/>A piece of old wood is in front of the keypad. Remove it by clicking and dragging the mouse. Players find themselves with ID cards that represent their respective characters. On all of the ID cards, the badge numbers begin with a zero and then a single digit number from 1 to 9. Because there are four players, they must figure out the order of their ID numbers to discover the code. In our prototype, the order is indicated by a big number on the card. The players must enter the code (5917) to open the door. Old Palettes block the door to the next room. Move them by clicking and dragging the mouse.<br/></p>\n<p><strong>PART II</strong><br/>They now find themselves in an escape pod (cargo plane inspired). They see four chairs alongside one of the walls. Underneath all four chairs is a rail for a sliding drawer. However, all the drawers are missing except for one. The one drawer still there is locked. The three chairs that are missing the drawer can be adjusted and clicked into place in an upright position, but the chair with the drawer cannot. Opposite to that is the door they are trying to get into. Hidden in the second stacked drawer by the door is the key to the drawer underneath the chair. Inside the drawer they find an airplane infographic that tells them to put the chairs upright for “safety reasons” in order to manually override the door. After pulling the drawer out from under the chair, it is unstuck and the players can move it. After the players position all of the chairs upright, the door opens automatically.</p>", "metacritic": null, "released": "2019-12-09", "tba": false, "updated": "2019-12-13T04:36:54", "background_image": "https://media.rawg.io/media/screenshots/5d3/5d336b5eaa6a6413b91003e47f12fa4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["justin2jam", "ACStudiosX", "Cashel Condon", "Amber Smith", "Stephanie Wilhite"], "genres": [], "publishers": [], "esrb_rating": null}