{"id": 398271, "slug": "swing-words-phonics-and-alphabet-games", "name": "Swing Words Phonics and Alphabet Games", "name_original": "Swing Words Phonics and Alphabet Games", "description": "<p>Short Vowel Sounds, CVC Words<br/>• Learn Phonics Sounds and ABC sounds<br/>• Magic E and Long and Short Vowels<br/>• Blending sounds and Diagraphs<br/>• Over 40 levels with free coins to win!<br/>• Cute Child friendly images<br/>• Ideal for home or classrooms<br/>• Learn to read and have fun<br/><br/>Lots of Phonics games included to have fun and learn English.<br/><br/><br/>Chose your animal and take them on a Jungle Adventure through the Phonic Forest!<br/>Swing, Slide and Jump your way to earn coins to free the other animals!<br/><br/>The better you do the more you can win!<br/><br/>Included within the game all 40 plus English Phonic sounds that slowly progress in difficultly as the player plays progresses through the Phonics game.<br/><br/>Although there are In app purchases, you will get rewarded for both playing the game and accuracy where you can earn the coins to unlock the premium features in the app.<br/><br/>It is leveled with each phonic sound being added to the game as you play through. Until the final levels when it will randomly select from the sounds you have practiced and learnt!<br/><br/>It is designed this way to ensure that students new to phonics have the time to consolidate their learnign and not just plow through with out having time to digest what they have learnt.<br/><br/>Making English Fun<br/><br/>English Play and Phonics games are an important part of the learning process for children especially younger children. Taking difficult tasks and making them enjoyable, interactive and purposeful will gain quicker results than simple rote learning of a language. I hope by using phonics games these apps will go some way to helping you, your students or your children learn English is a fun and interactive way.<br/><br/><br/><br/>What is inside,<br/><br/>ABC , CVC, Vowel, English Blends, Magic E, Syllables and sight words all wrapped up in one easy to use English Word and phonics game.<br/><br/>There are over 40 levels of phonics and 5 sections and 3 games in each level.<br/>Each level included 2 swing Phonics games, 2 slide and spell phonics games and 1 jump phonics game.<br/><br/>The more starts you get the more coins you get, the more coins you get the quicker you can rescue the other animals, unlock all the levels, and remove ads if you wish.<br/><br/>Of course if you want these are also included as In app purchases.<br/><br/>There are many more CVC games, Abc games and phonics games on my store and there are links int eh app to find those. they also have blends, phonics quizes and Magic E apps.<br/><br/><br/>www.makingenglishfun.com if you would like to play in classrooms or on PC.<br/><br/>I am a teacher of English and use phonics games when needed in my lessons, i wanted simple ones to save time and when i couldn't find them i decided to try to make my own, i hope these are useful for your teaching of phonics as well.<br/><br/>Phonics games and English Learning apps are just one way for students to learn English, but i hope they go some way to helping you and your students!<br/><br/>Also great used as ESL games in ESL classrooms</p>", "metacritic": null, "released": "2019-12-09", "tba": false, "updated": "2019-12-13T05:11:55", "background_image": "https://media.rawg.io/media/screenshots/5fe/5fed7c5a44c26e2f88fe3a65a2cfeb7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Making English Fun"], "genres": [], "publishers": [], "esrb_rating": null}