{"id": 398388, "slug": "framing-dawes-demo", "name": "Framing Dawes Demo", "name_original": "Framing Dawes Demo", "description": "Demo out now!<br/><br/>Watch the trailer on YouTube: \r\n\r\n\n<p>After a heated argument with her Father, a desperate Bay Dawes runs to the woods and digs up a box of her Mother's belongings.  These few but precious items she gathered before her Mother went to Witherington End Asylum are all she has left of her. Within the box, there is also an ornate bottle full of a strange dark liquid with a faded but inviting label promising to transform her into her most perfect self. <br/></p>\n<p>But this is a dangerous concoction that never should have been brewed by her alchemist Mother, let alone fall into the hands of her only child. <br/></p>\n<p>Wiping away her tears, Dawes lifts the bottle out of the box and without a second thought, she drinks the potion. Seconds later, her balance falters and drops the bottle. As the few remaining drops drip into the soil, she stumbles to the ground, her eyes facing the now empty bottle. <br/></p>\n<p>As she begins to lose consciousness, her attention is briefly caught by blurry small print on the label before she closes her eyes</p>\n<p> </p>\n\n<p><strong><em>Warning: Can cause memory loss, paranoia, hallucinations, insanity and death.</em></strong></p>\n<p> <br/></p>\n\n<p>Dawes slowly regains consciousness as sounds of birdsong, and the unhealthy groan of her computer fill her ears. This provides her with some comfort and confirmation that she is back in her bedroom. Glancing over to her monitor, Dawes notices she's received an email. Getting up slowly and while still unsteady on her feet, she walks over to the computer to further inspect the note. The mysterious email from an unknown sender warns her to leave home as she's being accused of murdering a missing boy, and they're coming for her... Whoever 'they' are...  </p>\n<p>Prank or not, the problem is, Dawes can't remember what she did over the last 24 hours. To find out what happened, she might need to have conversations with inanimate objects to help her remember.</p>\n<p>Join Bay Dawes and her dead pet rabbit, Dink on their adventure to find missing memories and to unravel the mystery of who is.  </p>\n\n<p> </p>\n<em>Framing Dawes</em>\n\n\n<p>   - A story-driven episodic dark 2D point and click fairy-tale adventure game split into three parts.</p>\n<p>    - Explore the beautiful hand-drawn world of Dawes' and her new friends   <br/></p>\n<p>   -  Cast spells to reveal hidden locations and find useful inventory to solve puzzles.</p>\n<p>   - Play as Bay Dawes with the ability to switch to Dink, the rabbit in some scenarios.</p>\n<p>   - Experience occasional possessions and paranormal activity.</p>\n<p>    - Meet a variety of strange and intriguing characters to interact with.</p>\n<p>   -  Read Dawes' journal to track progress and to reveal her inner thoughts.</p>\n<p>   - Original soundtrack.</p>\n\n<p>Demo out now!</p>\n<p>Join the community: discord.gg/WzeZD4k<br/><br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-12-13T05:39:13", "background_image": "https://media.rawg.io/media/screenshots/016/016296323d2d6092c93337c5b5ec5bdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["JinxItGames"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}