{"id": 398399, "slug": "the-shape", "name": "The Shape", "name_original": "The Shape", "description": "<p>The Shape..</p>\n<p>A big difficult game.. even i couldnt make it to the end level :D i dont even talk about chaos level :(.. I made it a very hard game but you can buy weapons and power ups to get stronger !!! :) you can kill monsters or just collect gems and coins.. to get to the next level you have to kill monsters and make  some puzzles. So the game is not only hard physically but also mentally.. Good luck :)</p>\n\n<p>You can find the instructions in the game but let me write them here too:</p>\n<p>to move , fly and jump: use your arrow keys or wasd buttons</p>\n<p>to shoot: use your mouse</p>\n<p>to leave your soul behind : press e, by leaving your soul behind you can transform back to your soul !! so this is like taking the time back and a small trip in the time :)) if you press e once you leave your soul behind which is a great type to solve puzzles, and if you press e agian (5seconds cooldown) you get back to your soul.if you dont.. the soul follows you after 5 seconds.</p>\n<p>controll soul : if you wanna play with your soul. press A or Q (depends on your keyboard) by this way you are becoming your soul and take no dmg from enemies and other things (no spoiler :)) for 5 seconds. after 5 seconds your soul goes back and you wont be able to reuse it for 5 seconds. </p>\n<p>Weapons :  6 deadly weapons :) press 1,2,3,4,5,6 and 7 to use your weapons. each weapon has different range, damage, bullet,.ect..... </p>\n<p>Power Ups : once you buy a power up. It will be automatically integrated to your player.</p>\n<p>The levels are tricky and difficuly. in some places you can find a lot of coins and gems but be careful it can be a trap too !! :) </p>\n<p>I hope you enjoy it.</p>", "metacritic": null, "released": "2019-12-06", "tba": false, "updated": "2019-12-13T05:41:38", "background_image": "https://media.rawg.io/media/screenshots/be7/be7b63300c2199da73e51e1fa1e6768a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Dzhan"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}