{"id": 398341, "slug": "idle-blasters", "name": "Idle Blasters", "name_original": "Idle Blasters", "description": "Made and finished in about a week, Idle Blasters is an idea I've wanted to make for a while now. I played a game called Idle Bouncer, and it quickly became my favorite idle game ever. The game was less about \"how quickly can you get carpal tunnel?\" and more about \"how can I optimize my money output?\" Idle Blasters is a loveletter to that style of idle games.\r\n\r\n\r\nUse WASD or arrow keys to move, you can also left click to move slowly, in case you need to move just a tiny bit.\r\nRight click on the upper half of the screen to change the direction of your bullets.\r\nRick click on the bottom half of the screen to select which unit you control.\r\nRemember to save often! Autosave only happens every 10 minutes!\r\n\n<p>Also hey, just for fun, check out this super old screenshot!</p>\n\n<p>Wow wee, what a glow-up<br/></p>\n\n<p>Due to me being a moron, this game doesn't work in HTML, even though I kinda wish it did! Idle games always kinda felt perfect for browsers, instead of having to download a whole EXE. I might recode some of the game down the line so it actually works in HTML, but for the time being - you gotta download it :(<br/></p>\n\n<p>If your antivirus prevents you from opening the game, add an exception for it! The process of doing that is a little different for every antivirus, but it wont be too hard to find a tutorial on how to do that online. Just search something like \"<your antivirus=\"\" name=\"\"> how to add an exception\"<br/></your></p>\n\n<p><em>Programming/art by </em>@rgbmew<br/></p>\n<p><em>Splash screen logo by Batass</em><br/></p>\n<p><em>Fonts used:</em><br/></p>\n<p><em>\"Equipment\" created by Eeve Somepx / </em>somepx.itch.io<br/></p>\n<p><em>\"Pixeldown\" created by Daymarius / </em>daymarius.1001fonts.com<br/></p>\n<p><em>\"Helvetica Extended BQ Bold\"<br/></em></p>\n\r\nUpdate log:\r\n12/10/19 (version 1.02)\r\n-rebalanced enemy health - instead of each new enemy having *1.5 health as the last enemy, they have *1.25 health<br/>-changed the price of enemies<br/>-added MAX text to helper bullets/helper fire rate<br/>-nerfed bombs and boomerangs<br/>-made it cost more to loop multiple times<br/>-made fire rate upgrades a little cheaper<br/>-made damage/fire rate upgrades start out a little cheaper<br/>-made damage upgrades more effective<br/>-made helpers more expensive<br/>-added a whacky ammo feature, just to make it so the player cant leave the game on all night and roll in infinite cash<br/>-increased effectiveness of coin multiplier<br/>-fixed some stats not resetting when you loop\r\n\r\n12/9/19 (version 1.01) \r\n-Fixed typo on the loop button's textbox<br/>-removed money duplication button (haha oops)\r\n\r\n12/8/19 (version 1) \r\n-I released the game! wow!", "metacritic": null, "released": "2019-12-09", "tba": false, "updated": "2019-12-13T05:28:58", "background_image": "https://media.rawg.io/media/screenshots/f6b/f6baa28ae0f84dde2cbb400df7d3dee7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mew"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}