{"id": 398436, "slug": "hearts-card-game", "name": "Hearts: Card Game", "name_original": "Hearts: Card Game", "description": "Hearts Free is a classic competitive card game, and MobilityWare’s artificial intelligence ensures YOUR play has the competitive edge, Hearts card master!<br/><br/>This free Hearts game will teach you how to play with our intuitive AI. Our artificial intelligence adapts to your Hearts card game play style. Play feels fair, even though your opponents are some smart bots. But while playing them can feel like a challenge, MobilityWare’s Hearts hints AI feature is at your disposal and the smartest of them all!  AI bot opponents offer another major benefit - you can play them offline, so no wifi is required to play Hearts!<br/><br/>Ever play a card game with real online users and experience inconveniences? Never worry about other users taking too long or abandoning a game in this free card classic. Enjoy the adaptability of AI, and benefit from MobilityWare’s free Hearts hints system, which always puts you in a clear position to win the games you play! We guarantee when you play, you’ll just notice your sense of relaxation and fun.<br/><br/>Get Excited for Features!<br/>Whether you’re going to Shoot the Moon as a Hearts card master or just starting to get into the game or totally new to Hearts, you’ll find our game has a feature for your comfort and challenge level.<br/><br/>Artificial Intelligence <br/>- We cannot stop talking about this card game’s adaptive and fair AI features! <br/>- Playing Hearts free is a cinch with smart opponents<br/>- And our even more intelligent free Hints feature<br/><br/>Play Offline, Anytime<br/>- Wifi? Who needs it?<br/>- No need to wait around for real users to log on with this free Hearts card game<br/>- And no need to have game delays when their internet lags<br/>- Reliable AI bots want to play cards with you all day, no internet required<br/><br/>Fair Play<br/>- Learn to play a game with our simple start guide and free automated advice (which you can turn off!)<br/>- Use as many free Hints as you like, powered by the smartest AI in our app!<br/>- Use the free Undo function as many times as you like if you need to rethink your moves<br/><br/>Some Tips for Hearts Beginners!<br/>- Scoring points in Hearts is not a good thing (unless you collect ALL available points)<br/>- Each hearts suit card is worth 1 point<br/>- Beware the Queen of Spades - a card worth 13 points!<br/>- If you collect all points available in the game, they get thrown to your opponents in a dramatic feat called Shooting the Moon!", "metacritic": null, "released": "2019-11-25", "tba": false, "updated": "2019-12-16T01:52:53", "background_image": "https://media.rawg.io/media/screenshots/436/4362166e2fc45bf12f6f5d51e227ef6c.jpg", "website": "http://www.mobilityware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MobilityWare"], "genres": ["Casual", "Card"], "publishers": ["Mobilityware"], "esrb_rating": "Everyone 10+"}