{"id": 398426, "slug": "ice-scream-episode-2", "name": "Ice Scream Episode 2", "name_original": "Ice Scream Episode 2", "description": "The ice cream seller has come back to the neighborhood! He has kidnapped your best friend Lis in front of you...<br/><br/>It has frozen your best friend with some kind of power, and you have to discover where it takes. What if there are more children like him behind this story?<br/><br/>This terrifying ice cream seller is called Rod, and he seems very friendly to young children, but he has an evil plan for them that you will have to discover. All you know is that he will take it inside his ice cream van, but you don't know where.<br/><br/>Your mission will be to hide inside his van and solve the mystery of this evil villain. To do this, you will travel through different scenarios and solve the necessary puzzles to save the frozen child.<br/><br/>What can you do in this game?<br/><br/>- The evil Rod will listen to all your movements, but you can hide and deceive him so that he does not see you.<br/>- Move to totally different scenarios through the ice cream van, and discover all its secrets.<br/>- Solve puzzles to rescue your neighbor from the clutches of this horrific enemy.<br/>- Play in ghost, normal and hard mode! Can you complete all of them?<br/>- Enjoy a horror game without bloody scenarios, suitable for all audiences!<br/><br/>If you want to enjoy an experience of fantasy, horror and fun, play now \"Ice Scream: Horror Neighboor\". The action and the shouts are guaranteed.<br/><br/>It is recommended to play with headphones for a better experience.<br/><br/>Each update will bring new content, fixes and improvements based on your comments.<br/><br/>This game contains ads.<br/><br/>Thanks for playing! =)", "metacritic": null, "released": "2019-12-13", "tba": false, "updated": "2019-12-16T01:48:27", "background_image": "https://media.rawg.io/media/screenshots/bc1/bc100c42d571304ced8bde78a67d8c4a_FKFHcEr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Etorki Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Etorki Games"], "esrb_rating": "Teen"}