{"id": 398430, "slug": "iron-saga", "name": "Iron Saga", "name_original": "Iron Saga", "description": "ACE commanders, assemble! 500+ Mechas and Pilots, 100,000 possible formations! Diverse game modes, smooth battle experiences and dazzling skills that will mesmerize you without fail! Let your blood boil with passion and experience the non-stop fun! Treat yourself to gameplay like never before in Iron Saga!<br/><br/>PROLOGUE<br/>The world was once engulfed in a sea of flames caused by twelve battle mechas, later called the ‘Grand Gods’.<br/>Fast forward centuries, and the war is but a legend forgotten by time – it is a memory that humanity can barely recall. But then, the emergence of \"Battle Mechs\" suddenly jolts the entire world awake. Forces of all manner and kind conspire in the shadows, all eager to lay their hands on this world-destroying technology – and they will rekindle the fires of war among the world’s armies, mercenaries and bounty hunters to get it.  <br/>Meanwhile, ACE pilots from all over the world are scrambling to assemble. The legend of the Battle Mecha begins now!<br/><br/>UNIQUE CONTROLS: YOUR SKILL MATTERS<br/>Maneuver your mechas in real-time with our unique real-time battle system. Control the outcome of the battle at your fingertips! From micro controls to all-out guns blazing, from dodging lethal hits to striking an enemy’s weakness at the right time – every single command counts on the ever-changing battlefield.<br/><br/>OVER 100,000+ POSSIBLE MECHA &amp; PILOT COMBINATIONS<br/>Customize your own teams from over 500+ mechas and pilots. Pick from amazing humanoid Mechas and gorgeously-drawn pilots for a battle setup that is yours and yours alone!<br/><br/>MULTIPLE GAME MODES, FRANTIC CORPS CONFLICTS<br/>Completed story mode? Check out the Arena, Combat Simulation, Rocket Pack, Amazing Race, Card Games, Corps Conflicts and much more! Keep your blasters locked and loaded for non-stop firefights!<br/><br/>100+ EPIC PILOTS WITH DIVERSE SKINS <br/>Get to know the 100+ Pilots, all unique in personality and dressed to kill. Our unique BGM system ensures an audio-visual feast when you change pilot skins!<br/><br/>PERFECT PRODUCTION TEAM, ICONIC OST &amp; GRAPHICS<br/>100+ distinguished artists and legendary composers bring to you a flurry of artistic perfection for your eyes and ears!   <br/><br/>Bursting with love for Iron Saga? Don’t hesitate to follow us!<br/><br/>Official Website: http://ironsaga.com/<br/>Twitter: https://twitter.com/IronsagaEN<br/>Facebook: https://www.facebook.com/Ironsaga.en<br/><br/>We would love to hear from you! Contact us at en@ironsaga.com<br/><br/>Game Duchy<br/>Seize the free time", "metacritic": null, "released": "2019-12-11", "tba": false, "updated": "2019-12-16T01:50:16", "background_image": "https://media.rawg.io/media/screenshots/09b/09b9991c49f0dcd5fbb6049b930f696b_wh5rMR7.jpg", "website": "http://ironsaga.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Sentai"], "genres": ["RPG", "Strategy"], "publishers": ["Hangzhou Sentai Interactive Entertainment Co"], "esrb_rating": "Teen"}