{"id": 398465, "slug": "rival-powers-cold-war", "name": "Rival Powers: Cold War", "name_original": "Rival Powers: Cold War", "description": "<p>Become the leader of any country in the year 1949 and lead your nation through the Cold War. Fight proxy wars, infiltrate foreign governments, and build your sphere of influence. Take control of one of the superpowers, the US or the USSR, or build your own great power through diplomacy and warfare. <br/></p>\n<p><strong>This is an early alpha version. Should you buy this game?<br/></strong></p>\r\nHow to Play\r\n<ul><li>Use <strong>WASD </strong>to move around the map. </li><li>Use <strong>Q </strong>and <strong>E </strong>to zoom.</li><li>Use <strong>C</strong> and <strong>V </strong> to slow down and speed up the passage of time. </li><li>Left click on a region to select it. Click on a selected region to select the country that owns it.</li><li>Right click on your own country to unlock research using research points. </li><li>Right click on another country to take diplomatic or covert actions.</li><li>Set a national focus at the top of the screen. National focuses are used to guide your country's progress through the decades. </li><li>To reform your country, click on the policy buttons to select a new policy. Selecting a policy costs political points and all policies are not available at all times. </li><li>The game automatically saves your campaign in a save file called <em>save.json. </em>To start a new campaign, remove or rename your <em>save.json</em> to something else. Temporary solution.</li></ul>", "metacritic": null, "released": "2019-12-16", "tba": false, "updated": "2019-12-16T02:04:07", "background_image": "https://media.rawg.io/media/screenshots/605/605907ac04f7c7d3707a2ee47e4e4b96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["northronics"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}