{"id": 3986, "slug": "eat-lead-the-return-of-matt-hazard", "name": "Eat Lead: The Return of Matt Hazard", "name_original": "Eat Lead: The Return of Matt Hazard", "description": "Get ready for a fictional account of the world's most popular video game hero... of the 1980s. Matt Hazard is coming out of retirement and making his next-gen 'comeback' against all his old enemies in a hilarious parody of the last 25 years of action games.<br/>When he finally gets the call to make his official comeback, he finds out he's not the star, but the prey. Matt must defeat the game where the programmers aren't playing by the rules. They're throwing everything at him in their arsenal from old enemies, to past environments, unfair weapons, and more, to make sure he doesn't make it to the last level.<br/>Key Features<br/>Ingenious storyline and setting that's never been explored in a video game<br/>Celebrity voice talent: Neil Patrick Harris (How I Met Your Mother) and Will Arnett (Arrested Development)<br/>Hilarious script written by WGA Award-winning writer, David Ellis<br/>Unique visuals, taking on tons of classic video game bad guys at once: cowboys, space marines, wizards and karate masters.<br/><br/>1 player<br/>HDTV screen resolution: 720p<br/><br/>  Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.<br/><br/>™ and ©2008-2009 D3Publisher of America, Inc. Published exclusively by D3Publisher worldwide. Eat Lead™: The Return of Matt Hazard and its associated characters and names, D3Publisher and its logo are trademarks or registered trademarks of D3Publisher of America, Inc.  Developed by Vicious Cycle.", "metacritic": null, "released": "2009-03-03", "tba": false, "updated": "2023-11-23T11:07:40", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1c5b7d617614a672e89b24ea32ee35e.jpg", "website": "http://www.eatleadvideogame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "beaten": 3, "toplay": 4, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 592, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 3"], "developers": ["D3 Publisher", "Vicious Cycle Software"], "genres": ["Action", "Shooter"], "publishers": ["D3 Publisher"], "esrb_rating": "Teen"}