{"id": 398624, "slug": "santas-sharttt", "name": "Santa's SHARTTT", "name_original": "Santa's SHARTTT", "description": "<p><strong>Santa's SHARTTT for Yogscast Jingle Jam Game Jam</strong></p>\n<p>Art by Hannah &amp; Dave</p>\n<p>Audio by various internet royalty free sources</p>\n<p>Everything else by Kieran (keyz182).</p>\n\n<p><strong>Santa at the north pole</strong>: “Oh no! This is a disaster! There’s been a garbage compactor accident in Stoke-on-trent, and they’ve declared a no fly zone! How will I deliver presents now?! I can’t do it on foot, there’s no way I can lug my giant sack around all of the town!”\r\n<strong>Elf</strong>: “Don’t worry Santa, we have just the thing! We invented the “Santa's Holiday Automated Rubbish To Toy Transformer”, AKA The SHARTTT for just this situation! The SHARTTT  will suck up trash, and recombobulate the mesotrons at the subatomic level to turn that trash into presents!”</p>\n<p><strong>Santa</strong>: “Wow, you guys are great! But what about the kids? If I have any hope of being done on time, I’ll need to start early. They’ll still be out on the streets, they’ll see me!”</p>\n<p><strong>Elf</strong>: “Seeing you isn’t the problem here, it’s the touching. Have you seen these kids? So full of <em>germs…</em> If they get close they’ll infect you, and there’s no way you’ll finish if you get stuck with a *<em>shudders</em>*... cold… Or worse, MANFLU! You'll be stuck in bed for all of Christmas if you catch the dreaded Manflu.”</p>\n<p><strong>Santa</strong>: “I see, so what do I do?”</p>\n<p><strong>Elf</strong>: “Well, we equipped the SHARTTT with a launcher, so you can fire presents at the kids from a safe distance. So you just need to make sure your aim is true, and no kids slip through the net.”</p>\n<p><strong>Santa</strong>: “Excellent. Do you have any snacks, or any... *a-hem*... pick me ups to help me out? I don’t normally do this much physical work.”</p>\n<p><strong>Elf</strong>: “Santa! What kind of operation do you think we run up here!? Of course we have the usual assortment of “pick-me-ups” as you call them, but that’s irrelevant. Instead, when SHARTTT picks up some really high quality garbage, it’ll drop a “power up”. It’s a special little concoction of mine. Can have random effects on you, the kids, or even SHARTTT. That’ll get you through the day.”</p>", "metacritic": null, "released": "2019-12-15", "tba": false, "updated": "2019-12-16T02:37:16", "background_image": "https://media.rawg.io/media/screenshots/00a/00a5a44daa9ad41302f537db15403d3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["keyz182"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}