{"id": 398752, "slug": "robinyeti", "name": "RobinYeti", "name_original": "RobinYeti", "description": "<p>RobinYeti is a game about the \"infamous\" RobinYeti. While some may protest to see the change they want, RobinYeti takes a much more direct approach. RobinYeti is just like Robinhood, if Robinhood broke into buildings filled with the rich and brutally slaughtered every single one of them with his bare hands.  As RobinYeti, you must beat, maim, smash, and kill the rich, stealing as much of their money as possible. And just like Robinhood, RobinYeti takes his spoils and gives them to the poor.<br/></p>\n<p>In the one whole level, you must work your way from point A to point B while collecting enough coins to go through the exit. You must be quick as to beat the timer<br/></p>\n<p>Use WASD to control Robinyeti, and space to jump. Double tap W to run. Press control to grab the rich, and spam shift to shake them. Once you've drained them of their money, throw them with control. Richman can only be killed once they have no coins. Throw them at a wall to finish them off.<br/></p>\n<p>The gameplay cycle is bare bones, if you run out of time in the level, it immediately resets the game. If you beat the level, you get a short but sweet congratulation that also resets the game.</p>\n<p>With this release, I focused on getting the core gameplay into a releasable state. If I decide to continue working on this project, many things will be added and tweaked. What I liked most about this project is how good it felt to smash things around. I feel that in this release, there's a few missing things and a few bugs that stop that from being the case. <br/></p>", "metacritic": null, "released": "2019-12-15", "tba": false, "updated": "2019-12-16T03:07:56", "background_image": "https://media.rawg.io/media/screenshots/82f/82fc39cbe72d11cf93aaf40e20c084bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["memetologist"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}