{"id": 3987, "slug": "giana-sisters-twisted-dreams", "name": "Giana Sisters: Twisted Dreams", "name_original": "Giana Sisters: Twisted Dreams", "description": "<p>Giana Sisters: Twisted Dreams is the third game in the series that was started by Giana Sisters, a 1987 platformer. The original game was a Super Mario rip-off, but, though the new game retained many of the old mechanics (such as defeating enemies by jumping on them), there are also novel gameplay ideas.<br />\nYou play as Giana, a girl who tries to rescue her sister Maria from the hands of an evil dragon Gurglewocky. Giana herself has two different personalities, a &quot;Cutie&quot; and a &quot;Punk&quot;, that can be switched during the game. This change also dramatically alters the environment, allowing the player to shift between two dream worlds: one is a brightly colored garden, while other is a dark, nightmarish forest of giant mushrooms. In both worlds, the levels are nearly identical, despite the aesthetic change. But sometimes the game may demand you to switch to another world to move forward or to obtain a powerup that only exists in one of the worlds.<br />\nA definitive feature of Giana Sisters: Twisted Dreams is its music. The score was composed by Chris Hulsbeck, who worked with the original Giana Sisters, and metal band Machinae Supremacy. The soundtrack shifts between “traditional” and &quot;heavy&quot; versions of the same compositions to highlight the game&#39;s dual nature.</p>", "metacritic": 77, "released": "2012-10-22", "tba": false, "updated": "2024-03-13T16:08:29", "background_image": "https://media.rawg.io/media/screenshots/e5b/e5be8c031ac0dbd85bf058947d480375.jpg", "website": "http://www.project-giana.com", "rating": 3.06, "rating_top": 3, "added_by_status": {"yet": 153, "owned": 2231, "beaten": 36, "toplay": 19, "dropped": 88, "playing": 7}, "playtime": 3, "achievements_count": 37, "ratings_count": 166, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 166, "platforms": ["PlayStation 3", "Xbox 360", "Wii U", "PC"], "developers": ["Black Forest Games"], "genres": ["Action", "Adventure", "Arcade", "Indie", "Platformer"], "publishers": ["HandyGames", "Black Forest Games", "bitComposer Entertainment"], "esrb_rating": null}