{"id": 399037, "slug": "ai-assistant-ivory", "name": "AI Assistant Ivory", "name_original": "AI Assistant Ivory", "description": "<p><strong>AI Assistant Ivory</strong> is a short interactive fiction made in Godot for the ☼ SCREAM SOLSTICE ☼ game jam. You just found a digital personal assistant powered by a brand new AI! Jump right in and discover the possibilities!</p>\n<p>I don't want to spoil too much, but as the jam is about horror themed games, the game might scare you. No jump scares, though.</p>\n<p>It is rather short and can be completed in a few minutes or so. But the dialog depends on what you choose, so please try out something else in another play through! There are a few Easter eggs to be found.</p>\r\nControls\r\n<p>You can advance the dialog by pressing the left mouse button or hitting enter/space on your keyboard. To confirm any text you entered into a text box just hit enter or use the supplied \"Enter\" button. Buttons that offer you different options can be pressed by mouse or with the shortcuts 1, 2 and 3 (if the focus is not on a text box).</p>\r\nWork of others\r\n<p>There are different assets used that were made by others, namely the font and all music tracks and sound effects. See the included licence files for any details. All sound effects and music tracks not explicitly mentioned in the licence files were taken from the <strong>HUMBLE MUSIC AND SOUND EFFECTS FOR GAMES, FILMS, AND CONTENT CREATORS BUNDLE</strong> that may not be used outside the game.</p>\r\nSource\r\n<p>The game's source code is available here. You need Godot 3.2 to run the game. Also all audio assets have been replaced with empty samples. This way it should be ready to run if you check out the repository and load it up in the Godot editor, but you won't hear anything. See the repository for details and licences.</p>", "metacritic": null, "released": "2019-12-14", "tba": false, "updated": "2019-12-16T04:13:12", "background_image": "https://media.rawg.io/media/screenshots/eaa/eaaa2bd2e5c21c1accb16d472774f718.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["GreenBeakCrow"], "genres": [], "publishers": [], "esrb_rating": null}