{"id": 399117, "slug": "wtiau-classroom-demo", "name": "WTIAU Classroom Demo", "name_original": "WTIAU Classroom Demo", "description": "<p>This is a demo of a fully modeled 3D classroom made for Roya Bagheri's game design class. The room design is based on a Western Tehran Islamic Azad University classroom.</p>\n<p>Objects in this classroom are physics based and can be interacted with:</p>\n<ul><li>Use the light switch to turn off/on the lights in class.</li><li>Press any key on the laptop to start a sample video from projector.</li><li>You can pick up some objects like the flashlight and light bulb on table.</li><li>Roll up/down the projector panel by interacting with it.</li><li>If you feel playful; you can smash the chairs to make some chaos :)))</li></ul>\r\nInstructions\r\n<p>You can do some actions in the classroom demo:</p>\n<ul><li>Walk around with A,W,S,D.</li><li>Run with left shift.</li><li>Jump with space.</li><li>Interact with objects in class with E or left mouse.</li><li>Pick up or drop objects with right mouse.</li></ul>\n<p>You can change these keys or bind joystick, game pad, controller or... inputs in game launcher dialog.</p>\r\nUnity Source\r\n<p>Buy the Unity 2018 source to get access to the full source of this demo under Creative Commons Attribution 4.0 International license. </p>\n<p>You'll get access to:</p>\n<ul><li>A fully modeled realistic classroom with baked + real time lightning powered by Progressive light mapping engine.</li></ul>\n<ul><li>Clean physically based rendered models of classroom objects rigged from the classroom's base model: Wooden door, Student's chair, Teacher's chair, Teacher's table, Laptop, Flashlight, Light bulb and a projector. Most of these models have Albedo, Normal map and Roughness textures on Unity's standard shader.</li></ul>\n<ul><li>A playable demo game with Unity's character controller, Interactions and Actions C# scripts with simple procedure to make new intractable objects.</li></ul>\n<ul><li>Simple and elegant UI for interacting with objects and pause menu with sub menus.</li></ul>\n<p>Note that according to Creative Commons Attribution 4.0 International license you can edit, share and use anything you want in your project as long as you give proper credit (Example: some 3D assets and codes made by IEP-Esy (https://iep-esy.itch.io))</p>\n<p>This work is licensed under a Creative Commons Attribution 4.0 International License.</p>", "metacritic": null, "released": "2019-12-14", "tba": false, "updated": "2019-12-16T04:30:50", "background_image": "https://media.rawg.io/media/screenshots/703/703e8ef393f1f21854976438afc906df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IEP_Esy"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}