{"id": 399150, "slug": "woeful-love", "name": "Woeful Love", "name_original": "Woeful Love", "description": "<p><strong>Woeful Love</strong> is a Puzzle/Horror game made in about a week and a half by a group of 4 students from the University of Wisconsin-Whitewater. </p>\r\nDevelopers:\r\n<p>Dylan Oelke - Programmer/Designer<br/>Adam Weber - Programmer/Designer/Artist<br/>Jacob Sefranek - Artist<br/>Lance Pearson - Programmer/Designer/Artist</p>\r\nStory \r\n<p>Long ago, a man by the name of Nathan found the love of his life, Claire. The couple built their own house far away from civilization, and would often make their food by hunting animals or gathering fruits and berries. Nathan’s love for Claire knew no bounds, yet, Claire never felt loved enough. She always felt that Nathan never appreciated her, or what she did for him or the house they had built, and so one day while Nathan went hunting, Claire took a small amount of belongings and left. This devastated Nathan. </p>\n<p>\tOver time Nathan became more and more psychotic, often hunting for sport just to keep his mind off Claire. Seeing her possessions scattered throughout the mansion tore him apart, so much that he would tear up the room. Many travelers who would walk by would often walk in to see if there was anything wrong, and Nathan would simply take them in, never to let them out. Everything to Nathan was a way to distract him. Anything that moved, anything living or dead, it did not matter, as long as it could distract him. Eventually some townsfolk assassinated Nathan in his sleep, yet no one ever saw them again. Thus, the legend began. Anyone who would dare go near that mansion would be thought of as a dead man. Very few have survived, and those few have been scared for eternity. </p>\n<p>\tThe legend of Nathan became quite popular throughout the lands that many people came up with their own theories. Some say that the mansion is filled with treasure. Some say that Claire did eventually come back to Nathan, only to see the horror that he has become. You as the main character are there to see things out, to find treasure or to find Claire. To see if Nathan really does exist, or if he was just a hoax created by those who want the mansion for themselves. The only way to find out is to venture inside. </p>\n\r\nAsset Credits\r\n\n<p>Shadowlands 5 - Antechamber Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p>This House Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p>Welcome to HorrorLand Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/</p>\n<p>Creepy Lullaby, A.wav\" by InspectorJ (www.jshaw.co.uk) of Freesound.org</p>", "metacritic": null, "released": "2019-12-14", "tba": false, "updated": "2019-12-16T04:37:59", "background_image": "https://media.rawg.io/media/screenshots/a11/a11f40c21f9f8abf2858f082ca95fe78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["TheZBillDyl"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}