{"id": 399264, "slug": "defensive-driver-and-road-rager-beta", "name": "Defensive Driver and Road Rager (Beta)", "name_original": "Defensive Driver and Road Rager (Beta)", "description": "<p><strong>Defensive Driver and Road Rager</strong> is an endless, tag-team highway racing game where two drivers test how far they can speed down an endless highway without totaling their cars or running out of time. Each driver has their own special ability they can use to make navigating through heavy traffic easier and more exciting while providing a temporary speed boost in the process.</p>\n<p>The driver in the front is controlled by you while the driver in the back follows you. You can have the drivers switch places at any time. The differences between these two drivers are their cars and special abilities.</p>\n\n<p><strong>Defensive Driver</strong><br/></p>\n<p>The game starts out with Defensive Driver in the front. This driver prefers to avoid traffic as much as possible. Their car is initially given a handling boost to make switching lanes and avoiding much easier. Their ability, Defensive Driving, slows down time and gives the car an even greater handling boost. While this ability is active, every near miss with traffic cars gives the driver a massive speed boost.</p>\n\n<p><strong>Road Rager</strong><br/></p>\n<p>The game starts out with Road Rager in the back, but you can switch to this driver at any time by pressing [shift]. This driver prefers to smash through traffic and get everyone out of the way as soon as possible. Their car is initially given a health boost to survive a little longer in heavy traffic. Their ability, Road Rage, makes the car briefly indestructible and unstoppable. While this ability is active, every car you hit gives the driver a small speed boost.</p>\n\n<p><strong>Scoring</strong><br/></p>\n<p>So far, your final score is determined by the following  factors</p>\n<ul><li>Distance driver 1 has driven without totaling their car</li><li>Distance driver 2 has driven without totaling their car</li><li>Near misses with traffic cars</li></ul>\n\n<p><strong>In-Game Controls</strong></p>\n<p>Accelerate - [W]</p>\n<p>Brake - [S]</p>\n<p>Steer - [A] and [D]</p>\n<p>Use or Cancel Special Ability - [Space]</p>\n<p>Switch Driver - [Shift]</p>\n<p>Rotate Camera - [Arrow Key Left] or [Arrow Key Right]</p>\n<p>Look Forward - [Arrow Key Up]</p>\n<p>Look Back - [Arrow Key Down]</p>\n<p>Exit to Main Menu - [Esc]</p>\n<p>Restart Game - [R] (only works when Game Over screen is displayed)</p>\n<p>Reset High Score - [0] (takes effect after restarting game)  </p>\n\n<p>This game is currently in beta and anything is subject to change in the future. I started this game in early September 2019 as a college course project and plan to keep updating this until the end of April 2020. </p>\n<p>If you have any questions, feedback, or suggestions, feel free to let me know in the comments! Thanks for playing!</p>", "metacritic": null, "released": "2019-12-13", "tba": false, "updated": "2019-12-16T05:04:36", "background_image": "https://media.rawg.io/media/screenshots/ace/ace1ff19000501a1424660397ee9932a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Speeding Husky"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}