{"id": 399372, "slug": "wild-hunt-the-tables-turn-jib-leekitwattana", "name": "Wild Hunt: The Tables Turn (Jib Leekitwattana)", "name_original": "Wild Hunt: The Tables Turn (Jib Leekitwattana)", "description": "<p>The Wild Hunt revolves around a story embedded in European folklore in which a ghostly host appears in the sky in a wild hunting pursuit. It is said that seeing the host can lead to the observer's death or their abduction into a ghostly realm or the underworld. In our game, players take on the role of fighting the Wild Hunt.</p>\n<p><em>Wild Hunt: The Tables Turn</em> follows the concept of ghost hunting and exorcisms, where players take on the role of a ghost hunter who is on a mission to exorcise evil spirits. Take up the mantle of ghost hunter and explore the real world in order to discover and exorcise the evil ghosts lurking in the dark.</p>\n<p>We recommend playing this game in the dark to experience its true atmosphere!</p>\n\n<p><strong>How to Play:</strong></p>\n<p>1. Start the game and explore to look for ghosts.</p>\n<p>2. Once you find them, there are a few things you can do: attack, charged attack, help the ghost move on, and exorcise. </p>\n\n<p>3. Once the ghost is attacked enough, it will turns black as it is weakended and you will able to swipe them.</p>\n<p>4. There are different types of ghosts! While you should be exorcising the evil ones, you should help the kind ones move on!</p>\n<p>(From Top Left: Kind Ghost, Small Evil Ghost, Medium Evil Ghost, Rare Evil Ghost)</p>\n\n<p>5. Once your power reaches 75%, you will be able to see the rare ghosts!</p>\n<p>6. The game ends when the rare ghost is exorcised.</p>\n\n<p><strong>Playable Location:</strong> Union Square Park</p>\n\n\n<p><strong>A Game by:</strong></p>\r\nJib LeekitwattanaConstantinos ConstantinidesYou Jin SongCharacter DesignCharacter DesignCharacter DesignProgrammer<br/>(Interaction, Enemy Behaviors, Geolocation)Programmer<br/>(Auxiliary, UI/UX, Effects)ArtistTeam ManagerSound DesignUI/UX Design", "metacritic": null, "released": "2019-12-13", "tba": false, "updated": "2019-12-16T05:29:40", "background_image": "https://media.rawg.io/media/screenshots/bf4/bf43ac00dcddf425f756f07fc6843560.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Jib Leekitwattana"], "genres": [], "publishers": [], "esrb_rating": null}