{"id": 399425, "slug": "basketball-legends-dunk-game", "name": "Basketball Legends: Dunk Game", "name_original": "Basketball Legends: Dunk Game", "description": "Do you want to play with some of the greatest icons in the sport? Thanks to Basketball Legends: Dunk Game, you have the chance to play against the greats only by using your mobile device! Get ready to play basketball with some true basketball legends!<br/><br/>Are you a basketball enthusiast? You want to mingle with the dramatic basketball matches or just simply a game player. Whatever, now Basketball Legends here to help you experience the best and most exciting basketball games ever! With Basketball Legends: Dunk Game, you have a chance to play with the real legends that you wish for long. Isn't it fantastic? Unlock all the achievements and have your name on the high scores!<br/><br/>Features of Basketball Legends: Dunk Game<br/>- Cool stylized graphics that look both cartoony and accurate. <br/>- Different types of moves and shots. <br/>- Select your team. <br/><br/>How to play Basketball Legends: Dunk Game: <br/>- Use the arrow keys to move<br/>- There are two skill buttons to show your professional skills<br/><br/>Download Basketball Legends: Dunk Game now to unlock achievements along the way and see your name appear on the leaderboard! Do you have what it takes to make it to the top? To struggle against your friend with these super basketball players, don’t wait any longer. Call your friend right now, set your team and get ready for super struggles which are tough from each other.", "metacritic": null, "released": "2018-10-03", "tba": false, "updated": "2019-12-20T02:05:02", "background_image": "https://media.rawg.io/media/screenshots/6bc/6bc98d32e01cbc5473f5480e403c8ce0_3dRwpGq.jpg", "website": "http://www.dmobi.info/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tingo"], "genres": ["Sports", "Casual"], "publishers": ["TINGO INTERNATIONAL TRAVEL COMPANY"], "esrb_rating": "Everyone 10+"}