{"id": 399450, "slug": "blood-and-glass", "name": "Blood and Glass", "name_original": "Blood and Glass", "description": "<p>The Nebula Mining Corporation has just discovered a new asteroid bursting with a rare ore, Galarite. They convert Galarite to fuel and sell it off to other corporations as a massive profit, so finding a fresh, new asteroid is a boon for them. The CEO and his co-founder are going to map out a mining site on the asteroid. Before the expedition, you ask the CEO for an interview about the asteroid and what it means for the corporation...</p>\n<p>This is about a 15-20 minute experience and has 11 endings. The \"true\" ending may be one you don't expect, so do give it a try!</p>\n<p>This is a project made for one of my college courses, World Creation. We, as a class, decided on a concept for a world to build on. We then split off into groups and created several corporations that would be a part of this world and interact with each other given a greater context. After we had the framework built, we were individually assigned a \"adventure game\" or visual novel of sorts based in the world we created. I chose to use my characters and my group's corporation (who wouldn't?) with some additional references to the other group's corporations and characters. I framed the story in a way that shouldn't require further context so it would make sense to anyone who tried it out.<br/></p>\n<p>This project was written and created in about a week using Unity and the Fungus text asset from the Unity Asset Store. Photos used are free stock photos and the text box style and sounds are what come with Fungus. Though it's not represented here, we also used articy:draft 3 to track and manage our corporations, characters, and the world itself.</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2019-12-20", "tba": false, "updated": "2019-12-20T02:14:16", "background_image": "https://media.rawg.io/media/screenshots/8d3/8d36121360ed8da8bc9b47d3d465f02d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GogglesKitty"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}