{"id": 399563, "slug": "your-demons-chapter-0", "name": "Your Demons: Chapter 0", "name_original": "Your Demons: Chapter 0", "description": "Hello and welcome everyone to the early access of Your Demons: Chapter 0\r\nIt's an action-RPG set in an urban contemporary world, mainly focused on gang wars.\r\nSince we are still beta testing it and solving some bugs and gameplay issues, we will release a new version next year bug solved and fully translated (and with language localisation!).\r\nHere's a brief list of what you need to know about the gameplay:\r\n- You have no life points except your TOXIC level, wich means one or few shots and you are dead, same with the enemies.\r\n- Your objective is to eliminate a guy upstairs from where you start, sitting on a table in this restaurant with two guards protecting him, armed only with pistols.\r\nYou have different ways to kill him, one of which is poisoning his pizza.\r\n- There are 3 areas: Restaurant, Streets and Bar Ultima Thule.\r\n- Look around for weapons and boosts, even in car's trunks.\r\n- Don't forget to open your inventory by pressing I to equip your weapons and equipment (descriptions are still in italian, we apologize and we'll fix it as soon as we can).\r\n- There are three firearms: pistol, coachgun and grenade launcher\r\n- Six melee weapons: Knife, Pig's Leg, Butcher Knife, Pizza Shovel, Baseball Bat, and your own fists.\r\nThey have unique movesets. Press RMB, LMB and Q to unleash the beast!\r\n- Drugs you can find (joints, shrooms, cocaine, alcoholic beverages) will raise your toxic level, which protects you from shots but if you reach 5 you will faint and die. To lower your Toxic level smoke some nicotine. You'll also find poison and Laxative.\r\n- There are not many of this items so you have to look around for them!\r\n!LIST OF BUGS!\r\n- Sometimes the Target doesn't phisically appear and his guards gets stuck in Idle after you shoot them.\r\n- You have to open your inventory after each area change to re-equip your items.\r\n- If you have issues with equipped items not working (you have two or more items in one hand and none of them is working) change area.\r\n- Loading screen, subtitles from the starting TV and dialogues still in italian.\r\n- You may find more than one coachgun.\r\n- Visual Effects from Drugs disappear while changin area, not the Toxic level.\r\n- If the Target's missing, try the ending pizza poisoning.\r\n- If you are experiencing FPS drops (we still have to figure the requirements), please contact us, and go on SETTINGS &gt; SCALABILITY and set it to 1, it's the lowest setting for graphics.\r\n- We still have to add settings like audio control, keybindings, graphics...\r\n- We also have to make a fully functional leaderboard system to register all your scores.\r\nIF you are experiencing other bugs, please contact us so we can fix them.\r\nHope you'll enjoy it!", "metacritic": null, "released": "2019-12-19", "tba": false, "updated": "2019-12-20T02:39:54", "background_image": "https://media.rawg.io/media/screenshots/44b/44be89059c0785fe148d0c54c2d5e627.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["67byte"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}