{"id": 399626, "slug": "red-2-xl", "name": "R.E.D. 2-XL", "name_original": "R.E.D. 2-XL", "description": "<p>Game de tiro no espaço.</p>\n<p>Suporta Joystick e teclado.<br/></p>\n<p>HISTÓRIA<br/></p>\n<p>No ano de 2629 a Terra foi invadida pela Tropa Intergalática Centauriana. Após 153 anos de sangrentas batalhas, os seres humanos da Terra conseguiram expulsar os invasores.</p>\n<p>Mas ainda com sede de vingança, os seres humanos da Terra construiram poderosas máquinas espaciais de guerra, chamadas de Cérebro Eletrônico Sakurá, que viajaram por 100 anos rumo a Proxima Centauri, mas foram capturadas e reprogramadas para atacar a Terra.</p>\n<p>Frustrados com o fracasso do ataque e prevendo uma nova invasão, a humanidade terrena se uniu na tentativa de criar a mais poderosa arma de defesa espacial de todos os tempo, o Robô Espacias de Defesa ou simplesmente R.E.D.</p>\n<p>R.E.D. foi projetado no ano 2780, na mais notável agencia espacial da Terra naquele período: A AEB, mas antes que seu desenvolvimento fosse concluído, os humanos da Terra conseguiram vencer a Guerra intergalática e o projeto foi substituído pelo desenvolvimento da arma de contra-ataque Sakurá.</p>\n<p>Quando os Sakurás mostraram-se ineficazes, a EAB retomou a criação do R.E.D.</p>\n<p>Os Robôs foram enviados para patrulhamento em diversos pontos do Sistema Solar, aguardando o eminente ataque Centauriano, até que em 2899 um robô R.E.D. modelo 2-XL detectou nas proximidades de Júpiter uma tropa alienígena se aproximando e iniciou sozinho a defesa do planeta Terra.</p>\n<p>POWERUPS</p>\n<p>Além de ser a arma de defesa espacial mais cara do planeta Terra, R.E.D. também tem um exorbitante consumo de energia, o que o torna dependente do envio constante de diversas células de baterias para manter seu funcionamento e de suas armas.</p>\n<p>No game há 4 powerups disponíveis:</p>\n<p>1 - Bateria de canhão: Cada bateria lhe garante o disparo de 15 tiros de energia pura;</p>\n<p>2 - Bateria interna: realimenta a CPU interna do R.E.D.</p>\n<p>3 - Bateria de reparo: Alimenta o \"Sistema Auxiliar de Auto-Reparo\"</p>\n<p>4 - Bateria Combo: Tão cara que poucas são fabricadas e são difíceis de se conseguir. Além de fornecer energia suficiente para 60 tiros, alimentar a CPU interna e o Sistema Auxiliar de Auto-Reparo, ela também fornece energia suficiente para o robô produzir um super tiro de energia pura concentrada, cinco vezes mais forte do que um tiro normal.</p>\n<p>ARMAS</p>\n<p>O Robô R.E.D. possui um canhão de energia pura capaz de colapsar instantaneamente as naves alienígenas e danificar seriamente a \"Nave do Comando\".</p>\n<p>Para sua arma funcionar, precisa ser alimentada pela bateria de canhão que lhe garante 15 disparos.</p>\n<p>Quando o R.E.D. consegue uma Bateria Combo, ele é capaz de produzir um tiro de energia pura concentrada 5 vezes mais forte do que um tiro normal.</p>\n<p>INIMIGOS</p>\n<p>Os inimigos são divididos por grupos, cada grupo é composto por uma divisão de naves espaciais e somente após a destruição daquela divisão, uma nova é enviada com naves diferentes.</p>\n<p>As naves são feitas com uma super liga metálica, um bilhão de vezes mais dura que o aço e quando entram em contato com o tiro de energia pura do R.E.D. colapsam e explodem instantaneamente, isso tornou a Terra altamente combativa e difícil de se conquistar.</p>\n<p>Além das naves alienígenas, o R.E.D. também enfrentará:</p>\n<p>1 - Uma onda de asteroides intencionalmente desviados de sua órbita no Cinturão de Kuiper para colidirem com a Terra.</p>\n<p>2 - O Cérebro Eletrônico Sakurá, uma arma de defesa terrena enviada inicialmente como forma de vingança após a expulsão dos alienígenas em 2782. Os centaurianos capturaram facilmente as Sakurás e as reprogramaram para atacar a Terra.</p>\n<p>3 - A Nave do Comando, é a última nave do ataque, nesta nave está o comandante geral que coordena o ataque ao planeta Terra, não se sabe ao certo seu nome, mas os humanos da Terra se referem a ele simplesmente como \"O Comandante A\". Sua nave é 60 vezes mais resistente do que as naves anteriores.</p>", "metacritic": null, "released": "2019-12-19", "tba": false, "updated": "2019-12-20T02:57:12", "background_image": "https://media.rawg.io/media/screenshots/d3d/d3d28ac09e608061541c15952dc2177b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["playtronic"], "genres": ["Action"], "publishers": [], "esrb_rating": null}