{"id": 399799, "slug": "darkness-td", "name": "Darkness TD", "name_original": "Darkness TD", "description": "<p>Darkness TD centers around the player, who has managed to get a special artifact in an ancient chinese temple. The artifact functions as a light source. However, once it is in the possession of the player, the guardians of the ancient temple awaken. The player has been granted the ability to build towers that will attack the incoming enemies. There are three different types of towers; the arrow, rocket and flame towers. There are also two types of enemies; terracotta and jiangshi. The enemies will follow a path that has been laid out. It may seem like an ordinary tower defense game, but the player needs to shine the artifact's light upon the towers to activate them. There are mirrors in the game that can reflect light, which encourages the player to experiment with light. There are two levels, and the first level is to allow the player to get a feel of the game. The second level is much more challenging, as there is another objective; to charge a door. The door needs to be charged completely as well as staying alive to complete the second level. The game ends when the enemies reach the player.</p>\n<p>This student game was made by illucidnation, a team of game developers consisting of 2 Game Designers, 4 Artists &amp; 4 Programmers doing Bachelor of Game Development in UOW Malaysia KDU.</p>\n<p>Credits:</p>\n<ul><li> Soh Jin Cheng, Game Designer, sohjincheng@gmail.com</li><li> Matsutani Haruka, Game Designer, monbun1827@gmail.com</li><li> Shawn Low Zhen Xuan, Game Artist, theshawnatic@gmail.com</li><li> Muhammad Naim Bin Rashidi Aly</li><li> Ong Jia Min, Game Artist, ongjiamin99@gmail.com</li><li> Muhammad Khairul Anwar Bin Ahmad Fuad</li><li> Leong Onn Loon, Game Programmer, onnloon0630@gmail.com</li><li> Yap Kar Seng, Game Programmer, qruleskarseng@hotmail.com</li><li> Xiao Hongyu, Game Programmer, 1171607088@qq.com</li><li> See Aik Eng,Game Programmer ,warriormy@hotmail.com</li></ul>", "metacritic": null, "released": "2019-12-18", "tba": false, "updated": "2019-12-20T03:37:20", "background_image": "https://media.rawg.io/media/screenshots/fe6/fe61099cd9d588ca62e30e9fa19a2cb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["UOWM Game Development", "Hawk27"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}