{"id": 399776, "slug": "overgrown-julian-sollozo", "name": "Overgrown (Julian Sollozo)", "name_original": "Overgrown (Julian Sollozo)", "description": "<p>This is a game that I am making with 4 other team members for a Capstone class at UC Irvine. The idea behind the game is, what if you were a part of a tower defense game instead of sitting idly by. We thought it would be fun to give the player direct control of an avatar so that you avoid the idle waiting time that can come with more traditional tower defense games. We combined this with some aesthetic and mechanics inspired by games like Harvest Moon and Stardew Valley, to create a really interesting idea for a twist on a tried and true formula. </p>\n<p>I am the producer and designer for the game, that is mostly responsible for keeping the project on track and designing features and levels. This has been probably my largest scale project and it has been an awesome learning experience when it comes to organizing a team, and sticking to a plan.  We still have a lot of work left to do, personally I am currently working on the plot, and more level designs. My team, even though we first met while working on this project, is working really well and really trying to come out with a quality product.</p>\n<p>Currently the game is in development, and as many may know, this means that there are a few major bugs. Currently we are working on fixing a but that is making our shop disappear, but this will hopefully be fixed shortly. If there are any other bugs make sure to let us know in the comments. Lastly, a reminder that all current art in this build is temporary, and will be replaced soon. </p>\n<p>Have fun and remember to keep your bug spray handy,</p>\n<p>Julian</p>\n<p>12/18/19</p>\n<p> -an idea of what the art will eventually look like<br/></p>", "metacritic": null, "released": "2019-12-18", "tba": false, "updated": "2019-12-20T03:32:06", "background_image": "https://media.rawg.io/media/screenshots/e34/e34bb1747dfd1961f83406c2c790a7c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Julian Sollozo"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}