{"id": 399893, "slug": "men-must-be-crazy", "name": "Men Must Be Crazy", "name_original": "Men Must Be Crazy", "description": "<p><strong>Created for Global Game Jam 2016</strong></p>\n<p>A local population is being threatened by the impeding eruption of a volcano. Everyone has gathered to listen to the wise words of their elders, and ponder their propositions to resolve the situation... through ritual. </p>\n<p><strong>Gameplay</strong><br/></p>\n<p>The player will have to choose an elder (one of the three people on top) and select from a range of options to perform different rituals to try to save the population from it's destruction. Will you perform a ritual dance to please the gods? Or maybe you should pray and ask for forgiveness? Perhaps a mystical chant may summon energies to stop the volcano? Also, will everyone accept these propositions and become followers? Will they be able to push through any level of sacrifices required of them by the rituals? Will there be agreement or dissonance? Who knows the answers to all these questions... Find the \"ritual\" for you, and uncover the steps required to perform it... or maybe not. </p>\n<p><strong>NOTES</strong><br/></p>\n<p>Unfortunately we were unable to implement everything on time, and, as such, there actually is no \"win condition\" possible... But you can loose! (lol) Also, you might find a bug or two. For instance, sometimes the wrong animations and audio are run.</p>\n<ul><li>Created by: Edgar Jesus, Ricardo Toureiro, Samuel Alves</li><li>Music by: Pedro Rodrigues</li><li>Audio by: Tiago Rodrigues</li></ul>", "metacritic": null, "released": "2019-12-17", "tba": false, "updated": "2019-12-20T04:04:04", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e6fbfedc5961bd92ff3696bc29d92c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Edgar J."], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}