{"id": 399862, "slug": "find-your-way-itch", "name": "Find Your Way (itch)", "name_original": "Find Your Way (itch)", "description": "<p>The night is cold, the tracks are covered, and the monsters are out. You have lost your way home and need to make it back before sunrise. You may have lost your bearings, but you have not lost your hope. Use the power up collectibles around you to navigate and fight your way through natural obstacles and swarms of enemies. Find Your Way is a 2D actions side-scroller that serves as the first ever project from amateur game developer Jack O'Brien. Players must learn the level and learn the abilities granted to them in order to get back on the right track to make their way back home. You, you must Find Your Way back home. </p>\n<p>**DISCLAIMER**</p>\n<p>This game is currently in development and is missing many key components in order to be classified as a complete game. I apologize for any missing components and features that would further make the game more complete. However, the game will be diligently worked on and completed soon!</p>\n<p>Features: </p>\n<ul><li>Three main power ups for you to navigate and through the vertical and hostile obstacles throughout the level<ul><li>Double Jump: Use your first power up to get your bearings and jump higher through the first set of obstacles!</li><li>Shoot: Use your second power up to blast through the wave enemies the are in the way of victory!</li><li>Glide: Use the last power up to soar through the level with a gravity altering collectible!</li></ul></li><li>Eerie and ominous level design and setting to immerse the player to make the game more than a platformer. It's a spooky experience! </li><li>Level enhancing game audio to further immerse the player in a spooky experience!</li><li>Simple verticality and obstacle design so that anyone and everyone can play and enjoy! </li></ul>\n<p>Controls:</p>\n<ul><li>Movement: <ul><li>Left and Right arrow keys: Horizontal movement </li><li>Space Bar: <ul><li>Jump</li></ul><ul><li> Twice to double jump</li><li>Hold to glide</li></ul></li></ul></li><li>Action:</li><ul><li>Shoot: CTRL</li></ul><li>MISC:<ul><li>To end the game: ALT + SHIFT + F4</li></ul></li></ul>", "metacritic": null, "released": "2019-12-17", "tba": false, "updated": "2019-12-20T03:55:59", "background_image": "https://media.rawg.io/media/screenshots/596/596aaae1468dd47cdce1a88f1754d6fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jalobrie"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}