{"id": 400326, "slug": "civilizationrise-of-empire", "name": "Civilization:Rise of Empire", "name_original": "Civilization:Rise of Empire", "description": "Civilization: Rise of Empire is a real-time strategy simulation game based on the Middle Ages. Here you will build your kingdom and city, use strategy and tactics and lead fearless knights to conquer the territory!<br/><br/>#GAME FEATURES:<br/><br/>●Build Your Military Matrix in A Free Sandbox<br/>Real world map. the original medieval style. Deserts, lakes, forests and other diverse terrains will change the situation of war. Expand the territory to extending the territory of the forces.<br/><br/>●Diverse Genres of Points in Technology Tree<br/>The most interesting and characteristic system in the game is no other than the technology system. Different internal affairs and military technology can help you achieve your goals quickly. The point routes of technology will create different genres. The situation of war changes rapidly.<br/><br/>●Create Exclusive Soldiers to Fight in Siege<br/>Construct city to accumulate wealth and resources and train soldiers rapidly. Thousands of arms combine with forces to make the battle variable and fun. Dispatch troops to capture cities and loot wealth. Make the kingdom attract worldwide attention!<br/><br/>●Members of Bloc Help Each Other<br/>It is impossible to conquer the whole world on your own. Joining the Bloc to fight with your allied. Scout, attack and defense are seamlessly connected. Once your capital is attacked, you allies will be informed and you will fight together against the enemies.<br/><br/>- Your Legend is yet to be written, free download today to enjoy the pure war!!!<br/><br/>CONTACT US：<br/>Facebook:https://www.facebook.com/CivilizationROE<br/><br/>Reddit: https://www.reddit.com/r/RiseofEmpire<br/><br/>Discord: https://discord.io/RiseofEmpire<br/><br/>E-Mail：g1042235380@gmail.com<br/><br/>Policy：http://civilization.civilizationriseofempire.com/yszc.html<br/><br/><br/>E-Mail：g1042235380@gmail.com", "metacritic": null, "released": "2019-12-12", "tba": false, "updated": "2019-12-23T01:59:07", "background_image": "https://media.rawg.io/media/screenshots/559/559278c864b78cd897d6b6330141160f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mincai li"], "genres": ["RPG", "Strategy"], "publishers": ["mincai li"], "esrb_rating": "Teen"}