{"id": 400521, "slug": "dragons-vs-knights", "name": "Dragons vs Knights", "name_original": "Dragons vs Knights", "description": "Dragons vs KnightsDemo<p>Ei, você!</p>\n<p>A rainha dragão está indefesa enquanto coloca seus ovos e os humanos estão se aproveitando para atacar! Precisamos da sua ajuda!</p>\n<p>Dragons vs Knights é um jogo no estilo tower defense com um ritmo rápido e estratégias dinâmicas, você pode reposicionar seus dragões para montar a melhor defesa contra cada onda de ataque dos cavaleiros. Cada tipo de dragão tem habilidades únicas, assim como os humanos de classes diferentes!</p>\n<p>Este demo tem 7 fases para teste do jogo, mas pode ainda conter bugs pois não foi exaustivamente testado. Divirta-se e comente o que achou, críticas são bem vindas e avisos de bugs são muito importantes! O jogo está em estágio avançado do desenvolvimento e estará disponível em breve no Steam e na Play Store para Android.</p>\n<p>Siga no Facebook Bolere Games para mais notícias, data de lançamento e projetos futuros!</p>\n\n<p>Hey you!</p>\n<p>The dragon queen is helpless while she lays her eggs and the humans are taking advantage to attack! We need your help!</p>\n<p>Dragons vs Knights is a game in the tower defense genre with a fast pace and dynamic strategies, you can reposition your dragons to mount the best defense for each upcoming attack wave of knights. Each dragon type has unique abilities, as well as the different human classes!</p>\n<p>This demo has 7 stages to try the game, but may yet contain bugs as it hasn't been thoroughly tested.  Have fun and comment bellow, criticism is welcome and bug reports are very important! The game is in late development and will be released soon on PC Steam and Android Play Store.</p>\n<p>\n</p>\n<p>Follow Bolere Games on Facebook for more news, release date and future projects!</p>", "metacritic": null, "released": "2019-12-21", "tba": false, "updated": "2019-12-23T02:44:47", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab08738198bb81df999afe801d7dc9b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MattBolere"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}