{"id": 400632, "slug": "the-vietnam-war-strategy-game", "name": "The Vietnam War Strategy Game", "name_original": "The Vietnam War Strategy Game", "description": "<p>This game lets you simulate the military, diplomatic, and domestic political conflicts that comprised the Vietnam War. You play the US/South Vietnam side, and to win, you must keep the North Vietnamese and the Viet Cong from capturing Saigon for 100 turns. To do this, you must effectively manage resources such as ground troops, intelligence, domestic support, and air power. If South Vietnam can hold out, it has a chance to become the next South Korea or Singapore.</p>\n<p>The point of this game is to see what would have happened if the US had been willing to make the kind of low troop count / long-term military commitment that we’ve seen in Iraq and Afghanistan during the closing years of the Vietnam War. Essentially, the game is designed to simulate the Vietnamization phase of the conflict. To be successful, you must get South Vietnam to a place where it can defend itself with a bit of military aid from the US. Once the south was able to hold off the north militarily, the same economic forces that transformed South Korea, Taiwan, Singapore and Malaysia into industrialized countries would have a chance to make over the South Vietnamese economy as well. At the same time, Soviet and PRC patience for North Vietnam would eventually end due to the Sino-Soviet split and/or the collapse of the Soviet Union. If the US was willing to provide weapons, training, air support, and financial aid through 1985, South Vietnam could probably have survived.</p>", "metacritic": null, "released": "2019-12-21", "tba": false, "updated": "2019-12-23T03:14:36", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4c6ba2a236a676b769abf6fc6f86cd3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["africacrossgames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}