{"id": 400635, "slug": "lafix-ii", "name": "LAFIX II", "name_original": "LAFIX II", "description": "<p>I have ported this game, Lafix II from the Symbian operating system (used on the Nokia N8 phone) to the ZX Spectrum.  Written entirely in BASIC with only a small machine code routine to disable the break key, the game will provide hours of fun with 135 levels to play through.</p>\n<p>From the menu you can press P to then enter a pass code.  If you have already completed a number of levels and have made a note of the pass codes from the levels, you can simply enter one of those pass codes and go straight to that level.</p>\n<p>While playing a level you can return to the menu by pressing the DELETE key.  On an original rubber keyed spectrum this is achieved by hitting Caps Shift and 0 (a combination that hopefully you won't hit by accident).  Once at the menu, if you wish to replay the level you were on you will have to enter the pass code, as simply pressing any other key will start you back at LEVEL 1.<br/><br/>On every level you will find a starting tile and an ending tile.  Your task is to move the mirrors around to direct a laser beam from the starting tile to the ending one.  Along the way you will encounter impenetrable walls, fixed mirrors, holes that you cannot place a mirror in, teleporters, often more than one way to solve a puzzle, level pass codes (skip to a particular level from the menu),  and sometimes it would seem that the level is unsolvable, but rest assured, the author has play tested every level thoroughly.</p>\n<p>This is not an arcade game, so fast reactions are not required.  At the start of the level a flashing cursor will be positioned at the starting tile.  Move this around with Q, A, O or P and when you are highlighting a movable mirror press the ENTER key to pick it up.  A small graphic appears at the bottom of the screen indicating which sort of mirror you have picked up.  If you decide you wanted to pick up a different mirror, just move to that mirror and hit ENTER.  Once you have picked up a mirror, move the cursor around the screen to the desired location and hit ENTER again.  You will move the last picked up mirror to that location.  You can only move a mirror into a blank space.<br/></p>\n<p>Once you are happy with your mirror placement, press SPACE to fire the laser.  Being the super hero you are, the laser moves quite slowly around the level.  If you hit an obstacle or the edge of the screen, the laser will stop and erase itself ready for you to correct the error and try again.<br/></p>\n<p>On completion of the level (when the laser reaches the intended target tile), you will be greeted by a rising scale of notes from the BEEPer and the next screen will start drawing.  I apologise that this bit is slow, I compacted the screen data somewhat because I wasn't sure how large the data would be, and it takes a modest time to unpack each level.</p>\n<p>I have left it open that I may decide in the future to design more levels to go into the game.</p>\n<p>It is advised to make a note of the pass code for every screen.  Conveniently this is shown at the bottom of the screen once the level has been displayed.<br/></p>\n<p>Please enjoy, and I welcome your feedback.</p>", "metacritic": null, "released": "2019-12-21", "tba": false, "updated": "2019-12-23T03:15:17", "background_image": "https://media.rawg.io/media/screenshots/075/07522fa6325a1817deb8c69ebf6ceb63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Simonsnake"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}