{"id": 400848, "slug": "desires-choose-your-story", "name": "Desires: Choose Your Story", "name_original": "Desires: Choose Your Story", "description": "\"Desires: Choose Your Story\" is a highly immersive interactive role-playing platform.<br/><br/><br/><br/>Desires isn't like other multiple-choice games- on your platform, you have a real impact on the storyline. You'll get to design your character yourself- customising hair, skin colour, clothing, and lots more!<br/><br/><br/><br/>In all of our games, you're not a player or a bystander- but the protagonist- shaping the plot from the very start. You'll interact with thousands of different characters to take our games in your own unique direction- creating special solutions and endings that are exclusive to you!<br/><br/><br/><br/>Our platform utilizes high-quality interactive content with meiticulous graphics and the best quality storylines for a luxury gaming experience. Unique choices lead to bespoke plots and tailor-made game endings shaped by you and written by our professional team of writers!<br/><br/><br/><br/><br/><br/>FEATURES<br/><br/><br/><br/>Desires enjoys partnerships with numerous award-winning romance writers across the world, and hundreds of best-selling books have been published on our platform in an exciting, interactive format. <br/><br/><br/><br/>Need to lose yourself in a fantasy adventure? Want to solve puzzles in action-packed mystery... or feel like getting rid of some pent-up energy in a steamy romance story? We've got you covered! Our interactive games are drawn from a huge variety of genres and writers, so that we have something to suit everyone.<br/><br/><br/><br/>Love and hate, good and evil, loyalty and trickery... Everything is to play for in Desires. Come and give us a try!<br/><br/><br/><br/>PRIVACY POLICY &amp; TERMS OF SERVICE<br/><br/>Please read our privacy policy at http://desires.moments.game/privacy.html<br/><br/>By playing the game, you agree to our terms of service http://desires.moments.game/terms.html", "metacritic": null, "released": "2019-12-22", "tba": false, "updated": "2019-12-27T01:51:42", "background_image": "https://media.rawg.io/media/screenshots/0a7/0a754e8d3adbcd6394fa58956fc31f76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Koramgame.com"], "genres": ["Adventure", "RPG"], "publishers": ["Koramgame.com"], "esrb_rating": "Mature"}