{"id": 400979, "slug": "dr_love2-14s-mondrain", "name": "Dr_Love2-14's Mondrain", "name_original": "Dr_Love2-14's Mondrain", "description": "<p>Description by /u/Dr_love2-14</p>\n<p>Board Description: The gameboard is a 5-by-6 grid. Each square is numbered with either one, two or three dots. The grid is numbered with the dots in uniform diagonals across the gameboard as shown here: http://imgur.com/a/iOi0RnT</p>\n<p>Game Setup: The game is setup with six yellow rings on one side and six blue rings on the other side as shown here: http://imgur.com/a/IjjTVNJ</p>\n<p>Turn Overview: Choose one of your rings and move it exactly the number of spaces as dots that it started on at the beggining of your turn. For example: If you choose a ring starting on a space with three dots, you must move that ring three spaces.</p>\n<p>Additional Movement Rules: You move a ring to any immediate horizontal or adjacent space. You cannot move a ring diagonally. You must move the ring into a free space (unless you are capturing a ring. See \"capturing rings\" for more information.) A free space does not have any other rings on it.</p>\n<p>You are allowed to backtrack. For example, if for your turn you choose a ring starting on a space with two dots, you may move that ring one space forward and then back again, ending where you started.</p>\n<p>Capturing Rings: You capture your opponent's ring by landing directly on it. For example, if you choose a ring starting on a space with three dots, you cannot potentially capture three of your opponent's rings. You can only capture one ring, because your turn must end with your ring on the same space the captured ring was once on.</p>\n<p>Winning the Game and Strategies: You win the game by capturing all of your opponent's rings.</p>\n<p>The game usually progresses by mutual attrition, with one player capturing one opponent ring at the eventual cost of one of their own rings. Thus, most every game ends in a pyrrhic victory, with the victor having only one ring left.</p>\n<p>Key strategies are to simply progress towards near the end of the game with your last ring in an advantageous position to capture your opponent's last ring.</p>", "metacritic": null, "released": "2019-12-26", "tba": false, "updated": "2019-12-27T02:22:13", "background_image": "https://media.rawg.io/media/screenshots/3ad/3adef82c0fd04ae00fbd1e8c441cba5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lohborn"], "genres": [], "publishers": [], "esrb_rating": null}