{"id": 401, "slug": "nioh", "name": "Nioh", "name_original": "Nioh", "description": "<h3>Dead or alive</h3>\n<p>A game of insane complexity in the best traditions of the Dark Souls series, the games of which set the standard of quality in the genre. The game was developed by the Japanese studio Team Ninja for the Sony PlayStation 4 console and PC in 2017. The development team previously released projects such as Ninja Gaiden and Dead or Alive. The version of the game for the PC contains all the additional content that came out on the console.</p>\n<h3>The setting</h3>\n<p>The game takes place in the seventeenth century Japan, in the fictionalized version of the Sengoku period, when the country was engulfed in the flames of civil war. The player takes control of the An Anglo-Irish sailor named William, who sets out in pursuit of the villain in the country of the rising sun and finds himself entangled in the mystical and political upheavals that pervaded all of Japan. Despite the fantasy elements, the plot uses real prototypes of historical events and personalities.</p>\n<h3>Key features</h3>\n<p>The controls are quite simple: two types of attack, block and dodge are available. The gameplay is modified by role-playing elements: for example, at the start of the game, it is necessary to choose which weapon in William will be predefined. This helps to determine which skills to develop, with further completion. Like Dark Souls, enemies are reborn after each interaction with the local analog of bonfires - Shrines.</p>", "metacritic": 88, "released": "2017-02-07", "tba": false, "updated": "2024-04-16T11:25:44", "background_image": "https://media.rawg.io/media/games/f84/f84c7c45e074117fb81fecf427f8b41f.jpg", "website": "http://teamninja-studio.com/nioh/", "rating": 3.81, "rating_top": 4, "added_by_status": {"yet": 290, "owned": 2424, "beaten": 275, "toplay": 184, "dropped": 358, "playing": 81}, "playtime": 0, "achievements_count": 336, "ratings_count": 671, "suggestions_count": 655, "game_series_count": 1, "reviews_count": 677, "platforms": ["PC", "PlayStation 4"], "developers": ["Team NINJA"], "genres": ["Action", "RPG"], "publishers": ["Sony Computer Entertainment", "Koei Tecmo Games"], "esrb_rating": "Mature"}