{"id": 401087, "slug": "elves-clan-tricky-xmas", "name": "Elves Clan: Tricky Xmas", "name_original": "Elves Clan: Tricky Xmas", "description": "<p>🎄🎁Elves Clan: Tricky Xmas🎁🎄 is an impossible game, very easy to play but hard as a Buddhist monk career!  <br/><br/>In Elves Clan: Tricky Xmas you’ll have to help Triki, Friki and Kiki to get to Chicho's house, jumping obstacles and platforms before they move, break, disappear or anything else kills you XD! On the way, you’ll find coins and Christmas tree balls... 😇 It seems easy, right? Well, it doesn't! Because this simple game can take out your rage but at the same time all your Christmas love :3 Are you going to accept the challenge and beat your friends' high scores!  <br/><br/>“But, who are the Elves?” <br/>Triki, Friki and Kiki are best friends and want to arrive at Chicho's house on Christmas to make pranks on him and stop him to celebrate this beautiful night. You read that right! You are playing as cute antiheroes in this game, so help them on this adventure! <br/><br/>❤️YOU WILL HELP VENEZUELAN CITIZENS❤️ <br/>The money raised from each ads watched will be donated to Venezuelan foundations that distribute food, medicines and clothes for the neediest. The game and the animated shorts are made by Venezuelan all around the world and some friends from other countries that are helping this cause! <br/><br/> -------- FEATURES --------  <br/>🎅 Super hard, fun and addictive <br/>🎅 Simple and intuitive platform game <br/>🎅 Achievements and leaderboards are integrated with Google Play Games. <br/>🎅 New levels, skins and gifts will be added with every new animated short released! 🎅 Unique visual retro new graphic style . <br/><br/>Regarding In-App Purchases: <br/>IAPs in the game are purely cosmetic. <br/>No additional purchases are needed to finish the game. <br/>🎁 Offline game: No internet connection needed. <br/><br/>This game was made by Juan León and some friends who help him with the music, character design and QA (they are in the game credits). We hope you enjoy our game as we loved to do it too and help the cause! We would love to hear your feedback 🤘 and stay tuned to the animated short release.   <br/><br/>Download the cutest and most difficult game in the history of Christmas. Once you die, the laugh don't stop! (from who is watching you play, that's for sure) 🤣</p>", "metacritic": null, "released": "2019-12-25", "tba": false, "updated": "2019-12-27T02:43:52", "background_image": "https://media.rawg.io/media/screenshots/42b/42b56bec833c64809237e3de637f171b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JUANLEON.LIFE"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}