{"id": 401097, "slug": "full-frame-battalion", "name": "Full-Frame Battalion", "name_original": "Full-Frame Battalion", "description": "<p><strong>Full-Frame Battalion</strong> is a project built from a passion for Japan's iconic Gundam franchise. Using Unity for development and being built in spare time, the game is simple at the moment. However, as time goes on and more skills get added to the dev's toolbox, the game will become something the mech shooter community would be proud to call their own.</p>\n<p>Currently, the game features:</p>\n<p>- WASD controls for X/Z axis movement, and Space/Ctrl for Y axis</p>\n\n<p>- A menu that allows loading into the sandbox level, reading the control scheme, and quitting the game</p>\n<p>- A couple enemies driven by an expandable, robust Finite State Machine</p>\n<p>- Ammo, health, and booster fuel to be managed as you play</p>\n<p>- Beautiful space themed skyboxes thanks to SpaceSkies Free on the Unity Asset Store</p>\n<p>There's plenty more to come in Full-Frame Battalion's development. Next in my plans are a pause menu and enemy spawn system to make sure the fun only stops when you say so. Further than that, you'll just have to stay tuned and see.</p>\n<p>- C M Badiuk</p><p>DISCLAIMER: This game currently uses a music track from Titanfall 2, by Respawn Entertainment and EA. This track is temporarily being used only on the main menu, and is considered to fall under fair use. Any concerns may be brought up with me directly through my support Email Address</p>", "metacritic": null, "released": "2019-12-24", "tba": false, "updated": "2019-12-27T02:46:02", "background_image": "https://media.rawg.io/media/screenshots/e87/e8781c2ee41ffd5505b317b74faebc5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CMBadiuk"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}