{"id": 401125, "slug": "freeze64-free-commodore-c64-christmas-game", "name": "FREEZE64 - Free Commodore C64 Christmas Game", "name_original": "FREEZE64 - Free Commodore C64 Christmas Game", "description": "<p><strong>What is FREEZE64?</strong></p>\n<p>This game was kindly sponsored by the FREEZE64 fanzine: the properly printed Commodore 64 gaming, cheat and coding fanzine, which you can buy and have sent to you wherever you are in the world.</p>\n<p>Each issue is full of C64 game news, mini game reviews, coder interviews (recent interviews include Jon Hare, David Darling, Andrew Braybrook, John Darnell, Gary Penn, Nick Taylor, Peter Liepa, Shaun Southern, Chris Shrigley, Karl Hornell, Mark Greenshields, Duncan Kershaw, Tony Pomfret…) game ending reviews, desert island disks, special guides on game hacking, tips, revealing hidden game messages, exclusive POKES ‘n CODES, and lots, lots more. If you love gaming on your C64 and want to learn more about cheating in games, as well as reading game reviews, features and interviews, then FREEZE64 is the fanzine for you.</p>\n<p>Buy issues or subscribe at https://freeze64.com/</p>\n<p><strong>System Requirements:</strong><br/></p>\n<p>The FREEZE64 Christmas game is compatible with real Commodore 64s, emulators (I recommend VICE) and TheC64 and TheC64 Mini. For the best experience use or emulate a PAL machine but it does work on NTSC.</p>\n<p><strong>Loading Instructions:</strong></p>\n<p>If you wish to play on real hardware then you will need a means of transferring the FREEZE64.D64 file to a real disk or a device such as SD2IEC or Pi1541 to mount the disk. Type LOAD \"*\",8,1 then RUN to play.</p>\n<p>For emulators, simply drag and drop the FREEZE64.PRG file into the emulator window or load it from the \"mount disk\" menu and follow instructions for real hardware.</p>\n<p>For TheC64 machines, copy the FREEZE64.PRG file to your USB stick and launch it via the console's menu system.</p>\n<p>Playing Instructions:</p>\n<p>It is a FREEZE-ing Chrismas Eve and Santa has presents to deliver. See how many parcels you can drop into chimneys before the moon sets, but watch out for Chinese lanterns, bats and burglars who are on the prowl to try to spoil Christmas! </p>\n<p>Use a joystick in port 2. Directions move Santa around the screen and fire drops a parcel.</p>\n<p>Press P while playing to pause the game<br/></p>\n<p>Press Q while paused to quit to the title screen</p>\n<p><strong>Credits:</strong></p>\n<p>Graphics and game design: Aurora Richmond (age 10)<br/></p>\n<p>Programming and sounds: Mike Richmond</p>\n<p>Playtesting: Aurora Richmond, Oliver Richmond, Vinny Mainolfi, Furroy and  Shallan50k.</p>\n<p>Producer: Vinny Mainolfi for FREEZE64 fanzine www.freeze64.com</p>\n<p><strong>Have a Merry Christmas and a Happy and Prosperous New Year!</strong><br/></p>", "metacritic": null, "released": "2019-12-24", "tba": false, "updated": "2019-12-27T02:52:45", "background_image": "https://media.rawg.io/media/screenshots/b87/b8715c7f88851514773dab42fed61423.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MikeRichmond"], "genres": ["Action"], "publishers": [], "esrb_rating": null}