{"id": 40129, "slug": "breach", "name": "Breach", "name_original": "Breach", "description": "<p>Seventy thousand years ago, humanity was on the verge of extinction until a group of Immortals created the Veil, splitting Earth into two realities: one that has the Earth we know, and an alternate Earth where all that we have come to know as mythology thrives.  Now the Veil has been shattered and the two worlds are collapsing into each other with catastrophic consequences.  You and your friends are among the rare few who can wield magic and defend humanity against this cataclysm.<br />\nBreach is a fast-paced third person co-op action RPG.  Create your own character, customize your appearance, and choose from dozens of classes with gameplay inspired by multiple genres.  Launch your enemies in the air and juggle them with rapid attacks.  Play as a classic support healer.  Sit on the edge of the action and snipe your enemies from a distance.  Endlessly customize your character and class to find your own unique playstyle.<br />\nTake your unique character onto Missions across the globe in Solo or Co-op modes with any number of players up to 4.  Fight your way through mythological monsters toward a final area where you will face a giant boss monster.  Along the way you will be challenged by an all new kind of enemy, the Veil Demon.  This smoke-like spirit can possess and empower any monster you encounter and create breaches, pulling in environmental hazards from the parallel, Mythological Earth.<br />\nIn addition to playing as a Hero, you can also play as the Veil Demon in Solo or Versus modes!  Breach also has a Custom mode where you can play with any number of friends (up to 5), playing as either a Hero or Veil Demon.</p>", "metacritic": 59, "released": "1986-12-31", "tba": false, "updated": "2023-12-18T17:34:53", "background_image": "https://media.rawg.io/media/games/781/78147bbd2444a3c6e2525c72edd7118f.jpg", "website": "http://breachgame.com", "rating": 1.93, "rating_top": 1, "added_by_status": {"yet": 20, "owned": 533, "toplay": 4, "dropped": 7, "playing": 1}, "playtime": 1, "achievements_count": 16, "ratings_count": 46, "suggestions_count": 688, "game_series_count": 0, "reviews_count": 46, "platforms": ["PC"], "developers": ["Atomic Games", "Omnitrend Software", "QC Games", "NullReferenceGames"], "genres": ["Action", "Shooter", "RPG", "Indie"], "publishers": ["Throwback Entertainment", "Atomic Games", "QC Games", "NullReferenceGames"], "esrb_rating": "Teen"}