{"id": 401431, "slug": "a-positive-light-star-wars-and-dechartgames-inspir", "name": "A Positive Light (Star Wars and DechartGames Inspired Game)", "name_original": "A Positive Light (Star Wars and DechartGames Inspired Game)", "description": "<p>*Star Wars: A Positive Light (Star Wars and DechartGames Inspired Game) *<br/></p><p>Fighters of the Dechart Base, see how long you can last on the run from evil forces! <br/></p>\n<p>Press Space or Q to jump! You can hold the button for a longer jump or press it twice for a double jump.<br/></p>\n\n<p>~~~</p>\n<p>This started out as a kind of joke idea from how many times Bryan Dechart has shouted \"I want to be in A Star Wars game!\" at conventions, but then I wanted it to be something for the whole community to enjoy. It started out as a platformer, but after all the fun with the community playing Crash Team Racing, I thought it'd be cool to make it an endless runner game that people could be competitive with and compare scores. :D </p>\n<p>Been working on this just over a month, which was intended as a Christmas gift for the commnity, but better late than never! I hope you all get to enjoy the game! It's been a few years since I really did any game coding, but I was still determined to make this. The Dechart Games/ Connor Army is one of the most amazing communities I've ever known, and I'm so glad to have found so many friends through it! You're all so amazing, brilliant, kind and posistive! Love you all! &lt;3</p>\n\n<p>In case you've never heard of Dechart Games, Bryan Dechart and Amelia Rose Blaire are awesome people who are actors and stream games on Twitch! You can find them over at https://www.twitch.tv/dechartgames </p>\n\n<p>This game is fan made, no copyright is intended. <br/></p>", "metacritic": null, "released": "2019-12-29", "tba": false, "updated": "2019-12-30T02:04:12", "background_image": "https://media.rawg.io/media/screenshots/7db/7db396ec2c5145a2ea8237a840e1506b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DogtorWho"], "genres": [], "publishers": [], "esrb_rating": null}