{"id": 401504, "slug": "sunny-new-year-death-of-snowman", "name": "Sunny New Year: Death of Snowman", "name_original": "Sunny New Year: Death of Snowman", "description": "Controls\r\n<ul><li>Up Arrow / W / Z to move up and scroll through text</li><li>Left Arrow / A / Q to move left and scroll back through text</li><li>Right Arrow / D to move right and scroll through text</li><li>R to restart</li><li>Escape to close game on Windows</li><li>F11 to toggle fullscreen on Windows</li></ul>\r\nStory\r\n<p>You are  a snowman, fighting to survive the oncoming New Years heat! Race from the encroaching sunlight, tumbling downhill to find a walk-in freezer to sustain yourself in! You'll need to crack open lost gifts until you find something that can help you get inside a restaurant for their walk-in freezer, but don't melt first!</p>\n<p>It was never going to snow for Christmas in California, but with the magic of a child's wish and Christmas spirit, a snowstorm was conjured for a merry white Christmas! You were created alongside this snowstorm to help spread cheer for the holiday!</p>\n<p>But now it's New Years Eve, and the magic that brought the Christmas snow is fading... The sunlight looms ever closer, so you must escape downhill and find a way to survive New Years! A walk-in freezer seems the best idea... but all the restaurants are closed for New Years Eve! The water from the melting snow and ice has scattered lost gifts across this hill. Surely one must hide <em>something </em>that can help you get inside one such restaurant. If you can survive that long!</p>\r\nJam Themes\r\n<p>This game was made for the concurrent 2019 Trijam: The Ultimate Mega Extreme edition, Mini Jam 44: New Year, and Weekly Game Jam - Week 129.</p>\n<p>It was made in under 9 hours for the Mega TriJam, in the same time period of Mini Jam 44 and WGJ 129.</p>\r\nThe Mega TriJam Themes were:\r\n<ol><li>The End is Near ✔️</li><li>Mistakes Were Made ✔️</li><li>+1 ❌</li></ol>\n<p>This game best fits the theme \"The End is Near\". This is the core concept behind the game and integral to gameplay. You are a snowman evading from the nearing sunlight that threatens to melt you. The sun is always coming closer, ready to destroy you. This also relates strongly to the experience of managing your snowman health, when the end is near for you with only a small pitiful little head remaining, surrounded by deadly puddles that will wash you away and a nearing line of sunlight that will melt you. This <em>also </em>relates to the fact that the game takes place on New Years Eve, the nearest to the end of the year as you could be. This <em>also also </em>relates to something else silly I won't spoil.</p>\n<p>It doesn't fit the \"Mistakes Were Made\" theme as tightly. I still think that idea definitely relates to the gameplay experience, as your mistakes are very costly and a poor choice can ripple through and lead to your demise without a stroke of luck. It isn't <em>that </em>strong of a connection, though.</p>\n<p>I can't rightly say this game adheres to the \"+1\" theme. You can of course argue that you're always getting +1 snowman body parts and +1 spaghetti and the like, and I was planning to steer into that with a \"+1 snowman piece\" and \"+1 spaghetti\" text effect pop-up every time you did that, but I didn't have time for that in the tight 3 hour crunch time for programming, so that's not even there to reinforce the connection.</p>\n<p>The Mega TriJam also had the following optional challenges:</p>\n<ol><li>Use Godot Engine; ❌</li><li>Make your game free and open source; ✔️</li><li>Design freezing temperature related game; ✔️</li><li>Have presents and gifts in your game; ✔️</li><li>Have Christmas magic and spirit in your game; ✔️</li><li>Add an Easter egg (from known Christmas/New Year movie or a game). ✔️</li></ol>\n<p>I did not use Godot; I used GameMaker Studio 2, FL Studio, and sfxr.</p>\n<p>The game is free and the source code is available for download above. I always forget to do that... and I'm embarrassed by my hacky, uncommented, very messy spaghetti-code with lots and lots and lots of magic numbers and copy-paste and bad practice and all sorts of garbage... but it's crunched in a 3 hour time limit so what can you do.</p>\n<p>I originally intended a bigger mechanic with temperature-freezing, with you being able to use Christmas magic powered by syrupy spaghetti to freeze puddles into ice, however I did <em>not </em>have enough time to implement this. This would have been after the simple +1 text effect pop-up and I couldn't even get to that. But even without that freezing mechanic you can't deny that the game is about a snowman on snow and ice, escaping from the rising temperature to stay with the freezing temperature.</p>\n<p>The game centers around random lost gifts and presents that you need to bust open to find a tool to help you get in a restaurant so you can take shelter in their walk-in freezer.</p>\n<p>You are a sentient snowman brought to life by Christmas magic and spirit.</p>\n<p>The spaghetti with syrup, graham crackers, and candy that's in most every present box is a pretty obvious reference to Will Ferrell's Christmas classic <em>Elf</em>.</p>\r\nThe Optional Mini Jam Theme was:\r\n<ul><li>New Years ✔️</li></ul>\n<p>And the mandatory Mini Jam limitation was:</p>\n<ul><li>You may only use 3 inputs ✔️</li></ul>\n<p>The game is set on New Years Eve, with New Years marking the loss of the Christmas magic that brought snow to California and you to life.</p>\n<p>And the game only uses the inputs Up/Left/Right. I do use multiple alternatives to these inputs, so WASD and ZQSD work just as well for accessibility, which I'm pretty sure is normal and to be expected. W versus Z versus the Up Arrow behave exactly the same and likely each player will only realize one of these input sets anyway: whichever one they try first. I also have some standard commands to close the game with Escape, toggle fullscreen with F11, and restart the game with R, but these are not \"game\" inputs, they're more application commands, and I believe they're also expected and standard. They don't affect gameplay at all (the game will restart without the R key), and Escape and F11 don't even work on the web browser version that everyone will be playing anyway, so I highly doubt players will even know they're there. They're honestly more just for me to test the game.</p>\r\nThe Weekly Game Jam 129 Theme was:\r\n<ul><li>Lost in Space ❌</li></ul>\n<p>I don't adhere to this theme at all. I designed the game on-paper before this theme was announced, and it's very optional.</p>\r\nHow It Works\r\n<p><em>Sunny New Year</em> is semi-procedurally generated from a list of hand-made room building blocks. These little map chunks are 8x8 pixel image files, which are read pixel-by-pixel for their RGB values, which are then converted into simple objects in the room (ice, snow, puddle, wall, gift, or door) via a hard-coded lookup table. I did this so that I could make the levels as part of the 3 Hours of Art, instead of using up mu 3 Hours of Programming time.</p>\n<p>This is a <em>very </em>quick, basic, and easy implementation, and does not take into account the player's gameplay state to self-balance or improve the experience, like with an AI Director. It just selects a new map chunk to lay down at complete random (so the same map chunk could be laid down over and over and over again in succession with bad luck) one-at-a-time. It has a 50-50 chance of being flipped horizontally to make them a bit more unique, and there's a 1% chance for each tile to not be spawned for some additional randomness. Gifts also have like a 2/3 chance of not being spawned, I believe.</p>\n<p>So as a player you're trudging forward managing your snowman health, making sure you don't fall too far behind and have plenty of space between you and the sunlight, breaking boxes until you find what you're looking for (spoiler: a brick) and then search for another door to break open to win.</p>\n<p>For more information on my development process, see my design document here! I usually fully design my game jam games on-paper before starting any true work, and the development is just chasing this concept, usually getting close but missing a few features I didn't have time for (or sometimes a lot). This is even more true for TriJam.</p>\n\r\nAssets\r\n<p>I made all the assets for this game during the jam time! For the Mega TriJam pre-made assets were highly discouraged, what with the 3 hours for art, 3 hours for music, and 3 separate hours for programming.</p>\r\nKnown Bugs\r\n<ul><li>If you beat the game, then press R to restart the game, the outro music will not be stopped, so the outro and intro music will overlap and play simultaneously</li></ul>", "metacritic": null, "released": "2019-12-29", "tba": false, "updated": "2019-12-30T02:18:33", "background_image": "https://media.rawg.io/media/screenshots/4b7/4b78ddd853cf76a58e67c9bc6ce207f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Gunnar Clovis"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}