{"id": 401604, "slug": "the-golden-bow", "name": "The Golden Bow", "name_original": "The Golden Bow", "description": "<p>I'm Lucas, a 23 year old solo developer. I started developing the golden bow as a joke, to learn how to create games, in august 2018. But I grew so fond of the game that I decided to make it a real thing, and have been working hard on it ever since! I currently work on the game on my time off, and since I'm a medicine student, I barely have it. That means I often sacrifice my health and sleep routine to bring the best content for you guys. SO PAY ME! Just kidding, I'm not doing this for money. It's for love, really. Heck, I don't even know if I'll put a price tag on the final product. It really depends on how satisfied I'm with it. My dream is that some day I'll be able to make a living making games, create my own studio and bring joy and creativity to videogames once more. The happiest day of my life will probably be when I'm able to afford a living without having to use my medicine's degree. I hate it.</p>\n<p>The game is going to be released for PC. I plan to release it in 2020. I would love to make a console port, but first I must release it for PC. Then I'll see. Hopes are high though!</p>\n<p>Keep and eye out here for updates! Follow me in social medias:<br/></p>\n<p>Twitter: https://twitter.com/TheGoldenBow2<br/></p>\n<p>Instagram: https://www.instagram.com/thegbow.l/</p>\n<p>I'm always open to chat and share my experience with anyone who's willing to ask.</p>\n<p>That's all for now. </p>", "metacritic": null, "released": "2019-12-28", "tba": false, "updated": "2019-12-30T02:37:49", "background_image": "https://media.rawg.io/media/screenshots/f8f/f8f672e9899e3c5096526bff039c055e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thegbow"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}