{"id": 401664, "slug": "realm-of-the-past-evil", "name": "Realm of the Past Evil", "name_original": "Realm of the Past Evil", "description": "<p>This game can be played on browser or download below the zip for Windows.</p>\n<p><strong>GAMEPLAY</strong><br/></p>\n<p>Realm of the Past Evil is an RPG which gameplay consists in preparing your team on a hub, dungeon exploring and combat.</p>\n<p>The current dungeon is room-based. Each room is randomly connected with each other. To finish the dungeon you will have to travel across these rooms to get to the bottom right one where is the boss. Each room you access will trigger a combat. You can't see which new rooms are connected to the one you are entering until you clear that room.</p>\n<p>The combat is turn-based where each unit occupies a specific tile, and the unit skills are categorized in short range which can only target the first column occupied by an enemy, and long range which can target all tiles. At the same time, these skills target different amount of tiles, from a single tile to multiple ones in a row or column.</p>\n<p>You can access to the management menu both on the hub and on the dungeon to change your squad formation, change their equipment and use healing items.<br/></p>\n<p><strong>STORY</strong>\n</p>\n<p>The demon king was defeated by the heroes. Its army stopped the conquest of the world, allowing a new ray of hope. Nevertheless, there is no trace of these heroes, and the realm of the demon king remains. Due to this uncertainty, the guild coalition has decided to hire mercenaries to enter once more in this realm to uncover the true fate of the heroes and the demon king, with the reward of all the treasures waiting to be found.</p>\n<p><strong>ART</strong><br/></p>\n<p>The art is entirely in pixel-art but the font text, using sprites around 32 bits.</p>\n<p><strong>CONTROLS</strong><br/></p>\n<p>The one control is the left-click of the mouse to interact with the buttons and the tiles to attack in combat, and drag the mouse to change the squad formation in the management menu and to move the camera on the dungeon scene.</p>", "metacritic": null, "released": "2019-12-27", "tba": false, "updated": "2019-12-30T02:50:41", "background_image": "https://media.rawg.io/media/screenshots/882/882d38b4f36248739c5a8daa5e7c44fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Crowsler"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}