{"id": 401713, "slug": "grocery-quest-mini-gb-studio", "name": "Grocery Quest mini (GB Studio)", "name_original": "Grocery Quest mini (GB Studio)", "description": "<p>CONTROLS: Arrow Keys = D-Pad, Z = A button, X = B button, ENTER = Start button<br/>IN CASE YOU GET STUCK: hit 'Enter' to enter the menu screen, then Enter again to back out -- this should reset the position of a specific puzzle-related object.<br/><br/>(NO SOUND because the process of creating or using sound with GB Studio is currently beyond me)<br/><br/><br/><strong>JANE slept in and her girlfriend KAT needs her to get some GROCERIES.<br/><br/>A very normal trip to fetch GROCERIES follows.</strong><br/><br/><br/>Using GB Studio by Chris Maltby, I created this silly little mini prototype game for my wife for Xmas. It takes the default sample project fiels included with GB Studio and edits and adds to them using mostly borrowed and edited assets, as well as a few things I made from scratch. I've tried to remove any possible bugs, but feel free to let me know if you find anything I missed! (there is one detail that will seem like a bug at first but is actually intentional)<br/><br/>This parody project was fun to work with as I had to learn about the physical limitations of what the Game Boy was able to do and display. As per any game made in GB Studio, this can actually be run on actual Game Boy hardware, in theory. So it was nice, as someone who doesn't have much coding experience outside of RenPy, to learn a bit more about the workings and limits of the Game Boy.<br/><br/>I utilized the default sprites and backgrounds included with the program, as well as sprites borrowed from (and in many cases edited a bit from) the following sources:<br/>DeerTears<br/>Jan Schneider's Murder Mansion<br/>Rekkimaru<br/>and a very special sprite I used was created by hamigakimomo<br/><br/>And sprites from the original Game Boy Pokemon games, created by Game Freak and ripped to the Spriter's Resource.</p>\n<p>The main characters are my own characters Jane Fitzpatrick and Katrina Kesuk from my story <em>What We Learned at Rokudai, </em>and you can find more art of them here. The artwork used in the faux GB label is by my wife mollifiable, full version can be found here.<br/><br/><br/></p>", "metacritic": null, "released": "2019-12-27", "tba": false, "updated": "2019-12-30T03:06:16", "background_image": "https://media.rawg.io/media/screenshots/88c/88c2e73d9cd9727a1ad475d107637bb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Destiny-Smasher"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}