{"id": 401847, "slug": "necrophobia", "name": "Necrophobia (itch)", "name_original": "Necrophobia (itch)", "description": "<p>Necrophobia is a top-down shooter game that puts you in a world filled with.. Yep, you guessed it: Zombies!<br/><br/>In Necrophobia, your main goal isn't to survive for as long as you can, unlike traditional zombie survival games. The aim is to get to the highest level possible without dying. Which can be a challenge, considering that the zombies get stronger and stronger with each level you gain.<br/><br/>Features:<br/><br/>- Choose from 4 different maps to slaughter zombies.<br/></p>\n<p>- Using 4 different weapons, bring the fight to the undead.</p>\n<p>- Gain XP from killing zombies, and level up.<br/><br/>- Enjoy the challenge that comes from the undead becoming stronger with each level you attain.<br/><br/>- And try to survive for as many levels as you can.</p>\n<p>-Oh, and remember to conserve your ammo!<br/><br/>Supported platforms: Currently Windows, but I am open to adding more platforms.<br/><br/>Game controls:<br/><br/>WASD: Movement<br/><br/>Left mouse button: Shoot<br/><br/>R: Reload<br/><br/>Q and E: Switch weapons<br/><br/>This is my first proper game that isn't, for lack of a better description, a glorified endless runner game. It's not likely to be a perfect game, but I hope to use any feedback to improve this game where and when I can.  Feel free to use the comments section to provide any feedback you can provide.<br/></p>", "metacritic": null, "released": "2020-01-02", "tba": false, "updated": "2020-01-03T01:35:10", "background_image": "https://media.rawg.io/media/screenshots/45a/45a11400c7e3a93d21d452eeaa26cfd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Reece Tarrant"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}