{"id": 402055, "slug": "nullzero-battles", "name": "NullZero battles", "name_original": "NullZero battles", "description": "<p>NullZero Battles is a small game about letting hundreds of AI units fight to the death! Use over 44 different units with their own attacks and powers, every unit is special and thinks independently. Mid range computers can handle about 300-600 Units without any serious frame drops. But this is different for everyone. Choose between 2 Large maps to fight in!</p>\n<p>There are many different kinds of units, divided into many factions! Some of those factions are:</p>\n<ol><li>Knights</li><li>Samurai</li><li>Modern</li><li>Pirates</li><li>Mystical</li><li>Giants</li><li>Vikings</li><li>Sci-Fi</li></ol>\n<p>This Project was made purely for fun, to see if i could make something fun happen. I am not a experienced indie studio, i am currently studying gamdevelopement, i am 3 years into the study and i keep creating these games in my spare time to get better. I really liked this one, so i decided to finally publish a game. Dont expect much, expect some bugs and more. </p>\n<p>Feedback is always greatly appreciated, since it helps me get better.</p>\n<p>Why i set a price to the game? A Decent amount of money actually went into this, mainly the 3D art. And using new funds i will be able to make more games, get better and eventually publish more fun games for you to enjoy!</p>\n<p>So keep in mind that the game isnt perfect, having that said.. Enjoy!!</p>", "metacritic": null, "released": "2019-12-31", "tba": false, "updated": "2020-01-03T02:22:10", "background_image": "https://media.rawg.io/media/screenshots/fee/fee3da902c1c0f4bd793a4c79572cff4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DavidMeijer"], "genres": ["Strategy", "Fighting"], "publishers": [], "esrb_rating": null}