{"id": 402142, "slug": "southern-holler", "name": "Southern Holler", "name_original": "Southern Holler", "description": "In the hills and valleys of Appalachia lie many a hidden holler. These are secret spaces, liminal and oracular. You know in the mountains there is coal, those dark, black diamonds that mean riches and a life of leisure. Hidden in between the dense forests and winding creeks, the fog and spiritualists, the shale and caves, there is hope, future, a hidden and secret valley. But the mountains, southerner, are older than you. And they’re waiting.\r\n\r\n<p>This is the 5.5x8.5 zine edition of Souther Holler: A Trophy Dark Incursion. You can print this out on five pages. It is slightly edited and expanded from the version submitted to the Trophy Incursion Writing Contest. You can download the version submitted to the contest for free. </p>\n<p>This is a ready-to-play zine, and includes the SRD content released by Jesse Ross and Trophy so you can use this as a reference for your incursion and Trophy in general. It includes an expanded character set, old illustrations from the 1800s, monster generator, drives, and rings. </p>\n<p>Southern Holler won the Trophy Dark Incursion Contest in 2019.</p>\n<p>Linda H. Codega is a queer author and RPG writer who lives in between a river and a mountain in New York. They grew up in the tidelands of Virginia, and are always writing, reading, or watching something new.</p>\n<p>Find me on Twitter @_linfinn, online at lindahcodega.com or just email me at lhcodega@gmail.com. I'd love to chat with you. If you find the price a burden, DM me and I'll send this to you for free. </p>", "metacritic": null, "released": "2019-12-31", "tba": false, "updated": "2020-01-03T02:40:51", "background_image": "https://media.rawg.io/media/screenshots/142/142754e469e342d6fb85b1af4551777c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["linda c"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}