{"id": 40214, "slug": "fifa-11", "name": "FIFA 11", "name_original": "FIFA 11", "description": "<p>The game (also known in North America as FIFA Soccer 11) is the 18th title in Electronic Arts&#39; FIFA series of football video games.</p>\n<h3>Highlited new features of the game</h3>\n<p>The &quot;Two Button&quot; control system from the 2010 FIFA World Cup game moved to FIFA 11 now and that is ideal for new players to the series.\u2028\u2028Next Gen Gameplay Engine - the PC version of the game now uses the same game engine as the PlayStation 3 and Xbox 360 versions. </p>\n<h3>Other important PC improvements</h3>\n<p>next-gen menu presentation,<br />\n«Be a pro» seasons have been completely revamped,<br />\na new practice arena,<br />\na new 5 v 5 online team play,<br />\nPro Club Championship,<br />\nall new Virtual Pro game mode,<br />\n360° dribbling is also featured along with LAN play,<br />\nplayers can create their own tactics.</p>\n<h3>Main improvements for PS3 and Xbox 360</h3>\n<p>it is possible now to play as a Goalkeeper (it is done also for PS2, PSP). It is combined with a new Goalkeeper Intelligence (for all Platforms) - more urgency, better perception, new animation technology for realistic positioning of the goalkeeper,<br />\na new passing system, the accuracy of each pass is determined now by the gamer&#39;s own accuracy with the control pad, as well as by the situation and by the players on the pitch skills,<br />\na new web-based application Creation Centre which allows to create material to download to their console and share with their friends.<br />\n&quot;Be a Pro Mode&quot; and &quot;Manager Mode&quot; have been merged into the new «Career Mode» (it is done also for PS2, PSP, NDS),<br />\nthe system of transfer of players has changed significantly - now it includes agreement between clubs, managers, coaches, with transparent rules designed to take into account the opinions of all and reach a balanced solution,<br />\nYou can see the comments from the coach on the player growth screen</p>\n<h3>Main improvement for Wii</h3>\n<p>Players can play five vs. five in the «Street football» mode. The traditional version 11 vs. 11 is also presents.</p>", "metacritic": 84, "released": "2010-09-28", "tba": false, "updated": "2024-03-08T17:03:50", "background_image": "https://media.rawg.io/media/games/91b/91bfbb800ff39bf57f3fb7c3f3bf1f6c.jpg", "website": "http://www.ea.com/intl/football/fifa", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 437, "beaten": 100, "toplay": 2, "dropped": 67, "playing": 1}, "playtime": 0, "achievements_count": 90, "ratings_count": 142, "suggestions_count": 198, "game_series_count": 30, "reviews_count": 142, "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Wii", "Xbox 360"], "developers": ["Electronic Arts Canada"], "genres": ["Sports"], "publishers": ["Electronic Arts"], "esrb_rating": null}