{"id": 402141, "slug": "a-completely-normal-dating-simulation-that-is-defi", "name": "a completely normal dating simulation that is definitely completely sweet, innocent and normal", "name_original": "a completely normal dating simulation that is definitely completely sweet, innocent and normal", "description": "<p>a fun dating sim where you get to date stick figures! that might sound dumb, but trust me when i say that the stick figures in question are, like... the SMEXIEST STICK FIGURES EVER. they also have very good and real personalities, just like real people! so really, it's just like dating an actual stick figure! except through a computer screen! so... i guess.. it's just like having an internet boyfriend and/or girlfriend who refuses to show their real face and just uses the avatar of a stick figure! sounds completely great and not suspicious or sketchy at all! <br/></p>\n<p>anyway, what are you waiting for? play this game, unless of course you don't enjoy the experience of having an internet boyfriend and/or girlfriend who refuses to show their real face and just uses the avatar of a stick figure. in which case, there's really nothing for you here. you can leave now.</p>\n<p><strong>OH BOY IF YOU'RE STILL HERE UH<br/></strong></p>\n<p><strong>THIS GAME MAY BE TERRIFYING FOR PEOPLE WHO ARE SCARED OF DATING AND/OR STICK FIGURES.<br/></strong></p>\n<p>praise for this game that i don't want to say the title of because it's way too long</p>\n<p>this game was very good -anonymous</p>\n<p>nothing strange, weird, odd, abnormal, or out of the ordinary happened while playing this game. -also anonymous</p>\n<p>this game did not murder my family - another anonymous person who may or may not be the same person as the first 2</p><p>it's totally not, uh it's totally, uhhh, it's the highest of quality in a video game- saqib asad<br/></p>\n<p>C R E D I T S !<br/></p>\n<p>Voice of the educated child ------------------------------------------------- Saqib Asad.</p>\n<p>Everything else ---Lux Revell who by the way you should follow on twitter @LuxRevell</p>\n<p>by the way PS when you download the game open the thing with the girl with pink hair and a snake, i don't know how to change the picture.<br/></p>", "metacritic": null, "released": "2019-12-31", "tba": false, "updated": "2020-01-03T02:40:33", "background_image": "https://media.rawg.io/media/screenshots/6b3/6b3029ed22e60539b44363e34d6a90cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["EDUCATED CHILD GAMES"], "genres": [], "publishers": [], "esrb_rating": null}