{"id": 402360, "slug": "terreur-sur-svalbard", "name": "Terreur sur Svalbard", "name_original": "Terreur sur Svalbard", "description": "<p><strong>INTRODUCTION</strong><br/><br/>Ce jeu reprend l'univers et des personnages du <em>Thriller de Noël VX</em>, mais il n'est pas obligatoire d'avoir ce dernier installé pour jouer. Il s'agit vraiment d'un jeu différent, même si j'ai fait la bêtise d'écrire \"add-on\" sur mon écran-titre.<br/><br/><strong>HISTOIRE</strong><br/><br/><em>Après le sauvetage du père Noël, le petit groupe qui avait vécu cette grande aventure se sépara. La famille Noël retourna à Svae et à  son train-train habituel, bien que Rudolf et Noëla, endurcis par leur périple, aient pris l’habitude de se dégourdir en forêt en chassant les lions de glace, ainsi que d’autres animaux féroces à longues dents. L’ange Lyra revint aux cieux, là où était sa place. Quant à Migö, le Yéti, il était désormais débarrassé de son rival de toujours, Nergal le Terrible, et put s’en retourner dans les montagnes de l’archipel, dans les froides cavernes qu’il affectionnait tant.</em><br/><br/>Ainsi aurait pu finir cette belle histoire, et si tel était le cas, nous ne prendrions pas la peine de vous conter ceci. Mais la paix, la sécurité, la joie… ne durent qu’un temps. Ils sont éphémères, fragiles. Bientôt, la faune, la flore, la vie et la substance même de l’archipel seraient soumises à un terrible danger. Car Celui-Qui-Dort s’agite dans son sommeil, il Cauchemarde, et de ses rêves surgissent des réalités effrayantes.<br/>Lorsque Glaciazion, la maîtresse de cimes neigeuses, vient informer Migö des horreurs qui ont surgit sur les flancs de Svalbard, l’héroïque Yéti sait qu’il n’a qu’une chose à faire : ressortir de sa torpeur et de son ennui, et retourner fracasser les crânes des Cauchemars pour se frayer une route jusqu’à l’antre de Celui-Qui-Dort. Une fois sur place, qui sait, deux petites baffes, et l’entité endormie passera peut-être de son agitation mortelle à un rêve joyeux ?<br/>Ou peut-être pas.<br/><br/><strong>PERSONNAGES</strong><br/><br/><br/><strong>Migö le yéti</strong> est le héros de cette aventure. C'est l'unique personnage que vous contrôlerez du début à la fin.<br/><br/><br/><strong>Glaciazion, maîtresse des Cimes</strong>. Elle a remarqué l'activité anormale sur les flancs du Sommet des Rêves. Mais elle va bien sûr aller trouver Migö pour qu'il fasse lui-même le sale boulot!<br/><br/><br/><strong>Le Marchand</strong> est un rat-ninja mystérieux qui va vous extorquer de précieuses pièces d'or contre des goodies pourris à collectionner!<br/><br/><br/><strong>Les Nuisances</strong> sont trois spectres cauchemardesques supérieurs qui feront office de boss. Ils sont bien plus dangereux que les Cauchemars classiques.<br/><br/><br/><strong>Celui-Qui-Dort</strong> est un mage immortel enfermé dans un stase. Il est si puissant que ses cauchemars prennent forme dans la réalité. C'est pourquoi vous devez à tout prix lui rendre un sommeil paisible!<br/><br/><strong>GAMEPLAY</strong><br/><br/>Le gameplay se résume en trois aspects: exploration / combat / collection.<br/><br/><strong>Exploration :</strong><br/>En mode exploration, les attaques sont désactivées.<br/>*Touches directionnelles =&gt; Se déplacer<br/>*Touche Echap / X / 0 =&gt; Annuler / Retour<br/>*Touche Shift =&gt; Courir<br/>Il existe plusieurs interactions possibles.<br/> Les épées permettent de sauvegarder.<br/> Les Pentacles vous rendent vos vies. Ils ne peuvent être utilisés lors du mode combat.<br/> L'or est la monnaie utilisée dans le jeu. Les ennemis en lâchent une fois vaincus. Chaque bourse ramassée équivaut à 1 Or.<br/> La nourriture est exclusivement lâchée par les ennemis vaincus. Elle est le seul moyen de récupérer des vies au milieu d'un combat. Si vous passez dessus lorsque vous disoposez de toutes vos vies, elle ne disparaîtra pas, et vous serez libres de venir la grignoter plus tard si besoin. Un plat de nourriture rend 1 vie.<br/><br/><strong>Combat :</strong><br/>Le système de Terreur sur Svalbard, pour les affrontements se rapproche d'un A-RPG, d'un Zelda, ou pour citer des jeux amateurs, d'un Survive.<br/> Cet îcone, en haut à droite de votre écran, représente les vies dont vous disposez. Migö en pleine forme dispose de 3 vies. Chaque attaque reçue retire une vie.<br/> Cet îcone apparait en bas à droite de votre écran lorsque des ennemis se trouvent à proximité. Il indique l'activation du \"mode combat\".<br/>En mode combat:<br/>*Touche A =&gt; Flammeglace, une attaque rapide à distance.<br/>*Touche S =&gt; Stalagmite, une attaque de corps à corps.<br/>*Touche Shift =&gt; Fixe la direction, afin d'effectuer des déplacements latéraux.<br/>Lorsque le mode combat est activé, il est impossible de faire autre chose (mis à part activer des interrupteurs), tant qu'il n'est pas terminé. Vous ne pourrez pas non plus quitter le niveau.<br/>Le mode combat est automatiquement désactivé lorsque tous les ennemis du niveau sont vaincus.<br/><br/><strong>Collection :</strong><br/> Des goodies seront à collectionner dans le jeu.<br/>Certains sont à acheter au marchand, tandis que d'autres seront à trouver par vous-même. Le nombre de goodies ramassés aura un impact sur le rang qui vous sera attribué à la fin du jeu (bouuh le copiage honteux sur Falco's Univers chut ok j'ai pas trouvé mieux! xD)</p>\n\n<p>C'est un jeu complet bien sûr, réalisé en une petite semaine.<br/>Il fut créé à l'occasion du concours Homme des Neige organisé par Raymo sur \"feu\" RMVX.bbactif, et du concours de noël 2011 d'E-magination, histoire de faire d'une pierre deux coups!</p>", "metacritic": null, "released": "2019-12-30", "tba": false, "updated": "2020-01-03T03:33:10", "background_image": "https://media.rawg.io/media/screenshots/ef1/ef12865068066d6fe94a79485f0eca36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mystère Nobody"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}