{"id": 402321, "slug": "fluffy-sphera", "name": "Fluffy Sphera", "name_original": "Fluffy Sphera", "description": "<p>\n<br/></p><p>In the process of creating our first game, we created two incomplete games before ‘Fluffy Sphera’, the first was ‘Trapped’ where the player would be trying to rescue his space ship from a space maze and the second was ‘River Run’ which was a remake of the 80s ‘River Raid’, now we have our first full game ‘Fluffy Sphera’.</p>\n<p>‘Fluffy Sphera’ is a hyper casual game where you play as a fluffy bouncing ball, your aim is to reach safety by bouncing over colorful platforms and avoiding falling and escape other objects that try to destroy your fluffy, the game consists of 10 worlds where each world has 10 levels, you will have to finish each world in one shot, if you fall or your fluffy gets destroyed you will have to start the world from the beginning, but don’t worry each level is very short that the whole world can be finished in a couple of minutes which depends mainly on your expertise as a player. At the beginning of each world there are valuable tips that you need to read.</p>\n<p>Just be aware that some of the worlds are tough and would need you to concentrate. Good luck to you and to your fluffy 🙂</p>\n<p>Download directly from Itch , our server for Windows version or click the Play Store link for the Android version, have fun</p>\n<p>https://www.blackbird.games/Downloads/Fluffy_Sphera_win32exe.zip</p>\n<p>https://play.google.com/store/apps/details?id=com.blackbirdgames.fluffysphera<br/></p>", "metacritic": null, "released": "2019-12-30", "tba": false, "updated": "2020-01-03T03:22:40", "background_image": "https://media.rawg.io/media/screenshots/f19/f19d440454cee8163cc2d42d6b6ad710.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Blackbird Games Studio"], "genres": [], "publishers": [], "esrb_rating": null}