{"id": 402519, "slug": "another-day-survivel", "name": "Another Day - Survivel", "name_original": "Another Day - Survivel", "description": "<p>Eschatological and zombie-themed MMOPRG mobile game, here comes it! You are the saviour this world has been waiting for!<br />\nAnother Day is a massively multiplayer online role-playing game. You&#39;ll start as a stranger in a mysterious town. After that, you can experience the ups and downs of the story and make your shelter by yourself. Driving different vehicles and using various guns, you can also enjoy the sense of achievement after killing the final boss via making full use of terrain.</p>\n<p>[Game feature]<br />\nLearn more about him/her!<br />\nThere are many different NPCs in the game. In this ruined world, zombies are everywhere. The NPCs tried hard to survive. Do you want to know more about each NPC and invite them to join your team? Explore their stories!</p>\n<p>A cool battle filled with strategy!<br />\nDo you want to burn the zombie? Then throw out your Molotov.<br />\nWant to take advantage of the terrain to shoot zombies from a higher location? You can collect some wood and build a ladder to realize it.<br />\nYou have a wealth of resources available to reform the environment and win!</p>\n<p>Build a shelter for yourself!<br />\nMake a shelter by yourself, you can design your own house from every single piece of brick and paint to furniture! Everyone will get a unique shelter in the destroyed world!</p>\n<p>Various vehicles and guns!<br />\nA zombie wave is coming?! Use shotgun to defend against them!<br />\nFacing with Reformers with excellent defense ability? Shot their heads with a sniper rifle!<br />\nAIs a zombie close behind me? Let me cut it with a chainsaw!<br />\nEach player can carry 2 weapons at the same time to deal with different situations.</p>", "metacritic": null, "released": "2019-12-31", "tba": false, "updated": "2020-01-05T13:17:20", "background_image": "https://media.rawg.io/media/screenshots/14f/14f7d0f23b850fae80ed483dda88f135.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": [], "genres": ["Action", "Shooter", "RPG"], "publishers": [], "esrb_rating": null}