{"id": 402542, "slug": "remember-a-horror-puzzle-game", "name": "Remember: A Horror Puzzle Game", "name_original": "Remember: A Horror Puzzle Game", "description": "You awake in a cold, damp morgue reeking of death and with no recollection of who you are, where you are, or why you're here.  As you solve puzzles across an increasingly disturbing world, abundant yet disjointed clues will offer insights into those seemingly simple questions.  <br/><br/>Will you Remember?<br/><br/>This horrifying new room escape experience from inDgenious is intended for adult audiences! Immerse yourself in our handcrafted world through our eerily beautiful 3D environments, formidable puzzles, intriguing story, and our expertly-crafted auditory experience! Objectives range from routine hidden object / item finds to interactive puzzles that will challenge you both in mind and manual dexterity. <br/><br/>* This is the FULL version of the game. You get absolutely everything unlocked upfront with NO ads or In App Purchases! *<br/><br/>What are you waiting for? It's OK to be scared.<br/><br/>FEATURES:<br/><br/>+ An intense Horror Room Escape adventure intended for mature audiences!<br/><br/>+ 100+ challenging and interactive puzzles!<br/><br/>+ Intriguing story wrapped in eerily beautiful 3D environments!<br/><br/>+ Expertly crafted sound effects and music!<br/><br/>+ Built-in hint system so you never get stuck! <br/><br/>+ All hints and objectives available in FULL version, LITE version requires unlocking with reward videos or a one-time in app purchase.<br/><br/>IMPORTANT NOTE:  This is our biggest game yet and has a huge amount of high quality, pre-rendered graphics. An additional ~100MB of FREE downloadable content is required to play the entire game.<br/><br/>DETAILS:<br/><br/>See this game and more at: https://www.indgenious.com/<br/><br/>Come talk with us on our page at: https://www.facebook.com/RememberMobileGame<br/><br/>Find us on Twitter at: https://www.twitter.com/indgenious<br/><br/>Or on Instagram: https://www.instagram.com/remember_game/", "metacritic": null, "released": "2019-11-20", "tba": false, "updated": "2020-01-06T01:49:42", "background_image": "https://media.rawg.io/media/screenshots/30a/30a8a19fe2d5a52d4711121f093891bb_CeuStPT.jpg", "website": "https://www.remember-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["David White"], "genres": ["Adventure", "Puzzle"], "publishers": ["David White"], "esrb_rating": "Mature"}