{"id": 402516, "slug": "pico-tanks-multiplayer-mayhem", "name": "Pico Tanks: Multiplayer Mayhem", "name_original": "Pico Tanks: Multiplayer Mayhem", "description": "<p>Pico Tanks is a fast-paced, energetic 3v3 tank brawler with a strong focus on team strategy.<br />\nDesign your own unique tank with thousands of possible gameplay-changing combinations. Group up with your friends and compete in spectacular 3v3 battles across multiple maps and game modes! Communicate with your team and overcome your enemies to claim victory in this team-focused real-time PvP battle arena.</p>\n<p>FIGHT IN CHAOTIC 3V3 GAME MODES</p>\n<p>Brawl in fast-paced action with friends or be matched with other players of a similar rank. Go head-to-head in intense real-time 3v3 battles with multiple modes available:<br />\n● Hold the Flag: Your team needs to capture the flag and hold onto it for the longest before time is up.<br />\n● Fetch the Cargo: One mighty tank in your team must grab the cargo before your opponents do and drag it to your base while the rest of the team defends.<br />\nAttack your enemies, heal your allies, hide in the bushes, herd some sheep! Many more game modes will be added in future updates.</p>\n<p>DESIGN THE ULTIMATE TANK</p>\n<p>Design tanks to suit your style and team’s tactics. You can also swap customizations during battle to your advantage. Get crazy and creative designing your own tanks with oodles of customizations!<br />\n● Satisfying Weapons: Choose a weapon to suit your play-style. Like long range? Perhaps the Sniper Rifle is perfect for you. Prefer short range to get up close and personal? Try the Spud Launcher (it shoots the freshest potatoes).<br />\n● Load Up or Load Light: Choose a tank base with the stats you need to suit your weapon of choice. The more armoured, the more abilities you can carry, or go light to zip through the battlefield.<br />\n● Power Ups: Abilities are where it’s at. Deploy an airstrike to finish an opponent, or throw a repair pack at your friends. These can really decide a game!<br />\n● Personalize Your Look: Your tank deserves only the best in skins and toppers. Customize your tank with some character and expression. Tear up the battlefield with a Pizza skin and Rubber Ducky antenna topper, we won’t judge. Go crazy, show off, look awesome!</p>\n<p>PREPARE FOR MULTIPLAYER MAYHEM</p>\n<p>When the smoke has cleared, meet up with your team and adjust strategies to refine your skills. Upgrade your tanks, climb the scoreboards, and engage in a dynamic community. Unlock skins and toppers as you progress. Collect scrap metal to upgrade your tank bases, weapons and abilities. New features, game modes, maps and items will be added in future updates!</p>\n<p>Download Pico Tanks now for free and we will see you amongst the mayhem!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2020-01-05T13:03:51", "background_image": "https://media.rawg.io/media/screenshots/c4f/c4f7a2939383973a1b2ab34aa2dd1f6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": [], "genres": ["Action", "Arcade"], "publishers": [], "esrb_rating": null}