{"id": 402759, "slug": "launch-codes", "name": "LAUNCH CODES", "name_original": "LAUNCH CODES", "description": "<p>Welcome to the Heptagon, home to our nation's most secretive military super-secrets. By far the most secretive secret stored here is the infamous trio of LAUNCH CODES, which are capable of activating the KILL EVERYBODY MISSILE (which does exactly what you'd think it would do). As an International Tactical Criminal Hacker Investigations Operative (ITCHIO), you've been informed that the USSR (Unbelievably Sneaky Socialist Republic) has infiltrated the top ranks of our country's military with an unbelievably sneaky SPY. They aim to end the SLIGHTLY CHILLY WAR by taking control of the missile. Your job is to attend the Heptagon's weekly FRIDAY PIZZA PARTY and totally ruin the vibe by eliminating the SPY. Our country's fate lies in your hands.<br/></p>\r\nHOW TO PLAY\r\n<p><strong>Detective</strong> - Your goal is to control your character with the WASD keys to figure out who the spy is before they visit all three terminals. In singleplayer, you'll be looking for which AI is acting most suspiciously. In multiplayer, you'll be searching for the other player who will be attempting to blend in with the AIs. Once you think you know who the spy is, press the E button to switch to INTERCEPT MODE. Your identity will be revealed, and you must then chase down and tag the spy. However, if you touch the wrong person, the spy will win.</p>\n<p><strong>Spy (only playable in multiplayer)</strong> - Your goal is to visit all three terminals without getting caught. You must imitate the AIs in the game, trying to mask your identity from the detective. If you can visit all three terminals before time runs out, you win.</p>", "metacritic": null, "released": "2020-01-04", "tba": false, "updated": "2020-01-06T02:34:40", "background_image": "https://media.rawg.io/media/screenshots/b4a/b4a7aa9cfb2eb13363783dc854150634.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dwight Davis"], "genres": [], "publishers": [], "esrb_rating": null}