{"id": 402707, "slug": "10-in-1-game-a-week-bundle", "name": "10 in 1 game-a-week bundle!", "name_original": "10 in 1 game-a-week bundle!", "description": "<p>10 games, each made in a week! Some were a bit of a bust, others were pretty rad.<br/></p>\n<p>These games are simple prototypes, proof of concepts, or unfinished works. This bundle serves as a bit of a time capsule for me, but also for the curious or those who might go on a similar journey!</p>\n\n<p><strong>Week 1</strong> - DRIFTING Through Time<br/>Theme: 10 seconds or less.<br/><br/>Turning your car sideways is<strong> SO COOL</strong> it <strong>FREEZES TIME</strong>! Drift to stop time, get as many laps as you can before time runs out!</p>\n\n<p><strong>Week 2 </strong>- Dog Ownership Simulator<br/>Theme:<strong> </strong>Durational</p>\n<p>Play with your dog! Click and drag to give it a spin, swipe on poos to clean them up!</p>\n<p><strong>Week 3</strong> - Chillin' Bayside<br/>Theme: Melbourne</p>\n<p>A simple little physics toy inspired by summer holidays on the great ocean road. Kinda like playing around in a bath - click and hold the mouse to push stuff around :)</p>\n<p><strong>Week 4</strong> - Paint the Town Red<br/>Theme: Colour</p>\n<p>Bounce around the world and paint as you go, cherry tomato! A game dedicated to a personal friend of mine.</p>\n<p><strong>Week 5</strong> - RONG<br/>Theme: Phsyics</p>\n<p>An inter-dimensional pong remix, RONG has you sticking it out for the highest score! Made in collab. with divlauren!</p>\n<p><strong>Week 6</strong> - ???<br/>Theme: Legedermain</p>\n<p>Originally supposed to be about a magician who had his many hats stolen, this unfinished puzzle platform has never seen the light of day.</p>\n<p><strong>Week 7</strong> - Pineapple Pipeline<br/>Theme: Camerawork</p>\n<p>A simple skateboarding game down an infinite half-pipe. This game was inspired by fish-eye lenses used in skateboarding videos.</p>\n<p><strong>Week 8</strong> - Tandem Toobs<br/>Theme: Gift</p>\n<p>I made this game as a <strong>gift</strong> for my parents. Currently unfinished, but intended to be a co-op platformer, each player controls one half of two cylinders, and has to co-ordinate to move around.</p>\n<p><strong>Week 9</strong> - Beach Bird Volleyball<br/>Theme: Minigame<br/></p>\n\n<p>Beach Bird Volleyball stars buff seagulls using their floppy fists to fight it out in games of volleyball.</p>\n<p><strong>Week 10</strong> - Mouse racing game<br/>Theme: Weird Input</p>\n<p>This game is played by turning your mouse upside down and revving up the mousewheel like a pullback car.</p>\n<p><strong>Week 11</strong> - Spider Playground<br/>Theme: Playground</p>\n<p>Spider playground is a unfinished little sandbox where you can explore a climable(ish) playground as a tiny spider.<br/></p>\n<p>You may notice that some of these projects are already available for free on my page. That is no mistake! This package will have all my games <strong>as they were completed</strong> when I was working through my game-a-week journey. The games I've chosen to upload separately might receive updates in the future, and some already have. <br/></p>\n\n<p>This bundle is honest record of my successes and failures. I've also decided to charge for this, as truthfully there was a lot of labour put into these projects. If you're not interested in strange and possible broken games, check out my page for finished works. But if you do, I hope they can bring you as much joy as they've brought me :)<br/></p>", "metacritic": null, "released": "2020-01-05", "tba": false, "updated": "2020-01-06T02:24:50", "background_image": "https://media.rawg.io/media/screenshots/006/006611c18510af9221cb5300809a840f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Andrew Karalis"], "genres": [], "publishers": [], "esrb_rating": null}