{"id": 402910, "slug": "op9-the-cold-war-visual-novel", "name": "OP9: The Cold War Visual Novel", "name_original": "OP9: The Cold War Visual Novel", "description": "<p>The story begins on June 25th, 1991. Play as Ami Madison, professional translator and new recruit in a secret organization known only as OP9 (short for Operation 9). When asked to leave your desk job and join six advanced recruits on a dangerous mission into the Soviet Union, will you accept?</p>\n<p><em>OP9</em> is structured like a novel and immersive like a movie. With an extensive soundtrack, captivating art, and many different story routes determined by the player's choices, there's something here for everyone to love. The game includes 8+ hours of play and more if the reader chooses to try different routes.</p>\n<p>Commentary by reviewers who played the game in its beta stages:</p>\n<p><em>\"I genuinely think this is one of the best stories I've ever read ... I'm even tearing up now thinking of it.\"</em><br/></p>\n<p><em>\"[The story] was a very emotional journey for me.\"</em></p>\n<p><em>\"This game made me feel true anxiety, sorrow, and joy.\"</em></p>\n<p><em>\"This game.. oh my God, this game. This is wonderful in so many ways that I can't even describe. It's beautifully written, and even in the most heartbreaking scenes still manages to make me laugh. Text based games are rarely ever able to make me cry, but this one did.\"</em></p>", "metacritic": null, "released": "2020-01-01", "tba": false, "updated": "2020-01-06T03:08:31", "background_image": "https://media.rawg.io/media/screenshots/751/751e7e15c7dfa94ed4dd1863510f0eda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Achromia Games"], "genres": ["Action", "Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}