{"id": 402970, "slug": "project-tussle-overdrive", "name": "Project TUSSLE: Overdrive", "name_original": "Project TUSSLE: Overdrive", "description": "<p><strong>What is Project TUSSLE?</strong></p>\n<p>Project TUSSLE is an in-development open-source fighting engine meant to emulate platform fighting games, such as Super Smash Bros. The game itself is a series of frameworks and editors to allow users to create their own stages, fighters, and modes. TUSSLE is meant to be accessible to non-programmers to quickly make their favorite characters, while still allowing experienced creators to make characters that push the engine to its absolute limit.</p>\n<p>As the game goes further in development, and the player base grows, TUSSLE will become more than just an engine, it will serve as a community hub of creative works, to build a game where anything can happen. Future endeavors include an online module repository, a community-driven character rating and balancing system, and tournament support.</p>\n<p><strong>Features</strong></p>\n<p>- Simple tools for building any character you can imagine! Take sprites from video game classics or draw up your own, then get to creating!</p>\n<p>- Customize your game however you see fit, the entire physics engine is at your control! Enable wavedashing, change shield stun, tweak gravity, then save and share your presets with others!</p>\n<p>- Use your own collection of music in-game, with options to adjust song frequency, and even set up playlists instead of loops for stages or game sessions!</p>\n<p>- Fully Compatible with any input device your computer recognizes as an input device!</p>\n<p>- And to top it all off, TUSSLE is, and will always be, FREE!</p>\n<p><strong>Media</strong></p>\n<p>Discord - https://projecttussle.com/discord</p>\n<p>Subreddit - https://www.reddit.com/r/ProjectTUSSLE/</p>\n<p>Weekly Blog Posts - http://projecttussle.com/</p>\n<p>Twitter - https://twitter.com/TUSSLEdev</p>\n<p>Youtube - https://www.youtube.com/channel/UC416SW5rkbsc6zuJc...</p>\n<p>The fastest way to report bugs or contact the dev team is to post on our Discord. We are always accepting contributions and team members, send me a message and let me know what you want to contribute.</p>\n<p><strong>Project TUSSLE: Your Game, Your Fight, Your Rules.</strong></p>", "metacritic": null, "released": "2020-01-03", "tba": false, "updated": "2020-01-06T03:21:13", "background_image": "https://media.rawg.io/media/screenshots/c6f/c6fc8c459cd73526f6502876ffe92b03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["digiholic"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}