{"id": 403, "slug": "the-onion-knights", "name": "THE ONION KNIGHTS", "name_original": "THE ONION KNIGHTS", "description": "The Onion Knights is a <strong>tower defense</strong> game with adorable fantasy characters, creating addictive gameplay thanks to its strategy and RPG elements. To defend their castle against the evil forces of the Curry Kingdom players receive support from three knights with their unique abilities. Special items and hiring ruthless heroes become a necessity with growing difficulty and level progression. Players can choose from normal to hard difficulty and compete in the special Extreme Mode against constant waves of enemies to gain exclusive rewards.  <br/><br/><br/><strong>KEY FEATURES OF THE DEFINITIVE EDITION</strong><br/><ul><li>Three Onion Knights: Use their special skills to fend off endless hordes of enemies<br/></li><li>Hire heroes: Profit from exclusive abilities <br/></li><li>Easy controls: Quick to learn and addictive gameplay fit everyone’s needs<br/></li><li>Deep strategy: Rising difficulty with game progress, making the strategic use and upgrade of items a necessity to succeed<br/></li><li>Upgrade system: Level up the abilities of your knights, your canon and mana pool as well as upgrade your heroes<br/></li><li>Big variety: 16 battlefields and 160 stages with easy and hard mode to choose from<br/></li><li>Extreme mode: Compete in an endless mode and receive special rewards every 10th wave<br/></li><li>Improved graphics with Full HD resolution<br/></li><li>The full content with no ingame purchases</li></ul>", "metacritic": null, "released": "2015-11-02", "tba": false, "updated": "2019-10-22T14:37:30", "background_image": "https://media.rawg.io/media/screenshots/baa/baa12818496f5ce838e7a89d62c95812.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 14, "ratings_count": 1, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC", "iOS"], "developers": ["THEM Corp", "them"], "genres": ["Action", "Strategy", "Arcade", "Casual"], "publishers": ["Insel Games", "THEM", "themcorporation"], "esrb_rating": null}