{"id": 403229, "slug": "jibaro", "name": "Jíbaro", "name_original": "Jíbaro", "description": "<p><strong>Jíbaro [pronounced \"HEE-bah-ro\"] is the word used in Puerto Rico to refer to the countryside people who farm the land in a traditional way. The Jíbaro is a self-subsistence farmer, and an iconic reflection of the Puerto Rican people.<br/></strong></p>\n<p>Jíbaro is a micro-management RTS game set in the mountains of Puerto Rico in the early 1500s. A poor farmer with only his guitar, you are toiling away at the Earth in hopes of surviving and raising your animals. Life is difficult and at times you will be given the choice to sell your livestock or eat them to stay alive.</p>\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p><strong>How to play: </strong><br/></p>\n<p>- You can select each animal to control with your left mouse button, when they are highlighted you can right click anywhere on the screen to move that animal to that location.</p>\n<p>- You can hold down the left mouse button and drag to group up animals.</p>\n<p>- B is your buy menu, you can use it to purchase animals with your money.</p>\n<p>-Space bar will prompt the Jíbaro to play a random mix of 3 songs. </p>\n<p>-Hyenas will occasionally attack your flock, you can easily shoo them away with the mouse cursor.</p>\n\n<p>Animals will age and grow from calf to cow, pig to piglet, chick to chicken. They need to be tended to with food and water or they will die. Chicks need to be in the hen house(red), pigs(pink) need the pig pen, and cows need grass to graze(green). The water source nearby will make your animals less thirsty.<br/></p>\n<p>---------------------------------------------------------------------------------------------------------</p>\n<p>Theme: <strong>Dying Is Awarded<br/></strong></p>\n<p>In the late 1960s, two Spanish guitarists formed a duo to make music in the vibrant hills of Puerto Rico. They had become known on the island for their music and especially for their technique in strumming the guitar with a shot glass in the bars of the island. During this time time there was a great political distress in Puerto Rico but these two artists still had the will to create and make meaningful music.  The songs featured in this game are sung by Tonín Ortiz and the guitarist is my grandfather, Efrain Santiago. <br/></p>\n<p>Although my grandfather passed away in 1994, his name and his music will continue to live on in my creations to be presented to an audience worldwide. <br/></p>\n\n<p>Created by:</p>\n<p>Johnny Wu (Artist)<br/></p>\n<p>Marlon Gonzalez (Programmer)<br/><br/></p>", "metacritic": null, "released": "2020-01-09", "tba": false, "updated": "2020-01-10T02:44:54", "background_image": "https://media.rawg.io/media/screenshots/f53/f537cfacda64514a03fb45e550b90ce5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["newworldcircuit"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}