{"id": 403255, "slug": "sortition", "name": "Sortition", "name_original": "Sortition", "description": "<p>(Promo pic from left to right: Erik, Jack, Lexi, Alex, Zach and Kieran)</p>\n<p><em>If you could give up something that makes you who you are, would you?</em></p>\n<p><em>It could be your wealth.</em></p>\n<p><em>Your honesty.</em></p>\n<p><em>Your intelligence.</em></p>\n<p><em>Another’s existence.</em></p>\n<p><em>As long as you consider that something to be the most important in your life, that is enough to be the price you must pay. For a second chance at life.</em></p>\n\n<p>Sometimes, people feel their death is unfair, that it isn’t their time to die. That there's something they still want to do in life.<br/></p>\n<p>Those people are the ones who are noticed by beings called Fate Changers, who watch over the world - beings who will give them a second chance.</p>\n<p>But it will cost them. They can choose to take that chance and continue living their life as if their death never happened. Or...they can attempt to get back the price they paid to manipulate fate: by becoming a Defier and playing a game called Sortition.</p>\n<p>This isn’t a grand tale about people trying to save the world. Nor is it about a great villain who will destroy it.</p>\n<p>This is a story about one girl. A young lady named Alexandria Garnett who became a Defier and decided to participate in Sortition. Her most important person has forgotten her. She lives in a world where they will never be together. For this reason, she decides to fight to take back what she has lost.</p>\n<p>- In Game Phone System with the following apps: Contacts, Message, Notebuddy and Sortition<br/>- Map exploration<br/>- RPG-inspired elements such as an inventory system and ability to accept/complete tasks<br/>- 4 Routes planned with multiple endings for each</p><p>These are the main characters that will be introduced in the demo.</p>\n<p><strong>Alexandria Garnett (Lexi)</strong><br/>Age: 23<br/>Description: A young lady who’s still a bit naive about the world. She lived her whole life going along with the flow and not really thinking of what she truly wanted. After college, she spent her days working odd jobs ranging from museum guard, dog walker and waitress.<br/>She might not have a lot of money but she still tries her best to save enough every month to pay her rent on time.<br/>Perhaps things were starting to look better for Lexi when a young man who’s the son of the CEO for a big company fell in love with her. She found herself in an entirely different world and didn’t have to worry about money.<br/>They went on dates to extremely fancy places, she had many experiences that she never would’ve had with her current income.<br/>However, perhaps fate was cruel, on the way from one of those fancy dates she finds herself a bit too close to death’s door. She makes a deal to come back to life in exchange for something important...</p>\n<p><strong>Erik Raines</strong><br/>Age: ??<br/>Lexi's description: Who is this guy?? I met him as I was dying and he was somehow able to bring me back to life. He said he's not human and calls himself a Fate Changer. Even though he definitely sketchy, he doesn't seem like a bad person.</p>\n<p><strong>Alexander (Alex) Lloyd</strong><br/>Age: 21<br/>Lexi's description: Talk about bad first impressions! Was he intentionally trying to get on my bad side? I feel like he was! I hope not all players in this game are like him. I'm trying to convince myself maybe he just had a bad day. </p>\n<p><strong>Kieran Aurelius</strong><br/>Age: 26<br/>Lexi's description:  A mysterious man who wants to be allies with me. What is he planning? I can't help but feel suspicious of him. It must be the gas mask. </p>\n<p><strong>Zachary (Zach) Vincere</strong><br/>Age: 17/18<br/>Lexi's description: He's some kid that Kieran has told me to take care of. I'm not sure how I feel being the 'illegal' guardian to someone I barely know. The money was too enticing and I don't think Kieran would've taken no for an answer...</p>\n<p><strong>Jackson (Jack) Sinclair</strong><br/>Age: 27<br/>Lexi's description: I would call guys like him a womanizer or player. He's the type of person who would hit on every female in a club then take them home or...worst, to some love hotel!</p>\n\n\n<p>Hey all, Dragonaqua here. \\o/ This is a visual novel I've been working on with a friend of mine. And finally decided it was time to get something out there to the public. My friend AZhang did the majority of the GUI designs/menu and phone screens that are in the screenshots. (Currently she doesn't have much of a social media presence so will update once she gives me something). I'm the writer, programmer, artist, etc, etc. I've decided to release this demo mainly to get some feedback on her UI work as well as the story so far. </p>\n<p>Some other details below on the game:</p>\n<p>Price: Completely Free!<br/>Most of the resources and assets I'll be using are non-commercial anyways.</p>\n<p><strong>Credits:</strong><br/></p>\n<p>Thank you <strong>teuthowenia</strong> so much for being my editor and giving super helpful feedback!</p>\n<p>Resource Credits:</p>\n<p>Characters created by me in MMD </p>\n<p>Backgrounds, Music, Sound Effects will be free resources with some backgrounds from MMD as well</p>\n<p>MMD credits:</p>\n<ul><li>Male character’s clothes: ＥＳ(嘆きの舞Ｐ）</li><li>Darin’s Clothes: <ul><li>Modelled by Seo-MMD</li><li>Designed by @SEXPOTDESIGNER</li></ul></li><li>kieran’s galaxy bottle necklace <ul><li>Reseliee from Devianart</li></ul></li><li>male hair from Kijiko, <em>Converted by IamMaemi/BuriedSillence</em></li><li>Female MC hair:<ul><li>Tda</li><li>ragexyz &amp; Illuison</li></ul></li></ul>\n<p>Backgrounds:</p>\n<ul><li>Uncle Mugen from Lemmasoft</li><li>http://www.aquamary.com</li><li>http://doga.jp/~kama/L3BackPic/</li><li>Texture pack used from  Sirius-sdz on Devianart</li></ul>\n<p>Sfx:</p>\n<ul><li>http://www.manitoux.net/ruta/sozai/effect.html</li><li>http://soundbible.com</li><li>https://soundimage.org/sfx-urban-ambience/</li><li>http://wingless-seraph.net/material-music.html</li><li>http://maoudamashii.jokersounds.com/</li></ul>\n<p>BGM:</p>\n<ul><li>https://soundimage.org</li><li>http://ccmixter.org<ul><li>Doxent - passing</li><li>Nigid - flower of the loved</li><li>Nigid - the second idea</li><li>Widian - Memories</li><li>Super sigil - Blind answer</li><li>Zikweb - Not too quiet</li><li>Lancefield - Infinite Sorrows</li><li>Lancefield - A Moment</li><li>Pitx - A Reason To Smile </li><li>Leeroy -Someplace</li><li>Skill_Borrower-  Kind of Unreal </li><li>Robbero - Whisper </li><li>Xytum - Synthesis </li><li>Eric Matyas - Street_Chaos </li><li>Eric Matyas - Slick Streets Looping</li><li>Kirkoid - Mood Swing</li><li>Deeplastik - The Edge (deeplastik secret remix)</li></ul></li></ul>\n<p>\n</p>\n<p><strong>Post Demo Questions:</strong>\n</p>\n<p>Finally, some questions if you have some time after playing the demo and wouldn't mind giving us some feedback.</p>\n<ol><li>How easy was it to maneuver around? (save, load, move around the cellphone, etc)?</li><li>Were there visuals that negatively impacted your gaming experience? (ex: too bright/dark, big/small font size, etc)</li><li>Did you enjoy the demo overall? Why or why not?</li><li>Is there anything you disliked?</li><li>Any recommendations or critique for a better gaming experience?  Any points in the plot you feel could be better/seem confusing or lacking?</li></ol>\n<p>Thanks for reading!</p>", "metacritic": null, "released": "2020-01-09", "tba": false, "updated": "2020-01-10T02:52:51", "background_image": "https://media.rawg.io/media/screenshots/751/75186cff78a9775f9f4d3b60499af5ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Dragonaqua"], "genres": [], "publishers": [], "esrb_rating": null}