{"id": 403361, "slug": "break-it-itch", "name": "Break It! (itch)", "name_original": "Break It! (itch)", "description": "Break It!\r\n<p>Upgrade your engine, unlock powerful skills and shatter waves of red shapes before they destroy you! <em>Break It!</em> is a game with <strong>cool sounds</strong>, <strong>explosions</strong> and<strong> enjoyable visual effects</strong>!</p>\n<p>A game fully made by <em>Colombage En PLS</em> with Construct 2.<br/></p>\n<p>This version is still under development. The full version of the game should be released before the end of the year (2019) at colombage.itch.io.</p>\n<p>Your feedbacks are welcome! Enjoy the game!~</p>\r\n-INSTRUCTIONS-\r\n<ul><li>Arrow keys or ZQSD / WASD : Move (can be set in the options)</li><li>Mouse : Pick up bonuses </li><li>Left click : Use Special skill </li><li>Right click : Skill switch </li><li>P : Pause / Resume</li></ul>\r\n-HOW TO PLAY-\r\n<p> <br/></p>\n<p>This is you. <br/></p>\n\n<p>Red shapes are enemies. Destroy them. You loose energy when they hit or bypass you.<br/></p>\n\n<p>This is what you're fighting with. Make it collide with red shapes.</p>\n<p>When you hit the ball, it gains power and speed. When the ball collides with something, it loses durability. Once the ball has collided too much, it is destroyed and replaced by a new one.</p>\n<br/>You can upgrade your vehicle and unlock skills by clicking this icon.\r\nENGINE\r\n<p>Upgrading your engine allows you to go and shoot faster, slow down enemies, and unlock speed-based skills.</p>\r\nGENERATOR\r\n<p>Upgrading your generator allows you to increase your energy (used by your active skills, like mana points), your critical hit odds, and the amount of bonuses drops.  Upgrade it to enhance your skills and unlock technique-based skills.<br/></p>\r\nSHELL\r\n<p>Upgrading your shell allows you to hit harder, push your foes back and boost your durability (it's like your HP). It is sheer power. Upgrade it to unlock power-based skills.<br/></p>", "metacritic": null, "released": "2020-01-08", "tba": false, "updated": "2020-01-10T03:18:10", "background_image": "https://media.rawg.io/media/screenshots/7da/7daeb4c1e7c81fd32fcd9eaacf8f62bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Colombage En PLS"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}