{"id": 403336, "slug": "yeet", "name": "YEET", "name_original": "YEET", "description": "What is YEET?\r\n<p>YEET is a volatile &amp; surreal multiplayer-experience to be played with 2-4 players! Inspired by titles by titles of frantic local-multiplayer action, YEET aims to deliver competitive rapid-fire gameplay with a casually chaotic twist. Featuring controls so slippery that they'll make you want to yeet your friends controller out of the window, YEET is an ordeal to be remembered!<br/></p>\n<p>YEET was a passion project developed by an amateur 4-person-team over the course of 5 months. The first iteration of YEET was developed during a 72-hour game jam, which produced a prototype so fun that the team involved unanimously agreed to continue on YEET to get it into a state worthy of public release. Thus, after working for on YEET for almost half a year, the team is extremely proud of what we have made together and the team feels that YEET is in a good enough state to be released and enjoyed by the public!<br/></p>\r\nTechnical Information\r\n<ul><li><strong>To play YEET you are required to own 2-4 compatible gamepads.</strong></li><li>YEET is currently only available on Windows.</li><li>Due to the fact that YEET's controller support is powered by Rewired, YEET supports an extremely wide range of gamepads that can be mixed and matched to one's desire.</li><li>Even if your obscure gamepad is not mentioned in the list, it is still extremely likely that Rewired will support it none the less.</li><li>It is inadvisable to disconnect/reconnect gamepads during active gameplay (ie. when rounds are taking place), as logic handling these issues has not been implemented into that part of the game. Controllers are safe to be messed around with in the main menu and player select screen.</li></ul>\r\nCredits\r\n<p><strong>Project Lead, Programmer, Designer &amp; Voice Actor: </strong>Esko Evtyukov<br/></p>\n<p><strong>Artist &amp; Animator: </strong>Milena Kampen</p>\n<p><strong>SFX Artist &amp; Composer: </strong>Teemu Pietilä</p>\n<p><strong>Assistant Designer &amp; QA-tester: </strong>Ilmari Hirvonen</p>", "metacritic": null, "released": "2020-01-08", "tba": false, "updated": "2020-01-10T03:12:11", "background_image": "https://media.rawg.io/media/screenshots/63d/63d20f8c7d53f2b72fde2a4ecccf47f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cepukka", "sugarpotato"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}