{"id": 403612, "slug": "cosby-simulator-2020-prototype", "name": "Cosby Simulator 2020 (Prototype)", "name_original": "Cosby Simulator 2020 (Prototype)", "description": "<p><strong>William Henry Cosby Jr.</strong> (/ˈkɒzbi/; born July 12, 1937) is an American stand-up comedian, actor, musician, author, and convicted sex offender. Cosby began his career as a stand-up comic at the hungry i in San Francisco during the 1960s. He then landed a starring role in the television show <em>I Spy</em>, followed by his own sitcom <em>The Bill Cosby Show</em>, which ran for two seasons from 1969 to 1971. In 1972, using the Fat Albert character developed during his stand-up routines, Cosby created, produced, and hosted the animated comedy television series <em>Fat Albert and the Cosby Kids</em> which ran until 1985, centering on a group of young friends growing up in an urban area. Throughout the 1970s, Cosby starred in about half a dozen films, and occasionally returned to film later in his career. In 1976, he earned his Doctor of Education from the University of Massachusetts Amherst. His dissertation discussed the use of <em>Fat Albert and the Cosby Kids</em> as a teaching tool in elementary schools.</p>\n<p>Beginning in the 1980s, Cosby produced and starred in the television sitcom <em>The Cosby Show</em>, which aired from 1984 to 1992 and was rated as the number one show in America for 1985 through 1989. The sitcom highlighted the experiences and growth of an affluent African-American family. Cosby produced the spin-off sitcom <em>A Different World</em>, which aired from 1987 to 1993. He also starred in <em>The Cosby Mysteries</em> from 1994 to 1995 and in the sitcom <em>Cosby</em> from 1996 to 2000, and hosted <em>Kids Say the Darndest Things</em> from 1998 to 2000.</p>\n<p>Cosby's reputation was tarnished during the mid-2010s when numerous women made sexual assault accusations against him, the earliest dating back decades. More than 60 women have accused him of either attempted sexual assault, rape, drug-facilitated sexual assault, sexual battery, child sexual abuse, or sexual misconduct, all of which he has denied, and the statute of limitations had by the mid-2010s expired in nearly all cases. Cosby was found guilty of three counts of aggravated indecent assault and sentenced to three to ten years in prison in September 2018.</p>", "metacritic": null, "released": "2020-01-06", "tba": false, "updated": "2020-01-10T04:15:50", "background_image": "https://media.rawg.io/media/screenshots/897/897870468953dae3de177c3dc26831d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Golzay"], "genres": [], "publishers": [], "esrb_rating": null}