{"id": 403717, "slug": "necore-tower", "name": "Necore Tower", "name_original": "Necore Tower", "description": "<p>Currently In Pre-Prototype, Necore Tower is a small <em><strong>free</strong></em> \"backstory/advertisement\" game being developed to begin the Necore Series project (https://necoreseries.com).</p>\n<p>In this game you'll be playing as Garlen Hastein, who at this time had only recently become the new King of Necore, a realm still recovering from a disastrous period and its near destruction centuries ago. A new threat has come to the attention of the newly seated King and is one that cannot be ignored, for all the work that has been done thus far to recover from those events, would be for naught if ignored.<br/><br/>You'll start at the base of Necore Tower, where the sacred artifact, The Necoria, has been safely sealed away and guarded for the centuries since the near destruction of Necore. You'll have to fight your way through the horde of monsters and guardians, solve puzzles, complete quests and defeat floor bosses in the tower to reach the top where the final boss will be waiting.<br/><br/>**Disclaimer**<br/>This game is currently in a PRE-PROTOTYPE state, used for the Necore Testing team</p>\n<p>if you'd like to be apart of the testing team and have your feed back heard and implemented you can sign up here: https://necoreseries.com/become-a-tester-today/<br/><br/></p>\n<p>Controls: <br/>WASD to move</p>\n<p>Left Click deducts health (for testing the hp bar)</p>\n<p>If health reaches 0, you will no longer be able to move press ESC to open pause menu to quit or press Alt+F4<br/></p>\n<p>Right Click uses mana AoE ability<br/></p>\n<p>The Option \"Test Scene\" in the main menu will take you to a scene which will not work properly as it was used to test a fix for artefact lines caused by Unity if you enter that scene you will have to press Alt+F4 to end the game.</p>", "metacritic": null, "released": "2020-01-06", "tba": false, "updated": "2020-01-10T04:41:34", "background_image": "https://media.rawg.io/media/screenshots/fa6/fa6627e9de72eb35d372393ad8722fbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SoulessVagabond"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}