{"id": 403813, "slug": "juicy-fruit-drink-maker-free-food-cooking-game", "name": "Juicy Fruit Drink Maker - Free Food Cooking Game", "name_original": "Juicy Fruit Drink Maker - Free Food Cooking Game", "description": "<ul>\n<li>Make healthy organic fruit smoothies from scratch.  </li>\n<li>Choose the ingredients and mix everything together.  </li>\n<li>Decorate the drink, sip and enjoy!<br />\nOh so yummy! And healthy, too! Make your very own organic fruit smoothies from scratch with Juice Drink Maker, a free cooking game that&#39;s filled with delicious drinks you can build and decorate on your own! Choose from a wide variety of yummy fruits, toss them in the blender, pour into a designer glass, decorate and take a sip. It&#39;s so tasty, you&#39;ll want to do it again right away!<br />\nJuice Drink Maker is an amazing way to create healthy fruit smoothies and yummy organic drinks. Start by choosing each ingredient one by one, then toss them in the mixer. Tap the screen to blend everything together, making a smooth and delicious drink right before your eyes! Pour the ingredients into a glass and get ready for the best part: decorations!<br />\nYou can decorate your organic fruit smoothie with all sorts of yummy, healthy drink toppings. Keep it simple or go crazy, it&#39;s all up to you! Making your drink from scratch is two parts creativity, one part fun. Go wild and mix the craziest flavors you can think of. After all, you&#39;re making a healthy treat, so there&#39;s no reason not to have a good time, too! No guilt, just yummy flavors. Don&#39;t forget to share your organic treat with your friends. They&#39;ll be so jealous, they&#39;ll want to take a turn, too!<br />\nFeatures:  </li>\n<li>Create tons of fruit smoothies from scratch.  </li>\n<li>Make healthy, organic drinks on your own.  </li>\n<li>Tons of yummy decoration toppings to choose from.  </li>\n<li>Mix, sip, share and enjoy!<br />\nHow to Play:  </li>\n<li>Pick your smoothie ingredients from the screen.  </li>\n<li>Mix them all in the blender until they turn into a drink.  </li>\n<li>Pour into a glass, add toppings, and take a drink!<br />\nJoin our Facebook Page: https://www.facebook.com/pages/Food-Maker/753597864675941<br />\nFollow us on Twitter: https://twitter.com/FoodMakerGame<br />\nKnow more about Food Maker at our official website: http://www.absoluteappsmedia.com/  </li>\n</ul>\n<hr />\n<p>MORE awesome games available from our partner! Come see here: http://www.cupcakekidsinc.com<br />\nLike them on Facebook for the coolest updates! https://www.facebook.com/pages/Crazy-Kids-Games-Inc/545284352284786<br />\nWant to know whats going on? Come see our partner&#39;s Twitter! https://twitter.com/CupcakeKidsInc</p>", "metacritic": null, "released": "2015-03-23", "tba": false, "updated": "2021-02-20T11:08:39", "background_image": "https://media.rawg.io/media/screenshots/044/0449994652ba8c334ed57f4f464df555.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Food Maker"], "genres": ["Educational"], "publishers": [], "esrb_rating": "Everyone 10+"}