{"id": 403807, "slug": "mob-psycho-100-psychic-battle", "name": "Mob Psycho 100: Psychic Battle", "name_original": "Mob Psycho 100: Psychic Battle", "description": "Reigen, Mob, and Dimple and the delinquent cast of Mob Psycho 100 have arrived in an all-new mobile game! <br/><br/>Explore the world of Seasoning City, battle with a team of delinquents and take on the most challenging villains from the Mob Psycho 100 universe. Play and interact with your favorite moments of the anime with animated cutscenes in crisp 3D graphics. Create your ultimate delinquent team with the entire cast of the Mob Psycho universe and take them into the battle in story events, pvp, and raid battles. <br/><br/>The Ultimate Mob Psycho Experience <br/>- Play through fully animated cutscenes with the original voice over cast to live your favorite movements from the anime<br/>- Defend yourself in 5v5 team building, fast-paced, turn-based battles<br/>- Explore the story and battle at school, abandoned houses, underground tunnels and other classic locations from the show<br/><br/>Become the Best Version of Yourself<br/>- Train, collect, and upgrade Mob Psycho characters to build the strongest troublemaking team. <br/>- Challenge yourself in limited time missions against the strongest delinquents of the Mob Psycho universe<br/>- Characters can unleash their own signature moves in rich 3D graphics<br/><br/><br/><br/>TERMS OF SERVICE:<br/>Please read this Terms of Service Agreement and our Privacy Notice before using our services as they govern the relationship between you and Crunchyroll.<br/> <br/>https://www.crunchyroll.com/games/terms/index.html<br/>https://www.crunchyroll.com/games/privacy/index.html", "metacritic": null, "released": "2020-01-03", "tba": false, "updated": "2020-01-13T01:49:43", "background_image": "https://media.rawg.io/media/screenshots/e86/e86b4f0416c226da2c70843163a6b826_mNoAGML.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crunchyroll Games"], "genres": ["Strategy", "Card"], "publishers": ["Crunchyroll Games"], "esrb_rating": "Teen"}