{"id": 403856, "slug": "puzzle-vr", "name": "Puzzle VR", "name_original": "Puzzle VR", "description": "<p>In Puzzle VR, you can visually train your brain to remember all sorts of patterns!<br/>A 3 by 3 or 4 by 4 grid will appear in front of you and, when you are ready, will briefly display a random - and different every time - pattern for you to memorize. Then, you must recreate the pattern by clicking on each of the tiles!<br/><br/>To play, open the game and look at a level - 3 by 3 or 4 by 4. Pull your trigger to select it. Then, click the Play button on the left. A pattern will flash up to memorize, then disappear. Now, look at and pull the trigger on each of the squares that were shown to you. If you get stuck, use the regenerate button on the right for a new puzzle. When you solve the puzzle, a win screen will pop up and you can regenerate the puzzle to play again and again.<br/><br/>You can easily change the difficulty (if the game is too tricky or you if want more of a challenge) by looking down and pressing the Settings button while in a game. This will bring up a slider that you can click and drag back and forth to adjust the amount of time allotted for you to memorize the pattern.<br/><br/>Look down and click on the home button to return to the main menu and select a level - 3 by 3 or 4 by 4. In the main menu, you can also look down and select the paintbrush to open Theme Settings. This allows you to pick a theme from a list for your game. You can easily change the theme by selecting another one in Theme settings, or return to the default theme by deselecting any theme that was previously selected.<br/><br/>This game requires a Google Cardboard headset and a gyro-enabled smartphone running Android 4.4 or higher.<br/><br/>If you have questions or would like to see other games by PicoPlanet Developing, click here.</p>", "metacritic": null, "released": "2020-01-13", "tba": false, "updated": "2020-01-13T02:07:48", "background_image": "https://media.rawg.io/media/screenshots/488/48879f06a9af56804850f6508d8d160f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PicoPlanetDev"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}