{"id": 403984, "slug": "i-am-dungeon", "name": "I AM DUNGEON", "name_original": "I AM DUNGEON", "description": "Protect the treasure.\r\nKill the hero.\r\n\r\nYou play a DUNGEON , and can spawn different objects into the room. \r\nThere are always THREE objects to choose from (TOP), just CLICK on the <strong>OBJECT </strong>you want to SPAWN and CLICK the TILE you wish to have it. \r\nYou WIN when the HERO DIES (no more hearts).\r\nYou LOSE if the HERO reaches the TREASURE.\r\nObjects\r\n<ul><li><strong>TREASURE:</strong> TO BE PLACED FIRST. IF THE HERO REACHES THIS TILE. YOU LOSE.</li><li><strong>WALL: </strong>CAN BE USED TO DIRECT HERO OR MOBS. LASTS FOR 10 TURNS.</li><li><strong>HOLE:</strong> WHEN THE HERO LANDS ON THIS, HERO LOSES SOME HEALTH AND STARTS FROM THE DUNGEON DOOR. WHEN MOBS LANDS ON THIS, THEY DIE. LASTS FOR 10 TURNS.</li><li><strong>SPIKES:</strong> WHEN THE HERO LANDS ON THIS THEY LOSE HEALTH. MOBS CAN DIE IF THEY WALK ON TOO MANY SPIKES.</li><li><strong>ZOMBIE: </strong>WHEN THE ZOMBIE AND HERO COLLIDE, THERE IS A CHANCE THEY WILL THEY FIGHT. IF ZOMBIE WINS, HERO LOSES HEALTH. IF HERO WINS, ZOMBIE DIES. RESISTANT TO SPIKE DAMAGE.</li><li><strong>GOBLIN:</strong> WHEN THE GOBLIN AND HERO COLLIDE, THERE IS A CHANCE THEY WILL FIGHT. IF GOBLIN WINS, HERO LOSES HEALTH. IF HERO WINS, GOBLIN DIES BUT HERO LOSES HEALTH.</li><li><strong>WARLOCK:</strong> WHEN THE WARLOCK AND HERO COLLIDE, THERE IS A CHANCE THEY WILL THEY FIGHT. IF WARLOCK WINS, HERO LOSES HEALTH. IF HERO WINS, WARLOCK DIES BUT HERO LOSES HEALTH AND ALL POTIONS DISAPPEAR.</li><li><strong>POTION:</strong> WHEN THE HERO LANDS ON A POTION, THE HERO GAINS HEALTH.</li></ul>\n<p>This was made for Mini Jam 45: Dungeons with the limitation: pocket sized. The game's low resolution and is mobile (touchscreen-friendly) so you can carry the dungeon in you pocket (initially was going to be called pocket dungeon, but that didn't say much about the game).</p>\n<p>Thanks,</p>\r\nWebow.\r\n\n<p><strong>Sounds and Music</strong></p>\n<p>Music: \"Professor and the Plant\" by Kevin MacLeod (https://incompetech.com)\r\nLicense: CC BY (http://creativecommons.org/licenses/by/4.0/)</p>\n<p>Sound effects obtained from https://www.zapsplat.com</p>", "metacritic": null, "released": "2020-01-12", "tba": false, "updated": "2020-01-13T02:35:27", "background_image": "https://media.rawg.io/media/screenshots/34c/34c23a23558ff2cbe4a768bc0919381d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Webow"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}