{"id": 404010, "slug": "bounty-seekers", "name": "Bounty Seekers", "name_original": "Bounty Seekers", "description": "<p>This game was maded for Pirate Jam Pre-Jam Skirmish 2020. </p>\n<p>Theme: Bounty</p>\n<p>Game Name: Bounty Seekers</p>\n\n<p>Game instructions\r\n</p>\n<p>Objective:<br/>Get the most Bounty.</p>\n<p>Rules:<br/>- To get Bounty points, you must eliminate the enemy caravan.<br/>- You have two main resources, Army and Arsenal. These resources can be seen from the lower left side of the screen.<br/>- Army represents the number of troops in your group, this amount cannot be increased during the game.<br/>- Arsenal is a resource to equip your army with better weapons, you have an initial amount, but it can increase in game.<br/>- To increase your Arsenal points you must eliminate the enemy units.<br/>- To select from where your units gonna appear, click over a spawn point (gray circle), once is selected gonna chage his color to blue..<br/>- To send troops to the attack, select a card from the bottom. Each card has a unit name, an image, on the left side its value in Army and on the right side its value in Arsenal.<br/>- When selecting a card you can see in the lower right part of the screen, a thorough description of the unit along with its statistics.<br/>- With the buttons located on the lower right side you can send a unit to attack. The upper button is for attacking enemy troops, while the lower button is for attacking the caravan.<br/>- A unit with certain types of targets (Troops or caravan) will attempt to attack only these types of enemies until there are none left. If there is no such enemy left, it will go on to attack another type of enemy.<br/>- The game ends if you destroy the entire enemy caravan or if you lose all your units. However, if you collect more than 60% of the Bounty, you win the game.</p>", "metacritic": null, "released": "2020-01-12", "tba": false, "updated": "2020-01-13T02:41:06", "background_image": "https://media.rawg.io/media/screenshots/807/8079c204a29a594b03b7ecfbd3b76ca0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Gab2891"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}