{"id": 404053, "slug": "empire-of-fire", "name": "Empire of Fire", "name_original": "Empire of Fire", "description": "<p>The Australian federal government's handling of climate change has been truly reprehensible.</p>\n<p>Cutting funding to emergency services and first responders. Doing nothing to reduce emissions, and giving excuses and inaccurate data when asked to do so. Gaslighting the Australian public by pretending they have believed in climate change all along. Forgetting that people have died, and when reminded that they have, telling lies about how you had made such a mistake. Grasping at the hands of the furious people whose homes have been razed. Several Coalition ministers have even gone on record to international audiences, denying climate change and the threat it poses to their constituents.</p>\n<p>All of this was unnecessary and could have been avoided.</p>\n<p>To put it bluntly: when Piers Morgan and Alan Jones are speaking out against our government for being too conservative, you know things are really dire.</p>\n<p>So I donated to the NSW RFS. And I made a satirical game, because that is a healthy way to process my feelings about the bushfire emergency, and my feelings about the miserable leaders who refuse to lead.</p>\n<p>As I am unable to hook up payments to be automatically directed to the RFS or similar agency, I have turned off all payments for this game. Please see the link below if you are feeling charitable and would like to contribute to the emergency services who are fighting an uphill battle:</p>\n<p>https://www.theguardian.com/australia-news/2019/dec/21/how-you-can-donate-and-help-the-volunteer-firefighters-in-australias-bushfire-crisis<br/></p>\n<p>Please donate if you are able.</p>\n<p>Please attend rallies in your local area.</p>\n<p>Please speak up.</p>\n<p>Please do not give up or ignore the criminal negligence that has happened and will continue to happen under this government.</p>", "metacritic": null, "released": "2020-01-12", "tba": false, "updated": "2020-01-13T02:54:07", "background_image": "https://media.rawg.io/media/screenshots/7e6/7e6a303df4ce9cf1d360b82109819d9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["\"Bideo Bames\" Games"], "genres": [], "publishers": [], "esrb_rating": null}