{"id": 404153, "slug": "minesweeper-ezez33", "name": "Minesweeper (ezez33)", "name_original": "Minesweeper (ezez33)", "description": "<p>A recreation of classic Windows Entertainment Pack Minesweeper.  <br/></p><p>Your mission is to uncover all the tiles without mines. Click any tile to start the game. No mine will be in the start tile or around it (these will be moved), and the map will have the exact number of mines shown.</p>\n<p>If a tile has mines around it, it will show the number of mines around (maximum of 8 mines). You can flag the tiles you know to have mine under it, but it is not needed to win a game.<br/></p>\n<p>False flags can be detected near end game if your mine count goes to negative (you have flagged tiles with no mine).<br/></p>\n\n<p><strong>=== CUSTOM MAPS ===</strong></p>\n<p>You can select \"Custom\" mode and set the playfield size and mine count as you wish - maximum size is larger than in the original, and you can create real marathon challenge (120x60 tiles) if you wish so. BTW - empty area open flood fill is not using a recursive algorithm, so there should be no stack overflows to crash a game.</p>\n<p><strong>=== TIMER ====</strong><br/>Digital displays have 4 digits instead of three, so you can record your gameplay with the timer up to 9999 seconds, roughly 170 minutes ;). When a game is won, you will get the playtime with the accuracy of a fraction of a second.<br/></p>\n<p><strong>=== CONTROLS ===</strong></p>\n<p><strong>Menus</strong> - Mouse left click<br/><strong>Open a tile -</strong> Mouse left click<strong><br/>Flag a tile</strong> - Mouse right click<br/><strong>Clear tiles around </strong><strong>(</strong><strong>when correctly flagged)</strong> - Shift + mouse left click</p>\n<p><strong>=== INFO ==== </strong><br/>Programming, design and graphics by Sami S.</p>\n<p>I created this as a learning experience.</p>\n<p>Graphics and Emojis are custom high-resolution vector graphic recreations in style of the original game which I (painstakingly) created in Affinity Designer.</p>\n<p>Feel free to leave comments (just say hi if you feel like it), bug reports and suggestions.<br/></p>", "metacritic": null, "released": "2020-01-11", "tba": false, "updated": "2020-01-13T03:18:24", "background_image": "https://media.rawg.io/media/screenshots/4f7/4f7f4bd11b7468787bb8c2c828d2cad6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ezez33"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}