{"id": 404226, "slug": "bob-the-back-up-guy", "name": "Bob the Back-Up Guy!", "name_original": "Bob the Back-Up Guy!", "description": "<p>Sometimes, even superheroes need backup!  In a world where people finally had enough of the destructive squabbling from both heroes and villains, everyone rose up and tossed them all in special containment cells.  Unfortunately, the bold actions of the general public were not enough to keep the bad guys in jail for long.  Through a combination of bribery, blackmail, and extortion, most of the villains quietly made their way out of jail and resumed their criminal activities on a less overt scale.  The good guys of course took notice and pleaded for their release so that they may capture their “other-halves”.  To their dismay, the superhero fatigued public turned a deaf ear.  Now the frustrated heroes must watch all their hard work crumble before them, completely helpless…almost.\r\n  </p>\n<p>That’s where Bob comes in.  Who is Bob you might ask?  Well, he’s the backup guy of course!  One of a small group of people from around the world that have what it takes to help heroes out of a jam (though they would never admit they needed it).  Not able to make the cut of being a hero himself, Bob has contented himself by being a backup.  Now at long last, he has a chance to prove himself.  He’s not a hero anyone wants, but he’s the one the heroes need!\r\n  </p>\n<p>It will be up to you, the player, to take control of Bob, sneak into the superhero prison, and break them out one at a time.  Bob will need to safely bypass all security measures without using deadly force (you aren’t a villain after all).  And maybe, just maybe if you succeed in your mission, the heroes will remember your name!\r\n</p>", "metacritic": null, "released": "2020-01-11", "tba": false, "updated": "2020-01-13T03:35:46", "background_image": "https://media.rawg.io/media/screenshots/7a5/7a5b78f512a35f50aac5aaaae91bf787.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carattiniw"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}