{"id": 404358, "slug": "ressurflection", "name": "Ressurflection", "name_original": "Ressurflection", "description": "<p><em>At a stage in our lives we all fear the inevitability of death but what if you could cheat such an end through the use of a forlorn mirror?</em></p>\n<p>Horizon Bluff has always annually held its ‘Legend of the Wyvern Glass’ festivities. The Wyvern glass was a long lost mythical mirror, once fabled for its power of ‘Ressurflection’ and coveted by a kingdom now all but gone. That is quick to change however with the arrival of the Roulette Runner’s circus to the coastal city of Horizon Bluff. Trouble is soon to set in motion not just the kingdom’s sudden reappearance but the entrapment of one of their own acrobats within the mirror silver. </p>\n<p>Yet things are soon to worsen...with the spread of a purple ‘corruption’ across the city and the fact that our most unfortunate trouper is far from alone within the mirror, finding himself at the mercy of its ‘Mirror Maiden’. </p>\n<p>The apparent all powerful manipulator of its realm…</p>\n\n<p>Ressurflection is a Fantasy/cartoon RPG set in the fictional universe of the Arbvar and  taking centre stage primarily at the coastal city of ‘Horizon Bluff’. Its story and game play are heavily character driven, with its narrative divided into two parallels told both within and outside the mirror itself. Ressurflection’s core themes draw from our inevitability of fearing death, and that at some point or another, we all must accept it, and to treasure what’s really important in the time that we have.</p>\n\n<ul><li><strong>Original art &amp; graphics </strong>–All of the graphical assets of Ressurflection are completely original and animated in a stylistic cartoon-like appeal with fantastical designed to bring out personality.</li><li><strong>CP Battle system</strong> – Allies all contribute Character points or CP for short. The battle system derives from your ability to manage these points and use your characters carefully during battle!</li><li><strong>Many murders</strong> - An assortment of fun, loving crows flock around this game.</li><li><strong>Characters, lore and lotsa story!</strong> –Character-rich story and soulful interactions abound - many things have a variety of banter and comments by whatever cast you have at hand! We want to ensure the world feels alive and that the characters feel a part of it too!</li><li><strong>Original Soundtrack</strong> – Primarily created by the quirky Geoff Moore along with a few other contributing composers along the way.</li></ul>\n<p>Although Ressurflection is not a horror game in the most traditional of senses, <strong>some parts of the game have elements meant to induce paranoia, fear and tension. Mild swearing and blood is sometimes present. </strong></p>\n<p>A rough demo for the project will be open to the public in the coming months; if you have any feedback or bugs and issues to report please do so on our discord or if you would like to keep up with development;  https://discord.gg/DKGUpYX<br/></p>\n<p>Alternatively the Twitter is at the following; https://twitter.com/charlottezxz</p>", "metacritic": null, "released": "2020-01-10", "tba": false, "updated": "2020-01-13T04:11:03", "background_image": "https://media.rawg.io/media/screenshots/739/73947da2a9a5e11fc876ad40a6941703.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Charlottezxz"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}