{"id": 404346, "slug": "a-fiery-working-title", "name": "A Fiery Working Title!", "name_original": "A Fiery Working Title!", "description": "<p><strong>Play as Flare</strong>, a small fireball that's full of energy! He's wild, a little hot-headed, and likes to fight.</p>\n<p>When he discovers that he's in enemy territory, Flare must retaliate and defeat enemies coming his way! But be wary, these enemies are tough!</p>\n<p>How long will you last?<br/></p>\n<p>Will you prevail?</p>\n<p>*</p>\n<p><strong>Controls:</strong></p>\n<p>- Use the W, A, S, D keys or arrow keys to move</p>\n<p>- Use your mouse to face in a direction</p>\n<p>- Click the mouse (or hold) to shoot a fireball!</p>\n<p>*</p>\n<p><em><strong>Main objective of the game:</strong></em></p>\n<p><em>Try and get the highest score you can by defeating enemies, and surviving as long as possible! Each level has a unique trait to it, but the last level is a boss level with a different prime objective. Defeat King Tempest to canonically win the game!</em></p>\n<p><em>Above all, however, just have fun trying to break your own high score, and when you're confident with the controls, go for the boss fight!</em></p>\n<p>*</p>\n<p><strong>Key features found in the game:</strong>\n</p>\n<p>- There is a high score system that runs universal throughout the game. See which level gets you the highest score!</p>\n<p>- You can run into Grasslings to regain HP, but their projectiles are quick.</p>\n<p>- You take damage from projectiles, but your fireballs can negate other projectiles, levelling the playing field.</p>\n<p>- You take more damage from Aqualings if they touch you, but they, and their projectiles, move slowly.</p>\n<p>- The game has 4 stages, where 3 are unique stages and the last is a Boss level. Each level has its own soundtrack!</p>\n<p>*</p>\n<p>{Currently, only supported on Windows platforms, but I'm trying to get them released on others too!}</p>\n<p>***</p>\n<p><strong>Credits:</strong></p>\n<p>Coded by KJEKJE</p>\n<p>Art and Sprite-work by KJEKJE</p>\n<p>All music by KJEKJE</p>\n<p>SFX made by KJEKJE</p>\n\n<p>Made with Unity</p>\n<p>[Font used in desc. is Kite One]</p>\n\n<p>Special Thanks:</p>\n<p>Family, friends, and lecturers with guidance and direction.</p>\n<p>You know who you are. :)</p>\n<p>***</p>\n<p>~ Thanks for playing! Stay tuned for more! ~</p>", "metacritic": null, "released": "2020-01-10", "tba": false, "updated": "2020-01-13T04:08:10", "background_image": "https://media.rawg.io/media/screenshots/03b/03b3643077ac0ba880bc9e758f762d8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KJEKJE42"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}