{"id": 404537, "slug": "generic-rpg-quest-iii-demo-version", "name": "Generic RPG Quest III (Demo Version)", "name_original": "Generic RPG Quest III (Demo Version)", "description": "<p>Four heroes of light from a far away land are asked by a king to collect the four treasures of the elements, defeat a dark lord, and rescue the princess. Where  have I heard something like that before?</p>\n<p>Yes, Generic RPG Quest III is a classic NES-styled RPG though and though, or it is? As you explore the world and meet new people, strange and mysterious things are revealed. Why are the heroes on their quest? Where did they come from? Why are cutscenes suddenly playing? Why is there now backstory? Is the dark lord really that evil? What is this so called \"cycle\" he speaks of?</p>\n<p>As you may have guessed, this game may seem like a cheap NES RPG ripping off Final Fantasy I or Dragon Quest I, but in reality this game holds many secrets, with multiple endings and diverging paths based on your seemingly insignificant choices. Choose 6 different unique classes to choose from to fight your way though forests, caves, mountains, volcanos, undersea ruins and much more as the four heroes discover a secret conspiracy that may destroy the very fabric of their world...</p>\n<p>Features</p>\n<p>-6 Classes to choose from, each with their own unique strengths and weaknesses.</p>\n<p>-A branching story with multiple endings and secrets. (Branching story only in version 2)</p>\n<p>-Dungeons with unique mechanics</p>\n<p>-An ATB battle system similar to the Final Fantasy games.</p>\n<p>-A customizable skill equip system that allows you to strategically choose what skills you bring into battle. </p>\n<p>-Tons of secret bosses and challenges that will put your skills to the test.</p>\n<p>Note: The current version of the game is not the final product. It is a re-release of version 1 of my game, which I cancelled. However I am planning to fully re-make from the ground up in the future, which you can all look forward to.  Also of note is that Version 1 was never completed. I only made it up to the ice cave dungeon before I ran into various glitches that prevented me from continuing to work on it.  Please understand. Finally, please, I ask that if you see this game posted on a website called rpgmaker.net, DO NOT SUPPORT IT. Please do not support that website by any means as they banned me and many others from that website unfairly for possessing right-wing views during the great RMN purge of December 2019. I hope you understand, and please enjoy this game!</p>", "metacritic": null, "released": "2020-01-17", "tba": false, "updated": "2020-01-17T02:08:17", "background_image": "https://media.rawg.io/media/screenshots/89d/89de9d6da66eaf9f858188f806eec4d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KrimsonKatt Productions"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}