{"id": 404567, "slug": "offside-itch", "name": "Offside (itch)", "name_original": "Offside (itch)", "description": "<p>    Dans les lointaines montagnes enneigées d'Europe du Nord vit Nils, un jeune garçon passionné de football. Petit-fils d'un grand champion, il a reçu en héritage une superbe collection de ballons. Mais Olaf et sa bande de brutes, les Black Tigers, ont tout volé ! Aidé par ses deux amis Icha et Vince, Nils va devoir rattrapper les malfrats et récupérer les ballons au plus vite.<br/></p>\n<p>Mix entre Runner et Combat d'arêne, Offside vous propose d'incarner le jeune garçon à travers 4 niveaux palpitants, où réflexes et agilité seront essentiels pour contrer les plans d'Olaf et récupérer la collection de ballons de foot.<br/><br/>Caractéristiques du jeu :<br/><br/>- Aidez Nils à rattraper Olaf en évitant les obstacles sur son chemin.<br/>- Déjouez les embuscades tendues par les Black Tigers en repoussant les ennemis à coups de tirs acrobatiques.<br/>- Réalisez le meilleur score sur chaque niveau, seul ou en affrontant vos amis.<br/>- Devenez une star de foot de Scandinavie en réalisant les plus beaux dribbles.<br/><br/><br/>Offside création d'objectif 3D et ISTDS Montréal:<br/><br/>Offside est un projet étudiant réalisé par une équipe internationnale. Notre école, objectif 3d - game est spécialisée dans la conception de jeux vidéo et est située à Montpellier ainsi qu'à Angoulême. L'ISTDS Montréal est une école dédiée à la création de contenu sonore pour le jeu vidéo<br/><br/>Notre but ? Faire se rencontrer la passion créative de nos étudiants pour le jeu vidéo et les attentes de recruteurs de l'industrie. Pour assurer une embauche à nos élèves à la fin de leurs études nous utilisons une pédagogie basée sur des savoir faire répondant aux besoins des studios qui recrutent.<br/><br/>Les cours basés, pour l'essentiel, sur des exercices pratiques et sur un investissement personnel reproduisent les conditions de travail des studios de production permettant d'acquérir les savoir faire techniques nécessaires. L'année est ponctuée de projets de groupes pour mettre en application les savoirs acquis, développer l'esprit d'équipe et augmenter ses compétences.</p>", "metacritic": null, "released": "2020-01-16", "tba": false, "updated": "2020-01-17T02:14:51", "background_image": "https://media.rawg.io/media/screenshots/187/1879bb727a6e69ef4b5ceb42583ff91e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Terry Perez Gervais"], "genres": ["Action", "Sports"], "publishers": [], "esrb_rating": null}