{"id": 404526, "slug": "idle-casino-manager", "name": "Idle Casino Manager", "name_original": "Idle Casino Manager", "description": "Rule your casino and become the richest manager!<br/><br/>Are you ready to run a huge gambling establishment?<br/><br/>Start with a small casino and work hard to make your business grow. Add new games to create an exciting experience where visitors can play poker, roulette, blackjack or try their luck at the slot machine.<br/><br/>Manage your cocktail bar and exchange booth wisely to earn money. Expand the Casino with new floors and unlock the most amazing games and machines.<br/><br/>Improve the attractions of your casino with an all-new poker table, a golden roulette ball or new games for the arcade machines. Scale up your parking lot and launch marketing campaigns to get even more visitors to your gambling establishment.<br/><br/>As you slowly become a huge casino tycoon you'll need to hire new employees or raise their salaries as your business grows. The decision where to invest your hard-earned money is all yours. Will you unlock new games first? Or would you like to further improve the ones you already got? There are different ways to achieve glory but which one is the best for your establishment?<br/><br/>If you like management and idle games, you’ll enjoy Idle Casino Manager. Although it's an easy-to-play game it takes all your strategic decisions into account. Invest your money wisely and transform your small business into a huge Las Vegas-like casino!<br/><br/>Features:<br/>► Easy-to-play game for every player<br/>► Take important business decisions.<br/>► Many different games available.<br/>► No internet connection needed. Play offline anywhere, anytime.<br/>► Make important managing decisions to expand your establishment<br/><br/>Become the biggest casino tycoon the world has ever seen!<br/><br/>What are you waiting for? Play now!<br/><br/>Do you have any Ideas, praises or problems?<br/>Just drop us a message: support@coldfiregames.com<br/>Or via Facebook: https://www.facebook.com/IdleCasino<br/>Website: https://coldfiregames.com<br/><br/>Your Idle Casino Manager team", "metacritic": null, "released": "2020-01-16", "tba": false, "updated": "2020-01-17T02:03:45", "background_image": "https://media.rawg.io/media/screenshots/9a1/9a1189794494f223468cfb2fce015fba_NakQAVn.jpg", "website": "https://www.coldfiregames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ColdFire Games"], "genres": ["Strategy", "Simulation"], "publishers": ["ColdFire Games"], "esrb_rating": "Mature"}