{"id": 404522, "slug": "faily-brakes-2-flatout", "name": "Faily Brakes 2 Flatout", "name_original": "Faily Brakes 2 Flatout", "description": "It's Faily Brakes - accelerated to the MAX!<br/><br/>Phil Faily can’t catch a break. This time his car’s accelerator pedal is stuck to the floor and he’s speeding out of control with his vehicle getting faster and faster as he’s trying to maneuver his way through oncoming traffic, hills, tunnels and traffic intersections as well as the police riding on his tail for speeding!<br/><br/>With plenty of hills, thrills and Faily spills, this is the next level Faily Brakes experience the mobile gaming world has been waiting for! <br/><br/>Gameplay Features:<br/><br/>- Vast reimagined Faily World, where Phil and Anita can decide to take different turns, tunnels, caves, fields and more. Choose your own Faily adventure!<br/><br/>- Destructible vehicles – Cars are now able to take some damage without crashing completely. See the doors swing open and the bonnet of the car fly off!<br/><br/>- A huge range of car customizations - Upgrade your car's performance, paint, wheels, antenna, and even your license plate.  <br/><br/>-  Bigger ragdoll crashes - Crashing in the game is still just as much fun as playing! <br/><br/>- Police Car Chases - Evade the cops riding your tail for speeding!<br/><br/>- Race your ghost! Challenge your best run or a direct challenge from a friend!", "metacritic": null, "released": "2019-12-22", "tba": false, "updated": "2020-01-17T02:02:19", "background_image": "https://media.rawg.io/media/screenshots/3be/3bec02fb66ef9ce692e2e1fc95ddb74e.jpg", "website": "https://www.facebook.com/809474989133468", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Spunge Games"], "genres": ["Action", "Sports", "Casual"], "publishers": ["Spunge Games"], "esrb_rating": "Everyone 10+"}