{"id": 404510, "slug": "puzzle-out-puzzles-all-in-one", "name": "Puzzle Out: Puzzles All in One", "name_original": "Puzzle Out: Puzzles All in One", "description": "Show your epic power of puzzle solving!<br/><br/>Get the most addictive puzzle game, unlock all the logic puzzle, train your logical thought.<br/>Keep your brain sharp!<br/><br/>Puzzle Out currently contains:<br/><br/>*Classic Line Connect*<br/><br/>Connect the same color of dot, draw all the lines without crossing each other. All the space on the board should be full filled.<br/><br/>*Hexa Line Connect*<br/><br/>Connect the pairs of colorful dots, fill all the lines in the hexagon frame without empty space.<br/><br/>*Pipe Connect*<br/><br/>Become a sucessful plumber, have to turn pines, create a perfect piping connection between two dots (water-tap).<br/><br/>*Classic Tangram*<br/><br/>The objective of tangram puzzle game (which originally invented in ancient China) is to form specific shape by using all seven pieves, which may not overlap.<br/><br/>*Classic Unblock/block (Rolling Blocks)*<br/><br/>Slide the blocks to create a channel. The goal is to move the red block from start to exit. If you like Klotski puzzle games, unblock games, try this one!<br/><br/>*Classic Unroll the Ball*<br/><br/>Refresh your brain by rolling the ball, move blocks to creat a path, move the ball to the GOAL block. Ready for the challenge?<br/><br/>More puzzle brain teaser games are comming soon!<br/><br/>Puzzle Out Game Features:<br/><br/>*Hundreds of puzzle challenges, more is under development<br/>*Daily Spin, get free coins everyday<br/>*Easy to play, hard to be master<br/>*Simple but lightful graphic<br/>*Free hint<br/>*Unlimited game time<br/><br/>Come to challenge all the puzzle games and build your puzzle kingdom, keep your brain up to date, my loyal fan of classic puzzles.<br/><br/>Download for free, unlock all the amazing brain challenging puzzle games, challenge your knowledge and mind in a single download!<br/><br/>Being a logic puzzle game lover, searching for simple graphic and puzzles unions, we highly recommend Puzzle Out as your new brain teasers game.<br/><br/>We are working on adding new challenging and entertaining puzzle games inside the puzzle kingdom. We are listening all your suggestion at the same time. Tell us your idea without hesitation!", "metacritic": null, "released": "2019-12-06", "tba": false, "updated": "2020-01-17T01:58:07", "background_image": "https://media.rawg.io/media/screenshots/b4d/b4da3dab9abca6f575a88ab98cdad7f0_OoyFkqx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alpaca Silver"], "genres": ["Board Games", "Puzzle"], "publishers": ["Alpaca Silver"], "esrb_rating": "Everyone 10+"}