{"id": 404507, "slug": "code-shifter", "name": "CODE SHIFTER", "name_original": "CODE SHIFTER", "description": "<p>Our adventure starts at the video game company, Awesome Rainbow Corp.<br />\nYour aim as a staff member is to deliver a complete, bug-free game.<br />\nHowever, as your game nears completion, strange software bugs have started appearing.<br />\nUse the Code Shifter program in this side-scrolling action-platformer to defeat all<br />\nthe in-game bugs.<br />\nOnce you&#39;ve exterminated the bugs that have sprung forth in the programming world,<br />\nyou&#39;ll return to the real world where your story continues to develop, leading<br />\nyou to the root of the outbreak.<br />\n■Original visual style<br />\nFrom watercolors and flat colorful art to retro style pixel art,<br />\nthe graphics are a delightful mix of titles past and present.<br />\n■Game system<br />\nIn this exhilarating side-scrolling action-platformer you must<br />\ntransform your character to overcome the challanges and defeat the various enemies in each stage.<br />\nAll 30 characters have the ability to transform and use a variety of actions for a unique experience.<br />\n■Drama<br />\nOur protagonist is a programmer named Stella who is joined<br />\nby game designer Mozzie, graphics designer Rudy,<br />\nVeteran programmer Hudson, and project director Greig.<br />\nTheir antics in this entertaining comedy drama are sure<br />\nto bring a smile to your face.<br />\n■Contains an overwhelming volume of collaboration<br />\nThis game is jam-packed with Arc System Works characters from various titles.<br />\nNot only are there 30 playable characters that have different attacks and actions but there&#39;s another<br />\n70 assist characters with various special attacks.<br />\nThe 8-bit soundtrack is a remix sampled from the original theme songs of each respective series!<br />\nCharacters from popular titles such as Guilty Gear, Blaz Blue, Double Dragon,<br />\nKuniokun and many more show up to lend a hand to the fight.<br />\n■Don&#39;t miss the VS Mode<br />\nUp to 4 players can battle locally using the collab characters you have collected during<br />\nthe main game. You and your friends will no doubt get swept up in all the excitement!</p>", "metacritic": null, "released": "2020-01-29", "tba": false, "updated": "2023-11-05T14:43:02", "background_image": "https://media.rawg.io/media/screenshots/922/922d43ee9c8c1df6d52e4206e071dd70.jpg", "website": "https://www.arcsystemworks.jp/codeshifter/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "toplay": 2, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 57, "ratings_count": 1, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation 4", "Xbox One", "Nintendo Switch"], "developers": ["LAND HO! Co"], "genres": ["Action", "Platformer"], "publishers": ["Arc System Works"], "esrb_rating": "Everyone 10+"}