{"id": 404587, "slug": "virtually-real-life", "name": "Virtually Real Life", "name_original": "Virtually Real Life", "description": "\"Reality. A term concocted by creatures to give worth to their version of reality...But what is reality if there are so many realities?\"<br/><br/>What happens if a being of a 2D world is dragged into the virtual world of a 3D realm? The story follows our \"hero\" who was dragged into a world he/she barely understands, and has to survive and escape the demonic beings who brought our hero into this realm. Don't forget to try and save our hero's true love that was also dragged into this realm, or forget about true love all together, your choice. As if that isn't enough, horrific demons possessing objects will hunt you and could appear at any moment.<br/><br/>You need to help the hero search this strange 3D world for clues about his/her lost true love and a way to survive and escape this world. Almost every item in every scene can be investigated and some need to be revisited to find all secrets and items to continue. Many secrets are just for fun, but some can alter the very existence of both our hero's world and this strange 3D world.<br/><br/>Help other beings who are trapped or betray them. Surrender to the demonic beings who can posses almost anything or resist them until the very \"end\". Oh, did I mention you need to find your true love, or you can just save your own hide.<br/><br/><br/>\"Hi everyone, I am the blonde girl in the game and have great news. The developers gave me my own side quest path with various endings. Please, come and check me out, won't you? I will make it worth your while in-game, promise.\"<br/><br/><br/>\"Ignore the peasant girl above and let me show you my true power in my own side quest.\"<br/><br/>\"And this is what we developers have to deal with everyday as these characters battle it out in our heads ... Is that normal?\"", "metacritic": null, "released": "2020-01-16", "tba": false, "updated": "2023-11-05T15:53:06", "background_image": "https://media.rawg.io/media/screenshots/ecf/ecfbd8c738e3d99759250b9fec786649.jpg", "website": "https://virtually-real-life.freedomsoftware.co.za/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Freedoms Software", "Freedom Software"], "genres": ["Adventure", "Indie"], "publishers": ["Freedom Software"], "esrb_rating": null}