{"id": 404726, "slug": "p-p-dash", "name": "P. P. Dash", "name_original": "P. P. Dash", "description": "<p>This game was made as part of the Global Game Jam 2015 at chika-ba, Japan (see entry), and is only available in Japanese. If you cannot read it, you can still follow the instructions below to play.<br/></p>\r\nVideo\r\n<p>This trailer also shows how this should be played, so we recommend watching it first.</p>\r\n\r\n\r\nRules\r\n<p>P.P. Dash is a rhythm game for 2 players controlling 2 kids playing Ring and run at the <em>Knock Hotel</em>. During a round, player A sets a rhythm by knocking on certain doors in a row, then player B must repeat the pattern by opening the same doors, a la <em>Simon Says</em>.</p>\n<p>If player B opens all the doors knocked by player A, the game continue to the next round. Otherwise (if player B missed a knocked door), the game ends. Note that player B may open doors that were not knocked without losing.<br/></p>\n<p>It is possible to see the game either as cooperative or competitive:</p>\n<ul><li>Cooperative mode: player A knows as many doors as he/she wants, but must count on player B to repeat the pattern. The final score is the number of doors correctly knocked, then opened, minus the number of doors not knocked but opened (penalty). You can set a minimum and maximum number of doors to knock each round for extra difficulty and to prevent knock spamming, but the game itself doesn't enforce that.</li><li>Competitive mode (rotation): player 1 starts as player A, and player 2 as player B. Player B must repeat the patterns of player A as many rounds as possible. When player B fails, both players exchange their roles. Players can then compare the number of rounds they passed in the role of player B. To prevent door open spamming, you can set a limit to the number of extra doors to open, but the game itself doesn't enforce that.</li><li>Competitive mode (alternation): similar to rotation, but instead of waiting for one player to be defeated, players 1 and 2 exchange roles every round (of after N rounds). A player can only losing in the role of B, so the first player to miss a knocked door loses.</li></ul>\r\n\r\nStart game\r\n<p>Either play in the embedded HTML game above, or download the web-dl version below and open index.html in a browser (with Javascript active).</p>\n<ul><li>Click on the 1st line (ゲームをはじめる) to open the game page. Then click on the right button (スタート) to start the game.</li><li>Click on the 2nd line (せつめいをみる) to read Japanese instructions.</li></ul>\n<p>Note: there is a blank space on the first screen in the embedded HTML above due to itch.io preventing embedded videos to appear in HTML games. The missing video is the same as the one at the top of this description.</p>\r\n\r\nIn-game\r\n<p>Click on the left button (ノック or あける) to knock (1st phase with the boy) or open (2nd phase with the girl) a door. If the button is focused, you can also just press Space or Enter.</p>\r\n\r\nContext\r\n<p>The jam's theme was \"What do we do now?\", however this was only loosely followed and instead, all the games made in this location had the following constraint: make the game playable by people with impaired vision. The game meets this criterion by providing audio feedback from player 1's pattern to player 2 reproducing it. It also features very simple HTML to navigate in.</p>\r\nKnown issues\r\n<p>Unfortunately, a small audio desynchronization bug makes it difficult to reproduce the player 1's exact rhythm after a certain number of rounds, but the game remains playable overall.</p>\r\nCredits\r\n<ul><li>Masaaki Fukunaga (福永正明): Programming support</li><li>Hiroto Morokuma (諸熊 浩人): Programming</li><li>Long Nguyen Huu: Programming</li><li>Yasuhiro Chida (千田泰宏): Promotional movie, audio</li><li>Haruka Kajikawa (梶川晴香): Animation, staff</li></ul>\n<p>... and everyone contributed a bit to game design!</p>", "metacritic": null, "released": "2020-01-15", "tba": false, "updated": "2020-01-17T02:56:45", "background_image": "https://media.rawg.io/media/screenshots/5cd/5cd3838ad1a6f4ad968b8a0aead42ebf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["komehara"], "genres": [], "publishers": [], "esrb_rating": null}