{"id": 40471, "slug": "cargo-the-quest-for-gravity", "name": "Cargo! The Quest for Gravity", "name_original": "Cargo! The Quest for Gravity", "description": "The Gods haven’t looked too kindly on humanity and Earth, as we know it, has been reduced to a group of island archipelagos, populated by “BUDDIES” – pint-sized creatures, unbound by gravity’s forces and free to float and frolic at their own whim and leisure.<br/>\t\t\t\t\t\t The Gods have given the BUDDIES free reign over these colorful islands for their own willy-nilly, topsy turvy pleasure. But, there is a way to stop them ….FUN is the secret ingredient that will ground the BUDDIES and return gravity to Earth. <br/>\t\t\t\t\t\t As one of Earth’s last human survivors, it’s up to you to dish out a healthy dose of amusement to restore order on Earth.<br/>\t\t\t\t\t\t Do you have what it takes to outwit the BUDDIES and win back the favor of the Gods?<br/>\t\t\t\t\t\tKey Features:\t\t\t\t\t\t<ul><li>Packed with unique and innovative physics-driven gameplay that offers multiple solutions to each mission; not to mention an unlimited sandbox mode!<br/> </li><li>Explore a wide variety landscapes and locations including flying islands, large underwater environments, and numerous interiors. Changing seasons offer a dynamic effect on gameplay.<br/> </li><li>Loads of different parts &amp; components that can be assembled to create crazy yet functional vehicles<br/> </li><li>Use your own music to create a personalized game soundtrack<br/> </li></ul>", "metacritic": null, "released": "2011-04-21", "tba": false, "updated": "2024-01-07T09:17:13", "background_image": "https://media.rawg.io/media/screenshots/756/756eef7a07205ea9af2e6c74f8be140f.jpg", "website": "http://www.bit-composer.com/www_en/game.aspx?gameid=3925a527-3f13-48ec-84a3-6b057adf339f", "rating": 3.11, "rating_top": 3, "added_by_status": {"yet": 14, "owned": 431, "beaten": 17, "toplay": 1, "dropped": 8}, "playtime": 2, "achievements_count": 52, "ratings_count": 38, "suggestions_count": 438, "game_series_count": 0, "reviews_count": 38, "platforms": ["PC"], "developers": ["Ice-Pick Lodge"], "genres": ["Action", "Adventure", "Simulation", "Arcade"], "publishers": ["Nordic Games", "Viva Meda", "Ice-Pick Lodge", "bitComposer Games"], "esrb_rating": null}