{"id": 404730, "slug": "masks-bomber-jonathan-k", "name": "Masks (Bomber / Jonathan K)", "name_original": "Masks (Bomber / Jonathan K)", "description": "<p>Submission for the Weekly Game Jam, Week 131 - Magic Mask.</p>\n<p>Programming, level design, \"art\" - Bomber / Jonathan K</p>\n<p>Music - Dartikus /</p>\n<p>This is a minimalist puzzle game based on water flowing. Your goal is to refill the spring in each level, marked by a pink lily.</p>\n<p>You're equipped with a magical mask that allows you to raise and lower earth, so long as you have the mana to!<br/></p>\n<p><strong>Controls</strong></p>\n<p>To move, use <strong>WASD</strong>. To rotate the camera for a different view of the level, use <strong>Q</strong> and <strong>E</strong>. Keep in mind that the WASD controls are relative to your camera rotation!</p>\n<p>To reset the level, use <strong>R</strong>.<br/></p>\n<p>To raise earth, mouse over a green tile / any portion of a column of green tiles and <strong>left</strong>-click.</p>\n<p>To lower earth, mouse over a green tile / any portion of a column of green tiles and <strong>right</strong>-click.</p>\n<p>Once you raise/lower earth, you will need to move into a glowing blue mana crystal to use your ability again.</p>\n<p><strong>Web/HTML5 Version Notes</strong></p>\n<p>When you press \"Run Game\",  hit <strong>Tab</strong> to give the embedded window focus (itch should really do this by default...). If you click on the window and accidentally use your ability, you can hit <strong>R</strong> to restart!<br/></p>\n<p>The web version is less stable/tested than the downloadable version - if it's giving you trouble, try downloading the executable version.<br/></p>\n<p><strong>Development Notes<br/></strong></p>\n<p>This was my second time attempting a 3D puzzle game, and my third time seriously attempting a puzzle game in general. It turned out pretty well, considering we lacked a dedicated artist.</p>\n<p>It's particularly tricky to develop good puzzles - that's something I've run into every time I've tried to develop a puzzle game. This time, it helped to add mechanics one by one and try to come up with puzzles using as small a set as possible. (The first time a sort of \"puzzle\" popped out was when the ground could be both lowered <em>and</em> raised, and water flowing was present.)<br/></p>\n<p>Original plans for the game had the player unlocking and being able to use multiple masks, each associated with a different element (earth, fire, water, air). The earth mask was the easiest to come up with and implement at the code level, so it's the primary one we focused on. We considered a fire mask that could start wood burning (which would spread similarly to water flow), among other things.<br/></p>", "metacritic": null, "released": "2020-01-15", "tba": false, "updated": "2020-01-17T02:57:52", "background_image": "https://media.rawg.io/media/screenshots/089/0895827aa352b6d2381d58269a52daf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}