{"id": 404921, "slug": "a-grim-birthday", "name": "\"A Grim Birthday\"", "name_original": "\"A Grim Birthday\"", "description": "<p>\"A Grim Birthday\" follows the story of Bobbet, a young automaton celebrating her 8th birthday alone, as usual. When, out of the blue, she receives a parcel, which suddenly  appears in the centre of her room...</p>\n<p>Can you help her unpack this late birthday present, and uncover the mysteries that await within?</p>\n<p>---------------------------------------------------------</p>\n<p>Hey all!<br/></p>\n<p>Just wanted to let you all know that, while this game is intended to be part of university work, I hope to further develop the concept behind this game in the future, especially in regards to making it a full series. I want to take the basic concept and create something pretty big, so thankfully this little assignment task has taught me quite a bit about designing a level, even in a small space.</p>\n<p>However, for the time being, this is just a sort-of prototype for a bigger series, while keeping my boundaries of \"A singular room\" game in place for uni work. Still, I have had plenty of fun making this, and I hope you like it too :D</p>\n<p>Regardless, thank you so much for looking at my work, and I hope to make bigger and better things in the future! ^^<br/></p>\n<p>P.S: I sincerely apologise about the audio, as I have no real audio-editing skills and made the best with what I knew. It may be either too low or too loud, so please make sure to turn your devices audio up or down respectively. Thank you, and once again I'm sorry!</p>\n<p>---</p>\n<p>Links to more of my content;<br/></p>\n<p>Newgrounds: https://xyrodonatus.newgrounds.com/</p>\n<p>Twitter: https://twitter.com/me_lucid</p>", "metacritic": null, "released": "2020-01-14", "tba": false, "updated": "2020-01-17T03:44:55", "background_image": "https://media.rawg.io/media/screenshots/251/251597a1b5a857bd2defa1e9b2583c7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["XyroDonatus"], "genres": [], "publishers": [], "esrb_rating": null}