{"id": 405289, "slug": "chibi-maker-avatar-creator", "name": "Chibi Maker - Avatar Creator", "name_original": "Chibi Maker - Avatar Creator", "description": "That’s a brand new avatar maker and doll dress up game! Now you can make your own character so easily! You can use your pastel doll as an cute avatar for social networks or make kawaii wallpapers with your adorable dolls! Surprise your friends, unleash your imagination and upgrade your creative skills!Th<br/><br/>~ Thank you for your cool reviews! Your feedback is very important for us and it helps us make a better games! ~<br/><br/>Pick up the skin color of your chibi character from an infinite number of colors! Choose your favorite hairstyle and also customize it’s color. Dress up dolls from variety of clothing items. Pick up the wings for your little doll. Now it’s time to decide what kind of eyes, mouth and eyebrows your cute avatar is going to have. Huge amount of face accessories such as freckles, moles, blush are also available in our anime maker. Pick up pets for your kawaii doll so that she doesn’t feel lonely. Final touch is background! Many pastel wallpapers is in your hands. Well.. It’s time to save your pastel doll on your device! <br/><br/>If you like doll dress up and anime maker games, you will definitely love this one! Make your own chibi character and show it to your friends. Surprise them by making their avatars. Gather your own collection of kawaii dolls!<br/><br/>* Full customization of skin color and hairstyle<br/>* High variety of wings for your pastel doll <br/>* Create chibi yourself or make avatars for your friends!<br/>* Make your own kawaii wallpapers<br/>* Facial features and accessories <br/>* Cute pets for your chibi character<br/>* Many clothes items", "metacritic": null, "released": "2019-10-11", "tba": false, "updated": "2020-01-20T01:58:52", "background_image": "https://media.rawg.io/media/screenshots/377/3773c087b780a93c66a4ed6632c519fb_B1udTQ0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["arpaplus"], "genres": ["RPG", "Casual"], "publishers": ["Arpaplyus OOO"], "esrb_rating": "Everyone 10+"}