{"id": 405281, "slug": "woody-scapes-block-puzzle", "name": "Woody Scapes Block Puzzle", "name_original": "Woody Scapes Block Puzzle", "description": "#1 Player's Choice for Daily Puzzle!<br/><br/>Let’s try WOODY SCAPES and see how the simple art of nature background helps you live happier and healthier &lt;3<br/><br/>If you’re looking for a classic block puzzle game to relax, help you find clarity, and rejuvenate your brain and body, WOODY SCAPES is right up your alley. This is one of the most unique puzzle games with the beauty of nature. <br/><br/>There are lots of different nature backgrounds and game music for you to choose and enjoy. Scenes of nature are associated with a positive mood and psychological wellbeing, meaningfulness, and vitality.<br/><br/>The objective of this game is simple – drag the blocks to create and destroy full lines on the screen both vertically and horizontally. The more block formations you make, the more scores you will be granted.<br/><br/>◉ WOODY SCAPES HIGHLIGHTS:<br/>- Lots of different mind-blowing nature backgrounds to rejuvenate your brain and body.<br/>- The meditational soundtracks: Relaxing &amp; Calming are used to cool your brain.<br/>- Both Classic &amp; Wood boards are available to choose from.<br/>- No time limit to enjoy and increase your thinking ability.<br/>- Free &amp; Simple to play with endless fun.<br/><br/>Serving as a mental exercise, WOODY SCAPES is surprisingly easy to play, offering a soothing and relaxing experience while also challenging your ability to think through problems. So, for passing your boring time, it will be a great solution.<br/><br/>Carving out time to play WOODY SCAPES now for free! <br/>Ideas on how we can make WOODY SCAPES even better? <br/><br/>Need help with the game? We love to hear from our players! <br/><br/>Contact us: freeblockpuzzlegamesinc@gmail.com", "metacritic": null, "released": "2019-12-18", "tba": false, "updated": "2020-01-20T01:55:07", "background_image": "https://media.rawg.io/media/screenshots/247/24768768c560561c1d780b3e80643c96_R5U1Lur.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Free Block Puzzle Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Free Block Puzzle Games"], "esrb_rating": "Everyone 10+"}