{"id": 405308, "slug": "blendy-juicy-simulation", "name": "Blendy! - Juicy Simulation", "name_original": "Blendy! - Juicy Simulation", "description": "So good you can practically taste it!<br/><br/>Relax and blend your stresses away in the number one blending simulation game!<br/><br/>Take customer orders and blend away to keep them coming back! Add the right amount of each ingredient with the correct timing to make the perfect juices, smoothies, or cocktails. Unlock more fruits and vegetables and ice the more you play! Watch your stress just melt away!<br/><br/>Ah that’s refreshing! Can you keep the customers happy?<br/><br/>GAME FEATURES<br/><br/>1. Simple but addicting mechanics<br/>Add the right amount of each ingredient to make the perfect juices. Than tap to blend! Can you keep the customers happy?<br/><br/>2. Beautiful Graphics<br/>This is one of the best looking blending simulation games there is. ​Watch in amazement as you blend the ingredients into vibrant juices.<br/><br/>3. New ingredients constantly getting added<br/>New fruits and vegetables are continuously getting added for you to blend away.<br/><br/>4. Amazing physics<br/>Watch as objects fall and bounces out if it overflows. Feel the satisfaction as you watch the items blend into new colorful juices.<br/><br/>Whether you want a smoothie, a cocktail, or just a fruit and vegetable juice - Blendy! has what you want. Once you start playing, you will not be able to put it down!<br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Mr. Bullet, Happy Glass, Ink Inc and Love Balls!<br/><br/>Follow us to get news and updates on our other Award Winning titles; https://lionstudios.cc/ <br/>Facebook.com/LionStudios.cc <br/>Instagram.com/LionStudioscc <br/>Twitter.com/LionStudiosCC <br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": null, "tba": false, "updated": "2020-01-20T02:06:32", "background_image": "https://media.rawg.io/media/screenshots/7cd/7cd4b435ced4674a58aaf7c6e974c0c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Lion Studios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}