{"id": 40536, "slug": "atelier-iris-eternal-mana", "name": "Atelier Iris: Eternal Mana", "name_original": "Atelier Iris: Eternal Mana", "description": "<p>Eternal Mana is set in the world of Regallzine, long the home of alchemy and mana. Wars and internal disputes have separated the kingdom of Esviore and now, the area of South Esviore where the game takes place is no longer under the control of King Slaith. Instead, each separate city-state of South Esviore runs their own affairs, trading with one another but remaining mostly separate.</p>\n<p>The situation with Regallzine is also tied with the fate of Avenberry, a legendary city of alchemists that existed many hundreds of years before the game&#39;s beginning. No one knows exactly what happened, but it is said that Avenberry fell because of the misuse of the alchemy that ran their lives. Many alchemists and treasure hunters have come to Avenberry to try to unlock its secrets since that time, and the city of Kavoc was built for that purpose. However, none have been able to get past the gate that guards the citadel, and Avenberry&#39;s secrets have so far been preserved.</p>\n<p>Alchemists today are few and far between, most basing their research on the studies of Iris, an alchemist who lived before the fall of Avenberry. They travel the world in search of new alchemaic artifacts for synthesis, ruins of the past, and Mana. The mana are a race of beings that allow alchemists to use their power. They augment the power of the elements which Alchemists extract from objects in the world and use them to create new and powerful magical items. Mana have feelings, emotions, and personalities just as people do, and many become good friends with their alchemist, although some people do forget about this fact.</p>\n<p>The protagonist of the game, Klein Kiesling, is one of these wandering alchemists. His adventure begins when he stumbles across a monster in a forest, is rescued by a girl, and gets wound up in her fate and eventually, the fate of the world.</p>", "metacritic": 74, "released": "2005-06-28", "tba": false, "updated": "2023-01-14T04:35:10", "background_image": "https://media.rawg.io/media/games/da9/da90a489124a6b023a74139b31f9663d.jpg", "website": "http://nisamerica.com/games/a6/", "rating": 3.56, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 6, "beaten": 8, "toplay": 10, "dropped": 2, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 494, "game_series_count": 24, "reviews_count": 9, "platforms": ["PlayStation 2"], "developers": ["Gust"], "genres": ["Adventure", "RPG"], "publishers": ["NIS America"], "esrb_rating": "Teen"}