{"id": 405563, "slug": "youre-going-to-die", "name": "You're Going To Die!", "name_original": "You're Going To Die!", "description": "<p>My first game.  It isn't great but you can't deny that it IS a game.</p>\n<p>Words &amp; code &amp; music by Luke Kondor</p>\n<p>Sound effects by 99sounds.org</p>\n<p>With a lot of help from the Complete C# Unity Developer 2D course on Udemy.</p>\n<p>Follow me at @Lukeofkondor,www.lukekondor.com, and Patreon.com/Lukeofkondor.</p>\n<p>***</p>\n<p><strong>DevLogs:</strong></p>\n<p>Jan 13th 2020</p>\n<p>I want to start making a few games. It’s a terrifying prospect.</p>\n<p>I was doing a text adventure tutorial… so let’s see if I can make something interesting or fun out of that. </p>\n<p>*</p>\n<p>Jan 16th 2020</p>\n<p>So I signed up to a very highly-rated gamemaking course on Udemy. They take you through the process of making various different types of games, the first one being a text adventure game.</p>\n<p>Sounds simple enough.</p>\n<p>I figured I could do the games and try to add personalisations to each one, try to break them and rebuild them, learning how the pieces were put together, sorta like how Dr Manhattan figured out how to reconstruct himself from nothing.</p>\n<p>Easy right?</p>\n<p>So I followed the tutorials and learned some basic scripting and started to get a handle on Unity itself. The core game engine came together just as expected.</p>\n<p>But then I started to add my customisations. I added my own graphics, tried to make the text adventure choices make me laugh, and then started to look into adding audio. I wanted audio to trigger at various events, win states, keys pressed, etc.</p>\n<p>Some of this was easy and some of it was so painfully difficult it was almost unbelievable.</p>\n<p>To add audio at the win state of the game, I spent about five hours digging through tutorials, trying to work out some C#, testing, re-testing, pulling my hair out (if I had hair), screaming, and I was almost certain that I might not figure it out.</p>\n<p>But then...</p>\n<p>I did.</p>\n<p>And suddenly I could see what I was doing.</p>\n<p>And it came together.</p>\n<p>It worked.</p>\n<p>I could see the woods for the trees and the audio trigger worked.</p>\n<p>Holy shit. That was actually a pretty great feeling. I felt like Einstein after he discovered the formula for saying Eureka but way better. Einstein only figured out the theory of relativity; I figured out how to make a game make a noise when the player wins.</p>\n<p>*</p>\n<p>Jan 18th 2020</p>\n<p>YGTD is just about there. </p>\n<p>I feel like I could spend another hundred hours on it, adding new story branches, refining the writing, making it all poetic, and I reckon I could add all sorts of extra features, but I think I need to finish this and move on to the next game project. </p>\n<p>Whilst I'm still figuring out how the game development process works, I'm aiming for volume instead of perfection. I'm hoping to put a whole bunch of fun little game sketches together. </p>\n<p>Here are the tenets of my game-making homeschooling: </p>\n<p>1) Daily work</p>\n<p>2) Volume, not perfection</p>\n<p>3) Steal (well)</p>\n<p>4) Conscious learning</p>\n<p>5) Rest</p>\n<p>6) Feedback</p>\n<p>7) Create what you love</p><p>*</p>\n<p>19th Jan 2020</p>\n<p>Publish day.</p>", "metacritic": null, "released": "2020-01-19", "tba": false, "updated": "2020-01-20T03:11:51", "background_image": "https://media.rawg.io/media/screenshots/a3d/a3d52c79e941f345a924766da5a49ec4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lukeofkondor"], "genres": [], "publishers": [], "esrb_rating": null}