{"id": 405502, "slug": "are-you-planning-to-slug", "name": "Are you Planning to Slug?", "name_original": "Are you Planning to Slug?", "description": "<p><strong>6 Thousand years ago, The Sumerian Empire has established as the oldest known bastion of humanity. This has nothing to do with the game, i just thought you'd like to know the fun fact.</strong></p>\n<p><em>During  a comfy evening, you sit down to reach back as far as your mind recollects, to the simpler days of fun and enjoyment without the systematical human rights degradation imposed by minimum wage employers that now plagues your life. You undust a specific game you have never managed to get running. As the disc slickly slides out of its containing unit, its name engraved with a pernament marker refreshes your memory even more. \"\"Are you Planning to Slug?\" by Thomas Biroller.\" Might as well be worth a shot to test your luck now that you have a IT and gender studies degree, allowing you to swiftly undust your Sega Mega Entertainment System. And now, your mind has finally connected the dots together. You were putting the disc in the wrong way. And now, the one game sitting at the back of your head has now been finally unlocked, like a long lost memory. This story paragraph has no bearing on any in-game events.</em></p>\n<p><strong>Are you Planning to Slug</strong>, is a rage platformer where every time your character perishes, the world gets just a bit more messed up. Made for the 2nd Wowie! Jam. Tackle this old-school metroidvania-esque experience with a brand new spin: a BUG in the code has made it so that this old gem faces corruption every time your snail gets salty. Push through this test of will and share your high score with friends and family who do not care about gaming and/or game jams as a hobby!</p>\n<p>You can join my discord if this was to your enjoyment: https://discord.gg/sqPfd8n</p>", "metacritic": null, "released": "2020-01-19", "tba": false, "updated": "2020-01-20T02:54:51", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c52518e2231394c643e428a6d873bb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Koni"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}