{"id": 405746, "slug": "draconomics-cyberstarlight", "name": "Draconomics (CyberStarLight)", "name_original": "Draconomics (CyberStarLight)", "description": "How to play\r\n<ul><li>You need to collect 1,000,000 gold coins to win. If the dragon rage reaches 100% it’s game over.</li><li>If a mole gives the wrong treasure the dragon gets angry, otherwise you get gold coins.</li><li>Kill unwanted moles with left-click.</li><li>You start with a cap on your max treasure size, you have to buy and build mines to increase\r\nthe cap up to 1,000,000 before you can win!</li><li>When you kill a mole the other moles panic and walk faster, their panic decays slowly when they are not\r\nbeing killed.</li></ul>\n<p>Good luck!</p>\r\nDescription\r\n<p>This Dragon has no treasure hoard! </p>\n<p>Mole minions are running to bring him some of their treasure, but sometimes they bring him trash! Not to mention this dragon is picky, so he only wants particular treasures.</p>\n<p>When the moles bring trash or treasure the dragon doesn’t want, left click to fireball them! Dragon only wants what it wants. Whenever bad treasure or trash is given to the Dragon, he will become more and more enraged. If Dragon’s rage reaches max level, it’s game over!</p>\n<p>The goal is to fill up the Dragon’s treasure trove. Get 1,000,000 worth of treasure to win the game.</p>\n<p>Dragon can build up another mole mine by paying 50,000 gold. Click the build button and place them anywhere on the map using left click. Mole mines increase the rate of treasures brought to the Dragon and also the treasure trove’s cap! Dragon can also target and destroy mines.</p>\n<p>But be careful. If you fireball too many mole minions, their panic will increase and they will run faster to you, bringing both trash and treasure! </p>\n<p>Feel like cheating?\r\nPress ‘G’ to get 10,000 gold instantly!</p>\n<p>This game was made for Ludum Dare 45!</p>\n<p>Code: @cyberstarlight &amp; @karim1209\r\nMusic: @cephalo\r\nArt: @falu</p>", "metacritic": null, "released": "2020-01-18", "tba": false, "updated": "2020-01-20T04:03:57", "background_image": "https://media.rawg.io/media/screenshots/8f2/8f255885eae34478cf3a2b169497eadd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CyberStarLight"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}