{"id": 405797, "slug": "dragonborne", "name": "Dragonborne", "name_original": "Dragonborne", "description": "Get ready for a brand new adventure RPG, Indie Developer SpaceBot Interactive brings you the eagerly awaited Dragonborne.<br/>\n<br/>\n<br/>\n<br/>\r\nTravel through the region of Argon as Kris, in search of your missing father Kurtis, the greatest dragon slayer the region has ever known.<br/>\n<br/>\r\n​<br/>\n<br/>\r\nDragonborne is made with GB Studio and features a turn based battle system, various mini quests and puzzles that you must complete to progress through the game.<br/>\n<br/>\r\n​<br/>\n<br/>\r\nFight your way to each of the dragon caves to face your fears and overcome the challenges that stand in your way.<br/>\n<br/>\r\n​<br/>\n<br/>\r\nAre you tough enough to find your father and save the region before the dragon's awake from their slumber? <br/>\n<br/>\r\n​<br/>\n<br/>\r\nAround 10 hours of gameplay, puzzles, dungeons, multiple enemies, various weapon and armour upgrades, character zapping system, ranking system dependent on how you finish the game, various collectibles, mini quests, multiple endings and much more!!<br/>\n<br/>\r\nThis is a direct port of the original Game Boy version<br/>\n<br/>\r\nControls for the game are outlined in the pdf manual, please choose view manual from the right hand side menu, on this store page.", "metacritic": null, "released": "2020-01-18", "tba": false, "updated": "2021-02-15T02:32:56", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fd9215115b12e1bcfb56d23ef369665.jpg", "website": "https://www.spacebot-interactive.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["tofa24", "Spacebot Interactive"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Spacebot Interactive"], "esrb_rating": null}