{"id": 405838, "slug": "void-itch-hel_kj", "name": "Void (itch) (hel_kj)", "name_original": "Void (itch) (hel_kj)", "description": "<p>This is a simple one-screen arcade platformer with a dark minimal wave analog synth soundtrack.<br/></p><p>// CONTROLS:</p>\n<p>keyboard:<br/>left: move left<br/>right: move right<br/>space: jump</p>\n<p>pressing the \"F\" key at any point switches between full screen &amp; windowed mode.</p>\n<p>controller:<br/>d-pad: movement<br/>\"A\": jump</p>\n<p>// POINTS</p>\n<p>Points are scored when the player is atop any of the disappearing/reappearing platforms. An extra life is awarded every 1000 points.</p>\n<p>// JUMPING</p>\n<p>Players can jump twice (double jump) in addition to being able to walljump off the left &amp; right game walls. The double jump is restored when atop a platform.</p>\n<p>// WALLJUMPING</p>\n<p>The the player is adjacent to the left or right game walls, pressing jump will perform a wall jump.</p>\n<p>// DEATH</p>\n<p>Player death occurs when the player falls off the screen, and when the player makes contact with things that are red.</p>\n<p>// PICKUPS</p>\n<p>There are three pickups that may appear during play: The \"plus sign\" increases the rate of points acquired, the \"minus sign\" decreases the rate of points acquired, and the \"extra life\" (white square) awards an extra life to the player.</p>\n<p>~ TIPS &amp; TRICKS ~</p>\n<p>+ The middle of the screen is generally the safest. be careful walljumping while the red beam obstacle is present.</p>\n<p>+ If you walljump while pressing the opposite direction (timing is critical) you can perform an extra long jump. Be aware this jump isn't as high as the standard walljump.</p>\n<p>+ You might not know where to land when you leave a platform. Space out your doublejumps (&amp; wall jump) to buy some time.</p>\n<p>~ VERSION 1.1 CHANGES ~</p>\n<p>added new cannon (exploding bullets)<br/>added optional fullscreen mode<br/>added controller support<br/>added 3 new background music tracks<br/>adjusted obstacle progression</p>\n<p>~~~~~~~~~~~~~~~~~~~~~~<br/>Game &amp; music by Karl Jørgensen 2017<br/>http://www.okikumi.com/void<br/>http://okikumi.bandcamp.com/album/void</p><br/>", "metacritic": null, "released": "2020-01-17", "tba": false, "updated": "2020-01-20T04:25:28", "background_image": "https://media.rawg.io/media/screenshots/e1e/e1e8705725aaa33db1b784d0064942db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hel_kj"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}