{"id": 405806, "slug": "verge-axis-demo", "name": "Verge Axis Demo", "name_original": "Verge Axis Demo", "description": "<p><strong> </strong>In this F-Zero inspired racer, use your boost to reach insane speeds. However, doing so will cause your machine's temperature to rise and when your temperature meter gets full your machine will overheat and you won't be able to boost for a while.</p>\n<p> To prevent this, you can either play it safe and let off the boost or you can take the many jumps scattered throughout the track and perform barrel rolls to reset your temperature meter and continue boosting upon landing. But if you're not careful with the jumps you might find yourself flying off course to your doom!</p>\n<p><strong>Features in this demo include:<br/></strong></p>\n<ul><li>A Time Attack mode with three different tracks.</li><li>Four playable machines with varying stats and handling (with more to be added in future builds).</li><li>A tutorial mode that explains the controls.</li><li>Game pad support.</li></ul>\n<p><strong>Important Notes:<br/></strong></p>\n<ul><li>Runs best on modern or recent hardware and Windows 64-bit OS.</li><li>For some reason when playing on a laptop, you can't turn when the charger is not plugged in. Currently trying to resolve this issue.</li></ul>\n<p><strong>Credits</strong>General game development including art, modelling, texturing, track design, animations, scripting, etc. was done by <strong>LeoGeo.<br/></strong></p>\n<p>All music was done by<strong> Remix Rave.</strong></p>", "metacritic": null, "released": "2020-01-18", "tba": false, "updated": "2020-01-20T04:18:01", "background_image": "https://media.rawg.io/media/screenshots/dc1/dc103a4c0319cf924dd9265630524b19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LeoGeo"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}