{"id": 405929, "slug": "one-rolly-boi-samuel-wilson", "name": "One Rolly Boi (Samuel Wilson)", "name_original": "One Rolly Boi (Samuel Wilson)", "description": "<p>Our snowman has been adventuring but has managed to lose his head, you have to help him roll back to his body and maybe increase in size?</p>\n<p>This has been a week long game jam game submitted to the winter Solent mega jam 2020. The themes for this jam were Winter, difficulty based on the environment. This was achived by using a snowman as our main character having him rolling around in a snow covered world jumping from platform to platform increasing in size giving him more health as he rolls.</p>\n<p>The environmental hazards that have been put in place are: <br/></p>\n<p>Icicles - These will fall down on the snowman's head and hurt/kill him when rolled under.</p>\n<p>Mines (Not so much environmental but) - These will explode when hit or after time of the proximity going off.</p>\n<p>Water - This will kill our little snowman head on him</p>\n<p>There are also a few variations of the heads that will allow for different mechanics allowing the player to traverse the levels in some different ways.</p>\n<p>Normal head - Used to get around, unlimited uses.</p>\n<p>Bomb head -  Allows to blow up objects after picked up, limited to 3 uses.</p>\n<p>Goo head - Allows to stick to walls after picked up, limited to 3 uses.</p>\n<p>As well as these mechanics there is a collectable and star system, this works by there being a load of coins in levels that will need collecting to get the full star amount at the end of the level, but you are being times so do you want all the coins and stars or to have the fastest time possible?</p>\n\n<p>Winner of Solent 2020 Winter Mega Jam.</p>\n\n<p>Developers: Samuel Wilson, Daniel Foyle, Byron Andrews-Salvietto</p>\n<p><strong>Build Release Date</strong></p>\n<p>First release build - 10/01/2020</p>", "metacritic": null, "released": "2020-01-17", "tba": false, "updated": "2020-01-20T04:48:53", "background_image": "https://media.rawg.io/media/screenshots/2fa/2fa2970f4095a009f94a8b645e75f572.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Samuel Wilson"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}