{"id": 405958, "slug": "masterhacker", "name": "MasterHacker", "name_original": "MasterHacker", "description": "<p>Masterhacker is an early prototype of a game in which you can hack into different computers. By hacking yourself through the levels, you'll be a  real masterhacker at the end of the game.</p>\r\nPre-Alpha Release\r\n<p>Because it's an early prototype I called it the Pre-Alpha Release. So far, the game contains only one computer that you can hack as sort of a demo so you can see the potential of it.</p>\r\nDesign you own levels\r\n<p>In the first level, you see a lot of elements that can be used to create larger and more complicate levels:</p>\n<ul><li>A circuit that can be activated or disactivated</li><li>A detection-system that activates the defend-bots</li><li>Defend bots that block you </li><li>A gate that can be opened and closed</li><li>Files that need to be hacked to accomplish the level</li></ul>\n<p>With these elements, you are free to design your own levels and send them to me. I'll look at the designs and look what I can do whit them. </p>\r\nStoryline\r\n<p>To make a link between the different computers and levels, I will also develop a story in which a hacker plays the leading role. It will be about a Russian hacke rin a cyberwar between Russia and the USA who both want the supreme powerand rule the world.</p>\r\nSoftware\r\n<p>All the music and sound effects are created in Cubase AI. The engine I use is the Godot Game Engine and the graphical design is done with Photoshop. The images I use come from pexels.com.</p>\r\nDisclaimer\r\n<ul><li>None of the characters in this game are real or based on real persons. </li><li>The game is pure fiction and not meant to critisize any point of view.</li></ul><p>All rights reserved to Rune Floryn</p>", "metacritic": null, "released": "2020-01-17", "tba": false, "updated": "2020-01-20T04:57:27", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc1d3a752b0f5c16cc297ecdfb6a267c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rune Floryn"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}