{"id": 406229, "slug": "elf-la-aventura", "name": "ELF - La aventura", "name_original": "ELF - La aventura", "description": "<p><strong><em>ELF, LA AVENTURA - PARTE 1</em></strong><br/><br/><br/><strong>Historia:</strong><br/>Cornelius, el protagonista de esta historia, podía considerarse un elfo feliz. No sólo era sano y joven<br/>(apenas sobrepasaba los cien años) sino que ademas estaba profundamente enamorado de una hermosa<br/>elfa que le correspondía y con la que esperaba poder casarse pronto.<br/>Sin embargo, un cruel personaje iba a turbar la felicidad de la pareja. El mago Necrilous necesitaba una<br/>elfa para su último hechizo y Elisa, la joven amada de nuestro héroe, tuvo la desgracia de convertirse<br/>en la elegida para ser hervida en el caldero donde iba a ser preparado el diabólico brebaje.<br/>Esta es tu historia, de como Cornelius el Elfo se aventura en el bosque en busca<br/>de su amada.<br/>¿serás capaz de conseguirlo?</p>\n<p><strong>Instrucciones:</strong><br/>Como toda aventura conversacional tipo \"AD\" puedes usar comandos típicos como:<br/>COGER, DEJAR, USAR, DAR, COMER, HABLAR, EX o EXAMINAR y algún que otro verbo.<br/>Ejemplos:<br/>DAR comida a Luke<br/>HABLAR con Luke<br/>También puedes usar:<br/>M para volver a ver la descripción de la localidad actual.<br/>X para ver las salidas posibles (conexiones de localidades)<br/>I para ver el inventario.<br/>N, S, E, O para moverte por el mapa.<br/>Q o FIN para salir o reiniciar el juego.</p>\n<p>Examina todo lo que encuentres a tu paso. Quien sabe lo que el juego oculta..</p>\n<p>Aunque durante el juego aparezcan \"tildes\", no es posible ni necesario escribirlas.<br/>La Ñ si se utiliza.<br/>Escribe siempre en minúsculas.<br/><br/></p>\n<p><strong>Créditos:</strong><br/>---------<br/>Programación: JAVY FERNÁNDEZ<br/>Gráficos: JAVY FERNÁNDEZ<br/>BetaTester: DAVID M. (6128)<br/>Juego original: © 1991 OCEAN SOFTWARE<br/>Versión aventura: © 2016 DEFECTO DIGITAL</p><p><strong>El juego es GRATIS. Una donación será bien recibida!</strong><br/></p>\n\n<p><strong><em>PACK.ZIP</em></strong></p>\n\n\n<p><strong><em>ELF, THE ADVENTURE - PART 1</em></strong><br/>2016 DD STUDIOS (DEFECTO DIGITAL)</p>\n<p><strong>History:</strong><br/>Cornelius, the protagonist of this story, could be considered a happy elf. Not only was he healthy and young<br/>(barely over a hundred years old) but was also deeply in love with a beautiful<br/>the elf she was entitled to and hoped to marry soon.<br/>However, a cruel character was going to disturb the couple's happiness. The wizard Necrilous needed a<br/>elf for her last spell and Elisa, our hero's beloved young lady, had the misfortune to become<br/>on the one chosen to be boiled in the cauldron where the diabolic brew was to be prepared.<br/>This is your story, of how Cornelius the Elf ventures into the forest in search<br/>of his beloved.<br/>will you be able to get it?</p>\n<p><strong>Instructions:</strong><br/>Like all \"AD\" type conversational adventures you can use typical commands like:<br/>GET, LEAVE, USE, GIVE, EAT, TALK, EX or EXAMINE and some verbs.<br/>Examples:<br/>GIVE food to Luke<br/>TALK to Luke<br/>You can also use:<br/>M to see the description of the current location again.<br/>X to see the possible exits (location connections)<br/>I to see the inventory.<br/>N, S, E, O to move around the map.<br/>Q or END to exit or restart the game.</p>\n<p>Browse everything in your path. Who knows what the game hides..</p>\n<p>Even if \"check marks\" appear during the game, it is not possible or necessary to write them down.<br/>The Ñ if used.<br/>Always write in lowercase.</p>\n<p><strong>Credits:</strong><br/>---------<br/>Programming: JAVY FERNÁNDEZ<br/>Graphics: JAVY FERNÁNDEZ<br/>BetaTester: DAVID M. (6128)<br/>Original Game: © 1991 OCEAN SOFTWARE<br/>Adventure version: © 2016 DEFECTO DIGITAL</p>\n<p><strong>The game is FREE. A donation is welcome.</strong><br/></p>", "metacritic": null, "released": "2020-01-21", "tba": false, "updated": "2020-01-24T02:43:57", "background_image": "https://media.rawg.io/media/screenshots/198/1986b150c3819984377f85b4089cb04f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DD Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}