{"id": 406207, "slug": "crazysteveio", "name": "CrazySteve.io", "name_original": "CrazySteve.io", "description": "CrazySteve.io - MINECRAFR.IO\r\n<p>The game Crazy Steve io was created for fun and fast fighting. The main task in Crazy Steve is to score as many points as possible and be the coolest 😎. To do this, you need to collect diamonds and apples that appear on the map. For diamonds💎, you charge more experience than apples🍎, but thanks to apples you can recovery your health. A lot of diamonds💎💎💎 fall out of the killed rival. Do you understand what we are inclined to? Yes! You need to scatter around the dynamic checkers, shoot from the bow, attack with the sword, shoot from the fireball and use other weapon in every way to kill the rivals🔫, and then take their diamonds to yourself. By the way, be careful, you can undermine yourself, will be more blood! On the map running animals🐷 that you can kill and recovery health. </p>\n<p>With each new level you increase slightly. Together with the volume increases the ability of your character to collect apples and diamonds. But at the same time you gradually slow down and become more vulnerable to attacks by fast, small and agile rivals. Therefore, the Top player quickly opens the hunting season. Players scour the field in search of a 'fat boy'. So the more diamonds you recruit, the sharper the battle becomes!</p>\n<p>Another feature of Crazy Steve is that you can undermine your own sword. You can throw 4 dynamite at a time. Only after the explosion of one of them you can throw a new one. On the map are scattered different helmets: wooden, iron, gold, diamond and cart, wear them or sit in the cart to be more protected!</p>\n<p>Apples and diamonds appear on the map constantly. Players usually fight in the center and therefore one should periodically look at the edges of the map to collect diamonds.<br/></p>", "metacritic": null, "released": "2020-01-23", "tba": false, "updated": "2020-01-24T02:38:50", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e20863d219ab2455063e430f347edb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 1, "platforms": ["Web"], "developers": ["K&S Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}