{"id": 406369, "slug": "project-egg", "name": "Project EGG", "name_original": "Project EGG", "description": "<p><strong>Project </strong><strong>EGG</strong></p>\n<p><em>For the 2020 Virtus New Game Jam</em></p>\n<p>Survive for as long as you can!<br/>Defend your Chickens and their houses from the onslaught of foxes!</p>\n<p>Collect Resources to rebuild your Chicken's houses (From Silo Menus).<br/>Eat the plants to stay alive and moving!</p>\n<p>Give Chickens Missions to find you resources!</p>\n<p>If all the chicken houses go down - Game Over.<br/>Watch your reputation - Saving Chickens and killing foxes will boost it. Destruction of the chickens or their houses will lower it! Keep it above 0 or Game Over.</p>\n<p>Beware the night!</p>\n\n<p><strong>Controls</strong><br/></p>\n<p>WASD - Movement</p>\n<p>Space Bar - Jump (Hold for a longer Jump)</p>\n<p>Q - Eat Food and Drink </p>\n<p>E - Access Chicken and Silo Menus - Collect Resources </p>\n<p>Left Click - Quick Fire (Egg Firing)</p>\n<p>Right Click (Hold) - Heavy Fire: Launches you into the air. Left Click to fire once in this mode. </p>\n\n<p><strong>Additional Info </strong><br/></p>\n<p>In order to rebuild chicken houses you need resources which can be found around your environment - or you can send chickens on missions to get your resources for you. Once having gathered the required materials... Head to a silo and press E to access its menu, from there you may deposit your local inventory and (if any chicken houses are destroyed) Rebuild the chicken houses. </p>\n\n<p>Hitting a fox 5x without error grants you a hit streak bonus. Giving you more speed, strength and allowing you to deal more damage! Hitting foxes with this bonus enabled increases the length of time its enabled for - Missing however decreases the time you have (in tiny amounts)</p>\n\n<p>Keep a close eye on your reputation bar (Blue Bar - top-left) when high it will increase the amount of resources chickens bring back and increases your overall hit bonus mutators. Both killing a fox and saving chickens awards you reputation. While losing chickens or their houses decreases your reputation!</p>\n\n<p><strong>Credits </strong></p>\n<p><em>Programmers -<strong> </strong></em><strong>Faith254, Developd and Cosmic </strong></p>\n<p><em>Modelers</em> - <strong>Hotdog and Faith254</strong></p>\n<p>Emails - </p>\n<p>nashvillenoahhill@yahoo.com (Hotdog) </p>\n<p>Developdprogrammingofficial@gmail.com (Developd)</p>", "metacritic": null, "released": "2020-01-22", "tba": false, "updated": "2020-01-24T03:14:31", "background_image": "https://media.rawg.io/media/screenshots/830/8309ac367a9de5be0923d4a910c03f08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Faith254"], "genres": ["Action"], "publishers": [], "esrb_rating": null}