{"id": 406489, "slug": "southcottian", "name": "SOUTHCOTTIAN", "name_original": "SOUTHCOTTIAN", "description": "<p><strong>SOUTHCOTTIAN</strong> is artist John Walter's first Virtual Reality game.</p>\n<p>Joanna Southcott (1750-1814) was an English prophet who led a cult with more than 1400 followers. At the age of 64 she believed that she was going to give birth to the new messiah but it turned out to be a phantom pregnancy. During her lifetime Southcott left of a sealed box of prophecies to the nation to be opened in a time of crisis. The box has never been opened. There is no better time than Brexit to open Joanna Southcott’s box! <br/></p>\n<p><strong>SOUTHCOTTIAN</strong> (2019) is a Virtual Reality game inspired by Southcott’s life that tells the story of her phantom pregnancy as an allegory for Brexit. The piece continues my investigation into the analogies that can be made between biological viruses and thought contagion. Texts appear on various levels that relates to the spread of religious memes. The story is embedded within my broader interests in patterns, performing in costume and filming on location, which combine to create a new fictional world. The objective of the game is to find Joanna Southcott (a bit like <em>Where’s Wally?)</em> and learn about her biography, about Brexit slang and about religious memes. This visual mash-up is surreal and contrasst with the commercial slickness of video game production to extend my shonky aesthetic into a new digital realm.</p>\n<p><strong>SOUTHCOTTIAN</strong> is a non-linear and immersive form of storytelling that is best viewed in an Oculus Rift VR headset or equivalent. It combines 360° video, digital animation, 3D scanning and coding, which are collaged together as what I have termed a “painting engine”. Each time <strong>SOUTHCOTTIAN</strong> is played a new moving painting emerges as a different combination of parts are triggered. The viewer co-creates the artwork from within the parameters that I have constructed. <br/></p>\n<p><strong>SOUTHCOTTIAN</strong> takes my maximalist aesthetic and my interest in visual complexity to dizzying new heights.</p>", "metacritic": null, "released": "2020-01-21", "tba": false, "updated": "2020-01-24T03:40:38", "background_image": "https://media.rawg.io/media/screenshots/cc6/cc686a29fdad6a1cb58a6fd98ac81ccf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["John Walter"], "genres": [], "publishers": [], "esrb_rating": null}