{"id": 406519, "slug": "change-ranger-demo", "name": "Change Ranger Demo", "name_original": "Change Ranger Demo", "description": "<p><strong>Change Ranger</strong>, developed by Joy Way Games, is a new first person shooter and puzzle game in virtual reality. In each level of the game you’re given a limited period of “frozen time” in which you must alter the scene just enough to result in the destruction of your enemies when time starts flowing normally.<br/></p>\n<ul><li><strong>Add it to your Wishlist and get notified as soon as the full version is released on Steam:</strong><strong> </strong>http://bit.ly/2R56j7e</li></ul>\n<p>Each level in the game consists of three phases:</p>\n<p><strong>1⃣ Time flows at normal speed. </strong>The location is filled with enemies who rush to kill you. They are just about to pull their triggers or otherwise bring rain death upon you when...</p>\n<p><strong>2⃣ Time stops. </strong>This is your chance to save yourself by cleverly altering the scene. You can, for example, strategically change the direction of an enemy’s pointed gun. During this phase, a timer shows you exactly how many seconds you have until time returns to normal.<br/> <br/><strong>3⃣ Time is restored to normal. </strong>You are instantly transported back to the original position of your body and your enemies continue on whatever trajectory and with whatever momentum they had before time stopped. If you’ve managed to make the right changes while time was frozen, your enemies will be simultaneously destroyed and you’ll move on to the next level unscathed. However, if you’ve miscalculated, you’ll suffer the wrath of your enemies’ vastly superior firepower.</p>\n<p>In Change Ranger, each level presents you with increasingly complex challenges and offers you an increasing variety of tools at your disposal. The deviously clever alterations you’ll need to make while time is frozen include redirecting a car, arming a bomb, strategically opening or closing a door, directing an enemy’s hand to a lever that triggers the devastating fall of a weight, and positioning an object to result in a deadly bullet or shrapnel ricochet. </p>\n<p>Make sure you get it just right though because if your changes don’t manage to result in the complete destruction of your enemies, you’ll be the one who ends up dead when time starts flowing again!</p>", "metacritic": null, "released": "2020-01-21", "tba": false, "updated": "2020-01-24T03:47:57", "background_image": "https://media.rawg.io/media/screenshots/e74/e74cdee39a044584bb5490c26aa44990.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PlatformaVR"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}