{"id": 406672, "slug": "ball-sweeper", "name": "Ball Sweeper", "name_original": "Ball Sweeper", "description": "<p>This is <strong>adventure game</strong>. This game is planned for a series of games with different character players later.\r\n</p>\n<p>The story starts from a little girl who enters the miraculous world. You can read the story prologue while playing this game. <br/></p>\n<p>Your mission is simple, run the player from start point to finish point. take the coins and make as many goal balls as you can.  All coins and the number of goals will be multiplied as the score after you reach the finish point.</p>\n<p>Oh wait!, during the journey there are many obstacles such as enemies that can block and destroy your ball and they can hurt players. But you can also destroy them with a special ball instead.</p>\n<p>And there are also puzzles that you have to solve in order to open the path of purpose.</p>\n<p>Be careful not to let the player fall from a height.</p>\n<p>There is a secret bonus that there will be no hints in the game, but here the author gives a clue, that you can get this near the finish area ;)  just \"<em>make a different goal!</em>\".</p>\n\n\n<p><strong>Install and the movement controller:</strong><br/></p><p>a description of how to install and the movement controller is in the download section.</p>\n<p><em>Note: When you first start playing the game, maybe you need to practice first to learn the movement controller.</em><br/></p>\n<p><strong>The download files</strong> is available for <strong>Windows</strong>, <br/><em>and also available for <strong>MacOSX </strong>and <strong>Linux</strong> in the debug version, which is we haven't tested yet due to device limitations at this time. we are still focusing on windows for now. If you want, please play to try the game.</em><br/>we also have a goal that the game can run on Android in the future.</p>\n<p>Maybe You will likely encounter some minor bugs. Any and all feedback greatly appreciated. You can also send feedback to kangbud.yeah@gmail.com<br/>You can follow us on <em>Instagram</em>: @budtoon or <em>Facebook Page</em>: @budtoonartwork for any updates.</p>\n<p><em>Thanks!</em></p>", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2020-01-24T04:22:04", "background_image": "https://media.rawg.io/media/screenshots/9c8/9c8c7d8075bbde01401147a6d08e9efb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["budtoon"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}