{"id": 406679, "slug": "guiding-light-corner-office-games", "name": "Guiding Light (Corner Office Games)", "name_original": "Guiding Light (Corner Office Games)", "description": "<p>Guiding Light is a cooperative game in which you and a friend work for the Intergalactic Crash Unit. It’s your job to rescue stranded aliens from all kinds of sticky situations. One player is an alien who goes down to the planet to execute the rescue operation, while the other pilots the UFO to help guide the alien on the ground.<br/>Using your different points of view and abilities you need to work together to complete your rescue mission.</p>\n\n<p>To successfully execute these operations, communication is key. <em>Guiding Light emphasizes co-op gameplay</em> by requiring the need for <em>teamwork</em> and <em>communication</em> between players to be able to progress through the game. Both players have different points of view, information, and abilities which are all needed to successfully complete the rescue operations.<br/></p>\n\n<p>One of the two roles to fulfill is the alien. This player goes down to the ground and is expected to platform through foreign planets to get to stranded aliens who need to be beamed up to the UFO.<br/>The alien plays from a first-person perspective, and can interact with buttons, levers and can pick up batteries.<br/></p>\n\n<p>The other player is the UFO and is, quite literally, the guiding light for the alien. The UFO can fly through the level and provides information to the alien. Because of its different point of view, the UFO has a more complete grasp on the situation but needs to communicate with the alien to know what is going on on the ground.<br/>The UFO has a light ray on board, which can be used to help the alien with vision and reveal items and objects they would not be able to see by themselves. The UFO can also shine it's light on solar panels to activate doors and moving platforms to help the alien traverse the terrain and reach the end goal.<br/></p>", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2020-01-24T04:23:41", "background_image": "https://media.rawg.io/media/screenshots/e36/e3600edfa5987e56e47e020b7c37482a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Corner Office Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}