{"id": 406764, "slug": "vir-us", "name": "VIR US", "name_original": "VIR US", "description": "<p><em>FOR BEST EXPERIENCE, USE A MOUSE</em></p>\r\nTUTORIAL: READ BELOW\r\n<p>This is a game about spawning computer bugs to destroy as many computers as possible. <em>At any time</em>, press \"B\" to open the bug spawning menu. You may only spawn <em>5 bugs</em> in total for each computer. If all 5 die, your virus has been defeated. The three types of bugs are:<br/></p>\n<p>1. <strong>DESTRUCTIVE BUG (DB)</strong><strong>:</strong> This bug is tough and can take a few bullets without dying. The DB is capable of breaking turrets to shield its teammates, but make sure they don't die before it can finish!</p>\n<p>2. <strong>ANTI-VIRUS ATTACKER (AA): </strong>This bug can break down the blue antivirus barriers that guard the PC components, but is useless against anything else. This bug is vital at the start of the computer attack, so make sure to spawn one first!</p>\n<p>3. <strong>COMPONENT ATTACKER (CA): </strong>This last bug is vital to finish off the weakened computer. Once the barriers have been removed, the CA can enter and destroy the PC components!</p>\n<p>To attack with and move a bug, <em>click and drag backwards</em> to slingshot it towards a target. Targets only take damage after being hit by the appropriate bug. Click the \"P\" button at any time to pause the game. Continue destroying as many computers as you can and share your highscore in the comments once you're finished!</p>\n\n<p>TL;DR - DB breaks turrets, AA breaks barriers, CA breaks computer parts.  Click and drag to slingshot bugs into whatever they are attacking.</p>\n\n<p>CREDITS:</p>\n<p>Music created by DefineDoddy and FelineFriendly</p>\n<p>Art created by FelineFriendly</p>\n<p>(A lot of) Programming done by FelineFriendly and DefineDoddy</p>\n<p>Created in 72 hours for the Wowie! Game Jam 2.0</p>", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2020-01-24T04:41:50", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d0e51402ee6d6cbac5aee9018b8a8a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["FelineFriendly", "DefineDoddy"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}