{"id": 406825, "slug": "the-catgeon", "name": "The Catgeon", "name_original": "The Catgeon", "description": "<p><strong>The Catgeon is a fast-paced dungeon crawler game. Playing as a magical cat, you can explore the endless depths of the dungeon and blast monsters with an array of destructive spells.</strong><br/></p>\r\nFeatures\r\n<ul><li>Endless, procedurally generated floors</li><li>Task-based floor progression</li><li>An arsenal of spells unlocked and upgraded as player levels</li><li>Monster battles</li><li>Rare monsters dropping power ups</li><li>Map charting</li></ul>\r\nControls\r\n<ul><li>Movement - Mouse click/hold on tiles, double click to run</li><li>Attack - Mouse click/hold on monster</li><li>Attack spell selection - Number keys [123] or icon click</li><li>Shield spell - Q or icon click</li><li>Show map - M or 🔍 button click</li><li>Menu - Esc or ◆ button click</li></ul>\r\nProgression tasks \r\n<p> In order to proceed onto the lower floors the player is faced with a small variety of quests.   </p>\r\nSoul collection \r\n<p>A number of souls is spawned across the floor. In order to proceed all of them need to be found and collected.</p>\n\r\nMonster slaying  \r\n<p>Monsters appear on every floor and one of the tasks require a set number of them to be slain before a passage is opened.</p>\n\r\nMap charting\r\n<p>As the player walks around and explores the dungeon a map is charted. In order to proceed the majority of the tiles need to be discovered.</p>\n\r\nSpells\r\n<p>There are three different kinds of attack spells and one defensive spell that the cat can use when battling monsters. </p>\r\nMagic Missile\r\n<p>Magic Missile is the basic attack unlocked at the start. It requires no MP and creates a small projectile that shoots in a straight line towards the monster. If it misses it bounces off the walls and obstacles.</p>\n\n<p>At level 5 the Magic Missile is upgraded and becomes a homing missile, making hitting monsters much easier. </p>\n\r\nFireball\r\n<p>Fireball is a more powerful attack that's unlocked at level 2. It consumes 20 MP on use and can be shot over obstacles. It creates a small explosion on hit.</p>\n\n<p>At level 13 the fireball becomes stronger and faster, the explosion it creates grows as well. </p>\n\r\nVoid \r\n<p>Void is a powerful spell unlocked upon reaching level 8. It requires 60MP to use  and creates a large explosion that can damage multiple monsters at once. </p>\n\n<p>At level 22 Void gets a lifesteal effect that makes it heal the player by a fraction of the damage dealt.</p>\r\nShield\r\n<p>Shield is a defensive spell unlocked at level 18. It costs 80MP to use and gives the cat 30% armor, which protects it from losing HP while it's up. After being upgraded at level 26, the spell's potency goes up to 50%.</p>\r\n\r\nGameplay Video", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2020-01-24T04:56:37", "background_image": "https://media.rawg.io/media/screenshots/e90/e90a8d58c36e0f666e91a30261d7315a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rhime"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}