{"id": 406949, "slug": "ncis-the-game-from-the-tv-show", "name": "NCIS: The Game from the TV Show", "name_original": "NCIS: The Game from the TV Show", "description": "<p>“I love the characters and the contrast between the tongue in cheek humor and the seriousness of the international relations busting drama” SlideToPlay.comPut criminals behind bars as an NCIS agent in a gripping game based on the TV show! Join the Major Case Response Team led by Special Agent Leroy Jethro Gibbs, in solving thrilling cases where following your gut instinct is as important as the evidence before you. Search the crime scene, collect evidence, examine the results in a lab, and stake out possible suspects. When you have all of the right pieces, bring them in for questioning and choose how to go about dragging the information out of them. Be careful though, if you&#39;re too aggressive, they won&#39;t give up anything. All of the investigative fun takes place in an entertaining mix of action and mini-games like matching fingerprints, reconstructing chemical substances, and even autopsies! Can you remember to follow Special Agent Leroy Jethro Gibbs and catch the criminals?FEATURES INCLUDE: • Five thrilling cases, developed with the show’s creative team. • Exciting crime scenes, filled with evidence. Find the suspect by piecing it all together!• Engaging mini-games and challenging puzzles• Character interaction: choose your strategy to get the most information• Investigation and interrogation: figure out who the murderer is before it’s too late!Highly recommended for fans of CSI: Miami, Clue: Cover Story and Sherlock Holmes Mystery.GameHouse Guarantee: We take pride in the loyalty and trust our customers show us when they purchase a GameHouse product. If you are not completely satisfied with your recent purchase, please contact us at iphone-games@real.com.</p>", "metacritic": null, "released": "2010-09-07", "tba": false, "updated": "2020-01-24T05:29:23", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameHouse"], "genres": ["Adventure"], "publishers": ["Gamehouse"], "esrb_rating": null}