{"id": 40712, "slug": "chainz-galaxy", "name": "Chainz Galaxy", "name_original": "Chainz Galaxy", "description": "In this addictive puzzler, you’ll twist and turn your links to make colorful matches of three or more to eliminate them from the board and build up a colorful linked world. <br/><br/>Four fresh game modes: Classic, Arcade, Puzzle, and Strategy let you go at your own pace until you run out of links, or race against the clock to see how many chains you can make before time runs out! In classic mode, you can rattle your chain links in seven stages for 50 levels. Or, test your skills in 15 timed levels in arcade mode. Try out the 10 Puzzle levels or the nine strategy games that feature three different difficulty settings—can you conquer the high score on each one? <br/><br/>Rack up your score with eight exciting power-ups including Wild Link, Freeze, Magnet, and Cross Link. Collect bonuses by gathering 30 charms throughout the game for extra scrambles, adding to your trophy collection, and to help you score big in Chainz Galaxy! <br/><br/>Chainz Galaxy offers 80+ levels of match-making game play. Match your way through the whole galaxy! <br/><br/>Visit us at www.mumbojumbo.com to find more great casual games like LUXOR, the award-winning marble-shooter game available for the iPhone, 7 Wonders HD, Midnight Mysteries: Salem Witch Trials, Samantha Swift and the Fountains of Fate and Everyday Genius: SquareLogic all for iPad! <br/><br/>Find us on Facebook: http://www.facebook.com/MumboJumboGames <br/><br/>Follow us on Twitter: http://twitter.com/MumboJumboGames", "metacritic": null, "released": "2010-12-17", "tba": false, "updated": "2019-07-30T02:01:06", "background_image": "https://media.rawg.io/media/screenshots/f7e/f7e05105d458c9edd10fc50840a08222.jpg", "website": "http://www.mumbojumbo.com/games/Chainz_Galaxy", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "iOS"], "developers": ["MumboJumbo"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["MumboJumbo"], "esrb_rating": null}