{"id": 407125, "slug": "tales-of-camelot", "name": "Tales of Camelot", "name_original": "Tales of Camelot", "description": "<p>The aim of the game is to complete the quests given by killing enemies. There are different types of enemies, each with its unique feature. You have at your disposal the basic attack, which is right click, and 4 spells. Be careful on how you use those spells as they drain your mana.<br/></p>\n<p>When an enemy dies there is a chance for items to drop. These items will help you get stronger. Armor pieces will increase your resistances, weapons will increase your damage. There are 2 types of damages, attack and power. Attack are your right clicks/melee attacks and increasing armor will decrease the damage dealt by these attacks. Power are the magical attacks, these include your spells and projectiles, and building magic resistance (MR) will help you survive these attacks. Be careful enemies have armor and magic resistance too, play around their weaknesses. \r\n  </p>\n<p><strong>Spells </strong>\n</p>\n<ul><li>Q – Meteor: Using your magical power create a meteor which will fall from the sky and annihilate your enemies\r\n  </li><li>W – Spirit Wave: Concentrating your power and releasing it around you to create an energy field around you, which damages enemies nearby. However, this spell will drain your mana slowly, so use it wisely.\r\n  </li><li>E – Teleport: This a high-level magic you are able to teleport in short distances. However, this requires a short time to channel the magic in which you won’t be able to move.\r\n  </li><li>R – Meteor Shower: This is your ultimate spell, using your full energy you create a massive amount of meters all around you, destroying everything nearby. A very powerful spell which requires a lot of mana and takes a long time to recharge.\r\n  </li></ul>\n<p> \r\n  </p>\n<p><strong>Controls</strong>\n</p>\n<ul><li>Left click - move \r\n  </li><li>Right click - interact/attack\r\n  </li><li>Q, W, E, R - spells \r\n  </li><li>I - toggle inventory\r\n  </li><li>O - toggle quest panel \r\n  </li><li>ESC - pause menu\r\n  </li></ul>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Warning: </strong>There might be a bug where you will not be able to interact with the statues, if so, press K to skip the quest\r\n</p>\n<p><strong>Warning: </strong>When equipping items the stats might not change, works fine on editor but not in the build version.<br/></p>", "metacritic": null, "released": "2020-01-26", "tba": false, "updated": "2020-01-27T02:31:35", "background_image": "https://media.rawg.io/media/screenshots/f0c/f0c3a09aa1ecb8fe9a15c4ce78ee26ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sohag"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}