{"id": 407549, "slug": "tenchu-fatal-shadows", "name": "Tenchu: Fatal Shadows", "name_original": "Tenchu: Fatal Shadows", "description": "<p>In a time of feudal wars, Rikimaru and Ayame, two ninja of the Azuma Ninja Clan, served Lord Gohda by returning his precious daughter, Princess Kiku, from the hands of Lord Mei-Oh. Unfortunately, Rikimaru was caught in a disastrous rockfall during his escape, in an attempt to save Ayame and Princess Kiku, and is still missing. The land of Gohda remained peaceful after Lord Mei-Oh&#39;s attack, and Ayame, as an agent of Lord Gohda, continued to patrol the expansive territory.</p>\n<p>One day in her travels, Ayame came across a destroyed ninja village. She hoped to find survivors, but arrived too late. The ninja of Hagakure died whispering the &quot;Kuroya&quot; with their final breaths. As Ayame was about to leave, a young female ninja stood in her way. Her name was Rin, back from her training, and devastated to see her village in ruins. She sees Ayame as the only person alive, and blames her for the destroying of her village. Eventually, Rin sees that it was not Ayame that destroyed her village. The two team up to find the people responsible.</p>\n<p>After completing a stage, players are shown a TV drama-style teaser for plot developments occurring in the next stage. In the Japanese version of the game, these segments are narrated by popular narrator and voice actor Kiyoshi Kobayashi and always begin with the phrase &quot;Jikai no Tenchu Kurenai de wa...&quot; (次回の「天誅紅」では・・・; &quot;Next time on Tenchu Kurenai...&quot;).</p>", "metacritic": 58, "released": "2004-07-22", "tba": false, "updated": "2024-01-03T00:47:27", "background_image": "https://media.rawg.io/media/games/3b6/3b6562a7b6f2239f86a7f83d529d3dff.jpg", "website": "", "rating": 4.25, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 7, "beaten": 6, "toplay": 7, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 350, "game_series_count": 9, "reviews_count": 8, "platforms": ["PSP", "PlayStation 2"], "developers": ["FromSoftware"], "genres": ["Action"], "publishers": ["SEGA"], "esrb_rating": "Mature"}