{"id": 407575, "slug": "pro-deer-hunting", "name": "Pro Deer Hunting", "name_original": "Pro Deer Hunting", "description": "Take your deer hunting to the next level! Pro Deer Hunting offers four different destinations  to include hunts for Coues deer, Canadian whitetails, Sitka Blacktail deer, and Southeastern  whitetails. Stunning realism in graphics, environment and hunting tactics allow you to test your skills and see if you have what it takes to become the next Pro Deer Hunter!<br/><br/>* Pro mode hunt for simulated deer hunting.<br/>* Action mode hunt for realistic deer drive style hunting.<br/>* Four different whitetail deer sub-species.<br/>* Expansive hunting areas to include Southeast US, Kodiak Island Alaska, Mexico, and Canada.<br/>* Firearm and bow range for target practice.<br/>* Choice of weapons- scoped rifle, lever action rifle, double barrel shotgun, and compound bow.<br/>* Ability to attract deer with grunt tube and rattling antlers.<br/>* Deer gear- tree stands, ground blinds, binoculars, wind direction indicator and camo choices.<br/>* Hunting realism- different antler sizes, bucks chasing does, scent detection, and blood trailing.<br/><br/>1 player<br/>800MB minimum save size<br/>DUALSHOCK®4<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>Pro Deer Hunting ©2020 Developed and published by PSR Outdoors. All rights reserved.", "metacritic": null, "released": "2020-01-28", "tba": false, "updated": "2020-01-31T01:59:51", "background_image": "https://media.rawg.io/media/screenshots/f8c/f8cc397d440d1bb73b11e6e9246731bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Shooter", "Simulation"], "publishers": [], "esrb_rating": null}