{"id": 407510, "slug": "where-in-space-is-baby-hitler", "name": "Where in Space is Baby Hitler", "name_original": "Where in Space is Baby Hitler", "description": "<p>Previously, you traveled back in time to kill Baby Hitler. You failed that mission. Instead you took Baby Hitler on board of a spaceship, with an alien from outer space.</p>\n<p>That's the last thing you remember.</p>\n<p>Next thing you know, you wake up in a prison cell on a foreign planet. You can't recall the events that lead you to this situation. The baby and your alien friend are nowhere to be found.</p>\n<p>Will you escape the prison? Will you find the baby? And most importantly, WILL YOU FINALLY KILL BABY HITLER?!</p>\n<p>------</p>\n<p>Welcome to the second installment of the \"Baby Hitler\" series.</p>\n<p>This is the sequel to \"Kill Baby Hitler\".</p>\n<p>This time, you are living a sci-fi fantasy, in which you get to visit various planets in search for Baby Hitler, and encounter new alien species.</p>\n<p>The game is a point-and-click adventure played with the mouse, in the same style as \"Kill Baby Hitler\", with more puzzles, more action, and a much deeper plot!</p>\n<p>The game is 64x64 pixels, since it was originally released for #LOWREZJAM2019, but with more than 4 colors this time (thank god! that restriction gave me so much headaches in the previous game!)</p>\n<p>This time, don't complain that you just play for 1 minute and be done. This game is gonna take you possibly several hours or days to finish! As in the previous game, you get 4 different endings, which thankfully don't involve repeating the same things five times in a row.</p>\n<p>I hope you enjoy, and if you do, please share this with your friends!</p>", "metacritic": null, "released": "2020-01-24", "tba": false, "updated": "2020-01-27T04:01:11", "background_image": "https://media.rawg.io/media/screenshots/8ec/8ec412066b30a9842aa9af4b46d401c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jack Le Hamster"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}