{"id": 407573, "slug": "it-came-from-space-and-ate-our-brains-2", "name": "It came from space and ate our brains", "name_original": "It came from space and ate our brains", "description": "A merciless alien species that feeds on human brains (duh) has invaded the Earth. Who can stand up to them? You, obviously! Save the world—or at least yourself. Send aliens to oblivion in It Came From Space and Ate Our Brains—a unique top-down arcade shooter.<br/>Addicting gameplay elements, co-op mode, and a way to turn aliens into goo? It’s all here! Explore atmospheric locations with a flashlight and a weapon powerful enough to blast those unwanted intergalactic guests back into space. Survive hordes of enemies trying to corner you and get inside your skull… at least until you set a new high score and die like a badass!<br/><br/>Key features: <br/>•\tSix exciting co-op campaign missions for up to 4 players<br/>•\tDifferent alien types <br/>•\tPowerful weapons and special powers <br/>•\tAn incredible techno soundtrack that serves as the perfect background for brain-eating mayhem <br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1-4 players<br/>1GB minimum save size<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>It came from space and ate our brains © 2020 Developed by Triangle Studios BV. Published by All in! Games sp. z o.o. All other trademarks, copyrights and logos are property of their respective owners.", "metacritic": null, "released": "2020-01-28", "tba": false, "updated": "2020-12-16T14:19:11", "background_image": "https://media.rawg.io/media/screenshots/bf9/bf9c24e49ebb07b2e576b0152c821010.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch"], "developers": [], "genres": ["Action", "Shooter"], "publishers": ["All in! Games"], "esrb_rating": "Everyone 10+"}