{"id": 407602, "slug": "realm-of-alters", "name": "Realm of Alters", "name_original": "Realm of Alters", "description": "In Realm of Alters (ROA), it’s a battle of wits, and building decks to create powerful strategies. Whether this is your first card game, or you are an experienced pro, the depth and charm of ROA will draw you in. Experience the magic, and mayhem with your friends today!<h3>Story Background</h3>Legend has it that the three \"Creation gods\" overthrew the old gods, created a vigorous world that freed all lives in the world from fate. Years later, paths of the three gods diverged after a great battle. They were sealed away, reincarnated, and hibernated with respectively. Monsters and artifacts were scattering all over the earth, and people are using these powers to rebuild civilizations and countries in their own will.<h3>Gameplay &amp; Features</h3><ul><li><strong>Infinite Combination:</strong> 5 Champions and 250+ cards are included in the Early Access. Combine your destined Champion and 40 cards in different classes (colores) to achieve infinite combos and deck archetypes.<br/><br/><br/></li><li><strong>Variety Deck Building:</strong> Choose your cards wisely! Discover hundreds of cards to add to your deck. Pick those which combo each other and execute your grand strategies.<br/><br/><br/></li><li><strong>Mana Resources System:</strong> Sacrifice a card to general Mana. Would you sacrifice a high-cost card for mana in early game? Or save it for a huge late-game impact?<br/><br/><br/></li><li><strong>Shield System:</strong> A come back mechanic that shielded yourself against incoming attack! <br/>1. The amount of shield you have would reduce the incoming damage. <br/>2. Each Shield is a card, you draw them when they break, and allow you to swing the battle in your favor.<br/><br/><br/></li><li><strong>Gifts Based on Progress:</strong> Daily Login Gift, Path of Glory, Silver Coin Card Draw, Card Crafting with Dust, etc., allow you to enrich your card collection quickly!<br/><br/></li><li><strong>Different Game Modes:</strong><br/>Story Mode: In the newly launched story level, you are a member of ROA. Find the source of chaos and the way to long-lasting peace with the companionship of Spirit \"Lucy\"! Rich lore and story awaits you to discover.<br/><br/>Casual Battle: Practice your newly formed deck and combo without worrying about losing battle points! Challenge your friend anytime!<br/><br/>Ranked Mode: Match your opponents with battle points, test your strength in an equal level, and win special rewards! Evolve your deck continuously during the battle and use it to execute your victory plan.<br/></li></ul>", "metacritic": null, "released": "2020-01-30", "tba": false, "updated": "2020-09-28T01:48:49", "background_image": "https://media.rawg.io/media/screenshots/5e2/5e2878b88757602153757627b6870b7a.jpg", "website": "https://www.playrealmofalters.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC", "macOS"], "developers": ["Ember Entertainment", "Realm of Alters"], "genres": ["Strategy", "Card", "Indie"], "publishers": ["Ember Entertainment", "Realm of Alters"], "esrb_rating": "Teen"}