{"id": 407727, "slug": "vega", "name": "Vega (itch)", "name_original": "Vega (itch)", "description": "<p><strong>Vega é um jogo educacional, que tem por objetivo auxiliar no processo de ensino-aprendizagem de Libras para crianças surdas e ouvintes. </strong></p>\n<p>O jogo é composto por oito planetas que compreendem o conteúdo básico para o aprendizado de Libras, levando em consideração a complexidade dos cinco parâmetros que compõem a língua <strong>(Configurações de mãos, Ponto de articulação, Movimento, Orientação/Direcionalidade das mãos e expressão facial e ou corporal)</strong>.  Além disso,  o jogo segue a abordagem de ensino bilíngue, que se propõe a ensinar às pessoas surdas por intermédio de duas vertentes: </p>\n<ul><li>Libras como língua materna por excelência;</li><li>e a Língua Portuguesa na sua forma escrita. </li></ul>\n\n<p>Cada planeta incluso no jogo abordará um tema específico (alfabeto, números cardinais representativos, saudações e cordialidade, cores, objetos escolares, comida, moda e meios de transporte). Para está versão de demonstração estamos disponibilizando o planeta Alfa composto por quatro missões que trabalham com o alfabeto. Cada missão possui uma dinâmica cognitiva diferente de ensino, não condicionando o comportamento do jogador a uma única lógica pré-determinada. As missões também tem por objetivo estimular os dois lados do cérebro, o lado dominante de uma pessoa que ocupa a linguagem e as operações lógicas e o outro lado  que controla as emoções e a criatividade.</p>\n<p>Durante todo o jogo a personagem (Giulia) executará os sinais em Libras, representados em paralelo por legendas na Língua Portuguesa, enfatizando  assim a Libras como a língua materna do jogo, bem como auxiliando o aprendizado da criança durante o decorrer das missões através de um divertido teclado composto pelo alfabeto em Libras.</p>\n\n<p>Crianças surdas brasileiras entre 8 a 12 anos de idade que estejam no início do processo de aprendizagem de Libras.</p>\n\n<ul><li><em><strong>Sistema Operacional:</strong> Windows Vista, 7, 8, 10</em></li><li><strong>Processador:</strong> 1.7+ GHz ou superior</li><li><strong>Placa de vídeo:</strong> Intel HD 3000 ou superior;</li><li><strong>Armazenamento:</strong> 2 GB de espaço disponível</li></ul>", "metacritic": null, "released": "2020-01-30", "tba": false, "updated": "2020-01-31T02:46:09", "background_image": "https://media.rawg.io/media/screenshots/e96/e96958765d78050c0caa2228beb070aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fit_instituto"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}