{"id": 407833, "slug": "waste-walkers-subsistence", "name": "Waste Walkers Subsistence", "name_original": "Waste Walkers Subsistence", "description": "<p><em>Three years have passed since the world was destroyed by man's inability to cooperate for the greater good. The world has been left in total ruin and humanity is on the verge of extinction. Chaos continues to consume civilization and fear haunts all who still draw breath. Those who do still breathe are confronted with terrible horrors each passing day. Surviving in this new world is not for the faint of heart.</em></p>\n<ul><li><em><em>Entirely New Adventure - Play In Role Of Spook, A Loner With A Dark Past, As He Attempts To Return To His Childhood Home In Search Of His Family!<br/></em></em></li><li><em><em>Powerful Storyline - Subsistence Focuses On A Main Plot But Has Many Side Quests And Other Things To Do!<br/></em></em></li><li><em><em>New Side Quests - New Side Quests And Missions To Complete!<br/></em></em></li><li><em><em>New Characters - Completely New Characters To Interact With!<br/></em></em></li><li><em><em>New Equipment - Fight With New Weapons And Armor!<br/></em></em></li><li><em><em>New Skills - Improve Your Survival Chances With New Skills And Even Some New Abilities!<br/></em></em></li><li><em><em>New Schematics - Build And Craft Even More Trinkets And Gadgets To Help You Survive!<br/></em></em></li><li><em><em>New Artwork - Totally New Artwork For Characters, Equipment, And Weapons!<br/></em></em></li><li><em><em>Dungeon Crawling - Plunge Into The Dark Underground And Face Unreal Horrors!<br/></em></em></li><li><em><em>Advanced Features - Many Features Of The Base Game Have Been Expanded Upon And Further Advanced!<br/></em></em></li><li><em><em>New Location - New Locations And New Areas To Explore!<br/></em></em></li><li><em><em>New Enemies - Face New Enemies And New Threats In The Wasteland!</em></em></li></ul>", "metacritic": null, "released": "2020-01-28", "tba": false, "updated": "2020-01-31T03:14:42", "background_image": "https://media.rawg.io/media/screenshots/dd8/dd8647d8865ee73cfd4cb7edf3408e4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Corrosion"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}