{"id": 407877, "slug": "deluge-the-rebellion-of-nat-turner", "name": "Deluge - The Rebellion of Nat Turner", "name_original": "Deluge - The Rebellion of Nat Turner", "description": "<p><strong>Background</strong><br/>It's very uncomfortable to release this. I've been shifting uncomfortably and cringing as I type.<br/><br/>I have an interest in making games that can be part of a larger discussion on race, and in 2017, I created this as an attempt to put something out about violence against slave owners.  It is one thing to intellectually agree with this, and it is another thing to experience it. <br/><br/>It's also another thing to know that a white person created this, perhaps you'll notice the underlying subtext - white guilt, self loathing, and a sense of self righteousness.<br/><br/><strong>Disclaimer</strong><br/>I would not create this today. <br/>Number 1: it's creating art around a legacy of black resistance, which, while inspiring, is not my own, and therefore not mine to make art around.<br/>Number 2: it deals directly with slavery in a way that is easy to disassociate from. I'm not the decedent of slave owners,  does that mean I get to feel self righteous and morally superior? Nope - I can trace the connection between my own success, and the advantages of growing up in a white community where home loans were available because of whiteness, and a family business passed through generations (also made possible because of whiteness).. and so on. Without that, I wouldn't be where I am. That's probably a game I need to make at some point, but that's for another day.<br/><br/>So why put this out at all? </p>\n<p>Well for one, I'm trying to embrace making mistakes. I am 37, and it's really only been the last 8 years that I've been having discussions about race. I'm going to make a lot more mistakes. Maybe I'm putting this out because for the first time I feel like I can hold space for potential negative feedback that will come in. I hope that the comments section of this game can be a space for vulnerable reflection and honest feedback. I'm also afraid. But that's okay. <br/><br/><strong>What to Expect</strong><br/>If you are white and you are playing this, you may feel uncomfortable, if so I encourage you to take some breaths and allow yourself to stay with the discomfort. In an ideal world, this game would be ideal to be played with a group of white people perhaps in the midst of reading My Grandmother's Hands. </p>\n<p>If you come from a lineage of enslaved black American's, I have no idea how this will hit you. Especially since we haven't developed a relationship of trust.  </p>\n<p>I created this game without really intending for it only to be played by anyone I didn't know, which allowed me to feel free enough to create some content that is more than a little icky. In the first 2 panels, I tried my best to convey the loss of dignity of slavery, to ground the violence to come in a sense of context, so that it wouldn't feel like a random game about killing. But in doing so I had to write dialogue from the perspective of an overseer talking to an enslaved black person, which is pretty disgusting, and hurtful. I only hope that the context in which it's provided makes it bearable. </p>\n<p><strong>Epilogue</strong></p>\n<p>For myself, playing this work allows me to to see where my heart was at 3 years ago. Today I am not without guilt, shame and loathing, but I am not wallowing in them any longer, and I don't see those emotions as useful tools to pull people into a white anti-racist struggle. I've found that outing white body supremacy inside myself is limited only by my own self compassion and resilience.  Today I seek to  find community with other white people who have an interest in a anti-racist movement. The problem comes from inside the house.</p>\n<p>Maybe you're white and you're reading this and you're like what the hell are you talking about! That's cool. I'm only like 8 years old at this and I may be coming at this journey from a very different direction than you. I'm still learning.</p>", "metacritic": null, "released": "2020-01-29", "tba": false, "updated": "2020-01-31T03:25:01", "background_image": "https://media.rawg.io/media/screenshots/982/982a28eec3f457fc2fd01cd3a8e89c2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["subtext"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}