{"id": 407828, "slug": "retro-rpg", "name": "RETRO-RPG", "name_original": "RETRO-RPG", "description": "<p>Immerse yourself in an exciting and exciting role-playing RPG in the spirit of dark fantasy dungeon, where you are waiting for hundreds of dungeons, enemies, weapons, armor, magic and more!<br/>To save the magical world, you need to crush the powerful warriors of Darkness. Develop the parameters of the hero – and create a hero of unprecedented power!<br/>You have to challenge ferocious bosses and other monsters. Improve your strategy and defense from battle to battle, and you will learn to defeat any villains.<br/>It is not enough to be just a hero RPG-here you need to become a legend RPG!<br/><br/>Download the game and join the fight!<br/><br/>⋇PECULIAR PROPERTIES⋇<br/><br/>STRATEGIC GAMEPLAY<br/>Think over the battle strategy. Decide which sets of artifacts to put on the hero RPG to strengthen your hero. Level up your RPG hero and unlock new maps. Collect the legendary armor and weapons, you can best use the skills of your hero and win any battle!<br/><br/>LOTS OF DUNGEON MAPS!<br/>Embark on a journey through the incredible labyrinths of dark dungeons, go down to the very core of hell on the very last floor and destroy the Lord of terror. Be careful here it is very easy to get lost or fall to the death of the brave.<br/><br/>GRAND BOSS BATTLES<br/>Win battles with dozens of bosses-and get valuable rewards, experience and unique things. Crush dragons, necromancers, Golems and other monsters that stand in your way as an RPG hero, and then re-enter locations to get rare equipment and experience.<br/><br/>PAY ATTENTION:<br/><br/>• In-game items can be purchased. Some of them, depending on the type, cannot be returned.<br/>* RPG available in early access.<br/>* RPG in your pocket, play wherever and whenever you want.</p>", "metacritic": null, "released": "2020-01-29", "tba": false, "updated": "2020-01-31T03:13:01", "background_image": "https://media.rawg.io/media/screenshots/07c/07c5dd02149b4105e726ff0d97a6e8b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blaggame"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}