{"id": 407993, "slug": "nostalgia-scp-091", "name": "Nostalgia SCP-091", "name_original": "Nostalgia SCP-091", "description": "<p>SCP-091  || Ref: http://www.scp-wiki.net/scp-091<br/></p>\n<p>THIS GAME IS TO HELP RAISE MONEY FOR THE SCP CONTAINMENT BREACH COMMUNITY!</p>\n<p>\r\nHelp contribute to support the open source community behind the SCP  lore: </p>\n<p>https://www.gofundme.com/f/scp-legal-funds<br/></p>\n<p>Check out the actual SCP Containment Breach Wiki: </p>\n<p>http://www.scp-wiki.net/</p>\n<p>I do not claim any rights to the franchise.</p>\n<p>-------------------------</p>\n<p>If you'd like to see a specific SCP experience, let me know what your favorite SCP is and how you'd like to see it portrayed in a game. <br/></p>\n<p>-------------------------<br/></p>\n<p><strong>Item #:</strong> SCP-091</p>\n<p><strong>Object Class:</strong> Anomalous Safe</p>\n<p><strong>Special Containment Procedures:</strong> SCP-091 is to be stored in a standard containment locker at Site-██. When SCP-091 is not being tested, it is to be placed under combination lock. Since SCP-091 has shown no signs of resistance to tearing or damage greater than that of normal cardboard, great care should be taken when transporting it to and from testing sites.</p>\n<p>During testing, no one other than the subject should view SCP-091. Those suspected of having seen SCP-091 are to be administered Class-B amnestics immediately, and all personal recordings or images in the possession of the subject—both print and digital—are to be destroyed to prevent recurrence.</p>\n<p><strong>Description:</strong> SCP-091 is a “Scotties” brand tissue box, currently empty. Immediately upon observing SCP-091, viewers report an overwhelming sense of nostalgia. Those affected begin reminiscing about times they “were near” SCP-091, major events that occurred while it was present, or people and places that somehow relate to it.</p>\n<p>SCP-091 was originally recorded as an anomalous item and sent to Reliquary Site-44, until one of the members of the recovery team, Assistant Researcher ████—while viewing a recording of her wedding from 199█—noted SCP-091 in the background of the film and noted a strong flood of nostalgic memories attached to it, including:</p>\n<ul><li>Memories of SCP-091 at the wedding itself.</li><li>Memories of SCP-091 at the reception.</li><li>Memories of SCP-091 during the honeymoon.</li></ul>\n<p>A further interview with Assistant Researcher ████’s ex-husband demonstrated that he too remembered SCP-091 in all of those places and situations, again noting strong feelings of nostalgia and fondness for it. Further investigation found that several people who attended the wedding remember SCP-091 being there and the emotional effect. Others were asked to describe the wedding itself without being informed of SCP-091. In these cases, they described the scene without including SCP-091, until they were questioned about it directly. At that time, they immediately underwent the same, previously observed effect.</p>\n<p>Continued testing under other situations has continued to produce similar results. Administration of amnestics has proven ineffective at stopping the effect if the subject is allowed to view an image or recording of SCP-091.</p>\n<p>Of note is the fact that in each recorded instance of SCP-091, the box pictured is full of tissues.</p>", "metacritic": null, "released": "2020-01-28", "tba": false, "updated": "2020-01-31T03:56:01", "background_image": "https://media.rawg.io/media/screenshots/074/0743140d4509ea7bb3e86d31e4b07510.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Devy_Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}