{"id": 408139, "slug": "plague-day", "name": "Plague Day", "name_original": "Plague Day", "description": "<p>Instructions:  Use LEFT MOUSE BUTTON to walk and interact with the environment. <br/>                               Use RIGHT &amp; MIDDLE BUTTON to adjust camera.<br/><br/>Plague Day is a detective RPG style serious game prototype for the Van Hall Larenstein University of Applied Science students. It is a platform where user can experience, analyse and learn from various real life zoonosis outbreak simulations.  On this project I have been working on programming early prototypes and UX-UI design. <br/><br/>Sadly our main programmer, who was responsible for implementing UI design worked last minute and did not manage to implement all of the features. Perhaps one day I will reprogram everything and implement what was lost.</p>\n<p>My approach to UX design was systematizing and reducing information by implementing interaction — choice to access as much information as one need in order to solve the outbreak. In some cases like dialogue choices instead of displaying full sentences I narrowed information to one word which makes experience more intuitive. There are several ways player can gather information: by interacting with environment, having conversations, conducting research (computer, microscope).To store, display and revise all the data I have designed a logbook system, a mechanic that stores and categorizes information in clues and sub-clues: #2clue Blood on the ground • the goat Betsy gave birth • blood contains Coxielia Buretti. Additionally once pressed the logbook is used to reveal more in debt clue explanation, read more about characters or locations, travel and configure settings.</p>", "metacritic": null, "released": "2020-01-27", "tba": false, "updated": "2020-01-31T04:31:11", "background_image": "https://media.rawg.io/media/screenshots/afe/afe550b3b0942b781e2e575f7775339a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Roocktopus"], "genres": ["Adventure", "RPG", "Educational"], "publishers": [], "esrb_rating": null}