{"id": 40828, "slug": "starsector", "name": "Starsector", "name_original": "Starsector", "description": "<p>The World of Starsector</p>\n<p>The interstellar Gate System which binds the space of the Human Domain in a network of trade, industry, and empire collapses in an instant that shatters known civilization forever. Countless fleets are scattered and lost. The comforts of the high age of civilization are but a memory. Entire worlds cut off from the Gate network starve, burn, and tear themselves apart. Now, humanity is scattered in pockets throughout the galaxy, trying to recover from the great Collapse.<br />\nThe story of Starsector concerns a dense region of space in the Perseus Arm left relatively unharmed by the calamity that destroyed the Domain. For over 200 cycles, humanity has been losing its grip on civilization and struggling desperately to hang on to what is left.<br />\nCurrent Features</p>\n<p>Pilot your ship in top-down 2D combat<br />\nCommand your fleet in tactical battles<br />\nGain experience to level up your skills<br />\nDetailed space combat mechanics<br />\nCustomize your ship’s loadout before battle<br />\nHire officers to give skill bonuses, pilot auxiliary ships, and oversee your operations<br />\nExplore war-torn star systems<br />\nExploit events to trade goods for profit<br />\nWin the favor or scorn of powerful factions<br />\nDiscover new worlds and salvage lost derelicts<br />\nMod support for diverse user-made content<br />\nClaim new worlds, build outposts and industry<br />\nComplete narrative missions and uncover hidden technology</p>\n<p>What will you discover in the ongoing development of the world of Starsector?</p>\n<p>Single player, gritty, dystopian sci-fi setting<br />\nClassic top-down gameplay style enhanced by modern technology<br />\nA procedurally generated galactic sector seeded with well-known core worlds and factions<br />\nDevelop your character into a hot-shot pilot, a smuggler, a stern admiral, an industrial magnate – or anything in between<br />\nOutfit ships with your weapons of choice and add hull modifications to create devastating tactical combinations<br />\nExplore hundreds of locations to find habitable worlds, rich resource deposits, and lost technology<br />\nAssemble a large, powerful fleet or a finely-tuned task force with hand-picked officers and crew<br />\nCripple core world supply lines to create easy prey for piracy or bolster the rule of law and try to reverse the Sector’s descent into chaos<br />\nSurvey forgotten worlds and establish new colonies among the ruins<br />\nUse lost and forbidden technologies to advance your cause – can you afford to pay for the consequences of your hubris?<br />\nLeave your mark upon the world and determine the fate of the Sector with your decisions</p>", "metacritic": null, "released": "2013-04-26", "tba": false, "updated": "2023-10-22T15:25:15", "background_image": "https://media.rawg.io/media/screenshots/d40/d4071c66ee11adb5a33630b5499c0322.jpg", "website": "", "rating": 4.57, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 8, "beaten": 1, "toplay": 12, "dropped": 2, "playing": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Fractal Softworks"], "genres": ["RPG", "Strategy"], "publishers": ["Fractal Softworks"], "esrb_rating": null}