{"id": 408283, "slug": "shadowgun-war-games", "name": "Shadowgun War Games", "name_original": "Shadowgun War Games", "description": "<p>Tactical multiplayer FPS (First Person Shooter) with outstanding graphics and intense PvP (Player versus Player) 5v5 battles. Work out your strategy for classic Capture the Flag or go in all guns blazing in Team Deathmatch. With intense multiplayer maps and modes, Shadowgun War Games is the best PvP experience on mobile!</p>\n<p>FREE TO PLAY CONSOLE-QUALITY FPS<br />\nTactical First Person Shooter action shooter with outstanding graphics, customizable controls, plus voice and text chat! Easy on-the-go FPS multiplayer shooter where everyone can experience truly competitive combat on their mobile device.</p>\n<p>STUNNING MAPS AND THRILLING GAME MODES<br />\nSquad up with friends and fight against players worldwide in arenas, maps and unique events across the Shadowgun Universe.</p>\n<p>EASY CONTROLS<br />\nIt’s fun and accessible for beginners and hardcore gamers will find plenty of challenge. Anyone can compete in Capture the Flag and Team Deathmatch game modes!</p>\n<p>UNIQUE HEROES AND ABILITIES<br />\nFrom Blink and Shield for defensive players to Berserk mode for more aggressive tactics. Customize your hero with unique skins, emotes, charms, stickers, etc.</p>\n<p>COMPETITIVE GAMEPLAY<br />\nMultiplayer PvP FPS that rewards skill and strategy in battle. Team tactics will ensure victory in this free to play multiplayer PvP First Person Shooter.</p>\n<p>UPDATES AND VARIETY<br />\nRegular updates will add more choice and complexity to the Shadowgun War Games PvP experience with the arrival of exciting new heroes, game modes, events, skins and emotes. The future of mobile gameplay is War Games!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2020-01-31T13:29:58", "background_image": "https://media.rawg.io/media/screenshots/373/37333e5464eda966022f9df43ab32957.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": [], "genres": ["Shooter", "Massively Multiplayer"], "publishers": [], "esrb_rating": null}