{"id": 408317, "slug": "ultimate-lion-simulator-2", "name": "Ultimate Lion Simulator 2", "name_original": "Ultimate Lion Simulator 2", "description": "Take on the life of our most realistic lion ever in the sequel to the most popular animal simulators of all time! Explore a wild world brimming with stunningly realistic plants and animals alike. Meet other lions in the savanna and live together, raise your family, hunt for food, and become the strongest lion pride bet in the world!<br/><br/>HYPER REALISTIC SIMULATION<br/>The savanna has never been more alive! Explore and hunt to maintain your lions thirst and hunger in the most detailed world we’ve ever created!<br/><br/>NEW ALERT SYSTEM<br/>Sneak your way through the tall grass of the savanna to avoiding alerting nearby animals and giving them a head start trying to escape you! Animal AI is smarter and faster than ever!<br/><br/>NEW BATTLE SYSTEM<br/>Omnidirectional dodge system brings a new level of skill to your fights! Quickly react to your opponents attack direction to dodge and avoid damage!<br/><br/>NEW RELATIONSHIP SYSTEM<br/>Build deeper bonds with your lions through the new relationship and personality system. Your pride recognizes heroic and caring acts that will alter the relationships between lions. Gain bonuses from synergetic lions hunting together!<br/><br/>EXPANDED PRIDE<br/>Have up to TEN lions in your pride! Seek out friendly lions and pass their challenges to recruit them to your pack! Play as your new lions to help them level up and improve relations with other family members!<br/><br/>BABY AND TEEN LIONS<br/>A brand new age makes raising your cubs even more real! Breed lion cubs that will grow into teens and eventually full grown members of your clan!<br/><br/>NEW CUSTOMIZATIONS<br/>Introducing expanded animal customization options for fine-tuning your lion's look! Alter physical features like height and ear size to accentuate a lion's personality!<br/><br/>CONQUER THE SPIRITS OF THE FOREST<br/>Challenge the four elemental spirits of the forest to battles on an EPIC scale! Overcome the power of the sun, pulverize powerful plants, and shred the shifting sands in increasingly difficult tests of your reflexes and timing!<br/><br/>UPGRADE STATS AND SKILLS<br/>Gain experience and level up your lions to unlock stat bonuses and unique skills! Skills will grant specialized lion abilities like healing, tracking, and battle strength!<br/><br/>NEW DEN CRAFTING<br/>Collect materials to decorate and upgrade your dens and make life for your lions even better! Building animal traps can provide your pack with a guaranteed tasty snack in the mornings!<br/><br/>MASSIVE OPEN WORLD SAVANNA<br/>We have done away with procedural flora, and have instead hand placed every blade of grass and tree in the world, bringing a more detailed purposeful world for you to explore!<br/><br/>REALISTIC WEATHER AND SEASONAL CYCLE<br/>The world around you change before your eyes with our brand new seasonal cycles. Lands flood in the rainy season, rivers dry up in the summer, and different climates will be altered accordingly to provide maximum realism.<br/><br/>INCREDIBLY DETAILED ANIMALS<br/>Discover the all new wildlife of the savanna! Improved AI and animations combined with species specific action trees will immerse you in our most detailed world to date. Track down animals like Elephant, Hyena, Rhinoceros, Camel, Tiger, Buffalo, Snake, Crocodile, Cheetah, Impala, Warthog, Zebra, Giraffe and of course lions!<br/><br/>IMPROVED NEXT-GEN GRAPHICS<br/>Introducing AAA PC quality graphics in a mobile simulator! With meticulously optimized models and textures, we’ve managed to reach an unrivaled level of visual quality!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the blood effects to add even more realism!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Ultimate Lion Simulator 2 and prove you can survive as a wild lion in our all-new completely revamped simulation!<br/><br/>If you liked living as a Lion then be sure to check out our other animal simulators!<br/><br/>We plan on creating more sequels so give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames", "metacritic": null, "released": "2020-01-31", "tba": false, "updated": "2020-02-03T02:00:23", "background_image": "https://media.rawg.io/media/screenshots/663/6637d25d8f3eb33df7ea933321cb8ca0_SVUtnlv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": "Teen"}