{"id": 408381, "slug": "haunted-house-repair-co", "name": "Haunted House Repair Co", "name_original": "Haunted House Repair Co", "description": "Controls\r\n<p>Arrow Keys for movement<br/></p>\r\nEssence statement \r\n<p>It’s your first shift at your new job. You’ve got a list of renovations to be completed at 100 Hauntley Street. You wanted to impress your boss so you asked for the toughest job. Little did you know the house is being torn apart by ghosts!</p>\r\nDescription\r\n<p>The player walks around a 2D, top down layout of a house. Their goal is to complete a list of repairs throughout a house. The repairs are abstracted into four categories. In order to complete the repairs, the player equips the right tool and stand on top of the area in need of repairs for a duration of time. The player is only be able to hold/equip two of four tools at any one time. Players can go to their van to switch out tools at any point</p>\n<p>Three types of ghosts roam the house. Each ghost has a different movement pattern inspired by the logic of the ghosts from Pacman. If a ghost enters a room while a player is repairing the room, it will scare the player out of the room and cause additional damage to the room (undoes one previous repair). </p>\n<p>Each ghost in the house has business they’ve left unresolved in their past life. Each room contains a section of narrative which explains the history of the house and the inhabitants who cannot let go of the past. </p>\r\nDesign Pillars\r\n<ul><li>Home repair: Players travel throughout the rooms of the house repairing different types of damage.</li><li>Spooky ghosts: 3 Ghosts roam the house and cause damage to a room if the player is in it.</li><li>Inventory management: Players have a tool belt that carry 2 of 3 tools for repairs.</li><li>Environmental story telling:  Each room contains narrative which explains why the house is haunted.  </li></ul>", "metacritic": null, "released": "2020-02-02", "tba": false, "updated": "2020-02-03T02:14:23", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MoeG"], "genres": [], "publishers": [], "esrb_rating": null}