{"id": 40831, "slug": "the-sims-3-generations", "name": "The Sims 3: Generations", "name_original": "The Sims 3: Generations", "description": "<p>Enjoy a whole spectrum of rich life experiences with your Sims! Start off in the imagination-fuelled world of childhood and embrace the drama of the teen years. Experience the complicated realities of adult life, then reap the benefits of growing up in each life stage. A wealth of new options and activities makes your Sims’ lives more meaningful than ever before, whatever their ages. With new celebrations, dramatic life events, and all-new ways for your Sims to express their creativity, The Sims 3 Generations lets your Sims live life to the fullest!<br />\nKey features:<br />\nSims of every age can enjoy new activities! Kids can hang out with friends in tree houses. Teens can pull hilarious pranks. Adults can suffer midlife crises. And so much more!<br />\nWhether it’s a raging all-teen party while the parents are out, a high school graduation or an official wedding ceremony, new celebrations make every age more fun!<br />\nFrom bachelor party hi-jinks to getting in trouble for bad grades to hearing rumors around town about Sims who cheat on their spouses, hilarity ensues when new drama unfolds!<br />\nSims will enjoy all-new ways to be creative including tinkering with chemistry sets, making their own home movies that they can watch on their own TVs, playing make believe as an astronaut, dinosaur, princess, and more!<br />\nAll of the new activities, celebrations, and drama are easier than ever to remember and reminisce about with a new Memories system that keeps track of major life moments and also lets you share them on Facebook or your Sims My Page!</p>\n<p>Online Disclaimer:<br />\nINTERNET CONNECTION, ONLINE AUTHENTICATION, ACCEPTANCE OF END USER LICENSE AGREEMENT, AND LATEST THE SIMS 3 PATCH UPDATE REQUIRED TO PLAY THE SIMS 3 DIGITAL DOWNLOAD PRODUCT. ACCESS TO ONLINE SERVICES INCLUDING SIMPOINTS AND DOWNLOADS REQUIRES AN INTERNET CONNECTION, EA ACCOUNT AND GAME REGISTRATION WITH THE PROVIDED ONE-TIME USE SERIAL CODE.  REGISTRATION IS LIMITED TO ONE EA ACCOUNT PER SERIAL CODE AND IS NON-TRANSFERABLE. EA ONLINE PRIVACY POLICY AND TERMS OF SERVICE CAN BE FOUND AT http://www.ea.com/&quot;&gt;www.ea.com. YOU MUST BE 13+ TO REGISTER FOR AN EA ACCOUNT.  MAC USERS MUST UPDATE TO THE LATEST VERSION OF THE SIMS 3 LAUNCHER TO ACCESS ONLINE SERVICES, INCLUDING SIMPOINTS AND DOWNLOADS.  [Manual only: EA MAY PROVIDE CERTAIN INCREMENTAL CONTENT AND/OR UPDATES FOR NO ADDITIONAL CHARGE, IF AND WHEN AVAILABLE.]  THE SIMS 3 DIGITAL DOWNLOAD PRODUCT USES SECUROM DIGITAL RIGHTS MANAGEMENT TECHNOLOGY PROVIDED BY SONY DADC AUSTRIA AG.  FOR MORE INFORMATION ABOUT SECUROM, VISIT https://support.securom.com/faq.html&quot;&gt;HTTP:/FAQ.SECUROM.COM/. GAME CAN BE PLAYED ON UP TO FIVE COMPUTERS AT THE SAME TIME; USERS CAN MANAGE WHICH COMPUTERS ARE AUTHORIZED OR DE-AUTHORIZED TO PLAY GAME.  VISIT http://activate.ea.com/deauthorize/&quot;&gt;http://activate.ea.com/deauthorize/ FOR MORE INFORMATION ON DE-AUTHORIZATION. INCLUDES SOFTWARE THAT COLLECTS DATA ONLINE NECESSARY TO PROVIDE AND ACTIVATE IN-GAME ADVERTISING FOR ALL THE SIMS 3 PRODUCTS PREVIOUSLY OR HEREAFTER INSTALLED.<br />\nEA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON http://www.ea.com/2/service-updates&quot;&gt;www.ea.com/2/service-updates.</p>", "metacritic": null, "released": "2011-05-31", "tba": false, "updated": "2024-02-09T20:20:29", "background_image": "https://media.rawg.io/media/games/8b1/8b1593118ffa323d0610fae66dd1083b.jpg", "website": "http://www.thesims3.com/game/ep4", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 12, "beaten": 13, "toplay": 1, "dropped": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 17, "platforms": ["macOS", "PC"], "developers": ["The Sims Studio"], "genres": ["Strategy"], "publishers": ["Electronic Arts"], "esrb_rating": null}