{"id": 409086, "slug": "deadlocke", "name": "deadlocke", "name_original": "deadlocke", "description": "<ul><li><strong><em>dead·lock </em></strong><strong><em>/ˈdedˌläk/ </em></strong><em>(n.)</em> a situation, typically one involving opposing parties, in which no progress can be made.</li></ul>\r\nSUMMARY ::\r\n<p>// After experiencing the monotonous day-to-day of being an errand runner, the first exciting thing happened in her life since forever plunged Red into going on the run with a reclusive hacker, Wolf. Although, whether if she can trust him or not, is another story entirely.</p>\n<ul><li><strong>Red,</strong> <em>the protagonist</em>, blunt and cynical, she has been under Vitriol's employment for the past years. Has grown bored and unhappy with her life but there's no better option.</li><li><strong>Wolf,</strong> <em>the hacker,</em> eccentric and easygoing, not much is known about him beyond the fact he has been working with Vitriol for a while now, he seems awfully relaxed for a person in his position despite what he said.</li><li><strong>Rhett,</strong> <em>the friend</em>, reserved and protective, the only person Red can trust in this place, he's also the one she owed her life to. Although she doesn't actually know much about him, she knows he can be relied on.</li><li><strong>Vitriol,</strong> <em>the boss</em>, detached and distant, doesn't care about anything except his own agenda. However, he'll help others if it benefit him.</li></ul>\r\nNOTES ::\r\n<p>// The game is a bit incomplete. As it is, it's finished but the script is only in the first draft meant for my Digital Narrative class. I intend to go over it again and smooth over details along with adding new contents since it's quite messy right now.</p>\n<p>// It'd be much appreciated if you can play and give feedback so I can improve the game :) Thank you for checking this out!</p>", "metacritic": null, "released": "2020-02-02", "tba": false, "updated": "2020-02-03T04:48:04", "background_image": "https://media.rawg.io/media/screenshots/931/931faf0a0d3181e4d32e461de9dff295.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vanxin"], "genres": [], "publishers": [], "esrb_rating": null}