{"id": 4090, "slug": "atelier-ayesha-the-alchemist-of-dusk", "name": "Atelier Ayesha: The Alchemist of Dusk", "name_original": "Atelier Ayesha: The Alchemist of Dusk", "description": "<p>The promise begins.<br />\nAfter times of prosperity, people must endure the dusk.<br />\nAs another of period of dusk begins, in a region of the world where people are beginning to live humble lives once again… This land lacks the system of a governed nation, yet people live together, hand in hand. There, in an isolated workshop, lives a girl who makes a living by making medicine. This girl&#39;s name is Ayesha. She used to live with her grandfather and younger sister, but after her grandfather passed away a few years ago, her sister also went missing. Now she is only left with her pet cow, and her solitude.<br />\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.<br />\nThe Atelier Ayesha  -The Alchemist of Dusk-  ©2012-2013 GUST CO., LTD. All rights reserved. The KT logo is a registered trademark of TECMO KOEI HOLDINGS CO., LTD.</p>", "metacritic": 73, "released": "2012-06-28", "tba": false, "updated": "2024-03-27T09:48:54", "background_image": "https://media.rawg.io/media/games/597/597f586ef56926a135744a7803ee3efe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 9, "beaten": 5, "toplay": 7, "dropped": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 740, "game_series_count": 24, "reviews_count": 4, "platforms": ["PlayStation 3"], "developers": ["Gust"], "genres": ["RPG"], "publishers": ["Koei Tecmo"], "esrb_rating": "Teen"}