{"id": 409170, "slug": "super-robert", "name": "Super Robert", "name_original": "Super Robert", "description": "<p><em>Super Robert</em> began as a final project for my senior year computer science class in the spring of 2018, I'm not entirely sure why making a video game about myself seemed like a good idea, but that's besides the point. I only made the first two worlds of the game, but I ended up having a lot of fun making this silly game, and decided I wanted to finish it. This January, I finally found a good opportunity to thanks to the 2020 Finally Finish Something Jam hosted by Second Dimension Games.</p>\n<p><em>Super Robert</em> is, strangely, a memoir (with various names, places, and details changed, of course,) following my life after moving from Illinois and New York. You play as me and dodge pigeons, cars, and giant pianos, while collecting headphones, music notes, and brownies. It's not just platforming, though, because there are also mini-games and boss fights that break up the side-scrolling. If you play well enough, you can even take a vacation to Maine to earn extra points and lives!</p>\n<p>This game is done in the style of a Nintendo Entertainment System game, attempting to utilize the same palette, sprite limitations, and audio track limitations. Like many NES platformers, the game has eight worlds, and each world has four levels each, plus a mini-game and a boss battle.</p>\n\n<p>The main game follows the format of a traditional side-scroller: move to left and jump over enemies and obstacles, collecting power-ups, and reading dialogue from various characters along the way. Between levels, though, you'll get to see a map of all the levels in the current world. Simply move Super Robert between these with the arrow keys, and press start to begin. The bright pink bonus levels work the same way, and can only be completed once per world.</p>\n<p>If at any point, you're ready to take a break, pressing the space bar on the world map will let you see a postcard from Super Robert, complete with a secret password on the right. Take note of this password, since you'll be able to use it next time you boot up the game by pressing the space bar on the title screen.</p>\n<p>Even though this game is odd and not very innovative, I hope you enjoy playing it!</p>\n<p><strong>Instructions:</strong></p>\n<p>Enter - Start/Pause/Begin Level</p>\n<p>Space - Jump/Continue/View Password/Select</p>\n<p>Arrow Keys - Move</p>\n<p>Z - Shoot a CD</p>", "metacritic": null, "released": "2020-02-02", "tba": false, "updated": "2020-02-03T05:06:17", "background_image": "https://media.rawg.io/media/screenshots/c75/c75f71fb3f1adc8612d4cf416fb62bbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["robert0504"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}