{"id": 4094, "slug": "metal-gear-rising-revengeance", "name": "Metal Gear Rising: Revengeance", "name_original": "Metal Gear Rising: Revengeance", "description": "<p>After the events of the uprising took four years. Naomi Hunter creates the FOXAVILE computer virus that destroys the system of &quot;Sons of the Patriots&quot;, thereby putting an end to the military economy, what turned the war into a profitable business. PMSC (Private Military Security Companies) began to protect essential people and act as peacekeepers. You play as Raiden, a katana-wielding cyborg who is forced to join the PMSC to protect his family.</p>\n<p>Most of the gameplay Raiden has to cut enemies and some objects with a mighty high-frequency sword. Along with the standard attacks available &quot;Free sword mode&quot; that allows you to control the assault. In the open mode, attacks are more powerful, but the range of their impact is lower. For the elimination of enemies in Free mode are given points that allow you to restore health and the scale of the free sword with the help of fluids that are in the spine of dead cyborgs.</p>\n<p>Being undetected, you can perform silent and quick kills on some enemies approaching from behind or from above. Available, at least, ten kinds of weapons and a few suits.</p>", "metacritic": 83, "released": "2013-02-19", "tba": false, "updated": "2024-04-21T07:22:30", "background_image": "https://media.rawg.io/media/games/8e6/8e699e91cf77c2060b6d515e2135b1b1.jpg", "website": "https://www.konami.com/mg/archive/mgr/", "rating": 4.24, "rating_top": 5, "added_by_status": {"yet": 331, "owned": 3732, "beaten": 1071, "toplay": 204, "dropped": 285, "playing": 57}, "playtime": 6, "achievements_count": 116, "ratings_count": 1177, "suggestions_count": 655, "game_series_count": 14, "reviews_count": 1190, "platforms": ["PlayStation 3", "Xbox 360", "PC", "Android", "Xbox One"], "developers": ["Platinum Games"], "genres": ["Action"], "publishers": ["Konami"], "esrb_rating": "Mature"}