{"id": 409573, "slug": "starship-troopers-terran-command", "name": "Starship Troopers - Terran Command", "name_original": "Starship Troopers - Terran Command", "description": "<p>Starship Troopers - Terran Command is a thrilling real-time strategy game set in the Starship Troopers movies universe. Take command of the Mobile Infantry and do your part in the war against the Arachnid threat. Build, develop and control your armies to strike an effective balance between tactical superiority and strength in numbers. Ensure that human civilization, not insect, dominates the galaxy now and always!<br />\nPlanetary Campaigns<br />\nFight for control over an entire planet in the campaign mode, where the storyline and missions develop according to your choices and achievements on the battlefield. Remain obedient to the demands of Terran Command – no matter how costly or ruthless – to benefit from exclusive unit types and special abilities, or follow your own path to glory to become an irrefutable Hero of the Federation. Develop and customize your forces through a detailed technology tree and upgradeable leader characters that can be assigned to your units.<br />\nTactics &amp; Numbers<br />\nWhile the Arachnids can rely on virtually limitless numbers, the Mobile Infantry must develop effective tactics to overcome this imbalance. Deploy your units at strategic locations to cover vital choke points and gain superior firepower through tactical use of elevation levels. Be wary, however, that battle mechanics such as True Line of Sight and True Line of Fire also allow Bugs to lay ambushes around every corner, as they are well known for their use of surprise attacks and deception.<br />\nUnits &amp; Abilities<br />\nAn expansive range of unique units, weapons, and special abilities are at the disposal of MI commanders. Infantry squads armed with Morita Assault Rifles and MX-90 Fragmentation Grenades form the mainstay of your forces. Rocket Troopers deliver deadly payloads with pin-point accuracy while Engineers are vital to shore up defensive positions with MG turrets, barricades, and minefields. As a campaign progresses, technological breakthroughs unlock the true potential of the Federation’s arsenal with Power Armor infantry squads, TAC Fighter airstrikes, Marauder mobile suits, and many more developments optimized for spraying Bug ichor across the battlefield.<br />\nKey features<br />\n- Dynamically generated campaigns for virtually limitless replayability.<br />\n- Dozens of unique unit types, each with their own special abilities.<br />\n- Terrain elevation, True Line of Sight &amp; True Line of Fire provide deep tactical gameplay.<br />\n- An extensive technology tree to develop and customize your forces.<br />\n- Persistent leaders can be attached to units and upgraded throughout the campaign.<br />\n- Heroics, explosions, gore, and Bugs. Lots of Bugs.</p>", "metacritic": 70, "released": "2022-06-16", "tba": false, "updated": "2024-04-08T07:07:51", "background_image": "https://media.rawg.io/media/screenshots/028/02824bfe061591cf8c8dd3b2d0ccad4d.jpg", "website": "", "rating": 2.93, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 12, "beaten": 8, "toplay": 8, "dropped": 8, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC"], "developers": ["The Artistocrats"], "genres": ["Strategy"], "publishers": ["Slitherine"], "esrb_rating": null}