{"id": 409522, "slug": "the-giraffe-who-wants-to-collect-every-cute-tiny-h", "name": "The Giraffe who wants to collect every cute tiny hat", "name_original": "The Giraffe who wants to collect every cute tiny hat", "description": "<p>Welcome. You now live in a world where a giraffe can lengthen it's fabulous neck for the sole purpose of collecting cute tiny hats.</p>\n<p>Go through 25 hand crafted levels to help the giraffe accomplish it's goal in this puzzle-game where the path you take is now an occupied path. There's also 5 unique bonus level to unlock !</p>\r\nHow to play\r\n<p>Use the <strong>\"WASD\"</strong> buttons or the <strong>arrow keys</strong> to move.</p>\n<p>Press the <strong>\"R\"</strong> button to reset the current level.</p>\n<p>Press the <strong>\"P\"</strong> button to display the pause menu.</p>\n<p>There's a fullscreen button in the bottom right corner of the game window.</p>\n<p>The goal is to collect all the hats on each level. You will also have to collect keys to help you find a way. In the level selection menu you can see that there are high scores. The high score is the lenght of the giraffe at the end of the level, the more, the better. Get some high scores to unlock the bonus levels !</p>\r\nTrivia\r\n<ul><li>It's my first ever game made with Unity and it took me around 3 months during my free time.</li><li>During coding I kept messing the spelling of \"giraffe\" because in French it's \"girafe\" with only one \"f\".</li><li>There is no undo button because the levels are very short to do and I wanted people to plan their path as a whole.</li><li>The sheeps you can see during the game looks a bit like TomSka's sheep and I find it funny.</li><li>Yes, level 23 is a bit weird.</li></ul>", "metacritic": null, "released": "2020-01-31", "tba": false, "updated": "2020-02-03T06:21:46", "background_image": "https://media.rawg.io/media/screenshots/497/49717af96ac7765c5daddc6770a52177.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Quentin Delvallet"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}