{"id": 409604, "slug": "mix-paint", "name": "Mix & Paint", "name_original": "Mix & Paint", "description": "Prepare to embark on a mesmerising artistic adventure with \"Mix &amp; Paint,\" the ultimate happy colour experience that brings the joy of colours to life! Unleash your inner artist as you dive into a world where colouring games and paint by number combine to create a truly creative experience. Get ready to mix and paint vibrant hues, and transform blank canvases into vibrant works of art. <br/>Mix &amp; Paint is not your typical art game—it's a unique combination of colour match gameplay, paint by number, and the joy of colouring books. With its innovative concept, this art game will truly ignite your imagination and leave you feeling inspired… to mix colours!<br/>The gameplay revolves around the concept of happy colour match and paint by number. Each level presents you with a beautiful colour sample, and it's your task to mix colours using a variety of pigments at your disposal. Tap colour strips and blend them together to create the perfect shade that matches the sample. Feel the satisfaction as you watch the colours blend harmoniously, revealing the ideal hue.<br/>Once you've mastered the art of colour match, it's time to unleash your creativity on the canvas. Tap colours from a wide range of stunning pictures and apply your meticulously mixed colours to bring them to life. From breathtaking landscapes to adorable animals and intricate patterns, there's an abundance of artistic possibilities waiting for you.<br/>This paint by number colouring game offers a relaxing and engaging experience, perfect for both casual gamers and art enthusiasts alike. Whether you have a few minutes to spare or want to dive into an immersive colouring session, this game has you covered. Take a break from the hustle and bustle of everyday life, grab your mobile device, and let the happy colours transport you to a world of tranquility and self-expression.<br/>Features:<br/>Innovative mix and paint gameplay combined with the joy of colouring books<br/>Tap colour swatches and blend them together to create the perfect shades<br/>Dive into a wide range of pictures, from landscapes to animals and patterns<br/>Relaxing and engaging gameplay suitable for all ages<br/>Experience the satisfaction of colour match and precise painting<br/>Free your mind and explore the endless possibilities of mix and paint colouring games<br/>Immerse yourself in a world of vibrant hues and artistic expression<br/>Plunge head first into a colourful journey of self-discovery and artistic fulfilment! Download Mix &amp; Paint now and unleash your inner artist! Let the happy colours inspire you as you create breathtaking masterpieces with every stroke of your virtual brush.", "metacritic": null, "released": "2019-12-20", "tba": false, "updated": "2023-07-14T05:36:29", "background_image": "https://media.rawg.io/media/screenshots/86a/86a835121d9029a06b0b789be29a6784_ZhHdLUY.jpg", "website": "https://www.geishatokyo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Geisha Tokyo", "Elran Harpazi"], "genres": ["Simulation", "Casual", "Puzzle"], "publishers": ["Geisha Tokyo", "Elran Harpazi"], "esrb_rating": null}