{"id": 409726, "slug": "madievals-chapter-one", "name": "Madievals: Chapter One", "name_original": "Madievals: Chapter One", "description": "<p>Immerse yourself in the first chapter of the comedy and grotesque atmospheres of Madievals!</p>\n<p>A completely 3D point&amp;click adventure like you haven’t seen for a long time, perfect for the whole family!</p>\n<p>A fearless knight named Rusty Steelknee, hunter of precious relics, arrives in the Realm of Manzasun. Nothing is known about him, apart from the fact that he’s never separated from his helm, his horse Spoffy and his cast iron drawers, and that his purpose is to take possession of the Idol Lamp, kept inside the Ascension Temple.</p>\n<p>The realm, though, has been afflicted by a curse, the CuPeNEver, and surrounded by a terrible eternal darkness. Very soon, Rusty – due to both his proud temper and a series of not exactly accidental coincidences – will become involved in something much bigger than him.</p>\n<p>But Rusty will know how to tackle the adventure head-on, and with his self-deprecating sarcasm he will be able to disentangle himself from extraordinary situations!</p>\n<p>Fascinating and mysterious story, full of absurd and zany scenarios.<br/>Funny dialogues with lots of bizarre characters.<br/>Unusual puzzles but with their own logic.<br/>Ability to switch to 2D pixel art as many like nowadays, provocative women to conquer and a final prize of a million golden doubloons to win! (Okay, that’s not true, but the game is really funny, promise!)</p><p>TITLE: Madievals: Chapter One<br/>GENRE: Adventure<br/>DEVELOPER: 2finger, Netminds <br/>PUBLISHER: Daring Touch, Netminds<br/>RELEASE DATE: 16 Jul, 2019</p>", "metacritic": null, "released": "2020-02-06", "tba": false, "updated": "2020-02-07T02:34:26", "background_image": "https://media.rawg.io/media/screenshots/448/4480c1bace51ebf96a536c588bd42bea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carlo_DT"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}