{"id": 410058, "slug": "interdimensional-spike", "name": "Interdimensional Spike", "name_original": "Interdimensional Spike", "description": "<p>This game was created for the NOKIA 3310 JAM  (https://itch.io/jam/nokiajam2).<br/></p>\n<p>This is the first game jam I have participated in and I am glad I joined. <br/></p>\n\n<p>The theme of the jam was \"death is good\", and while I at first thought about creating a game where you play as Death and you give away free doughnuts... I went with a more simple approach that fits my current skill while challenging me a bit and still being achievable in a short time.</p>\n\n<p>That turned out to be a platformer where you use death as a way to progress easier. <br/></p>\n<p>Many of the mechanics you see here I have never worked on before, so it was an interesting challenge. And it turns out the limited pixels on screen affect the movement of objects in-game in terms of moving a set number of pixels per frame, I didn't consider this stuff before working under these limitations. <br/></p>\n<p>I would have liked to add more mechanics related to using death, maybe some more levels and such. Didn't manage to in time. <br/></p><p>Also would have loved to have some better looking assets in it. But this is what I could do, and as you can see, I am not an artist, haha. The SFX might not be the best fit for the old Nokia phone either.<br/></p>\n<p>Anyway, the game as it is right now feels even to me more like a demo of different mechanics than a.. well, a well thought out game. But I am very happy I worked on it, it was very engaging and I learned something from it.<br/></p>", "metacritic": null, "released": "2020-02-05", "tba": false, "updated": "2020-02-07T04:00:23", "background_image": "https://media.rawg.io/media/screenshots/325/3258fcfb686c5f5b11e14edf58348610.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["yaotu"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}