{"id": 410385, "slug": "this-fighting-game-is-broken", "name": "This Fighting Game is Broken", "name_original": "This Fighting Game is Broken", "description": "<p>You are a game developer working on a successful fighting game. There’s just one problem - the game’s fighters are imbalanced! Different fans want different things from this balance, not to mention your boss and the game's esports Sponsor, Pop-Aid! The scene is split on the game, and it’s your job to fix it!</p>\n<p>You will create balance patches for your fighting game by modifying character stats. You will get feedback from your different constituents about the game, hinting at their desires. Your <strong>boss </strong>wants characters to follow their planned archetypes, based on their descriptions and designs. Your <strong>sponsor</strong>, not knowing much about game dev, requires a random stat change each session. The <strong>other groups</strong> then have different preferences, which they will hint at.</p>\n<p>You have four quarters to satisfy everyone, and each change eats up your limited quarterly budget, so choose wisely! Make the right changes and bring harmony to the FGC!</p>\n<p>Originally created for the Global Game Jam 2020 with the theme of \"repair\" (in this case, fixing broken fighting game characters).</p>\n<p><strong>Credits</strong><strong>:</strong></p>\n<p>Michael Alvarez<br/>Christopher Brown<br/>Stan Chou<br/>Dakota Hernandez<br/>Edgar San Martin</p>", "metacritic": null, "released": "2020-02-03", "tba": false, "updated": "2020-02-07T05:19:23", "background_image": "https://media.rawg.io/media/screenshots/a43/a43e99f48be9cdeaf5223ef1bd825252.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Dakota Hernandez"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}