{"id": 41033, "slug": "the-sims-3-town-life-stuff", "name": "The Sims 3: Town Life Stuff", "name_original": "The Sims 3: Town Life Stuff", "description": "<p>The Sims™ 3 Town Life Stuff introduces venues complete with dozens of new objects to give your Sims’ town and homes a makeover. Customize a new library, an exclusive gym, a fun playground, or a fresh laundry room. Your Sims get more than new décor and style options—they get new community venues, like Scrumptious Nibbles Café, for your Sims to visit too!<br />\nKey features:</p>\n<p>Pre-Built Venues and Lots: Give your Sims’ town a new look with spectacular ready-to-go venues and community lots—or construct your own cool setting.<br />\nFit and Fresh: Work out with the latest high-tech gym equipment, then clean your sweaty gym clothes in the new state-of-the-art washer and dryer set.<br />\nTime to Unwind: Kids will love the new Sunny Bungalow jungle gym, slide, and sandbox, while grown-ups can play chess by the new fountain.<br />\nStudy Time or Story Time: Update the library with an elegant array of accessories, build your own study, or create cubicles with specialized sectional seating.<br />\nNew Casual Outfits and Hairstyles: Clothes for running errands, hanging out, or working out—there are lots of styles for all your Sims’ fashion needs.</p>\n<p>Online Notice:<br />\nINTERNET CONNECTION, ONLINE AUTHENTICATION, ACCEPTANCE OF END USER LICENSE AGREEMENT, AND LATEST THE SIMS 3 PATCH UPDATE REQUIRED TO PLAY THE SIMS 3 DIGITAL DOWNLOAD PRODUCT. ACCESS TO ONLINE SERVICES INCLUDING SIMPOINTS AND DOWNLOADS REQUIRES AN INTERNET CONNECTION, EA ACCOUNT AND GAME REGISTRATION WITH THE PROVIDED ONE-TIME USE SERIAL CODE.  REGISTRATION IS LIMITED TO ONE EA ACCOUNT PER SERIAL CODE AND IS NON-TRANSFERABLE. EA ONLINE PRIVACY POLICY AND TERMS OF SERVICE CAN BE FOUND AT http://www.ea.com/&quot;&gt;www.ea.com. YOU MUST BE 13+ TO REGISTER FOR AN EA ACCOUNT.  MAC USERS MUST UPDATE TO THE LATEST VERSION OF THE SIMS 3 LAUNCHER TO ACCESS ONLINE SERVICES, INCLUDING SIMPOINTS AND DOWNLOADS.  [Manual only: EA MAY PROVIDE CERTAIN INCREMENTAL CONTENT AND/OR UPDATES FOR NO ADDITIONAL CHARGE, IF AND WHEN AVAILABLE.]  THE SIMS 3 DIGITAL DOWNLOAD PRODUCT USES SECUROM DIGITAL RIGHTS MANAGEMENT TECHNOLOGY PROVIDED BY SONY DADC AUSTRIA AG.  FOR MORE INFORMATION ABOUT SECUROM, VISIT https://support.securom.com/faq.html&quot;&gt;HTTP:/FAQ.SECUROM.COM/. GAME CAN BE PLAYED ON UP TO FIVE COMPUTERS AT THE SAME TIME; USERS CAN MANAGE WHICH COMPUTERS ARE AUTHORIZED OR DE-AUTHORIZED TO PLAY GAME.  VISIT http://activate.ea.com/deauthorize/&quot;&gt;http://activate.ea.com/deauthorize/ FOR MORE INFORMATION ON DE-AUTHORIZATION. INCLUDES SOFTWARE THAT COLLECTS DATA ONLINE NECESSARY TO PROVIDE AND ACTIVATE IN-GAME ADVERTISING FOR ALL THE SIMS 3 PRODUCTS PREVIOUSLY OR HEREAFTER INSTALLED.<br />\nEA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON http://www.ea.com/1/service-updates&quot;&gt;www.ea.com/2/service-updates.</p>", "metacritic": null, "released": "2011-07-26", "tba": false, "updated": "2023-03-02T20:40:28", "background_image": "https://media.rawg.io/media/games/cdd/cdd510e3c9ba52e175399806c6827ccd.jpg", "website": "http://www.thesims3.com/game/sp4", "rating": 3.67, "rating_top": 4, "added_by_status": {"owned": 6, "beaten": 9, "toplay": 1, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC", "macOS"], "developers": ["The Sims Studio"], "genres": ["Strategy"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}