{"id": 410317, "slug": "ggj20-every-problem-looks-like-a-nail", "name": "GGJ20 - Every Problem Looks Like A Nail", "name_original": "GGJ20 - Every Problem Looks Like A Nail", "description": "<p>WINNER:  noisebridge GGJ2020 \"Best Narrative Design\"</p>\n<p>Made for Global Game Jam 2020, with the theme \"Repair\"   https://globalgamejam.org/2020/games/every-problem-looks-nail-2</p>\n<p>I guess Wac-a-mole meets job simulator? </p>\n<p><strong>How to play</strong></p>\n<p> WASD to move, LMB to use the hammer. The \"looking busy\" timer will drain as time goes on, hit any object to fill it. Some objects give you points, some are neutral some are minus points... but all have particle effects.</p>\n<p><strong> Concept</strong></p>\n<p>GGJ used to have super artsy themes, they've stopped recently but I still think of them more high concept than other jams so that's how I landed on starting from the old expression. I also knew I only had a day this weekend and was soloing. So the concept is basically the old expression \"When all you have is a hammer every problem looks like a nail.\" Usually overused to explain that programmers need a bigger toolkit. But sometimes people just keep using the tool they know, even if it won't solve I mean \"repair\" their current problem. </p>\n<p><strong>Things I didn't have time for:</strong></p>\n<ul><li> no fancy combos. </li><li>I mostly wanted to just learn more about particles in unreal so that's what I spent most time on </li><li>Only one reference to my cats in the name of an item. WAY to few cats in this game.</li><li> Real Game balance... ( Is it unbalanced or is it the Dark Souls of Wac-A-Mole? A: yeah, it's just unbalanced and impossible after 30 seconds, the drain time ramps up and the increase from hitting ramps down to min at like 30-45 seconds while spawn time increases )</li></ul>", "metacritic": null, "released": "2020-02-04", "tba": false, "updated": "2020-02-07T05:02:51", "background_image": "https://media.rawg.io/media/screenshots/c66/c668c4ec173180a0f1378bf1a5c82e51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UltraRat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}