{"id": 41038, "slug": "recall", "name": "Recall", "name_original": "Recall", "description": "<strong><h3>Story</h3></strong><br/>Can is a man who grew up in an orphanage and devoted his life to boxing. When Can wins the gold belt at the World Championship, something happens to him.<br/>After this incident, Akın, his closest friend, disappears. This mysterious disappearance of Akın takes Can on an adventure. During this adventure, Can encounters people he did not know and did not get involved with. Coach Güray, who is the biggest supporter of Can during these events, helps him and becomes a partner in this adventure with him.<br/><strong><h3>Gameplay</h3></strong><br/><ul><li>Our main weapons will be our fists in this melee-based game. Combo attacks, blocking the opponent's hits and dodging are the best way to show your skills, the more you develop in this area, the faster and more effectively you can neutralize your opponents.<br/></li><li>In addition to punches, you can also use the objects we find around. For example, you can take a bottle and throw it at your enemy.<br/><br/><br/><br/></li><li>When it comes to life and death, you will want deadly weapons, use knives and firearms for this.<br/></li><li>Try to use your weapons for different purposes. For example, if you run out of ammo in your pistol, you can throw your gun at the enemy or grab a bottle and throw it to distract the enemies.<br/><br/><br/><br/></li><li>You can get weapon attachments from some people in the city to upgrade your weapons.</li></ul><h3>Join our Discord:</h3>", "metacritic": null, "released": "2021-06-25", "tba": false, "updated": "2021-07-02T02:42:02", "background_image": "https://media.rawg.io/media/screenshots/6f8/6f8704e384c34423df7f127648b284e5.jpg", "website": "http://recallgame.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jaewoo Jay Jeon", "Recall Studios"], "genres": ["Action", "Adventure", "Arcade", "Indie"], "publishers": ["Jaewoo Jay Jeon", "Recall Studios"], "esrb_rating": null}