{"id": 410448, "slug": "dodge-minigame", "name": "Dodge minigame", "name_original": "Dodge minigame", "description": "<p>This was my first ever developed game. Everything was coded by me when i was starting to learn programming. </p>\n<p>This is far from what a game should be, but I'm not sure if i will continue this project, and because of that, i'm posting it here has it is right now, just to not feel like it went to waste. The reason why, is that the coding behind the project is very confusing, and i would probably need to re-code the whole thing.</p>\n<p>Game developed using unity, sprites, music, sound effects, and again, coding, all developed by me.</p>\r\nHow to install:\r\n<p>1 - Extract the zip file anywhere on your computer</p>\n<p>2 - Open the  dodge.exe</p>\n<p>3 - Have fun</p>\r\nHow to play:\r\n<p>- Well, as you all can guess, because of my creative choice of a name, your objective in this game is to dodge, and survive for the longest duration possible. The top 10 players, whom have survived the longest, will be displayed on the game's menu.</p>\n<p>- The shop is not functional. The ability there itself is already done, and the money system too, just haven't done the shop itself working, and didn't put any kind of limitation to the ability, so i decided to disable the feature, unless of-course, otherwise requested by people to finish its development.</p>\n<p>- Use your WASD keys or arrow keys, or any joystick you have laying around should work too</p>\n\r\nKnown issues: \r\n<p>- You can get out of the field of view, I felt that making the camera follow the player making this game way too easy, so i removed this feature. Imagine invisible walls there, and just try to not go out of your screen :3</p>\n<p>- If you're getting \"Bank: unable to calculate\", I'm not entirely sure what causes it yet, but your score might not be uploaded because of it. To fix it, go to \\Dodge\\Dodge_Data, open savegame.txt, put a 0 in there and save.</p>\n<p>This game was only tested on 1080p monitors, i have no clue how it will behave or look on other resolutions, but i don't think there should be a problem.</p>\n\n<p>To finish this, I'm not proud of the result, far from it, i could improve many things and add many features, but as i said before, old coding, and its the first ever game/mini-game developed by me, so want to have this gem somewhere to be remembered ^-^</p>", "metacritic": null, "released": "2020-02-03", "tba": false, "updated": "2020-02-07T05:33:29", "background_image": "https://media.rawg.io/media/screenshots/558/5586154d1d6956447fa668bfef469bc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Loading"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}