{"id": 410806, "slug": "fx-me-im-famous", "name": "F!x me ! I'm famous", "name_original": "F!x me ! I'm famous", "description": "Description\r\n<p>Two teams of robots race to gather their master computer parts and reassemble them. Each team try to reproduce the computer configuration pattern : the blue one is displayed on the top-left corner of the screen, the red one on the bottom-right corner.</p>\n<p>The first team that reproduces its pattern wins. Your are free to put the parts anywhere on the map. the only condition is to have a matching-pattern somewhere on the map.<br/></p>\n<p>Any robot can pick a part. At this point the part takes its carrier color. When your try to take an opponent-coloured part, you will have to wait for a while in front of it, until its color changed back to yours. That means it is easier and faster to take a white part than an enemy-coloured one. But it is not safe to let your opponent finish its pattern before you. It is up to your team to decide which strategy you will use.<br/></p>\n<p>This game was performed during the Global Game Jam 2020 event in Cergy - FRANCE. Enjoy !\r\n</p>\r\n\r\nPlay here !\r\n<p>If you want to test the game directly in your web browser, click here !</p>\r\n\r\nControls\r\n<p>All controls are performed with a gamepad.</p>\n<p>At start, press the A button to register your robot. When your robot is displayed on screen, press A again to change your team (either blue or red). Whatever the number of gamepads you have, anyone can join the game by pressing A.</p>\n<p>When all players are ready, one can press START button and the race begins.</p>\n<p>Move your robot using either the left analog axis, or the cross. Grab a computer component by keeping A button held. When you release  this button, the computer part is left on the floor. <br/></p>\n<p>When you try to take a computer part that is enemy-coloured, you have to wait with A button pressed for a while : the color will fade to white, and then will get your team color : the computer part is now yours and you can move it anywhere.<br/></p>\r\n\r\nDownload\r\n<p>\n</p>\r\n\r\nGFX\r\n<p>\r\nThis game contains original graphics made using GIMP during this game jam.\r\n</p>\r\n\r\nMusic\r\n<p>\r\nThis game contains original music created by 'Hyperspace Jelly\" : please visit its website to discover other creations.\r\n</p>\r\n\r\nRepository\r\n<p>\r\nThe GIT repository is available here.<br/>\n</p>\r\n\r\nLicence\r\n<p>\r\nCreative Commons BY-NC-SA 3.0 (Attribution-NonCommercial-ShareAlike 3.0 Unported) - 2018 - RPH Studio.<br/>\n</p>", "metacritic": null, "released": "2020-02-02", "tba": false, "updated": "2020-02-07T07:05:46", "background_image": "https://media.rawg.io/media/screenshots/9e1/9e1e569c4394d80213ae5691b7d1b539.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RPH Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}