{"id": 410954, "slug": "lan-pfusher", "name": "LAN Pfusher", "name_original": "LAN Pfusher", "description": "<p>You are Jean-Michel, the IT guy and you are going to work all night for the Pfuscher LAN. Your job ? Simply be fast, smart and repair as fast as possible the material of LAN members. If LAN members are not repaired quickly, their satisfaction will decrease and will leave the LAN. If there is no motivation anymore, the game is finish, you lose !<br/>Goal : Get the best score</p>\n<p>Legend : Player : you : the real player Gamer : NPC : Characters playing in LAN you need to repair</p>\n<p>Controls :<br/>With NES manette use :<br/>A : Repair / use / get item<br/>X : Drop<br/>Left trigger : Choose previous item<br/>Right trigger : Choose next item<br/>Direction panel : Move your character</p>\n<p>With keyboard :</p>\n<p>How to play : <br/>All items are stored in the basement. Go in front of a locker and get item by clicking on A.<br/>If one person have a problem, it will be notified by red display on it screen with a picture of the needed item for reparation.<br/>To repair, go in front of the PC with the right item and click on A to repair. Wait until the screen of the gamer remain with a game instead of the error.<br/>You have only 10 slots for items, you will need to come back to basement.</p>\n<p>They are different type of gamers in the LAN. Depending on the type of gamer, they will lose their motivation more or less quickly. Giving them items like coffee, beer and so on will increase their motivation. Repairing their PC you also increase it.<br/>If the motivation of the lan players are going to 0 you lose the game and your score is saved. Play with your friends to have the best score ! :)</p>", "metacritic": null, "released": "2020-02-09", "tba": false, "updated": "2020-02-10T02:17:19", "background_image": "https://media.rawg.io/media/screenshots/4ab/4abacbbc13693c3987d80352b55d9c4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aston966"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}