{"id": 411, "slug": "how-to-survive-2", "name": "How to Survive 2", "name_original": "How to Survive 2", "description": "Find water, food and shelter and talk to the unconventional locals to make your way around.<br />\nAn eccentric masked stranger offers you help? Sure, sounds way better than zombies!<br />\n• Multiplayer is here! You can invite up to 16 players to access your camp and 4 of you can play simultaneously online<br />\n- Local coop : up to 4 player simultaneously on the same PC<br />\n- Players in local Coop can join an online game (i.e. 16 players can play simultaneously)<br />\n• Teamwork: all players can contribute to a bigger, better camp and can perform co-op actions and strategies.<br />\n• New improved camera follows your character, allowing you to zoom in and out on the fly!<br />\n• New randomized environments: from the unforgiving Mississippi Delta bayous to the abandoned streets of New Orleans’ French Quarter.<br />\n• Create your own character: learn new and different skills to specialize as you level up and equip with scavenged and handcrafted armor, tools and weapons.<br />\n• A new deeper crafting system will allow you to use items and materials to create hundreds of items, tools and weapons to upgrade your character and your base camp.<br />\n• You are an expert in survival ? You want real challenges ? Elite quests are made for you !<br />\nIn this special quest type, you have only one try to reach your objective. If you die, you will directly be sent back to camp and you’ll have to deal with the judgemental look of your friends...<br />\n• Set-up, upgrade and protect your camp as you want: choose from a wide upgradeable variety of traps, barricades, obstacle and workshops that will provide you new recipes and allow you to create more materials and items.<br />\n• Protect your camp and survive, alone or with your friends, to the Kovac’s Challenges ! Place your traps in a strategic way and prepare to fight hordes of powerful zombies.<br />\n• Night &amp; day cycle and weather conditions.<br />\n• Be careful when you got out by night, some nocturnal zombies are hiding in the darkness, ready to attack you.<br />\n• Meet new survivors by creating a public camp and use your special private chest to keep safe your precious objects.<br />\n• You can now kill zombies in a cooler way thanks to the finish moves and gory effects !<br />\n• Watch your hunger and your thirst if you want to be capable of fighting zombies.<br />\n• Watch the weight of your inventory. You don’t want to be slowed down while a horde is chasing you.<br />\n• Kovac’s more diligent students will be happy to find his precious advice in a new video format ! Paper is for losers...</p>", "metacritic": 69, "released": "2016-09-08", "tba": false, "updated": "2024-01-22T16:26:46", "background_image": "https://media.rawg.io/media/screenshots/203/203c7ef2bd4780cb6fabee0cf940216f.jpg", "website": "http://www.howtosurvivethegame.com", "rating": 3.13, "rating_top": 3, "added_by_status": {"yet": 53, "owned": 1028, "beaten": 20, "toplay": 14, "dropped": 77, "playing": 5}, "playtime": 5, "achievements_count": 192, "ratings_count": 93, "suggestions_count": 553, "game_series_count": 0, "reviews_count": 93, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["505 Games", "Eko Software"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["505 Games"], "esrb_rating": "Mature"}