{"id": 411051, "slug": "xenopurge", "name": "Xenopurge", "name_original": "Xenopurge", "description": "\n<p>Earth is undergoing an alien invasion and the situation is desperate. The interplanetary defense community has no choice but to send its best pilot to eradicate the problem at its source.</p>\n<p><strong>Xenopurge</strong> is a shooter in which you take control of this elite pilot in control of a small but powerful ship.</p>\n<p>The ship is equipped with an <strong>energy gauge</strong>, which can be recharged via the <strong>shield dash</strong>. This energy can either be used to <strong>fire</strong> or activate a <strong>temporary shield</strong>.</p>\n<p><strong>PS: Bugs are still present in the game, such as the pause that can cause premature waves to appear, or the shield dash that doesn't work diagonally top-left. If you want to restart, restart the game or the waves will be badly coordinated. (Didn't have time to debug... oops)</strong></p>\n<p><strong>(I therefore advise you not to use the pause !)</strong></p>\n<p><em>This game was made by me in 2019, over a period of about 3 months.</em></p><p>Art by me : https://www.artstation.com/artwork/nQNeV9</p>\n<p>Music credits : FTL OST by Ben Prunty.</p>\n<p>Menu : Rockmen (explore) : https://www.youtube.com/watch?v=7nV51LX5gC4</p>\n<p>Level : Civil (battle) : https://www.youtube.com/watch?v=xjqZS4q9Dq8</p>\n<p>Boss : Slug (battle) : https://www.youtube.com/watch?v=fdPxS2rrW9Q</p>\n\n<p>La Terre subit une invasion alienne et la situation est désespérée. La communauté de la défense interplanétaire n'a plus d'autre choix que d'envoyer son meilleur pilote afin d'éradiquer le problème à la source.</p>\n<p><strong>Xenopurge</strong> est un shooter dans lequel vous prenez le contrôle de ce pilote d'élite aux contrôle d'un vaisseau, certes petit mais puissant.</p>\n<p>Le vaisseau est doté d'une <strong>jauge d'énergie</strong>, qui peut se recharger via le <strong>dash bouclier</strong>. Cette énergie peut être utilisée soit pour <strong>tirer</strong>, soit activer un <strong>bouclier temporaire</strong>.</p>\n\n<p><strong>PS : Des bugs sont encore présents dans le jeu, tel que la pause qui peut causer l'apparition de vagues prématurées, ou encore le dash bouclier qui ne marche pas en diagonale haut-gauche. Si vous voulez relancer une partie, redémarrez le jeu sinon les vagues seront mal coordonnées. (pas eu le temps de debug.. oups)</strong></p>\n<p><strong>(je vous conseille donc de ne pas utiliser la pause !)</strong></p>\n<p><em>Ce jeu a été réalisé par mes soins en 2019, sur une durée d'environ 3 mois.</em></p>\n<p>Visuels du jeu : https://www.artstation.com/artwork/nQNeV9</p>\n<p>Crédits musicaux : FTL OST de Ben Prunty.</p>\n<p>Menu : Rockmen (explore) : https://www.youtube.com/watch?v=7nV51LX5gC4</p>\n<p>Level : Civil (battle) : https://www.youtube.com/watch?v=xjqZS4q9Dq8</p>\n<p>Boss : Slug (battle) : https://www.youtube.com/watch?v=fdPxS2rrW9Q</p>", "metacritic": null, "released": "2020-02-09", "tba": false, "updated": "2020-02-10T02:38:18", "background_image": "https://media.rawg.io/media/screenshots/b89/b8983b77273c2da8556605ee32931701.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pierre Morreel"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}