{"id": 411174, "slug": "raycore", "name": "raycore", "name_original": "raycore", "description": "<p>Welcome to raycore!</p>\n<p>raycore is a simple first-person walking simulator. It is the product of a few courses I did when I was completing my undergraduate at Portland State.<br/><br/></p>\n<p>The rendering for raycore is an implementation of Ray Casting. This was the algorithm used for Wolfenstein 3D. I did my implementation from scratch (though credit to Permadi for providing excellent articles on the math behind raycasting).<br/><br/></p>\n\n<p>My implementation includes rendered walls, floors, ceilings, sprites, and skyboxes. In addition, I added variable height walls and sprites (these can be 64 pixels or higher).<br/><br/></p>\n\n<p>I also wrote a level loading system from scratch. While this may not seem like much, it's essentially a compiler from a text file to a render-able environment. With this system, you can build levels without having to recompile all the source code.<br/><br/></p>\n\n<p>Recompile the source code? Yes, Raycore is entirely open source. You can check out the source code here.<br/></p>\n<p>Lastly, if you ever wanted to know how I implemented ray casting, I did a series of articles detailing the math behind ray casting:<br/></p>\n<ol><li>Implementing a Ray Caster Part 1: Basic Wall Rendering</li><li>Implementing a Ray Caster Part 2: Sprite Rendering</li><li>Implementing a Ray Caster Part 3: Floor, Ceiling, and Sky Rendering</li><li>Implementing a Ray Caster Part 4: Optimization Techniques</li></ol>\n<p>I hope you enjoy, and have a blessed day!<br/></p>", "metacritic": null, "released": "2020-02-09", "tba": false, "updated": "2020-02-10T03:08:57", "background_image": "https://media.rawg.io/media/screenshots/799/79955fbd853f6eae7d87bf7a0d866b71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["twrog"], "genres": [], "publishers": [], "esrb_rating": null}