{"id": 411272, "slug": "angry-bloaters", "name": "Angry Bloaters", "name_original": "Angry Bloaters", "description": "<p>Angry Bloaters is a game I wrote in August 2018 as a homage to Eric and the Floaters,  a game that I enjoyed playing with my brother back in the 80s on our ZX Spectrum 48K. </p>\n<p>Eric and the Floaters is  the Spectrum version of Bomberman, at least a first iteration of it. It was really simple but very addictive and I recall we had many hours of fun. It was definitely one of the games we kept coming back to (like Snakepit, Jetpac, Pssst to name but a few).</p>\n<p>So, I decided to do a modern version for the ZX Spectrum Next. I kept most of the Eric and the Floaters gameplay, especially the feature that allows the player and the enemies to walk over bombs, unlike the arcade Bomberman where you could trap enemies (and yourself) with bombs. I added a few bonus items, like a speed shoe (a Bubble Bobble pun), an extended range bomb, a second bomb, plus some more, trying to give it some more depth.</p>\n<p>One feature that everybody hated but I loved to keep was the auto-setting bomb stage. Every 4 stages, a bomb will be set on its own continuously, so that should keep the adrenaline pumping! Also, few stages have an opening on the sides, which allow a Pacman-esque movement for some nice hit&amp;runs! And if you wonder about those entries on the high score table, I wanted to immortalize the names of our high school teachers, plus some nicknames of our friends.<br/></p>\n<p>Coded in Z80N assembly using Zeus-ish assembler, developed on Cspect emulator and a 2A Next board. Coding, music, sound effects: Lampros Potamianos. Graphics:  Phoebus Dokos and Lampros Potamianos .</p>\n<p>This game is free, donations are welcome and appreciated!<br/></p>\n<p>Help OldJohn fight his own bloaters in one of his nightmares. Only fire will purge them!<br/></p>", "metacritic": null, "released": "2020-02-08", "tba": false, "updated": "2020-02-10T03:29:50", "background_image": "https://media.rawg.io/media/screenshots/d75/d757f983b2d5491618c49d6392e79436.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lpotamianos"], "genres": ["Action"], "publishers": [], "esrb_rating": null}