{"id": 411205, "slug": "aikent", "name": "AïKent", "name_original": "AïKent", "description": "<p><strong><em>AïKent</em></strong> is a <strong>puzzle / tactic game</strong> in which players have to get rid of all the enemies on board to access the next challenge. This project is part of the final year for the Game Design bachelor, we've been working for 3 months on <strong>preproduction</strong>, looking for design ideas, testing and prototyping each. The game is designer for <strong>mobile experience</strong>. The goal was to present in december a brief <strong>gameplay prototype</strong> of what the game is going to be, every human ressources were <strong>focused </strong>and the <strong>game design</strong> of the game during that period and to study the <strong>feasibility </strong>of the project.</p>\n<p> It's only on January than the research on theme and artistic direction would begin, simultaneously entering the production. The production was supposed to last for 6 month.</p>\r\nGame Design Post-Mortem\r\n\r\nGame system\r\n\n<p>Players will be proposed a succession of little puzzle. We planned to deliver several \"world\", each world introducing and exploiting a new mechanic. A world is divided into <strong>10 puzzle situations</strong>, the last challenge offering a fight against the super unit of the region.</p>\n<p><strong>One level, one set up, several ending</strong>. The player player will face a group of enemies trying to push him towards the bounds of the map to kill him. During a game his <strong>reflection</strong> will be challenged, <strong>planning </strong>next turn, we oriented the system so that players have to constantly <strong>think</strong> the <strong>outcome </strong>of their <strong>decision</strong>. \"Is this position dangerous ?\", \"Can I get rid of this opponent without putting myself in danger ?\"</p>\n<p>To get rid of enemies, since they don't have any life or anything, you'll have to push them against map border. This will instantly froze them to death. Each action spending <strong>action</strong> from a <strong>pool </strong>that's being refreshed every new player's turn. If the player <strong>succeed </strong>at <strong>completing </strong>the level he will <strong>unlock </strong>the next one, earning <strong>upgrade</strong> for the character (such as range for spell, 1 more action to the pool, etc ...).</p>\r\nMechanics\r\n\n<p>Players have 2 main mechanics for World 1.</p>\n<ul><ul><li>The first is a <strong>teleport</strong>. Player is able to target a tile and it will place him. But there is a twist, if the player use this ability <strong>targeting </strong>an <strong>opponent </strong>you'll <strong>swap </strong>position with him, this action as the<strong> same cost </strong>but a stronger out come.</li><li>The second mechanic is a <strong>push </strong>in a straight line. The player is then able to eliminate opponent by pushing them on map border, but also to <strong>use terrain </strong>gameplay <strong>elements</strong>, such a ice-block in the World 1.</li></ul></ul>", "metacritic": null, "released": "2020-02-09", "tba": false, "updated": "2020-02-10T03:15:14", "background_image": "https://media.rawg.io/media/screenshots/d12/d122fd0252030a4b76caa094b5ed9b58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Quentin_Frehring"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}