{"id": 411286, "slug": "hokataru-life", "name": "Hokataru Life!", "name_original": "Hokataru Life!", "description": "<p>Hey everyone! This is a small visual novel that me and a friend are making for fun! The story is based around 4 girls that you get to decide who to end up dating! </p>\n<p><strong>Premise</strong></p>\n<p>Hiroshi is a countryside boy who moved into the big Hokataru City to find out how life is like over there. As he embarks on his journey at Hokataru High, he realizes that there are 4 girls that stand out and catches his attention, whether by accident or by force. Will he develop any feelings for any of them? Only time can tell.</p>\n<p><strong>Characters!</strong></p>\n<p>Hiroshi (Main Character)</p>\n<ul><li>A young country boy who has moved into the city to experience what life is genuinely like there. Generally he is a plain person but the girls are what brings the emotions out of him. He has a nice 8-pack.</li></ul>\n<p>Mayumi (Shy Student Council President)</p>\n<ul><li>As a girl who spent a lot of her time alone reading books, Mayumi is a shy person who doesn’t like to approach others. Although when it comes to talking about books she lights up and gets excited about anything to do with them. </li></ul>\n<p>Keiko (Upbeat, Optimistic)</p>\n<ul><li>Keiko is an adventurous girl who likes to explore all aspects of life that amuses/intrigues her. She often is in a cheery mood which can help others around her to become happier. She likes to drag others into her business and tries to share her experience with everyone! </li></ul>\n<p>Tora (Tsundere Baseball Captain)</p>\n<ul><li>Tora started playing baseball in her middle-school and was the ace pitcher on her team. After suffering a minor injury before coming to Hokataru High she became the captain in her second year. She is a classic tsundere and struggles to show her true emotions.</li></ul>\n<p>Riko (Distant &amp; Cold Loner)</p>\n<ul><li>Riko was raised in a normal family with 3 other siblings. Due to her dad moving around Japan a lot for work, she constantly finds herself changing schools. As a result, Riko is anti-social and often appears to give everyone around her the cold shoulder. Her interests include video games and movies.</li></ul>", "metacritic": null, "released": "2020-02-08", "tba": false, "updated": "2020-02-10T03:32:52", "background_image": "https://media.rawg.io/media/screenshots/7ad/7ada77648fb27d1bf1da75ee17934089.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["AdamKip", "FreesiaOG"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}