{"id": 411382, "slug": "ishtars-treasures-abducted-hunters", "name": "Ishtar's Treasures Abducted Hunters", "name_original": "Ishtar's Treasures Abducted Hunters", "description": "<p>*** Esta es una versión Demo</p><p>Videojuego RPG para Windows, con una historia basada en elementos de la mitología prehispánica del pueblo Pipil salvadoreño, integrado con aspectos de ciencia ficción en su historia. <br/></p>\n<p>Ishtar's Treasures o Tesoros de Ishtar, es un proyecto para representar a manera de videojuego, historias que retoman elementos del mito de los pueblos Pipiles y/o Mayas de la región Centroamericana, en combinación con los mitos universales, además de presentar aventuras fantásticas de personajes explorados en los libros de la Saga llamada Disentervein, escritos por Ricardo Rodríguez Garay, a los cuáles pertenecen las publicaciones de \"Historias Desmontables Volumen 1\", \"Las Falacias de Lemuria\" y la obra de \"Los Últimos días de Katherine Ventura\".</p>\n<p>Abducted Hunters o Cazadores Abducidos, es un capítulo de la historia de Ishtar's Treasures, en el cual se explora la mayor aventura de una aprendiz de curadora en el antiguo pueblo Pipil llamado Técuz, el cual se encuentra a los pies del Monte Teopán. En esta historia, la joven aprendiz, investiga un misterio que amenaza a su pueblo, y el equilibrio de la naturaleza misma, auxiliada por sus compañeros aprendices, y descubriendo importantes aliados de diferentes regiones y épocas, se encuentra ella misma en el medio de un conflicto entre seres sobrenaturales y dioses prehispánicos.</p>\n<p><strong>Reconocimiento de Propiedad Intelectual</strong></p>\n<p>Además del reconocimiento dentro del juego, quiero mencionar de manera directa en este espacio, un agradecimiento por los recursos, a los creadores mencionados a continuación.</p>\n<p>La música seleccionada para esta adaptación de videojuego es proporcionada parcialmente por las fuentes de datos de los creadores:</p>\n<ul><li>Game Dev Market</li><li>Aaron.Krogh Sound.Archive.May.2014</li></ul>\n<p>Los recursos gráficos para esta adaptación de videojuego es proporcionada parcialmente por las fuentes de datos de los creadores:</p>\n<ul><li>AmysBattlers</li><li>Whtdragon</li><li>Thalzon</li><li>TkoolMaterials</li><li>DeadBirdProductionsMV</li><li>Zael</li><li>Starbird Resources</li><li>BaronBanana</li><li>Aekashics Librarium Static Battlers (http://www.akashics.moe/aekashics-librarium-battler-batch-downloads/)</li><li>Aekashics</li><li>Archeia RPGMaker Freebies</li><li>JodisKadokawa</li><li>Kadokawa</li><li>Tale</li><li>Enterbrain</li></ul>", "metacritic": null, "released": "2020-02-08", "tba": false, "updated": "2020-02-10T03:57:45", "background_image": "https://media.rawg.io/media/screenshots/800/80014655f8e9d0e9916671c6e0bbf956.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mumolk"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}