{"id": 411414, "slug": "lords-and-conquest", "name": "Lords and Conquest", "name_original": "Lords and Conquest", "description": "<p>You are a young lord of a once powerful family and your ties to the deceased king gives you claim to the throne. Owning small fief, in a now shattered kingdom your ambition is to become a powerful lord and regain your house’s name prestige. Achieve your objectives  through clever strategy and defeat much powerful lords. With a intuitive battle and conquest systems in a grand strategy scheme.</p>\n<p>The game is a real time grand strategy game with a combat mechanic that focus on the macro-strategy plays and preparations of the armies, and castles and knowing the right time and place to strike your enemy.This results in a intuitive and accessible system without any over complicated battle dynamics and micromanaging tactics, still making the player use his head in order to make progress. The numbers are intuitive and doesn’t require any over complicated plans. It is a perfect to introduce new players to the strategy game genre. While still appealing more experienced strategy game players. </p>\n<p>Combat Mechanics based on “dice rolls” and modifiers that comes from your army.</p>\n<p>A castle system that you have to upgrade and manage castles already conquered, improving your troops and income.</p>\n<p>A dynamic of knowing when to attack or when to retreat to your castle manage your troops and income and go back to the battlefield.</p>\n<p>Game made on unity as a learning project, really tried to push myself on the time that i had, made the game in less than 3 months.</p>\n<p>Any Feedback is Welcome.</p>", "metacritic": null, "released": "2020-02-07", "tba": false, "updated": "2020-02-10T04:05:19", "background_image": "https://media.rawg.io/media/screenshots/068/068e6ac3fe4ab220ed941af05fc292cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nunoareia"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}