{"id": 411532, "slug": "life-is-fare", "name": "Life Is Fare", "name_original": "Life Is Fare", "description": "<p>Life Is Fare was made in 4 days by studio Ractik (6 students) for the International Sustainability Game Jam 2020, a collaboration between the Hogeschool Voor De Kunsten Utrecht and the University of Utrecht, as part of a school assignment.</p>\n<p><strong>Context and description</strong><br/></p><p>The game has an applied purpose.  The goal given by the client was to promote radical new futures in commercial game media. The kind of future we want to show in our game is one where society has fixed as many social issues as possible. Traffic has been solved by allowing only public transport. Poverty has been fixed by applying a basic income. Discrimination has been stopped by removing genders of every person. Has it really?</p><p>You are a ticket inspector on the subway and don't do your job for income, but for pleasure. Global highscores exist for work quality and efficiency to motivate workers. The player can participate in this score system, but will find that it is impossible to become number one and do the job thoroughly. Only when the player starts applying pattern recognition to maximize efficiency and giving fines based on prejudice they have a chance to make it to the top. Our goal is to show that this behaviour of prejudice is a trap humans can always fall into, no matter the drastic approach to get rid of it. It's not a utopia after all.<br/></p><p><strong>Team</strong></p>\n<ul><li>Leon van Oldenborgh (HKU)</li><li>Willem van Schaik (HKU)</li><li>Nathan Nieuwenhuizen (HKU)</li><li>Joeri Ridder (HKU)</li><li>Sterre Perquin (UU)</li><li>Jeroen Blok (HKU)</li></ul>", "metacritic": null, "released": "2020-02-07", "tba": false, "updated": "2020-02-10T04:31:32", "background_image": "https://media.rawg.io/media/screenshots/0ea/0ea0b1aeacfceb3ed80ff8521e84f0b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Joeriri"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}