{"id": 411637, "slug": "idle-robot", "name": "Idle Robot", "name_original": "Idle Robot", "description": "Have you ever thought about build and put together a robot model but don’t know how to get start? Or don’t have much time to DIY?<br/>\u2028In Idle Robot, you could choose MK-2, Free Zeros and other different kinds of robots and start to build your own robot. We give you a unique chance to discover and merge various parts including armor, weapons, powers of a robot right from sketch.<br/><br/>Most Intriguing Idle Game <br/>Coolest 3D Robot idle Game<br/>1st Mecha Building Simulation Game<br/>\u2028Discovery the amazing internal structure in which a robot unravels starting from the very first part leading to the weapon system and power system and at the end finish up a complete mobility robot.<br/><br/>FEATURES<br/>- Tap the part of robot you want to build <br/>- Collect power to upgrade and unlock new parts <br/>- Use time travel and 2X speed to accelerate your power collection <br/>- Display real-time robot building status on screen\u2028<br/>- Get awesome rewards from the prize wheel! <br/>- Finish your robot and share it with your friends<br/><br/>Motive, easy and engaging gameplay. Fun and Easy to play, tap and tap to build up your robot; play anywhere and anytime; get the most fun out of your breaks! If you are a fan of Robots, DROID COMBAT, MechWarrior, you are going to enjoy this fun idle game with no doubt.<br/><br/>Play Idle Robot! Build your own Mecha! <br/>Be patience! Collect all Robots! <br/><br/>Enjoy the 3D idle robot building game totally for free!<br/>Have a super fun gaming experience with Idle Robot!<br/>Download now! <br/><br/>**Please Note: This robot idle game is suitable for kids and adults, and it is completely free to play but some optional in-game items will require payment.", "metacritic": null, "released": "2019-12-31", "tba": false, "updated": "2020-02-14T02:09:24", "background_image": "https://media.rawg.io/media/screenshots/736/736bb17547ec52c098abcd7a77031418.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Puppet Games (Beijing) Technology Co"], "genres": ["Casual"], "publishers": ["Puppet Games (Beijing) Technology Co"], "esrb_rating": "Everyone 10+"}