{"id": 4119, "slug": "chronovolt", "name": "Chronovolt", "name_original": "Chronovolt", "description": "<p>Chronovolt, an action adventure in time. Pilot the Chronosphere through wonderful worlds to stop Dr Scabious and his army of Minions from controlling the end of the Universe. Use powerful time controls to stop and rewind time, open time gates and blast enemies into the past.<br />\nChronovolt is a fiendish 3D puzzle-platformer in which you have to guide your rolling Chronosphere through the twists, turns, traps and hazards of the Escher-like levels. To keep the chase alive, you&#39;ll need speed, dexterity and determination to reach each Time Gate as Dr Scabious makes his escape.<br />\nSome functions and features may not be available on PlayStation TV.<br />\n1 player(s)<br />\nNetwork Features<br />\n1024KB Minimum<br />\nTouchscreen<br />\nRear Touch Pad<br />\nDual Analog Sticks<br />\nMotion Sensor<br />\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.<br />", "metacritic": 44, "released": "2012-11-21", "tba": false, "updated": "2024-03-09T22:12:40", "background_image": "https://media.rawg.io/media/games/8dc/8dc50d624dff0d52840e605e8e012816.jpg", "website": "", "rating": 2.55, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 133, "beaten": 3, "dropped": 8}, "playtime": 0, "achievements_count": 9, "ratings_count": 20, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 20, "platforms": ["PS Vita"], "developers": ["Playerthree"], "genres": ["Action", "Puzzle"], "publishers": ["Playerthree"], "esrb_rating": "Everyone"}