{"id": 411974, "slug": "ambush-2", "name": "Ambush", "name_original": "Ambush", "description": "Disclaimer: Ambush is not a single player game, 2 players minimum required, up to 8 players.<br/>This game can be played remotely using Steam Remote Play.<br/><br/>Disclaimer: Only one player can play with a keyboard. Other players will need a controller, even if you are using Steam Remote Play.<br/><br/><br/>Ambush is a party game up to 2-8 local players. Stay hidden in a crowd, spot players among the bots, and slice them up with your freshly sharpened katana.<br/>Strategy and violence will be part of the game.<br/><br/><h3>Up to 8 local players</h3><br/>Do you dream of cutting up your friends? Invite them for a game up to 8 local players and learn them how to use a katana.<h3>Remote Play</h3><br/>Thanks to the Steam Remote Play Together feature, play with your friends by sharing your screen, <strong>only one version of the game is required among the 8 players</strong>!<br/> There is also Parsec software, an alternative to Steam Remote Play Together.<br/><br/>Steam Remote Play Together: https://store.steampowered.com/remoteplay<h3>Game modes</h3><br/>Each game mode is based on the concept of being concealed among a crowd of AI (Artificial Intelligence).<br/><br/>Ninja mode<br/>Players are partially revealed every 10 seconds. You will need to be mobile, discreet and opportunistic!<br/><br/>Lasers mode<br/>Lasers pass through the area, forcing you to make a choice : Stay hidden or run to avoid laser amputation.<br/><br/>Items mode<br/>Items appear in the arena, get them and overtake your opponents. Detect them, cut them out, electrocute them, anything goes!<br/><br/>Digital zone mode<br/>A deadly area is closing, the tension will increase crescendo!<br/><br/>Stars mode<br/>Stars are dropped in the arena, collect them all, or kill your opponents for victory!", "metacritic": null, "released": "2020-02-12", "tba": false, "updated": "2021-09-06T16:24:57", "background_image": "https://media.rawg.io/media/screenshots/ab9/ab97da65842458de1fe10b559a051a2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["henriwb", "Thierry Ferreira"], "genres": ["Action", "Adventure", "Strategy", "Casual"], "publishers": ["Thierry Ferreira"], "esrb_rating": null}