{"id": 411999, "slug": "follower-battle", "name": "Follower Battle", "name_original": "Follower Battle", "description": "<p>This application allows you to see creatures 🗺 generated by human emotions 🙇 on the world map. ms.Zero - one of first users, decided that he could capture all the characters and thus subordinate emotions of people to his will. This is hardly possible, but who will check?  We must stop him before it’s too late!</p>\n<p>Unfortunately, ms.Zero found like-minded people. They united in a clan and set up towers to control creatures. You and your friends will have to destroy them and possibly build something of their own.</p>\n<p>⏱ Time is running out - rather join the fight 🗡!</p>\n<p>👥 <strong>ASSEMBLE HEROES ►</strong><br/>Look for creatures on a real world map, collect and develop them. Carefully study their abilities and choose the best strategy to use.</p>\n<p>🌍 <strong>EXPLORE WORLD ►</strong><br/>Find quests, merchants, and interesting dungeons on the world map. Sometimes you don’t even have to go anywhere :)</p>\n<p>⚔<strong> JOIN CLANS ►</strong><br/>Find a clan to taste or create your own. Develop it and spread its influence in the world with the help of special towers. Complete clan assignments, take part in clan tournaments and get valuable rewards.</p>\n<p>🏗 <strong>CAPTURE TERRITORIES ►</strong><br/>Destroy the Zero Towers. Create your own camp on a real world map and expand it. Decorate your towers with panoramas of real or fictional places that all your friends can see!</p>\n<p>🤼 <strong>FIGHT IN PVP ►</strong><br/>Prove that your squad and its tactics are the best on the server. Compete with other players, increase the PVP rating and get additional daily rewards!</p>\n<p><strong>coming soon </strong><strong>http://followerbattle.com/</strong></p>", "metacritic": null, "released": "2020-02-12", "tba": false, "updated": "2020-02-14T03:37:46", "background_image": "https://media.rawg.io/media/screenshots/9ba/9ba4890b17fe2f9e65f963c3ebe9c363.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anastasia Maru"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}