{"id": 412047, "slug": "heart-fragment", "name": "Heart Fragment", "name_original": "Heart Fragment", "description": "Enter the world of Heart Fragment, an upcoming indie visual novel otome. <br/><strong>The full game will be out late 2020/early 2021!</strong><br/><br/>As the protagonist (default name Xani, but customizeable) you'll enter a world of mystery that has over 20 potential endings. Collect the fragments each ending contains to unlock the truth.<br/><br/><br/><ul><li>five main paths, containing a variety of romantic endings, platonic endings, and family-based endings (and some bad endings too, so stay on guard!)<br/></li><li>you influence the story by making what you believe are suitable choices, and at the same time have the potential to influence the protagonist's personality<br/></li><li>unlockable personality traits (confident, honest, creative, paranoid, bored, gullible) based on your choices<br/></li><li>your endgame partner is YOUR CHOICE! the bonus/final route allows you to pick your endgame romantic partner and endgame BFF!<br/></li><li>renameable protagonist and a cast of lovable characters<br/></li><li>partial voice acting, with CG scenes being fully voiced<br/></li><li>custom soundtrack by Cylight Studios and Joshua Mock</li></ul><br/><br/><br/>Years into our future and years into the game’s past, scientists attempted an experiment with one particular goal in mind - to create a drug that would force human evolution to its next step. The experiment succeeded. Those the first human test was completed on gained powers beyond their wildest imaginations.<br/><br/>Increased mental capacity. Telekinesis. Telepathy. Super strength.<br/><br/>But no success story can happen without it’s downfalls, and an unforeseen side effect occurred. They began to lose their humanity. It only happened in short bursts, but when it did, together with their new found powers, they became extremely dangerous. And so they were euthanized, their lives ended as humanely as possible, and the experiment was marked a failure. The risks were too great to continue any further.<br/><br/>But one man - the lead scientist of the project - escaped. Desperate for his life’s work not to go unnoticed he created one last version of the drug, in an attempt to remove the side effects. Seemingly, it worked. However, with the results of the last experiment clear, this scientist too was considered a danger. He fled into hiding with his family.<br/><br/>The man was never found, and with complete silence from him perhaps proving him to have kept his sanity, eventually the search was called off. The failed experiment was called to a close and buried.<br/><br/>Years later, mysterious accident after accident has led to the death of both the scientist and all members of his family. Only one remains; his great granddaughter, protected since birth by a small group among the last of those that still know about the experiment, and from whom the secret of her past has been kept for years. But she’s about to find out.", "metacritic": null, "released": "2020-02-11", "tba": false, "updated": "2020-04-17T03:41:30", "background_image": "https://media.rawg.io/media/screenshots/891/89141f824e16bd0fd3b8d022dfeee665.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "toplay": 1}, "playtime": 0, "achievements_count": 66, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["heartfragment", "HF Gaming"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["HF Gaming"], "esrb_rating": null}