{"id": 412075, "slug": "u-fate", "name": "U-Fate", "name_original": "U-Fate", "description": "<p><strong>Story</strong></p>\n<p>The empire of Áncia lives a troubled time. The emperor is sick, the dynasty is in danger and many changes are happening in this ancient kingdom. One of them was the arrival of a new director at his university. This change, which went unnoticed will lead to a huge crisis within the country. We as a student newly admitted to the institution will be part of it. In our young hands the destiny of endless lives and our own fortune will be decided.\r\n</p>\n<p><strong>Historia</strong></p>\n<p>El imperio de Áncia vive una época convulsa. El emperador está enfermo, la dinastía corre peligro y muchos cambios están aconteciendo en este antiguo reino. Uno de ellos fue la llegada de una nueva dirección a su universidad. Este cambio, aunque de primeras pudo pasar desapercibido desembocará en una enorme crisis dentro del país y nosotros como un alumno recién ingresados en la institución nos veremos participes de ello. En nuestras jóvenes manos se decidirá el destino de un sinfín de vidas y de nuestra propia fortuna.\r\n</p>\n\n<p><strong>Exploration</strong></p>\n<p>Explore the great empire of Áncia discovering its different cities and cultures.</p>\n\n<p><strong>Exploración</strong></p>\n<p>Explora el gran imperio de Áncia descubriendo sus diferentes ciudades y culturas.</p>\n\n<p><strong>Combat</strong>\n</p>\n<p>Fight enemies with a turn based system to obtain experience and objects.</p>\n\n<p><strong>Combate</strong></p>\n<p>Enfrenta a enemigos con un sistema basado en turnos para lograr experiencia y objetos.</p>\n\n\n<p><strong>Decisions</strong></p>\n<p>Every decision is important and will change the fate of our protagonist.<br/></p>\n<p><strong>Decisiones</strong></p>\n<p>Cada decisión es importante y cambiará el destino de nuestro protagonista.</p>\n\n<p><strong>Squad</strong></p>\n<p>Make your own team to achieve a greater advantage in the fighting and improve them to develop their full potential.<br/></p>\n<p><strong>Equipo</strong></p>\n<p>Haz tu propio equipo para lograr una mayor ventaja en los combates y mejóralos para desarrollar todo su potencial.</p>\n\n\n<p><strong>Missions</strong></p>\n<p>Complete different types of missions to achieve different types of rewards such as new characters, money or learn more about the history of Áncia.</p>\n\n<p><strong>Misiones</strong><br/></p>\n<p>Completa distintos tipo de misiones para lograr distintos tipos de recompensas como nuevos personajes, dinero o conocer más sobre la historia de Áncia.</p>\n\n<p><strong>Install instructions</strong></p>\n<ul><li>Download the ZIP file below</li><li>Extract the ZIP file</li><li>Run 'U-FATE.exe'</li></ul>\n<p>Important: Xbox controller compatible.</p>\n\n<p>Twitter: https://twitter.com/SlothGamesCo</p>\n<p>Instagram: https://www.instagram.com/slothgamescompany/</p>", "metacritic": null, "released": "2020-02-11", "tba": false, "updated": "2020-02-14T03:56:56", "background_image": "https://media.rawg.io/media/screenshots/53f/53f1cfe34db094b9d65b516ecd2ab777.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SlothGamesCo"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}