{"id": 412139, "slug": "the-hollow-earth-hypothesis", "name": "The Hollow Earth Hypothesis", "name_original": "The Hollow Earth Hypothesis", "description": "<p>The Hollow Earth Hypothesis is a platform game for the 1MB ZX Spectrum Next. <br/></p>\n<p>It is an old school platform game developed during the kickstarter period of the Next (2017-2019) by Lampros Potamianos. Simon Butler kicked in during the project and revamped the graphics with his magic touch! The game was written using the Zeus-ish assembler, Cspect emulator and a 2A Next board. All game design, coding, music and SFX by Lampros Potamianos. Kudos to the Next team for their invaluable help, especially D (for fighting the mongoose), Flash and Jim (for the NEX loader) and Phoebus (for the fish).  The game uses most of the new perks that come with the ZX Spectrum Next: 8 bit hardware sprites, Layer 2 and Layer 3 graphics, plus some hardware scrolling on the Layer 3. Also, it uses custom 256 colour palettes. <br/></p>\n<p>Guide professor Rickamex through 80 screens, collect the 20 items scattered around the island  and figure out what is going on.  Each item has a special use which the professor has to discover. Most are quite obvious, but some have to be used in specific locations. The island comprises of 3 ground levels, the caves and the subterranean lake.  99 coins are distributed on these levels, some are easy to get, but some almost impossible. Professor will have to decide which ones are worth risking for... Mapping the game is not a bad idea at all!<br/></p>\n<p>The game features a sandbox style gameplay, as most screens are accessible from the start. Mind you, there is a bridge that needs to be lowered, three teleports that need to be used, plus some tasks that will be assigned and need to be completed before reaching the end of the game!<br/></p>\n<p>The game supports redefinable keyboard and joystick controls. Besides the usual Up, Down, Left, Right and Jump controls, the inventory system uses a couple of extra keys, so if you are using the joystick, you will have to redefine the keyboard controls in order to set the Inventory Left and Inventory Right keys on the keyboard. It won't be a problem accessing the keyboard when playing with a joystick as you will have to find a nice and quiet spot for the Professor before using the Inventory Keys to access the item you need to use. Also, you should take care when entering a new screen, observing the enemy movement patterns to make your way through. There are some special enemies, a rat with an er-rat-ic behavior, jumping frogs, blobs and a vampire bat that need to be avoided someway. <br/>An extra live will be awarded upon gathering 40 gold coins, but that should not stop you from gathering some more, as they may be needed later on. If you find that five lives are not enough to make it to the end, try again, and then try some more. Although pixel perfect jumps are not the norm for this game, it still is old school, just like the ones we grew up with our Spectrums. Patience, quick reflexes, mapping the game, should prove valuable in Professor's Rickamex quest. And there might be a hidden cheat mode somewhere...</p>\n<p>To play the game, copy the .NEX file into a directory of its own on your SD card. If you redefine the keys, a new DATA.BIN file will be saved so that the game loads them every time it is launched.<br/></p>", "metacritic": null, "released": "2020-02-10", "tba": false, "updated": "2020-02-14T04:11:32", "background_image": "https://media.rawg.io/media/screenshots/04a/04a333abc22c308dd130968feb8f58f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lpotamianos"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}