{"id": 412495, "slug": "shadowgun-war-games-pvp-fps", "name": "Shadowgun War Games - PvP FPS", "name_original": "Shadowgun War Games - PvP FPS", "description": "Shadowgun War Games is a free-to-play tactical FPS with outstanding graphics and intense 5v5 battles. Work out your strategy for classic Capture the Flag or go in all guns blazing in Team Deathmatch. With intense multiplayer maps and modes, Shadowgun War Games is the best PvP experience on mobile phones!<br/><br/>FREE TO PLAY CONSOLE-QUALITY FPS<br/>Console quality tactical FPS action on mobile with outstanding graphics, customizable controls, plus voice and text chat! Compete in stunning arenas with beautiful 3D visuals. Easy on-the-go shooter action where everyone can experience truly competitive combat on their mobile device.<br/><br/>STUNNING MAPS AND THRILLING GAME MODES<br/>Squad up with friends and fight against players worldwide in arenas, maps and unique events across the Shadowgun Universe. It’s fun and accessible for beginners and hardcore gamers will find plenty of challenge. Anyone can compete in Capture the Flag and Team Deathmatch game modes!<br/><br/>UNIQUE HEROES AND ABILITIES<br/>Shadowgun War Games features unique heroes, each with their distinctive style and skills, from Blink and Shield for defensive players to Berserk mode for more aggressive tactics. Customize your hero with unique skins and emotes in PvP multiplayer game modes.<br/><br/>COMPETITIVE GAMEPLAY<br/>Shadowgun War Games is a tactical FPS that rewards skill and strategy in battle. The quick and easy matchmaking will team you with friends of your ability, and the Ranked System will reward progress on your journey to the top. Team tactics will ensure victory in this free to play multiplayer shooter.<br/><br/>UPDATES AND VARIETY<br/>Regular updates will add more choice and complexity to the Shadowgun War Games experience with the arrival of exciting new heroes, game modes, events, skins and emotes. The future of mobile gameplay is War Games!<br/>_______________________________________<br/><br/>ATTENTION ALL PLAYERS! We’d love to hear your feedback to help us improve the game. To leave feedback visit here. https://www.madfingergames.com/support<br/><br/>Note: You will need an internet connection to play Shadowgun War Games.<br/><br/>Please note this app contains social features that allow you to connect and enjoy the game with your friends, as well as push notifications that will let you know when the latest events and new content is available. You can choose to opt-out of these features.<br/><br/><br/><br/>https://www.madfingergames.com/shadowgun/wargames", "metacritic": null, "released": "2020-02-14", "tba": false, "updated": "2020-02-17T01:55:57", "background_image": "https://media.rawg.io/media/screenshots/a2e/a2e8834edc18543fe2e3cc0354829667_XNvIh6r.jpg", "website": "https://www.madfingergames.com/shadowgun/wargames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MADFINGER Games"], "genres": ["Action", "Adventure"], "publishers": ["MADFINGER Games"], "esrb_rating": "Teen"}