{"id": 412576, "slug": "dodge-the-slaughter", "name": "Dodge the sLaughter", "name_original": "Dodge the sLaughter", "description": "<p>GAME OVERVIEW</p>\n<p>Dodge the sLaughter is an asymmetrical competitive game that was developed over the course of one week by a four person interdisciplinary team for round three of the ETC's Building Virtual Worlds course. The game utilized phidgets build into props to allow players to compete against one another. The first player had a feather duster with magnets attached to the end and a cardboard cutout of a person with magnet sensor phidgets hidden in the cutout. As the first player held the feather duster to  sensors, a avatar on screen would be tickled. However, the second player had a vest with buttons attached to it that allowed them to block those areas from being tickled. The first player had to fill a tickle bar within the time limit, while the second player had to block the first player from doing any tickling.<br/></p>\n<p>MY ROLE: GAMEPLAY PROGRAMMER</p>\n<p>As the Gameplay Programmer, I designed and implemented the tickling and blocking mechanics of the game. It was my responsibility to interface with the phidgets to ensure that the game was reacting properly to the voltage inputs from the sensors. Additionally, as the primary programmer on the team, I was responsible for adding every art asset and sound into the game, coding the overall game loop, and using Unity's built-in animator to create animations based off sprite sheets provided to me by the artists.</p>", "metacritic": null, "released": "2020-02-16", "tba": false, "updated": "2020-02-17T02:20:03", "background_image": "https://media.rawg.io/media/screenshots/824/8244d516f132b8d4a854b63a2393d6bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TylerThompson"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}