{"id": 412508, "slug": "heroes-bash", "name": "Heroes Bash", "name_original": "Heroes Bash", "description": "Forming a pact with Abyss Demons, my brother, Prince Erathorn, stole the crown and plan to conquer the Bash Isles and declare himself Emperor. With vast amounts of resources and the Imperial Army at his disposal, the future of Bash Isles looks grim. Nonetheless, I will stay vigilant with the help of my friends and others along the way, I am sure to stop his non-sense just like when we were children.<br/><br/>Features<br/><br/>Open World Adventure<br/>Explore the Bash Isles as you try to uncover his plans to conquer each dominion. Set a foothold in the many realms, make alliances, claim resources, and recruit friends to help you. But be a weary traveler for danger plagues the land now that law and order are no longer upheld. Watch out for roving bandits, rebels, monsters, and demons. Various map events and unique missions await you. <br/><br/>Heroes Await Your Call<br/>They may have humble beginnings, but the Bash Isles is filled with those with the abilities to become Heroes. Explore the Realms and recruit them to your cause. Unlock their individual skills and build the best team for different missions. A wide variety of customization options allows for flexibility in how you play and tackle challenges.<br/><br/>Monsters and Dungeons<br/>Abyss Demons now roam the land. Brutes, bandits, and rebels are taking advantage of the chaos. <br/>Create the best team to defeat each unique dungeon, accomplish unique missions, and slay giant bosses. Manually maneuver your Heroes and army to minimize losses.<br/><br/>Establish Your Base<br/>A variety of building options so you can decide on the best way to defend against your brother and other online invaders. Identify strengths and weaknesses in different structures and layouts, scout for potential threats, and optimize for the best defense. Protect and increase your resources by upgrading and expanding your Kingdom. Rebuild Bash Isles and the Kingdom in your image.<br/><br/>Multiplayer Battles, Team-play and more <br/>Test your heroes, tactics, and defenses against other online players. Large multiplayer engagements give you extra bonuses and unlock whole new ways to play. Gather your friends and make new ones. Join together to destroy greater foes and achieve ultimate glory.", "metacritic": null, "released": "2020-02-13", "tba": false, "updated": "2020-02-17T02:01:28", "background_image": "https://media.rawg.io/media/screenshots/c1d/c1da38994b89e0b11fbb8a8b919dfc0c_ecnWT8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LONGXIN GAME"], "genres": ["Strategy", "Card"], "publishers": ["Hong Kong Longsin Co.,Limited"], "esrb_rating": "Everyone 10+"}