{"id": 41261, "slug": "anna", "name": "Anna", "name_original": "Anna", "description": "Supported languages (selectable from the game main menu): English &amp; Italian (full audio and text), German, French, Spanish, Turkish, Russian (Text only with English or Italian audio).<br/><br/>TalkingAboutGames.com - Score: A<br/>\"For fans of adventure games that tend to the darker side of the genre, Anna is a must play title for 2012.\"<br/><br/>Adventuregamers.com - 4 out of 5<br/>\"The game is truly a labor of love, that much is obvious.\"<br/><br/>Anna is a first-person horror adventure that explores the darkest depths of the human psyche. Set in an abandoned sawmill nestled high in the mountains, Anna challenges you to uncover horrific clues and use them to solve puzzles related to your character’s dark past.  As you play, Anna will change locations and unveil new secrets. The way you play will not only determine the mental health of your main character, but will also lead to one of three possible endings.<br/><br/>Features:<br/>- A haunting  tale of psychological terror<br/>- Three possible endings, each determined by the player’s actions in the storyline<br/>- Physics-based environmental puzzles <br/>- A faithful 3D recreation of the Italian countryside and a sinister sawmill that await your exploration <br/>- Atmospheric soundtrack <br/>- Brain-twisting puzzles to solve and horrific clues to uncover<br/><br/><br/>System requirements:<br/>OS version: 10.8.2 (recommended)<br/>Processor: iMac Intel i5 2.7 GHz<br/>Memory: 2 GB RAM<br/>Graphics: Radeon HD 6770M 512 MB", "metacritic": null, "released": "2012-07-16", "tba": false, "updated": "2024-03-24T18:53:46", "background_image": "https://media.rawg.io/media/screenshots/544/5449486521f2037439a306056d0f4ba2.jpg", "website": "http://dreampainters-anna.blogspot.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 15, "beaten": 4, "toplay": 3, "dropped": 1}, "playtime": 1, "achievements_count": 7, "ratings_count": 5, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "macOS"], "developers": ["Kalypso Media", "Dreampainters"], "genres": ["Adventure", "RPG"], "publishers": ["Kalypso Media"], "esrb_rating": null}