{"id": 412611, "slug": "santas-toys-factory", "name": "Santa's Toys Factory", "name_original": "Santa's Toys Factory", "description": "<p>It's almost Christmas!!! Help Santa making presents to kids all over the world. Each 10 seconds you'll get a new wish to grant . Pick one of the four toy options ( ball, doll, phone or car )and don't forget to wrap it up in one of the two colors available, then sent it to your sleigh!</p>\n<p>Important note: Bad kids shouldn't have theirs whish granted, after all, they've been bad kids. Show them Santa Claus is just and give them some wrapped coal so maybe next year they'll get a cool gift.</p>\n\n<p>This game was made by Ankor to submit to TriJam#57, but, unfortunately, we've exceeded their 3-hours limit.</p>\n<p>Instructions:</p>\n<p>WASD / Arrows - Move</p>\n<p>SpaceBar - Pick Up items / Put back on desk</p>\n<p>G - Interact with the WrapperDesk</p>\n<p>__________________________________________________________________</p>\n\n<p>É quase Natal !!! Ajude o Papai Noel à fazer presentes para crianças no mundo inteiro. A cada 10 segundos você recebe um novo pedido para realizar. Escolhe uma entre quatro opções de brinquedos ( bola, boneca, celular ou carro) e não esqueça de embrulhar em uma das duas opções disponíveis e depois mande para o seu trenó!</p>\n<p>Importante: Crianças más não devem ter seus pedidos realizados, além do mais, elas foram más! Mostre à elas que o Papai Noel é justo e as dê um pouco de carvão embrulhado. Talvez próximo ano elas possam receber algum presente legal.</p>\n\n<p>Esse jogo foi feito pela Ankor em participação da TriJam#57, mas, infelizmente, ultrapassamos o limite de 3 horas de produção.</p>\n\n<p>Controles:</p>\n<p>WASD / Setas - Movimentação</p>\n<p>Espaço - Pegar Itens, / Por de volta nas mesas</p>\n<p>G - Interagir com a mesa de embrulho</p>", "metacritic": null, "released": "2020-02-16", "tba": false, "updated": "2020-02-17T02:28:27", "background_image": "https://media.rawg.io/media/screenshots/b61/b610ecaf7c2a834f6a789f24ba4d0506.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ankor Studio"], "genres": [], "publishers": [], "esrb_rating": null}