{"id": 41273, "slug": "cube-world", "name": "Cube World", "name_original": "Cube World", "description": "<p>What is Cube World?<br />\nCube World is a voxel-based action RPG with a focus on exploration. It takes place in a procedurally generated fantasy world made up of entirely of cubes.Features<br />\nChoose between four different classes: Warrior, Ranger, Mage, Rogue.<br />\nAction-based combat with dodging, aiming, combos, special skills and more.<br />\nExplore a nearly infinite, procedurally generated fantasy world.<br />\nPlan your next adventure with the 3D voxel world map. Scroll and zoom everywhere to find your next destination!<br />\nCraft weapons, armor, potions, elixirs and food and more from ingredients found throughout the world.<br />\nTame pets that fight along your side and can be used as mounts.<br />\nNon-linear, open world gameplay. Solve quests, help residents, fight huge monsters, explore ancient dungeons! It&#39;s all up to you!<br />\nDiscover procedurally generated lore and learn about ancient civilizations and magic artifacts.<br />\nRetrieve unique magic artifacts to level up and improve your skills.<br />\nEarn gold to buy items or to book an eagle flight to new lands.<br />\nCube World&#39;s unique per-land progression system makes finding loot, solving quests and clearing dungeons rewarding and exciting over and over again.<br />\nUse your hang glider to take to the skies or explore the oceans with your boat.<br />\nFind magic items to enter secret areas and to support you on your journey.<br />\nPlay solo singleplayer or join your friends in coop-online-multiplayer.</p>", "metacritic": null, "released": "2019-09-30", "tba": false, "updated": "2024-01-07T09:17:13", "background_image": "https://media.rawg.io/media/screenshots/ef5/ef5a09f5204c0ecaf61fbf67e7848ffe.jpg", "website": "http://picroma.com/cubeworld", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 234, "beaten": 14, "toplay": 8, "dropped": 70, "playing": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 65, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 66, "platforms": ["PC"], "developers": ["Wolfram von Funck", "Picroma", "Cube World"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Wolfram von Funck", "Picroma", "Cube World"], "esrb_rating": null}