{"id": 412775, "slug": "project-seductress", "name": "Project Seductress", "name_original": "Project Seductress", "description": "<p>Requeriments:<br />\nWell the game uses pbr and advanced materials wich means that you need a dedicated grapic card and a good amount of RAM. I have tested with a 1060 gtx and 16gb of ram (ddr4) but it would be enought with something around 8gb.<br />\nScreencaps:<br />\nWhat is this about?<br />\nThis project seeks to generate attractive and belivable characters through an artistic and technological mix that takes advantage of the artistic direction/liberty and high level shaders in conjunction with real-time techniques that mimic the behavior of the different tissues that make up the human body. In addition, it integrates personality and pysichological traits in the characters it presents, due to the term of quality of them at the moment there is only a female character that uses multiple layers of deformation sculpted by hand, control and mixing systems as well as semi or automatic systems.<br />\nWhat is the final goal?<br />\nThe final goal of the project is to create interesting and believable &quot;companions&quot; fine crafted to be fleshy and realistic.<br />\nWhy is this different from any other 3D NSFW projects?<br />\nFor starters it does not use Daz3D wich represents the 90% of other 3D NSFW projects, the characters that I&#39;m bringing to life are hand sculpted, texturized using a mix between hand paint and photo scanned images, the animations and deformations are hand crafted and constantly evolving always looking for the finnest result.<br />\nBesides that I appreciate the support wich means that I&#39;m taking a compromise with you, my Patreons, wich means that I will publish a new build every month as soon as we hit the first goal, right now I can&#39;t dedicate all my time to the project as I have a job but if we reach the goal I&#39;m going to quit that job and go full time with this.<br />\nWho are you?<br />\nI&#39;m a profesional technical &quot;3D generalist&quot; mostly focused in sculpting, illustration and VFX. As animator I&#39;m not very good but I have knowledge of Motion Capture for full body and facial tracking, that means that I can integrate lifelike movements for the characters, but is kinda money expensive as soon as I can afford the rent of the Mocap lab I will introduce it.<br />\nAnd what about the poor english?<br />\nI know, is not the best, I&#39;m working on it but I&#39;m not gredy I&#39;m just to broken right now to comissionate someone. I will fix this aspect as soon as I can, I&#39;m sorry.<br />\nPro tip: Use Alt + F4 to close the game(idiot mistake i did not include a buttom to close the game in this build).</p>", "metacritic": null, "released": "2020-02-15", "tba": false, "updated": "2022-02-23T13:57:46", "background_image": "https://media.rawg.io/media/games/c10/c10862aab0d85c1e5d1a5e6ffcec6aed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sytry"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}