{"id": 412742, "slug": "junkman-the-kessler-syndrome", "name": "Junkman: The Kessler Syndrome", "name_original": "Junkman: The Kessler Syndrome", "description": "<p>Local Award Winning Game of Nasa Space Apps 2020.<br/><br/><strong>For the REAL experience we recomend to DOWNLOAD the WIN executable, since it wasn't done for HTML5 and has some issues.</strong></p><p>Link to the project site: https://2019.spaceappschallenge.org/challenges/stars/orbital-scrap-metal-the-video-game/teams/junkman/project</p>\n<ul><li><strong>Game description:</strong></li></ul>\n<p>The main idea is to raise awareness and teach the population about garbage in space, a great dilemma for the future.<br/>To achieve this we want to make a super fun game that teaches about the different types of space garbage that there is and the issues they can cause.</p>\n<p>\"Junkman: The Kessler Syndrome!\" will inform the player of the different types of space scrap in a super casual way thus raising the popularity of the problem at hand, hopefully reaching more and more people around the world.</p>\n\n<ul><li><strong>Details:</strong></li></ul>\n<p>This is going to be a pixel-art game with asteroid-like mechanics, an upgrade system, a fun story, data and some curious information about space scrap.</p>\n\n<ul><li><strong>Kessler Syndrome:</strong></li></ul>\n<p>The Kessler syndrome is a scenario in which the density of objects in low Earth orbit (LEO) is high enough that collisions between objects could cause a cascade in which each collision generates space debris that increases the likelihood of further collisions.<br/>One implication is that the distribution of debris in orbit could render space activities and the use of satellites in specific orbital ranges difficult for many generations.<br/><br/></p>\n<ul><li><strong>The Story:</strong></li></ul>\n<p>You find yourself in a near future, where the amount of objects and space junk in low Earth orbit has almost reached a critical point.<br/>Humanity faces the possible scenario of not only destroying all of its satellites and going backwards years of scientific progress, but also of being imprisoned on its own planet and not being able to continue with its space programs.<br/>Your are the last hope for humanity, launched to space in a special ship to collect and destroy debris before it is too late.</p>\n\n<ul><li><strong>Basic gameplay and features:</strong></li></ul>\n<p>The game consists of collecting space scrap and debris on a player-controlled spaceship with all sort of upgrades.</p>\n<p>The space scrap collected in the game will have real data provided by NASA and the SPACEBIRDS app. <strong>(To be Implemented)</strong></p>\n\n<ul><li><strong>Objectives in the game:</strong></li></ul>\n<p>The main objective is to clean the space from all the scrap laying around and prevent it to enter the Earth orbit in order to avert a possible <em>collision cascade effect!!</em></p>\n<p>An achievent will be to collect all the special scrap and its data. <strong>(To be Implemented)</strong></p>\n<p>Once the main objective is completed, if the player wishes to do so, he can continue playing until he improves his ship to the maximum, finishes the rest of the objectives or just simply finds the game really fun and wants to keep playing.</p>\n\n<ul><li><strong>Some mechanics:</strong></li></ul>\n<p>To keep the player engaged with the game, an upgrade system will be implemented based on a currency and a trade mechanism. The currency and trade system consists on selling the collected scrap and exchange it for <em>\"gears</em>\" (the currency within the game). The place where these mechanics will be carried out it's going to be a kind of hangar.<strong> (To be Implemented)</strong></p>\n<p>The player will be able to gain speed, resistance against impacts, more load capacity inside the ship and more fuel thanks to these upgrades.</p>\n<p>Within the game there will be different types of space scrap, each type provides different amounts of <em>\"gears</em>\" and varied materials.</p>\n<p>These types are:</p>\n<p>- Payloads: It is very hard to find. They have very rare materials and the highest value in \"<em>g</em>ears\".</p>\n<p>- Rockets: Fairly fast space scrap. They provide some rare materials, high value in <em>\"gears</em>\".</p>\n<p>- Debris: Their movement speed is slow . These do not have materials, since the player can find them everywhere they're the easiest way to get <em>\"gears</em>\".</p>\n<p>The materials that can be obtained are log nuts, screws, reinforced plates and high tech scrap.</p>\n\n<ul><li><strong>Special scrap and interesting information:</strong></li></ul>\n<p>The special scrap it's a kind of scrap when collected within the game a GUI pop up will apear with real information and data of the object, such as: Where it came from? What it is? Its name and its speed, for example. All this information will be the same that NASA has on its official website: https://worldwind.arc.nasa.gov/spacebirds .<strong> (To be Implemented)</strong></p>\n<p>There will be a limited amount of these special scrap, being placed at random points on the map, each of them containing different and specific information on a particular type of scrap.</p>\n<p>They are collectible, giving the player another reason to explore and be interested in the issue at hand.</p>\n\n<ul><li><strong>Risks to the player:</strong></li></ul>\n<p>The player may get hit by asteroids or some particular clusters of debris that will damage his ship, losing some part of the cargo or even causing his death.</p>\n<p>If he gets hit and dies the player will lose all the scrap previously collected and will respawn inside the hangar.</p>", "metacritic": null, "released": "2020-02-16", "tba": false, "updated": "2020-02-17T03:01:41", "background_image": "https://media.rawg.io/media/screenshots/8fc/8fc6a54179f75537609ea697747ae775.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["brunomir"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}