{"id": 412858, "slug": "the-cult-marduks-longest-night-demo", "name": "The Cult: Marduk's Longest Night (DEMO)", "name_original": "The Cult: Marduk's Longest Night (DEMO)", "description": "<p>The Cult: Marduk's Longest Night is a\r\n2d, hand-drawn, point &amp; click adventure game that mixes a first\r\nperson perspective with visual novel-style dialogues. Even though\r\nit's filled to the brim with dry humor, Marduk's\r\nLongest Night is a gritty tale about how\r\nmuch we are willing to corrupt ourselves in order to survive.</p>\n\n<p>SYNOPSIS<br/></p>\n<p>What a hellish day for Caleb Marduk! And he's someone who knows a thing or two when it comes to Hell.</p>\n<p>Going from ruthless summoner of the most powerful secret society in the world to a man utterly alone in a matter of hours, it's something that would make anyone fall into despair. And yet he thought to be a valuable asset for The Cult... After all, being capable of mastering dark magic to ruin people's lives —and doing that with a certain charisma— it's a very appreciated skill in his environment. But when The Cult kidnaps his daughter in front of his eyes and every demon is looking forward to feast on his rotten soul, even a monumental ego like Marduk's starts to see things in a entirely different light. <br/></p>\n<p>Crushed under the weight of the choice that changed his life yet determined to take back what was taken from him, Marduk has only one certainty: it will be a very long night...</p>\n\n<p>The Cult: Marduk's Longest Night is available on STEAM!</p>\n<p>https://store.steampowered.com/app/1074220/The_Cult_Marduks_Longest_Night/<br/></p>\n\n<p><strong>Demo currently available in English/German/Italian</strong><br/></p>", "metacritic": null, "released": "2020-02-15", "tba": false, "updated": "2020-02-17T03:40:37", "background_image": "https://media.rawg.io/media/screenshots/5e3/5e30e3db691a520c0c1e6c47ee19071f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neon Sloth Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}