{"id": 412874, "slug": "meshplace", "name": "Meshplace", "name_original": "Meshplace", "description": "<p><em>Meshplace</em> is a project I started on about three weeks ago; it's a manifestation of everything I'm learning as a computer science and physics major.</p>\n<p><strong>Preface</strong></p>\n<p>I want the game to be about you, the user. I'm not just saying that because I can't think of a catchy pitch or anything, I really intend the game to be community driven. I have so many interesting plans for this game, as do my friends, and I hope as do you. Listen, I'm not saying I am the most creative guy, but I do think I have okay problem solving skills. If you want it in the game, I'll find a way to make it happen, albeit, still consistent with the vibe I've already set up.<br/></p>\n<p>Anyway, enough of that. Here is my elevator pitch for what I got so far.</p>\n<p><strong>What's a Meshplace?</strong></p>\n<p>Great question. Let's go for a ride.</p>\n<p>You're prompted with a screen that asks the dimensions of a \"place\". </p>\n<em>Place Creation Interface</em>\n<p><em>What is this? </em>You may ask (You smart player, you).<br/></p>\n<p>This is the <em>Place Creation Interface, </em>the screen that allows you to input simple information about the place you would like the computer create. When you press that create button, your computer will run an algorithm to create a procedurally generated environment ready to be altered.</p>\n<p><em>Yeah, so great, what do I do with it?</em><br/></p>\n<p>Exactly.</p>\n<p>You're gonna probably want to walk around, get a feel for the controls (And you should, I spent two days on those alone, I hope they feel okay)</p>\n<p><strong>Use W, A, S, D... naturally... to move.</strong></p>\n<p>Oh yeah. <strong>You can fly, too. Press 'F' to toggle that. Use SPACE and LEFT SHIFT to ascend and descend.</strong></p>\n<p><em>Okay, great. So I can move and fly... I can do the same thing in Minecraft. Now what?</em></p>\n<p>You'll notice an extensive GUI floating on your screen. All that white and pixelated text? Look in the upper right hand corner... that's your mode.</p>\n<p><em>What the heck does Terraforming mean?</em></p>\n<p>Yeah, I'm excited to show you. Read the directions below the mode and try it for yourself.</p>\n\r\nFun with Terraforming!\r\n<p><em>So, I've made a couple trenches in the ground, now what?</em></p>\n\n<p>Well, sure making trenches is fun, but this mode actually has a more practical purpose. I am trying to set up a sandbox for the player, one where you can create till your hearts content. This mode will alter the terrain of your place to your liking, making mountains, canyons, or leveling it out for your buildings.</p>\n<p><em>Yeah, yeah, speaking of level, what does this \"target\" and \"current\" level stuff mean?</em></p>\n<p>Yeah, so this serves to tell you how deep (or high) your mesh selection will be altered. If you keep it on a constant level, fly and look from a birds eye, you can level out land quickly and effectively for buildings. Keep in mind, you cannot target land that is higher than you are! You would clip through the world, and while that might be fun for you, the developer no like-y.</p>\n<p><em>Okay, I see what you mean. You know, you sure talk about building a lot. How do I do that?</em></p>\n<p>Well, if you were looking around to all the elements of the GUI, you would have seen the words in the lower left hand corner of your screen that tell you to <strong>press TAB to switch modes.</strong></p>\n<p><em>Oh cool, now I'm in Building mode.</em></p>\n<p>Yeah, you are. Once again, read the words below that to figure out how to use it.</p>\n\r\nBuilding mode\r\n<p>Okay, a couple things to note about this mode.</p>\n\n<ol><li>There's text on the top of the screen</li><li>There's text on the right hand side of the screen</li></ol>\n<p><em>No shit, Sherlock.</em></p>\n<p>Use the <strong>UP and DOWN arrow keys to select a block type</strong> and the<strong> DOWN and UP arrow keys to select your material.</strong></p>\n<p>Now that you have some block selected (preferably one that doesn't say 'coming soon' on the right hand side) you're ready to place it.</p>\n<p>When you left click, a block will appear where your mesh selection is, and it will be auto rotated to the way you are facing. Try turning 90 degrees and placing it. Pretty cool, huh?</p>\n<p><em>Yeah, sure. It'll take some getting used to, though.</em></p>\n<p>Yes, as with any game, it's a bit of a learning curve. We're not even done with building yet, however. You see in the picture above I have walls stacked on top of each other? I even have windows cut out!</p>\n<p><em>Yeah, how do I do that?</em></p>\n<p>Sure. Okay, admittedly, I am still programming this feature. It works, it just needs to be more visual. You will be seeing this fix in the next update log, for sure. Anyway, <strong>aim your cross hair towards the very top of the wall and click to stack blocks on each other</strong><strong>.</strong> Might take a couple tries now, since you literally don't know until you click, but it'll work sooner or later.</p>\n<p><em>Okay cool! Still, though... make that visual, man.</em></p>\n<p>Now you're a pro at building so far! Don't worry, I intend to populate the other three block types this week. I am still working out the best way to make them comfortable to build with.<strong> If you have any suggestions, PLEASE leave a comment.</strong></p>\n<p><em>Welp, looks like that's all right. I'll bet nothing happens if I press TAB one more time...</em></p>\n<p>Wrong. One more mode in this version! This one is a bit wacky... but I kinda like it.</p>\n\r\nMake it pretty with Rendering mode!\r\n<p>I love low-poly art style. I have ever since Spyro 2 on the PS1. Is that not low poly? Eh. Kinda. Anyway, this mode, Rendering mode, gives you complete control over how you want your game to be rendered.<br/></p>\n\n<p><em>What are you talking about?</em></p>\n<p>Yeah. I said it once and I'll say it again-- I want this game to be about you. I want you to be able to create whatever you want, and make it look how you want it.</p>\n<p><em>Cool. I see all this text to the right, but clicking it just seems to keep it at zero.</em></p>\n<p>That's because when you mouse over a shader, clicking on it resets it to zero. Try mousing over it and using your scroll wheel to adjust it's value. When you find a picture you like,<strong> press T to toggle the GUI</strong> and look at your beautiful render. <strong>When you want to play again, press T or TAB again.</strong></p>\n<p><em>Sweet! One more thing... how do I rotate the camera? My mouse is free!</em></p>\n<p>Oh yeah... my bad. <strong>Right click and drag to look around.</strong></p>\n<p><strong>The Future</strong></p>\n<p>Listen, I really appreciate you taking the time to either read this or try the game out for yourself. I know what you're thinking... it's not a lot right now. <em>Sure, but It's a shell of what it will be.</em></p>\n<p>I started on this project three weeks ago. Literally. I wrote the first line of code three weeks ago. I have worked on this project everyday since then, and I still cannot get enough. You want to know why? There is no end in sight. Nothing blocking progress.</p>\n<p> I divide the development process into these tiny little manageable pieces, and I make consistent progress completing those goals. The only limit is us, the community. This game has the potential to be bigger than anything I could ever imagine.</p>\n<p>Just think of it--Multiplayer? Oh yeah. Real time physics? Oh yeah. A WWI style trench fight with snowballs or laser guns? I don't know? You could make that... if you wanted.</p>\n<p><em>Okay, that's enough, Ian. We get it. You're game is gonna be bigger than what it is now blah blah blah.</em></p>\n<p>Alright, that's enough of me, then. You know what, it's up to you-- I'll keep updating as often as I finish a patch, you can comment what you think. It sucks? Fair. What could be added or fixed to make it not suck?</p>\n<p>Well, anyway, thanks for reading this far. Give them game try, if you haven't already. I'll just be waiting here. Right here. Watching. Breathing. Coding.</p>", "metacritic": null, "released": "2020-02-15", "tba": false, "updated": "2020-02-17T03:44:07", "background_image": "https://media.rawg.io/media/screenshots/730/730669facce543440b6b5f58b1c04990.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IanWilkey"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}