{"id": 412942, "slug": "silent-scream", "name": "Silent Scream (itch)", "name_original": "Silent Scream (itch)", "description": "<p>Imagine waking up to sounds of demonic whispers coming from a nearby outdated radio.  This is what thirty-year veteran detective Giles Morris experienced after falling asleep in his office one foggy Monday morning in the 1940s.  He had never experienced something so bone-chilling in all his years of detective work.  Through the static, he could hear the blood curdling scream of a woman calling out his name in panic, along with an unknown address in a low distorted voice.  Giles was creeped out not knowing what to do at the moment.  However, since he was a well- known detective throughout the community, he decided he would explore the area to protect his reputation and come right back to his office.  He packs everything inside his car and heads off to find the address.  While searching for the address, Morris begins to get hungry and pulls off to the nearest city of Talon Fall for food.  However, after parking his car he noticed that there had not been a soul in sight.  He walks near a restaurant to take a quick peek through a window.  The sign read “OPEN” but the restaurant was completely dark and empty.  After exploring the building, a noise coming from deep within the kitchen startled him, causing his curiosity to get the best of him.  Giles finds a hatch leading to an underground tunnel.  Once he gets inside, the tunnel hatch closes shut, forcing him to explore the depths in order to discover the unknown and find a way out.         \r\n</p>", "metacritic": null, "released": "2020-02-14", "tba": false, "updated": "2020-02-17T04:03:09", "background_image": "https://media.rawg.io/media/screenshots/44d/44dcf88103d83e48725c023dda6542d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TalonFall"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}