{"id": 413085, "slug": "dragonscales-3-eternal-prophecy-of-darkness", "name": "DragonScales 3: Eternal Prophecy of Darkness", "name_original": "DragonScales 3: Eternal Prophecy of Darkness", "description": "The caravan of mages has been slaughtered off by a mysterious spell. Only a wizard managed to survive: you. A DragonScales journey into a world threatened by the worshippers of Specktr's sinister prophecy, a ritual to invoke absolute darkness and decimate the Gravity Kingdom. Your mental prowess is the ultimate bid for the survival of your race. DragonScales 3 is a casual, tile-matching game in which you combine colored scales on the board to collect special tiles, stars and prizes, defeat skulls and other monsters, solve tricky puzzles, and many more game actions! There are bosses too, showcasing a new approach to DragonScales battles. More than 150 levels await. Put a halt to the deviant aura of the Eternal Prophecy of Darkness!<br/><br/><strong>Special features</strong><br/><br/><ul><li>150 levels.<br/></li><li>Multiple challenges: basic scale combinations, scales which fall from their position, chasing scales, solving puzzles, destroying skulls and monsters on the board, and many more actions.<br/></li><li>First DragonScales game with 'Gravity Mode'.<br/></li><li>5 boss battles with a new play mode.<br/></li><li>First DragonScales game with badges and secret stars.<br/></li><li>New array of magical powers. For instance, you can use 'Improved Prescience' to select a tailored set of scales to play, or even change completely the position <br/>of all the scales on the board with the new 'Confusion' power!<br/></li><li>New story arc with Specktr's cultists.</li></ul>", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2023-11-05T12:52:52", "background_image": "https://media.rawg.io/media/screenshots/b21/b2190002bc85d2dc5fbd188bb0b87e2a.jpg", "website": "https://www.ikigames.com/dragonscales-3-eternal-prophecy-of-darkness/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IKIGames"], "genres": ["Casual", "Puzzle"], "publishers": ["IKIGames"], "esrb_rating": null}