{"id": 413101, "slug": "born-punk", "name": "Born Punk", "name_original": "Born Punk", "description": "<strong>A former combat hacker, a corporate CEO and a malfunctioning android get possessed by mysterious, otherworldly entities and must band together to save themselves and uncover the entities' origins. Talk, puzzle and explore your way through this (often humorous) cyberpunk thriller.</strong><br/><br/>Bornholm. Today, a quaint island in the Baltic Sea. In 2155, a sprawling metropolis able to compete with major world powers. Thanks to the Space Elevator, a technological marvel built by Bornholm's corporate consortium, The Conglomerate, few nations on the planet are more influential both in industrial matters and space exploration.<br/><br/><br/><br/>In Born Punk, the player slips into the role of three people (well, two people, depending on your stance on artificial lifeforms) living on the island: <strong>Eevi</strong>, a corporate combat hacker turned bartender down on her luck; <strong>Mariposa</strong>, the CEO of Bornholm's biggest corporation; and a malfunctioning android who calls himself <strong>Grandmaster Flashdrive</strong>.<br/><br/>The three characters have one thing in common: they all, one after another, get possessed by strange entities of unknown origin and even less known intentions. They must work together - and sometimes against each other - to find out of the nature of those beings, what they want, and why they seem to think that their 'mission' is of vital importance for the future of humanity.<br/><br/><h3>Key features: </h3><br/><br/><ul><li> <strong>A classic point-and-click adventure experience:</strong> we're very proud to feature our own distinct style, but we are also definitely influenced by games like Monkey Island or Beneath a Steel Sky and try to please both veteran afficionados of the genre and newcomers alike with a traditional pixel-art appearance and a streamlined, modern approach to game design<br/></li><li> <strong>Movement everywhere:</strong> you won't feel like you're walking through a still life painting; Born Punk's world is alive and full of animation, soundscapes and small details to discover<br/></li><li> <strong>Choices and consequences:</strong> often, it's possible to approach dialogues and puzzles from different angles. As a result, interactions and dialogues with other characters, the difficulty to overcome certain obstacles, and the results of many actions will vary greatly depending on what the player chooses to do<br/></li><li> <strong>Full voice-overs:</strong> every character in Born Punk and every line is voiced by professional voice actors. Yes, that includes the cat.<br/></li><li> <strong>Bombastic music:</strong> the main theme and various other tracks are composed by Jeff Kurtenacker, composer of Wildstar and choral arranger of World of Warcraft. Jeff is joined by a merry band of synthwave musicians to create a genuine and emotional cyberpunk/sci-fi soundtrack with a Nordic twist<br/></li><li> <strong>Let's be serious, it's funny:</strong> Born Punk is science-fiction with heavy cyberpunk influences; but we're also boasting a hopeful, often humorous undertone. Point &amp; click adventures without at least a bit of humour are unthinkable to us!<br/></li><li> <strong>A comprehensive universe:</strong> there's a slew of background info to read and experience, all of which becomes available in your PDA as you interact with the game world. Sometimes, in-game lore will also serve as an optional gameplay mechanic.</li></ul>", "metacritic": null, "released": "2022-06-17", "tba": false, "updated": "2023-05-08T22:11:43", "background_image": "https://media.rawg.io/media/screenshots/fad/fad06758e7b3d50aab21b3026824e726.jpg", "website": "https://insertdisk22.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 15, "beaten": 1, "toplay": 3, "dropped": 1}, "playtime": 4, "achievements_count": 23, "ratings_count": 3, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Insert Disk 22"], "genres": ["Adventure", "Indie"], "publishers": ["Insert Disk 22"], "esrb_rating": null}