{"id": 413163, "slug": "the-klept", "name": "the Klept", "name_original": "the Klept", "description": "<p>the klept is an arcade game of 20 levels currently, which puts you in the shoes of a burglar who must recover all the objects being in the part before being able to leave and pass to the following level.</p>\n<p>Of course, the locals will not let you do it, but fortunately, you can use certain objects such as armchairs for quit people.\r\nAlso watch out for some traps found in the upper levels!\r\nThe game is available in French and English</p>\n<p>Do not hesitate to leave constructive comments which will allow me to improve my game.<br/></p>\n<p>                                                                             TIPS: </p>\n<p> do not waste your time trying to knock out the blue enemies, they will push back the armchairs and will probably become unusable.                                                          </p>\n<p>                                                                        CONTROLS:</p>\n<p>move with the keys Z, Q, S, D or the arrows on the numeric keypad.\r\nescape to access the menu during the game.\r\nP key to pause.\r\n                                                                 </p>\n<p>                                                                            WARNING:</p>\n<p>Currently the game is played in window mode (1024 x 768) or full screen but only if the resolution of your monitor is 1900 x 1200, otherwise disproportions may appear.</p>\n\n<p>the klept est un jeu d'arcade de 20 niveaux actuellement, qui vous met dans la peau d'un cambrioleur qui doit récuperer tous les objets se trouvant dans la piece avant de pouvoir sortir et passer au niveau suivant.<br/></p>\n<p>Biens sur les habitants des lieux ne vous laisserons pas faire mais heureusement, vous pouvez vous servir de certains objets comme des fauteuils pour les  stoppés.</p>\n<p>Faite aussi attention à certains pieges ce trouvant dans les niveaux superieurs !</p>\n<p>Le jeu est disponible en français et en anglais</p>\n<p>N'hesitez pas à laisser des commentaires constructifs  qui me permettrons d'ameliorer mon jeu.</p>\n<p>                                                                          ASTUCE:</p>\n<p>ne perdez pas votre temps à tenter d'assommer les ennemis bleus,  ils repousseront les fauteuils et deviendrons probablement inutilisable.</p>\n<p>                                                                     CONTROLES:</p>\n<p>deplacement avec les touches Z,Q,S,D ou les fleches du clavier numérique.</p>\n<p>echap pour acceder au menu durant la partie.</p>\n<p>touche P pour mettre en pause.</p>\n<p>                                                                  AVERTISSEMENT:</p>\n<p>Actuellement le jeu ce joue en mode fenetre (1024 x 768) ou plein ecran mais seulement si la resolution de votre moniteur est de 1900 x 1200, dans le cas contraire des disproportions peuvent apparaitre.</p>", "metacritic": null, "released": "2020-02-20", "tba": false, "updated": "2020-02-21T02:18:04", "background_image": "https://media.rawg.io/media/screenshots/600/600e7b2a28f919a0f0c59b67051949b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["octant"], "genres": ["Action"], "publishers": [], "esrb_rating": null}