{"id": 413102, "slug": "dishonored-complete-collection", "name": "Dishonored: Complete Collection", "name_original": "Dishonored: Complete Collection", "description": "<p>Please note that this pack contains Dishonored - Definitive Edition,  Dishonored®: Death of the Outsider™ and Dishonored 2</p>\n\nDishonored - Definitive Edition\nExperience the definitive Dishonored collection. This complete compilation includes Dishonored, winner of over 100 Game of Year awards, as well as all of its additional content - Dunwall City Trials, The Knife of Dunwall, The Brigmore Witches and Void Walker’s Arsenal.<br/>\n<br/>\nDeveloped by Arkane Studios, Edge Online’s 2012 Studio of the Year, Dishonored is an immersive first-person action game that casts you as a supernatural assassin driven by revenge. With Dishonored’s flexible combat system, creatively eliminate your targets as you combine the supernatural abilities, weapons and unusual gadgets at your disposal. Pursue your enemies under the cover of darkness or ruthlessly attack them head on with weapons drawn. The outcome of each mission plays out based on the choices you make.\nDLC Included:\n<br/>\nThe Knife of Dunwall<br/>\nIn The Knife of Dunwall, take on the role of Daud, the legendary assassin who killed the Empress. After assassinating the Empress, and forever changing the fate of Dunwall, you embark on a search for redemption. Gain access to Daud’s new weapons, gadgets and supernatural abilities as you traverse through parts of Dunwall yet unseen, including the city’s whaling center, Rothwild Slaughterhouse, and the heavily guarded Legal District.<br/>\n<br/>\nThe Brigmore Witches<br/>\nContinue your journey as the legendary assassin, Daud, in The Brigmore Witches. This conclusion to Daud’s story will put you at odds with warring gang factions and the dangerous Brigmore witch coven. Journey through undiscovered locales within Dunwall, including Drapers Ward and the Brigmore Manor, where you will be met with supernatural forces that test the limits of your new weapons and abilities.<br/>\n<br/>\nDunwall City Trials<br/>\nIn Dunwall City Trials, experience Dishonored’s flexible combat system, stealth gameplay, and distinct settings in a whole new way as you make your way through 10 distinct maps that feature a variety of challenges. Put your stealth, combat and mobility skills to the test as you clear demanding objectives, unlock new achievements and secrets, and climb up the global online leaderboards.<br/>\n<br/>\nVoid Walker’s Arsenal<br/>\nWith the Void Walker’s Arsenal add-on pack, gain access to four content bundles previously available only through pre-ordering Dishonored. These bundles offer unique character bonuses, additional bone charm slots and more.\n\n<br/><br/>\n<br/>\nDishonored®: Death of the Outsider™\n\nFrom the award-winning developers at Arkane® Studios comes Dishonored®: Death of the Outsider, the next standalone adventure in the critically-acclaimed Dishonored® series. Be a badass supernatural assassin and take on the role of notorious Billie Lurk as she reunites with her mentor Daud in order to pull off the greatest assassination ever conceived. Building upon Dishonored® 2’s signature gameplay and art style, Death of the Outsider features all the series hallmarks, including brutal combat systems, unique level design, and immersive storytelling that responds to your every choice. With compelling characters and exhilarating action, Death of the Outsider is the perfect entry point for those new to the Dishonored series, while delivering a significant expansion of the gameplay and world for longtime fans.STORY:\nTake on the role of Billie Lurk (aka Megan Foster), once one of Dunwall's most notorious killers-for-hire. Reunited with your old mentor, the legendary assassin Daud, you undertake the greatest assassination ever conceived: killing the Outsider, a god-like figure whom Billie and Daud see as instrumental to some of the Empire's most dishonorable moments. As you venture deep into the grimiest corners of Karnaca to uncover the mystery of the Outsider and his origins, you will face deadly opposition, ancient powers, and difficult decisions that will forever change the world around you.KEY FEATURES:<ul><li>The Ultimate Supernatural AssassinStay in the shadows or step into the daylight to take on all foes – the choice is yours. Equipped with a unique set of supernatural abilities, gadgets, and weapons, you can approach each situation in your own way. Use your abilities and skills to sneak through environments unseen or brutally eliminate all opposition in your way. \n\n</li><li>The Greatest AssassinationKilling the Outsider won’t be easy. You’ll have to journey deep into the seedy underbelly of Karnaca, where you’ll unravel some the city’s lost secrets. Along the way you’ll infiltrate underground fight clubs and black magic cults, and retrieve ancient artifacts in a thrilling bank heist mission that sets the table for your greatest mission ever. \n\n\n\n</li><li>The Definitive TargetsAs you hunt down The Outsider, face off against a new cast of enemies along the way. Armed with your weapons, gadgets and abilities, take down deadly foes such as the immortal Envisioned, the relentless Sisters of the Oracular Order and the new Clockwork Soldiers. Up the ante by accepting Contracts to find and eliminate optional targets throughout your mission.  \n\n</li><li>Replay Your WayUnleash further potential for creative chaos by replaying with some of the signature powers from Dishonored 2 in the Original Game Plus (OG+) mode.</li></ul>\n<br/><br/>\n<br/>\nDishonored 2\n\nReprise your role as a supernatural assassin in Dishonored 2.<br/>\n<br/>\nPraised by PC Gamer as “brilliant”, IGN as “amazing” and “a super sequel, IGN as “amazing” and “a superb sequel”, declared a “masterpiece” by Eurogamer, and hailed “a must-play revenge tale among the best in its class” by Game Informer, Dishonored 2 is the follow up to Arkane Studio's first-person action blockbuster and winner of more than 100 'Game of the Year' awards, Dishonored.<br/>\n<br/>\nPlay your way in a world where mysticism and industry collide. Will you choose to play as Empress Emily Kaldwin or the royal protector, Corvo Attano? Will you make your way through the game unseen, make full use of its brutal combat system, or use a blend of both? How will you combine your character's unique set of powers, weapons and gadgets to eliminate your enemies? The story responds to your choices, leading to intriguing outcomes, as you play through each of the game's hand-crafted missions.\nStory:\nDishonored 2 is set 15 years after the Lord Regent has been vanquished and the dreaded Rat Plague has passed into history. An otherworldly usurper has seized Empress Emily Kaldwin’s throne, leaving the fate of the Isles hanging in the balance. As Emily or Corvo, travel beyond the legendary streets of Dunwall to Karnaca, the once-dazzling coastal city that holds the keys to restoring Emily to power. Armed with the Mark of the Outsider and powerful new abilities, track down your enemies and take back what’s rightfully yours.\n\nKey Features:\n\n<ul>\n<li>The Assassins<br/>\nAs fully voiced characters, Emily Kaldwin and Corvo Attano now bring their own perspectives and emotional responses to the world and story. Use each character’s set of powers, gadgets and uniquely-tuned weapons in creative ways as you explore the world – whether you fight your way through the city streets or sneak across the rooftops - and which enemies you decide to eliminate or spare.\n </li>\n<li>Supernatural Powers<br/>\nAdvanced bonecharm crafting and all-new upgrade trees allow you to customize your powers in vastly different ways. Become a living shadow to silently stalk your targets, link enemies so they share a common fate, or mesmerize your foes and dominate their minds. Choose from nearly infinite combinations of violence, nonlethal combat, powers and weapons to accomplish your objectives.\n </li>\n<li>Imaginative World<br/>\nFrom the grimy, rat-infested streets of Dunwall to the lush, exotic coasts of a decaying Karnaca, immerse yourself in stylized locales created by Arkane’s premiere art and narrative teams. The world is a character in its own right, rich with story, architecture and eclectic characters. It is also punctuated by signature mission locations, such as the Dust District, ravaged by dust storms and warring factions, and a madman’s mansion made of shifting walls, deadly traps and clockwork soldiers.\n </li>\n<li>The Void Engine<br/>\nDishonored 2 is beautifully brought to life with the new Void Engine, a leap forward in rendering technology, built from id Tech and highly-customized by Arkane Studios. Designed to support world-class art direction and take full advantage of the powerful hardware this generation has to offer, the Void Engine allows for significant advances to all game systems, including responsive stealth and combat Artificial Intelligence, lighting and graphical rendering, impressively dense urban environments, and story presentation.</li>\n</ul>", "metacritic": null, "released": "2012-10-11", "tba": false, "updated": "2023-02-19T14:39:59", "background_image": "https://media.rawg.io/media/screenshots/575/575ea47d1637e1e1bca20c0a8a6f9049.jpg", "website": "", "rating": 4.0, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 5, "beaten": 9, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 649, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Arkane Studios"], "genres": [], "publishers": ["Bethesda Softworks"], "esrb_rating": null}