{"id": 413133, "slug": "world-war-doh-real-time-pvp", "name": "World War Doh: Real Time PvP", "name_original": "World War Doh: Real Time PvP", "description": "Build your army and dominate the competition in World War Doh—an intense, chaotic, and hilarious new Real-Time Strategy game! Play now and Control Your Chaos!<br/> <br/> Control your Commander to defeat opponents in challenging PvP card combat battles. Your only goal: to crush someone else’s hopes. Collect and upgrade dozens of unique cards to create the ultimate deck, then take your troops to battle! Do you have what it takes to be the best?<br/> <br/> With tons of strategies to explore, World War Doh will challenge you at every turn! Conquer the world, put your enemies to shame, and assert dominance with your Commander’s epic army! <br/> <br/> Network connection is required. A love for chaos is optional.<br/> <br/> FEATURES:<br/> • Crush enemies from across the world in real-time strategy battles!<br/> • Build your base, deploy your army, and win before the time is up!<br/> • Unlock, collect, and upgrade rare cards to create the ultimate card combat deck!<br/> • Upgrade and control your Commander during combat to counter your opponent’s tactics!<br/> • Switch up your strategy in real-time to catch your opponents off-guard! Unleash epic combos and wreak havoc on the enemy base!<br/> <br/> EXTRAVAGANT PASS SUBSCRIPTION:<br/> • Air Chest opens 25% Faster!<br/> • Enter the Tower of Loot for 40 Gems (Down from 60)!<br/> • VIP chest with subscription, and 1st of every month!<br/> • One FREE extra spin in EVERY Piggy!<br/> • Extra VIP cards in every container!<br/> • New Units: Pass holders get 2 weeks early access!<br/> <br/> SUBSCRIPTION TERMS:<br/> • Payment will be charged to the applicable iTunes Account at confirmation to purchase. The prices vary depending on country. The actual money charged may also be converted into your local currency based on the iTunes Account policy.<br/> • Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/> • Account will be charged for renewal within 24-hours prior to the end of the current period and you must verify the cost of the renewal.<br/> • Subscriptions may be managed by the user and auto-renewal may be turned off by going into the user’s Account Settings after purchase.<br/> <br/> Follow: @WorldWarDoh #ControlYourChaos<br/> <br/> <br/> Privacy Policy: www.jamcity.com/privacy<br/> <br/> Terms of Service: https://www.jamcity.com/terms-of-service/", "metacritic": null, "released": "2020-02-20", "tba": false, "updated": "2020-02-21T02:10:46", "background_image": "https://media.rawg.io/media/screenshots/94a/94aa322bb8b9aa445a48a26215ab666f_swDGWlX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jam City"], "genres": ["Action", "Strategy"], "publishers": ["Jam City"], "esrb_rating": "Teen"}