{"id": 413342, "slug": "laser-chess-with-ai", "name": "Laser Chess with AI", "name_original": "Laser Chess with AI", "description": "<p>This is a board game similar to Chess, buuut not exactly. </p>\n<p><strong>Discription:</strong></p>\n<p>It's turn based game - player vs AI. The player and the AI both have per 3 pieces(units) as follows - Player: Grunt, Jumpship and Tank. AI: Drone, Dreadnought and Comand Unit. At each turn the player can move any or none of his pieces, but once the piece is moved it <strong>must</strong> attack otherwise the player should end his turn(so you should think your move before actually playing it). Once the player is ready with his turn or simply cannot attack after moved piece, hit the end turn button, then the AI starts his turn. Once the AI is ready with his moves, automaticly the player turn will come, until any of the win conditions is reached.</p>\n<p>Each peace has attack and health as follows:</p>\n<p>Grunt - 1 ATK, 2 Health - move 1 space forward, backward, left or right; attack diagonally at any range.</p>\n<p>Jumpship - 2 ATK, 2 Health - move like Knight in Chess, attack in 2 spaces in the following directions -  forward, backward, left or right;</p>\n<p>Tank - 2 ATK, 4 Health - move like Queen in Chess, up to 3 spaces, attack once at any range in any of the following dirrections  -  forward, backward, left or right;</p>\n<p>Drone - Moves 1 space - forward,  1 ATK, 2 Health, attack diagonally at any range.</p>\n<p>Dreadnought - Moves 1 space in any direction, 2 ATK, 5 Health, attacks all adjacent enemy units.</p>\n<p>Command Unit - Moves 1 space forward or backwards, 0 ATK, 5 Health.</p>\n<p><strong>WIN CONDITIONS:</strong></p>\n<p>Player wins if all the Command Units are destroyed.</p>\n<p>AI Wins if all human units are killed, or one of the drones reaches the 8th row.</p>\n\n<p>P.S. This a prototipe i am about to add animations VFX effects and some levels. I just want to check if you guis would like it and some feedback would be nice.</p>\n<p>Have Fun!</p>", "metacritic": null, "released": "2020-02-19", "tba": false, "updated": "2020-02-21T02:58:11", "background_image": "https://media.rawg.io/media/screenshots/058/0580b4497397dd8aed4ef38aab390b31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["svasilev"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}