{"id": 4136, "slug": "disgaea-hour-of-darkness", "name": "Disgaea: Hour of Darkness", "name_original": "Disgaea: Hour of Darkness", "description": "<p>The king of the Netherworld is dead.  Join his son, Laharl, as he embarks on a quest to take his rightful place on the throne in this tactical RPG.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.<br />\nThis title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore functionalities such as multiplayer, versus, and co-op modes are not available.<br />\nThis item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item&#39;s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated systems associated with this Sony Entertainment Network Account. Please see software description for device compatibility.</p>", "metacritic": null, "released": "2013-01-15", "tba": false, "updated": "2023-01-11T03:46:01", "background_image": "https://media.rawg.io/media/screenshots/00c/00c84f49a6c003402968c9bb60cf6c56.jpeg", "website": "", "rating": 4.5, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 6, "beaten": 8, "toplay": 7, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 2", "PlayStation 3"], "developers": ["Sony Interactive Entertainment"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}