{"id": 413696, "slug": "bee-rave-7100", "name": "Bee Rave 7100", "name_original": "Bee Rave 7100", "description": "<p>The year is 7100 AD. Humans have gone extinct. Surviving species of Earth’s Sixth Mass Extinction are now free to roam undisturbed over land, sky, and seas. Remnants of the Anthropocene linger as survivors long afflicted by human activities endure in a state of genetic homogeneity.</p>\n<p>You are a survivor. You embody a species of solitary bee. Your perception of the world  is shaped in blue, green, and ultraviolet light and motivated by your needs to eat and reproduce. Vibrational feedback appends to your physiology as  you fly through a joyful post-apocalyptic arena picking up scent trails, feeding on nectar, and mating with your peers. Procedural flowers sprout up as you carry pollen from one flower to another, coincidentally increasing their genetic diversity to a point where you provoke the formation of new varieties. Music and sound-effects follow your journey as a responsive soundtrack that evolves based on your interactions with the world. </p>\n<p><em>Bee Rave 7100</em> is an invitation to embody non-humanness and engage with the mechanisms behind the formation of genetic wealth. Players step into a sculptural flower pod which transports them step into a future where diversity is built anew. The VR headset is enclosed inside a mask depicting an artistic interpretation of a speculative evolutionary stage of bee whose lifespan is determined by the choices made in-game. </p>\n<p>This project builds upon visits and research at the University of Cambridge Department of Plant Sciences, Cambridge and Queen Mary University Chittka Bee Sensory and Behavioural Ecology Lab - School of Biological and Chemical Sciences, London.<br/></p>", "metacritic": null, "released": "2020-02-17", "tba": false, "updated": "2020-02-21T04:22:56", "background_image": "https://media.rawg.io/media/screenshots/06a/06ade00edffda860f89d2cb22a70ee72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["seventyonehundred"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}