{"id": 413686, "slug": "lasting-solstice-demo", "name": "Lasting Solstice (demo)", "name_original": "Lasting Solstice (demo)", "description": "\n\n\n<p>Wednesday, December 21, 2011</p>\n<p>\"First comes the blinding white light, then the colors, and then the stillness.\"</p>\n<p>Suffering from amnesia, Kazu wakes up in a hospital bed. Under his disoriented state, he meets a young girl by the name of Yukari, a close friend of his. The atmosphere is heavy as Yukari tries her best to form the beginnings of her thoughts. She regrets to inform Kazu that there is something else that he should know: his mother is in the other hospital room, on her death-bed, the only family member that lived with him before.</p>\n<p>Kazu continues down the hall to the other hospital room where her mother lays. Her face doesn’t remind him of anyone. He lost more than just his memories. He lost his sense of self. Noticing Kazu’s unfortunate circumstances, Yukari is quick to help him regain his footing.</p>\n<p>Shortly after leaving the hospital, he meets another old friend, Shiori who also begins to help dispel the bleak and uneasy tension in the air. To rehabilitate, Kazu decides to go back to school, where he meets two new friends Emily and Saori. Kazu thought that it would be a good opportunity to get a hobby. He is presented with some choices. Whether he should pursue painting, music, or whichever. But there is still one question that is left unanswered.</p>\n<p> Will his mother survive?<br/><br/></p>\n\n<p>ON KICKSTARTER NOW:<br/></p>\n<br/>\n\n\n\n<p>Kawaii Puffin : Project Lead/Writer/Programmer<br/></p>\n<p>KaptivateTV  :  Lead Artist/Character &amp; CG Artist</p>\n<p>Cupnunu  : GUI Artist</p>\n<p>Vui Huynh  : Background artist</p>\n<p>Eric Jeffrey Tan : SFX/Music Composer</p>\n<p>Soraya : Promotional Video</p>\n<p>Yoko Kitaguchi : Editor</p>", "metacritic": null, "released": "2020-02-17", "tba": false, "updated": "2020-02-21T04:20:45", "background_image": "https://media.rawg.io/media/screenshots/913/9137623fa14f0cc510a40684dd12e1fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kawaii_Puffin"], "genres": [], "publishers": [], "esrb_rating": null}