{"id": 4137, "slug": "knytt-underground", "name": "Knytt Underground", "name_original": "Knytt Underground", "description": "<p>Knytt Underground is a 2D platformer with a heavy focus on non-linearity, exploring the world, and replayability.  It is the part of the Knytt series and the restart of the IP. </p>\n<h3>Gameplay</h3>\n<p>The player explores a vast map by running and climbing surfaces. There are second to none enemies and hostile NPCs. Rooms bound the world in the title. There are a total of 1800 rooms in total. The protagonist can take quests from NPCs and explore the game&#39;s world according to his likings.</p>\n<h3>Plot</h3>\n<p>The depicted actions take place on the planet abandoned by humans 500 years ago. The player follows the adventures of Mi Sprocket in the world inhabited by sprites, fairies, and other fantasy creatures. She does not talk, so everyone confuses her request for making a wish to the local shrine for saving the world. She sets off on the adventure with two fairies of her kind: Cilia and Dora. Fairies have different personalities so it matters which one is sent to talk with NPCs as it may affect the outcome of the negotiations. <br />\nThe foremost fairies&#39; quest is to find Six Bells of Fate — only after ringing the all would there be a world&#39;s order and the destruction of the universe would be canceled.<br />\nKnytt utilizes breaking the fourth wall with exploiting favorite game clichés — disguising in-game characters as the real people and making fun of the main quest which seems to have no meaning.</p>", "metacritic": null, "released": "2012-12-18", "tba": false, "updated": "2023-11-30T07:02:27", "background_image": "https://media.rawg.io/media/screenshots/23f/23f0e6329c5a9aaffd04930c5a751648.jpg", "website": "http://www.knyttunderground.com/", "rating": 2.81, "rating_top": 3, "added_by_status": {"yet": 32, "owned": 708, "beaten": 18, "toplay": 4, "dropped": 23}, "playtime": 2, "achievements_count": 26, "ratings_count": 57, "suggestions_count": 327, "game_series_count": 3, "reviews_count": 57, "platforms": ["PlayStation 3", "Wii U", "PC", "macOS", "Linux", "PS Vita"], "developers": ["Nicklas Nygren", "MP2", "Nifflas' Games"], "genres": ["Adventure", "Indie"], "publishers": ["Ripstone"], "esrb_rating": "Mature"}