{"id": 413869, "slug": "survive-together-zombie-mmo-survival", "name": "Survive Together Zombie MMO Survival", "name_original": "Survive Together Zombie MMO Survival", "description": "<p>Taking place in a world controlled by powerful witches driven by evil motives, your survival journey starts in your base. Craft, build and repair weapons and tools in your base in order to be ready to explore the world and take down zombies and monsters. Equip and gear up your character with crucial elements to survive and helpful to your clan. Conquer unexplored map area and defeat bosses to level up and help your faction win the season war.</p>\n<p>TEAM UP TO SURVIVE</p>\n<p>• Find the right weapon for the right situation: assault rifles, machetes, sub-machine guns, and more!</p>\n<p>• Play with your friends and take down powerful World Bosses.</p>\n<p>• Save other players from hordes of zombies, critters and other deadly enemies.</p>\n<p>• Pick your faction and fight for the glory of witches and demons bent on world destruction.</p>\n<p>BUILD YOUR BASE FROM THE GROUND UP</p>\n<p>• Start a camp and gather a team of survivors as you learn to thrive in this hostile world.</p>\n<p>• Fortify your base with defensive structures like sniper towers, landmines and more!</p>\n<p>• Choose from an expanding list of structures and decorations to customize your fortress.</p>\n<p>• Build an outpost to trade resources with friends and visiting survivors.</p>\n<p>EXPLORE A VAST AND CHAOTIC WORLD</p>\n<p>• Roam across massive worlds and gather resources, rare loot, and more!</p>\n<p>• Unlock hidden regions to discover the mysteries and monsters that lie within.</p>\n<p>• Take on unique challenges spread across the land to earn rewards.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2020-02-21T15:21:10", "background_image": "https://media.rawg.io/media/screenshots/26f/26f5606da007fdbed6a3db7494556508.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": [], "genres": ["Shooter", "RPG"], "publishers": [], "esrb_rating": null}