{"id": 413866, "slug": "edna-harvey-the-breakout-anniversary-edition", "name": "Edna & Harvey: The Breakout - Anniversary Edition", "name_original": "Edna & Harvey: The Breakout - Anniversary Edition", "description": "The award-winning adventure with a new paintjob!<br />\nFor &quot;Edna &amp; Harvey: The Breakout – Anniversary Edition&quot;, Daedalic&#39;s classic has been redrawn and received a complete overhaul: high resolution visuals, new technology, intuitive controls – it&#39;s a truly insane adventure. Experience this quirky cult classic with Edna &amp; Harvey anew, but better than ever before – or discover this gem for the first time!Time to go crazy!<br />\nWhen Edna wakes up, she has no memories of her past, or why she finds herself in the padded cell of a sanatorium. Though she hasn&#39;t the slightest idea how she ended up in a cell, one thing is certain: She wants to get out of there!<br />\nAfter all, she feels positively sane – and her talking plush bunny Harvey absolutely agrees.<br />\nTogether they try to make their escape and meet the weirdest inmates – from a man in a bee costume to the pseudo-siamese twins Hoti and Moti. But Dr. Marcel, the head of the sanatorium, does everything in his power to stop Edna from leaving. What is his endgame? And why has her memory been wiped? Bit by bit, Edna remembers the time before the sanatorium...<br />\nSwitch at will between old and new visuals<br />\nMore than 20 hours of bizarre humor and crazy adventure fun<br />\nA plethora of funny characters and insanely entertaining dialogues<br />\nA unique comic-style in a new interpretation<br />\nModernized technology, improved controls – all polished and state of the art</p>", "metacritic": null, "released": "2019-12-04", "tba": false, "updated": "2024-03-05T17:03:44", "background_image": "https://media.rawg.io/media/games/4be/4bef90d57a056935567ed9e4d48fe037.jpg", "website": "https://www.daedalic.com/edna-anniversary-10th", "rating": 4.2, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 156, "beaten": 27, "toplay": 7, "dropped": 3, "playing": 1}, "playtime": 3, "achievements_count": 30, "ratings_count": 24, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 25, "platforms": ["Linux", "macOS", "PC", "Nintendo Switch"], "developers": ["Daedalic Entertainment"], "genres": ["Adventure", "Family", "Indie", "Puzzle"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}