{"id": 414061, "slug": "dungeon-of-confusion", "name": "Dungeon Of Confusion", "name_original": "Dungeon Of Confusion", "description": "<p>Welcome to a failed Game Jam game! But hey, it's here to play. I think the concept, had I had time to build it out, could have been really fun. Sadly, this is just a base level with no props, enemies, or interesting gameplay elements of any kind.  There are however some keys you can find that do have a purpose, and there is an end to the game.<br/><br/>My theme for this jam was generated as Playstation One Styled, 3D Platformer Maze. I am not amazing at 3D models, and I work in Unreal Engine, so most things I have access to are too nice looking to be in a Playstation One styled game. I struggled for the entire first day trying to make some art until I decided to just use what I had. I put a level together the following day, decided it looked too good, and scrapped it.<br/><br/>After messing around with art for most of the second day I came to the realization that I could make good art look bad with a filter, but most of my time was already gone at this point and I had absolutely no progress. What you are playing here is a game that was actually made in about 6 hours, either way, enjoy!<br/><br/>Credits:<br/>Programming and Level Design: DeepFriedOreo<br/>All art and music in this project was purchased and is licensed through the Unreal Marketplace.<br/><br/>!Music may be loud. No in-game controls for sound available!</p>", "metacritic": null, "released": "2020-02-23", "tba": false, "updated": "2020-02-24T02:28:55", "background_image": "https://media.rawg.io/media/screenshots/7a4/7a4f8517db2738a6c23a762829c35296.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DeepFriedOreo"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}