{"id": 414146, "slug": "the-virtual-trillium-trail-v-204", "name": "The Virtual Trillium Trail v. 2.0.4", "name_original": "The Virtual Trillium Trail v. 2.0.4", "description": "<p>The Virtual Trillium Trail Project,  Version 2.0.4, release date: 6/29/2011.<br/></p>\n\n<p><strong>The Virtual Trillium Trail Project </strong>investigated the digital media design factors that resulted in impacts  on emotions and   learning outcomes. It was a Ph.D. dissertation in information science (research 2003-2008) that lead to significant findings on the immersive virtual environment (XR) design factors of <strong><em>information fidelity</em></strong> and <strong><em>navigational freedom</em></strong>  on informal learning outcomes and emotions.</p>\n<p> <strong>Real Virtual Comparison on Learning: </strong>A pilot study  showed that the real field trip   outperformed the virtual in total learning, but  when virtual content was   identical to the real content the learning outcomes were the same. Priming, transfer, and reinforcement were learning outcomes, which indicated that the best educational practices are to    use the virtual and real experiences together to prime, transfer, and reinforce the real, not as a replacement for the real. </p>\n<p><strong>Visual Fidelity and Navigational Freedom and  as Design Factors with Measured Impacts on Learning and Emotions:</strong> There       is significant interaction between Visual Fidelity and Navigational       Freedom, as design factors on changes in test scores, as measured in  Knowledge Gained.  Visual Fidelity is strong and significant as a factor, and Navigational Freedom shows a strong trend. The combined conditions of both High       Visual Fidelity and High Navigational Freedom resulted in superior       <strong>Knowledge Gained on tests, </strong> <em>(Mean</em> = <strong>37.44% increase in test scores</strong>, <em>SD</em> = 13.88) when compared to the Low Visual Fidelity and Low       Navigational Freedom conditions (<em>Mean</em> = 20.93 % increase in test scores, <em>SD</em> = 13.36). <br/></p>\n<p>The project collaborated with <strong>Gabi Hughes, Environmental  Educator,Audubon Society of  Western Pennsylvania,</strong> who coordinated the Fox   Chapel Area   School District environmental  science education program. Teachers, especially <strong>Beth Durbin, from the Fox Chapel   Area School    District,</strong> were instrumental and supportive. Volunteer  third, fourth, and fifth grade students from the greater Pittsburgh area participated in the IRB approved research.  In addition, <strong>Professor Susan Kalisz, Department of Biological Sciences, at the University of Pittsburgh</strong>, and senior research associate Jessica Dunn,    collaborated and provided the plant population data sets of the real field trip location required to build the visualization  of the park. </p>\n<p>The Virtual Trillium Trail is a unique data simulation and  visualization of Dr. Kalisz’s long-term NSF biological plot study data, unlike  any other virtual world for education and a model of <strong>Virtual Nature</strong>. Furthermore, the location of the  Trillium Trail Wildflower Reserve is the site for many science school field trips, created and lead by the Audubon Society of  Western Pennsylvania. The combination of the biological data and the proven  educational approaches (from 1968, Beulah Frey, Ruth Scott and Ruth Boyles)  offered an ideal and successful real world learning experience to model, on which to base a computer simulation for research into the usability of virtual worlds, and  to better understand patterns of intrinsic learning found in informal settings.<br/> </p>\n<p><strong>Publications and Creative  Works as Principal Investigator</strong></p>\n<p><strong>Harrington,</strong> Maria C. R.. (<strong>2012</strong>, June). The Virtual Trillium Trail  and the Empirical Effects of Freedom and Fidelity on Discovery-based Learning. <em>Virtual Reality, 16</em>(2), 105-120.  Originally published in OnlineFirst™ Springer London, 1-15 (March 3, 2011). https://doi.org/10.1007/s10055-011-0189-7  </p>\n<p><strong>Harrington</strong>, Maria C. R., (<strong>2011</strong>, April-June). Empirical Evidence  of Priming, Transfer, Reinforcement, and Learning in the Real and Virtual  Trillium Trails. <em>IEEE Transactions on  Learning Technologies, 4</em>(2), 175-186. https://ieeexplore.ieee.org/document/5539765 <br/></p>\n<p><strong>Harrington,</strong> Maria, C. R. (<strong>2009</strong>).     An Ethnographic Comparison of  Real and Virtual Reality Field Trips   to   Trillium Trail: The Salamander Find as  a Salient Event. In Freier,   N.G.   &amp; Kahn, P.H. (Eds.), <em>Children, Youth and Environments: Special Issue on Children in  Technological Environments, 19</em>(1). https://www.jstor.org/stable/10.7721/chilyoutenvi.19.1.0074?seq=1 </p>\n<p><strong>Harrington</strong>, Maria, C. R. <strong>(2008</strong>).    Simulated   Ecological Environments for       Education (SEEE): A   Tripartite Model   Framework of HCI Design Parameters       for   Situational Learning in   Virtual Environments. Dissertation         Abstracts International. July   17, 2008. University       of   Pittsburgh, Pittsburgh, PA. http://d-scholarship.pitt.edu/8971/ <br/></p>\n<p><strong>Publications and Creative  Works for the AR Perpetual Garden Apps:</strong></p>\n\n<p><strong>The AR Perpetual Garden</strong> (2015-2018), is an Augmented Reality App for use inside and outside museums to extend the learning impact of real dioramas and gardens. Knowledge and complex causal chain interactions previously locked in traditional artifacts become accessible with immersive data visualizations and bio acoustics reflecting scientific data sets to show two contrasting scenarios - Woodland in Balance and Woodland out of Balance. This Augmented Reality implementation is unique as it is uses the vision tracking features of the most recently released ARCore and ARKit SDKs producing a perceptual experience on parity with reality. The concepts and knowledge are easily accessible at a click of a button to hear the curator’s interpretive narrative and access a complementary website of facts, The Virtual Garden Timeline. The AR Perpetual Garden App was developed in part, as an international collaboration between The Harrington Lab at the University of Central Florida, The Powdermill Nature Reserve at the Carnegie Museum of Natural History, and the MultiMediaTechnology program of the Salzburg University of Applied Sciences, Austria. Undergraduate and graduate students were involved in the production of the app. The multidisciplinary effort was developed with my partners, Dr. John W. Wenzel, Director, Powdermill Nature Reserve, CMNH and Dr. Markus Tatzgern, FH-Professor, Head of Game Development and Mixed Reality, MultiMediaTechnology program of the Salzburg University of Applied Sciences, Austria.</p>\n<p><strong>Apple  iTunes:<br/></strong></p>\n<p><strong>Harrington, </strong>Maria C. R., Wenzel, J. W.,      Tatzgern, M., Langer T., Oliver, M., Isaac, B., Guffey, A., Bledsoe,   Z.,   Jones,  C., Dinic, R.,  and Tiefengrabner, M. (2017-2018). The  AR Perpetual Garden Apps. <strong>Published on Apple  iTunes App Store</strong> (Version 1.2) Launched October 25, 2018. Available from https://itunes.apple.com/us/app/ar-perpetual-garden/id1438086490?mt=8 </p>\n<p><strong>Google Play:<br/></strong></p>\n<p><strong>Harrington, </strong>Maria C. R., Wenzel, J. W.,  Tatzgern, M., Langer T., Oliver, M., Isaac, B., Guffey, A., Bledsoe, Z., Jones,  C.  and Dinic, R. (2017-2018). The  AR Perpetual Garden Apps. <strong>Published on Google Play Android Store</strong> (Version  6.6.6) Launched November 30, 2018. Available from https://play.google.com/store/apps/details?id=com.carnegie.garden </p>\n<p><strong>Harrington, </strong>Maria C. R., Wenzel, J. W., Oliver, M., Isaac, B., Guffey, A., Bledsoe, Z. and Jones, C. (2015-2017). <em>The Virtual Garden Timeline Website</em>. (Launch 2017. https://virtualgarden.powdermill.org/<br/></p>\n<p><strong>Publications and Creative  Works as Principal Investigator  </strong></p>\n<p><strong>Harrington, </strong>Maria  C. R., Tatzgern, M.   Langer T., Wenzel, J. W. (2019). Augmented Reality Brings  the Real   World into Natural History Dioramas with Data Visualizations and    Bioacoustics at the Carnegie Museum of Natural History, <em>Curator: The Museum Journal</em>, <em>62</em>(2),  177-193. First published in <em>Wiley Online  Library</em> (April 19, 2019). https://doi.org/10.1111/cura.12308</p>\n<p><strong>Harrington, </strong>Maria, C. R.<strong> (Accepted 2020</strong>).  Observations of Presence in an Ecologically Valid Ethnographic Study using an Augmented Reality Virtual Diorama. In <em>Proceedings</em> of the <em>2020 IEEE Conference on Virtual Reality and 3D User Interfaces 27th IEEE Conference on Virtual Reality and 3D User Interfaces. </em>Atlanta, Georgia. March 22-26, 2020.  Video: </p>\n<p><strong>Harrington, </strong>Maria, C. R. (<strong>Accepted 2020</strong>). Augmented and Virtual Reality Dioramas and Arboretums for Museum XR Exhibition Engagement and Learning Design as a Lightning Talk. In <em>Proceedings</em> of the 24th Annual MuseWeb conference <em>MW20: MW 2020</em>. Los Angeles, CA. March 31 - April 4, 2020.\r\n  </p>\n<p><strong>Harrington, </strong>Maria, C. R. (<strong>2019</strong>). Virtual Dioramas Inside and Outside Museums with the AR Perpetual Garden App.  In <em>Proceedings</em> of the Annual MuseWeb conference <em>MW19: MW 2019</em>. Boston, MA. Published online February 14, 2019. Consulted March 13, 2019, April 2- 6. https://mw19.mwconf.org/paper/virtual-dioramas-inside-and-outside-of-museums-with-the-ar-perpetual-garden-app/   </p>\n<p><strong>Harrington</strong>, Maria C. R. (November 3-4, <strong>2017</strong>). Ripples in a Pond: How Virtual Reality may be a Tool of Impact for the Humanities. In <em>Proceedings of the HASTAC 2017</em>, UCF, Orlando, FL.\r\n  <br/></p>", "metacritic": null, "released": "2020-02-23", "tba": false, "updated": "2020-02-24T02:45:57", "background_image": "https://media.rawg.io/media/screenshots/fcc/fcccda0cf4446d153be9da963d293d1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 389, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Harrington Lab"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}