{"id": 414453, "slug": "scp-6781-the-infinite-mineshaft", "name": "SCP 6781: The infinite mineshaft", "name_original": "SCP 6781: The infinite mineshaft", "description": "<p>\"SCP-6781: The infinite mineshaft\" is an horror SCP-Fangame based on an scp that i had writen while the latin lessons in school. In \"SCP-6781: The infinite mineshaft\" you play as an Testobject how will forced to investigate SCP-6781 or well knowed as \"The infinite Mineshaft\". </p>\n<p>SCP 6187: The Infinite Mineshaft</p>\n<p>Security level: Euclid</p>\n<p>Safety measures: The entrance to SCP 6187 is secured by a 50 centimeter thick iron door which can only be opened by a signal given by the SCP Foundation. The mine in which SCP 6187 is located has been bought by the SCP Foundation and was out of use beforehand.</p>\n<p>Description: SCP 6187 is a mineshaft which is located in a mine near ██████ in Germany. According to the current measurements no end could be found to the mineshaft which is why researchers suspect that it could be infinite. Furthermore a researcher who wanted to explore the mineshaft before it was bought by the SCP Foundation reported about a creature with glowing red eyes but could not remember the body of SCP 6187-1. Local policeman  ██████ who investigated the mineshaft after the incident reported that he also encountered the creature and was even attacked by the creature. Policeofficer ██████ could not remember anything about the appearence of SCP 6187-1 exept the red eyes either. In addition both stated that they heared „spooky\" and „abnormal“ sounds from within the mineshaft.</p>\n<p>Addendum 1: After examinations through test subject D-1276 there are speculations about SCP 6187-1 only attacking when light by a flashlight is shined on it. Please investigate without a flashlight, because reduction of chance of risk is important for future investigations on SCP 6187-1. Testsubject D-1276 managed to get 2,3 kilometers deep into the mine before he disappeared after a connection loss.</p>\n<p>Addendum 2: Test subject 1277 will be researching about the behavior of SCP 6187-1 as demanded by Dr. ██████</p>\n<p>Addendum 3: Acess denied.</p>", "metacritic": null, "released": "2020-02-23", "tba": false, "updated": "2020-02-24T03:52:26", "background_image": "https://media.rawg.io/media/screenshots/710/710ee94c81683c928e790b385117c7aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PolygonStudios"], "genres": [], "publishers": [], "esrb_rating": null}