{"id": 414471, "slug": "fight-against-the-holemancer-across-the-multiverse", "name": "Fight against the Holemancer across the multiverse", "name_original": "Fight against the Holemancer across the multiverse", "description": "<p>For years the kingdom of Nyria has been in peace and harmony, but now the holemancer has escaped from her prison that kept her sealed by acquiring new powers.<br/>Now with these new powers he travels through the universes destroying the worlds where there are no heroes who can defend him, for each world he destroys increases his power considerably.<br/></p>\n<p>But all is not lost, a new group of heroes has emerged with the ability to chase the Holemancer through the universes.<br/>In each world the heroes must complete a mission to prevent it from being destroyed and thus weaken it until it can be defeated.<br/></p>\r\nObjective:\r\n<p>Complete the mission of each scenario, in this way you will damage the Holemancer until you defeat it.</p>\r\nFeatures:\r\n<ul><li>  4 Diferent characters.</li><li> 15 diferents stages.</li><li>Non linear game progression: the player advances through randomly selected levels.</li><li>Replayable.</li></ul>\r\nControls:\r\n<ul><li>Move: W, A, S, D</li><li>Dash: left shift</li><li>Attack, up to chain 3 skills: Mouse Left Clic.</li></ul>\r\nA few final words:\r\n<p>Unfortunately there were several elements that I would have liked to include (such as procedural levels, more enemies, greater variety of graphic elements), but I could not due to the weather. However, I plan to continue with this project for a better future.<br/></p>\r\nThanks for playing.", "metacritic": null, "released": "2020-02-23", "tba": false, "updated": "2020-02-24T03:57:07", "background_image": "https://media.rawg.io/media/screenshots/883/883deeb4a327f4fe869bb42301af3545.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MMarker"], "genres": ["Action"], "publishers": [], "esrb_rating": null}