{"id": 414562, "slug": "nonogram-animal-griddlers", "name": "Nonogram Animal Griddlers", "name_original": "Nonogram Animal Griddlers", "description": "<strong>Nonogram Animal Griddlers</strong>, is a logical puzzle game, known as Nonograms, Picross or Griddlers.<br/>These puzzles can be solved with the numbers on the side of the grid cells. These indicate a group of contiguous filled squares. Between the groups there is at least one empty square. <br/>Completing these puzzles will form a picture. In this game all the puzzles will form images of all different kinds of animals. <br/><br/>The game is designed so you can solve puzzles as if you had a puzzle book. <br/>You can take your time. <br/>Play any puzzles, without having to unlock puzzles. <br/>No punishment for errors or miss clicks.<br/>The game automatically saves any change to the puzzles, making you able to quit and continue a puzzle anytime you want.<br/><br/>The puzzles are divided into 6 different packs, with a 1 to 6 star rating based on the size of the puzzles.<br/>It’s best to begin with the smaller more easy puzzles, before starting on the bigger puzzles.<br/><br/><strong>Features:</strong><br/>- 120 unique puzzles.<br/>- All puzzles will form pictures of animals of all kinds.<br/>- Relaxing classical music.<br/>- Various puzzle sizes from 10x10 to 20x20.<br/>- Logic puzzles without pencil and paper, but it plays exactly the same!<br/>- Train you logical and abstract thought processes.", "metacritic": null, "released": "2020-02-21", "tba": false, "updated": "2023-11-05T17:41:09", "background_image": "https://media.rawg.io/media/screenshots/db2/db2c0f7e6e1a6e6cc909654b3697228e.jpg", "website": "http://dextergames.nl/NonogramAnimalGriddlers/Nonogram_Animal_Griddlers.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["DexteR Games"], "genres": ["Casual", "Indie", "Puzzle"], "publishers": ["DexteR Games"], "esrb_rating": null}