{"id": 414739, "slug": "a-hole-in-space", "name": "A Hole In Space", "name_original": "A Hole In Space", "description": "<h3>Epilepsy Warning</h3>If you are suffering from epilepsy, this game is probably not for you. This is due to the huge amount of bright stars, which can flicker and rotate around you.<h3>Description</h3><br/>'A Hole In Space' is a slow-paced space simulation game. You take control of a small black hole, which roams through an universe created by parameters you choose.<br/><br/>The movement is slow and sluggish, because everything moves by forces. The time you need to accelerate is the same time you need to decelerate. Therefore, it is not advisable to try to fly with max speed. <br/><br/>The amount of time you need to absorb the whole universe depends on how many stars you want in your universe. Your universe can have from 100 up to 10 million stars, but only if your PC can handle it.<h3>Goal</h3><br/>The goal is to absorb the whole universe.<br/><br/>1. Absorb nearby suns to grow in mass. <br/>2. Absorb other black holes in the universe, if you are greater in mass. <br/>3. Absorb the rest of the universe through your new added huge mass.<br/>4. Enjoy the Big Bang!<br/><br/>You lost the game, if any black hole absorbs you. This will happen if you get to close to them with a lesser mass.<h3>Features</h3><br/><ul><li>Every universe is unique due to procedural generation.<br/></li><li>Nevertheless, use the seed to share your universe with others.<br/></li><li>You can create up to 100 galaxies in your universe and therefore up to 100 supermassive black holes in their center.<br/></li><li>The galaxies can either be static or dynamic, which means they either stay in place or attracting each other.<br/></li><li>The whole universe can contain up to 10 million stars, but only if your PC can handle it.<br/></li><li>You can turn the gravity of stars on or off. If this is off, the performance will drop linear with the amount of stars. Otherwise it will drop squared. Therefore the max amount of stars will be reduced to 100K.<br/></li><li>The stars can either start with zero velocity or with the first cosmic velocity, which means they will fly in an orbit around the center black hole.<br/></li><li>There are 6 different galaxy forms to explore: Random, Circle, Sphere, Spiral-2-Arms, Spiral-4-Arms, Spiral-8-Arms<br/></li><li>Switch between the player black hole and galaxy camera to get a greater view of the universe.</li></ul><h3>Technical Aspect</h3>For this game I used Unity's Data Oriented Technology Stack (DOTS) and with it the Entity Component System (ECS), the C# Job System and the Burst compiler.<br/><br/><br/>However I did not use Unity physics. Instead I created my own, based on classical Newton mechanics, center of mass model, vector mathematics and the superposition principle. The more advanced Schwarzschild Metric is not implemented.<br/><br/>For a stable collision detection and to avoid infinities, a maximum speed for all objects and a space boundary were implemented. So no star can be slingshotted into oblivion, which would otherwise lead to an unfinishable game.<h3>Epilog</h3><br/>If you have any ideas, criticism, feedback or just found some bugs, let me know in the Steam forum.<br/><br/>Last but not least, have fun and delight yourself in void!", "metacritic": null, "released": "2020-02-22", "tba": false, "updated": "2021-02-05T03:33:26", "background_image": "https://media.rawg.io/media/screenshots/920/920ebada5cdc821173114387c99c03ac.jpg", "website": "https://gamejolt.com/games/A_Hole_In_Space/576787", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["CleverAI", "Clever AI"], "genres": ["Simulation"], "publishers": ["Hoi 4 Deu"], "esrb_rating": null}