{"id": 4148, "slug": "zombie-driver-hd", "name": "Zombie Driver HD", "name_original": "Zombie Driver HD", "description": "<p>Zombie Driver HD is a single-player action game, combining elements of shooter and racing. The events set in a zombie apocalypse environment. </p>\n<h3>Modes</h3>\n<p>There are three game modes. The first one is a classical story mode.<br />\nYou play as a taxi driver, who is doing his work when the virus appears. You need to get to the military checkpoint, where you have to complete different missions: picking up survivors around the city, transporting something or even killing. You have to fight with the bosses – substantial mutated zombies. In the second mode, Blood Race, the player enters the brutal race. You can chase the cars and take them down. There are three distinct game types: classic race; eliminator, where the player needs to take down cars as many as he can; the endurance, in which you need to race with a ticking bomb in your vehicle. The last one is Slaughter. You try to survive on different arenas as long as you can. </p>\n<h3>Gameplay</h3>\n<p>As for the vehicles, there are 13 types of driving. It includes a fire truck, bulldozer, and tank.<br />\nEvery vehicle feels different, so you can taste it and choose the most convenient one. Upgrading the vehicle on the fly is possible. The game offers the variety of weapons. You can burn zombies with flamethrowers or attack with the launcher. You fight with crowds of zombies at a time, especially in the Slaughter mode. The types of enemies can be unusual: there are zombies dogs, for instance. Medical drops, scattered around the city, can help to manage your health.</p>", "metacritic": null, "released": "2012-10-17", "tba": false, "updated": "2024-04-06T12:29:59", "background_image": "https://media.rawg.io/media/games/3d4/3d48e2f29341c31e69f80d107d0a1871.jpg", "website": "http://www.zombiedriver.com", "rating": 3.04, "rating_top": 3, "added_by_status": {"yet": 75, "owned": 1882, "beaten": 36, "toplay": 7, "dropped": 60, "playing": 6}, "playtime": 2, "achievements_count": 164, "ratings_count": 133, "suggestions_count": 625, "game_series_count": 0, "reviews_count": 134, "platforms": ["PlayStation 3", "Xbox 360", "PC"], "developers": ["Exor Studios"], "genres": ["Action", "Shooter", "Racing", "Indie"], "publishers": ["Nordic Games", "Exor Studios"], "esrb_rating": "Mature"}