{"id": 414977, "slug": "all-the-delicate-duplicates-itch", "name": "All the Delicate Duplicates (itch)", "name_original": "All the Delicate Duplicates (itch)", "description": "<p>All The Delicate Duplicates is a short single player first-person narrative game that toys with the concept of time: reality isn’t stable or linear here, but unfurls across a storyworld that bends, flexes and (in some instances) duplicates. <br/></p>\n\n<p><strong>Story</strong>\n</p>\n<p>John, a computer engineer and single father, inherits a collection of arcane objects from Mo, his mysterious relative. Over time, John and his daughter Charlotte begin to realise that these objects have unusual physical properties – and that the more they are exposed to them, the more their reality and memories appear to change.\r\n  </p>\n<p><strong>Main Mechanics</strong>\n</p>\n<p>All the Delicate Duplicates is a PC game - containing a non-linear ‘Back [+Forth] Story’ – that uses familiar FPS game mechanics to allow free roam around (often surreal) interactive environments. Using a mouse and keyboard and/or gamepad, players explore objects, diaries, journals, newspaper cuttings, mobile phones, laptops and other items left behind by the work’s characters, helping to piece together an elastically fragmented storyline.\r\n  </p>\n<p><strong>Features</strong>\n</p>\n<ul><li>Haunting freeform environments with open      exploration. \r\n</li><li>Non-linear narrative that pieces together      through interactive discoveries in the gameworld and a text based      backstory.\r\n</li><li>Music by acclaimed audio creator Chris      Joseph.\r\n</li><li>Commissioned by The Space [the BBC + Arts Council England] , One to One Development Trust and Mez Breeze Design.\r\n</li><li>Supported by Tumblr through their      International Digital Media and Arts Prize.\r\n</li><li>David-Lynch-like intrigue (if we do say so      ourselves) via a variable storyline.\r\n</li></ul>\n<p><strong>Inspirations/Themes</strong>\n</p>\n<p>Quantum physics, Multiverse theories, time travel, mental illness definitions, the difficulties of everyday domestic relationships and the games we play within them, gender disparities, the relativity of perceptions and their role in reality-shaping.\r\n  </p>\n<p><strong>Warnings</strong>\n</p>\n<p>All The Delicate Duplicates contains minimal strobe-like effects, minimal to moderate profanity, potentially creepy psychological concepts and themes, and not an ounce of gore. <em>All the Delicate Duplicates</em> stretches storytelling beyond the “real” as you (think you) know it.\r\n  </p>", "metacritic": null, "released": "2020-02-22", "tba": false, "updated": "2020-02-24T05:45:03", "background_image": "https://media.rawg.io/media/screenshots/6f5/6f5ccf0e0337f5e71ed591e4b8663cb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Mez Breeze"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}