{"id": 415052, "slug": "mine-dimensions", "name": "Mine Dimensions", "name_original": "Mine Dimensions", "description": "<p>You have two possible roles:<br/></p>\n<ol><li>Download the game below to enter the MultiDimensional Zone as a Coin Hunter to find coins scattered across space and time.</li><li>Go to http://104.237.13.63/asym/ to access the Mine Placement Interface and try to stop the Coin Hunters from collecting too many coins.</li></ol>\r\nMultiDimensional Zone\r\n<p>Want to be a hero? Download and install the game to enter the MDZ as a Coin Hunter. Your job is to collect as many coins as possible, represented by the \"score\" value.</p>\n<p>You will also find in your interface information such as your personal identification number (ID), your current heading and position, and the distance to the nearest detected coin.</p>\n<p>Find and collect as many coins as you can, but watch out! Villains are using the Mine Placement Interface to stop your efforts. These mines reach across dimensions and affect everyone in the MDZ. Be careful.</p>\n<p>We are tracking the total number of coins collected by all Coin Hunters. Perhaps someday, when enough are collected, we will be able to shut down the MPI for good.</p>\r\nMine Placement Interface\r\n<p>If you prefer a more villainous route, the MPI accessed at http://104.237.13.63/asym/ allows you to place interdimensional mines. Though these mines only affect one Coin Hunter at a time, they are the only way to stop them from amassing coins.</p>\n<p>IDMs are a very rare commodity and only a handful will be given every several hours. When you run out, request more - but you may be denied if you have stockpiled too many or request too quickly.</p>\r\nWarning: Buggy Prototype\r\n<p>Both of these things are super buggy, as this project was made in seven days for the 8 Bits to Infinity Asymmetrical Jam. Please let me know if you have any troubles!</p>", "metacritic": null, "released": "2020-02-21", "tba": false, "updated": "2020-02-24T06:04:16", "background_image": "https://media.rawg.io/media/screenshots/5cf/5cffdb6ad51754bfdb18b034ab32014c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Joshua McLean"], "genres": [], "publishers": [], "esrb_rating": null}