{"id": 415034, "slug": "this-game-is-broken-thematiaz0", "name": "This Game Is Broken (TheMatiaz0)", "name_original": "This Game Is Broken (TheMatiaz0)", "description": "<p>Infinite walking platformer, where you have to run from the Deadly Wall Of Bugs. The game will not make it easy for you, because it's broken! But don't worry, you can repair it.</p>\n<p>How can I repair it?</p>\n<p>This colorful block we call the Bug Fixer, you'll meet it on your way several times, maybe even a dozen. Its functionality is to remove in a medium radius Glitch Blocks and Spikes and Glitch Mobs. It also removes the random bug effect.</p>\n<p>What is Glitch Block?</p>\n<p>Glitch Block is very naughty block, that gives you a random bug effect. It can be different - from rotation of the screen by 180 degrees to total invertion of X axis. Be careful with this blocky thing.</p>\n<p>What is Glitch Mob?</p>\n<p>Glitch Mob is like Glitch Block, but more dangerous. The most important difference is that it can shoot you from the distance. After that, your character will get a random bug effect similar to Glitch Block's. Move often to dodge bullets from this guy.</p>\n<p>Spikes...? I'm actually scared right now.</p>\n<p>Don't be. Spikes can only kill your character if there is a collision between them. Try to avoid them unless you really like to kill your character.</p>\n\n<p>Is there something else I should know about?</p>\n<p>Hmm... I guess nothing else... no... wait. I forgot about Deadly Wall Of Bugs. I think that can be dangerous and very scary for you.</p>\n\n<p>Hope you the best. Beat your own records. Greetings from <em>NullPtr </em>team, which includes:</p>\n<ul><li><strong>Michał \"Biegus\" Biegaj</strong> - programmer,</li><li><strong>Mateusz \"TheMatiaz0\" Kusionowicz</strong> - programmer,</li><li><strong>Jakub \"Alias\" Kartkowski</strong> - graphic and game designer,</li><li><strong>Rad \"kurroneko\" Szwugier</strong> - game designer, musician, graphic designer.</li></ul>\n<p>The game was initially created for Global Game Jam 2020: https://globalgamejam.org/2020/games/game-broken-1</p>", "metacritic": null, "released": "2020-02-21", "tba": false, "updated": "2020-02-24T05:59:54", "background_image": "https://media.rawg.io/media/screenshots/bcb/bcb89e5fca1688c5138ede14c01c49c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheMatiaz0"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}