{"id": 415140, "slug": "towards-the-enduring-light-xiang-guang-er-xing", "name": "Towards the Enduring Light | 向光而行", "name_original": "Towards the Enduring Light | 向光而行", "description": "<p>A short minimalist 'walking simulator' responding to the Wuhan Coronavirus outbreak, inspired by real life events and news reports of the city since the quarantine.  Created for 'Gaming Spirit Bomb' - a fundraiser Game Jam to support doctors and victims of the Coronavirus outbreak in Wuhan, China (See other entries here).<br/><br/>Literal walkthrough: press right arrow to move forward [insert game title here]</p>\n<p>As the official sites only supports payment methods in Chinese RMB, <strong>all donations here on itch.io</strong> will be transferred by me to Tongji Hospital Tongji Medical College of HUST. NEKCOM Entertainment based locally in Wuhan will personally facilitate the donation process to ensure full transparency and direct transfer.  (until the coronavirus situation ceases/ call for donations end)<br/><br/>Inspiration for the game came from reports of the the normally bustling city of Wuhan suddenly empty after the quarantine, akin to sights commonly only found in post-apocalyptic genre works.  However, a viral short of an unknown hero risking his life to deliver a box of facemasks reminded us of the value of humanity and compassion in the face of disasters.<br/><br/>We originally intended to create a 2D homage to works such as <em>What Remains of Edith Finch, Everybody's Gone to the Rapture</em>, or more aptly, <em>The Graveyard and Passage</em>.  We also tried to challenge ourselves by developing in the open source Godot engine for the first time.  Unfortunately due to a combination of engine unfamiliarity and time constraints, we had to strip away a lot of planned interactions and content to just focus on the core concept and emotional experience.<br/><br/>The final result is pretty short and a bit rough around the edges but we hope it's worth your time.<br/>\n</p>\n<p>Credits:</p>\n<p>Concept: Allan Xia<br/>Code: Gordon Larson<br/>Art: Allan Xia, Matthias Chua<br/>Sound (Freesound.org):<br/></p>\n<p>Smooth cinematic intro’ by tyops<br/>‘Footsteps Concrete A’ by InspectorJ<br/>‘Soft Wind’ by florianreichelt<br/>‘Autumn Forest Wind’ by Akacie<br/>‘HopefulAmbience1’ by RichardCulver</p>", "metacritic": null, "released": "2020-02-21", "tba": false, "updated": "2020-02-24T06:22:52", "background_image": "https://media.rawg.io/media/screenshots/fa0/fa06cdf918e271cbea92c9a7ca0866e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Allan Xia"], "genres": [], "publishers": [], "esrb_rating": null}