{"id": 415167, "slug": "tenchu-3-wrath-of-heaven", "name": "Tenchu: Wrath of Heaven", "name_original": "Tenchu: Wrath of Heaven", "description": "<p>After Lord Mei-Oh was defeated in Tenchu: Stealth Assassins, Rikimaru was left in Lord Mei-Oh&#39;s fortress carrying a giant boulder to provide an escape route for Ayame and Princess Kiku. He appears to be trapped and left for dead. Ayame stuck Rikimaru&#39;s sword, &quot;Izayoi&quot; (he is seen drawing this sword in the opening CG of Wrath of Heaven) in snow as a monument for her fellow ninja, now considered dead. A year later, Rikimaru reports to Lord Gohda that he has managed to survive this near-death experience; unbeknownst to them, the real Rikimaru is trapped in the 20th century trying to find a way back to their time.</p>\n<p>The game&#39;s plot plays differently depending on the character chosen, but connects at certain points. The story revolves mainly around Rikimaru&#39;s return and the struggle for the Three Jewels, which are said to give power to those who possess them. These are the Jewels of Heaven, Earth, and Virtue. Tenrai, an evil wizard who wants to get his hands on them, commands a band of his men to take the Jewels from whoever possesses them. However, upon encountering Rikimaru, he seems interested in his power and attempts convincing him to join his men. Rikimaru refuse, and he and Ayame face each one of them. One of the men in Tenrai&#39;s arsenal is Onikage, who only serves him to pursue his plan of reviving Mei-Oh (his former master) and Tatsumaru (the former leader of the Azuma Ninja Clan whom Tenrai revived). Rikimaru and Ayame follow Tenrai into his fortress to stop him from destroying the world using the power gained from two of the Jewels. If he can be defeated, peace will be returned to Gohda&#39;s land.</p>", "metacritic": 79, "released": "2003-03-03", "tba": false, "updated": "2023-05-23T08:32:22", "background_image": "https://media.rawg.io/media/games/3e8/3e87d8eb82396185713b3d9017643838.jpg", "website": "", "rating": 3.33, "rating_top": 5, "added_by_status": {"yet": 3, "owned": 7, "beaten": 8, "toplay": 7, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 510, "game_series_count": 9, "reviews_count": 6, "platforms": ["PlayStation 2", "Android", "PSP"], "developers": ["Activision", "K2"], "genres": ["Action", "Adventure"], "publishers": ["Activison"], "esrb_rating": "Teen"}