{"id": 415192, "slug": "infliction-extended-cut", "name": "Infliction: Extended Cut", "name_original": "Infliction: Extended Cut", "description": "Infliction is an interactive nightmare, a horrific exploration of the darkness that can lurk within the most normal-looking suburban home.<br/><br/>Wander through the remnants of a once-happy family, reading letters and journals, listening to voicemails, and piecing together clues to understand the terrible events that led you here.<br/><br/>However, you are not alone. Something else has remained in this house, a being of infinite grief and rage. While you hunt for clues, it hunts you, waiting for its chance to unleash its anger on you.<br/><br/>Can you survive long enough to find atonement?<br/><br/>You are not alone\r\nA restless AI enemy will be stalking you, and you really don’t want to be caught. Will you hide, or find some way to fight back?<br/><br/>Warped reality\r\nExplore a realistic, interactive suburban house that gets more fractured and twisted the deeper you go.<br/><br/>Piece it together\r\nRead letters, find diaries, and examine the precious mementos of a broken family to understand the terrible events that led you here.<br/><br/>Almost too real\r\nThe story is grounded in real-world domestic tragedy, the fears and hurts that we all know: broken hearts, betrayed trust, grief, and loss.<br/><br/>Light and dark\r\nThe power of Unreal renders a photorealistic environment with dynamic lights and shadows that can dazzle you or plunge you into darkness.", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2023-02-16T14:24:18", "background_image": "https://media.rawg.io/media/screenshots/0ff/0ff553b4fdc0269e30154af6c36bf62c.jpg", "website": "", "rating": 3.17, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 7, "beaten": 7, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 15, "ratings_count": 6, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 6, "platforms": ["Xbox One", "PC", "Nintendo Switch"], "developers": ["Caustic Reality"], "genres": ["Adventure"], "publishers": ["Blowfish Studios"], "esrb_rating": "Mature"}