{"id": 415209, "slug": "rate-my-oc", "name": "Rate My OC", "name_original": "Rate My OC", "description": "- Welcome to Rate My OC -<br/>Are you ready to share your OC with the world? Upload your original character and share them with others! Add custom information about your OC including their favorite likes, dislikes, relationship, personality, and much more! After uploading your own characters, go rate other people’s OCs! Do you love the way they designed their character? Then make them happy and rate them 10 stars! <br/><br/>Rate My OC is available to all types of original characters! Choose from specific categories when uploading your OC, such as Gacha Life, Gacha Studio, Gacha Club, Anime, Fan Fiction and more! All types of characters and art are welcomed, including gacha, humans, furries, and ponies! What are you waiting for? Jump into Rate My OC and share your creations today!<br/><br/>UPLOAD YOUR OC<br/>- Upload an image of your OC for the world to see! Choose from categories such as Gacha Life, Gacha Studio, Gacha Club, Anime, Fan Fiction and more! All types of artwork are okay to upload!<br/>- Create your own OC story and biography! Add details such as gender, relationship, personality, likes, dislikes, birthday, age, and anything else you want!<br/><br/>RATE OTHER OCS<br/>- View other OCs and rate them from 0 to 10 stars!<br/>- If you really love an OC, give them a special gem! Earn gems through achievements and get on the gem rankings!<br/><br/>SHARE YOUR OC<br/>- Send your custom character code to friends so they can rate your OC!<br/>- Discover new OCs and add them to your favorites list!<br/><br/>GET ON THE LEADERBOARDS<br/>- The Top 100 OCs in each category are on display, can your OC be number one?<br/>- Trending, All-Time, and Gem Leaderboards!<br/><br/>«Notes»<br/>- The game may lag on old devices &amp; devices with 4k screens.<br/>- Please restart the game if you experience lag over time.<br/><br/>Thank you for playing Rate My OC!!!<br/><br/>Like us on Facebook: https://www.facebook.com/Lunime<br/>Facebook Group: https://www.facebook.com/groups/RateMyOC/<br/>Visit our Website: https://www.Lunime.com", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2020-02-28T02:10:35", "background_image": "https://media.rawg.io/media/screenshots/47c/47c16d030d73e2cd40c5a0ac5386a0db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lunime"], "genres": ["RPG", "Casual"], "publishers": ["Lunime"], "esrb_rating": "Everyone 10+"}