{"id": 415212, "slug": "panda-cube-smash", "name": "Panda Cube Smash", "name_original": "Panda Cube Smash", "description": "Match, blast, crush hundreds of cubes and toys, combining special boosters to create huge explosions for challenging the funniest levels every day! Experience the greatest adventures with your friends to compete in the various tournaments to see who will stand the top and win the final prize!<br/><br/>Start your adventure in this magical toon world! Your talent is the key when challenging countless possibilities through hundreds of levels. Match the same colored cubes and create powerful combos to blast by your fingers to solve fascinating puzzles you will ever meet! Compete with the best players to see who will win the Champion Cup!<br/><br/>HOW TO PLAY:<br/>. Tap 2 or more cubes of the same color to blast them!<br/>. Match 5 or puzzle pieces of the same color to create powerful boosters such as rockets or bombs to blast the blocks to pass levels!<br/>. Try to create different powerful combos to solve puzzles in the toon world!<br/>. Don’t forget to join various events: Daily challenge, Team Chest, Star tournament, team tournament, and Champion Arena. <br/><br/>GAME FEATURES:<br/>. Over 1000 challenging puzzles are waiting for you in the toon world!<br/>. Show off your blast skill through joining various exciting events!<br/>. Get prizes from the daily rewards!<br/>. Win more coins by passing more levels by collecting stars!<br/>. Compete with other players worldwide to win the Champion Cup!<br/>. Create your team or join the team you want with your Facebook friends.<br/>. Get lives and coins from your teammates by joining a team! <br/><br/>If you have any questions or problems, please contact us at: Pandacubesmash@gmail.com", "metacritic": null, "released": "2020-02-20", "tba": false, "updated": "2020-02-28T02:11:32", "background_image": "https://media.rawg.io/media/screenshots/67e/67e98782ad0abe6d1214eb2062c5b9da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tuyoo Online HK"], "genres": ["Casual", "Puzzle"], "publishers": ["Tuyoo Online HK"], "esrb_rating": "Mature"}