{"id": 415480, "slug": "vile-itch-ardentsquid", "name": "Vile (itch) (Ardentsquid)", "name_original": "Vile (itch) (Ardentsquid)", "description": "<p>Vile is an action rogue-lite about fighting demonic creatures and other horrors throughout a vile world. Fight enemies and/or complete random objectives given to you in procedurally-generated dungeons to put a stop to the creatures forever! Collect souls, find new weapons, new artifacts, and battle EPIC bosses! Use your souls to buy talents from 3 different talent trees!</p>\n<p><strong>Different Objectives:</strong> Each playthrough in Vile can be interesting to find something new and fun with random objectives given at the start of levels. If you complete this objectives you will you will be rewarded! This will keep each playthrough feeling fresh with over 20 objectives and if you don't want to complete the objectives then no problem! You can just kill enemies to proceed to the next level.<br/><br/><strong>Characters, Weapons, Artifacts:</strong> Play as unique characters, each with their own set of abilities, weapons, and an artifacts. Artifacts can provide many uses in battle but they take mana. Stamina regenerates over time and is used for the two abilities of each character.<br/><br/><strong>Epic Bosses:</strong> Battle 12 epic bosses! Battle a huge bone vulture, on a carriage, and each different from the last.<br/><br/><strong>Talent Trees:</strong> Three awesome talent trees with so many talents to purchase from. Ranging from loot that gets pulled in to your character, an extra spell, keep souls gathered or gain health when an objective is completed and many more!<br/><br/><strong>Maps and Loot:</strong> With 6 different worlds, plenty of weapons and artifacts to find there is a lot of things to enjoy in Vile!<br/><br/><strong>Key Features</strong></p>\n<ul><li>Random objectives given at the start of the level to complete or you can just kill enemies to proceed</li><li>Epic bosses to battle</li><li>Unlock unique characters with two abilities to give the player plenty of options</li><li>Three different talent trees with multiple talents to purchase upgrades from!</li><li>Local Co-op - Team up with a friend</li><li>6 Different and always changing maps</li><li>Find new weapons and artifacts every time you play.</li></ul>", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2020-02-28T03:32:09", "background_image": "https://media.rawg.io/media/screenshots/9bd/9bd7f176381e57bd371e9b9a01359684.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ardentsquid"], "genres": ["Action"], "publishers": [], "esrb_rating": null}