{"id": 415583, "slug": "how-to-feel", "name": "how to feel", "name_original": "how to feel", "description": "<p>use ⬆️ ⬇️ ⬅️ ➡️ or WASD, it's about 2 minutes long</p>\n<p>I started using Bitsy to work on small-scale, personal game creation, this is the first thing I've made using it.</p>\n\n<p>I wanted to try hard to express myself earnestly, in an authentic way, and avoid being corny, too. A lot of the art I do is cloaked in irony and camp in a way that can make it feel impersonal. It's also a lot of effort to uphold the camp and the irony, it's like this big fucking act, and  I don't feel like I get a lot of catharsis or artistic release from making art. I like making people laugh, I like making people happy, I like making people feel powerful or cool, but, IDK, I have a lot of problems with codependency and it's like, I have to learn how to do other things, too. So I figured I'd try to do this with art, as well.</p>\n\n<p>I really value small, personal games. I want them to be a more normal thing to do - Like a Polaroid, like taking an Instagram photo, right? I want them to be folded into the fabric of like, standard artistic expression that we all take part in. I really enjoyed using Bitsy, but even that was a little heavy lifting, my partner was intimidated by it watching me make this. It's also very 'game-y', with its pixel aesthetic. That's not bad, but I think it can be alienating if you want creation and consumption of personal games to be \"\"\"\"\"normal\"\"\"\"\".<br/></p>\n\n<p>The Bitsy tool, however, is fantastic. I've used Unity a ton, and a few other game creation tools, but making something in Bitsy really felt like I was <em>playing around</em>. I went in with a whole other idea of what I was doing, but I found it really fun to recreate little pixel dioramas of places that are important to me, and from there it just spun into a whole different work. Bitsy's really flexible - I like how it uses color palettes, how it uses tilesets,... It's fantastic to work with. I ended up using one hack, that allowed me to exit to other rooms from dialogue. I want to play more with Bitsy, I want to try out other storytelling techniques, play with some other hacks. Bitsy feels exactly how a \"game\" making tool should feel, responsive, flexible, playful, it feels like a co-author.<br/></p>", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2020-02-28T04:01:08", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e8df2e344a0f713a846025e1c563ed0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["pentagram"], "genres": [], "publishers": [], "esrb_rating": null}