{"id": 415674, "slug": "customechs-showdown", "name": "CustoMechs Showdown", "name_original": "CustoMechs Showdown", "description": "<p>Choose among a pool of different components to build your mech: a body, a weapon, a set of wheels, and two utility components: a topper and a gimmick! Every category has its own components, and you can build your own mech by choosing one of them for each category! Then, you fight with your friend in a multiplayer versus 2D arena: you lose if your life goes to 0 or you get pushed out of the arena! The first to reach the target number of victories wins!</p>\n<p>There are different game modes to play with:</p>\n<p> \r\n</p>\n<ul><li>Classic: for beginners or for a faster preparation: you choose among a set of pre-built mechs!</li><li>Free build: You have at your disposal all the components you want! Build the ultimate mech and destroy your friends!</li><li>Draft mode: Every player starts with a “hand” (like in card games) of components: each player picks one and pass his/her hand to the next player, and so on until hands are emptied. When the draft is finished they can build their mech, but only with the pieces they took from the draft! If the player didn’t have a component for a certain category, he/she’ll receive a random one.</li><li>OnePunch Mechs: this mode is for fast and fun matches: everyone has the same pre-built mech, “The Punisher”: it’s the smallest mech with components which allow it to fly and go faster and as weapon the “Punch-o-Matic 3000!”, a mechanical boxing glove which pushes enemy very far! If you get punched once, you’ll fly off the stage: every hit can be deadly! </li></ul>\n<p>Each component can do different things:</p><ul><li>Bodies determine your hitbox, your main weight, your health. They come in different sizes and shapes: smaller is lighter but with less health, and vice versa.</li><li>Weapons determines your main attack options: range, rate of fire, damage and push force. Remember, you can destroy opponents also by throwing them off stage!</li><li>Wheels determine your type of movement: wheels to move and jump, a pogo to keep jumping and reach higher places, an ufo to fly (recharge on ground!) and… A 2000KG cursed mayan shrine?</li><li>Toppers are activable item placed on top of your mech. They have a cooldown, if they are active, or activate by themselves if passive. They can do various things: throw 3 missiles, propel you upwards even in mid-air, shield you from damage, slow down your fall or even attract a dangerous lightning!</li><li>Gimmicks are like toppers, and do miscellaneous things: drop bouncing bombs or deadly mines, boost you forward, or restore your life! </li></ul>\n<p>CustoMechs Showdown is a multiplayer versus game developed for the Video game Design and Programming course at the Politecnico di Milano. More information at:\r\n</p>\n<p> \r\n</p>\n<p>http://www.polimigamecollective.org\r\n</p>", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2020-02-28T04:23:57", "background_image": "https://media.rawg.io/media/screenshots/d0b/d0b2a1a5daab3b1732460a516c1ec56e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["POLIMI Game Collective"], "genres": ["Action"], "publishers": [], "esrb_rating": null}