{"id": 415669, "slug": "dark-pastry", "name": "Dark Pastry", "name_original": "Dark Pastry", "description": "<p>Agata is just an old harmless woman who runs her bakery alone. On what seems like a regular day, she hears a strange sound.. she investigates and sees a book on the floor. The book has an unsettling aura, when she picks it up she observes that the pages are all empty, except for a single recipe which doesn’t seem to make any sense... It is called the Great Grandmother Tilda Cake. Then lightning flashes and she drops the book in fear. The earth rumbles as her lovely Bakery splits into two and a portal to the underworld opens. She bravely steps into it….</p>\n<p>In this game Agata discovers the dark craft of pastry through the completion of the book. She finds herself compelled to follow what the book has to offer as she sees a glimpse of the possibilities for her bakery. She has a sweet old bakery whose recipes and work are outdated and her business is in decline. The book seems to be her salvation. But the craft is dark and full of terrors. As she delves into the depths of this craft, she gets corrupted. She gets darker with each incantation of pastry. She is warned by her relatives repeatedly. They represent the horrors that fell upon them for their ambition in the search for the Great Grandmother Tilda Cake. What one can achieve with such a recipe is beyond any human perception. Agata is first scared and confused about her encounters with her relatives. She is like \"Uncle Zachary, what are you doing here?\" but then she realizes that his uncle is not the sweet old gentleman she knew once. So she has no choice but to beat the knowledge out of him. As Agata goes darker into the craft, she doesn't ask questions anymore. She is focused on her goal, to complete the book and bake the Great Grandmother Tilda Cake.\r\n</p>\n<p>In this game you will have to explore dungeons, beat the literal hell out of you dead relatives and collect ingredients to craft recipes, each one is getting you closer to your dark goal!\r\n</p>\n<p> \r\n</p>\n<p>Dark Pastry is a game developed for the Video game Design and Programming course at the Politecnico di Milano. More information at:\r\n</p>\n<p> \r\n</p>\n<p>http://www.polimigamecollective.org\r\n</p>", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2020-02-28T04:22:43", "background_image": "https://media.rawg.io/media/screenshots/930/9309ab392ffec8f6a6290fdfb482d35c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["POLIMI Game Collective"], "genres": ["Action"], "publishers": [], "esrb_rating": null}