{"id": 415748, "slug": "pluvioville", "name": "Pluvioville", "name_original": "Pluvioville", "description": "<p>This was my first game jam submission, and while I of course wish I could have polished it <strong><em>much</em> </strong>more, I'm happy that I was able to get basic prototypes of the core ideas I had for the game.<br/><br/>All of the assets (except for the one remaining placeholder Godot icon.png :P ) were created by me this week. Originally I was going to export this to HTML5, but I ran into a bug where none of the polygons with Skeleton2D's attached would be visible, and thus I was unable to make it functional at all on that platform.<br/><br/>If you defeat the final \"boss\" root, the color and rain will be restored to the world. This was originally going to be much more granular, but I ran out of time. You also will be able to fly around the level at will like Flappy Bird to more easily go back and see the true colors of the earlier platforms.<br/><br/>Source is extremely messy and probably not very educational... But here's the GitLab link: https://gitlab.com/Waridley/Pluvioville<br/><br/>Keyboard keybinds:<br/>Move - WASD or arrow keys<br/>Jump - Space or Keypad 0<br/>Crouch - Shift or Control<br/>Attack - Left click or E (Once you have your other leaf)<br/><br/>Controller mappings:<br/>Move - Any stick or D pad<br/>Jump - Xbox A, Nintendo B, DualShock X<br/>Crouch - L (1, 2, or 3)<br/>Attack - R2 (Once you have your other leaf)</p>", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2020-02-28T04:41:26", "background_image": "https://media.rawg.io/media/screenshots/64c/64c52964b465b38f7bc57e482bb02e35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Waridley"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}