{"id": 415700, "slug": "victory-design", "name": "Victory Design", "name_original": "Victory Design", "description": "<p>Decide the designs of the equipment of the armed forces in a time of turmoil and impending conflict. Adapt and fix the dire situation the army was left after the civil war. Push your own military doctrine to fit into the nation's capacities or risk defeat by the military staff blind demands.</p>\n<p><strong>SETUP</strong></p>\n<p>Following a long and disastrous civil war the nation's armed forces have been left in a complete mess with poor organization and serious flaws. Its fragility is an open door for the ever increasing threat beyond the borders. Due to your loyalty and vital strategic help during the civil war you have now been assigned as the Minister of Armed Forces. Your task is to revitalize the armed forces and bring them up to standard. It may be a time of peace and rebuilding but be on the lookout for the next big conflict.</p>\n<p><strong>MECHANICS</strong></p>\n<p>The armed forces of the nation are evaluated in 2 categories, Industry and Capacities. Additionally, Military Doctrine changes the emphasis of each Capacity that the Military Staff will use.</p>\n<p><strong><em>Industry</em></strong></p>\n<p>Industry is split in 3 categories: Engineering Capacity; Resource Capacity and Replenishment(Reliability). All these are important to ensure the armed forces has enough quantities of equipment to wage war, they are present in all designs and must be taken into consideration at all times.</p>\n<p><em><strong>Capacities</strong></em></p>\n<p>Capacities measures the ability of the armed forces to perform certain tasks. They are split in Anti-Infantry, Anti-Armor, Breakthrough, Exploitation, Morale and Efficiency.</p>\n<ul><li><em>Anti-Infantry</em> - The ability of the armed forces to face infantry, be it on defense or offense. Designs that contribute to this are Rifle, Artillery, certain tanks, etc</li><li><em>Anti-Armor</em> - The ability of the armed forces to face armored vehicles, be it on defense or offense. Designs that contribute to this are Anti-tank Rifle, Tank Destroyer, certain tanks, etc</li><li><em>Breakthrough</em> - The ability of the armed forces to push through enemy defenses. Designs that contribute to this are Mortar, SMG, certain tanks, etc</li><li><em>Exploitation</em> - The ability of the armed forces to take advantage of a breakthrough. Designs that contribute to this are utility vehicles, Armored Car, certain tanks, etc</li><li><em>Morale</em> - The ability of the armed forces to stay organized and motivated. All designs contribute to this</li><li><em>Efficiency</em> - The ability of the armed forces to perform tasks in the more efficient way possible. Designs that contribute to this are Engineer, Radio, Truck, etc</li></ul>\n<p><em><strong>Doctrine</strong></em> </p>\n<p>Doctrine changes the emphasis of each Capacity in the Armed Forces. This allows the Armed Forces to shape their combat style to focus on the good capacities of the equipment and minimize the impact of the bad capacities. The player doesn't have absolute control over the Doctrine, the Military Staff will produce their own Doctrine at the start of the game. However the player is allowed to make a single change to it every 6 months to try and better shape it into the capacities he desires.</p>\n<p><strong>TECHNOLOGICAL CONTEXT</strong></p>\n<p>The game starts in 1920 and portrays a military and technological reality close to the Interwar period (as is evidenced by the types of tanks available) while also including elements from the Second World War such as Tank Destroyers and combat Halftracks.</p>\n<p><strong>MOTIVATION</strong></p>\n<p>I'm a fan of Hearts of Iron game series which is a grand strategy game set in WW2 and in their latest installment they have added elements of designing and developing the designs for the armed forces to fit your desire and necessities. However I have found that their implementation of these elements was rather underwhelming, with a very clear \"meta\" to follow and meaningless options. Naturally their game is much deeper than Design decisions as such I felt this theme could be further expanded.</p>\n<p><strong>STATE OF THE GAME</strong><br/></p>\n<p>The core mechanics of the game are fully implemented, you are able to test and enhance your strategy to face any starting situation the game will throw at you. However your strategy will not yet be put to the test by the game, in the future a major event will occur around 2 years into the game that will be the final test to your planning, stay tuned for that.</p>", "metacritic": null, "released": "2020-02-08", "tba": false, "updated": "2020-02-28T04:30:04", "background_image": "https://media.rawg.io/media/screenshots/52e/52ee29bd4c546f31080e93770aaf49e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FrancM"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}