{"id": 415803, "slug": "sortir-des-lignes", "name": "Sortir des Lignes", "name_original": "Sortir des Lignes", "description": "<p><strong>Sortir des Lignes</strong> est le projet de  jeu que j’ai présenté en dossier d’admission <strong>2018</strong> à l’<strong>ENJMIN</strong>, pour le parcours Game Design. Nous avions un peu moins d’un mois et demi pour proposer un concept de jeu répondant à un sujet imposé : <em>Ellis Island</em> de Georges Perec. Récit qui retrace l’histoire de l’immigration des Européens vers les États-Unis.</p>\n<p>J’ai pris le parti de présenter l’aspect<strong> journalistique</strong> du phénomène, en utilisant le texte pour espace de jeu. J’ai voulu montrer l’évolution d’une ligne éditoriale à mesure qu’évoluent les événements. J’ai aussi cherché à rendre l’aspect chaotique des nouveaux phénomènes migratoires : le joueur ne doit plus parcourir l’article de presse mot après mot et ligne après ligne comme pour une lecture, mais doit multiplier les manières de parcourir le texte en empruntant toutes les directions possibles.</p>\n<p><strong>Développement</strong><br/></p>\n<p>Une fois le dossier rendu, j’ai développé un prototype en <strong>C++</strong> avec la bibliothèque <strong>Qt</strong> pour le rendu graphique. Il a été développé en à peu près deux semaines.</p>\n<p><strong>Contrôles<br/></strong></p>\n<p>Le jeu se joue à l'aide des <strong>touches directionnelles du clavier</strong>. Il faut déplacer une à une les lettres du mot sur des lettres similaires dans le texte, en essayant de s'approcher de la sortie en profitant des mouvements de groupe.<br/></p>", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2020-02-28T04:55:55", "background_image": "https://media.rawg.io/media/screenshots/fd2/fd2fee918b699e41370fdf9da60340e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HeuR"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}