{"id": 415995, "slug": "forsaken-hall", "name": "Forsaken Hall", "name_original": "Forsaken Hall", "description": "<p>Forsaken Hall is a tiny dungeon crawl adventure built in a weekend to try out some ideas for HTML / JavaScript based games.</p>\n<p>Your goal is to find 3 hidden treasures, then escape the dungeon by finding the exit stairs.</p>\n<p>Navigate the dungeon by clicking on the square and circle icons on the map. As you explore the dungeon new rooms will become available.</p>\n<p>When you explore a room for the first time it will cost a single unit of torch light. If you run out of torch light the game will end! (There may be some extra torches lying around...)</p>\n<p>In many rooms of the dungeon there are items or obstacles. You will collect most items automatically when you discover them.</p>\n<p>You may revisit any room by clicking on it again -- this will not cost any torch light. From time to time you may encounter obstacles you cannot overcome at first, so you may need to explore additional rooms, then return.<br/></p>\n<p>When you encounter an obstacle you can click on any item in your inventory to attempt to use it to overcome the obstacle. Some obstacles will have additional interactions as well.\r\n</p>\n<p><em><strong>Note that the dungeon does not change from game to game, so if you happen to die you can try again and take advantage of your knowledge of where items are located.<br/></strong></em></p>\n<p>If you enjoy the game, please share it with friends and consider following Spinfoam Games on Twitter.</p>\n<p>If you really, really enjoy the game, please consider making a small donation here or even subscribing to the Spinfoam Games Patreon.<br/></p>", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2020-02-28T05:50:06", "background_image": "https://media.rawg.io/media/screenshots/343/343564ff0b082ddd7f90f9d733c2c06b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Spinfoam Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}