{"id": 415926, "slug": "molly-death-wish-driver", "name": "Molly - Death Wish Driver", "name_original": "Molly - Death Wish Driver", "description": "<p>Hey there. Note that ESC is to quit the game. Apart from that normal WSAD, test it out and you will see for yourself, it is obvious. Spacebar is handbrake. \"L\" is for Lights. But the map is set in daylight so lights do not matter that much. </p>\n<p>Side game - can you find 3 cats.</p>\n<p>Now my big thing with this game is testing at every level. Please please tell me what you think. By all means feel free to nitpick things like \"you can drive through the trees\" but I do not think those super obvious details are as necessary, I know you can drive through the tree. I know alot of the bad things about this map because it is only a testing ground to test out my car. My point is you could spend ages pointing out all the bad things about this demo and feel free to, but note that this is going to be nothing like the finished game. I am sharing this just to show you first glimpse of what I am working on so you can see progress happening in the future. </p>\n<p>If you have any feedback, I stress to add, please do tell me. This game will like \"Molly - Can you survive 100 nights?\" be on sale but for something like 5 euro this time. I plan to have around 30 levels in it, you will speck up your car, your guns, yourself. You will be fighting zombies by the way. All to come in the future. Oh yeah, there will be a 2 player option in the game too where two people can play on one screen with a second keyboard, or even on the same keyboard or with an extra gamepad, or 2 gamepads. Cool I think. When second player joins the second player can be in a second car (with Molly and against the Zombies or with the Xombies against Molly. With you as the Zombie you would be a big baddie zombie). </p>\n<p>I will be making all the models, sound effect and music inhouse so the game will be 100% original content. Cool<br/><br/><br/></p>", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2020-02-28T05:25:18", "background_image": "https://media.rawg.io/media/screenshots/758/758cff81d68a225eb7467682ce638a7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hammerheadzoid"], "genres": ["Action"], "publishers": [], "esrb_rating": null}