{"id": 415925, "slug": "the-beanery", "name": "The Beanery", "name_original": "The Beanery", "description": "<p>Running a bean shop isn't as easy as they make it out to be. In this game demo from Rider &amp; Reiati, you'll spend three days running your own Beanery. Talk to your neighbors, steam beans, and serve orders! <br/></p>\n<p>Before you play there are a few instructions we didn't have time to put into the prototype. A<strong> controller is required.</strong> The button hints are for Xbox controllers, but other controllers will work. Also, the only level of cooking available in this game is \"steamed.\"</p>\r\nIntended Features\r\n<p>Please bear in mind this prototype finished <strong>without many of these features</strong>. We still wanted to show you what we had in mind for our game though! This section explains what we had in store for the game.</p>\r\nCustomize your Shop!\r\n<p>A catalog of items was intended to be provided for you to place into your shop however you wanted! Between days, you would have been able to order furniture from the online catalog, and place it however you like. Using the money you got from making orders, you could build your shop bigger and bigger over time! More chairs would add capacity to your shop for your neighbors to sit. Larger display cases would let you keep a larger stock of beans at your disposal. Online registers would get people in and out faster through your shop. Be careful though: if you optimize your shop for income, your neighbors might start to feel like customers.</p>\r\nMore Bean Types!\r\n<p>Find the steamer that suits your style! Unlock more ways to cook your beans, and personalize beans for your customers! Be sure to maintain a healthy balance between speed and comfort in your shop. Not all customers are even looking for a bean right now. Provide them dehydrated beans for their home, or even sell your own merchandise! Tourists love getting token items for trips they've taken!</p>\n\r\nConcept art for the stocking screen.<br/>\r\nAnd much More!\r\n<ul><li>Highly Contextual Dialog</li><li>Neighborhood Economy</li><li>Hold Excess Stock in your Back Room</li><li>A Full Settings Screen</li></ul>\r\nKeep Updated!\r\n<p>Follow Boo Rider (@stopboorider) for beautiful art and interesting stories. Follow James Reaiti (@jamesreiati) for game development updates. You can't follow our composer Tombard anywhere right now,  but keep your eye out for him!<br/></p>", "metacritic": null, "released": "2020-02-23", "tba": false, "updated": "2020-02-28T05:25:05", "background_image": "https://media.rawg.io/media/screenshots/719/719c8ee97cec249ed397fb708842c0c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["James", "Boo Rider"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}