{"id": 416, "slug": "grand-theft-auto-san-andreas", "name": "Grand Theft Auto: San Andreas", "name_original": "Grand Theft Auto: San Andreas", "description": "<p>Grand Theft Auto - San Andreas is the seventh entry in the series in the GTA franchise, but only second big title after GTA - Vice City. Setting up in fictional state San Andreas, you follow the story of CJ, a member of one of the multiple gangs in the city. CJ&#39;s family is being attacked in drive shooting which resulted in the death of CJ&#39;s mother, so he returns to home from Liberty City. Meeting the rest of the family at his mom&#39;s funeral, he decides to rebuild the gang and gain control of the state.</p>\n<p>The game makes a brilliant connection with missions and open world actions that you are able to do around the cities. You can steal cars, buy guns, hunt for collectables and do some side quests, while different characters give you specific missions in order to push the plot forward. Streets are filled with people as well as plenty of vehicles to steal. Fictional brands of cars, tanks, bikes are available to be stolen from any place around the city. Armoury contains pistols, rifles, hand-machine guns or a rocket launcher as well as melee weapons giving player freedom in anything he&#39;s doing in GTA.</p>", "metacritic": 93, "released": "2004-10-26", "tba": false, "updated": "2024-04-21T00:52:05", "background_image": "https://media.rawg.io/media/games/960/960b601d9541cec776c5fa42a00bf6c4.jpg", "website": "http://www.rockstargames.com/sanandreas/pc", "rating": 4.51, "rating_top": 5, "added_by_status": {"yet": 275, "owned": 5994, "beaten": 3507, "toplay": 188, "dropped": 1062, "playing": 118}, "playtime": 2, "achievements_count": 121, "ratings_count": 3705, "suggestions_count": 485, "game_series_count": 12, "reviews_count": 3728, "platforms": ["macOS", "PC", "iOS", "Xbox", "Android", "PlayStation 4", "PlayStation 3", "PlayStation 2", "Xbox 360", "Xbox One"], "developers": ["Rockstar North", "War Drum Studios"], "genres": ["Action"], "publishers": ["Capcom", "Rockstar Games", "1C-SoftClub"], "esrb_rating": "Mature"}