{"id": 4160, "slug": "djmax-technika-tune", "name": "DJMAX TECHNIKA TUNE", "name_original": "DJMAX TECHNIKA TUNE", "description": "DJMAX TECHNIKA™ has made a huge splash in the arcade scene, and now players can experience it anywhere! Thanks to the PS Vita's touchscreen technology, the gameplay that has made the arcade title such a hit can make the transition to the home market as well! Exclusively for the PlayStation®Vita system, DJMAX TECHNIKA TUNE™ has been built from the ground up to take advantage of everything the system has to offer.<br/><br/>Featuring in-game trophies, unlockable galleries, real time online rankings and more, the replay value is endless! DJMAX TECHNIKA TUNE™ features the best tracks from all 3 iterations of the DJMAX TECHNIKA™ arcade game along with new songs, and classic DJMAX Online tracks with updated background movies and new charts. All of this content is all wrapped up in a bundle set to deliver one of the most well rounded, genre encompassing music games of all time!<br/><br/>1 player(s)<br/>Network Features<br/>1024KB Minimum<br/>Touchscreen<br/>Rear Touch Pad<br/><br/>  Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.<br/><br/>", "metacritic": null, "released": "2012-12-04", "tba": false, "updated": "2023-03-29T13:23:18", "background_image": "https://media.rawg.io/media/screenshots/de8/de800be69cbd24ddbd05e0bf21c5c794.jpg", "website": "", "rating": 3.67, "rating_top": 4, "added_by_status": {"owned": 46, "beaten": 2, "toplay": 1, "dropped": 7}, "playtime": 0, "achievements_count": 2, "ratings_count": 8, "suggestions_count": 102, "game_series_count": 5, "reviews_count": 9, "platforms": ["PS Vita"], "developers": ["PENTAVISION"], "genres": [], "publishers": [], "esrb_rating": "Teen"}