{"id": 416053, "slug": "lego-legacy-heroes-unboxed", "name": "LEGO Legacy: Heroes Unboxed", "name_original": "LEGO Legacy: Heroes Unboxed", "description": "<p>Immerse yourself in a vibrant LEGO® universe full of action, battles, sets and heroes! Your favorite minifigures and sets are busting out of the box in the most vibrant turn-based RPG ever assembled.<br />\nBattle your way to the top of the leaderboard with teams of iconic heroes from the LEGO themes you love, and prepare for action-packed RPG campaigns that will take you all the way from the high seas to space.<br />\n[STRATEGIC RPG BATTLES]<br />\nCreate the LEGO mashup of your dreams! Utilize each hero for their unique skills to battle and dismantle your RPG foes. Take your team to the next level with a winning turn-based strategy.<br />\n[COLLECT ICONIC HEROES]<br />\nUnite iconic LEGO minifigures from all eras such as Hot Dog Man, Captain Redbeard, Lloyd from Ninjago, Majisto, Willa the Witch, Spaceman Reed and many more! Power up your heroes to build awesome abilities and strike down your enemies!<br />\n[BUILD REAL LEGO SETS]<br />\nRediscover amazing sets from every LEGO theme including: LEGO City, LEGO Castle, LEGO Ninjago, LEGO Pirate and LEGO Space (with many more to come!). Build sets and unravel their secrets to add strength and create synergies to help your teams in battle.<br />\n[MULTIPLAYER TURN-BASED STRATEGY RPG]<br />\nJoin forces with other RPG players in asynchronous multiplayer battles! Join a guild and borrow heroes to help you battle your way through campaigns and events.<br />\n[NEW LEGO ADVENTURES]<br />\nStrike out into a completely new RPG LEGO world on a journey of thrills, chills, humor... and peril!<br />\nDon’t forget to join our communities on:<br />\nDiscord: https://gmlft.co/LLHU-iOS-DISCORD<br />\nFacebook: https://gmlft.co/LLHU-iOS-Facebook<br />\nYouTube: https://gmlft.co/LLHU-iOS-YouTube<br />\nInstagram: https://gmlft.co/LLHU-iOS-Instagram<br />\nSign up to receive the latest news and find out more about our Creator Program on:<br />\nwww.LEGOLEGACY.com<br />\nYou can download and play this game for free. Please be informed that it also allows you to play using virtual currency, which can be acquired as you progress through the game or by paying with real money.<br />\nPurchases of virtual currency using real money are performed using a credit card, or other form of payment associated with your account, and are activated when you input your iTunes account password, without the need to re-enter your credit card number or PIN.<br />\nOnce your iTunes account password is entered, your account will allow in-app purchases for 15 minutes. To restrict or disable in-app purchases, you can change the settings on your iOS device (Settings &gt; Screen Time &gt; tap “Turn on Screen Time”).<br />\nDisabling password protection may result in unauthorized purchases. We strongly encourage you to keep password protection turned on if you have children or if others could have access to your device.<br />\nAn additional download of 500 to 600 MB is required to play this game. Please note the size of this required download may change without notice.<br />\nThe game requires an Internet connection (3G or Wi-Fi) for downloads and updates, and other features including playing with friends.</p>\n<hr />\n<p>Visit our official site at http://gmlft.co/website_EN<br />\nTerms of Use: http://www.gameloft.com/en/conditions-of-use<br />\nPrivacy Policy: http://www.gameloft.com/en/privacy-notice<br />\nEnd-User License Agreement: http://www.gameloft.com/en/eula</p>", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2023-09-15T06:03:24", "background_image": "https://media.rawg.io/media/screenshots/219/219173172de3010446845a8073b26ab8_JYY7Mcm.jpg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Gameloft", "Netflix"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Gameloft", "Netflix"], "esrb_rating": null}