{"id": 416052, "slug": "happy-chef-cooking-game", "name": "Happy Chef: Cooking Game", "name_original": "Happy Chef: Cooking Game", "description": "[Background]<br/>A chef with a dream, who practices cooking and sees the food culture and ethnic customs around the world; Learn how to cook dishes across the world with all sorts of different cooking styles.<br/><br/>[Features]<br/>Enjoy various kinds of delicious food and Feel food culture in distinctive restaurants from different countries.<br/><br/>[FAST, EASY and ADDICTIVE Game Play]<br/>* All cooking is completed with just a click.<br/>Game flow: Customers appear - Stand and Show the menu - Cooking the dishes - Serve the dishes - Customers leave with tips.<br/>Cooking process: Tap the raw materials to start cooking - Wait till the ingredients are ready and Tap to plate - Garnish the dishes or mix drinks to complete various food combinations.<br/>* Serve food with the right side dishes<br/>* Earn golds and diamonds from cooking service<br/>* Upgrade kitchenware and food for best cuisines<br/>* Complete multiple cooking goals to pass levels<br/>* Open new restaurants and learn new cooking skills<br/>* Do Daily Quests to get rarity boosters and rewards<br/>* Create MORE combos and win bonuses<br/>* Keep an eye on the oven, don’t burn food\u2028* Arrange your cooking reasonably, don’t discard food\u2028* Use time management skills\u2028* Serve in smart dish sequence<br/><br/>Tired of waiting for new levels in the other games? That won’t happen in the Happy Chef. More than one thousands of game levels are waiting to challenge you! And we release updates regularly with new restaurants, new levels, new dishes, and fresh gameplay! Download for FREE NOW and get ready to ENJOY the cooking world!<br/><br/>Subscription Info:<br/>- 25 RMB per week (7 Days)<br/>- VIP subscribers can get the following privileges during the subscription period:<br/>(1) Get 100 diamonds every day<br/>(2) Double life Recovery Speed<br/>(3) Snacks Limit *2<br/>(4) Double the amount of get the Snacks<br/>- Payment will be charged to iTunes Account at confirmation of purchase and within 24-hours prior to the end of the current period.<br/>- Subscription automatically renews unless auto-renew is turned off (from Account Settings) at least 24-hours before the end of the current period.<br/>- No cancellation of the current subscription is allowed during active subscription period.<br/>- Unsubscribe process:<br/>1. Go to Setting &gt; iTunes Store and App Store<br/>2. Select your Apple ID<br/>3. Select \"View Apple ID\"<br/>4. Select \"Subscription\"<br/>5. Find the corresponding subscription of Happy Chef<br/>6. Select \"Cancel Subscription\".<br/><br/>Privacy Policy: http://img.m.duoku.com/cimages/img/promo/page/protocol/protocol.html\u2028Terms of Service: http://img.m.duoku.com/cimages/img/promo/page/protocol/protocol.html", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2020-03-02T02:02:38", "background_image": "https://media.rawg.io/media/screenshots/bb6/bb66aae41cd6fe5098453214a13fafc7_POj8feD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["jiawei hou"], "genres": ["Simulation"], "publishers": ["jiawei hou"], "esrb_rating": "Everyone 10+"}