{"id": 416042, "slug": "ash-of-gods-tactics", "name": "Ash of Gods: Tactics", "name_original": "Ash of Gods: Tactics", "description": "<p>I remember the day when the blazing star struck the ground. Thousands of humans were killed, once prosperous countries were destroyed and cities were reduced to ruins... It was long ago. Cities were builded again and humans returned to their peaceful lifes. But I know that the Reaping is coming.<br />\nThe world of Terminum is on the edge of war. I feel it. A lot of blood will be shed. They are coming. And death follows them.<br />\nBut there&#39;s hope yet. A chance to change the grim fate. I don&#39;t want to see this world perishes. And I need your help in this difficult and dangerous adventure. Will you join me?<br />\nA prequel for award-winning Ash of Gods: Redemption is here!<br />\nGather your party, manage it, hire and train units to level it in your own way. Find and buy powerful artifacts to make your characters stronger, complete a deck of magical cards to surprize your opponents on a battlefield and create unique strategies to carve your path through many difficult fights and face The Reaping.<br />\n● 24 story mode battles with three difficulty levels. Can you beat them all?<br />\n● PvP mode: create a strong team and compete with other players to get to the top of the ladder and get your rank among the best<br />\n● Make your party unique: train units and hire new ones, buy artifacts and collect a deck of magic cards which are perfect for your strategy<br />\n● A beautiful standout 2D hand-drawn graphics and rotoscoping animation<br />\n● A captivating story which is prequel to Ash of Gods: Redemption&#39;s storyline<br />\nContact US<br />\nEmail Address: ashofgods.cs@teebik-inc.com<br />\nFan Page: https://www.facebook.com/AshofGodsMobile/</p>", "metacritic": null, "released": "2019-09-18", "tba": false, "updated": "2022-08-17T14:09:13", "background_image": "https://media.rawg.io/media/games/385/3855cec59d9d67886c76b221ed3b0800.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 226, "game_series_count": 3, "reviews_count": 1, "platforms": ["iOS"], "developers": ["TBG"], "genres": ["Strategy", "Card"], "publishers": ["TBG"], "esrb_rating": "Teen"}