{"id": 416055, "slug": "merge-wood-block-puzzle", "name": "Merge Wood: Block Puzzle", "name_original": "Merge Wood: Block Puzzle", "description": "Wood Block Merger is a brand new puzzle game! A new type of brain training puzzle, entertain your brain for minutes or hours.<br/>Just drag the block onto another one with the same number!<br/>Merge them into a bigger number!<br/><br/><br/>FEATURES<br/>- Easy to learn, hard to master <br/>- Exercise the brain and make people smart<br/>- Merge tiles with the same number<br/>- Minimalism graphics suitable for all ages<br/>- Playing the game with your friends and family<br/>- No time limit, play anywhere.<br/><br/>As a puzzle game lover, you will love this wood block merge game.<br/><br/>Subscription Terms<br/>VIP Membership is a subscription.<br/>After buying this subscription, you will receive: free continue every game over, start from high number and remove all ads. This is an Auto-renewable subscription. Payment will be charged to your iTunes account at confirmation of purchase and will automatically renew (at the duration/price selected) unless auto-renew is turned off at least 24 hrs before the end of the current period. The account will be charged for renewal within 24-hours prior to the end of the current period. Subscriptions may be managed and auto-renewal may be turned off via Settings &gt; App and iTunes Stores &gt; Apple ID &gt; View Apple ID<br/><br/>The prices are established for United States customers. Pricing in other countries may change and actual charges may be converted to your local currency.<br/><br/>End of trial and subscription renewal:<br/>• The payment is charged to your account after a confirmation of purchase.<br/>• The subscription is renewed unless you turn it off 24 hours before the end of the current period.<br/>• The account will be charged for renewal within 24 hours before the end of the current period at the cost of the weekly subscription.<br/>• The user may manage the subscription and auto-renewal have to be turned off by going to the user’s account settings after purchase in the Store.<br/>• No cancellation of the current subscription is allowed during the active subscription period.<br/><br/>Canceling a trial or a subscription:<br/>• If you want to cancel a subscription during its free trial, you have to cancel it through your account in the Store. This must be done at least 24 hours before the end of the free trial period to avoid being charged.<br/><br/>For more information, please visit https://support.apple.com/HT207865 <br/><br/>If you have any questions, feel free to contact us at support@lihuhugames.com<br/><br/>Privacy Policy and Terms of use: http://lihuhugames.com/privacy.html", "metacritic": null, "released": "2019-09-19", "tba": false, "updated": "2020-03-02T02:03:45", "background_image": "https://media.rawg.io/media/screenshots/39e/39eac2a8098e198afeeb6b0c0f8b17ea_J9hrYH0.jpg", "website": "http://lihuhugames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LIHUHU PTE"], "genres": ["Board Games", "Puzzle"], "publishers": ["LIHUHU PTE"], "esrb_rating": "Everyone 10+"}