{"id": 41627, "slug": "plants-vs-zombies-2-free", "name": "Plants vs. Zombies 2: It's About Time", "name_original": "Plants vs. Zombies 2: It's About Time", "description": "<p>Play the award-winning hit action-strategy adventure where you meet, greet, and defeat legions of hilarious zombies from the dawn of time, to the end of days. Amass an army of amazing plants, supercharge them with Plant Food, and devise the ultimate plan to protect your brain.<br />\n100 Million Downloads – This app has received more than 100 million overall downloads.<br />\nDISCOVER HUNDREDS OF PLANTS AND ZOMBIES<br />\nCollect your favorite lawn legends, like Sunflower and Peashooter, along with hundreds of other horticultural hotshots, including creative bloomers like Lava Guava and Laser Bean. Go toe-to-missing-toe with a massive array of zombies at every turn, like Jetpack Zombie and Mermaid Imp – you’ll even have to protect your brain from rampant Zombie Chickens!<br />\nGROW POWERFUL PLANTS<br />\nEarn Seed Packets as you play and use them to fuel your plants like never before. Power up attacks, double-down defenses, speed up planting time, and even gain entirely new abilities. Boost your plants to ensure those zombies are lawn-gone!<br />\nJOURNEY THROUGH SPACE AND TIME<br />\nBattle across 11 crazy worlds, from Ancient Egypt to the Far Future, and beyond. With more than 300 levels, ultra-challenging endless zones, fun mini-games, and daily Piñata Party events, there’s always a new challenge to complete. Plus, ready your best defenses – Dr. Zomboss is waiting to take you on at the end of every world!<br />\nEXPLORE MORE WITH THE TRAVEL LOG<br />\nStumped about where to go next? Consult your Travel Log to embark on exciting Quests created just for you. Complete Scheduled Quests before time runs out, or take on a series of Epic Quests and earn special rewards.<br />\nRequires acceptance of EA’s Privacy &amp; Cookie Policy and User Agreement.<br />\nBy installing this game, you consent to its installation and the installation of any game updates or upgrades released through your platform. You can turn off automatic updates through your device settings, but if you do not update your app, you may experience reduced functionality.</p>", "metacritic": null, "released": "2013-08-15", "tba": false, "updated": "2024-04-12T20:41:56", "background_image": "https://media.rawg.io/media/screenshots/511/511a5cb40253866cbcf18bc773a62825.jpg", "website": "http://www.popcap.com/plants-vs-zombies-2", "rating": 3.66, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 28, "beaten": 66, "toplay": 8, "dropped": 89, "playing": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 111, "suggestions_count": 353, "game_series_count": 7, "reviews_count": 112, "platforms": ["Android", "PC", "iOS"], "developers": ["Electronic Arts", "PopCap Games"], "genres": ["Adventure", "Strategy", "Arcade", "Casual"], "publishers": ["Electronic Arts", "PopCap"], "esrb_rating": null}