{"id": 416266, "slug": "angelic-waves-demo", "name": "Angelic Waves (demo)", "name_original": "Angelic Waves (demo)", "description": "<p>Here’s the story about our MC of this visual novel game called Maxwell Cross, a out-of-love person who barley has a social life, got an slight anxiety problem and living in a small apartment.\r\n  </p>\n<p>One day, three new neighbours have move in the luxury suite two floors from you.\r\n  </p>\n<p>Maxwell Cross meets Geline, with long-blonde hair and good-girl personality woman in the lobby. After a short talk, Roya, with short hair and cool-looking woman and Anabelle, a bubbly girl who comes along and greet him. After their talk and helping them moving in, Maxwell returned to his room.\r\n  </p>\n<p>But many days later of getting along with the girls from weeks to weeks, he’ll starting to have feeling for the girls, likewise as the girls. But as a dating sim, you must choose one girl to date. When the relationship grew closer with your chosen girl, the girl shares you a secret that’ll change your life forever.\r\n</p>\n<p>Why are the girls being so close to each other? Well their love more important than the secret? Will this visual novel protagonist survive the most challenging task ever… a relationship?! Play the game to find out!<br/></p>\n<p>Genre: Comedy, Romance, Drama, Fantasy, Slice of Life\r\n  </p>\n<p>Romance: B x G \r\n</p>\n\n<p>(Mild Language,)</p>\n\n<p><strong>Bus Arrows Studios is an visual novel and media studio founded and owned by an visual novel developer newcomer, Jaygee598. Which is a supporter of visual novels, voice actors and other visual novel developers in several communities.\r\n  </strong></p>\n<p><strong>Jaygee598/Bus Arrows Studios: (Director/Writer/Programmer/Character Design)\r\n  </strong></p>\n<p><strong>Here’s the great people that helped me developing this nice game. :)\r\n  </strong></p>\n<p><strong> \r\n  </strong></p>\n<p><strong>Background (BG) Artists: Keiraworks, Gin-1994, AvareonArt and more....\r\n  </strong></p>\n<p><strong>CG artists: ReefMeizer, HimeXin, Shiinashi, Kiorang\r\n  </strong></p>\n<p><strong>Character Sprites: Larvinlucas   </strong></p>\n<p><strong>Character Artist: ReefMeizer   </strong></p>\n<p><strong>Composers: Jan Hehr (Kosmos connections, Beyond You), Ian Booms, CthulhuSeeker (Pixel Happy Games, Caffeine: Victoria’s Legacy) and more....\r\n  </strong></p>\n<p><strong>GUI: DS-sans (Chemically Bonded, Sound of Her Love)\r\n  </strong></p>\n<p><strong>Writer editors: Kelebek, Voraguard   </strong></p>\n<p><strong>Assistant programmer: just_mr_j   </strong></p>\n<p><strong>Special thanks: Omega Fallon, Latte coffee VN, Insanity, Fluffland, Pixel Happy Games, LoveVNdev and more....</strong>\n</p>", "metacritic": null, "released": "2020-03-01", "tba": false, "updated": "2020-03-02T02:56:48", "background_image": "https://media.rawg.io/media/screenshots/f28/f283197268a483ba4a00c852c27f4699.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Bus Arrows Studios"], "genres": [], "publishers": [], "esrb_rating": null}