{"id": 416311, "slug": "igors-quest", "name": "Igor's Quest", "name_original": "Igor's Quest", "description": "Background story\r\n<p>One day, Igor is minding his own business in the living room of Frankenstein's castle, when the doctor comes running down the stairs from his laboratory. He is clearly excited.<br/></p>\n<p>\"Igor! I've done it! The machine is ready and there's a thunderstorm due tonight. I need fresh body parts: head, hair, eyes, ears, body, arms, hands, legs and feet. You know what to do. Bring the parts to the laboratory. Pronto!\"</p>\n<p>\"Yes, master.\"<br/></p>\n<p>The doctor then adjourns to his study.<br/></p>\n<p>You must help Igor to find all the body parts and return them to Frankenstein's laboratory. This may not be as easy as it sounds. You see, Igor is not all that bright. He gets easily confused, particularly where the English language is concerned.<br/></p>\n<p>Body parts are cleverly disguised using various forms of word play such as homonyms (words that sound the same and are spelled the same, but have different meanings), homophones (words that sound the same, but are spelled differently and have different meanings), synonyms and so on.\r\n</p>\n<p>There are nine body parts. You are awarded 5 points for each part you find and 5 points for each part you return to the lab. Each time you are awarded points, a short jingle plays, so make sure you have sound turned on. If you hear the jingle, but don't see the body part, it's probably in your inventory.</p>\r\nInstructions\r\n\r\n\r\n<p>This is a traditional text adventure written for the Adventuron Treasure Hunt Jam that ran from 6 February to 5 March 2020. The rules were defined at https://itch.io/jam/treasure-hunt. Under the rules of the jam, all room descriptions, object descriptions and commands are limited to one or two words. Responses and incidental messages are limited to six words, but I chose to take the extra (optional) challenge of limiting these to two words. The intro and end-game text is limited to three sentences.</p>\n<p>Use one- or two-word commands to help Igor search the castle and the surrounding area for the parts that Frankenstein needs to create his monster. Commands consist of a verb, optionally followed by a noun. Because of the two-word limitation, there are a few places where an adjective can be used instead of a noun so that you can distinguish between otherwise identical objects.</p>\r\nMovement\r\n<p>To move around, use GO NORTH, GO SOUTH and so on. You can move in any of the four cardinal compass directions, as well as UP and DOWN. To save typing, movement commands can be abbreviated to N, S, E, W, U and D. You can sometimes use other commands such as ENTER, JUMP or SWIM to move to another location. These will be reasonably obvious when the time comes.</p>\r\nExamining things\r\n<p>As you are hunting for body parts, most of your time will be spent searching your environment. Make sure you EXAMINE everything you come across, even insignificant things like room descriptions and scenery, as subtle hints and clues are scattered everywhere. If you don't find a clue, you might at least find a pun or some subtle humour. This game is intended to be fun to play, as well as fun to solve. To save typing, EXAMINE can be abbreviated to X. For example, EXAMINE TABLE can be abbreviated to X TABLE.<br/></p>\r\nManipulating objects\r\n<p>Apart from examining things, most of your time will be spent manipulating objects. Use commands like GET or TAKE to pick up an object, e.g. GET AXE. Use commands like DROP or DISCARD to drop an object, e.g. DROP AXE. Use WEAR to wear an item of clothing and REMOVE to remove something that is already worn. To see what you are currently carrying and wearing, use INVENTORY (or I). Igor is not a Mack truck, so he can only carry five items and wear two items.</p>\n<p>There are many other verbs that can be used to manipulate objects. These will be fairly obvious when the time comes. Common verbs include OPEN, CLOSE, PLAY, EAT, INSERT and so on. The game has well over 100 verbs, so if something doesn't work, try a synonym or try a different way of achieving the same thing. For example, if FEED BIRD doesn't work, try GIVE SEED.</p>\r\nCommunicating with characters\r\n<p>You will encounter a few characters in the game. In addition to examining them, try verbs like TALK, GIVE and SHOW.</p>\r\n Other commands\r\n<p>Use LOOK (or L) to refresh the display.<br/></p>\n<p>Use VERSION to get the game version or ABOUT, CREDITS or INFO to get the game version plus some extra info about the game. These are the only commands that are not restricted to the two-word response.</p>\n<p>Use SCORE to get your score, although this is also shown in the status bar at the top of the screen.</p>\n<p>Use TURNS to see how many turns you've taken. Once you've solved the game, you should try to solve it in as few moves as possible. The number of turns taken does not include \"meta\" commands such as SCORE, TURNS and INVENTORY.</p>\n<p>Use SAVE to save your progress. Use LOAD or RESTORE to restore a saved game. Due to a limitation in Adventuron, use LOOK after restoring a saved game to refresh the display.<br/></p>\n<p>Use UNDO to undo the last move.</p>\n<p>Use WAIT (or Z) to do nothing apart from pass the time.</p>\n<p>Use SOUND ON and SOUND OFF to turn sound on and off.<br/></p>\n<p>Most importantly, have fun and enjoy the game.<br/></p>", "metacritic": null, "released": "2020-03-01", "tba": false, "updated": "2020-03-02T03:07:36", "background_image": "https://media.rawg.io/media/screenshots/165/165265c1a6d55c3950447eb24c65bcd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Garry Francis"], "genres": [], "publishers": [], "esrb_rating": null}