{"id": 416485, "slug": "stay-awake-neverdarkentertainment", "name": "Stay Awake (neverdarkentertainment)", "name_original": "Stay Awake (neverdarkentertainment)", "description": "<p>Game a Month #2: Stay Awake</p>\n\n<p>Have you ever felt that you just couldn't stay awake even though you've drank your weight in coffee? Then this is the game just for you! Play as the narcoleptic Bob as he goes through his daily life trying not to go to sleep. Explore new areas like your Bedroom, Traffic, and the most exciting place in the world the Office! Even though joys are bound to happen, don't forget that if you fall asleep you could crash your car or even worse you could lose your job! OOOOO spooky! So adventure on the high seas I mean high traffic areas and Stay Awake you filthy animal!</p>\n<p>Controls:</p>\n<p>Controller:</p>\n<p>A button : Increment the progress bar.</p>\n<p>B button: Move to the next level if you've won or lost.</p>\n\n<p>Keyboard:</p>\n<p>Space Bar: Increment the progress.</p>\n<p>Enter key: Advance to next level if you've won or lost.</p>\n<p>Known Bugs:</p>\n<p>1. If you see the next level dialogue box disappear don't panic. Just press the B or Enter button and it should push you to the next level.</p>\n\n<p>Designers Notes:</p>\n<p>If you find anything or would like to give feedback on the project please comment here. This game was a bit frustrating to complete, but I found it to be a lot of fun. I hope you do too. Please enjoy!</p>", "metacritic": null, "released": "2020-02-29", "tba": false, "updated": "2020-03-02T03:47:14", "background_image": "https://media.rawg.io/media/screenshots/565/56565b15d49b37d8b5365cd8e02f5ff0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["neverdarkentertainment"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}