{"id": 41647, "slug": "frozen-hearth", "name": "Frozen Hearth", "name_original": "Frozen Hearth", "description": "<p>Frozen Hearth is an indie hybrid of role-playing and real-time strategy games developed by Epiphany games.</p>\n<h3>Plot</h3>\n<p>The world is invaded by an unknown deadly force. You must save it from certain extinction by becoming a powerful reincarnation of a legendary Danaan. Save the world from the ice monsters, known as Shangur, that are driven by an unstoppable wave of moving ice and snow, consuming anything it reaches.</p>\n<h3>Gameplay</h3>\n<p>The gameplay of Frozen Hearth is heavily influenced by the Defence of the Ancients and other MOBAs. The players control a single character that can issue orders to their army. It is possible to level your character up unlocking new abilities or enhancing the already existing ones. The main objective of a singleplayer campaign is to annihilate the army of your enemy and destroying their base. The player chooses a mission to participate in and spawns on the map. </p>\n<p>The players are also able to cast special magical spells that can either buff their own army or help destroy the enemy one. It is also essential for the player to build special structures to create more powerful units to lead into the fight.</p>\n<h3>Multiplayer</h3>\n<p>The game also features a multiplayer mode while the singleplayer one is used to prepare the player for the multiplayer. Once you master the aspects of the singleplayer mode, a multiplayer mode is unlocked, where the players fight each other on the maps that are ported over from the campaign with the same gameplay.</p>", "metacritic": null, "released": "2012-11-29", "tba": false, "updated": "2019-09-17T05:06:41", "background_image": "https://media.rawg.io/media/screenshots/1f1/1f1bd3e33e2ba212ab6b026b7a4046a1.jpg", "website": "http://www.frozenhearth.com/", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 401, "beaten": 1, "toplay": 1, "dropped": 5}, "playtime": 2, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC"], "developers": ["Epiphany Games"], "genres": ["Strategy"], "publishers": ["Immanitas Entertainment"], "esrb_rating": null}