{"id": 416589, "slug": "jump-rangers-corebook", "name": "Jump Rangers - Corebook", "name_original": "Jump Rangers - Corebook", "description": "<p>Jump Rangers is about little kid space commandoes fighting for humanity's survival against an empire of giant alien dinosaurs - as well as giant alien robots, and all the other giant threats that wait for us among the stars. When \"The Saurian Horde\" invaded Earth, our world has no interstellar travel of our own. The only way humanity could survive was by colonizing their vast and cavernous motherships, colonizing the worlds where they land, and spreading out amongst the stars like an infestation of bed bugs.</p>\n<p>While the grown-up refugees of Earth struggle through their ragtag, \"bandages and blasters\" existence and cling to the last little pieces of human civilization, a number of brave kids have taken it upon themselves to sneak aboard alien vessels and steal technology, to carry news between worlds and star systems, to fight back against the aliens, and to lead humanity into the future. Nobody told these kids to run away and become our heroes. In Jump Rangers, kids really are the future... and that future is now.</p>\n<p>Here's what you're looking at!<br/></p>\n<p><strong>JUMP RANGERS COREBOOK &amp; Character Sheet - FREE!<br/></strong></p>\n<p>In this book, you'll find everything a storyteller needs to run a Jump Rangers game - from the rules of the game to all the basics of life as a Jump Ranger. Get to know the monsters that rule the galaxy, as well as the tools, weapons, and vehicles people have invented to fight them. Discover some of the worlds where humanity has taken refuge among the stars. Embark on <strong>FIRST CONTACT,</strong> a Jump Rangers mission!</p>\n<p><strong>EXPANSIONS - $12 in bulk, or hit the links below to buy individually for $5 each (or subscribe on Patreon, for the whole lot, plus future expansions, plus benefts, starting at $5)</strong><br/></p>\n<p><strong>INTEL FILE: RUNAWAYS &amp; Character Sheet<br/>Individual file: https://jumprangers.itch.io/runaways</strong><br/>Check out the expansion that the Jump Rangers do not want you to see! What happens to the kids who stow aboard an alien spaceship and run away into the big, wide galaxy... without ever training to be a Jump Ranger? Not only does this book have the answers, it provides rules for creating your own antihero! From the Punk Rangers to the scavengers of the Saurian wastelands, from the criminal underworld of Dragon City to the scrap caverns of Planet Clearance, this is a sourcebook on the destiny and that awaits a runaway.</p>\n<p><strong>INTEL FILE: OF MICE AND MANDIBLES &amp; Character Sheet<br/>Individual file: https://jumprangers.itch.io/spacemice</strong><br/>What was Planet Mist, before it became an eerie warzone between the Saurian Horde and the spore bugs? Before the Saurian Horde descended from the skies of Mist, this world was home to a race of peaceful space mice called the mistlings. Explore their history, their culture, and their complicated relationship with the spore bugs that are even now fighting to retake Planet Mist from the Saurian Horde. Learn the secrets of the Nomads, the exiled, unsung heroes that saved the mistling people from Saurian extermination! Create a Nomad hero, and bring the wonder and adventure of space mice to your Jump Rangers opera!</p>\n<p><strong>MISSION FILE 1: THE UNDERSAUR ALLIANCE<br/>Individual file here: https://jumprangers.itch.io/undersauralliance</strong><br/>In the very first Jump Rangers opera to start laying out the Jump Rangers continuity, General Ardin Paksis needs the Rangers to help him wipe the Saurian Horde off of Planet Battleground - and to build a weapon strong enough to push the Horde of of Sauros or Earth! Because the General's plan only works with the help of the undersaurs, the Rangers will journey from Battleground to Sauros and back again. Along the way they'll face the Saurian front on Planet Battleground, the dangers of the underworld of Dragon City on Sauros, and everything between!</p>\n\n<p>Questions? Comments? Use the discussion board, or just come find us on Twitter!</p>\n<p><strong>JUMP RANGERS</strong>: For all things Rangers.</p>\n<p><strong>TENNYSON E. STEAD</strong>: Writer, Producer, Created By</p>\n<p><strong>LEE HULME</strong>: Development Coordinator, Editor, Writer</p>\n<p>In the corps, we don't say \"good luck.\" What we say is \"go high and go far.\"</p>\n<p><strong>Go high and go far, Rangers!</strong></p>", "metacritic": null, "released": "2020-02-27", "tba": false, "updated": "2020-03-02T04:14:09", "background_image": "https://media.rawg.io/media/screenshots/44b/44bf2fa5c13a576a1d9c100881c9a5fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JumpRangers"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}