{"id": 416645, "slug": "shuffs-no-relation-games", "name": "Shuffs (No Relation Games)", "name_original": "Shuffs (No Relation Games)", "description": "<p>Frashten Farm has shut down and Shuffs the scarecrow is out of work. That's where you come in! No scarecrow can navigate the intricate, physics based puzzles laid out across Bowkin County without a cool, capable player behind the wheel. Could that be you? Do you have the resourcefulness to scour your environment for objects and projectiles to aid you in this journey? Do you have a keen eye to suss out the solution to these pesky little puzzles? Do you have the skills to take said objects and projectiles, juggle and hurl them through said puzzles, and pull out a stylish trick shot or two along the way?</p>\n\n<p>\"No.\" - Oh, uhh, yeah...that's uhh...that's cool...</p>\n\n<p>\"Yes.\" - Of course you do! You're an absolute champion! So here's what's on offer:</p>\n<ul><li>38 levels across 13 stages</li><li>4 boss fights</li><li>24 bonus levels</li><li>2-3 hours of playtime to complete the story</li><li>19 tracks of music to amp up your triumphs*</li><li>Lots of tasty corn. Like, LOTS</li></ul>\n\n<p>The standard controls are W,A,S,D to move, J to jump and L to attack. Hold S while moving and press L to slide while attacking, press L in the air for an air attack.</p>\n<p>It has been mapped to a PS4 controller so that X is jump and Square is attack. I've been using a Playstation Classic controller mostly, if you have one that you would like to use, it's Circle to jump and Triangle to attack.</p>\n\n\n\n\n\n<p>*and failures</p>", "metacritic": null, "released": "2020-02-27", "tba": false, "updated": "2020-03-02T04:26:14", "background_image": "https://media.rawg.io/media/screenshots/73f/73f634d1fb8a2a308d86db0068c558ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["No Relation Games"], "genres": ["Action", "Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}