{"id": 416760, "slug": "yastuna-2-the-space-incident", "name": "Yastuna 2 - the Space Incident", "name_original": "Yastuna 2 - the Space Incident", "description": "<p>Here are the games included in Yastuna vol. 1 , and available from the main menu :<br/></p>\n<p> </p>\n<p><em>In space, nobody will hear you play</em></p>\r\nCredits\r\n<p>Graphisms : Templeton</p>\n<p>Music : </p>\n<ul><li>Space Dance : Sampo Rintanen </li><li>Space Lock &amp; Domino : Fadest</li></ul>\n<p>Made with BLL kit and tools from L. Baumstark, B. Schick, M. Domin, K. Kaksonen</p>\r\nGames\r\nSpace Lock\r\n<p>Inspired by Lunar Lockout, the classic from Binary Arts / Think Fun. 60 levels of increasing difficulty. The game includes a level editor, in order to create and play to your own levels. With an easy to use code system, you will be able to distribute to your friends or over Internet your best levels. A tutorial is included, in order to learn how to play to Space Lock.<br/></p>\n<p> </p>\n<p><em>The biggest adventure of the whole day.</em></p>\n<p>How to use : Your goal is to bring the red and white ship to the center of the screen, into the teleportation area. You can select and move every ships, but once in movement, a ship will only stop when blocked by another ship. A ship cannot leave the screen area, or it will be lost in deep space. To select a ship, use the pad, press A to select a ship, the name and the photo of the pilot will be displayed. Use the pad to give a direction to the selected ship. The \"How to play\" tutorial will help you to understand some Space Lock tricks. Option 1 button displays an help cross for selection. Pause button displau a control menu.</p>\n<p>How to use the level editor : </p>\n<p>You can put freely each ship on screen. You can put a ship outside the screen if you do not want it in your level. The 6-letter code at the right will allow you to keep a trace of your favorites levels, and to spread them to your friends or over Internet. Each letter is for a ship, and its position on the screen. </p>\n<p>Press Option 1 to be able to test your level.</p>\r\nSpace Shoot\r\n<p>Enough is enough, the dinner time cannot be disturbed by these invaders every day !!! With your good old ship, fight against never-ending ennemies waves. Between each level, you can upgrade your ship at the Space Shop. Be careful, every use of a special weapon will cost you some points.<br/></p>\n\n<p> <em>Changing waves for more fun</em></p>\n<p>How to play : </p>\n<p>Pad : move the ship from left to right. </p>\n<p>A button : normal shoot, if you stay without moving for a while, you will get a rapide shoot (the actual shoot is displayed at the left top of the screen). </p>\n<p>B button: use special weapon of your ship. Be careful, every use of a special weapon will cost you some points, you must have enough points in order to use a special weapon. </p>\n<p>During the game, the ennemies will drop some capsules when destroyed, this will give you some bonus if you can catch them :  </p>\n<p>Here are the different types of bonus : \r\n- Go to next level. \r\n- Gain a life. \r\n-Activate a shield. \r\n- 25 points. \r\n- fake.</p>\n<p>How to use the Space Shop :</p>\n<p> In order to enter the Space Shop, press Option 1 between 2 waves. </p>\n<p>You can freely choose your upgrade. A quick description of every upgrade, and the value in points (every use during game will cost you these points). You can load an upgrade, even if you do not have enough points to use it now, but you would not be able to use it, unless you get this capital in points. </p>\n<p>Available upgrades : \r\nBooster - 10 points : speed shoot, the same than normal shoot, when you stay immobile for a while. \r\nSpeed-up - 10 points : allow you to move speeder for a while. \r\nPlasma - 25 points : perforating speed shoot. \r\nNapalm Bomb - 100 points : In order to use this bomb, a first press on B drops the bomb, a second press on B makes it explodes, destroying everything around it. \r\nShield - 200 points : this shield will protect you from shoots and collisions... for a while.</p>\r\nSpace Dance\r\n<p>Between 2 space combat, why not going relaxing into discotheque ? A dance game on Lynx, with nice musics from Sampo. In order to be able to go to next level, you must score at least 80%.<br/></p>\n<p> </p>\n<p><em>Ehm, no, there is no dance pad for Lynx, AFAIK ;)</em></p>\r\nSpace Domino\r\n<p>Play against your Lynx in this simple domino game. Will you be able to win ?<br/></p>\n<p> </p>\n<p><em>A to take or drop a domino, B to swap a domino.</em></p>", "metacritic": null, "released": "2020-02-28", "tba": false, "updated": "2020-03-02T04:55:51", "background_image": "https://media.rawg.io/media/screenshots/e3c/e3c5d5bcad282b9abbc066757a12ddde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Fadest"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}