{"id": 416829, "slug": "knighthood", "name": "Knighthood", "name_original": "Knighthood", "description": "In this new role-playing game, you are a Rage Knight, born to fight and conquer. Battle friends and foes in a living fantasy world full of mysterious monsters and mighty enemies as you strive to become the Land’s most feared and famous Knight in the Order of Rage.<br/><br/>Rage Knights, heroes to the people, once defended the world. Now, it is controlled and corrupted by the dark power of Lord Karnon. As a new Rage Knight, explore a rich fantasy RPG world, battle epic monsters, fight enemies and corrupted Rage Knights to create your own legend amongst the Order of Rage.<br/><br/><br/><br/>BRING YOUR INNER KNIGHT TO LIFE<br/>Launch the game, create your Knight and join the new action-packed RPG adventure from Midoki and enter an epic fantasy world!<br/><br/>• Follow the legendary Sir Edward Drakeson through your first RPG trials and battle him to prove your worth to the Order of Rage.<br/>• Earn your Gauntlet, the powerful relic and symbol of the Order of Rage and begin your epic RPG adventure in Astellan, at the edge of a colourful fantasy world.<br/>• Play the game of fame and riches by collecting legendary items to customize and strengthen your Rage Knight.<br/>• In this brand new RPG, recruit and upgrade Ancient Heroes to improve your battle powers.<br/>• Call upon your Rage to unleash your Heroes’ unique abilities during a fight.<br/><br/><br/><br/>FIGHT YOUR WAY TO THE TOP AND BECOME A LEGEND<br/>In this new game, level up your Knight and battle goblins, beasts and undead creatures as you delve deeper into a world of fantasy and mystery. In this gesture-driven combat game, choose the best RPG tactics to win battles and become a legend.<br/><br/>• Win rare treasure in hunts and quests to improve your gear and up your game.<br/>• Collect Ancient Heroes to fight by your side and summon their epic abilities in times of need.<br/>• Choose your RPG strategy. Select your weapons and heroes to fit your goals and win the fight!<br/>• Master your RPG combat skills: Create a perfect chain of attacks switching between weapon, gauntlet and Hero powers.<br/>• Defeat fellow knights, and become the Hero of the PvP arena.<br/><br/><br/><br/>GEAR UP IN STYLE<br/>Your Knight, your style! In this new RPG game, create the perfect mix of style and power to stand out from the crowd!<br/><br/>• Fully customise your Rage Knight. Show off your epic style to your friends and foes.<br/>• Collect the best gear from hundreds of items and stand tall in the PvP arena and leaderboards.<br/>• Create a look that fits your personality and fight with style.<br/><br/><br/><br/>JOIN THE KNIGHTHOOD<br/>Join a guild: hone your RPG skills by defeating titanic Guild Bosses with your fellow knights.<br/><br/>• Build your own guild: Rally your friends and develop an unstoppable fellowship - a Guild to be the envy of them all.<br/>• Chat with guildmates in real-time to strengthen your bonds and hone your RPG strategy.<br/>• Fight Epic battles. Together you can build a legacy and live up to the glory of the Order of Rage.<br/><br/><br/><br/>Knighthood tailors the RPG experience to your mobile device and lifestyle. In this game, explore towns and dungeons while engaging a fantasy world full of monsters in one-handed, epic gesture-driven combat.<br/><br/>Knighthood is completely free to play but some optional in-game items will require payment. You must be connected to the Internet to access the game.<br/><br/>Do not sell my data: King shares your personal information with advertising partners to personalize ads. Learn more at https://king.com/privacyPolicy.  If you wish to exercise your Do Not Sell My Data rights, you can do so by contacting us via the in-game help centre or by going to https://soporto.king.com/", "metacritic": null, "released": "2020-02-26", "tba": false, "updated": "2022-11-14T20:10:41", "background_image": "https://media.rawg.io/media/screenshots/325/325bd9675c7ca90901b5012c64fa7673_K51CyFQ.jpg", "website": "https://knighthoodgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["King"], "genres": ["Action", "RPG"], "publishers": ["King.com"], "esrb_rating": "Everyone 10+"}