{"id": 416816, "slug": "granblue-fantasy-versus-character-pass-set", "name": "Granblue Fantasy: Versus — Character Pass Set", "name_original": "Granblue Fantasy: Versus — Character Pass Set", "description": "Legendary fighting game studio ARC SYSTEM WORKS and Cygames team up to bring the beloved Granblue Fantasy universe to the home console in an action-packed, head-to-head fighter. <br/><br/>Also includes an RPG mode that features an all-new, original story told through beautifully rendered cutscenes. <br/><br/>Includes a Granblue Fantasy serial code as a purchase bonus!<br/>*Choose one of: Sunlight Stone x1, Gold Brick x1, Sephira Evolite x1, Damascus Crystal x10<br/>*Additional bonuses will be added in the future.<br/>*Each bonus can only be claimed once per Granblue Fantasy account.<br/><br/>Granblue Fantasy: Versus 'Character Pass Set' Contents<br/>• Granblue Fantasy: Versus game<br/>• Character Pass<br/>- 5 DLC characters will be unlocked after launch<br/>• Color Pack<br/>- Customize the base roster of fighters with DLC color variants<br/>• PS4™ Theme<br/>• PSN Avatar Set<br/><br/>*This bundle consists of Granblue Fantasy: Versus and related digital contents. Granblue Fantasy: Versus is also available as a stand-alone purchase. Please check whether you already own the game before you make your purchase<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>Licensed to and published by XSEED Games / Marvelous USA, Inc.", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2020-03-06T01:51:34", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}