{"id": 416842, "slug": "the-seven-deadly-sins-grand-cross", "name": "The Seven Deadly Sins: Grand Cross", "name_original": "The Seven Deadly Sins: Grand Cross", "description": "Are you ready to enjoy dynamic combat, breathtaking animations, and a riveting story true to the original?<br/><br/>Download the amazing cinematic anime game, The Seven Deadly Sins: Grand Cross, right now!<br/><br/>=====================================<br/>Features of The Seven Deadly Sins: Grand Cross <br/>=====================================<br/><br/>▶ A brand-new turn-based RPG! A novel approach to combat! A strategic combat system utilizing skill synthesis.<br/>Skills with the same star rank upgrade to a higher rank when they're next to each other!<br/>Feel the thrill of battle with each turn in the dynamic combat system.<br/>Combine cards and use them to trigger an \"\"Ultimate Move\"\" to decimate opponents!<br/>Create your own strategy by combining the unique skills of [The Seven Deadly Sins] characters.<br/><br/>▶ Cooperate with friends to take down a giant demon in Death Match mode, and enjoy exciting and diverse PvP content.<br/>Enjoy Death Match, 2-player cooperative content played in real time!<br/>Defeat demons with a friend before time expires to defend the kingdom!<br/>An Arena where you can compete with players all around the world awaits.<br/>Find your own strategy to win!<br/><br/>▶ Build your very own team in the [The Seven Deadly Sins]!<br/>[The Seven Deadly Sins] heroes assemble!<br/>Dress up your characters in exclusive, never-before-seen outfits!<br/>Hairstyles and accessories galore to suit your customization needs!<br/>Check out the new looks of [The Seven Deadly Sins] characters!<br/><br/>▶ The original world recreated in detail - the animated story beautifully reborn!<br/>The continent of Britannia has come to life! The Holy War that ended 3,000 years ago begins anew.<br/>Experience high-resolution 3D animated cutscenes and prepare for the Holy War alongside the characters of [The Seven Deadly Sins].<br/><br/>▶ Characters rendered in AR, and various other easter eggs await you!<br/><br/>▶ Optional access<br/><br/>CAMERA<br/>- Allows the camera for AR function to take pictures with AR characters.<br/><br/>WRITE_EXTERNAL_STORAGE<br/>- Allows the application to read from the external storage.<br/><br/>※ This app offer in-app purchases. You can disable this feature by adjusting your device’s settings.<br/>By downloading this game, you are agreeing to our Terms of Service and Privacy Policy.<br/> - Terms of Use: http://help.netmarble.com/policy/terms_of_service.asp<br/> - Privacy Policy: http://help.netmarble.com/policy/privacy_policy.asp", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-16T10:01:53", "background_image": "https://media.rawg.io/media/screenshots/970/970863887d3ecb1825dd0500d6975ef0.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 2, "beaten": 2, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 5, "platforms": ["Android"], "developers": ["NetMarble"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}