{"id": 417, "slug": "naruto-shippuden-ultimate-ninja-storm-4-road-to-bo", "name": "NARUTO SHIPPUDEN: Ultimate Ninja STORM 4 ROAD TO BORUTO", "name_original": "NARUTO SHIPPUDEN: Ultimate Ninja STORM 4 ROAD TO BORUTO", "description": "<p>NARUTO SHIPPUDEN™: Ultimate Ninja® STORM 4 Road to Boruto concludes the Ultimate Ninja Storm series and collects all of the DLC content packs for Storm 4 and previously exclusive pre-order bonuses! Not only will players get the Ultimate Ninja Storm 4 game and content packs, they will also get an all new adventure Road to Boruto which contains many new hours of gameplay focusing on the son of Naruto who is part of a whole new generation of ninjas.<br />\n• All Ultimate Ninja Storm 4 Content in One Edition – Includes the Ultimate Ninja Storm 4 game, 3 DLC packs from the Season Pass, the all new Road to Boruto DLC, and all the previously exclusive pre-order bonus content<br />\n• Huge Character Roster and New Hidden Leaf Village – Additional playable characters including Boruto, Sarada, Mitsuki, and Sasuke (Wandering Shinobi) and a new setting of a New Hidden Leaf Village<br />\n• New Collection and Challenge Elements that extends gameplay<br />\nAdditional hardware required for Remote Play.<br />\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy).<br />\nOnline features may be terminated at any time.<br />\n*Online multiplayer requires a PlayStation®Plus membership.<br />\n1-2 players<br />\nNetwork Players 2-8<br />\n42GB minimum save size<br />\nDUALSHOCK®4<br />\nRemote Play<br />\nOnline Play (Optional)<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />\nNARUTO artwork and elements © 2002 MASASHI KISHIMOTO/2007 SHIPPUDEN All Rights Reserved. © 2002 MASASHI KISHIMOTO/2007 SHIPPUDEN © NMP 2014 © 2002 MASASHI KISHIMOTO/2007 SHIPPUDEN © BMP 2015<br />\nSHONEN JUMP, NARUTO and NARUTO SHIPPUDEN are trademarks of Shueisha, Inc. in the U.S. and/or other countries. This product is manufactured, distributed and sold in North, South and Central American territories under license from VIZ Media, LLC.<br />\nGame software © 2017 BANDAI NAMCO Entertainment Inc. All Rights Reserved.</p>", "metacritic": null, "released": "2017-02-03", "tba": false, "updated": "2024-01-31T14:34:54", "background_image": "https://media.rawg.io/media/games/fbd/fbda5b60245810158992eb1ea6ceee99.jpg", "website": "", "rating": 3.82, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 6, "beaten": 12, "toplay": 5, "dropped": 7, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 11, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One"], "developers": ["BANDAI NAMCO Entertainment America"], "genres": ["Fighting"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": "Teen"}