{"id": 417208, "slug": "roguelikelike", "name": "RoguelikeLike", "name_original": "RoguelikeLike", "description": "<p>A small Broughlike game created using this excellent tutorial by Jeremiah Reid. The original tutorial was created using javascript, this version is made with PureBasic language. The web version was created using SpiderBasic.</p>\n<p>Use WASD to move. For each 3 treasures collected you get one new spell slot. Cast spells using the numbers keys 1..9.<br/></p>\n<p>Spells description:</p>\n<ul><li>WOOP: Transports the player to a random tile.</li><li>QUAKE: Deals 2 damage for each adjacent wall.</li><li>MAELSTROM: Changes all monsters to random tiles.</li><li>MULLIGAN: Resets the level and change the player's health to 1.</li><li>AURA: Heals the player and any adjacent monsters.</li><li>DASH: Moves the player in the direction of the last attack or move. It the player is able to move any adjacent monsters to the final tile are hit and stun.</li><li>DIG: Removes all internal walls and heals the player 2 health points.</li><li>KINGMAKER: Heals all monsters and puts a treasure in their tiles.</li><li>ALCHEMY: Turn all adjacent walls (no external walls) in treasures.</li><li>POWER: The next player's attack will do 6 damage.</li><li>BUBBLE: Goes through the player's spells and duplicates the previous one if the current one is empty.</li><li>BRAVERY: Stuns all monsters.</li><li>BOLT: Casts a bolt in the direction of the last movement. Delas 4 damage.</li><li>CROSS: Casts one bolt for each direction (up, right, down, left). Deals 2 damage.</li><li>EX: Casts a bolt in each diagonal direction. Deals 2 damage.</li><li>VAMPIRE: Steals 1 health point from each adjacent monster and stuns them.</li><li>TELEPORT: Teleport the player to a random monster place and kills it.</li></ul>", "metacritic": null, "released": "2020-03-04", "tba": false, "updated": "2020-03-06T03:21:14", "background_image": "https://media.rawg.io/media/screenshots/568/5688ef5d1fe096472a5fa9c2b4df6a7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["ricardo_sdl"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}