{"id": 417281, "slug": "attack-of-the-flying-polyps", "name": "Attack Of The Flying Polyps", "name_original": "Attack Of The Flying Polyps", "description": "<p>This prototype was created for the \"Bad Lovecraft Game\" Jam.</p>\n<p>Made with Unity 5.65  Personal Edition.</p>\n<p>Cinematics created in Blender 2.72.</p>\n\n<p><strong>The story thus far....</strong></p>\n<p>\"Just another routine Dawn Patrol\".</p>\n<p>Or so thought Hauptmann Suki von Kleinschmidt as she clambered into the cockpit of her not-so-trusty Pfalz D.III.</p>\n<p>If only due to the unforeseen encounter with an Aurora Borealis over the front,  the aircraft and its pilot are inexplicably  whisked away almost 1900 years into the future, by which time the events of an ominous  foretelling have born fruit.     As predicted by professor Nathaniel Wingate Peaslee of Miskatonic University, a malevolent and ancient race of flying polyps have breached the confines erected by the Great Race of Yith, and have descended their  wrath upon an unsuspecting planet. </p>\n<p>Now, earth's landscape is consumed by large towers of basalt as far as the eye can see, and the polyps reign supreme as the dominant organism.  </p>\n<p>Suki's only option is to fight her way through the malevolent beasts in her vicinity, after which, who knows what?</p>\n\n\n<p><strong>Gameplay</strong></p>\n<p>\"Attack Of The  Flying Polyps\" is an arcade flight-simulator in which the player engages in aerial combat against hordes of evil flying beasts.  The polyps are rugged and can absorb tremendous amounts of punishment, while attacking with bursts of powerful winds which progressively erode the integrity of your aircraft.</p>\n<p>The level ends when either Suki's plane is destroyed, or the player has successfully eliminated all 16 monsters. </p>\n\n<p><strong>Origins</strong></p>\n<p>AOTFP is inspired by the premise created in Lovecraft's novella \"A Shadow Out  Of Time\", originally published in 1936.  </p>\n<p>The events of the story originally center around the exploits of Prof. Nathaniel Peaslee, whose consciousness has remained absent for several years, due to the psychological possessions inflicted by the Great Race of Yith.  </p>\n<p>Upon regaining control of his body several years later, Peaslee progressively recalls the circumstances which led to his psychological imprisonment, most notably concerning an ancient war waged between the Yith and a malevolent race of flying polyps.  </p>\n<p>While the Great Race of Yith temporarily gained the upper hand by imprisoning the polyps in a subterranean abyss, their powers of foresight predicted that one day, the monsters would breach their confines and dominate the earth. </p>\n<p>The story ends after an excavation, where Peaslee has unearthed one of the Yith's ancient libraries buried within the confines of the Australian desert.  A chance encounter with one of the polyps indicates that the latter have already plotted their escape, and the professor laments an ominous prediction that before long, the population of earth will be subjected to an \"incredible and mocking shadow out of time.\"</p>\n<p>Accordingly, the events of this game surround the prospect of a future earth in which the predictions have come true, and apart from the protagonist, no other form of human life exists.</p>\n\n<p><strong>Controls</strong></p>\n<strong>Arrow keys or 'WASD'</strong>pitch /  roll<strong>Spacebar</strong>fire machine guns<strong>Escape</strong>exit to main menu\r\n\n<p><strong>DISCLAIMER:  </strong>While his stories continue to fascinate and captivate us to this day, the fact remains that, on a personal  level, Howard Phillips Lovecraft harbored explicitly racist and xenophobic views that are impossible to ignore.  Granted, the severity of his attitudes were profound even by the standards of his time period and nationality (which, given how racist most white Americans were during the 1920's, says a lot.)</p>\n<p>Thus, I wish to assure you that my participation in this game jam and the creation of this prototype is not in any way intended to downplay, let alone excuse, his prejudiced views.</p>\n<p>In fact, I believe that the best way to defy his personal attitudes on these matters is  by integrating the merits of  his stories with the  incorporation of representations which fly in the face of the very sexist and racist views that he so explicitly possessed. </p>", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2020-03-06T03:36:05", "background_image": "https://media.rawg.io/media/screenshots/c98/c98d72f518ba4adb3d0b98696891d8e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jesse Hamm"], "genres": ["Action"], "publishers": [], "esrb_rating": null}