{"id": 417330, "slug": "underwhelming-resurrections", "name": "Underwhelming Resurrections", "name_original": "Underwhelming Resurrections", "description": "<p>  Nanna City. It's an excellent place to raise your children in peace, so long as they don't get attacked by slimes. It's an excellent place to grow old in peace, so long as your elderly don't get kidnapped by LunaTech for some crazy experiment. And it's an excellent city to reinvent yourself after getting an alley-stabbing-inspired wake up call. Go to the big city, and go on an adventure. Make some new friends, bring your old friends along for the ride, get in a fight, fix something that's broken, and just chill in general for a change. Sure, Nanna City is falling apart, but maybe it's a place you can feel like you can make a real change and a real positive difference. But first, you need to make real change, and a real positive difference, in your own life. Maybe start by not getting stabbed again ...<br/></p>\n<p>   Underwhelming Resurrections is a 10 hour RPG with a modern day setting, about 24 playable characters, a fast paced status effect focused battle system, and multiplayer support. It's ... something. Fun to run around with your friends in at least. I am looking for any constructive criticism and advice the audience might have. This project was honestly built on the bones of a more ambitious project that I lost the heart for after years of work that was going nowhere, so apologies if this game feels rushed and slapped together. I just want you guys to have something you can run around in and feel some joy in. I hope there are no egregious issues I missed, and I hope I can take what I learned from actually trying to release something and put that knowledge into something special for you next time. For now, enjoy the silly dialogue, the weird way fights work, the multiplayer I'm proud I got to mostly work, and anything else in here. Love, peace, and warmth.</p>", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2020-03-06T03:47:05", "background_image": "https://media.rawg.io/media/screenshots/ac4/ac4e9271ce5a3fcb99febe6c83f2ebee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thamaliam"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}