{"id": 417517, "slug": "ronin-itch-leotheshade", "name": "Ronin (itch) (leotheshade)", "name_original": "Ronin (itch) (leotheshade)", "description": "<p>The tide of demons never ceases, and as the ancient order of The Haze dies out, you are left as one of the last remaining members. You are well past your prime, and yet, you continue fighting, honor-bound to fulfill the order's cause until your last breath. Even so, you tire of this life of death and bloodshed, craving a life you swore to forsake. Yet, the fight always goes on, as you search for a way out of this existence of battle, while keeping to your oaths. Take up the Blade, Glaive, and Pipe of the Ronin, conjuring smoke-projections of yourself to fight creatures no human could stand against in this turn-like action rpg game: Ronin.</p>\n<p>As of right now, Ronin does not have an ingame tutorial, so this will be an overview of the basic controls of Ronin. Be aware, Ronin was designed to be a difficult game, and it takes awhile to get the hang of things. </p>\n<p>The game runs of turn-based aspects, with each character taking a turn to act. On the player's turn, you take control of your smoke-double to do the fighting. You must first choose a fighting style to use for that turn, done by clicking the left-most button with a pipe display. Each fighting style plays differently. Once you've selected a fighting style, click the center button to begin combat. When using the spear style, circles will appear around the enemy's body. You must click each circle right as its outline touches its border(like OSU). I'm working on making it less like OSU, but for right now, that's what it is. When using the sword-style, lines will appear around the enemy's body. To attack, you must click and drag the mouse to create a line following the line through the enemy's body(tip: make sure that your line goes past each end of the guidance line). Once you finish attacking, the enemy's phase will begin. At the start of each phase, the boss will enter one of its battle-modes that affect how the player and boss interact with each other. Each battle-mode has a direct counter, and an indirect counter(direct breaks the boss out of its mode, indirect does not). After the boss has taken a mode, it will begin its attack phase, where the boss will begin drawing lines through you, similarly how you do to it when using the sword. To defend against these attacks, you have to draw your own line, crossing the boss's, to parry.</p>", "metacritic": null, "released": "2020-03-02", "tba": false, "updated": "2020-03-06T04:29:32", "background_image": "https://media.rawg.io/media/screenshots/fe8/fe82410a0b383756776d31dd38ab1d89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["leotheshade"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}