{"id": 417621, "slug": "battle-of-basketball", "name": "Battle of Basketball", "name_original": "Battle of Basketball", "description": "The first scuffle Cup Super Basketball League officially kicked off<br/><br/>All kinds of master sports experts come on stage<br/><br/>The players of both sides fight to the death<br/><br/>Sometimes fast layup, sometimes over three points into the basket<br/><br/>Beautiful step back, lifelike fake action, shaking the opponent to doubt life from now on<br/><br/>At this time, the competition is extremely fierce, has reached the stage of white heat, and the physical contact is very frequent<br/><br/>You cross the opponent and rush into the forbidden area. You turn around and take off. You are circling in the air. You are picking the opportunity to throw the ball into the basket<br/><br/>The opponent who has been waiting for a long time in the forbidden area looks at you covetously. It seems that a super spicy hot pot is brewing<br/><br/>After 0.11 seconds, you successfully put the ball into the basket, but because of the other player's strength, you fell to the ground with a slap<br/><br/>The two players almost clashed, but no one was sent off because freedom is the only rule of streetball<br/><br/>With 1.5 seconds to go before the end of the game, the score is still stuck<br/><br/>The coach arranged the final tactics to pass directly from the backcourt to assist the teammates in scoring. The ball seemed to pass a little high, and the teammates got up and didn't catch it<br/><br/>Oh, no, the ball has gone straight to the basket. With a swish, the ball hit the net!<br/><br/>Time is over, kill!!! We won!!!", "metacritic": null, "released": "2016-05-27", "tba": false, "updated": "2020-03-09T01:53:51", "background_image": "https://media.rawg.io/media/screenshots/d48/d4802410e12b62661f9b057391dfdae3_ckwHBVT.jpg", "website": "http://www.ags-mobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shiguang Li"], "genres": ["Sports", "Casual"], "publishers": ["Shiguang Li"], "esrb_rating": "Everyone 10+"}