{"id": 417619, "slug": "nirvana-game-of-life", "name": "Nirvana - Game of Life", "name_original": "Nirvana - Game of Life", "description": "Play as a soul traveling from body to body through the cycle of life, all while experiencing<br/>everything life has to offer and trying to break the cycle in order to reach Nirvana. <br/><br/>Make your decisions with a simple swipe mechanics in hundreds of life situations. Live as a:<br/><br/>+ Super Hero<br/>+ Assassin<br/>+ Super Star<br/>+ Gangsta<br/>+ Wizard<br/>+ Rockemon Master<br/><br/>Maintain a balance between your needs (money, health, popularity, and happiness)<br/>throughout your life. Each year you will have to make a seemingly random decision that<br/>will affect your life:<br/><br/>+ Make friends<br/>+ Get married<br/>+ Have children<br/>+ Choose your \"Rockemon\"<br/>+ Break out of jail<br/>+ and a lot more!<br/><br/>Beware as each choice can be your last one! Hurry up to gain as many experiences as you can, and ultimately, try to reach Nirvana. There are many ways to die, but you will always get another round with a new body to control.<br/><br/>Will you be able to defeat The Creator and break the cycle of life? Be careful, a lost soul is going to contact you and promise you a way out – will you trust her? <br/><br/>Play this beta version now for free!<br/><br/>*** How to Play Nirvana: Game of Life ***<br/><br/>- Click on the card and drag it slowly to the right or to the left without letting go - that way you will be able to read your choices.<br/><br/>- Release the card when you see the option you want to choose -  keep in mind that it will affect the bars at the top, which you should keep balanced.<br/><br/>- If you reach the top or bottom of one of the bars you will die.<br/> Try to reach old age to reveal new hilarious cards and maybe even meet death himself.<br/><br/>- Try to complete achievements in order to unlock new and unique life experiences, such as superhero life, assassin life, and superstar life. They will also guide you to interesting stories, choices, and perks.<br/><br/>- Use your head - life can be tricky and surprising for a young soul, but an experienced soul learns from its mistakes.<br/><br/>* Stay tuned and don't miss updates of new content:<br/><br/>Facebook - https://www.facebook.com/nirvanagameoflife/<br/>Youtube - https://youtu.be/iwELOM8H7tA<br/>Instagram - https://www.instagram.com/goldtusksgames/<br/>Twitter - https://twitter.com/GoldTusks_Games<br/><br/>Be advised: If you have any mental health conditions, you should know that this game might make you over-think your own life, so play with caution.", "metacritic": null, "released": "2019-12-21", "tba": false, "updated": "2020-03-09T01:53:00", "background_image": "https://media.rawg.io/media/screenshots/4dc/4dce314c376bb65df9c6d03d28508724_9Kou8t3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Doron Elisha"], "genres": ["Adventure", "Simulation"], "publishers": ["Doron Elisha"], "esrb_rating": "Teen"}