{"id": 417696, "slug": "pathfinder-last-stand", "name": "PATHFINDER: Last Stand", "name_original": "PATHFINDER: Last Stand", "description": "<p><em>Pathfinder: Last Stand</em> is a survival based arcade game, where you must fend off many enemies that hide in the shadows. Using light to your advantage to help spot where enemies are is critical to your survival in this unforgiving wasteland.<br/></p><p><strong>CONTROLS:</strong><br/>WASD: Movement<br/>Mouse movement/reticle: Aim<br/>Left click: Shoot<br/>Right click (functioning incorrectly in current build): Melee strike<br/>R: Reload gun (Must be standing still in current build)<br/>E: Throw /pick up lamps (must be aiming at lamp and in range to pick up)<br/>Esc: Pause<br/></p><p><strong>FAQ:</strong><br/>Q: How do I restart the game?/I am pressing quit and nothing is happening?<br/>A: In the current build, unfortunately you must restart the game to play again. In the browser this can be done by refreshing the page, and in the windows version this can be done by losing and re-opening the game. Due to loading times, it's recommended to use the windows version, especially if you have a poor internet connection.</p><p>Q: I am dying at the start of the game and I don't know why?<br/>A: Enemies are invisible in the dark, and you must use light sources to see where enemies are.<br/><br/><strong>ADDITIONAL INFO:</strong><br/>Due to the tight time constraints, we were only able to implement a portion of what we had planned. It saddens me that the game does such a poor job at helping the player understand what is happening, but I hope that a skim of the description will help players avoid some of these issues.<br/><br/>Pathfinder was made in roughly 40 hours from start to finish for the Lux Jam 2020. The theme was \"Light and Shadow\". Pathfinder was built in Godot 3.2 in a team of three (credits below).<br/><br/><strong>CREDITS:</strong><br/>BricksParts: Game Design and Artistic Lead<br/>     Discord: BricksParts#5032<br/></p><p>codetorex: Development Lead<br/></p><p>FirahFabe: Music and Sound Design Lead<br/>     Discord: FirahFabe#6007<br/>     Twitter: @firahfabe</p><p>Some sound effects provided from Freesound.org and Zapsplat.com</p>", "metacritic": null, "released": "2020-03-08", "tba": false, "updated": "2020-03-09T02:10:09", "background_image": "https://media.rawg.io/media/screenshots/f62/f62255d578b5c26bf8603d6f2bbc4b84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["codetorex", "BricksParts", "FirahFabe"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}