{"id": 417730, "slug": "rogues-delight", "name": "Rogue's Delight", "name_original": "Rogue's Delight", "description": "<p>A submission for 7DRL 2020 -- take your rogue deep to the bottom of a procedural dungeon to claim the Amulet of Yendor for yourself.  A game with the heart of a classic roguelike, but fast (except when you need to strategize).<br/></p>\n<p>Controls</p>\n<ul><li>WASD - Move</li><li>Space - Toggle Time</li><li>Left Shift - Half Speed</li><li>1-6 - Select Action</li><li>Left Click - Perform Action</li><li>-/+ - Adjust the UI bar on the right's position (temp fix for a bug that's popping up on some resolutions)</li></ul>\n<p>Mechanics</p>\n<p><strong>Real Time With Pause:</strong> Although the game proceeds at full speed by default, you can pause at any time with the Space key or by selecting an action to perform, causing events to unfold at 1/100th normal speed. Select an action, aim with the mouse, and click to perform it. You can hold Left Shift during pause to let time progress at half speed or hit Space again to unpause.</p>\n<p><strong>Dash &amp; Slash: </strong>You have two default actions--Dash, which lets you move quickly, and Slash, which swings your sword. Each are unlimited use, but cost Stamina to use. The less Stamina you have, the less distance your actions can cover. Killing an enemy immediately resets your Stamina to full.</p>\n<p><strong>Rods &amp; Potions:</strong> You will find many Rods and Potions in your delve. Moving over them picks them up (if you have any inventory slots open), and each grants you an additional action you can perform. Rods and Potions are color coded, but are initially unidentified. Using one once will identify it.<br/></p>\n<p>Rods &amp; Potions have a limited number of uses each. Fully using one up will level up one the player's stats, allowing them to grow tougher, faster, more damaging, etc.</p>\n<p><strong>Stairs: </strong>There is a staircase on each floor of the dungeon. Bumping into it will automatically cause you to proceed to the next floor. The 10th floor does not contain a staircase; instead it contains the Amulet of Yendor.<br/></p>\n<p><strong>Gold:</strong> Pick up gold to raise your score. Picking up the Amulet of Yendor will cause you to immediately gain 1000 points and win the game.</p>\n<p><strong>Monsters:</strong> There are 26 monsters--one for each letter of the alphabet. If you want to see what the letter stands for, just mouse over their icon letter and their full name will reveal. As for their individual abilities. . .only trial and error will tell.<br/></p>", "metacritic": null, "released": "2020-03-08", "tba": false, "updated": "2020-03-09T02:16:42", "background_image": "https://media.rawg.io/media/screenshots/e02/e02624597274ca5518132ed1b7899074.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["OtspIII"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}