{"id": 417800, "slug": "three-circles", "name": "Three Circles", "name_original": "Three Circles", "description": "Three Circles<p>Three Circles is an adventure puzzle game played with the first-person view in a mysterious desert. By exploring and solving puzzles in the desert, the giant three-circle sculpture can be lit up and directs the player to reach the end. <br/></p>\n<p>Three Circles gets the inspiration from the video game Rime. In Rime, a player plays in the view of a young boy and controls him to explore the secrets of that world. Three Circles takes over the colour style from Rime to create a dreamy environment. It also utilises bright colours and a soft modelling style. In the desert, there are three isolated islands and a giant sculpture situate on the edge between the desert and the ocean. Both the ocean and the sculpture are used as landmarks for the player trapped in the desert. Moreover, the ocean can be designed as the next puzzle adventure environment in future work.</p>\n<p>The reason for placing the environment in a desert is that the desert is a broad space with a mysterious feeling. Trapped on small floating islands also emphasises the feeling of lonely and isolated. The landmarks of sculpture and ocean use the light and the water to direct the player to march towards the hope. Circle, the vital symbol in this environment, represents the infinity, perfection and timelessness. It matches with the desert environment and helps the player to marks the complement of each puzzle. The theme music and sound effects add mysteries and fantasies into this environment as well.</p>\n<p>Three Circles is meant to encourage the trapped and isolated player to solve the puzzles and find a way to get out. The end of this environment is either the end of this dreamy world or the start of the next journey.</p>", "metacritic": null, "released": "2020-03-02", "tba": false, "updated": "2020-03-09T02:30:38", "background_image": "https://media.rawg.io/media/screenshots/8b0/8b09a66e97914b22e53252c2b28c68da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["JichenCui"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}