{"id": 417903, "slug": "bug-stomper", "name": "Bug Stomper", "name_original": "Bug Stomper", "description": "Why was this game made?\r\n<p>Game Stomper is a game jam entry for the 7DRL game jam.</p>\r\nWhat is this game about?\r\n<p>This game is about being the big foot in town and being commissioned to squash as many bugs as you can. </p>\n<p>After all, it's in your DNA to <strong><em>Crush </em></strong>bugs. You come from a long lineage of bug stompers. Your father was a bug stomper, your father's father was a bug stomp. His father's father father father father father's father was a bug stomper....and so on!</p>\r\nHow does the game work?\r\n<p>This game is an<strong> endless dungeon</strong>. The game ends when you die. As you stomp all the bugs in a given level you will<em> progress to the next stage.</em></p>\r\nEarn points for:\r\n<ul><li>Stomping Bugs</li><li>Picking up Toe Rings</li><li>Picking up different Shoe Boxes for Shoe Style</li></ul>\n<p>This is a<strong> turn based game</strong>. The amount of times you move is dictated by your current health. If you are wearing a shoe you get to move 8 spaces, only a sock - 7 spaces, barefoot - 6 spaces.</p>\n<p>If you happen to be <strong>barefoot </strong>you are on your last leg and can die quite easily. For those thrill seekers out there you can earn <strong>2x points</strong> when you are barefoot, but you are at that last hit before your run of the game ending.</p>\r\nEnemies:\r\nHealth Points\r\n<p>Most enemies have 1 HP, so one stomp should do the trick. <strong>Roaches </strong>are transcendent from another universe and have <strong>2 HP</strong>. You will need to stomp on a roach twice before killing it, but they also offer the<strong> most points</strong> on kill.</p>\r\nMovement\r\n<p>Enemies share a pool of turns. If there are 6 enemies, then there are 8 turns shared amusing the hive mind that is bugs. As there are less enemies, there will be less enemy turns available.</p>\n<p>When an enemy takes it's turn it can have up to 3 movement. So if there is 1 bug with 3 movement with 2 turns, they will get 6 moves total. So bee careful!</p>\r\nWho made this game? \r\n<p>Art, Design - Chelsea</p>\n<p>Music, Sounds, Development, Design - Yanni</p>\r\nControls (Playing game):\r\n\r\n<ul><li>WASD - Moves the character</li></ul>", "metacritic": null, "released": "2020-03-08", "tba": false, "updated": "2020-03-09T02:53:18", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bf2613bbbe2cc6198ff0028517ac904.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yanni"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}