{"id": 417970, "slug": "voidshell-7drl", "name": "VoidShell-7DRL", "name_original": "VoidShell-7DRL", "description": "<p>Built in 7 days for the 2020 7 Day Roguelike Challenge.</p>\n<p>Stranded on a hostile alien world, you'll have to rely on your wits to survive.  Fortunately your wits are being augmented by a neural link with your hi-tech exosuit, allowing you to slow and pause time as you wish.  Will this give you the tactical edge you need to defeat this world's strange inhabitants and escape back into space? </p>\n<p>Features:</p>\n<ul><li>Infinite procedurally-generated world to explore.</li><li>Time only moves when you do, letting you plan your next steps (and shots) carefully.</li><li>Power management mechanic lets you power up your suit to meet your needs on the fly.</li><li>8 suit sub-systems and upgrades, each of which give you special abilities, but only if you can keep them powered...</li><li>5 different species of ravenous alien monster.</li></ul>\n<p>The design goal behind this one was to create an 'analogue' Roguelike, i.e. one without the traditional grid and that gave the player a much finer degree of control than usual.   Everything else flowed from that.  If you ever wanted to play SuperHot in space with random generation this is probably the game for you!</p>\n<p>Tips:</p>\n<ul><li>Find the 3 fuel cores, power up your thrusters and ascend to the heavens to win.</li><li>The game may look like an FPS, but try to play it like one and you will probably die.  Take your time, choose your shots and match your power assignments to the situation you're in.</li><li>Check your scanner regularly to make sure you're not being snuck up on.</li><li>You can run away from most enemies, but when you come across a fuel core you'll need to stand your ground to extract the power.  Try not to let the horde build up too much or you'll be overwhelmed.</li></ul>", "metacritic": null, "released": "2020-03-08", "tba": false, "updated": "2020-03-09T03:09:50", "background_image": "https://media.rawg.io/media/screenshots/c22/c22426946dba62f0b60cd0431570a44d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PNJeffries"], "genres": [], "publishers": [], "esrb_rating": null}