{"id": 4180, "slug": "disney-epic-mickey-2-the-power-of-two", "name": "Disney Epic Mickey 2: The Power of Two", "name_original": "Disney Epic Mickey 2: The Power of Two", "description": "<p>In Disney Epic Mickey 2: The Power of Two, gamers will play as Mickey Mouse and for the first time ever,  Oswald the Lucky Rabbit, Walt Disney’s first cartoon star, in an all-new adventure of creativity and  discovery. Created by industry luminary Warren Spector and Disney Interactive’s Junction Point game  development studio, Disney Epic Mickey 2: The Power of Two returns the franchise through PC. Disney Epic Mickey 2: The Power of Two returns Mickey Mouse and Oswald the Lucky Rabbit to  Wasteland, an alternate world filled with 80 years of forgotten Disney characters and theme park  attractions.  But for the first time, Mickey and Oswald will join forces as true partners – Mickey with his  magical paint brush that wields paint and thinner, and Oswald with his powerful remote control that  allows him to command electricity.   This new co-op play combined with enhanced in-game physics will  further enhance the idea that “PlayStyle Matters” – a unique approach to gameplay pioneered by  Warren Spector where players dynamically tackle different challenges in order to explore all possibilities  and storylines, but with consequences for their chosen actions.</p>", "metacritic": 59, "released": "2012-03-20", "tba": false, "updated": "2023-07-19T11:22:54", "background_image": "https://media.rawg.io/media/screenshots/0af/0affd676990f5b2ee4dbae6ed9dfc976.jpg", "website": "http://games.disney.com/disney-epic-mickey-2-the-power-of-two-video-game", "rating": 3.25, "rating_top": 3, "added_by_status": {"yet": 33, "owned": 351, "beaten": 27, "toplay": 26, "dropped": 35, "playing": 4}, "playtime": 4, "achievements_count": 110, "ratings_count": 60, "suggestions_count": 534, "game_series_count": 2, "reviews_count": 60, "platforms": ["PlayStation 3", "Xbox 360", "Wii", "PC", "PS Vita", "Wii U"], "developers": ["Junction Point", "Junction Point Studios"], "genres": ["Action", "Adventure"], "publishers": ["Disney Interactive"], "esrb_rating": "Everyone 10+"}