{"id": 418018, "slug": "get-blocked", "name": "Get Blocked!", "name_original": "Get Blocked!", "description": "If any of the shifting blocks collide with you, game over!<br/>To aid your escape, you wield the powers to erase blocks, recall blocks from the past, and teleport!\r\n<p>Unfinished game about escaping from procedurally generated levels.</p>\n<p>You can still play and complete it, but it might be a little easy/uninteresting.</p><p>Made it for 7DRL although I'm not sure it is exactly a Roguelike yet....</p>\r\nControls\r\n<p>Click \"GAME!\" to start. Press ESC while in-game to return to the menu.</p><p>WASD to move.</p>\n<p>Initiate a spell cast with E, R, or T, depending on the spell.</p>\n<p>Once initiated, move the spell cursor with WASD, then press the spell key again to execute the spell.</p>\n<p>Press Q at any point to cancel the spell, or press a different spell key to switch to that spell instead.</p>\r\nIn the future I intend to add:\r\n<ul><li>A real title screen and actual fonts so all the text is not blurry</li><li>One additional requirement before escaping each level (a lever that reveals the ladder or something)</li><li>A way to defeat the shifting blocks (push them into pits?)</li><li>Potentially a spell upgrade system, to let you extend the range/aoe of your spells, or acquire more mana to spend on them.</li><li>More levels/an infinite mode</li><li>More interesting things within levels - a fountain to refill mana, other traps?</li></ul>\r\nFeedback and Bugs\r\n<p>There seems to be an issue with the level counter at the moment, but you should be able to win after 5 levels regardless.</p>\n<p>I'm keen to hear any feedback about how I could make this more fun, or if you spot any other bugs.</p>\n<p>Thanks!</p>", "metacritic": null, "released": "2020-03-08", "tba": false, "updated": "2020-03-09T03:19:56", "background_image": "https://media.rawg.io/media/screenshots/bbb/bbb9950a61bf5746decfb908d3c60548.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gellelao"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}