{"id": 418194, "slug": "blood-moon-genesis", "name": "Blood Moon: Genesis", "name_original": "Blood Moon: Genesis", "description": "<p><strong>Premise</strong><br/></p>\n<p>This is the tale of a 2 tailed fox in the underworld that is possessing a fallen human body with a goal of sealing the “Drunken Demon” Shuten Doji back into the divine shrine and prevent the destruction of the overworld.</p>\n<p><strong>The Underworld Prison</strong></p>\n<p>The Underworld is a place where all types of Yokais that were imprisoned by the divine walks. The world below is the reflection of the dark side of the upper world. This world resembles something similar to Kyoto with the dense bamboo forest and infamous Nijo Castle leading to shine where the bosses are imprisoned in. The underworld is not controlled by the divine but instead powered by a mysterious force radiating from Shuten Doji which makes divine spirits weaker in the underworld. </p>\n<p><strong>The Blood Moon Event</strong></p>\n<p>The blood moon event is created from the build-up of rage in the underworld for 100 years that produces enough energy to awaken the blood moon in the underworld. During these events, all Yokais gain immense power from the effects of the blood moon.</p>\n<p><strong>The Tear</strong></p>\n<p>A build-up of energy from the Yokai's energy for thousands of years causes a tear in the underworld which is a pathway to the upper world. All types of matter and energy can pass through this tear and this is where the divine channels their power from the upper world to empower Junko (Fox Spirit) in the underworld to carry out the task of sealing the Yokai and prevent their escape. </p>\n<p><strong>Aiko The Noble Warrior</strong></p>\n<p>Aiko is the body that Junko posses during the war. Aiko is a low rank loyal warrior from the Oda clan that gave up her life to save her general during the war. Because of her loyalty Aiko was given a 2nd chance in life and was revived by Junko the fox spirit of the Moon and Sun by bonding with them and was tasked by them to seal the evil forces of the underworld.</p>\n<p><strong>Junko The Fox Spirit of the Moon and Sun</strong></p>\n<p>Junko is a two tail tenko fox which possesses the power of the swiftness of the moon and the strength of the sun.</p>\n<p><strong><em>Controls</em></strong><br/></p>\n<p>Controller</p>\n<p>Keyboard and Mouse</p>", "metacritic": null, "released": "2020-03-07", "tba": false, "updated": "2020-03-09T03:59:16", "background_image": "https://media.rawg.io/media/screenshots/5bf/5bfe9e7784093f6e550a16d72856f320.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Acekugen", "simchew", "soulworker 09", "Wakakaka", "Mohammadreza Heidari", "Project G", "ChuahCheeYee"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}