{"id": 418214, "slug": "joustrl", "name": "JoustRL", "name_original": "JoustRL", "description": "<p><strong>JoustRL is a 7DRL 2020 Entry <br/></strong>Fly your mount up the pocket dimension volcano of floating islands, lava falls, and vicious beasts to capture the prize: A Golden Dragon Egg!  Get back down to the teleport pad with the egg to escape with your prize.</p>\n<p>Your mount will get tired, it can only flap its wings so many times before you will need to find an island to rest on and restore your flap count.  Look up and down using the z/x keys and plan your ascent.  Grey shadows will help inform you of what is above, as you ascend things below you will loose their background colour and fade to darkness.</p>\n<p>Your mount will maintain its flight momentum so watch your speed if you need to be able to make quick turns.  The movement is based on the 'line-racer' rules but special mounts have special modifiers!  Try out all the different mounts to experience them for yourself.</p>\n<p>The volcano is deadly, we are playing by arcade rules here: there is no hp and you and your mount are fragile.  If you fly into or run on top of lava you will die.  To kill an enemy your movement must end on the square they are on.  The enemy has the same rule, to score a hit on you they must end their movement on your square.  If you are hit you will die. </p>\n<p>There are three enemies, they each have unique abilities and behaviour, try to work them out and use it to your advantage.<br/></p>\n<p>Wizard mode keys:<br/>b: get the egg<br/>n: refil flaps<br/>m: warp to current z level</p>", "metacritic": null, "released": "2020-03-07", "tba": false, "updated": "2020-03-09T04:03:27", "background_image": "https://media.rawg.io/media/screenshots/0fe/0fe63329c8a899b303dba5d6ee496d3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ibGoge"], "genres": [], "publishers": [], "esrb_rating": null}