{"id": 4182, "slug": "elminage-original", "name": "Elminage Original", "name_original": "Elminage Original", "description": "<p>Embark on a grand adventure in the lands of Halodra Ille! The fate of this world hangs in the balance as the barrier protecting it is severely weakened. The gods granted power to six rings to form the world&#39;s barrier and located them in a tower known as Dragon&#39;s Fang. Dark priestesses planned on destroying the barrier for so they could summon their Demon King. When they tried to destroy one of the rings, the barrier weakened greatly, but the remaining five rings scattered themselves across the ends of the realm to prevent further damage to the shield. With the shield weakened, monsters of increasing power and ferocity began appearing throughout the lands. You must join the search among other adventurers of Halodra Illa and find the five rings and restore balance to the world!<br />\nSome functions and features may not be available on PlayStation TV.<br />\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.<br />", "metacritic": null, "released": "2011-05-19", "tba": false, "updated": "2023-12-21T06:18:24", "background_image": "https://media.rawg.io/media/games/e22/e22de99369f0fa04b36dbe6a5e266a4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 345, "game_series_count": 4, "reviews_count": 2, "platforms": ["PlayStation 2", "PSP", "Nintendo 3DS", "Nintendo DS"], "developers": ["UFO Interactive Games", "Starfish"], "genres": ["Action", "RPG"], "publishers": ["Rising Star Games", "Ninja Games Japan"], "esrb_rating": "Everyone 10+"}