{"id": 418217, "slug": "roody2d", "name": "Roody:2d (itch)", "name_original": "Roody:2d (itch)", "description": "Roody:2d 0.1.1 alpha\r\n<p>A \"low level\" automation game created by redinator2000.</p>\n<p>Basic crafting is tedious, but automating basic tasks is challenging.</p>\n<p>Do not redistribute.</p>\r\nControls\r\n<p>You need a keyboard and a 2-3 button mouse to play this game.</p>\n<p>The main menu can be navigated with the mouse or the arrow keys and [Enter].</p>\n<p>[Escape] Go to a \"higher level\" screen, either the main start menu, main pause menu, or main game. [Escape] toggles between the pause menu and the pause game.</p>\n<p>[F10] Reload resources</p>\n<p>Navigate to the \"Options\" menu and scroll down to see the rest of the controls.</p>\r\nClarifications\r\n<p><place> and <remove> change behavior with the <mode ...=\"\"> buttons</mode></remove></place></p>\n<p><reduce> can delete your entire hand if the stack count reaches 0</reduce></p>\r\nHelp my settings are all messed up!\r\n<p>Delete config.config</p>\r\nGameplay\r\nBasics\r\nBlocks\r\n<p>The world in Roody:2d is made of blocks. There are no items, only blocks.</p>\n<p>Many blocks have unique abilities and uses. Double-tap <scan>(default: [X]) over a block to read a short description, or simply browse the guide book (default:[G]) and see how to make different blocks.</scan></p>\r\nInventory\r\n<p>The player can hold stacks of identical blocks in 3 ways: the backpack, the hotbar, and the hand.</p>\n<p>The player can hold stacks of identical block structures (multiple blocks welded together) in 2 ways: the backpack and the hand.</p>\n<p>The hand can move items between the world, the backpack, and the hotbar. If the hand is only holding a stack of single blocks, it will likely dump them into the hotbar.</p>\r\nBuilding\r\n<p>If a block or a block structure is smaller than 20x20, you can pick it up instantly with <remove>(default: [mouse right]) and place it with <place>(default: [mouse left]).</place></remove></p>\n<p>To connect blocks, go into welding mode by either holding <mode hold=\"\">(default: [Shift]) or toggling <mode toggle=\"\">(default: [C]). Hold <place>(default: [mouse left]) with your mouse over a block seam in the welding radius of the player.</place></mode></mode></p>\n<p>To disconnect blocks, go into welding mode, then hold <remove>(default: [mouse right]) with your mouse over two connected blocks in the welding radius of the player.</remove></p>\r\nCrafting\r\n<p>Construct the arrangement seen in the guidebook(default: [G]).</p>\n<p>Most recipes consist of the material, the machine block that acts on the material, and a block activating the machine block (often an {inductor} or activated {toggler} welded to the machine block).</p>\n<p>The {combiner} is the most complex machine block, taking in a structure of multiple blocks welded together in a particular arrangement, and turning them into 1 or more of the product.</p>\r\nContainers\r\n<p>Some blocks can hold other blocks.</p>\n<p>If a block is holding another block, it cannot be picked up. If you wish to pick up a container, you need to empty it first by holding <remove> with welding mode off.</remove></p>\n<p>The {collector} and {extruder} can automatically put other blocks into and out of other containers, especially the {crate}, the main storage solution in the game.</p>\n<p>Machine blocks such as the {extractor} and {combiner} are also containers, holding the products of their process.</p>\r\nWires\r\n<p>Wires connect to each other and other blocks by being welded to each other.</p>\r\nGeneral Strategies\r\nMining\r\n<ul>\n<li>Dig deep by removing all the welds from a block, then picking it up.</li>\n<li>Find ore veins.</li>\n<li>Hold &lt;remove&gt; to collect ore from the ore veins.</li>\n<li>Use an arc smelter to turn the ore into metal bars.</li>\n<li>When the ore vein is depleted, it will become a core vein, the rare raw material used for manufacturing advanced blocks.</li>\n</ul>\r\nOther resources\r\n<ul>\n<li>Find a desert and pick up {sand}, be careful not cause a collapse on yourself.</li>\n<li>Find a forest and carry a tree back to your base. Place a {leaf} on top of a {log} on top of {dirt} and connect the blocks together to let them grow.</li>\n</ul>\r\nAutomation\r\n<ul>\n<li>Find some way to automate placing and removing ores from arc smelters.(HINT: use a {block detector} on machining mode)</li>\n<li>Create an automatic tree farm.</li>\n<li>Make a mining vehicle, key components being a {destroyer} and {pilot chair}.</li>\n<li>Use {actuator}s, {mantler}s, wiring components, and anything else you find useful to automatically turn raw materials into the blocks you find yourself often crafting manually.</li>\n<li>Automatically build small arrangements of blocks you find yourself using and store stacks of these structures in your backpack.</li>\n<li>???</li>\n<li>Grey goo the infinite world.</li>\n</ul>\r\nCommands\r\n<p>Use <open console=\"\">(default: [tilde])</open></p>\r\n\r\nposition - show current position in tile coordinates\r\npos - shorthand for position\r\nping - pong\r\nsay &lt;string&gt; - announce something to yourself\r\ncheats - toggle cheats\r\nnoclip - toggle noclip\r\ngive &lt;integer&gt; &lt;block&gt; - if your hand is empty, you will receive &lt;integer&gt; &lt;block&gt;s\r\nclear - clear inventory\r\n\r\nAlpha\r\n<p>This is an in development alpha version. Expect and report bugs. Discord: https://discord.gg/gbEkBNt</p>\n<p>Do not expect your saved worlds to carry over to later versions.</p>\r\nEncouraged feedback\r\n<ul>\n<li><strong>Reproducible crashes and bugs</strong></li>\n<li>Obvious texture or spelling mistakes</li>\n<li>Changes to crafting recipes, with a good argument</li>\n<li>Changes to block behavior, with a good argument</li>\n<li>Specific tweaks to visuals</li>\n<li>Specific tweaks to player interactions</li>\n<li>Changes to this README</li>\n<li>Additional features that are in line with the rest of the game, ideally you should be an experienced player with this specific game and the rest of the automation genre.</li></ul>\n<p>This is not a comprehensive list.</p>", "metacritic": null, "released": "2020-03-07", "tba": false, "updated": "2020-03-09T04:04:06", "background_image": "https://media.rawg.io/media/screenshots/101/101c7c5eb8675680a354b738c1bb4346.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["redinator2000"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}