{"id": 418247, "slug": "trash-blaster", "name": "Trash Blaster", "name_original": "Trash Blaster", "description": "<p> In Trash-Blaster, you are essentially a space custodian who cleans up the mess left behind by corporations throughout the galaxy. It is a very simple concept, but the game is going to be grand! I do not want to spoil much but if you are a fan of Top Down RPGs that combine adventure platforming with a hint of space shooting and cosmic HORROR; you've come to the right place!</p>\n<p>The game itself has some primitive graphics and sound, because I started playing around with game design in the early 2000's (think Windows XP); and wanted to please my younger self! (Yeah don't worry the final products will not be like this...Possibly)</p>\n<p>I have attached a free demo of what to expect from the series as a whole! <br/>Ill be honest i don't have a plan in terms of rewarding fellow patrons for their contribution, but will be more than happy to add their somewhere in future games! </p>\n<p>I plan to use your contributions to support myself in continuing the games development cycle, and plan to feature the following:</p>\n<p>Multi-platform release (Steam,PS4,XBOX,SWITCH,and possibly IOS)</p>\n<p>Enjoy some complimentary screenshots, and the prototype!</p>\n<p>CONTROLS!:</p>\n<p>Standard <br/>In Ship</p>\n<p>Look: Left Mouse<br/>Throttle: Right Mouse button<br/>Fire: Left Mouse Button</p>\n<p>On boots</p>\n<p>Move: Arrow Keys<br/>Interact with a specific computer: Left Mouse Button<br/>Die: Get caught</p>\n<p>Game pad that may POSSIBLY look like Xbox 360 Controller</p>\n<p>In Ship</p>\n<p>Look: Left Analog<br/>Throttle: Right Trigger<br/>Fire: X</p>\n<p>On boots</p>\n<p>Move: Left Analog<br/>Interact with a specific computer: A<br/>Die: Get caught by thing that could be a trope in today's indie HORROR game trend.<br/></p>\n<p>NOTE!: This protoype is not easy, so make sure you practice your reflexes with very bad/broken movie licensed video games from the 1990s!(Or games that tried to capitalize on really successful/well-balanced games!)</p>\n<p>Load: Save.i?</p>", "metacritic": null, "released": "2020-03-07", "tba": false, "updated": "2020-03-09T04:09:27", "background_image": "https://media.rawg.io/media/screenshots/bbd/bbd50a9197ae4e599f1bf88b864e0e34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["James Cantu"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}