{"id": 418328, "slug": "sheep-with-mates", "name": "Sheep with Mates", "name_original": "Sheep with Mates", "description": "<p>Grab some mates and throw them on the couch, it's time to herd some sheep!</p>\n<p>Competitive sheepherding for 2-8 local players.<br/></p>\r\nFast-paced sheepherding action!\r\n<p>Pick a team, red vs. blue, then get as many sheep as you can back into your stable.</p>\n<p>Input is simple and straightforward; a thumbstick to move and a button to bark. Bark at the sheep to scare them away from you, straight into your team's stable. Though beware, because barking scares away all sheep in a radius, even those behind you.</p>\r\nPlay with up to 8 players at the same time.\r\n<p>You read that right! Play with 2 to 8 players at the same time. Teams have no restrictions, so go wild!<br/>Don't have 8 controllers? That's fine, Sheep with Mates supports 2 players per controller and 4 on keyboard! So you can hand half of your controller to a friend to play. Hand it to a foe for some extra fun!</p>\n<p>For a more in-depth explanation of how the game functions, check out this user manual: https://www.basklein.com/files/Sheep%20with%20Mates%20-%20Manual.pdf<br/></p>\r\nOnly have online mates? Fret not!\r\n<p>Though it isn't supported directly in-game, there are loads of third-party applications that allow you to play local-multiplayer games online!</p>\n<p>I recommend using Parsec (https://parsecgaming.com/).<br/>How-to guide: https://www.youtube.com/watch?v=LICxYmdf138</p>\n<p>If you play online in this way, you still only need one copy of the game. Which is also interesting if you're a streamer since you can play together with your audience members and they won't have to buy the game to do so!</p>", "metacritic": null, "released": "2020-03-06", "tba": false, "updated": "2020-03-09T04:26:37", "background_image": "https://media.rawg.io/media/screenshots/c36/c3689178593769f511c9a42b6a12a7f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["basklein"], "genres": [], "publishers": [], "esrb_rating": null}