{"id": 418336, "slug": "robot-run-lazabit", "name": "Robot Run (LAZABIT)", "name_original": "Robot Run (LAZABIT)", "description": "Actualización 1.1.0:<p>En esta nueva actualización se añadieron los siguientes elementos: apartir de ahora si quieres te podrás mover hacia arriba con la tecla W o SPACE, tambien tanto efectos de sonido como música se le a reducido la ganancia, por ultimo si estas en juego debes de saber que en cualquier momento presionando la tecla R podras Reiniciar tu puntuación actual y aparecerás en un nivel aleatorio </p>Instrucciones:\r\n<p>Te mueves con arrow UP (o tambien  W y SPACE), RIGHT o D y LEFT o A, puedes (si estas dentro de un nivel) reiniciar tu puntuacion y seleccionar un nivel al azar presionando R y volver al menu presionando P . Tu objetivo es llegar al punto mas alto del nivel y SALTAR! para ir cada vez mas arriba y evitar terminar en el suelo por culpa de una explosión de un PEM!</p>\r\nAcerca de el juego y el desarrollador:\r\n<p>Este es mi primer videojuego que publico, ya que e hecho algunos de prueba pero este es el primer videojuego que publico bajo el nombre LAZABIT. En cuanto a mis otros proyectos que no llegue a publicar no eran la gran cosa, fueron 3 juegos, el primero trataba de un globo que debía ir esquivando obstáculos (nada raro), el segundo trataba de una pelota que tenia que encontrar una solución a un puzzle antes de que llegue la lava (parecido a este juego pero con puzzles), y el tercero era exactamente el mismo juego que este pero con otros gráficos. En fin agradecería su opinión de este juego y nada mas, soy LAZABIT y me despido</p>", "metacritic": null, "released": "2020-03-06", "tba": false, "updated": "2020-03-09T04:28:15", "background_image": "https://media.rawg.io/media/screenshots/8a8/8a833aca4f5234a6645b1bfae3b99e7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LAZABIT"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}