{"id": 41837, "slug": "captain-disaster-in-death-has-a-million-stomping-2", "name": "Captain Disaster in Death Has A Million Stomping Boots", "name_original": "Captain Disaster in Death Has A Million Stomping Boots", "description": "Captain Disaster takes a job delivering a package from Acturus-1 to Proboscis Major - not realising that he is actually transporting something that will put the entire galaxy in danger!  Though just getting the package in the first place is quite a challenge in itself...\r\nOur intrepid nitwit investigates interesting peculiar people, puzzling places and panicky problems along the way to saving the day, once he finally realises that something is wrong.  Expect lots of laughs and head-scratching dilemmas before you reach the shocking conclusion and find out what all this \"Million Stomping Boots\" business is actually about!\r\nThe game is a multi award winner so it's not just us saying it ;-)\r\n\r\nGame Details:\r\n<ul><li>Classic point-and-click adventure gaming action with a few new twists</li><li>Retro 320x200 resolution graphics</li><li>Fully voiced </li><li>Epic music score </li><li>Plenty of puzzles </li><li>Plenty of adventure</li><li>Plenty of comedy</li></ul>\n<p>This game has been a labour of love by 2 devs (CaptainD and TheBitPriest) - who should know better, but just can't help loving the genre - with help from multiple other people over time.   We were inspired by the classic adventure games produced by Lucasfilm Games and Sierra, and believe we have created something that will hopefully, like those games, stand the test of time.</p>\r\nReviews:\r\n<p>\"What I loved most about this game is that it is well-written with a delightful sense of comic humor... To summarize, CaptainD and TheBitPriest have done an admirable job of creating a game that is delightful to play. \" (<strong><strong>Just Adventure</strong><strong>)</strong></strong></p>\n<p>\"Captain Disaster turned out to be an incredibly in-depth adventure with a world more vivid than we imagined from first impressions. It is difficult, harking back to a similar era of games, but you’ll find yourself motivated to carry on by the sheer litany of puns and references. \" (<strong>BigBossBattle</strong>)<br/></p>\n<p>\"Funky music, varied locales, lovely pixel art, appropriately cheesy voice acting and a story full of twists and turns one simply has to experience to believe. Were I to simply tell the tale of what Captain Disaster in: Death Has A Million Stomping Boots experienced, chances are most would think me absolutely mad.\" (<strong>Wraithkal</strong>)</p>\n<p><strong>What players have said:</strong><br/></p>\n<p>\"An hilarious and fun to play spacefaring adventure, full of clever ideas and puzzles of all sorts\"  </p>\n<p>\"A fun successor to games like Space Quest with references and jokes aplenty and a lighthearted atmosphere that doesn't take itself seriously in the slightest. Had a lot of fun figuring out the puzzles and meeting all the bizarre characters.\" </p>\n<p>\"If you have a fondness for planet-hopping sci-fi TV shows and movies of yesteryear, and you also like the idea of guiding a bumbling buffoon through a comedy of errors in deep space, give this game a try.\" <br/></p>\n<p>\"A great game polished to a brilliant sheen over many years of development.<br/>Instant adventure game classic!\" <br/></p>\n<p>\"excellent story with engaging &amp; challenging game play with a lot of subtle social comment &amp; brought to life with humorous voice-acting .....What more can I say!\" </p>\n<p>\"I found it to be a delightful &amp; engaging game brought to life with an interesting story, humour that I could immediately identify with &amp; pretty good voice acting!\"</p>\n<p>\"A spoof of the space opera genre that actually manages to be THE best space opera I've seen in years. It's quite simply FUN! It's got a memorable cast of aliens, robots and AI's. It's got an epic finale. \"</p>\n<p>\"The jokes, and Captain Disaster himself were really fun to play. \"</p>\n<p>\"It's a very fun game with a great combination of story and mixture of some tributes to movies and games!\"</p>\n<p>\"It's Captain Disaster, a zany, outlandish comedy game that never fails to amuse. Gameplay is not too difficult/frustrating, and voice acting I thought was top rate. As a commercial game, I feel like it is a complete package, I only wish it were longer.\"<br/></p>\n<p><strong>Reviews here on Itch:</strong></p>\n\n\n\r\nGameplay Footage\r\n(Have tried to avoid any spoilers!!)\r\n\n\n\r\nMight want to avoid this one if strobe lighting causes you difficulties.", "metacritic": null, "released": "2017-12-29", "tba": false, "updated": "2021-09-21T14:31:34", "background_image": "https://media.rawg.io/media/screenshots/3cf/3cf50505b3d5ef07e9ed5dbee7f92f28.jpg", "website": "http://www.captaindisasterthecomputergame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adventure Game Studio", "CaptainD"], "genres": ["Adventure"], "publishers": ["Adventure Game Studio"], "esrb_rating": null}