{"id": 418399, "slug": "circadian-dice", "name": "Circadian Dice (itch)", "name_original": "Circadian Dice (itch)", "description": "<p>Circadian Dice is a game inspired by single-player deck-building games, but instead of upgrading a deck, you build up a set of dice!<br/></p>\r\nOverview\r\n<p>A cosmic entity has twisted time into an endless cycle. By observing the repeating patterns, the entity intends to destroy all uncertainty and ultimately control reality.</p>\n<p>In Circadian Dice, you control a group of heroes that have managed to step outside this unnatural cycle, and are now setting out to find and destroy its source. You will need to overcome a series of skirmishes by upgrading your dice to bend chance in your favor, and strategically using your limited resources to defeat your enemies. </p>\n<p>While the heroes and their dice are restored to normal after each scenario (whether they die or succeed), any upgrades, relics, abilities, and modifiers that you have unlocked persist - so your tools are constantly improving! The better you perform in battle, the quicker you will build your arsenal and progress through the game towards your ultimate goal to break the loop and save <br/>the universe.</p>\r\nFeatures\r\n<ul><li>A game about probability manipulation and combo crafting: shape 6-sided dice into weapons of destruction, generators of wealth, magic conduits, or stat-boosting machines!</li><li>11 scenarios, available in Normal and Hard Mode. In Hard Mode, each scenario is significantly changed with new enemies, secrets, and challenges!</li><li>Unlockable <em>Endless</em> and <em>Campaign </em>(\"roguelite\") modes that turn the game from a skirmish-based adventure into an intense survival challenge.</li><li>6 different heroes with unique characteristics and play styles.</li><li>36 unlockable and equippable <em>Relics</em> that provide your hero with new abilities, change your stats, and give you game-warping bonuses.</li><li>60 different abilities that strengthen your hero, manipulate your dice, or damage your enemies.</li><li>A semi-random upgrade mechanic for each scenario and hero, that ensures new combo opportunities every time you play.</li><li>55 enemies and 23 bosses, each with different characteristics and abilities.\r\n</li><li>(Almost) every enemy can be captured in your dice to give you bonuses and new attacks based on the enemy's attributes!</li><li>Rare random enemy mutations that can either make your adventure harder, or be turned to your benefit.\r\n</li><li>Built for quick pick-up-and-play sessions: each scenario takes between 10 and 30 minutes to play, and is designed as a stand-alone challenge.</li><li>High replayability: random mutators, semi-random upgrade opportunities, and near-infinite combo possibilities makes each run of a scenario unique!</li><li>Extensive tooltips for every element in the game help you learn and strategize.</li></ul>", "metacritic": null, "released": "2020-03-06", "tba": false, "updated": "2020-03-09T04:41:41", "background_image": "https://media.rawg.io/media/screenshots/1bc/1bcad9b6a25ac0e2e712de27e996ad41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["shuffleup", "Strumbones"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}