{"id": 41844, "slug": "corebreach", "name": "CoreBreach", "name_original": "CoreBreach", "description": "CoreBreach is THE brand-new futuristic \"anti-gravity\" racing game for Mac OS X. <br/><br/>** PLEASE CHECK THE SYSTEM REQUIREMENTS PRIOR TO PURCHASE ** <br/><br/>6 EXCITING ANTI-GRAVITY SHIPS<br/>CoreBreach offers 6 great ships from easy maneuverable to rigid but ultra fast - and an unbelievable bonus ship.<br/><br/>6 RACE TRACKS &amp; REVERSE MODE<br/>You can choose from 6 beautiful, detailed and futuristic tracks of varying difficulty in both directions to prove your skills.<br/><br/>6 POWERFUL COMBAT WEAPONS<br/>Combat your enemies using 6 powerful weapons including the deadly \"Zeus Plasma Cannon\" or choose \"Space Nitro\".<br/><br/>UNIQUE GAMEPLAY &amp; GRAPHICS<br/>CoreBreach features a good looking high contrast graphics style and offers exclusive gameplay ideas like the \"CoreMode\".<br/>Advanced users can choose the in-ship camera mode for mind bending speed sensation (Warning: can cause dizziness).<br/><br/>CAREER-MODE &amp; STORY-LINE<br/>Fight your evil opponents while racing towards world domination in the thrilling story-mode.<br/>Win trophy money to upgrade your weapons and tune your ships to be even better.<br/><br/>THE SOUNDTRACK OF 1000-MPH RACING<br/>CoreBreach offers a powerful and varied 50-minute soundtrack to support the immersive gameplay.<br/><br/>SPLIT-SCREEN MULTIPLAYER AND ONLINE TIME-ATTACK<br/>Battle it out with your friends using the split-screen multiplayer mode or compete globally with the internet high-scores.<br/>Your lap times are automatically posted in the high-scores after each game - no account creation needed.<br/><br/>GAME CONTROLLER SUPPORT<br/>CoreBreach supports common steering wheels and game pads - you can even play with two controllers (split-screen).<br/><br/>USER-MADE RACE TRACK SUPPORT<br/>CoreBreach supports the creation of user-made race tracks (3D modeling skills required) and easy sharing and playing of these tracks.<br/><br/>TRUE MAC NATIVE GAMING<br/>CoreBreach is developed from the ground up for Mac OS X and provides these unique benefits:<br/>  • effortlessly switch to other applications while playing - your race is automatically paused<br/>  • seamlessly change from fullscreen- to windowed-mode and back even during the race<br/>  • you can still see the on-screen notifications from other apps while playing (mails, music, instant-messages, etc)<br/>  • the user interface for the game menu uses the familiar and well designed Mac-native controls for ease-of-use<br/>  • CoreBreach is not a cheap port of a iPad game, meaning you can choose resolution and graphics settings to your liking<br/><br/>*** SYSTEM REQUIREMENTS *** <br/>* 64-bit Intel processor<br/>* 1GB free disk space<br/>* Compatible video card, one of:<br/>  - ATI Radeon HD 2400 or higher<br/>  - NVIDIA GeForce 7300 or higher<br/>  - INTEL HD Graphics 3000 or higher<br/><br/>*** WEBSITE *** <br/>Get more information here:<br/>https://www.corecode.io/corebreach/", "metacritic": null, "released": "2011-08-24", "tba": false, "updated": "2019-10-22T14:33:13", "background_image": "https://media.rawg.io/media/screenshots/979/97954d09d3401751f291a8b66ebac9e3.jpg", "website": "http://corebreach.corecode.at/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["CoreCode"], "genres": ["Racing", "Arcade"], "publishers": ["CoreCode"], "esrb_rating": null}