{"id": 418502, "slug": "wargame-sicily-1943", "name": "Wargame: Sicily 1943", "name_original": "Wargame: Sicily 1943", "description": "Operation Husky was the code name for the invasion of Sicily in July 1943. This was the first return, in earnest, of the Western Allied powers to the continent of Europe since the disastrous withdrawal of the B.E.F. from France in 1940.<br/><br/>Two armies were involved: The US 7th Army, commanded by Patton, and the British 8th Army, commanded by Montgomery. They faced a variety of Axis formations, from demoralised Italian coastal defences to tougher German mechanised troops, remnants of the Afrika Corps and Italian elites.<br/><br/>This game allows you to play either the Allied invasion, or the Axis defenders. The aim of the Allies is to capture the 3 principle cities of Sicily (Catania, Palermo and Messina) as quickly as possible. The Axis must prevent this.<br/><br/>You can play another person hot-seat, or either side against your device.<br/><br/>There are 3 options you can set:<br/>Allied reinforcements: Fewer than historical, or more reinforcements from the historical floating reserves.<br/>Axis reinforcements: Fewer than historical, or more German and Italian reinforcements could be sent.<br/>Landing site: The historical site chosen was not the original one - there was an alternative Western site.<br/><br/>In all, there are 147 selectable combinations, plus you can set any of the options to a random choice.", "metacritic": null, "released": "2014-02-09", "tba": false, "updated": "2020-03-13T02:03:22", "background_image": "https://media.rawg.io/media/screenshots/b4a/b4a9f584b49c107a0f32c1134d6d76e7_lYJXgk1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["David Kershaw"], "genres": ["Strategy", "Board Games", "Educational"], "publishers": ["David Kershaw"], "esrb_rating": "Everyone 10+"}