{"id": 418689, "slug": "cyberneon-2082-chapter-1-the-cyberpsycho-murder", "name": "CyberNeon 2082 – Chapter 1: The CyberPsycho Murder", "name_original": "CyberNeon 2082 – Chapter 1: The CyberPsycho Murder", "description": "<p><strong>CyberNeon 2082 </strong>is an episodic detective horror game with FPS elements set in a dystopian version of our future.<br/></p>\n<p>In this<strong> first chapter</strong> the character we control (Agent Kane Anderson) is a policeman from “Neo City” in the year 2082  who is assigned the investigation of a murder case in the mansion of a very important macro corporation member (Tyrell Vega, CEO of VEGA CORP).</p>\n<p>The society is in a state of maximum inequality, with a lot of delinquency in the streets, and is mostly controlled by the richest.</p>\n<p>The game begins when we fly to the abandoned house, on a dark and rainy night...</p>\n\n<strong>Keyboard</strong>\n\n<strong>Controller</strong><br/>\n<p>Website: finigam.es<br/></p>\n<p>Twitter: @GamesFini</p>\n<p>YouTube: @FiniGames</p>\n<p>Discord:  https://discord.gg/wPvH2ve </p>\n<p><strong>This open beta is supposed to work as an idea of the game world and serve as the <em>first chapter</em> for the game. We will keep working on this game since we want to create a fully explorable world with multiple chapters depending on the funding we get.</strong></p>\n<p>The final release of the game is planned for early Summer. We will be posting more updates of the new characters we are working on for the Neo City map for the final release on our discord channel - https://discord.gg/4nVZfn and website - finigam.es</p>\n<p> </p>\n<p>DONATION REWARDS</p>\n<p>----------------------------------------------------------------------------------------------------------<br/>- More than $5 (Rank NeoCitizen) we will get your voice in the game and your name in the credits!</p>\n<p>You will also receive a digital copy of the final game once it's released and the donator and NeoCitizen rank on our discord page</p>\n<p>- More than $50 (Rank NCPD Agent) This rank will get you a pack of rewards including a giant wallpaper with logo art, logo stickers, and of course your name on the credits and voice in the game!</p>\n<p>You will also receive a digital copy of the final game once it's released and the NCPD Agent rank on our discord page </p>\n<p>- More than $100 (Cybernetic Lord) This rank will get you to choose on of Kane’s side missions, talk with the devs and propose new gameplay ideas that will be implemented into the game as well as a pack of rewards including a wallpaper with logo art signed by the creators, logo stickers, and an exclusive custom T-shirt from our merch store. And of course, your name on the credits and voice in the game!</p>\n<p>You will also receive a digital copy of the final game once it's released and the Cybernetic Lord rank on our discord page </p>\n<p>- $500 (God of the machines) This rank will get your face modeled into the game and you will be one of the NPCs! We will design a district of Neo City for you and put all your ideas into the final release. You will also get to choose on of Kane’s side missions, talk with the devs and propose new gameplay ideas that will be implemented into the game as well as a pack of rewards including a wallpaper with logo art signed by the creators, logo stickers, an exclusive custom T-shirt from our merch store. And of course your name on the credits and voice in the game!</p>\n<p>You will also receive a digital copy of the final game once it's released and the God of the machines rank on our discord page</p>\n\n<p><strong>Changelog</strong><br/></p>\n<p><strong>09/04/19</strong> - Build uploaded directly to Itch.io for better updates.</p>\n<p><strong>10/04/19 [1.1]- </strong>Major bugs fixed (player speed, various map bugs and a crash bug).<br/></p>\n<p><strong>16/04/19 [1.2] - </strong>Update with bug fixes &amp; improvements (see devlog for details).<br/></p>\n<p><strong>Upcoming</strong></p>\n<p><strong>20/08/20</strong> - Release of the final game<br/></p>", "metacritic": null, "released": "2020-03-11", "tba": false, "updated": "2020-03-13T02:48:14", "background_image": "https://media.rawg.io/media/screenshots/c3a/c3adf03ed5f8de03b54ce6ca33f3c7b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FiniGames"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}