{"id": 418772, "slug": "evidyon-no-mans-land", "name": "Evidyon - No Man's Land", "name_original": "Evidyon - No Man's Land", "description": "<p>Evidyon - No man's Land is a free and opensource 3D MMORPG, this higly addictive Mmorpg have all you want from a commercial game; fast-paced PVP; lot of contents, Guilds, Dungeons, Geosids, Partys, and more than 60 lvls to explore!<br/></p>\n\n<p>Download and Host your own public/local server to play the game!</p>\n<p><strong>EVIDYON - No Man's Land</strong></p>\n<p><strong>----[ Evidyon ]----------------------------------------------------------------</strong></p>\n<p>Welcome to Evidyon!</p>\n<p>HOW TO RUN &amp; PLAY A EVIDYON SERVER VERSION 1.4<br/></p>\n<p>-Install client</p>\n<p>-Download server and execute it on the server machine</p>\n<p>-Go to your client installation directory; edit config.ini file with notepad and look for the line with \"188.165.201.55\" replace it with your public server address (127.0.0.1 for local)</p>\n<p>-Now you will be able to join the server with the 1.4 Evidyon - No man's Land client</p>\n<p><strong>----[ Basic Information ]-------------------------------------------------------</strong></p>\n<p>Most of the stuff in this document is intuitive and can be discovered by playing</p>\n<p>the game, so feel free to get started!</p>\n<p>Create an account, a character and enter the world. You are safe on the square</p>\n<p>of ground where you enter the world and cannot be killed there. Hunt monsters to</p>\n<p>gain levels and find items--but beware! Once you reach level 5, other players</p>\n<p>can kill you too!</p>\n<p><strong>----[ Controls ]---------------------------------------------------------------</strong></p>\n<p><strong>Default Keys:</strong><br/>=================================<br/>To reset the keys for one of your characters, go to wherever you installed<br/>Evidyon (usually c:\\Program Files\\Evidyon) and delete \"<character name=\"\">.keys\"<br/> d - drop items i - inventory c - cast spell u - use item s - stats screen [return] - chat F5 - take screenshot L - show/hide chat log</character></p>\n<p><strong>----[ Detailed Instructions ]--------------------------------------------------</strong></p>\n<p>The tooltips should explain a lot (e.g., what the various attributes do, what a spell does, &amp;c.).<br/>Feel free to ask questions if you have any.</p>\n<p><strong>Key Binding: </strong>To bind a function to a key, in the menu system right-click on what you want to bind--one of the screens or menus from across the top, a spell/ability from the Cast menu, an item from the Use menu--and then press the key to which you want the function bound. You'll see the bound key in parenthesis next to the function.</p>\n<p><strong>Chat:</strong> To say something, press ENTER, type your message, and press ENTER again to send. If your message is too long, the left-over text will remain in your chat bar, so you only have to press ENTER again to send the rest of what you want to say. Local chat will display above your character's head, party and global chat will display in the top left corner of the screen with a tag indicating which type of chat. All chat messages also show up in the chat log.<br/>To open/close the chat log, press 'L'.<br/>For global chat, prefix &gt; to your message (e.g., &gt;hi everyone!).<br/>For guild chat, prefix -- or g- to your message (e.g., g-who's here?).<br/>For party chat, prefix - or p- to your message (e.g., -where are you?).</p>\n<p><strong>Groups:</strong><br/>Evidyon supports parties of up to 8 characters at a time.<br/>Party commands: /lead opens you for /join which joins you to a nearby leader; parties are democratic, so if A leads B and B leads C, ABC are now a single party. /close stops you from accepting joins. /leave removes you from your party. /kick kicks out the nearest party member (again, democratic: anybody can kick anybody).<br/>EXP for monster kills is shared in a 5 level range, but you have to be nearby your party members to get credit for their kill.<br/>If you're nearby a party member and he kills a player, you also get blamed (in terms of alignment) for the kill.</p>\n<p><strong>Alignment and PvP:</strong><br/>If you are the aggressor (i.e. you attack a person who hasn't done damage to you recently) the damage the player who is being attacked is reduced based on your difference in level. This effect only lasts until the player who is attacked fights back. If you are not the aggressor in a fight, you cannot lose alignment--so defending yourself is consequence-free.</p>\n<p>You cannot log off if you are engaged in combat.</p>\n<p>If you are level 3 or lower, you will never drop any items when you die.<br/>If you are level 5 or lower, you cannot be PKed unless you fight back.<br/>If you are level 7 or lower, you will not drop any equipped items when you die.</p>\n<p>All players who hit another good player before they die are considered killers, regardless of who actually dealt the final blow.</p>\n<p>A PK is defined as being a killer of a player with a non-evil (i.e. neutral or better) alignment. You cannot PK an evil player. Killing evil players does not count against you in any way.</p>\n<p><strong>Alignment System</strong><br/>You are allowed one consequence-free pk each 24 hours. If you go 24 hours killing only one person, you will gain a point of alignment.</p>\n<p>Every person you kill within a 24 hour period of your last PK will decrease your alignment by an increasing amount. Let me give an example: You kill a player. Ten minutes later you kill again and lose 1 point of alignment. Four hours later you kill again and lose 2 points. Ten hours later = 3 points. You wait 24 hours after that last kill, and the counter resets.</p>\n<p>For every day you go only killing 1 person, you will gain 4 points of alignment. Inactive characters (not played for more than a few days) gain at a slower rate.</p>\n<p><strong>Bonuses &amp; Penalties:</strong><br/>- Good characters drop fewer items, evil characters drop more items.<br/>- The square will not protect an evil character.<br/>- Evil characters spawn in the swamp. For those of you that know the map, the columns have changed to make this place more accessible.</p>\n<p><strong>Storage Merchant:</strong> The guy standing on the square is a Storage Merchant. Click on him and you'll see two lists: on the right, items in storage; on the left, items carried (does not include equipped items). All of the Characters on a single Account share the same Storage space.</p>\n<p><strong>Geosids:</strong><br/>The big crystals. Drop an item in the circle around one to sacrifice the item and charge the geosid. When the charge reaches 0, something good happens.</p>\n<p><strong>Bazaar:</strong><br/>You can access the Bazaar via \"Alishandra\" on the town square. You can list your own items for sale and buy the items of others. Your first couple listings are free, but if you want to list more items concurrently, each one will cost you a listing fee. The listing fee increases quickly depending on how many items you already have listed. If there are more than 20 items in a category, the listing will automatically refresh every 30 seconds to display a new set of items.</p>\n<p><strong>Screenshot: </strong>To take a screenshot, press F5 (a bindable key). The picture will be saved as a .png to your My Pictures/Evidyon folder.</p>\n<p><strong>Stacked Items:</strong><br/>Right-click to split a stack of items in half. Click stackable items to combine them again.</p>", "metacritic": null, "released": "2020-03-11", "tba": false, "updated": "2020-03-13T03:09:58", "background_image": "https://media.rawg.io/media/screenshots/695/6955b81956381524ca29d45ab097398d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WiTF Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}