{"id": 418729, "slug": "bird-of-plague", "name": "Bird of Plague", "name_original": "Bird of Plague", "description": "Install instructions<p>Bienvenue dans Bird of Plague ! Un jeu réalisé pour la GameCodeur Gamejam #23.</p>\n\n<p>Le thème étant centré sur la contamination, je souhaitais trouver un sujet qui ne venait pas tout de suite à l'esprit lorsque l'on énonce ce mot.  Ainsi plutôt que de choisir un sujet tel que le vaccin, le virus, les soins médicaux je suis allé chercher au fin fond de ma culture cinématographique. Un sujet m'est alors venu: DRACULA !</p>\n\n<p>Vous incarnerez donc un vampire ayant grand soif. Une soif qu'il peut satisfaire auprès des petits villageois se promenant entre les murs d'un château. Evidemment lorsqu'un villageois est mordu, il est alors contaminé et prépare sa transformation en vampire !</p>\n<p>Toutefois prenez garde aux chevaliers qui assurent l'ordre au sein du château, ils n'hésiteront pas une seconde à vous charger à vue pour tenter de vous découper en rondelle...</p>\n\n<p>J'ai réalisé ce jeu sur Unity en une cinquantaine d'heures environ. La dernière fois que j'avais participé à une jam c'était pour #21 de GameCodeur, à cette époque je n'avais que très peu expérimenté Unity. Depuis j'ai pu en apprendre beaucoup plus et réaliser un prototype dont je suis très satisfait. Certaines idées n'ont pas eu le temps d'être mise en oeuvre mais l'essentiel du gameplay est là. </p>\n\n<p>Pour jouer: </p>\n<ol><li>Télécharger le fichier ZIP</li><li>Extraire le fichier</li><li>Double-cliquer sur le fichier .exe</li></ol>\n\n<p>N'hésitez pas à me faire vos retours en commentaires, cela permet de continuer à améliorer mes petites créations. Bon jeu à tous :)</p>", "metacritic": null, "released": "2020-03-11", "tba": false, "updated": "2020-03-13T03:00:07", "background_image": "https://media.rawg.io/media/screenshots/f7d/f7d6712e3a127a6d7c7c6c1eaca2de51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FrenchAssassinX"], "genres": ["Action"], "publishers": [], "esrb_rating": null}