{"id": 418882, "slug": "contaminationroom", "name": "ContaminationRoom", "name_original": "ContaminationRoom", "description": "Prologue\r\n<p>Vous êtes un soldat qui s'est retrouvé coincé dans un chateau lors d'une mission spéciale en Russie, après une explosion nucléaire massive. La radioactivité très importante a provoqué une mutation chez certains habitants près de cette zone. Votre but est de sortir de ce chateau le plus vite possible avant que les zombies ne vous contaminent. Pour cela, récupérez les clés de chaque pièce afin d'en sortir. Attention aux flaques de laves toxiques que les zombies libèrent ! Bonne chance soldat !<br/></p>\r\nDéveloppement du jeu\r\n<p><em>ContaminationRoom</em> est un jeu développé en <strong>C#</strong> et avec le moteur de jeu <strong>MonoGame</strong>. Ce jeu est mon tout premier projet réalisé avec ce langage et ce moteur, c'était donc un défi de me lancer dans cette jam sans <strong>aucune connaissance</strong> de ces deux outils. De plus je n'avais jamais utilisé Visual Studio auparavant, cela m'a posé plusieurs problèmes au niveau de la<strong> gestion de mon temps</strong> (Heureusement, David a rallongé la durée de la jam).  La recherche de sprite m'a pris pas mal de temps, j'ai réussi à en trouver sur internet des libres de droit pour le héro et les murs et le reste que j'ai créé moi même et sur le pack GameCodeur. Malgré ça, je suis content de ce que j'ai réussi à produire pour ma première game jam et c'est l'essentiel! Le code sera sûrement disponible sur mon github une fois que je l'aurais réusiner.<br/></p>\n<br/>Pour la prochaine game jam\r\n<p>Mon but pour la prochaine game jam est de réussir à mieux gérer mon temps pour implémenter des nouvelles idées ! J'essayerai aussi de créer le plus de sprite possible moi-même !<br/><br/></p>\r\nMon expérience\r\n<p>J'ai 15 ans et je suis élève GameCodeur depuis 3 semaines mais je programme depuis plus d'un an. Durant cet jam j'ai appris à utiliser deux outils très puissants tout en créant ce jeu. Elle a été très enrichissante car j'ai passé beaucoup de temps à lire de la documentation et débugué. Je conseille à tout ceux qui n'ont pas encore participé à une game jam de participer à la prochaine, même si vous n'êtes pas sûrs de vous ! L'essentiel c'est de prendre plaisir et de produire encore et encore pour s'améliorer!  <br/><br/></p>\r\nGlobal\r\nNom d'adhérent GameCodeurLangageMoteurTemps PasséJean-BaptisteCodeC#MonoGame1 semaine<br/>", "metacritic": null, "released": "2020-03-10", "tba": false, "updated": "2020-03-13T03:34:17", "background_image": "https://media.rawg.io/media/screenshots/cf1/cf1a2d90a686cbb51761fcdcfd7cdd2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azzury"], "genres": [], "publishers": [], "esrb_rating": null}