{"id": 418939, "slug": "klepto-the-arduous-quest-for-grilled-cheese", "name": "Klepto & The Arduous Quest for Grilled Cheese", "name_original": "Klepto & The Arduous Quest for Grilled Cheese", "description": "<p>** CURRENT BUG ** When the game starts the volume is off by default for some odd reason. Until this is fixed, skip the intro and go to the settings screen. Increase the volume slider, click apply and the volume will work. We apologize for this and will try to fix it ASAP!</p><p>*Anyone having trouble playing, please open the ZIP file, and extract the FOLDER inside of it to somewhere (desktop, for example) and run the .exe from there and it'll run.</p><p>A game developed in 10 weeks with a 3 person team for a college capstone project.</p>\n<p>Created by Dylan Lavimodiere, Joseph Carr &amp; Hannah Trautz.<br/></p>\n<p>This game is a Star Fox inspired space shooter with story, character development and a fun and cool cartoon aesthetic. </p>\n<p><strong>Klepto and the</strong> <strong>Arduous Quest </strong><strong>For </strong><strong>Grilled Cheese</strong></p>\n\n\n<p>The Plot:</p>\n<p>The year is XX28. Homemade Grilled Cheese machines are locked away in the farthest reaches of the galaxy by Emperor Xerxes. The Republic of Arlon has fallen. Klepto Phantasmagoria has escaped the clutches of Captain Vernon Ardala and has angered Wiaxx the Merciful for the last time. With little time left for the few survivors of the Resistance of Arlon, Phantasmagoria must steal back the Molten Core of Uxane that was recently obtained by the now turned Wiaxx the Unmerciful. </p>\n<p>With the knowledge of the recently turned Wiaxx, he commands Phantasmagoria to venture back to Ardala’s star system and reclaim the Core before the Resistance of Arlon reclaims the Core and reunites the galaxy through the Resistance of Arlon. Phantasmagoria uses the power of CyberChase (Not the PBS Kids cartoon - Do not sue.) to slip between the security of the Empire of Xerxes to obtain the one and only weakness of Ardala; grilled cheese on a brioche bun.</p>\n<p>Upon successfully using Wiaxx the Merciful - now Wiaxx the Unmerciful’s old elevated key access code to obtain the Legendary Golden Grilled Cheese Maker. With the weakness of Ardala in hand, Phantasmagoria goes to confront him head on in what will be the final battle for one of them. Who will win? Find out in: Klepto and Arduous Quest for Grilled Cheese.</p>\n<p>Klepto Phantasmagoria: The number one fugitive on the Intergalactic Protection Force’s most wanted. His claim to fame was getting into Deathrow, eating his last meal and leaving. The problem? He did this <em>nine</em> times, forcing the citizens to pay outrageous taxes on keeping his sorry soul alive.</p>\n<p>Captain Vernon Ardala: The leader of the Intergalactic Protection Force. His only goal in life is to take down Klepto. With him finally in his grasp for the tenth time, he is certain he will capture him once and for all. His favorite color is orange and he loves eating grilled cheese on brioche buns. Despicable.</p>\n<p>Vernon’s Grunts: Each are individually engraved with their serial numbers on their left ring fingers. They also come with commemorative plaques and Certificates of Authenticity to prove they are sworn to Vernon’s cause.</p>\n<p>Emperor Xerxes: Plot relevance does not matter; only here because of paper work related legal reasons.</p>\n<p>Wiaxx the Unmerciful: Added for backstory and surprising pentultimate plot twist and commander of Phantasmagoria.</p>", "metacritic": null, "released": "2020-03-10", "tba": false, "updated": "2020-03-13T03:48:58", "background_image": "https://media.rawg.io/media/screenshots/9f4/9f4596430e9b14a0a335048a29cfb7db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joey Carr"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}