{"id": 418934, "slug": "american-truck-traffic-racer-highway-racing", "name": "American Truck Traffic Racer: Highway Racing", "name_original": "American Truck Traffic Racer: Highway Racing", "description": "<p>Google Play: https://play.google.com/store/apps/details?id=com.American.Truck.Simulator.Euro.Truck.Driver.Game.Free.Berneons.Games<br/></p>\n<p>This is a game about a traffic racer on an American truck that drives along the highway racing dodging obstacles. Your task is to hold out as long as possible on the highway. For this you will receive a reward in the form of coins. Still on the way you will meet containers that need to be collected. At the end of the game, you can open them and get even more coins and transport cars from there.<br/></p>\n<p>Features of the game American Truck Traffic Racer: Highway Racing\r\n★ Use the ability to accelerate and beat any obstacle on the highway\r\n★ Use time dilation ability to dodge other traffic riders\r\n★ Use your magnet ability and collect all coins and freights on the highway traffic\r\n★ Use your shield ability to gain extra life in racing traffic\r\n★ Use the ability to multiply coins and earn more money and reputation on racing highway</p>\n<p>Do not forget to use these abilities to win racing games!</p>\n<p>For the money you earn from racing, you can buy new American trucks to show your skill level in road racing!</p>\n<p>Good luck on the highway at American Truck Traffic Racer: Highway Racing!</p>", "metacritic": null, "released": "2020-03-10", "tba": false, "updated": "2020-03-13T03:47:24", "background_image": "https://media.rawg.io/media/screenshots/ea0/ea0fc339df2f63d9613fa59d88e1c874.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Berneons Games"], "genres": ["Adventure", "Racing"], "publishers": [], "esrb_rating": null}