{"id": 419000, "slug": "not-spy-hunter", "name": "Not Spy Hunter", "name_original": "Not Spy Hunter", "description": "<p>After a whole year of refining this game, it has finally reached something that actually looks better than it did before.</p>\r\nPLAY THE RACER OF A LIFETIME\r\n<p>Race down an infinite stretch of highway with only one goal: go as fast as possible. This is pretty much the only thing that you want to do. You only have one problem. Someone decided to put a bunch of roadblocks in your way, and send cars with the likeness of certain Ford Mustangs to shoot at you. I thought it'd look cool that way. Also, this game sort of looks like spy hunter, but it's not, it just happens to look that way.</p>\r\nUSE INNOVATIVE CONTROLS\r\n<p>Just use the arrow (or cursor, if you like to say things differently from the rest of us) keys and space bar.</p>\r\nVIEW SORT OF UGLY GRAPHICS IN TWO DIMENSIONS\r\n<p>Man, this game looks pretty ugly.</p>\r\nI HAVE REMOVED THE SOUND\r\n<p>I'm still working on sound that's satisfying, so for now you'll have to endure pure silence.</p>\r\nI THINK IT HAS MOBILE SUPPORT\r\n<p>You can touch and drag to do stuff. It should work, I really haven't tested it. Let me know if there are any bugs!</p>\r\nIN DEVELOPMENT\r\n<p>So it's fairly obvious this game isn't finished. When will it be finished? I have no idea. I'll probably just keep adding stuff until I give up on it. If there's a bug, or something feels... off... be sure to leave a comment. I'll try to fix it when I have time.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-03-13T04:04:51", "background_image": "https://media.rawg.io/media/screenshots/3dd/3ddbe170d6082d1f28bc7783d043d2ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tyly04"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}