{"id": 419023, "slug": "hover-fps", "name": "Hover FPS", "name_original": "Hover FPS", "description": "<p>This is a pre-beta indie Unity Microgame based FPS Shooter with an engaging story and gunplay that never gets old! Featuring tons of levels aswell as an Open World mode!<br/></p>\n<p>Features:</p>\n<ul><li>A large arsenal of weapons and guns! (Screenshot 1)</li><li>New and interesting enemies and weapons introduced almost every level .(Screenshot 2)</li><li>Creative levels that are all tied together by a mystery and a fun story. (Screenshot 3)</li><li>Detailed levels with funny side-stories told through details. Fun gimmicks like security cameras to see your enemies before see you. (Screenshot 4)</li><li>Tons of riveting enemies with creative designs and features. For example, the cactus turret disguises itself as a cactus during run-and-gun style desert levels, make sure your checking every cactus! (Screenshot 5)</li><li>Intense battles where you fight enemies over control of a missile, destroying a piece of technology gone rouge, and hunting down your mysterious kidnapper's identity are all examples of objectives in this game. Side objectives can lead to you discovering cool secrets, or getting the most out of this game, and main objectives never disappoint in terms of thrill and firefights. (Screenshot 6)</li><li>Fun slightly cartoony slightly realistic graphics  that will keep you in awe throughout the entire game (Screenshots 1 and 6)</li><li>Levels that encourage stealth and levels that encourage close quarters combat (Screenshots 2 and 4)</li><li>Secrets hidden in levels that make each level very replayable and more fun if you find these secrets on your first attempt!</li><li>Prototype and Parasitic weapons which are extremely powerful weapons that also upgrade other weapons!</li></ul>\n<p>DEMO Features:<br/>The first 8 levels of the game FOR FREE!</p>\n<p>An early, less fleshed out version of open world is included.</p>\n<p>Access to one of the many prototype weapons.</p>\n<p>A lighting demo and improved graphic demo!</p>", "metacritic": null, "released": "2020-03-10", "tba": false, "updated": "2020-03-13T04:11:17", "background_image": "https://media.rawg.io/media/screenshots/d22/d22f72563ba9cb171d581e97b2546eac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NikoFPS"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}