{"id": 419063, "slug": "ostrofa-itch", "name": "Ostrofa (itch)", "name_original": "Ostrofa (itch)", "description": "<p><strong>Ostrofa</strong> is my very first multiplayer-survival game that I've been working on for about 2 years now. I am mostly operating as a one-man team on this project, so your support would mean a world to me to continue moving forward! </p>\n<p>I've decided to release it as Early Access product so that players can have input on the game's planned features while allowing myself to have some extra time to crush bugs! Player feedback is something very valuable to me, and I'm eager to see how Ostrofa will grow and evolve based on what the players want!</p>\r\nWhat is it about?\r\n<p>You find yourself stranded on a deserted island, surrounded with nothing but wild animals and collectible resources. What do you do?</p>\n<p>Welcome to Ostrofa, where you’ll be challenged to use your survival instincts and combat skills to survive in a randomly generated, low-poly environment, fighting other players around the world!</p>\r\nCollect resources to stay alive\r\n<p>Food can be found on your or resource islands. Look for apple and orange trees, mushrooms, vegetables, and berries. You can also hunt nearby animals, which can provide a good amount of meat. If you are looking for something more sustainable, there's always an option to create a plant farm or build fish traps!</p>\r\nExplore your surroundings\r\n<p>Stay away from the dark - there are a lot of wild creatures watching you. Carry a torch or build a campfire to keep yourself warm and scare them away. A sharp axe or gun might come in handy.</p>\r\nCollect Life Shards\r\n<p>These pretty blue crystals called <em>Life Shards</em> are the most valuable treasure you can own. It is very simple - the first player to collect and deposit <em>15</em> of them or the one who has the most on the day <em>20</em>, wins the match. They can be retrieved from either killing the bosses or looting supply drops.</p>\r\nFind valuable gear\r\n<p>The best way to survive is to get the best gear in the game. Chests are scattered all over the map and contain very, very exciting and worthy items. Be as quick as you can to loot them first!<br/><br/></p>\r\nCrafting\r\n<p>What will you need to fend off aggressors of your territory? Weapons, Traps, and Tools! The blueprint panel next to your inventory grants you the power to craft and will be one of the most essential skills you'll need to survive in Ostrofa!</p>", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-03-13T04:20:53", "background_image": "https://media.rawg.io/media/screenshots/18b/18bf63672221d92e2917a1f9589e3ae9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Normunds Petrovs"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}