{"id": 419113, "slug": "exp-parasite", "name": "Exp Parasite", "name_original": "Exp Parasite", "description": "An unidentified alien parasitic entity has been caught by scientists and enclosed in a specially created virtual simulator in order to study its capabilities. Take control of the parasite and infect different mechanical objects, overcome countless obstacles, and fight powerful bosses.<br/><br/>In this retro, hardcore 2D arcade game, you will defy gravity by moving in any direction to take control over objects and gain their abilities. Each managed object is unique and gives its own gaming experience in a world where every minute the gameplay changes.<h3>Features:</h3><br/><strong>Each Minute of the Gameplay is Unique</strong> – Exp Parasite was developed with an emphasis on diversity. Every minute the gameplay changes thanks to varied gameplay filled with countless obstacles, enemies, interactive elements, leveling, bonus items, changing environments and more. <br/><br/><strong>Superpowers</strong> – Gain and improve powerful abilities such as Slowdown time (time in the game slows down for a short period of time) and Invulnerability (gain full immunity to any type of damage for a short period of time).<br/><br/><strong>Rewards</strong> – Earn rewards at the end of each level in the form of a limited number of power-ups (hyper cores). The maximum for each level is 4. If you’re is unable to collect all four cores the first time, you can replay the level and pick up the remaining cores. These rewards can be used in the store to purchase additional lives and certain abilities.<br/><br/><strong>Unique Levels with Unique Bosses</strong> – Play a diverse range of levels each with their own boss that challenges you with their unique capabilities, techniques, strategies, and attacks. In order to advance to the next level, the player must defeat the boss in a variety of fight scenarios.<br/>", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-09-18T02:44:14", "background_image": "https://media.rawg.io/media/screenshots/a82/a8251dae78ee3305eb0d52f69f0be5d3.jpg", "website": "https://greyheadstudio.com/parasite/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "Web", "Xbox One", "PC", "macOS", "Linux", "PlayStation 4"], "developers": ["Zimogor"], "genres": ["Action", "Arcade", "Indie", "Platformer"], "publishers": ["Greyhead Studio"], "esrb_rating": null}