{"id": 419183, "slug": "bandito-poker-patent-pending", "name": "Bandito Poker, Patent Pending", "name_original": "Bandito Poker, Patent Pending", "description": "Bandito Poker, my novel three-card video poker game where you steal from the dealer, Patent Pending<p>My patent for \"POKER EVENT WITH CARD REMOVAL FROM DEALER POSITION\" covering my game <em>Bandito Poker </em>and similar casino gaming products was filed on February 19, 2020 with US Docket No. 777_771USP1.</p>Controls<ul><li><strong>Mouse Click </strong>to select deal button to begin game, change bet size, and select any one of the dealer's five cards to steal it and resolve the game</li><li><strong>Z X C V B </strong>or <strong>1 2 3 4 5 </strong>to select the corresponding card from the dealer's hand, and any will deal a new hand</li><li><strong>Escape </strong>to close the application</li><li><strong>F11 </strong>to toggle fullscreen</li><li><strong>R </strong>to reset</li><li><strong>Left / Right Arrow Keys </strong>to change bet size</li></ul>Free Demo<p>This is a free demo of my recently invented three-card video poker game <em>Bandito Poker</em>. No real money is wagered or earned; all credits are simply representative numbers for fun. By pressing R to restart or entering the settings menu, your credits will reset to 500.</p>Gameplay<p>In <em>Bandito Poker</em>, you are dealt 2 cards face-up, while the dealer is dealt 5 cards, 3 face-down and 2 face-up. You then <em>steal</em> any one of the dealer's 5 cards, removing it from the dealer's hand and adding to your hand, offering a unique video poker strategy for players to engage, balancing harming the dealer's hand and improving your own. Your handcrafted three-card poker hand is then compared to the dealer's best three-card poker hand, and if you beat the dealer's hand, you win odds according to the paytable in the upper-left corner. This culminates with a Royal Tie, achieved when both you and the dealer have a Mini Royal (suited A-K-Q), which pays a progressive on a max credit bet.</p><p>Concurrently, a 7 card bonus game is run based on all 7 cards on the field at the end of a game. This pays odds based on the five-card poker hand formed from the 7 face-up cards, up to a 7 Card Straight Flush, which pays a progressive on a max credit bet. This progressive is separate from the main game's Royal Tie progressive.</p>Math<p>In this version, the main game has a house advantage of approximately 1.88% and the bonus game has a house advantage of 2.787%. The main has a volatility index (or standard deviation) of approximately 2.756.</p><p>For more information on the math of the game, please reference my simulation and Excel sheet for this game's math: https://gunnar-clovis.itch.io/bandito-poker-math-simulation</p>Patent Warning\r\n<p>This demo of Bandito Poker has been released for purposes of demonstration, fun, and education. Any attempts to replicate the game without official licensing rights will be prosecuted to the fullest extent of the law.</p>\n<p>In layman's terms: just look at this for fun and educational interest! Don't steal the game and try to sell it to IGT as your own IP or <em>very </em>bad things will happen to you. I very much doubt anyone who would be viewing this page would ever do that, but I just want to be formally clear. I do not have any legal requirement to give this warning; if anyone tried to claim the patented material or copyrighted IP as their own, they would be heavily sued for patent fraud or similar regardless of any warnings given or not like this. I'm just letting you know this pertains to patented material and is serious, so it's not ground for cloning.</p>", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-03-13T04:50:59", "background_image": "https://media.rawg.io/media/screenshots/439/43976834027e155f6806a93c854c8738.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gunnar Clovis"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}