{"id": 419176, "slug": "just-flip-the-demo-web", "name": "Just Flip - The Demo (Web)", "name_original": "Just Flip - The Demo (Web)", "description": "Just Flip - The Demo (Web)\r\n\n<p><strong>Prefer to play downloadable PC version? - https://jeffweber.itch.io/just-flip-demo</strong></p>\n<p><strong>TIPS:</strong></p>\n<ul><li>Land on your feet!</li><li>Control your flip in the air by tucking (to spin faster) and untucking (to spin slower)</li><li>In the air you have rotational inertia, you need to get a feel for this and untuck a little before the landing.</li><li>It will take practice. It's like learning to ride a bike. It feels almost impossible at first, but slowly things get easier. </li></ul>\n<p><strong><em>NOTE: This demo is a small taste of the game to come.  Please enjoy and let me know what you think in the comments below or with the in-game feedback form.</em></strong></p>\n<p>Hey everyone, my name is Jeff Weber. I've been making physics games in my spare time for over 10 years. Just Flip is my latest and greatest!</p>\n<p>Like all my physics games, it gets to the point quick with minimal fluff and nonsense.<br/><br/>Launch yourself, parkour style, over a single massive mountain <em>(Note: this demo is just a small portion of the full mountain) </em>full of steep cliffs, ski slopes, and interesting obstacles. Flip, Ski, Fall down, rage, get up, keep flipping!<br/><br/>The controls in Just Flip are simple in concept, but require some practice to get a feel for the inertia of the flip. The launch and flip mechanic has been honed, tweaked, and iterated-on for over a year to make it smooth and satisfying.<br/>Just pull down and back sling-shot style anywhere on the screen and release to launch. Once in the air, mouse down to crouch or release to extend. Stick the landing and repeat.<br/><br/>Inspired by the world of 'Getting Over It with Bennet Foddy', Just Flip consists of a single large continuous mountain of stuff to flip and ski over. You will not be artificially teleported back to the start if you fail to stick a landing, you will simply get back up and keep flipping. Of course, if you fail to stick the landing in the wrong place, gravity might have a say in where you end up.<br/></p>\n<p>If you enjoy 'Just Flip', please consider wishlisting on Steam. It really helps.</p>\n<p>-Jeff</p>", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-03-13T04:48:43", "background_image": "https://media.rawg.io/media/screenshots/e51/e51e9919039872e1d21a8308e269a95d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JeffWeber"], "genres": ["Action"], "publishers": [], "esrb_rating": null}