{"id": 419206, "slug": "monster-garden-itch-never_k", "name": "Monster Garden (itch) (never_k)", "name_original": "Monster Garden (itch) (never_k)", "description": "<p><strong>Monster Garden</strong></p>\n<p>Pets in roguelikes are cool. What if the whole game was just pets?</p>\n<p>Haha, just kidding...</p>\n<p>...unless?</p>\n<p>The Stakes:</p>\n<ul><li>The player can't attack directly.</li><li>The player will be killed in one hit.</li><li>Collect 16 distinct monsters in the monster-catching-ball and return to the starting area to win.</li></ul>\n<p>How to Play: </p>\n<ul><li>Spawn tamed monsters near wild monsters to attack and defeat them.</li><li>Careful though, you don't control them. They go where they want.</li><li>Click the ball in the lower left, a monster, then a space on the map to spawn a monster.</li><li>Click a tamed monster and \"RECALL\" to bring them back into the ball.</li><li>Wild monsters with low health can be captured in the same way.</li><li>When tamed monsters do damage to wild monsters, tamed monsters in the ball gain health.</li><li>Click a traversable space on the map to walk there. This cannot be cancelled.</li><li>Click the player to wait a turn.</li></ul>\n<p>Monster Melee:</p>\n<ul><li>Click a monster to see a description.</li><li>The vital stats of tamed monsters can be seen.</li><li>The vital stats of wild monsters will be obscured.</li><li>Each monster has a size, speed, and one of five types.</li><li>The attacks of monsters with larger size do more damage.</li><li>The attacks of monsters with higher speed succeed more frequently.</li><li>Each monster type is strong against one other type and weak against a different type.</li><li>The sizes, speeds, and types of monsters will be the same every game.</li><li>Which types are strong and weak against each other will change every game.</li></ul>\n<p>Pro Tips:</p>\n<ul><li>Use the player to bait monsters out into the open, but don't get them too close.</li><li>Cycle tamed monsters in and out of the ball to keep them healthy.</li><li>Watch for attacks that are particularly effective, or ineffective, to work out which types are strong and weak against which other types.</li><li>If you exit and reenter the garden, different monsters will repopulate.</li><li>You need 16 different monsters to win, so if you have duplicates in the ball they're expendable (😬gulp... 😰yikes! 😱)</li></ul>\n<p>Special thanks to Pokefans.net, for the tileset and spritesheets.</p>\n<p>https://fanart.pokefans.net/</p>\n\n<p>NOTE:</p>\n<p>Updated 2020-03-09 to fix a game breaking RNG bug.</p><p>Updated 2020-03-12 to fix a game breaking \"undefined type\" bug.<br/></p>", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-03-13T04:58:41", "background_image": "https://media.rawg.io/media/screenshots/067/067b597925ff1e4711e3482fdfe20b86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["never_k"], "genres": [], "publishers": [], "esrb_rating": null}