{"id": 419266, "slug": "99-anime-girls", "name": "99 Anime Girls", "name_original": "99 Anime Girls", "description": "Princess Infinity and her dark legion have attacked and destroyed planet Earth. 26 years prior to the onslaught an unwitting hero is born with the power to stop her. Rescue the 99, defeat princess Infinity and save Earth once and for all in this action-adventure game featuring cute anime girls, cunning adversaries and exciting surprises.<br/><br/>99 Anime Girls - Key Game Features<br/><br/>- Clear <strong>99+ action-packed platform levels</strong> to rescue each and every girl<br/>- Defeat cunning adversaries in <strong>battles and mini-games</strong><br/>- <strong>Chat to the girls</strong> to uncover secrets about them and progress the story<br/>- Collect gold, gems, potions and equipment to help you on your quest<br/>- Discover <strong>secret areas, story arcs and events</strong> by exploring fearlessly and conversing wisely<br/>- Compete in \"marathon mode\" to claim fame in the global rankings with a super fast <strong>speed run</strong><br/><br/>99 Anime Girls - A Personal Message from the Developer<br/><br/>Thank you for considering my game. 99 Anime Girls is an indie game that I've spent 2 and a half years working on. I've always wanted to make games and now, finally, I'm excited to bring it to you. You'll find a mix of old-school platform jumping, cute characters and simple mini-games inspired by my time in Japan as well as a unique quirkiness that only comes with indie freedom. 99 Anime Girls is finally complete and all of the levels are done! Are you ready for an adventure? What are you waiting for? 99 Anime Girls is available now!<br/><br/>99 Anime Girls - PC Version Notes<br/><br/>- The game is designed for 9:16 portrait, if you're running landscape you'll get black boxes on the sides, meh it doesn't really matter, the game play is all there but for best results rotate your monitor and set your display settings to portrait mode.<br/>- The game is playable with mouse and keyboard. In addition there is xbox controller support for the main platform levels.<br/>- The main characters will run automatically. You control the other moves such as jump, double jump etc.<br/>- <strong>The game starts off easy, but trust me, it does get harder!</strong><br/>- There are 25 Steam achievements to collect in addition to 36 in-game achievements!<br/>- This is the PC port. The mobile version has ads and a one time unlock fee whereas the PC version has an extra life mini-game, no ads and no unlock fee.<br/><br/>99 Anime Girls - Controls<br/><br/>Jump: space bar, x, s, right arrow, mouse button or xbox controller button (A, B or X)<br/>Jump (Ichika): space bar, z, a, down arrow, mouse button or xbox controller button (A, B or X)<br/>Battle, Attack: left mouse button<br/>Battle, Block: hold right mouse button or left click and hold shield icon<br/>Go Back or Quit: Esc or xbox controller Y button<br/>Retry platform level after death: Space, return or press xbox controller A button<br/><br/>Notes: 2 player co-op is possible on some of the late game levels. Gopher360 (a separate xbox controller application) is not supported.<br/><br/><br/><br/>What are you waiting for?! Let's play! Aw!<br/><br/>", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2023-11-05T22:51:13", "background_image": "https://media.rawg.io/media/screenshots/76d/76d57e5e70dda66aedcb2b9e9247d336.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["99animegirls", "Tsuki Hikari Games"], "genres": ["Action", "Adventure", "Casual", "Indie", "Platformer"], "publishers": ["Tsuki Hikari Games"], "esrb_rating": null}