{"id": 419304, "slug": "motorsport-manager-online", "name": "Motorsport Manager Online", "name_original": "Motorsport Manager Online", "description": "WE RECOMMEND PLAYING ON iPHONE 7 (&amp; UP) OR iPAD PRO AND IPAD (5TH GENERATION).<br/>iPHONE 6 MAY EXPERIENCE PROBLEMS.<br/><br/>Motorsport Manager Online takes the acclaimed race team strategy game online for the first time.<br/><br/>Create your very own motorsport team by hiring drivers and designing car parts, then compete against real managers from around the world in simultaneous 10 person multiplayer races.<br/><br/>Can you make it to the World Motorsport Championship, where the top players compete every week to be the best Motorsport Manager in the world?<br/><br/>Some of the world’s top drivers (including Jean Eric Vergne and Sebastian Buemi) and legendary motorsport brands (such as Porsche, Mercedes and Audi) are available for the very first time in a Motorsport Manager game!<br/><br/>MULTIPLAYER<br/>Take on the world in thrilling 10 player online multiplayer races.<br/><br/>FORMULA E<br/>Every 2019-20 Formula E driver is available to hire in the game, and the iconic Formula E Gen2 Car is free to use in races!<br/><br/>3D RACING ACTION<br/>Zoom in to see the intense wheel to wheel action, with your cars and liveries rendered on track in 3D.<br/><br/>THE COMPETITION NEVER STOPS<br/>With Global and Friends Leaderboards, come back every week to check your ranking and collect new rewards.", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2020-03-16T01:50:39", "background_image": "https://media.rawg.io/media/screenshots/0c7/0c7168b0a2c19a007c18910ca0ff4208_gvxrENx.jpg", "website": "http://www.motorsportmanager.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Playsport Games"], "genres": ["Sports", "Racing"], "publishers": ["Playsport Games"], "esrb_rating": "Everyone 10+"}