{"id": 419330, "slug": "mystery-trackers-paxton-creek-avengers-a-mystery-2", "name": "Mystery Trackers: Paxton Creek Avengers - A Mystery Hidden Object Game (Full)", "name_original": "Mystery Trackers: Paxton Creek Avengers - A Mystery Hidden Object Game (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>A mysterious figure called the Paxton Creek Avenger has kidnapped your commander’s daughter and is terrorizing a theater full of innocent people. Apparently, they blame the Mystery Trackers organization for all of the woes of society, and intend to take retribution on their sons and daughters. There’s no way you’ll let that happen on your watch, so the hunt is on!<br/><br/>• WHAT IS THIS EVIL MASTERMIND’S TRUE MOTIVATION?<br/>What’s with the disguise, and why kidnap a harmless young girl? You must use all of your deductive skills to get to the bottom of this case or it’ll be lights out on the Mystery Trackers!<br/><br/>• USE YOUR THERMAL SCOPE TO TRACK DOWN THE BAD GUYS<br/>Your handy new gadget will aid you in solving cryptic hidden object scenes.<br/> <br/>• CRACK THE CASE WITH YOUR LITTLE FRIEND ELF!<br/>Once again, your trusty sidekick is there to help decipher fabulous puzzles and mystifying mini-games.<br/><br/>• SAVE THE FILM CREW IN THE BONUS CHAPTER<br/>Return to the theater in another adventure and enjoy additional Collector’s Edition exclusives including collectible Orchestra Musicians, special achievements, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2020-03-16T02:02:05", "background_image": "https://media.rawg.io/media/screenshots/ef1/ef158b0115ad474d83465c7a5aec31e7_KpVE4pz.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}