{"id": 419317, "slug": "overdox", "name": "OVERDOX", "name_original": "OVERDOX", "description": "▶ Action-Packed Real-Time Combat!<br/>- Feel the rush of competition as you face off against foes in real-time!<br/>- Use skill shots, dodge, and parry! Only the fastest and most skillful will reap the glory of battle!<br/><br/>▶ Endless Fun with Various Game Modes<br/>- Which of the 12 gladiators will emerge from the arena victorious?!<br/>  Compete against players from all over the world in an exhilarating battle royale match!<br/>- Duke it out with your friends in Friendly Mode to see who's best!<br/><br/>▶ Sneaky but Deadly!<br/>- Be wary of your surroundings! Track opponents down to catch them off guard!<br/>- Flash, Toxic Mist, Entrap... Acquire various unique skills from the battlefield to unleash them on your opponents!<br/><br/>▶ Take Your Pick! Wide Variety of Weapons Ready!<br/>- Pick the weapon that suits you best from the ultimate weapon collection!<br/>- Upgrade your weapon and use the Weapon Skill to eliminate all opponents!<br/><br/>▶ Your Very Own Stylish Gear!<br/>- Collect and upgrade gear pieces that specialize in Attack, Defense, Speed, or Stamina!<br/>- East meets West! Complete gear sets grant special set effects!<br/><br/>※ Use of illegal programs, modified apps, and other unauthorized methods to access the game may result in service restrictions, removal of game accounts and data, claims for compensation of damages, and other remedies deemed necessary under the Terms of Service.<br/><br/>[ Official Community ] <br/>- Facebook: https://www.facebook.com/OverdoxOfficial<br/><br/>*Game Inquiry: support@overdox.zendesk.com <br/><br/>* Although it is free to play, this game contains optional in-app purchases that may incur additional charges. Please note that refund of in-app purchases may be limited depending on circumstance.<br/>* For our usage policy (including refunds &amp; termination of service), please read the Terms of Service available in the game.", "metacritic": null, "released": "2019-11-07", "tba": false, "updated": "2020-03-16T01:56:39", "background_image": "https://media.rawg.io/media/screenshots/c39/c3964f068bfa9a9480b6fdeb21385a64_ypqjWb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HAEGIN Co.,Ltd."], "genres": ["Action", "RPG"], "publishers": ["HAEGIN Co.,Ltd."], "esrb_rating": "Teen"}