{"id": 419306, "slug": "soccer-rally-arena", "name": "SOCCER RALLY: ARENA", "name_original": "SOCCER RALLY: ARENA", "description": "THINK YOU HAVE WHAT IT TAKES TO BECOME A LEGEND?<br/><br/>The original and best mobile car football game from 2012, is back and better than ever. Now featuring intense 3v3 car football action, with cross platform online multiplayer!<br/><br/>Designed for mobile, with a top down camera so that you can see all the action and act fast, with easy to master arcade style controls. Soccer Rally: Arena looks simple, but under the hood there is a depth of skills and strategies that need to be mastered on the fly, that will separate highly skilled drivers from the rest. Rev up your engine! Out drive the competition,  boost the ball into the back of the net and get ready for the only car football experience you’ll ever need on mobile.<br/><br/>Gather your friends and team up against the rest of the world with ranked party mode, set up private parties just for fun, or sharpen your skills and do it on your own.<br/><br/>On the road to becoming a Soccer Rally champion, you will unlock awesome cars for your garage. Each with different top speeds, acceleration, boost speeds and unique handing which makes Soccer Rally: Arena easy to pick up but hard to master.<br/><br/>Driver! Are you ready to become a legend?<br/><br/><br/><br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/>In our game we have the following subscription option:<br/><br/>1. A Season Pass which offers a monthly subscription for $4.99. It gives you unlimited fuel and lets you unlock cars, emojis and nitros marked Premium in the Season Pass, when you have earned enough XP (experience points) to do so.<br/><br/> <br/><br/>End of trial and subscription renewal<br/><br/> <br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/><br/> Payment will be charged to iTunes Account at confirmation of purchase.<br/><br/><br/> Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/><br/> Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/><br/> Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/><br/> Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/> <br/><br/>If you end your subscription, you keep any of the cars, emojis and nitros you have unlocked to that point.<br/><br/> <br/><br/>Cancelling trial or subscription<br/><br/><br/> <br/> <br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be cancelled. After your subscription expires, you will no longer have unlimited fuel,or be able to unlock cars, emojis or nitros marked as Premium. However, any cars, emojis or nitros you have unlocked while your subscription was active will remain yours.<br/><br/><br/> If you have any questions or comments, feel free to contact us at contact@lavaskull.com<br/><br/><br/> <br/> <br/><br/>Privacy Policy: https://www.lavaskull.com/privacy<br/><br/>Terms of Use: https://www.lavaskull.com/termsofuse<br/><br/>Subscription Policy: http://www.lavaskull.com/subscription", "metacritic": null, "released": "2020-03-06", "tba": false, "updated": "2020-03-16T01:51:42", "background_image": "https://media.rawg.io/media/screenshots/fd5/fd509ab617988740e90164bc0e741c46_ev2cZ0Z.jpg", "website": "http://www.lavaskull.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LAVA SKULL"], "genres": ["Sports", "Racing"], "publishers": ["LAVA SKULL"], "esrb_rating": "Everyone 10+"}