{"id": 419484, "slug": "zeta-wolf-chronicles", "name": "Zeta Wolf Chronicles", "name_original": "Zeta Wolf Chronicles", "description": "<ul><li><strong>Genre</strong>: Visual Novel, BxG, Romance, Slice of Life, Comedy, Psychological, Fantasy</li><li><strong>WARNINGS</strong>: May depict depression-prone characters, but nothing extreme. </li><li><strong>Rating</strong>: 13+  </li><li>Developer: AniClash Studios</li></ul>\n<p><strong>Zeta Wolf Chronicles is a romance, drama-heavy, BxG visual novel currently in development. We're currently in Alpha stage, gradually acquiring time/funds for additional assets. </strong><strong>Our Kickstarter is planned sometime next year. </strong><br/></p>\n<p>Unique to Zeta Wolf Chronicles are the perspective theme and the primary focus on internal communication. With <strong>insight points</strong> (point and click gameplay) you can temporarily gain the perspective of the inner thoughts of a certain character. Later with <strong>reflection points</strong>, you can trigger additional thoughts from Rayen, and be faced with choosing between either when they appear simultaneously. This can make each playthrough unique, with your choices altering the flow of the story. </p>\n<p>Much care was spent in planning Zeta Wolf's story and overall plot. Realism was a central focus, and having believable character interactions and romance timelines. A large portion of our background and setting are inspired by real-life events.  </p>\n<p>While or demo is just the tip of the iceberg, we wanted a story that could inspire and educate others in the world of romance. As our demo portrays, <strong>being a guy in a similar situation as Rayen, is no easy task</strong>. It's important to us that we can show rather than tell, how Rayen navigates his individual situation with girls－under extreme desperation and anxiety.  </p>\n<p>As such, our project lead <strong>Zanthos</strong> set out to create a visual novel<strong> </strong>different from many eroge/BxG of today. Where the path to the heroine－and your girlfriend, is believable, logical and rooted in realism.  </p>\r\nDemo Features\r\n<ul><li><strong>~90</strong> <strong>Minutes</strong> of Gameplay</li><li>Over <strong>14k</strong> Word Script</li><li>Partial Voiced: <strong>~4k</strong> Words Spoken Dialogue</li><li>Multiple Choices and Endings</li></ul>\n<p>Thank you so much for visiting our page and trying our demo! </p>\r\nSupport us?\r\n<p>We're currently working on our assets for the next build and our eventual Kickstarter for next year. Want to throw us a bone to speed up the process? Consider donating today! Your kindness is much appreciated, and if you donate more than $5, your name will be listed immediately in our credits for the next build. </p>\r\nContact Us\r\n<p>If you need any help with getting the game running, want to reach out, or for general inquires, please contact our staff at aniclashstudios@gmail.com</p>\r\nContent Creation/Press\r\n<p>If you'd like to stream or record video content of our demo, we'd love to hear about it! Just send us a DM (@AniClashStudios) or email us at the address above! Thank you! You'll definitely get a shout out.  </p>\n<p>Likewise, if you'd like to write about our game, we have provided a small presskit-lite with some promotional materials. Our options will be expanded greater next year once we prepare more assets. </p>\n<p>Download Press Kit</p>\r\nSurvey/Bug Reporting\r\n<p>Finished playing through our demo? We'd love to hear your feedback! Just click on the button below to be taken to a <strong>brief questionnaire</strong>.</p>\n<p>Additionally, if you encounter any unusual bugs within the game, consider taking the time to report them (also through the button below). Thank you! </p>\n\n\r\nCast\r\n<ul><li>Shane Sheffey (Zanthos) - <strong>Project Lead/Programmer/Writer</strong></li><li>Leticia Varela Paz - <strong>Assistant Lead</strong></li><li>PhamChau Studio - <strong>Lead Artist/CG/BG/Character Design</strong></li><li>Re.Alice Works - <strong>GUI / Interface Design</strong></li><li> Keiraworks - <strong>Additional Background Art </strong></li><li>Red Robotix - <strong>Original Music / Composer</strong></li><li>Rene Breitbarth - <strong>Additional Music</strong></li><li>Rachi Sills - <strong>Rayen Lycon</strong></li><li>Lauren A. Mayfield - <strong>Siona Rufus</strong></li><li>Dottovu -<strong> Lyca/???</strong></li><li>Amber Bray - <strong>Hima Crass</strong></li></ul>\n\n\n\r\nFuture Developments\r\n<ul><li><strong>3</strong> New Characters will be introduced in 2020. 1 of these is based on our twitter raffle winner</li><li><strong>Spanish Translation</strong> on next major build</li><li>Expanded <strong>Glossary</strong> and <strong>Backlog </strong>Menus</li><li><strong>Hub Based Gameplay</strong> (Choose Interactions and Dialogue with Meter)</li><li><strong>MAC Build</strong> - Once adequate testing is performed </li></ul>", "metacritic": null, "released": "2020-03-15", "tba": false, "updated": "2020-03-16T02:35:50", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a958ae28911b248c07c30c22f7eb1fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["AniClashStudios"], "genres": [], "publishers": [], "esrb_rating": null}