{"id": 419670, "slug": "heisenbergs-uncertain-pinball", "name": "Heisenberg's Uncertain Pinball", "name_original": "Heisenberg's Uncertain Pinball", "description": "<p>In this psychedelic particle-based pinball game, you control the bumpers with your eyebrows. You can toggle between two views of the pinball playfield: either see the motion of the pinball and its collisions but not know exactly where the pinball is, or see a still screen of where everything is but not see any motion.<br/><br/>I made this game during Pirate Jam 2020 (#PirateJam2020), where the theme was \"Uncertainty\". <strong>Follow along with the Pirate Jam videos</strong> to see the behind-the-scenes action of Pirate Jam, which takes place in the Andaman Sea south of Thailand, on a fleet of sailboats.<br/></p>\n<p>Heisenberg's Uncertainty Principle, is a quantum mechanics principle that asserts that the position and velocity of a particle cannot both be measured exactly, even in theory. So in this version of pinball, you can either see the motion and collisions of the pinball, or the position of the pinball, but not both at the same time.</p>\n<p>Also of uncertainty is EYEBROWS. They are somewhat hard to control, and you don't necessarily know where they are unless you see yourself in a mirror. This game has a webcam-based eyebrow tracking system that lets you control the pinball bumpers by raising your eyebrows.</p>\n<p><strong>Webcam Eyebrow-Based Controls:</strong> Face the web-cam and raise your eyebrows to raise the bumpers or to launch the pinball.<br/></p>\n<p>The accuracy of the web-cam based eyebrow tracking system depends heavily on the lighting, your face, glasses, and the strength/color of your eyebrows. If the system is having trouble tracking your face, then please use better lighting, remove your glasses, tape some dark-colored tape to your eyebrows, and remove other faces that might be in the view of the camera.</p>\n<p>During the game, you can also go into the still mode (press space to toggle) to see how the webcam is tracking your eyebrows.<br/></p>\n<p><strong>Traditional Controls: </strong>You can play this game without a webcam. Just use the Z and X keys for the left and right bumpers.<br/></p>\n<p><strong>Interesting fact: </strong>I originally made a physical alt-ctrl eyebrow-based controller that you wear on your head that tracks your eyebrow, but I was unable to get it to stay steady on the head, so in the final few hours of the game jam, I integrated the OpenCV facial recognition library to track the eyebrows through the webcam.</p>\n<p>Here are some funny videos/photos of the old physical eyebrow-based controller, and of players playing the game using the webcam-based eyebrow controller: <strong>Google Photos Album</strong><br/></p>\n\n<p><strong>Special thanks</strong> to Jerry Belich (@j3rrytron on Twitter) for help with making the physical alt-ctrl version of the eyebrow tracker!</p>\n\n<p>Also, thank you to the Pirate Jam sponsors: @unity3d @kenneyNL @devolverdigital @codeofthevoid @americanmcgee @TVPaint_Anim @LandfallGames</p>\n<p><strong>Tools Used: </strong>Unity game engine, GarageBand to make the music, Audacity for more audio editing, Blender for 3D modeling</p>\n<p><strong>Libraries</strong> <strong>Used</strong>: Reaktion for audio reactive animation, OpenCV for facial tracking<br/></p>", "metacritic": null, "released": "2020-03-14", "tba": false, "updated": "2020-03-16T03:22:42", "background_image": "https://media.rawg.io/media/screenshots/4e7/4e7a4b4805b731513f4eed2d158921dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["andyman404"], "genres": ["Action"], "publishers": [], "esrb_rating": null}