{"id": 4197, "slug": "absolute-supercars", "name": "Absolute Supercars", "name_original": "Absolute Supercars", "description": "Over 40 of the finest supercars the world has ever seen.<br/>A whopping 16 racers going flat out on the track at any one time online and LAN.<br/>Over 20 tracks, from favorites such as Silverstone and Nürburgring to less well known greats such as Mugello Italy.<br/>Fully featured Career, Arcade and Tournament modes.<br/>Top Gear and 5th Gear’s Tiff Needell recorded voice overs, including tutorials for 16 of the toughest tracks in the game.<br/>Dynamic AI: rival drivers will get better or worse depending on how you race so you’ll always have a decent challenge going on around you. Of course, should you wish to have consistent AI you can switch this mode off. Drivers will also have their own battles with or without your influence and will make mistakes even if they’re half a lap ahead or behind you.<br/>Featuring Aston Martin, Ferrari, McLaren, Bugatti, Pagani and more!<br/>Hundreds of paint schemes to choose from, with advanced car livery customization.<br/>Full gaming wheel support.<br/><br/>The definitive collection of supercars!<br/><br/><br/>1 player<br/>2MB minimum save size<br/>HDTV screen resolution: 720p, 1080i, 1080p<br/>DUALSHOCK®3<br/>Network Features<br/>Network Players 2-16<br/><br/>  Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.<br/><br/>2011 System 3 Ltd. Published under license by Eutechnyx Limited. All rights reserved.", "metacritic": null, "released": "2012-11-06", "tba": false, "updated": "2019-08-02T16:23:45", "background_image": "https://media.rawg.io/media/screenshots/be9/be931640168683103bd12ce352d7d85f.jpg", "website": "http://www.facebook.com/AbsoluteSuperCars", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 35, "ratings_count": 1, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 3"], "developers": ["Eutechnyx"], "genres": ["Racing"], "publishers": ["Eutechnyx"], "esrb_rating": "Everyone 10+"}