{"id": 419886, "slug": "contamination-senjinsama", "name": "Contamination (Senjinsama)", "name_original": "Contamination (Senjinsama)", "description": "<p>Petit jeu réalisé dans le cadre de la GameJam de mars 2020 de Gamecodeur, sur le thème \"Contamination\".</p>\n<p>Ce jeu se joue à la souris. 10 patients de différentes couleurs (différentes maladies) doivent être soignés à l'aide de la piqûre que vous avez en main, et les fioles comprenant les antidotes : Chaque couleur correspond à sa maladie (bouteille verte avec le patient vert, le rouge avec le rouge...).</p>\n<p>Il suffit juste de cliquer sur la bonne bouteille et de cliquer sur le patient correspondant à la couleur.</p>\n<p>Vous avez 10 secondes avant qu'ils ne meurent. Vous avez gagné si le nombre de personnes soignées est supérieurs au nombre de morts.</p>\n<p>Je n'ai aps eu le etmps de terminer ce que je voulais faire à l'origine. La 4eme bouteille est destiné au port du masque que je voulais mettre en place lorsque le patient est soigné. Si celui-ci ne porte pas de masque, il peut de nouveau être contaminé lorsqu'il est proche d'un malade (ce n'est pas géré actuellement). Mais vous pouvez appliquer un masque su une personne saine, ça changera le sprite.</p>\n<p>je voulais aussi augmenter la difficulté au fur et à mesure, mais j'ai mal géré mon temps.</p>\n<p>Je suis tout de même content d'avoir produit quelque chose, car je souhaite, dorénavant, produire systématiquement quelque chose à chaque GameJam.</p>\n<p>pour info, codé en lua (love2d) en une 15 d'heures.</p>\n<p>Bon jeu !</p>", "metacritic": null, "released": "2020-03-12", "tba": false, "updated": "2020-03-16T04:13:54", "background_image": "https://media.rawg.io/media/screenshots/1c9/1c9f99b7277cc34e48fa0711530cf33d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Senjinsama"], "genres": [], "publishers": [], "esrb_rating": null}