{"id": 419950, "slug": "trickster-cards", "name": "Trickster Cards", "name_original": "Trickster Cards", "description": "“Great graphics. Challenging. Totally frustrating when I don't win! That tells me it's good.”<br/><br/>Cards Online, Your Way<br/><br/>Let the fun begin. Play the games you love with friends and family or get matched with other live players at your level. Trickster Cards offers customizable rules, so you can play cards your way!<br/><br/>• Fast-paced, competitive and fun — for free!<br/>• Get matched by skill to other live players <br/>• Video chat with friends and family<br/>• Use your favorite house rules<br/>• Apps available across devices and stores<br/><br/>Real People, Right Now<br/><br/>Select “Play” and Trickster Cards finds other players based on skill and speed. Get started without waiting — other players join as they’re ready. After the game, “Play Again” keeps you playing with the same group.<br/><br/>Friends and Family Included<br/><br/>Play together — even when you’re apart. Select “Join” and Trickster Cards helps you invite friends and family to a game. Turn on notifications to hear about friends’ games anytime. Now game night lives on wherever you are.<br/><br/>Your House, Your Rules<br/><br/>Enjoy Spades, Euchre, Pitch, Hearts, Bid Whist, 500, Pinochle, Oh Hell, or Bridge. Trickster Cards supports them all with customizable rules to play the way you want to play.<br/><br/>Play Across Devices<br/><br/>Have an iPhone, but your friends don’t? No problem. Trickster Cards works on more devices so you and your friends can play where you want, when you want, with whom you want. Great on phones, tablets, laptops and desktops!<br/><br/>Fast and Friendly Chat<br/><br/>Express reactions quickly using chat presets. Focus on the game without the distraction of off-topic comments. Then socialize with full chat after the game. Or set up a private game with friends to use full chat anytime — even add live video chat!<br/><br/>What Players are Saying<br/><br/>“Best Euchre game I’ve found.”<br/><br/>“The best multiplayer Hearts game if you want to play with friends.”<br/><br/>“I think I’ve tried every 10-point Pitch game available. This one is my favorite! Best looking, best gameplay, best price.”<br/> <br/>“I’ve tried them all and this is hands-down the best multiplayer Spades app.”", "metacritic": null, "released": "2015-04-19", "tba": false, "updated": "2020-03-20T01:56:05", "background_image": "https://media.rawg.io/media/screenshots/a6b/a6b0f997f3b53af49375e4d2c8455012_aWR8TzG.jpg", "website": "https://www.trickstercards.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Trickster Cards"], "genres": ["Card"], "publishers": ["Trickster Cards"], "esrb_rating": "Mature"}