{"id": 41991, "slug": "futuridium-ep", "name": "Futuridium EP", "name_original": "Futuridium EP", "description": "Get a trip back to the 80s' with the insanely fast, insanely difficult action of Futuridium EP!<br/><br/>Futuridium EP is a retro fast paced shoot’em up with a modern twist, amazing 3D graphic and an adrenaline pumping 45 minutes original soundtrack.<br/><br/>You are a lone starship pilot who get lost in a dimensional loop just before a battle: with a limited and constantly depleting energy bar your only hope is to fly as fast as possible over enormous space dreadnoughts and destroy all the cyan power cubes, replenishing your energy tank and revealing the ship’s power core, which must be destroyed to move to the next ship.<br/><br/>- No special powers, no bonuses: only the player reflexes count. Your ship, your lasers, your ability!<br/>- You can stop and turn your ship 180° at any time, just pressing a button!<br/>- No speed control: you always fly as fast as possible...<br/><br/>Game features:<br/><br/>- 13 levels<br/>- 11 original music tracks, for a 45 minutes original soundtrack. You can skip them in games like a jukebox.<br/>- A new energy based gameplay mechanic<br/>- 4 different gameplay speed, unlockable finishing the game. The game can get crazy fast...<br/>- 4 different graphic skins<br/>- Peculiar graphic style, full of colours and glithy full screen special effects<br/>- Full GameCenter support, with online leaderboards and achievements<br/>- A credit system: destroy cubes to get in game credits to continue and other goodies<br/>- Ragequit button: a useful feature when the game becomes too hard!<br/>- Cool easter eggs!<br/><br/>The game is hard, and while the keyboard is supported it's a lot better played with a joypad.<br/><br/>What the press says: <br/><br/>\"Piloting a nimble one-man fighter craft and taking on a fleet of epic armed-to-the-teeth alien dreadnoughts has never been so much fun.\" - indiegames.com<br/><br/>\"An amazing debut from an exciting new indie studio, and as a free download it is completely essential.\" - rgcd.co.uk<br/><br/>\"Fun as hell, and I can’t stop playing. Seriously, somebody help me.\" - indiestatik.com", "metacritic": null, "released": "2013-01-05", "tba": false, "updated": "2019-10-22T14:38:27", "background_image": "https://media.rawg.io/media/screenshots/489/489c12a3154ea4d464fb13d50959d62d.jpg", "website": "http://www.futuridium.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["MixedBag"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["MixedBag"], "esrb_rating": "Everyone 10+"}