{"id": 419964, "slug": "cooking-voyage-kitchen-dash", "name": "Cooking Voyage: Kitchen Dash", "name_original": "Cooking Voyage: Kitchen Dash", "description": "The best kitchen &amp; time management &amp; design game in 2020! Cook tasty food with tons of recipes like a star chef! <br/><br/>Do you like to play fast-paced cooking games?<br/>Do you have a craze of time management games?<br/>Are you excited about driving your own superyacht around the world to build your own restaurant empire？<br/><br/>If you answered \"YES\", you should check out this addictive time management cooking game Cooking Voyage - Crazy Chef's Restaurant Dash Game! New FREE fun cooking simulator game in 2020!  The cooking joys and adventures await!<br/><br/>Cook like a mad top star chef with the highest cooking fever and madness ever! Show off your cooking craze as you prepare, cook and serve tasty meals in each exotic restaurants all over the world to build your own restaurant empire. Control the fast-paced chaos as you dash your way around the kitchen, serve fast to crazy picky customers. Sharpening your cooking skills is not enough though, spending your earnings on upgrades for food and appliance for your restaurant to be a five star one! You are destined for fabulous chef mega fame!<br/><br/>Did we say you will own a super megayacht? Board your own megayacht to begin your worldwide journey! Visit famous cities and unlock the most famous landmarks! Discover different food cultures and cook various cuisines with tons of ingredients in distinctive restaurants. The journey will never be bored while you could give your megayacht a complete makeover! Decorate your bedroom, kitchen, hall and other rooms in just the way you want! Explore your creativity with hundreds of design options and create your dream megayacht!<br/><br/>Features<br/><br/>● COOK massive tasty cuisines and recipes with hundreds of ingredients<br/><br/>● EXPAND your restaurant empire with distinct restaurants in different cities<br/><br/>● TRAVEL to explore amazing food cuisines  around the world<br/><br/>● A SUPER MEGAYACHT to discover for new rooms and minigames<br/><br/>● RENOVATE and DESIGN what your own megayacht looks like<br/><br/>● BUILD LANDMARKS in each city map with your progression<br/><br/>● UPGRADE your kitchen and ingredients for premium dishes<br/><br/>● TAP to PLAY over 500+ levels and more to come<br/><br/>● CREATE COMBOS to earn extra coins<br/><br/>● SERVE  a variety of cute customers<br/><br/>● PLAY OFFLINE<br/><br/>Download for FREE and join the adventures of Cooking Voyage!<br/><br/>Enjoying Cooking Voyage? Learn more about the game!<br/><br/>Questions? Contact our Tech Support by sending an email to support@newvoy.com.", "metacritic": null, "released": "2020-03-14", "tba": false, "updated": "2020-03-20T02:02:06", "background_image": "https://media.rawg.io/media/screenshots/e3a/e3a8c0e613c0cac6c584eb393d0ae0c3_fZTLWap.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Newvoy Games"], "genres": ["Strategy", "Casual"], "publishers": ["Newvoy Games"], "esrb_rating": "Everyone 10+"}