{"id": 419960, "slug": "optiflight", "name": "OptiFlight", "name_original": "OptiFlight", "description": "Step into the world of airline route planning, where your goal is to create a flight network to guide passengers to their destinations in a limited amount of time. You get to call the shots on which routes to draw and which cities to designate as hubs that best serve each scenario. The flight maps you design will also need to be efficient and flexible to accommodate for events that may occur, like airport rushes and closures, as its effects ripple throughout your network. With over 80 geographically and historically themed levels to play, each map you make will be put to the test.<br/><br/>MAIN FEATURES<br/>- Take a step back in time and create flight maps for past historical scenarios, like the 1849 California Gold Rush and the 2012 London Olympic Games<br/>- Prepare for the future and create flight maps in realistic inclement weather simulation, including Hurricanes and Blizzards<br/>- Understand the present and create flight maps using actual cities, like New York City and Istanbul, to reflect real flight patterns<br/><br/>FAN-FAVORITE LEVELS<br/>Vote for your favorite level in the Preferences page<br/>Contiguous US:<br/>  ① Big Game (Level 36)<br/>  ② Sustain (Level 38)<br/>  ③ Apollo (Level 7)<br/>Europe:<br/>  ① Sustain (Level 38)<br/>  ② High Speed (Level 16)<br/>  ③ Physica (Level 20)<br/><br/>OTHER FEATURES<br/>- Play 80+ levels across multiple maps like America and Europe<br/>- Analyze in-game statistics to help fine-tune your flight map<br/>- Speed up or slow down the game to your comfort<br/>- Compete for the top spot on worldwide leaderboards<br/>- Simplistic interface and experience<br/>- No ads<br/><br/>FUTURE FEATURES<br/>- More maps!<br/>- More levels!<br/>- More cities!", "metacritic": null, "released": "2020-03-18", "tba": false, "updated": "2020-03-20T02:00:32", "background_image": "https://media.rawg.io/media/screenshots/6d2/6d26261378b958668a6d03818f5d5a4c_SsitZ0u.jpg", "website": "https://www.krishsuchdev.com/OptiFlight", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Krish Suchdev"], "genres": ["Strategy", "Simulation"], "publishers": ["Krish Suchdev"], "esrb_rating": "Everyone 10+"}