{"id": 41992, "slug": "milmo", "name": "MilMo", "name_original": "MilMo", "description": "<strong>Exciting action gameplay with crazy monsters and cool bosses!</strong><br/>Run, jump and fight your way through an amazing and ever unfolding island world. Find hidden Exploration Tokens to assemble powerful new items and weapons. Uncover a deep, intricate storyline filled with epic quest and amazing secrets.<br/><br/><strong>Design your own awesome hero avatar</strong><br/>How would you create a superhero? In MilMo you can choose from tons of cool clothes, armors, haircuts, accessories and limitless color combos to design your unique avatar. Be creative and let your imagination run wild!<br/><br/><strong>Collect power ups and unlock impressive titles and rewards</strong><br/>When you collect MilMos different powerups you can run faster, jump higher, hit harder, swim further and pack more punches! You can also unlock different titles and rewards by earning hundreds of medals for exploring, fighting, questing, hunting animals, digging and much more!<br/><br/><strong>Design and furnish your home</strong><br/>In MilMo you get your own house which you can design and furnish however you like! The shop offers all kinds of tables, chairs, beds, wallpapers, ornaments and other stuff you need to create your perfect home. You can also visit other players houses and vote for the ones you like best. If you get many votes for your home you can appear on the top list which shows the ten houses with the most votes.", "metacritic": null, "released": "2013-12-31", "tba": false, "updated": "2019-07-25T19:02:20", "background_image": "https://media.rawg.io/media/screenshots/3b6/3b6e557f26d07eed5d78de143d7a3722.jpg", "website": "http://www.milmogame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 96, "ratings_count": 2, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Dohi Entertainment", "Dohi Sweden"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Dohi Sweden", "Dohi Entertainment"], "esrb_rating": null}