{"id": 42, "slug": "what-remains-of-edith-finch", "name": "What Remains of Edith Finch", "name_original": "What Remains of Edith Finch", "description": "<p>The Finch&#39;s family, also known as &quot;America&#39;s most unfortunate family&quot;, believes that the family is being pursued by a deadly curse. Each generation has only one child who survived to give birth to the next one.</p>\n<p>The player begins to act as Edith Finch, who arrives in an orderly abandoned family mansion to find out what opens the key that she received from her mother along with the will. Of course, she is most interested in the question of the family curse, or more precisely, whether she will become a victim of it. In any case, all the relatives known to her, even on American soil, died an unnatural death. Exploring the house, she opens the rooms of each deceased relative. And plunges into the circumstances of premature death of everyone.</p>\n<p>Life (and death) of each of the deceased relatives Edith the hero resides in the image of this relative.<br />\nThe essence of the game is to clarify the circumstances of the death of many members of the same family in order to see behind these deaths and biographies something common and native. It is interesting to dive not only in different human images, but also act in the guise of birds or animals.<br />\nIn addition to following Edith, the game has something to inspect, search, discover and solve, play mini-games.</p>", "metacritic": 89, "released": "2017-04-23", "tba": false, "updated": "2024-04-18T21:19:29", "background_image": "https://media.rawg.io/media/games/34e/34e100b1f648de99f32d477065f04653.jpg", "website": "http://edithfinch.com/", "rating": 4.39, "rating_top": 5, "added_by_status": {"yet": 404, "owned": 3262, "beaten": 1977, "toplay": 448, "dropped": 100, "playing": 45}, "playtime": 3, "achievements_count": 55, "ratings_count": 1939, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 1965, "platforms": ["Xbox One", "iOS", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["Annapurna Interactive", "Giant Sparrow"], "genres": ["Adventure", "Indie"], "publishers": ["Annapurna Interactive"], "esrb_rating": "Teen"}