{"id": 420204, "slug": "flower-snatcher", "name": "Flower Snatcher", "name_original": "Flower Snatcher", "description": "<p>Flower Snatcher is a 2d survival game. You are a little robot who must survive from the evil weed plants trying to eat your metal because they are upset (but happy?) of you stealing their flowers. Each flower has their own set amount of coins. Rack up as much points as you can. <br/></p>\n<p>Post a screenshot if you think you have a high score!</p>\n<p>This is a game jam game for the Harvest Mouse Jam. The theme was \"Spring,\" and because of my lack of experience in game dev and in programming, I wanted it to be very simple. I asked my wife what ideas fall in to \"Spring\" and so she came up with picking flowers.</p>\n<p>NOTE: there's a couple of bugs that I am aware of. One, all objects instantiates randomly around the map but they sometimes end up spawning in walls. I couldn't figure it out for the life of me. Two, the enemies get destroyed when colliding on the walls. They are supposed to call an animation before they disappear. I'm sure there's couple of more that I am unaware of. If you find anything, please let me know!</p>\n<p>Music by Josh Kashdan. www.kashdanmusic.com </p>\n<ol><li>Instagram - Kashdan Music</li><li>Twitter - Kashdan Music</li></ol>\n<p>Sound FX from OpenGameArt.org.</p>\n<p>Programming, Pixel Art, and Animations  by Sleeping Daemon.</p>\n<p>Thank you all for playing the game. Any feedback is always appreciated. </p>\n<p>And to many more jams! This was fun and also a wake up call.<br/></p>", "metacritic": null, "released": "2020-03-18", "tba": false, "updated": "2020-03-20T03:03:21", "background_image": "https://media.rawg.io/media/screenshots/767/767713b90daedba753a903013654818d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Sleeping Daemon"], "genres": [], "publishers": [], "esrb_rating": null}