{"id": 420285, "slug": "smut-dungeons-snuggle-bundle", "name": "Smut Dungeons: Snuggle Bundle", "name_original": "Smut Dungeons: Snuggle Bundle", "description": "<p>The Smut Dungeons Snuggle Bundle is a collection of erotic fantasy text adventures containing interactive love-making scenes.<br />\nThese interactive text sext adventures are for ADULTS ONLY (18+). Try not to rip your dick off.<br />\nThe Adventures:<br />\nDesert Wind: The heat of the desert is wild and oppressive. As you venture through the sandy wastes, you come across an oasis. Stopping for a drink and a quick dip, you soon find that you&#39;re not alone... and you quickly find yourself in the hot embrace of a bronze-skinned god.<br />\nNaughty Nymphs: After a hard day of travel, you find yourself in a hidden grove surrounded by beautiful woodland nymphs. They have a request to make of you... will you fulfill their desires?<br />\nPalace of Pleasures: The Palace of Pleasures is a place where you can fulfill all of your desires. In a world ravaged by disease, the pristine palace is a place to go to escape reality for a while and enjoy the small (or big) things in life.<br />\nPools of Wonder: After a stressful week at work, you have decided to take a little vacation. On the outskirts of the village lies a hidden grotto filled with magical, rejuvenating pools. You pack a few things and leave the village early in the morning, hoping to find peace and quiet for a while. What you find is more than you were expecting...<br />\nSamurai&#39;s Kiss: After a morning of sweaty exercise you decide to bathe in the river. I wonder if anyone will join you?<br />\nPlay more Smut Dungeons here.</p>", "metacritic": null, "released": "2020-03-18", "tba": false, "updated": "2022-07-04T12:26:45", "background_image": "https://media.rawg.io/media/games/3bf/3bf7600d87a34a2a449a6e5f22e08857.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["smutdungeons"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}