{"id": 420356, "slug": "heroes-and-monsters-1-from-the-abyss", "name": "Heroes and Monsters 1 From the Abyss", "name_original": "Heroes and Monsters 1 From the Abyss", "description": "<p>Hey everyone!</p>\n<p>I'm a wannabe indie game developer, and I've been working hard on my new game Heroes and Monsters 1 From the Abyss.</p>\n<p>It was inspired by a really old game called \"Ogre Battle 64\". It's a 3D, real-time, strategy, adventure, single-player game. It was built from scratch using desktop java, openGL, and openAL.</p>\n<p>The game currently has a single campaign. The story is based on a big brother named Matt, and his little sister Chanty. They live in a magical world, which is an empty Abyss, until gifted individuals, called dreamers, create the contents of the world with their minds.</p>\n<p>The game starts on an otherwise ordinary day, when Chanty and Matt go outside alone for the first time against their parents wishes. Chanty then discovers her true powers and summons a massive world into being. Matt, being the responsible big brother that he is, takes it on himself to bring Chanty home before things get out of control.</p>\n<p>But, chanty really doesn't want to go home, so she summons a castle and locks herself inside. She also summons monsters to defend it. Matt must defeat the monsters and capture the castle in order to bring his sister home. Along the way various friends and even strangers join the rescue party to bring chanty home.</p>\n<p>The game spans a total of 8 missions, with more planned for the future. There is approximately 5 hours of gameplay including 20 to 30 minutes of 3D stories. The stories are hilarious and include several well built </p>\n<p>Play Instructions:<br/>(1) Download the gave via the link<br/>(2) Extract the file (it is .rar filetype)<br/>(3) Run engine.Jar<br/>(4) If it fails to start, install the latest java runtime environment and try again<br/>(5) If it still doesn't start, let me know, and I'll see what I can do</p>\n<p>The game is completely free to download and play. I do however accept donations, but I would much rather prefer feedback right now.</p>\n<p>Thanks for your support.</p>", "metacritic": null, "released": "2020-03-18", "tba": false, "updated": "2020-03-20T03:37:19", "background_image": "https://media.rawg.io/media/screenshots/dcd/dcd2b2aba029070ded30d3bd2addde1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wargamechampion"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}