{"id": 420346, "slug": "mano-fico", "name": "Mano Fico", "name_original": "Mano Fico", "description": "<p><strong>Mano Fico</strong> is an environment design project I worked on in the second year of my  game development program.  It's a very short walking simulator where the player must collect 3 keys to open a gate, and then exit the level.</p>\n<p>Due to the project being exclusively about environment design, most of the scripts used in the project were provided by my professors at the time. It was a pretty entertaining project overall, and I've decided to upload a build of the game here as a portfolio piece of sorts. <br/></p>\n<p>It's worth noting that this game may experience issues. It was built using the then experimental <em>Lightweight Render Pipeline </em>in Unity. This pipeline has since been merged into the new standard pipeline, but I haven't ported the game over into that. From what I can tell, Unity's occlusion culling feature didn't exactly behave well when working with the <em>LWRP</em>. The uploaded build is the most reliable version of the game, so it shouldn't be an issue, but just keep that in mind.<br/></p>\n<p>I'm not too much of a 3D artist, so I opted to go for a more oil or acrylic paint visual style to get this looking decent.</p>\n<p>Also, the reason the file size for this project is so high, is because there are an absurd amount of high resolution light maps. During the actual project, I compensated for the art style by focusing heavily on lighting.<br/><br/>This project is not being developed further and is entirely <em>free</em> for people check out.</p>\n<p><strong>3D assets were created using a student license of 3DSmax.</strong><br/></p>", "metacritic": null, "released": "2020-03-18", "tba": false, "updated": "2020-03-20T03:34:59", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0cdd2ae15575097aa32c960d053d22b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TurretCorruption"], "genres": [], "publishers": [], "esrb_rating": null}