{"id": 420422, "slug": "digitalpandas", "name": "DigitalPandas", "name_original": "DigitalPandas", "description": "<p><strong>Fiction</strong></p>\n<p>Such a long time ago, when the history itself did not exist, there was a mystic mountain where lived many Pandas. Those Pandas lived peacefully and undiscovered by other animals, and they devoted their whole lives into the bamboo plantation. However, as not everything can go as they wish for, their secret was known by other animals at last. The precious bamboo caught every single one’s attention, and the animals around the bottom of the mountain decided to march against and raid the Pandas. A heroic warrior realizes their dangerous situation, and he decides to protect his ethnic. With many years spent in the mountains, he has learned every short cut and advantage place. He lured and trapped his enemies on their way climbing the mountain, and even make them fight each other for the control of bamboo.</p>\n<p><strong>Style</strong></p>\n<p>We want to have a balance between a strategy game and a casual game. We want to  have some cute elements to show the fights to avoid violent scenes. With playful style music makes players feel relax and have fun. </p>\n<p>Sound link: https://drive.google.com/file/d/1QZTJhltfiU8vSaQX0jaVraQxMtSeO9fg/view?usp=sharing </p>\n<p><strong>Core mechanics</strong></p>\n<p>A Tower Defense strategy game with immovable defensive items over the maze-like maps. Players will control the hero panda to utilize the environments and skills accordingly to defeat their enemies. By changing the terrain to change enemies’ offensive routes, (For example, a player can move a wall to let enemy go another path.) player can defeat enemies by taking advantage of the immovable defensive items or try to let the enemies with different factions fight with each other. At the end of the game, if the base still exist, players clear the map and move forward to the next stage.</p>\n<p> <strong>Ideal Players</strong></p>\n<p>\tFor players over 8 years old, and it may contain light violence.  Players who want to play casual games to spend some time, but also want to enjoy the process of a strategy game. The experienced tower defense players should find this game interesting, since it contains a controllable character, fixed defensive items and moveable map objects, which would bring some new ideas to them.</p>", "metacritic": null, "released": "2020-03-17", "tba": false, "updated": "2020-03-20T03:55:12", "background_image": "https://media.rawg.io/media/screenshots/8d1/8d133bcbd668edde574ed08d5328fdb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jzhao40"], "genres": ["Action", "Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}