{"id": 420516, "slug": "red-ship-scarlet-shot", "name": "Red Ship: Scarlet Shot", "name_original": "Red Ship: Scarlet Shot", "description": "<p>Ahoy there!</p>\n<p>This was the last game I made using Scratch before switching to unity. As a result it represents the pinnacle of what I was able to achieve there.</p>\n\n<p>Red Ship: Scarlet Shot is a vertically scrolling bullet hell shoot-em-up. It takes inspiration from series such as Dodonpachi and Touhou, as well as some of my earlier games.</p>\n<p>You can play it just fine here but here's the link to the original project if you want to go there: https://scratch.mit.edu/projects/321054207/</p>\n\n<p>I'd recommend playing in full screen.</p>\n<p>Controls:</p>\n<p>Arrow Keys: Move your ship (also, select ship on title screen)</p>\n<p>[Z] :  fire your weapon</p>\n<p>[X] : focus (slow your ship down and compress your fire)</p>\n<p>[C] or [Space] : release a screen-clearing bomb. Your bomb will be spread out or focused depending on whether or not you are holding the [X] key.</p>\n<p>[P] : reset the game and return to the title screen</p>\n<p>Scoring:</p><p>Destroy enemies to raise the multiplier and gain some score. Graze enemy bullets to gain more score. Bullets will continue to give score as long as your ship is in range, so hug tight clusters of bullets for major pointage! You will recieve a bonus for no-missing a stage, as well as lives and bombs remaining at the end of the game.</p>\n<p>Enjoy!</p>\n\n<p>The game was made by me using Scratch.</p>\n<p>The music is by soundcloud user Cosmosys (https://soundcloud.com/cosmosys).</p>", "metacritic": null, "released": "2020-03-17", "tba": false, "updated": "2020-03-20T04:17:58", "background_image": "https://media.rawg.io/media/screenshots/c68/c68c19b2632cfc0e611a01c5792c60dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kraken Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}