{"id": 420596, "slug": "dont-open-covid-outside", "name": "Don't Open. COVID Outside", "name_original": "Don't Open. COVID Outside", "description": "Don't Open. COVID Outside\r\n<p>Made for the Quarantine Jam 2020.</p>\n<p>This is a 2D pixel art top-down bullet hell arcade videogame in which you play as a medic who has found the cure for the COVID-19 and has to give it to the infected people without getting infected himself.</p>\n<p>You can find the Source Code of this game on GitLab!<br/></p>\r\n\r\n#<strong>Don't</strong>StayAtHome!\r\n<p>While everyone is locked on quarantine, a rogue medical researcher has found the cure to the fiendish virus. But there's no healthy human left to give the cure. No military, no politician, no one. Only him with the cure.</p>\n<p>He has no other choice than to go outside and face the virus by himself. But he's not immune and he's no hero, so he has to be careful. The virus can spread in two ways: by proximity and by coughing. He can't go near the infected, so how will he spread the cure?</p>\r\n\r\nTake your weapon, face your fear\r\n<p>As the only scientist left, of course he has to be a genius. He managed to take a rifle and adapt it so that it can shoot syringes filled with the cure for the disease. This way, he just have to literally shoot the medicine to the infected to heal them, without any need of going near them. But he still has to be carefull: their breath is infected too.</p>\n<p>Avoid the infected coughs, don't come near the infected and kill the virus for good, once and for all, a syringe at a time.</p>\r\n\r\nInstructions\r\n<p>Move the character using the WASD Keys, aim with the mouse and shoot with its left button. Pay attention at your syringes: you can't carry too much of them.</p>\n<p>Don't worry, though, for some reason the infected people appear to leave behind useful stuff once you heal them.</p>\r\n\r\nMask filter\r\n<p>Of course, as a medic you have access to a professional filtered mask. It can actually prevent you from getting infected. But there's a catch: the filters don't last forever. Every hit you hit you get will damage the used filter until it will become useless. The filter can take up to two hits, the third an last one will infect you. But don't worry! Of course you can <em>still</em> find new filters around! I'm pretty sure that some of those infected actually got them before getting ill, so maybe if you heal them they will leave them behind for you. Keep an eye on your mask filter condition and be sure to take a new one if it's too damaged.</p>\r\n\r\nSyringes pack\r\n<p>This is exactly what it seems: a pack of syringes. They're basically your ammunitions, so be sure to get them whenever you see them in the field to reload your rifle. Be careful not to finish them: without your shots you're helpless against the virus.</p>\r\n\r\nCure granades\r\n<p>I understand why you decided that a rifle was better than... <em>this</em>. I mean, maybe it's still a bit too much, but I think that you're some kind of The Walking Dead fanboy, are you? In any case, the rifle wasn't exactly your first choice. The <em>cure granade</em> was. Granades filled with the cure for the virus. And you wanted to bomb the entire world with them. Do you also like Michael Bay, besides The Walking Dead? In any case, you actually crafted them in the end, and though they're not exactly... <em>conventional</em>, they can reaaally come in handy when you're surrounded. If you see one of these granades somehow laying around the battlefield, take them. You can then throw them with the right button on your mouse. They should deal one... <em>heal damage</em> to \"every infected on the screen\". That's what the instructions say anyway. Whatever it means.</p>\n<p>You can carry up to 3 granades at a time.</p>\r\n\r\nDon't take this mission too seriously\r\n<p>This game is made by an italian developer as a parody to try and lower the tension made by the COVID-19 pandemic and the following quarantine. It's not meant to be taken seriously.</p>\n<p>The events depicted in this game are entirely a work of fiction and aren't in any way related to real facts.</p>\r\n\r\nNow some really serious stuff\r\n<p>This game will be published on Itch for the Quarantine Jam. It is going to be completely free to play, no donation required. However, since humanity is facing one of its biggest challenge of the third millennium, I ask you to donate for a charity that is actually fighting the COVID-19. So that we can really win.</p>\n<p>Maybe before there's only one healthy man left, if we're lucky.</p>\n<p>So instead of making a donation to support me, make a donation to support them.</p>\r\n\r\nCredits\r\nDesing and programming<br/>Xecestel\r\n<p>This game contains thirs party assets, such as:</p>\r\n\r\nFonts\r\n<ul><li>\n<strong>Exquisite Corpse</strong> by Chad Savage (Public Domain)</li><li>\n<strong>Alegreya Sans SC Font Family</strong> by Juan Pablo de Peral for Huerta Tipografica (SIL Open Font License (OFL)])</li></ul>\r\n\r\nGraphics\r\n<ul><li>\n<strong>Photo of the doorway</strong> by pxhere.com, modified by Federica Ress (CC0 Universal Public Domain Dedication)</li><li>\n<strong>Roguelike Modern City Pack</strong> by Kenney (CC0 Universal Public Domain Dedication)</li><li>\n<strong>Pixel Guns</strong> by LakeKeta, modified by Xecestel (CC-BY 3.0 Creative Commons Attribution 3.0)</li></ul>\r\n\r\nMusic\r\n<ul><li>\n<strong>Energetic Metal Song</strong> by The Real Monoton Artist (CC0 Creative Commons License)</li><li>\n<strong>Menace</strong> by yd (CC0 Creative Commons License)</li></ul>\n<p>For more information on the licenses, check the README file inside the main directory.<br/></p>", "metacritic": null, "released": "2020-03-16", "tba": false, "updated": "2020-03-20T04:37:14", "background_image": "https://media.rawg.io/media/screenshots/c86/c86f811f47fdfd8a69d04d1a47fc9747.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Xecestel"], "genres": ["Action"], "publishers": [], "esrb_rating": null}