{"id": 4207, "slug": "when-vikings-attack", "name": "When Vikings Attack!", "name_original": "When Vikings Attack!", "description": "Compatible with PlayStation®Vita and PlayStation®3.<br/><br/>Buy this product for PlayStation®Vita and get the PlayStation®3 version FOR FREE. After purchasing, simply head to the PlayStation®Store “Download List” for your PS3™ and you’ll find this product ready to be downloaded.<br/><br/>Overview<br/>A scary battalion of mischievous Vikings has suddenly invaded Britain – over a thousand years too late.<br/><br/>The silly things may have forgotten their weapons, but they are still itching for a fight. <br/><br/>Control gangs of civilians to pick up and throw whatever you can find at your foes – from road signs, to post boxes and vehicles. Be warned: the Vikings have the same plan so the art of dodging is just as important as having a good aim.<br/><br/>Defend farms, fairgrounds, building sites and more from your enemies and then take on your friends in truly frenzied multiplayer battles.<br/><br/>Features<br/>•\tPlay alongside up to three friends on PS3™ or PS Vita via Cross-play.<br/>•\tThrash your friends in fast, frantic and funny multiplayer battles.<br/>•\tCarry on playing wherever you are with Cross-save: start your game on PS3™ and then continue your adventures on PS Vita, or vice-versa.<br/><br/>Important Notices<br/>•\tGameplay requires PlayStation®Vita memory card (sold separately).<br/>•\tVisit eu.playstation.com to find out more about When Vikings Attack™ and the exciting world of PlayStation®Network.<br/>•\tYou can read this title’s instruction manual via its LiveArea™ – just select the question mark icon.<br/><br/>Compatibility Notices:<br/><br/><br/>1 Player 650MB Minimum Space Required Microphone Dual Analog Sticks Network Players 2-4 Network Features PS3™ Cross-play PS3™ Cross-save Requires the PSVita and PS3 system versions of the software (may be sold separately).<br/><br/>Some functions and features may not be available on PlayStation TV.<br/><br/>1 player(s)<br/>100KB Minimum<br/><br/>  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.<br/><br/>(c)2012 Sony Computer Entertainment Europe. Developed by Clever Beans.  When Vikings Attack! is a trademark of Sony Computer Entertainment Europe.", "metacritic": null, "released": "2012-11-06", "tba": false, "updated": "2024-03-10T18:36:29", "background_image": "https://media.rawg.io/media/screenshots/46f/46f5d8a8aae5b01cbed2963f2ab451ab.jpg", "website": "", "rating": 2.58, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 292, "beaten": 12, "dropped": 23}, "playtime": 0, "achievements_count": 19, "ratings_count": 40, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 40, "platforms": ["PlayStation 3", "PS Vita"], "developers": ["Sony Interactive Entertainment", "Clever Beans", "XDev Studios"], "genres": ["Action"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Everyone 10+"}