{"id": 420835, "slug": "gooberries-itch", "name": "Gooberries (itch)", "name_original": "Gooberries (itch)", "description": "<p>Gooberries is in <strong>BETA</strong>. Looking forward to your feedback. I've still got a lot of work to do to get everything feeling as good as it can so please go easy on me :) Keep up to date with my devlog videos on Youtube.</p>\n<p>Grow and harvest different plants for every season and don't forget to raise some critters too! This semi futuristic farming sim will keep you busy for hours growing crops and customizing your garden.</p>\n<p>But don't leave all the work up to yourself. If you can prove yourself as a sufficient gardener you'll be able to take some of the workload off with helper bots and machines. A fully automated garden is every green thumb's secret fantasy after all! </p>\n<p>Gooberries is currently in <strong>BETA</strong>. Early Access release is TBD. The games core loop is completely however and can be played for hours. What i'm currently working on is simply adding more things to the game and finishing building out the world.</p>\n<p> Player feedback is so important to me. Please consider sharing your experience with the game in the Discord channel. Ideas are always welcome as I continue to build towards the full release, but bug finding is also HUGELY important. Please report any bugs on the Discord.<br/></p>\n<p>I post update videos on YouTube when I add new things to the game.</p>\n<p>To be part of the community and share your feedback, join the Discord.<br/><br/></p>", "metacritic": null, "released": "2020-03-16", "tba": false, "updated": "2020-03-20T05:35:37", "background_image": "https://media.rawg.io/media/screenshots/e10/e100e1893cf5d59e98dc7ca693bd07be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MashPatch"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}