{"id": 420999, "slug": "sins-raid-3d-fantasy-arpg", "name": "Sins Raid - 3D Fantasy ARPG", "name_original": "Sins Raid - 3D Fantasy ARPG", "description": "The Most Innovative ARPG is here!<br/>Begin your journey as the Heroes of Light!<br/><br/>[The Ultimate RPG Experience]<br/>Sins Raid brings back the boss fights, the MMO Holy Trinity class archetypes and the co-op raids of your favorite titles, transforming them into the ultimate mobile MMORPG experience. Take command of your Heroes and battle the evil that plagues the land of Sins Raid. <br/><br/>Can you stand the might of the Seven Sins?<br/><br/>Key Features<br/><br/>[Creative Character Design and customization]<br/>An RPG is only as good as the characters you play! Select from an amalgamation of carefully designed heroes with powerful unique skill sets, complete with character style, team role, lore, and everything. Customize them with skins and runes of your choosing to create your very own team.<br/><br/>[Diverse Combat System]<br/>Breaking the shackles of horizontal turn-based combat, Sins Raid offers a whole new 3D mobile battle experience in real-time. No two boss fights are the same and must be countered by following specific instructions, some even interacting with the environment! Strategic thinking, quick fingers and a creative mind for improvisation are all demanded to triumph over the Seven Sins.<br/><br/>[Intuitive Control Scheme]<br/>Ever thought you could control multiple characters in your team at once?<br/>Utilizing a 3D control mechanic that just makes sense for the mobile platform, Sins Raid perfectly translates the thrilling experience of pc/console gameplay onto your phone. Perform difficult maneuvers such as dodging boss skills or unleash powerful skill combinations in an instant, while truly experiencing raids on your fingertips!<br/><br/>[All for One, One for All]<br/>This is a game where both multiplayer and single-player coexists. No social pressure, play it solo, co-op with friends, or join a Guild to meet players worldwide. This is your game, your playstyle. Play however you want, with whoever you want.<br/><br/>Now, let the real challenge begin!<br/><br/><br/><br/>Don’t forget to follow our Official Accounts:<br/><br/>Discord: discord.gg/3tuk4A7<br/><br/>Facebook: facebook.com/SinsRaid/<br/><br/>Instagram: instagram.com/sinsraid<br/><br/>Twitter: twitter.com/SinsRaid<br/><br/>Pinterest: pinterest.co.uk/sinsraid/", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-03-23T02:01:28", "background_image": "https://media.rawg.io/media/screenshots/661/661987543dbcaa92c7e5d9e3ce734afc_2J8ZVP2.jpg", "website": "https://www.facebook.com/SinsRaid/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CUBE MAGIC"], "genres": ["Action", "RPG"], "publishers": ["CUBE MAGIC"], "esrb_rating": "Teen"}