{"id": 421010, "slug": "byebye-monster", "name": "ByeBye Monster", "name_original": "ByeBye Monster", "description": "The Dark Lord robbed the kingdom's only princess. <br/>Defeat powerful enemies to save the princess.<br/>In battle, we learn powerful skills to resist the enemy's constant attack and challenge a variety of monsters with different skill combinations.<br/>Simple interface style, simple gameplay operation, give players a very easy gameplay experience.<br/>There will never be the same level experience, different styles of game scenes, a rich variety of monsters and organs, and a variety of powerful BOSS.<br/><br/>Game features:<br/>1.\tOne-handed games, You can conquer the whole game world with one hand.<br/>2.\tYou can learn hundreds of skill, and a rich combination of skill can challenge a variety of powerful enemies.<br/>3.\tChallenge endless game levels, hundreds of unique monsters and powerful bosses.<br/>4.\tFree exploration game levels bring a new gaming experience.<br/>5.\tA powerful weapon helps the magician fight better.<br/>6.\tUnique pets can help heroes challenge various difficulties.<br/><br/>Subscription options<br/><br/>We have the following subscription period in our game:<br/>Subscribe Membership offers monthly subscription for $6.99 which provides  bonus double,one more skill per game, free revive for 1 time, 20 diamonds reward with daily login.<br/>End of trial and subscription renewal This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication,where applicable.<br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/>If you have any questions or comments, feel free to contact us at griffongames@163.com<br/>Privacy Policy: https://zqac.hengtingab.com/static/privacy.html<br/>Terms of Services  : https://zqac.hengtingab.com/static/disclaimer.html", "metacritic": null, "released": "2020-02-24", "tba": false, "updated": "2020-03-23T02:05:46", "background_image": "https://media.rawg.io/media/screenshots/de5/de52abcaee2f5a36e0c4a34b9b71a61a_zoZUTBg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["香港边游网络技术有限公司"], "genres": ["Action", "Adventure"], "publishers": ["BIANYOU"], "esrb_rating": "Everyone 10+"}