{"id": 421007, "slug": "companion-for-ac-new-horizons", "name": "Companion for AC New Horizons", "name_original": "Companion for AC New Horizons", "description": "Excited for the release of AC New Horizons? Want a companion app to get ready for the game? Here's one to keep in your pocket! Use \"Companion for AC New Horizons\" to keep up on the latest news on the new game. You can also find a countdown to release day, detailed information on bugs, fish, villagers, and even upcoming recipes.<br/><br/>Keep tuned as new data on wildlife and items will be slowly added in after the game is released!<br/><br/>FEATURING:<br/>- Keep your very own companion app in your pocket, just like in the upcoming game!<br/>- Stay up to date with the latest New Horizons game news in the News section<br/>- Count down the days until the game's release in the Countdown section<br/>- Learn all the new crafting recipes that will appear in New Horizons<br/>- Learn when to catch all the bugs and fish, and keep track of what you've already caught<br/>- Get detailed information on any villager that currently exists and favorite them to keep track of which ones live in your village so you can easily check their birthday or their favorite coffee<br/>- Receive notifications on the birthdays of your favorite villagers<br/>- Receive notifications to remind you if there is an event going on<br/>- Create your own custom notifications<br/>- Keep a to-do list in a notepad<br/><br/>The \"Companion for AC New Horizons\" app and the developer are not affiliated with Nintendo Co. Ltd. in any way. The Animal Crossing franchise and its characters are the property of Nintendo.", "metacritic": null, "released": "2020-01-31", "tba": false, "updated": "2020-03-23T02:04:26", "background_image": "https://media.rawg.io/media/screenshots/82e/82ea4aa959ac54b9b8cc8245b9c55e9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Paul Serb"], "genres": ["RPG", "Simulation"], "publishers": ["Paul Serb"], "esrb_rating": "Everyone 10+"}