{"id": 421229, "slug": "notaviralgame", "name": "notaviralgame", "name_original": "notaviralgame", "description": "The game: notaviralgame\r\n<p>This game was made for the Trijam#62 game jam which theme was <em>Viral Infection</em>. We didn’t want the COVID19 interpretation of it so we figured we’d do a game revolving around a computer viral infection. </p>\n<p>And so we started our first ever game jam. The plan was to have computer nodes spread around the screen that would form a net. The idea was that the player would be a hacker trying to create their botnet.</p>\n<p>For this the gameplay goes as follow:</p>\n<ul>\n<li>the players clicks on a node to infect it</li>\n<li>the more infected neighbors there are the greatest the chance to succeed the infection!</li>\n<li>if the infection fails the link between the two nodes has a chance to blacklist the attacking node (this should have blacklisted it also for links that had proxies but we ended up running out of time)</li>\n<li>the goal of the game is to infect as many nodes as possible</li>\n</ul>\n<p>This was a really simple idea in our heads when we set out to do it. However neither of us had any experience with game jams and now realize we spent more time on polishing some unessential aspects than actually implementing gameplay. This taught us a lot and we both had a lot of fun doing it!</p>\n<p>We hope you’ll have fun playing the game!</p>\n<p><em>NB: there is no actual game to speak of, just circles to click</em></p>\r\nInstallation\r\n<p>At this time we do not offer pre-built binaries for the game. If you wish to play it you will need to make sure you have:</p>\n<ul>\n<li>python (&gt;=3.7)</li>\n<li>pygame (2.0.0.dev6)</li>\n</ul>\n<p>For this I recommend installing python and then run python -m pip install -r requirements.txt. This should take care of everything. Then you simply need to get into the src folder and run main.py. (ex: python main.py).</p>\n<p>The source can be found on Github</p>\r\nCredits\r\n<p>This game was entirely made by Kadir Aksoy and I (s0lst1ce).</p>\n<p>The music was kindly provided by Kubbi.</p>", "metacritic": null, "released": "2020-03-22", "tba": false, "updated": "2020-03-23T03:01:15", "background_image": "https://media.rawg.io/media/screenshots/eb5/eb53e010f569005ff2ddb3dd9e666603.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["s0lst1ce", "k4dir"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}