{"id": 421661, "slug": "all-ive-got", "name": "All I've Got", "name_original": "All I've Got", "description": "All I've Got\r\n\"He gives me life and I've got nothing to give him.<br/>Nothing, but myself.\"\r\n\n<p>A short interactive fiction about a Sunflower who fell in love with the blinding Sun. </p>\n<p>Press space to advance. Use mouse to drag objects.</p>\n<p>Available in English and Portuguese.<br/></p>\n\n<p><strong>Important:</strong> I've developed this game as a personal exercise to explore Unity and Fungus. There are still a few bugs I couldn't solve, but they're easily avoidable if you refrain from clicking on the screen during text sequences. For a better experience, I'd recommend downloading the executable rather than playing in browser.</p>\n\n\r\nTudo de Mim\r\n\"Ele me dá vida. E eu não tenho nada para lhe oferecer.<br/>Nada, além de mim.\"\r\n\n<p>Uma curta ficção interativa sobre um Girassol que se apaixonou pelo glorioso Sol.</p>\n<p>Aperte espaço para avançar. Use o mouse para arrastar objetos.</p>\n<p>Disponível em português e inglês.</p>\n\n<p><strong>Importante: </strong>Eu desenvolvi este jogo como um exercício pessoal para explorar Unity e Fungus. Ainda restaram alguns erros que não consegui resolver, mas é fácil evitá-los se você não clicar na tela durante sequências de texto. Para uma melhor experiência, eu recomendaria baixar o executável ao invés de jogar no navegador.</p>", "metacritic": null, "released": "2020-03-20", "tba": false, "updated": "2020-03-23T04:41:54", "background_image": "https://media.rawg.io/media/screenshots/e21/e215102e00bdbd2a4c334630b5136a4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["barbaraf"], "genres": [], "publishers": [], "esrb_rating": null}