{"id": 421631, "slug": "rocket-jockey-the-remake", "name": "Rocket Jockey The Remake", "name_original": "Rocket Jockey The Remake", "description": "<p>Greetings Rocketeers!<br/></p>\n<p>Ever since 1996, the release of the original Rocket Jockey game, no one had the opportunity to run, jump, fly, grab, kill, goal and race to their will in a rocket jockey game... NO MORE!<br/></p>\n<p>Here is my take on a remake for the classic.</p>\n<p>New Engine, New Graphics, New Physics but good old Gameplay!</p>\n<p>Features:<br/></p>\n<p>- Run Fly Jump Ragdollize Grab Explode and Goal!</p>\n<p>- Split Screen Gameplay!</p>\n<p>- Upscaled menus.</p>\n<p>- AI, more like AS (Artificial Stupidity) at this point.</p>\n<p>- 2 custom main new levels.</p>\n<p>- Experimental old game level loading.</p>\n<p>Special keys:  </p>\n<p>F1 -Restart the game to the menu</p>\n<p>R - Restart the Level</p>\n<p>Gameplay keys</p>\n<p>WASD + IJKL + M + space (mouse also works but you can't merge ropes)</p>\n\n<p>GamePlay (Wikipedia):<br/></p>\n<p>Players control a \"sled\" (called a cycle in game), which is basically a rocket with small wings for directing the flight and grappling hooks mounted on the sides. These hooks can be fired into pylons, mines, sporting equipment, bodies, and anything else that can be grappled. The grappling hook guns are fixed to shoot out horizontally, 45 degrees to the left and the right of the sled's direction of motion. The player can tap a key to connect the left grapple line to the right one and fly free, leaving a clothesline obstruction for others. Hence, grappling hooks serve a dual purpose: tight turns on stationary objects, and disabling competitors.<br/></p>\n<p>I'm alone in this endeavor however kudos for Joel Garcia from the rocket jockey facebook group for taking the time to convert the old levels to JSON format.</p>", "metacritic": null, "released": "2020-03-20", "tba": false, "updated": "2020-03-23T04:35:33", "background_image": "https://media.rawg.io/media/screenshots/5bc/5bcc4a31763d309b87ae55a33d5bc36a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AwesometonGames"], "genres": ["Action", "Racing", "Fighting"], "publishers": [], "esrb_rating": null}