{"id": 421724, "slug": "trickster-euchre", "name": "Trickster Euchre", "name_original": "Trickster Euchre", "description": "“Best Euchre game I’ve found.”<br/><br/>Free, Live, Social Play – Your Way<br/><br/>Let the fun begin. Play the game you love with friends and family or get matched with other live players at your level. Trickster Euchre offers customizable rules, so you can play Euchre your way!<br/><br/>• Fast-paced, competitive and fun — for free!<br/>• Get matched by skill to other live players <br/>• Invite and play with friends and family<br/>• Use your favorite house rules<br/>• Apps available across devices and stores<br/><br/>Real People, Right Now<br/><br/>Select “Play” and Trickster Euchre finds other players based on skill and speed. Get started without waiting — other players join as they’re ready. After the game, “Play Again” keeps you playing with the same group.<br/><br/>Friends and Family Included<br/><br/>Play together — even when you’re apart. Select “Join” and Trickster Euchre helps you invite friends and family to a game. Turn on notifications to hear about friends’ games anytime. Now game night lives on wherever you are.<br/><br/>Your House, Your Rules<br/><br/>Play Euchre your way with customizable rules. Choose whether or not to stick-the-dealer, play with a Joker, and more.<br/><br/>Play Across Devices<br/><br/>Have an iPhone, but your friends don’t? No problem. Trickster Euchre works on more devices so you and your friends can play where you want, when you want, with whom you want. Great on phones, tablets, laptops and desktops!<br/><br/>Fast and Friendly Chat<br/><br/>Express reactions quickly using chat presets. Focus on the game without the distraction of off-topic comments. Then socialize with full chat after the game. Or set up a private game with friends to use full chat anytime.<br/><br/>What Players are Saying<br/><br/>“I like being able to play Euchre again. It’s something I enjoyed in school but, now live in a part of the country where few people are familiar with the game.”<br/> <br/>“I love how I am able to play with my friends, and I really enjoy the user-friendly interface.”<br/><br/>“Awesome app! So nice to have a quality euchre game on my phone!”<br/> <br/>“Really nice game with great layout and user face. You can play with AI or random users, friends, and even set up games.”<br/><br/>“Easy to see the cards on the screen – that’s important. Also AI plays well and is not idiotic like many Euchre AI’s.”", "metacritic": null, "released": "2014-10-23", "tba": false, "updated": "2020-03-27T01:58:53", "background_image": "https://media.rawg.io/media/screenshots/30f/30f9367cc77a7fb5605cef1740d2daa3_Nro7aaB.jpg", "website": "https://www.trickstercards.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Trickster Cards"], "genres": ["Card"], "publishers": ["Trickster Cards"], "esrb_rating": "Mature"}