{"id": 421754, "slug": "pango-hide-and-seek", "name": "Pango Hide and seek", "name_original": "Pango Hide and seek", "description": "Pango hid himself! Will you find him?<br/><br/>Join Pango and his friends in a funny and entertaining hide-and-seek game.<br/><br/>Search for Pango in more than 15 different worlds that you can explore freely, ranging from the African savanna to the snowy mountains, and including gemstone mines, a haunted manor, outer space and many more...<br/>Pango can hide anywhere; in a tree, behind a rock, on the back of an elephant or under a bed. It’s up to you to find him!<br/><br/>Small items have also been lost in every level: the heart, the clover and the key. Try to find them as well!<br/><br/>All backgrounds are entirely interactive, fitting into the tender and colorful world of Pango with detailed animations and funny sounds.<br/><br/>\"Pango, Hide and Seek\" is an observation and exploration game made for children aged 3 and more, with a progressive difficulty.<br/>No time limit and no competition are involved; children will explore at will, without any stress and with total freedom, discovering characters and exploring backgrounds while having fun.<br/><br/><br/>FEATURES<br/>- Search Pango in a fun hide-and-seek game<br/>- Find hidden bonuses for increased replayability<br/>- An observation and exploration game with total freedom<br/>- No stress, no time limit, no competition<br/>- A progressive difficulty, adapted to young children<br/>- Over 15 fully interactive and colorful levels<br/>- Characters and backgrounds with sounds and animations<br/>- An intuitive and responsive interface<br/>- For ages 3 and up<br/>- Parental controls<br/>- No integrated purchases<br/>- No invasive publicity<br/><br/>REVIEWS:<br/>- TTPM: « There are so many things to discover and explore on each level, and because there is no time limit, kids can take their time to play and enjoy all the silliness that each level brings. »<br/><br/>- 148 Apps: « Pango Hide and Seek is a bright and kinetic game, full of details and animated elements that children will find entertaining. »<br/><br/>- Smart Apps for Kids: « This is an engaging game with fun sounds and animation for children three years and up to click around on. »<br/><br/>- GeeksWithJunior: « Pango Hide and Seek is a delightful game filled with many interesting interactions. Each scene has been cleverly crafted, and is a joy to explore {...}. Multitouch support makes it possible to play the game with friends. »", "metacritic": null, "released": "2014-02-21", "tba": false, "updated": "2020-03-27T02:08:44", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e1c63674b3febcc5bb9836421854f80_joKgKM4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Studio Pango"], "genres": ["Educational", "Puzzle"], "publishers": ["Studio Pango SAS"], "esrb_rating": "Everyone 10+"}