{"id": 421943, "slug": "nantettatte-engine", "name": "Nantettatte Engine", "name_original": "Nantettatte Engine", "description": "<p><strong>NANTETTATTE ENGINE starring ROM²<br/>For TurboGrafx-16 / PC Engine</strong></p>\n<p><strong>Year: 6280AD</strong><br/>In the years following the Great Flush, the HuCOUNCIL decided to preserve all known PC Engine games and hardware in a secret vault within Mt. Fuji.</p>\n<p>They encased the dormant volcano in an air-tight dome and suspended it above the barren, lava filled wastelands that Earth had become.<br/></p>\n<p>The evil Nintendoids and Segatrons were not so lucky. All of their items were lost. In a jealous rage, they have joined forces, intent on destroying the PC Engine vault!<br/></p>\n<p><strong>Year: 198X</strong><br/></p>\n<p>Meanwhile, RomRom, relaxing near the beach, receives a distress signal on her HuPHONE...</p>\n<p>from the HuCOUNCIL in the future!<br/></p>\n<p>She hops in her trusty AE86 and races to the meeting point, greeted by a PC Engine Shuttle fighter-ship!<br/></p>\n<p>The HuDRIVE engages and sends her speeding to the future, so she can save the PC Engine, and the future itself!<br/></p>\n<p><strong>AD6280年</strong></p>\n<p>グレートフラッシュ後HuCOUNCILはすべてのPCエンジンゲームやハードを富士山内の秘密のボールトに保存した。</p>\n<p>彼らは眠っている火山を気密ドームで囲み溶岩で満たされた荒れ地になった地球の上に浮かべた。<br/></p>\n<p>邪悪なニンテンドイドとセガトランたちはそれほど運がよくなく、すべて失ってしまった。<br/></p>\n<p>嫉妬深い怒りの中彼らは力に加わりPCエンジンのボールトを破壊しようとしている！<br/></p>\n<p><strong>198X年</strong><br/></p>\n<p>一方、海辺の資格でリラックスしているRomRomは未来のHuCOUNCILからの遭難信号を彼女のHuPHONEで受け取った！</p>\n<p>彼女は愛用しているAE86に飛び乗り待ち合わせ場所に急ぐとそこにはは<br/></p>\n<p>PCエンジンシャトル戦闘機が待っていた！</p>\n<p>HuDRIVEが稼働しPCエンジンと未来そのものを助けるため彼女を未来へと飛んで行った！<br/></p>\n\n<p><em>Created to celebrate the 30th birthday of the PC Engine, Nantettatte Engine is a simple high score based shooting game.</em></p>\n<p><em>Please download and enjoy it in any emulator, or a real machine using any flashcart!<br/></em></p>\n<p><em>The rules of the game are simple, and may seem familiar to you:<br/></em></p>\n<p><em>Shoot the enemies to gain points. Enemies that reach the ground subtract points.</em></p>\n<p><em>Don't let the dreaded Boing Balls or Watchy Games hit the bottom, or you will receive instant death!</em></p>\n\n<p><em>PCエンジンの30年記念の祝いとして開発されたNantettatte Engineはハイスコアベースのシューターです。</em></p>\n<p><em>ダウンロードし、どのエミューレター、それともフラッシュカート経由で実際のハードウェアを使ってで楽しんでください！ゲームのルールは簡単で、もう慣れていると思います。</em></p>\n<p><em>敵を撃ち落とすとポイントをもらい、地面に敵が到着するとポイントが引かれます。<br/></em></p>\n<p><em>もしBoing Ballsや Watchy Gamesが地面に届いたら一瞬に命がなくなります！</em></p>", "metacritic": null, "released": "2020-03-26", "tba": false, "updated": "2020-03-27T02:55:49", "background_image": "https://media.rawg.io/media/screenshots/d0d/d0d9b7fd9c671a2b6d132db17d7d273c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aetherbyte Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}