{"id": 421917, "slug": "chinatown-detective-agency-alpha-demo", "name": "Chinatown Detective Agency: Alpha Demo", "name_original": "Chinatown Detective Agency: Alpha Demo", "description": "<p>Welcome to Chinatown Detective Agency.</p>\n<p>The world is in a state of flux as the global economy nears the nadir of its decade-long collapse. Singapore stands as a last refuge of order but even here the government struggles on the brink of chaos. Private detectives are now the first call for those citizens able to afford a semblance of justice.</p>\n<p>That’s where you come in. You are Amira Darma, once a rising star at INTERPOL, now a freshly minted Private Investigator in the heart of Chinatown, and your first client is about to walk through your door...</p>\n<p>Inspired by the classic Carmen Sandiego games of the 80s and 90s, Chinatown Detective Agency is a mystery adventure game that will take you across Singapore and the world in hot pursuit of criminals, witnesses and clues. Solve puzzles and uncover leads using real research and investigation, and manage your time and money to solve cases from clients both well-intentioned and nefarious.</p>\n<p>Along the way, untangle a web of conspiracies and plots that threaten to push the Lion City over the edge.</p>\n\n\n\n\n<p><strong>Unravel a global conspiracy</strong><br/>Explore a rich cybernoir future of mystery and intrigue in a world inspired by Blade Runner, The Da Vinci Code and Black Mirror. Travel the globe from your base in Singapore in search of leads, and talk with dozens of uniquely voiced characters each with their own mysterious agendas.</p>\n<p><strong>Work smart</strong><br/>In Chinatown Detective Agency, time is a precious resource. The daily grind of the working Joe is a one-way ticket to fatigue, and tasks have a funny way of taking longer as you tire. Time is money, and the clock is always ticking. It's up to you to make good use of the time you have and to keep your agency, and yourself, alive.</p>\n<p><strong>Assemble a team</strong><br/>You’re new to the PI game, but over time you’re bound to make contacts, build a network, maybe even hire some staff. Alongside investigating cases and solving mysteries you’ll need to keep your business running and your staff happy.</p>\n<p><strong>Lose yourself in the future</strong><br/>Neon lamp-light reflected in pools of rainwater. Anti-government graffiti daubed across aging subways. The encroaching murk of riverside London. Explore 30 stunningly rendered tableaus from artist Ricardo Juchem and immerse yourself in the chaotic future of 2032.</p>\n<p>* * * * * * * *</p>\n<p><strong>PLEASE READ -- IMPORTANT INFORMATION REGARDING KNOWN ALPHA BUILD BUGS AND ISSUES:</strong></p>\n<ul><li><strong>This demo is not supported on ultra-wide displays. Please only play the game on a standard wide screen. Optimal resolution is 1920x1080.</strong></li><li><strong>The opening cinematic cannot currently be skipped - we apologise for this!</strong></li><li><strong>During dialogue, please do not open Settings. Please wait for dialogue to finish before opening Settings.</strong></li><li><strong>When having issues with the Mac demo (\"can't be opened\"), unpack the compressed folder using the free Unarchiver app. </strong></li></ul>\n<p><strong>* * * * * * * *</strong></p>\n<p><strong><br/><em>This is our first publicly released demo for Chinatown Detective Agency. We hope you enjoy it, and we look forward to your feedback. If you enjoyed the game, do wishlist us on Steam!</em></strong><br/></p>", "metacritic": null, "released": "2020-03-26", "tba": false, "updated": "2020-03-27T02:48:41", "background_image": "https://media.rawg.io/media/screenshots/99a/99aab49c78ecafdf0dfe45edf5784ea2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["General Interactive Co."], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}