{"id": 421977, "slug": "terminal-hacker-guardian", "name": "Terminal Hacker Guardian", "name_original": "Terminal Hacker Guardian", "description": "Terminal Hacker Guardian\r\n<p>Welcome to your terminal resident. As you know in 1988 Guardian one of the worlds leading tech and ISP (Internet Service Provider) companies lead by Mr Along Scent detected an incoming asteroid bound for Earth. As the world scrambled for solutions among other companies Guardian invested heavily in vaults to safeguard the future of the human race if impact was unavoidable. These vaults like many databases before the impact are run on Guardian computer systems and servers. </p>\n<p>It is year 2038 and Vault 304 has yet to receive further instructions for over 45+ years since entering isolation and preparing for impact. Several scouting parties have been dispatched in the last two years but none have returned, it is safe to say the world outside must be dangerous and as planned it is time to shut the vault gates and return to isolation. However we no longer have the password....</p>\n<p>-------------------------------------------------------------------------------------------------------<br/></p>\n<p>My own personal quest to uncover the secrets of Unity and c# begun with this simple game. After starting the game typing Menu will always return you to the main menu screen which is very helpful. There are also a few hidden easter eggs within the main menu. \"Help\" is also a useful command to see a very brief overview of your mission and of course the most useful command \"gate\" When you've uncovered enough clues you may be able to guess the password to the vault doors in the gate menu and close the vault doors returning to safety and completing the game. </p>\n<p>Please enjoy! And may the force be with you</p>", "metacritic": null, "released": "2020-03-26", "tba": false, "updated": "2020-03-27T03:03:24", "background_image": "https://media.rawg.io/media/screenshots/1f4/1f42c7243047a61436bf08e465f0b11d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Pirate Chicken Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}