{"id": 422041, "slug": "plady-joy", "name": "Plady Joy", "name_original": "Plady Joy", "description": "<p>A small side-scroller rpg.<br/></p>\n<p>Fight monsters, get money, upgrade yourself, become powerful and have fun!</p>\n\n<p>A log of newly added/changed things:</p>\r\n01.09\r\n<ul><li> Added Redberries and Blueberries, collectable items.</li><li>Added Heal button on the NPC, which costs 10 Redberries and 10 Blueberries.</li><li>Reduced the power and the speed of the first enemy, \"Purple square\".</li><li>Removed the Load Game button.</li><li>Initial HP and MP is 50 each now.</li><li>Replaced \"Moving Speed\" skill with \"Running Speed\".</li><li>Dying will cause you a lose of 20 coins.</li><li>Removed the Inventory due to temporary working on it.</li><li>A status point will give you only 10 MP or HP, instead of 20 initial.</li><li>Changed player's moving speed and added acceleration and deceleration.</li></ul>\r\n03.26\r\n<ul><li>Added new currency: Tokens.</li><li>Added Crypt: Token powered</li><li>Added new feature: Your name is visible under the character now</li><li>Added feature: Name color. 3 free colors and 3 in the Crypt.</li><li>Double Jump and triple coin items are now belong to the Crypt.</li><li>The characters limit for the name is now 12, from 20 initial.</li></ul>\r\n03.27\r\n<ul><li>Added new Crypt item: Mouse Aim</li><li>Changed the price of the tokens: from 100 to 250 each (keep in mind that until the game will be fully out all the currency values will vary)</li><li>Changed the prices for Double Jump and Triple coins, Crypt items.</li><li>Added new name color purchasable via Crypt: White.</li><li>Added the 3 default name colors to the Crypt.</li><li>Changed the User Interface.</li><li>Temporary increased the coin drop and exp for purple square.</li><li>A slightly increase to the purple square power and health.</li><li>Dying will now cause you a lose of 40% of your coins, instead of only 20 coins initially.</li><li>Changed the font style for name, coins, hp, hp, and level.</li><li>Remodeled the area.</li></ul>", "metacritic": null, "released": "2020-03-26", "tba": false, "updated": "2020-03-27T03:17:43", "background_image": "https://media.rawg.io/media/screenshots/d04/d048b364e50cac3dafa52b60823159ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Andreyiy"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}