{"id": 42234, "slug": "tekken-revolution", "name": "Tekken Revolution", "name_original": "Tekken Revolution", "description": "<p>Tekken Revolution is a spin-off installment in the Tekken franchise of fighting games. It was released exclusively for PlayStation 3 and discontinued since 2017. The game was the first in its series to introduce a free-to-play model. It was targeted towards new and casual players.</p>\n<h3>Gameplay</h3>\n<p>The player controls a character and fights other characters, controlled either by AI or by another player, in one-on-one arena battles. Tekken Revolution features 29 characters, but only eight of those are available from the start. The rest have to be unlocked by winning fights or by purchasing. The game introduces only one new playable character, Eliza the vampire. There are the traditional Versus and Arcade Modes in the game. Tekken Revolution also allows both local and online multiplayer. </p>\n<h3>Differences from the previous games</h3>\n<p>The game is heavily based on Tekken Tag Tournament 2 and features some of the character animations and backgrounds from this game. However, Revolution also introduces several new mechanics. There are two new types of moves called Critical Arts and Special Arts. The back walking was also sped up. </p>\n<p>Tekken Revolution was the first game in the franchise to feature skill upgrade and leveling up. Each time the player gains a level, he or she may use four Skill Points to enhance his or her favorite fighter&#39;s Power, Endurance, or Vigor. The player can also purchase them with the in-game currency.</p>", "metacritic": 70, "released": "2013-06-11", "tba": false, "updated": "2023-05-18T21:52:42", "background_image": "https://media.rawg.io/media/games/3c2/3c22f68c6b5b84ce03aebad1122790cd.jpg", "website": "http://tekken-revolution.bngames.net/", "rating": 3.24, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 362, "beaten": 29, "toplay": 7, "dropped": 31, "playing": 1}, "playtime": 2, "achievements_count": 7, "ratings_count": 48, "suggestions_count": 585, "game_series_count": 16, "reviews_count": 49, "platforms": ["PlayStation 3"], "developers": ["Bandai Namco Entertainment"], "genres": ["Arcade", "Fighting"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": "Teen"}