{"id": 422561, "slug": "trouble-in-westwytch", "name": "Trouble in Westwytch", "name_original": "Trouble in Westwytch", "description": "<p><strong>Description:</strong></p>\n<p>Trouble in Westwytch is an action RPG where you fight pumpkins, help villagers and investigate who’s behind the pumpkin curse. The game is made as a standalone demo /prototype which will later serve as a base for a bigger project currently in the planning stage.</p>\n<p>This game will take you to Westwytch – a small, remote village with a problem – pumpkins have risen from fields and are terrorizing the local populace. You take the role of a hero to help out the locals and get clues as to what is behind this unrest.</p>\n<p><strong>A little backstory behind the project:</strong></p>\n<p>This game is my personal learning project as well as my first real release of any game ever. The mindset behind this game was to make something rather than nothing at all since I make games on my free time and there is no guarantee that the larger project I’m planning to make will be finished within a reasonable time frame. The project took me just over a year to make and is a nice first entry in my portfolio.</p>\n<p><strong>Music credits:</strong></p>\n<p>An important part of the game is it's soundtrack. That is why I felt the need to credit the musicians here as well as in the game. All tracks were taken from https://opengameart.org/</p>\n<p>Anyway here's the list:</p>\n<ul><li>Assassin's Assault by HorrorPen</li><li>Dark Forest Theme by cynicmusic (The Cynic Project)</li><li>The God Slaying Shovel by Scrabbit</li><li>Desolate by Matthew Pablo</li><li>Waltz No. I by Kim Lightyear</li><li>Lament for a Warrior's Soul by RandomMind</li><li>King's Feast by RandomMind</li></ul>\n<p><strong>A few last notes:</strong></p>\n<p>Paying for the game is not obligatory but is appreciated. Any money made from this project will go directly back into my next game projects. (Currently I need to upgrade the game engine I use from GameMaker: Studio 1.4. to version 2 so the money will help me achieve it faster).</p>\n<p>If you see any bugs or glitches - contact me and I will try and resolve them as fast as I can.</p>\n<p>Lastly, any feedback on this game is welcomed. I learned everything, from 2D art to programming and game design,  on my own so feedback will help me steer myself in the right direction.</p>", "metacritic": null, "released": "2020-03-23", "tba": false, "updated": "2020-03-27T05:13:59", "background_image": "https://media.rawg.io/media/screenshots/3e1/3e12d3744bc445fefb92a38f7b2b4f25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sir_Raitan"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}