{"id": 422522, "slug": "backyard-pirates", "name": "Backyard Pirates", "name_original": "Backyard Pirates", "description": "<p>Este juego es un proyecto corto que pulimos y lanzamos por Itch, casi a modo de early access, para que puedan jugar en pantalla dividida con algún <strong>compañero de cuarentena</strong> ahora que más que nunca nos encontramos sin saber qué hacer para entretenernos.</p>\n<p><strong>Backyard Pirates</strong> es un juego de <strong>estrategia a tiempo real</strong> en su más básica expresión, de chicos jugando a los <strong>piratas </strong>que tienen que reconstruir su barco con recursos que juntan dejando marineros en islas, para que puedan generarlos.</p>\n<p>La idea es ir agregando contenido, así que no te olvides de dejar tus <strong>comentarios</strong> e ideas abajo!</p>\n<p>                                                                                                                      </p>\n<p>Take an RTS, strip it down to its very core, simplify it even more, add some kids pretending to be pirates trying to finish their pirate ships, and you'll get <strong>Backyard Pirates!</strong></p>\n<p>We polished and released this game jam project now, lacking plenty of features, so you can grab someone you are <strong>quarantining </strong>with, and compete with them in split screen mode. </p>\n<p>To do so, you must draw it with crayons that can be gathered by exchanging them by other resources that your sailors will produce once you leave them at production islands. But do be careful, as they can be bribed with candy, so be sure to also recruit gunners and assign them at outposts to keep an eye out for on the other team.</p>\n<p><strong>Two can play on a single keyboard</strong>, as well as Xbox or PS4 joysticks.</p>\n<p>The idea is to continue to keep improving the game so <strong>leave any feedback </strong>in the comments!</p>\n<p>Some of the future features we are working on include:</p>\n<ul><li>Single player mode vs AI.</li><li>Different maps and new modes.</li><li>Revamped menus, for both looks and functionality.</li><li>Upgradeable island towers.</li><li>A new island type.</li><li>More kids and different colors for each teams.</li><li>Customizable ships.</li><li>Proper audio.</li><li>Several gameplay and graphic tweaks across the entire experience.</li></ul>", "metacritic": null, "released": "2020-03-24", "tba": false, "updated": "2020-03-27T05:05:46", "background_image": "https://media.rawg.io/media/screenshots/a4c/a4c1f24cebee5c124e737ce2a77f308d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cosmic Brew"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}