{"id": 4227, "slug": "dokuro", "name": "Dokuro", "name_original": "Dokuro", "description": "A classical fairy-tale springs to life in this charming, chalk-art puzzle/platformer! <br/>\n<br/>\r\nDokuro puts players in command of a charming little skeleton who is fed up with his master, the Dark Lord, and resolves to rescue a recently kidnapped princess. The princess is blind to the various dangers and pitfalls of the castle and will continue to move forward -- potentially to her doom-- if our hero doesn't do something! Upon coiffing down a magical blue elixir, Dokuro gains the ability to transform into a swashbuckling hero. This noble form allows him to save the day and simultaneously catch the eye of the otherwise unaware princess. <br/>\n<br/>\r\nPush, pull, jump and toggle to solve unique and increasingly difficult puzzles. Handle inhospitable situations with the power of the almighty chalk! Different colors of chalk allow our little bonehead to draw lines of flame, create great bodies of water, and repair broken ropes. If those challenges aren't harrowing enough, there’s also a fair amount of skillful jumping, slashing, and dodging required to get through the tough-as-nails platforming segments! <br/>\n<br/>\r\nWith new visual effects, a revamped UI, and a full set of Steam achievements, the critically acclaimed Dokuro is finally arriving on the PC!<br/>\n<br/>\r\nMain Features:<br/>\r\n*Captivating chalk style art – Immerse yourself in the gorgeous fairytale setting as you help Dokuro save the Princess from the Dark Lord.<br/>\r\n*Unique, intuitive controls – Toggle switches, hack away at your foes, and draw your solutions in chalk to help keep the Princess safe.<br/>\r\n*Tons of engrossing content – Features almost 150 platform/puzzle filled levels that will require dexterity of both body and mind as you fight through 20-30 hours of gameplay.<br/>\r\n*Full complement of Steam Achievements to earn – Master the Dark Lord’s treacherous puzzles, collect the coins in each level, and complete all challenges ahead of you bolster your collection of achievements.", "metacritic": null, "released": "2012-07-05", "tba": false, "updated": "2022-09-26T22:02:32", "background_image": "https://media.rawg.io/media/screenshots/583/583d76585e02b2f39b292993ecd4cee3.jpeg", "website": "http://www.gunghoonline.com/games/dokuro/", "rating": 2.59, "rating_top": 3, "added_by_status": {"yet": 11, "owned": 197, "beaten": 8, "toplay": 2, "dropped": 11, "playing": 1}, "playtime": 1, "achievements_count": 53, "ratings_count": 17, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 17, "platforms": ["PS Vita", "Nintendo Switch", "PC", "Android", "iOS"], "developers": ["Gungho Online", "GAME ARTS Co", "GungHo Online Entertainment", "GungHoOnlineEntertainment"], "genres": ["Action", "Casual", "Puzzle"], "publishers": ["GungHo Online Entertainment America", "GungHo Online Entertainment", "SE Mobile and Online"], "esrb_rating": null}