{"id": 422889, "slug": "eternal-sword-m", "name": "Eternal Sword M", "name_original": "Eternal Sword M", "description": "This world is collapsing and you have to go back to 7 days ago to save it!<br/>The eternal sword! It's our last hope! Bring it back to twist the fate of destruction, save the world from its end!<br/><br/>An action MMORPG with stunning graphics and breathtaking combat experience <br/>-Build yourself with tons of skills and talents<br/>-Use your secondary class wisely<br/><br/>Save a vast world close to destruction<br/>-Experience an exciting story about time travelling<br/>-Make the future different with your choice<br/><br/>Outfits, mounts, wings and artifacts, customize your unique hero<br/>-Upgrade your mounts and wings to unlock more FREE appearances<br/>-Raid mighty bosses for epic artifact drops<br/>-Collect outfits and dye them your favorite colors<br/><br/>Team up with your friends to explore a open fantasy world<br/>-Well-designed PVE dungeons require good team Co-operation<br/>-Drive powerful mobile suits to defeat ancient golems<br/><br/>Defeat all challengers and claim the crown<br/>-Show your courage and skills to acquire abundant loots<br/>-Build your own elite squad and win the glory<br/><br/>Protect the honor of the guild<br/>-Defeat other guilds with massive GVG wars and diplomatic strategies<br/>-Enjoy your casual guild life with various guild events", "metacritic": null, "released": "2019-12-29", "tba": false, "updated": "2020-03-30T02:10:53", "background_image": "https://media.rawg.io/media/screenshots/74c/74cdae023ac961a75a4674b8b925b4ba.jpg", "website": "https://www.neocraftstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["NEOCRAFT"], "genres": ["Action", "RPG"], "publishers": ["NEOCRAFT"], "esrb_rating": "Everyone 10+"}