{"id": 422892, "slug": "don-zombie", "name": "Don Zombie", "name_original": "Don Zombie", "description": "Don Zombie is an action shooter game in a world riddled by zombies. The infection has taken over and it looks unstoppable. Every city is infested with the undead, but Don, a former Colonel, will not give up until he clears every last bit of the zombie menace...<br/><br/>Use an arsenal of guns, explosives, traps and vehicles to destroy the zombie hordes in short and engaging levels. Upgrade your weapons to make them more powerful.<br/><br/>Features<br/>• Hunt down the zombies in more than 100 levels<br/>• Over 25 different weapons, explosives, traps, and vehicles will help you eradicate the infection<br/>• Defeat huge zombie enemies<br/>• Use high tech military gear like the handheld Railgun or the bipedal Walker<br/>• Visit all locations on the map to unlock special boosters<br/>• Make upgrades, earn gold and kill even bigger hordes of undead<br/>• Participate in the Arena to see how long you can last<br/>• Complete fun daily Challenges and get awesome rewards<br/><br/>Join the community<br/>Share your zombie stories with other fans and be the first to get news about new game updates<br/><br/>Check our website: nosixfive.com<br/>Follow us on Facebook: facebook.com/nosixfive<br/>Follow us on Twitter: twitter.com/nosixfive<br/><br/>Support<br/>If you need help with Don Zombie or you have feedback, please visit:<br/>https://nosixfive.com/<br/><br/><br/>PLEASE NOTE! Don Zombie is free to download and play however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Don Zombie.", "metacritic": null, "released": "2020-03-10", "tba": false, "updated": "2020-03-30T02:11:48", "background_image": "https://media.rawg.io/media/screenshots/65d/65df3df4af5647efcd511306239180dd.jpg", "website": "https://nosixfive.com/donzombie/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["No Six Five"], "genres": ["Action", "Casual"], "publishers": ["No Six Five EOOD"], "esrb_rating": "Teen"}