{"id": 422888, "slug": "missile-command-recharged", "name": "Missile Command: Recharged", "name_original": "Missile Command: Recharged", "description": "It may look easy, but the difficulty curve of Missile Command sneaks up on you. Before too long you are intensely focused on taking out incoming missiles and enemy planes, and taking desperate measures to save your remaining cities. <br/><br/>Missile Command: Recharged takes the classic arcade game and adds several layers of oomph and pizzaz. This revamped take on the classic introduces more power-ups, new enemies, and a suite of challenges that limit the number of counter-defenses at your disposal - not to mention co-op across all game modes! An amazing new soundtrack from the incomparable Megan McDuffee perfectly complements the gameplay and adds depth and variety. Of course, you could also test your skills against players across the globe in the 32 challenge levels or the classic endless Arcade mode.<br/><br/>Key Features<br/><ul><li><strong>Power Ups:</strong> Don’t just target missiles – take aim at all-new power-ups that will  give you special tool, including powerful missiles, shields, and even a screen-clearing special blast.<br/></li><li><strong>Upgrades:</strong> In Arcade, use accumulated points you earn to upgrade defensive attributes that will keep you in the game longer – if you use them wisely.<br/></li><li><strong>Local Co-op:</strong> Tag in a friend to play any mode in local co-op and coordinate to fend off enemies even longer.<br/></li><li><strong>Leaderboards:</strong> Compete in global leaderboards and aim to claim bragging rights as the top missile commander.</li></ul>", "metacritic": null, "released": "2020-03-25", "tba": false, "updated": "2023-01-09T04:41:55", "background_image": "https://media.rawg.io/media/screenshots/60c/60c6e8e56cc98fa52ede8ca0556f918d_OK920LV.jpg", "website": "https://www.atari.com/games/missile-command-recharged/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 10, "owned": 18, "beaten": 1}, "playtime": 3, "achievements_count": 56, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "macOS", "iOS", "Nintendo Switch"], "developers": ["Atari", "Nickervision Studios", "SneakyBox", "Adamvision Studios"], "genres": ["Action", "Casual"], "publishers": ["Atari"], "esrb_rating": null}