{"id": 422886, "slug": "save-the-girl-2", "name": "Save The Girl!", "name_original": "Save The Girl!", "description": "Oh no a shark, what will you do? Pitch a tent or fire the missiles?!!! Choose your fate but be careful, one wrong answer, and you are shark bait! But no fear, you can always try again in this relaxing story puzzler.<br/><br/>In Save The Girl, you decide what happens. Travel through different lands and engage in countless adventures, there is only one thing you need to make sure you do… you save the girl. Rainstorms, zombies, beaches, sinking ships… think your way through all the different stories to see what will happen next!<br/><br/> Game Features:<br/><br/>Challenging Puzzles<br/>The world is always changing and there is a new challenge around every corner. Can you make it to the end and save the girl?<br/><br/>Hilariously Fun Time Killer<br/>Hours of fun and relaxing in this immersive puzzle game. The perfect way to spend your days quarantined inside. Free to play and fun for the whole family.<br/><br/>3.  New Content<br/>New adventures for you to go on all the time! Can you unlock everything?<br/><br/>4. It is that game from those ads<br/>Yes, it actually is.<br/><br/>Can you help save the girl? Can you find out who else needs to be saved? Good luck!<br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Happy Glass, Mr Bullet and I Peel Good!<br/><br/>Follow us to get news and updates on our other Award Winning titles:<br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": "2020-01-18", "tba": false, "updated": "2020-03-30T02:09:54", "background_image": "https://media.rawg.io/media/screenshots/e5a/e5a051ceae75950c9e19a365fadd0383.jpg", "website": "http://lionstudios.cc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lion Studios"], "genres": ["Casual", "Puzzle"], "publishers": ["Lion Studios"], "esrb_rating": "Everyone 10+"}