{"id": 422854, "slug": "good-job", "name": "Good Job!", "name_original": "Good Job!", "description": "<p>A Bumbling Employee Meets Office-Themed Puzzles. Hilarity Ensues.<br />\nAs the clumsy child of a CEO, you must climb the corporate ladder one office-themed puzzle at a time! Complete puzzles in multiple ways as you experiment with the interactive environments—a projector can be wheeled gently through an electric door…or catapulted through the wall. So toil (or tumble) your way to the top and make your father proud!</p>\n<p>Your job duties can vary from fixing the office’s internet connection to cleaning up experimental goo. You may bump into your coworkers or knock over a priceless item or two in the process, but as long as you get the job done you’re one step closer to the executive suite! True star employees can also replay stages to try to earn a higher score by maximizing speed while minimizing damages.<br />\nPass a Joy-Con™ controller to a friend (or coworker) for some help solving puzzles, divvying up tasks, or collecting in-game outfits. Whether you’re playing alone or with a friend, Good Job! turns sometimes-mundane office dealings into a puzzling and hilarious take on climbing the corporate ladder.  <br />\nThe dress code at your father’s company is…flexible to say the least. By exploring the office’s many departments, you can find over 100 in-game outfits hidden throughout. These looks range from business casual to Viking chic, so you can leave the suit at home and let your true colors show!</p>", "metacritic": 78, "released": "2020-03-26", "tba": false, "updated": "2023-10-27T18:32:13", "background_image": "https://media.rawg.io/media/screenshots/2e8/2e859086a0b49d7615444e9425807d17.jpg", "website": "https://www.nintendo.com/games/detail/good-job-switch/", "rating": 3.48, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 7, "beaten": 7, "toplay": 32, "dropped": 17, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 22, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 23, "platforms": ["Nintendo Switch"], "developers": ["Paladin Studios"], "genres": ["Action", "Puzzle"], "publishers": ["Nintendo"], "esrb_rating": null}