{"id": 422877, "slug": "trickster-pitch", "name": "Trickster Pitch", "name_original": "Trickster Pitch", "description": "“I like the fact I can play Pitch with my friends.”<br/><br/>Free, Live, Social Play – Your Way<br/><br/>Let the fun begin. Play the game you love with friends and family or get matched with other live players at your level. Trickster Pitch offers customizable rules, so you can play Pitch your way!<br/><br/>• Fast-paced, competitive and fun — for free!<br/>• Get matched by skill to other live players <br/>• Invite and play with friends and family<br/>• Use your favorite house rules<br/>• Apps available across devices and stores<br/><br/>Real People, Right Now<br/><br/>Select “Play” and Trickster Pitch finds other players based on skill and speed. Get started without waiting — other players join as they’re ready. After the game, “Play Again” keeps you playing with the same group.<br/><br/>Friends and Family Included<br/><br/>Play together — even when you’re apart. Select “Join” and Trickster Pitch helps you invite friends and family to a game. Turn on notifications to hear about friends’ games anytime. Now game night lives on wherever you are.<br/><br/>Your House, Your Rules<br/><br/>Play Pitch your way with customizable rules. Choose your favorite point variation, adjust who gets low point, decide if players can “Shoot the Moon,” and more.<br/><br/>Supported Variations<br/>• 4-Point<br/>• 5-Point<br/>• 6-Point<br/>• 7-Point<br/>• 10-Point<br/>• 13-Point<br/><br/>Play Across Devices<br/><br/>Have an iPhone, but your friends don’t? No problem. Trickster Pitch works on more devices so you and your friends can play where you want, when you want, with whom you want. Great on phones, tablets, laptops and desktops!<br/><br/>Fast and Friendly Chat<br/><br/>Express reactions quickly using chat presets. Focus on the game without the distraction of off-topic comments. Then socialize with full chat after the game. Or set up a private game with friends to use full chat anytime.<br/><br/>What Players are Saying<br/><br/>“It is stable and fun gameplay. Good controls and graphics.”<br/> <br/>“I think I’ve tried every 10-point Pitch game available. This one is my favorite! Best looking, best gameplay, best price.”<br/><br/>“Clean interface, good variety of game variations, network multiplayer.”", "metacritic": null, "released": "2016-02-17", "tba": false, "updated": "2020-03-30T02:07:03", "background_image": "https://media.rawg.io/media/screenshots/e2d/e2dc217df7c7cfe4b325597a7725ee69.jpg", "website": "https://www.trickstercards.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Trickster Cards"], "genres": ["Card"], "publishers": ["Trickster Cards"], "esrb_rating": "Mature"}