{"id": 422946, "slug": "drone-x-virus", "name": "Drone X Virus", "name_original": "Drone X Virus", "description": "<p>People can't go out of their homes due to a recent Virus Outbreak ! You equip yourself with your trusty Drone to scout the city, control your bots and bring people water and food , but watch out for the virus!<br/></p>\n<p>You are such a caring person, and other people will soon join the cause! </p>\n<p><strong><em>English ( Español mas abajo )</em></strong><br/></p><p>Controls </p>\n<ul><li>Move - Arrow keys / WASD</li><li>Rise or descend - Left shift -+ Arrow Keys / WASD</li><li>Click on a bot to select it, then click somewhere else to move it there (Watch out , the drone has a reach , if the bot gets out of it , it gets deselected automatically</li></ul>\n<p>How to Play</p>\n<p>You win if you survive long enough for the cure to arrive! Level 3 it's infinite time to test your skill! </p>\n<p>You lose if the virus spreads above the limit , so keep it below! </p>\n<p>* How to stop the virus?<br/>The virus spreads more quick when the people are sad<br/></p>\n<p>(\"They go out of their houses!\") <br/></p>\n<p>Move medBots to virus dots to wipe it, medBots take some time to kill the virus.  You have to use one toilet paper to kill one virus, move toilet paper from pharmacies to the HQ to get more paper! </p>\n<p>* How to keep people happy?<br/>Bring them food and water when they need it! move TransportBots to stores to pick things , then move the bot to the entrance of the house to give the provisions. The people will thank you with a gear! , move it to the HQ to collect it.</p>\n<p>Stores join for the cause! they donate resources once in a while. (They are the resources they leave outside)</p>\n<p>Be careful , if there is a virus close to a store, it will stop it's donating process, and if it is close to a house, you will not be able to deliver provisions!</p>\n<p><strong><em>Español</em></strong></p><p>Las personas no pueden salir de sus casas a causa de un reciente virus. Te equipas de tu confiable Dron para explorar la ciudad, controla a tus robots para llevar a las personas agua y comida, ¡Pero ten cuidado del virus!</p>\n<p>Eres una persona tan solidaria, y ¡Pronto mas personas se unirán a la causa!<br/></p>\n<p>Controles</p>\n<ul><li> Mover  - Flechas / WASD</li><li>Elevarte o Bajar - Left shift + Flechas  / WASD</li><li>Da click a un robot para seleccionarlo , luego da click en algun lugar para moverlo (Cuidad el dron tiene un alcance maximo, si el robot se sale, se deseleccionara) </li></ul>\n<p>Como Jugar</p>\n<p>¿Ganas si sobrevives lo suficiente para que llegue la cura! El Nivel 3 es infinito para poner a prueba tu habilidad.</p>\n<p>Pierdes si el virus crece por encima del limite , ¡Así que manténlo debajo! </p>\n<p>* ¿Cómo detener el virus? El virus crece más rápido cuando las personas están tristes (\"¡Salen de sus casas!\") </p>\n<p>Mueve a los robot medico hacia un virus para eliminarlo, los robots medico tardan un tiempo en eliminar el virus, debes gastar un papel de baño para eliminar a un virus. Mueve papel de baño de las farmacias al HQ para tener más! (Usando los robot de carga)</p>\n<p>* ¿Cómo mantener a la gente feliz?  </p><p>¡Llevándoles comida y agua cuando lo necesiten! <br/><br/>Mueve a los robot de carga a las tiendas para recoger las cosas y luego llévalos a la entrada de las casas para darles las provisiones. Las personas te agradecerán con engranes, llévalos al HQ para obtenerlos.</p>\n<p>¡Las tiendas se unen a la causa! Donan recursos de vez en cuando (Son los recursos que dejan en su entrada) </p>\n<p>¡Ten cuidado! Si el virus esta muy cerca de una tienda , esta detendrá su donación, y si el virus esta cerca de una casa, no podrás entregarle provisiones.</p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T02:23:56", "background_image": "https://media.rawg.io/media/screenshots/0da/0da917de486296710d173897921a8211.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kvoff"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}