{"id": 423094, "slug": "coquetel", "name": "COQUETEL", "name_original": "COQUETEL", "description": "<p>Coqueteleiros, juntos aperfeiçoando seu trabalho em equipe terão que atravessar uma floresta. Armas? Adivinha. A vida te dá limões, mas em equipe você atravessa qualquer coisa e ainda termina com uma bela limonada :D</p>\n<p>MVP 1</p>\n<p>UTILIDADE DO JOGO<br/>- Promover trabalho em equipe cooperação, união e aperfeiçoamento e mostrar o quanto uma equipe consegue se aperfeiçoar 1000 vezes além do máximo que um indivíduo consegue se aperfeiçoar sozinho.</p>\n<p>-1 - monstros - 15 cartas com nrs de 0 a 5 e área de ataque (1 ou 2)<br/>-1 - dá 5 limões pra cada um (Sinergia)<br/>-1 - faz triangulo, quarado, pentagono, hexagono<br/>-1 - palito ou (coqutelzinho impresso)</p>\n<p>0 - inicia o cronometro<br/>0 - misturar monstros<br/>0 - numero de jogadores será um numero a menos do que o numero de lados que o desafio central vai ter, no tabuleiro<br/>0 - [MODO A] A equipe decide junta se vai querer 25 poções de início ou em cada rodada infinitamente.</p>\n\n<p>-------------- COMEÇA rodada:-------<br/>0 - [A]Equipe escolhe que poções quer<br/>1 - os jogadores podem se posicionar como quiserem<br/>2 - [MODO B] A equipe fabrica 5 poções e decide com quem elas vão ficar.<br/>3 - Escolhe quantas carta quiser pro centro e puxa do baralho (aleatorio e finito)<br/>4 - gira o dado pra saber saber pra que lado cada carta vai apontar<br/>5 - vira as cartas<br/>-------- BATALHA<br/>6 - quem tiver no lado que o monstro vai atacar leva o dano total do monstro (contabiliza com feijão limão ou palito de coquetel 5)<br/>7 - Quem tiver COQUETEIS pode escolher se vai usar pra recuperar Sinergia, atacar o Desafio (projetos)<br/>----------- NR 0<br/>8 - Acabam as cartas = SUCESSO / alguém morre = FALHAR<br/>-------- FIM<br/>tem cronometro<br/>15 rodadas</p>\n<p>OBJETIVO DOS JOGADORES:<br/>BATER O PRÓPRIO RECORD COMO EQUIPE em TEMPO e NR de rodadas do começo ao fim das cartas.</p><p>CREDITOS (DO-CRIADORES)</p><p>- MATHEUS BRINGEL E SILVA<br/>- FRANCISCO AGUIAR </p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T02:57:51", "background_image": "https://media.rawg.io/media/screenshots/d33/d33c440c61e0e3036bdef2ee1eeed6bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mtbringel"], "genres": [], "publishers": [], "esrb_rating": null}