{"id": 423103, "slug": "day-in-the-park", "name": "Day In The Park", "name_original": "Day In The Park", "description": "<p>It's a nice day in the park (on a floating island on space). You have positive messages floating by, cheering you up. A message comes in, dissolving into view, and your bird friend does a little dance. You send a message too, writing down positive words for everyone else to see, and sending it off if a paper airplane. within 5 minutes, your kind message will reach them, brightening up their day. You sit there and relax to the music and scenery, reading more messages as they come in.</p>\n<p>These times are rough on all of us, hurting many people's mental health. The idea behind this game is to cheer people up who are feeling down in this crisis! All the messages are player-written (some written by me playing the game), and are sent to a server that allows everyone else to read your message. Spread some positivity!<br/></p>\n<p>Controls:</p>\n<p>Mouse to rotate head</p>\n<p>Click to interact</p>\n<p>Click on the writing pad on your right to open it. Write your message, then press send to send your message. You can cancel your message to put away the pad, or just exit the game from the pad.<br/></p>\n\n<p>Music:</p>\n<p>Calm Garden by rediezminor88</p>\n<p>On The Down Low by Ahjay Stelino</p>\n<p>Deciduous Forest by Crazy Sunshine</p>\n\n<p>Requires internet connection (to connect to AWS server)</p>\n<p>Social Media Links:</p>\n<p>Game Creator Twitter: https://twitter.com/KaucherIris</p>\n<p>Crazy Sunshine: https://soundcloud.com/user-101431398</p>\n<p>Ahjay Stelino: https://ahjaystelino.com/<br/></p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T02:59:36", "background_image": "https://media.rawg.io/media/screenshots/682/68298518c52d8f6710de7c486c4b60fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["IrisCreates"], "genres": [], "publishers": [], "esrb_rating": null}