{"id": 423274, "slug": "wavelength-board-game", "name": "Wavelength (Board Game)", "name_original": "Wavelength (Board Game)", "description": "<p>This is a poorly-made copy of the boardgame Wavelength. Wavelength is a party game for 2-12 players about placing a thing in a spectrum between two opposite ideas, like hot &amp; cold, flavorless &amp; flavorful, bad pizza topping &amp; good pizza topping.  This will get you to get things like where should I put \"Hot Coffee\" in the spectrum between hot &amp; cold. It's definitely leaning to the hot side, but it' not the hottest thing ever either...</p>\n\n<p>Description from<em> Board Game Geek </em>(https://boardgamegeek.com/boardgame/262543/wavelength)</p>\n\n<p>\"<em>Wavelength</em> is a social guessing game in which two teams compete to read each other's minds. Teams take turns rotating a dial to where they think a hidden bullseye is located on a spectrum. One of the players on your team — the Psychic — knows exactly where the bullseye is, and draws a card with a pair of binaries on it (such as: Job - Career, Rough - Smooth, Fantasy - Sci-Fi, Sad Song - Happy Song, etc). The Psychic must then provide a clue that is *conceptually* where the bullseye is located between those two binaries.</p>\n<p>For example, if the card this round is HOT-COLD and the bullseye is slightly to the \"cold\" side of the centre, the Psychic needs to give a clue somewhere in that region. Perhaps \"salad\"?</p>\n<p>After the Psychic gives their clue, their team discusses where they think the bullseye is located and turns the dial to that location on that spectrum. The closer to the center of the bullseye the team guess, the more points they score!\"</p>\n\n<p>This version is very primitive and there's only local play, but more cards + co-op mode wil come soon (TM).</p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T03:35:05", "background_image": "https://media.rawg.io/media/screenshots/e43/e431a05f92bd1c504bbad4c119ada2ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chocfudge"], "genres": [], "publishers": [], "esrb_rating": null}