{"id": 423219, "slug": "elysium-pryymez", "name": "Elysium (Pryymez)", "name_original": "Elysium (Pryymez)", "description": "<p> Ons concept is een narrative-driven game waarbij je als speler kan rondlopen en een (kleine) story ervaart door te interacteren met de omgeving en NPC’s. </p>\n<p>Story:</p>\n<p>De story (samenvatting) Elysium is een utopische stad waarbij het lijkt alsof alles perfect is. In werkelijkheid is er geen vrijheid en wordt er door L.A.B. (de overheid in deze stad) bepaald wat je mag denken en wat je mag doen. Er is een weeshuis in Elysium, en jij bent een van de weeskinderen die in dat huis verblijft; Alejandra Nikolas is je naam. Je weet eigenlijk helemaal niks van Elysium (als protagonist, maar ook als speler) en denkt ook dat de stad perfect is. Langzamerhand kom je er echter achter dat niet alles is wat het lijkt en dat Elysium en L.A.B. niet zo perfect zijn als je denkt. Dit gebeurt in eerste instantie doordat je een berichtje krijgt dat je niet alles moet geloven wat je denkt. Hierdoor kom je in aanraking met een groep genaamd anti-L.A.B. die probeert de waarheid te achterhalen. Het blijkt dat je oom de leider is van deze groep en dat hij de enige familie is die je in Elysium hebt. Hij heeft zichzelf echter omhoog gewerkt binnen L.A.B. en het is dus lastig om met hem in contact te komen. De mensen van anti-L.A.B. komen er na een tijdje achter dat jij het nichtje bent van Alastaire Nikolas (je oom), en je wordt dus in contact gebracht met hem. Hierna volgt het ontsnappingsplan. De reden dat er een ontsnappingsplan is, is omdat er robot A.I’s in Elysium worden geproduceerd, gebruikt en verkocht (aan consumenten). Deze robots zijn echter gemaakt uit de weeskinderen van het weeshuis waarbij er jaarlijks een onderdeel van het lichaam vervangen wordt met een cybernetic deel. Dit gebeurt totdat alleen nog de hersenen over zijn van de weeskinderen. Daarna worden ze of verkocht of zelf gebruikt door L.A.B. Dit is ook met je broer gebeurd, en daar kom je later pas achter. Als dit zo door blijft gaan, gebeurt dit dus ook bij jou. De hele essentie van dit verhaal is dat L.A.B. (de overheid) fake news verspreidt en niet eerlijk is. Zij brengen het alsof de robot A.I.’s gewone robots zijn en dat iedereen het goed heeft in Elysium. Dit doen ze allemaal in de zoektocht naar de ultieme robot A.I.</p>\n\n<p>Cliënt en Teamleden:</p>\n<p>Onze cliënt van project context 2 was de Ethics Institute, Universiteit van Utrecht (Mariette van den Hoven).<br/></p>\n<p>Team 14: </p>\n<p>Artists: Marc Man, Iris Schuit, Tim van Galen.</p>\n<p>Developer: Pim Horeman.</p>\n<p>Audio: Yannick Middelkoop.</p>\n<p>Global Sustainability Sciences : Jasper van Zon.</p>\n\n<p>Begeleider: Johan Otten</p>\n\n<p>Technische Aspecten:</p>\n<p>Unity 2019.3</p>\n<p>Github &amp; Sourcetree [https://github.com/Pimmez/Esylium]<br/></p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T03:24:03", "background_image": "https://media.rawg.io/media/screenshots/320/320caf1811939b91b6e3cad03e2bb885.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pryymez"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}