{"id": 423257, "slug": "neetworking-monster-girls-at-work", "name": "NeetWorking; ~Monster Girls At Work~", "name_original": "NeetWorking; ~Monster Girls At Work~", "description": "NeetWorking<p>_____________________________________________</p>\n<p>This game is a management simulator taking place in a town where monster girls started to move in!</p>\n<p>Enter Minoru, a man who lived his life as a failure. One day, he finds himself in charge of an apartment built under his missing grandfather’s name. But that comes at a price: he also must pay back a very large loan his grandfather took, or else... <br/>As Minoru, you decide how to pay back the loan while...<br/>- Working jobs in town<br/>- Meeting the monster girls mentioned earlier in this post<br/>- Seeing what the world (okay, more like a city) has to offer</p>\n<p><strong>Key Features:</strong><br/>- Mountains and beaches to explore<br/>- Monster girls<br/>- Managing your time and debt<br/>- Monster girls<br/>- Lots of items to be found by means such as foraging<br/>- The fear of living in a cardboard box!<br/>- Did we mention this game has monster girls? Because we're SilumanSoft, dangit!</p>\n<p><strong>In progress or planned:</strong><br/>- Getting girls to live with you, because you’re that much of a charmer<br/>- Having said girls take on jobs, helping you pay back the debt<br/>- Item-crafting, because what grandchild of a mad scientist can’t do that?<br/>- Various quests that flesh out the characters and setting<br/>- Romantic endings with... well, take a guess~.<br/>- Dating system</p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T03:31:53", "background_image": "https://media.rawg.io/media/screenshots/a13/a136c4aecba94c7472d920694df1036a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Siluman Soft", "Angel Star Studios"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}