{"id": 4232, "slug": "birds-of-steel", "name": "Birds of Steel", "name_original": "Birds of Steel", "description": "<p>Birds of Steel gives aerial aviators the ability to strap in to some of the most historically accurate WWII fighter planes and rewrite history. This new IP blends next gen supremacy and the finest details of aerial combat into a historical recreation fit for flight sim fans and history buffs alike. Use your skills to pilot top planes from all combatants in WWII to recreate history or to change the outcomes of the most prolific battles in history.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item&#39;s use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.<br />\nGaijin Entertainment, Birds of Steel and their respective logos are trademarks and/or registered trademarks of Gaijin Entertainment Corporation or its affiliates in the U.S. And other countries. All other trademarks, logos and copyrights are property of their respective owners. © 2012 Konami Digital Entertainment  KONAMI is a registered trademark of KONAMI CORPORATION.</p>", "metacritic": 75, "released": "2011-12-09", "tba": false, "updated": "2022-02-09T15:32:23", "background_image": "https://media.rawg.io/media/games/c3d/c3dc439b61dc1b6f01a493fd8547b51b.jpg", "website": "http://www.birdsofsteel.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 42, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 85, "ratings_count": 4, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 3", "Xbox 360"], "developers": ["Konami Digital Entertainment", "Gaijin Entertainment"], "genres": ["Action", "Simulation", "Racing", "Arcade"], "publishers": ["Konami"], "esrb_rating": "Teen"}