{"id": 423349, "slug": "jump-up-candy", "name": "Jump Up Candy", "name_original": "Jump Up Candy", "description": "<p>You must carry sweets through obstacles, keep sweets from falling or hitting obstacles. Complete all levels with obstacles and get the highest score, have fun with Jump Up Candy.</p>\n<p>Have you ever been a fan of colorful flowers or candy games? The good news Jump Up Candy is an arcade game in the manner of the famous Flappy Bird and Swing Copters. The game is free and does not require an Internet connection or WiFi, you can play Jump Up Candy anywhere and anytime.</p>\n<p>Welcome to Jump Up Candy!<br/>Jump Up Candy is a one-touch arcade game where you must tap the screen to jump while avoiding obstacles.<br/>Well, jumping up candy is the same, but with a better game and with a great sense of candy games.<br/>The game is simple on the surface — tap to keep the candy jumping upward while bouncing in the air and avoid obstacles to cross it. Go through as many obstacles as possible before crashing into another cube. The difficulty of the game is that the obstacles move and the candies jump.<br/>Jump up candies; click on the cube with intense accuracy to be able to cross various obstacles; your cube will change an obstacle at each intersection with bonuses that you will meet during your journey.</p>\n<p>Be focused, careful and smart to cross obstacles with the help of candy.<br/>Over time, obstacles become more complex using high speed and various forms. The process may be simple, but it is also addictive.<br/>Be careful to get through the bombs, or you will have to start all over again.<br/>You will need a quick reaction and nerves of steel to play Jump Up Candy.</p>\n<p>Features Jump Up Candy:<br/>* Impressive graphics.<br/>* Easy to play, hard to master.<br/>* Convenient and colorful interface<br/>* Simple and fun gameplay.<br/>* Free and endless levels.<br/>* Funny sound effects.</p>\n<p>Features Jump Up Candy:<br/>• Over 150 levels<br/>• Endless game<br/>* Online Leaderboards<br/>* Play anytime, anywhere, no internet needed!<br/>* Easy and fun to play!<br/>* Absolutely free<br/>* Option to turn on / off the sound</p>\n<p>If you are a fan of bright and exciting and competitive games, then you will instantly become addicted to this exciting game!<br/>Jump Up Candy is ideal for spending time with friends, family, hobbies, training the mind.</p>\n<p>So what are you waiting for? Download our Jump Up Candy game and enjoy the best candy jumping game!</p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-03-30T03:53:30", "background_image": "https://media.rawg.io/media/screenshots/6f9/6f9b6d733d479afcbcc1a87467e9852d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ALX Software Development"], "genres": [], "publishers": [], "esrb_rating": null}