{"id": 42336, "slug": "grand-theft-auto-online", "name": "Grand Theft Auto Online", "name_original": "Grand Theft Auto Online", "description": "<p>Grand Theft Auto Online is a dynamic and persistent open world for 16 players that begins by sharing content and mechanics with Grand Theft Auto V, but continues to expand and evolve with content created by Rockstar and other players. Taking the fundamental concepts of open-world freedom, ambient activity and mission-based gameplay and making them available to multiple players in an incredibly dynamic online world, we offer players the freedom to explore alone or work cooperatively with friends to complete missions. Residents of Los Santos band together to participate in activities and ambient events, or compete in traditional game modes with the entire community, all with the personality and refined mechanics of Grand Theft Auto V.<br />\nYou start by creating and developing a unique character from the ground up and can invest in your potential criminal by customizing his or her appearance, improving their stats, owning customized vehicles, purchasing personal property, and taking part in Jobs, Missions and activities that continually open up new opportunities to rise through the criminal ranks.<br />\nGrand Theft Auto Online will continually expand and evolve over time with a constant stream of new content, creating the first ever persistent and dynamic GTA game world.</p>", "metacritic": 82, "released": "2013-10-01", "tba": false, "updated": "2024-04-11T17:43:05", "background_image": "https://media.rawg.io/media/games/bbd/bbd7af2d6dab31e0b3bbfb5f63575ab8.jpg", "website": "http://www.rockstargames.com/V/", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 32, "beaten": 75, "toplay": 12, "dropped": 96, "playing": 36}, "playtime": 0, "achievements_count": 0, "ratings_count": 145, "suggestions_count": 539, "game_series_count": 0, "reviews_count": 148, "platforms": ["Xbox One", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5"], "developers": ["Rockstar North"], "genres": ["Action", "Shooter"], "publishers": ["Rockstar Games"], "esrb_rating": "Mature"}