{"id": 423417, "slug": "fates-of-ort-itch", "name": "Fates of Ort (itch)", "name_original": "Fates of Ort (itch)", "description": "<p>Fates of Ort is a retro inspired fantasy RPG with a focus on strategic action and a story driven by your decisions. It is a tale of sacrifice and difficult choices, in a world under threat of annihilation by the avaricious force of Consumption magic.</p>\n\n<p>Magic is powerful, but it is not free. Every spell you cast requires a little bit of your life energy to spark it. Cast enough spells and you will extinguish your very soul. This means you need to be strategic when fighting, balancing the cost of magic with the risk of taking damage from your enemies.</p>\n\n<p>How each spell manifests in the world depends on what divine power you choose to combine it with. For example, the Evoke Force spell will cause the ground to erupt with a series of sharp ice crystals, summon a thunderous lightning strike, or barrage the ground with a meteor shower – all depending on what the spell is combined with.</p>\n\n<p>Use the magic spells at your disposal to defeat the demons spilling out from the underworld. In Ort, time is frozen whenever you stand still. This means you have the opportunity to plan your attacks and be strategic.</p>\n\n\n<p>Like any RPG, you will be slaying enemies to collect loot and experience. The items you pick up will improve your magical abilities, though some come with curses... As you level up, you will learn additional magic spells to use against your enemies.</p>\n\n\n<p>Ort is varied and expansive, an open world for you to explore. Choose the order of the quests you pursue, or just explore to meet new characters. The final battle is available whenever you choose, but... Are you strong enough?</p>\n<br/>\n\n\n<p>Play as a novice mage, forced to take on the responsibility of saving the world and those that are important to you. Quests can be completed to gain access to new areas, save and unlock allies, gain items and powers, and more. Replays are encouraged because small decisions can have permanent and significant consequences, leading to different game outcomes.</p>\n\n\n<ul><li>Learn and use 12 magic spells, and combine them with the three elements for different effects</li><li>Time stops when you stand still - take advantage of this to plan your attacks</li><li>Use your life energy to weave spells - be strategic in your fighting</li><li>Explore various biomes around the world of Ort and meet a diverse set of characters</li><li>Atmospheric soundtrack composed by Chris Gray</li><li>Pursue truly optional quest lines, and make difficult choices between which characters to save</li><li>Save the world, or rule it as a force of evil</li></ul>\n\n<p><strong>Games that inspired Fates of Ort<br/></strong></p>\n<p>Diablo 2, Morrowind, Chrono Trigger, Fallout, Eschalon Book</p><p>Purchase comes with a <strong>Steam</strong> key.<br/></p>", "metacritic": null, "released": "2020-03-27", "tba": false, "updated": "2020-03-30T04:07:36", "background_image": "https://media.rawg.io/media/screenshots/37a/37a2afb8560daaaf849a528b6678ea52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["8BitSkull"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}