{"id": 423562, "slug": "corona-crush-the-corona-virus-dating-sim", "name": "Corona Crush: The Corona Virus Dating Sim", "name_original": "Corona Crush: The Corona Virus Dating Sim", "description": "<p><strong><strong>PRIMEIRO LUGAR NA QUARENTENA JAM</strong></strong></p><p><strong><strong>Nesse dating sim, você decide web namorar durante a quarentena de coronavírus. Consiga um encontro antes que a pandemia acabe.</strong></strong></p>\n<p><strong>O mundo entra em colapso por conta do Coronavírus. A quarentena já dura três anos. Os militares tomaram as ruas forçando todos a ficarem em casa até que o problema seja resolvido. Ninguém tem notícias do mundo lá fora, a não ser por um único jornal que ganhou monopólio da comunicação mundial.</strong></p>\n<p><strong>Um dia você recebe o anúncio: a quarentena acabará em uma semana.</strong></p>\n<p><strong>Apenas mais 7 dias de confinamento. Você quer alguém para celebrar com você o fim da pandemia.  Mas quem? Faz muito tempo que você não tem contato humano… Tem que ser alguém especial. </strong></p>\n<p><strong>Converse com diferentes crushes no app \"Corona Crush\" para encontrar a pessoa perfeita para sair com você após a quarentena.</strong></p>\n<p><strong>Será que você vai conseguir um encontro? Vai sobreviver lá fora? Será que seu crush tem corona? Os zumbis tomaram o poder? O apocalipse chegou? Descubra tudo isso jogando: Corona Crush.</strong></p>\n<p><strong>Jogue e tente conseguir todos os 8 finais!</strong></p>\n<p><strong>Essa DEMO contém:</strong></p>\n<ul><li>7 dias até o fim da querentena</li><li>4 personagens para namorar</li><li>8 finais (4 finais bons e 4 finais ruins)</li></ul>\n<p><strong>A versão completa conterá:</strong></p>\n<ul><li>15 dias até o fim da querentena</li><li>8 personagens para namorar</li><li>38 finais (8 finais bons, 17 finais ruins, 1 final secreto)</li></ul>\n\n<p>XXXXX</p>\n<p>Beta English version will be available soon.</p>\n<p><strong>In this dating sim, you decide to webdate during the corona quarantine. Get a date before the pandemic ends.</strong></p>\n<p><strong>The world enters in collapse because of the Coronavirus. The quarantine has go on for 3 years now. The military goes to the streets. Everyone is forced to stay at home until the virus is dealt with. No one has news of the outside world. One day you get the announcement: the quarantine will be over in one week.</strong></p>\n<p><strong>7 days more to go. You want someone to celebrate with you the end of the pandemic. But who? Has been a while since you had physical human contact... It must be special. Chat with different crush's to find out the perfect person to go out with after the quarantine.</strong></p>\n<p><strong>Will you survive outside? Does your crush have corona? Has the apocalypse really arrived? Find out here in Love Virus: The Corona Dating Sim.</strong></p>\n<p>Play and get all 8 endings!</p>\n<p><strong>Equipe</strong></p>\n<p><strong>Game Designer<strong> <strong>&amp;</strong> </strong>Game Writter: </strong>Camila Mattos</p>\n<p><strong>Game Designer &amp; Game Writter: </strong>Cael Barbosa<br/></p>\n<p><strong>Artista 2D: </strong>Sofia Pougy</p>\n<p><strong>Programador:</strong> Daniel Carias</p>\n<p><strong>Som:</strong> Liz Marques</p>", "metacritic": null, "released": "2020-03-28", "tba": false, "updated": "2020-03-30T04:37:26", "background_image": "https://media.rawg.io/media/screenshots/53c/53c718d3eef774fae8532795488831f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Camila Mattos"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}