{"id": 423685, "slug": "the-pendant-of-prosperity", "name": "The Pendant of Prosperity (itch)", "name_original": "The Pendant of Prosperity (itch)", "description": "<p><strong>*PLEASE NOTE! WHILE WE DON’T HAVE ANY ART INCLUDED AT THE MOMENT, WE’RE CURRENTLY PLANING ON HAVING 20 PIECES OF ART FROM SAXXON INCLUDED WITH THIS PROJECT. HOWEVER AT THIS TIME, AND DUE TO VARIOUS EVENTS, WE WON’T BE ABLE TO INCLUDE THE ART TILL LATER THIS YEAR. EVERYONE WHO CURRENTLY BUYS A COPY RIGHT NOW WILL RECEIVE A VERSION WITH THE ART INCLUDED AS SOON AS POSSIBLE AS WELL AS  ANY OTHER UPDATES IN THE FUTURE. *\r\n  </strong></p>\n<p>Your girlfriend Reggie just loves the new necklace you gave her, but soon things start to get a ‘little’ strange in a BIG way! In this completely interactive story, over 80,000 words long and large, you get to decide what happens!   </p>\n<p>In one path, Reggie’s already awesome breasts might grow in size to beyond busty! Pretty soon she might not be able to leave your apartment building! In another path, Reggie could be stricken with an insatiable hunger, eating and eating all day long! Can you get the necklace off of her before the magic jewel sends her weight gain into the extremes? Will you want to?   </p>\n<p>The choice is yours in this sexy and sensual adventure that's packed with over 20 exciting endings! The first in the new Chews Your Own Adventure line of interactive fiction from Earthbound Books.\r\n   \r\n  </p>", "metacritic": null, "released": "2020-03-28", "tba": false, "updated": "2020-03-30T05:05:44", "background_image": "https://media.rawg.io/media/screenshots/c86/c868bd83212a295df3b35c2872ef2c9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Earthbound Books"], "genres": [], "publishers": [], "esrb_rating": null}