{"id": 423631, "slug": "construct-3-crt-ansi", "name": "Construct 3 - CRT + ANSI", "name_original": "Construct 3 - CRT + ANSI", "description": "<p>*** Clicca sul gioco per dargli il fuoco (altrimenti i tasti non funzioneranno), quindi premi F per mandare a tutto schermo e P per iniziare la partita. ***</p>\n<p>*** Clicca su \"Click here to load external level\" per caricare un livello custom (<strong>grazie a Vincenzo Striano per l'idea!</strong>). ***</p><p>EDIT: --- Ho aggiunto 2 piccoli bonus:</p><ol><li>Se durante la partita premete il tasto 1, la modalità di gioco cambia da intero livello a camera;</li><li>Se durante la partita premete il tasto 2 viene commutato il font grafico. ---</li></ol>\n<p>In questo periodo di quarantena da COVID-19, visto che in tanti regalano cose qua e là, ho pensato di preparare un regalo anche io.</p>\n<p>Si tratta di due librerie scritte in Construct 3 e di un giochino che mostra come funzionano.</p>\n<p><strong>Procediamo con ordine e partiamo dalla fine</strong>, ovvero dal giochino (nasce come esempio, pertanto è volutamente limitato).</p>\n<p>Il giochino è un clone testuale dello storico Boulder Dash (</p>\n<p>). Per chi ha un paio d'anni in più, come me, forse lo ha giocato anche con il piratato nome di \"Caduta massi\" su C64 (<br/></p>\n<p>).<br/></p>\n<p>Lo scopo del gioco è quello di far fuggire il personaggio dal livello, attraverso un portale che si apre solo dopo che lo stesso ha raccolto tutti i diamanti presenti.</p>\n<p>I comandi sono tutti presenti a video, ma li ricapitolo brevemente:</p>\n<ul><li>WASD o i tasti direzionali consentono di muovere il giocatore</li><li>Shift + A oppure Shift + sinistra consentono di spingere una roccia verso sinistra (se possibile)</li><li>Shift + D oppure Shift + destra consentono di spingere una roccia verso destra (se possibile)</li><li>F mette il gioco in fullscreen</li><li>K uccide il giocatore (gli fa perdere una vita, da usare se ci si è \"incastrati\" senza via d'uscita)</li><li>P dalla schermata del titolo avvia una nuova partita</li><li>R dalla schermata del gameover torna alla schermata di avvio</li><li>Click su \"Click here to load external level\" per caricare un livello custom</li><li>1 commuta da livello intero a camera</li><li>2 commuta il set caratteri</li></ul>\n<p>Quelle che seguono sono le leggi che governano il mondo di gioco:</p>\n<ol><li>il giocatore deve raccogliere tutti i diamanti (i quadratini azzurro chiaro). Quando li ha raccolti tutti si apre il portale. Il giocatore passa al livello successivo (nel mio caso vince) entrando nel portale. Ha a disposizione 3 vite e per ogni vita 200 secondi per farlo.</li><li>il giocatore può muoversi in tutte le direzioni scavando nel terreno. Non può oltrepassare i muri e le rocce (@).</li><li>scavando, può scavare sotto le rocce... se si sofferma immediatamente sotto una roccia (anche se sopra ce ne sono altre) le sostiene, ma se gli precipita una roccia addosso ne rimane schiacciato.</li><li>le rocce sdrucciolano le une sulle altre, lo stesso i diamanti, e possono anche sdrucciolare rocce sui diamanti e viceversa (in pratica, se rocce e diamanti non hanno un appoggio solido ed hanno spazio ai lati, possono cadere).</li><li>il giocatore può spostare le rocce, solo a sinistra e a destra, a patto che si trovi adiacente alla roccia da muovere e che nella direzione desiderata vi sia uno spazio vuoto dopo la roccia.</li><li>nel campo di gioco ci sono anche dei nemici che se toccano il giocatore gli fanno perdere una vita.</li><li>i nemici sono anche molto utili: il giocatore può ucciderli facendogli cadere addosso le rocce. I nemici morendo esplodono, e l'esplosione è in grado di distruggere rocce e muri (ma non diamanti).</li></ol>\n<p>Sulla base di queste regole potete giocare questo simpatico puzzle-game, ma non solo: <strong>potete anche creare dei vostri livelli</strong> e <strong>pubblicarli </strong>da qualche parte (se volete li mandate a me ed io ve li aggiungo qui nella pagina itch) o <strong>inviarli </strong>ai vostri amici (<strong>grazie a Vincenzo Striano per l'idea!</strong>). Infatti, il livello è \"disegnato\" in un semplice file di testo (potete guardare CustomLevel.txt per vedere come è fatto). Per caricarlo nel gioco è sufficiente cliccare con il mouse sulla scritta \"Click here to load external level\" (per ragioni tecniche legate ai vari browser è necessario usare il mouse), quindi selezionare il file del livello che si intende giocare.</p>\n<p>Se volete costruire i vostri livelli, queste sono le indicazioni:</p>\n<ol><li>tutto il livello deve essere disegnato in <strong>25 righe</strong> di testo ed ogni riga deve contenere esattamente <strong>80 caratteri</strong> (vedi il file CustomLevel.txt)</li><li>occorre <strong>rispettare lo spazio previsto per l'HUD</strong> (vedi sempre il file CustomLevel.txt)</li><li>ogni livello deve contenere almeno <strong>il giocatore</strong> (A) e <strong>l'uscita</strong> (Q)</li><li>i caratteri utilizzabili (ed il loro significato) sono i seguenti:</li></ol>\n<ul><li>X (maiuscola) : muro infrangibile (le esplosioni non lo distruggono)</li><li>M (maiuscola) : muro frangibile (può essere distrutto da una esplosione)</li><li>O (maiuscola) : roccia</li><li>. (punto) : terreno</li><li>&lt;spazio vuoto&gt; : spazio vuoto (senza terreno né altri oggetti, rocce e diamanti possono caderci dentro e i nemici possono muovercisi)</li><li>d (minuscola) : diamante</li><li>E (maiuscola) : nemico che inizia il suo movimento verso sinistra</li><li>e (minuscola) : nemico che inizia il suo movimento verso destra</li><li>A (maiuscola) : posizione di partenza del giocatore</li><li>Q (maiuscola) : posizione del portale di uscita</li></ul>\n<p>Ho preparato due video che mostrano come risolvere (una delle possibili soluzioni) il gioco ufficiale ( <strong>*** ATTENZIONE SPOILER!! ***</strong></p>\n<p>) e il livello custom ( <strong>*** ATTENZIONE SPOILER!! ***</strong><br/></p>\n<p>), ma vi consiglio provare a risolverli da soli per non perdere il gusto della sfida (non sono eccessivamente complicati... poi quello custom l'ho derivato da quello ufficiale, in modo da potervi permettere di riciclare alcune delle tecniche già apprese, ma ovviamente i livelli custom possono avere qualsiasi aspetto e difficoltà).<br/></p>\n\n<p>Quindi, augurandovi buon divertimento con questo classico senza tempo, passo al prossimo argomento.<br/></p>\n\n<p>La prima delle librerie presenti nel progetto si trova nell'eventsheet <strong>libCRT</strong>.</p>\n<p>Si tratta di un vero e proprio <strong>emulatore </strong>della \"Text mode\" del PC, eventi Construct che ricostruiscono le routine del servizio 10h del BIOS (eccetto la riscrittura della matrice del video font e della reimpostazione dei 16 colori standard via RGB, limitazioni che sono <strong>aggirabili </strong>entrambi caricando a runtime una differente tileset in screen opportunamente modificata), le routine della libreria CRT di Turbo Pascal e quelle relative alla gestione video di GWBasic (tutte cose ormai sconosciute ai più).</p>\n<p><em>Tengo a precisare che il giochino non usa sprite o plugin esterni, ma esclusivamente l'emulatore da me realizzato.</em></p>\n<p>Perché perdere tempo a fare una cosa del genere? Le motivazioni, fondamentalmente, sono le seguenti:</p>\n<ol><li>Sono un inguaribile nostalgico... quando ho iniziato io a programmare sul PC (ed ho iniziato ben prima del PC), la modalità grafica, semplicemente, non esisteva... ed anche le interfacce a caratteri erano piuttosto limitate... ma quei tempi e quel modo di programmare è scomparso, ed è un gran peccato, perché il software, come tutto, ancora si basava sull'essere e non sull'apparire...</li><li>Ho voluto ancora una volta dimostrare quanto potente sia uno strumento ad eventi come Construct e quanto si sbaglino le persone ancora ad asserire che lavorare in Construct non è programmare...</li><li>La modalità testo è un fantastico strumento didattico... aiuta a focalizzare l'attenzione sulla logica e costringe a \"pensare\" per escogitare strategie per risolvere problemi di UI e UX invece di ricorrere alle solite scorciatoie fornite dalle modalità grafiche.</li><li>Il modo testo è un fantastico strumento per dimostrare che è possibile fare videogiochi con qualsiasi cosa, e che un videogioco, per intrattenere, non deve necessariamente avere milioni di colori e grafiche da film... quelle servono solo per avere successo facilmente e rapidamente, spesso con titoli che mancano totalmente di sostanza. Basti pensare a Rogue (</li></ol>\n<p>) un gioco fatto <em>in modo testo, senza l'ausilio dell'ASCII esteso, in bianco e nero, che ha dato il via ad una intera categoria di videogiochi</em> (i Roguelike).<br/></p>\n<p>La seconda libreria, nell'eventsheet <strong>libANSI</strong>, come dice il nome (a conoscerlo), implementa lo stack del terminale ANSI, limitatamente all'aspetto video.</p>\n<p>Prima di internet, per scambiare dati tra computer usavamo le BBS... una sorta di \"portali\" nati inizialmente per scambiare messaggi, poi estesa ai file, poi sono apparsi i primi giochini online... e in tutto questo, è nato (tra i tanti, come sempre) uno standard per i terminali, che consentisse di trasmettere, in maniera controllata, colori e animazioni. Era l'epoca dei terminali ANSI e del suo standard. E le BBS divennero il luogo in cui gli artisti digitali poterono pubblicare i loro primi \"murales\".</p>\n<p>Ancora oggi, sebbene ovviamente oramai quasi estinti, questi artisti hanno una loro nicchia e continuano a produrre (es. https://16colo.rs/)</p>\n<p>Ecco uno dei tanti video di esempio: </p>\n<p><em>Un bellissimo mondo fatto di 16 colori fissi, con forme costrette, che gli artisti più bravi riescono a moltiplicare con gli appositi caratteri \"retini\" e gli 8 prestabiliti colori di sfondo disponibili.</em></p>\n<p>Realizzo questa libreria augurandomi che a qualche pixel artist possa la cosa interessare, o addirittura stuzzicare!</p>\n\n<p>Il modo testo, o interfaccia a caratteri, oramai è passata di moda, anacronistica (anche se definire anacronistico qualcosa che ha meno della mia età mi fa impressione), ma suscita ancora grandi emozioni ed è fonte di grande ispirazione. Basti pensare al progetto ASCIIDENT, che ovviamente non è in modo testo, ma affonda a piene mani nelle sue radici. Un progetto che consiglio a chiunque di darci un occhio:</p>\n\n<p>Basta, ho scritto fin troppo... questo è il mio dono, a qualcuno sembrerà inutile, qualcun altro lo troverà prezioso sotto diversi punti di vista... a tutti loro dico buono studio e buon divertimento!</p>", "metacritic": null, "released": "2020-03-28", "tba": false, "updated": "2020-03-30T04:53:35", "background_image": "https://media.rawg.io/media/screenshots/41d/41db1c3aa27fd4618296bb4d7442d9b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fiaful"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}