{"id": 423633, "slug": "nekopunk-under-development", "name": "NekoPunk (under development)", "name_original": "NekoPunk (under development)", "description": "NekoPunk is currently under development.\r\n<p>I submitted a demo version in order to receive your feedbacks, before I go further in the dev! if you find a bug, please notice me, if you have a suggestion, please notice me! Oh, and this page is also under construction, so I will write a better description later. <strong>Please note! The Linux and Mac version have not been tested! </strong>They should work fine, but I can't test them myself. Also, this demo contains some placeholders and anything may be modified. Final version will be non-free.<br/></p>\r\nControls :\r\n<p>ZQSD or WASD to move.<br/>Left click to shoot.<br/>Right click to dash (it makes you briefly invincible).<br/>Escape to pause.<br/>E to buy something in the shop.<br/>Tab to switch weapon. <strong>(This system is for testing purposes, so enjoy while you can! In the final version, you'll start the game with only one weapon, and have to look for the other ones!)</strong><br/>Controls will be explained in game in a further update.</p>\r\nWhat is NekoPunk?\r\n<p>This is a roguelite where you play as Miss Cyanure, the ultimate weapon. A living weapon, a catgirl with a rifle, created to annihilate resistance. However, she refuses her fate so she attack her creators instead. Help her to escape the lab! And do some havoc by the way.</p>\n<p>The demo version contain 3 levels, each of these are procedurally generated. There are around 50 different rooms when I am writing this description. Of course, the final version will havee way more rooms.<br/></p>\r\nCredits :\r\n<p>Everything is an original idea from Franck Poulhon alias Frelon-K.<br/>Softwares used:</p>\n<p>Unity Engine<br/>FamiStudio<br/>Aseprite<br/>Visual Studio<br/>BitFontMaker2<br/></p>\r\nKnown Issues to fix.\r\n<ul><li>Doors are sometimes open even when there are living foes in the room.</li></ul>", "metacritic": null, "released": "2020-03-28", "tba": false, "updated": "2020-03-30T04:54:09", "background_image": "https://media.rawg.io/media/screenshots/212/212aacc6ed8ff5e0151053028bcf9f3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Frelon-K Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}