{"id": 423963, "slug": "tuning-club-online", "name": "Tuning Club Online", "name_original": "Tuning Club Online", "description": "<p>Tuning Club Online is a unique racing game in real time via the network. Stop racing the rival ghosts or bots. Build your car, fight with friends and rivals around the world.<br />\n►VARIETY OF MODES<br />\n- Have a free ride and chat with friends;<br />\n- Push maximum power in the speed race;<br />\n- Leave smoking trails on the track in drift mode;<br />\n- Fight for the crown in crown hold mode;<br />\n- Don’t let anyone catch you up in a bomb mode;<br />\n►ARCADE<br />\n- Pick up boosters on the levels to slow down your opponents, earn money, get nitro, pick up the crown or arrange a real bombardment;<br />\n►VISUAL TUNING<br />\n- Put bumpers, body kits, hoods, spoilers, apply vinyls or skins, choose tires and wheels;<br />\n- Create your own unique style with skins, cop lights, clown heads, crazy tailpipes and more;<br />\n►ENGINE TUNING<br />\n- Build an engine to fit your playing style;<br />\n- Combine rare details and their unique qualities;<br />\n- Put the piston, crankshaft, camshaft, flywheel and other parts;<br />\nE36, RX7, Skyline, Evolution - and this is just the beginning of the list of legendary cars for tuning in this multiplayer game. Over a million combinations are there to bring your ideas to life. Gather your collection of cars and their parts to become the champion in the arena.</p>", "metacritic": null, "released": "2020-03-23", "tba": false, "updated": "2022-01-09T11:52:22", "background_image": "https://media.rawg.io/media/screenshots/3e5/3e55a88fbbf2ce26ed422b47680c6273_a465SzM.jpg", "website": "", "rating": 4.0, "rating_top": 5, "added_by_status": {"owned": 6, "toplay": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 8, "platforms": ["Android", "iOS"], "developers": ["Maxim Tatarchenko"], "genres": ["Simulation", "Racing"], "publishers": ["Maxim Tatarchenko"], "esrb_rating": "Everyone 10+"}