{"id": 423987, "slug": "garrys-city", "name": "Garrys City", "name_original": "Garrys City", "description": "Garrys City is the real action thrilling game for all the lovers of the simulator games. Come and enjoy the city with different challenges to face as the real hero. You are put on various missions lately. Enter into the sphere of liberty and play different types of the real crime city gangster. Start your ride as the real crime gangster hero and start missions against the godfathers and crime lords. \u2028Play this Garrys city game. You are freely moved in the city and discover the city with the help of map. Experience the best thug life that you have not been experienced before. Complete the missions in the endless mode in which you can discover city freely. Add some adventure in the Garrys city game. Use the guns, bikes, cars and much more to explore the Garrys city.<br/>Garrys city game gives you the opportunity to enjoy the taxi driver life within the game  you can drive taxi as well\u2028Play the most wanted real mafia life and discover all places in the Garrys city. Move around freely in the Garrys city. Get into the car and complete the missions with stealthy transports like, car, and motor-bike. You can use different type of police guns and upgrade your equipment with the game shop. Accept the challenges and complete them. \u2028You can enjoy the driving of car and riding of bike while playing Garrys city Game.<br/><br/>\u2028FEATURES\u2028<br/><br/>-Car driving<br/>-Motor-bike Riding<br/>-Explore the Garrys city<br/>-Engaging gameplay sound effects\u2028-Upgrade player<br/>-Upgrade your guns and other equipment<br/>- Enjoy the Taxi Ride", "metacritic": null, "released": "2019-11-09", "tba": false, "updated": "2020-04-03T02:12:04", "background_image": "https://media.rawg.io/media/screenshots/f8d/f8d7ec4732c15fd61cd68dfbd31d6618_aZxzOFJ.jpg", "website": "http://justmyapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hussain Barakat"], "genres": ["Adventure", "Simulation"], "publishers": ["Hussain Barakat"], "esrb_rating": "Teen"}