{"id": 423953, "slug": "final-assault-2020", "name": "Final Assault (2020)", "name_original": "Final Assault (2020)", "description": "Final Assault is an action packed, WWII themed RTS built from the ground up to capitalize on the power of VR. Tower over the battlefield as war rages around you in 360 degrees. Command jeeps, tanks, and artillery in massive ground battles as the skies erupt in bullets, flak and dynamic dog fights. Execute air strikes and bombing runs as you advance your troops towards enemy territory. Control your units by drawing paths for precise, direct combat. Strategic decisions have consequences that require quick thinking and fast VR reflexes. This new approach to classic RTS gaming utilizes compelling and immersive gameplay that can only exist in VR. Jump into the combat. Fight the battle, win the war!<br/><br/><br/><br/>Online features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/><br/>1 player<br/>Network Players 2-2 - Full game requires PlayStation®Plus membership to access online multiplayer<br/>Online Play (Optional)<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/>2 PS®Move controllers required<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2020-03-31", "tba": false, "updated": "2020-04-03T01:58:31", "background_image": "https://media.rawg.io/media/screenshots/ed9/ed9fa30480ace2047ebb2da765a264ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 509, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}