{"id": 423985, "slug": "aces-of-the-luftwaffe-squadron-2", "name": "Aces of the Luftwaffe Squadron", "name_original": "Aces of the Luftwaffe Squadron", "description": "The Squadron has reached your mobile device! Dodge a bullet storm and face fearsome aerial war machines! Lead your squadron to victory in two different campaigns, full of story twists and legendary boss fights!<br/><br/>ACES OF THE LUFTWAFFE - SQUADRON is an action-packed vertical scrolling shoot‘ em-up with a fascinating and fully voiced narrative. Dodge bullets, collect massive power-ups and wisely use special abilities to defeat your enemies. Two campaigns with 50 levels in total, waves of various deadly enemies and a lot of epic boss fights. Are you up to this task?<br/><br/>When Europe seemed to be free, a secret German commando called The Aces of the Luftwaffe took their chance to strike back and invade the USA! It’s your duty to restore peace and liberty aboard deadly wings of steel in bombastic air battles! However, every story has two sides. While the Aces of Luftwaffe begin their assault on the United States, you are charged with leading a squad of elite German pilots on a secret mission. Embarc on an epic aerial adventure of intrigue and deceit from a secret base in the Bermuda Triangle. Choose your side, decide your role and take off!<br/><br/>- Action-packed Shoot ’em up with explosive special effects<br/>- Heroic NPC wingmen that will follow your order<br/>- Skill trees with individual abilities for each wingman<br/>- Challenging achievement system<br/>- Captivating storyline with fully voiced characters<br/>- 50 levels and exciting missions <br/>- 12 spectacular boss fights<br/>- Epic movie-like orchestral soundtrack", "metacritic": null, "released": "2020-02-27", "tba": false, "updated": "2020-04-03T02:11:26", "background_image": "https://media.rawg.io/media/screenshots/fbc/fbc2412defb3a8432568135a4c7cf23a_gDD4awg.jpg", "website": "https://handy-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Handy Games"], "genres": ["Action", "Simulation"], "publishers": ["www.handy-games.com"], "esrb_rating": "Everyone 10+"}