{"id": 423965, "slug": "devil-hunter-eternal-war", "name": "Devil Hunter: Eternal War", "name_original": "Devil Hunter: Eternal War", "description": "The roar of the Giant Gorilla resounded through the heavens and the earth, declaring an end to the legend of the Giant Roc.<br/>The war between Giant Gorillas and Giant Rocs was just... a nightmare. With the end of this ancient war, the two hegemons disappeared from public memory, and the Three Realms began a new chapter.<br/>Nowadays, the world is mixed with bad and good; immortals and devils. What does the future hold for the current Three Realms? Perhaps, it's up to you!<br/><br/><br/>- Game features<br/><br/>▲ Autoplay：Autoplay can help you to do daily requests, kill monsters and loot Bosses! All you have to do is figure out a way to manage this messy world.<br/><br/>▲ Mounts and Pets：Hundreds of cool Mounts and Pets never leave you or forsake you. Their loyalty helps you dominate the whole world. Flying dragons, rhinos, giant scorpions, pegasi, dinosaurs, and even high-tech motorcycles... You can find almost everything you can think of, and they can meet all your needs.<br/><br/>▲ World Boss：Battle against the strong World Boss with players around the globe. At this moment, your kindness to others is cruelty to yourself. Kill other players to loot the Boss's treasures; various outfits and ultimate materials await!<br/><br/>▲ Cross-server PVP：Plan well and fight together with your guild members, or even former enemies on the cross-server battlefield to occupy limited-resource tiles and honor the guild you represent!<br/><br/>▲ Perfect Immortal Couple：While fighting alone in the world of immortals and devils, you might feel lonely sometimes. Why not go find your perfect match, and achieve the immortality together? This way, you can get twice the results with half the effort. At the same time, you can also go hand-in-hand and enjoy an amazing view of the Three Realms.<br/><br/>▲ Rich Gameplay：Unexpected Fortune, Sincere Words, Guild Contests, The Peaks of Mount Kunlun...A variety of gameplay types await you every day! On the way to achieving immortality, you will never be bored!<br/><br/>Follow our offical Facebook Fanpage to get the latest game news: <br/>https://www.facebook.com/DevilHunter.Eternalwar/<br/>http://devilhunter.centurygame.com/", "metacritic": null, "released": "2020-03-31", "tba": false, "updated": "2020-04-03T02:03:45", "background_image": "https://media.rawg.io/media/screenshots/aca/acaf2b6dd8b3d7b0b1e79eb2629e6352_FEJkGqc.jpg", "website": "http://devilhunter.centurygame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Upshot Video"], "genres": ["Action", "RPG"], "publishers": ["CQGAMING INTERACTIVE"], "esrb_rating": "Everyone 10+"}