{"id": 424190, "slug": "the-cool-communtiy-app", "name": "The Cool Communtiy App", "name_original": "The Cool Communtiy App", "description": "<p>The Cool Community App allows users to instantly launch the app. The app has a blog and a chat. The Cool Community App is an APK and will only run on specific devices. It runs on ANY Fire TV device and Android TV (which can be installed on a Smart TV).<br/></p>\n<p>The Cool Community App is also on every Android device. In all which you need to download the same APK file. </p>\n<p>If you are on PC you can get the Cool Communtiy App just by getting BlueStacks.</p>\n<p><strong>Minimum system requirements for BlueStacks</strong></p>\n<ul><li>OS: Microsoft Windows 7 and above.</li><li>Processor:  Intel or AMD Processor.</li><li>RAM: Your PC must have at least 2GB of RAM. (Note that having 2GB or more disk space is not a substitute for RAM)</li><li>HDD: 5GB Free Disk Space.</li><li>You must be an Administrator on your PC. </li><li>Up to date graphics drivers from Microsoft or the chipset vendor.</li></ul>\n<p>BlueStacks 4 will work on systems that fulfill the minimum systems requirements. </p>\n<p>However, for a superior gaming experience, Recommended System Requirements are mentioned below.</p>\n<p><strong>Recommended system requirements for BlueStacks</strong></p>\n<ul><li>OS: Microsoft Windows 10</li><li>Processor: Intel or AMD Multi-Core Processor with Single Thread PassMark score &gt; 1000 and virtualization extensions enabled in the BIOS (<strong>see help</strong>). Click on <strong>this link</strong> to find the single thread Passmark score of your PC's processor.</li><li>Graphics: Intel/Nvidia/ATI, Onboard or Discrete controller with PassMark score &gt;= 750. Click on <strong>this link</strong> to find the Passmark score of your PC's graphics controller.</li><li>RAM: 8GB or higher</li><li>HDD: SSD (or Fusion/Hybrid Drives) </li><li>Internet: Broadband connection to access games, accounts and related content.</li><li>Up to date graphics drivers from Microsoft or the chipset vendor.</li><li>We do not recommend installing the BlueStacks App Player if you have a virtual machine, e.g., Microsoft Virtual PC, VMWare Workstation, or Oracle Virtualbox, installed on the same PC.</li></ul>\n<p>BlueStacks is an American technology company that produces the BlueStacks App Player and other cloud-based cross-platform products. The BlueStacks App Player is designed to enable Android applications to run on PCs running Microsoft Windows and Apple's macOS. (It is an Android Emulator).</p>\n<p>If you do not want to install it that way you can get it through Google Chrome. Press the 3 dots in the up-right corner of your screen, then press More Tools and Create Shortcut.</p>\n<p>There is also an online emulator of the app. No storage of your device will be taken from it. Personally, I would recommend using the emulator before downloading the APK file.</p>\n<p>WARNING: If you are planning to install any APKs to your device. They can be harmful. This app has been tested before being released, it is safe.</p>", "metacritic": null, "released": "2020-04-02", "tba": false, "updated": "2020-04-03T02:59:46", "background_image": "https://media.rawg.io/media/screenshots/f96/f9676b60e0fd51ff9b7fb303d29759a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Cool Community"], "genres": [], "publishers": [], "esrb_rating": null}