{"id": 4241, "slug": "lego-harry-potter-years-5-7", "name": "LEGO Harry Potter: Years 5-7", "name_original": "LEGO Harry Potter: Years 5-7", "description": "<p>LEGO Harry Potter: Years 5-7 is an action-adventure utilizing LEGO thematics and mechanics. The game is the part of the vast LEGO franchise and is released by Traveller&#39;s Tales — the studio specializing in LEGO since 2006. This is the second part of the Harry Potter LEGO arc with the first one being Years 1-4 title.</p>\n<h3>Gameplay</h3>\n<p>The game features mechanics same for all of the LEGO games — the core characteristic of them is collecting LEGO blocks while proceeding through the levels: the environment can be destroyed to some extent (basic surroundings like grass and walls are indestructible), the crafting part looks like an assembly of a constructor kit. <br />\nThe title implements conditionally open world consisting of various locations reminiscent from the original book. The player can travel between locations after the completing of the main story to mop up the collectibles and find an interaction that was earlier inaccessible due to lack of special powers and moves. Such skills are usually acquired within the first playthrough. The game does not feature an online multiplayer, unlike its predecessor.</p>\n<h3>Story</h3>\n<p>The plot of the game generally follows the last three books and four films about the Harry Potter&#39;s adventures. The game starts with events depicted in The Order of the Phoenix film and ends with a fight with Lord Voldemort.</p>", "metacritic": 80, "released": "2011-11-11", "tba": false, "updated": "2024-04-20T09:00:30", "background_image": "https://media.rawg.io/media/games/6ad/6ad0779bd730077eb28aa3a50394ed5c.jpg", "website": "http://harrypotter.lego.com", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 106, "owned": 1447, "beaten": 281, "toplay": 47, "dropped": 61, "playing": 18}, "playtime": 4, "achievements_count": 91, "ratings_count": 271, "suggestions_count": 615, "game_series_count": 4, "reviews_count": 274, "platforms": ["Android", "macOS", "PC", "Wii", "Xbox 360", "PlayStation 3", "Nintendo 3DS", "PSP", "PS Vita", "Nintendo DS"], "developers": ["Feral Interactive", "Warner Bros. Interactive", "Traveller's Tales", "TT Fusion"], "genres": ["Action"], "publishers": ["Feral Interactive", "Warner Bros. Interactive", "ak tronic Software & Services"], "esrb_rating": "Everyone 10+"}