{"id": 424119, "slug": "smut-dungeons-mega-bundle", "name": "Smut Dungeons Mega Bundle", "name_original": "Smut Dungeons Mega Bundle", "description": "<p>The Smut Dungeons Mega Collection is a collection of erotic fantasy text adventures containing interactive love-making scenes. This bundle contains ALL of the Smut Dungeons stories together in one tight package ;)<br />\nThe Adventures:<br />\nDesert Wind: The heat of the desert is wild and oppressive. As you venture through the sandy wastes, you come across an oasis. Stopping for a drink and a quick dip, you soon find that you&#39;re not alone... and you quickly find yourself in the hot embrace of a bronze-skinned god.<br />\nNaughty Nymphs: After a hard day of travel, you find yourself in a hidden grove surrounded by beautiful woodland nymphs. They have a request to make of you... will you fulfill their desires?<br />\nPalace of Pleasures: The Palace of Pleasures is a place where you can fulfill all of your desires. In a world ravaged by disease, the pristine palace is a place to go to escape reality for a while and enjoy the small (or big) things in life.<br />\nPools of Wonder: After a stressful week at work, you have decided to take a little vacation. On the outskirts of the village lies a hidden grotto filled with magical, rejuvenating pools. You pack a few things and leave the village early in the morning, hoping to find peace and quiet for a while. What you find is more than you were expecting...<br />\nSamurai&#39;s Kiss: After a morning of sweaty exercise you decide to bathe in the river. I wonder if anyone will join you?<br />\nTemple of the Barbarian Queen - The sexy barbarian queen has summoned you to her chambers. You&#39;d better do as she bids.<br />\nDen of the Saber Cat - You and your childhood best friend have found yourselves trapped in the den of a vicious saber cat! If you can&#39;t defeat the beast, you&#39;d better find another way to keep yourselves entertained.<br />\nRavager - A barbarian warlord called The Ravager is pillaging and plundering the village. Perhaps you can convince The Ravager to go home without using violence...<br />\nStarship Desire - The starfleet has been destroyed! Now you and Captain Magma are stranded on a derelict spacecraft, drifting through space all alone... whatever will you do?<br />\nSlow Ride: You&#39;re riding through Skull Canyon when suddenly you&#39;re accosted by a group of sexy bandits. Whatever will you do?<br />\nViking Princess: You&#39;ve spent your whole life in the palace, being told what you can and cannot do. One night you sneak out and explore the mysteries of the public bathhouse...<br />\nSoaking Wet: This wasn&#39;t the first time I&#39;d ventured outside completely naked, but it was the first time I&#39;d gotten caught. I could remember dozens of times when I was in college when I&#39;d gone streaking on the beach, skinny dipping in the hot tub, or simply taken off my clothes and walked naked through the woods. But this... this was something else. Just thinking about my past exploits got me all hot and bothered. And lying next to this stranger in the rain... soo hottt!<br />\nCaught in the Shower: You have always been an extremely athletic woman, and so you spend much of your time in the gym. Tonight you&#39;ll be going on a special date, but you live too far away, so you need to shower off in the gym before meeting the lucky stud. There&#39;s just one problem- the women&#39;s shower is out of order! Looks like you&#39;ll need to sneak into the men&#39;s shower and hope nobody comes in while you&#39;re wet and naked...<br />\nStorm Clouds: You and your friends are celebrating spring break at the beach. The weather is beautiful and you&#39;re all low-key admiring each other in your bathing suits. But when a sudden storm rolls in, you find yourselves splitting up and running for cover. When you find shelter in a nearby sea-cave, you look back and realize that only one person followed you, while everyone else took off in another direction. The girl in the cave with you is a beauty wearing a skimpy little bikini. The air is turning cold, and the two of you are soaking wet... better get those clothes off so they can dry!<br />\nNew Hire: As a multi-billionaire, your life is basically perfect. There&#39;s just one thing missing- you are in dire need of a new personal assistant. Normally you&#39;d leave the hiring process to your underlings, but you need this assistant to be perfect in all the right ways. When a hot new applicant applies for the job, you call her in for a private interview.<br />\nSecret Retreat: Work is stressful. You&#39;ve been working as a secretary for years, but it seems like you can never get ahead. Recently, you were invited to a company retreat by your billionaire boss. Curiously, you realize that the date on your invitation is wrong... it seems like he&#39;s asked you to show up a few hours early for a special thank you gift.<br />\nBlackmailed: You would never do anything to hurt your wife. You&#39;ve given her everything she could ever want because you&#39;re filthy stinkin&#39; rich. But when you get caught fooling around, you find that you&#39;ll need to act quickly in order to stop your dirty secret from getting out... and that may involve keeping your naughty co-workers satisfied with more than just paychecks.<br />\nSecret Rendezvous: Your marriage is stale and you long for the thrills of your youth. After meeting a charming stranger at the supermarket, you plan a secret getaway to let loose.<br />\nBound and Obedient: You didn&#39;t get where you are today by being smart and hard-working- you got here by sleeping with all the right men! But when you climb too high, you&#39;ll find that some billionaires have terrifying desires...<br />\nTicket to Nowhere: You can&#39;t afford to flunk this class or your life will be ruined! You&#39;d better get into the professor&#39;s office and see if there&#39;s anything you can do to bring your grade up.<br />\nFarthest Depths: Your crew has been assigned to probe the farthest depths of space. But when a bunch of horny men and women are stuck together on a space ship millions of lightyears away from Earth, things are bound to get freaky.<br />\nEruption on Uranus: You have crash landed on Uranus! The volcanoes in the planet&#39;s surface are erupting, and you have nowhere left to run. This may very well be your last night in this universe. Better not waste it!<br />\nRings of the Moon: You have been reassigned to the most boring job in the galaxy: working on the moon base. If you don&#39;t find some way to entertain yourself, you&#39;ll probably die of boredom. Luckily, the base is filled with hunky dudes looking for some action.<br />\nSamurai&#39;s Touch: As a simple farmgirl, you have always believed that you would live a simple life devoid of thrills and adventure. That all changed when a new, handsome warrior came to town...<br />\nEndless Time: You have discovered a watch that can freeze time! Try not to do anything too naughty with it... (Note: Contains time freeze/noncon/dubcon scenarios.)<br />\nClouds of Bliss: For centuries, the noble Cloud Giants have watched over the world from their sky towers. Few have been given the chance to meet these mysterious beings, but those who have find that their lives are forever changed. You are about to find yourself in a very rare and lucky situation...</p>\n<hr />\n<p>Hi! I&#39;m Britt and I write Smut Dungeons, a series of erotic fantasy adventure stories featuring slutty secretaries, alpha billionaires, hunky barbarians, dashing space cadets, and naughty schoolgirls. My text games are overflowing with hot, naughty scenes to get you in the mood. Nothing turns me on like writing kinky smut and fantasizing about hot-bodied, powerful men sweeping me off my feet and having their way with me - SO HOT! ;)<br />\nRead more of my smut here!!<br />\nPlease note these games are for Adults Only (18+)!</p>", "metacritic": null, "released": "2020-04-02", "tba": false, "updated": "2022-07-04T12:25:24", "background_image": "https://media.rawg.io/media/games/e45/e457d3036a6df67ac8f711bf98a2e833.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["smutdungeons"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}