{"id": 424377, "slug": "quest-for-coin", "name": "Quest For Coin", "name_original": "Quest For Coin", "description": "<p>Quest for Coin\r\n  </p>\n<p>Story: Sir Ghost-A-lot needs to gather money in order to buy equipment to help Arthur on his journey. After wondering through the woods, he loses his weapons and armor while falling down a steep hill and into a swamp. Upon seeing that all everything is useless; he begins to hastily search the woods for some spare change to buy new stuff in the next town. Luckily, the equipment he needs is very cheap and all he’ll need is roughly 3 coins to replace everything. With luck he stumbles into an area containing three coins, but he’s not alone. Blocking his path to each coin is a giant bee. Now he must avoid getting stung while attempting the grab every coin in the area. After he succeeds, he is free to resume his travel to meet up with Arthur.\r\n  </p>\n<p>Mechanics: In this game the player succeeds by collecting all of the collectibles on the map. The player must avoid the enemies in order to get to the objective and win. There is no weapon that the player can use to kill the enemies on screen. The character has a health bar of 3. This means that the player can only afford to take three stings from a bee before they die and must try again. The player can move in about eight directions using the arrows on their computer. The game takes place within a limited space, with walls that prevent them from wondering off the map. After the player achieves the objective, they win the game.   </p>\n<p>Assets: This game is made using Unity Playground. The game is a top-down adventure style that uses 2D sprites. There’s only a single map that is used for this game. It uses collision-based physics that give the impression of interaction between the playable character, the environment, and the enemies. This is meant to be an abridged version of what a full-length version of the game would look like. \r\n</p>", "metacritic": null, "released": "2020-04-01", "tba": false, "updated": "2020-04-03T03:39:05", "background_image": "https://media.rawg.io/media/screenshots/c7f/c7f1f6d97fe0ccada770a74b096b60da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cole Waldon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}