{"id": 424527, "slug": "vertigo-itch-magmasubterraneo", "name": "Vertigo (itch) (magmasubterraneo)", "name_original": "Vertigo (itch) (magmasubterraneo)", "description": "<p><em>Vertigo</em> was created for the Isolation #BitsyJam</p>\n<p>Thank you for playing! </p>\n<p>I'm always kind of an overthinker, but these days of Isolation have had me in a hyper-contemplative mood. I wanted to do something close to what's been roaming in my head, mostly to let it out (this to say I'm sorry if it gets weirdly personal). I know I'm not the only one who feels vertigo when they look inside too much.</p>\n<p>This is my first Bitsy Jam and I'm very excited. Please let me know if you find any bugs. I'd love to read what you think.</p>\n<p>I'll upload an Spanish version as soon as I can ❤️.</p>\n<p>The music is Infancia, by Gerry Weil.</p>\n<p>Now ✨ fun facts ✨</p>\n<p>* The position of the stars in the first space room is my attempt to recreate the actual sky from last Sunday (March 29, 2020).</p><p>* The quote from Moby Dick is from chapter 32 \"Cetology\".</p><p>* The quote from Don Quixote is from the Prologue (Which I could 100% copy and paste here to express my feelings towards this game haha).</p>\n<p>* The music the turntable is playing is <em>In Between Days</em>, by The Cure.</p>\n<p>* This is the poem at the beginning, by Rafael Cadenas (Sorry I don't have a full version in English).</p>\n<p>Special thanks to Jaime Yañez (caballitodefuego) for leading the way to Bitsy and supporting me and to Claudia for being my beta tester.</p>\n<p><em>Made using Adam Le Doux's life-saver engine Bitsy. </em><br/></p>", "metacritic": null, "released": "2020-04-01", "tba": false, "updated": "2020-04-03T04:16:01", "background_image": "https://media.rawg.io/media/screenshots/4c9/4c98c6b802be8677f2e628c26528f433.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["magmasubterraneo"], "genres": [], "publishers": [], "esrb_rating": null}