{"id": 424703, "slug": "ominous-2", "name": "Ominous", "name_original": "Ominous", "description": "<p>We are creating an old school adventure plarformer with a modern touch. Right now we are releasing an old version of \"Ominous\", in anticipation of the revamped game.</p>\r\nCurrent status\r\n<p>\"Ominous\" is in Active development, we added dynamic lighting, revamped most of the graphics, added new mechanics, sound, etc! \r\nStay tuned for the new release!<br/></p>\n\r\nCredits\r\n<p>We are <strong>Crane51</strong>, a team of 4:<br/><br/>  <strong>Nataša </strong>(programmer)<br/><strong><br/>Vedran </strong>( Level/Game design )<br/><br/><strong>Jurica </strong>( art )</p>\n<p><strong>Matija (sound)</strong><br/></p>\n<p>And Mirko (Who actually programmed the game :D)<br/></p>\r\nControls:\r\n<p><strong>E</strong> to use<br/><strong>S</strong> to sneak<br/><strong>D</strong> to punch</p>\n<p><strong>Space</strong> to skip intro<br/></p>\n<p>Controllers supported.<br/></p>\n<p>mouse for the menus (sorry!)</p>\n\r\nThe Story\r\n<p>Ominous is a 2D pixel art adventure platform game. The main character is Gowan McDerrick who pursuits artifacts all over the world, from Mongolian monasteries to Mayan tombs. During that journey, Gowan reveals the world of mysticism, intrigues and history, and for the first time, he comes to know himself.<br/>Gowan’s journey starts during Great Britain’s Edwardian era with an invitation from old friend and commander, Brigadier-General Sir Edward Bellingham. <br/>During the first part of second Boer war, in the middle of fighting, Sir Edward fell into the ground and nobody seen him for ten days. Scouts found him three miles north from camp, and what strange, five mile in the east from the hole he fell in. Few weeks after accident, Sir Edward had to leave for England. The consequence of falling into the hole was broken spine. Doctors in South Africa agreed that he would never walk again. Gowan saw how Sir Edward has become grim and depressed, focused only on an Egyptian manuscript he found in the tombs bellow the lost city of Kweneng. <br/> When the invitation arrived, Gowan was highly decorated soldier with a rank of corporal and he got a leave in London. With only few weeks of contract he needed to decide if he would leave the army of take another tour. He took the room in a dosshouse on shores of Thames and thought about new tour in India. <br/></p>\n<p>However, life is strange...</p>\r\nContact us!\r\n<p>If you would like to support us you can join our discord server, parteon, or twitter to help us bring this game to life :)<br/></p>\n<p>Our discord server:<br/>https://discord.gg/ucPSfSQ<br/></p>\n<p>Support us on patreon:<br/>https://www.patreon.com/OminousGame<br/></p>\n<p>Check out our twitter screenshots from the new version:<br/>https://twitter.com/OminousGame</p>\n<p>Facebook:<br/>https://www.facebook.com/ominousgame/<br/><br/>Downloadable version is recommended:<br/>https://drive.google.com/open?id=10LRY23TeSjlQ1DUGTStmqV4mmlcNdL8K<br/><br/></p>", "metacritic": null, "released": "2020-03-31", "tba": false, "updated": "2020-04-03T04:55:43", "background_image": "https://media.rawg.io/media/screenshots/b3c/b3c18c2769a39ccc5f130490bc9cce61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Crane 51", "frulica"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}