{"id": 424823, "slug": "isolate-2", "name": "Isolate!", "name_original": "Isolate!", "description": "<p>This is a pseudo-simulation game demonstrating the spread of a contagion that can go undetected much like COVID-19.  It is played in discrete sessions of under 2 minutes.</p>\n<p><em>I wanted to create a potentially engaging way to illustrate the importance of social distancing and isolating sickness, as well as how impactful it is to allow illness to spread in areas of high population density.</em><br/><br/></p>\n<p><strong>INSTRUCTIONS:</strong></p>\n<p><strong>Left click (and drag) to place a circular quarantine zone.<br/></strong><strong><em> </em></strong><em>Larger zones disappear faster. A quarantine dramatically reduces the speed of entities inside and around it, and has a chance to prevent entities from moving in or outside of the circle. Older zones are less effective at containing entities. <br/></em></p>\n<p><strong>Use right click to reveal sickness in a small radius temporarily. </strong><br/><em>Revealed entities will be color-coded according to their health status. Like testing, this is a way to find sick entities that may be asymptomatic.</em><br/></p>\n<p><strong>Escape returns to the menu.</strong><br/><em>At the menu you</em><em> can change the population density, and select the ability mode: either 100 uses that never regenerate, or 5 uses that regenerate once every couple seconds.<br/></em></p>\n<p><strong>PASSIVE GAMEPLAY DETAILS:<br/></strong></p>\n<p><strong>Vaccine Timer</strong><br/><em>After 90 seconds a vaccine is created that ends the game. All symptomatic entities will immediately recover or die and the score will be calculated.<br/></em></p>\n<p><strong>Unrevealed Entities<br/></strong><em>Blue entities have no symptoms but may still be sick, and even contagious. Once entities become symptomatic, they turn red (contagious) and eventually orange (noncontagious), before recovering or dying.</em></p>\n<p><strong>Mortality Rate</strong><br/><em>When an entity becomes symptomatic, it will soon either recover or die. The chance of death is increased for every other symptomatic entity on the field. This chance is calculated when it first becomes symptomatic.<br/></em></p>\n<p><strong>Contagion<br/></strong><em>When an entity enters personal space (a distance roughly their size apart) of a contagious entity, they are exposed to the virus and may become sick.  This chance is increased if they physically touch. Entities will also increase their chances of becoming sick the longer they are near a contagious entity. No entities will spontaneously manifest infection, they only become sick through interacting with contagious entities.<br/></em></p>\n<p><strong>Origin of Infection<br/></strong><em>There are 3 infected entities at the start of every session. All other infections occur because of the interactions that unfold. <br/></em></p>\n<p><em>If you act early enough,  with enough testing and isolation, you can significantly reduce the impact of the virus. This is very difficult in areas of large groups, as is demonstrated when the population density is increased.</em></p>\n\n<p><strong>DEVELOPER NOTES<br/></strong></p>\n<p>This game was originally a curiosity I decided to 'finish' and put online. I recognize and apologize that it is not accessible, due to its heavy reliance on color for gameplay. I am interested in creating a proper, accessible build soon.<br/></p>", "metacritic": null, "released": "2020-03-31", "tba": false, "updated": "2020-04-03T05:22:56", "background_image": "https://media.rawg.io/media/screenshots/ddf/ddf0e888469cc36a4f5bc2055bb3a6df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["valkymaera"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}