{"id": 424881, "slug": "hexagonal-game-of-life", "name": "Hexagonal Game of life", "name_original": "Hexagonal Game of life", "description": "<p>In English</p><p>The game of life is a cellular automata proposed in the 70s by John Horton Conway.</p><p>It is a zero players game, it means that its evolution is determined by its initial state and it doesnt need any input.</p><p>In this version an hexagonal cell is used instead of the original square one.</p><p>The player can change the survive and born ranges. The idea with this tame is the player tries different values and initial state to observe how the automata behaves. </p><p>https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life<br/></p><p><strong>If you discover an interesting pattern please submit a screenshot on the comments. </strong></p><p>En Español!</p><p>El juego de la vida es un autómata celular propuesto en los años 70s por John Horton Conway <br/></p><p>Se trata de un juego de cero jugadores, lo que quiere decir que su evolución está determinada por el estado inicial y no necesita ninguna entrada de datos posterior.</p>\n<p>En está versión usamos una célula hexagonal a diferencia de la original que es cuadrada. <br/></p>\n<p>El jugador puede modificar los rangos en los cuales se define si una célula vive, muere o nace. La idea del juego es experimentar con diferentes valores y observar como se comporta el autómata.</p>\n<p>https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life</p>\n\n<p><strong>Si consigues un patrón interesante por favor sube un screenshot en los comentarios.<br/><br/>Tema/Trabajo futuro</strong>: Inicialmente estaba propuesto experimentar con este espacio hexagonal para validar un videojuego de puzzles donde el jugador debe agregar diferentes átomos o células que generen una reacción en cadena en el nivel. sin embargo me entretuve con la implementación técnica.</p>\n\n<p>Hecho con &lt;3 en Godot Engine 3.2</p>\n<p>Como siempre el código es open source y está disponible en Github: https://github.com/agar3s/cgdj-2020<br/></p>", "metacritic": null, "released": "2020-03-31", "tba": false, "updated": "2020-04-03T05:35:46", "background_image": "https://media.rawg.io/media/screenshots/467/4670ce1768f38bb5b5032dcebf2edbf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Agar3s"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}