{"id": 425003, "slug": "balancing-cats", "name": "Balancing Cats", "name_original": "Balancing Cats", "description": "<p>Learn how to play and post any ideas on Balancing Cats page:</p>\n<p>     http://bit.ly/BalancingCatsOnFacebook</p>\n<p>More on how it looks like - gameplay video:                </p>\n\n<p>IMPORTANT:     Please update/install Google Games once and sign in to see Top Cats leaderboard. It's only to make game a lot more fun. </p>\n<p>We promise - this increases fun and addictivenes, it will still allow You to relax during Balancing Cats gameplay. Google SDK asking permissions on Level 7 to allow convenient competitive leaderboard. </p>\n<p>Safe way to buy additional Boosts - Google Billing, just add payment method and You will see prices in local currency. <br/>No need to buy to play, only for enjoying Balancing Cats - funny nice black cat game. Thank You for understanding.</p>\n<p>[Story of Balancing Cats]<br/>You are a cute cat. Your human left You alone to guard home while he's away. What do cats do then? Bad things? No, not this cat, cute little kitty. This Balancing Cat is here to help! Are You up for a challenge?</p>\n<p>First cat is a black one... more cats coming soon. Leave cats or room suggestions in a review or on Facebook.</p>\n<p>Firstly, kitchen is clean and redecorated. Please catch all falling food, so Your human happily finds kitchen clean when he's back. </p>\n<p>Please be a good kitty and defend Your room from dirt. We made it free and with no ads. Download now! </p>\n<p>[More about Cats game]<br/>Is it easier to balance balls? Or stack cats? Come on, tap only once and play using accelerometer. </p>\n<p>That is a lot of fun. It's physics based game with a cute cat (like You probably). </p>\n<p>Food tray is on cats head, so please help to balance food from falling. </p>\n<p>Cats are naturally good at it, but are You up for challenge? A competition with a friend? Top cats - score leaderboard awaits.</p>\n<p>[Balancing] <br/>Watching food falling or moving phone will not help You with Your diet, but You will surely have fun with this cat game.  Kids will like this game too. Especially sounds :)</p>\n<p>Cats are one of favorite pet, games like this are rare. In this balancing game there is a lot of fast reaction situations (cats do that) for Your unique strategy to guide You to the Top cat online.</p>\n<p>This is completely unique cats game with first one cute cat. Black cat, but she is very lucky.</p>\n<p>Have You seen how cutely cat rolls eyes. Not every cat does that soo cute. More cats like that.</p>\n<p>That is right - do Your best to compete with Your friends in this \"sort of Multiplayer\" game and earn highest score ever!</p>\n<p>Post Your score proudly (allow Play Games), share it through Messenger or Twitter and let's see who's at the top cats.</p>\n<p>Happy strategic balancing and relaxing time with cats.</p>\n<p>We appreciate all the cat supporters! We love Cats too ♥</p>", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2020-04-03T06:05:05", "background_image": "https://media.rawg.io/media/screenshots/19d/19dc8d5f8042acbfdb9e861aa393837e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AnimusAudax"], "genres": ["Action"], "publishers": [], "esrb_rating": null}