{"id": 425044, "slug": "my-pets-tale-the-crystal-curse-demo", "name": "My Pet's Tale - The Crystal Curse (demo)", "name_original": "My Pet's Tale - The Crystal Curse (demo)", "description": "<p>An enchanting and magical adventure, that will warm your heart and bring you smiles.  Play as a variety of pets on a quest to save your best friend.</p>\n\n<p><strong>Features:</strong></p>\n<p>+Original Soundtrack by Luis Quintero (over 1 million YouTube views channel!)<br/>+Rich and heartwarming storyline, filled with whimsy for all-ages<br/>+Unlock a whole town to customize and build, by collecting Crystal Eggs<br/>+Dungeon crawl through randomized areas and use your pet's skills to explore and find treasure<br/>+Graphics by our lead artist Uran</p>\n\n<p><strong>After Demo:</strong><br/>+More playable animals, with special skills &amp; attacks<br/>+Evolve your cat into a tiger! and other animals as well.<br/>+Go on mini-games and quests, with other animals<br/>+Totally randomized dungeons, with more areas and bosses.<br/>+Find several other objects and people you can unseal for your town<br/>+More original music will be made<br/>+Possible MMORPG support<br/>+Assign your pets to shops and other areas!</p>\n<p>One of the game's characters was based on a real-life pet, but sadly he passed away during the production of the game due to unknown causes.  Help his memory live on by going on his RPG adventures - we think he would want that, as will all dogs!</p>\n\n\n<p>+This is an early demo and does not reflect the final version</p>", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2020-04-03T06:14:02", "background_image": "https://media.rawg.io/media/screenshots/383/3830ac7a37ff837b38bb9ef64853c05a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Angel Star Studios"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}