{"id": 425198, "slug": "harmonia-itch-gamersmurf", "name": "Harmonia (itch) (GamerSmurf)", "name_original": "Harmonia (itch) (GamerSmurf)", "description": "<p>Harmonia is a fast paced arcade game which tests your speed and rewards you generously.</p>\n<p>Catering to the theme of the Stay Safe Jam, this game delivers a powerful message about the importance of solidarity and community in our lives, something which is especially important, in today's global situation. </p>\n\r\nStory and Theme\r\n<p>The story follows you, a resident of the town of Harmonia, who is presented with the choice to influence and spread awareness among the people of Harmonia towards the importance of community. You can choose to pass the information on, by pressing the appropriate key, or let the commuters pass by. You can see yourself walking on the streets of Harmonia on the right hand side. The more people you influence, the more positive changes you can see in the world around you. Similarly, the more people you don't influence, the more under-developed the town becomes. If you lose all influence, the town will eventually turn to rubble. This shows how much of an impact togetherness and solidarity can have globally and what can happen without it!</p>\n\r\nHow to Play\r\n<p>You can press the respective keys <strong>(W, A, S, D)</strong> to \"catch\" the people as they pass by the information booths. Keep increasing your score and you will see more improvements to the town of Harmonia. Keep losing people, and the town of Harmonia will be no more!</p>\n<p>Every few people influenced will trigger a positive development in the moving world on the right. If you successfully influence 10 people in a row, a boost will become available which can be activated with <strong>SPACE </strong>and will trigger an additional positive development in Harmonia.</p>\n\r\nCredits\r\n<p>All sprites and code files in the game were designed and developed entirely by me within the time frame of the jam.</p>\n<p>The music for this game was downloaded from the Open Game Art website. Credits for individual files are as follows - </p>\n<ul><li>Main in game music - Alexandr Zhelanov - Journey to the East Rocks</li><li>Game over music - Kim Lightyear - Whistle</li><li>Game over sound - Epic Amulet Item</li><li>Boost / caught a person - Completion Sounds</li><li>Ambient wind - Wind Sounds</li><li>Ambient bird noises - Isaiah658</li><li>Menu button click sound / missed a person - David McKee (VIRiX Dreamcore)</li></ul>\n\n\n<p>I hope you enjoyed playing the game as much as I enjoyed making it! I would appreciate any comment below with general feedback and suggestions for improvements. Please keep in mind that this was made in 48 hours as part of a game jam, so please excuse some intricacies I may have missed out!</p>\n<p><em>Thank you for playing!</em></p>", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2020-04-03T06:48:56", "background_image": "https://media.rawg.io/media/screenshots/ef7/ef72664ab035dcbb6b7f0723e86b2a97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamerSmurf"], "genres": [], "publishers": [], "esrb_rating": null}