{"id": 4251, "slug": "littlebigplanet-ps-vita", "name": "LittleBigPlanet (PS Vita)", "name_original": "LittleBigPlanet (PS Vita)", "description": "<p>Welcome to LittleBigPlanet™ PlayStation®Vita! Join Sackboy in a completely new adventure, filled with mystery, peril and excitement! The PS Vita&#39;s front and back touch controls let you PLAY freely. Fully customize Sackboy and his world with the specialized CREATE tools, and discover endless levels SHARED by fans online.<br />\n-Includes features from LBP1 and LBP2, plus new PS Vita exclusives making this the most powerful and flexible LBP to-date<br />\n-Utilizes all PS Vita functions: touch, tilt, microphone and cameras</p>\n<p>-3G connectivity allows you to browse, download and publish your own levels wherever you are<br />\n-Play with four players online (Wi-Fi)<br />\nDISCLOSURE REGARDING USE OF LOCATION: This game interacts with other applications that use location data (such as “near”). To turn off location data, go to [Settings] &gt; [Location Data].<br />\nThis item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.This item may be used with up to 2 activated PlayStation® devices associated with this Sony Entertainment Network Account. Please see software description for device compatibility. ©2012 Sony Computer Entertainment Europe. Developed by Tarsier Studios and Double Eleven Limited. “LittleBigPlanet” is a trademark or registered trademark of Sony Computer Entertainment Europe. The PSVITA logo is a trademark of Sony Computer Entertainment Inc.</p>", "metacritic": 88, "released": "2012-09-25", "tba": false, "updated": "2023-11-09T07:19:11", "background_image": "https://media.rawg.io/media/games/ee7/ee7a21b7e1da6752b8061414b26cdb6e.jpg", "website": "", "rating": 3.79, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 9, "beaten": 18, "toplay": 13, "dropped": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 19, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 19, "platforms": ["PS Vita"], "developers": ["Double Eleven", "Tarsier Studios", "XDev Studio Europe"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": ["Sony Interactive Entertainment"], "esrb_rating": "Everyone"}