{"id": 425138, "slug": "its-raining-men", "name": "It's Raining Men", "name_original": "It's Raining Men", "description": "<p>Mother Nature has rearranged the sky, and it's raining men (hallellujah)! You are a Weather Girl, and  the chance to find the guy of your dreams amidst the best storm ever is now! <br/></p>\n<p>It's Raining Men has been an important song for me throughout my life. So when the inspiration came, I decided to do something, if minuscule, to honor The Weather Girls' immortal legacy.</p>\n<p><strong>It's recommended to play on fullscreen mode.</strong><br/></p>\n<p><strong>CONTROLS:</strong></p>\n<ul><li>WASD or arrows to move left and right.</li><li>Space to jump.</li><li>You'll get higher scores the lower you catch the guys!</li></ul>\n<p><strong>CREDITS:</strong></p>\n<ul><li>Character Art: Kenney's Free Assets.</li><li>Background Art: Pixel Night City, from fridaruiz in OpenGameArt.</li><li>Music: It's Raining Men - 8 bit, from8BitUzz (permission was asked).</li><li>Thud sound: \"Body Thud\" by Kane53126 in Freesound.</li><li>All coding and the logo are made by me.</li><li>All rights are property of their rightful owners.</li></ul>\n<p><strong>DEV NOTES:<br/></strong></p>\n<p>I sadly started running out of time before I could change the main menu design or implement another player sprite. I wanted to introduce a male sprite because some of us grew up in the 90's imagining that Mother Nature would also throw a man our way.<br/></p>\n<p>I also deliberately made this game so you couldn't lose.</p>\n<p><strong>ADDITIONAL NOTES:<br/></strong></p>\n<p>A few friends have also joined this jam. Please take a look at their games:</p>\n<ul><li>Playing Under Storm, by Samuel Reyes.</li><li>Be The Storm, by KRG Code.</li><li>Warlock and the Storm, by Jose Moyano.</li></ul>", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2020-04-03T06:35:09", "background_image": "https://media.rawg.io/media/screenshots/d69/d6965fc174a1470976e6c413f8e7f519.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JPBarroso"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}