{"id": 425129, "slug": "hookman-hookman2020", "name": "HOOKMAN (hookman2020)", "name_original": "HOOKMAN (hookman2020)", "description": "<p><strong>We are making a four-player team deatchmatch game.</strong><strong>Players put down a tower to hook other players to their sides to kill, or rescue teammate from other side.</strong></p>\n<p>(What’s New?) A list of what has changed this week (tweaked mechanics, added content, etc).</p>\n<ul><li>Redesign the mechanics of the hook. We changed the speed of the hook to make it more playable, also, we changed the saving and collaborating attack system.</li><li>Hooking enemies now can cause damage to the enemy (5 health points per second)</li><li>Player can no longer cancel the hook. So that the player won’t easily die by falling into the water, emphasizing the use of punching.</li><li>Redesign the health bar showing. HP showing also depends on the color of the body it showed.</li><li>Add the feature: assume that there are Player P1 (red), P2(red), P3(blue), if P3 hook P2 and P1 hook P2 to save P2, then both of the two hooks will be cancelled.</li><li>Add the feature: assume that there are Player P1 (red), P2(red), P3(blue), if P1 hook P3 and in the hooking process, P2 hook P3, then the first hook will be canceled and P3 will be hooked by P2 instead.</li></ul>\n<p>(What’s the Motivation?) A discussion / summary of why you made these changes. Where is your project headed?</p>\n<p>We made changes based on feedback from our peers and instructor’s playtestings, and redesigned the mechanics of the hook to make it more intuitive (make physical sense). </p>\n<p>Since somebody said that the health bar is not clear when changing the camera of the player, we change the parenting to following. Also changed the HP system also shown by the color of our players’ body.</p>\n<p>To emphasize the importance of the hook, we add the damage to the hook if the player is hooking an enemy, it will cause damage during the process of being hooked.</p>\n<p>Also, we still want to make it a multiplayer game rather than change this to a single-player game.<br/></p>\n<p>(What’s Next?) What changes you plan to make for the next iteration.</p>\n<ul><li>Since saving teammates is relatively harder than hooking other players. We would add some buffs to the player who successfully saves his/her teammates.</li><li>Maybe we could add some drop items after the player is killed. These items may act as scores or some buffs to further emphasize the use of the punch.</li><li>More collaboration mechanics design and bug fixes. </li></ul>\n<p>The game is Parsec based. And it is under development, so we really need some feedback!</p>", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2020-04-03T06:32:57", "background_image": "https://media.rawg.io/media/screenshots/524/52476c3c9a0c6d3a3a45fd4199224689.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hookman2020"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}