{"id": 425232, "slug": "dog-survival-simulator", "name": "Dog Survival Simulator", "name_original": "Dog Survival Simulator", "description": "Total app relaunch! Now with Multiplayer! Survive against the other wild dogs in this high action dog simulator.  The name of the game is survival.  Take control of this Doberman and hunt down the enemy dogs.  Dogs included are Doberman, Sheepdog, Dalmatian, Wolf Hound, German Shepherd, and Bulldog. Fun sounds and animations included.  This Dog animal simulator has been designed for all ages. Start this ultimate game of survival now!<br/><br/>Top App Features:<br/>--6 Different Dog Breeds included<br/>--3 Different Times of Day, including rain<br/>--All New! Huge Open World 3D Map<br/>--Upgrade your Dogs Strength, Stamina, and Speed.<br/>--Now with Dragons!<br/><br/>EVERY CHANGING CONDITIONS<br/>No two games will ever be the same. Stray dogs don't like the rain.<br/>HD GRAPHICS IN 3D<br/>Stunning High Definition graphics bring this forest to life. <br/>UPGRADE YOUR DOBERMAN<br/>When you hunt, you earn meat units that can be used to purchase upgrades for your Dino.<br/>HIGH ACTION GAMEPLAY<br/>Fun controls and Addictive game play for hours of great animal simulation.<br/>RECORD YOUR HUNTING VICTORIES<br/>The app automatically records all your victories so you can see how well you have done.<br/>9 DOG BREEDS INCLUDED<br/>Doberman, Sheepdog, Dalmatian, Wolf Hound, German Shepherd, and Bulldog.<br/>6 HEAD TO HEAD BATTLES<br/>Challenge your fighting skills against 6 different 3 on 1 battles. Be prepared for a flight for survival. You either win or loose.<br/>FUN SOUND EFFECTS<br/>Plenty of barking!<br/><br/><br/>Like us on Facebook:<br/>https://www.facebook.com/wildfootgames<br/>Please check out our other 3D animal sims - Eagle, Dinosaur, Owl, Cheetah, Lion, Wolf, Crocodile, and Polar Bear Games. We realize the app is not perfect, and we welcome your constructive criticism. At Wild Foot we are looking for things we can do to improve the app. <br/>Please send your suggestions to wildfootgames@gmail.com.", "metacritic": null, "released": "2015-04-01", "tba": false, "updated": "2020-04-06T02:04:40", "background_image": "https://media.rawg.io/media/screenshots/32e/32eb84080b269f9ccba37527c13a2b41_Vv3MPs5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["RPG", "Racing"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}