{"id": 425275, "slug": "parchis", "name": "Parchís", "name_original": "Parchís", "description": "<p>NOTA IMPORTANTE: JUEGO TAL CUAL LO TENÍA A MEDIAS. LOS BOTONES DEL MENÚ FUNCIONAN, PERO NO CAMBIAN DE COLOR NI NADA AL TOCARLOS. ADEMÁS, EN LA VERSIÓN NAVEGADOR NO APARECE EL BOTÓN DEL MENÚ CUANDO SE JUEGA DESDE MÓVIL XD<br/><br/>Publico esta primer versión, para que lo podáis probar y comparar con su versión final, al terminar la \"Gueim Llam\" :)</p>\n<p>El tradicional juego del parchís, con algunas novedades:<br/></p>\n<p>- Elige entre diferentes cámaras</p>\n<p>- DICE AUTO: Activa o desactiva el lanzamiento automático del dado (sin necesidad de que el jugador toque el dado del centro de la pantalla).</p>\n<p>- MOVE AUTO: Activa o desactiva el movimiento automático de las fichas del jugador (siempre y cuando haya sólo una ficha fuera de casa).</p>\n<p>- DICE SERIES: Los números aleatorios, ya sabemos que no son aleatorios de verdad en un ordenador/dispositivo móvil. Esta opción lo que hace es poner la cantidad que elijas (1, 2, 3...) de veces los números del 1 al 6 en una lista y \"barajarlos\". Por ejemplo, si elegimos \"DICES SERIES 2\", tendremos del 1 al 6 dos veces en dicha lista (en total 12 números). Cada vez que tires, se irá usando un número de la lista hasta agotar esos 12. De esta manera, además de asegurarte una cierta aleatoriedad, puedes usar estrategias si controlas los números que te quedan por salir.</p>", "metacritic": null, "released": "2020-04-05", "tba": false, "updated": "2020-04-06T02:13:46", "background_image": "https://media.rawg.io/media/screenshots/1ec/1ecb167550571f21370aa5e9a520ea88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["breynartstudios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}