{"id": 425217, "slug": "total-battle-tactical-wargame", "name": "Total Battle: Tactical Wargame", "name_original": "Total Battle: Tactical Wargame", "description": "EXPLORE &amp; CRAFT<br/>Raid ancient tombs and crypts in search of epic loot and items to craft majestic equipment for your hero. Different equipment sets give unique abilities to your hero - legendary warrior armor, fantasy beastslayer, honored governor, Indiana explorer. If that’s not RPG enough for you, then choose among 9 completely different heroes, each with their own perks and abilities.<br/><br/>TRAIN &amp; LEAD<br/>Your very own military base is right in the heart of your castle: train and set-up the best army possible using different types of units, from infantry to catapults, to titans and dragons.<br/><br/>BEASTSLAYER PvE STRATEGY<br/>Get out on the world map and lead your army into some hardcore mobile PvE action - strike titans, dragons, elves, fire worms, vampires, black knights just to name a few of the fantasy creatures lurking out there. Select your soldiers and attack strategy carefully, you wouldn’t want a dragon to conquer the kingdom you care about so much.<br/><br/>PvP STRATEGY:<br/>Battle and conquer the castles of the most skilled war game MMO players in this real time rts PvP, these include real army veterans, strategists and generals.<br/><br/>MASSIVE WAR GAMES<br/>Military strategy and tactics at its best: join or create a clan, launch clan marches against free roaming monster packs, siege their forts, or declare war on other clans and burn them all - slowly, strategically, one by one, capture their territory and make them bow down to your banner! And finally unite your kingdom and march out to vanquish the other kingdoms.<br/><br/>POLITICS<br/>After fighting your way into the senate, use your political skills to elect a King who will lead your kingdom into either prosperity or poverty, or maybe you’re good enough to be King yourself? The King will assign honorific titles, decide how to spend the treasury, issue Kingdom rules and finally unite his people in battle against other kingdoms. That’s if you’ve made a wise choice with your fellow senators... otherwise you could get a clown with a bag of grenades ;)<br/><br/>INTENSE MMO EVENTS:<br/>Game events happen every day with Grand tournaments once a week, this is when things get so hot intense you just might forget your kids at school.", "metacritic": null, "released": "2018-10-20", "tba": false, "updated": "2023-08-01T07:10:57", "background_image": "https://media.rawg.io/media/screenshots/27e/27e4f074f5408117661d942789820e4a_OvYfNA6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Scorewarrior"], "genres": ["Strategy"], "publishers": ["SCOREWARRIOR"], "esrb_rating": "Everyone 10+"}