{"id": 42524, "slug": "nagiq-2-treasure-hunt", "name": "NagiQ 2: Treasure Hunt", "name_original": "NagiQ 2: Treasure Hunt", "description": "<p>Nagi has found a treasure map and is now embarked on an adventure to conquer 5 islands and 75 boards full of fun with words! He's after all of the treasures and a lot of coins! In NagiQ 2 you'll enjoy an original gameplay based on combining words on boards to win coins, defeat an evil pirate, win prizes, punch evil skulls, explode monsters, trim mustaches and prove that you are the ultimate wizard of word games. Good luck with this <strong>challenging game</strong>!</p><p><strong>Special features</strong></p><ul><li>Rich, challenging and original gameplay! Each island has its unique challenge and enemies! The Iron Hand Pirate, evil skulls, monsters, mustache guys, and multi-letter tiles!</li><li>Form words to capture gift boxes. You could win coins or special Lorin letters which will help you to form words!</li><li>Rise your score to unlock letters! The more letters you unlock the more your chances to succeed!</li><li>Receive all of the game's treasures by conquering islands and for your achievements.</li><li>Support for English and Spanish languages!</li></ul><p><strong>Game Levels</strong></p><p>The game comprises 5 awesome islands, amounting to 75 fun and challenging boards. The islands are:</p><ol><li>ARRGH ISLAND: Basic boards, to learn the gameplay and to defeat the mischievous Iron Hand Pirate.</li><li>SKULL ISLAND: These boards are full of evil skulls. Form words to punch them out of the boards!</li><li>SCARY ISLAND: Monsters everywhere! Form words to surround these monsters and explode them.</li><li>MUSTACHE ISLAND: Trimming mustaches! You'll have to cover all the tiles containing mustache guys!</li><li>FROZEN ISLAND: The last island, and the hardest challenge. Boards will contain tiles with more than one letter, adding to the defy.</li></ol>", "metacritic": null, "released": "2013-12-13", "tba": false, "updated": "2020-04-08T10:48:53", "background_image": "https://media.rawg.io/media/screenshots/4b8/4b898e83d37d7046c63e85f7d2289bd5.jpg", "website": "http://www.ikigames.com/nagiq2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android", "PC"], "developers": ["IKIGames"], "genres": ["Educational"], "publishers": ["IKIGames"], "esrb_rating": null}