{"id": 42537, "slug": "dont-starve-reign-of-giants", "name": "Don't Starve: Reign of Giants", "name_original": "Don't Starve: Reign of Giants", "description": "<p>Don’t Starve: Reign of Giants is an expansion pack that adds new characters, seasons, creatures, biomes, and other challenges to Don’t Starve.</p>\n<p>The entire world of Don’t Starve has been expanded and is now even more uncompromising! New mysteries, challenges and scientific innovations await your discovery. Manage your resources well, because the wilderness of Don’t Starve has learned some new tricks.</p>\n<p>Key Features:</p>\n<p>New playable characters: Reign of Giants adds two characters for players to discover and survive with. Play as Wigfrid, a stage actress who went a bit too far with method acting on her latest role, an ancient Valkyrie, or Webber, a young boy who lives inside the spider who tried to eat him long ago.</p>\n<p>Year-round starvation: Struggle through a full year of seasons as you experience the torrential rain falls of spring and the blistering heat of summer.</p>\n<p>A bigger, badder world: New biomes have been filled to the brim with new creatures and gatherables that will either help you survive - or kill you.</p>\n<p>An extra save slot: You asked, we delivered.</p>\n<p>Giants: They’re in the name for crying out loud!</p>", "metacritic": null, "released": "2014-04-30", "tba": false, "updated": "2022-10-16T17:50:39", "background_image": "https://media.rawg.io/media/screenshots/94d/94d6cac59d43f2bb3f518f52b5f5976c.jpg", "website": "https://www.klei.com/games/dont-starve", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 18, "beaten": 10, "toplay": 2, "dropped": 7, "playing": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 22, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 22, "platforms": ["PC"], "developers": ["Klei Entertainment"], "genres": ["Action"], "publishers": ["Klei Entertainment"], "esrb_rating": null}