{"id": 42542, "slug": "tribal-wars-2", "name": "Tribal Wars 2", "name_original": "Tribal Wars 2", "description": "Build your villages and expand your empire! Ally yourself with other players to form mighty tribes! Protect your people against your enemies! And turn the tides of war! <br/><br/>Tribal Wars 2, the free online strategy game, is the successor to InnoGames’ online hit Tribalwars. You become the ruler of a city in a war torn medieval universe and you have to defend your followers and your village and expand your empire to ensure its survival. To succeed you have to rely on your strength and your strategic skills.<br/><br/>But you won’t be able to do all of this on your own. Rally other players to your cause, build a tribe and form alliances with other tribes. Your political decisions could mean the difference between triumph and defeat in the world of Tribal Wars 2.<br/><br/>Tribalwars 2 is available in the browser and on your mobile device. You are able to use the same account across all your different devices. You used your browser to send one of your armies to attack an enemy’s village? Check the results of the attack on your smartphone and prepare your cities for the counter-attack using your tablet! All features of the game are available on all different devices.<br/> <br/>FEATURES:<br/>• Build glorious villages with 16 different types of buildings<br/>• Wage war with 13 different types of units<br/>• Create army presets to plan your attacks<br/>• Conquer other villages and compete with your enemies for their territory<br/>• Form tribes with other players to create an empire and rule the world of Tribal Wars 2<br/>• Trade resources with other players<br/>• Choose an Order and get access to different types of elite units<br/>• Play the same account cross platform on all your different devices<br/> <br/>Learn more about the game on our website http://www.tribalwars2.com<br/>Become a fan on facebook at https://www.facebook.com/tribalwars2<br/>Add us to your Google+ circles at https://plus.google.com/+Tribalwars2/posts<br/>Subscribe to our youtube channel at http://www.youtube.com/user/tribalwars2<br/><br/>General Terms and Conditions: https://legal.innogames.com/portal/en/agb<br/>Imprint: https://legal.innogames.com/portal/en/imprint", "metacritic": null, "released": "2015-03-30", "tba": false, "updated": "2019-07-29T23:33:32", "background_image": "https://media.rawg.io/media/screenshots/f15/f15b517e89a214f7b051a28763a91ecd.jpg", "website": "http://en.tribalwars2.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS", "Android"], "developers": ["InnoGames"], "genres": ["Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["InnoGames"], "esrb_rating": "Everyone 10+"}