{"id": 425604, "slug": "gwubish", "name": "Gwubish", "name_original": "Gwubish", "description": "<p>Experience life as an exotic Gween Gwubster in its natural habitat. Although the Gween Gwubster is the only Gwubster known to be capable of processing thoughts, its goal is still always quite simple: to <strong>get off the screen</strong>. To do this, the Gween Gwubster must master the art of movement. It must learn its limits and understand its capabilities.</p>\n\n<p>Now, you may be thinking that there is no way this pile of gwub is worth even a little bit of Gweem. You are probably right, but just look at all the<strong> <em>amazingly awesome </em></strong>features that are included:<br/></p>\n<ul><li>Gwub!</li><li>40-ish+ increasingly difficult levels!</li><li>Your progress is automatically saved!</li><li>26 different letter buttons that all do something different!</li><li>5 different Gwub sounds!!!</li><li>Every letter is probably needed to complete your journey!</li><li>Soothing meditative music to calm your stressful life as a Gwubster!</li><li>Almost 10+ different species of Gwubsters to interact with!</li><li>Orange Gwub!</li><li>1v1 shared-keyboard pvp arena for accidentally killing yourself while trying to poop on your friend!</li><li>Powerful Gwub that is a little bit pink-ish!</li><li>Truly inspiring awkwardness!</li><li>Even more GWUB!!!</li></ul>\n<p>Wow! That list has more than 2 different features! Unfortunately, this game may not be for everyone. Please read the following before purchasing Gwubish:</p>\n<ul><li>This game may cause stress and/or diarrhea, as it simulates the life of a Gween Gwubster.</li><li>This game may subconsciously inspire you to want to poop more often.</li><li>This game no longer comes with a<strong> </strong><em><strong>free toilet</strong></em>.</li><li>Persons older than 2 years may not enjoy this game.</li><li>Persons younger than 28 years may not enjoy this game.</li><li>If you eat a banana while playing this game, your hunger level may decrease.</li><li>This game is the worst game ever released by Bonchish Worlds.</li></ul>\n\n<p><strong>Frequently Asked Questions:<br/></strong></p>\n<p><strong>Q: </strong>How many letter keys does an average keyboard have?<strong> A: About 26-ish.<br/></strong></p>\n<p><strong>Q: </strong>Does this game still come with a <strong><em>free toilet</em></strong>?<strong> A: No, the delivery of <em>free toilets</em> was ended when Tropical Strawberry Gwubsters began eating the <em>free toilets</em>. However you may still attempt to play this game while sitting on a toilet if you wish to.<br/></strong></p>\n<p><strong>Q</strong>: What happens if I press a key that does not have a letter on it? <strong>A: Your Gwub level will increase, bringing you one step closer to spontaneous self-explosion for pretty much no reason at all.<br/></strong></p>\n<p><strong>Q: </strong>Why?!?! <strong>A: Y</strong></p>\n<p><strong>Q: </strong>What should I do if I have $1.43 ready to go right now? <strong>A: You should probably go buy something else.</strong></p>\n<p><strong>Q: </strong>What should I do if I purchase this game, but I don't like it?<strong> A: Play something different and pretend you paid for that game instead of this one.</strong><br/></p>", "metacritic": null, "released": "2020-04-01", "tba": false, "updated": "2020-04-06T03:24:07", "background_image": "https://media.rawg.io/media/screenshots/977/977abbb29219fa78ed23ae770cfd37b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bonchish Worlds"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}