{"id": 425617, "slug": "vertigo-espanol", "name": "Vértigo [Español]", "name_original": "Vértigo [Español]", "description": "<p>¡Gracias por jugar! Usa las flechas del teclado para moverte y explorar.</p>\n<p><em>Vertigo</em> fue creado originalmente en inglés para el #BitsyJam con el tema de <em>Isolation</em>. Aquí pueden encontrar la versión original. </p>\n<p>Siempre estoy pensando de más las cosas, pero estos días de encierro me han puesto hiper-contemplativa. Quería hacer algo con las cosas que me han estado dando vueltas en la cabeza, sobre todo para desahogarme. Sé que no soy la única que siente vértigo si se asoma demasiado para adentro.</p>\n<p>Por favor cuéntenme sin encuentran algún error. Me encantaría leer qué piensan después de jugarlo.</p>\n<p>La música es Infancia, by Gerry Weil.</p>\n<p>Ahora ✨ fun facts ✨</p>\n<p>* La posición de las estrellas en el primer cuarto del espacio es mi intento de imitar el cielo en tiempo real mientras hacía el juego (29 de Marzo de 2020).</p>\n<p>* La cita de Moby Dick es del capítulo 32, \"Cetología\".</p>\n<p>* La cita de Don Quijote es del Prólogo (el cual podría copiar y pegar completo aquí para describir cómo me siento respecto a este juego jaja).</p>\n<p>* La música que suena en el tocadiscos es <em>Youlin</em>, de Las Chicas del Can.</p>\n<p>* Este es el poema del principio, de Rafael Cadenas.</p>\n<p>Agradecimientos especiales a Jaime Yañez (caballitodefuego) por mostrarme Bitsy y ayudarme un montón, a Claudia y a Ezequiel por ser mis beta testers. </p>\n<p><em>Hecho usando la maravillosa plataforma Bitsy de Adam Le Doux's. </em></p>", "metacritic": null, "released": "2020-04-05", "tba": false, "updated": "2020-04-06T03:26:36", "background_image": "https://media.rawg.io/media/screenshots/8ee/8eea5eccb021d0602101281d02940dd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["magmasubterraneo"], "genres": [], "publishers": [], "esrb_rating": null}