{"id": 425969, "slug": "control-a-distraction-simulator", "name": "Control - A distraction simulator", "name_original": "Control - A distraction simulator", "description": "<p>Control - A distraction simulator is a game about simulating a person's life that's pulled in different directions by distractions. Some distractions are good some are bad, but to do his job he needs to focus which is very hard for him to do. This is a super-early prototype!!! The idea is to keep working on it and maybe get feedback from some benevolent folks out there. </p>\n<p><strong>Gameplay</strong></p>\n<p>The core gameplay is to finish writing a story in the given time. Clicking on the desk or note icon opens a notepad where the story will slowly be written. </p>\n\n<p>One of the buttons at the bottom (called focus-buttons) will light up briefly, and if pressed while lit up, a few sentences of the story will be written. </p>\n\n<p>While the player writes the story his will power gradually depletes and once it goes down to zero the notepad will close and only open again when will-power has fully recharged.</p>\n<p>While the player is in 'writing-mode' his phone will periodically have pop-ups that will serve to distract him. These pop-ups could be chat notifications or game-high-score notifications for a game the player has been playing on his phone. Clicking on the pop-up or even the phone will open it. However this switching of context will lower the player's will power.</p>\n\n<p>For now there are three objectives</p>\n<p>- Finish the story</p>\n<p>- Get a high score on the game in the phone</p>\n<p>- Get atleast 10 likes for the messages you post in the chat application on the phone.</p>", "metacritic": null, "released": "2020-04-03", "tba": false, "updated": "2020-04-06T04:41:23", "background_image": "https://media.rawg.io/media/screenshots/bc4/bc42d7072119b2f5fcd39e8a153b2825.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sid"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}