{"id": 426008, "slug": "warpthrough-itch", "name": "WarpThrough (itch)", "name_original": "WarpThrough (itch)", "description": "<p><em>WarpThrough is a fast and challenging platformer with arcade-inspired gameplay, unique combat, and a short story full of charming characters. Get into the flow and balance beating up monsters with warping through portals. How many dimensions can you survive?</em></p>\n\n<p>In WarpThrough you won't live long by running around and spamming the attack button.<br/>...<br/>Because there is no attack button.<br/><br/>Stop moving to charge your attack, and when the time is right - move to that monster to beat it up!<br/><br/><br/><br/>Inspired by indie classics such as Towerfall Ascension, Super Crate box and Downwell, WarpThrough is all about skill-based, fun, and unique gameplay.<br/></p>\r\nFeatures:\r\n<ul><li><strong>Tense combat</strong><br/>Fight or flee using the unique attacks and tight platforming controls</li><li><strong>Hostile dimensions</strong><br/>Beat up a variety of monsters as you warp further and further</li><li><strong>Unlockable characters with their own attacks</strong><br/>- Charlotte, destroying enemies with fiery punches<br/>- Three, armed with a gun, which would be useful if only he could aim<br/>- Ebbie, taking her dog Ball for a walk<br/>- Manor, electrocuting monsters that fall in his traps</li><li><strong>A short (1-2 hour) story full of charming personalities</strong><br/>Brace the dimensions, save your friends and stop the monsters!</li><li><strong>And much more!</strong><br/>Local co-op, weekly challenges, different modes, etc.</li></ul>\n<p>Gameplay is WarpThrough’s core, but it’s cast of characters are not just there for show!<br/><br/><br/></p>\n<p>“I am very smitten with this game (...) these mechanics are hard to get used to, but once you do it's very interesting - I've never played a game like it.” <br/>So... Videogames! Podcast</p>\n<p>“If you're interested in a game that has arcade-style gameplay, it's fast and it's fun, don't let the looks throw you off. Let the game speak for itself.”\r\n<br/>Pernell (on SML podcast) </p>\n<p> “(...) not moving for about a second charges up an attack which can then be unleashed by pressing up, down, left or right, immediately annihilating any and all in range. (...) Fun? You bet ya.”\r\n<br/>Wraithkal</p>\n<p><strong>Purchasing WarpThrough on itch.io also gives you a Steam key for the game!</strong></p>", "metacritic": null, "released": "2020-04-03", "tba": false, "updated": "2020-04-06T04:50:52", "background_image": "https://media.rawg.io/media/screenshots/352/35295ff6f99a42d08a74aa2a18d6af27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ramon Huiskamp"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}