{"id": 426086, "slug": "recapture-demo", "name": "RECAPTURE - DEMO", "name_original": "RECAPTURE - DEMO", "description": "<p>¡Hola!</p>\n<p>Somos <strong>Endless Phase</strong>, un equipo de estudiantes del último curso del Diploma de Diseño de Videojuegos de Seeway - por LCI Barcelona.</p>\n<p>Durante este año hemos estado (y seguimos) desarrollando <strong>Recapture</strong>, nuestro trabajo de final de grado, un videojuego de aventuras y ciencia ficción para móviles donde te pondrás en la piel de C3R38R0, un cyborg de una época distópica con el objetivo recuperar la humanidad que la civilización ha perdido con el paso de los siglos.</p>\n\r\nINSTRUCCIONES PARA INSTALAR EL JUEGO PARA ANDROID\r\n<ul><li><strong>0.</strong> Entra a esta misma página web desde tu teléfono móvil.</li></ul>\n<ul><li><strong>1.</strong> Descarga el archivo APK desde más abajo de esta misma página.</li></ul>\n<ul><li><strong>2.</strong> Abre el archivo descargado en tu teléfono. Puede que aparezca alguna notificación indicando que la aplicación no es segura; ignóralo. Es una advertencia normal al descargar aplicaciones desde páginas que no sean tiendas oficiales como Google Play.</li></ul>\n<ul><li><em><strong>Nota</strong>: Si tu teléfono te avisa de que no se puede instalar la aplicación, es posible que debas permitir la instalación de apps de terceros en las opciones de tu smartphone.</em></li></ul>\n<ul><li><strong>3. </strong>Pasado un momento, el móvil debería notificarte que la aplicación se ha instalado correctamente y el icono de Recapture aparecerá en el menú del teléfono listo para ejecutarse.</li></ul>\n\r\nINSTRUCCIONES PARA INSTALAR EL JUEGO EN WINDOWS\r\n<ul><li><strong>1.</strong> Descarga la build para Windows desde más abajo de esta misma página.</li></ul>\n<ul><li><strong>2. </strong>Abre el archivo .zip descargado en tu ordenador y descomprímelo. </li></ul>\n<ul><li><strong>3.</strong> Ejecuta el archivo \"Recapture_Demo.exe\", ajusta la configuración como tú prefieras y estará listo para iniciarse.</li></ul><p>Para salir de la demo en Windows una vez se quiera dejar de jugar y está la pantalla completa activada, recomendamos utilizar ALT + F4, o en el caso de un teclado con la tecla función, FN + ALT + F4.</p>", "metacritic": null, "released": "2020-04-02", "tba": false, "updated": "2020-04-06T05:08:01", "background_image": "https://media.rawg.io/media/screenshots/3da/3da3c88932ed707ffc803b34378a93c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Endless Phase"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}