{"id": 426138, "slug": "idetective-logic-puzzles", "name": "iDetective Logic Puzzles", "name_original": "iDetective Logic Puzzles", "description": "You are a part-time detective who helps out Inspector Thadeus Deprehensio, from the local office, who you affectionately call \"Inspector Thad.\" Together, you will help solve countless cases, some easier than others, some challenging, which will keep your wits sharp, your mind logical, and the world a better place. If you need assistance, just tap the Help button which will reveal all--including the ability to shake this device to start over or to clear your notes grid.<br/><br/>Enjoy solving dozens of mind-blowing cases of varying difficulty--including the 3 cases from the Lite version (iDetectiveLt). Tapping on a case brings you to the main grid. Here, you'll see scrollable text that talks about the case and gives clues you'll need. Based on these clues, you can circle and cross out possible suspects. <br/><br/>Based on the clues and your grid notes, you enter your hypotheses in the Answer page where clicking on 'Check' lets you see if your answers are correct so far--letting you correct what you've missed.<br/><br/>Your changes are always saved! Should you decide to leave the current case unfinished because you want to work on another case, your answers as well as your grid notes are all saved so you can go back to work on them again at a later time.  <br/><br/>So what are you waiting for, my dear detective? Get out your magnifying glass, your fingerprint kit and download this app now! Over 30+ cases! The game's afoot! <br/><br/>If you want to try out the free version first, search the AppStore for \"iDetectiveLt\". It has 4 puzzles and all the features!", "metacritic": null, "released": "2010-03-26", "tba": false, "updated": "2020-04-10T02:13:57", "background_image": "https://media.rawg.io/media/screenshots/fcd/fcdcc5918cd45f7be3963a223eadf375.jpg", "website": "http://instructoons.com/apps/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vicente Malixi"], "genres": ["Strategy", "Educational", "Puzzle"], "publishers": ["Vicente Malixi"], "esrb_rating": "Everyone 10+"}