{"id": 426116, "slug": "rocky-rampage-wreck-em-up", "name": "Rocky Rampage: Wreck 'em Up", "name_original": "Rocky Rampage: Wreck 'em Up", "description": "Mr. Boulder is the \"Fashionable\" Champion of the Rock Kingdom. One day his collection of heroic Wonderpants got stolen by the jealous Empire of Scissor. Enraged, he storms to the castle of Her Sharpness Empress Clipper and relentlessly crushes swarms of soldiers to get his Wonderpants back.<br/><br/><br/>With the help from Pebble, his trusty and ever-loyal sidekick, they will chase down Her Sharpness Empress Clipper to the end of the world.<br/><br/>So roll as far as you can and get your Wonderpants back!<br/><br/><br/><br/>Features:<br/><br/>Launch yourself to an EPIC speed<br/>Don't stop! Upgrade your Wonderpants and with perfect timing, launch Mr. Boulder faster than ever.<br/><br/>DESTROY anything in your path<br/>Build and maintain your speed, be it a swarm of enemies or even a massive wall, don't let anything stand in your way! You are unstoppable!<br/><br/>RIDE on various interesting enemies<br/>Find interesting enemies along your path. Each of them with unique behaviors and some that you can even ride on to help you storm the castle!<br/><br/>COMPLETE your collection of Wonderpants<br/>An ever-growing wardrobe of unique and funny Wonderpants. Get everything back and reclaim your title as the most \"Fashionable\"!<br/><br/><br/>For the latest news, updates, and events follow us on:<br/><br/>Youtube : http://www.youtube.com/joyseedgametribe<br/>Instagram : http://www.instagram.com/joyseedgametribe<br/>Twitter : http://twitter.com/joyseedgame", "metacritic": null, "released": "2020-04-05", "tba": false, "updated": "2022-11-03T18:50:35", "background_image": "https://media.rawg.io/media/screenshots/698/698c22c0f5c0082b3709858c8977664d_1vWJnAn.jpg", "website": "http://www.joyseedgametribe.com/games/rocky-rampage/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Joyseed Gametribe"], "genres": ["Action", "Adventure"], "publishers": ["JOYSEED BERBAGI SUKSES, PT"], "esrb_rating": "Everyone 10+"}