{"id": 426137, "slug": "arctic-penguin-simulator", "name": "Arctic Penguin Simulator", "name_original": "Arctic Penguin Simulator", "description": "From deep in the arctic, a young Penguin awakens. Cold, hungry, and alone - it's your job to help her find her family members, get strong, and defeat all her enemies.  She needs your help to survive and thrive against these extreme harsh winter conditions. In the beginning, she will be strong enough to fish and hunt down rabbits.  But you must build up her strength and stamina so that one day she can defeat all the giant bosses.  This 3D wild animal simulator allows you to take control of this fearless Arctic Penguin as she freely roams across the tundra and races through the water. Skate across the ice to chase down that rabbit.  Help her grow up to fight the big animal bosses.  Find your 2 mates and start your thriving family. Animal simulation at its best. The realistic 3D map is massive so take your time to explore all the areas to find all the bosses.<br/><br/>Big thanks to Concetta for the game suggestions!!<br/><br/>The 5 bosses includes Arctic Fox, Orca, Wolf, Sea Lion, and Moose.  Of course we threw in some eagles, fish, octopus and rabbits also. The more you play, the more your animal grows, and the stronger she becomes.  Survival is key in this Penguin animal simulator.<br/><br/>Top Game Features Include:<br/>-- Huge Open Ice and Tundra World 3D Map<br/>-- Plenty of places to swim and hunt<br/>-- Fast paced and Continuous action game play<br/>-- Bosses include Polar Bear, Wild White Wolf, Orca, Giant Sea Lion, and Giant Moose<br/>-- Survive the extreme arctic elements like snow and freezing rain<br/>-- The weather and time of day is dynamic. This means the longer you survive, the more changes you will experience.<br/>-- Refill your Penguin's energy by fishing and hunting<br/>-- Super Fun animations and sound effects<br/>-- Realistic Snow covered terrain\u2028\u2028We would really like to hear from you.  Come and stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates.\u2028\u2028Be sure and check out our other 3D animal simulators. We understand that the game is by no means perfect and we welcome your constructive criticism.   Please email your suggestions.  This game idea was actually sent by one of our fans.  At Wild Foot we are looking for things we can do to improve the app. Now stop reading this and start hunting and swimming with your penguin!", "metacritic": null, "released": "2015-12-01", "tba": false, "updated": "2020-04-10T02:13:35", "background_image": "https://media.rawg.io/media/screenshots/050/0509eb99e479e084891569898a08ccf5_lDKI8xh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Teen"}