{"id": 426296, "slug": "axegend-vr", "name": "Axegend VR", "name_original": "Axegend VR", "description": "<h3>Story</h3>There is a prosperous country that changes its name every 100 years...<br/>Strangely, some of its citizens would go missing every once in a while...<br/>In the Gemini month of year 327, the princess of the Kingdom of Sri... was captured by goblins! You are a noob knight with some skills up your sleeves...<br/>Your dream is to become a knight commander! And then idle away the rest of your life...<br/>This time, you are somehow assigned to save the princess from the enemy camp. This is a good chance to get promoted!<br/>But on your journey to save the princess, you find out a bigger conspiracy...<br/>Come to think about it: No one knows why something that doesn't belong in this world of axes and magic suddenly appears, like... the glowing rod!<h3>Features</h3><strong>·Fusing with Rougelike Element</strong><br/>Every run offers a brand new experience with random item loots. You will start with an axe then work your way to victory in a world that blends intense battles with casual interval stages. The randomness and permadeath elements will make the game replayable and exciting.<br/><br/><strong>·Creating Your Own Fighting Style</strong><br/>There are many weapons to choose from, such as axes, swords, bows, even umbrellas... Each weapon has unique skill or ability, combined with different unique traps like springboards, fires and taunt traps, you can form a variety of tactics and combat style.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><strong>·Thrilling Boss Fights</strong><br/>Gigantic bosses will take your eyes by storm. Some of them may look funny, but their strength is no joke. This won’t be an easy battle!<br/><br/><br/><br/><br/><br/><strong>·Fun Interval Stage</strong><br/>Between intense and exciting battles, there are several interval stages to offer a change of pace.<br/>Jump, slash and dodge your way to victory!<br/><br/><br/><br/><br/><br/><br/><br/><strong>·Becoming A Hero</strong><br/>Everybody has dreamt of becoming a hero! Use your favorite weapon and protect to save &amp; protect the princess as a hero. Charge on!<h3>Contact</h3><strong>Facebook：</strong><br/>https://www.facebook.com/Axegend-109962473874771/<br/><strong>Weibo      ：</strong><br/>https://weibo.com/u/5938731338", "metacritic": null, "released": "2020-03-09", "tba": false, "updated": "2020-04-13T09:34:45", "background_image": "https://media.rawg.io/media/screenshots/5ff/5ff9f6daccef37a487ef945784778a60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Axegend VR Game", "Subversion Squad Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Fighting"], "publishers": ["Subversion Squad Studio"], "esrb_rating": null}