{"id": 426291, "slug": "pocket-race-manager", "name": "Pocket Race: Manager", "name_original": "Pocket Race: Manager", "description": "<p>Pocket Race: Manager is the latest indie game from Magic Storm, our hobby game developer team. It is a mini race driving game with simple controls and some strategic elements and lots of different car parts.<br/></p>\n<p>The game is being created using Unity and will support more platforms beside the windows pc later (android, maybe ios or game consoles).<br/>The game is developed with German, English, French and spanish language support, like later followed by other languages, if the community supports us.<br/>Every track has 2 qualification races. The two fastest drivers continue for the Final Race. </p>\n<p>Race with 1-4 human Players in 3 different Environments with a day/night cyle and different weather!</p>\n<p>Make sure to enhance your car until you got the best one!<br/>Hold the Accelerate Button to accelerate, release it to drive power-saving and decrease the motor heat. Quick-Tap to brake, or use the brake key on your PC keyboard. Attention: do not overheat!<br/>It is very important to improve your car. Earn money to buy new parts with a successful qualification and a good place in a final race. Also win money from drawing cards. You also earn money from a good popularity. If you configure your car, keep an eye on weight and balance. Of course a light car is a bit faster, but if it gets too fast with a low balance it gets unstable and can even take off.<br/>There is a Free/Test version with 4 tracks season, and for just 2.99€ a version with 12 tracks<br/>and an additionl 12x2 tracks where you drive each track 2 times.</p>\n<p>If you have any questions or need help concerning the game, you can ask us any time on our internet platform. Please visit us at the following website:<br/>https://www.indiedb.com/company/magic-storm</p>\n<p>(there is also the free/trial version with 4 tracks)</p>", "metacritic": null, "released": "2020-04-08", "tba": false, "updated": "2020-04-10T02:52:36", "background_image": "https://media.rawg.io/media/screenshots/135/1357c7c68ef0f52078ae9053724a8143.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magic Storm"], "genres": ["Strategy", "Simulation", "Racing"], "publishers": [], "esrb_rating": null}