{"id": 426471, "slug": "the-bloody", "name": "The Bloody", "name_original": "The Bloody", "description": "<p><strong><em>Résumer  :</em></strong></p>\n<p><strong>Vous incarnez BLOODY, un garçon emprisonné par sa famille dans un manoir. Vous devez l'aider à s'échapper en éliminant les différent monstres qui protègent l'entrée du manoir . Le graphisme est basique et le jeu est vu de haut.<br/></strong></p>\n<p><strong><em>Gameplay :</em><br/></strong></p>\n<p><strong>Le joueur incarne un jeune garçon devant s'enfuir du manoir de son père ou il a été emprisonner par sa famille. Le héro parcourt divers pièces du manoir et doit éliminer chaque ennemies de chaque pièces afin de trouver le joyau téleporteur vers la salle (niveau) suivant. Le personnage peut bouger vers les huits directions, tirer, ramasser des vies ou des PowerUp qui lui permettent d'améliorer son arme ou ses capacités afin de tuer plus facilement et rapidement les monstres.</strong></p>\n<p><strong><em>Créateur :<br/></em></strong></p>\n<p><strong>Je me nomme Lamine alias Nemila, je suis un apprenti développeur de jeux indépendant, j'utilise Game Maker Studio (la version gratuite parce que je n'ai pas les moyens) car je me suis familiariser avec le langage qu'utilise celui ci, le Gml (Game Maker langage). Cependant je pense passer de Game Maker vers Unity afin de m'améliorer dans ma création de jeux. Je ne suis inscrit à aucune  école de création de jeux vidéos,  j'ai tout appris en autodidacte  sur  youtube et certains sites. Je suis pas mal avancé en programmation mais je suis absolument nul en graphisme, level ou game design.</strong><br/></p>", "metacritic": null, "released": "2020-04-08", "tba": false, "updated": "2020-04-10T03:33:40", "background_image": "https://media.rawg.io/media/screenshots/ba1/ba1e9ef916eb54deb1aca9f3bd83ba3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nemila"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}