{"id": 426743, "slug": "drova-forsaken-kin", "name": "Drova - Forsaken Kin", "name_original": "Drova - Forsaken Kin", "description": "<p>Drova - Forsaken Kin is a role-playing game that focuses on combat and discovery. We try to revive old aspects of roleplaying that we miss in modern roleplaying games. It is important to us that the player has to orient himself in our world instead of being guided.</p>\n\r\nImportant Note\r\n<p>This is a <strong>prototype</strong>-demo from “Drova - Forsaken Kin” - a game we are currently developing. This demo is a spinoff of our actual game, so we can test the first mechanics and game design ideas. We are publishing it to get feedback and enhance the player experience. <br/></p>\n\r\nFeatures\r\n<ul><li>Fight 5 different enemy types</li><li>Loot your enemies for more equipment and consumables</li><li>Fight with 2 different weapon sets <ul><li>Set 1: sword and shield</li><li>Set 2: bow</li></ul></li><li>Dodge to avoid enemy attacks</li><li>Block to get less damage from enemy attacks. If you get the timing right something cool will happen</li><li>Learn to manage our casting-ressource “Flow”, which punishes you if you are casting to much or playing bad</li></ul>\n\r\nWhat's next?\r\n<p>We plan to release another demo this summer, for which we like to involve your feedback in our development-progress. The next demo will have a playtime of about 1h and focuses more on story and will contain more content.\r\n</p>\n<p>\n<strong>This Game is not tested for Linux and Mac systems!</strong></p>", "metacritic": null, "released": "2020-04-07", "tba": false, "updated": "2020-04-10T04:42:14", "background_image": "https://media.rawg.io/media/screenshots/b17/b1795c76a894307657be581693dc7d31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Just2d"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}