{"id": 426770, "slug": "drift-worlds-real-life-drifting-arcade-racing", "name": "Drift Worlds ⚠️ Real Life Drifting, Arcade Racing", "name_original": "Drift Worlds ⚠️ Real Life Drifting, Arcade Racing", "description": "<p>Drift Worlds is an arcade racer that simulates real world racing across outrageous terrains and environments.<br/><br/>You will find yourself drifting across desert plateau's, above the clouds across snowy tundras or deep in the depths of a volcano. With dozens of levels providing unique and exciting challenge we'll see who can hold the record for each race. Hold the record and you will be immortalised as a ghost racing along side each new challenger.<br/><br/>Make sure to get your driving right to earn some more money to help you unlock more cars in the garage.<br/><br/>⚠️⚠️⚠️<br/><br/>There are dozens of levels to explore and even more cars to unlock with more content being updated weekly.<br/><br/>Each level provides unique obstacles and challenges so make sure you're racing at your best. Drift smoothly around each corner and avoid the obstacles, make one small mistake and you will be sent flying into the abyss. Drive well enough and you will earn enough money to unlock the best and fastest cars.<br/><br/>Racing has never been so much fun! Drift Worlds combines real life graphics with a fun arcade feel, with unique and exciting levels to conquer. Don't forget to challenge you friends to see who will become the ultimate Drift King!<br/><br/>🔥🔥🔥<br/><br/>FEATURES<br/>✓ Real time car damage: On crashing you car will respond to the impact with dents and damage effecting the cars model. It will not effect how you race so don't worry about repairing.<br/>✓ Over 24 cars at launch: 2 dozen cars added at launch with more added over the coming weeks! Take your drift to the next level with one of the many sports cars added. Maybe take an unconventional muscle car out for a drift!<br/>✓ New tracks added weekly: With constant updates you will have an endless amount of racing to accomplish.<br/><br/>🔥🔥🔥<br/><br/>WHAT'S NEW<br/>- Driving has been optimised to be more responsive to turning.<br/>- 3 New cars added!<br/>- 2 new levels added!</p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T04:51:38", "background_image": "https://media.rawg.io/media/screenshots/4ba/4ba04415d5dee051fd8e928ae2777fca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MomasVII"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}