{"id": 426977, "slug": "tyles", "name": "Tyles", "name_original": "Tyles", "description": "<p>How to play:</p>\n\n<p>This game is played using the mouse. Drag and drop tiles to move them. Click tiles to level them up.<br/>To level up a tile, the surrounding tiles have to be “balanced”</p>\n<p>This means that, for the surrounding tiles:<br/>If there are x amount of tiles of a specific level, there must also be x amount of tiles of the other levels<br/>For example: if there are two level 2 tiles and one level 1 tile surrounding a tile, that tile can be balanced out by either adding a level 1 tile or removing a level 2 tile.<br/>Blank spaces don’t count as tiles.</p>\n<p>In addition, when balancing, a tile only takes into account tiles that are either the same level as it, one level above, or one level below.<br/>For example: A level 5 tile surrounded by four level 4 tiles and four level 1 tiles would not count as balanced, because it does not take the level 1 tiles into account.</p>\n<p>A tile will have a green border if it can be levelled up. The bars on the tiles represent the number of turns a tile has left alive. A turn is any time you left click the mouse. A tile will not die and will not lose life if it can level up. Points are earned by leveling up tiles, and they are equal to 3 x the new level of the tile.</p><p>Colour guide:</p><p>Green = Level 1. Yellow = Level 2. Orange = Level 3. Red = Level 4. Purple = Level 5.</p>\n<p>Example of play:</p>\n<p>There is a level 2 tile (yellow) that you want to level up. The current tiles around the tile are: 2,2,1,0,0,0,4,5. There are 2 2s, 1 1, 3 0s, 1 4, 1 5. The ONLY tiles that a level 2 tile cares about are level 1,2,3 tiles. This means that when our level 2 tile is checking to see if there are equal numbers of the tiles around it, it only checks whether the numbers of level 1,2,3 tiles are equal. If there are 0 of a tile then it is also disregarded. There are 2 2s and 1 1. 2 =/= 1 so the tile numbers are not balanced. To fix this you SWAP one of the zeros with another level 1 tile elsewhere. The numbers of level 1s and level 2s are now equal (there are no level 3s so they don't matter) so tile's outline goes green to show it can be levelled up. You click the tile to level it up and it goes to level 3 (orange) earning you 3^2=9 points (the tile's timer also is set to 3(level) * 3(constant)). The tile cannot be levelled up again because now it is level 3 so it cares about level 2,3,4 tiles because there are 2 level 2s and 1 level 4. 2=/=1.</p>\n\n<p>Quick note:</p>\n<p>There is no permanent leaderboard in this game. I'm very sorry about that, I just couldn't get reading and writing to files to work for me. It's on my list of things to learn soon.</p>\n<p>- Xhirp</p>\n\n<p>Credits:</p>\n<p>Design: Kyrion, Xhirp</p>\n<p>Programming: Xhirp - https://xhrip.itch.io/ - https://www.twitch.tv/squalm</p>\n<p>Art: Wolfie</p>\n<p>Sound: JonScores - https://www.jonscores.com/</p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T05:43:27", "background_image": "https://media.rawg.io/media/screenshots/af1/af165f332027b4516f6bbc0520119cb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xhrip"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}