{"id": 426997, "slug": "glacial-adventure-ataris-frostbite-remake", "name": "GLACIAL ADVENTURE - Atari's Frostbite remake", "name_original": "GLACIAL ADVENTURE - Atari's Frostbite remake", "description": "<p>GLACIAL ADVENTURE - Atari's Frostbite remake<br/></p>\n<p>Release N.: V.1.1 - 2009 - Freeware</p>\n<p>http://www.orbemidia.com - dimitrikozma@gmail.com</p>\n<p>Atari's Arcade Action classic Frostbite remake with new graphics and adictive gameplay. </p>\n<p>-------</p>\n<p>Is cold outside and would be nice to have some fun inside a hot igloo. So, Let's build it!</p>\n<p>Glacial Adventure is a remake with new graphics of classic Activision's Atari 2600 Game, Frostbite. New graphics and smooth gameplay in the same simple and adictive game from the past.</p>\n<p>Features:<br/>- Random animations when you finish a stage<br/>- Cartoon Graphics<br/>- Fast and dinamic gameplay<br/>- Nostalgic</p>\n<p>HOW TO PLAY</p>\n<p>Left - Left Arrow<br/>Right - Right Arrow<br/>Jump Up - Up Arrow<br/>Jump Down - Down Arrow</p>\n<p>Instructions</p>\n<p>The goal of the game is to build an igloo for yourself piece by piece by jumping on sheets of ice floating in a river. But you have to do this before the temperature, taking the place of a timer, hits zero and you freeze. You also have to avoid birds, crabs and other nasties in the river that would grab you and knock you off the ice - apparently you can't swim, for if this happens, you drown.</p>\n<p>You start off on shore with nothing - jumping on a piece of ice causes it's row to change to blue. Each time you jump on a piece of ice in a row and change its color, you get a block in your igloo back on the shore - you don't get anything for jumping on blue ice. After you've jumped on a piece of ice in each row, they all turn back to white and you can jump on them again, which you'll need to do some times to complete your igloo. The last piece puts a door in the igloo, and then you have to get back to shore and get inside before time runs out.</p>\n<p>If the time limit and the obstacles in the river aren't enough to make the game challenging, don't fear - or rather, do fear, for after a few levels a hungry bear appears on shore, and he's got his eye on you! Now you can't just go jumping back to shore any time you like and getting in the igloo isn't as easy. Time is of the essence, not only so you don't freeze but because the remaining degrees add up your bonus points, but with the bear around, you need to plot your moves more carefully. About the only thing you see that you don't need to worry about are the fish - didn't you know, fish is good for your health!</p>\n<p>This is a fun game! Enjoy!</p>\n<p>Remake created by Dimitri Kozma - www.orbemidia.com</p>\n<p>-----------</p>\n<p>GLACIAL ADVENTURE - Atari's Frostbite remake</p>\n<p>Release N.: V.1.1 - 2009 - Freeware</p>\n<p>http://www.orbemidia.com - dimitrikozma@gmail.com</p>\n<p>Atari's Arcade Action classic remake with new graphics and adictive gameplay. </p>\n<p>-----------</p>\n<p>Atari Remake Frostbite Cool Classic Arcade Action Platform Colurful Fun jump jumping family friendly family-friendly Boy Girl Game Children Funny Levels kid independent cool free style game Dimitri Kozma Orbemidia</p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T05:49:24", "background_image": "https://media.rawg.io/media/screenshots/4ab/4ab3e131b97106f76e3ce503f3ba52c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dimitri Kozma"], "genres": ["Action"], "publishers": [], "esrb_rating": null}