{"id": 42698, "slug": "vae-victis", "name": "Vae Victis", "name_original": "Vae Victis", "description": "<h3>Overview</h3>Welcome to Vae Victis, the minimalistic turn-based strategy game where you choose your faction, build your army, and crush your enemies to expand your empire. With intuitive turn-based combat, this game is easy to pick up but hard to master. Quickly form defensive lines and rapidly attack to claim victory!<br/><br/><br/><h3>Campaign</h3>Start as a small kingdom and work to build a successful empire. Expand your borders while keeping a close eye on your enemies, who are always looking for an opportunity to strike. But war is not your only challenge; managing your economy and people is key to your success.<h3>Multiplayer</h3>Go head-to-head with your friends in custom battles and surprise them with your cunning Celtic archers, strong Roman swordsmen, or Hunnic cavalry maneuvers.<h3>Custom Battles</h3>Not in the mood for a full campaign? Start a custom battle, set your army and enemies, and deploy your strategy for a quick, intense battle.<h3>Key Features</h3><ul><li><strong>Intuitive Turn-Based Combat</strong><br/>Most turn-based combat systems are slow and clunky, however in Vae Victis the combat is fast and dynamic. Quickly form defensive lines and rapidly attack!<br/><br/></li><li><strong>Factions</strong><br/>Choose from a variety of factions with their own special abilities and units to provide a twist to your strategy!<br/><br/></li><li><strong>Units</strong><br/>All units are created to fit their faction, with buffs and nerfs based on the factions' abilities. Making each battle unique.<br/><br/></li><li><strong>Dynamic Combat</strong><br/>Battle outcomes take into account a myriad of factors from unit position, to unit health to special abilities making each situation unique.<br/><br/>woe to the conquered</li></ul>", "metacritic": null, "released": "2014-04-30", "tba": false, "updated": "2023-08-04T02:30:10", "background_image": "https://media.rawg.io/media/screenshots/f14/f14e0de044336bca2f6985456b982f64.jpg", "website": "http://vaevictisgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Nicholas Rizzo", "Razvy"], "genres": ["Action", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Nicholas Rizzo", "Razvy"], "esrb_rating": null}