{"id": 427042, "slug": "attrahunt-temple", "name": "Attrahunt Temple", "name_original": "Attrahunt Temple", "description": "<p>Hi, this is my first game and i'm essentially testing the idea of a plataformer  where the key mechanic is that the player is attracted by his enemies.</p>\n<p>Controls: </p>\n<p>Move with the arrows</p>\n<p>Jump with spacebar</p>\n<p>X,Z,C for attack</p>\n<p>P can close the game <br/></p>\n<p>IMPORTANT : Each attack button has a different knockback on hit. X will send your enemy in the direction you are facing,Z and C will send your enemy in the direction your facing but with a slight tilt,Z will always tilt anticlockwise and C clockwise.</p>\n<p>There currently are 2 levels and 1 extra boss if you beat both levels.Any criticism is welcomed and please report any weird interaction you find.</p>\n\n<p>Hola , este es mi primer juego  y esencialmente estoy probando la idea de un plataformero donde la mecánica principal es que el jugador es atraído por los enemigos .</p>\n<p>Controles: </p>\n<p>Muevete con las flechas</p>\n<p>Salta con espacio</p>\n<p>X,Z,C para atacar</p>\n<p>P puede cerrar el juego</p>\n<p>IMPORTANTE : Cada botón de ataque tiene un knockback distinto. X empujara al enemigo en la dirección que apuntas ,Z y C empujaran al enemigo en la dirección que apuntas pero con una inclinación ,Z añade una inclinación en dirección contraria a las manecillas del reloj y C en la dirección de las manecillas del reloj.</p>\n<p>Actualmente hay 2 niveles y un jefe extra si vences ambos niveles .Cualquier critica es bien recibida y por favor reporten cualquier interacción rara que encuentren.</p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T06:01:46", "background_image": "https://media.rawg.io/media/screenshots/c37/c37f798ba61c4ca7325d9be6de31e70a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["SeGuSa123"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}