{"id": 4271, "slug": "lights-camera-party", "name": "LIGHTS, CAMERA, PARTY!", "name_original": "LIGHTS, CAMERA, PARTY!", "description": "When one of APE TV’s satellites crashes on the Funzini family’s house, the studio owner, Gus Pacho, invites them to live on his studio lot. But there’s a catch: as long as they’re living there, they have to star in a wide swath of crazy TV shows and compete for the grand prize: THE HOME OF THEIR DREAMS!<br/>In this irreverent, wacky challenge/adventure funfest, players have to compete against each other in a slew of game modes that promise the most awesome, most hilarious, over-the-top PlayStation®Move motion controller experience of their gaming lives. Lights, Camera, Party! boasts a frenetic, family-friendly gameplay for up to 8 players sharing a single controller. They will find themselves catapulted through a cavalcade of insane mini-games, including a full story mode, 3 party modes, 50 mini-games, 5 playable characters, 150 challenges, over a dozen trophies and 200 in-game achievements!<br/><br/><br/><br/>PlayStation®Move motion controller and PlayStation®Eye (sold separately) required to use this product.     <br/><br/>Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.<br/><br/>PlayStation®Move motion controller and PlayStation®Eye camera required.<br/>PlayStation®Move navigation controller or Wireless Controller required.<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.<br/><br/><br/>All other trademarks are the property of their respective owners.  <br/><br/>PlayStation®Move motion controller and PlayStation®Eye (sold separately) required to use this product.", "metacritic": null, "released": "2012-08-28", "tba": false, "updated": "2019-08-02T16:22:02", "background_image": "https://media.rawg.io/media/screenshots/794/79460c84c0dcee56f46adf0fdbc62242.jpg", "website": "http://www.lcpgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Frima Studio"], "genres": ["Arcade", "Family"], "publishers": ["Frima Studio"], "esrb_rating": "Everyone 10+"}