{"id": 427284, "slug": "grandmas-cat", "name": "Grandma's Cat", "name_original": "Grandma's Cat", "description": "<p>[ENG]<br/>Dynamic game about cleaning rooms, which are destroyed by exploding cat! On Normal mode, every 60 seconds Mruczek will cause an explosion that scatters around all the items in his range. If we fail to put them back on their original place after given time, he will explode once again.</p>\n<p>Game will judge our speed, and will punish us for loosing composture and reckless behaviour. Autistic physics of Unity won't make your task any easier.</p>\n<p>Game offers unique interactions with the cat and items.<br/><br/>[PL]<br/>Dynamiczna gra polegająca na sprzątnięciu pomieszczeń niszczonych przez bombowego kota. Co pewien przedział czasowy Mruczek wykonuje bombowe miałknięcie rozrzucające wszystkie przedmioty dookoła niego. Jeśli w przeciągu np. 60 sekund nie uda nam się rozstawić na miejsca wszystkich elementów, Mruczek wykonuje miałknięcie jeszcze raz.</p>\n<p>Gra będzie oceniać naszą prędkość, a karać za brak opanowania i nieprzemyślane zachowania. Pikanterii do rozgrywki doda (wadliwa, jednak zabezpieczona tak, aby grę dało się ukończyć) fizyka Unity, nie raz przewracająca nam szafki pełne przedmiotów bądź wyrzucające sofę na drugi koniec pokoju.</p>\n<p>Gra będzie oferuje interakcje z przedmiotami jak i kotem.</p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T07:00:41", "background_image": "https://media.rawg.io/media/screenshots/99d/99dfc7bcf685e85960cbd63cd7dafc47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RGI"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}