{"id": 427291, "slug": "thegoldrushbeta", "name": "TheGoldRushBeta", "name_original": "TheGoldRushBeta", "description": "<p>Last week, we polished the UI and characters’ animation. We redesign the four characters. Now their animations are juicier and have the same art style. Based on last week’s playtesting feedback, some people believed that the boxes are irrelevant to our game. Players tended not to break them. We decided to add two new items to our game. One provides a speed buff, and the other one is a shield. These items can be obtained by breaking boxes. Some people said that they counldn't tell who is p1, p2, p3, and p4 in the final scoreboard. We added the player id indicator to resolve this problem.  Also, some people said that they could not choose between the red team and the blue team. We redesign the character selection scene to give players the freedom to choose their team. Besides, people said that it was not clear when one team was going to win. We use a progress bar to make it more clear. We also implement new mechanism that player can heal themselves when they return to their bases. As for professionalism, we polished and added more audios. We also implemented the scene transition for our game.<br/></p>\n<p>In the future, we will keep working on the game balancing, since we will introduce several new mechanisms. Since we haven't finish color palettes, we will also keep working on color palettes to make our game's UI fonts softer. </p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T07:02:16", "background_image": "https://media.rawg.io/media/screenshots/e65/e65383ffb2938ff51092c479490704cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yjxqwed"], "genres": ["Action"], "publishers": [], "esrb_rating": null}