{"id": 427334, "slug": "march-madness", "name": "March Madness", "name_original": "March Madness", "description": "<p>TITLE: March Madness<br/>Creator: Christopher Forlines<br/>License: Whatever, enjoy!</p>\n<p>Made for the 2020 DOS Game Jam on Itch.io:<br/>https://itch.io/jam/dos-games-jam</p>\n<p>Created using:<br/>SpriteSomething (iPad)<br/>Aseprite (Windows)<br/>LOVEDOS: https://github.com/rxi/lovedos<br/>NotePad++</p>\n<p>Every time I enter a game jam I like to try to push my skills a little. Although I've been using LOVEDOS to make DOS games in LUA and enjoy the limitations I wanted to push a little further in my core \"engine\" and find out where I could make improvements. Most of these were in the \"cutscene\" system which plays the intro text and win/lose text and I was able to flush these parts out a little better now that I've used them.</p>\n<p>Although not a great game in graphics or gameplay (you mostly wait for time to pass) it was a fun experiment and took more time than I expected which made me work on it a little each day so I wouldn't give up on it like I do most \"long\" projects.</p>\n<p>Goal:<br/>With random food/water/snacks try to survive for 31 days in isolation during the pandemic.</p>\n<p>Bugs/Glitches/Issues:</p>\n<p>No sound or music. (Sorry)<br/>No know bugs (yet) as it's not been tested.<br/>Balance issues. Major balance issues. Like... you will either survive without an issue or die in a couple weeks I can't tell. Feedback <br/>will help greatly here.</p>\n<p>To use:<br/>This is a single EXE file for use in DOSBOX or on a DOS machine. Stability is unknown outside of DOSBOX and sometimes crashes in DOSBOX. If it does, try to run it until it works (floating point issue).</p>\n<p>Scan the file for viruses (and maintain at least 6 feet distant from the file at all times)<br/>Unzip somewhere useful for DOS or DOSBOX<br/>Type MARMAD.EXE to run.<br/>Enjoy</p>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-04-10T07:13:18", "background_image": "https://media.rawg.io/media/screenshots/fcd/fcdb827f4287296a2bf232942d6ce635.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["4KbShort"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}