{"id": 427469, "slug": "dusk-mark", "name": "Dusk Mark", "name_original": "Dusk Mark", "description": "Hi guys! This game is still in the verification stage and its functions are not complete. It only has a 10-minute battle flow.<br/>\n<br/>\r\nThis version of the game is a free beta version, the expected process is 20 minutes, and the official version is about 2 hours in length.<br/>\n<br/>\r\nThis is my first game, but I will definitely finish this game.<br/>\n<br/>\r\nIf you have any questions, please feel free to contact me:<br/>\r\n1. Trace of 暗光之痕@bilibili;<br/>\r\n2.QQ group 1029389047;<br/>\r\n3.Email deanpang@126.com.<br/>\n<br/>\r\nI will reply if there is any information, but because the game production is busy, please forgive me if you do not respond in time.<br/>\n<br/>\r\nThe dusk mark is a symbol of strength given by the gods and a fantasy legend that has been lost for thousands of years. The protagonist is sent to Driftleaf Town, deep in the dense forest. The power of the imprint is carried on the back, and what is waiting for him?<br/>\r\nTraditional RPG, combat is dominated by strategy. In the face of various enemies and dilemmas, rely on the scarce resources at hand to think hard about the solution!<br/>\n<br/>\r\nGame Features:<br/>\r\n1. Enemies and events have low repetition, and there are novel things in every corner of the map waiting for everyone to explore;<br/>\r\n2. The setting of background and characters is rigorous and meticulous, and I hope to show the fantasy story as if it were real;<br/>\r\n3. When faced with a dilemma, there are multiple solutions, and you need to weigh the pros and cons and carefully think about the steps forward.", "metacritic": null, "released": "2020-02-25", "tba": false, "updated": "2020-04-13T05:07:14", "background_image": "https://media.rawg.io/media/screenshots/b28/b28e68bb867e3ae7f28a6c280abfcf9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XRPG"], "genres": ["Adventure", "RPG"], "publishers": ["XRPG"], "esrb_rating": null}