{"id": 427481, "slug": "the-aegis-saga", "name": "The Aegis Saga", "name_original": "The Aegis Saga", "description": "The blight eats the world while humans war for scraps. Will you fight, run, or lead your people to the stars? Or murderously ascend the human throne?<br/><br/>Two races clash; humans and turans--human discord versus turan magic. When the turans’ ancestors left the world to walk between stars, wild magic began returning. Now humans war to fill the vacuum, blind to the magical blight that is racing to smother the whole continent. High in their plateaus, the last turans must choose: Fight, follow their ancestors into the stars, or perish. And their fate rests on the life of a human child.<br/><br/>The Aegis Saga is a 280,00-word interactive fantasy novel by Charles Parkes, where your choices affect the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.<br/><br/><ul><li> Play as a male or female human, or as an ungendered turan; gay or straight.<br/></li><li> Race through a hostile city on the back of a feaclaw.<br/></li><li> Betray the trust of a powerful shaman as he teaches you to dance time.<br/></li><li>  Find love on the shingle beside a peaceful water garden.<br/></li><li>  Learn about glyf and how your magic can alter or destroy you!<br/></li><li> See your personality change with your character development, without being locked into decisions to win stats checks.<br/></li><li> Reread a page you missed, or skip ahead during a second read through.</li></ul><br/>Whether you try to understand the new world of the humans, or focus on the mysteries of the blight, either way, the child holds the key to everything.", "metacritic": null, "released": "2020-04-02", "tba": false, "updated": "2020-04-13T05:14:03", "background_image": "https://media.rawg.io/media/screenshots/e99/e99e1e145c7878f5f78dc8082b7bed68.jpg", "website": "https://www.choiceofgames.com/aegis-saga", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Hosted Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": null}