{"id": 427407, "slug": "blockheaven", "name": "BlockHeaven", "name_original": "BlockHeaven", "description": "<p><strong>What is it?</strong></p>\n<p>- This is simple turn-based strategy game, demonstrating basic idea of \"currency\" and \"shield\", protecting from \"currency\". The 0.1.0 version was programmed in less than about 3 days. That is, so far, my furthest gamedev experience. You should definitely try this out.</p>\n<p><strong>How do I play?</strong></p>\n<p>- This is pretty basic. You load in map (there are some maps included in archive), initialize game, select spawn point (red block) for every player (Press next player button at the bottom). Start game once you're ready.</p>\n<p>Once the game starts, random order is calculated in which players make their turns. At the start of every turn, profit is calculated based on amount of controlled provinces, their type, and buildings built on them. People can use their power to conquer new provinces. Different neutral provinces have different amount of power necessary to conquer them. To conquer player's province, you have to spend (5*shield) power. After being conquered new province will get 1 shield, or, if it's conquered from player, it will be (old_shield/2), rounded up (1/2 -&gt; 1).</p>\n<p><strong>Cool! What are the buildings and province types?</strong><br/></p>\n<p>- For detailed information you may want to use in-game help checkbox. There are currently Default, Hill, Mountain, River, Resourced, Farm types of provinces. You can build Fort (anywhere), Village (on top of Farm), Town-City-Fortified city (upgraded from Village), Factory (next to resource pool). Fort gives defense bonuses, village and so on gives per-turn power bonus.</p>\n<p><strong>How do I win</strong><br/></p>\n<p>- To win you have to eliminate all players. Easiest way would be rushing for their capital - the point where player started his game. Conquering capital will give losing side power-per-turn debuffs.</p>", "metacritic": null, "released": "2020-04-05", "tba": false, "updated": "2020-04-10T07:30:34", "background_image": "https://media.rawg.io/media/screenshots/e21/e21833bdd6794ff3bd8b9517c0d21441.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IKTeam"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}