{"id": 427436, "slug": "aishoujo", "name": "AI＊Shoujo", "name_original": "AI＊Shoujo", "description": "<p>━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\n◆The Ultimate 3D Life Simulator◆<br />\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\nAI Shoujo is a simulation crafting and survival game where you&#39;ll enjoy a carefree life of abundance on a lush deserted island. But this is no solitary journey of philosophical contemplation, no! A lovely group of realistic AI ladies will keep your nights from growing lonely and your days filled with comfort and joy.</p>\n<p>AI Shoujo won&#39;t just blow your mind, it&#39;ll blow you...away!<br />\nAll characters in the game are over the age of 18.<br />\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\n◆A Vast Suite of Character Customization Tools◆<br />\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\nCreate the perfect partner with a suite of character creation tools that sport a thick set of Tools &amp; Assets. The girl of your dreams is just a few clicks away!</p>\n<p>And guess what? We&#39;ve upgraded our 3D customization tools to make them more realistic, more detailed, and more satisfying! With a host of all-new features, you&#39;ll soon have a waifu so real she could be a body pillow! Hey, we&#39;ve said it before, and we&#39;ll say it again: bring your (3D!) waifu to laifu!<br />\nSculpt your ideal friend, add some benefits, and experience the pleasure of the best 3D simulation game around! We guarantee it&#39;ll make you pump your fist in excitement!</p>\n<p>━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\n◆Lifelike NPCs◆<br />\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\nBut that&#39;s enough about customizing NPC bodies. We know what you&#39;re really after: their minds! And AI Shoujo&#39;s ladies are no beep-boop robots (unless you&#39;re into that, we won&#39;t judge). They&#39;ll think and make decisions on their own, and you&#39;ll often see them skipping around the island working, playing, relaxing...whatever they feel like!</p>\n<p>Watch as your special AI Shoujo lives, laughs, loves, and learns, and before you know it you&#39;ll have a true partner to share life with on this uncharted desert isle.</p>\n<p>━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\n◆Savor a Slow Life in the Sun◆<br />\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━<br />\nAh! The salty sea breeze!<br />\nAh! The warm tropical sun!<br />\nAh! The verdant green of the jungle!<br />\nThis island is truly a paradise! Cast your eyes about and you&#39;re bound to spot some pirate booty or a brace of tender, juicy coconuts.</p>\n<p>In AI Shoujo, you&#39;ll find yourself immersed in a lovingly crafted 3D map filled with beauty and color. Spend a few days with a few girls on this gorgeous island, and you&#39;ll have memories that will transcend your screen and touch your heart.</p>\n<p>We hope you enjoy AI Shoujo!</p>", "metacritic": null, "released": "2020-03-17", "tba": false, "updated": "2024-03-20T13:35:50", "background_image": "https://media.rawg.io/media/screenshots/3c3/3c35974203aad7597aa040b5b9acbc94.jpg", "website": "", "rating": 4.17, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 20, "beaten": 3, "toplay": 11, "dropped": 3, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Illusion"], "genres": ["Adventure", "Simulation", "Puzzle"], "publishers": ["Illusion"], "esrb_rating": "Adults Only"}