{"id": 427421, "slug": "journey-2d-frigo_flamboyant", "name": "Journey 2D (frigo_flamboyant)", "name_original": "Journey 2D (frigo_flamboyant)", "description": "<p><em>See English Translation Below </em><br/></p>\n<p>Voici mon projet pour la Potat0 jam : un prototype de Journey en 2D.</p>\n\n<p><strong>Objectif :</strong> Activer les 6 pierres qui ouvrent la porte à la fin du niveau.<br/></p>\n<p><strong>Commandes </strong></p>\n<p>Déplacement : flèches.<br/>Parler/Bulle : Z, W, clic gauche. 3 tailles de bulle selon que l'on clique/presse ou maintienne la touche (clic, clic d'1 seconde, plus de 2 secondes).<br/></p>\n<p>Toucher une écharpe permet de recharger son nombre de sauts et la jauge de planage. Pour sauter plus haut, plus loin et plus longtemps, n'hésitez pas à spammer ces bulles près des tissus volants.<br/></p><p>L'expérience\r\n est courte, il me manque quelques sons, une animation, des sprites qui \r\nprennent en compte l'allongement de l'écharpe à chaque obtention de \r\nsymbole pour signifier l'augmentation de la jauge de planage. Jauge pour laquelle il manque un feedback indiquant sa taille et son état (vide ou non).</p>\n<p>Cette fois-ci, j'ai produit l'intégralité de mes sprites au lieu d'en utiliser des libres de droit comme lors de ma précédente game jam. Seuls les effets sonores et la musique ont été empruntés (cf crédits ci-dessous).<br/><br/>En tout cas, je suis motivé pour faire les 4 (ou 5) niveaux restants :p<br/></p>\n<p>J'attends vos commentaires avec impatience :)<br/></p>\n<p>Commandes:<br/>Flèches pour se déplacer</p>\n<p>Clic gauche ou Z ou W pour \"parler\"/faire une bulle.</p>\n<p>Si la bulle atteint les fragments volants, cela recharge la jauge de planage.<br/><br/>Pour terminer le niveau, activer chacune des pierres avec la bulle.</p>\n<p><em>MAJ</em></p>\n<ul><li>Il n'est désormais plus possible de spammer la flèche du haut pour traverser le niveau</li><li>Le nombre de saut en l'air, sans activer d'écharpe, est désormais limité au nombre de symboles blancs récupérés\r\n</li><li>Ajout de morceaux d'écharpe pour plus de liberté de mouvements dans le niveau</li><li>Ajout d'effet pour les morceaux d'écharpes</li><li>Correction des OOB (Out Of Bounds)</li><li> Il n'est désormais plus possible de bouger le personnage à la fin du niveau, une fois que la statue s'illumine</li><li>La camera se détache du personnage à la fin du niveau</li><li>Ajout d'une zone secrète</li><li>Ajout d'une légère parallaxe sur les dunes</li></ul>\n<p>Bugs connus : <br/></p>\n<p>Construct ajoute parfois tout en haut des sprites. C'est le cas pour le haut des dunes.<br/></p>\n<p><em>UPDATE</em><br/></p>\n<ul><li>It is no longer possible to spam the up arrow across the level</li><li>The number of jumps in the air is now limited to the number of symbols collected. This number is reset on collision with the floating tissue fragments</li><li>Tissue fragments have been added to give more freedom of movements across the level  </li><li>Tissue fragments now have a warp effect </li><li>All OOBs that were found are now solved</li><li>It is no longer possible to move once the final statue is lit</li><li>A secret zone has been added</li><li>parallax has been added to the Dune Layer</li></ul>\n\n<p>___________<br/> Credits <br/>___________<br/></p>\n<p>Music : <br/>Bensound - Sad Day<br/></p>\n<p>Sound Effects : <br/>Audio Micro Sound Effects Library - Free sound library <br/>Aerosol can spray 1, Aerosol can spray 2<br/>clock mantle half hour 1, clock mantle hour toll with hour chime 1, clock mantle tolling 1, 2, 4</p>\n\n<p><em>ENGLISH DESCRIPTION<br/></em></p>\n<p>Here is my project for the Potat0 jam: Journey2D. <br/><br/>This is a prototype, some sound effects, animations and sprites are missing, such as the scarf getting longer as you collect the white symbols. It also lacks feedback for the jumping gauge.<br/><br/>Contrary to my previous game jam participation, this time I didn't borrow any free to use graphic assets and made it all myself. Only the sound effects and music are free to use.<br/><br/>If I am brave enough, I'll try to make the other levels.<br/><br/>Commands; <br/>Left and Right Arrows.<br/>Up arrow to jump/glide (if has scarf)<br/>Left click or W or Z to speak / spawn a bubble. (press, hold 1 second, hold 2 seconds then release)<br/><br/></p>", "metacritic": null, "released": "2020-04-05", "tba": false, "updated": "2020-04-10T07:33:45", "background_image": "https://media.rawg.io/media/screenshots/b3b/b3bf25762b83ebfc463af64b4ad9b0e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["frigo_flamboyant"], "genres": [], "publishers": [], "esrb_rating": null}