{"id": 427555, "slug": "nations-at-war-digital", "name": "Nations At War Digital", "name_original": "Nations At War Digital", "description": "Nations At War series is a dynamic platoon-level combat computer game based on the award-winning board games of the same series name. Nations At War series centered on armor, artillery and infantry combat during World War 2.  With unparalleled artwork and an impulse-based game mechanic that keeps the player constantly involved, each action-packed firefight plays out cinematically.  <br/><br/><br/>Do you ever wish you could try a new game system and make sure it is for you?  Well now you can, with our Nations At War Digital game.  Nations At War Digital gives you a chance to play two scenarios from our White Star Rising game.   Our game manual comes in a variety of formats for free, these include PDF, EPUB, MP3 (YES Audio) and MP4 Audiobook formats.  Our manuals have lots of examples to illustrate the game mechanics. Our motto is “Play the Game, Not the Rules”.  We understand that the best way to learn a game system is to be shown.  We achieve this with our extensive play-list of “boot camp” training videos, available on YouTube, that walk you through the entire system rule by rule.  <br/><br/><br/>The gameplay is fast and furious and decisions need to be made quickly, leadership is key. Unique Skills enhance effectiveness. And out of the intense fury of a firefight, a Hero may be spawned a Hero who can turn the tide of battle and save the day for your side. <br/><br/><br/>Nations At War Digital, you’ll find everything you’re looking for in a platoon level game: armor, artillery, infantry.  You command and control your forces including air support and you will fight in desperate close assaults.  Nations At War series has you covered with a variety of battles and theaters on every front of World War 2.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T06:03:10", "background_image": "https://media.rawg.io/media/screenshots/ef5/ef5f2ba144abbf6e7baec30b7424eaca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Riveted Games", "Lock 'n Load Publishing"], "genres": ["Strategy", "Indie"], "publishers": ["Lock 'n Load Publishing"], "esrb_rating": null}