{"id": 427544, "slug": "spoils-of-plunder", "name": "Spoils of Plunder", "name_original": "Spoils of Plunder", "description": "<h3>PWN!</h3><ul><li>Settle thine scorn with nemesis old and new in a duel.</li><li>Face all your enemies at once in the Rumble of Bones.</li><li>Dodge the human challenges, and become an accomplished slayer of artificial intelligence.</li></ul><h3>YUGE HAMMER</h3><br/>Aye, thou can wield thine mallet and smack thine associates.<h3>ZIP-ZAP!</h3><br/>Or weave space and time with thine magicks.<h3>LOL, I DEAD</h3><br/>One partakes in this action as a skeletal construct of average hilarity.<h3>In English, please</h3><br/>Spoils of Plunder is a classic arcade action RPG with a twist. It is first and foremost a PvP game where tactics and quick thinking on your feet is more important than rapid clicking of the left mouse button. PvP is played in different modes where unholy alliances and team mates can be betrayed, character builds changed on the run, and loot gathered from fallen enemies.<br/><br/>Spoils of Plunder also features a campaign that can be played in single and multiplayer over the internet. You go forth as the executioner of the underworld, working for the Skeleton Queen. The campaign features monsters, bosses, traps, more monsters, and plentiful loot. As a unique feature, you can also hurt your co-op partners, so taking revenge on a loot ninja is finally possible. The game itself features mechanics that make it much more challenging than your average action RPG, so beware!<br/><br/>The spoils of thine plunder await thee, go forth and claim them!", "metacritic": null, "released": "2020-05-01", "tba": false, "updated": "2020-04-13T05:55:33", "background_image": "https://media.rawg.io/media/screenshots/0c7/0c779f1d4c04822312afe12a5f9e14bd.jpg", "website": "https://spoilsofplunder.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dapper Grim Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Dapper Grim Studios"], "esrb_rating": null}