{"id": 427600, "slug": "arida-rise-of-the-brave", "name": "ARIDA: Rise of the Brave", "name_original": "ARIDA: Rise of the Brave", "description": "Overcome the challenges of the drought to survive this nineteenth-century Brazilian backlands walking trip.<br/><br/>Cícera continues her journey in this single-player that combines elements of survival and adventure. Gather resources, build utensils, learn tools, and interact with other backlands travelers. Be strong. Have faith and wisdom to explore the aridest regions and discover clues that point the way to a very special settlement.<h3>FEATURES</h3><br/><strong>Ready for the night</strong><br/>The day and night cycle adds greater provisioning needs. When the sunlight is gone, new threats will emerge. And new guides too!<br/><br/><strong>Accompanied on the journey</strong><br/>A lonely trip in the backlands can be very dangerous. Stay tuned for the challenges you meet, maybe you can find someone (or something) who will serve as a companion.<br/><br/><strong>Equipped for adventure</strong><br/>The challenges of the backlands require equipment. Use the machete and hoe for vital actions such as getting water, cutting paths or cutting a cornstalk. But don't forget to have a handful of stones as blind equipment is of no use!<br/><br/><strong>Recipes to practice</strong><br/>Living in the backlands requires a science of its own. The fauna and flora are unique, so try to learn the recipes available for crafting with the typical items of the region. <br/><br/><strong>Interact to survive</strong><br/>Hunger and thirst can be quite cruel in the backlands in times of drought. Interact with the other characters you met to solve quests and learn new strategies for getting water and food.<br/><br/><strong>Explore to know</strong><br/>Explore the arid regions to learn more about the backlands and find the resources you need to stay upright. A full inventory is always a good thing!<br/><br/><strong>Stories to learn</strong><br/>The backlands is a special place, with unique stories that would only happen there. Venture to find the lost objects and find out more about the backlands legends.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T06:29:17", "background_image": "https://media.rawg.io/media/screenshots/326/326ad71a404326b570a65400e6fa3141.jpg", "website": "http://aocagamelab.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aoca Game Lab"], "genres": ["Adventure", "Indie"], "publishers": ["Aoca Game Lab"], "esrb_rating": null}