{"id": 427636, "slug": "seduce-me-the-complete-story-2", "name": "Seduce Me: The Complete Story", "name_original": "Seduce Me: The Complete Story", "description": "Introducing the COMPLETE STORY of \"Seduce Me\", the popular English Dating Sim where you get to tell your story with a family of five demon brothers from the moment you meet the incubi to the day you say I do to your favorite incubus. This Complete Story includes \"Seduce Me The Otome\", \"Seduce Me 2: The Demon War\", 13 mini-episodes, and both Audio Otome CDs as well as a basic compendium for lore comprehension! <br/>\n<br/>\r\n\"It seemed like the start of something new. Something that would change.\"<br/>\r\nYou are a senior in high school along with your two best friends, Naomi Patterson and Suzu Cappini. You are also the granddaughter of Harold Anderson, the CEO and founder of Anderson Toys, a toy company sworn to give children amazing products and give a large part of their profit to charity.<br/>\r\nOne day, you get called home to attend your grandfather's funeral. After the funeral, you learn that you have inherited his large estate. Your father suggests you move in immediately, so the next day, you move out of your parents home and into your estate.<br/>\r\nWhen you enter your new home, however, you see five injured, yet very handsome men on the lobby floor. They eventually awaken and make it known that they were attacked by a group of dangerous 'misfits' and ran to find shelter, passing out as soon as they entered your home.<br/>\r\nYou find out that they are incubi, 'demons who consume and use sexual energy of humans to survive'. With nowhere to go and a target on their backs, they ponder what what to do. Out of sympathy, you offer your home as refuge for a while in exchange for minor servitude (it is a big house, after all). They happily agree.<br/>\r\nWhat will happen as the incubi get comfy? Why exactly did they come the human world? Who are the 'misfits', and will they stop pursuing them so the incubi can leave?<br/>\r\n...Will you WANT them to leave?", "metacritic": null, "released": "2020-03-27", "tba": false, "updated": "2020-04-13T06:54:02", "background_image": "https://media.rawg.io/media/screenshots/2ee/2eef097c8dce5a57e16249858c95a82b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Michaela Laws"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Michaela Laws"], "esrb_rating": null}