{"id": 427631, "slug": "frog-space", "name": "Frog Space", "name_original": "Frog Space", "description": "\"A game for people having strong mentality.\"<br/><br/>Frog Space is a simple (indie three-dimensional precision action adventure) game. All you need to do is a mouse and a space bar. Change direction with the mouse, press the space bar to jump. Of course, you can adjust the strength of the jump depending on the time you press the space bar. More precise control will be required over the stage. The skills needed to clear the game have been revealed in four guidebooks, which are in the early part of the game. Of course, there are a few more miscellaneous skills, but they're not necessary. When you're ready, go on an adventure. You will be able to feel that you, not your character, are growing up. Both control and mental strength.<br/><br/><br/><br/><br/>\"The world of Frog Space is connected as one. Sometimes it's good to look back on the path you've walked.\"<br/><br/><br/><br/>There are three main points in Frog Space.<br/><br/>- Obstacles: There are many environments that prevent adventure.<br/>- Lotus: Protects the Froxy from being thrown out of the obstruction. Blue lotus flowers help three times, and red lotus flowers help endlessly.<br/>- Ride: You can find a variety of rides during your trip. It can be helpful, but also it can be disturbing.<br/><br/><br/><br/><br/>Giant Rat : It's full of curiosity.<br/><br/><br/>Cassette Player : Music cue!<br/><br/><br/>BullFrog : Are you ready for the test?", "metacritic": null, "released": "2020-04-16", "tba": false, "updated": "2020-04-13T06:49:57", "background_image": "https://media.rawg.io/media/screenshots/2ae/2ae8238eba928b7c3856721438572562.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HIGHLENDID"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["HIGHLENDID"], "esrb_rating": null}