{"id": 427604, "slug": "divided-reigns", "name": "Divided Reigns", "name_original": "Divided Reigns", "description": "Inspired by some of the best games ever made, Divided Reigns keeps the focus on good storytelling, strategic battles, and immersive exploration just like the JRPG greats of the 90's.<br/>\n<br/>\r\nFeatures: <br/>\r\n- 50+ hours in the main story<br/>\r\n- New, unique, and strategic battle system<br/>\r\n- Deep and emotional main story<br/>\r\n- Loads of side quests and secrets to discover<br/>\r\n- Nine main playable characters each with character arcs that test who they are and develop over the course of the whole game<br/>\r\n- Tons of equipment to build your team for a wide variety of enemies<br/>\r\n- Brand new attack system where you exploit enemy's physical weaknesses similar to other games' elemental weaknesses<br/>\r\n- Regular calendar events with unique rewards only available during the events<br/>\r\n- SO much more!<br/>\n<br/>\r\nFollow Captain Ailfred and Lieutenant Shakar after they are exiled from their home kingdom and try to find peace in a world that seems to love war. Get help from an unexpected place--a wandering Abeyan father and daughter, Habar and Niomi who have a secret they vowed to never reveal. Meet and recruit the fencer Celeste, the daughter of one of the richest men in all of Kairon. Navigate needing the help of a monk named Gall who hates Ailfred for his role in the destruction of his homeland. There are nine main characters in total--each with unique personalities, motives, and story arcs. Each character also brings different strategic tool sets to overcome your seemingly insurmountable foes.<br/>\n<br/>\r\nThe battle system of Divided Reigns has been redesigned from the ground up to make each battle fun, challenging, and feel fresh. Different weapons grant the character wielding it different attack types. Does the enemy have a steel breastplate? Thrust attacks will probably not work well, but Side or Trip attacks might! Just found out the enemy is weak to ranged attacks? Swap that greatsword for a crossbow mid-battle to maximize your attacks. Use the enemy art to try to guess which of the eight different types of attacks will work best, find those weaknesses, and exploit them!<br/>\n<br/>\r\nNostalgia Addict Games is a small indie video game developer who truly cares about the craft and art of creating great games. If a bug is found, a suggestion needs to be made, or you get stuck in the game, the developers are always on the Steam discussion board to help with anything. If you choose to purchase and play Divided Reigns, we want you to know we appreciate you more than you could ever know. We hope you enjoy the game!", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T06:31:59", "background_image": "https://media.rawg.io/media/screenshots/688/688c6e81ef0ba870baa02d628c0f370e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 468, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrew Ryan Henke", "Adam Dover"], "genres": ["RPG"], "publishers": ["Nostalgia Addict Games"], "esrb_rating": null}