{"id": 427745, "slug": "guardian-of-lore", "name": "Guardian of Lore", "name_original": "Guardian of Lore", "description": "<p>Play as Prince Sayri, and save the memory of ancient civilizations from wicked magic that aims to destroy the stories that contain it. Become part of beautifully crafted 2.5D worlds from Native-American folktales, and battle against an evil invader army threatening their disappearance. How much of each story will you be able to preserve for future generations to come? Become a Guardian of Lore and find out! GAME FEATURES<br />\nA CLASSIC 2.5D EPIC ADVENTURE: As Sayri, jump, run, fight, and make your way through the magnificently crafted world of each folktale you enter. Guardian of Lore is a callback to platforming classics, plus unique artistic, story and gameplay features that make for a refreshing experience.<br />\nA BOOKWORM BATTLE MAGE: Make the most out of Sayri´s unique spell casting and combat systems! Use them to traverse each story level however you want, with the weapons and magic you want, and customize prince Sayri´s gameplay to your liking.<br />\nYOUR KNOWLEDGE IS POWER: Use knowledge as a currency to enhance Sayri´s abilities. Collect knowledge hidden inside each level to unlock more powerful magic and items.<br />\nA GAME OF MIGHT AND MYSTERY: Test your skills against the wicked monsters, magical dangers, and unforgiving bosses that lurk within each folktale. Defeat them to uncover the pieces that make up the story of each level you&#39;re immersed in.<br />\nEXOTIC MYTHOLOGIES TO DISCOVER: Become part of whimsical settings with a distinct native Latin American flavor. Through each story, experience art, characters and mythologies that expand upon the fantasy genre in unexplored directions.<br />\nSTORY BRANCHING THAT CHANGES EACH LEVEL: The amount of story details you have recovered inside every level changes it on your play-through. Replay each story to see your impact on its ending and the world it paints on your screen.<br />\nVenture into the Mystical Library, where the knowledge of conquered civilizations lost to time was recorded in books of folktales and myths. With the power of the Amulet of Yebichai, bring the world of each book to life, meet unforgettable stories and characters, and fight to keep the Lore of old alive!</p>", "metacritic": null, "released": "2021-05-21", "tba": false, "updated": "2022-03-10T14:21:57", "background_image": "https://media.rawg.io/media/screenshots/049/049ff20fac9e08711c700226966ae10d.jpg", "website": "https://guardianoflore.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Round2Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Round2Games"], "esrb_rating": null}