{"id": 427720, "slug": "texas-holdem-poker-solo-king", "name": "Texas Holdem Poker: Solo King", "name_original": "Texas Holdem Poker: Solo King", "description": "Single-player, No Limit, Texas Hold'em, Sit &amp; Go game, NO Ads, NO IAP, VS 245 AI, 2 rules: Shootout &amp; Heads-Up, 5,000,000 chips.<br/>\r\nCustomize your own game structures to help you focuses on training and improving your poker skills. <br/>\r\nExtensive statistics to help you analyses your own playing traits.<br/>\r\nAndroid, windows, Mac version released.<br/>\r\nStart playing Solo king on your phone and continue on pc or tablet with the same data.<br/>\n<br/>\r\nAre you a rookie? Or a professional? Whatever! Want to learn how to play poker, or just practice in controlled conditions? Then this is the App for you.<br/>\r\nApp focuses on training and improving your poker skills and gaining experience in the game of Texas Hold’Em，and getting a chance to be the best poker player ever.<br/>\r\nEven experienced players will benefit from being able to practice and resolve playing weaknesses. The game also analyses your own playing traits and statistics, so you can track your improvement and discover how opponents see you.<br/>\n<br/>\r\nSolo King will turn beginners into winners, amateurs into professionals and professionals into superstars!<br/>\n<br/>\r\nWhether you want to compete Shootout tournaments or prefer playing Heads-up poker games, Solo King is your home for authentic gameplay.<br/>\n<br/>\r\nSo, what are you waiting for?<br/>\r\nPress Buy and download Solo King NOW.<br/>\n<br/>\r\nOur Exciting Features:<br/>\r\n1: Single-player : You and 245 CPU AI. 2 rules：Shootout Tournaments(210 AI), Heads-Up Tournaments (35 AI). <br/>\n<br/>\r\n2: Buy the game ONE TIME! Free to play forever. NO annoying advertisements. NO in-app purchases to keep taking your money! MORE THAN 60 HOURS of Texas Hold'em Poker play.<br/>\n<br/>\r\n3: Customize your own game structures: 7 levels: 1-7 , 7 blinds: 100/200 – 10000/20000, table's players: 5~9 , man or woman, Volume controls for Sound and Voice effects, Game speed control. Different degrees of difficulty.<br/>\n<br/>\r\n4: Fair play guaranteed: Be assured that the hands dealt are purely random and collusion prevention guarantee and is bound by our 100% Fair Play Guarantee: no tricks, no cheat, and nothing is done to give the AI any unfair advantage whatsoever.<br/>\n<br/>\r\n5：Best logical CPU AI opponents: <br/>\r\n245 unique personality AI opponents, each crafted with specific playing traits and skill levels ( Decided to Personality factor, Emotion factor, Strategy factor ). This poker AI engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players. <br/>\n<br/>\r\n6：Single account，Continuous play：one account to deal on any device ( mac，all Android phones and tablets, windows pc. download Solo King from  google play : https://play.google.com/store/apps/details?id=org.cocos2dx.SoloKingSinglePlayTexasPoker ).<br/>\r\nOn-line mode: Very low network traffic：less than 10k bytes per hour. <br/>\r\nLocal data persistence stored in the cloud. Ensure data consistency at all ends and never lose. <br/>\r\nSynchronize data when logging in. After logging in, you can run offline.<br/>\n<br/>\r\n7: Extensive statistics: Get detailed stats to track your progress and status in the game! Gain experience points to level-up!<br/>\n<br/>\r\n8: Earn more chips：<br/>\r\nAdd poker friends by Social network, text or email! You can get free chip gifts by each poker friends invitation. After your buddy login the game, you will be rewarded 500000 chips. The buddy you invited will get 500000 FREE chips! <br/>\n<br/>\r\n9：Online leaderboards:  Compete against the world to see who is truly the best poker player.<br/>\n<br/>\r\n10：18 localized languages in game,  realistic sounds, smooth animations, simple UI design，suitable for all level games players<br/>\n<br/>\r\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.", "metacritic": null, "released": "2020-03-04", "tba": false, "updated": "2020-04-13T07:44:16", "background_image": "https://media.rawg.io/media/screenshots/52c/52cfa0e2c367ad48d3a04f4b32131533.jpg", "website": "https://play.google.com/store/apps/details?id=org.cocos2dx.SoloKingSinglePlayTexasPoker", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["xiaodong sun"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["xiaodong sun"], "esrb_rating": null}