{"id": 427703, "slug": "rift-wizard", "name": "Rift Wizard", "name_original": "Rift Wizard", "description": "Rift Wizard is a tough as nails retro fantasy roguelike, with an emphasis on strategy and build planning.<br/>\n<br/>\r\nYou play as an immortal amnesiac wizard, who must relearn magic as he crosses a myriad of dangerous realms to slay his nemesis.<br/>\n<br/>\r\nWill you become a powerful fire wizard, roasting hordes of foes with fireballs and pillars of flame, summoning fire dragons and elementals for backup, dabbling in chaos magic to deal with the odd fire resistant foe?<br/>\n<br/>\r\nOr will you write your spellbook into a complex engine of death magic, harvesting souls from fallen enemies to fuel death wheels and nightmares, protecting yourself with the reanimated corpses of your foes, eventually even backing up your undead hordes with healing magic?<br/>\n<br/>\r\nPerhaps a hybrid approach would be wise- the denizens of the wastes are quite varied, and what is devastating and overpowerning in one realm might be laughably useless in another.  There is an art to authoring the perfect spellbook, focused enough to achieve great power, but diverse enough to never be irrelevant- an art you must perfect if you are ever to succeed.<br/>\n<br/>\r\nWhatever you do, manage your magical resources carefully!  The empires and civilizations of man fell long ago, now there is only chaos in the universe.  There is nowhere to rest or shop- you must survive only on what you find in the desolate ruins of the universe, and what you can conjure forth from your mind.  Should you fall, you will forget everything you know, lose all the magic you have learned, and be forced to start again a thousand years later from nothing.", "metacritic": null, "released": "2020-07-28", "tba": false, "updated": "2023-10-30T05:27:07", "background_image": "https://media.rawg.io/media/screenshots/c40/c40a3f6236fb1d2a488bd27f0e33529f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 49, "toplay": 7, "dropped": 2}, "playtime": 2, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Dylan White"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Dylan White"], "esrb_rating": null}