{"id": 427780, "slug": "cepheus-protocol", "name": "Cepheus Protocol", "name_original": "Cepheus Protocol", "description": "A mysterious virus of alien origin is sweeping through San Francisco. It is up to the Center for Epidemic Research and Control (CERC) to track down and find Patient Zero before it is forced to enact the Cepheus Protocol. Command your squad, save civilians, and stop the Pangu Virus before it is too late.<br/><br/>Main Objectives:<br/><ul><li>Train and level a single squad of up to 8 members as you search the city for Patient Zero.<br/></li><li>Build, train defenders, and safeguard your base from the Pangu Virus’ victims. <br/></li><li>Manage your squad as you attempt to control the spread of the virus.</li></ul><br/>Strategy:<br/><ul><li>Take command of Captain Adrian Winter as she leads an 8-member squad of elite soldiers as you attempt to stop the Pangu Virus from spreading beyond containment. <br/></li><li>Choose how to spend your in-game money on important upgrading to your barracks, improving weapons, or buying new soldiers to fill your ranks. You earn in-game money by completing main and side missions, and eliminating the infected. <br/></li><li>Collect viral samples to better improve your squads’ abilities and expand your understanding of the virus before it is too late.<br/></li><li>Every life matters and every soldier counts. If Captain Winter dies, it’s game over. Decide whether to leave her at the base or use her advanced skill-set to even the odds while in the field. </li></ul><br/><h3>Pangu Meteorite</h3>In the farthest reaches of the frozen Antarctic ice shelve, Chinese researchers discovered a 4.8 billion-year-old meteorite that had microscopic alien organisms deep within the rock. Decades later, after a Special Forces raid to retrieve a sample of the virus that had been cultivated from the discovery, Chelsey Trader is accidentally exposed to the Pangu Virus.<br/><br/><br/>Becoming Patient Zero, inadvertently, she spread the virus, which infects innocent civilians which are mutated into monstrous beings under her control. <br/><br/><h3>Build and Defend Your Base</h3><ul><li>Building: At the onset of the game, you’ll be able to build a base comprised of specialized buildings where new soldiers can be trained and research on the Pangu Virus can be conducted. <br/></li><li>Defenses: As the threat from the virus grows, your base is at constant risk of being overwhelmed as random and planned encounters with the infected threaten to overrun your only means to find a way to stop the outbreak.<br/></li><li>Patrolling: As the infection grows, more and more parts of the city fall to the Pangu Virus. You must send out patrols to each section of the world and destroy toxic gas towers that spread the virus at an alarming rate. </li></ul><br/><h3>Infection System</h3>The Pangu virus grows stronger by the minute. Complete missions and destroy infection pods throughout the map to lower its spreading rate. Be warned, each soldier under your command is equally at risk of becoming infected. <br/><br/><br/><h3>Tactics on the Battlefield - Combat Features</h3><ul><li>Command Captain Winter as your powerful hero character.<br/></li><li>Train soldiers across various disciplines. These include assault, heavy weapons, Spec-Ops, sniper, scientist, and medical.<br/></li><li>Use tactical awareness to slow downtime and get out of sticky situations!<br/></li><li>Use different squad formations to give you a tactical edge over the infected.<br/></li><li>Use different team dynamics by utilizing specialized units in conjunction with their counterparts for maxim effect. <br/></li><li>You’ll have access to other tools such as carpet bombs, ammo drops, and more!</li></ul>", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-04-13T08:26:53", "background_image": "https://media.rawg.io/media/screenshots/1f4/1f432bbd1b14a0b2f807571ab8daded8.jpg", "website": "https://www.indiedb.com/games/cepheus-protocol", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 26, "owned": 620, "beaten": 1, "toplay": 4, "dropped": 1}, "playtime": 3, "achievements_count": 4, "ratings_count": 5, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Halcyon Winds"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Halcyon Winds"], "esrb_rating": null}