{"id": 427742, "slug": "colony-siege", "name": "Colony Siege", "name_original": "Colony Siege", "description": "Colony Siege is a real-time strategy, survival, and base defense hybrid. Battle in a wide variety of environments to defend the last human colonies from two unique threats. Survive alone or with a friend as you progress through a non-linear campaign.<h3>Defend Your Colony</h3><br/><br/><br/>Whether fighting the Xenos or the Riven, no colony building is safe from attack. While protecting the colony Citadel is your primary objective, the enemy will not discriminate when it comes to attacking your colony.<h3>Use Towers, Traps, Strikes, Mobile Units, and Special Abilities</h3><br/><br/><br/>Defend with powerful towers that automatically form walls when placed near each other. Use unique traps to slow, impale, burn, or bombard the enemy. Build and command mobile ground units. Strike the enemy with satellite-powered attacks, long-range missiles, commander abilities, and fighter sorties.<h3>Design Mazes Before and During Battle</h3><br/><br/><br/>Defensive towers and barriers automatically generate a laser fence when constructed close together, allowing your mobile units passage while restricting enemy movement.<h3>Embark on an Epic Campaign</h3><br/><br/><br/>Experience dozens of intense missions from a starmap with branching paths. Press your advantage or repeat previous missions for extra cash.<h3>Fight Alone or with a Friend</h3><br/><br/><br/>The entire campaign is cooperative from the very first mission to the last. Consolidate forces with a friend or combine different tactics.<h3>Battle Both Xeno and Riven Enemies</h3><br/><br/><br/>Defend against the relentless biomechanical xeno swarm as well as the corrupted Riven that were once human. Both enemy factions behave differently and require different tactics.<h3>Persistant Progression System</h3><br/><br/><br/>Earn money from completing mission primary and bonus objectives, and spend it on persistent upgrades, new weapons, and different towers, traps, units, and strikes. Unlock powerful perks to buffer your weaknesses or bolster your advantages.<h3>Battle in a Wide Variety of Environments</h3><br/><br/><br/>Expect a constant change of scenery as you travel to different planets, moons, space stations, and enormous mobile space platforms.", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-16T16:55:46", "background_image": "https://media.rawg.io/media/screenshots/611/611e310fd35a237945e004a85dabe5c4.jpg", "website": "https://www.colonysiege.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22, "beaten": 1, "dropped": 2}, "playtime": 4, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 527, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Finifugal Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Finifugal Games"], "esrb_rating": null}