{"id": 427707, "slug": "love-me-forever", "name": "Love Me Forever", "name_original": "Love Me Forever", "description": " <strong>From Brendan's view:</strong> The story is about how I as a heroic firefighter save a pretty girl trapped inside a burning building. We start to date, she suddenly becomes very clingy and druggs me. Next thing I know, I wake up inside her father's basement with an electric bracelet attached to my ankle. What kind of girl does something like that?!?<br/><br/> <strong>From Allison's view:</strong> The story is about how a boy, that is also my soulmate saves my life. We're in love and want to get married and have babies together! We currently are living very happily at my father's house. We're going to have such an amazing life together!<br/><br/><br/><br/> <strong>Brendan</strong> likes to play the hero in every given situation<br/> <strong>Allison</strong> is your girlfriend and soulmate (Alli forced us to write this..)<br/> <strong>Jerry</strong> is your best friend, he only became a firefighter to get girls<br/> <strong>Tori</strong> is the paramedic and only female in the firefighter crew<br/> <strong>Maddox</strong> the driver engineer, drives the fire truck like a racecar driver<br/> <strong>Vernon</strong> is the captain and your supervisor (he is also a moron)<br/><br/><br/><br/> <strong>A unique RPG with puzzle elements</strong> tied to the relationship of the main characters<br/> <strong>A messed up Story</strong> that will question your relationship (if you are in one)<br/> <strong>Inspired by a ex-girlfriend</strong> of one of the developers (she bugged the house)<br/> <strong>Original hand drawn Art</strong> created by a colorblind web designer that had an F in art<br/> <strong>Curse Words</strong> like the s-word and f-word (not scumbag, not fudge,..)<br/> <strong>Girly Shoulder Bag</strong> looks pretty ladylike, but you need it to stash all your tools inside<br/> <strong>Glow-in-the-Dark Stickers</strong> can only be collected during darkness (turn the light off)<br/> <strong>Zodiac Coins</strong> exchange them for future predicts from Alli's grandma (she is a psychic)<br/> <strong>Video Tapes</strong> will show you intense scenes from your relationship with Allison<br/> <strong>Sweet Minigames</strong> can be found in the game, also arcade machines<br/><br/><br/><h3>What kind of a game is this?</h3>Love Me Forever is a puzzle and exploration RPG with an inventory system. Find tools, objects, consumables, keys and use them to unlock doors, overcome obstacles and solve puzzles. The game focuses on story and gameplay and is combat-free.<h3>What is a cool feature of the game?</h3>The game has 15 video tapes you have to find, each tape will reward you with a funny flashback scene from your relationship with Allison. In every flashback you will find a hint, that will help you to solve a puzzle in the game (so pay close attention!).<h3>Where does the game take place?</h3>The main part of the game takes place in the mansion of Alli's family. The firefighter part is the prolog of the game, the game begins in the dormitory (Brendan's room) in the fire department.<h3>In which languages will the game be translated?</h3>We currently planning to release the game in english, german, japanese and chinese. Also considering to translate it into more languages after release.<br/><br/><br/><br/>Game footage not final.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T07:37:18", "background_image": "https://media.rawg.io/media/screenshots/522/5223309368e48363c3567539a20843ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Frogmouth"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Frogmouth"], "esrb_rating": null}