{"id": 427714, "slug": "shardhunters-2", "name": "Shardhunters", "name_original": "Shardhunters", "description": "<strong>SHARDHUNTERS</strong> is a <strong>competetive </strong>collectible tactics game.<br/><br/>Intense skirmishes on a 9x7 battleboard. Gain control over valuable Bloodhards by strategic positioning and powerful abilities to achieve victory. Unlock new mastery and skill combinations with the newly gathered resources. New units are added to the game every month to shake up the metagame.<h3>KEY FEATURES</h3><ul><li><strong>Strategic Depth</strong></li></ul> With a tactical battlefield, positioning of your units and team building is truly matters. And with 90 unique skills and 18 masteries the possibilities are infinite!<br/><br/><ul><li><strong>Fast Matches</strong></li></ul> Online matches last from 15 to 20 minutes. It is very easy to get involved if you up for a challenge!<br/><br/><ul><li><strong>Competitive</strong></li></ul> Play against players of equal skill on the monthly Season Ranked Ladder. Or compete in the Arena Draft Mode, where the longer you last, the better the rewards!<br/><br/><ul><li><strong>Gorgeous 3D Models</strong></li></ul> Your hero collection is not only deadly but equally beautiful, armed with brilliantly animated abilities.<br/><br/><ul><li><strong>Immersive Lore</strong></li></ul> It is the middle of the 17th century. Magic has awakened and the world is overrun by hordes of the undead revived by the Witchplague. Entire nations have disappeared, and their people are scattered all over the continent. Uncover the mysteries of alternate Europe!<br/><br/>Competitive turn-based skirmishes at its finest!<br/><br/><br/>Build your party of heroes from <strong>90 abilities</strong> across <strong>18 different masteries</strong> and test your skills against other players online in ranked season ladder and draft mode tournaments.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T07:40:46", "background_image": "https://media.rawg.io/media/screenshots/4ae/4ae44148b2da991985b43f9b617c5cfa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lycan Studio"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Lycan Studio"], "esrb_rating": null}