{"id": 427773, "slug": "my-jigsaw-adventures-roads-of-life", "name": "My Jigsaw Adventures - Roads of Life", "name_original": "My Jigsaw Adventures - Roads of Life", "description": "Get ready for an amazing journey made of jigsaws, driven by a fantastic story!<br/><br/><br/><br/><strong>Story</strong>: Love is a double-edged sword... After the loss of your loved one, would you do everything to see her again? Would you travel the world seeking hope and answers or surrender yourself to death? Can love be revived?<br/><br/><br/><ul><li>A beautiful story driven jigsaw game<br/></li><li>Hand painted pictures by a professional artist - no photo stock<br/></li><li>Choose among a selection of shapes: traditional jigsaw, mosaic or triangle<br/></li><li>All jigsaws available in 5 different sizes (from 28 to 220 pieces)<br/></li><li>Set your own difficulty level thanks to customization settings (choose to display the picture or no, display the grid, etc.)<br/></li><li>Unique music for each puzzle<br/></li><li>Download the puzzles you completed as wallpaper for your computer.</li></ul><br/>But that’s not all! Roads of Life also has two game modes to fit your mood. So, are you in for RELAXATION or CHALLENGE?<h3>Standard Mode:</h3>Play Without A Timer and Get Unlimited Hints!<h3>Challenge Mode:</h3>Apply a time limit to any jigsaw! Better the score, better the medal...<br/>Hints are stacked in this game mode. You’ll earn one hint per jigsaw puzzle completed.<br/><br/><br/>MJA is made, tested and translated with the help of an amazing community - mostly jigsaw lovers - from all over the world and we can’t thank them enough! <br/>Check the credits to see their names.<br/>Roads of Life is the first episode of a series, join us for the next games!", "metacritic": null, "released": "2020-04-01", "tba": false, "updated": "2020-04-13T08:23:01", "background_image": "https://media.rawg.io/media/screenshots/f36/f367ea8cf221ea6f8a49356681ce6e1d.jpg", "website": "https://twitter.com/coldcoffeegames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["CCS"], "genres": ["Casual", "Indie"], "publishers": ["CCS"], "esrb_rating": null}