{"id": 427748, "slug": "oh-frog", "name": "Oh Frog", "name_original": "Oh Frog", "description": "The Frog Kingdom’s most prized artifacts, the <strong>Crowns of Power</strong>, have been stolen and the world is plunged into chaos. As darkness slowly seeps through the land, the Crowns' power has began to twist and corrupt nature herself into a force of evil. Desperate, King Frog summons you, <strong>Lif</strong>, the Kingdom’s last ray of hope and bravest frog, to recover the Crowns and restore peace across the land!<br/><br/>     A colorful and loopy 2D action adventure game, Oh Frog invites you to explore the gorgeous and peculiar  Frog Kingdom, unravel its mysteries and brave its terrible dangers! Using the simple and addictive hook-and-swing mechanic guide Lif through handcrafted perilous traps and ancient puzzles or bounce around and clobber your enemies. Embark on a magical adventure and discover hidden relics, aid unlikely allies and battle epic bosses!<br/><br/>   Experience a fairy tale-esque land full of luscious forests, eerie swamps, windy mountaintops and many more, all hand drawn with meticulous detail and love to invoke the feeling of a dream-like world. Whether friend or foe, all characters come alive through masterful animation and a pinch of derpiness! Watch Lif’s story unfurl in lighthearted comic strips as you conquer stages and progress through the game. <br/><br/>   But wait! There’s more!Duke it out with three other friends in classic deathmatch-style or fight for control of an ancient artifact, in local coop mode! Choose between five legendary frog heroes and fight for victory in ancient battlefields.<br/><br/>Dive into an incredible adventure of frogtastic proportions!", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-13T08:09:38", "background_image": "https://media.rawg.io/media/screenshots/c85/c850f9aabf03eb9bbdd30757eb86c3f6.jpg", "website": "https://www.gamingcorps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gaming Corps"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Gaming Corps"], "esrb_rating": null}