{"id": 427821, "slug": "lost-circus-vr-the-prologue", "name": "Lost Circus VR - The Prologue", "name_original": "Lost Circus VR - The Prologue", "description": "Meet a mysterious Clown and his abandoned circus. Will You dare to start a thrilling night excursion? If You dare to get into a barrel on the old, rusty cart, pushed by a strange Clown - get ready for an extreme experience. You are going to visit a place abandoned for a long time, encounter a tiger and hordes of overgrown, furious spiders. Show Your sharpshooting skills and carefully avoid wild animals inhabiting the area.<br/><br/><br/> <br/>„Lost Circus VR - The Prologue” is an introduction for the newly created game made in VR technology. The incredible care for details of the environement will let You truly immerse in dark climate of an abandoned circus. The dedicated music and amazing 5.1 sound will build up the mood and give You a „goose bumps”. The highest quality of 4K textures also greatly improves the impressions of reality, even in state of the art high resolution googles.<br/><br/> <br/><br/>„Lost Circus VR” comes from the Virtual Magic entertainment workshop, an experienced company known for producing many 3D and 5d virtual shows and movies created for amusement parks. Our roots are in the movies industry, that is the reason we want to maintain our own more cinematic approach towards VR games.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T08:55:39", "background_image": "https://media.rawg.io/media/screenshots/400/4008be5f26fee4c63582fd264d80beb4.jpg", "website": "http://virtualmagic.com.pl/en/lost-circus-vr-2/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VIRTUAL MAGIC"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["VIRTUAL MAGIC"], "esrb_rating": null}