{"id": 427815, "slug": "rugby-league-team-manager-3", "name": "Rugby League Team Manager 3", "name_original": "Rugby League Team Manager 3", "description": "The third instalment of “The Number 1 Rugby League Management Game”.<br/>The biggest leagues and competitions. Rugby League Team Manager 3 gives you full control of managing your own Rugby League club.  Training schedules, coaches, physios, scouting, finances, sponsors, facilities and more.  MUCH MORE!<br/>Navigate your way through domestic campaigns and international competitions, within numerous leagues, in both the Northern and Southern hemispheres, with over 7000 senior players to choose from!<h3>What's New?</h3>We've gone crazy on this one and here is a list of what is ALL NEW.<br/><br/><ul><li>New match engine with all new graphics and animation.  Take control with more interactions than ever before.</li></ul><ul><li>Entirely new and redesigned User Interface.  Very clean and modern with tool-tips, help and tutorials.</li></ul><ul><li>New manager types, styles and attributes</li></ul><ul><li>New executive board evaluations</li></ul><ul><li>Canadian league</li></ul><ul><li>New player sales negotiations</li></ul><ul><li>New tactical options</li></ul><ul><li>New financial budgets</li></ul><ul><li>New seasonal players, attributes, kits and badges</li></ul><ul><li>New seasonal leagues</li></ul><h3>Match engine</h3>Created from the ground up, using real life animations and player movements, incorporating a host of tactical options in both attack and defence.<h3>New User Interface</h3>Lively animated user interface, which makes navigating the game easy, as well as being easy on the eye.<br/><h3>New manager attributes</h3>Managers now have a host of attributes like the players themselves, which combine to give an overall rating.<h3>New executive board evaluations</h3>Executive board will now judge your managerial performance in many different ways.  Only maintaining these levels will lead to your job security.<h3>New Canadian league</h3>A new Canadian league now included which competes with the American league in a promotional playoff at the end of the season.<br/><h3>New Player sales negotiations</h3>The sale of your own players can now be negotiated, so you can either play it safe and except the early offers, or hold out for a better deal.<h3>New manager types</h3>The starting manager now has a variety of managerial types he can start as, each carrying bonuses in specific areas.<br/><h3>New tactical options</h3>As well as the Ad-Lib attack style, there is now Structured-Flexible and Structured-Rigid to choose from.<br/><h3>New financial budgets</h3>Clubs will now have budgets for payroll, transfers and ground improvements.  Over spending budgets will not be taken lightly by the executive board.<h3>New Database</h3>New imagery, attributes, kits and badges. new leagues and participating clubs.<br/><h3>226 Clubs</h3>Including clubs from both the northern and southern hemispheres.<h3>Staffing and Facilities</h3>Control all staffing, including Assistants, Coaches, Doctors &amp; Physios<br/>Upgrade facilities, including Stadium, Gym, Training Paddock, Track,<br/>Kicking Enclosure, Tactical Briefing Room, Academy Clubhouse, Alliance<br/>Clubhouse &amp; Centre of Excellence<h3>Players</h3><br/>Discover hidden talents among youth teams and work with Agents and<br/>Scouts to deliver the best players to your club.<br/><ul><li>Featuring 7064 senior players and 1980 alliance players</li></ul><ul><li>Full 2D and 3D match engines with real-time interaction with your team</li></ul><h3>Game Database Editor</h3><br/>Get closer to the simulation with the powerful customised game editor<br/><h3>Tournaments and Competitions</h3>Work your way up the ladder, and lead your club out in the biggest tournaments in the world. <br/>Up to 7 tiers of domestic promotion and relegation.<br/>Experience the thrill of an international Club Series and also Cup competitions!", "metacritic": null, "released": "2020-01-07", "tba": false, "updated": "2020-04-13T08:49:27", "background_image": "https://media.rawg.io/media/screenshots/bc1/bc179c8c652388eef19b3178136f2cde.jpg", "website": "http://www.alternativesoft.co.uk/RLTM3/rltm3.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Alternative Software"], "genres": ["Simulation", "Sports"], "publishers": ["Alternative Software"], "esrb_rating": null}