{"id": 427831, "slug": "company-of-crime", "name": "Company of Crime", "name_original": "Company of Crime", "description": "Company of Crime is a criminal empire-builder featuring tactical turn-based missions. It<br/>takes place in 1960s London, the cultural capital of the world and home to a plethora of<br/>subcultures and businesses. Your task is to build a company that will own<br/>the criminal underworld, or if you play as the chief inspector of Scotland Yard’s famous Flying Squad, tear it down piece by piece. In the process you will go to pubs, clubs, vets, tailors, harbors and many other locations as you expand your influence over the city. Your team consists of either gang members possessing the different skills required to pull off criminal tasks, or detectives that have mastered the art of investigation. The big question is ultimately this: who will take London?<h3>Features:</h3><br/><strong>Tactical turn-based melee combat</strong><br/>With a focus on melee combat and tight spaces, Company of Crime sets itself apart from other tactical turn-based strategy games. Units have a zone of control that makes them tied to the choices you make. Block enemy movements, build superiority in numbers, and gain flanking bonuses by attacking from behind. You can even kick enemies where the sun doesn’t shine to create safe passageways to units that would otherwise get free attacks. If someone grabs a gun, either find cover or go after them to wrestle it away before the bodies start piling up.<br/><br/><strong>Heat mechanics</strong><br/>When doing your dirty business, you’d be wise to silently extort your way through the underworld. Loud gunfire or shooting enemies will only attract more opposition, and a criminal empire that blows its cover won’t go far. Fighting the outcome of too much heat is always more difficult than avoiding it, and if things get too tough, you better have some leverage to get the cops off your back.<br/><br/><strong>Level progression</strong><br/>This is more than just cops and robbers. Whatever the mission is, there is level progression beyond just hit points and stamina. Beating up the owner of a pub is one thing, but you can’t just bail before the police arrive. You’ll have to first assemble any evidence that will prove it was you at the crime scene crime scene before jetting.<br/><br/><strong>Building legit business with criminal means</strong><br/>Building a criminal empire requires a legitimate cover. Progression of the game takes place as you… ahem… “convince” people to sell their businesses and homes to you at a bargain price, or at least turn a blind eye to what you do in their back room. Owning more locations will unlock more items, features, and elements, but will also potentially expose you to a surprise attack from the police or a rival criminal family.<br/><br/><strong>Not just your own story</strong><br/>While your task is to create an empire of crime or to tear it down, this is not just your story. This is a story of 1960s London with beatniks, mods, lemonheads, rockers and every other cultural identity of the time. It’s also a story of a falling empire. The Cold War UK is shining in the cultural world, but is facing ever-increasing pressure from inside and out. There is a mysterious order trying to tear down the British Empire from the shadows, and who better to fight it than experts of the underworld and the famous Flying Squad.<br/><br/><strong>Reactive Police</strong><br/>Shady business takes place in obscurity, so police gameplay is more reactive. You get the call only when violence takes place, but that’s not the best way to find evidence against the criminal families. Assign sergeants to discover shady places, speak with informants, and apply for search warrants to raid questionable locales. Make sure they don’t burn the evidence before you manage to arrest them, or they’ll walk free as quickly as they were taken in.", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2023-12-18T17:33:39", "background_image": "https://media.rawg.io/media/screenshots/019/0195dc9ed0d6ab42ae68ca316875d0aa.jpg", "website": "", "rating": 2.43, "rating_top": 1, "added_by_status": {"yet": 6, "owned": 119, "beaten": 1, "toplay": 10, "dropped": 1}, "playtime": 9, "achievements_count": 20, "ratings_count": 7, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "macOS"], "developers": ["Resistance Games"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["1C Entertainment"], "esrb_rating": null}