{"id": 427807, "slug": "matcha-warriors", "name": "Matcha Warriors", "name_original": "Matcha Warriors", "description": "The world is in danger! The amulet that maintains the harmony of life has been stolen and the only hope are the Matcha Warriors.​<br/>Matcha Warriors is an action platform game with roguelike elements, where the player crosses the most varied environments fighting against monsters, barbarians and supernatural entities.<br/>To beat them you need to build your equipment, learn magical skills and choose the best items to face different situations.<br/>With fast fighting and unique mechanics, the player will have to use strategy and skill so that at least one warrior reaches the end and recovers the amulet.<br/><br/><h3>Features:</h3><ul><li>Learn powerfull skills such as Fireballs, Magic Barriers, Rays of light and use them against the enemies<br/></li><li>Collect materials to craft armors, weapons and shields<br/></li><li>Enhance your equipment with elemental orbs<br/></li><li>Stage selection changes at each run enhancing the replayability<br/></li><li>All levels have random elements such as enemies groups, traps, items and scenery variations<br/></li><li>For each run there is a limited number of warriors. If you die, the next warrior can use the items left behind<br/></li><li>Even if you can't make it through, your legacy will serve to ease the path of other Matcha Warriors</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T08:43:12", "background_image": "https://media.rawg.io/media/screenshots/90b/90bf07731e326c4d203910b5f9767662.jpg", "website": "https://www.sideralcreations.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sideral Creations"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Sideral Creations"], "esrb_rating": null}