{"id": 427857, "slug": "infinity-heroes", "name": "Infinity Heroes", "name_original": "Infinity Heroes", "description": "Infinity Heroes is a strategically deep cross-platform card game, designed for mobile &amp; PC. <br/><br/>The game's foundation is laid in making Infinity Heroes easy to get into, for people who don't traditionally play card games, by destroying the traditional barriers of entry.<br/><br/>Pre-constructed decks mean not only is the game less expensive to play, but you also won't have to worry about deck building, or building up collections and finding rare cards. Not only that but giving you access to everything you need to be competitive on day 1. When you enter a game, you could play against someone who has played for a year, and the better PLAYER will be the one that wins. <br/><br/>Simultaneous turns also give the players a lot less downtime, making sure that there's always fast-paced strategic action to focus on.<br/><br/>With multiple heroes being chosen, ultimate units/spells, hero powers, and card cycling, you will never be locked out of the game, and you will always have a number of options in how you want to deal with your current threats, and potentially punish your opponent.<br/><br/>With characters returning from Infinity Wars, the world and story will continue to grow and evolve within Infinity Heroes.<h3>Living Roadmap</h3><br/>Our aims and goals are generally shifting and changing, with the Living Roadmap below, you can get a better understanding of what's important to us, and what we're aiming to get done and when.<br/><br/>", "metacritic": null, "released": "2020-03-18", "tba": false, "updated": "2020-04-13T09:18:47", "background_image": "https://media.rawg.io/media/screenshots/2a3/2a342a16a97c54108039077d5a0db353.jpg", "website": "http://infinityheroesgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 120}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lightmare Studios"], "genres": ["Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Lightmare Studios"], "esrb_rating": null}