{"id": 427869, "slug": "miners-mettle", "name": "Miner's Mettle", "name_original": "Miner's Mettle", "description": "Miner’s Mettle is a blend of artillery shooting and real time strategy! Four factions fight for supremacy on an uninhabitable mining planet. You must ensure that your faction not only survives but also secures a sizable cache of the miracle mineral, Pentum. <br/><br/>You will explore and survey harsh terrain for mineral deposits. Return to safety with the minerals, and you’ll be able to research and build exciting new technologies that will expand your tactical options against your competitors. This tech can be installed on your armed trains, allowing you to customize each one and fulfill different roles in your strategic plans.<br/><br/><br/><br/>Features:<br/>•\tA blend of artillery shooting and real time strategy.<br/>•\tControl a fleet of artillery-trains. Ensuring a steady flow of resources requires logistical precision, even before contact with the enemy. You must try to disrupt the competition even as they do the same to you.<br/>•\tCustomize your trains to fulfill different roles on the mining fields. Some trains may haul minerals back to base, while others may unleash terrible new technologies upon their targets.<br/>•\tChoose your path to victory; crush your competitors or out-mine them.<br/>•\tA variety of extra-large maps spanning several dozen square kilometers, befitting an artillery battlefield.<br/>•\t4 distinct factions<br/>•\tSingle player and Co-operative Horde Mode: Survive by yourself or with your online friends against a rising tide of enemies. Out-shoot the incoming horde, or mine enough Pentum before you get overrun!<br/>•\tOnline Multiplayer: Play on a variety of maps", "metacritic": null, "released": "2020-04-22", "tba": false, "updated": "2020-04-13T09:25:49", "background_image": "https://media.rawg.io/media/screenshots/a56/a56356c254ccea0005309b9c9afa1753.jpg", "website": "http://www.minersmettle.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Singular Scheme"], "genres": ["Strategy"], "publishers": ["Singular Scheme"], "esrb_rating": null}