{"id": 427880, "slug": "lustlock-labyrinth", "name": "Lustlock Labyrinth", "name_original": "Lustlock Labyrinth", "description": "On the trail of her missing friend, Marisa the adventurer enters the great Lustlock Labyrinth.<br/>A magical dungeon of untold power...<br/><br/>Those who challenge the dungeon risk everything, their sanity, their bodies, even their names are at risk.<br/>For the one who conquers the dungeon? Their hearts desire made reality... those that lose become permanent residents...<br/><br/>Of course, Marisa is above such temptations... She only has her friend's safety in her mind.<br/>Can she reach the deepest floor and defeat the dungeon keeper? Or will she lose everything?<br/><br/><br/><ul><li>  A dark fantasy first person dungeon rpg!<br/><br/></li><li> Map out each floor as you explore!<br/><br/></li><li> A wide variety of cute girls to fight, Death is forbidden! <br/><br/></li><li> Main Character is animated in battle! A cute and strong warrior!<br/><br/></li><li> Collect Items, Learn new skills, and best your enemies! <br/><br/></li><li> Grapple attacks - Some enemies will grapple you and you will have to struggle free. <br/></li></ul><br/>Often, you'll have to choose between brute forcing and enemy, or learning the enemies attack pattern to maxmise damage.<br/>If you think they're going to do a lewd attack you can punish them with crit damage! but if they're not you waste a turn.<br/><br/>With this in mind, the game is balanced so no grinding is necessary. With smart play and good usage of items found in the dungeon, Marisa can overcome any challenge.<br/><br/><br/>Controls<br/>The game controls with mouse and keyboard.<br/>Use either wasd or arrow keys to navigate the dungeon, and the mouse to navigate menus and selecting battle commands.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T09:32:36", "background_image": "https://media.rawg.io/media/screenshots/1ac/1ac9a759387b45305d368a39a0a8708d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azurezero"], "genres": ["RPG", "Indie"], "publishers": ["Azurezero"], "esrb_rating": null}