{"id": 427882, "slug": "ageless", "name": "Ageless", "name_original": "Ageless", "description": "<p>Lost, confused and alone. What will Kiara do when she suddenly finds herself with the power to control the age of flora and fauna? An ability that was bestowed onto her by a magical obelisk.<br />\nTraverse a puzzle-platforming world unlike any other, full of myths and magic. Embark on an emotional journey where you will be faced with tough choices and must confront your inner demons.<br />\nFollow Kiara as she is thrown into a world of wonder and heart ache. Manipulate the age of animals and plant-life as you find your way through intricate environmental puzzles and defeat the merciless bosses that stand in your way.<br />\nBecome Ageless: Equipped with a mystical bow, master the art of becoming Ageless. Dash off animals and plant-life to navigate through interesting puzzles and intricate platforming challenges.<br />\nUnique Aging Mechanic: Play with the laws of nature to control the age of animals and plants in order to progress through exciting levels.<br />\nNot your Average Fairy-tale: In a tragic story of loss and personal discovery, Kiara must decide if she will use her newfound powers to face her inner demons or run from them.<br />\nNew Worlds to Discover: Explore new areas filled with unique plants and animals as you progress through the game. Each level is hand drawn to pixel perfection to create a beautiful world.</p>", "metacritic": null, "released": "2020-07-28", "tba": false, "updated": "2023-12-18T17:33:42", "background_image": "https://media.rawg.io/media/screenshots/294/294835d466dfb67bea7c79e74c4da128.jpg", "website": "", "rating": 2.44, "rating_top": 3, "added_by_status": {"yet": 37, "owned": 718, "toplay": 5, "dropped": 8, "playing": 1}, "playtime": 3, "achievements_count": 12, "ratings_count": 9, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 9, "platforms": ["Nintendo Switch", "PC"], "developers": ["One More Dream Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Team17 Digital"], "esrb_rating": null}