{"id": 427866, "slug": "mech-era", "name": "MECH ERA", "name_original": "MECH ERA", "description": "Mech Era is a 3D sandbox game that provides players endless freedom and endless fun through creating their own world utilizing the power of AR and physics logic. Become the ultimate mech designer and produce interstellar warships, doomsday chariots, giant robots, aircrafts, terminator bots and more—let your imagination run free, the sky’s the limit! You not only get to watch your creations come to life but also get to drive them and even use them to destroy other players’ designs. Rely on your strategic skills to crush opponents, conquer worlds, or even build your own fortress—full of traps and jump scares and guarded by defense mechs armed to the teeth— and watch those poor unwitting intruders flee in terror! You can also share the blueprints of your designs with other players and even trade with them.<br/>\n<br/>\r\n1. Real-time physics-based destruction<br/>\r\nDrive self-designed mechs to launch attack on your opponents’ forts or use your trademark weapons to blast their constructions to smithereens!<br/>\r\nThe visual impact and destructive effects generated based on environmental physics will make every siege as realistic and immersive as it can ever get!<br/>\r\n2. Put together your own dream machines<br/>\r\nHundreds of modules and components to work with. If you can think it, you can make it!<br/>\r\n3. A new spin on the Tower Defense genre<br/>\r\nUnleash your wildest imagination, build obstructions and lay down traps to construct your one-of-a-kind fortress.<br/>\r\n4. A playground for skilled strategists<br/>\r\nCan you find the weak point of your opponent’s meticulously-designed fortress? Our strategy-based gameplay sets apart the gifted tacticians from the helpless weaklings!", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2020-04-13T09:24:21", "background_image": "https://media.rawg.io/media/screenshots/8af/8af32000bcb9f3c914fa2ca4be0b8956.jpg", "website": "http://jx.iccgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["上海沙界软件有限公司"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["游艺春秋网络科技(香港)有限公司"], "esrb_rating": null}