{"id": 427871, "slug": "blackthorn-arena", "name": "Blackthorn Arena", "name_original": "Blackthorn Arena", "description": "<p>The story happens in a brutal land called the Freelands, consists of several city states and trade towns while slavery is still a universal thing here. You – as an heir of the Blackthorn Arena, swear to take back the glory and honor once belong to your family.<br />\nNotice: As the game is in the EA stage, the optimization of the memory is not yet completed. Players with 8G or less memory are strongly recommended playing in low or medium effects to prevent the game from flashing back. We apologize for this and promise to do our best to optimize the game before the official release. Thank you.<br />\nCore Game Play:<br />\n1) Build your gladiators:<br />\nBuy slaves and train them into gladiators. You will need to manage their attributions, skills and talents, equip them with the best armors and weapons you can afford. Some of them may have talent to become a support staff such as cooks, healer, drillmaster, black smith etc.<br />\n2) Claim your Glories:<br />\nSend your Gladiators to fight in 10 diverse arenas in &quot;The FreeLand”, defeat other gladiators and over 30 kinds of monsters. Challenge the champions of other arenas, kick them out of their throne. Create your own champions and become the most powerful master in the world.<br />\n3) Manage your arena:<br />\nDon’t forget you have an arena to manage! As your gladiators win battles in other arenas, you will gain money as reward, as well as reputation. Money can buy new slaves, better equips and upgrade your arena when needed. Use your money wisely because everything about running an arena is depending on it. Reputation is important too, cost reputation to hold a game will grant you considerable incomes.<br />\nKey Feature:<br />\n1) All Gladiators are lived:<br />\nAll gladiators are existed dynamically in the game world - not only yours, but also gladiators in other Arenas or belongs to other masters. NPC gladiators will enroll in different competitions which hold all over the world every day. They could die, get injured or grow stronger as your gladiators do. Whenever you defeat other Gladiators, you can either spare their lives or execute them. If you spare gladiators, you may face them again in the future battle.<br />\n2) RPG level Character build:<br />\nBlackthorn Arena offers players a CRPG level character build systems. Choose between 6 major attributes and 6 weapon types, combine over 100 combat skills to build a unique fighter. There are no classes, you create your own class! Your Gladiators will also gain various traits during their gladiator career. Some traits may have strong impacts in competitions.<br />\n3) Various equipment:<br />\nEquip your gladiators with over 200 pieces of armors and weapons, not just for combat effectiveness but also for fashion! Each set of armor has an unique appearance and will reflect in our advanced avatar system.<br />\n4) Abundant events:<br />\nAs an Arena master, you must deal with plenty of events every day. Some of them are opportunity while others are total troubles. Dealing with all kinds of emergencies is also an important and inevitable experience for an Arena master.<br />\n5) Real time combat with tactical pause:<br />\nThe game’s combat is based on real time, but you can pause at any time to issue an command, switch between characters or apply other technique movements.<br />\n6) Editable Combat AI<br />\nDuring fighting, you can command only one gladiator at a time. The rest of them will fight automatically. But you can always edit your gladiators&#39; combat AI so they can response to different situation properly.<br />\n7) Brutal and challenging Gladiator Career:<br />\nThe career of a gladiator is cruel and gory. Your Gladiators could completely lose control due to will collapses in the battles. Also beware, Gladiators may die permanently when get defeated! So, please cherish your Gladiators&#39; lives, but don&#39;t get over passible for them.</p>", "metacritic": null, "released": "2020-01-17", "tba": false, "updated": "2022-01-01T16:29:32", "background_image": "https://media.rawg.io/media/screenshots/7ea/7eada2e3d4f7aaec298665e4ce014732.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 26, "toplay": 2, "dropped": 4, "playing": 1}, "playtime": 9, "achievements_count": 29, "ratings_count": 4, "suggestions_count": 595, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["PersonaeGame Studio"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["CreativeForge Games"], "esrb_rating": null}