{"id": 427902, "slug": "nordic-warriors", "name": "Nordic Warriors", "name_original": "Nordic Warriors", "description": "Inspired by the classic game \"Myth\", Nordic Warriors is a Real Time Tactical game set in a world descending into an existential struggle for survival. You'll need smart strategy combined with tactical skills to survive the onslaught of undead hordes and their sorcerer allies. Come face to face with heroes, legends, demons and gods as you fight through the middle world and even enter the gates of Hel itself.<br/><br/>Do You Have What It Takes to Survive Ragnarok?<br/><br/><br/><br/><br/><br/><br/>It was the beginning of winter. The darkening sky brought cold winds and falling leaves. Freja and her warriors had just returned to Kjos from a three days search of the forest with no success. It had been days since the foraging party failed to return on time. Where could their missing friends be? As they approached home, Freja felt something was wrong. In fact, she had never felt like this before, as if someone was squeezing her insides making it hard to breath. Perhaps they were just tired from the road, she thought… But it was quiet, too quiet. She looked into her friends’ eyes and confirmed - something was definitely wrong.<br/><br/>As they approached the village a horrible scene was revealed to them - Their entire village was killed by the undead. Men, women and children were massacred in a surprise attack with no chance of survival. Shocked by this horrible truth, the group decides to search and destroy this evil once and for all.<br/><br/>Embark on a journey and experience overwhelming encounters facing various undead enemies as you struggle for survival. Use smart strategy combined with tactical skills to complete different mission objectives and advance your way in the game. Follow the storyline and reveal a shocking secret that’s been hidden for many years. <br/><br/>Mystical beings, undead warriors, hellish monsters and underworld creatures - You’ll face them all! But… Are you ready for them?<br/><br/><br/><br/><br/><br/><br/><ul><li>A REAL Real Time Tactical gameplay in a pre-medieval era battleground environment. <br/></li><li>Classic Mythalike RTS action. <br/></li><li>Master a variety of friendly units from warriors wielding swords and axes, to Shield Maidens and archers, explosive expert Alchemists and even stranger allies. <br/></li><li>Use mighty magics to blast or distract your foes, convert some enemies to friends and attempt to survive the onslaught.  Or die trying.<br/></li><li>Battle across a variety of landscapes and take the fight beyond the gates of Hel itself.<br/></li><li>Quest for lost artifacts, explore terrain crawling with the armies of evil and work your way towards survival.<br/></li><li>Use every feature of the landscape to gain advantage against a sea of implacable foes.<br/></li><li>14 levels of mythic mayhem and desperate action.<br/></li><li>3 levels of difficulty: <br/>    o Thrall you will weary blunting your weapons on the endless hordes of shambling horrors.<br/>    o Heroic brings more challenge &amp; despair to those who are not swift, decisive…  and lucky. <br/>    o Ragnarok will test the mettle of even the fiercest commanders: prepare for destruction!<br/></li><li>Slaughter anyone or anything that comes by. Yes, even a deer or your friendly neighbor.<br/></li><li>You can blow up some stuff. Have fun figuring them out.</li></ul><br/>Also, there’s ponies! and unicorns! and giant mushrooms! and oh golly just buy two already!<br/>(well… not really… or maybe?)<br/><br/><br/><br/>* This game is not optimized for 4:3 resolution and some features might not display correctly.", "metacritic": null, "released": "2020-02-02", "tba": false, "updated": "2020-04-13T13:33:58", "background_image": "https://media.rawg.io/media/screenshots/8c0/8c0b89e86a1e60beec637302bf79bcb5.jpg", "website": "https://mashmashustudio.wixsite.com/nordicwarriors", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 13, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 523, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Nordic Warriors", "Roman Levin", "Liron Peer"], "genres": ["Strategy", "Indie"], "publishers": ["Liron Peer & Roma Levin"], "esrb_rating": null}