{"id": 427993, "slug": "potion-commotion-2", "name": "Potion Commotion", "name_original": "Potion Commotion", "description": "<h3>GET READY FOR POTION COMMOTION! THE FUN IDLE CLICKER GAME!</h3>The elderly and eccentric Wogglebogg the Wizard has found himself in a financial pickle, and he needs YOUR help to keep his Potion Brewing Business afloat!<br/> He requires the assistance of a talented individual (that’s you), to build him a dynamic garden, full of trees, plants and creatures, each giving unusual ingredients that can be combined to make Potions.<br/><br/>Want a Fire Potion? You’ll have to get some Dragon Eggs and Volcano Ice Cream!<br/>Require a Strength Potion? You better stock up on Chocolate Camel Milk and Spinach Leaves.<br/><br/>The more Potions you help Wogglebogg make, the more coins and elixir you’ll receive, allowing you to further expand and create!<br/><br/>But watch out! Sneaky pests will try to steal your hard-earned resources. Scare them away with your cursor, or invest in some fierce Guard’em Gnomes to do it for you.<h3> Key Features </h3><ul><li><strong>Idle Gameplay</strong><br/>While there’s plenty to do in both the garden and Wogglebogg’s abode, if you ever want to sit back and relax, you’re in luck!<br/>Even when you’re taking a break, ingredients will grow, Potions will be made and your garden will progress, ready for you to return and reap the rewards!!!<br/><br/></li><li><strong>Fun, quirky Characters</strong><br/>As well as Wogglebogg, you’ll simply love the many unforgettable friends you meet in Potion Commotion! Such as Sir Loinsteak- the charismatic Knight, Hamrietta- the lazy and sarcastic Pig, Chester the Jester- king of the bad one-liners, and more...<br/><br/></li><li><strong>100 Achievements</strong><br/>For all you determined achievement hunters out there, this game features a plethora of fun and challenging objectives for you to sink your teeth into!<br/><br/></li><li><strong>Complete Voice-Over and Original Soundtrack</strong><br/>Potion Commotion offers a fantastic audio experience, with an English Voice Cast for all characters in the game, as well a quality OST, by HMN Music.<br/><br/></li><li><strong>Play the way you want</strong><br/>Choose your own path to Wizardry with thousands of ways to succeed. Each decision can impact greatly on your progress and makes every garden unique to each player.</li></ul><h3> Other Features </h3><ul><li> Offline Progression<br/></li><li> Co-Op Mode, get a Potion Pal to join the fun<br/></li><li> NO Micro-transactions<br/></li><li> Full Controller Support<br/></li><li> Garden Design mode, get the look you want<br/></li><li> Dank Memes<br/></li><li> Prestige System<br/></li><li> Daily Bonuses<br/></li><li> Hundreds of terrible puns to make you smile<br/></li><li> A passionate, and committed indie developer.</li></ul><br/><strong>Do NOT miss out on the fun!! Add Potion Commotion to your Wishlist NOW!!!</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-13T22:11:37", "background_image": "https://media.rawg.io/media/screenshots/f97/f9720b10066dd2c52a89701b5dde2582.jpg", "website": "https://www.facebook.com/NerdyBirdStudios/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 100, "ratings_count": 1, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["NerdyBird Studios"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["NerdyBird Studios"], "esrb_rating": null}