{"id": 427930, "slug": "phasmophobia", "name": "Phasmophobia", "name_original": "Phasmophobia", "description": "<p>Phasmophobia is a 4 player online co-op psychological horror where you and your team members of paranormal investigators will enter haunted locations filled with paranormal activity and gather as much evidence of the paranormal as you can. You will use your ghost hunting equipment to search for and record evidence of whatever ghost is haunting the location to sell onto a ghost removal team.<br />\nYou can choose to support your team by monitoring the location with CCTV cameras and motion sensors from the safety of the truck or head inside and get your hands dirty with the ghostly activity that will get increasingly hostile as time goes on.<br />\nImmersive Experience: Realistic graphics and sounds as well as having minimal user interfaces will ensure a totally immersive experience that will keep you on your toes.<br />\nCross platform: Phasmophobia supports all players whether they have VR or not so can enjoy the game with your VR and non VR friends.<br />\nCo-op multiplayer: Play alongside your friends with up to 4 players in this co-op horror where teamwork is key to your success.<br />\nUnique Ghosts: Over 10 different types of Ghosts all with unique traits meaning each investigation will be different.<br />\nInvestigate: Use well known ghost hunting equipment such as EMF Readers, Spirit Boxes, Thermometers and Night Vision Cameras to find clues and gather as much paranormal evidence as you can.<br />\nFull Voice Recognition:  The Ghosts are listening! Use your actual voice to interact with the Ghosts through Ouija Boards and EVP Sessions using a Spirit Box.</p>", "metacritic": null, "released": "2020-09-18", "tba": false, "updated": "2024-04-21T00:46:51", "background_image": "https://media.rawg.io/media/screenshots/370/370895ff725d74e26b8d30389222b397.jpg", "website": "http://kineticgames.co.uk/", "rating": 3.88, "rating_top": 4, "added_by_status": {"yet": 61, "owned": 2461, "beaten": 156, "toplay": 63, "dropped": 298, "playing": 115}, "playtime": 6, "achievements_count": 48, "ratings_count": 381, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 387, "platforms": ["PC"], "developers": ["Kinetic Games"], "genres": ["Action", "Indie"], "publishers": ["Kinetic Games"], "esrb_rating": null}