{"id": 427935, "slug": "cloud-meadow", "name": "Cloud Meadow", "name_original": "Cloud Meadow", "description": "Welcome to the world of Cloud Meadow, where islands float in the sky through ancient magics and humankind works alongside monsters to create prosperous civilizations!<br />\nPlay as one of our protagonists, Evan or Eve, as you venture out into the frontier to farm, breed, and battle in order to support a budding and diverse community of monsterfolk!<br />\nIt is your job to explore and tame uncharted territory, filled with a whole trove of interesting creatures and treasures that lead you to unraveling the mysteries of the world around you!<br />\nEqual parts farming simulator, RPG, &amp; visual novel, Cloud Meadow is all about three F&#39;s- Farming, Fighting, and Flirting. In keeping with this, you are able to:<br />\nCultivate A Cozy Farm- plant seeds, grow crops, take charge of your personal homestead!<br />\nDate The Denizens- romance a wide array of partners! Over 50 animated sex scenes!<br />\nBattle Baddies- engage in satisfying hybrid active-turn-based RPG battles!<br />\nSexual Shenanigans- breed monsters together to create new pals to battle and bond with!<br />\nExplore Exotic Locales- discover many unique &amp; breathtaking environments!<br />\n... and much more! Upgrade your farm, learn new cooking recipes, customize your party!</p>", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2024-01-02T00:18:02", "background_image": "https://media.rawg.io/media/screenshots/6e8/6e826ac9096a155eeec1cfd2a6941ed5.jpg", "website": "http://www.cloudmeadowgame.com", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 66, "beaten": 2, "toplay": 8, "dropped": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Team Nimbus"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["TinyHat Studios"], "esrb_rating": "Adults Only"}