{"id": 428050, "slug": "denial-2", "name": "DENIAL", "name_original": "DENIAL", "description": "Look inside, your dark mind is fighting against your soul, your conscience can't pick a side and fear is standing against logic.\r\nWhat if after too much pressure you pass out, you see nothing but black, slowly you find what is dark and what is darker yet sleeping well?\r\nWhat if everything you believed in was proven to be a lie? Everything you have been ignoring is coming back to get you, shouting at you that they are real.\r\nAnd what if you don't wake up? You keep living the same nightmare over and over only because you are deeply lost inside your own mind, only because you are too weak to handle your fears.\r\n\r\nThey took it from us, our identity, our face! I am here to make sure to bring it all back...\r\nI remember how that liquid was a stain from the walls to the floor while you walked in those halls, feeling the safety of my world under it's shell. You were free, not exposed to the savagery of the outside. You knew the truth but you looked for more, this creation wasn't enough, we made that shell and you began melting it bit by bit, slowly peeling one layer after the other, leaving only a black hole of nothing.\r\nIt's gone too far. After all, you are part of them.\r\n\r\nIn this game you play an unstable man, you will wander between walls that trap his mind and you will go deep into places you have never seen before. \r\nThe environment will be inconsistent, at first you might explore the brighter areas of his mind, but as you go deeper it gets darker, illusions and voices are everywhere.\r\nDenial is the hard work of two brothers who worked tirelessly to bring their dream to life and they couldn't be more proud of it.\r\nWe invite you to take a visit into the madness, to face the truth.\r\n\r\n\"I AM A COSTUME, SHELL, SHADOW. BUT THAT'S OKAY, I AM THE ONE THEY CAN SEE AND YOU WERE LEFT TO FEEL IT\"\r\n\r\nGame features:\r\n• Psychological horror - your sanity is fluctuating, your brain betrays you and you are losing it without your pills.\r\n• See the big picture - there are pieces scattered everywhere, can you find them and finish the puzzle?\r\n• Multiple endings - which one will you choose? Every choice comes with its own consequences.", "metacritic": null, "released": "2020-05-05", "tba": false, "updated": "2020-04-13T11:27:02", "background_image": "https://media.rawg.io/media/screenshots/c09/c09c4b233b461c0a815f0fbe43ef95ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ofek Ben Shalom", "Eldar Ben Shalom"], "genres": ["Indie"], "publishers": ["Ofek Ben Shalom", "Eldar Ben Shalom"], "esrb_rating": null}