{"id": 428036, "slug": "test-tube-titans", "name": "Test Tube Titans", "name_original": "Test Tube Titans", "description": "Grow procedurally generated monsters in a lab and then send them out into the world to create havoc using physics-based controls. That's the basic idea behind <strong>Test Tube Titans</strong>.<br/><br/>- Per Limb Control! A complex but rewarding control system that is fun and satisfying. (best enjoyed with a controller)<br/><br/>- Random Character Generation! With an infinite array of possible titans every experience will never be the same.<br/><br/>- Fully Destructible Environments! Dismantle buildings, fight off law enforcement, eat people. <br/><br/>- Unlock Rewards! Upgrade your lab as you progress to achieve more powerful titans through cross-breeding, special abilities, and larger containment cells.<br/><br/>- Local Multiplayer! Play co-op (2 players) with a friend through the main campaign, or go head-to-head wrestling (up to 4 players)! *<br/><br/>- A Challenging Campaign! 35 missions to prove your mastery of the titans.<br/><br/>- Creative Mode! Jump straight into making the weirdest and strongest titans without any restrictions.<br/><br/>- Lo-fi Soundtrack! Over 30 original music tracks to set the mood.<br/><br/>- Custom level editor (still in BETA) lets you create your own cities using the same tool as the developer.<br/><br/>*IMPORTANT: Multiplayer is only supported when each player has their own controller.<br/>Mouse controls are not currently supported.", "metacritic": null, "released": "2020-03-05", "tba": false, "updated": "2020-04-13T11:19:10", "background_image": "https://media.rawg.io/media/screenshots/528/528766130c68f1cb8dd1039fdeebadbd.jpg", "website": "http://ghosttimegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ghost Time Games"], "genres": ["Action", "Indie"], "publishers": ["Ghost Time Games"], "esrb_rating": null}