{"id": 428082, "slug": "warden-of-the-isles-2", "name": "Warden of the Isles", "name_original": "Warden of the Isles", "description": "Use wits, magic, and a powerful throwing arm to build and defend your town while commanding troops to fight enemies in this lighthearted VR blend of RTS and Mage Simulator. Defend against a looming and mysterious threat, uncover its dark origins, and become... The Warden of the Isles!<h3>Features </h3><ul><li>A FULLY IMMERSIVE VR BLEND OF RTS AND MAGE SIMULATOR!<br/></li><li>WIELD THE POWER OF A WARDEN... Use spells to sway the tides of battle, support your troops, and summon elemental creatures to your aid.<br/></li><li>UTILIZE A MIGHTY THROWING ARM... Grab enemies and throw them to their deaths! Utilize the sea to drown them, the earth to smash them, or save your own troops by grabbing and rescuing them from foes!<br/></li><li>BUILD YOUR BASE... Assign workers to various tasks as you gather resources and construct buildings, expand your capabilities while growing your army and defenses!<br/></li><li>LEAD YOUR TROOPS TO BATTLE... Order your troops into unique legions and take the fight to the enemy! <br/></li><li>EXPERIENCE AN ORIGINAL STORY... Uncover the secrets of the Isles of Muhan in a fully voiced and lighthearted narrative with over 15 hours of gameplay!</li></ul><h3>Story </h3><br/>There has always been a Warden of the Isles. For as far back as history dates, these powerful mages defended the Isles of Muhan against all threats while maintaining peace between the bickering tribes. Fusing themselves with the Shards of Challenging spread across the Isles of Muhan, Wardens are able to wield immense magical and physical powers in order to perform their duties.<br/><br/>Over the years, the inhabitants of the Isles of Muhan relied more and more heavily on the increasingly powerful Wardens, while at the same time, those mages gifted enough to wield such power became rarer...<br/><br/>Now, a dark rumor spreads... NEROK, the current Warden of the Isles, has not been seen in months, and there are whispers that he has vanished... This, along with a series of strange occurrences spreading across the Isles, has caused the elderly mage NAMURF, the former Warden of the Isles, to return from retirement and seek answers.<br/><br/>But he will not be able to do this alone... YOU have been chosen...", "metacritic": null, "released": "2020-02-14", "tba": false, "updated": "2020-04-13T11:50:11", "background_image": "https://media.rawg.io/media/screenshots/3c1/3c123b15d2a51e3c625e75f1fb53886d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["beardlings"], "genres": ["Strategy", "Indie"], "publishers": ["BEARDLINGS"], "esrb_rating": null}