{"id": 428066, "slug": "coromon", "name": "Coromon", "name_original": "Coromon", "description": "<p>Coromon is a modern monster taming game with retro pixelart. Coromon brings an immersive storyline, strategic turn-based combat and challenging puzzles to a classic genre.<br />\nUse powerful moves to take down your opponent&#39;s Squad. Use your skills to poison, stun or damage your opponent with an arsenal of available skills.<br />\nIn the region of Velua where Humans and Coromon live in harmony, a shady organization is on the verge of releasing a dark power upon the world. Will they succeed in their evil plans, or can they still be stopped?<br />\nStep into the role of a young hero joining the technologically advanced organisation of Lux Solis. Gather your favorite Coromon to create a powerful squad. Together with your Coromon, you&#39;ll have to train, fight and puzzle your way through an adventure-filled world!<br />\nA compelling story<br />\nCoromon is a story driven game with an interesting plot, revolving around a trainer who just started working for Lux Solis.<br />\nDifficulty levels<br />\nYou can select your own difficulty. Whether you want to take it easy, play the normal experience, or want to try out the hard or insane difficulty, everyone can choose how they want to play.<br />\nEpic boss battles<br />\nThere are six Titans known to exist in Velua, which hold immense powers. These battles will put you and your Coromon to the ultimate test of strength.<br />\nChallenging puzzles<br />\nEach of the Titans is hidden away in its own dungeon. Reaching them will not be easy! You will be put to the test with innovating and challenging puzzles.<br />\nStat customisation<br />\nEvery Coromon is unique, but also every trainer. After gaining enough XP, your Coromon will earn bonus stat points, which you can distribute over its stats as you see fit. Train that glass canon you&#39;ve always dreamed about, or the ultimate tank Coromon.<br />\nCharacter customisation<br />\nCreate your own unique character from hundreds of clothing assets, hairstyles and hats. During the game, you will be able to update your appearance by finding more items, or by visiting the local hairdresser or tanning salloon.<br />\n120+ animated Coromon<br />\nThe Velua region is filled with over 120 animated Coromon for you to catch and train, so that everyone can put together their favorite squad.<br />\nUnique regions to explore<br />\nVelua consists of many different climates, which all have their unique look and feel. Every new town or route you visit will give a completely new atmosphere.<br />\nBeautiful visuals<br />\nCoromon features stunning modernised pixelart visuals inspired by classics of the rpg genre.<br />\nOriginal soundtrack with 50+ tracks<br />\nAn inspiring soundtrack by Davi Vasc, inspired by music from the genre&#39;s greatest soundtracks. The soundtracks include unique tracks for each area, emphasizing the surroundings of the player.<br />\nMultiple saveslots<br />\nWe offer two saveslots and an autosave functionality, so that you can try multiple playthroughs without losing your valuable savedata.<br />\nWe&#39;re honored to be able to provide Coromon to you, a game we&#39;ve poured our heart in. Coromon is our tribute to the classics of the genre. While staying loyal to the core gameplay, we wanted to add new gameplay features but also keep the retro look, by using a modern pixelart style.<br />\nThank you for trying out Coromon, and we hope you will enjoy the game as much as we enjoyed creating it.</p>", "metacritic": 74, "released": "2022-03-30", "tba": false, "updated": "2024-01-15T12:33:23", "background_image": "https://media.rawg.io/media/games/026/026672d37f949c9e763bfeffc4873f7d.jpg", "website": "https://www.coromon.com", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 147, "beaten": 6, "toplay": 19, "dropped": 5, "playing": 5}, "playtime": 2, "achievements_count": 66, "ratings_count": 16, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 16, "platforms": ["macOS", "PC", "Nintendo Switch", "Android", "iOS"], "developers": ["TRAGsoft"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Freedom Games", "TRAGsoft"], "esrb_rating": null}