{"id": 428035, "slug": "stop-sign-vr", "name": "Stop Sign VR", "name_original": "Stop Sign VR", "description": "Stop Sign VR <strong>helps you avoid hitting</strong> your computer monitor, TV, walls, ceiling, lamps, furniture and other objects in and around your VR play area.<br/>While you are playing other games a prediction algorithm warns you of possible impacts using sound, images and haptic feedback. <br/><br/>Position (virtual) boxes around your valuable (real) equipment, such as TVs, ceiling fans, room lighting and so on.<br/>Enter your ceiling height to get proximity alerts for the ceiling. If you want, it can also alert you before hitting the floor.<br/><br/>The boxes will fade out when you're not close. The fade-out and full-visibility distances can be configured for each box separately.<br/>If you don't know where your boxes are, because they're faded out, press the System button and look around.<br/><br/>Highlights:<br/><br/><ul><li>runs alongside other SteamVR games<br/></li><li>works with all SteamVR (OpenVR) software, games, headsets, controllers and trackers<br/></li><li>perfect for when you play Hack and Slash games or other games with melee weapons<br/></li><li>many configurable settings such as: alert distance, alert sound volume (or use no sound at all), turn off the default chaperone warning system, alerts for hitting ceiling or floor, etc.<br/></li><li>use the separate Settings Editor program to edit all settings in Windows (not in VR); also use it to add, remove and edit boxes<br/></li><li>predicts impacts of all your tracked devices: HMD, controllers and trackers<br/></li><li>does not harm the performance of other VR software<br/></li><li>the Stop Sign VR runtime is 100% coded in C++ and optimized to spend very little CPU/GPU cycles</li></ul><br/>The separate Settings Editor program is in the Windows System Tray, next to the clock in the bottom right corner of your desktop.<br/><br/>The alert sounds are spatialized by Steam Audio's HRTF-based binaural rendering so you will hear where the closest wall or object is, even if you can't see it.", "metacritic": null, "released": "2019-12-17", "tba": false, "updated": "2020-04-13T11:18:07", "background_image": "https://media.rawg.io/media/screenshots/e07/e070a43e8cd881eb7696d08a4f3a3595.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Reality Inside"], "genres": ["Action", "Sports", "Indie"], "publishers": ["Reality Inside"], "esrb_rating": null}