{"id": 428064, "slug": "4th-generation-warfare", "name": "4th Generation Warfare", "name_original": "4th Generation Warfare", "description": "Actions common to all characters (moving, going to a restaurant, taking/placing/giving/stealing objects, seducing, threatening, marrying/divorcing, interacting, bribing…) are distinguished from actions specific to their profession.<br/><br/>Examples of specific actions by type of character:<br/>    • Head of State: appoint cabinet members, set budget guidelines, denounce the UN, approve nuclear weapons, campaign in elections, begin infrastructure projects…<br/>    • Secretary of Diplomacy and Diplomats: implement commercial contracts, sign strategic agreements, vote in the UN, open embassies…<br/>    • Head of Secret Services and Spys: infiltrate, sabotage, assassinate, spy, kidnap...<br/>    • Cyber-Analysts: hack into a server or smartphone, GPS tracking, plant viruses, reinforce data protection, trace the source of a cyberattack…<br/>    • Head of the Army: implement arms deals, construct bases, manage staff, declare martial law…<br/>    • Secretary of Interior and Police Investigators: use video surveillance, investigate crimes and offenses, make arrests, interrogate a suspect, conduct a stakeout, monitor a building, break up demonstrations...<br/><br/>Non-playable characters are also capable of many specific actions: editing articles for journalists, ordering union strikes, influential sermons by religious dignitaries, exhibitions for artists, assassination by a hitman, voting instructions for political leaders...<h3>A Reactive but Still Influenced Population</h3><br/>The happiness level of the population is calculated on each turn. It can vary according to the policies of the state (social spending, level of taxation), unemployment rate, purchasing power that changes according to product costs, potential shortages, anxiety levels in the country or the corruption of the leaders. Angry people can start demonstrations or riots, call for a strike and ultimately cause the player to lose the game.<br/>The people can also be influenced by the manipulation of information in the media or by natural leaders such as union or party leaders, by religious dignitaries who themselves can be in service of a foreign power.<h3>A Multitude of Strategies</h3><br/>The multitude of action plans (limited in each turn and must be carefully considered) combined with different ways to calculate scores offers players a multitude of strategies.<br/>The different levels of underlying gameplay such as wargames, featuring around fifty different types of military units, trade wars via economic contracts, management of the national budget to influence popularity via your investment capacity, management of resources, the role of the UN who can sanction a country or authorize  military interventions all add even more to the possibilities and the excitement of the game, with fortunes changing at any moment.<h3>Numerous Gameplay Modes and Options</h3><br/>Various configurations are available allowing you to vary the enjoyment of the game:<br/><br/>    • \"Career\" Mode: a game mode recommended to new players, the match begins with the only controlled character being the Head of State. You must then choose your closest advisors and gradually expand your group.<br/>    • \"Government\" Mode: the player choose a dozen characters at the beginning, allowing to operate within all domains.<br/>    • \"Multinational\" Option: a player can play as several countries and develop different tactics. Many small countries can then face a bigger one on equal footing.<br/>    • \"Extra Characters\" Option: the player can select a certain number of extra characters and devise a strategy before the game even starts.  For example, you can play as journalists or political opponents in a foreign country who can help destabilize the current regime.<br/>    • \"Multiplayer\" mode * : in multi-player mode, several players can join teams. The teams are in competition, each of them having several countries. (* Multi-player mode will be released during the Early Access period)<br/>    • \"Secret Objectives\" Options: each player (human or AI) can draw an objective which, if attained, will grant bonus points or even immediately win the game. Examples include controlling more than 50% of the hydrocarbon market, tripling the population, changing the regime in an enemy country.<br/>    • Game options allow you to fine-tune game dynamics: number of turns, duration of turns, number of actions per turn", "metacritic": null, "released": "2020-03-05", "tba": false, "updated": "2020-04-13T11:35:33", "background_image": "https://media.rawg.io/media/screenshots/59b/59ba0ecf929f228003d249e6cdd6b113.jpg", "website": "https://www.4th-generation-warfare.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 51, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 521, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eversim"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Eversim"], "esrb_rating": null}