{"id": 428088, "slug": "the-narrator-is-a-dick-longer-harder-and-uncut", "name": "The Narrator is a DICK: Longer, Harder, and Uncut", "name_original": "The Narrator is a DICK: Longer, Harder, and Uncut", "description": "<h3>THE STORY</h3>You can't remember how you got here, or what you were doing. You wander around confused... until a voice pierces the heavens. \"Hey idiot! Wake up!\" You rise from your slumber in a daze... where did that voice come from? Then it returns \"Go right you idiot! What are you doing just standing there?\" Who the hell is this guys? You're unsure... but you know one thing. He's a major DICK!<br/><br/><h3>THE GAME</h3>The Narrator is a DICK : Longer, Harder, and Uncut is the remastered version of the 2016 sensation \"The Narrator is a DICK\". The Narrator is back, and he's more of a DICK than ever, but don't worry because now you can take him down with your friends in the all new online co-op mode. If that's not enough, don't worry because new pals are here to help, as you can play as any character in the game!<br/><br/><br/><h3>Key Features </h3><br/><ul><li><strong>Comedy Based Unfair 2D Platformer</strong>  - Inspired by Games Like \"I Wanna Be The Guy\" and \"Kaizo Mario\".<br/></li><li><strong>Fully Narrated</strong>  - Every Line is Fully Voiced in English. <br/></li><li><strong>A Cavalcade Of Crazy Characters</strong>  - Meet Zany and Wild Characters as you Travel. <br/></li><li><strong>Full Controller Support</strong>  - Play using Keyboard or Controller.<br/></li><li><strong>Steam Achievements</strong> - An Assortment of Achievements to Unlock.<br/></li><li><strong>Improved Gameplay</strong> - Overall the game just feels better and smoother to play.<br/></li><li><strong>Multiplayer </strong>- Play every level together with your friends in rooms of up to 144 players.<br/></li><li><strong>Time Trial</strong> - Speed runners rejoice as your time played is now tracked in-game, making it easy to decide who is truly the best.<br/></li><li><strong>Original Soundtrack</strong> - A brand new original OST by Kirk Markarian.<br/></li><li><strong>Improved Graphics</strong> - New and Improved Sprites.<br/></li><li><strong>Infinite Save Slots</strong> - Start a New Game Without Losing Progress in Others.<br/></li><li><strong>Improved UI</strong> - Better Looking and More Uniform UI Elements.<br/></li><li><strong>Subtitles </strong>- Subtitles to Improve Accessibility.<br/></li><li><strong>New SFX</strong> - New and Improved Sound Effects.<br/></li><li><strong>Animations </strong> - New and Improved Animations.<br/></li><li><strong>Details </strong> - New and Improved Level Details.</li></ul><br/>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-13T11:55:23", "background_image": "https://media.rawg.io/media/screenshots/599/599bc5af99826c710c1d573b9c5e09fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Adam DeLease"], "genres": ["Adventure", "Indie"], "publishers": ["Adam DeLease"], "esrb_rating": null}