{"id": 428017, "slug": "streamer-daily", "name": "Streamer Daily", "name_original": "Streamer Daily", "description": "Like every person, you will have to meet your daily needs.<br/><br/>Will you be able to spend time on broadcasts and keep your hunger, fatigue and happiness high, earn money from work and be a good streamer at the same time?<br/><br/>You can gain experience for every minute you broadcast and spend these experiences to improve your abilities.<br/><br/>You can finish story-based missions or test yourself to fulfill sponsors' tough tasks.<br/><br/><br/>Streamer Daily contains 75 games in 15 different genres. You can play a unique mini game for each type of game.<br/><br/>The games will be easier according to the power of your computer and you will become a more popular streamer by increasing your achievements.<br/><br/>Also your own skills will be important to get high scores in every game.<br/><br/><br/>You can grow your personal space by moving to larger homes. More expensive items mean be more popular, and being more popular means more followers.<br/><br/>Hundreds of furniture that you can furnish as you wish is waiting for you in AKEI store.<br/><br/>How about broadcasting with a beautiful view by considering the illumination of your home according to what time of day you are?<br/><br/><br/>The most important requirement to be a good publisher is to have a good computer.<br/><br/>By upgrading your OBS add-ons, you can broadcast better quality and increase your reputation by taking care of your audience.<br/><br/><br/>You can buy hundreds of PC parts either online or in the store.<br/><br/>With a quality computer, you can improve your broadcasts and increase your audience, followers, subscribers and donations.<br/><br/><br/>You can participate in tournaments over the Internet and show your awards at home.<br/><br/>Doing business on the internet, buying and renting houses, taking out a loan from the bank, open a skin safe are some of the other activities you can do.", "metacritic": null, "released": "2020-03-04", "tba": false, "updated": "2022-09-04T07:48:10", "background_image": "https://media.rawg.io/media/screenshots/10c/10cad9877bf787ff42a758ecf148d909.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11, "beaten": 2, "dropped": 2, "playing": 1}, "playtime": 6, "achievements_count": 34, "ratings_count": 3, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Mehan Games"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Mehan Games"], "esrb_rating": null}