{"id": 428033, "slug": "hotshot-racing", "name": "Hotshot Racing", "name_original": "Hotshot Racing", "description": "<p>Hotshot Racing<br />\nHotshot Racing is a blisteringly fast arcade-style racing game fusing drift handling, razor-sharp retro visuals and an incredible sense of speed to create an exhilarating driving experience.</p>\n<p>16 racing circuits provide the twists, turns and straights conducive to searingly quick racing. Take in coastal, jungle, alpine and Las Vegas desert environments, with each course modelled with the most vivid colours and blue skies for miles.</p>\n<p>Time Trial and Grand Prix modes cater to those who like to compete in classic racing formats, while ‘Cops and Robbers’ and ‘Drive or Explode’ modes offer exhilarating new ways to play.</p>\n<p>Each mode is available in single-player, four-player split-screen and eight-player online, while Time Trial is single-player only. Single-player modes run at a blistering 60FPS to deliver one of the fastest depictions of racing possible.</p>\n<p>Smash lap records to rise-up the global online leaderboards or download ghost laps to match your racing lines against the very best.MEET THE HOTSHOTSKeiko, Xing, Mike, Alexa, Aston, Toshiro, Marcus and Viktor - eight speed addicts that have dedicated their lives to the pursuit of being the greatest racing driver in the world.CATCH THE DRIFTDrifting is crucial in Hotshot Racing. Boost charges as the player drifts so maintaining it for as long as possible is vital to preserving maximum speed throughout a race.DRIVE OR EXPLODEIn this mode each car has a bomb attached to it. Drop below a certain speed and BOOM! The trigger speed gets faster and faster, forcing players to maintain impossibly high speeds.COPS AND ROBBERSRobbers evade the cops. Cops catch the robbers, and in doing so convert them to the police side, leading to an exciting test of skill for the surviving criminals.A WELL NEEDED BOOSTEarn boost by drifting and slipstreaming opponents and unleash a one-shot hit of speed to leave them in your rear view mirror.</p>", "metacritic": 75, "released": "2020-09-10", "tba": false, "updated": "2024-03-17T17:00:03", "background_image": "https://media.rawg.io/media/screenshots/116/1169f370cdb4976dda3220faa3c57cda.jpg", "website": "http://curve-digital.com/", "rating": 3.27, "rating_top": 4, "added_by_status": {"yet": 57, "owned": 1353, "beaten": 16, "toplay": 13, "dropped": 53, "playing": 6}, "playtime": 1, "achievements_count": 266, "ratings_count": 94, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 95, "platforms": ["PlayStation 4", "PC", "Xbox One", "Nintendo Switch"], "developers": ["Sumo Digital", "Lucky Mountain Games"], "genres": ["Racing", "Indie"], "publishers": ["Curve Digital"], "esrb_rating": "Mature"}