{"id": 428039, "slug": "mists-of-noyah", "name": "Mists of Noyah", "name_original": "Mists of Noyah", "description": "Hunt during the day, be hunted during the nightDuring the day, you’ll have to collect resources such as wood, iron, gold, special ores, plants, food, and search for lost inhabitants of the ancient fort!<br />\nDuring the night, you’ll have to build defensive gates, regroup with the found inhabitants and protect yourself. Every full moon, the demons lash out at your fort and get stronger with each attack. If you lose the fort and can&#39;t get it back in time, you LOSE THE GAME!<br />\nMain Features<br />\nMultiplayer Co-op<br />\nCrafting<br />\nRPG Elements<br />\nClasses and Skills<br />\nDemonic Transformation<br />\nRandom World Generation<br />\nDay and night cycle<br />\nEvents<br />\nFactions<br />\nProfessions [Mining, Fishing, Lumber, Herboism, Cooking]<br />\nRare Monsters<br />\nBig Bosses<br />\nTower Defense Demonic Transformation All the characters were possessed during the major attack of corruption. Because they are very strong, they trapped the demons within themselves, but when they get very close to death, the demons take control. Crafting and RPG Elements Forge and enchant your equipment and accessories, create potions, plant, cook, distribute talent, unlock spells and skills. The fort You start in an abandoned fort, and need as soon as possible to find all the former residents there who fled during the corruption attack. Among the residents, you will find soldiers, archers, engineers, mechanics, alchemists, merchants and more. Factions The factions are smarter monsters, who build bases to get stronger. You&#39;ll have to destroy those bases before they create an army to attack your fort! \\</p>", "metacritic": null, "released": "2022-05-22", "tba": false, "updated": "2023-03-18T14:24:38", "background_image": "https://media.rawg.io/media/screenshots/a31/a31a1d165a3fb67e7fa825027a8a7c25.jpg", "website": "http://mistsofnoyah.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 39, "beaten": 1, "toplay": 5, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 4, "platforms": ["Linux", "PC"], "developers": ["Pyxeralia"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Pyxeralia"], "esrb_rating": null}