{"id": 428171, "slug": "rollercoaster-mechanic", "name": "Rollercoaster Mechanic", "name_original": "Rollercoaster Mechanic", "description": "In <strong>Rollercoaster Mechanic</strong>, you save destroyed and broken funfairs. A small company, two brothers Leo and Noah, each with different skills and a great challenge: starting up broken rollercoasters and other attractions. Diagnose damage, repair, clean, test. And finally, enjoy every repaired attraction.<br/><br/><br/><br/>The biggest challenge is working at heights. Here, the cooperation of the brothers will be the basis of success. You will often have to scale the heights just to unscrew one tiny screw that can cause tragedy during the rollercoaster ride. Going between clouds, don't forget to bring the right tools.<br/><br/><br/><br/>Fortunately, you have a diagnostic console at your disposal, finding a fault without it would be close to a miracle. It's your command centre, you'll find out where the problem is, but you'll also have to prove your smartness many times because not everything will be obvious. Then, the most important thing will be to repair and replace the damaged parts.<br/><br/><br/><br/>The fair was abandoned for a very long time, so you not only need to repair the damage, but also tidy it up, clean it, often give it a bit of new glow, and grease or start up many elements. It won't be easy, you have to watch out for hobos, hordes of rats or other new inhabitants of the abandoned amusement park.<br/><br/><br/><br/>A small family business, two brothers, and a big challenge. Things can happen between brothers, but don't worry, Leo and Noah understand each other perfectly and complement with their skills. Use the experience of both depending on your needs, many tasks will require their full cooperation.<br/><br/><br/><br/>The profession of a rollercoaster mechanic is not easy. You have to learn and grow all the time, use new tools, develop and improve them. Buy new tools to make your work more efficient. Implement new mechanics, work faster and better, but also have great fun.<br/><br/><br/><br/>And finally, the best part of your work. Each attraction should be tested before handing it over to guests. Remember, this is very important. You must be perfect, because if you make a mistake... scary to even think about it. Everything will surely go well, enjoy the amazing fun!", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T12:47:32", "background_image": "https://media.rawg.io/media/screenshots/f3a/f3a830d2455201cbb860faa2527b914f.jpg", "website": "http://forestlightgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 630, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ForestLight Games"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "Forestlight Games"], "esrb_rating": null}