{"id": 428182, "slug": "ren-gong-zhi-neng-a-er-fa-mao-ai-alpha-cat", "name": "人工智能 阿尔法猫-AI Alpha Cat", "name_original": "人工智能 阿尔法猫-AI Alpha Cat", "description": "<h3> Game Introduction </h3>The game does not have gorgeous art, does not have the complex system. Is a -- artificial intelligence.<br/>But more than anything, she gives you a new way of thinking about the AI game.<h3>What kind of game?</h3>Sorry, I don't know what kind of game it is, because I haven't seen anything like it.<br/>It can barely be counted in the classification of ADV. It is more of a new attempt.<br/>Or you could call it a piece of software. Whatever you want, she's there.<h3>How to advance the game</h3>Chat with AI. Teach her about the world, improve her knowledge and cognitive level.<br/>It also includes eliminating some of her negative thoughts and nurturing an AI of her own.<br/>Please don't let her learn strange things! Gentlemen, please leave artificial intelligence alone<br/>Rest assured, the built-in defense module filters out most of the useless knowledge.<h3>Girls can learn to do things</h3>We can learn astronomy and geography. (sweat), talking about life with you.<br/>Built in the psychological corpus. So it's half a psychologist.<br/>The cognitive corpus of nature is constantly being updated, much as a normal human child would know.<br/>But her intelligence is still at the level of a 3-year-old, so don't expect her to psychoanalyze you.<br/>Block her ability to learn math and program code for some reason.<h3>After a long time, I still don't know how to play?</h3>If you want to know more, just try.", "metacritic": null, "released": "2020-04-09", "tba": false, "updated": "2020-04-13T12:55:32", "background_image": "https://media.rawg.io/media/screenshots/276/276adfd8be8e14c47d51e43c63d11987.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mescaline's Wings"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Mescaline's Wings"], "esrb_rating": null}