{"id": 428164, "slug": "kinky-fight-club", "name": "Kinky Fight Club", "name_original": "Kinky Fight Club", "description": "<strong>Kinky Fight Club</strong> is a realtime 3d-RPG where the characters go to the club to have sex-fights! Whoever makes their opponent cum first wins! <br/><br/>The Game includes an <strong>Arcade mode</strong> with 30 characters, and 6 slots for you to Customize your own fighters. Each character has their own stats, costumes, abilities, weakness, resistance, and different sex movements! <br/>Choose your character and climb as high as you can defeating enemies in the Arcade towers! or Pick your opponents in Versus mode!<br/><br/>The Game also includes a <strong>Story mode</strong>, where you create your own character and go on an adventure, and participating on the Kinky Fight Club Championship! While doing this you can have varios different adventures, train, make friends, get in trouble, get out of trouble, etc. There are many endings to the game, and your choices matter in this game! (aswell as your score!)<br/><br/>Finally, the Game includes a lot of content for different tastes, but <strong>you can set it to only see the kind of content you like!</strong> (not into yaoi? no problem, you won't see any unless you desire so!)<br/><br/>Game Features:<br/><ul><li>    You can play with male or female characters. (or even futas, optional!)<br/></li><li>    RPG-style attributes, weakness, resistances, cooldowns and abilities!<br/></li><li>    30+ Unique characters with their own costumes and abilities!<br/></li><li>    Create your own characters, and choose their look from a list of over 300 clothing items!<br/></li><li>    You can play with a passive role or an active role regardless of gender. (this allows for all kinds of sex interactions!)<br/></li><li>    Female characters can use Strap-ons (or become futas) to perform on Active roles!<br/></li><li>    You won't see any content you dont want!. <br/></li><li>    Over 75 Different Sex/Foreplay movements to use!<br/></li><li>    Multiple stages on Sex/Foreplay movements, for over 300 original sex animations for the game!<br/></li><li>    Boob, Booty and Dick size sliders, to increase or decrease as you like!<br/></li><li>    Lots of unlockables, Art galleries, Extra features, and an unpredictable AI makes for great replayability!<br/></li><li>    Multiple difficulties, including a -Relax- mode!<br/></li><li>   And many more!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T12:41:15", "background_image": "https://media.rawg.io/media/screenshots/a6a/a6ae1390be91403d93fe030f61296c6a.jpg", "website": "http://mrzgames.wordpress.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 2}, "playtime": 0, "achievements_count": 46, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Mr Z Games"], "genres": ["Action", "RPG", "Simulation"], "publishers": ["Mr Z Games"], "esrb_rating": null}