{"id": 428141, "slug": "geometry-arena-ji-he-jing-ji-chang", "name": "Geometry Arena 几何竞技场", "name_original": "Geometry Arena 几何竞技场", "description": "Fast numerical growth - Most upgrades can improve the ability of the character. Just enjoy it !<br />\nBullet splitting effect - Some upgrades can give your bullets a special splitting effect. Different types of bullet splitting effects can be combined freely. You can even use them to draw various strange patterns.<br />\nBullet growth effect - Some upgrades can give your bullet special growth ability. Different types of bullet growth effects can be combined freely, which makes your bullets have interesting changes from the moment of shooting.<br />\nCharacter special effects - Some upgrades can give your character various special effects, such as automatic tracking missile, recovery ability, bullet burst and so on. Build your own build by yourself!<br />\nInteresting and Novel Character Formation!<br />\nHard core numerical system - The game character has more than ten RPG numerical character attributes, each of which shows the source and calculation formula of its bonus with a high degree of visualization to meet the needs of hard core data control players.<br />\nNine characteristic roles - Each role has different attributes, advantages and disadvantages, and characteristic skills. Soldier with shields, sniper causing amazing damage, magician with magic bullet circle around them, double gunner with infinite displacement sprint, triple gunner with bullet storm, summoner with bullet capable of automatically searching for enemies, cannon gunner with bullet capable of penetrating enemies, shotgun with dozens of bullets fired in a short time, and machinegun who crush enemies with body shape advantage .Who is your favorite?<br />\nColorful character variation - There are 12 different variant colors for you to choose. They can bring different bonus to your character. Through the combination of character attributes and color variation, you can build your unique game style.<br />\nDeep character growth - Permanently strengthen the character&#39;s ability with the stars gained in the battle. The enhancement of a single character can also strengthen all characters, so that you can enjoy the benefits of previous training for other characters while switching new characters.<br />\nIntense and Exciting Combat Experience!<br />\nArena battlefield - Dozens of different types of enemies swarmed in from all directions. Can you resist attacks again and again?<br />\nBullet free Barrage - Enemies use their bodies to form a barrage and attack until the end of the game. Evasion is no longer the only survival skill. Only attack can guarantee survival!<br />\nFind Your Own Game Experience!<br />\nMulti level game difficulty level - Too simple to fight? No problem! You are free to increase the difficulty of the battle and get bonus reward. Step up from F to S + and challenge your limits.<br />\nCustomizable difficulty options - Want to play something new? That&#39;s all right. Before each round of combat, you can freely combine the 12 unique difficulty options in the main menu to create your own unique experience.<br />\nChallenging endless mode - Not enough to play after beating the game?  Endless mode it&#39;s coming! The difficulty of endless mode level will increase by leaps and bounds, and reward with rich star rewards. Make good use of endless mode to cultivate your character!</p>", "metacritic": null, "released": "2020-04-08", "tba": false, "updated": "2022-01-31T21:39:08", "background_image": "https://media.rawg.io/media/screenshots/590/59033290a5ae27f4bbe8ef7f4fcb2357.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 43, "toplay": 1}, "playtime": 2, "achievements_count": 124, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["011 Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["011 Games"], "esrb_rating": null}