{"id": 4281, "slug": "ratchet-clank-going-commando", "name": "Ratchet & Clank: Going Commando", "name_original": "Ratchet & Clank: Going Commando", "description": "<p>Ratchet &amp; Clank: Going Commando is the second installment in the Ratchet &amp; Clank series developed by Insomniac Games and published by Sony Interactive Entertainment.</p>\n<p>The game follows Ratchet and Clank, who after defeating Chairman Drek in the conclusion of the previous release, are recruited by MegaCorp&#39;s CEO, Abercrombie Fizzwidget, and taken to the Bogon Galaxy. While Clank is given an apartment on planet Endako, Ratchet is trained to work as a commando, tasked to locate a thief who has taken a biological experiment. The two later realize that the operation is not all as it seems, and must work to save the galaxy from the Protopet menace.</p>\n<p>While the core third person action adventure gameplay is similar to the previous entry, Going Commando features notably more role playing game elements, allowing players to upgrade both their nanotech (health) and weapons by defeating enemies, and given them more weapons and armor to purchase at vendors with collected bolts. There are also many more challenges, such as gladiator battles and hoverbike races, that they can participate in to earn bolts (or alternatively raritanium to upgrade their ship). Players are still required to complete objectives on planets to unlock new planets or to obtain gadgets required to complete other objectives and progress the story.</p>", "metacritic": 90, "released": "2003-11-11", "tba": false, "updated": "2024-03-02T17:26:14", "background_image": "https://media.rawg.io/media/games/c03/c03965311ed72ba0629b84f4db45aebf.jpg", "website": "", "rating": 4.33, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 43, "beaten": 136, "toplay": 32, "dropped": 9, "playing": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 88, "suggestions_count": 211, "game_series_count": 15, "reviews_count": 91, "platforms": ["PS Vita", "PlayStation 2", "PlayStation 3"], "developers": ["Insomniac Games"], "genres": ["Action", "Shooter", "RPG", "Platformer"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Teen"}