{"id": 428244, "slug": "zombie-island-2", "name": "Zombie Island", "name_original": "Zombie Island", "description": "Thank you for looking at Zombie Island!!<br/>\n<br/>\r\nWhat is in this game:<br/>\r\n7 main levels<br/>\r\n3 endless levels<br/>\r\n1 super secret level.. SHHH<br/>\n<br/>\r\nWhy I made this game:<br/>\r\nI made this game in my free time from school. I started this game back in early 2018 but had to push the game into New Years'. I wanted to have a game where there is no goal but to slay some zombies on some islands and to find some easter eggs. I wanted to not make another zombie game but to have secrets for you to find. The game is free so why not try it out? <br/>\n<br/>\r\nWhat this game expresses:<br/>\r\nZombie Island tries to express relaxation and to defeat all the zombies to clear the islands. There are other modes as well which are hidden for you to find out. In the future, I might open it up for people to play the full game without finding these hidden easter eggs. Have fun and thanks for the slaying.<br/>\n<br/>\r\nContent:<br/>\r\nThe content in Zombie Island includes an open island where zombies roam. There is no story but there IS a level where you can find out where they came from. Enjoy your stay and look at the beautiful islands. Never know what you might click on or come across. <br/>\n<br/>\r\nOverview of the game:<br/>\n<br/>\r\nTake a walk through zombie-infested islands where you are tasked to clean the island from zombies. Or take some time and storm.... or face some deadly... Nevermind... I can't talk about it.. you should find out yourself.. Happy slaying..", "metacritic": null, "released": "2020-01-01", "tba": false, "updated": "2020-04-13T13:38:16", "background_image": "https://media.rawg.io/media/screenshots/efb/efbecfa8b61a1b4bfacc2cecfd7a463f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sheer Studios"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Sheer Studios"], "esrb_rating": null}