{"id": 428216, "slug": "vilundia", "name": "Vilundia", "name_original": "Vilundia", "description": "Vilundia is an easy to play, single player, card game for Windows and Linux. The game includes elements of both skill and luck.<br/><br/><strong>Scenario</strong><br/>In the fantasy kingdom of Vilundia, the Forces Of Chaos and the Forces Of Order are in a struggle to take control of the kingdom's locations and resources.<br/><br/><strong>Playing</strong><br/>Select to play as either the Forces Of Chaos or the Forces of Order.  Play your Faction cards skillfully against your opponent Faction to take control of resources at each location.  Each turn, the number of locations you control is added to your score until the end of the game.<br/><br/><strong>Resources And Locations</strong><br/>Resources such as Cottages, Peasants, Food, Crystals, Dragon Eggs, Wichcraft, Bats, Turrets, The Moon, Sun, Ships and Broomsticks are up for grabs. From Gordia to Ingwi, locations in Vilundia inlcude towns, ports, castles, caves, moutains and forests. The number of locations available varies with game length.<br/><br/><strong>Card Decks</strong><br/>The Forces Of Chaos card deck includes Witches, Trolls, Ogres, Vikings, Dragons and Tree Monsters.  The Forces Of Order card deck includes Kings, Queens, Knights, Soldiers, Wizards and Serfs. Crads are used to Own, Add, Delete, Convert, Block and Steal resources.<br/><br/><strong>Key Features</strong><br/><ul><li>Easy to learn<br/></li><li>Non-combat card mechanics<br/></li><li>Resource control is the aim of the game<br/></li><li>Set your own length of game turns<br/></li><li>Card Actions to Own, Add, Delete, Convert, Block and Steal resources</li></ul>", "metacritic": null, "released": "2020-03-05", "tba": false, "updated": "2020-04-13T13:21:57", "background_image": "https://media.rawg.io/media/screenshots/c41/c41a44be023401fcd96d534f5722cd4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Spaghetti Code"], "genres": ["Casual"], "publishers": ["Spaghetti Code"], "esrb_rating": null}