{"id": 428231, "slug": "blaster-squad", "name": "Blaster Squad", "name_original": "Blaster Squad", "description": "<ul><li>Co-op mayhem for up to 4 players<br/></li><li>Try to keep your multikill combo going and trigger special attacks!<br/></li><li>Blast through 8 different planets and over 1000 randomly generated increasingly challenging levels until you pack enough firepower to take on the real evil<br/></li><li>Level up, and customize your weapon with thousands of different ammo types with different effects<br/></li><li>4 ultimate skills that help you work together as a team<br/></li><li>Supports 1-4 controllers, 1-2 players on a single keyboard, and online multiplayer with Remote Play Together</li></ul><br/>As part of Alien Supervision &amp; Security unit you and your Blaster Squad is sent to investigate a formerly habitable planet that seems to be swarmed by alien monsters. Find out who's behind the invasion and bring them some explosive justice. <br/><br/><h3>The world</h3><br/>Your galaxy consists of 8 planets with different flora and terrain. Each planet contains multiple sectors with different obstacles, totaling in over 1000 playable levels.<br/><br/><h3>Weapons</h3><br/>Weapons are leveled up increasing their fire rate, damage, and ultimate ability. You can unlock up to 4 attachments that can shoot different ammo types with different behaviors and bonuses. You can combine different attachments to your weapon and build your ultimate monster killer.<br/><br/><h3>Characters</h3><br/>Characters have countless unique visuals and 4 unique ultimate abilities. The abilities help you work together as a team. You can revive other players, and having more teammates makes taking down the big monsters much easier. Collect points by killing monsters and level up your character's health, agility, and shield until you're ready to take on the final bosses!", "metacritic": null, "released": "2020-05-01", "tba": false, "updated": "2020-04-13T13:30:59", "background_image": "https://media.rawg.io/media/screenshots/194/19473f25192f07e89e3fe6e3cec2ecd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gaming Couch"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Gaming Couch"], "esrb_rating": null}