{"id": 428225, "slug": "viktor-crysworth", "name": "Viktor Crysworth", "name_original": "Viktor Crysworth", "description": "World and Armageddon… The only owner of the two worlds…<br/><br/>He, Viktor Crysworth known as the “black engineer” who dominates the artificial intelligence he uses to take over the world and take control of it. His dreams that began to flourish in Germany were prototypes that would rule the future for him. He would take complete control of the sovereignty and not leave a single sign of life behind. The only thing he wanted was a group of people that he could rule.<br/><br/>He found what he was looking for, thanks to Dr. Ron Brown, professor of physics from the university. The first outcome of the power he created was realized by the founder of the Sea Effect team, Dr. Ron Brown. The Sea Effect, led by Dr. Ron Brown, placed high growth robots called “Fallstreak”, a new product of Viktor and the destruction and lethal strenght of which would be tested in North Antarctica. During the testing process everyone interacted with these robots, disappeared in seconds.<br/><br/>Artificial intelligence created with an overloaded technology was on alert to cause great destruction and to reduce the technology stock all over the world to zero. Unfortunately, the Sea Effect team was too late for some things.<br/><br/>It was a great opportunity to listen to all the experiences from a real hero who fought to death in order to save the distant future of the world, Jakob Knox and though the soldiers of his ever lasting enemy, Sultan. <br/><br/>Maybe it wasn’t.<br/><br/>And now, the end was much closer than the beginning for a defenseless Andromeda.<br/><br/>A huge chain created for Viktor Crysworth’s dream of “full domination”… and more than 2080 Fallstreak representing its smallest link, redesigned in its own path, having reached the top of the technology.<br/><br/>Is Viktor Crysworth a criminal, or not? The ropes are entirely in the hands of Agustin Graysen.", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-04-13T13:27:40", "background_image": "https://media.rawg.io/media/screenshots/bd3/bd3a29c32a9b3f9eb39ca1839a269d14.jpg", "website": "http://viktorcrysworth.misadref.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MISADREF"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["MISADREF"], "esrb_rating": null}