{"id": 428296, "slug": "ultimate-mma", "name": "Ultimate MMA", "name_original": "Ultimate MMA", "description": "<strong>Ultimate MMA</strong> is a mixed martial art fighting game.<h3>FEATURES</h3><ul><li> Unlock 50+ moves from a variety of martial art schools<br/></li><li> Customize your fighter<br/></li><li> Try over 70 different combinations of kicks and punches<br/></li><li> Beat a large number of fighters and obtain their unique techniques<br/></li><li> Invite your friends and have fun</li></ul><h3>CONTROL</h3>The faster you press the faster you strike.<br/><br/><strong>Uppercuts</strong> are performed by simultaneously pressing punch and kick buttons in one direction.<br/><strong>Body mod</strong> button turns punches and kicks into body punches and body kicks.<br/><strong>Hook mod</strong> button replaces punches and body punches with side hooks.<br/><strong>Special mod</strong> in combination with punches and kicks activates special move.<h3>CUSTOMIZATION</h3>Being a huge fan of versatile character editors I strived to build such a system myself.<br/><br/>The customization system provides options to manually set body parameters, facial features, hairstyles, skin tones and a wide range of tattoos.<br/>You can tweak a character's physique in many ways, including body size, arm's length, chest depth, palms scale, shoulder's angle, even shin's size and much more. Each fighter has a unique set of parameters based on body constitution.<h3>REMOTE PLAY</h3>With Remote Play Together, you can invite Steam Friends to join your game online.<br/>Only the host needs to own and install the game, while the second player connects through Steam Remote Play streaming technology.", "metacritic": null, "released": "2020-03-05", "tba": false, "updated": "2020-04-13T14:28:10", "background_image": "https://media.rawg.io/media/screenshots/47b/47b2be989c865428fd2b91f941ceb15a.jpg", "website": "https://www.facebook.com/Ultimate-MMA-103906857894211", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Anton Pushkarev"], "genres": ["Sports"], "publishers": ["gridmaniac"], "esrb_rating": null}