{"id": 428209, "slug": "legend-creatureschuan-qi-sheng-wu", "name": "Legend Creatures(传奇生物)", "name_original": "Legend Creatures(传奇生物)", "description": "<p>SummaryLegendary creatures is an independent game with rich playing methods such as roguelike + self-propelled chess + strategy. You can collect various fantasy creatures and form different team lineups. These creatures have various talents and skills, cooperate with different equipment to strengthen the battle, and can also evolve into different biological types, branches and levels. You can also expand the bio mod to increase gameplay and let all kinds of magical and interesting creatures join the game.creaturesAll creatures have their own evolutionary trees, which retain their previous abilities and acquire new ones after evolution. Each unique capability is scripted, not just numerical. Different factions of creatures can be combined according to your tactics. Each of the same three creatures can evolve into higher-level creatures. You can evolve creatures of different factions according to your own lineup requirements, including soldiers, mages, shields, assassins, archers, therapists, etc.<br />\nGear and talentEach biological character can also wear three pieces of equipment with unique effects. Different equipment will produce various chain synergy effects with the biological character&#39;s own passive skills and talents. You need to configure different equipment according to different skills and talents, and then cooperate with the changing lineup to have a surprise effect.<br />\nModIn the official version, the Creative Workshop (MOD) will be opened. Players can create their own creatures, equipment, talents, etc. With a simple API and a biological picture, you can easily realize your own wonderful and even spooky biological idea DIY.</p>", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2022-02-01T01:23:05", "background_image": "https://media.rawg.io/media/screenshots/c27/c276c166377c12f0de594330d883e956.jpg", "website": "https://weibo.com/ROStudio", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "toplay": 1}, "playtime": 6, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hideChara"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Aplus games"], "esrb_rating": null}