{"id": 428393, "slug": "advancity", "name": "Advancity", "name_original": "Advancity", "description": "<h3>Run an empire in this simple and enjoyable city builder strategy management game. Build, research, train, battle, upgrade, expand, and sail, all while managing your citizens and resources. Advancity focuses on fun and progression.</h3><br/><br/><strong>Build homes for citizens, construct machines and research new technologies. Train soldiers for strategic battles against enemy camps and bases. Expand your empire by sending ships to conquer more land on new islands.</strong><br/><br/><strong>Advancity focuses on fun and progression. There is always something to do without having to wait around. This casual game is simple and easy to understand with no steep learning curve. Advancity is sure to be enjoyed by anyone!</strong><br/><br/><ul><li>Build houses, public locations, and manage your citizens.<br/></li><li>Construct machines for mining, smelting, and more.<br/><br/><br/></li><li>Assign scientists to research and discover new technologies and advancements.<br/></li><li>Train soldiers and go on strategic battles with monster camps and bases.<br/><br/><br/></li><li>Upgrade your buildings and army as you progress.<br/></li><li>Explore and battle in new lands for more spots to build, mining nodes, monsters, and more.<br/><br/><br/></li><li>Conquer multiple islands overseas by constructing ships to transport resources and military.<br/><br/></li></ul>", "metacritic": null, "released": "2020-04-22", "tba": false, "updated": "2020-04-13T15:41:56", "background_image": "https://media.rawg.io/media/screenshots/0b3/0b38451890a1a17e4f47958583822cb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tbjbu2"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Tbjbu2"], "esrb_rating": null}