{"id": 428329, "slug": "bowmen-2", "name": "Bowmen", "name_original": "Bowmen", "description": "READY YOUR BOWS and down your energy drinks for our all new debut title: Bowmen! As one of the last of an elite group of archers, you must fire arrows to drive back waves of enemies spawned from the depths of hell before they can destroy the realms of men. Shoot enemies using a variety of different weapon types, ignite explosives on the map, and equip items to help your little archer inflict maximum damage. Level up to unlock more daunting and brow-sweating difficulties, all the while fighting your way into higher and higher scores. If you're good enough, your scores will sit on our online leaderboards for exclusive bragging rights as one of Bowmen's most elite players! <br/><br/>A MESSAGE FROM THE CREATOR - Hello everyone, and welcome to the Bowmen store page! We are working hard to bring our first title to you as fast as possible, but being a small independent game studio (and I put a lot of emphasis on small) means that development has been going slowly and steadily. We will announce a lot more here in the months to come regarding game specifics, but in the meantime, we're actively looking for closed beta testers to provide crucial feedback on the gaming experience. So if you'd like to help and participate, please check out our website and signal your intent to participate in play testing and we may send you a beta key. Thanks for checking us out!<h3>SURVIVE THE ONSLAUGHT OF HELL</h3><br/><br/>Lord Pain has summoned his infernal minions once again to wreak havoc on the realms of men... As one of the last of the Bowmen, a long forgotten but elite Elven race that once guarded the living against this malevolent evil, you must muster your courage and venture forth toward the portal of doom to save mankind once again. With a bit of skill, a dash of luck, and the help of an unusual accomplice, you may hold these demons off just long enough for the living to be saved and mankind to emerge victorious once again!<h3>EARN UNIQUE ITEMS</h3><br/><br/><br/><br/>Bowmen comes with a plethora of items for you to discover off the enemies you slay during each encounter. Items can increase your heath regeneration, increase your defense, add to your overall weapon damage, or enhance your arrows with unique abilities (such as Mjölnir or Bloodlust) which foster different play styles. Do you prefer to do single target damage or AoE? Which is more effective in getting you that higher score on the leaderboards? The choice is yours!<h3>FIGHT YOUR WAY TO THE TOP</h3><br/><br/>Fight your way to the top of our Leaderboards to earn exclusive bragging among your fellow archers! After each session of Onslaught on Infernal difficulty, your score will automatically be submitted to our servers at Ethereal Gem along with your character's name and your current player level. If your score is higher than any of the scores within the top 1000, your score will be shown on our website so that everyone will know their place in the Bowmen hierarchy!", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-13T14:56:26", "background_image": "https://media.rawg.io/media/screenshots/860/860440795873bfbc1148c08700326bba.jpg", "website": "https://www.etherealgem.com/public/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ethereal Gem"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Ethereal Gem"], "esrb_rating": null}