{"id": 428300, "slug": "dragonfang-drahns-mystery-dungeon", "name": "DragonFang - Drahn's Mystery Dungeon", "name_original": "DragonFang - Drahn's Mystery Dungeon", "description": "DragonFang is a story-rich tactical rogue-like RPG.<br/>Summon and level up your ally monsters to challenge bosses in the dungeon depths!<br/><br/><br/>DragonFang is the story of a young dragonian in a world where dragons are slowly becoming extinct.<br/><br/>Once upon a time the dragons, mightiest among all, ruled the world with their godly power.<br/>The seemingly everlasting dragon era has come to an unexpected end, and the world is in turmoil without absolute rulers.<br/><br/>As their days come to an end, dragons create labyrinths and hide in their depths out of time and space to quietly draw their last breaths. Thus no one can misuse their tremendous powers as they sleep, for they love the world.<br/><br/>Why are they passing out of existence?<br/><br/><br/><br/>Now a dragonian boy, Drahn, and his trusty fairy companion, starts a journey to meet with the remaining dragons.<br/>He will need to unlock the powers of the Dragonfang to discover the truth!<br/><br/><br/><br/>DragonFang is a story-rich tactical rogue-like RPG. <br/><br/><h3>Mystery dungeons</h3><br/>Adventure into a flame swirling dungeon, sky piercing Yggdrasil, and the solemn shrine deep under the sea. You will face mighty bosses awaiting deep in the dungeons. <br/>Randomly generated dungeons can be played over and over and still yield new loot or dangers. <br/>There will be lots of really challenging dungeons and bosses so get ready!<br/><br/><h3>Dragon time</h3><br/>Time is stopped between your actions, so you can analyze the situation and decide to attack, use a powerful item or fang skill, or even run away and heal to fight on another day. Each action depletes your Dragon Time, which will heal you unless you re attacked or poisoned,  and you can replenish by discovering new rooms. But beware, if you run out, each action will also deplete your health!<br/><br/><h3>Over 150 monster fangs to train and equip.</h3><br/>Summon ally monsters and employ their special power and skills to defeat these evil bosses.<br/>You can select and equip up to 3 monster fangs to borrow their strength in your dungeoning.<br/>There are over 150 of them, from cute to cool and unique ones, all with different skills and strength. Choose your favorite and level them up to become stronger.<br/><br/><br/><br/>Enemies may decide to join your party after defeating them!<br/>Are you going to stick with your old pals? Or you want to build a different squad with new friends? It’s all up to you.", "metacritic": null, "released": "2020-02-03", "tba": false, "updated": "2020-04-13T14:33:38", "background_image": "https://media.rawg.io/media/screenshots/d03/d030ab9efb8727ad33a1a5d2ab60f9f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 75}, "playtime": 1, "achievements_count": 42, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Degica", "Toydea"], "genres": ["RPG"], "publishers": ["Degica"], "esrb_rating": null}