{"id": 428317, "slug": "guns-of-bullshit", "name": "Guns of Bullshit", "name_original": "Guns of Bullshit", "description": "<strong><h3>Mistakes - give us experience and our experience is Guns of Bullshit.</h3></strong><br/><strong>Guns of Bullshit is a grandiose project from STREAMWORKS and the highest-rated game according to Aleksey Shevtsov is released on PC. The game was in development for almost a year, and finally it can be released!</strong><br/><br/><strong>Guns of Bullshit harnesses the power of the player’s computer to show every corner of this world with maximum credibility. Among the graphic and technical improvements - increased range of drawing; improvements in global lighting and diffuse shading; improved reflections and shadows of higher resolution at all distances.</strong><br/><br/><strong><h3>Features:</h3><br/><ul><li> The game takes place in the elaborate world of a fictional country called Nerasia. It spreads over an area of ​​322 square kilometers, and real-life places served as a source of inspiration for this world!<br/></li><li>Interaction with other bots, each of which is trying to survive at all costs!<br/></li><li>Ability to create a local server on which only bots will be located and you! No one can distract you from the unrealistic process of the game.<br/></li><li>Arcade firearms and brutal hand-to-hand combat system.<br/></li><li>Smooth and convenient character control with elaborate animation.<br/></li><li>Reliable and most stable Unity technology platform, which is used by many professional companies.<br/></li><li>Several game locations in which you can demolish the Bosko right and left, leaving no chance for opponents! </li></ul></strong><br/><br/>All characters and events appearing in this game are fictional. Any resemblance to real people, living or dead, or events is purely coincidental. The game has no purpose to insult or humiliate anyone.", "metacritic": null, "released": "2020-04-12", "tba": false, "updated": "2020-04-13T14:46:59", "background_image": "https://media.rawg.io/media/screenshots/f37/f3793d2d4f6810b23b94f84e9277d24a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["STREAMWORKS"], "genres": ["Action", "Adventure", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["STREAMWORKS"], "esrb_rating": null}