{"id": 428304, "slug": "drone-swarm-2", "name": "Drone Swarm", "name_original": "Drone Swarm", "description": "<p>You are Commander Carter, ex-soldier and captain of the starship Argo. Its ultimate weapon: a giant swarm of 32,000 drones. Control your mothership&#39;s drones and strategically deploy them to achieve your objectives. Split the swarm to simultaneously defend your ship and attack the enemy. Develop your own tactics and exploit the environment to destroy alien aggressors. Explore the uncharted galaxy with its many dangers and mysteries. Collect resources and acquire new abilities to keep upgrading your ship and drones.<br />\n“Wow. It’s not often a game impresses me with graphics or technology anymore, but Drone Swarm is immediately a thrill just to look at.” Rock Paper Shotgun<br />\nThe year is 2118. Earth lays in ruins after huge swathes of it were destroyed by a massive swarm of alien drones. The few human survivors found a way to control the drones and halt the attack. Now that the Earth is uninhabitable, the starship Argo has been sent on the long and dangerous search to find a new Earth somewhere out there in the galaxy.<br />\nDiscover more about the diverse species of aliens throughout the galaxy in a thrilling storyline. Join forces with either the Voohr or the Dashan and determine the fate of humankind. The decision is yours alone!<br />\nDo what must be done to complete your mission. You are the last hope for human civilization!<br />\n“Drone Swarm is a graphically-impressive sci-fi strategy game&quot; KnowTechie<br />\n•   Control a vast swarm of 32,000 drones.<br />\n•   Journey through an expansive story campaign featuring around 100 unique star systems and challenging battles.<br />\n•   Your choices directly impact the course of events.<br />\n•   Upgrade your mothership to prepare for increasingly more powerful enemies.<br />\n•   Use unique abilities like physics and energy attacks to route the enemy.<br />\n•   Keep adapting your tactics to the ever-changing combat styles of the enemy.<br />\n•   Use your environment to your advantage and eliminate enemy ships.<br />\n&quot;Drone Swarm is just as beautiful as it is exciting. From gameplay mechanics to visuals, the time spent in this ever-evolving cosmos is electrifying and intense.&quot; TheGamer</p>", "metacritic": null, "released": "2020-10-20", "tba": false, "updated": "2023-01-15T18:31:50", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7f8c3974327a644f18bc2bc2de62118.jpg", "website": "https://droneswarmgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 34, "toplay": 2, "dropped": 2}, "playtime": 3, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["stillalive studios"], "genres": ["Strategy", "Indie"], "publishers": ["Astragon Entertainment"], "esrb_rating": null}