{"id": 428320, "slug": "my-breast-friend-sally", "name": "My Breast Friend Sally", "name_original": "My Breast Friend Sally", "description": "If you are looking for a high quality, funny, and sexy story world, set in a “slice of life” fantasy farm, this is a game for you!<br />\nSally,  a cow-human hybrid girl, is one of many creatures owned by Farmer Edmund. She is a milk maid, but has “special status” among the other creatures of the farm, as she is quite beautiful. Ed treats her as his personal companion pet.<br />\nEd’s young nephew Jimmy works on the farm, as it’s mostly a family affair. He has come of age and is beginning to take notice of the voluptuous Sally. His uncle has tasked him with tending to her, but this may be prove to be problematic.<br />\nCan Sally resist Jimmy’s crush for her?<br />\nSALLY<br />\nSally was bread for her beauty and her capacity to provide milk. A mainstay on the farm for some years now, Sally enjoys a life of leisure, aside from her occasional duties as a milkmaid. Despite her more or less comfortable life, she longs for adventure and excitement! For now, she’ll have to settle for country life, and try and stop her eyes from wandering to the farm’s “forbidden fruits”.<br />\nJIMMY<br />\nJimmy has been tasked with tending to Sally, but this has proven to be difficult given the rising sexual frustrations and curiosities he’s experiencing since he&#39;s come of age. He has developed desires for a nurturing woman, and this has heightened his curiosity in Sally and her comforting allure.<br />\nEVA<br />\nShe is a sassy little creature who likes to wander the farm in search for occasional mischief. As and indoor/outdoor pet, she enjoys more freedoms than most of the people and creatures on the property. Eva’s job is that of a simple pet, although Sally suspects that Ed is beginning to favor her.<br />\nFIONA<br />\nFiona is an experienced. She’s a friend to the family and lives on a ranch about 2 miles from the farm. Aside from being an horse expert, she is an experienced  “jack of all trades” and is quite useful around the grounds. Her love for equine creatures is obvious, as she spends a good amount of her time tending to the prize horses.<br />\nDASH<br />\nThe farm is home to a trio of horse-human hybrid stallions that are prized for their impressive...<br />\nphysiques! Dash is their leader. These beasts are held in high esteem and often take precedent of the other creatures of the farm, much to Sally&#39;s dismay.<br />\nHD 1080p &amp; Fullscreen options<br />\nVisual Novel/ Point and click<br />\n2+ hours of content<br />\n25+ illustrated scenes<br />\nFully voiced characters<br />\nCG Gallery<br />\nExtras and secrets<br />\nDress-up “photo booth” gallery<br />\nOriginal Soundtrack and audio<br />\nLanguage options<br />\nAll the characters are over 18 years old</p>", "metacritic": null, "released": "2020-09-30", "tba": false, "updated": "2023-06-22T19:03:43", "background_image": "https://media.rawg.io/media/games/bdc/bdcebe68d55036cd5449e8b6832e5917.jpg", "website": "https://www.kupaastudios.com/my-breast-friend-sally/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 39, "beaten": 3, "toplay": 6}, "playtime": 1, "achievements_count": 16, "ratings_count": 3, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Lewd Mewd"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Critical Bliss", "Kupaa Studios"], "esrb_rating": null}