{"id": 428391, "slug": "dreamscaper-prologue", "name": "Dreamscaper: Prologue", "name_original": "Dreamscaper: Prologue", "description": "<h3>DREAM. DIE. WAKE. REPEAT.</h3><br/><br/>Dreamscaper: Prologue is the first chapter in the Dreamscaper saga, consisting of the level Home Town and<strong> 4-6h</strong> of unlockable content. Dreamscaper is an ARPG Roguelite blending elements from brawlers, top-down shooters, and dungeon crawlers. Every slumber is a different dungeon in an an ever-changing world with a multitude of unique events and challenges.<h3>Features</h3><ul><li><strong>MASTER DEEP COMBAT SYSTEMS</strong>: Skilled play gets rewarded. Use careful positioning, exact timing and quick reflexes to defeat foes with an abundance of combat options.<br/></li><li><strong>HARNESS YOUR LUCID POWERS</strong>: Warp the Dreamscape around you with  surreal dream attacks and abilities that manipulate the elements, warp space, and even control time itself.<br/></li><li><strong>UNCOVER THE MYSTERY</strong>: Unravel Cassidy’s story as you plunge through her subconscious and build relationships in the real world.</li></ul><br/><h3>OVERCOME THE NIGHTMARE​</h3><br/><br/>Adventure through beautiful, haunting dreams to discover untold secrets, vanquish nightmares, and upgrade your gear all while uncovering Cassidy’s story as you plunge through her subconscious. Each dream is another peek into Cassidy’s memories and experiences.<br/><br/>Live Cassidy's waking life and forge friendships with the people around her. Empower Cassidy with their hopes and memories to dispel the darkness of her nightmares.<br/><br/><br/>", "metacritic": null, "released": "2020-04-08", "tba": false, "updated": "2023-02-07T02:01:09", "background_image": "https://media.rawg.io/media/screenshots/fe6/fe6f705b7e47f46146db2e9dcea6aaa5.jpg", "website": "http://www.dreamscapergame.com", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 216, "beaten": 3, "toplay": 6, "dropped": 4}, "playtime": 1, "achievements_count": 13, "ratings_count": 11, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC"], "developers": ["Afterburner Studios"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Maple Whispering", "Afterburner Studios"], "esrb_rating": null}