{"id": 428420, "slug": "stick-shadow-fighter", "name": "Stick Shadow Fighter", "name_original": "Stick Shadow Fighter", "description": "Stick Hero Fighter - Super Dragon Warriors - The best action games and top 1 feature arcade<br/>games.<br/>If you love Stick Shadow Hero Fighter - Super Dragon Warriors fighting type of game then<br/>this game is the right choice for you with its great graphics and challenging gameplay.<br/>Stick Shadow Hero Fighter dbz - Super Dragon Warriors was inspired by \"Saiyanz battle Z\"<br/>promises to do the most exciting games in this genre.<br/>Join our game Stick Hero Fighter - Super Dragon Warriors, feel all skill and combo - which<br/>you have just read comic as ki, kamehameha. Join the tournament, be the champion and<br/>the god of super saiyan.<br/>Enjoy the ultimate attacks of warriors, such as kemeha, dragon recall, energy ball m and<br/>death balls, a fighting game is here waiting for you, good luck in the Most Unexceptional<br/>pixel z S champion game.<br/>HOW TO PLAY<br/>Stick Warriors has the most basic control ever! you just need to dodge, jump, power your ki,<br/>become ultra instinct and Z warriors super Hero fight against invaders. Use ultimate power,<br/>ultra shooting ball skill will be kill all invaders in shadow.<br/>FEATURES<br/>- 4 Game modes: Versus mode, Story mode, Tournament mode and Training mode<br/>- Versus mode: Face your favorite opponent head-on in an one-on-one battle. The winner<br/>will be decided after 3 rounds.<br/>- Story mode: Go on a life-long adventure to discover your true strength. Travel to all<br/>corners of the world and scream your battle cry. Become the hero as you mean to be.<br/>- Tournament: 16 finest warriors were chosen to fight in the tournament. Defeat any person<br/>may come in your way to reach the ultimate glory as the new champion.<br/>- Training mode: Prepare yourself for a new journey. Here, you can practice fighting skills<br/>and try out new characters. There's no limit on time so you can fight with the dummy as<br/>long as you want.<br/>- 46 stickman fighter characters SSJ with unique fight dbz styles.<br/>- Upgrade and unlock over 46 unique special moves for each fighter.<br/><br/>- Stick Hero Fighter super saiyan has the most basic control ever!<br/>- Ultra instinct characters.<br/>- Easy and Simple to play.<br/>- Cool transform Saiyanz.<br/>- Collect these kinds of super fighters: dragon ssj2, z ssj3, ssj4, ultra instinct (ui), xeno... to<br/>become strongest stickman warrior.<br/>CONTROL<br/>- KI Blast, Counter Skill, Power, Attach, Move, Teleport, Block.<br/>- Power + Attach: super attach.<br/>- Power + KI Blast: Ki Beam, Final Flash, Death Beam.<br/>- Special skill: Energy Ball, Dragon Strike, Death Ball, Big Bang Attack.<br/>Download Stick Hero Fighter - Super Dragon Warriors game for free and Protect your Earth<br/>and Universe from the big villains now. Control your heroes to destroy all enemies, all<br/>villains.<br/>Keep in touch with us if you like our game and do not forget to comment about Stickman<br/>Fighting game. We would love to hear from you!", "metacritic": null, "released": "2020-04-05", "tba": false, "updated": "2020-04-13T15:56:59", "background_image": "https://media.rawg.io/media/screenshots/b59/b59876f02028dba94352049e47235357_jo3U95S.jpg", "website": "https://www.facebook.com/StickShadowFighter/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Doan Thanh"], "genres": ["Action", "Adventure"], "publishers": ["Doan Thanh"], "esrb_rating": "Everyone 10+"}