{"id": 428589, "slug": "dynasty-of-the-sands", "name": "Dynasty of the Sands", "name_original": "Dynasty of the Sands", "description": "<strong>A mythical Ancient Egyptian city building game. Build a paradise along the banks of the river Nile.</strong><br/><br/>Dynasty of the Sands challenges you to build a mighty Pyramid in Ancient Egypt, to become your resting place, and an everlasting monument to your Dynasty. To achieve such a feat, a grand city, abundant resources and careful planning will be required.<br/><br/><br/><br/><strong>You start from humble beginnings, a collection of mud and straw huts, from which you will develop a grand city.</strong><br/><br/>Dynasty of the Sands takes place in an open world environment, with seasons, a day/night cycle, weather, wildlife, disease and more. These systems challenge the player as they develop a city to sustain a growing population.<br/><br/><br/><br/>The gods pose an ever present threat, and appeasing them is the only way to avoid their wrath. Building statues, shrines, temples and giving sacrifices are just some of the ways to pacify them.<br/><br/>Constructing your city is a balancing act. The needs of your villagers, the environmental pressures and the gods make this a challenging experience. However perseverance will be rewarded with a golden city of riches.<br/><br/>- Villagers must be provided with Water Sources, Food, Shelter and Entertainment to ensure they remain happy and healthy.<br/><br/>- Resources will be required in abundance. Primary resources like Mud and Flax can be grown and extracted. Secondary and Tertiary resources like Mud Brick and Pottery must be crafted within a series of production buildings.<br/><br/>- Vast amounts of quarried rock are required to construct your Pyramid. Sandstone blocks and limestone casing become a valuable commodity as you expand your monument. Completion of Pyramid levels grants power from the gods, used to unlock technologies and avoid the gods wrath.<br/><br/>- In-depth environment, day/night cycle, weather, wildlife, disease and many more systems are constantly changing and evolving to create a dynamic and engaging game experience.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T03:18:38", "background_image": "https://media.rawg.io/media/screenshots/aac/aacc3e1be8b4c7705c98a7e50b5255bc.jpg", "website": "http://rocketflair.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rocket Flair Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Rocket Flair Studios"], "esrb_rating": null}