{"id": 428579, "slug": "deep-space-banana", "name": "Deep Space Banana", "name_original": "Deep Space Banana", "description": "<h3>Deep Space Banana – Experience the Simian Strategy Game</h3><br/>Welcome to the depths of outer space. Discover Deep Space Banana – a very special game for intergalactic gaming with a very special blend of defense game and combat strategy game. This thrilling 3D ape game takes you on a journey to the far future where you establish your own space station and set your sights on the vast expanses before you.<br/><br/><h3>Monkey Madness in Space</h3><br/>Tackle the challenges of sustaining an all-ape crew in this comical and captivating science fiction strategy game. Provide rations for your primate posse by harvesting the lovingly grown bananas from your greenhouses, and fulfill other needs by constantly upgrading your space station. Deep Space Banana offers countless features and customization options that will keep you coming back for more:<br/><br/><ul><li>Upgrade your space station with hangars, machine shops, construction centers, oxygen converters and many other segments in this monkey game<br/></li><li>Fantastic 3D graphics in a visually stunning game<br/></li><li>Countless quests, gripping battles and captivating campaigns<br/></li><li>Various options to upgrade and augment your space station<br/></li><li>Heated arena battles<br/></li><li>Build extensive defense systems<br/></li><li>Strategy game decisions to make in a science fiction defense game setting<br/></li><li>Gripping gaming experiences</li></ul><br/><h3>Conquer Outer Space</h3><br/>In Deep Space Banana, you'll have the opportunity to explore the farthest reaches of outer space. Thrilling adventures, perilous campaigns of conquest and countless spine-tingling challenges await you. Expand your sphere of influence through ruthless campaigns requiring the cunning mind of a strategy game genius and ensure the prosperity and thriving of your base, using defense game elements such as missile launchers and mine throwers to keep your enemies at bay. Action is guaranteed in this magnificent monkey game! But that doesn't mean that the classic tycoon elements of harvesting resources come too short – supplying your station with energy, oxygen, iron, and of course, bananas is just as important as the management of your military units, which require maintenance and can be continuously augmented and upgraded.<br/><br/><h3>Blast off!</h3><br/>Download Deep Space Banana and test your defense game skills as an outer space conqueror in this entertaining strategy game. Expand your space station and embark on exciting missions. <br/>Get started now!", "metacritic": null, "released": "2020-03-04", "tba": false, "updated": "2020-04-17T03:13:00", "background_image": "https://media.rawg.io/media/screenshots/e21/e217edbad1f47731849de9e239273818.jpg", "website": "https://company.upjers.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Upjers", "Jo-Mei"], "genres": ["Strategy", "Casual"], "publishers": ["Upjers"], "esrb_rating": null}