{"id": 428595, "slug": "takenoko", "name": "Takenoko", "name_original": "Takenoko", "description": "PLANT, IRRIGATE, AND GROW BAMBOO… BUT WILL YOU BE ABLE TO SATISFY THE APPETITE OF THE GREEDY IMPERIAL PANDA?<br/><br/>The Japanese emperor has called the very best gardeners in the empire to compete for the complicated task of caring for his sacred panda. Only the gardener with the very best plots of bamboo will be able to satisfy this picky animal!<br/><br/>Plant a bamboo forest around the emperor’s pond. Cultivate and irrigate your plots to grow all the types of bamboo the panda loves. <br/>To beat your rivals, make improvements to your plots: build irrigation channels or add fertilizer to accelerate the growth of your bamboo… and pray that the weather is favorable!<br/><br/>The player who completes the most objectives wins the game. Only one gardener can win the emperor’s favor… So grab a rake!<br/><br/><br/>Characteristics:<br/>-\tSimple and tactical gameplay adapted from the acclaimed board game, Takenoko, by Antoine Bauza.<br/>-\t1 to 4 players<br/>-\tPlay in single-player mode against the computer or your friends and the rest of the world in local or online multi-player!<br/>-\tChibis: an extension pack with all new objectives, new plots of land, and most importantly, Miss Panda and her babies. Available for purchase in the game shop!<br/><br/><br/><br/>Original board game awards:<br/>- 2013 Ludoteca Ideale official selection<br/>- 2013 winner of Games Magazine best new family game<br/>- 2012 Tric Trac nomination<br/>- 2012 winner of Lys public choice award<br/>- 2012 nomination for JoTa best family board game<br/>- 2012 nomination for Golden Geek best family board game<br/>- 2012 nomination for the Golden Geek best kids’ board game<br/>- 2012 winner of As d’Or-Jeu de l’Année<br/><br/><br/><br/>Languages available: French, English, German, Spanish and Italian.", "metacritic": null, "released": "2019-11-27", "tba": false, "updated": "2023-01-06T18:22:28", "background_image": "https://media.rawg.io/media/screenshots/d53/d53e7e777b043a3614d5c1c2127681aa.jpg", "website": "http://www.asmodee-digital.com/en/takenoko/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 17, "beaten": 1, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Asmodee Digital"], "genres": ["Strategy", "Casual"], "publishers": ["Asmodee Digital"], "esrb_rating": null}