{"id": 428612, "slug": "chronostation", "name": "Chronostation", "name_original": "Chronostation", "description": "You are a commander of a space station on an asteroid mining mission somewhere in deep space. From one of the asteroids you dig out parts of an ancient alien spaceship. An accident happens after extracting and moving them on board of your station and you find yourself transported into unknown place and time. Now you are trying to understand where you are and how to get back home. Fortunately, asteroids around you are rich with crystals containing chroniton particles which are crucial for your return. But soon you discover that you are not alone, and your station is under attack from ships of an unknown alien race. Attempts at communication fail so you are forced to defend yourself while you are trying to resolve your current situation. You hope that if you mine enough resources, you'll be able to improve your chances by research, destroy the enemy, and finally return home.<br/>\n<br/>\r\nEnemy ships of various types will swarm your station in 100 waves.<br/>\n<br/>\r\nYou can build various defensive towers, energy grid and other types of space structures to aid in your defense.<br/>\n<br/>\r\nWith research you can improve quality of your space structures and increase your chances of survival.<br/>\n<br/>\r\nEven if your space station appears to be destroyed many times, it is not actually destroyed but only returns in time and space because of the anomaly caused by the alien ship parts. A part of your mined resources remains and is converted into research resources through chroniton particles.<br/>\n<br/>\r\nGreat adaptive music from talented composer Marek Hradil aka \"Mad Maverick\" contributes to the game's atmosphere.<br/>\n<br/>\r\nThe adaptive music has been implemented using welove.audio Engine.", "metacritic": null, "released": "2020-03-02", "tba": false, "updated": "2020-04-17T03:36:30", "background_image": "https://media.rawg.io/media/screenshots/e47/e4713596613556b4b89e960d17be3660.jpg", "website": "https://www.facebook.com/Chronostationgame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Manfromstars"], "genres": ["Strategy", "Indie"], "publishers": ["Manfromstars"], "esrb_rating": null}