{"id": 428646, "slug": "12-labours-of-hercules-x-greed-for-speed", "name": "12 Labours of Hercules X: Greed for Speed", "name_original": "12 Labours of Hercules X: Greed for Speed", "description": "The newest time-management strategy game from JetDogs! Think strategically, solve numerous puzzles, manage resources and travel to new locations - Hercules and his crew will take you on the first supersonic quest through Ancient Greece!<br/><br/><br/><br/>Hot summer day in a beautiful garden was going to be relaxing and peaceful as ever…until a powerful wave tore down everything in its path! What caused it? What kind of creature can move so fast that even the hero's sharp eyes can't see it? <br/><br/><br/><br/>Hercules knows that he can't let the beast roam around and bring trouble to the land, so he decides to go after the creature. But he needs to catch up to it first! <br/><br/><br/><br/>Join Hercules on the ultrasonic quest through Ancient Greece. <br/><br/><br/><br/>Face the unexpected consequences of brewing a magic potion, discover secret boosts, travel to snowy mountain peaks and warm sea shores: everything is <br/>possible when you are moving at the speed of light! <br/>No time to lose - hurry up to play Hercules X: Greed for Speed! <br/><br/><br/><br/><ul><li> Amazing Time Management game!<br/></li><li> Interactive guide.<br/></li><li> Wallpapers.<br/></li><li> Accompany Hercules during his fastest labour!<br/></li><li> Grow stronger and faster with boost pills.<br/></li><li> Find out how the gods increase their speed.<br/></li><li> Explore sub-levels, bonus levels and super bonus levels.<br/></li><li> Stunning full HD graphics.<br/></li><li> Easy to learn, hard to master: many ways to complete a level.</li></ul>", "metacritic": null, "released": "2020-04-22", "tba": false, "updated": "2020-04-17T03:58:33", "background_image": "https://media.rawg.io/media/screenshots/9dd/9ddeba7e6c41d9183aafd2010f983229.jpg", "website": "http://jetdogs.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 37, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 11, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jetdogs Studios", "Zoom Out Games"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Jetdogs Studios"], "esrb_rating": null}