{"id": 428614, "slug": "shadow-arena", "name": "Shadow Arena", "name_original": "Shadow Arena", "description": "Countless will fall and only one will ultimately rise victorious in the Shadow Arena.<br/>In battles that pit 40 heroes against each other in fierce, action-packed showdowns, do you have what it takes to defeat your opponents and become the final survivor, the sole champion?<h3>A Dynamic Fantasy Arena Fighter</h3>Experience a new style of PVP action in this fast-paced fantasy arena fighter where the most battle-hardened characters from the Black Desert universe compete against each other until only one is left standing on the battlefield. Playing as one of these heroes, your fight to survive the Shadow Arena will be intense, with opponents coming at you from every direction and the dark fog looming on all sides, threatening to swallow everything in its path.<br/><h3>The Means to Your End</h3>Will you rain steel on your competitors with swords and weapons, or hit them with a barrage of spells? Will you outplay your opponents in direct combat or outmaneuver them with other strategies? How will you survive the arena's giant dragon and the Ancient Ruins Guardians?<br/><br/>Regardless of the choices and moves you make, in the end, there is only one rule in the Shadow Arena: fight until you are the last one standing!<br/><br/><br/>So enter the battlefield shrouded in darkness, where the strong eat the weak.<br/>Because there's no need for the weak.", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-23T13:29:10", "background_image": "https://media.rawg.io/media/screenshots/afb/afb64cefd58d1e5ea452cddbf9a2ef7f.jpg", "website": "https://shadowarena.pearlabyss.com/Main/Index", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 283, "toplay": 1, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 523, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Pearl Abyss"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Pearl Abyss"], "esrb_rating": null}