{"id": 428684, "slug": "acolony", "name": "AColony", "name_original": "AColony", "description": "AColony is a base building and colony simulation game. You start with nothing more than a few colonists and some items placed in an unknown world and the story begins.<h3>Build A Colony</h3><br/>With enough resources your colonists can build houses in various ways to keep them warm and safe. You can construct multi-floor buildings as well as a base that extends into the mountains. Furthermore there is a huge selection of diverse furniture and tools to customize your rooms.<br/><br/><h3>Electricity</h3><br/>Every modern colony needs electricity.<br/>If your colonists have researched the required technology, they are able to build power generators, batteries, and a lot of various machines.<br/>To connect them they can build cables across the entire world, but also vertical on the walls of buildings to connect elements of different levels.<br/><br/><h3>Research Technologies</h3><br/>An important task for your colonists is to research new technologies to unlock more advanced weapons, items and construction elements.<br/>When certain levels in the science tree are reached, the colonists can research in different science sectors which is required to achieve higher technologies.<br/><br/><h3>Unique colonists</h3><br/>Each colonist is an individual person with its own mood, needs and mental state.<br/>If one of them is unhappy that will have an negative impact on the productivity and control.<br/>In addition every colonist has 3 mental attributes - empathy, intelligence and standards<br/>- these attributes can happen as a result of colonists refusing to do specific jobs<br/>but it can also affect the interaction with other colonists.<br/><br/><h3>Defend Your Colony</h3><br/>The world has a lot to offer - but that also includes dangers.<br/>There are not only people from other colonies with a wide range of weapons but nature has some tricks too. Weather, deadly diseases, and more.<br/>There are a lot of ways which can lead to the death of your colonists.<br/><br/><h3>Play Together</h3><br/>You don't have to explore the world alone - you can also play with a friend in co-op.<br/>If you do so this has the following impacts:<br/><br/><ul><li> You get some special tools, like a power cable connector to share powersystems.<br/></li><li> Interactions and relationships between the colonists of different players.<br/></li><li> Enemies and events will be adjusted accordingly.</li></ul><br/><h3>General Features</h3><br/><br/><ul><li> Creative building over multiple levels<br/></li><li> Various furniture to customize rooms<br/></li><li> Electricity system with producers, batteries, consumers &amp; switches<br/></li><li> Gathering resources and crafting items<br/></li><li> Large selection of weapons<br/></li><li> Static weapons like turrets &amp; artillery<br/></li><li> Online co-op<br/></li><li> Unique colonists with moods and needs<br/></li><li> Injury and disease system for colonists<br/></li><li> Technologies to research via a technology tree<br/></li><li> Weather + day &amp; night cycle<br/></li><li> Special events to conquer</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T04:18:35", "background_image": "https://media.rawg.io/media/screenshots/d9d/d9dc159714165dd8d990e02ac32aab0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZeroTris"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["ZeroTris"], "esrb_rating": null}