{"id": 428722, "slug": "the-haunting-2", "name": "The Haunting", "name_original": "The Haunting", "description": "<strong>EARLY ACCESS NOTE:</strong><br/>Content updates every 1 - 2 weeks.<br/><br/>Jim Walker crashes into a tree and gets lost in an unknown woods in where he discovers various hauntings from the past. Fight evil ghosts and demons using a camera, solve puzzles and experience a cinematic first person horror game in AAA graphics and audio set in a open world environment.<br/><br/>Inspired by a Japanese horror game and transformed into  a western style. Powered by next-gen technology and workflows, The Haunting will deliver visual details of photorealistic quality.<br/><br/>*AAA graphics and audio that deliver a rich AAA experience<br/>*Open world experience<br/>*Non - Linear storyline<br/>*Fight ghosts and demons using a camera<br/>*Solve puzzles<br/>*A immersive cinematic horror experience<br/>*Full controller support<br/><br/><br/><br/><strong>Health Warning!</strong><br/>This game contains flashing images.<br/><br/>WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES<br/>A very small percentage of individuals may experience epileptic seizures or blackouts when exposed to certain light patterns or flashing lights. Exposure to certain patterns or backgrounds on a television screen or when playing video games may trigger epileptic seizures or blackouts in these individuals. These conditions may trigger previously undetected epileptic symptoms or seizures in persons who have no history of prior seizures or epilepsy. If you, or anyone in your family has an epileptic condition or has had seizures of any kind, consult your physician before playing.", "metacritic": null, "released": "2020-04-30", "tba": false, "updated": "2020-04-17T04:41:04", "background_image": "https://media.rawg.io/media/screenshots/8b4/8b4f60e74aca072c95d33d984641f454.jpg", "website": "http://www.blueboxgamestudios.com/thehaunting", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BLUE BOX Game Studios"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["BLUE BOX Game Studios"], "esrb_rating": null}