{"id": 428779, "slug": "witching-tower-heroes", "name": "Witching Tower: Heroes", "name_original": "Witching Tower: Heroes", "description": "Witching Tower: Heroes is a fantasy action game developed exclusively for VR.<br/><br/>You are a Defender from Citadel of Light, sent to a war-torn kingdom to deal with undead hordes from the Dark Tower. With four weapon types, each with a unique fighting style, you take on missions to cleanse the land from foul creatures. You will fight against undead nobles, soldiers, wardens, sorcerers and their hideous minions. Long dead, they will haunt you, attack you, fiddle with your plans and tactics; they will do everything they can to protect their Necromancer Queen.<br/><br/>Game on and have fun! Relentless arcade action suitable even for people new to VR!<h3>Features:</h3><br/><strong>You own fighting style.</strong><br/><ul><li>What will you pick? Good old melee, archery, firearms or a powerful drill that shreds skeleton enemies into pieces? How about a staff of Fire and Light, capable of reigning fire and brimstone on the battlefield? Do you like crushing the undead up close and personal or do you like keeping your distance and supporting the team? There’s always a way to experiment with weapons or even the surroundings!</li></ul><br/><strong>Hordes of undead and humongous bosses!</strong><br/><ul><li>Every enemy is special, with its own unique attack patterns, behaviour and weak points. Foul, unnerving, disgusting undead hordes will pursue you with unrelenting intent to destroy everything in their path!</li></ul><br/><strong>Unique missions.</strong><br/><ul><li>Protect, destroy, chase and, most importantly, survive under the onslaught of undead hordes!</li></ul><br/><strong>Claim your title as a true Hero!</strong><br/><ul><li>Acquire points in combat to become the best on the global leaderboard. Show everyone that you’re worthy of fame of being a Hero!</li></ul><br/><strong>Immersive environment and atmosphere.</strong><br/><ul><li>Realistic textures, beautiful moody lighting, special effects and VR magic bring life to gothic architecture and let you immerse into the world of dark fantasy.</li></ul><br/><strong>Pick your control type.</strong><br/><ul><li>Locomotion and teleport movement options are available. Are you right-handed or left-handed? Doesn’t matter, you can play however you like.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T05:32:58", "background_image": "https://media.rawg.io/media/screenshots/b0c/b0c262e1a3860c1fb88c9da4ec7cc841.jpg", "website": "http://dailymagic.info/wt/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daily Magic Productions"], "genres": ["Action", "Indie"], "publishers": ["Daily Magic Productions"], "esrb_rating": null}