{"id": 428792, "slug": "the-rule-of-land-pioneers", "name": "The Rule of Land: Pioneers", "name_original": "The Rule of Land: Pioneers", "description": "This is a survival game.<br/>The coronal explosion destroyed all the electronic equipment of human beings and caused serious radiation. Human beings had to move into underground shelters. Fifty years later, it was thought that the disaster was over and that the surface could survive. So they organized a survival competition back to the surface. A group of brave pioneers took part in the surface survival competition. You are one of them.<br/><br/><br/><br/>The game has a real survival experience, restore a large number of real wilderness survival details!<br/><br/>In the game, players can hunt, collect, build, synthesize, plant, cook, mine, smelt, make wine, trade, explore, take in refugees, raise animals, treat diseases, maintain ecological balance and fight against other virtual characters!<br/><br/><br/><br/><ul><li>You have to deal with hunger, disease, bad weather and other dangers.</li></ul><ul><li>You should not only survive, but also defeat other survivors!</li></ul><ul><li>There are multiple game modes, characters and survival areas to choose from.</li></ul><ul><li>Rich random events ensure that each game has a different experience.</li></ul><ul><li>Rich strategic play, the good or bad survival depends on your survival skills.</li></ul><ul><li>Learning the real knowledge of survival in the field.</li></ul><ul><li>Excellent art, the game achieved a good rendering effect, distinctive style.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T05:41:16", "background_image": "https://media.rawg.io/media/screenshots/64b/64bf583b22d53e0ddc0694018a0597ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Horgee Games"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Gamera Game"], "esrb_rating": null}