{"id": 428763, "slug": "redneck-ed-astro-monsters-show", "name": "Redneck Ed: Astro Monsters Show", "name_original": "Redneck Ed: Astro Monsters Show", "description": "<strong>Redneck Ed: Astro Monsters Show</strong> is an energetic, colorful arcade-style beat ‘em up that follows the misadventures of Ed, a simple mechanic, in the world of intergalactic show business. Explore the behind-the-scenes inner workings of the galactic gladiator tournament, solve mysteries, and earn fame among the alien masses, all to get Ed's stolen face back!<br/><br/><br/><strong>15 levels of total chaos:</strong><br/>A riot of colors in a whimsical world populated by aliens that need to be seen to be believed. Inspired by timeless movies and classical games, the levels contain tons of Easter eggs, so a-hunting Ed will go!<br/><br/><br/><strong>Maniacal bosses:</strong><br/>Don't ever think about stopping, not even for a second! Gotta keep the producers happy, lest they axe your contract together with your head. Attack to the sick beat of the killer soundtrack as you take on impossible enemies. If it bleeds – Ed can bash its skull in with a wrench!<br/><br/><br/><strong>A real thriller:</strong><br/>You're an actor swept up in the cutthroat world of show business. Killing monsters, conquering bosses, going on life-threatening adventures across awesome outlandish levels — all of this is still just the wrapping. Dig deeper and uncover the twisted plot behind all the glitter and gorgeous visuals. How the final episode of the show will play out is entirely up to you!<br/><br/><br/><strong>А rip-roaring beat'em up with bright, offbeat art!</strong><br/>Face off against endless hordes of cosmic abominations, solve puzzles, and knock over a few glasses at a bar, looking for allies who would help you find the answers to the mysteries that plague the intergalactic entertainment industry.<br/><br/><br/>Lights! Camera! Show 'em what you got!", "metacritic": null, "released": "2020-06-25", "tba": false, "updated": "2022-09-04T13:10:50", "background_image": "https://media.rawg.io/media/screenshots/452/4520ed45b7d115deb55795b83507a53a.jpg", "website": "https://store.101xp.com/redneck/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 39, "toplay": 2}, "playtime": 1, "achievements_count": 25, "ratings_count": 3, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Redneck Ed", "Rustic Funtastic"], "genres": ["Action", "Adventure", "Fighting", "Indie", "Platformer"], "publishers": ["101XP"], "esrb_rating": null}