{"id": 428790, "slug": "fotomuseo-3d", "name": "FotoMuseo 3D", "name_original": "FotoMuseo 3D", "description": "<strong>What happens when you are a photographer and your dream is the exposing a part of your work in a gallery?</strong><br/>Well, you end up building it yourself virtually and sharing it with the world. FotoMuseo 3D is one of the customizable Games (AIM) with your photos on demand in the catalog at <strong>JonatanFoto Catalog</strong>.<br/><br/>Since I was a little boy I have always dreamed of being able to exhibit/share my works in a public place such as a gallery, a venue, an event, etc. And now as an adult and <strong>photographer</strong> even more if possible. That people can visit me, see and value the result of my work created through the lens of my camera. Because achieving this when you are nobody, is very complicated. For this reason I have taken advantage of my passion for <strong>Multimedia Development</strong> to create my own virtual PhotoMuseum and be able to carry out the Expo on it.<br/><br/><br/><strong>What is the Exhibition of the 365 Nostalgic Items Project?</strong><br/>It's a sample of my first <strong>Photographic Project</strong> when I started the adventure of <strong>JonatanFoto</strong>. A daily photo-project worked for 1 year that allowed me to learn/grow in an exponential way.<h3>What future do I want to apply to FotoMuseo 3D here on Steam?</h3>I want to take advantage of this virtual environment as a tool, to carry out different EXPOS over time. That the person who purchases his copy of the <strong>FotoMuseo 3D</strong> can view them for free as they are published. Right now the PhotoMuseum has been inaugurated with the Expo of <strong>Project 365 Nostalgic Items.</strong><br/>But, <strong>what New Expos will I be able to present over time?</strong> Stay with me to discover them...<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T05:40:01", "background_image": "https://media.rawg.io/media/screenshots/260/2606fe9e8fb889fd4496a9fe7260b8ba.jpg", "website": "http://www.variedalia.com/search/label/FotoMuseo%203D", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Russell Variedalia"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["JonatanFoto"], "esrb_rating": null}