{"id": 428755, "slug": "love-sex-second-base", "name": "Love & Sex: Second Base", "name_original": "Love & Sex: Second Base", "description": "<h3>Story</h3><strong>Mike </strong>is a young code monkey in a big company, even surrounded with beautiful girls his love life is in disarray.<br/>His high school sweetheart cheated on him and his latest flame is dating on of his friends.<br/>Will you be able to help him find love and avoid the pitfalls of dating life or will he end up alone and unhappy?<br/><br/><strong>Bree </strong>is a college freshman, penniless and a bit socially awkward.<br/>Help her find a job and succeed in her studies to become a successful woman or lead her down a dark path of drugs and devauchery.<h3>Description</h3><strong>Love &amp; Sex: Second Base</strong> is a free roaming dating sim where a geeky guy or girl (hopefully you) gets to be be roommate with two very hot people and meet plenty of others in their daily life.<br/>The player has the choice of taking on the role of either a guy or a girl and meet a whole cast of unique and memorable characters along the way.<br/><br/>The aim of the game is, bascially, to get lucky with the partner of your choice, meeting, dating and (of course) getting it on in a host of different places, situations and positions.<br/>You can keep it casual, ask for their hand in marriage and even get them pregnant, while being either the perfect partner, or cheating on them whenever the chance arises.<br/>To do this, you'll need to build your stats, know your conquests and play the game like a pro.<br/>The game is structured around a year of 4 months/seasons (summer, autumn, spring, winter) of 30 days with holidays, the protagonist and prospective dates have a birthday and can react accordingly with the calendar.<br/><br/>But remember, they can react to each other and if the player is two timing he can get in trouble, the game has a date and a phone systems so you can invite girls and guys to dates, ask their numbers and send them dirty texts.<br/><br/>Mike (our hero) and Bree (our heroine) live in a small house and work boring jobs, but during the course of the game they have the possibility to improve their lot in life.<br/><br/>Each girl/guy has his/her own schedule and will be in different places at different times, dressed differently and choose different activities, when the hero meets a girl/guy he/she can talk to her/him, give her/him gifts, compliment her/him, ask her/him on dates, ask her/his number or her/his birthday...<br/><br/>Basically, their lives (and love lives) are yours to control!<h3>Features</h3><ul><li>Date, get lucky &amp; get married<br/></li><li>Partial voice acting<br/></li><li>Seasonal and day/night cycles<br/></li><li>Pregnancy &amp; birth control<br/></li><li>Needs and stats system<br/></li><li>Harem endings</li></ul><h3>Content</h3><ul><li>Close to 1 million words of story<br/></li><li>500+ events<br/></li><li>200+ activities <br/></li><li>100+ full screen CG<br/></li><li>50+ items<br/></li><li>50+ locations<br/></li><li>15+ dateable characters to get lucky with<br/></li><li>10+ dating spots</li></ul>", "metacritic": null, "released": "2020-03-27", "tba": false, "updated": "2024-02-05T20:11:12", "background_image": "https://media.rawg.io/media/screenshots/e31/e314fe0ef664d104ca8f7c8ed93b69a3.jpg", "website": "", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 19, "toplay": 3}, "playtime": 6, "achievements_count": 38, "ratings_count": 5, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["Andrealphus Games"], "genres": ["Casual"], "publishers": ["Andrealphus Games"], "esrb_rating": null}