{"id": 428768, "slug": "moe-moe-world-war-ii-3-deluxe-edition-meng-meng-2c", "name": "Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版", "name_original": "Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版", "description": "《Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版 》Developed by SystemSoft Alpha,《Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版 》 is a classic beauty strategic game sequel authorized by Interwise Media. Now available on Steam.<br/>\n<br/>\r\n《Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版》 contains:  <br/>\r\nMain Program <br/>\r\nContain:<br/>\r\nCharacter-specific graphics x 56 pictures<br/>\r\nGame Art Picture x 187 pictures<br/>\r\nMemorial Wallpaper x 3 pictures<br/>\r\nBismarck Special Shape<br/>\r\n162 pages Digital Art Set<br/>\r\nCollector's Edition 3D Module<br/>\r\nOriginal Digital Music x 10<br/>\r\nSpecial art cover x 10 covers<br/>\n<br/>\r\n《Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版》 is a game that revolves around weaponry being humanized. During World War II, all the commonly used weaponry during that period of time are being represented by \"Cute Girls\". The story revolves around a female humanoid weapon named \"Girls of Steel\"; it was told through three different story-lines: Japan, America, and German. Players can control different characters as a commander, planning and giving direct orders such as using ultimate abilities and fight their way to victory.<br/>\n<br/>\r\nThroughout the course of the game, players can experience ADV mode and have nice conversations with girls, SLG mode was formed by fancy and flashy strategies, and you also can  interact with girls by the \"repairing parts\" game mechanic.<br/>\n<br/>\r\nPlayers can have intimate interactions with injured Girls of Steel by the repairing mechanic in the game; moreover, the \"weapon transfer\" system allows each characters to have up to three weapons to choose from. Also there is a new system called \"Core Equipment\" In this game.  Only Girls of Steel have the \"core\". The Girls of Steel can split into two genres: Native Girls of Steel who already has a \"Core\" during development and Nurtured Girls of Steel who obtained their \"Core\" due to human transformation. According to the official information, Girls of Steel can equip \"Core\" on them; Once equipping the \"Core\" their attributes will become stronger. Players can also remove or switch the \"core\" to enhance their characters easily.<br/>\n<br/>\r\nSuper evolution is a feature in《Moe Moe World War II-3 Deluxe Edition 萌萌２次大戰（略）３豪華限定版》. As a Girl of Steel's heart grows, their appearance also evolves. And a super-evolved girl of steel also come with super gorgeous arms.<br/>\n<br/>\r\nDisclaimer: The content of the disclaimer statement to make by Interwise Multimedia Corp.(“Interwise”) on Steam that the characters are all over 18 years old.<br/>\r\n免責聲明: 由Interwise Multimedia Corp.( “Interwise”) 在Steam上發布的免責聲明內容，所有角色人物已超過18歲。<br/>\r\n免责声明: 由Interwise Multimedia Corp.( “Interwise”) 在Steam上发布的免责声明内容，所有角色人物已超过18岁。", "metacritic": null, "released": "2020-02-13", "tba": false, "updated": "2020-04-17T05:25:11", "background_image": "https://media.rawg.io/media/screenshots/83e/83e301920d2020259cc3857f04c04150.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SystemSoft Alpha"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["Interwise Multimedia"], "esrb_rating": null}