{"id": 428782, "slug": "spiritual-calling-vr", "name": "Spiritual Calling VR", "name_original": "Spiritual Calling VR", "description": "A well-known detective-psychic receives a diary of a girl who studied at a boarding school. She died in strange circumstances and school was closed in a hurry. The place quickly became notorious. Ominous sounds are often heard from there and carcasses of animals found in the vicinity. People talk about spirits and poltergeists and bypass the building. <br/><br/>A letter was attached to the thick diary envelope asking him to save the soul of the granddaughter, possessed by a demon. The hero would have treated this letter as delirium of a crazy old woman, if not for a diary with evidence that the girl and her friends performed a mystical ritual. Intrigued by this story, the hero undertakes to investigate the mysterious events of the past.<br/><br/>In search of truth, you as a practicing medium have to to explore the school to demystify what happed there. Use your mystical sight and enchanted artifacts to look into the other world for answers.<br/><br/><ul><li>Strange twists and turns will leave you uncertain<br/></li><li>Explore the depths of madness within abandoned school<br/></li><li>Put puzzles to solve a main riddle</li></ul><br/><ul><li>Explore the environment to uncover the details of the tragic past<br/></li><li>Uncover hiding details using your spiritual powers<br/></li><li>Search through the abandoned school and see the story and secrets unfold</li></ul><br/><ul><li>Hallucinating and delirious vision appers around<br/></li><li>Despite of the paranormal basis of surroundings - your and your decisions are real<br/></li><li>Each event affect further story and endings</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T05:34:41", "background_image": "https://media.rawg.io/media/screenshots/c87/c87b42525ccff84392b8ef83cab01e65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlackRat", "DGMA"], "genres": ["Adventure", "Indie"], "publishers": ["DGMA"], "esrb_rating": null}