{"id": 428757, "slug": "iron-guard-vr", "name": "IRON GUARD VR", "name_original": "IRON GUARD VR", "description": "IRON GUARD VR is a sci-fi tower defense game made in the spirit of classic RTS games. Lives of the surviving crew members are in your hands . Find out why the terraformer robots have rebelled and help evacuate your crew from an unknown planet, where survival is the new frontier.<br/><br/><strong>DESCRIPTION: </strong><br/><br/>The year is 2232 A.D and the crew of “Avalon” has crash landed on the planet Akris, while trying to investigate why the earlier drone ship carrying the AI terraformer bots lost contact. Fortunately, the planet is habitable because the terraformer ship and it’s AI bots had done their job to make “Akris” habitable and sustainable for life.<br/>You are 1st officer Graves. It is up to you to protect the lives of the surviving crew. Defend all and secure resources from the onslaught of the out-of-control terraformer bots. <br/>Use the engineering drone, erect defensive turrets, mine various structures and collect resources. You need to survive at all costs to find out what caused the Terraformers to go rogue and not complete the terraformation. <br/><br/><strong>FEATURES:</strong><br/><br/>• A complete 360 degrees immersive gameplay using best in class VR technology.<br/><br/>• Different game modes and styles.<br/><br/>• 5 unique turrets and other buildings with few levels of upgrades.<br/><br/>• Possibility of non-linear equipment upgrade between missions.<br/><br/>• Arcade style shooting from a drone using conventional or super weapons.<br/><br/>• A unique storyline revealed through cutscenes and dialogues.<br/><br/>• Amazing voice acting and music which adds to the gameplay in the true spirit classic RTS games.<br/><br/>• Beautiful and stylized graphics with mysterious atmospheres of an unknown planet, showcasing various biomes where battles ensue.", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T05:13:38", "background_image": "https://media.rawg.io/media/screenshots/e63/e6374d8ba3ac8674196103073e4a3cf4.jpg", "website": "https://xlabdigital.com/portfolio/iron-guard/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xlab Digital"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Xlab Digital"], "esrb_rating": null}