{"id": 428881, "slug": "secrets-of-moon-island", "name": "Secrets of Moon Island", "name_original": "Secrets of Moon Island", "description": "Secrets of Moon Island is a simple indie, open world swashbuckling rpg/adventure type of game.<br/><br/>In this game you are guiding your two main heroes to complete their tasks.<br/><br/>While you explore the world with one hero, in order to find out how to break the islands curse and free your sister, your other hero will likely be defending the main village.<br/><br/>Of course you will also try to possibly gather any supporters or equipment with your exploring hero to help your defending hero in its task.<br/><br/>You can play this game top down or in third person, whichever style suits you best.<h3>At the moment you can expect the following features:</h3><ul><li> Search for legendary weapons and armor to help you in your quest.<br/></li><li> Gather help for your main heroes by making friends with some creatures or by crafting others. (You can craft little \"helpers\" to help you right off the bat).<br/></li><li> Fight your enemies either top down or in direct control of your main hero.<br/></li><li> Direct control combat comes in two variations, one more traditional with pressing buttons for performing attacks or blocking, whereas the other one gives you a more \"direct\" control of your sword.<br/></li><li>Non target based combat system: <br/>You do not need to focus on an enemy in order to hit them in third person or in fencer mode. If you hit your enemy, you hit your enemy, it is as simple as that. <br/></li><li> Experience and a very simple level up system. You don't need to spend hours learning tech trees, you literally just increase some attributes. <br/>All creatures you control can gain experience and level up, not only the main heroes!<br/></li><li>Explore the small island without hand holding mechanics such as quest tracking lines, by orienting yourself solely on landmarks and your map. <br/>Note: There is a per default disabled option in settings that allows you to get a \"your position\" marker on the map.</li></ul><h3>Is this a game for you?</h3><br/>Please bear in mind that this is an indie game, and that, whilst I am very passionate about this project, I am a solo developer, and this, by its very nature, brings about some natural limitations.<br/><br/>Therefore:<br/><ul><li>  Do you enjoy discovering new indie games? Do you like casual exploring without quest tracking lines and other hand holding mechanics? Are you open to try out non streamlined UI, movement and combat systems and have no high expectations regarding graphics? <br/>Then this game is more than likely for you!<br/></li><li>  Do you want a nearly flawless, streamlined AAA game off the shelf, and don't enjoy thinking outside the box? <br/>Then this game is probably not something you would enjoy.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T06:36:58", "background_image": "https://media.rawg.io/media/screenshots/f11/f115a5cd7ac2c500f5ccb45bde62445b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StarlightCoder"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["StarlightCoder"], "esrb_rating": null}