{"id": 428855, "slug": "codename-terranova", "name": "Codename: Terranova", "name_original": "Codename: Terranova", "description": "<h3>Agent, do you read me?</h3>Taking place of an operating agent is canonical in videogames (think of James Bond to Sam Fisher, or Solid Snake). <br/>But without support they would probably have been dead and buried long ago. This time <strong>the Operator</strong> is part of the game!<br/><strong><h3>Co-op communication</h3></strong>Collaboration and communication are fundamental in <strong>Codename: Terranova</strong>! <br/>Your team will have to show that they are a perfect match to overcome any adversity.<br/>The <strong>on field Agent </strong>must be ready to act, but only <strong>the Operations Center</strong> (a.k.a. <strong>the Operator</strong>) is able to guide him to the end, and surprises are around the corner. Each level is a challenge that tests the cooperation between the players.<h3>Connect as a true spy movie</h3>Each player will have its own platform: <strong>the Agent </strong> will be ready to act and <strong>the Operator</strong> will access the control system via PC or by app allowing him to keep the train control system in the palm of his hand! What you need is just an internet connection.<h3>New way to play</h3>You can use our app on any platform. We use <strong>Progressive Web App</strong> technology so you can call a friend and make him connect in few seconds through any smartphone, tablet or computer.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T06:20:51", "background_image": "https://media.rawg.io/media/screenshots/016/016800ec7723a75d6285a855ccba33a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 47, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ACGames"], "genres": ["Action", "Indie"], "publishers": ["ACGames"], "esrb_rating": null}