{"id": 428859, "slug": "suchart", "name": "SuchArt!", "name_original": "SuchArt!", "description": "SuchArt! is a game featuring you being such an amazing artist. Really you rock, your latest DNA test is very positive about it. <br/><br/>Now please pick a brush or a flamethrower and express your boundless creativity across your brand new studio, up board the International Space City. And don’t forget: the only limit is the size of your brush.<br/><br/>As down on Earth the robots are revolting and the ugly (yet somehow cute) Crabuxes covet the planet’s salt water, only you can decide what to paint on your next canvas…<h3>Key features:</h3><ul><li>Paint everywhere. Wait, how did you mess up your studio that much that fast?<br/></li><li>Waw! Did those red and blue pigments really mix into this elegant yet powerful purple?<br/></li><li>Hey, this elegant yet powerful purple subtly dried over the last minutes. How exciting!<br/></li><li>Sell your art! Sell your paintings at the marketplace, or fulfill all your clients desires through hopefully well paid commissions. Or the promise of a gift. Or some exposure, the best of all currencies out there.<br/></li><li>Expose your art! Expose your delicately crafted paintings inside your virtual gallery. <br/></li><li>Get more tools! Don’t let this boring bland brush get in the way of your creativity. You want a flamethrower? Buy a flameth… wait, this thing is expansive!<br/></li><li>Get famous! Singing is overrated. In 2130, painting is the way to go.<br/></li><li>They say down on Earth the robots are revolting and the Crabuxes covet the planet’s salt water. But surely that’s none of your business. Or, is it?</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-08T06:49:38", "background_image": "https://media.rawg.io/media/screenshots/3e4/3e4821676cd1432f5e5df5752bcb743d.jpg", "website": "", "rating": 3.44, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 174, "beaten": 2, "toplay": 4, "dropped": 5, "playing": 2}, "playtime": 4, "achievements_count": 27, "ratings_count": 8, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Voolgi"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Voolgi"], "esrb_rating": null}