{"id": 428980, "slug": "the-evil-within-season-pass", "name": "The Evil Within: Season Pass", "name_original": "The Evil Within: Season Pass", "description": "<p>Please note that this pack contains the following:<br/>\n- The Evil Within: The Assignment DLC<br/>\n- The Evil Within: The Consequence DLC<br/>\n- The Evil Within: The Executioner DLC</p>\n\nThe Evil Within: The Consequence\nExperience survival horror from a new perspective in The Evil Within: The Consequence. This is the final installment of a two-part, story driven experience where players take on the role of detective Juli Kidman, Sebastian Castellanos’ mysterious partner, in a concurrent story that looks to answer some of the questions surrounding her whereabouts during The Evil Within. Along the way she will encounter disturbing new enemies, discover new mysteries, and uncover new horrors. The Consequence give fans of The Evil Within the perfect opportunity to continue discovering detective Kidman’s hidden motivations and her mysterious connection to Mobius, the shadowy group thought to be behind the gruesome events of The Evil Within.\n<br/><br/>\n<br/>\n\nThe Evil Within: The Assignment\nExperience survival horror from a new perspective with The Evil Within: The Assignment. This is the first of a two-part, story driven experience where players take on the role of detective Juli Kidman, Sebastian Castellanos’ mysterious partner, in a concurrent story that looks to answer some of the questions surrounding her whereabouts during The Evil Within. Along the way she will encounter disturbing new enemies, discover new mysteries, and uncover new horrors. The Assignment gives fans of The Evil Within the perfect opportunity to discover detective Kidman’s hidden motivations and her mysterious connection to Mobius, the shadowy group thought to be behind the gruesome events of The Evil Within.\n<br/><br/>\n<br/>\n\nThe Evil Within: The Executioner\nExperience firsthand the powerful force that is The Keeper in The Evil Within: The Executioner. This third and final add-on for The Evil Within places players in a series of battle arenas all from the first-person perspective of The Keeper. Initially armed with The Keeper’s signature hammer, players will fight against a host of The Evil Within’s iconic villains to earn new weapons and upgrades. Set in the Manor House of the Victoriano Estate, The Executioner features first-person melee combat combined with exploration and discovery as players unearth the story of a man forced to become The Keeper.", "metacritic": null, "released": "2014-10-12", "tba": false, "updated": "2023-05-29T08:16:34", "background_image": "https://media.rawg.io/media/screenshots/102/1020cf71c34ae82b0fbd53f7dfe04c19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tango Gameworks"], "genres": [], "publishers": ["Bethesda Softworks"], "esrb_rating": null}