{"id": 428995, "slug": "idle-mafia", "name": "Idle Mafia", "name_original": "Idle Mafia", "description": "The grittiest idle mafia simulation game out there!<br/><br/>Manage insidious businesses, Gather talented Capos to carry out your bidding, and occupy new territory through any means necessary.<br/><br/> - Do what you want: Take protection fee, robbing anyone, fight on the streets... Be a benevolent leader or a ruthless crime lord. Who you steal from and what you steal is all up to you!<br/> - Make tons of money: with Casino, Gentlemens' Clubs, even set up an adult studio empire! You'll need cash businesses to keep things running smoothly.<br/> - Grow from a no-name gang into an international crime syndicate: from stealing to kidnapping, nothing is off limits unless you say so.<br/> - Expand your territory: occupy streets, cities, build your own Mafia empire. Tear down those who stand in your way, and recruit loyal followers to your cause.<br/> - Collect Capos: infamous criminals from around the world with special abilities that set them apart. Whether it's a horde of robot ninjas or luchadore accountants, become a force to be reckoned with!<br/> - Idle Cash: You're the boss here - sit back and enjoy as your loyal minions handle all the dirty work. Behind every successful fortune there is a crime!<br/><br/>--------------------<br/>Want to be a part of our community? Questions, problems, or suggestions? You can find us on:<br/>- Discord: https://discord.gg/EeXGd2B<br/>- Facebook: https://www.facebook.com/idlemafia/<br/>- YouTube: https://www.youtube.com/channel/UCEAxWTCLEYl0uOCtbcuXTYA", "metacritic": null, "released": "2020-04-13", "tba": false, "updated": "2022-10-23T21:20:48", "background_image": "https://media.rawg.io/media/screenshots/c67/c670c861b1105199bdd4d651a2c8c326.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["FunPlus"], "genres": ["Simulation"], "publishers": ["DianDian Interactive"], "esrb_rating": "Teen"}