{"id": 428934, "slug": "anime-studio-tycoon", "name": "Anime Studio Tycoon", "name_original": "Anime Studio Tycoon", "description": "Anime Studio Tycoon is a strategy and business <br/>management game. You can replay the history of anime industry by starting your own production studio in the 80s. Finish subcontracts get enough reputation and get a contract to create anime from the production committee. Create a legendary anime series and gain worldwide fans. Once you’re big enough license manga or create own story and create anime without production committee. Become the leader of the market and create your movies and distribution service.<br/>A journey through anime history<br/>Start your adventure in the 80s as a small studio. Learn more about the economy of anime industry, and get sub-contracts to gain experience.<br/><br/><strong>Create anime your way! </strong><br/>In Anime Studio Tycoon you micromanage anime development process. Take decision on different areas of production.<br/><br/><strong>Expand your company </strong><br/>Purchase new offices to support more staff. Hire staff, train them and unlock new options. Give contracts to poor countries having cheap labour.<br/><br/><strong>Make Series, OVA, Movies </strong><br/>With experience and great team, you can make your own anime’s without forming a production committee. It brings new challenges like getting TV slots to merchandising your show.<br/><br/> <strong>Economy </strong><br/>Creating an anime series is no easy task. For each anime there is one production committee which handles a different aspect of the business. In Anime Studio Tycoon we emulated complex process of real-life anime creation, you deal with merchandising and TV producers to the foreign distributor and manga publishers.<br/><strong>Features</strong><br/><ul><li>Start an anime production studio in the 80s <br/></li><li>Get a contract from the production committee to create anime.  <br/></li><li>Create your own anime based on your story or licence existing manga series. <br/></li><li>Move into bigger offices.<br/></li><li>Forge a world-class development team.<br/></li><li>Unlock achievements.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-17T07:11:10", "background_image": "https://media.rawg.io/media/screenshots/a81/a816c70804e0ed34f444e00fb06c8612.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["True Seria"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["True Seria"], "esrb_rating": null}