{"id": 428955, "slug": "an-airport-for-aliens-currently-run-by-dogs", "name": "An Airport for Aliens Currently Run by Dogs", "name_original": "An Airport for Aliens Currently Run by Dogs", "description": "<p>An Airport for Aliens Currently Run by Dogs is a first-person open-world comedy adventure game with a very long name. You and your fiancée are the last two human beings left in the universe. Dogs run airports, along with the rest of society. Deal with alien logic, travel issues, and strange stock photo dogs as you attempt to stay in touch with the person you love, when you both live your lives on the go!FEATURING Bribe Dog, the dog who loves bribes.<br />\nSecrets scattered across a universe of large, simulated airports, complete with timetables and flight cancellations.<br />\nAwkward conversations with your canine fellow passengers.<br />\nAn alien language you can translate, to discover the bad jokes dogs write when humans aren&#39;t around.<br />\nA Moth Man-themed record shop containing 20+ Moth Man-themed song parodies, because it seemed like a good idea at the time.<br />\nA cup of coffee larger than your body.<br />\nA cup of coffee larger than a building.<br />\nThe ability to vault over a Moth Man-themed record shop using a cup of coffee larger than a building.<br />\nA healthy long-distance relationship.<br />\nAn infinite number of hands that you can use to pet any dog, at any time.<br />\nI&#39;d really like to explain more, but the game is called An Airport for Aliens Currently Run by Dogs. Or, Dog Airport Game, if you&#39;re tired. It already explains everything. Any further words (and we&#39;ve used a lot) are meaningless. Pulling these sentences from the void only adds to a debt I cannot pay.<br />\nBuy my Dog Airport Game.<br />\nPlease.</p>", "metacritic": null, "released": "2021-05-25", "tba": false, "updated": "2023-10-10T16:42:05", "background_image": "https://media.rawg.io/media/screenshots/9ae/9ae86a9c86da7899ea7106999f4882f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 36, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 44, "ratings_count": 1, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Xbox One"], "developers": ["Strange Scaffold"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Strange Scaffold"], "esrb_rating": null}