{"id": 428924, "slug": "iconic-2", "name": "Iconic", "name_original": "Iconic", "description": "You are an arrow icon, navigating a 2D open world of visual communication. Free to go anywhere you like as long as you can figure out how to solve the puzzles. Discover secrets, visit landmarks, explore dungeons, cross continents, avoid destruction or fail for fun!<h3>Key Features</h3><br/><ul><li>All art, animation, and programming created by a single solo developer.<br/></li><li>A calming minimalistic art style free of noise and distraction.<br/></li><li>Explore Ruins, Dungeons, Landmarks, Villages, and more...<br/></li><li>A variety of traps, tricks, and mind-bending puzzles.<br/></li><li>An open 2D world to navigate.</li></ul><br/><h3>A World of Visual Communication:</h3><br/>Iconic features a world without text-based language, the experience is communicated directly through forms of visual display to help the player progress. Colors are used sparingly to indicate importance or to catch the eye and offer hints where the focus should be directed. The simplicity and minimalism is intentional and based on the concept of \"Lagom\" which roughly translates to \"Not too little, not too much\" in Swedish.<br/><br/>The gameplay is intended to invoke feelings of both calm and intense stress, yet let the player control the pace of progress and give freedom to discover what is available at the time and place of the players choosing.", "metacritic": null, "released": "2020-07-07", "tba": false, "updated": "2020-04-17T07:05:26", "background_image": "https://media.rawg.io/media/screenshots/db9/db981712cff2b768700e316529d5f19c.jpg", "website": "https://discord.gg/vMDzwNc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cody Rauh"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Cody Rauh"], "esrb_rating": null}