{"id": 4291, "slug": "counter-strike-global-offensive", "name": "Counter-Strike: Global Offensive", "name_original": "Counter-Strike: Global Offensive", "description": "<p>Counter-Strike is a multiplayer phenomenon in its simplicity. No complicated narratives to explain the source of the conflict, no futuristic and alien threats, but counter-terrorists against terrorists. Arena shooter at its core, CS:GO provides you with various methods of disposing enemies and reliant on cooperation within the team. During the round of the classical clash mode, you will gradually receive currency to purchase different equipment. Each player can carry a primary weapon, secondary pistol, knife and a set of grenades, which all can change the battle if wielded by the skilled player. <br />\nObjectives are clear and vary from map to map, from game mode to game mode. Stop the terrorists from planting explosives, stop the counter-terrorist from retrieving the hostages, kill everyone who isn’t you and just perform the best with.<br />\nCS:GO is one of the major cybersport discipline, which makes playing it more exciting to some players. Aside from purchasing the game, CS:GO is infamous for its loot case system, that requires players to purchase keys, in order to open said cases. Customization items consist of weapon skins, weapon stickers, and sprays that do not affect gameplay and have purely visual value to the player.</p>", "metacritic": 81, "released": "2012-08-21", "tba": false, "updated": "2024-04-21T00:51:07", "background_image": "https://media.rawg.io/media/games/736/73619bd336c894d6941d926bfd563946.jpg", "website": "http://blog.counter-strike.net/", "rating": 3.56, "rating_top": 4, "added_by_status": {"yet": 263, "owned": 12870, "beaten": 1032, "toplay": 77, "dropped": 2004, "playing": 625}, "playtime": 65, "achievements_count": 179, "ratings_count": 3455, "suggestions_count": 587, "game_series_count": 5, "reviews_count": 3490, "platforms": ["PC", "Linux", "Xbox 360", "PlayStation 3"], "developers": ["Valve Software", "Hidden Path Entertainment"], "genres": ["Shooter"], "publishers": ["Valve"], "esrb_rating": "Mature"}