{"id": 429475, "slug": "balloon-shooter-arcade-balloon-popping-game", "name": "Balloon Shooter (Arcade Balloon popping Game)", "name_original": "Balloon Shooter (Arcade Balloon popping Game)", "description": "<p>The Best Balloon Shooter game out there.<br/><br/>Balloon Shooter - an exciting Bow and Arrow shooting game, shoot the balloons to win rewards and unlock amazing powers.<br/><br/>Balloon shooter provides a challenging game play of arrow shooting and bursting balloons before they go out of your reach.<br/><br/>Though a casual game Balloon Shooter needs strategy do not a single balloon leaves your sight. Trust yourself and be the highest on the global scoreboards.<br/><br/>Do not hesitate, start throwing arrows now! you will become a master in no time.<br/><br/>----<br/>How to play Balloon Shooter:<br/>Touch the string of the Bow and Arrow will appear. Stretch the string to provide the power to the arrow and aim towards the balloons flying by.<br/>The more Balloons you pop the more powers you can unlock like sound Wave and Electricity Bolts to boost your high score and come out at the top of leader-board.<br/><br/>---<br/>Why Play Balloon Shooter:<br/>*very easy touch and stretch mechanics!<br/>*A casual strategic game!<br/>*As time increases the speed of the balloons increases making the game more challenging!<br/>*Buy and Enjoy power ups by exchanging Balloons you popped .<br/>*Master the game and be on top of the world leader boards.<br/><br/>Time to throw some arrows and pop those balloons! Be the greatest masters of the Bow and Arrow!<br/><br/>*** Download for free now<br/>*** Balloon Shooter in the best Bow and Arrow out there.</p>", "metacritic": null, "released": "2020-04-15", "tba": false, "updated": "2020-04-17T09:50:39", "background_image": "https://media.rawg.io/media/screenshots/289/289ccabf0355c97f6c3d11074d09aa65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Straight up technologies"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}