{"id": 429496, "slug": "prisoner-of-war-charity", "name": "Prisoner of War (Charity)", "name_original": "Prisoner of War (Charity)", "description": "<p>Get your game mode on and save yourself from your enemy’s base in Prisoner of War. The name of the game says it all. You have been captured by your own enemy! In this 2D platform, your mission is to escape the enemy’s base with either your automated rifle or your shotgun.  You will have to face different enemies each time you level up! There are 6 levels in total. Use your technics and skills to master the game. Do you think you have what it takes? Your control keys include WASD for movement, Ctrl to shoot, Q to swap between weapons, and R to reload. Make sure you don’t forget to reload!\r\n  </p>\n<p> \r\n  </p>\n<p>Prisoner of War is the first game I have created. In order to make it fun and engaging for my users, I took four months learning to make games and programming. I did not just want to throw a game out in the world without learning the success behind making one! I wanted to produce a game with all the action! Don’t worry, you do not even need to step out of your house to purchase the game. I made it through the studio game engine known as the GameMaker. All you need to do is have your computer to purchase and download the game! \r\n  </p>\n<p> \r\n  </p>\n<p>Yes, you do need to purchase the game, however, it’s definitely worth it. Not only for your own enjoyment, but also, I plan on having all the earnings from the game donated to Save the Children, a humanitarian organization dedicated to children all around the world. They have done a lot of work in aiding Coronavirus victims. According to Save the Children’s website, due to the Coronavirus, many children have been left without caregivers, at risk of violence and exploitation, and not able to attend school. Therefore, not only will you be accomplishing your mission to escape your enemy’s base, but aiding the real world face their own battles.\r\n  </p>\n<p> \r\n  </p>\n<p>Download Prisoner of War, get your technics ready, and complete the mission to defeat each different enemy!\r\n</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-04-17T09:56:26", "background_image": "https://media.rawg.io/media/screenshots/c70/c702e393483becad6e9afdc0f7bcdf99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HollowProductions"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}