{"id": 429666, "slug": "pfalz-eiii", "name": "Pfalz E.III", "name_original": "Pfalz E.III", "description": "<p>This has been created for the Dos Games Jam.</p>\n<p>I apologize for the lackluster state of this title; having only found out about this jam at the last minute, I only had three days to work on this project.</p>\n\n<p><strong>Premise:</strong></p>\n<p>\"Pfalz E.III\" is  an historical  early-90's/late 80's style PC-based \"flight simulator\" which incorporates rather crude flight-modeling that effectively sacrifices realism for the overall \"fun factor\".  </p>\n<p>Limited options for available mission types include \"Free Flight\", where one is free to experiment with the control scheme and flight mechanics without the burden of enemy interference, and \"Dogfight\", where the player engages in aerial combat against 1 to 3 adversaries. </p>\n<p>As you'll notice, this game  incorporates a highly primitive aesthetic, designed to emulate the limitations and style of early-90's DOS-based games. </p>\n<p>Among the inspirations for this title include such PC classics as Dynamix \"Red Baron\", 360 Software's \"Blue Max\", Microprose's \"Knights of the Sky\", and EA's \"Chuck Yeager's Air Combat\". </p>\n\n<p><strong>FLIGHT CONTROLS:</strong></p>\n<strong>ARROW KEYS</strong>pitch/roll<strong>\"Z\" and \"C\"</strong>yaw<strong>SPACE BAR</strong>fire machine guns<strong>ESCAPE</strong>exit to main menu\r\n\n<p><strong>Historical Background:</strong></p>\n<p>During the early stage of the \"Fokker Scourge\" in 1915/early 1916, the Germans continued to  exploit  their temporary monopoly on synchronized forward-mounted machine guns, by fielding limited quantities of low-performance fighters, equipped with the innovative \"interrupter gear.\"</p>\n<p>Produced in smaller numbers than the infamous Fokker Eindecker, the Pfalz E.III was merely a Spandau-equipped single-seater version of the company's A.II reconnaissance aircraft, the latter itself being nothing more than a license-built variant of the French Morane-Saulnier Type L.</p>\n<p>Like many early monoplanes of the period, the Pfalz E.III incorporated a \"wing warping\" arrangement as opposed to the more modern and conventional use of ailerons.</p>\n<p>Deployed in insignificant numbers to German fighter squadrons in both 1915 and 1916, the aircraft only enjoyed limited successes and within a short time, had  quickly become  outclassed by more advanced fighters on both sides of the front.</p>\n<p>By mid-1916, the singularly few Pfalz E.III's remaining in combat units were hurriedly withdrawn from service.</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-04-17T10:32:33", "background_image": "https://media.rawg.io/media/screenshots/824/82415b7370b8e033da2195d764981afe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jesse Hamm"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}