{"id": 429697, "slug": "ruff", "name": "RUFF", "name_original": "RUFF", "description": "<p>RUFF<br/>Genre: Puzzle</p>\n<p>Plot: In a distant corner of the Not-Our Galaxy, the space battleship of the Great Empire<br/>Attacks the space cruiser of the Proud Republic. Not equal forces<br/>And soon Republicans must die heroically, but there is still hope.<br/>One space bomber of the cruiser was able to break through to an enemy ship.<br/>It is left to fly to the main reactor of the battleship,<br/>Blow it up and become a hero (possibly posthumously).<br/>However, there is a slight problem, the bomber has a plasma projectile<br/>tore off the main engine...</p>\n<p>Game mechanics: The player controls a space bomber,<br/>Which moving through the level should get into the open portal trying at<br/>It is to obtain minimal damage.<br/>The portal opens with the selection of the bonus \"Key.\"<br/>The player receives damage from energy discharges and projectiles.<br/>With the Repair bonus, you can restore the player 's health to the maximum.<br/>Control is performed only by left mouse button (LMB).<br/>When the LMB is pressed, the bomb is fired towards the sight.<br/>Holding the LMB pressed leads to an increase in energy and growth<br/>A protective field around the bomber.<br/>The maximum size protective field blocks any damage.<br/>When the LMB is released and the energy value is more than five units, the nose<br/>Engine, at that space<br/>The bomber throws away in the opposite direction from the sight.<br/>The sight constantly revolves around the cosmic<br/>Bomber and is not controlled by a player.</p>\n<p>Control: left mouse button<br/>Pressing - shot with a bomb,<br/>Retention - increase of energy and protective field,<br/>Release - movement, at high energy value.</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-04-17T10:39:16", "background_image": "https://media.rawg.io/media/screenshots/129/129ca60de97c6459563e8dd4fdad7174.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamaun"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}