{"id": 429778, "slug": "the-esoteric-archive", "name": "The Esoteric Archive", "name_original": "The Esoteric Archive", "description": "<p>Those with a thirst for knowledge, and an understanding of the weavings, may find themselves in a library like no other. A deep perseverance and an amount of aimless wandering is required to find this place, but should you find it, you would surely find all the answers you seek. For this Esoteric Archive is vast, possibly endless, and filled with knowledge not meant for mankind. However, you have need of such knowledge, don’t you. Otherwise, why would you have come to such a place?<br/></p>\n\n<p>Game and Music by <strong>bjorntuga.</strong></p>\n\n<p>This game was intended for the <strong>“Haunted PS1 Wretched Weekend1” </strong>game jam. A majority of the assets I made during the allotted time, with a few exceptions of props I had previously built.This game uses some assets and/or modifications of assets from the Unreal Engine Marketplace. </p>\n\n<p><strong>CONTROLS:</strong><br/></p>\n<p>W,A,S,D - Move</p>\n<p>LMB - Pick Up Item in Crosshairs<br/>RMB - Zoom Camera Zoom</p>\n<p>That's it. That's all you get.</p>\n\n<p><strong>The Following Asset Packs were utilized in the making of this game.</strong></p>\n<p> </p>\n<p>\tChameleon Post Process</p>\n<p>\tGood Sky</p>\n<p>\tM5 VFX Vol2.</p>\n<p>\tUrban Materials Pack</p>\n<p><strong>Other Programs Used</strong></p>\n<p>\tBlender 3d</p>\n<p>\tMake Human</p>\n<p>\tUnreal Engine 4</p>\n<p>\tPhotoshop</p>\n<p>\tAudactiy</p>\n<p>Most of these are either free or were free at some point. If you are an aspiring game designer I highly encourage you looking into some of these programs. My point is, if I can make things like this, anyone can. Believe in yourself.</p>\n\n\n<p><strong>Author </strong><strong>Disclaimer and Notes:</strong> Bjorntuga is one person. Bjorntuga is a hobbyist, at best. Ergo, this game may not run very well on every system. I'll be honest, it might not run at all. I have no idea. I'm still relatively new at this. It works fine on my system, but I only have the one to playtest.  </p>\n\n<p>This game was built for a Game Jam. The entire experience can be completed in roughly 5 minutes. </p>\n\n<p>So, I snuck away from building Buried Beneath the Sleep (and somehow pried myself away from the Final Fantasy 7 Remake) to put together this small game jam game. Thematically/Lore wise, I'd say for now you can think of this as a sub-sect of the House of Ever Changing, but specifically for people who want solutions outside of the constructs of humanity. Perhaps knowledge on how to control time, or even life and death themselves. All knowledge is held in the Esoteric Archives. But just like the House of Everchanging, it's easy to get lost and forget why you came.</p><p>I'm going to try to sleep now.</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-04-17T10:58:34", "background_image": "https://media.rawg.io/media/screenshots/a41/a4127520115f071334e85c078f27e45e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bjorntuga"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}