{"id": 429847, "slug": "days-and-knights-demo", "name": "Days and Knights -- DEMO", "name_original": "Days and Knights -- DEMO", "description": "<p>NOTES 4/13/2020 --</p>\n<ul><li>Huzzah! A playable demo to tinker around and see how it's all put together!</li><li>There's still a bit to be done for the prologue itself, including finishing the writing and finalizing some sprites.</li><li>This project will have a voice cast as well! Just ran out of time for NaNoReNo to implement them in~</li></ul>\n<p>----------------</p>\n<p>Play Days and Knights, a visual novel brought to you by a super awesome cast and team of awesome individuals! You are a sorcerer raised in isolation but still with the hopes of being able to heal the world with your magical prowess. In a nearby village, you become their healer, allowing yourself the chance to continue your skills in peace. But things are turned upside down when an envoy of the Vernia Glades seeks your help, asking you to help cure the guard captain of a mysterious illness that befell them. It's up to you to use your abilities to find a way to heal her and make the kingdom's royal guard whole again! But how can you help out the kingdom when you're stuck with a major issue: magic is actually outlawed throughout the Vernia Glades!</p>\n<p>What will happen to you? What choices will you make? What is the cause of this mysterious illness plaguing the Head of the Knight’s Guard? Play through the story and romance yourself some knights in shining armor! Will you have a fairy tale ending or will you be cursed with a tragedy?</p>\n<p><strong>Genre:</strong> Fantasy, Action, Romance<br/><strong>WARNINGS: </strong>Language, Violence, Mature References and Themes</p>\n<p>-----------</p>\n<p>CHARACTERS and ROUTES --</p>\n<p>   </p>\n<p>CAPTAIN ADALINE WENDELL ---</p>\n<p>A young knight with a bright spirit and exuberant personality, she has served the Vernia Glades loyally for years before eventually taking the help of the guard captain. She always tries to see the good in the people around her, choosing to inspire and motivate the others around her with her upbeat energy and optimism. Despite her kindness to others, however, she refuses to let people walk all over her, become rather headstrong and pig-headed when people try to tell her to do something different than what she wants to do. But nevertheless, she's a leader to the fullest capacity. She also likes to train and fight alot, so it's not usual for her to brag about her win-streak against the other guardsmen.</p>\n\n<p>SER ROWEN MARGRAVE -- </p>\n<p>One of King Valeron's most trusted agents who often handles the dirty work of the kingdom. Quiet and stoic, it's often hard to tell what's going on in Rowen's mind as they go about their daily tasks. That is, if you can find them about the castle. They're rather elusive. Rowen tends not to speak to many people, but perhaps it's better for them that way -- as they view themselves more as an expendable asset for Valeron to use. A bit on the angsty side, Rowen still showcases a passion and loyalty that burns brighter than anyone else, and will fight until their last breath to protect what is most valuable to them. </p>\n\n<p>LIEUTENANT HARLAND CARVER --</p>\n<p>The most disciplined of all of the knights at the Glades, Harland was once a man with an adventurous past. A fighter by nature, he used to get into all sorts of trouble. However, after being betrayed by a companion of his, left injured and to take a blame for a crime the didn't commit, he was given the choice: reform or repent in solitude. Thus, he joined the guards, becoming Adaline's second in command and the strict and brutal side to Adaline's energetic and carefree atmosphere. He take his work very seriously, refusing to do much of small talk unless it's something to do with his duty to the guards. He also has a very bad anger issue and fails sometimes to hold his tongue.</p>\n\n<p>ISIDORE IVALICE --</p>\n<p>A scholar recruited by the royal guard to offer his insight and knowledge to the knights. With information on all sorts of things, from maps of various lands to customs and traditions, Isidore is the man to go to for anything. A bit eccentric and flirtatious with everyone who comes his way, he's a bit of a handful to deal with. But if you manage to befriend him and give him all sorts of tea (gossip and actual tea), he's more than happy to assist you. If not, then you best pay up in other various ways. He's a very majestic individual, despite his dramatic personality, but he proves to be a valuable ally to you -- especially when there's something rather 'magical' about him as well.<br/></p>\n<p>--------</p>\n<p>CAST AND CREW --</p>\n<p>Sprite Artist and Coder:<br/>Steph Nguyen</p>\n<p>Writers:<br/>Steph Nguyen<br/>Jordan Bonn<br/>Shakyra Dunn</p>\n<p>Voice Cast:<br/></p>\n<p>Magic Kaito as ADALINE WENDELL<br/>King Kodiak as HARLAND CARVER<br/>Ryan Hoyle as ISIDORE IVALICE<br/>LeeLoo_VA as ROWEN MARGRAVE<br/>VynVoxVA as SANCTUS/THEODOSIA SIDONIA<br/>JayOrtizVA as LYSANDER<br/>Bpjenkins123088 as KING VALERON<br/>Lucaricross as ASTERIUS MARQUIS<br/>JessiCartoons as SERENITY BARNHARDT<br/>John Klaus as JEREMIAH EMBERLY</p>\n<p>Backgrounds Courtesy by Rachel Chen<br/>https://itch.io/profile/rachelchen</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-04-17T11:14:48", "background_image": "https://media.rawg.io/media/screenshots/9c8/9c8bcde9bbdad22f0a3d96f50196dd2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stephicness"], "genres": [], "publishers": [], "esrb_rating": null}