{"id": 429850, "slug": "pain-itch", "name": "pain (itch)", "name_original": "pain (itch)", "description": "<p>To do something in game, you need to bump into some objects and click them. Eg. the cooker, bed, bathtub, main door, many more.</p><p>Time is  a bit glitchy  ¯\\_(ツ)_/¯ whatcha gonna do</p><p>As I suffer from depression and can't sleep most of the time, so I put this \"game\" together. I had to do it otherwise I wouldn't have been able to sleep, as my thoughts keep me awake all the time. Of course I had something greater in my mind but the implementation wasn't as easy... this is why I uploaded all the project files, a html version and a windows executable. To open the project files you need Scirra Construct 2. You can do whatever you want with the files :D</p>\n<p>If you want to donate, you may as it helps me and my depression (and I didn't completly waste my time)</p>\n\n<p>You can hover over the progress bars in the top left to see what they're about, this \"game\" is made from the eyes of a depressive person, which means that even the easiest tasks rob you of your energy and mood, you are never really in control of your actions because you're just trying to survive the day while trying to have fewest negative thoughts.</p>\n\n<p>If you have any tips concerning my depression I would appreciate a message as I currently don't know how to continue. If you read this far, be blessed. I just try to get over the day. I can't really eat anymore (I lost 5kg in like 2 weeks), when I try to eat I can take two bites and I'm full (almost on the verge of vomiting). I cry some nights because I review the day in the evening and just get lost in sad thoughts... or I make some sad scenarios in my head, about losing friends and family, which I hope never happens.... I get sensitive quite way to fast and can't control my moods. I don't really wanna do anything anymore, I guess I could make something out of this, but not with my current mindset... </p>\n<p>Maybe it's just a cheap way to try to get some cash, but I'm not in the postition to care about that.</p>\n<p>I don't know if it's worth doing anything anymore, I don't want to get out of bed anymore. Maybe that's where I belong... I'm gonna stay here until somebody pulls me out of this hole.<br/><br/>Anyways I wish you the best, and hope you never get into any situation like me.<br/><br/><br/>If you're suffering in a similar way, keep in mind: hurting yourself is never a solution!<br/>http://www.suicide.org/international-suicide-hotlines.html</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-04-17T11:15:23", "background_image": "https://media.rawg.io/media/screenshots/8d0/8d0f60a3582cca3883d0e96133563ecb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["District11"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}