{"id": 429938, "slug": "braveheart-academy", "name": "Braveheart Academy", "name_original": "Braveheart Academy", "description": "<p>Hey! The name's Chrys.<br/>Am developing BraveHeart Academy which is an Adult Eroge with some Visual Novel Aspects, the main focus being dating the girls at the Academy!</p>\n<br/>\n\n<p>_________</p>\n<p>__________________<br/>You’re a student enrolling in the international academy of Braveheart!<br/><br/>You’re able to pick you class and your starting stats so you can start the way you want to!<br/><br/>Pick a different class will pair you up with different people and the story perspective will change. <br/>Braveheart academy gives the best it can to his students, varied facilities so they can become the best at their craft. <br/>With diverse sport locales such as a swimming pool, track field, a gym and more! A big cafeteria so students can have lunch and a well deserved break.<br/>Big wings that are exclusive for each year of students, although the school allows people to visit other wings of course people from your year will be paired on the same building!<br/><br/><strong>The Gameplay?</strong><br/>Gameplay will have you meet girls, talk with them and have wonderful experiences with them. Don’t mess up their questions! <br/>They might not want to see you for a while if you have a tendency to not remember what they say. And when an encounter is special, you’ll have to solve a puzzle! The more intelligence you have within the game the more tips you’ll get!<br/><br/><strong>The Puzzle?</strong><br/>Its sliding puzzle minigame! you have to complete it under a set amount of time. <br/>The puzzles would get progressively harder ranging from 3x3 to 4x4 and even 5x5! <br/>The game is going to have stats and/or Items that you can decrease the puzzle's difficulty so you'll be able to complete puzzles easier and faster!<br/><br/><strong>The Renders?</strong><br/>Braveheart Academy will come to have fully animated and uncensored lewd &amp; H Scenes.<br/>And will consist mainly of renders to show each of the characters story!<br/>We aim to give unique characters, all with fully &amp; beautifully rendered CG Art and fluid animations in ALL lewd &amp; H Scenes.<br/><br/>_________________</p>\n<p>_________</p>\n<p>_<br/><br/><br/>There are three Classes you can join!<br/>Each class has different characters that you can interact, talk and get to know!<br/><br/><strong>From Class 1-1!</strong><br/>In this class you’ll have Lyra and Sophia as your classmates!<br/><br/><strong>Lyra Knight</strong><br/><br/>Lyra is an Aloof type of character, kuudere, cool, distant and unapproachable on the surface, but scratch the surface and you'll find turbulent emotion beneath. Self-reliant. Denies affection, but becomes expressively passionate toward her lover.<br/><br/><strong>Sophia Archer</strong><br/><br/>Sophia is the Submissive type of character, she has a service-oriented mindset and finds peace in taking instructions from those she looks up to. This can be at home, at workplace, with friends or in community relationships. <br/><br/><strong>From Class 2-3!</strong><br/>In this class you’ll have Blair, Viviana and Etna as your classmates!<br/><br/><strong>Blair Walker</strong><br/><br/>Blair is a Trap, he’s a guy that was always a bit more on the feminine side but is self-aware of that, he enjoys hiding his identity. Loves to tease people and play around with them. Overall he’s caring and hyperactive. Loves sweets. A lot. Really A LOT.<br/><br/><strong>Viviana Rodriguez</strong><br/><br/>Viviana is a quiet person, very soft-spoken and emotionally reserved, with a dry sense of humor. All of this has a reason and its because of Viviana’s griming past, filled with sadness and despair. Maybe you can help her get her out of her shell?<br/><strong><br/>Etna Edgeworth</strong><br/><br/>Etna is a Sensitive yet smart person. She’s a romantic who knows everything there is to know about romance from books. She's eager to have the real experience, and to feel what she feels when reading the passages derived from someone else's experience. Very literate and quick to pick up new knowledge, especially knowledge that supplements her understanding of the erotic. Becomes more self-deprecating the deeper in love she falls, as if she feels unworthy of the love she wants. Discussions about love and romance are more deeply personal for her and can win her heart.<br/><br/><strong>From Class 3-3!</strong><br/>In this class you’ll have Raven and Rika as your classmates!<br/><br/><strong>Raven Blackwell</strong><br/><br/>Raven is apathetic, usually negative. She shows off her indifferent manner openly to everyone. But once she gets intimated, she starts talking with insulting manner which is to conceal her actual sentiment. Also is aggressive in the beginning but with time you can get to see her girly side and sweet side, might not be much but its what she has to offer.<br/><br/><br/><strong>Rika Ushiro</strong><br/><br/>Rika is of Japanese Rich Background and you can see she was raised as such, she is worldly wise, with an unflappable pleasant grace. She is also the student council president of the school so it isn’t someone you’d like to get on the wrong side with. Although she is from a Elite background she is not arrogant, in fact she is quite humble.<br/><br/></p><p>If you want to help the project and even get something IN the game consider pledging on Patreon!<br/><br/>https://www.patreon.com/braveheartacademy</p>\n<p><strong>Please do note that these screenshots were taken during Alpha. </strong></p>\n<p><strong>What you see might and will most likely change for the better!</strong></p>", "metacritic": null, "released": "2020-04-13", "tba": false, "updated": "2020-04-17T11:35:01", "background_image": "https://media.rawg.io/media/screenshots/b22/b225d90112fc86fe2347552b68c29b38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["BraveHeartAcademy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}