{"id": 429988, "slug": "red-handed-robin", "name": "Red-Handed Robin", "name_original": "Red-Handed Robin", "description": "Red-Handed Robin will be released in two parts! For now, only part 1 is available to play.\r\n\n\n<p><em>\"All aboard the Whirlwind Express, the first ever train to connect the capital cities of Zephyr and Gales! Officially the most luxurious train in the world, no expense was spared on this ground-breaking maiden voyage. With one of our private luxury cabins, you'll be traveling in style as we make history on this cross-country trip!\"</em></p>\n<p>When career thief Robin comes across a boarding pass for the Whirlwind Express, she  thinks she's found a literal ticket to freedom. With a case full of stolen jewelry and her loyal bodyguard at her side, she's ready to flee the country in style... </p>\n<p>That is, until she runs into her childhood friend turned detective. Though he doesn't appear to recognize her, he keeps her under an annoyingly watchful eye anyway. </p>\n<p>Will Robin be able to keep her lies straight and make it off the train with the goods? Or will her cover be blown, along with her escape plan?</p>\n\n\n\n<p><strong>Robin's 'Ambition'</strong><br/>Growing up wealthy, Robin had everything she could ever want... or so it seemed. It always felt like something was missing, and the pieces finally fell into place the first time she stole from her father. Longing for freedom and the thrill of the chase, she became a runaway. She simply can't resist the call of adventure.</p>\n\n<p><strong>Wren's 'Suspicion'</strong><br/>Detective Wren has a keen eye for contradictions. Should Robin make too many mistakes or get caught in an especially egregious error, Wren may have all the evidence he needs to prove what she's done.</p>\n\n<p><strong>Jay's 'Loyalty'</strong><br/>Jay is very protective of Robin (and perhaps a little jealous). If things seem to be going south, he may very well derail the whole plan. Accustomed to solving problems through the use of force, he has no qualms 'protecting' Robin by removing her from this situation, even if it's against her will.<br/></p>\n\n\n<p>Red-Handed Robin was made by me, HitOrMissy, for NaNoRenO 2020+, a month-and-a-half long game jam that took place in March/April. It's an adventure Otome released in two parts. </p>\n<p><strong>Part one</strong><strong> features:</strong></p>\n<ul><li>A GxB story with two love interests </li><li>13k+ words (around an hour total playtime)</li><li>4 endings (2 bad, 2 good)</li></ul>\n<p>Currently, there are no CGs, but I hope to add some later!</p>\n\n<p>Red-Handed Robin's story contains swearing, the use of alcohol, and violence, including mentions of violence against a child.</p>\n<p>There are also some sexual themes, but they are pretty tame. <br/></p>\n<p><strong>Please play at your own discretion.</strong></p>\n\n\n\n<p>I post my art and game dev stuff on Twitter and Instagram! If you're interested in seeing any of that, you can find me here:</p>\n<ul><li>Twitter</li><li>Instagram</li></ul>", "metacritic": null, "released": "2020-04-13", "tba": false, "updated": "2020-04-17T11:47:05", "background_image": "https://media.rawg.io/media/screenshots/855/8553c805f01af839cf16db9ee1b15d4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["HitOrMissy"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}