{"id": 430, "slug": "grand-theft-auto-vice-city", "name": "Grand Theft Auto: Vice City", "name_original": "Grand Theft Auto: Vice City", "description": "<p>Grand Theft Auto: Vice City is a third-person shooter with an open world. The game is set in a fictional city during the 1980’s and exhibits a unique design of locations, people, and objects, resembling the real world’s counterparts of Vice City, mainly Miami, FL. GTA: Vice City is a fourth game of the series, following Grand Theft Auto III.</p>\n<p>The main character is introduced as Tommy Vercetti, an Italian-American mobster who works for a wealthy crime family. Throughout the story, the player will observe as the protagonist rises the ranks, sometimes making decisions of questionable nobility or profit. Our goal as a player is to ensure that Vercetti becomes the boss of all of Vice City’s mafia, and various story characters will help us or prevent us from achieving this goal.</p>\n<p>The worlds of Grand Theft Auto series have long been worked upon and have been done in much detail, and Vice City is no different. The people on the sidewalks, the stylish cars and neon light clubs, the sky-high buildings and lively piers and beaches, everything will bring nostalgic feelings to those of players, whose eyes have seen the glory of this time. The gameplay, however, bears little difference from its predecessor, continuing the trend of big guns, explosions, and cop chases.</p>", "metacritic": 94, "released": "2002-10-27", "tba": false, "updated": "2024-04-20T08:42:26", "background_image": "https://media.rawg.io/media/games/13a/13a528ac9cf48bbb6be5d35fe029336d.jpg", "website": "https://www.rockstargames.com/games/vicecity", "rating": 4.44, "rating_top": 5, "added_by_status": {"yet": 258, "owned": 5055, "beaten": 2852, "toplay": 153, "dropped": 840, "playing": 50}, "playtime": 2, "achievements_count": 90, "ratings_count": 2894, "suggestions_count": 377, "game_series_count": 12, "reviews_count": 2910, "platforms": ["Android", "macOS", "PC", "iOS", "PlayStation 4", "PS Vita", "PlayStation 2", "Xbox"], "developers": ["Rockstar North"], "genres": ["Action"], "publishers": ["Rockstar Games"], "esrb_rating": "Mature"}