{"id": 430260, "slug": "cyberception", "name": "Cyberception", "name_original": "Cyberception", "description": "Cyberception is a single player FPS set in dystopian, cyberpunk world.<br/>\n<br/>\r\nClassic first person shooter gameplay fused with elements of parkour that gives players new ways to dominate enemies.<br/>\n<br/>\r\nThree acts of story driven combat and hacking, inspired by such legends as Quake, Half-Life and recent reimaginations of Doom - this is our tribute to 90s good-old-days of pure first person shooting  gameplay of internet-cafes era.<br/>\n<br/>\r\nSingle player campaign will be accompanied with challenge arenas, with endless waves and players  score tracked through global ranking. We love online skirmishes, but in cyberpunk world you’re alone man. Nobody will hear your scream over wires, unless you beat somebody’s score!<br/>\n<br/>\r\nOn the course of the campaign you will wander through under city canals (inspired by monolithic Tokyo anti-flood system), streets of the mega city and executive top floors of the corporate headquarters. <br/>\n<br/>\r\nYou will face over 15 unique enemies, resembling different tiers of the cyberpunk criminal underworld and culture-fused megacity where it’s difficult to say when night comes after a day.<br/>\n<br/>\r\n7 types of weapons - including firearms and energy, alongside with hacking ability should be enough to give you a chance  to survive this trip.<br/>\n<br/>\r\nAll these neuro-fiber-stimulation junkies want one thing - to stop you from preventing ultimate suggestion emitters go full online. Because when they do, say goodbye to free will, buddy. It may be a video game story, but this is happening right now – this technology exists already. Get ready for the future and learn how to deal with it when it comes to your doorsteps!", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-20T03:04:07", "background_image": "https://media.rawg.io/media/screenshots/b95/b959a0c5ffe352d7ce32efd1f4e94552.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steelcore Games"], "genres": ["Action", "Indie"], "publishers": ["Steelcore Games"], "esrb_rating": null}