{"id": 430292, "slug": "bee-war", "name": "BEE WAR", "name_original": "BEE WAR", "description": "<ul>\n<li>Strory<br />\nBee history 20XX...<br />\nThe bee kingdom is attacked by insects.<br />\nNot only the honey bees, but the queen bee also fought, but this was in vain, and they were defeated.<br />\nThe bee kingdom attacked by the insects was under dominance for many years after that, and they were continually defiled.<br />\nWith a life of sexual slavery and continued rape, also forced into manual labor as a worker bee…<br />\nBee years 20XX were the dark ages.<br />\nHowever, one girl has stood up to recover the bee kingdom.<br />\nThe girl using a poisonous barb protruding from her arse as a weapon fights alone..  </li>\n<li>Game<br />\nThis is horizontally scrolling action.<br />\nThe plump heroine moves forward while taking items.<br />\nBy taking items, you can build up power quickly and then use your death blow.<br />\nThe level of difficulty for the action becomes more difficult in the second half.<br />\nUse 7 types of attack, dash and jump etc. to form a strategy.<br />\n(For those who are not keen on action, it is equipped with some hidden tricks)<br />\nIf you come into contact with the enemy, your lives go down.<br />\nIf you grab your opponent while her tits are out, you can rape her.<br />\nIn the street you are attacked by bees of the same group.<br />\nTake keys on the various walls and move forward.<br />\nAs you progress in the stages, it gets more difficult but there is continuity<br />\n(Where there is continuity, the item effects are also carried over, so it becomes easier the more continuity there is)  </li>\n<li>Sex<br />\nThe scenes where sex occurs during the action are in animation.<br />\nThe event scenes are also animated.<br />\n(some of the scenes are not animated)<br />\nThere is a gallery mode to view the sex scenes.<br />\nWe have made it as practical as possible.<br />\n!!All characters appearing are over 20 years old.!!</li>\n</ul>", "metacritic": null, "released": "2020-04-11", "tba": false, "updated": "2022-04-28T11:46:03", "background_image": "https://media.rawg.io/media/games/256/2568e7dc74e648c502bf6da3b1e1fdad.jpg", "website": "http://h-game.site/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aphrodite"], "genres": ["Action"], "publishers": ["H-GAME"], "esrb_rating": null}