{"id": 430335, "slug": "xevorel-the-way-of-the-feather", "name": "Xevorel - The Way Of The Feather", "name_original": "Xevorel - The Way Of The Feather", "description": "<h3>The Armies Of Darkness Are At The Gates!</h3>Hordes of mysterious creatures are swarming the countryside, leaving nothing but death and despair in their wake. Pick up your bow, nock the next arrow, and get ready to carve your own path as you explore a carefully hand-crafted world! <br/><br/>Xevorel - The Way Of The Feather is the first episode in the Xevorel Saga. Visit both familiar and alien regions, rediscover long-forgotten legends, solve ancient puzzles, meet powerful allies, and defeat fearsome bosses in a classic 2D platformer with a modern twist!<h3>Game Features</h3><ul><li>Experience classic gameplay with a twist! Delve into a tight mix of 2D-platforming, brain-teasing puzzles, and challenging fights.<br/><br/></li><li>Explore at your heart's content! Visit multiple hand-crafted pixel-art environments, each hosting its unique inhabitants.<br/><br/></li><li>Stick them in their knees! Master a dynamic combat system featuring special attacks, skills, and combos.<br/><br/></li><li>Gather around for a story! Unlock hidden secrets, rediscover long-forgotten legends, and learn more about the world of Xevorel.<br/><br/></li><li>Challenge your friends! Compete with people throughout the world and conquer the Xevorel Online Leaderboards.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-04-20T03:49:00", "background_image": "https://media.rawg.io/media/screenshots/b74/b743a10272da7a6f1042b179d85c2f98.jpg", "website": "https://www.amberaxe.com/xevorel", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amberaxe"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Amberaxe"], "esrb_rating": null}