{"id": 430388, "slug": "phaseworm", "name": "PhaseWorm", "name_original": "PhaseWorm", "description": "PhaseWorm might initially look like a game that you've seen before.  The first few stages will introduce you to movement mechanics that seem straightforward.  Next, we'll introduce Phasing.  Phasing allows you to match the color of the environmental tiles in order to pass through them.  The addition of the one-time passthrough concrete (or grey) tiles adds the additional challenging of carefully planning your path through the grid.<br/>\n<br/>\r\nStory mode will take you through an increasingly difficult and complex set of 30 themed levels, each with a unique layout.  PhaseWorm incorporates a medal system to track your best times on each level.  Getting more advanced medals requires more frequent and precise phases.  Getting the platinum times on many of these levels will prove to be very challenging.  <br/>\n<br/>\r\nApples have been carefully placed to challenge the player to build their skills.  Let's look at the end of \"The Desert Oasis\".  If you're going for the silver medal, you might phase to yellow and go around the center.  If you're pushing for the gold, you can try to go through the grey tiles and phase green while inside them.  If you want that platinum medal though, you're going to have to Phase perfectly from yellow to green, then quickly to blue and back to green.<br/>\n<br/>\r\nClearing the later stages is really tough, and aquiring the medals for these stages is a big achievement that will push the envelope for elite players.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nThe game's look and feel can be somewhat customized.  Gridlines can be turned off or set to any opacity, and the player can choose to use our themed tileset or switch back to basic colors.<br/>\n<br/>\r\nWe've also included a phase prediction prompt to help you as you progress through the game, and this element can be turned off as well.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nPhaseWorm is now available in early access.  While the core gameplay for story mode is complete, feedback and statistics from the community will help calibrate medal times and a smoother progression in level difficulty.<br/>\n<br/>\r\nFuture plans for PhaseWorm include more original soundtracks for the stages, a more polished UI, and alternative options for tilesets.  We also want to add controller support, with the Phase colors conveniently matching the Xbox controller buttons.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nWe hope you enjoy PhaseWorm, and encourage you to replay the levels as you improve your skill, or even try speedrunning the entire game!", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-04-20T04:20:31", "background_image": "https://media.rawg.io/media/screenshots/7b7/7b7b4d40d81ec4aab83d4ba0702bad63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Steve 'Elipsis' Barrios"], "genres": ["Action"], "publishers": ["Steve 'Elipsis' Barrios"], "esrb_rating": null}