{"id": 430339, "slug": "draw-a-stickman-epic-3", "name": "Draw a Stickman: EPIC 3", "name_original": "Draw a Stickman: EPIC 3", "description": "Played over 100 Million Times around the Globe and a winner of 5 Webby Awards, DRAW A STICKMAN is back and more EPIC than ever before!<br/>\n<br/>\r\nYour creativity will be maximized in the all-new Draw a Stickman: EPIC 3! Embark upon an exhilarating new adventure to defeat the Corruption: solve fun puzzles, outsmart crafty monsters, and discover an all-new world! So grab your freshly penciled Hero—it’s time to be EPIC!<br/>\n<br/>\r\nDRAW YOUR OWN HERO!<br/>\r\nUse the new, intricate drawing tools to design the perfect Hero! Be as creative as you want—your Hero can be anything you can draw!<br/>\n<br/>\r\nLIMITLESS SKETCHBOOK!<br/>\r\nStore unlimited drawings of Heroes and Tools in your new Sketchbook! Swap between these at any time to spice up your gameplay with all your favorite characters!<br/>\n<br/>\r\nNEW HUB WORLD!<br/>\r\nVenture around the new Hub World and meet other characters in the Stickman universe! See what they have to say and what they need you to do!<br/>\n<br/>\r\nEXPLORE LEVELS!<br/>\r\nAdventure through new levels packed with secrets, collectibles, and hidden pathways!<br/>\n<br/>\r\nFEISTY MONSTERS!<br/>\r\nLots of new monsters to outwit! Be on the lookout for Oozes, Trolls, Bully Goats, and—perhaps the most fearsome of them all—an Evil Hamster!<br/>\n<br/>\r\nFIND LOST COLOR BUDDIES!<br/>\r\nFind the lost Color Buddies to add rich, new colors to your drawings!<br/>\n<br/>\r\nMASTER NEW PENCILS!<br/>\r\nUse your nifty new pencils to bamboozle bosses and bring to life the world around you!<br/>\n<br/>\r\nUNLOCK EVERYTHING!<br/>\r\nUnlock new hidden areas as you find coloring guides, tool blueprints, and pencils! Can you earn 3 Stars on every level?<br/>\n<br/>\r\nYou’ll see plenty of new characters and some surprisingly familiar faces on this new adventure! Who are they? It’s a secret! Are you ready for an EPIC new adventure?", "metacritic": null, "released": "2020-05-07", "tba": false, "updated": "2020-05-08T02:26:00", "background_image": "https://media.rawg.io/media/screenshots/f0e/f0e74e94e664140950b427e90c2ce794.jpg", "website": "http://epic.drawastickman.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 2}, "playtime": 1, "achievements_count": 29, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Hitcents.com", "Hitcents", "Pocket Pinata"], "genres": ["Adventure", "RPG", "Casual", "Educational", "Indie"], "publishers": ["Hitcents", "Hitcents.com"], "esrb_rating": "Everyone 10+"}