{"id": 430347, "slug": "olaguna-chronicles", "name": "Olaguna Chronicles", "name_original": "Olaguna Chronicles", "description": "The mark of saint -Olaguna Chronicle is based on a medieval fantasy of swords and magic.<br/>The story is divided into eight chapters: the battle of the dragon, the legend of meronso, the change of sabante, the apocalypse of fate, the battle of the holy scar, the seal of bahamt, rogoydan and the ode<br/>Section, centered on the continent of olaguna, tells the story of the dragon and people on the continent of olaguna from 109 to 1139 with their own ideals, justice, desires and missions! after<br/>Nearly a thousand years of olaguna war history, write a scene for posterity poetry...<br/><br/>Olaguna Chronicles is the first half of the fourth chapter of the chronicle of OLAGUNA, the apocalypse of destiny, which takes place between 338 and 379 years old.<br/><br/>Olaguna is made up of three regions: olaguna continent, olaguna bay and rogoydan island.<br/><br/>In the year 338 of olaguna, barrex launched a joint attack on the free kingdom of neighboring albertha, and udnar's knights of the silver hand were wiped out in the battle of nazca plains.<br/><br/>At this point, the balance between defense and attack between alberser and barrex has been broken for more than 50 years. South of olagoubes into total war...<br/><br/>Our story begins here...<h3>Features </h3><br/>1. This is a SRPG game<br/><br/>2. Challenging turn-based combat, each level has a different goal, including defeat, puzzle solving, survival, escape, etc.<br/><br/>3. Weapon mutual mastery system, use the mutual mastery between the superior weapons to defeat the enemy!<br/><br/>4. Intricate plots and fascinating  paintings.", "metacritic": null, "released": "2020-01-23", "tba": false, "updated": "2020-04-20T03:57:46", "background_image": "https://media.rawg.io/media/screenshots/336/336cd42c8f1ef6658df6a1a5a6acdd49.jpg", "website": "https://www.indienova.com/g/stigmata-fate-apocalypse", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SELeft Studio"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Lycian Studio"], "esrb_rating": null}