{"id": 430372, "slug": "bimirror-world-mirage", "name": "Bimirror World Mirage", "name_original": "Bimirror World Mirage", "description": "<p>[game]<br />\nIt will be a role playing game.<br />\n[Storylines]<br />\nTwo girls &quot;Memiru&quot; and &quot;Ymir&quot; live in the village.<br />\nThey hear the story of another world from the old teacher Hedne and decide to return to the original world.<br />\nHowever, it is impossible to avoid the fight for that.<br />\nMonster and evil Empire Army wandering out of the village<br />\n&quot;From here, the place where we cannot live... &quot;<br />\n&quot;But who decided that?... It&#39;s a story that doesn&#39;t work for us! &quot;<br />\nThe two girls vow to never give up their dreams and hopes, and they are going to fight.<br />\n[Fuck Scene]<br />\nMonster Sex and Tentacle Sex, Stick Attack, Wall buttocks outrageous Rape, Devil Torture, Hypnosis Training<br />\nHuman Platter etc, many tortures that make beautiful bodies to tattered without mercy are waiting.<br />\nThe girls continue to be tortured until the heart breaks, but still fight to give up.<br />\nBy being cheated,  poisoned, the experience of the insult which is carved thoroughly in the body.<br />\nHard acts are done in the fantasy world not caught in the frame.<br />\nDoes the spirit of the girls collapse?<br />\nOr do they achieve purpose?<br />\nThe thought that They can never give up.<br />\nWith that thought, no matter how raped, no matter how  violated,<br />\neven if the stick of the tree is forced thrust in pu*sy, they can endure them.<br />\nNever lose. And then... back to the original world.<br />\n[Other]<br />\n1. This game is fiction.<br />\n2. Please refrain from playing if you are under 18 years old.<br />\n3. All of the characters appearing within the game are 18 years or over.<br />\n4. No characters under 18 years old appear within the game.<br />\n5. The stories in the game are all fiction.<br />\n6. The characters, organization, settings, and names in the game are fictitious and bear no relationship to actual ones.</p>", "metacritic": null, "released": "2020-04-11", "tba": false, "updated": "2022-05-10T13:55:46", "background_image": "https://media.rawg.io/media/games/f0a/f0a8bb1f66de0facb851534baab18d16.jpg", "website": "http://h-game.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 510, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["H-GAME", "DorieExplorer"], "genres": ["RPG"], "publishers": ["H-GAME"], "esrb_rating": null}