{"id": 430301, "slug": "she-will-punish-them", "name": "She Will Punish Them", "name_original": "She Will Punish Them", "description": "Bring your demoness to the goriest combat. Slaughter or get slaughtered. There are no check-points, only your skills, and luck matters. <br/><br/>The old demon king is dead. Veronica, as his favorite princess, ought to take the throne. However, her brothers and sisters are not happy with this decision. They betrayed and locked her up in the tower of pain. She must fight her way out, combat the demonic guards and gate-keepers. Survive and punish them!<br/><br/><strong>Features</strong><br/><br/><strong>Roguelike gameplay with High-Replayability</strong><br/>Fight your way out in the randomly generated maps of cold plain, dark meadow, ruins, and dungeons. Get randomly generated weapons, spells, and power-ups to boost up your combat ability. Improve your skills and reflex in the cycles of slaughtering and death. <br/><br/><strong>Gory Combat</strong><br/>Violently murder your foes with melee, spells, explosives, and traps. Cut them in half or blow into pieces. More than 30 weapons and spells to master, each with a unique playstyle. Be careful, your enemy can also do the same to you. The game doesn't focus on character's attributes, but a sense of brutal melee combat. The timing of each slash, choice of weapons, a quick roll to avoid a blow and rage is the key to victory.<br/><br/><strong>Collectible items and outfits</strong><br/>More than 50 outfits, ornaments, shoes, leggings to collect and customize your succubus to look like a badass demon queen. But if you die, you may lose all the equipment you have collected through hard work unless you put them in your personal storage. Punishment is real if you don't know when to withdraw.", "metacritic": null, "released": null, "tba": false, "updated": "2023-06-19T06:08:23", "background_image": "https://media.rawg.io/media/screenshots/393/393286a1a10d743ef3ea1524486b001a.jpg", "website": "https://www.shewillpunishthem.com/", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 239, "beaten": 4, "toplay": 10, "dropped": 8}, "playtime": 2, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["L2 Game Studios"], "genres": ["Action", "Indie"], "publishers": ["KK Softworks"], "esrb_rating": null}