{"id": 430482, "slug": "sakura-knight", "name": "Sakura Knight", "name_original": "Sakura Knight", "description": "The land of Lemuria was once in turmoil. Ruled over by the evil demon queen, Gunhild, the people lived every day in fear and strife… until the brave female knight, Cressida, destroyed her.<br/><br/>For the last thirty years, Lemuria has been at peace. Knights like Cressida are no longer needed to protect the masses – but Cressida’s daughter, Estelle, is determined to follow in her mother’s footsteps. Not content to spend the rest of her days in her parents’ bakery, our young heroine vows to take up the sword and go on a fantastic adventure…<br/><br/>But things don’t quite work out that way!<br/><br/>Despite her lofty ambitions, Estelle is sheltered and naïve. Less than a week into her adventure, she’s hoodwinked by a crafty catgirl, and then she has to content with a wildly flirtatious elven princess who keeps making advances on her!<br/><br/>How will Estelle ever manage to make her dream come true?!<br/><br/><br/><br/>Estelle is the heroine of the story. Though a young adult in her early twenties, she has spent most of her life sheltered and coddled by her overprotective parents. She wants to become a brave knight, but her clumsiness often gets the better of her.<br/><br/><br/>Felicia is a seductive elven princess who hails from the land of Gris. As per elven custom, Felicia must travel across the land and help those in need, in order to prove herself as a worthy successor to her mother’s throne.<br/>Felicia comes from a vast family with dozens of siblings. As the oldest, she’s also the loudest, and she almost never stops talking. She’s perpetually cheerful and optimistic, and more than a little airheaded, but her skills with a sword are impeccable.<br/><br/><br/>Tart is a self-proclaimed ‘magical cat witch’. Though she looks sweet and unassuming, she possesses incredible magical powers.<br/>Tart is mischievous and deceptive by nature. She makes a living through thievery, swindling, and stealing. She particularly loves taking advantage of cute girls – especially if she gets to see them cry.<br/><br/><br/>Rune is a wolfgirl who lives deep in the Lemurian forest. Her grasp of common Lemurian is somewhat shaky, and she finds it hard to communicate, but her passion always shines through.<br/>Serious and dutiful, Rune is a good ally to have. Like a guard dog, she’ll fiercely defend those she considers her comrades – but if you get on her bad side, she’ll hold a grudge for years.", "metacritic": null, "released": "2020-01-31", "tba": false, "updated": "2020-04-20T05:16:29", "background_image": "https://media.rawg.io/media/screenshots/067/067ed9b43b35efdff697bdcc6507f5d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 56, "toplay": 5, "dropped": 1, "playing": 1}, "playtime": 3, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["Winged Cloud"], "genres": ["Simulation", "Casual"], "publishers": ["Winged Cloud"], "esrb_rating": null}