{"id": 430448, "slug": "wire-2", "name": "Wire", "name_original": "Wire", "description": "Looming anxiety and an absurd obsession with her mortality cause Carissa to spiral down into a dark and inescapable impasse for she believes her unreasonable actions will prevent her own death she obscurely dreamt about when she was a child.<br/>Experience the cathartic and gruesome story of Carissa and the many intangible situations she finds herself in as she faces off against countless horrors and creatures that plague her reality. <br/><br/>By bringing elements of classic survival horror and putting it through the lens of a modern game, WIRE is sure to deliver a nostalgic yet absolutely unique gaming experience that will not be forgotten.<h3>Key Features</h3><br/> <ul><li>Stay awake long enough to find a safe place to sleep before you find yourself too tired to go on any farther.<br/> </li><li>With no flashlight, you must find a light switch to see what's inside the many dark rooms and halls you encounter on your journey, for you never know what you might accidentally walk into.<br/> </li><li>Fight against Carissa's anxiety and instincts so you don't lose control of her and what she does.<br/> </li><li>Fend off or flee from the few but wicked terrors that reside in Emily's reality.<br/> </li><li>Vast amounts of replayability with multiple endings and bonus content for completing the game.<br/> </li><li>Full controller and keyboard/mouse support so you can play however you choose.<br/></li></ul>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2022-03-28T02:52:14", "background_image": "https://media.rawg.io/media/screenshots/417/4170aa6bb3daf9f80cb7e3324777712b.jpg", "website": "https://www.evermoreshore.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sebastián Rodríguez Leopold", "Evermore Shore"], "genres": ["Adventure", "Indie"], "publishers": ["Sebastián Rodríguez Leopold", "Evermore Shore"], "esrb_rating": null}