{"id": 430434, "slug": "great-utopia", "name": "Great Utopia", "name_original": "Great Utopia", "description": "<strong>Sci-Fi Retro RPG in which you become humanity's last child, and last hope.</strong><br/><br/><strong>The Story:</strong><br/>For almost a century, the Great Utopia has kept the world under order.<br/>Everything was thriving, until tragedy struck in 2061.<br/>The Incubator, a machine that created humans, was broken.<br/>Any batch created after 2061 would be depressed and die at the age of 10.<br/><br/>Your story is both that of how tragedy began and how it ended.<br/><br/><strong>Features</strong><br/>Interactive storytelling, puzzles and turn based combat will give you around 2 hours of gameplay to complete this futuristic epic journey to save mankind.<br/>Anime style graphics, lovely characters, and fun dialogue will transport you to the world of Great Utopia, where you can visit its Capital City, it's Technological Advanced Buildings and even visit Cloud City, home to the Pillar of Science.<br/><br/><strong>Choose you Character</strong><br/>Start playing as any of 3 character classes:<br/><ul><li>Iron the Soldier: Master of weapons<br/></li><li>Tasha the Psychiatrist: Psychic power for both combat and defense<br/></li><li>Cloud the Scientist: A computer hacker with healing psychic powers</li></ul><br/><strong>Made with RPG Maker MV</strong><br/>RPG Maker MV has been pushed to its limits with puzzles and mechanics not found in any other game. You'll be impressed with the results.", "metacritic": null, "released": "2020-01-30", "tba": false, "updated": "2020-04-20T04:46:29", "background_image": "https://media.rawg.io/media/screenshots/e53/e536755da2b3859d102343286459f9c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Andres Cavallin"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Tools 4 Life"], "esrb_rating": null}