{"id": 430435, "slug": "super-crystal-hunter", "name": "Super Crystal Hunter", "name_original": "Super Crystal Hunter", "description": "<strong>Slade</strong> is a young and outstanding thief who has grown up between the filthiest thugs and bandits of a famous illicit activities guild, which, since immemorial times has ravaged the <strong>Eastern Lands</strong>.<br/><br/>However, the <strong>King</strong> of these lands, someone who was a respectable and fair person has dramatically changed; he has become greedy, sullen and excessively cruel.<br/><br/>Magically, he founded new elite of guardians who seemed to be possessed by a demon. They managed to find all the hideouts of this huge guild and they murdered all their members…<br/><br/>...except Slade, who could barely escaped.<br/><br/>Since then, the kid has remain hidden, planning his vengeance and a way to loot the Eastern Lands in order to reestablish a new and more powerful guild with him as <strong>King of Thieves</strong>.<br/><br/><br/><strong>World Map: </strong>You can move through it and choose multiple destinations.<br/>From the map it can be distinguished:<br/><br/><ul><li> <strong>Levels</strong>: Required-access destinations in order to advance in the game.<br/>  Blocked levels (in red) will not be available (in green) until the current level is finished (in gray).<br/></li><li> <strong>Special Zones</strong>: Everything that is not levels (normally in the shape of a house, or a tent). You can access to minigames so as to obtain more points or support items, or you can perform additional missions.</li></ul><br/><strong>Minigames</strong>: They serve as a complement of the main game and the additional mission.<br/><br/><strong>Bosses</strong>: They are in certain levels and each one has their own mechanics.<br/><br/><br/><ul><li> Beat all game levels. In those which allow bonus, the more you can unlock the better.<br/></li><li> Complete the additional mission. If you have unlocked the entire possible bonus too, you can enjoy an extra extension in the game.<br/></li><li> Discover all the achievements the game offers through Steam.</li></ul>", "metacritic": null, "released": "2020-02-16", "tba": false, "updated": "2020-04-20T04:47:21", "background_image": "https://media.rawg.io/media/screenshots/a7b/a7bda78ec7c33a84a7795fd3aa655df0.jpg", "website": "https://netherwareentertainment.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Netherware Entertainment"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Netherware Entertainment"], "esrb_rating": null}