{"id": 430462, "slug": "radical-rabbit-stew", "name": "Radical Rabbit Stew", "name_original": "Radical Rabbit Stew", "description": "Get your super spoons ready and whack those crazy rabbits into saucepans to free the space chefs - but think fast or the bunnies will attack! Featuring bite-sized pick-up-and-play action, fast-paced whack-a-rabbit gameplay, scintillating puzzles, super-sized boss fights, juicy pixel graphics and a sizzling soundtrack, RADICAL RABBIT STEW is a hare-raising action-arcade game perfect for new players and 16-bit retro fans alike.<br/><br/><strong>Scintillating Puzzles</strong> – Sink your teeth into puzzles and challenges with a range of rabbit foes, and acquire gameplay-altering spoons that keep puzzles fresh and fun.<br/><br/><br/><br/><strong>Super-Sized Boss Fights</strong> – Face off against unique bosses, each requiring different tactics to conquer. Whether it’s using enemy rabbits as ammunition or dodging incoming trains and smacking the drivers out, be prepared to think creatively to defeat each one.<br/><br/><br/><br/><strong>Seasoned Couch Multiplayer</strong> – Hop onto the couch to face off against friends in a  competitive yet light-hearted multiplayer mode. <br/><br/><br/><br/><strong>Sizzling Pick-Up-And-Play Action</strong> – Enjoy a mixture of expansive, side-scrolling levels and shorter, single-screen layouts, and have the freedom to hop in for bite-sized sessions or defeat those rascally rabbits entire worlds at a time.<br/><br/><br/><br/><strong>Sumptuous Arcade Art Style</strong> – Fun and vibrant pixel graphics that simultaneously complement and pay homage to the well-loved arcade genre.<br/><br/>", "metacritic": null, "released": "2020-07-16", "tba": false, "updated": "2023-05-25T12:05:24", "background_image": "https://media.rawg.io/media/screenshots/4bd/4bdb4c17e5f4c6783206abb3c743eb5d.jpg", "website": "https://radicalrabbitstew.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 99, "beaten": 1, "toplay": 6, "dropped": 1}, "playtime": 1, "achievements_count": 92, "ratings_count": 1, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Pugstorm"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Sold Out"], "esrb_rating": null}