{"id": 430423, "slug": "xia-yin-ge-pathofwuxia", "name": "PathOfWuxia", "name_original": "PathOfWuxia", "description": "<p>Path of Wuxia is the fourth title of Heluo Studio since the launch of the studio’s first title, Tale of Wuxia. Combine Wuxia world and school life with anime art style, it returns to the simulation gameplay well known by fans. Play as a young Xia who possesses extraordinary ability and join the academy known as the Hermitic Pavilions of Xia, grow strong along with various schoolmates and seek your own path of Xia.<br />\nA Wuxia school life Simulator<br />\nEstablished by the legendary master Dongfang, the Hermitic Pavilions of Xia strive to overcome the clannish culture of wuxia sects in this world, and focus on training righteous young Xias no matter where they come from. Accept teaching from various masters who come from various sects; exercise your mind and body; overcome masters’ challenges and quests; practice four kinds of arts and build up your personality; make friends and enemy; save those who are in need and try your best of being a Xia…In this uncommon wuxia school, what kind of Xia will you become?<br />\nGain trust and friendship of various schoolmates<br />\nYoung Xias who come from various sects are gathered at the Hermitic Pavilions of Xia. If you spend some time to get to know them, they will certainly become your dependable allies on your quests of Xia. This time of training together in the pavilions will be precious to both of you and your schoolmates. In the end, will you become brother and sister in arms, sweet lovers, or incompatible foes?<br />\nTurn-based battle with hexagon field and relations of five elements<br />\nThe classic hexagon turn-based battle returns once again since its debut in Tale of Wuxia. Aside from the combination of six types of weapon moves, internal styles, character traits and tactical maneuver of back stabbing or side assault; the five elements that each character possess are introduced. Understanding the relation of five elements in order to strike foes’ weakness and hide yours will be vital to achieve victory in battle. Use your special ability to turn the tide and overcome challenge with trusty schoolmates!<br />\nUncover long sealed past and seek your way of Xia<br />\nThrough your quests of being a Xia, you will gradually uncover the past of this world that is long sealed away. The relaxing peace is just the tranquility before another storm. As a righteous Xia, your “just deeds” will decide the fates of many. When everything falls apart around you, will you be able to face your past decisions and stay focus on your way of Xia?</p>", "metacritic": null, "released": "2020-05-01", "tba": false, "updated": "2020-05-01T12:26:00", "background_image": "https://media.rawg.io/media/screenshots/3c0/3c0b9db77773c464987e144f2c1be341.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 58, "toplay": 5, "dropped": 2}, "playtime": 5, "achievements_count": 20, "ratings_count": 4, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Heluo Studio"], "genres": ["RPG", "Indie"], "publishers": ["香港商河洛互動娛樂股份有限公司"], "esrb_rating": null}