{"id": 430419, "slug": "crash-the-game", "name": "CRASH THE GAME", "name_original": "CRASH THE GAME", "description": "Place a virtual bet. Watch the multiplier increase from 1x upwards! Cash out any time to get your virtual bet multiplied by that multiplier amount. But be careful because the game can bust at any time, and you'll get nothing!<br/>\n<br/>\r\n-Cash out virtual winnings on games in game like Squirmageddon and more all on a platform called Stean on CRASH THE GAME<br/>\n<br/>\r\n-Prove your the fastest clicker in the world on Whoopie Cushion 69 on stean.<br/>\n<br/>\r\n-Stream all the crash play on Snitch our virtual streaming platform.<br/>\r\nMore reputation = more cashout options but be careful some viewers may not like your decisions.<br/>\n<br/>\r\n-Level up and earn life time certificates which will be displayed on Snitch.<br/>\r\nAlso so much more to gain from leveling up- And way more to come!! <br/>\n<br/>\r\n-Cash out all your virtual winnings on in game virtual items from virtual weapon skins to virtual customizations.<br/>\r\nCustomize your house and yard plus more.<br/>\r\nDifferent in game virtual weapon skins (virtual pistols, virtual knifes and more)<br/>\n<br/>\r\n-Virtual in game deposit system allowing you to use your virtual mums virtual bank card if you have already maxed out your own virtual bank card.<br/>\n<br/>\n<br/>\r\nCome join the fun now and get hooked on CRASH THE GAME!!!", "metacritic": null, "released": "2020-02-22", "tba": false, "updated": "2020-04-20T04:37:46", "background_image": "https://media.rawg.io/media/screenshots/82d/82db767291ef2aa62fa50e642bd78271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kev Jackson"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Kev Jackson"], "esrb_rating": null}