{"id": 430418, "slug": "darkness-and-flame-enemy-in-reflection", "name": "Darkness and Flame: Enemy in Reflection", "name_original": "Darkness and Flame: Enemy in Reflection", "description": "The evil spirit tricked you. Now you have to make everything right, because others have tried and failed for centuries ...<br/>\n<br/>\r\n“Darkness and Flame. Enemy in Reflection” is an adventure game in the genre of Hidden Objects, with plenty of mini-games and puzzles, unforgettable characters and complicated quests.   <br/>\n<br/>\r\nPower of the Flame is restored, Alice and her friends escaped from the Dark Army. In search of a place to rest, they stop at a strange glade and allow themselves to relax ... <br/>\r\nHowever, in this new hostile world, one cannot lose its vigilance even for a minute. And the reckoning for carelessness will not take long ... Alice finds herself dragged into a battle with the evil that is older than darkness itself.<br/>\r\nShe'll have to solve questions that many generations of brave men couldn't. This time, friends won't come to the rescue - they have fallen victim to a powerful curse.<br/>\r\nWill Alice be able to make everything right? Will she find new friends that are ready to help? She was used to the dangers, but will her courage help in a world where no one hopes for salvation any longer?<br/>\r\nAlongside Alice you will explore the pristine beauty of Fertile Lands and find long-forgotten secrets. Solve puzzles and collect everything that can help her stop an ancient evil. Give people a new hope of salvation!<br/>\n<br/>\r\nFind out how to stop the ancient force that lured you into a trap<br/>\r\nExplore new lands in search of answers and solutions<br/>\r\nSolve lots of incredible puzzles<br/>\r\nGet help from new friends<br/>\r\nGather amazing collections and find dozens of morphing-objects.<br/>\r\nEnjoy stunning locations, magnificent graphics, exciting mini-games and puzzles.", "metacritic": null, "released": "2019-12-24", "tba": false, "updated": "2020-04-20T04:37:16", "background_image": "https://media.rawg.io/media/screenshots/1a3/1a378153dc7b20da8e360e65e2cf403f.jpg", "website": "https://five-bn.com/game/darkness-and-flame-enemy-in-reflection", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10}, "playtime": 7, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 565, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FIVE-BN GAMES"], "genres": ["Adventure", "Casual"], "publishers": ["FIVE-BN GAMES"], "esrb_rating": null}