{"id": 4309, "slug": "foosball-2012-ps-vita", "name": "Foosball 2012 PS Vita", "name_original": "Foosball 2012 PS Vita", "description": "For the first time ever, enjoy foosball on your PlayStation®Vita system. Play multiplayer matches, dominate the online leaderboards, or become a global champion in the single-player World Tour mode. <br/><br/>The Cross-Play feature will let you play against other players both on PS Vita system and PS3™, while cross-saving will let you continue playing the game on your PS3™ where you left off on PlayStation®Vita system!<br/><br/>Whether you enjoy foosball regularly or have played it only briefly before, this game's addictiveness and competitiveness will captivate you.  <br/><br/>- Online multiplayer &amp; global leaderboards.<br/>- 9 different tables, 6 balls, and dozens of customization options.<br/>- Play online against players on both PlayStation®Vita system and PlayStation®3 system!<br/>- Game Continuation feature lets you start playing on PS3™ and continue on PS Vita system anywhere you go.<br/><br/>Some functions and features may not be available on PlayStation TV.<br/><br/>1-4 player(s)<br/>Network Players 2-4<br/>Network Features<br/>256KB Minimum<br/>Touchscreen<br/>Dual Analog Sticks<br/>Motion Sensor<br/>Cross-platform play (PS3™)<br/><br/>  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.<br/><br/>GRIP Digital s.r.o. &amp; 3Division s.r.o., 2012", "metacritic": null, "released": "2012-07-24", "tba": false, "updated": "2019-08-02T16:23:39", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PS Vita"], "developers": [], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone 10+"}