{"id": 431007, "slug": "it_201_project_03_maulik_patel", "name": "IT_201_Project_03_Maulik_Patel", "name_original": "IT_201_Project_03_Maulik_Patel", "description": "<p>I have built a rudimentary game where upon clicking and dragging your cursor you can create various sizes of spheres, cubes and cylinders in different colors and make designs with them. You can clear the screen at will or the game will wipe itself after 3 seconds of drawing unless the toggle check is turned off. You can also erase what you drew by right clicking and dragging the mouse on whatever you had drawn previously. To change shapes you can click on the dropdown menu and to change the color and size you can move the sliders to your preferences. Sounds will be heard when creating the objects and can change what sound to hear from the dropdown menu. The objects drawn will have the laws of gravity apply to them and you can turn them off anytime from the checkbox. There is a shake option which will shake the whole screen and its contents you just have to press the shake button. You have the option to turn off the sound as well from the checkbox. Slow motion as a concept of time as a slider has also been implemented in this sprint. From now onwards upon pressing N the menu will shrink and grow in size giving it animation. There is a toggle for the prefab animations along with a dropdown menu for different animations. Beware that gravity and animations cannot coincide with one another. So at a time only one of the functions can work. Upon pressing S from now onwards the position of the sum in the game will also change which shows the shades of the different times of the day.</p>", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T07:35:44", "background_image": "https://media.rawg.io/media/screenshots/b9a/b9a4c8fa73ac30e0e0b0db61bbd3723e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Maulikcr7"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}