{"id": 43105, "slug": "dying-light-the-bozak-horde", "name": "Dying Light: The Bozak Horde", "name_original": "Dying Light: The Bozak Horde", "description": "<p>Who is Bozak? Survive his brutal challenges and learn more about the man who organized the quarantine zones trials in a brand-new game mode playable in single-player and co-op. In the Bozak Horde, you’re invited to the Harran stadium by a deeply-troubled psychopath named Bozak.<br />\nYet, if you want to leave that place alive, you need to face Bozak’s hordes of relentless zombies and fight your way through his vicious tasks. Accept the invitation, beat Bozak in his own game, and become the champion of the Harran stadium.</p>\n<p>ENTIRELY NEW LOCATION<br />\nThe previously inaccessible area has its doors open now. Discover the heart of Sector 0, the Harran Stadium, where the Harran outbreak began and face the sadistic psychopath born from the plague.</p>\n<p>BRAND NEW GAME MODE<br />\nGo alone or join your friends and beat Bozak’s game with the highest score. Thanks to the newly introduced leaderboards you can now compete with others and become the very best Dying Light player in the world.</p>\n<p>FIERCELY COMPETITIVE<br />\nTest your combat and parkour skills against sadistic trials that will make you sweat hard! Invite your friends for the ultimate Dying Light co-op experience. Are you going to make it till the end?</p>\n<p>NEW ENDGAME WEAPON<br />\nDefeat the horde and gain access to the Bozak Bow. Complete additional objectives to get electric, incendiary, and exploding arrows which will dramatically increase your chances for success.</p>", "metacritic": null, "released": "2015-05-26", "tba": false, "updated": "2024-03-31T12:35:06", "background_image": "https://media.rawg.io/media/screenshots/d76/d767da281203ac1f030a3bf74fbbf24e.jpg", "website": "", "rating": 2.9, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 7, "beaten": 16, "toplay": 3, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 20, "suggestions_count": 658, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC"], "developers": ["Techland"], "genres": ["Action"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": null}