{"id": 431099, "slug": "the-alchemist-itch-exocarrot", "name": "The Alchemist (itch) (exocarrot)", "name_original": "The Alchemist (itch) (exocarrot)", "description": "<p>Disclamer : The WebGL version is only available to give a preview, to play the game in good conditions, it is strongly recommended to download a version (Windows or Mac OS).</p>\n\r\nThe Alchemist\r\nDescription\r\n<p>Long ago, a mysterious alchemist found himself locked in a faraway dungeon.<br/>In that terrible dungeon, many creatures tried to kill him. fortunately the legend has it that he survived.</p>\n<p>Now it's your turn to be trapped in this terrible dungeon.<br/>Will you be able to accomplish the same feat as the mysterious man and become part of the legend in your own time?<br/></p>\n<p><strong>PS : Luckily before entering the dungeon you found a manuscript, the manuscript of the mysterious alchemist. Here's what it says in it.</strong><br/></p>\n\r\nInstructions\r\nMovements\r\n<p>You can move around the dungeon with [Z][Q][S][D], [LSHIFT] for running and jump with [SPACE].</p>\r\nInteractions\r\n<p>The [E] key will be very useful for interacting with your environment.</p>\n\r\nPotions\r\n<p>Once in the dungeon, you will face ruthless enemies. Your only means of defence will be the various potions you can find while exploring the place.<br/>Luckily, there are 4 types of primary potions :</p>\n<ul><li>The fire</li><li>The earth</li><li>The lightning</li><li>The wind</li></ul>\n<p>Each primary potion that you can find can be mixed with another and thus create a more powerful potion.<br/>By merging two potions, you get a new potion but lose the old ones.</p>\n<p><strong>To help you the mysterious alchemist has left a note in the book with all the potion recipes.</strong><br/></p>\n\r\nPotionsFireEarthLightningWindFire-LavaExplosionStorchEarthLava-MagnetSandLightningExplosionMagnet-SwiftWindStorchSandSwift-\r\n\r\nRooms\r\n<p>The dungeon has many rooms all full of surprises.<br/>Use the minimap to orient yourself.<br/>In the following you will find the following information:</p>\r\nEnemy:\r\n<p>These rooms are dangerous, so don't venture into them unprepared. You will find all kinds of terrible enemies.</p>\r\nPeaceful:\r\n<p>Luckily, the dungeon also has quiet rooms that are safe. Enjoy this rest !</p>\r\nWorkBench:\r\n<p>One of the most important rooms, you'll find a place to fuse your potions.</p>\r\nHeal:\r\n<p>In case of minor health problems do not hesitate to interact with the potion on the table, it will give you the strength to face the future.<br/>But be careful, you can only use the potion once per room, use it only when necessary.</p>\n\n<p>\n</p>\r\nEnemies\r\n<p>Are you ready to discover the enemies that inhabit this place.</p>\r\nSlimes:\r\n<p>Simple, but watch their jump.</p>\n\r\nSpiders:\r\n<p>They'll track and don't let go until you get rid of them.</p>\n\r\nDragons:\r\n<p>They look so sweet, but be careful. Their jet of flame will burn your body.</p>\n\n<p>It is highly probable that since its passage in such ancient times new creatures have appeared. Be on your guard!   <br/></p>\n<p>\n</p>\r\nBoss\r\n<p>The bosses are the most terrible creatures in this dungeon, but there's an easy way to deal with it, all you have to do is simply...<br/>Oh no, that page is missing, you'll have to do it on your own.</p>\n\r\nGood Luck !!", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T07:57:56", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c0ecd5a99409ea35f27493ff68a420.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["exocarrot"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}