{"id": 431168, "slug": "sunset-directive", "name": "Sunset Directive", "name_original": "Sunset Directive", "description": "<p>Gale is an old robot. One of the oldest, in fact. As a robot, the only thing Gale has over everyone else is a long battery life.  In the middle of a rest cycle, Gale receives new instructions from the impossible. Could it be that humans have given new orders?</p>\n<p>======</p>\n<p>Sunset Directive is a work of interactive fiction created for Ludum Dare 46 (Keep it Alive). I chose to do interactive fiction this time around because I have been working on Casement, an interactive engine for Twine. Sunset Directive uses Casement for inventory interactions, examination windows, and conversations. A good amount of changes happened during the jam, since this was the first time I put it to use! Several issues need to be worked out.</p>\n<p>Since Sunset Directive is choice-based interactive fiction, all you should need is your mouse or a mobile device. It should work fine on mobile (I put in extra queries for some of the windows at portrait).</p>\n<p>A note on mechanics. Casement has a system whereby you can use items that you're currently looking at (context-sensitive). Sometimes you might be asked for an inventory item, and you'll need to select it in your inventory. It doesn't come up too often, though, so I hope it isn't too confusing!</p>\n<p>======</p>\n<p>JSON for conversations was generated using the JSON Online Editor. It was immensely helpful for getting people talking.</p>\n<p>Audio samples were provided by DSK Music. Audio was compiled using LMMS.</p>\n<p>The font used in Sunset Directive is Quantico.</p>\n<p>#LDJAM #ludum-dare-46<br/></p>", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T08:12:47", "background_image": "https://media.rawg.io/media/screenshots/3d8/3d862fed3948c4e682d8dcd1362d26b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["incobalt"], "genres": [], "publishers": [], "esrb_rating": null}