{"id": 431273, "slug": "cosmic-cuisine", "name": "Cosmic Cuisine", "name_original": "Cosmic Cuisine", "description": "Cosmic Cuisine\r\n\n<p><strong>You are one of the worlds best chefs</strong> (they invented the fourth michelin star for you) and you have to prepare a strange dish, with even stranger ingredients, as you take part (obviously not very voluntarily) in a <strong>crazy intergalactic cook-off</strong>. Even though you are one of the best chefs on earth, you don't know how to work with any of these crazy ingredients and machines.  At the beginning of th competition the <strong>Alien King</strong> tells you what dish he wants, and then it's up to you to experiment with the ingredients: feel free, you can always <strong>use the bin to start all over again</strong>.</p>\n<p>\n</p>\n\n\r\nOur understanding of the GameJam's topic\r\n<p>When we first heard about the GameJam with this <strong>craft aspect</strong>, we thought about making a game were you're an old man who forgot all of his crafting recipes and the places he put his tools. But this didn't connect well with the <strong>alien theme</strong> we chose from the two themes revealed at the beginning of the Jam. We wanted to create a crafting game in which you have to <strong>experiment with the ingredients</strong> and you <strong>don't have well-known and logic crafting recipes.<br/></strong></p>\n\n\n<p>After you played our game please rate us for the Jam and leave a comment, what you liked about \"Cosmic Cuisine\" and what <strong>we could improve. :)<br/></strong></p>\n\n<p>Music used in the Game: <em>\"Surreal Chase\" by Eric Matyas Soundimage.org</em></p>", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T08:36:24", "background_image": "https://media.rawg.io/media/screenshots/070/070d36122b5563835535f3763df7c44b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nfvfire"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}