{"id": 431323, "slug": "the-last-sovereign-itch", "name": "The Last Sovereign (itch)", "name_original": "The Last Sovereign (itch)", "description": "<p>The Last Sovereign is an adult fantasy RPG that plunges you into the saga of a world torn between forces of lust and purity. As you enter the complex conflict, you forge a new path that will change the course of history!<br/></p>\n<p>...maybe. The thing is, acting like most heroes gets you killed, and most evil overlords' plans make no sense. The Last Sovereign is a game that twists your expectations for adult games, while fully embracing a reconstruction of some familiar old tropes to provide a lot of fun, sexy content. </p>\n<p>By telling a story that has sex as an integral component, The Last Sovereign offers a deep storyline that naturally includes sex scenes. No need to grind for hours or lose to every enemy to find the content. Not only will you adventure in a world where sex is a weapon, you'll build a harem of fully-realized characters with their own reasons for being with you... in and out of the bedroom.<br/></p>\r\nFeatures\r\n<ul><li>Over 50 hours of gameplay.\r\n</li><li>Over 150 sex scenes, currently being illustrated.\r\n</li><li>Over 25 fully illustrated scenes, including over 62 images total.\r\n</li><li>Manage the differing opinions and priorities of 20+ harem members.\r\n</li><li>Invest in over 140 different assets that have an impact on the plot and provide returns as the story progresses (Chapter 1+).\r\n</li><li>Negotiate deals between kingdoms and organizations, shaping the course of nations and religions (Chapter 2+).\r\n</li><li>Upgrade and customize a home base (Chapter 4+).</li></ul>", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T08:48:30", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee80d28ed25774ac61400cd2af494334.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SierraLee"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}