{"id": 431418, "slug": "my-pets-dungeon", "name": "My Pet's Dungeon", "name_original": "My Pet's Dungeon", "description": "<p>My Pet's dungeon is a Dungeon crawling RPG with your new pet. Unfortunately your new pet seems to have no regard to safety at all and would likely run into the dungeon no weapons, no protection and most importantly no plan!<br/></p>\n\n<p>To make sure your new friend doesn't die immediately there has been a shop stationed outside the dungeon with all the essentials like: Broad swords, potions and of course pizza!<br/></p>\n\n<p>Now for only 8 gold!<br/>Where was I oh yes... If you don't have any money don't fret the shop has a very lenient policy on selling Items. They'll buy anything including that bit of slime you carry in your bag for no reason. </p>\n\n<p>If you need to get Items just go through the dungeon and kill some of the monsters that lurk there. Although I do need to warn you that improper extraction time (flee at the right time, I like sounding smart) may end up in a swift and unjust death for your friend.<br/></p>\n\n<p>Unfortunately your pet doesn't like running away and will sometimes ignore your cry's to flee and keep fighting in these situations we advise a dose of steak to keep your pet happy. Happiness does no only keep your pet from dying after IGNORING YOU FOR THE FIFTH TIME!!!! sorry got a bit carried away. An increase in happiness will cause your pet to be more effective during battles.</p>\n\n<p>Thank you for reading this explanation although if you are coming from the Ludum Dare site I'm kind of confused why you didn't read it there. unless you did and you were looking to see if there were any changes of which there were none</p>\n<p>Wait...</p>\n<p> Tip: When you enter the dungeon your pet gets happier so fleeing isn't that bad, most of the time.<br/></p>", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T09:13:33", "background_image": "https://media.rawg.io/media/screenshots/cf2/cf24523e74448448596f0266db4109db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["N.O. games"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}