{"id": 431842, "slug": "a-dark-place-2", "name": "A Dark Place 2", "name_original": "A Dark Place 2", "description": "<p>Demo Notice :</p>\n<p><strong>This is the build release for the A Dark Place 2 Demo. The average playtime length has been estimated from 30 to 40 minutes long. Please report any bugs you may encounter during the experience. Thank you and have fun!</strong></p>\n<p>Version 1.5.0 or Below :</p>\n<p><strong>If framerates are running low some slowdown or speed problems may occur during the experience. Setting your game to performance mode in the configuration menu will significantly solve these problems by sacrificing most demanding graphical appearances. Only use this option when you feel like it is needed.</strong></p>\n<p>Credits :</p>\n<p>My major thanks go to @NotGabbyMemelord and @Lilou37 for helping out with the artwork and character designs. And thank you to all who have played, followed, purchased, and/or donated on my releases. All of the received help has kept the development flowing smoothly and we couldn't have done it without your support. Thank you!</p>\n<p>Story Introduction :</p>\n\n<p>You are an important fragment called upon from the legends. The one that takes the rose to recreate the realms of the forgotten past to a new world. The old world from the original realm has become withered as the curse of Nightmare continues to grow power. You will soon discover through the emulations of reality that the truths of life are not what they appear to be. Now you will travel to these worlds and discover that you are not alone.</p>\n<p>The Continuation of a Dark Place :</p>\n\n<p>As you return to the depths of the emulated reality, you must find a way to get back to the realm of the withered. This is the place that was considered the finale in the original world before the curse. Nightmare has recreated this forgotten area into his very own realm to represent the ultimate power of his own destruction. This place can now lead to a hidden magical rose which comes with the ultimate power to reset time back before the curse consumed the world. You'll soon discover the hidden truth beyond these emulated realities through the virtual timelines of the past and future.</p>\n<p>Gameplay Controls :</p>\n\n\n<p>W -&gt; Move forward</p>\n<p>A -&gt; Move left</p>\n<p>S -&gt; Move backward</p>\n<p>D -&gt; Move right</p>\n<p>F -&gt; Toggle flashlight when obtained</p>\n<p>Q -&gt; View inventory/items</p>\n<p>E -&gt; Enter through doorways, interact with objects, obtain key items, cycle through dialog.</p>\n<p>Ctrl -&gt; Crouch to pickup small key items, crawl through small tunnels, sneak silently away from danger.</p>\n<p>Left Click Hold -&gt; Hold an item/box.</p>\n<p>Left Click Drag/Let go -&gt; to throw a carried item using physics features.</p>\n<p>Right Click -&gt; Attack button for sledgehammer when equipped.</p>\n<p>Mouse wheel scroll -&gt; Toggle sledgehammer when obtained</p>\n<p>You can break carryable objects open by throwing them with force against walls.</p>\n<p>Level Selector :</p>\n\n<p>Some levels may be grayed out on some pages. This means that they are not finished nor developed yet.</p>\n<p>Not all Easter Eggs are shown in the tab. More updates are being planned ahead for featuring more of these throughout new public releases.</p>\n<p>Gameplay Performance Enhancements :</p>\n\n<p>(New) Motion Smoothing Beta - Enhances the default rendering to become smooth to all responding movements. This solution was created for the purpose of eliminating any screen jitter for the best gameplay experience. This works best when the desired framerate is reached. If you notice any animation slowdowns due to lack of frames, switch to Fixed Motion to solve this issue.</p>\n<p>(Legacy) Fixed Motion - The older method of motion that uses a fixed runtime instead of timed runtime. This may introduce some jitter during the gameplay without any smoothing to the image. This does solve certain slowdown problems with motion on older machines. Therefore, this was kept as a compatibility method.</p>\n<p>Games Related to the Series :</p>\n\n<p>A Dark Place: https://gamejolt.com/games/ADarkPlace/323680</p>\n<p>My Place: https://gamejolt.com/games/Myplace/254023</p>\n\n<p>Listen to the soundtrack (SoundCloud)</p>\n<p>https://soundcloud.com/mike-macson</p>\n<p>Community Group :</p>\n<p>https://gamejolt.com/c/A-Dark-Place-kfkhj4</p>\n\n<p><strong>-XerStudios 2020</strong></p>", "metacritic": null, "released": "2020-04-19", "tba": false, "updated": "2020-04-20T10:47:29", "background_image": "https://media.rawg.io/media/screenshots/a56/a563ad24056329098c895314597df740.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XerStudios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}