{"id": 43193, "slug": "zarvot", "name": "Zarvot", "name_original": "Zarvot", "description": "Where cubes find love, shoot lasers, and lay waste to handcrafted arenas.<br/><br/><br/><br/>This is a game of cubes.<br/>Tiny, adorable cubes with hopes, dreams, unrequited loves… and unlimited destructive power.<br/><br/>In <strong>Story Mode</strong>, you’ll follow the adventures of Charcoal and Mustard as they search for the ultimate birthday present to cheer up their best friend, Red--who is feeling quite blue. Take the subway to nine unique worlds where you’ll battle rogue bananas, evil milk cartons, and crayon box spiders--whatever it takes to make Red happy again!<br/><br/>In <strong>Multiplayer Mode</strong>, invite your friends and challenge them to cutthroat competitive cube combat! Show your skills with precision lasers and rapid fire guns, and master the devastating radial beam. Blast, warp, and crash through walls in over a dozen destructible thunderdomes across a variety of game modes.Key Features:<br/><strong>• CAPTIVATING STORY ABOUT CUBES: </strong><br/>Finally, a full length narrative where cubes take center stage! Featuring the story of three cube friends. Follow the captivating story of Charcoal and Mustard, two cubes trying their best to put together the ultimate birthday gift for their best friend.<br/><br/><strong>• OVER A DOZEN MULTIPLAYER MAPS: </strong><br/>Dash, zip, and destroy over a dozen destructible handcrafted multiplayer thunderdomes! Fight in serene forests, in dramatic thunderstorms, in a bathtub, and more. Break through walls, dodge deadly discs, and use the environment to win!<br/><br/><strong>• DELICIOUS ARCADE ACTION: </strong><br/>Take the subway to over nine different worlds filled with evil, mostly edible enemies. Zip around corners with your quick cube moves, blast your adversaries with precision nose lasers, chain together destructive combos, and use your Chomp super move to take down all challengers!<br/><br/><strong>• EPIC BOSS BATTLES: </strong><br/>Take on epic bosses--evil masterminds who hate happy birthdays. Bosses include the cube’s natural enemies, such as large, sentient bananas and frozen milk cartons.<br/><br/><strong>• STUNNING CHARACTERS: </strong><br/>Take in the cutting edge, industry-leading artistry of the fully rigged and animated cube characters. These cubes look so good, it’s unreal!<br/><br/>", "metacritic": null, "released": "2018-10-18", "tba": false, "updated": "2019-08-28T22:06:10", "background_image": "https://media.rawg.io/media/screenshots/942/942947e051c29366a860de51ffd87633.jpg", "website": "http://zarvot.sam-eng.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC", "macOS"], "developers": ["Samuel Eng", "snowhydra games"], "genres": ["Action", "Adventure", "Arcade", "Indie"], "publishers": ["Samuel Eng", "snowhydra games"], "esrb_rating": null}