{"id": 432113, "slug": "rabbit-ccara001", "name": "Rabbit (ccara001)", "name_original": "Rabbit (ccara001)", "description": "<p>This is a game I made of an adventurous rabbit. Everything you see in this game is made manually in JavaScript (p5 library), no external images. Compared to my first game made in JavaScript (p5.play) - Flagrunners that is also displayed on my itch.io page, this Rabbit game has been made with almost if not all my knowledge of JavaScript. It is the language I am most comfortable coding in. The last time I have coded in JavaScript was in my 2nd year of University and even so, we have not made any games. We only did graphical work. It may not seem like much but it was truly challenging to make everything and have it work smoothly after a long time of not coding in this language. </p>\n<p>Jump: SPACE BAR</p>\n<p>Movement: WASD or ARROW keys</p>\n<p>There is a score in the top left corner of the screen. You (the rabbit) will have 3 lives. If you fall into the canyon, you lose a life but you respawn back on the ground. There is also a score for the amount of carrots you can pick up.</p>\n<p>Even though it says \"press SPACE to continue\", you must refresh after winning or losing as I have not made a 2nd level yet. I did try but it broke my code so I left it as it is now. I might give it a go again after I gather more knowledge but for now I would like to publish a working version.</p>\n<p>The reason I made this game is because Easter was approaching and it reminded me of my first year of University when me and my Games Programming mates made simple easy games at the time, similar to this one in terms of graphics but much easier. I wanted to test my knowledge in JavaScript and see how much more I can do now that a lot of time has passed. During the Coronavirus times, thinking of my first two years of University and the many things I have accomplished and the people I was around while learning all those new things keeps me sane. The rabbit turned out pretty adorable and it being outside and eating its favourite food (the carrot) makes me smile and wish that I was outside eating a Burrito, Chicken Doner or my favourite Thai meal.</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2020-04-18", "tba": false, "updated": "2020-04-20T11:51:34", "background_image": "https://media.rawg.io/media/screenshots/5a5/5a5124e6e333293d2edd46215b821d06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ccara001"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}