{"id": 432245, "slug": "meatpossible-chapter-15-itch", "name": "MeatPossible: Chapter 1.5 (itch)", "name_original": "MeatPossible: Chapter 1.5 (itch)", "description": "<p>As part of an elite team of hopeful heroes, play as Lunaya, the naturally talented Knight Captain of Epicton Kingdom, and save it from the siege imposed by the Pig’s tribe, who have brought their cooks, the Flies, along for the battle.<br/></p>\r\nRead the Comic Book\r\n<p>MeatPossible is a transmedia project covering different formats such as the graphic novel and the video game. Chapter 1.5 tells the side story of the main story plot contained in the comic book. The Webtoon/Comic pages show right to the point that the game is supposed to continue.<br/></p>\r\nExecute Devastating Combos\r\n<p>Everytime you remove an obstacle, your chain of combos will be increased one by one. Each combo comes with a set of visual animations that help you levelling and increasing your score even faster. There are up to 10 different animations!<br/><br/></p>\r\nMerciless Unique Boss Fights\r\n<p>Build your score an strengthen your character, and you will eventually encounter the Pig Bosses. Every Pig Boss has their own patterns and traits. Figure out their moves and defeat them with no mercy. The more you get through the adventure, the higher amount of adrenaline is needed to beat these creatures.<br/></p>\r\nExtra Side Missions &amp; Mini Games\r\n<p>Apart from beating Pig Bosses, you will have two side quests to complete. First, accomplish the permanent Objectives set in the main menu. Second, complete the random bonus Missions given at the start of every round. Last but not least, challenge yourself to various Mini Games throughout the journey!<br/><br/></p>\r\nOld-School Pixel-Art Visual Style\r\n<p>The game features pixel-art old school RPG visuals which increasingly enhance the whole experience on a whole. Its retro graphical style will make the likes of hardcore gamers and casual users alike.<br/></p>\r\nSuitable For Everyone\r\n<p>MeatPossible: Chapter 1.5 is suitable for everyone and it is now up to you to save and protect the people of the Epicton Kingdom.<br/><br/></p>", "metacritic": null, "released": "2020-04-15", "tba": false, "updated": "2020-04-20T12:25:11", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fa4809dde58271aa0cd5a1964e20d5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["commonvisual"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}