{"id": 432359, "slug": "abu-dabi", "name": "Abu Dabi", "name_original": "Abu Dabi", "description": "<p>Abu Dabi is a VR multiplayer competitive sports game for Oculus Quest. In this game players shoot projectiles with their slingshots at each other's rings. By hitting rings players inflict damage to one another. The rings are continuously scaling in size, and the smaller the ring is when you hit it, the more damage you deal.<br/></p>\n<p>To defend against opponent's incoming projectiles, players can turn their free hand's palm towards the enemy. This will make a shield appear. Players can block opponent's projectiles this way. To make it easier to block, players' shields also have time stopping power. If the time stopping power is charged, player can press a button and for a couple of seconds the time will drastically slow down, allowing player to get their shield into place and block the projectile. If the player manages to block a projectile, time stopping power instantly recharges to full.</p>\n<p>The projectiles move on the dragon tail with constant speed and spawn rate, however, if your ring gets hit, there is a chance for every projectile on the tail to disappear. That chance varies by how much damage was dealt with a successful shot. So it is highly recommended to defend, because you might end up without any projectiles if your opponent is accurate and lucky.</p>\n<p>The game ends on these conditions:<br/>1. Your or your opponent's health drops to zero;<br/>2. Time runs out. (hourglass)</p>\n<p>If the time ran out and both players have the same amount of health, the game changes to sudden death mode, which means the first one to hit opponent's ring wins</p><p>The game is in early alpha stage, so there are bound to be occasional networking issues. For now the best way to play is for both players to be in the same room using the same wifi.<br/></p>\n<p>If you like the game, or found some bugs you want to report, please join the official Abu Dabi discord community https://discord.gg/PMRe6Dj</p>", "metacritic": null, "released": "2020-04-17", "tba": false, "updated": "2020-04-20T12:54:39", "background_image": "https://media.rawg.io/media/screenshots/9f9/9f96dd1269904469360057a431b940f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GlukVR"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}