{"id": 432356, "slug": "cosmotaxi", "name": "CosmoTaxi", "name_original": "CosmoTaxi", "description": "<p>Far, far away, in another galaxy, a fierce war of worlds occurred, worlds and planets, stars and galaxies were destroyed. After, in the present, when the world was almost restored, but the planets remained destroyed by asteroids ...<br/><br/>                              You ...<br/>                                                      ... ordinary cosmotaxist</p>\n<p>Management: WASD-main flight, QE-side flight. </p>\n<p>Boost </p>\n<p>Fill    (Unfortunately, there is no refueling option yet, rejoice at the endless fuel XeX)</p>\n<p>How to play: You appear among asteroids (so far only among asteroids, there will soon be stations, possibly planets) on which people live, some of them need to be brought to another asteroid (station), and so, many people have no transport, but there was A system has been invented, put a “Taxi” plate on each asteroid, which burns if you need it, otherwise it does not burn. </p>\n<p>You can only land on an asteroid from above, at low speed. Further, if you were needed (Passengers teleported to you (Yes, teleportation works only at short distances, technology does not give more, energy costs)), then you need to follow the radar to the cross. </p>\n<p>Also upgrade your rocket, rocket speed is UNLIMITED! (and so conceived)</p>", "metacritic": null, "released": "2020-04-17", "tba": false, "updated": "2020-04-20T12:53:47", "background_image": "https://media.rawg.io/media/screenshots/643/6433bfba73e1f4d095b7eff97ce1a3fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IldusEps"], "genres": [], "publishers": [], "esrb_rating": null}