{"id": 4324, "slug": "get-up-and-dance", "name": "Get Up And Dance©", "name_original": "Get Up And Dance©", "description": "Get Up And Dance © is the ultimate dancing game!  Featuring hit songs from Pussycat Dolls, Taio Cruz, Jessie J, Timbaland and Katy Perry, Gwen Stefani, and much more! Whether you are the star performer or prefer to stay out of the limelight as a backing dancer, Get Up And Dance offers a variety of options to bring out the dancer in everyone. Play Get Up And Dance Party Mode with up to eight friends. Create your very own dance troop and compete in fun and exciting party games such as Party Mix, Last Man Standing, and Tug of War. Perform as the lead or backing dancer with group routines specifically choreographed for Get Up And Dance. Enter your troop in a talent competition and battle through 10 rounds to win the Championship! Enjoy even more hours of dancing with additional features like Shape Up Mode, Rehearse Mode and Jukebox. With so much great music to get you moving, Get Up And Dance is the hottest and most exciting dance game available anywhere!     \r\n<br/><br/>\r\nGet Up And Dance ©2011 O-Games, Inc. Published by O-Games, Inc. O-Games and the O-Games Logo are registered trademarks of OG International Ltd. Developed by Gusto Games Ltd. Gusto and the Gusto logo are trademarks of Gusto Games Limited. PlayStation®Move motion controller and PlayStation®Eye (sold separately) required to use this product.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.", "metacritic": null, "released": "2011-11-04", "tba": false, "updated": "2019-08-02T16:23:38", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Digital Gaming"], "genres": [], "publishers": [], "esrb_rating": "Teen"}