{"id": 432617, "slug": "project-roc", "name": "Project ROC", "name_original": "Project ROC", "description": "<p><strong>WHO WE ARE</strong></p>\n<p>We’re a small team of creators and game developers. We believe games should be created by passionate gamers, regardless of programming knowledge or artistic ability. We are here to make it easier for anyone to create, launch, and earn a living making games on any platform.</p>\n\n<p><strong>WHAT WE DO</strong></p>\n<p>We’re empowering the next generation of game creators by building a robust game editor currently capable of publishing games for PC, web, and mobile. To this end, we’re hosting the <strong>Accelerator Program</strong> to find the best talent capable of making great games, regardless of previous game development experience.</p>\n<p>Here’s a few of the games we’ve made: <strong>Wild Sky TD</strong>(Google Play Editor’s Choice) and <strong>Wild Castle</strong>. We made these games with the same tools we’re offering to creators today. We think you can make better games than these.</p>\n\n<p><strong>WHAT WE OFFER</strong></p>\n<ul><li><strong>A powerful game editor</strong>, capable of publishing games for PC, web, and mobile.</li><li>Cartoony fantasy art assets that can be used in a wide variety of genres and game modes.</li><li>Advice and mentorship in production, game design, analytics, and monetization.</li><li><strong>A standard publishing deal</strong> for creators that successfully complete the accelerator program and are ready to launch their game.</li><li>A path towards earning a living making games with us.</li></ul>", "metacritic": null, "released": "2020-04-23", "tba": false, "updated": "2020-04-24T02:20:09", "background_image": "https://media.rawg.io/media/screenshots/302/3027bbb0c61e78475de3c32ec99e9030.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["devcrunchy"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}