{"id": 432645, "slug": "dragon-evotcg", "name": "Dragon Evo:TCG", "name_original": "Dragon Evo:TCG", "description": "<p><strong>DragonEvo:TCG </strong> is a free-to play online card game with elements of RPG and traditional CCGs. The game is set in the DragonEvo fantasy universe, where you must choose one of the rivaling factions on the continent of Erendor. <br/><br/></p>\n<p>Choose your path wisely – bring peace and balance to the land or complete domination!</p>\n\r\nMain features:\r\n<ul><li>Turn-based card game with elements of RPG &amp; TCG</li><li>A deck-building game with almost endless combinations of cards and equipment</li><li>A rich and story-driven environment based on the original DragonEvo universe</li><li>Play against players on all platforms, including mobile</li></ul>\n\r\nGameplay\r\n\n<p>Each deck has a main playable Hero card that a player must choose. Most cards can use equipment to change their stats or add special action effects. All players will be able to play practice matches against the computer, and when they feel they are up to it they may test their skill in ranked mode or challenge one of their friends. All cards can be acquired without cost by winning card packs or use ingame currency to buy these. <br/></p>\n<p>There are over 100 cards in the game that can be acquired along with more than 50 different equipment or consumable action cards that can suddenly change the course of the game. The game focuses on strategy above all, and anyone venturing beyond the starter pack will soon discover the potential endless combination and strategies they may choose. <br/></p>\n\r\nDeckbuilder &amp; Equipment \r\n\n\n<p>Don’t like your deck or just want to swap out some cards, or perhaps you wish to try on a new hero and a whole new faction? Create a new deck in our deck builder, equip your cards with special equipment to surprise your opponent and change the course of the game.<br/></p>\n\n\n\n\r\nIf you enjoy DragonEvo, consider SUPPORTING us! \r\n\n\n<p><strong>Key features &amp; Game Modes</strong><br/></p>\n<p><strong>Friend challenge:</strong>  Acquired a new card backside or just want to test your skill against your friends? Challenge them for a friendly duel via your friendlist. \r\n  </p>\n<p><strong>Ranked mode:\r\n </strong>Compete against other players to get to the top of the ranking lists, receive cards packs and achievements. \r\n  </p>\n<p><strong>Practice mode:</strong>\r\n Test your new deck against our AI before testing it on other players, find your strength and weaknesses before your opponent and unlock cards packs as you play. \r\n  </p>\n<p><strong>Adventures:\r\n </strong>Ready for a challenge? Play one of the games many adventures to see if your deck is up to the task. The adventures have been customized to give you a different challenge everytime. Or perhaps you may feel you are ready for the main Adventure boss: “Devil from the depths”. \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Collection:\r\n </strong>Browse your card collection, level up your cards or sell one and buy one you are missing. \r\n  </p>\n<p><strong>Market:</strong>\r\n Browse for new cards or equipment. Buy new Heroes, card packs or consumable action cards in our ever-expanding market section.   \r\n  </p>\n<p><strong>Clans:\r\n </strong>Invite your friends to your clan, acquire special clan perks* and become the top ranking clan for extra ordinary season rewards*\r\n  </p>\n<p> </p>\n<p><strong>Pay to win:\r\n </strong>We pride ourselves in that we have no pay to win mechanics and never will have. All cards can be bought by players for in-game currencies, and these currencies can only be acquired by playing the game. Although this reduces our monetization opportunities and may turn off some players, we feel we are striking a good balance between responsible gaming and providing an awesome game experience.\r\n</p>", "metacritic": null, "released": "2020-04-23", "tba": false, "updated": "2020-04-24T02:25:59", "background_image": "https://media.rawg.io/media/screenshots/dae/dae3092d4b6df14f7636b212133dc3f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["zegenie studios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}