{"id": 432608, "slug": "till-death-do-us", "name": "Till Death Do Us...", "name_original": "Till Death Do Us...", "description": "<p>(Please read the Important Note &amp; Bonus Ending Requirements Below!)</p>\n<p><strong>Synopsis</strong></p>\n<p>In every great RPG, nobody ever REALLY thinks about the well being of the NPC's, what happens to their lives if evil were to triumph?</p>\n<p>In TDDU, The all too familiar Legendary Heroes have Fallen and the Demon Prince wastes no time leading what's left of humanity to its extinction by unleashing fiendish plagues on the Holy Kingdom, home to the last living human settlement in the world.</p>\n<p>You play the role of Mya, a normal girl who works at the kingdom's church; simply called \"Sanctum\".  Accepting her fate,  she plans to escape the crumbling castle to rendezvous with her fiance', so they may embrace death together. </p>\n<p>---------------------------------------------------------------------------------------------------------</p>\n<p>Gameplay</p>\n<p><strong>Obstacles All Around!</strong><br/>TDDU offers no battle, instead you are faced with a poisonous mist that will chip away at your health for the entire duration of your campaign.<br/>In addition, various puzzles and vile demons that threaten to kill you will hinder your journey at every turn.</p>\n<p>Your object is to reach the Courtyard before the one of these obstacles get the best of you.</p>\n<p><strong>Prayer System - Delay the inevitable &amp; Survive till the end!</strong><br/>During Mya's Swan Song Crusade she'll come across several bodies of former friends and acquaintances. <br/>When Interacting with those bodies, Mya will pray for them, allowing the fallen to pass on to the \"Lord of the Light\" .</p>\n<p>Prayers also cleanse Mya's own soul little by little, restoring small amounts of HP. The more you pray for the dead the longer you'll last against the mist!</p>\n<p>-----------------------------------------------------------------------------------------------------</p>\n<p><strong>Bonus Ending</strong></p>\n<p>The game on its own is a complete short story, however for those who are curious and want to know a *little* more, I've constructed an unlock-able Bonus Ending that may tie up some loose ends! to unlock it you must pray for all 37 of the people that Mya comes across! </p>\n<p>Trouble keeping count? no worries, when you save/load the game there is a counter keeping track:<br/></p>\n\n\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p><strong>Important Note</strong>: </p>\n<p>NOT FOR THE FEINT OF HEART. What I mean by that is this game has a very morbid setting and, quite frankly, plot line. It is not a cry for help on my part, it was more so an idea I had last year and completely freestyled during this jam until it became this and I am honestly proud as this is MY FIRST GAME EVER RELEASED.<br/></p>\n<p>There are heavy death-related themes, pixelated gore and suggestive topics lightly touched on. Please be advised before playing the game or even looking at the screenshots (however the screenshots are a perfect example of the extent of what this game offers, the theme doesn't get \"darker\" than whats seen below). THIS IS NOT A HORROR GAME, and is not meant to offend or depress anyone.</p>", "metacritic": null, "released": "2020-04-23", "tba": false, "updated": "2020-04-24T02:18:24", "background_image": "https://media.rawg.io/media/screenshots/a4f/a4f48f90591ece0674b8146aa857b828.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ConflictX3"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}