{"id": 432776, "slug": "critical-landscape-scale-force-of-nature", "name": "Critical Landscape-Scale Force of Nature", "name_original": "Critical Landscape-Scale Force of Nature", "description": "<p><strong>Can you protect the dam and the depending ecosystem for all 8 waves?<br/></strong></p>\n<p><strong>Happy Earth Day 2020!</strong></p>\n<p>Beavers are undoubtedly adorable - these chubby rodents look like overgrown hamsters that come with a waggling paddle as a tail. Part of their charm comes with how relatable they are: like many of us, they create monogamous partnerships and raise families in cozy homes that they work hard to build. It is this industrious nature that beavers are better known for. There's a good reason why \"beavering away\" or \"busy as a beaver\" are common sayings to describe working hard. Beavers diligently work from dusk til dawn to chomp through trees and build their dams and lodges. In many ways, beavers embody the wholesome values of the classic American Dream: work hard and raise a family in a home you bought (or built) yourself. </p>\n<p>However, the history of beavers has not been an idyllic analogy. Beavers were almost hunted to extinction in the 1800s for food and clothing. Nowadays, conservation efforts have brought beaver populations back up to healthy levels, but they still face threats from deforestation and lack of water flow from climate change. Beavers can't build lodges if there are no trees to build them with, or if there is no water to dam in the first place. </p>\n<p>Beavers greatly aid in combating climate change and benefit the forest ecosystem. Beavers build dams to create ponds of still water so that they can construct the lodge that they actually live in without any problems. These ponds often spreads to become wetlands, and supports incredible biodiversity. Animals like frogs, salmon, and ducks, among others, are all aided by the hard work of beavers. The dams beavers build also provides an effective way to combat climate change, by storing water for human access, reducing floods, inhibiting wildfires, and trapping pollutants. All we humans have to do is leave them alone to do their thing. </p>\n<p>Beavers are incredible workers and can be seen as a linchpin species because of all that they do for the watershed ecosystem and even for the environment on a global scale. Protecting them is extremely important, especially as residents of the verdant Pacific Northwest. For Earth Day 2020, we hope to increase appreciation of these wonderful animals and what they contribute. We encourage you to be vigilant for construction projects that are irresponsible about cutting down forests or disrupting beaver dams, lodges or the waterways and ponds they are build on, and to further our mission of awareness. </p>\n<p>Thank you for reading, and we hope you enjoy our game!</p>\n<p>essay source</p>\n<p>Credits:</p>\n<p>Developer: Douglas Winegarden</p>\n<p>Sound and Music: Jake Kargl</p>\n<p>Assets and Animation: Zachary Tenorio</p>\n<p>Special thanks to Sam Xiao for writing our game's description and Andrew Swanson for creating our video promotional material. And thank you to IndieCade and the sponsors of the Climate Jam for inspiring all of us to do something with our time in quarantine.</p>\n<p>Tips:</p>\n<ul><li>Trees will fall towards where you last chomped it</li><li>Try to stun enemies as they walk under a falling tree</li><li>Use the trees to build walls and winding paths</li><li>Try to save up acorns for wave 6</li><li>Drop 3 trees on the excavator to disable it</li><li>Block the excavator with trees so it cannot move towards your dam</li><li>This game takes about 15 minutes to beat</li></ul>\n<p><strong>Made for the IndieCade Climate Jam from Friday April 17th to Wednesday April 22nd.</strong></p>", "metacritic": null, "released": "2020-04-23", "tba": false, "updated": "2020-04-24T02:56:50", "background_image": "https://media.rawg.io/media/screenshots/10b/10bbd3bd3cf89cb4b1f13373cce0c51d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DougDevs"], "genres": [], "publishers": [], "esrb_rating": null}