{"id": 432724, "slug": "farm-attack", "name": "Farm Attack", "name_original": "Farm Attack", "description": "<p><strong>What Is Farm Attack?</strong><br/></p>\n<p>Welcome to Farm Attack! A game I've been developing over the last couple months. it was originally a quick demo for my school, but I recently updated and expanded upon. The goal of the game is to survive 3 rounds and defeat the final boss to win the game. You grow your own ammo, either it be a Potato Bomb or a Red Hot Chilli Flamethrower!</p>\n<p><strong>How Do I Play?</strong></p>\n<p>You begin by selecting the seed you wish to plant. Every plant has a different attribute that can help you survive. If you have enough money or can pay a partial amount, you'll be able to buy the seed. (If you go into debt you will need to find money scattered around the map or grow more money).  Proceed to walk over to any plot of land and press \"x\". After some time, your plant will be ready to harvest. Some plants such as the Chilli are consumables, meaning once you pick it up it will instantly activate. Others such as the Carrot are a source of ammo, meaning you can store and use it any time.</p>\n<p><strong>What Should I Do If I Encounter A Bug?<br/></strong></p>\n<p>Please report any bugs to me and once  I have a list of them I'll do a big bug fixing update. There's a few issues that I am aware of but so far I have found no \"game breaking\" bugs that result in a crash. Email me at damiangamedev@gmail.com</p>\n<p><strong>CREDITS</strong></p>\n<p>Background Music: bluegrass banjo - country banjo</p>\n<p>Inspiration and Help: Brackeys, BlackThornProd, Jonas Tyroller and my lecturers for initially helping with my first prototype.</p><p>My twitter:  https://twitter.com/DamianGameDev</p><p>My youtube: https://www.youtube.com/channel/UCNGyFkjf-OP1AK889VToWnA</p>", "metacritic": null, "released": "2020-04-23", "tba": false, "updated": "2020-04-24T02:43:27", "background_image": "https://media.rawg.io/media/screenshots/adc/adce95de9d42b4e5ab8d6ac5e3afb9a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Damian"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}