{"id": 432979, "slug": "gakopops-very-terrible-first-game", "name": "GaKoPop's very terrible first game", "name_original": "GaKoPop's very terrible first game", "description": "<p><strong>What exactly is this?</strong></p>\n<p>\"Maze Game\" or as I like to call it \"GaKoPop's very terrible first game\" was the first ever game I worked on in Unreal engine and was handed in as the product for my Games Design Tools module in my first year as a games design student at Canterbury Christ Church university (I got 71/100 btw)</p>\n<p><strong>What was the goal of this project?</strong><br/></p>\n<p>The goal of this project was to show an understanding of blueprints in unreal and show I could put them together to create a functioning game. Thankfully it did not matter how the game looked but rather that I could make something using the blueprint system and show my progress, how I did what I did etc.</p>\n<p><strong>What did I learn from this project?</strong><br/></p>\n<p>I'm very grateful for this project as it taught me a lot about the basics of programming but most importantly it gave me the confidence to start improving and create without the fear of what I make being mediocre. This game doesn't look amazing or have the most innovative or fun game-play mechanics but it's a start. I'd say the most important lesson I learned from this project is that we can't create a masterpiece the first time we create something, but we definitely can't create one if we don't keep creating. Since creating this game I have gone on to work on multiple projects, in many different engines, most which won't see the light of day, but with each game I make, every project I start, I learn a little more that I can carry into the next project.</p>", "metacritic": null, "released": "2020-04-22", "tba": false, "updated": "2020-04-24T03:37:56", "background_image": "https://media.rawg.io/media/screenshots/600/600bc9088c24d7cf4ab96e7197824bd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GaKoPop"], "genres": [], "publishers": [], "esrb_rating": null}