{"id": 433157, "slug": "further-into-the-universe", "name": "Further into the Universe", "name_original": "Further into the Universe", "description": "Further into the Universe\r\n\r\n\r\nImportant\r\n<p>If you use QWERTY controls, the best is to download the Windows version [QWERTY] or to play with the arrows.</p>\r\n\r\n\r\nImportant<p>We are pleased to inform you that in the downloadable versions (Windows and MacOS) a wall of fame is available.<br/>Unfortunately, this feature is not available in the WebGL version.</p>\n<p>Give your all to get in and may the best win !<br/></p>\r\n\r\n\r\n\r\nDescription\r\n<p>In the not-so-distant future, life on earth is no longer possible, meteorites are destroying everything.<br/>Civilization as we know it has disappeared.</p>\n<p>You are one of the last survivors. Escape from Earth to begin your adventure. Space is not a safe place, be careful.</p>\r\n\r\n\r\nInstructions\r\n<p>Welcome aboard your spaceship!<br/>In the space of raging battles, destroy as many enemy ships as you can. But beware, your resources are limited.</p>\r\nResources \r\n<p>During your journey, your resources will be consumed.<br/>There are 3 types of resources:<br/></p>\n<p>\r\n-Fuel<br/>\r\n-Water<br/>\r\n-Food<br/>\n</p>\r\nPlanets\r\n<p>If your resources are empty you die, don't forget to keep an eye on them. The planets are rest areas, you can land there to regain a resource type.   When you go down to the planet, you have to start the resource extraction. As you walk around the planet, you will find elements to speed up the extraction, use them !</p>\n<p>A planet can only regain one type of resource. The colour of the planet indicates which resource it recharges.<br/></p>\r\nFollow these steps to fill out a resource gauge:\r\n<ol><li>Start the extraction from the back of the ship.</li><li>Finds elements in the environment to reduce extraction time.</li><li>Get back on course from the front of the ship.</li></ol>\n\r\n\r\n\r\nIllustrations", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-04-24T04:17:54", "background_image": "https://media.rawg.io/media/screenshots/9f5/9f58d8bd76e6f1c92e7913aff440ff0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["exocarrot"], "genres": ["Action", "Adventure", "Fighting"], "publishers": [], "esrb_rating": null}