{"id": 433861, "slug": "cthulhu-the-cult-must-not-die", "name": "Cthulhu - The Cult Must Not Die", "name_original": "Cthulhu - The Cult Must Not Die", "description": "<p>Your cult is in the process of finally summoning the great Cthulhu! But your enemies have tracked you down and are trying to prevent you from reaching your goal and killing you all. Keep the cult alive!!</p><p>Downloadable versions below.</p><p>Note: MacOS build has not been tested due to lack of hardware and was added for your convenience. Please notify us if it is broken.<br/></p>\n<p><strong>READ BEFORE PLAYING:</strong><br/></p>\n<p>How to play:\r\nThe cultists must survive long enough to summon the dark lord. As long as any cultist survives, you included, you can win.\r\nLeft mouse button to move, right mouse button for attack.\r\nPerform combos by waiting for the cursor to turn red for a follow up attack.\r\nIf enough combos are chained, you will perform a high powered attack that damages all enemies around you.\r\nMiss the combo and you will abort the attack.</p>\n<p>Some enemies will only be incapacitated. Move to them and attack to sacrifice them and gather their souls.\r\nBring their souls to the altar to speed up the summoning of the dark lord and heal yourself.</p>\n<p>Don’t worry if you die, your life is nothing to the dark lords. Another member of the cult will take over.\r\nOnly the summoning of the dark lord matters. The cult must survive!</p>\n\n<p>Changelog:</p>\n<ul><li>1.0<ul><li>Initial Release</li></ul></li><li>1.01 \r\n<ul><li>Fixed bug where enemies wont leave spawn</li><li>Fixed bug where enemies stop attacking the player</li></ul></li></ul>", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-04-24T07:02:37", "background_image": "https://media.rawg.io/media/screenshots/b63/b636c242de92f59024f2cff8f3408c84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["LaserPanzerWal"], "genres": ["Action"], "publishers": [], "esrb_rating": null}