{"id": 433984, "slug": "silkworm-keeping-a-game-alive", "name": "Silkworm: Keeping a Game Alive", "name_original": "Silkworm: Keeping a Game Alive", "description": "<p>Published just a few minutes before submission hour started (~3:59, April 22nd, 2020). I didn't utilize the submission hour too well, being unfamilar, tired, and a bit overwhelmed.</p>\n<p>WASD to move, space to interact, and R to restart a room if it doesn't go down well.</p>\n<p>If it seems hard, pay attention to the text carefully.</p>\n<p>(Without spoiling too much...)</p>\n<p>Play as Silkworm, an ambitious bug trying to stop the AI that they're a part of that some programmers ignorantly tried to use to help in development... Little did they know of the havoc that that AI would wreak upon their RPG!</p>\n<p>---------------------------</p>\n<p>I wanted to add more (and ESPECIALLY in the sound department), but for my first game jam entry and my first really story-driven game, I'm quite proud of this and am positive that I can expand upon a great many of the mechanics hinted at here! </p><p>(Yes, I tactually took the 15 minutes I needed to make Chameleon's Lo-Fi song using  Sampulator.com, but didn't allocate any time for redoing my crappy SFX otherwise. Yikes.) </p>\n<p>I also didn't have time for anyone to test it before publishing, but I'll try to scrape together  a few spare hours in the next few days for a sort of \"definitive edition\" with some of the ideas that I wanted to put in. This one will stay here as my first official jam entry, and to be rated accordingly.</p>", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-04-24T07:26:51", "background_image": "https://media.rawg.io/media/screenshots/7b3/7b3573742defb86cdad160c62b2f6205.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roey_Shap"], "genres": [], "publishers": [], "esrb_rating": null}