{"id": 434062, "slug": "cabral-soldado-heroico-ludum-dare-46", "name": "Cabral soldado Heroico (Ludum Dare 46)", "name_original": "Cabral soldado Heroico (Ludum Dare 46)", "description": "<p>ESPAÑOL</p>\n<p>3 de febrero de 1813 - Nos encontramos en la ciudad de San Lorenzo, provincia de Santa Fe, Argentina.</p>\n<p>El ejército patriota, encabezado por el General Don José de San Martín, se encuentra en plena batalla por la liberación.</p>\n<p>Del otro lado, el ejercito Realista, decididos a llegar hasta las últimas consecuencias para lograr mantener el régimen monárquico que azotaba a toda America del Sur.</p>\n<p>En este contexto el caballo del General San Martín es alcanzado por las armas enemigas, dejando al mismo en el suelo sin la posibilidad de defenderse.</p>\n<p>Es aquí, donde nuestro soldado Cabral está decidido a dar su vida por protegerlo, y con ello proteger los sueños de libertad...</p>\n<p>ENGLISH</p>\n<p>February 3, 1813 - We are in the city of San Lorenzo, Santa Fe province, Argentina.</p>\n<p>The Patriot army, led by General Don José de San Martín, is in full battle for liberation.</p>\n<p>On the opossite side: The Royalist army. And they are determined to go to the last consequences in order to maintain the monarchical regime on South America.</p>\n<p>On this context, General San Martín's horse is hit by enemy weapons, leaving him on the ground without the possibility of defending himself.</p>\n<p>This is when our soldier Cabral shows up. And he is determined to give his life to protect him and the dreams of freedom ...</p>", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-04-24T07:43:32", "background_image": "https://media.rawg.io/media/screenshots/67f/67f7c351f2ca5b0406885f241ac74e69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rustimak"], "genres": ["Action"], "publishers": [], "esrb_rating": null}