{"id": 434058, "slug": "fairy-fountain-factory-forest", "name": "Fairy Fountain Factory Forest", "name_original": "Fairy Fountain Factory Forest", "description": "<p><strong>Version 1.0a bugfix now available! See below</strong></p>\n<p>Devout heroes come to a shrine in the forest, praying for the loot and power needed to Slam Evil. **You** are the fairy in charge of the massive factory that produces said loot -- can you produce the gear they need and **KEEP THEM ALIVE?** </p>\n<ul><li><strong>Factorio Flavored Mindustry Minded Build n' Battle Arcade Strategery:</strong>  A new genre, invented in 72 hours.</li><li><strong>Explore, Build, and Connect: </strong>You and your loyal workers will gather resources, refine them into better materials, and then craft those into useful loot.</li><li><strong>Dynamic Music:</strong> Belthesar is a boss and we've got that sweet crossfading from calm to tense build/battle atmosphere.</li><li><strong>Twin Stick or KB/Mouse: </strong>Do as ye please while flying and fighting.</li></ul>\n<p>Like nearly 74% of the world's population, I enjoy Factorio and buildy-connecty-factory games. Mindustry <strong>really</strong> hit home though, as it added that Herzog Zwei / Dune 2 kick that bodies crave. This game is an homage to all that.</p>\n<p>It was hella ambitious in terms of features, even for a 72 hour project, and that shows mostly in the relatively thin amount of content. Note all the empty spaces in the builder grid. I took pains to add extra instructions to the main screen, as well as clear error messages when making incorrect build connections, but that was done at the cost of some bug proofing. Most critically: </p>\n<p>It's easy to place buildings too close to each other, or even overlapping. For maximum game enjoyment, <em>don't do that</em>.</p>\n<p><strong>Version 1.0a bugfix</strong></p>\n<ul><li>Two showstopper bugs fixed, involving resource spawning breaking and the shrine no longer accepting Weapons after level 3.</li><li>World mesh stretching/tearing bug fixed.</li><li>End of Wave menu responds to joystick input. </li><li>Credits added.</li><li>Leaderboards \"work\", but deeper fixes felt outside the scope of what's fair to allow after submission.</li></ul>\n<p>No gameplay changes were made. If newer versions go up after this, they'll be marked as such.</p>", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-04-24T07:42:50", "background_image": "https://media.rawg.io/media/screenshots/0af/0afcc559a8952dfd90a29d34114e5847.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Triger Mountain"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}