{"id": 434019, "slug": "carry-the-torch", "name": "Carry The Torch", "name_original": "Carry The Torch", "description": "<p>You will manage four resources:  <strong>Health, Stamina, Focus, and of course your torch.</strong><br/>Gather equipment and spend resources in order to climb through The Dungeon.<br/>The torch is both your source of power and your main weakness. <strong>If your torch drops to zero you lose the game.</strong><br/>However if any of your other resources drop below zero the value will instead be taken from your torch. Additionally slain enemies will add to your torch resource.</p>\n<p><strong>Map<br/></strong><br/><strong>You may have to pan the map down to see your first node. </strong>Access the map with the map button in the top right of your screen</p>\n<p>Then click on the nodes (white circles) to explore them. You cannot explore a node if you have an event currently pending.</p>\n\n<p><strong>Equipment</strong><br/>Equipment can be found in the box at the bottom left of your screen. <br/></p>\n\n<p>Hover over an equipment card to get a closer look and see it's function and click in order to activate it.<br/><br/>The number and brain symbol in the top left is the<strong> focus cost to use the equipment</strong>. If you don't have enough focus you cannot use the equipment.<br/>The number in the bottom right of the card <strong>represents the number of uses</strong>, if it displays an \"X\" it can be used infinitely or at least until you run out of focus.<br/>Finally the trash can in the top right lets you click there on the card (don't click the zoomed in version, click the trash can directly on the card) to <strong>delete the equipment</strong> and yield you 2 torch.<br/>Combat<br/><br/>In order to win you must get your foe's health to zero, this is displayed in the upper right with a blood droplet. In the middle you have your attack and block (on the left side of the wood block) and your foe's attack and block (on the right side of the block). You can use the two sliders to burn stamina and health into attack and block respectively. Simply slide the slider to the desired value and press the checkmark. Then when you are ready to apply damage click the \"Fight\" button located in the bottom-middle of the screen. Remember your attack is reduced by your opponent's block and visa versa. You can use equipment such as revolvers by activating them during combat.</p>", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-04-24T07:34:40", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shadowmyst76"], "genres": [], "publishers": [], "esrb_rating": null}