{"id": 434456, "slug": "the-heartbeat", "name": "The HeartBeat", "name_original": "The HeartBeat", "description": "<h3>Year 2077, New Dunk</h3><br/>Citizens of dunk have forgotten the glory time with Mother God Buho. Instead, they have betrayed their believe by transferred their flesh body to mechanical parts, all senses are replaced by biomechanical signal transmission with the help of Molig, the oligarch of biomechanical technology company. While people enjoying their pleasure time as “the cyber-Ed”, they have no anticipation of the Armageddon of digital virus that comes from nowhere.<br/><br/>And You Are the Mayor Of This City.<br/><br/>After ten days of work, your exhausted heart had finally bursted.<br/><br/>Your secretary arrived on time to bridged a mechanical heart for you to avoid you from endless darkness. Hold your heart tight, extend your life and the fate of this city until your last breathe.<h3>Maintain life</h3><br/>At the time of life and death, you need to listen to the rhythm of the music, observe the prompts on the screen, and press your heart regularly, so that you can survive the world.<h3>Publication policy</h3><br/>The city is looking forward to your voice and you must make a choice. Is it going against universal morality to seek stability, or is it to pray for empathy in this indifferent age?<br/>In view of your inconvenience, your rigorous and serious secretary will read the contents of the file for you.<h3>Make a decision</h3><br/>Not everything can be predicted by a neural network. Your response to every voice may affect the future of you and the city.", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2020-10-09T02:24:24", "background_image": "https://media.rawg.io/media/screenshots/f0d/f0d8654d61a95895bf71357aded5f295.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NULL", "豹"], "genres": ["RPG", "Indie"], "publishers": ["NULL"], "esrb_rating": null}