{"id": 43444, "slug": "castaway-paradise", "name": "Castaway Paradise", "name_original": "Castaway Paradise", "description": "FUN ACTIVITIESYou can spend your days doing fun activities such as catching bugs and fishing. Try to make a bigger catch than your friends and make your collections complete!GROW PLANTSFarm your own home-grown fresh crops! Rake the ground, plant the seeds and give them some water. You can also decorate your island with beautiful plants and flowers or grow fruit trees.CREATE YOUR OWN OUTFITEndlessly combine outfits, hats, dresses, shoes and other clothing to reflect your personality, or create a funny outfit just for the laughs!DECORATE YOUR ISLANDAfter the devastating storm, the island needs some renovation! You can place items from a lot of different theme packs and make the island your idea of paradise!HOLIDAYS AND EVENTSThroughout the year, special events and holidays will occur like Christmas and Halloween. Around the winter holidays for example, the island will be covered in snow, and you can help the villagers by decorating all the houses and the rest of the island.HELP THE VILLAGERS OUTBefriend the quirky villagers and help them by engaging on quests for them. They will reward you with great gifts! You can also just chat with them to get to know them better.</p>", "metacritic": null, "released": "2014-10-09", "tba": false, "updated": "2023-09-19T12:03:45", "background_image": "https://media.rawg.io/media/screenshots/972/9728dab527fc76f573bb360f1cd437af.jpg", "website": "http://stolencouchgames.com/castawayparadise/", "rating": 3.17, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 177, "beaten": 2, "toplay": 3, "dropped": 5}, "playtime": 5, "achievements_count": 121, "ratings_count": 6, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 6, "platforms": ["Nintendo Switch", "Xbox One", "iOS", "PC", "macOS", "PlayStation 4", "Android"], "developers": ["Stolen Couch Games"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Family", "Indie"], "publishers": ["Stolen Couch Games"], "esrb_rating": "Everyone"}