{"id": 434556, "slug": "virtual-meeting-simulator", "name": "Virtual Meeting Simulator", "name_original": "Virtual Meeting Simulator", "description": "<p><strong>You’ve been hired by MeetCorp, the premier facilitator of virtual meetings.</strong></p>\n<p>As a virtual meeting facilitator, you have the responsibility of running meetings and keeping participants engaged. Unfortunately, the job is a stressful one, and between that and spotty WiFi coverage, you have your work cut out for you. It’s going to take careful planning and some quick thinking to keep these meetings alive.</p>\n<p>Meetings will periodically run in the background. You’ll need to answer participant’s questions when they come up (you’ll see a ??? under their name) in order to keep them engaged. Participants lose engagement more and more quickly as time goes on, so it will take carefully management of your time in order to get as many points as possible.</p>\n<p>You’ll have to periodically re-connect your router in order to keep your WiFi connection going. If your connection cuts out, you won’t be able to access your computer to respond to participant’s, which could eventually cause them to leave your meeting.</p>\n<p>All of this causes a lot of stress. If your stress level gets too high, it’ll be harder for you to focus, and you’ll end up moving slower, making it harder to get between your router and your computer. To relieve stress, you can take a quick nap in bed - you’ll lose stress as long as you’re asleep.</p>\n<p>You’ll need to manage all of your resources to get the highest score possible. You only receive points for completed meetings. Post your high scores below!</p>\n<p><strong>Controls</strong></p>\n<p><strong>WASD or Arrow Keys</strong> - player movement</p>\n<p><strong>E</strong> - interact with objects (router, computer, bed)</p>\n<p><strong>ESC or Enter</strong> - exit typing prompt (except if sleeping)</p>\n<p><strong>Every key that appears in an on-screen prompt</strong> - responding to questions from participants, entering a new network, and waking up</p>\n<p><strong>Important notes</strong></p><ul><li>Apologies that the font in the tutorials is a bit hard to read. We're working on something to fix this.</li></ul>\n<p><strong>Uploads</strong></p>\n<ul><li>1.0 - Initial Jam upload</li><li>1.1 - Increased font size to make text more legible</li><li>1.2 - Fix bug that made it very difficult to recognize capital letters</li></ul>\n<p><strong>Credits</strong> </p>\n<p>Programming: @joe-bustamante, @jason-porritt, @andyp, @alex-zurek, and @dtkelch</p>\n<p>Music: @jason-porritt</p>\n<p>Graphics: All provided by Kenney (kenney.nl)</p>\n<p>Thanks for playing! We’d love to hear any feedback or comments below. We’ll get around to playing everyone that takes the time to review our game. Happy Ludum Dare!</p>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-24T09:33:14", "background_image": "https://media.rawg.io/media/screenshots/a4b/a4b238ef0c2bfa6669daa9f731085a9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["josephmbustamante"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}