{"id": 4345, "slug": "ghost-recon-future-soldier", "name": "Tom Clancy's Ghost Recon: Future Soldier", "name_original": "Tom Clancy's Ghost Recon: Future Soldier", "description": "<p>There is nothing fair, honorable, or just about combat. There is only winning and losing—the dead and the living.  The Ghosts don’t worry about even odds. They do everything in their power to overwhelm and obliterate the enemy.  Future technology is the key to winning an asymmetric battle. </p>\n<p>In Ghost Recon Future Soldier join an elite team of highly trained, cut-throat special-ops soldiers.  Armed to the teeth with unrivalled combat technology and cutting-edge military hardware, Ghost Recon takes you to the globe’s most deadly warzones to hunt down the highest value targets.</p>\n<p>When you’re outnumbered…Only the dead fight fair.Key Features:In Ghost Recon Future Soldier you will be equipped with the most advanced combat technology designed to overwhelm and obliterate the enemy.<br />\nCross Com:</p>\n<p>Stay one step ahead of the enemy: Cross Com gives you real time intel projected directly on your goggles. The HUD allows you to control drones on the fly, as well as locate key enemy targets.</p>\n<p>Optical Camouflage:</p>\n<p>Be invisible: Use optical camouflage to move undetected through hot spots and gain the upper hand on your enemies.</p>\n<p>Sync Shot:</p>\n<p>Tag ‘em and bag ‘em: Use the tagging feature on the ground or by drone to coordinate synchronized attacks on enemy targets.</p>\n<p>Cover Swap:</p>\n<p>Stay out of enemy sight: Exploit unique cover system and swap through dynamic covers to surprise, flank and eliminate the enemies.</p>\n<p>Hand-to-Hand Combat:</p>\n<p>Become the ultimate “quiet professional”: hand-to-hand combat will give you brutal close-combat moves.</p>\n<p>Over the Shoulder</p>\n<p>Relish in over 2500 animations: Your Ghost Recon character will roll, cover, slide, climb and disappear to stalk and take down your prey.</p>\n<p>Single-Player Campaign:</p>\n<p>An all-new, epic Ghost Recon experience<br />\n12 missions<br />\n 8 spectacular locales - Fight across diverse terrains from the dust of Africa, the suburbs of Moscow, to the icy territory of the ArcticCo-op Campaign:</p>\n<p>Team up with friends to take down the enemy<br />\nPlay through the 12 campaign missions cooperatively online with up to 3 friends.<br />\n Perform highly coordinated takedowns and devastating large-scale strikes utilizing multiple viewpoints. Your “5th man” UAV drone can draw fire and target enemies.<br />\n Lock onto enemy positions from the air or from the ground. Deploy sonic blasts to incapacitate your targets.<br />\n Unleash the firepower of mounted weapons systems from jeeps to helicopters, and eliminate enemies with your shooting skill.Guerrilla Mode:</p>\n<p>Dominate hundreds in this brand-new combat mode<br />\nYou and your fellow Ghosts will face waves of enemies and utilize real-life techniques inspired by U.S. Army counter-insurgency experts.<br />\n Enter, capture and secure a designated area, then prepare for up to 50 waves of enemies with increasing difficulty.<br />\n Compete against friends in online leaderboards.<br />\n Multiplayer Mode:</p>\n<p>Up to 12 players in 6Vs6 matches for a fast-paced, intense online experience<br />\nSelect from 3 classes (Rifleman, Engineer and Scout) and unlock new gear to battle online across 10 maps.<br />\n Gain experience and levels, make decisive choices to customize and develop your character.<br />\n Gather Intel on your enemies’ positions and share it with your teammates.<br />\n Use the new suppression system to pin your enemies down while your teammates flank them.<br />\n 4 game modes focused on objectives and cooperation, including new exclusives and GR’s classic Siege.<br />\n Created by Red Storm, the studio behind the critically acclaimed Ghost Recon Advanced Warfighter multiplayer modes.Gunsmith Mode:</p>\n<p>With over 20MM weapons at your disposal you’ll have the perfect weapon for any combat situation<br />\nCustomize your weapon in the Gunsmith mode to gain the unfair advantage on your enemies.<br />\n Choose from dozens of attachments and components.<br />\n Replace triggers, barrels, stocks and much more to trick out your weapon and make it your own.<br />\n Test your weapon in the firing range before taking it into battle for ultimate accuracy and performance.<br />\n Compatible with Single-Player, Multi-Player and Co-Op.</p>", "metacritic": 71, "released": "2012-05-22", "tba": false, "updated": "2024-04-14T14:16:10", "background_image": "https://media.rawg.io/media/games/361/361521dd66118f68e642aa095e3493c1.jpg", "website": "http://www.ghostrecon.com/", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 48, "owned": 697, "beaten": 165, "toplay": 44, "dropped": 79, "playing": 5}, "playtime": 5, "achievements_count": 45, "ratings_count": 177, "suggestions_count": 1093, "game_series_count": 14, "reviews_count": 177, "platforms": ["PlayStation 3", "PC", "Xbox 360", "Xbox One"], "developers": ["Ubisoft", "Ubisoft Paris", "Red Storm"], "genres": ["Action", "Shooter"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Mature"}