{"id": 434670, "slug": "prophet", "name": "PROPHET (itch)", "name_original": "PROPHET (itch)", "description": "<p><strong>🔻 UPGRADE GUIDE BELOW 🔻</strong></p>\n\n<p>📌 <strong>Story</strong></p>\n<p>The Earth became an abandoned place after the raid of the ungodly. Finally, you decided to take a step to cleanse the lands, and brought to life the giant machine, the Prophet, your greatest achievement to date. The Prophet can only follow one action: \"Eliminate!\".</p>\n\n<p>📌<strong> What you need to kno</strong></p>\n<p>Your objective is to keep the Prophet alive until it reaches the end of the track. The little running enemies are trying to stop the robot by leaking it's fuel tank. There is an indicator in the corner for you, to track how much fuel is currently in the machine. You can slow down enemies by pressing E near them.</p>\n\n<p>You are controlling this little guy (due to his size, you can easily lose track of him, if you are not careful, so look out). There are two kinds of collectibles; gear (toolboxes) and fuel (flasks), scattered around the map, which you can carry and give to the robot (be right below). You can upgrade the robot by collecting enough gears. </p>\n<p>Controls: <br/>- <strong>WASD</strong> - Movement<br/>- <strong>E</strong> - Interract<br/>- <strong>F</strong> - Open upgrade manual</p>\n<p>📌 <strong>Upgrade Manual</strong></p>\n<p>Is your robot not strong enough? Let's power them up! The upgrade manual is the where you can use all your collected gears, and upgrade the Prophet with new features or power ups. </p>\n\n<p>How does it work: <br/>- There are 5 types of main features (columns) and 3 upgrade types (rows).<br/>- You can start upgrading each part on the first row.<br/>- Then for the second upgrade (yellow section), you can choose which type you want to unlock (A or B).<br/>- You can switch between the two secondary upgrades types later, if you want.</p>\n\n<p>Detailed Upgrade table:</p>\n<strong>Engine</strong><strong>Cannon</strong><strong>Head</strong><strong>Rear Gun</strong><strong>Crusher</strong><strong>1st</strong>- 30 fuel tank- 1.3x faster reload speed<br/>- 1.5x faster aim speed- Straight fire- Backwards shoot<br/>- 15 range<br/><br/>- protects sides <br/>- thin width<strong>A</strong>- 45 fuel tank- 1.66x faster reload speed<br/>- 2x aim speed- Straight fire<br/>- 2x longer period<br/>- 2x range<br/>- 1.5x wide- Backwards shoot<br/>- 25 range<br/>- 1.66x aim speed- giving 1 fuel on enemy kill (by crusher)<strong>B</strong>- 15 instant fuel<br/>- 3.5x slower fuel consume- 4x explosion range- 2 moving fire on the sides- Dropping explosive mines- 2x width\r\n\n<p>📌 <strong>Bugs to look out for</strong><br/>- Player can stuck outside of playing field - [I recommend to not stay close to the borders (that are moving with the camera), until it's fixed]<br/>- Rear gun not functioning properly - [Sometimes it does, sometimes not, however, the B upgrade is working perfectly, so you can use it]<br/>- You can nullify an enemy’s movement speed - [Not intentional, but found this useful during testing, so not a priority]<br/>- Losing/Winning screens are not playing properly - [If you're wondering why your game froze suddenly, without any feedback, probably this is why (pushing the pause button might help, if it occurs)]</p>\n<p>📌 <strong>Dev notes</strong></p>\n<p>Honestly, I still don't know how I managed to finish this (bugs apart) in time. It was definitely fun making it, so I hope you will like it. Because of the lack of time, I couldn't playtest it properly, so I made 3 difficulty levels to compensate it somehow.</p>\n<p>Also, I think I can call my habit making the audio almost inaudible, so make sure to check the volume.</p>\n<p>The downloadable file is not updated yet.</p>\n<p>https://ldjam.com/events/ludum-dare/46/prophet<br/></p>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-24T10:00:33", "background_image": "https://media.rawg.io/media/screenshots/361/3614662eb2fc18836861de7bb132a04e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["marcellbalog"], "genres": ["Action"], "publishers": [], "esrb_rating": null}