{"id": 434758, "slug": "ld46-meals-on-rails", "name": "[LD46] Meals On Rails", "name_original": "[LD46] Meals On Rails", "description": "<p>This is an “inverted tower defense” game where your goal is to keep the  pizza travelling through the tower gauntlet alive. You are cyber-future  pizza delivery person equipped with a shield that can block and parry  shots from the towers along your route. Their energy fields pass right  through humans so standing in front of the bullets will do nothing.</p>\r\nTOWERS\r\n<ul><li><strong>Basic Cannon:</strong> Fires projectiles at a set interval. Every third shot will be a pink projectile. Parrying it will return to sender and destroy the tower.</li><li><strong>Sniper Cannon:</strong> Never fires pink projectiles. Make sure to pay attention and block! Looks similar to basic towers but blue.</li><li><strong>Laser Wall:</strong> Placed along the rail, make sure to find the connected button to disable it. If not your pizza will take damage when it passes through.</li></ul>\r\nPICKUPS\r\n\n<ul><li><strong>Heal Pizza:</strong>\r\nRestore 1 slice of your pizza.</li><li><strong>Shield Pizza:</strong> Protect the pizza from damage for a short while</li><li><strong>Pizza Boost:</strong> Increases the pizza speed for a short while</li><li><strong>Pizza Slow:</strong> Slows the pizza for a short while</li><li><strong>Player Boost:</strong> Increases the players speed for a short while</li></ul>\r\nCONTROLS\n<ul><li><strong>Move</strong> - WASD</li><li><strong>Block</strong> - Hold Right Mouse Click: Blocks projectiles.</li><li><strong>Parry</strong> - Hold Left Click: Parry only works on pink projectiles. Parrying requires stamina. Holding parry will reduce your stamina. Parrying a pink projectile will send it back to the tower that shot it and destroy it.</li><li><strong>Jump</strong> - Space</li><li><strong>Use</strong> - E: Find buttons connected to Laser Walls and press E on them to disable them.</li><li><strong>Pickups</strong> - 1, 2, 3, 4, 5 number keys: Use the collected pickups listed above.</li></ul>\r\nCover art by PoisonBasil\r\n<p>By @smt923, @MauZZR, @_joshuadolman, @LeahNudle<br/></p>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-24T10:19:13", "background_image": "https://media.rawg.io/media/screenshots/bbf/bbf3c4e1cef9c5cd3a740eae0d98c43c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["smt"], "genres": ["Action"], "publishers": [], "esrb_rating": null}