{"id": 435021, "slug": "dumb-ways-to-doctor", "name": "Dumb Ways to Doctor", "name_original": "Dumb Ways to Doctor", "description": "<p><strong>-Please read the disclaimer at the bottom-</strong><br/></p>\n<p>Lots of patients with serious illness are in need of treatment! As an amazing doctor, it is your job to save these patients, even from their death!</p>\n<p>There are up to 9 possible illnesses and 13 types of items available, plus a growing difficulty each day, challenge yourself to save as many patients as possible!</p>\n<p>For some reason, patients can turn into ZOMBIES if left unchecked! Should you prevent it or make it happen? You need to be careful because using a wrong item can lead to disasters!</p>\n<p><strong>Strategy Guide: </strong></p>\n<ul><li>Patient can resist treatment when their fragility is too high, use tranquilizers to lower it. </li><li>Use tools(Stun Gun, Plunger, Air Pump, Welding Tool) to attack zombies.</li><li>Apply blood packs to reduce blood loss.</li><li>Use steroids to increase heart rate, but treat them quickly before heart rate goes above 150.</li><li>Use tranquilizers to lower heart rate and fragility.</li></ul>\n<p>Remember to prioritize conditions with greater threat!</p>\n<p>&lt;<strong>Post Ludum Dare only</strong>&gt;\r\nUse tranquilizers on patients that went lunatic and get off from the bed themselves. You can then put them back on bed. (Does not work in jam submission due to a bug, not a new added feature)</p>\n\n\n\n<p>Jam submission change log- 2 hours 15 minutes after initial 72 hours<br/>-Fixed cursor sprite not displaying properly</p>\n<p><strong>Disclaimer: Play on the browser if you want to rate a Ludum Dare submission.<br/>The downloadable files (windows &amp; mac) are post-Ludum Dare submissions with better balancing and bug fixes.</strong></p>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-24T11:33:04", "background_image": "https://media.rawg.io/media/screenshots/23c/23cd5560354ca59224c63deaeae50732.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Specturnal"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}