{"id": 435022, "slug": "crazy-party-resuscitation", "name": "CRAZY PARTY RESUSCITATION", "name_original": "CRAZY PARTY RESUSCITATION", "description": "<p>CRAZY PARTY RESUSCITATION\r\nyou play as DJ Insert Name Here headlining Club LS's annual COOLPARTY but some people think it's lame so you gotta RESUSCITATE the JAMS via REAL TIME BEAT INPUTS\r\nmaster the BEAT SWITCH SYSTEM to KEEP the PARTY ALIVE for as long as POSSIBLE\r\nTAP to the BEAT on RHYTHM to change the SONG to what the people wanna hear\r\nBALANCE their DEMANDS to keep as many people as possible ENTERTAINED<br/></p>\n<p>==========<br/>Controls<br/>==========</p>\n<p>SPACE - Input beat</p>\n<p>ESC - Close game</p>\n\n<p>==========<br/>Tutorial<br/>==========</p>\n<p>In CRAZY PARTY RESUSCITATION you play as a DJ trying to keep a party alive.</p>\n<p>Every guest wants to listen to their own favorite song, indicated by their color and the rhythm they dance to during the \"Listen...\" phase. They also change what they want to hear at the start of the \"Listen...\" phase.</p>\n<p>Once the \"Listen...\" phase ends, you'll have to play back the rhythm they are dancing to with SPACE in order to change the song to what they want to hear. However, after a while the crowd will start asking for multiple songs at once, and anyone not dancing to their favorite song will start to leave the party.</p>\n<p>You can only play one song at a time! Do you want to keep as many people dancing as possible? Do you want to cater to the people near the exit to stop them from leaving? Their rhythms will also cross over each other, so you have to take care to still play the correct beat!</p>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-24T11:33:28", "background_image": "https://media.rawg.io/media/screenshots/a9e/a9e57df4963dbcc5c61b3397c98f8db7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Long Story Studios"], "genres": [], "publishers": [], "esrb_rating": null}