{"id": 4353, "slug": "bang-bang-racing", "name": "Bang Bang Racing", "name_original": "Bang Bang Racing", "description": "<strong>Bang Bang Racing</strong> is a distinct arcade game focusing not only on the speed but also on the technical driving skills. The very intuitive control system and the exciting tracks provide endless fun for everyone in the family.<br/><br/><strong>Bang Bang Racing</strong> delivers fast-paced racing around every corner and down every straight. Drive high-speed, pumped-up racing cars through cones, tires and exploding barrels! Be one step ahead of your competitors, finding shortcuts, repairing your car in the pit lane, and dominating your opponents from the top-down view.Key Features:<ul><li>Visit exotic racing locations from all around the world<br/></li><li>Complete 9 challenging reversible circuits and vary them with shortcuts<br/></li><li>Choose from the 20 unique vehicles across 4 classes of racing- muscle cars like N-Dura, stock car series like  Evo GT, world endurance championship like Protech and formula one open wheels cars like Apex<br/></li><li>Vary your choice of vehicle with one of the 8 colorful skins offered<br/></li><li>Call your friends to play with 4Player Split-screen Multiplayer Races<br/></li><li>Compete for top honors with extensive Friends and Global Leaderboards<br/></li><li>Face dynamic, interactive objects like cones or exploding barrels that make every race unpredictable<br/></li><li>Be aware of environmental conditions affecting the drivable surface-Snow, Sand, Water and Oil</li></ul>", "metacritic": null, "released": "2012-06-05", "tba": false, "updated": "2022-12-17T21:11:54", "background_image": "https://media.rawg.io/media/screenshots/b39/b3926aa0f8dce5ac47112dce021f7614.jpg", "website": "http://bangbangracing.com/en/home", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 24, "owned": 405, "beaten": 8, "dropped": 12}, "playtime": 1, "achievements_count": 36, "ratings_count": 17, "suggestions_count": 528, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC", "PlayStation 3", "Xbox 360"], "developers": ["Digital Reality"], "genres": ["Sports", "Racing", "Arcade"], "publishers": ["THQ Nordic", "HandyGames", "Digital Reality Software"], "esrb_rating": null}