{"id": 435427, "slug": "keep-drogon-alive", "name": "Keep Drogon Alive", "name_original": "Keep Drogon Alive", "description": "<p>Keep Drogon alive is a submission to IndiQ game jam and LDJAM46. It's a joint project betwen me and llunapuert. llunapuert contributed to the game idea and the BGM. </p>\r\nInstructions:\r\n<p>- Start the game: press Z (displayed as a circle in PICO-8 games)</p>\n<p>- Move Drogon: left and right arrows</p>\n<p>- Change Drogon’s color (quantum state): press X </p>\r\nWhat is this game about?\r\n<p>On the surface, this game is a Game of Thrones theme, inverse space invader, Ikaruga-clone. Beneath the surface, it runs on a simulated quantum computer and demonstrate an important concept in quantum physics!</p>\n<p>When Drogon is red, its state is |0&gt;; when it's blue, its state is |+&gt; = |0&gt;+|1&gt;. When the arrow is read, it's a Z-basis measurement; when it's blue, it's a X-basis measurement. Whether Drogon gets hit is determined by the measurement outcome of |1&gt;. When Drogon and arrow have the same color, the measurement outcome is 100% |0&gt;, 0% |1&gt; and therefore, it never gets hit. When they are not the same color, the measurement outcome is 50% |0&gt; and 50% |1&gt; and therefore, Drogon gets hit 50% of the time.</p>\n<p>The quantum computing aspect is implemented by a MicroQiskit-Lua quantum simulator developed by Decodoku.</p>\n<p>The science is demo using Qiskit in a jupyter notebook  here.</p>", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-04-24T13:21:21", "background_image": "https://media.rawg.io/media/screenshots/19d/19ded37df04d53a312fb910b99a59f49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kirais", "llunapuert"], "genres": ["Action"], "publishers": [], "esrb_rating": null}