{"id": 4356, "slug": "littlebigplanet-2", "name": "LittleBigPlanet 2", "name_original": "LittleBigPlanet 2", "description": "<p>Join Sackboy™ in a completely new adventure - filled with new abilities, new gameplay rules, innovative tools and a smarter LBP Network, evolving the whole PLAY CREATE SHARE™ experience.<br />\nKey Features:<br />\nSackboy™ is at it again! Join Sackboy™ and a lively cast of characters in a completely new PLAY CREATE SHARE™ adventure. As Sackboy™ gets recruited into The Alliance, you’ll journey to several unique worlds filled with new challenges, learn to control new tools, and discover a whole new way to play LittleBigPlanet™.<br />\nA world of PLAY is at your fingertips! Whether it’s the 50 plus levels in the whimsical storyline, endless multiplayer fun, the over 2 million levels of imaginative user-generated content from LittleBigPlanet™ (1), or the inevitable amount of revolutionary games to be created from the CREATE tools – there’s an infinite amount of gaming fun for you and your friends in LittleBigPlanet™ 2.<br />\nCREATE your own games! LittleBigPlanet™ 2 gives you complete access to customize everything - from your Sackboy™ ’s appearance to developing your own videogame. With access to the games’ CREATE tools, your imagination can run wild in creating any type of game you want from racing games, mini-games, action/adventure games, and even multiplayer shooters.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item&#39;s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements.  If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2011-01-18", "tba": false, "updated": "2023-12-11T17:04:05", "background_image": "https://media.rawg.io/media/games/040/040ab31e36c65e6a275ada23d8a7da34.jpg", "website": "http://www.littlebigplanet.com/2/", "rating": 4.08, "rating_top": 4, "added_by_status": {"yet": 34, "owned": 1336, "beaten": 327, "toplay": 32, "dropped": 112, "playing": 4}, "playtime": 5, "achievements_count": 74, "ratings_count": 390, "suggestions_count": 374, "game_series_count": 8, "reviews_count": 390, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment", "Media Molecule"], "genres": ["Action", "Arcade"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Everyone 10+"}