{"id": 43603, "slug": "summer-catchers", "name": "Summer Catchers", "name_original": "Summer Catchers", "description": "<p>The game is a road trip arcade racing with adventure elements about a little girl from a northern lands. She realized, that she has never seen the summer, ocean and albatrosses. So she decided to begin such an epic journey to make her dream come true.<br />\nThe main idea of gameplay is to overcome obstacles that happen on the way as you go in your car. Each of them can be passed differently. In order to do that, you will have an ability to buy all the necessary supplies in a shop before each trip. During the trip, your character will pick three random instruments from her travel bag. Your goal is to pick the right one at the right time. So, plan your trip, study the land you&#39;re going to travel through and you will succeed!<br />\nThere are many different levels, the difficulty of which grows as you go through the story. You are going to travel through shadowy forests, deep swamps, vast valleys, underground cities and other fabulous places. New levels will open new mechanics as well as new ways to utilize already gained instruments.<br />\nJust like the real world, the world of Summer Catchers is full of mysteries and surprises. Here, you will have a lot of interesting encounters and events, pushing you to do various things as you travel: find things well hidden, check your sense of rhythm, solve puzzles or even change somebody&#39;s life!<br />\nThe game&#39;s world is inhabited by a lot of witty characters and funny dialogues can happen with them, but that&#39;s mostly optional.<br />\nSometimes, outer simplicity hides smth bigger. Many of the game&#39;s features are hidden and only the most hard-bitten travellers and catchers will open all the secrets of this square-shaped world.</p>", "metacritic": 68, "released": "2019-07-19", "tba": false, "updated": "2024-04-11T21:44:01", "background_image": "https://media.rawg.io/media/screenshots/352/3525f931742cb00d5fc57f46fa783ab2.jpg", "website": "http://summercatchers.com/", "rating": 2.9, "rating_top": 3, "added_by_status": {"yet": 6, "owned": 52, "beaten": 4, "toplay": 15, "dropped": 7}, "playtime": 3, "achievements_count": 31, "ratings_count": 10, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "macOS", "Linux", "iOS"], "developers": ["Noodlecake", "FaceIT"], "genres": ["Adventure", "Racing", "Arcade", "Indie"], "publishers": ["Noodlecake Studios", "FaceIT"], "esrb_rating": "Everyone 10+"}