{"id": 436066, "slug": "coin-hunter-2", "name": "Coin Hunter+", "name_original": "Coin Hunter+", "description": "Tap, click &amp; earn treasures! It’s time to start your magical journey!<br/><br/>Coin Hunter is a board game! Casual, easy to play but exciting. All the surprises are in a mystery island, which is full of amazing treasures: Coins, diamonds, fate cards and so on. Let’s try your luck now!<br/><br/>Features:<br/>-Tap to roll magic dice:<br/>By easily one tap, the magic dice will be rolled. You will hop around to a random cell, meet different events, some events brings you coins or diamonds, but some events…<br/>All you need is just some luck!<br/><br/>-Get rewards through \"lucky event”:<br/>Some of events will bring you tons of treasure, don’t miss that!<br/><br/>-Solve the problem you may met to:<br/>Don’t let the roadblock block you to make the fortune!<br/><br/>-Value each choose:<br/>Choose the fate card carefully, which could let you win more!<br/><br/>-Daily check-in:<br/>Tons of treasure are prepared to persevering hunter!<br/><br/>-Mystery box:<br/>Random reward in the box, let’s check!<br/><br/>-Build your house:<br/>Use diamonds to build the house, the higher of the level, the more surprise you will get.<br/><br/>Tips:<br/>You can get free rolls every 4 hours! Enjoy it!<br/><br/><br/>*If you have any questions about our services, please feel free to contact us, we will try our best to help with you: <br/>coinhunter.feedback@gmail.com", "metacritic": null, "released": "2020-03-21", "tba": false, "updated": "2020-04-27T01:43:21", "background_image": "https://media.rawg.io/media/screenshots/d93/d936dd610a5af551cea4a894c87f002a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Smillage"], "genres": ["Casual"], "publishers": ["Smillage"], "esrb_rating": "Teen"}