{"id": 43621, "slug": "elite-dangerous-arena", "name": "Elite Dangerous: Arena", "name_original": "Elite Dangerous: Arena", "description": "<p>Elite Dangerous: Arena is a standalone expansion pack for Elite Dangerous developed by Frontier Developments.</p>\n<h3>Gameplay</h3>\n<p>This expansion pack adds a Player versus Player mode. The players can either play with each other in the usual Elite: Dangerous game sessions or engage on special arenas. It is possible to buy the pack without purchasing the base game.</p>\n<p>The core gameplay mechanic used in Elite: Dangerous is free space exploration. You&#39;re given a thousand credits and a beginner-level ship which is enough to start making money using both legal and illegal ways. The galaxy in which the players spawn is entirely procedurally generated, yet it takes into account the actual size and the number of star systems of the Milky Way galaxy. The game features several role-playing elements in its gameplay. There is no character class system present in the game. Instead, the players fit the ships to their intended roles. The role name was added into the game purely for descriptional purposes.</p>\n<p>Four new fighter-class ships were added to the game. The fast and aggressive Eagles both for Federation and Empire, a devastating Condor, and a heavily armored Sidewinder. The players will fight each other in four areas, which include space stations, asteroid fields, and even mines.</p>\n<p>Free for All, Team Deathmatch, and Capture the Flag modes are available.</p>", "metacritic": null, "released": "2016-02-16", "tba": false, "updated": "2023-07-29T15:30:56", "background_image": "https://media.rawg.io/media/screenshots/a66/a66d1fbae87c001aef2611e9b8272131.jpg", "website": "http://www.elitedangerous.com/", "rating": 2.52, "rating_top": 1, "added_by_status": {"yet": 21, "owned": 431, "beaten": 4, "toplay": 3, "dropped": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 29, "suggestions_count": 470, "game_series_count": 0, "reviews_count": 29, "platforms": ["PC"], "developers": ["Frontier Developments"], "genres": ["Simulation"], "publishers": ["Frontier Developments"], "esrb_rating": null}