{"id": 436389, "slug": "night-money-vs-mathew-the-cat", "name": "Night Money VS Mathew The Cat", "name_original": "Night Money VS Mathew The Cat", "description": "<p>Are you looking for an amazing rope swing arcade game to sharpen your mind? Do you like the Hook jump games? Can you take the night money through an adventurous journey, complete the missions and challenges, kill Mathew The Cat, and seek your revenge in this adventure fighting game? Get into the action of the extreme arcade games with the simulation experience of <strong>Night Money VS Mathew The Cat</strong> and lead the role of a professional hook jumper.<br/><br/><strong>Night Money VS Mathew The Cat</strong> is one of the most extremely exciting and adventurous games, with high-quality graphics, native control, dynamic gameplay, and cool animation effects. It lets you immerse yourself in challenging battles, tons of missions and challenges, different maps to explore, various obstacles, and 30 unique levels for unlimited entertainment! Discover our rope swing 2D game now, challenge your friends, and feel the adrenaline rush.<br/><br/>It’s a hook jump game as you’ve never experienced before! Join the world of adventures now, tap to hook and make incredible jumps, execute all these acrobatic tricks in a row like a rope swing hero, avoid the obstacles, explore different levels and environments, use the colorful portals to teleport, fight Mathew The Cat, and complete as many levels as you can in this awesome and unique offline adventure game!<br/><br/>Our goal is to offer everything you need for an amazing gaming experience. Don’t forget that your climbing and jumping skills are very important to complete the levels and get the 3 stars!<br/><br/>Why you have to download and install <strong>Night Money VS Mathew The Cat</strong> on your Android Smartphone or tablet?<br/><br/>• It’s very easy to use so you need just to install on your device and use it instantly. The best thing is that you don't need to create an account before playing our game.<br/>• It provides 30 unique and challenging levels with different missions and challenges for an amazing experience.<br/>• It’s free and it will stay free for life, so there are no hidden fees, no special memberships, and no annual subscription fees.<br/><br/>🎮 <strong>HOW TO PLAY?</strong><br/><br/>• Choose the level.<br/>• Use the control button to run, jump, and swing.<br/>• Avoid the obstacles and challenges.<br/>• Use the teleportation portals<br/>• Kill Mathew The Cat<br/>• Complete the levels and get 3 stars.<br/><br/>🎮 <strong>FEATURES:</strong><br/><br/>★ ORIGINAL &amp; NEW Adventure Rope Swinging Game<br/>★ High-quality Graphics and Amazing Sound Effects.<br/>★ Tons of challenging quests and missions<br/>★ 30 Unique levels.<br/>★ Different maps to explore!<br/>★ Amazing Acrobatic Tricks<br/>★ Various obstacles<br/>★ FREE &amp; Easy to play<br/><br/><strong>Night Money VS Mathew The Cat</strong> is a new refreshment in this popular game category. If you want to try the rope swing ninja game and fight the dangerous enemy, you'll love our extreme adventure game.<br/><br/>👉 <strong>Download it now for FREE and have hours of fun!</strong></p>", "metacritic": null, "released": "2020-04-26", "tba": false, "updated": "2020-04-27T02:55:52", "background_image": "https://media.rawg.io/media/screenshots/95b/95b92b265d47dd2ea2bae3c409033268.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Twirly Blaze Studio"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}