{"id": 436337, "slug": "color-line-2", "name": "Color Line 2", "name_original": "Color Line 2", "description": "Hold and drag the line to enjoy color line 2\r\nGo through same color as the line and if you hit other colors you will out and as you know that the twisty thing is that when you touch any other colour your line’s color will change randomly.\r\nThere are three difficulty modes SIMPLE, MEDIUM &amp; HARD.\r\nIn simple mode the line’s color won’t change when you change three color’s line.\r\nBut in medium mode your line’s color will change every time you hit any color or color line (if you hit the same color otherwise out).\r\nAnd in hard mode your line’s color will change every time you hit or touch the same color with double speed.\r\nIt is easy to learn but hard to master.\r\nNew features of the game is that this game comes with better graphics and gameplay with new different particles and roads that you can buy in the shop menu.\r\nCollect coins and buy them.\r\nEvery different line color is obstacle for your line.\r\nSave your color line till the end of the level.\r\nYou have to cross all the color lines and other obstacles to complete a level.\r\nColor switch when you touch a color.\r\nColor change is common when you touch anything so keep in mind that what is the color of the line now.\r\nHow To Play\r\nTap and hold and move finger to move the line right and left.\r\nYou can go through same color as the line.\r\nIf you hit any other color or color line even touch any other color, you will out.\r\nWhile you are in a tunnel do not move the line it will be the cause of your out.\r\nWhen you hit the same color or color box and if it is longer you can move inside of it as long as you don’t come out of it even the color changed you can still survive inside.\r\nDo not try to go very close to two colors or close line color it may out you.\r\n..........................................................................................\r\nDeveloped By Mohit Soni (GameDevMkss)\r\nFollow GameDevMkss\r\nFacebook - https://facebook.com/gamedevmkssz\r\nInstagram - https://instagram.com/gamedevmkss\r\nTwitter - https://twitter.com/gamedevmkss", "metacritic": null, "released": "2020-04-26", "tba": false, "updated": "2020-04-27T02:42:23", "background_image": "https://media.rawg.io/media/screenshots/e7b/e7b8a7b178b16ad4cf0104db66aa9d79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GameDevMkss"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}