{"id": 436520, "slug": "monstrous-affection", "name": "Monstrous Affection", "name_original": "Monstrous Affection", "description": "Monstrous Affection\r\n  \r\n  <p>Created for the Ludum Dare 46, as a Compo entry.</p>\n<p><strong>This is a post jam version, if you want to see the version to use to vote, please see this page</strong></p>\n<p>You can follow what is being worked on currently on Trello</p>\n<p>You can download and use freely the source code and assets on the github repository</p>\n\n\r\n  \r\n  \r\n  \r\n  Story\r\n  \r\n  \r\n    <p>You were on a nice romantic planet, going on a date with your life's crush...</p>\n<p>The sunset was beautiful... The air felt nice on your skin...</p>\n<p>You were both eating some food you picked on the beach earlier...</p>\n<p>Now that you think of it, that one had an odd shape...</p>\n<p>But before you noticed, it was too late, your crush had ate it.</p>\n<p>Suddenly, as the birds were passing by, while the air smelt like roses, your crush began to make awful sounds...</p>\n<p>Not human sounds... You could see its body starting to shape shift... The skin changing color...</p>\n<p>You almost passed out, and don't remember much of this...</p>\n<p>As you were regaining your focus, you saw, your crush was... Gone, but not completely...</p>\n<p>Somehow, although what it would say had nothing to do with words, you could understand...</p>\n<p>It was hungry... <strong>Very</strong> hungry...</p>\n<p>You started feeding it every food you could find... Soon enough you had used everything on the planet.</p>\n<p>You never were the pilot, only the engineer, but you took the monster in your ship and flew away towards another world.</p>\n<p>You barely can maneuver the ship, yet you manage to reach a new planet with food on its surface.</p>\n<p>However the landing wasn't as smooth... You crashed the ship, you think you'll probably never learn how to properly land...</p>\n<p>But you had to fetch food for your crush, don't let it starve...</p>\n<p><strong>Keep it alive ! You'll do anything for love !</strong></p>\n\n\r\n  \r\n  \r\n  \r\n  Gameplay\r\n  \r\n  Fetch resources by using the environment\r\n  <ul>\n<li>Mine resources deposits scattered across the planet to get raw materials out of them</li>\n<li>Transform the materials into components</li>\n<li>Craft to help you survive this hostile land</li>\n</ul>\r\n  \r\n  Feed the monster to keep it alive\r\n  <ul>\n<li>Use the food you gathered to keep the monster from starving</li>\n<li>Cook better food <strong>- Planned for a future update</strong></li>\n<li>Beware, the food won't last long outside ! Store it ! <strong>- Planned for a future update</strong></li>\n</ul>\r\n  \r\n  Build a rocket before you run out of resources\r\n  <ul>\n<li>Use the components to craft all the rocket parts</li>\n<li>Assemble the rocket and fuel it</li>\n<li>Leave the planet for another one that has more resources !</li>\n</ul>\n\n\r\n  \r\n  \r\n  \r\n  Controls\r\n  \r\n  \r\n    KeyAction\r\n    WASDMove around\r\n    SpaceUse jetpack (hold)\r\n    EPick items up and interact / place\r\n    QDrop items", "metacritic": null, "released": "2020-04-25", "tba": false, "updated": "2020-04-27T03:24:21", "background_image": "https://media.rawg.io/media/screenshots/ad0/ad0719ef2bfb84c66c5e891cf7b2d08b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PatateNouille"], "genres": [], "publishers": [], "esrb_rating": null}