{"id": 436523, "slug": "germz", "name": "GermZ", "name_original": "GermZ", "description": "<p>GreetingZ fellow Amigans,</p>\n<p>Here we are with our second production. It's rather short, mostly multiplayer party game called GermZ. </p>\n<p>You take control of one of four GermZ species and your purpose of the game is to kill all other GermZ. Simple as that.</p>\n<p>This is first public build of the game. Next one we hope will be the last containing finished game as there is only few things to add.</p>\n<p>Game will feature:<br/>- single player game based on delining own difficulty level per map rather than campaign mode (maybe in Mission Disk planned for future)<br/>- multiplayer game on 1 Amiga up to 4 players using joy1, joy2, WSAD, arrows controls<br/>- several maps to choose from<br/>- 3 levels of AI to customize the challenge<br/>- special cells with features expanding your tactic capabilities<br/><br/></p>\n<p>Game controls<br/>Control your GermZ with:<br/>Joystick 1-4 through respective ports<br/>WSAD+LShift<br/>Arrows+RShift</p>\n<p>Press fire on the cell you own, half of that cell GermZ will be selected for the attack, then navigate to the one you want to infect and press fire again to commence the attack.<br/>You can move reinforcements between your cells in the same manner.<br/>Pressing fire twice will repeat your last order (direction)<br/></p>\n<p>Requirements:<br/>Game should run on Amiga 500 with 512Kb of RAM<br/>there are some problems on configs above 020 (we work on that)</p>\n<p>Known bugz:<br/>Music is glitching on faster Mhz machines/turbo cards<br/>AI gets stucked sometimes<br/><br/>This game is first released as demo version on RETRONIZACJA 3.9 - polish retro multiplatform party (except Atari) starting 25.04.2020 on the Internet near you :)<br/></p>", "metacritic": null, "released": "2020-04-25", "tba": false, "updated": "2020-04-27T03:24:57", "background_image": "https://media.rawg.io/media/screenshots/d2c/d2c4f936fd1f2570ad031e71d1ea99c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Last Minute Creations"], "genres": ["Action"], "publishers": [], "esrb_rating": null}