{"id": 436801, "slug": "namespace", "name": "nameSpace", "name_original": "nameSpace", "description": "NameSpace is a Creative Commons party game from Else Break Labs about getting progressively quieter and more ridiculous. It's adapted from fun things like Celebrity, Charades, and (most directly) Monikers by Alex Hague and Justin Vickers, and involves finding a way to communicate something specific while not actually saying it out loud.\r\n<p>GENERAL PLAY:<br/>Divide all of the players into two teams (either formally through the app's Regular Play system or informally in Quick Play). Select or create a set number of prompts for each player based on the size of the group. You want to have around fifty prompts when this is all said and done. More prompts will generally mean a longer game. Quick and Infinite Play does this for you, but in Regular Play, you can fully select (or create) your own. The selected prompts from all of the players become the prompt list for your game. <br/><br/><em>NameSpace </em>(like <em>Monikers </em>) is played in three rounds made up of alternating turns. In each turn, a player from the current team has sixty seconds by default to get their teammates to guess as many prompts as possible from the prompt list by giving clues about the prompt's identity. Rotate the clue-giver every turn so everyone has a chance to do it. There's no limit to the number of guesses, just a limit on time. Skipping a prompt you don't know is a good strategy. Skipped prompts are put at the bottom of the prompt list to be tried again later. Teams are awarded points for prompts they guess correctly. A round ends when all prompts from the prompt list have been guessed correctly. Then, NameSpace mixes all the prompts back together for the next round. The team with the lower score always starts the new round.  <br/></p>\n\n<p>GAME ROUNDS    <br/> Each of the three rounds has a restriction on how you can give clues about your prompt: <br/><br/>Round 1  ::  Use any words, sounds, or gestures. You can't use the prompt itself. If you use any part of the prompt, you have to skip that prompt and it will be returned to the bottom of the prompt list. Reading the clue text is allowed. <br/><br/>Round 2  ::  Use only one word as a clue. It can be anything except the prompt itself or the prompt in another language or a rhyme. You can repeat that word as much as you like, but no other sounds or gestures. <br/><br/>Round 3  ::  The charades round. No words, just act out the prompt. Sound effects are OK (within reason).   <br/><br/></p>\n\n<p>ENDING A GAME    <br/> The team with the highest total score after three rounds wins. In Infinite Play, there is no score, you just keep going forever. Having fun is more important than getting the rules perfect.  <br/><br/><br/><br/>WHAT DOES THE APP DO    <br/> While <em>NameSpace </em>has adapted a lot of its rules from <em>Monikers</em>, there are some key differences to note. On the main screen, you can opt to setup the entire prompt pool, filtering out prompts for your game. You could play with only Celebrities or only the play with the <em>Monikers</em> Creative Commons prompt set. You can even weed out potentially awkward prompts if you like, so you don't have to ask your grandfather to perform a charade for Tub Girl. You can swipe down at any time to bring up the options menu. Here you can restart the current turn (if you're in a game and messed up), or toggle the sound, or go back to the main menu, or quit the app, or pause. You can also add and remove players from the pause screen in Regular Play. When you opt to play the game, you have three options. Regular Play Here you pick your teams, enter every player's name, select your prompts (even making a new prompts if you like), set the game length, set the turn timer, and generally, have the most control over how the game works. Quick Play The app handles basically everything. It picks prompts at random for you, and just calls for a member of each team during any given turn, alternating the teams each time. It doesn't keep track of players, so you will have to divide up the old fashioned way. If you don't want to deal with setup, this is the way to go. Infinite Play No teams, no players. It just picks a random spot in the prompt pool and brings up a new prompt each time. You can set a timer if you want to swap out players. Once you're actually guessing prompts, you can swipe RIGHT to indicate that your team guessed the prompt correctly (in which case you will be awarded points), or swipe LEFT to pass. A good way to think about it is 'Swipe right if you did it right, and swipe left to get left behind'. If you messed up, there is an undo button at the bottom to undo the last swipe you made. If you really messed up, at the end of the turn, you can click the 'Check your math' button which allows you to review the prompts you interacted with that turn and make any necessary adjustments. </p>\n\n\n<p>THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>", "metacritic": null, "released": "2020-04-24", "tba": false, "updated": "2020-04-27T04:24:40", "background_image": "https://media.rawg.io/media/screenshots/3c1/3c1fde2a381c97ab9296efcd3d652622.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Evan Meaney"], "genres": [], "publishers": [], "esrb_rating": null}