{"id": 436840, "slug": "eol", "name": "Éol", "name_original": "Éol", "description": "<p><strong>Prenez le contrôle d'Éol. Votre objectif est de t</strong><strong>raverser l'étendue de nuage et obtenir le meilleur score possible en évitant de tomber ou de rentrer en collision avec</strong><strong> les lanternes. Vous devez également ramasser des cristaux pour augmenter votre score final et attraper des bonus permettant de faire un double saut.</strong></p>\n\n\r\nCONTRÔLE\r\n<p>Éol se joue avec une seule touche, la barre espace, qui permet au personnage de sauter par-dessus différents obstacles. Plus la barre est maintenue, plus le personnage saute haut. Cela permet de rendre le jeu accessible à un plus grand public, notamment ceux n'ayant pas l'habitude de jouer ou n'ayant les conditions physiques pour utiliser un plus grand nombre de touches, ou ceux ayant besoin d'un équipement particulier.</p>\n\r\nPARTICULARITÉS DU JEU\r\n<p>Éol est un jeu qui a été pensé pour être accessible à tous. On peut y jouer de différentes façons :<br/></p>\n<p>*Les personnes possédant des problèmes d'auditions peuvent profiter de l’expérience avec seulement les images du jeu. Nous avons également fait en sorte d'utiliser des couleurs adéquates pour les joueurs ayant du daltonisme ou tout autre problème de vue. En effet, les éléments tels que les ennemis ou bonus possèdent des couleurs suffisamment contrastées pour que n’importe qui puisse remarquer les différences et avoir un confort de jeu optimal.</p>\n<p>*Les personnes possédant des problèmes de vue peuvent profiter de l’expérience avec seulement le son du jeu. En effet,  un son indique l'arrivée des lanternes ou encore la présence d'un trou dans les nuages pour indiquer au joueur de sauter. De plus, un son indique que le joueur a ramassé un bonus et s'arrête lorsque celui-ci ne fait plus effet. D'autres sons sont présents pour augmenter l'immersion, comme la musique en fond, le bruit lorsque l'on ramasse des cristaux, le son de défaite, le bruit du zeppelin ou encore celui des oiseaux. Tous ces sons sont expliqués par le biais d’un tutoriel avant de lancer la partie.</p>\n<p>La première fois que vous lancerez le jeu, vous pourrez entendre un tutoriel audio vous expliquant comment jouer au jeu à l'aide du son.</p>\n\r\nINFORMATIONS COMPLÉMENTAIRES\r\n<p>Nous sommes des étudiants 1ere année MMI à l'IUT Bordeaux Montaigne. Nous avons créé ce jeu dans le cadre d'un projet nommé \"Handiplay\", où nous devons penser et créer un jeu accessible  aux personnes en situation de handicap. Nous sommes le groupe 5.<br/></p>\n\r\nAMÉLIORATIONS POSSIBLES\r\n\n<p>•Ajuster la difficulté du jeu, qui peut parfois être trop compliqué ou trop simple.</p>\n<p>•Trouver un meilleur équilibre entre l'accessibilité et l'esthétisme du jeu.</p>\n<p>•Retravailler le son afin que l’apparition d'obstacles soit plus claire.</p>\n<p>•Créer plus d'ambiances différentes avec de la pluie et du tonnerre.</p>\n\r\nCRÉDITS:\r\n<strong>Contributeurs:  </strong>\n<p>Evan MARTIN, Justin QUILLÉVÉRÉ, Maxime LAÜER, Antoine TARDIVEL, Alexis SABLAYROLLES, Loïc THÉPAUT</p>\r\nProgrammation et intégration : \r\n<p>Evan MARTIN<br/></p>\r\nGraphismes et animations: \r\n<p>Maxime LAÜER, Antoine TARDIVEL, Alexis SABLAYROLLES</p>\r\nSound design et musique: \r\n<p>Loïc THÉPAUT</p>", "metacritic": null, "released": "2020-04-24", "tba": false, "updated": "2020-04-27T04:32:45", "background_image": "https://media.rawg.io/media/screenshots/bf9/bf98b288d660cee29bf993c5ae9cf6fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Handiplay"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}