{"id": 436970, "slug": "dysnomia", "name": "Dysnomia", "name_original": "Dysnomia", "description": "<p>Stranded with a failing ship and a lack of supplies after narrowly escaping certain death, a lone space marine must find his way home.</p>\n<p>The closest sign of civilisation: a remote mining outpost on Dysnomia, moon of the planet Eris. Forced to make an emergency landing and with all attempts to make contact with the outpost failing, the marine must scavenge what he can to refuel and repair his ship - and perhaps discover the fate of the outpost's inhabitants.</p>\n<p>For Amiga fans of old, Dysnomia is a direct mashup of Alien Breed and Xenomorph. For everyone else, it's a top-down alien shooter with open-world \"Metroidvania\" style progression.</p>\n<p>Featuring two-player co-op, survival and exploration elements, and detailed hand-crafted 2D art by Leon Arellano (who unfortunately I've lost contact with - please get in touch if you see this, Leon!)</p>\n<p><strong>History<br/></strong>Dysnomia was made in ten months between May 2009 and released in March 2010 on Xbox Live Indie Games. It was originally created in XNA 3.1. It was runner-up in Dream Build Play 2009.</p>\n<p>Luckily, at some point in 2010-2011, I migrated the project to XNA 4 and released a Windows version on the ill-fated IndieCity site.</p>\n<p>Ten years later, I dug out the source and fixed it up using FNA by Ethan Lee. As the original project used XACT audio authoring, FNA was really the only way to bring Dysnomia forward without completely re-writing the audio.<br/></p>\n<p><strong>Tips<br/></strong>I played through the game again for the first time in a decade to make sure it's all working! Here are some tips to help with the slightly clunky old-skoolness:</p>\n<p>- You can play with mouse/keyboard (default) or Xbox controller, but you'll need to switch to controller in the options (change P2 controls first!)</p>\n<p>- The tutorial stuff at the start is very spammy - sorry about that! Stick with it and the game gets better once you get inside the complex :)</p>\n<p>- Tab or share/options pad button for a nice map.</p>\n<p>- AI boards are essentially \"keys\". Keep as many with you as you can. Some devices such as switches and terminals only need powering up to use them once, after which you can remove the boards and take them with you.</p>\n<p>- Don't forget Nav Tablets. There is a Nav tablet to find on all levels except: Above ground, the entryway, data storage and lower mines. Five tablets total. The Data Storage encounter event counts for 50% of Nav Data.</p>\n<p>- There are two fuel rods in the Upper Mines.</p>", "metacritic": null, "released": "2020-04-24", "tba": false, "updated": "2020-04-27T05:03:27", "background_image": "https://media.rawg.io/media/screenshots/5c4/5c4111a6a35f923add7785d87339b5fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gareth Williams"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}