{"id": 436963, "slug": "the-rhythm-of-the-night", "name": "The Rhythm of The Night", "name_original": "The Rhythm of The Night", "description": "At Not a Game Studio, we see ourselves as a prolific digital atelier of interactive art, and we’re very focused on experimentation.\r\n<p>\n</p>\n<p>In 2017 we decided to create a game from scratch, live, in 4 days at the venue of Lisbon Games Week – visitors could play the game as we developed it – we titled the end result ‘Vinyl’: through planned improvisation, we developed a noir-esque jazz-heavy rhythm game, disguised as frantic top-down shooter.</p>\n<p>\n</p>\n<p>In 2019, we decided to create another game in 4 days, again, this time at Lisbon Games World and with twice as much creators. The concept was a bit different: let every creator do bits and pieces of gameplay as he or she intends, with no art direction, no established gameplay systems, no theme, no pre-conceived tone, and see how far we could go. </p>\n\n<p>We called this development and design process <em>“Clock”:</em> every creator makes a “gear” (small system) which fits in the overall system, with little to no preceding dependencies from other \"gears\".  Every two or three hours we would update the main build, which could be played from the get go at the venue.</p>\n<p>We were aiming at creating a deliberately unfocused conceptual corps exquis, not a curated “cinematic” linear experience – we wanted our creative process to be artistically and conceptually as pure as possible – we wanted the challenge of implementing a needlessly sophisticated and convoluted creative chimera – but most of all, our most ambitious aim was attempting the most horizontal collective process we could think of, in a medium that traditionally requires vertical hierarchy.</p>\n\n<p>As we started developing the project, the result started gaining a stronger and stronger comedic tone. Absurdism, fourth-wall breaking and non-sequiturs because recurrent. As visitors played, they started referring to it as a <em>“WarioWare”</em> game (because of its mini-game structure) of “trolling” – most of the content is meant to play with tropes and players’ expectations.</p>\n<p>\n</p>\r\nThis time, we titled the end oeuvre “The Rhythm of The Night”.\r\n<p>One of the songs that was in the main build was Corona’s <em>“Rhythm of the Night”</em> – which we included in reference to James Franco’s <em>“The Disaster Artist”</em>, a movie which explores the idea of auteurship through a metamodernist and comedic lens and features the same song – and which is why we gave our creation the same name.</p>\n\n<p>Most of what we did was also (probably? maybe?) highly illegal as well – we might release a “safe” final version with some content cut out – but the actual build, due to a sense of humor heightened by sleep deprivation and substance abuse, displayed private data and unlicensed content for comedic purposes.</p>\r\nCreated by<br/>Catarina Lopes I David Filipe I Filipe Pedras I Isaque Sanches I João Antunes I Mafalda Claro I Rui Humberto I Tiago Marques", "metacritic": null, "released": "2020-04-24", "tba": false, "updated": "2020-04-27T05:02:01", "background_image": "https://media.rawg.io/media/screenshots/06a/06af0854758b9449f81ca4f4d40f62f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Isaque Sanches", "Tiago Marques", "anacat", "David Filipe", "Mafalda Claro", "RuiHumberto", "João Eiras Antunes"], "genres": [], "publishers": [], "esrb_rating": null}