{"id": 437083, "slug": "the-walking-zombie-2", "name": "The Walking Zombie 2", "name_original": "The Walking Zombie 2", "description": "The world after the zombie apocalypse is a grim place. You were born into it, so you will have to struggle to survive and fight against many kinds of zombies, bandits and dangerous boss monsters. You will go on important story quests and many side quests, level up your skills and perks, sell and buy equipment, and communicate with the (un)lucky survivors.<br/><br/>SURVIVAL RPG AND FIRST-PERSON SHOOTER<br/>Walking Zombie 2 is a good old FPS with story, with dozens of quests and a lot of shooting stuff with different weapons. Your main enemies are zombies who already control the world. They are everywhere, in many different kinds and - most importantly - in great numbers. You will be using guns with different ammo, grenades or melee weapons to finish them off. Meanwhile, you will be able to heal yourself with medkits and food. As you complete more and more quests, your character will become stronger with better equipment, enhanced skills and gained perks. Are you going to get more hit points, a better chance when lockpicking locks or a lower fuel consumption while driving across the world map?<br/><br/>FEATURES<br/>• Good old single player post-apocalyptic FPS<br/>• Attractive modern polygon graphics style<br/>• Karma system - good and bad deeds create new options and encounters<br/>• Dozens of story and side quests<br/>• Many weapons, protective gear and other equipment<br/>• Weapon skins<br/>• A variety of enemies - zombie walkers, bandits, and huge boss mutants<br/>• Traders in settlements<br/>• Fun mini games and sniper missions<br/><br/>STORY OF THE CHOSEN ONE WITH A TRAGIC PAST<br/>Can your story end happily after such a tragic beginning? Because of the circumstances surrounding your birth, you are the only one who can save the world. You are immune to the effects of the virus that turns people and animals into zombies. That also makes you a perfect weapon against the undead masters of the planet and the symbol of hope for a better tomorrow. Together with friends that you will make on your path, find out the whole truth about your origin and search for the way to create a cure, despite the dangers lurking behind every corner.", "metacritic": null, "released": "2019-11-08", "tba": false, "updated": "2023-02-09T02:29:25", "background_image": "https://media.rawg.io/media/screenshots/1df/1df9ea824d061085ecf0f55d35b8bf98.jpg", "website": "https://www.facebook.com/thewalkingzombie2", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Alda Games"], "genres": ["Action", "RPG"], "publishers": ["Alda Games"], "esrb_rating": "Teen"}