{"id": 437081, "slug": "warship-legend-idle-captain", "name": "Warship Legend: Idle Captain", "name_original": "Warship Legend: Idle Captain", "description": "Warship Legend is an action-packed RPG game with 8 vs 8 team battles in real-time. Engage in massive naval warfare through the auto-matching system, and develop your skills through the use of various tactics depending on ship type and role. <br/><br/>As an intermediate commander of the joint fleet in the 1980s, you are obliged to fight against evil factions under the shadow. After experiencing strategic challenges, sincere friendship, and furious battle; you will become the master of this vast ocean.<br/><br/>Features:<br/><br/>◆ Idle RPG system ◆<br/>Set your fleets fighting while you are busy and the fighting won't stop, idle RPG system will auto-match the battle, gain new abilities and weapons, upgrade battleships with powerful weapons and multiple skills, fleets will be stronger when you back to the game.<br/><br/>◆ Varies of competition content ◆<br/>Warship Legend provides diversified combat content. PvE battle in the storyline; level locations are randomly generated on the map for each time. Arena PvP combat, matching for combat in real military rank from soldier to general, sail into the heart of the action in multiplayer PvP battle. Guild battle, 8 vs 8 epic fight in real-time. You are never feeling bored!<br/><br/>◆ Collection of hundreds of realistic warships and warplanes with distinctive features ◆<br/>Representative warships and warplanes of the modern naval system, destroyer, light cruiser, heavy cruiser, battleship, submarine, fighters, and particularly the \"king of seas\" - aircraft carrier, the military players absolutely cannot miss!<br/><br/>◆ Guild system to create a super fleet ◆<br/>Play with friends of the guild around the world, the fleet guild system provides a big platform for players to chat on tactics and combines the team play and fleet growth mechanism into one.<br/><br/>◆ Astonishing graphics, authentic sound effects ◆                                                                                                                                             An exciting story-line plus sensational graphics with incredible effects and stylish cut-scenes create an atmosphere to fully immerse yourself in and also guarantee maximum enjoyment.                                                                                                                                                                                                                                                           <br/><br/>◆ Unlock special cards ◆                                                                                                                                                                                                                                                                                                 Modify your deck and improve your chances of survival! Earn XP and upgrade your bases with special abilities and enhanced defenses!            <br/><br/>Visit our Facebook Page at https://www.facebook.com/warshiplegend/<br/><br/>NOTE:    A network connection is required.", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-05-01T02:20:29", "background_image": "https://media.rawg.io/media/screenshots/333/333fb2f2af34bb077f8ed52e41f77fe1_TUuzpej.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Special Gamez Technology Co"], "genres": ["Strategy", "Card"], "publishers": ["Special Gamez Technology Co"], "esrb_rating": "Teen"}