{"id": 437032, "slug": "ecobunker", "name": "ecoBunker", "name_original": "ecoBunker", "description": "<p>A Mini-Game to help people understand the inter-connectedness of life. <br/><br/>The output of this mini-game is based on real life studies on the effects of various keystone species and trophic levels in the food web. <br/><br/>INSTRUCTIONS: <br/></p>\n<p>1. Select a Species from the <strong>Overview Panel</strong>. This will load it into the species creator.</p>\n<p>2. In the<strong> Species Creator</strong> you can optionally select one of the &lt;=3 available sub-species variants [the smaller icons], each has it's own description in the <strong>Analysis</strong> panel, which will update whenever you click on a sub-species. If you do not select a variant the default  base species remains selected by default</p>\n<p>3. Once you feel you understand where each species fits in the overall ecosystem click <strong>Start</strong></p>\n<p>4. Select a new species, optionally select a sub-species and then Click<strong> Repopulate Species</strong> to introduce the new creature to the ecosystem .You will see it's population change from extinct to reflect it's population count</p>\n<p>5. If a species seems that it cannot be repopulated it is because there is nothing for it to eat and it dies immediately of starvation, review it's analysis and use your knowledge of working ecosystems to decide on a path to achieving a successful ecosystem</p>\n<p>6. Your ecosystem will not succeed if your primary producer (grass) goes extinct, so for your first play through, focus on keeping your grass alive and on the species variants that benefit it and do not negatively affect it early in the game. There are many ways to accomplish success but some are easier than others. <br/></p><p>7. Every species must be reproducing on the same turn to reach victory.<br/></p>\n<p>If adequate interest is shown in this idea, a full 3D Eco-Simulator  using this idea may be developed in response. Any donations or constructive suggestions are welcome as expressions of interest in a larger project.<br/></p>\n<p>icons are here if anyone's interested in those: icons made by monkik, Good Ware, iconixar, turkkub, Freepik</p>\n<p>\n</p>", "metacritic": null, "released": "2020-04-23", "tba": false, "updated": "2020-04-27T05:15:38", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["interpixel"], "genres": ["Simulation", "Educational", "Puzzle"], "publishers": [], "esrb_rating": null}