{"id": 437078, "slug": "car-parking-city-car-driving", "name": "Car Parking: City Car Driving", "name_original": "Car Parking: City Car Driving", "description": "If you are looking for an awesome car parking simulator game then Car Parking is the very one to perfect your driving skills. Especially for some drivers, parallel parking can be particularly intimidating. Fear not – this parking game will help you become a parking master.<br/><br/>One simple rule: steer away from the barriers on the road to prevent your car from getting bumped or scratched, carefully drive and park it in the assigned parking lot. This task may seem as easy as pie, but it can be quite difficult even for professional drivers. <br/><br/>Give it a shot, you will get hooked at the first try.<br/><br/>FEATURES:<br/>-       Real car driving experience with a rear-view mirror, a sensor for obstacle detection and satisfying engine sound.<br/>-       Different car park maps and types of parking to keep you entertained for hours.<br/>-       Shield item for protection.<br/>-       Cars of various models and colors that you can buy.<br/>-       Two challenging modes to test your driving skills: parking mode and license mode.<br/><br/>HOW TO PLAY:<br/>-       Press Start and shift the gear to the desired position to move forward (D) or backward (R).<br/>-       Use the steering wheel to turn the car in the direction that you want.<br/><br/>Download Car Parking for free now. Let’s get in your dream car to begin the journey. And always remember safety first.", "metacritic": null, "released": "2020-04-26", "tba": false, "updated": "2020-05-01T02:19:25", "background_image": "https://media.rawg.io/media/screenshots/bd0/bd048c97e54599bf187d42c95dbca21b_bsKa0h4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ABIGAMES PTE"], "genres": ["Simulation", "Racing"], "publishers": ["ABIGAMES PTE"], "esrb_rating": "Everyone 10+"}