{"id": 437007, "slug": "curve-flattener", "name": "Curve Flattener", "name_original": "Curve Flattener", "description": "<p>The idea for this game came to me while reading an article on the way epidemiologists model outbreaks and it was surprising to me to find that people can be modelled as nothing more than little dots with seemingly random trajectories. Humorous, but also very interesting, because I found myself wanting to play with the data models they had made. How did this little world work? What kind of correlations can be made?<br/></p>\n<p>In the day or two I spent working on the actual gameplay, attempting to distil the science of it into something simple and fun, I found myself more and more irritated with what I saw around me. Every time I saw or heard about people outside of their homes unnecessarily, I couldn't stop thinking about those little random dots, and how just one unfortunate contact could put an exponentially growing amount of people at risk. The goal of this project became less about making a toy, and more about making a statement to those who aren't quite getting it.</p>\n<p>You should all know by now to act as if you're already infected to refrain from endangering others. If you can avoid that \"iso hang\" with a friend, exercising in a busy location, or even just physically interacting with people living in separate households, please do. I think once these restrictions are lifted, we'll all be taking advantage of that sweet, sweet face-to-face time with our fellow HUMAN BEINGS, but until then, I ask you personally to be careful and respectful to the rest of society.</p>\n<p>Go and play the game, let me know what you think, and post up your flattest curves!</p>", "metacritic": null, "released": "2020-04-24", "tba": false, "updated": "2020-04-27T05:11:15", "background_image": "https://media.rawg.io/media/screenshots/31d/31db7479b922afd2cd930c057efaef0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jonathan Moallem"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}