{"id": 437111, "slug": "knockout-boxing-vr-box-fight", "name": "Knockout Boxing VR: Box Fight", "name_original": "Knockout Boxing VR: Box Fight", "description": "Are you in search for new real boxing vr games?<br/><br/>Real boxing where you can punch bags or other fights in 3d?<br/><br/>You are not alone, who doesn’t love VR gaming? Especially when real boxing comes in play.<br/><br/>The fun does not end here as our new vr box game is all about boxing and stumping your opponent.  If you love VR gaming, cardboard games, and 3d virtual reality boxing game, Knockout Boxing VR is sure to take you on Cloud9 of fun! Join into this exciting new gear vr real boxing platform offering a tasteful array of jaw-breaking and breathtaking boxing thrills and matches respectively. <br/><br/>In one of the best vr fighting games, you need to grind hard to beat hard by putting on your VR headset and boxing off the other opponent. Try the vr boxing game today!<br/><br/>REALISTIC VR BOXING<br/><br/>Whether you are new to the boxing ring or have ruled this arena for years, this exciting new vr boxing game with controller offers the most amazing combination of controls and graphics for every type of player. Learn the boxing tactics from your boxing coach and drill hard everyday to become on top of your league. With this VR boxing game, you can get to learn a lot and apply it to win lifelike boxing matches.<br/><br/>BOXING DRILLS FOR PRACTICE<br/><br/>Want to learn boxing? Willing to do anything it takes to defeat your opponent? Learn how to gain control over your opponent and rule the ring with your concentration, smartness and skills in a realistic vr boxing game. The VR boxing simulator offers coaches with real-time comments and instructions to help you learn the basics of boxing matches. Learn more combinations as you move up the levels and win more matches. Do you have what it takes to become a real boxing champion? Try the virtual reality boxing simulator now!<br/><br/>3D CLEAN &amp; STUNNING GRAPHICS &amp; FIGHTS<br/><br/>The action-adventure game offers clean and clear graphics and smooth controls so you can make the most of the boxing ring experience. Feel like a boxing legend as you step into the ring and defeat your opponent. Experience one of the most thrilling and immersive cardboard box game graphics!<br/><br/>HOW TO PLAY KNOCKOUT BOXING VR:<br/><br/>• Download and launch the vr fighting simulator game<br/>• Follow the VR games instructions to create cardboard games equipment<br/>• Choose to participate in boxing drills or matches in this boxing game<br/>• Earn points and experience clean and clear virtual reality boxing game graphics<br/>• Play, box and enjoy the box vr fighting!<br/><br/>FEATURES OF KNOCKOUT BOXING VR: RING BOX FIGHTING 2020 AR GAME:<br/><br/>• Simple and easy VR games UI/UX<br/>• Hassle-free cardboard games instructions for VR gaming experience<br/>• Play tons of new boxing games levels and win the cardboard box matches<br/>• Participate in boxing drills to practice your boxing skills<br/>• Play real-time boxing matches with your opponents<br/>• Earn match points and move up the leaderboard<br/>• Experience the thrill of action adventure with top-notch design<br/>• Stunning graphics and clean and clear design for best VR gaming experience<br/>• Best combination of AR and VR gaming in a single boxing game app<br/>• Enticing remarks and multiple new characters for better game interaction<br/>• Follow instructions and respond to comments instantly<br/>• Stunning sound effects and background music<br/>• Lifelike boxing match stadium and audience<br/>• Safe and affordable VR boxing game app<br/><br/>Are you ready to experience a new level of thrill in this new vr fighting boxing game? <br/><br/>If your answer is yes, this game offers you a great combination of AR and VR in a cheap and exciting manner so you can have all the fun. <br/><br/>Download and play boxing with Knockout Boxing VR: Ring Box Fighting 2020 AR Game today!", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2020-05-01T02:31:54", "background_image": "https://media.rawg.io/media/screenshots/0b0/0b014759300b7eafdca16071c02d7f78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Reza Yudistira"], "genres": ["Simulation", "Sports"], "publishers": ["Reza Yudistira"], "esrb_rating": "Everyone 10+"}