{"id": 437101, "slug": "box-turtle-simulator", "name": "Box Turtle Simulator", "name_original": "Box Turtle Simulator", "description": "The Box Turtles are coming!  Cute, awesome, and ready to take on the big wide world.  Control your very own Box Turtle, help him build his clan, and defeat all the enemies.   Establish your colony, feed the King, find Worker and attack reptiles, and go out in search of the bosses. You will find yourself in head to head battles against Ant colonies, Rhino Beetles, Ladybugs, Spiders, Praying Mantis, Wasp, and Honey Bees, and Scorpion. The ultimate turtle simulator you have been looking for. Fun gameplay, Smooth controls, and high quality 3D graphics.  You asked us to make it, we listened, so here it is.  <br/><br/>Top Game Features:<br/>-- Huge 3D Open World Map\u2028<br/>-- Call your colony members when you are near your enemies<br/>\u2028-- Realistic sound effects and real weather effects<br/>\u2028-- Fast paced and action packed animal simulator\u2028<br/>-- High quality graphics and realistic map\u2028<br/>-- Part survival and part animal simulator\u2028\u2028<br/><br/>Top Tip to play:  When you are near your enemy, you can call your family members.<br/><br/>Be sure to check us out on Facebook : https://www.facebook.com/wildfootgames<br/><br/>Thanks for all the great feedback Wildfooters!!. We really love hearing from you. Be sure to send us an email at wildfootwork1@gmail.com and let us know how we are doing. Thanks for playing, have fun playing as a Box Turtle!!", "metacritic": null, "released": "2016-10-03", "tba": false, "updated": "2020-05-01T02:28:25", "background_image": "https://media.rawg.io/media/screenshots/c78/c789e93b8ce7b95ced891ade550f4063_vgJiCDk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "Simulation"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}