{"id": 437198, "slug": "backpacking", "name": "Backpacking", "name_original": "Backpacking", "description": "<p>Welcome to our town! Population: Who knows? In this small town, the locals are the main attraction. As an older teen who has grown up in this town, you’ve had experience with dealing with your crazy neighbors. However, you still need to be armed to the teeth even when mom sends to you to pick up the eggs and milk. <br/></p>\n<p>You navigate the town as (your name here) in this top-down RPG where wacky and insane antics are abound. Take what you can carry in your backpack (which surprisingly can carry more than it looks) and set out to conquer the world (or at least dodge Mrs. Underman’s flying frying pans)! <br/></p>\n<p>While you’re out cutting a rug on the town, make sure you take a pair of scissors (we’re not kidding). You walk (or run for your life) around (the town) to complete tasks while avoiding the lunatic locals. However, you will have to talk to some of them in order to progress. Not all of them want you destroyed (well, at least not right off the bat. By the way, always bring the bat!). <br/></p>\n<p>Gameplay consists of talking to locals and potentially fighting them with what you have in your backpack. You as the player can have other characters follow you around who can help you in your quest. The humor is off the wall. Players will have to choose what to carry in their backpack in order to fight effectively.<br/></p>\n<p><em>This game was made for Digital Worlds' Convergence 2019 by Michael O'Connell, Wesley Vannall, Andrew Ratz, Dustin Durden, and Ryder Peppler. We developed this game from February - April 2019.</em><br/></p>", "metacritic": null, "released": "2020-04-30", "tba": false, "updated": "2020-05-01T02:52:52", "background_image": "https://media.rawg.io/media/screenshots/e1e/e1e54ef93fab7d6a4f91f12419160a6f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Michael O'Connell"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}