{"id": 4372, "slug": "table-top-tanks", "name": "Table Top Tanks", "name_original": "Table Top Tanks", "description": "Unleash table-top warfare in the all new AR Play game, Table Top Tanks! Utilizing WAAR™ technology, use the PlayStation®Vita system's AR Cards to create a virtual battlefield and guide your tank to victory across a myriad of high-intensity single and multiplayer game modes! Players control a virtual tank utilizing the twin thumb-sticks of the PS Vita system (one for movement, the other to aim the turret) to overcome several obstacles across real-world table-top environments from an overhead perspective.\r\n<br/><br/>\r\n- Solo Challenges including timed maze-runs, capture the flag missions, target practice, survival objectives.<br/>\r\n- Multiplayer  Modes with support for up to 4 Players via Ad-hoc play including Capture the Flag, Two Vs. Two and Last Man Standing.<br/>\r\n- Creator Mode for customized multiplayer maps including virtual object creation capabilities.<br/>\r\n- Various power-ups to give your tank the leading edge including a variety of shields, missiles and the ability to call in Air-Strike support.\r\n<br/><br/><br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item's use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.", "metacritic": null, "released": "2012-05-22", "tba": false, "updated": "2022-08-12T06:05:17", "background_image": null, "website": "", "rating": 2.86, "rating_top": 3, "added_by_status": {"owned": 58, "beaten": 1, "dropped": 4}, "playtime": 0, "achievements_count": 7, "ratings_count": 7, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 7, "platforms": ["PS Vita"], "developers": ["Sony Interactive Entertainment"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}