{"id": 437375, "slug": "project-sam", "name": "Project: S.A.M", "name_original": "Project: S.A.M", "description": "NOTE: Download at bottom of page!\r\n\n\n<p><strong>Project S.A.M.</strong> is a <strong>hard-core rogue-like</strong> set in the far future...</p>\n<p>You take on the role of a researcher, tasked with discovering what happened to the world outside the city of Zion. With the help of the technologically advanced S.A.M. Units (Scouting Automated Machine ), you aim to survive any dangers these desolate lands might send your way.</p>\n<p>Inspired by pioneers of the rogue-like genre, such as <strong>The</strong> <strong>Binding of Isaac</strong>,<strong> Enter the Gungeon</strong> and <strong>Moonlighter</strong>, Project S.A.M invites you to brave the dangerous lands of the far future. You will likely lose many S.A.M. Units on your journey into the unknown, but every loss is worthwhile if it brings you closer to your goals.</p>\n<p>…and every scientist knows that true failure only happens when we give up on finding out the truth.</p>\n\n<p>For over a millennium, The City of Zion has remained isolated from the outside world. Now, the city has begun to look to the outside world in order to discover new means of survival. Your role is to take up the mantle of a researcher and explorer. </p>\n<p>Your main task: discover what lies outside the city, and find safe territory for the city’s expansion. You will be able to pilot a S.A.M. unit from the safety of your own lab and utilize it to complete your research. Through the use of a kinetic cannon and impact absorption technology, S.A.M. Units are able to be launched safely from within the city.</p>\n<p>You are not fully aware of the dangers that await and will have to learn about the creatures and dangers that lie ahead through trial and error with the help of your trusty S.A.M Units. Through collecting data during your exploration, you discover new tools to aid in your S.A.M. Unit’s survival which will help you in furthering your endeavours.</p>\n<p>Your adventures will have the S.A.M. Units sent all around the perimeter of the city. Whenever the player sets off on a new adventure, they will be met with new environments, experiences, and encounters and will always need to forge their own path through these unknown regions.</p>\n\n\n<p>In each environment, there are greater dangers than the “normal” creatures of the land. Some selected few will pose an even greater challenge and often guard the path to continue your journey.</p>\n<p>Each one of these great creatures is a master of its environment and will utilize the most deadly traits of its surrounding biome in order to fight. Knowing this, you are well informed before you enter their lair and know what kind of fight to expect, but you will still have to master your S.A.M. skills if you wish to pass.</p>\n<p>Each weapon you will find has a specific combo count and each attack within it will be different from the last. The first attack most commonly being the weakest and the last being the most powerful, but the latter being the most difficult to use without getting damaged.</p>\n<p>Whether you like stabbing your enemies in quick succession or just want to split a whole group of them in half with one big swing, there will be a weapon for you to use and bring to its full potential.</p>\n<p>No matter how strong your weapons may be, the area outside Zion is dangerous. To keep your S.A.M. units alive they must be agile and stay in constant motion. Becoming an explorer will require you to perfect your survival skills, and be able to attack in between dodges, which will only improve your chances of survival.</p>\n<p>Through exploring you may obtain a myriad of items through merchants and chests, such as weapons and modules for your S.A.M. Units which will power you up and help you in combating future foes.</p>\n<p><strong>Modules</strong></p>\n<p>The player’s S.A.M. unit will also be able to carry modules that provide a multitude of offensive, defensive and utility bonuses. Some modules will be “active” modules and require the player to reach certain requirements or they might go on cooldown. Your S.A.M. unit can only utilize one “active” module at a time. Most other modules will still provide passive bonuses, and there is no limit to how many inactive modules you may carry at any given time.</p>\n<p>The research centre is your base of operations, from which you will be launching S.A.M. Units. Here, you have access to a database that will collect data of any local fauna or items your S.A.M. Unit might come across. As you get more familiar with the outside world it will provide you with greater insight on how to prepare for encounters with these hostile beings.</p>\n<p>Also found in the research centre is the armoury, which provides the ability to research, develop and upgrade weapons and trinkets that will be accessible to your S.A.M. Unit during its expeditions.</p>\n<p><strong>Data</strong></p>\n<p>Information and knowledge have become the most valuable currency within the city of Zion.</p>\n<p>As such it is used for the deployment of mechs and location beacons, it can also be used to purchase items and weapons from the merchant, as well as to buy blueprints.</p>\n<p><strong>Scrap</strong></p>\n<p>While exploring the Outside you will find a lot of scraps, which can either be recycled into weapons in the crafting stations or can be brought to the merchant to trade for valuable data.</p>\n<p>And remember, when your S.A.M. unit dies, you won’t be able to bring it back to Zion.</p>\n<p><strong>Enemy Components</strong></p>\n<p>Enemy components are special pieces of scrap that can be useful to Zion for research if sent back the research centre intact. Most merchants have facilities to enable the safe return of these precious materials.</p>\n<p>The information gathered from these rare substances is extremely valuable for researching the creation of weapons and modules, as well as upgrading them.</p>\n<p>Since Project: S.A.M. is an experimental endeavour, it will be up to you to manage the budget of your research and exploration and to convince your superiors that the exploration of the outside is not only necessary but profitable.</p>\n<p>If successful, you will be praised. However, if your data drops below zero you will have wasted your investors' money and time, leading to the project being scrapped.</p>\n<p>We want to utilize this mechanic as part of a true rogue-like experience where the player is punished for poor economic management and can lose their progress if they are not cautious.</p>\n\n\n<p><strong>Maciej Gniadek</strong>, the artist behind most of the art you will before, during and after playing Project S.A.M.</p><p>https://www.linkedin.com/in/maciej-g-8756b7141/</p><p>https://www.instagram.com/magicz.art96/?hl=en<br/></p>\n<p><strong>Alessio Giustarini</strong>, lead programmer and the man behind all the major systems that power the game (as well as all the bugs).</p><p>https://www.linkedin.com/in/alessio-giustarini-1b32b7121/<br/></p><p>https://www.instagram.com/theslothmeister/?hl=en<br/></p>\n<p><strong>Kelsey Rushworth</strong>, the sound designer that brings life to the environments, characters and the world inside and outside Zion.</p><p>https://www.instagram.com/rush_and_sound</p><p>https://www.linkedin.com/in/kelsey-rushworth-446092184/<br/></p>\n<p><strong>Brett Keable</strong>, our programmer who’s been implementing most of the game elements, bringing together art, code, and sound.</p>\n<p>https://www.instagram.com/brettkeable/?hl=en<br/></p><p>https://www.linkedin.com/in/brett-keable-438267179/<br/></p>", "metacritic": null, "released": "2020-04-30", "tba": false, "updated": "2020-05-01T03:33:23", "background_image": "https://media.rawg.io/media/screenshots/b07/b0731df10f86afe173cdda75e0afa99a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MediaShakeLtd"], "genres": ["Action"], "publishers": [], "esrb_rating": null}