{"id": 437369, "slug": "one-girl-army-prologue", "name": "One Girl Army - Prologue", "name_original": "One Girl Army - Prologue", "description": "<p>Hi. I'm the host of the #MagicalGirlGameJam, Ran d'Reille</p>\n<p>This game is my submission for my own game jam.</p>\n<p>Kirika's friend Goroko has been kidnapped by some Yakuza. Fight through the enemies and the boss, and rescue her friend!</p>\n<p>Kirika has got three modes:</p>\n<ul><li>the Dual Gun mode has low firepower, but lets you move quickly</li><li>the Assault Rifle mode lets you attack at a faster rate, but you move very slowly in this mode</li><li>the Shotgun mode has got immense firepower and lets you move at a reasonable speed, but you can only attack enemies in close range in this mode</li></ul>\n<p>Themes:</p>\n<ul><li>I Won't Rely on Anyone Anymore</li><li>My Very Best Friend</li></ul>\n<p>Notes:</p>\n<ol><li>In the beginning of the game, there is a recommendation for using a gamepad or PS stick -- but this game is still playable using keyboard. That screen is... an Easter Egg :3</li><li>The Linux version of this game has not been tested</li></ol>\n<p>Controls:<br/></p>\n<p>================</p>\n<p>Gamepad/PS Stick<br/>Left Analog: Movement<br/>D-Pad Left, Up, and Right: Change Mode (Dual Gun, Assault, Shotgun)<br/>XBOX X/PS Square: Attack<br/>XBOX Y/PS Triangle: Alternative Attack<br/>XBOX A/PS X: Jump<br/>Start: Pause<br/></p>\n<p>================</p>\n<p>Keyboard<br/>Arrow Keys: Movement<br/>A, S, D: Change Mode<br/>Z: Attack<br/>X: Alternative Attack<br/>Space: Jump</p>\n<p>================</p>\n<p>I must admit... although I encouraged people to make out-of-the-box game designs for this jam, creativity is not my strongest point... This game is... normal to say the least (^.^;</p>\n<p>Please forgive the amateurish quality of the music. I composed the musics myself -- and I'm no musician :P<br/></p>\n<p>Engine used: Godot v3.1</p>\n<p>Music composed using FL Studio 20, with sforzando plugins and samples from Touhou instruments<br/></p>\n<p>Please enjoy this humble game :)<br/></p><p>Known bugs:</p><ul><li>For some reasons the explosions of the boss are glitchy in the browser version. It works fine in my game editor</li><li>In the browser mode, the game breaks if you try to play the game after pressing the Exit button</li></ul>", "metacritic": null, "released": "2020-04-30", "tba": false, "updated": "2020-05-01T03:31:51", "background_image": "https://media.rawg.io/media/screenshots/4e9/4e928f406c3de6f37af179d98ab0b607.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Ran d'Reille"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}