{"id": 4374, "slug": "wonder-boy-in-monster-land", "name": "Wonder Boy in Monster Land", "name_original": "Wonder Boy in Monster Land", "description": "<p>The once beautiful kingdom has been thrown into chaos by a ferocious fire breathing dragon and his monstrous henchmen whose aim is to create their own Monster Land. Unable to defend themselves from the onslaught, the people cry out for a hero to save them! As Wonder Boy, set out on an incredible journey across different environments and dungeons, collect powerful weapons and spells and rid the land of evil!</p>\n<p>Now on Playstation®Network, earn brand new achievements, challenge yourself with all new trial modes and compete against other users across online leaderboards!</p>\n<p>© SEGA. ORIGINAL GAME ©WESTON. SEGA is registered in the U.S. Patent and Trademark Office. SEGA, the SEGA logo, and Wonder Boy in Monster Land are either registered trademarks or trademarks of SEGA Corporation. All rights reserved. &quot;PlayStation&quot; and the &quot;PS&quot; Family logo are registered trademarks and &quot;PS3&quot; is a trademark of Sony Computer Entertainment Inc. The PlayStation Network Logo is a service mark of Sony Computer Entertainment Inc.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.</p>", "metacritic": null, "released": "2009-01-26", "tba": false, "updated": "2022-03-31T00:44:25", "background_image": "https://media.rawg.io/media/screenshots/f7b/f7bb3cbb2e12cf4f0205edd10e63a853.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 24, "beaten": 3, "toplay": 1, "dropped": 4}, "playtime": 1, "achievements_count": 12, "ratings_count": 3, "suggestions_count": 155, "game_series_count": 10, "reviews_count": 4, "platforms": ["Nintendo Switch", "Wii", "PlayStation 3", "Atari ST", "SEGA Master System", "Commodore / Amiga"], "developers": ["SEGA"], "genres": ["Action", "RPG", "Platformer"], "publishers": ["SEGA"], "esrb_rating": "Everyone 10+"}