{"id": 437541, "slug": "keeper-of-the-forest-alpha-build-demo", "name": "Keeper of The Forest (alpha build demo)", "name_original": "Keeper of The Forest (alpha build demo)", "description": "<p><strong>Warning: This vn may mention some uncomfortable topics and viewer discretion is advised. </strong></p>\n<p>(VN currently in alpha and is very unfinished at the moment.)</p>\n<p>Current status of game:</p>\n<ul><li>Script (unfinished)</li><li>Sprites (Mostly done, but needing more poses and emotes)</li><li>A lot of missing cgi or possibly unfinished.</li><li>a couple of unfinished backgrounds </li></ul>\n<p>For two centuries, mortal kind has been forced to live in several small dome cities. Outside the cities protective magical barriers is a world now ruled by the gods, and very unwelcoming to all mortals. </p>\n<p>The gods allow the mortals to live within the magical barrier in peace. Seeing as they were the ones who created them for the purpose of keeping mortals locked up. </p>\n<p>Anyone who dares to leave, is at the mercy of the gods and they usually lack pity for mortals. </p>\n<p>However, that doesn't Stop Orien Mitchel from testing fate, and into the forest he goes. Hoping to start a new life away from the cruel fate he faced within the dome city. </p>\n<p>But such a future will only happen with the Keeper of the Forest's permission. </p>\n<p><strong>Characters</strong></p>\r\nOrien Mitchel - 25 years old, He/Him, afab non-binary, half-human &amp; half feline beastkin. \r\n An indentured servant from Argothan Dome City. Searching for freedom from his owners and a debt that's been passed onto him from his family.  Orien gains it by escaping into the forest, where no mortal will chase after him. Keyair of the Forest - ??? years old, they/them, non-binary, minor forest god.\r\nKeyair is the keeper and god of the Argothan Forest. He watches over everything in the forest and protects it from harm. He is also tasked with both guardian the Argothan dome city and ensuring humans who venture out don't make it out of the forest alive or unscathed. Linus of Curely - 29 years old?, He/him, Cisgender male, Forest Elf.\r\nAn elf who serves under Keyair, he is the only other servant in the forest gods household. He's far wiser than he looks and very dedicated to his job.  One must wonder how he came to serve a forest god.", "metacritic": null, "released": "2020-04-29", "tba": false, "updated": "2020-05-01T04:09:58", "background_image": "https://media.rawg.io/media/screenshots/350/35097f2dfd4308b70e2d03cddace9552.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nw160"], "genres": [], "publishers": [], "esrb_rating": null}