{"id": 437698, "slug": "a-perfect-game-2-speedy-snacks", "name": "A Perfect Game #2: Speedy Snacks", "name_original": "A Perfect Game #2: Speedy Snacks", "description": "<p>The Perfect Game Project rests on the assumption that it's a pleasure to watch someone else play a video game really, really well.  And what better player than AI that already knows where the points are coming from and how?  Download the game, stick it in the corner of your desktop, and watch the computer play (nearly) perfectly as the score goes up and up.  Is one million points enough?  Maybe two?  Only you can be certain.<br/></p>\n<p>Controls:  None!</p>\n<p>Sound:  None!</p>\n<p><em>Speedy Snacks, </em>Perfect Game Project #2, is a remake of the 1982 game <em>Fast Food </em>by Telesys for the Atari 2600.  It uses graphics from the original game.  The goal is to eat as much food as possible while avoiding the purple pickles.  Every so often, you'll see an announcement of \"You're Getting Fatter,\" after which the number of purple pickles eaten (if any) is reduced by one.  <br/></p>\n<p>The original description of <em>Fast Food </em>comes from its manual:</p>\r\n\r\nSTUFF YOURSELF!\r\nBurgers, fries, shakes, pizzas . . . Flying by at sub-gastronomical speeds. You and Mr. Mouth have to catch 'em if you can. The higher the calorie count, the better your score. The more calories you consume the faster the food flies.\r\nBut beware the purple pickles! Catch too many and your binge is over.\r\nNo matter how much you eat, you'll never gain a pound.\r\n<p>For more about <em>Fast Food, </em>visit its entry at AtariAge.<br/><br/><br/></p>", "metacritic": null, "released": "2020-04-29", "tba": false, "updated": "2020-05-01T04:43:01", "background_image": "https://media.rawg.io/media/screenshots/88b/88b6f761155e41b58a3e55ca3dad53c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bjbest60"], "genres": ["Action"], "publishers": [], "esrb_rating": null}