{"id": 437747, "slug": "mochi-madness", "name": "Mochi Madness", "name_original": "Mochi Madness", "description": "<p>Mochi Madness is a 2-player PVP game where you play as skewer-wielding mochis competing to build a dango stick! Race to be the first to get three dangos amidst a flurry of desserts that can either aid or hinder you in your goal. Poke around and throw to your heart's delight in three unique stages, each with their own flavor! <br/></p>\n<br/>\n<ul><li><em>POKE AND THROW:</em> Use the SHIFT button (or X on controller) to poke almost everything on the stages (including your opponent!) to use it to your advantage.</li><li><em>HOME GOAL:</em> Be the first to get three dangos onto your stick, but beware of the obstacles the stage presents!</li><li><em>LAUGH AND HAVE FUN:</em> Spend a few minutes (or hours!) playing with friends and family with local multiplayer.</li></ul>\n<p>This game was made in collaboration between students from USC Games and Berklee College of Music as a semester-long project. All code, art assets and music are original, with the exception of InControl, QuickOutline and MK Glass Shader (all on Unity Store).<br/></p>\n<p>Controller support included!</p>\n<p>---<br/></p>\n<p>CREDITS: <br/>Game Designer and Lead Programmer: André Pascual<br/>Game Designer and Lead Artist: Carys Gooi</p>\n<p>Composer/Arranger: Xinyuan Sun<br/>Composer/Arranger: Sung Jun Park<br/>Composer/Arranger: Jun Matoba<br/>Sound Design: Avik Chari</p>\n<p>Usability Tester: Francesca Palamara<br/>Usability Tester: Rachel Yu</p>", "metacritic": null, "released": "2020-04-29", "tba": false, "updated": "2020-05-01T04:55:05", "background_image": "https://media.rawg.io/media/screenshots/a50/a50fa5b2b8fab3e87dc2f996268eb643.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["crazycaryz"], "genres": ["Action", "Sports"], "publishers": [], "esrb_rating": null}