{"id": 43774, "slug": "letter-root-letter", "name": "√ Letter: Root Letter", "name_original": "√ Letter: Root Letter", "description": "<p>When a letter is delivered 15 years late - you discover an old pen-friend was involved in a murder, before she disappeared.<br />\nTravelling to her hometown, you must investigate the murder, using her past letters as clues to uncover the disturbing truth. Using Visual Novel and investigative gameplay elements, Root Letter elevates the Visual Novel genre to a whole new level.<br />\nRoot Letter Features:<br />\n•   An intense murder mystery set in a gorgeous, real-word, rural Japanese setting.<br />\n•   Stunning Visual Novel artwork from the renowned artist Minoboshi Taro.<br />\n•   Increased gameplay elements - search for clues, present evidence and explore environments.<br />\n•   Travel freely around Shimane, visiting real world locations and interviewing suspects.<br />\n•   Interrogation mode allows you to present evidence to characters and catch them out in lies.<br />\n•   Unravel the truth from your pen-friend&#39;s letters - was she telling the truth, was she even real?<br />\n•   Make difficult choices as you straddle an investigation spanning 15 years.<br />\n•   Five different endings with wildly different routes - for a huge level of replayability.<br />\n•   Incredible Soundtrack from composer Takashi Nitta and lead voice actor role for Noriko Hidaka (Ranma)</p>", "metacritic": null, "released": "2017-07-07", "tba": false, "updated": "2023-07-22T10:38:06", "background_image": "https://media.rawg.io/media/screenshots/7e9/7e9a1d5c29a7769b7e1a0c527038a4d7.jpg", "website": "http://www.r-letter.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 93, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 5, "achievements_count": 26, "ratings_count": 4, "suggestions_count": 358, "game_series_count": 2, "reviews_count": 4, "platforms": ["PC"], "developers": ["Kadokawa Games"], "genres": ["Adventure"], "publishers": ["Kadokawa Games"], "esrb_rating": "Teen"}