{"id": 437973, "slug": "titan-saga-chains-of-kronos", "name": "Titan Saga: Chains of Kronos", "name_original": "Titan Saga: Chains of Kronos", "description": "Overview\r\n<p>Titan saga is an open world fantasy rpg, focused on deep customization of characters and town. Through tough choices, tactical battles and epic dungeons, you will experience an exciting and unique adventure.<br/></p>\r\nStory\r\n<p>Imperial Unity, it was supposed to save the humans and bring back order. As the lord ruler began to lose his influence to the growing houses, he made law that the higher houses would have to wed their heirs to the lesser houses on the fringes of human lands. He said the Titan of Fire had commanded it, but even the common folk know he can no longer hear that voice. The lord ruler needed to redistribute the power, to stop the potential coup from the most powerful house. He would do anything to keep his power.<br/>Unbeknownst to all, an ancient force had awakened. The elves had found their paragon, The Titan of Air. He had crafted the first elves in the times before. The magic they once had, began to return. Human long knew they would never be able to turn back to magic. The Chains of Kronos sealed the Titan of Fire. But they were a people who looked forward and soon a large empire-wide guild of engineers had formed. With blackpowder and steam, humans had become the most powerful race. As magic begins a new, that may not last. Kronos the Titan who sealed all with not be able to hold be the Titan of Air for long.<br/><br/>You begin your journey as an unfortunate young heir, to a lesser noble house, forced to flee from your city. Elves were provoked to attack your small city on the edge of the human empire. Nefarious human enemies seem to want you dead and your family name destroyed. You must safe your family, your name, your people, your land and maybe... your race. As you begin your adventure, you notice more and more strange magical anomalies, you know something bigger than just you is happening.<br/><br/>Choose your allies wisely, as this journey will not be easy.</p>\n<p>Join the Development team at Discord.</p>", "metacritic": null, "released": "2020-04-28", "tba": false, "updated": "2020-05-01T05:45:07", "background_image": "https://media.rawg.io/media/screenshots/fd2/fd2ec617e1f08583763b37f0a56b3798.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kneeshaw Devolpments"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}