{"id": 43796, "slug": "kalzor-2000", "name": "Kalzor: 2000", "name_original": "Kalzor: 2000", "description": "<strong>In A Snapshot</strong><br/><br/><ul><li>Blast never ending waves of enemies<br/></li><li>Collect gold coins<br/></li><li>Unlock new ships<br/></li><li>Get your best hi-score<br/></li><li>Have the most amount of fun you can have with your clothes on</li></ul><br/><strong>A Blast From The Past</strong><br/><br/>Kalzor is a classic space blaster, drawing inspiration from the arcade hits of the 70's and 80's. I've done my best to bring together modern tech and classic gaming, to make Kalzor a balanced game, in regards to marrying the old and the new.<br/><br/>When you play Kalzor for the first time it will quickly feel like you are playing an arcade game from the eighties, the main difference is this time you're not a virgin.<br/><br/>The retro themed music perfectly ties together the simplistic addictive gameplay and retro inspired visuals for the ultimate experience of 'golden age' gaming. With a chiptune vibe, sounding like it was composed on a speak and spell (oh the memories). <br/><br/><strong>Game Play</strong><br/><br/>Kalzor is a straight up fun game, no reading, no cut scenes - just 100% pixelated spaceship blasting goodness. You'll avoid enemy attacks as you shoot your way to the highest score you've ever achieved. All the while collecting power ups and coins.<br/><br/>The coins themselves are used to unlock additional ships to control (there are five in total), meaning you have a variety of play styles to try. Each ship's stats vary between speed, accuracy and defence (number of shields you start with). So you'll find one that suits your mood.<br/><br/>Additionally there are alternative types of shots to use, which will alter how you proceed in combat. They also offer slightly more ammo than the regular ammo pickups, so if you see one float by don't forget to grab it.<br/><br/><strong>High score Champion</strong><br/><br/>As a bid to promote Kalzor, players may post their scores and game play footage to YouTube, so long as our license is adhered to.<br/><br/>For more information to help you avoid getting in trouble read our YULA on our site.<br/><br/><strong>Controls</strong><br/><br/>[Menu Navigation]<br/><br/>Up: W or up arrow<br/>Down: S or down arrow<br/>Left: A or left arrow<br/>Right: D or right arrow<br/>Go back a screen: Esc or back<br/>Confirmation/OK: Space or enter<br/><br/>[In Game]<br/><br/>Burst: W or up arrow<br/>Turn Left: A or left arrow<br/>Turn Right: D or right arrow<br/>Shoot: Space", "metacritic": null, "released": "2017-07-14", "tba": false, "updated": "2019-08-28T22:06:08", "background_image": "https://media.rawg.io/media/screenshots/9ff/9ff69610f146e831b59a907316336cf4.jpg", "website": "http://www.roley.co.uk/kalzor.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 2, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roley Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Roley Games"], "esrb_rating": null}