{"id": 438, "slug": "kill-the-bad-guy", "name": "Kill The Bad Guy", "name_original": "Kill The Bad Guy", "description": "<strong>I - KTBG: the original single-player puzzle game<br/>II - Gangs of Bad Guys: the new multi-player mode<br/><br/>I - KTBG</strong><br/><br/>Does everyone deserve a second chance? Can crimes ever be forgotten? Hiding behind the mask of the average man on the street, and furtively blending into the background, many war criminals, ex-Mafia members and other criminals have been literally getting away with murder, or worse. That is, until you turned up to ruin the party. As part of a secret and mysterious society whose members have sworn to rid the world of these Bad Guys, it’s your responsibility to make sure justice is served in the bloodiest possible way, using your unpredictability to your advantage.<br/><br/>Track the Bad Guys, be brutal and smart in your planning, and eliminate them one by one. But bear this in mind: each criminal’s death has to look like an accident. In each level, you’ll have the chance to splatter and destroy the Bad Guy using various weapons and traps. It’s up to you to make sure he ends up in the wrong place at the right time.<br/><br/>In this ingenious puzzle game in which physics plays an essential role, you’ll need to keep a cool head and your wits about you. Show no mercy as you set out to kill the Bad Guy!<br/><br/>“Until your mission is accomplished we don’t exist. If you fail, you’ll be the only person at fault, and we’ll deny ever knowing you.”<br/><br/><strong>Features</strong><br/>•\t<strong>TRACK YOUR TARGET</strong> in 60 levels, each one more original than the last, and unlock 6 completely off-the-wall bonus levels.<br/>•\t<strong>USE YOUR IMAGINATION</strong> as you take out the criminals one by one. Find the opportune moment to act, and make it as bloody as you can!<br/>•\t<strong>BECOME THE AMBASSADOR OF DEATH</strong> and make full use of all the different traps available. Sabotage vehicles, transform daily objects into deadly weapons, or combine different elements in order to create new ones.<br/>•\t<strong>WORK IN THE SHADOWS.</strong> Don’t draw attention to yourself. Cameras, pedestrians, cops and the Bad Guys’ bodyguards mustn’t suspect you. No one should ever doubt that these deaths are anything but unfortunate accidents.<br/>•\t<strong>TRY, TRY AND TRY AGAIN</strong> as you take advantage of the game’s replay feature. Get the top score, fulfil the secondary objectives, find new ways to kill each Bad Guy, and work on your murder skills.<br/>•\t<strong>SOCIAL SHARING.</strong> Show off your killing prowess and achievements to your friends, and prove that you are the world’s top justice seeker.<br/><br/><strong>II - Gangs of Bad Guys</strong><br/><br/>Playable up to 16 players, Gangs of Bad Guys is a new competitive mode. Face your opponents and kill them all. This time you control the Bad Guy and no more discretion, you must be clever and cunning to achieve your aims. Turn items of everyday into deadly traps, combine elements and bring the terror in the streets. Alone or in team, fight your enemies in 4 game modes: Serial Killers, Capture the flag, Godfather and Gang Supremacy.", "metacritic": null, "released": "2014-05-28", "tba": false, "updated": "2023-06-14T19:46:41", "background_image": "https://media.rawg.io/media/screenshots/1de/1de04e34894bfac3cc2f67f3818d5030.jpg", "website": "http://www.ktbg-thegame.com/", "rating": 2.88, "rating_top": 3, "added_by_status": {"yet": 14, "owned": 370, "beaten": 3, "toplay": 2, "dropped": 12}, "playtime": 2, "achievements_count": 86, "ratings_count": 17, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 17, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "Linux", "PC", "macOS"], "developers": ["Plug In Digital", "Exkee"], "genres": ["Action", "Strategy", "Simulation", "Indie", "Puzzle"], "publishers": ["Plug In Digital", "Exkee"], "esrb_rating": null}