{"id": 438003, "slug": "trashman-crisis-time-zx-spectrum-48128k", "name": "TRASHMAN Crisis Time ZX Spectrum 48/128k", "name_original": "TRASHMAN Crisis Time ZX Spectrum 48/128k", "description": "<p>(ESPAÑOL)</p>\n<p>TRASHMAN - CRISIS TIME</p>\n<p>----------------------<br/>@PCNONOGames 2020</p>\n<p>SINOPSIS:<br/>---------</p>\n<p>Andrés es un basurero con experiencia, con contrato fijo en la empresa de limpieza pública, donde trabaja desde hace muchos años.<br/>Pero el País sufre una fuerte Crisis económica y el ayuntamiento se ha visto obligado a vender el servicio de limpieza a una empresa Privada.</p>\n<p>Las condiciones laborales para Andrés han cambiado. Su sueldo ha bajado radicalmente, y los mismo ha ocurrido con sus pagas extras.</p>\n<p>Ahora, Andrés, no llega a final de mes, sus gastos son mayores que sus ingresos y necesita hacer trabajos extras y encontrar más dinero,<br/>aunque sea monedas en los bancos del parque para poder llegar a fin de mes.</p>\n<p>INSTRUCCIONES:<br/>--------------</p>\n<p>Ayuda al basurero Andrés hacer su trabajo diario, recoger los contenedores de basura. Llévalos al camión, vaciarlos y vuelve a soltarlos en su sitio.<br/>Para que no se te olvide ningún contenedor de basura sin recoger. Estos están numerados, y tendrás que ir recogiéndolos por orden.</p>\n<p>CUIDADO!!!! con los coches, motos, peatones y los perros, van como locos!!! y te harán daño. Y MUCHO CUIDADO!!! con el césped de las Urbanizaciones y las casas,<br/>porque si lo pisas, los vecinos protestarán y te restarán tiempo de trabajo.</p>\n<p>Por el contrario, si algún vecino necesita ayuda o quiere ser tu amigo, no dudes en ser agradable. Así conseguirás aumentar tu tiempo de trabajo.</p>\n<p>Y MUY IMPORTANTE!!! No olvides que con tu sueldo no llegarás a final de mes, intenta encontrar dinero por los caminos, bancos de los parques y sin duda,<br/>no rechaces ningún TRABAJO EXTRA!!! Porque tu sueldo es de 1000 euros y tus gastos 1140 euros. Sino llevas a esta cifra de gastos, estarás GAME OVER!!!</p>\n<p>CONTROLES:<br/>----------</p>\n<p>ARRIBA: Q<br/>ABAJO: A<br/>IZQUIERDA: O<br/>DERECHA: P</p>\n<p>CREDITOS:<br/>---------</p>\n<p>Producción, Programación y Gráficos: Antonio Román (Nono)<br/>Programación Avanzada: Sergio thEpOpE<br/>Ilustración: Andy Green (El Lagarto by Inglaterra)<br/>Música: Mr.Rancio<br/>Tester: Javier Ortiz, Salvador Román, Ana Rodríguez<br/>Juego Original: Malcolm Evans 1984</p>\n<p>AGRADECIMIENTOS:<br/>----------------</p>\n<p>Javy Fernández, Jonathan Cauldweel, Jaime Grilo, Ariel Endaraues, Jorge Enga, Marina Román, Darío, Allan Turvey.</p>\n<p>APLICACIONES USADAS:<br/>--------------------</p>\n<p>AGD 4.7 de Jonathan Cauldweel<br/>Perilla de Sergio thEpOpE<br/>ZX-Paintbrush<br/>MultiPaint<br/>Fuse Emulator<br/>Spectaculator Emulator<br/>Spectrum Tape Loader<br/>Screen Compressor Plus<br/>Vortex Tracker II</p>\n<p>Web:  https://www.pcnono.es</p>\n<p>Twitter; twitter.com/PCNONOGames</p>\n<p>Facebook; www.facebook.com/PCNONOGames/</p>\n<p>INSTAGRAM; www.instagram.com/pcnonogames/</p>\n\n<p>(ENGLISH)</p>\n<p>TRASHMAN - CRISIS TIME<br/>----------------------<br/>@PCNONOGames 2020</p>\n<p>SYNOPSIS:<br/>---------</p>\n<p>Andrés is an old trash man, who has a lot of experience in the job, he has a contract in the public cleaning company, where he has worked for years.<br/>Country suffered a horrible economic crisis and the town hall had to sell the cleaning service to a private company.</p>\n<p>This meant that the working conditions will change. His salary will decrease and the same will happen with his extras payments.</p>\n<p>Now Andrés cannot pay all his expenses because they are more money than what he earns. He needs extra jobs so that he can earns more money,<br/>even if it´s just the coins left in the park, to be able to make ends meet.</p>\n<p>INSTRUCCIONS:<br/>-------------</p>\n<p>Help Andrés the trash man do his diary job, pick up the bins, bring them to the lorry, empty them and put them back where they were.<br/>The bins are numbered and you must pick them in order.</p>\n<p>BE CAREFUL!! with the cars, the motorbikes, the pedestrians and dogs, they go very fast and can hurt you. Also BE CAREFUL!!! with the grass of the residential areas and the houses<br/>because if you step on them the neighbors will protests and the will entertain you and this will make your working time decrease.</p>\n<p>On the contrary, if a neighbor needs help or wants to be your friend, you should be friendly and nice to them. Doing this you will increase your working time.</p>\n<p>IMPORTANT!! Don´t forget that with your normal salary you don´t earn enough money for all your expenses and you aren´t able to make ends meet, try to find money, in the streets,<br/>in the benches that are in the parks and obviously accepts EXTRA WORK!! that they can offer you.<br/>You must do extra work because your salary is of 1000$ and your expenses are 1140$. If you don´t earn this amount of money the GAME WILL BE OVER!!!</p>\n<p>CONTROLS:<br/>---------</p>\n<p>UP : Q<br/>DOWN : A<br/>LEFT : O<br/>RIGHT : P</p>\n<p>CREDITS :<br/>---------</p>\n<p>Production, Programming and Graphics: Antonio Román (Nono)<br/>Programming Advance: Sergio thEpOpE<br/>Illustration: Andy Green(El Lagarto by Inglanterra)<br/>Music: Javier Parra(Mr.Rancio)<br/>Tester: Javier Ortiz, Salvador Román, Ana Rodríguez.<br/>Original Game: Malcolm Evans 1984</p>\n<p>THANKGIVING:<br/>------------</p>\n<p>Javy Fernandez, Jonathan Cauldweel, Jaime Grilo, Ariel Endaraues, Jorge Enga, Marina Román, Darío, Allan Turvey.</p>\n<p>APPS USED:<br/>----------</p>\n<p>AGD 4.7 by Jonathan Cauldweel<br/>Perilla by Sergio thEpOpE<br/>ZX-Paintbrush<br/>MultiPaint<br/>Fuse Emulator<br/>Spectaculator Emulator<br/>Spectrum Tape Loader<br/>Screen Compressor Plus<br/>Vortex Tracker II</p>\n<p>Web:  https://www.pcnono.es</p>\n<p>Twitter; twitter.com/PCNONOGames</p>\n<p>Facebook; www.facebook.com/PCNONOGames/</p>\n<p>INSTAGRAM; www.instagram.com/pcnonogames/</p>", "metacritic": null, "released": "2020-04-28", "tba": false, "updated": "2020-05-01T05:52:51", "background_image": "https://media.rawg.io/media/screenshots/e89/e891c42b5052b389679db15f511ae4ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PCNONOGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}