{"id": 438126, "slug": "bug-milk", "name": "\"BUG MILK\"", "name_original": "\"BUG MILK\"", "description": "<p><strong>Submission for the Starter Village Jam 14/04/20 - 14/05/20. This was so much fun! Thank you to the hosts for facilitating this! #startervillagejam</strong><br/></p>\n<p><strong>obliviist recommends: </strong></p>\n<ul><li><strong>chat with every weirdo you meet in the game</strong></li><li><strong>have an open mind (I'm very much open to having tomatoes tossed my way, though!!)</strong></li><li><strong>5 minutes for gameplay</strong></li></ul>\n<p>Howdy, itch-y people!! My name is Amye aka obliviist and this is my very first shot at getting a game to some point of completion. I wouldn't have been able to do this, obvs, without the wonderful, free lil engine that could: the Bitsy editor. Thank you, thank you to its creator,  Adam, and shimmerwitch for the Bitsy tutorial post.</p>\n<p><strong>\"BUG MILK\"</strong> is a short little story-game about a roach named Nudnik ('Nik' for short, along with all the other terms of endearment thrown at them by the cast of bizarre characters you meet in the game) which I threw together in a single afternoon with tons of love fuelled by terrible instant coffee. Perhaps the game may seem undercooked because of this but I wanted to keep it as spontaneous as possible since I'm still getting the hang of how to make games and use Bitsy (but aren't we all!)</p>\n<p>Anywho, tl;dr (I'm prone to rambling): If you choose to play this game, I hope you enjoy it. You most likely won't find anything deep or profound in this game - the world of <strong>\"BUG MILK\"</strong> is just weird and bizarre and maybe a tad bit unsettling (if this could potentially upset you, then by all means stay the heck away from <strong>\"BUG MILK\"</strong>! Haha! Times are tough). That being said, if you're anything like me and you're a little weird and aloof and, frankly, kinda stupid... this game is for you.</p>\n<p>Be safe out there,</p>\n<p>obliviist</p>\r\n🐛\r\n<p>Oh and full disclosure: I've been told that this game may help with Animal Crossing: New Horizons burnout</p>", "metacritic": null, "released": "2020-04-28", "tba": false, "updated": "2020-05-01T06:21:41", "background_image": "https://media.rawg.io/media/screenshots/074/074c00860d13aec0fd5eeb014a3d6b68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["obliviist"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}