{"id": 438333, "slug": "bunktown", "name": "Bunk.Town", "name_original": "Bunk.Town", "description": "<p><strong>Bunk Town Battle</strong> is a free multiplayer browser game at https://bunk.town . No download/account needed! Game progression is auto-saved to your browser. </p>\n<p>Bunk.Town is an open world survival action game. The goal is to survive in Bunkfort Town and to get in Bunkfort Bunker. You can play <strong>solo, with friends, or against friends</strong> (minecraft multiplayer style), earn and spend money, help the police and much more! Just don't catch the virus...</p>\n<p>As you can see from the number of members in the Discord, this game hasn't been officially released yet, so all feedback are welcome! I tested the game extensively so everything should work, but I have no idea how this would fare with more than 1-2 players in a server, especially in terms of balancing for the mobs/equipments. I am looking forward to see you all in game!</p>\n<p>Discord Link: https://discord.gg/9ufGw2x<br/></p>\n<p><strong>Welcome to Bunk. Town!</strong></p>\n<p>You have arrived to Bunkfort Town to shelter from the global pandemic. You have spent all your savings to travel to this town, for a slight chance to get into Bunkfort Bunker to survive the epidemic. Do you have enough wits and social skills to survive?</p>\n<p><strong>GOAL</strong>: Survive and sneak into the infamous Bunkfort Bunker! </p>\n<p><strong>CONTROLS</strong>: <strong>AWSD</strong> to move. <strong>Mouse Left Click</strong> to attack/use items. <strong>SPACE</strong> to dash. <strong>Q/E/Scroll</strong> to switch items. <strong>B</strong> to buy items. <strong>USE MOUSE</strong> to manage your items. Drag your mouse out of the inventory to drop the items you are holding.</p>\n<p><strong>HOW TO SAVE</strong>: The game autosaves your progress when you close the game! However, this save is only unique to your browser. If you would like to keep the same progress on different browsers, be sure to navigate to the Bunkfort Safes to save your items in a public safe, and retrieve it in the other browser!</p>\n\n<p><strong>Bunkfort Town Map</strong></p>\n\n<p><strong>Key Items</strong><br/></p>", "metacritic": null, "released": "2020-04-27", "tba": false, "updated": "2020-05-01T07:08:45", "background_image": "https://media.rawg.io/media/screenshots/576/57680e8cd54297767f4d5194cddf9f59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["cer0zz"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}