{"id": 438348, "slug": "laser-rails-chase-ld42", "name": "Laser Rails: Chase! [LD42]", "name_original": "Laser Rails: Chase! [LD42]", "description": "<p>From LD42, 2018, made in 48 hours!</p>\n<p>Both original JAM entry version and bug fixed post-jam builds are avaliable. </p>\n<p>LD page: https://ldjam.com/events/ludum-dare/42/laser-rails-chase</p>\n<p>Description:</p>\n<p><strong>Features:</strong></p>\n<ul><li>A Jetpack equipped cyberpunk-western-robot to play!</li><li>An infinite track/world with different areas!</li><li>A randomly generated train so every game is a bit different!</li><li>Evil robots with cannon-arms!</li><li>Laser turrets that scramble you and your jetpack!</li><li>Canyons and other hazards!</li><li>Like rocks that get in your way!</li><li>Poorly modelled cacti!</li><li>A good few bugs!</li></ul>\n<p>Chase the train with your jetpack and stay in as close as you can for as long as you can to score the most points. If it gets away from you, you can still catch back up. But the train will only keep getting faster! I didnt get around to adding the laser whip unfortunately, so combat is lacking! :(</p>\n<p><strong>Controls:</strong></p>\n<ul><li>WASD/Keys - Movement</li><li>Space - Jetpack (also helps you get back up when you fall)</li><li>R to restart</li><li>M to toggle music</li></ul>\n<p>Let me know in the comments what your highest score is!</p>\n<p><strong>Notes:</strong></p>\n<p>Ive opted-out for Audio because I ran out of time to make any sfx or music so whats in the game wasnt made by me - I just threw it in last minute for some ambience! Music: BenSound https://www.bensound.com/royalty-free-music/electronica Track: ‘Scifi’</p>\n<p>(Ive updated the game since the deadline with some minor fixes for some major bugs that webGL seemed to be having. An update file is included in the source download that specifies changes. Main issues fixed: Camera was glitching out like crazy, colliders werent working initially AT ALL in the initial upload and the character was tripping on collider edges at high speeds which would ruin an otherwise smooth run.)</p>\n<p>Post-Jam Version of Laser Rails: Chase! is up.</p>\n<p>I fixed a couple of big flaws, such as some physics issues and camera problems (losing track of the player, jerky camera etc) But most importantly based on feedback I added a tutorial area at the start - sheltered from enemy fire and with basic instructions on how to play (and a easy obstacle to get you to use the jetpack). My main regret with this game was how you start off getting shot at, not good for a lot of players!</p>\n<p>You can play the POST JAM (version 1) here: http://delta-edge.com/LaserRails_PostJam/</p>", "metacritic": null, "released": "2020-04-27", "tba": false, "updated": "2020-05-01T07:11:49", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fc9862d0e57ed18c7274df45c49f043.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Alex_ADEdge"], "genres": ["Action"], "publishers": [], "esrb_rating": null}