{"id": 438373, "slug": "highland-sheep-games", "name": "Highland Sheep Games", "name_original": "Highland Sheep Games", "description": "Welcome to the<br/>Highland Sheep Games!\r\n\n<p>The sheep from the novel \"The Legend of Conner MacSheep\" are celebrating the Highland Sheep Games. Take part in the tournament or play each of the four minigames individually to improve your highscore. <br/></p>\n<p>The disciplines are: <br/></p>\n<ul><li><em>Jump for Height:</em> a contest of strength and precision where you have to jump a wall and knock the bundle of heather down without getting caught on the wall.</li><li><em>Press-o-War:</em> push your opponent over the line with quick reactions.</li><li><em>Puzzling Patterns:</em> complete ancient Scottish sheep pattern without making any mistakes.</li><li><em>Hillrace:</em> the crowning discipline of the Highland Sheep Games: collect as many bonbons as possible on this challenging run up and down the Scottish countryside.</li></ul>\n<p>All art is drawn by the author herself. If you are interested in the development history of the game, you can check out the blog in English and German here:</p>\n<p>Blog English</p>\n<p>Blog German</p>\n<p>The game can be played in both <strong>English </strong>and <strong>German</strong>!</p>\n<p>The novel with the whole story about Conner MacSheep and the Highland Sheep Games is available in both German and English as hardcover, paperback or comic at Edition Schöne Bücher.<br/></p>\n\n<p>We would be glad to hear from you in the comment section :)<br/></p>", "metacritic": null, "released": "2020-04-27", "tba": false, "updated": "2020-05-01T07:17:29", "background_image": "https://media.rawg.io/media/screenshots/506/50667b0f658f7afb556dc742b3825274.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Edition Schoene Buecher"], "genres": ["Action"], "publishers": [], "esrb_rating": null}