{"id": 43836, "slug": "diving-trunks", "name": "Diving Trunks", "name_original": "Diving Trunks", "description": "Diving Trunks is a casual dodging/shoot 'em up style game featuring a seafaring elephant who has dropped his peanuts overboard.<br/>It is your task to help 'Trunks' dive down into the deep ocean to retrieve as many peanuts as possible, all whilst gulping air bubbles to stay alive and avoiding unkindly marine life.<br/><br/>Features crisp, cartoony graphics and original music. A wide variety of enemies ensure infinite replayability. Dodge smaller marine creatures then battle colossal sea monsters by shooting peanuts from your trunk!Game Modes<strong>Endless</strong>: Collect peanuts and survive for as long as you can. Encounter Boss Monsters with randomised features - prepare for anything from a simple battle to a total onslaught.<br/><strong>Challenge</strong>: Collect 50 peanuts before reaching the sea floor. Mysteries of the deep are waiting to be unlocked. Each playthrough is completely different - no two attempts are the same.Boss FightsBattle relentless sea monsters whose size and defenses are randomly-generated - who knows what you'll encounter in the depths. Use the peanuts you've collected as ammunition to defeat these deep-sea behemoths.MysteriesUnlock 15 game-changing mysteries - including various effects and new marine creatures - by playing Challenge mode.AchievementsConquer 28 local achievements to prove your skills. Complete them all to become a Lunacy Champion.HighscoresAttempt to beat the highest local scores in each game mode.OptionsSound FX, Music, Fullscreen.ControlsKeyboard (gameplay) and mouse (menus).BackgroundDiving Trunks is the result of a private game jam contest combining the theme of 'underwater' and item 'elephant'. The initial game idea grew and has been further developed over a year with a multitude of features and content, such as additional game modes, effects, and original music by first-time composer Tom Hines.", "metacritic": null, "released": "2017-06-20", "tba": false, "updated": "2019-08-28T22:06:06", "background_image": "https://media.rawg.io/media/screenshots/ec5/ec5f1cc8d8b767cf2b5d6412d8b83d6f.jpg", "website": "http://www.lunacyinteractive.com.au/games/divingtrunks", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Lunacy Interactive"], "genres": ["Casual", "Indie"], "publishers": ["Lunacy Interactive"], "esrb_rating": null}