{"id": 43844, "slug": "still-not-dead", "name": "Still Not Dead", "name_original": "Still Not Dead", "description": "<strong>Still Not Dead is DOOM + NUCLEAR THRONE</strong><br/><br/>Shoot everything that moves with super slick and satisfying gunplay in order to unlock the exits before death arrives to chase you out of the stage. Collect money to buy more than 30+ randomly spawning items and weapons. Pick a blessing or curse before moving onto the next procedurally generated stage, which drastically changes how each run plays out. Each stages becomes more bloody and brutal as you progress so make good use of your time before death comes for you. The game combines satisfying gunplay with open environments and tactical semi-random gameplay with a lot of choice as you manage your weapons, items, money, health, stamina, stage time, monsters, blessings, curses..etc<br/><br/><br/><strong>FEATURES:</strong><ul><li> 30+ unique weapons and items<br/></li><li> 40+ blessings and curses that change how you approach each run<br/></li><li> Fully destructible environments, dynamic fire and weather system<br/></li><li> Massive hordes of monsters in an open sandbox world<br/></li><li> 'Pick up n play' gameplay, gets you right into the game<br/></li><li> Hand drawn pixel-art and original soundtrack</li></ul><br/><strong>A DEV THAT CARES:</strong><ul><li> Check the discussion boards, I read them and respond<br/></li><li> I have over 10 years experience making games such as: Use Boxmen, SkullFace, Tony Eagle..etc (which you can play online, some of which have won awards)<br/></li><li> I respond to every review and video I can find<br/></li><li> I frequently update the game during early access</li></ul>", "metacritic": null, "released": "2017-07-10", "tba": false, "updated": "2022-10-01T23:41:52", "background_image": "https://media.rawg.io/media/screenshots/1ee/1ee57d14763ad9bcf217f509bf8d8f36.jpg", "website": "http://www.glovegames.tumblr.com", "rating": 2.33, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 165, "toplay": 2, "dropped": 1}, "playtime": 3, "achievements_count": 9, "ratings_count": 6, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Greg Sergeant"], "genres": ["Action", "Indie"], "publishers": ["Flying Interactive"], "esrb_rating": null}