{"id": 438511, "slug": "mazer-pyramids", "name": "Mazer - Pyramids", "name_original": "Mazer - Pyramids", "description": "<p>We humans always are in search of an answer to solve the mysteries, find the unknown, Explore the wildest dreams...<br/><br/>A legend, wickedly smart, unbelievably strong, focussed as an eagle who is known for his unreal adventures hailed by the people as 'MAZER' the highest form of respect given to the person who defies everyone's reality and standouts to be the one. The time has come to pass on the responsibility he is carrying to explore beyond for which the Mazer designs special equipment to analyse the mind of Kiyara who he strongly felt could be the next Mazer. This equipment simulates multiple dreams in Kiyara's mind after she enters the pod and the way Kiyara thinks, acts, performs will be analyzed by the mazer before giving her the title. This is the first dream that is induced to Kiyara's mind she is now stuck in a pyramid with no maps, directions and all she can find is strange stones that glow and blue flames that memorizes. she has to come out of the pyramid and unveil the secret of what's coming next.....<br/>From now on you will be the mind that thinks, decides, acts, performs and take up this journey and prove worthy to be the next MAZER.<br/><br/>Developers Note:<br/>This game is designed to provide rich user experience for the mobile game player and the sequels of the stories will be released at regular intervals. Once all the required skills and tricks of all the stories are understood in this and upcoming sequence of games. The main game Mazer - the journey begins will be our next release till then stay tuned and support this Indie Team.<br/><br/>tags: puzzle, maze, solve, pyramid, puzzle-solving, runner, mazes, maze game, puzzle game, new games.</p>", "metacritic": null, "released": "2020-04-27", "tba": false, "updated": "2020-05-01T07:48:29", "background_image": "https://media.rawg.io/media/screenshots/d21/d212b21cd1e39c55e1595e2c25ac8046.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["RANDOMCREATORS"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}