{"id": 438671, "slug": "coconut-survival", "name": "Coconut Survival", "name_original": "Coconut Survival", "description": "<p>I developed this game entirely from scratch (no template, absolutely nothing) in the Godot game engine for the Mini Jam 53 - Oasis in 3 days without any preparation beforehand. The only things that I didn't create were the sounds and the game engine itself. I wanted to preserve the aspect of the game jam, which in my opinion is about not preparing anything before the countdown starts.</p>\n<p>Creating this game on my own without anyone to help me was a real challenge due to my slowness, but even if the game is a bit bugged and not as I wanted, it is right there! I had to make <strong>VERY</strong> harsh decisions to get everything \"done\" in time, so I'm sorry if the game isn't as good as you expected. I'm still happy to have made a procedural generated map (trees, rocks, and even clouds are randomly generated) even if it's very far from being as I wanted it to be.</p>\n<p>So please remember, I made it in 3 days only, but I hope you will still enjoy it! :)<br/></p>\n\n<p><strong>CREDITS:<br/></strong></p>\n<p>\"Fidayda\" by Turku Nomads of the Silk Road :</p>\n<p>https://files.freemusicarchive.org/storage-freemusicarchive-org/music/WFMU/Turku...</p>\n<p>Sounds (modified) used in the game:</p>\n<p>http://soundbible.com/royalty-free-sounds-1.html<br/></p>\n<p><strong><em>Stay alive as long as you can. Good luck!</em></strong><br/></p>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-04T02:22:51", "background_image": "https://media.rawg.io/media/screenshots/d90/d90169adaf18916fa2c0caa1da8a3f43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC", "Linux"], "developers": ["CTN Phaco"], "genres": [], "publishers": [], "esrb_rating": null}