{"id": 43860, "slug": "you-shall-not-jump-pc-master-race-edition", "name": "You Shall Not Jump: PC Master Race Edition", "name_original": "You Shall Not Jump: PC Master Race Edition", "description": "<strong>In a nutshell</strong> <br/><br/>There’s a character, a laser, platforms, which you must create under your feet. Using these you must ascend to the top. Still looking simple. <br/>By the way, there are three characters. Naturally each comes with their own set of characteristics. The levels. In order to get to the high level, you have to complete the lowest one for all three chars. Why? Our brave heroes are escaping the prison they were put in by the omnipotent world government. For any two one of them to do this by themselves and leave the third one behind would be just bad manners, won’t you agree? <br/>Of course we have monsters. Monsters that jump upon you, bite, explode and do horrible things of every description. Okay. Stop. How is this rouge-like, you ask? Here’s how: 70+ items that affect the gameplay and characteristics; a shop and economy; dying results in death however laughable that may sound; secrets, random events, synergies and so on down the list. Oh yes, and the story! A real one! <br/><br/><strong>Some numbers and dry facts </strong><br/><br/><ul><li>8 types of weapons; <br/></li><li>RPG-elements. 7 main and more than 20 additional characteristics; <br/></li><li>Items you can use in sets to enhance their qualities; <br/></li><li>Shops with rats-smugglers offering their best equipment; <br/></li><li>80+ story notes.</li></ul>", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2019-08-28T22:06:05", "background_image": "https://media.rawg.io/media/screenshots/b22/b227a87b82ceef8e290bd2deffa76c62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 0, "achievements_count": 56, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "macOS"], "developers": ["Time Robbers"], "genres": ["Action", "Indie"], "publishers": ["Time Robbers"], "esrb_rating": null}