{"id": 438635, "slug": "megaparty-a-tootuff-adventure", "name": "Megaparty: A Tootuff Adventure", "name_original": "Megaparty: A Tootuff Adventure", "description": "<p>Titeuf is back for more than 40 challenges, all of them crazier than ever!<br />\nThe day before school started back, Tootuff heard that it was possible to clone sheep by selecting the very best specimens. Terrified about the idea of being infinitely duplicated, Tootuff shares his concerns with his friends.<br />\nFortunately, Hugo always has a solution. If only the best are destined to be cloned, you just have to be as naughty as possible to avoid being chosen.<br />\nTootuff and his friends embark on a race to get up to as much crazy mischief as possible to avoid being cloned.<br />\n5 game modes<br />\nSchool year: On your own or with a friend, choose a playable character to do as much mischief as possible and avoid being cloned! School year contains 3 episodes to be unlocked.<br />\nOnce all the challenges in an episode have been solved and your Mega Cool bar is full, you will access the next episode.<br />\nDuels: You don’t have time and you just want to have fun? Start a duel against the computer or against a friend. Choose one of the 42 mini-games available and see who’s the worst. However, you will have to unlock the challenges in School Year. Duels are for up to 2 players.<br />\nMega Duels: Not so fast! To access Mega Duels, you have to start by surviving School Year. Right, now choose the number of challenges you want. They will succeed one another and the one who wins the most will be the winner of Mega Duels! The Mega Duels mode is for up to 4 players.<br />\nDuels of death: Duels of death can only be accessed by the best. You have to finish the game with a certain percentage to unlock them. Face several adversaries in each game challenge (presented randomly) to seize the most victories possible. The Duels of death mode is for up to 4 players.<br />\nMega Ace: Three types of challenges for the very best for up to 4 players.<br />\nLittle Ace: Four challenges with just one button<br />\nSuper Ace: Four challenges with only the direction keys<br />\nSuper Mega Ace: Ultimate challenge reserved for super mega ace players! Use the direction keys and just one button to prove that you are one of the best not just a loser!</p>", "metacritic": null, "released": "2019-11-21", "tba": false, "updated": "2023-02-14T11:27:31", "background_image": "https://media.rawg.io/media/games/829/8299ee05051a5bd8b4c506db4dad3b91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One"], "developers": ["Microids"], "genres": ["Adventure", "Arcade"], "publishers": ["Microids"], "esrb_rating": "Teen"}