{"id": 438609, "slug": "gridders", "name": "Gridders", "name_original": "Gridders", "description": "<p>YOU&#39;RE CHALLENGED TO PLAY WITH A DIABOLICAL SET OF BLOCKS THAT COULD SPELL DOOM!</p>\n<p>It&#39;s 2049 and young Zack has just been sacked. But his job at the mysterious Gridder Corporation factory is just beginning. A terrible secret is concealed in the factory&#39;s depths and 36 grid levels of tumbling 3D automatons called Gridders stand between him and heroism. As Zack, you must interact with the 3D world, strategically manipulating the Gridders to uncover the keys to your final fate. Each level&#39;s challenge is more intense than the last. Each step brings you closer to a solution, or certain doom. Gridders is the adventure/puzzle game that requires guts and gray matter, so it&#39;s use your head or lose it!</p>\n<p>The interaction with the Gridders is entirely in your control. Employ daring strategy and tactical moves to collect the pyramid keys.<br />\nThe grids are strewn with a host of items that can help or hinder your process, depending on how you use them.<br />\nListen to Zack&#39;s faithful bionic bloodhound Fidex. His bark could save your life.<br />\nEach level presents its own puzzling challenges and multiple solutions. You may even find your own solution!<br />\nStrange encounters await you. Are you in the hands of an ally or in the hands of an enemy?</p>\n<p>Match wits with agents of evil including the corporation&#39;s sinister CEO and his &quot;technocutioners&quot; known as the Hunters.<br />\nFind and employ life-saving items like time warps and power-ups while avoiding dangerous pitfalls.<br />\nDiscover devices such as telepods, trap doors and gates which you must learn to use to your advantage.<br />\nDramatic animated sequences keep the plot twisting and turning.<br />\nUnique 3D environment with graphics that pop off the screen.<br />\nOriginal CD quality music adds an edge to your mission.</p>", "metacritic": null, "released": "1994-11-18", "tba": false, "updated": "2023-04-29T14:28:16", "background_image": "https://media.rawg.io/media/screenshots/521/521eabcb4a2b15177a970d7bcae9a13e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["3DO"], "developers": ["Tetragon"], "genres": ["Puzzle"], "publishers": ["The 3DO Company"], "esrb_rating": null}