{"id": 43875, "slug": "homeworld-emergence", "name": "Homeworld: Emergence", "name_original": "Homeworld: Emergence", "description": "Homeworld: Emergence was originally released as \"Homeworld: Cataclysm\". \"Cataclysm\" is now a registered trademark of Blizzard Entertainment, Inc., and the game has been renamed to avoid confusion. Other than the subtitle change, the game is identical to the game released in 2000.\n<br/><br/>\n15 years ago, we were awakened from the cryo-trays. We had survived the journey to Hilgara, our lost homeworld. Then they told us that the plant we left behind had been destroyed. Our families... friends... everyone not on the mothership - killed. Destroyed by an enemy we never knew.\n<br/><br/>\nWe realized there was nothing for us on Hilgara. No property, no rights, no future for the \"Sleepers\". So we returned to the stars, fully awake this time, to work and rebuild our lives.\n<br/><br/>\nIt is ironic, then, that we are the ones to discover an alien capable of exterminating all life in the galaxy. And only we are in a position to destroy it.\n<br/><br/>\nFifteen years after returning to their homeworld, a Hilgaran sect unwittingly releases an alien horror. Now it's up to you to commandeer the Kuun-Lan, a Hilgaran mining vessel, and transform it into a combat-ready mothership. Build and control a fleet of ships, research technologies, and harvest resources while you search for a way to eradicate the alien threat before it is too late.\n\nNew Ships &amp; technologies - 18 individual new ships with unique unit stats and capabilities plus 25 new technologies to research.\nEnhanced Fleet Management - Time compression hastens travel and resource gathering. Fog-of-war and waypoints improve navigation. An upgradeable and moveable mothership improves gameplay.\nFull-Length Campaign &amp; Multiplayer - 17 new singleplayer missions or play through LAN with up to 8 others.", "metacritic": null, "released": "2000-08-11", "tba": false, "updated": "2023-01-02T17:55:22", "background_image": "https://media.rawg.io/media/screenshots/912/9122c3ee05e9da75bc249c4fb126b2a5.jpg", "website": "", "rating": 4.42, "rating_top": 5, "added_by_status": {"yet": 17, "owned": 117, "beaten": 4, "toplay": 8, "dropped": 5, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC"], "developers": ["Gearbox Software"], "genres": [], "publishers": ["Gearbox Software"], "esrb_rating": null}