{"id": 438701, "slug": "ending-bravery", "name": "Ending Bravery", "name_original": "Ending Bravery", "description": "<p>The story begins with a hangover. You learn quickly that it’s the final days of your semester, and your cluster housing mates are unhappy with how you’ve conducted yourself in the last…24?…hours. You’re given a challenge, and a time limit.</p>\n<p>---</p>\r\nHow the Work Relates to the Theme: Apocalypse\r\n<p>I wanted to build a story that examined on time and endings. I used the greek definition of Apocalypse to direct my making; Apocalypse (ἀποκάλυψις) is a Greek word meaning “revelation”, “an unveiling or unfolding of things not previously known and which could not be known apart from the unveiling”. I liked the idea that a character would both uncover what had happened as they went along, and that their understanding would come from retracing steps of things that had already happened.</p>\n<p>I also wanted to examine the bravery or perhaps more aptly bold and reckless behaviour that <em>endings</em> inspire. For my story, it’s the end of a semester and for this, I drew on personal experience. No matter how well (or poorly) a semester went, I would always <em>ALWAYS</em> do something foolish and rash in the final days before break. Looking back, I can find no motivation or reason other than it being my response to something “ending”.</p>\n<p>Finally, I wanted to focus on time and how it is even more of an enemy to those with any kind of quotidian physical challenge. A hangover, to an able bodied human, is usually the result of a (or a series of) bad choice(s) that can be shaken off in a day or two and the time lost is negligible. But to someone restricted to a mobility device, where their ability to do or accomplish tasks during the day are already restricted by access, their energy and wellness, and the behaviour of those around them – what does it mean to be on a time-limit when your body is further impaired by self-inflicted indulgence.</p>\n<p>Hilariously - I ran out of time, focused on back-end things, and so I share this WIP with y'all with the intention of continuing my musings and exploration of these themes in the coming months.</p>", "metacritic": null, "released": "2020-05-03", "tba": false, "updated": "2020-05-04T02:29:27", "background_image": "https://media.rawg.io/media/screenshots/988/988eedf101da32cc9a22148dbf2fb48c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kay@thepapercutarcade.ca"], "genres": [], "publishers": [], "esrb_rating": null}