{"id": 43880, "slug": "masked-forces-zombie-survival", "name": "Masked Forces: Zombie Survival", "name_original": "Masked Forces: Zombie Survival", "description": "What will you do when the zombie apocalypse comes, are you ready to tackle it right now and stay face to face with all the horrors that will appear? <strong>Masked Forces Zombie Survival</strong> is a cool game designed to put you face to face with all the challenges and horrors that zombies can bring in an alternative future.<br/><br/>In this game, your primary concern is to get the best weapons and kill the enemies that come in waves. The challenge here is that most zombies tend to be very challenging to deal with, and their level of power does increase with each wave. So, you do have to acquire the best weapons and armor if you really want to eliminate all these enemies in a great and stellar manner.<br/><br/><strong>Masked Forces Zombie Survival</strong> comes with both multiplayer PVP and multiplayer COOP gameplay. So, you are free to choose how you want to tackle the entire experience based on the way you play. One thing is certain, Masked Forces Zombie Survival comes with all the demanding gameplay and incredible wave-based experience that you always wanted to explore. <br/><br/><strong>Features</strong>:<br/>• Get your weapons and armor from the shop<br/>• Multiplayer PVP and COOP<br/>• Single-player survival gameplay<br/>• Immersive gameplay", "metacritic": null, "released": "2017-07-13", "tba": false, "updated": "2019-08-28T22:06:05", "background_image": "https://media.rawg.io/media/screenshots/7f9/7f911abd5ea1a6a975ec24c011c88db1.jpg", "website": "http://freezenova.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 37, "beaten": 2, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 10, "ratings_count": 4, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "macOS", "Android"], "developers": ["FreezeNova"], "genres": ["Action", "Indie"], "publishers": ["FreezeNova"], "esrb_rating": "Mature"}