{"id": 438918, "slug": "stargrid", "name": "StarGrid", "name_original": "StarGrid", "description": "<p><em>2150.  </em></p>\n<p><em>     Les grandes pandémies du 21ème siècle ont poussé l'humanité à se tourner vers l'espace. Seules les profondeurs de la Terre restent habitables et fourmillent de villes entièrement souterraines.</em></p>\n<p><em>     Lorsque la survie de chacun s’est avérée être un enjeu collectif, lentement mais sûrement, le désir toujours plus croissant de sécurité a permis l’essor de mesures de plus en plus liberticides, avec l’accord d'une majorité de la population. Surveillance de masse, rationnement, informations filtrées et couvre-feu sont devenus le quotidien des terriens.</em></p>\n<p><em>     Tragiquement, pour les plus pauvres du moins, c’est sur l’accumulation des privations que prospère la pègre.</em></p>\n<p><em>     Afin de lutter contre ce phénomène galopant, la République Démocratique des Terriens Unis a massivement investi dans le projet StarGrid, une immense prison spatiale en orbite terrestre. Des rumeurs persistantes circulent à propos d’emprisonnements abusifs, notamment d’opposants politiques.</em></p>\n<p><em>     Malgré ces jours sombres pour l’humanité, certaines voix dissidentes veulent préserver l’idéal de liberté. Pourchassés pour activisme terroriste, ils ont trouvé refuge sur la Lune, et officient sous le nom de Coalition Sélénite.</em></p>\n<p><em>     Vous incarnez l’un de leurs meilleurs éléments, et avez reçu la très délicate mission d’infiltrer StarGrid, afin de faire libérer des alliés précieux pour les luttes à venir...</em></p>\n\n<p>StarGrid est un jeu de type Action/Commando-like dans un univers sci-fi. En tant qu'Agent de la Coalition sélénite, votre première mission consistera a libéré un ingénieur de votre groupe. Vous devrez pour cela vous faufiler entre les sentinelles de la station spatiale et déjouer ses sécurités.</p>\n<p>J'espère que vous prendrez du plaisir en jouant à StarGrid !</p>\n<p>Lysenti</p>", "metacritic": null, "released": "2020-05-03", "tba": false, "updated": "2020-05-04T03:19:17", "background_image": "https://media.rawg.io/media/screenshots/1a7/1a79459473ed060a8da14e6c57868c3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lysenti"], "genres": ["Action"], "publishers": [], "esrb_rating": null}