{"id": 43903, "slug": "b", "name": "b", "name_original": "b", "description": "this is a play as you desire game.b freeflight experience: a newly created undulating meadow in spring / summer with a central big tree and day-night-cycle on every start is the playground of b -- a bumblebee of subgenus gaudium formosum, recognizable by their cheeky :p.controls<strong>non-assignable controls</strong><br/>ESCAPE: open menu<br/>left mouse button click (with menu not open): toggle grass density to alternative value<br/>r: toggle let camera rotate around b<br/>p: toggle land on below place and stick to it<br/>s: halt when moving only due to inertia<br/>i: toggle slow down time to a halt<br/><br/><strong>assignable controls and their default value</strong><br/>increase flight speed (accel): w<br/>slow down flight speed (brake): s<br/>turn left: a<br/>turn right: d<br/>fly up: space<br/>fly down: left shift<br/>roll left: q<br/>roll right: e<br/>move wings to forward flight direction: o<br/>move wings to upward flight direction: l<br/><br/><strong>joystick meaning</strong><br/>thrust: speed<br/>rudder: up/down<br/>wings: roll<br/>yaw: left/right<br/>heli +/-: forward/upward<br/><br/><strong>Note</strong>: utilizes joystick 1 of Windows. The preferred joystick might have to be set as default within Windows game controller settings.settings<strong>launcher</strong><br/><ul><li>Graphics Quality: position in list: top: low quality, low hardware demands; bottom: high quality, high hardware demands (mostly GPU);  <br/>most bottom is default</li></ul><br/><strong>ingame</strong><br/><ul><li>landscape setting: 5 is default size. 6 already is demanding. 1 is minimum. 15 is very demanding. (GPU demands scale by the entire range, CPU demands scale from 6 upwards and have a minimum on average around 3 due to number of trees visible.) After change, clouds take time to fill the sky. While their generation isn't complete slider is disabled and frame rate might be unusually low.<br/></li><li>disable elastic camera: makes camera statically fixed, improves performance on weak CPUs<br/></li><li>number of dandelions: a high number of dandelions requires a strong CPU only when all their seeds are in the air (around one location)</li></ul>known issues<ul><li>some custom mp3 s don't play (due to large values in one of duration / bitrate / filesize),<br/></li><li>sometimes, after having switched resolution, the game doesn't initialize. Alt+Tab ing to Windows Desktop and back to game initializes it then. The menu might not accept input then. In this case, press ESCAPE to play without configuration. A Windows restart cures this issue.</li></ul><strong>Note</strong>: no collisions is on purposechanges<ul><li>since media creation: the landscape turning dark for around half a second after sun set and moon rises is fixed, midday peak brightness slightly reduced, morning and evening brightness reduced, night brightness slightly reduced, fog closer in morning and evening, game name logo replaced game name text in menu</li></ul>made with<br/><strong>Game Engine</strong><br/>Unity<br/><br/><strong>Third-Party assets</strong><br/>Shockwave-Sound: Days In the Sun (Full track), From Night to Dawn (60-secs version) (Invoice Nr.: 212765), LYN074: Nature &amp; Environments Set 3, LYN152: Ambient Environments (Invoice Nr.: 212869)<br/><br/><strong>Third-Party libraries, all from Unity Asset Store</strong><br/><ul><li>DirectX 11 Grass Shader <br/></li><li>Simple SSAO <br/></li><li>Azure[Sky] Dynamic Skybox <br/></li><li>Unity UI: OxOD Open/Save File Dialog System <br/></li><li>uAudio: Mp3 Player/Streamer <br/></li><li>NPR Oil Paint Effect</li></ul><br/><br/><strong>system requirements are a guideline, they are not guaranteed to be the only one or satisfying everyones criteria. The central big tree, when close enough in view, is particularly CPU-intensive and might decrease framerate.</strong><br/><br/>recommending a joystick having thrust and yaw control.", "metacritic": null, "released": "2017-06-26", "tba": false, "updated": "2022-08-27T23:19:01", "background_image": "https://media.rawg.io/media/screenshots/909/909e246c91ebe8b6ce165fb9549c74f7.jpg", "website": "http://uani.de/b", "rating": 2.23, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 230, "beaten": 7, "toplay": 2, "dropped": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["u&i"], "genres": ["Casual", "Indie"], "publishers": ["u&i"], "esrb_rating": null}