{"id": 43920, "slug": "neurowake", "name": "Neurowake", "name_original": "Neurowake", "description": "Neurowake is a team-based FPS game, designed exclusively for VR. Choose between one of five epic heroes, each with their own unique weapons and skills and compete across a variety of environments and match types.Story<br/>The Awakening brought chaos to the world, tearing it to pieces and setting up the foundation for a new global order, new threats, allies, and obstacles to overcome. Separated by ideology and belief, you must take on the responsibility of a member loyal to the UWC or choose to stand for freedom with the resistance. Whatever your decision - it's time to prove your worth on the battlefield.Heroes <br/>Take part in online battles as a UWC representative or a resistance hero and take down those that oppose your faction. Combine real world skills with unique abilities to become the ultimate Neurowake champion. Five epic hero characters are available in Neurowake Early Access now.Teleportation in VR <br/>Where most VR shooters tend to have a slow game pace. Our unique chessboard teleportation method brings intensive fast gameplay to virtual reality allowing you to focus on your what really matters. Taking out other players.Weapon &amp; Skill<br/>Every Neurowake hero is equipped with a unique set of weapons. Blasting your opponents away with double wielded shotguns up close or a tactful sniper kill. The choice is yours. <br/>Don’t forget the skill. The heroes are all with augmented power, from X-Vison to Ghost Cloak, which might make you be the game changer.Game Mode<br/> Free-for-all and Team Death Match are here. Need a new challenge? Siege mode will do the trick. Neurowake offers three classic game modes that guarantee one hell of a VR ride.Map<br/>The awakening has left its mark on the world. Battles have taken place in the most remote locations. From the sewers down below to the amazon jungle. You get to prove your worth all over the world in unique environments designed to give a thrilling VR experience.", "metacritic": null, "released": "2017-07-14", "tba": false, "updated": "2019-08-28T22:06:03", "background_image": "https://media.rawg.io/media/screenshots/608/608613aab2dff2aa7cd5cafcc27842d6.jpg", "website": "http://www.playneurowake.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 587, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shortfuse Studio"], "genres": ["Action", "RPG", "Strategy", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["Shortfuse Studio"], "esrb_rating": null}