{"id": 43926, "slug": "high-clear-vr", "name": "High clear VR", "name_original": "High clear VR", "description": "The High clear VR is Realistic graphic base Badminton VR Game.<br/><br/>From Simple mini games and lively fights, you can easily enjoy a fun and enjoyable game without badminton knowing it.<br/><br/>Enjoy playing badminton at home through Motion Control.<strong>match Mode</strong>Enjoy realistic badminton matches using four distinctive characters. You can do a lot of different shots based on a great physical engine. Also, the excellent AI and animations makes it more realistic. Win a game and enjoy the competition with users around the world.<strong>funny Mode</strong>You can enjoy 4 fun mini games. Try competing with users around the world. Easy and fun games will be Killing your time.<br/><ul><li>Smash down the drumsGet the score by drop the drums. If you drop the all drums, you get the bonus time. At the end of the time, the games over.</li></ul><ul><li>Fishing badmintonHit the fish and get the score and bonus time. Over time, fishs fade away. At the end of the time, the games over.</li></ul><ul><li>Extermination insectExtermination the fly and bee, get the score and bonus time. If you catch the burtter butterfly, you lose score and time. At the end of the time, the games over.</li></ul><ul><li>FootballAvoid the wall and get score. If you don't get score, you lose 1 chance. If you lose 5 chance, the game is over.</li></ul><strong>features</strong><ul><li> Support HTC Vive<br/></li><li> Badminton skill improvement and rank competition with mini game<br/></li><li> Competition with users of various skills with badminton Match<br/></li><li> Practical shuttlecock moves through swing motion and force(Hair Pin, Smashing.. ETC)<br/></li><li> Build a real badminton match feeling ingame <br/></li><li> Various Modes: Match, Funny</li></ul>", "metacritic": null, "released": "2017-06-28", "tba": false, "updated": "2019-08-28T22:06:03", "background_image": "https://media.rawg.io/media/screenshots/ebe/ebe6e178888b91fbe8c81854e2929c37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FiveStarGames"], "genres": ["Action", "Sports", "Casual"], "publishers": ["FiveStarGames"], "esrb_rating": null}