{"id": 439329, "slug": "spaghetti-tacos", "name": "Spaghetti Tacos", "name_original": "Spaghetti Tacos", "description": "<p><strong>Description:  I am sure if you have seen ICarly you have wondered what a spaghetti taco tastes like. Well, now you can practice making one virtually. </strong>Help Spencer gather the odd ingredients in odd places before time runs out and he is forced to eat vegetables for dinner. Gather ingredients from recipe by pressing  'z' in front of them. Mix them up and get ready for a delicious supper. </p><p>\n</p><p><strong>Controls: Z, X, arrow keys and enter</strong></p><p><strong>Stage 1: Ideation </strong></p>\n\n<p>\tI liked a lot of these ideas and enjoyed the process of brainstorming but after learning more about GB studios thought that a lot of them would be harder to create. The narrower constraint of a ‘Space Taco’ theme helped me a lot. The night before the assignment was assigned I had a hard time thinking of general games. This opened the door to a lot of weird and fun ideas that could help me create an interesting game even if it wasn’t space taco themed. </p>\n<p>\tThe layout of GB studio reminds me a lot of ‘Webkinz’ type games because I never played on a gameboy. During quarantine, I have been back on Webkinz and had fun but wanted to try and not base my game off of something that I already play. This helped narrow down the list for the paper prototyping stage. </p>\n<p><strong>Stage 2: Paper Prototyping</strong></p>\n\n<p>\tI tested different parts of games and mixed and matched ideas/ sprites/ settings from my ideation phase. I mostly drew from my elevator pitch idea, about Icarly and spaghetti tacos but wanted to incorporate space. I kept my ideas simple and clean so there would be room to expand in the digital phase or take some ideas in another direction. I was unsure of what kind of game I wanted to create- maze, adventure, puzzle, math, etc. </p>\n<p>\tMy family took turns looking through my paper prototyping stage as well as the ideation stage and gave a lot of feedback. My sister plays games on her phone while watching television so she wanted a mindless, non-stressful game so she liked the ideas of a maze, going through it at her leisure, while being able to look up at the tv when a good part came on. The rest of my family liked intense games that required thought and stress. For example, racing a timer with a maze or puzzle. </p>\n<p>\tI decided to use a little of each of their feedback for my digital prototyping phase. Even with my parents being older, and having seen Icarly a handful of times, they were intrigued by the taste of spaghetti tacos. I took away the space idea and focused on Icarly themed digital prototyping. </p>\n<p><strong>Stage 3: Digital Prototyping</strong></p>\n<p>\tFor the digital prototyping phase I created 1 game with different settings and objectives. I unfortunately do not have images of the settings in photoshop because my laptop was not working and she deleted everything to save space for videos. I think that this was a good thing because I worked out a lot of kinks on her laptop which saved me more time on the final game portion.</p>\n<p>\tThe first setting was solely the kitchen. I created sprites and backgrounds in photoshop. After completing the photoshop portion I noticed that my backgrounds were unclear which could create confusion and a harder time learning the game. I needed more detail in the backgrounds and sprites. In this game Spencer (the main character) had to boil water for spaghetti, while being distracted by people and questions (like his landlord or younger sister), nothing could overheat and I could not be rude to another character. This game was hard to manipulate and a lot of changes would have been needed to create a game that was not overwhelming and hard to follow. A lot of movements that I had been working on made sense to me while it did not to many other people. I learned from this prototype that I wanted more movement and change of scenery. My Mom said that she would not want to play this game because it is something she deals with every night. I think that because I was stuck on this idea that I forgot that I wanted my game to be weird and a different type of adventure. </p>\n<p>\tThe second setting was partly used in the final game. It was different settings and different tasks to be done in a certain time and maze like. This part of the process was extremely frustrating for me because it seemed like when I fixed a background a sprite would disappear or something would always be wrong. I created quite a few sprites and backgrounds and then tried to set up transitions for each screen, like a change scene. The farming screen had too many pixels so I needed to completely redo it as well as some images being blurry or looking very abstract. When I showed my sisters, they gave me the idea to create it so that sprites were not very obvious all the time. This made the game harder as well as more stressful with a time limit. Overall, this prototype was more of what I based my game off of. My family liked the setting of this game more because it was more adventurous. </p>\n<p><strong>Stage 4: Final Game</strong></p>\n<p>\tThe final game took a lot of tweaking but I was very happy with the way it turned out. It helped with my photoshop skills a lot, creating many different small sprites and backgrounds with only a few colors. Some sprites I created include: spaghetti flowers, a hammer, a bowl, tomatoes (which I learned I spelled wrong the entire game). </p>\n<p>\tFor my next game, I would like to work on creating actors to look a certain way instead of using the ones given as well as creating more decisions in the game. The game I created focuses more on getting from one place to another and less on making decisions that could result in a game over. </p>\n<p>\tFor ICarly fans this game will make a lot more sense- with weird references between actors etc. I put my own spin on how he gathered the ingredients like mashing tomatoes in the yard to create spaghetti sauce. </p>\n<p>\tI have user tested this game around my family and they seem to like it. My parents did not try out the game on my laptop until it was completely finished and they seemed to like it. My parents enjoyed the stressful yet also not stressful and wacky game. My sister enjoyed the words of affirmation surrounding each menu checklist. My other sister could not grasp the concept of having to pick things up using ‘z’. This made her frustrated that she could not just pick things up by walking into them. </p>\n<p>\tThe process of creating my first game was stressful and frustrating at times however once I got over the bugs I really enjoyed making it. Youtube videos were super helpful resources. After discussing spaghetti tacos for so long I am going to go make a real one. </p>\n<p> </p>", "metacritic": null, "released": "2020-05-03", "tba": false, "updated": "2020-05-04T04:56:04", "background_image": "https://media.rawg.io/media/screenshots/7c9/7c9d72b21e291e2109259fe432cb32ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mckennaagrayy"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}