{"id": 43946, "slug": "the-house-of-da-vinci", "name": "The House of da Vinci", "name_original": "The House of da Vinci", "description": "<p>Enter The House of Da Vinci, a new must-try 3D puzzle adventure game. Solve mechanical puzzles, discover hidden objects, escape from rooms and dive into the authentic atmosphere of the Renaissance. Use all your wits to find out what&#39;s behind your master&#39;s disappearance.KEY FEATURES<br />\nSOLVE MECHANICAL PUZZLES<br />\nBrain twisters and baffling riddles are all based on Leonardo’s inventions.<br />\nENJOY INTUITIVE TOUCH CONTROL<br />\nNavigate Leonardo’s workshop intuitively. Playing the game couldn’t be more fun.<br />\nEXPERIENCE THE RENAISSANCE<br />\nWar machines, complex lockboxes, mechanical puzzles, room escapes will all test your skills.<br />\nMASTER UNIQUE MECHANICS<br />\nDetect hidden objects by seeing through the surfaces around you.<br />\nPEEK INTO THE PAST<br />\nAn unusual gauntlet allows you to witness events that happened earlier, and learn more of the story.WHAT’S THE STORY BEHIND THE HOUSE OF DA VINCI?You are Da Vinci’s most promising apprentice. Your master, Leonardo, has disappeared. You have no idea where he’s gone or what has happened. So you begin your quest, your search for the truth. However, Leonardo&#39;s workshop is full of puzzles, inventions, escape mechanisms and objects hidden in all corners of beautifully decorated rooms. You’ll need to use all of your brain cells to find out what’s really going on!<br />\nWe’ve applied our own imagination to the story of the world’s greatest inventor, Leonardo da Vinci, providing players with unique special abilities throughout gameplay. We allow you to warp back into your early days as a young apprentice, exploring the 16th century world around you, peeking into Leonardo’s mechanisms, puzzles and devices, as you eventually become powerful enough to control time itself and learn the secrets hidden in the past.<br />\nMany challenging puzzles are inspired by Leonardo Da Vinci&#39;s real inventions and ideas. Mysterious locations were created based on original artworks and the wonderful Florence, Italy of 1506.LANGUAGESThe House of Da Vinci is now available in English, French, German, Spanish, Brazilian Portuguese, Czech, Slovak, Russian, Turkish, Italian, Polish, Japanese, Korean, Simplified Chinese, Hindi and Malay.WHO ARE WE? Blue Brain Games is an enthusiastic indie team of graphic artists and developers, all of whom are fans of both 3D puzzle games and the renaissance genius Leonardo Da Vinci. The House of Da Vinci was successfully funded on Kickstarter in late 2016. Install the game now and join over 2.391 adventure game enthusiasts that backed The House of Da Vinci!</p>", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2024-04-17T13:03:27", "background_image": "https://media.rawg.io/media/screenshots/901/901c8aaf0b2f0726b394746f6f33ab18.jpeg", "website": "http://thehouseofdavinci.com/", "rating": 3.85, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 207, "beaten": 33, "toplay": 12, "dropped": 8, "playing": 3}, "playtime": 6, "achievements_count": 6, "ratings_count": 36, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 40, "platforms": ["iOS", "Android", "Nintendo Switch", "macOS", "PC"], "developers": ["Blue Brain Games"], "genres": ["Adventure", "Strategy", "Indie", "Puzzle"], "publishers": ["Blue Brain Games"], "esrb_rating": "Everyone"}