{"id": 439708, "slug": "zoom-or-boom-jumping-pirate", "name": "Zoom or Boom: Jumping Pirate", "name_original": "Zoom or Boom: Jumping Pirate", "description": "<p>...about Author:<br/>https://johnnywhaam.wixsite.com/whaam<br/>Johnny Whaam, indie game developer.<br/></p>\n<p>...about Game:<br/>https://play.google.com/store/apps/details?id=com.ZoomorBoomJumpingPirate<br/></p>\n<p>Little red pirate jumps up into an incredible adventure, he needs to be faster than the missile to reach the top and escape. Can he find his way up?<br/>    Jumping has never been more fun, exciting and challenging at the same time! There's time to look around for the right path while jumping up and up...but don't wait too long, especially when you're getting closer to the top cause the constantly following missile gains speed and goes faster and faster.   <br/>    Power ups will help our little friend, discover and use all of them as you jump up but beware of traps and enemies too, evade cannonballs and bullets...</p>\n<p>Zoom or Boom : Jumping Pirate, features:<br/></p>\n<p>........15 Levels....... wonderful worlds to explore. Jungles and waterfalls, under the ocean, lava land, Roman amphitheather, icy land or space, deserts with gigantic flowers...<br/>........Platforms, path to the top........ sometimes it feels like a puzzle or a labyrinth, our pirate will have to stop for a second and look for the fastest way up.<br/>........Power ups........ on each level something new to discover and use, fly with wings, on a rocket, use helicopter helmet, double jump, or jump into cannon and get shot up, fly as a cannonball...and much more.<br/>........Traps........ and enemies, don't get to close to guards with laser spears, or aliens with futuristic weapons walking back and forth, be faster than fire and flamethrowers...and more.<br/>........Missile........ it always follows our little red, jumping pirate, there is no escape from the missile, unless... he's faster in a race to the top. An exit, a portal that transports him to the next world is there, right up there...<br/>........Checkpoints and lives........ there are 3 checkpoints on each level and 3 hearts, extra lives to collect on your way up. That way you don't restart from ground up every time, but...do not get hit by the missile, if it catches and hits the pirate, it's game over for that level. No matter how many lives you've collected, all is lost and you're back on the start.<br/>........Coins and diamonds........ if you reach the top, the next level opens.     You can also open any level if you have enough diamonds, each level has it's value, tap on any level number button and if you've got enough diamonds, it opens.<br/>    Always collect as many coins as you can on easier levels, when you reach the top they're converted to yellow diamonds.<br/>........Record time........ try playing a level again and beat your record time. How fast can you jump?<br/>Have fun jumping and flying around, be fast, be cautious, be faster...Zoom or Boom, Jumping Pirate wants to jump!<br/>Please download and rate this game, you're ratings are very much appreciated.<br/>Thanks...</p>", "metacritic": null, "released": "2020-05-02", "tba": false, "updated": "2020-05-04T06:25:39", "background_image": "https://media.rawg.io/media/screenshots/2ef/2efe5f80b6ebca9c4d6c38653f16f3ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whaam"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}