{"id": 439767, "slug": "transarctica-remake", "name": "Transarctica Remake", "name_original": "Transarctica Remake", "description": "<p>Roam a hostile frozen world in a futuristic steampunk train, fight train battles and try to stay alive while searching for clues about the \"Sun\". Along the way bond with your crew members, find new allies or make new enemies. Help communities survive the harsh environment or crush and enslave them. Good or bad, your decisions will make a difference.</p>\n<p>The goal of this project is to remake, reboot, reimagine the old DOS game Transarctica. The game had a pretty unique (for the time) backdrop and lore. Unfortunately, it was a product of its time and had some frustrating shortcomings. The idea is to keep the nice parts intact and revamp the parts which did not age well.</p>\n<p>I want to keep the art style (in HD), the map and the interface as close to the original as possible. The hot zone based interface is still there. If there is no clearly defined buttons on the screen you need to click on the image to interact with persons or things.  The lore and some story elements also remain. You can trade, you can fight, you can buy new wagons to help you survive.</p>\n<p>Some mechanics will be updated thou, such as the cities.  They will have dynamic supply and demand, extra marketplaces and more options to further the story and add side quests. <br/>Your core crew will also have \"personalities\" and you can also expand the team to update the capabilities of your train.<br/>The Viking Union will also be more layered and more clear on their motives. They will be more than one dimensional baddies.<br/>I want to add side quests and dynamic, branching story with greater emphasis on the world building. I'm thinking something similar to the the Mass Effect. Much smaller in scale and scope, of course, but your decisions will have consequences as you progress and may result very different endings. </p>\n<p>It is still in Alpha, please keep this in mind. The story is currently not there and there is no ending. You can roam around, trade, fight an endless stream of trains and find coal mines. If you find something frustrating or not well thought out, drop and note and I will try to address. <br/></p>", "metacritic": null, "released": "2020-05-01", "tba": false, "updated": "2020-05-04T06:39:48", "background_image": "https://media.rawg.io/media/screenshots/ce7/ce7f2f3df3bbbf2f5c8710e56a064b32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pendra37"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}