{"id": 43982, "slug": "idle-champions-of-the-forgotten-realms", "name": "Idle Champions of the Forgotten Realms", "name_original": "Idle Champions of the Forgotten Realms", "description": "<p>Idle Champions of the Forgotten Realms is an official Dungeons &amp; Dragons idle clicker game.</p>\n<p>Idle Champions challenges players to assemble a party of Champions and master the art of Formation Strategy. Players unlock new heroes, upgrade them to reveal special abilities, and collect epic gear. The key to glory is learning how to combine Champion abilities to defeat an onslaught of powerful monsters.</p>\n<p>Key Features:<br />\nUnlock Renowned ChampionsCollect renowned Champions from the world of Dungeons &amp; Dragons, including fan-favourites from the Force Grey series. Unlock more Champions and gear to add to your party in limited-time events.<br />\nFormation StrategyMastering the position of each Champion to maximize their special abilities is the key to completing each adventure. Each Champion&#39;s abilities and gear requires careful thought to create the best combination. Only the most powerful formations will defeat the waves of Dungeons &amp; Dragons monsters.<br />\nExplore the Forgotten RealmsTake your Champions on a journey through the Sword Coast. Players will be able to explore familiar locations within the Forgotten Realms as they tackle each adventure. After launch, the game will be updated with content inspired by the official Dungeons &amp; Dragons adventures, starting with a trip to Chult with the Tomb of Annihilation.<br />\nRegular EventsThe game is updated regularly with limited-time events. Completing events unlocks new Champions and gear to add to the player&#39;s collection.A Note About Premium Purchases:<br />\nYou can download and play Idle Champions for free, however, some premium in-game items can be purchased for real money.<br />\nGems earned for free in-game can be redeemed for Silver Chests and Gold Chests that contain equipment, potions, buffs, and gold.<br />\nSilver Chests contain 3 cards (Common to Uncommon rarity). They have a chance of dropping “Rare” equipment cards, but do not contain “Epic” equipment cards.<br />\nGold Chests contain 5 cards (Uncommon to Rare rarity). They always contain a Rare equipment card and have a chance of dropping an Epic equipment card.<br />\nGold Chests are available to buy in the shop for real money or you can wait and purchase them with gems earned for free during game play.<br />\nBonus “Golden Epic” equipment cards are generally only available as a purchase bonus for real money transactions, though specific Golden Epic cards may become available through free means at Codename Entertainment&#39;s discretion.</p>\n<p>In-App purchases range from $5-$50 per item.<em>Chance of a Rare drop in a Silver Chest is approximately 3.2%.<br />\n</em>*Chance of a Rare drop in a Gold Chest is 100% and an Epic drop is at least 10%.</p>", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2024-04-09T09:21:19", "background_image": "https://media.rawg.io/media/games/246/246367eab7ccfaaad14ad4507deee067.jpeg", "website": "http://www.idlechampions.com", "rating": 2.46, "rating_top": 3, "added_by_status": {"yet": 88, "owned": 1668, "beaten": 4, "toplay": 1, "dropped": 86, "playing": 15}, "playtime": 3, "achievements_count": 582, "ratings_count": 139, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 140, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC", "macOS"], "developers": ["Codename Entertainment"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Codename Entertainment"], "esrb_rating": "Teen"}