{"id": 43985, "slug": "prelude-for-a-dream", "name": "Prelude for a Dream", "name_original": "Prelude for a Dream", "description": "<strong>Prelude for a Dream: </strong><br/><br/>-Join a nostalgic voyage in Prelude for a Dream, with 4 catchy protagonists: Aglasis, Morail, Humots and Sustugriel. Each of them with unique backgrounds. Try to uncover the missing memory parts of our heroes, while you explore a world rich in cultures and stories. <br/><br/>-Prelude for a Dream is a game inspired in the Japanese RPGs of the past, made in VX Ace engine. But, it has a characteristic that resembles a lot the Western RPGs: You can access many of the world map of the game in the beginning… But, in the same way of the Westerns RPGs you will not pass the challenges before some training. How far you can go in a low level? Try hard, as much as you can.<br/><br/>-An all original OST made by me, almost 70 compositions. I composed for at least 5 years. Truly, some places were influenced by the music, and vice versa. <br/><br/>-Pay very attention to the story, which is very intriguing and fascinating, mixing various components. <br/><br/>-The battle system is the old classical like Dragon Quest. Mixing components like Special Attacks and Magic. Adding a bit of pepper to make the events more incendiary. Basically, in the side quests, that depending on how you play, can become very difficult.<br/><br/>-There are many secrets, and it is not about the story (but that too!). It is about the constructions of the maps. Try to catch everything while you explore the world!<br/><br/>-Important: <br/><br/>Press F1 to configure the screen, control options etc.", "metacritic": null, "released": "2017-06-27", "tba": false, "updated": "2019-08-28T22:06:01", "background_image": "https://media.rawg.io/media/screenshots/11e/11ee5dce4325bcc8d10986f5a878f64b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diego Fernandes Malinowsky", "Altanir Aparecida Fernandes Malinowsky", "Daniel Fernandes Malinowsky"], "genres": ["RPG"], "publishers": ["Diego Fernandes Malinowsky"], "esrb_rating": null}