{"id": 43987, "slug": "what-my-neighbors-are-demons", "name": "What!? My Neighbors Are Demons!!?", "name_original": "What!? My Neighbors Are Demons!!?", "description": "Story<br/><br/><br/>Poor Selene! It seems our protagonist was a bit too rough with her ex-boyfriend following high school. After being incapable of putting up with Selene’s insatiable lust, he decided to break off their relationship. Traumatized from being dumped, Selene became afraid of herself and has chosen to keep the lustful side of her personality locked away deep within her.<br/><br/>Now in college and living on her own, she has been mostly successful in this endeavor despite a few strange friendships and some lonely nights. Her resolve begins to wane, however, as the woman’s calm and solitary life get turned upside down by supernatural forces. Twin demons (a <strong>succubus</strong> and an <strong>incubus</strong>), secretly parading as humans, have moved in next door to her.<br/><br/>Once the two twins find out that their “dear neighbor” is having a bit of a personality crisis, their interest in Selene skyrockets. Elated to have a new toy to play with, the demons decide to help in the best way fiendish and mischievous neighbors can… by making her life just a little more complicated! Will the twins succeed in snapping Selene back to her normal self? Or will they make her even worse than she used to be?<br/><br/> Features<br/><ul><li>W!?MNAD!!? has a strong focus on corruption and moral degeneration. Join our characters on their downward spiral of moral integrity.<br/><br/></li><li>A smooth and sensual soundtrack compliments our crazy scenes. Taking inspiration from the 80s, Critical Bliss aims to make high quality music you would want to hear outside of the story. We hope to deliver an original \"A E S T H E T I C\" experience.<br/><br/></li><li>W!?MNAD!!? explores a lot of fetishes and fetishistic scenarios. One can expect tons of variety, positions, and themes. The choices made in scenes will alter how those scenes play out. Unlock secret endings based on your decisions!<br/><br/></li><li>Discover secret easter eggs hidden throughout the game. Will you be able to find them all?<br/><br/></li><li>Critical Bliss strives to have an ear for quality and sound direction. Our scenes won't feel complete without some nice sounds. Please look forward to well-directed groaning, moaning, panting, and other luscious murmurs echoing in the background.</li></ul>", "metacritic": null, "released": "2017-04-26", "tba": false, "updated": "2020-04-15T10:01:20", "background_image": "https://media.rawg.io/media/screenshots/64e/64e2d4deccf84f732d381dddd9d795f5.jpg", "website": "https://www.patreon.com/CriticalBliss", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC", "Linux"], "developers": ["Team Bliss", "criticalbliss"], "genres": ["Casual"], "publishers": ["Critical Bliss"], "esrb_rating": null}