{"id": 44003, "slug": "pinball-wicked", "name": "Pinball Wicked", "name_original": "Pinball Wicked", "description": "<strong>Pinball Wicked is one of the world's most advanced virtual pinball simulations. <br/>Magnificent ball rolling physics and wicked pinball mechanics running on a cutting edge engine: the high fidelity pinball experience.</strong><br/> <br/>At the game's core is a physically accurate and believable pinball experience simulating all the classic elements:<br/><br/>Balls, Flippers, Kickers, Lights and Lamps, Scoops, Diverters, Targets, Rollovers, Posts, Pegs and Pins, Ramps and Habitrails, Bumpers and Spinners, Gates and Doors, Magnets and Coils, Captive Balls and Captivating Toys - supported by a retro styled dot matrix display, a versatile light sequencer, sounds, voices and music.<br/><br/>Includes the arcade edition of Original Table #1 - Black Flaggers<br/><strong>Black Flaggers</strong> invites you on a pirate’s journey of plundering loot, swashbuckling adventures and cannon wielding foes. The playfield, toys, characters and environment create a lush and vibrant pirate world brimming with life and adventure.<br/><br/><strong>More tables will be developed during Early Access. <br/>These will be purchasable as downloadable content (DLC).</strong><strong>Pinball Wicked in a nutshell</strong><br/>The core of the game is a cutting edge pinball simulation system based on Epic’s awesome Unreal® Engine 4: Highly accurate physics, a modular game play system and a fully dynamic specialized lighting and fx system, capable of sequencing hundreds of lights.<br/><br/><ul><li>Includes Black Flaggers: <strong>Vibrant pirate world brimming with life and adventure</strong><br/></li><li>Classic and modern pinball elements<br/></li><li><strong>Absolute pinball physics</strong>: Highly accurate rolling ball simulation<br/></li><li>Fully dynamic, real-time lighting and <strong>physically-based rendering  (PBR)</strong><br/></li><li>Beautifully illuminated by <strong>a versatile light sequencer</strong><br/></li><li>Heaps of awesome particles and fx<br/></li><li>Pinball Action Cams: Switch instantly between predefined cameras and between fixed and dynamic modes.<br/></li><li>Retro styled dot-matrix display (DMD)<br/></li><li>High score table<br/></li><li>Operator menu: Additional customization options for gameplay relevant settings, like balls per game, Ball Saver durations, and more.</li></ul><br/><strong>Stay tuned for new feature announcements during Early Access!</strong>The upcoming <strong>Deluxe Edition DLC</strong> will contain the following feature additions: <br/> <br/><ul><li>Free Camera with custom camera presets. Add custom camera settings to the game, recall them during gameplay or set one as default.<br/></li><li>\"Glass Off Mode\": move, shoot and catch the ball by hand<br/></li><li>Additional ball skins</li></ul>", "metacritic": null, "released": "2017-09-21", "tba": false, "updated": "2019-08-28T22:06:00", "background_image": "https://media.rawg.io/media/screenshots/62d/62d48dbb2f6d8b5e821ff5e36d681750.jpg", "website": "https://pinballwicked.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 481, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Formslingers"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Formslingers"], "esrb_rating": null}