{"id": 44006, "slug": "potentia", "name": "Potentia", "name_original": "Potentia", "description": "<h3>Gameplay</h3><br/><br/><br/>Approach your enemies silently and takedown them with your trusty crowbar. Get your hands dirty with close combat if you are caught. If you prefer to use a silent ranged weapon, use your bow to silently hunt your enemy down. When the things get really messy, switch to your reliable assault rifle.  For the worst case, always keep your pistol somewhere nearby. Most importantly, manage your ammunition and medkit shots wisely. If you want to survive all these, you have to use your items carefully.<br/><br/><ul><li>Feel the action while witnessing Victor’s strange story on this new world.</li></ul><ul><li>Choose your style! You can dive into full action or sneak through your enemies and silently takedown them one by one.</li></ul><ul><li>Follow your instincts. Use the assistant view to find objects that you can interact with or your objective.</li></ul><h3>Narrative</h3><br/><br/><br/>Ongoing cold war was about to end. Both sides declared that they would no longer continue pursuing the war effort. That night, everyone was on the streets. People were celebrating the end of the war. The entire city was like a party zone. One of our friends was throwing a party at his home. My wife Anna and I were going to meet at the metro station to join our friends later that night. Eh, what can I say. We were all happy. As it turns out, our happiness wouldn’t last long. And our hopes for peace would vanish with the majority of the people around us.<br/><br/>Everything was lost in less than a second. An unknown energy weapon hit the city. No one knows the true extent of the damage caused by it, if it was contained to just one city, country, or the entire planet. Buildings and Infrastructure are left intact. Animals and plants are unharmed. However, people… Many of them just disappeared. Now, no one answers our radio transmissions. No one comes to our aid. Everyone just seems to be vanished. No one is around other than some hostile savages.  After the attack so few of us survived and what little amount of people who were still alive and sane wasn’t enough to keep government and law enforcement agencies functioning. Now it is the survival of the fittest. People became little more than savages.  Every new day brings new hardships but in the end we will endure, we will survive, whatever the cost.<br/> <br/>\t\t\t\t\t\t\t\tVictor, Main Character<br/><br/><br/>This is the story of Victor, Anna and Victor's new mysterious best friend.<br/><br/>", "metacritic": null, "released": "2017-07-04", "tba": false, "updated": "2021-02-12T02:29:17", "background_image": "https://media.rawg.io/media/screenshots/7d3/7d3d35899ca453f3431bb0cef18b8245.jpg", "website": "https://wilypumpkin.com/potentia", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 14, "beaten": 1}, "playtime": 4, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Influx Interactive", "Wily Pumpkin"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Influx Interactive", "Wily Pumpkin"], "esrb_rating": null}