{"id": 440029, "slug": "versatiles-final-demo", "name": "VersaTiles (Final Demo)", "name_original": "VersaTiles (Final Demo)", "description": "<p>VersaTiles is a unique puzzle rpg game inspired by games such as Pokemon, Tetris, and 2048 (game). Each turn, you select tiles on a 4x4 grid (16 tiles). All tiles are randomly generated, so pick your tiles wisely. You can select a tile and form a 4-tile sequence When making a sequence, the order in which you select them MATTERS. The sequence goes from left to right. Tiles can be used to deal damage to enemies, refill your HP (Heart Points), refill your CP (Command Points), or receive Commands. The player is given 25 seconds to form a sequence (the penalty timer can be turned off in the game). Once the timer reaches 0, if you haven’t made a 4-tile sequence, the remaining selected tiles will be used. After the player finishes their turn, each enemy’s counter drops by 1. When it reaches 0, the enemy is given a turn to attack. When you defeat all the enemies, you move to the next wave. At the end of a level, you face off against a boss.</p>\n<p>The objective of the game is to clear all the enemy waves without having your HP reach 0. If your HP reaches 0, it’s Game Over.</p>\n<ul><li>5 levels (3 Jungle, 2 Casino)</li><li>5 unique bosses</li><li>Over 16 enemies</li><li>Simple level up system</li></ul>\n<p>Disclaimer:  It's the final demo for my Video Game Design class. Currently, I have no plans of commercializing this game. Any constructive feedback is appreciated.</p>", "metacritic": null, "released": "2020-05-01", "tba": false, "updated": "2020-05-04T07:46:18", "background_image": "https://media.rawg.io/media/screenshots/966/96695c82dae61f6865d4ee537c7bea77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dreamluigi"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}