{"id": 440118, "slug": "surviving-titan", "name": "Surviving Titan", "name_original": "Surviving Titan", "description": "Surviving Titan is an open world, action packed, survival adventure game. You will have to craft, build, fight and explore to discover all of the mysteries of Titan.<br/><br/>You've crash landed on the planet Titan. Suffering from amnesia and armed with only a basic survival kit you begin exploring the planet looking for any signs of life. You are accompanied by your ships standard issue survival droid, their job is to help keep you alive.<br/><br/>Explore a large open world full of mysteries, dangerous creatures, rare resources and surprises. Live long enough to discover the mysteries of Titan, find other survivors and attempt to escape the perilous planet.<br/><br/>Key features -<br/><br/>A huge, randomly generated open world to explore - built up of seven different biomes. With each biome having a unique landscape, rare resources and inhabitants (friendly or otherwise) exploring these biomes will be instrumental if you are to ever survive Titan.<br/><br/>You are not alone - discover other survivors during your exploration and recruit them into your crew. Trade, fight and explore with them and perhaps they can help unravel some of the mysteries of Titan!<br/><br/>Craft your own adventure - With over 150 unique items to craft the world of Titan is your oyster. Craft useful objects, suits of armor or powerful weapons to help you survive.<br/><br/>Train your skills. There are 7 skills to master. Each skill has it's own unique benefits. Compete in global leaderboards to see who is the master of each skill.", "metacritic": null, "released": "2020-04-29", "tba": false, "updated": "2020-05-08T02:28:07", "background_image": "https://media.rawg.io/media/screenshots/30c/30c6b8767df423b64a0be72c1b785c06_b4gtok0.jpg", "website": "https://www.dynamiczero.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Myles Panayiotis"], "genres": ["Action", "Adventure"], "publishers": ["Myles Panayiotis"], "esrb_rating": "Everyone 10+"}