{"id": 440114, "slug": "1v1lol", "name": "1v1.LOL", "name_original": "1v1.LOL", "description": "<h3>Join over 80 Million Players in the Fastest Battle Royale experience!</h3><br/>Fight to survive in this epic multiplayer building and shooting game where only the last player standing wins and achieves the great and coveted victory.<br/><br/>Free 3D Battle Royale, with more than 10M downloads and 750k daily active users waiting for you to fight 1v1.<br/><br/><strong>What can you find in this multiplayer free online shooting game?</strong><br/><br/> Quick pairing:<br/>Find a 1v1 or 2v2 match against random players in 3 seconds, with real players 24 hours a day!<br/><br/><br/>Multiplayer Gun Game Modes:<br/>- 1v1: Unique multiplayer mode, where you get to play against other opponent fighting with the same weapons (Assault Rifle, shotgun, axe or sniper rifle)<br/>- 2v2: Multiplayer 4 player shooter game mode, where you play in pairs versus other opponents<br/>- Battle Royale: Join a squad and play with your friends to defeat other assassin guilds and become the last survivor<br/>- Custom Gun Games with friends: Recruit friends and play with them online in a multiplayer mode (1v1 arena, mini box, vikings death match, gulag and more)<br/><br/>Practice modes:<br/>- Free Build: Train your building skills with endless materials<br/>- Zombies: Intense action shooting game mode where you have to run, hide, shoot and kill the zombies<br/>- 3D AIM Trainer: Improve your gun shooting skills and become the best sniper shooter <br/><br/>Shooting Weapons:<br/>- Assault Rifle: Get ready for a gun game and take down killers with your assault rifle<br/>- Shotgun: Grab your pixel gun, start shooting and kill the enemies<br/>- Axe: Use fighting strategies and kill your opponent with an axe<br/>- Sniper rifle: Choose your sniper rifle and shoot!<br/><br/> Daily Challenges:<br/>- Participate in daily challenges to win coins and buy skins in our shop.<br/>- Defeat enemies with an assault rifle, play 2v2 free battles, win gun games in 1v1, etc.<br/><br/> Free Gun Game:<br/>This game is designed for all audiences and is completely free, it does not require payments or a battle pass to play without limits unlike other Battle Royale Gun Games.<br/><br/>1. No need to register, just download the game and start playing your pvp shooter simulator!<br/>2. Create the character´s name that will bring your virtual avatar to life in this Battle Royale, and start your first online gun game in practice mode. It's time to rehearse your shooting and building skills!<br/>3. You are now ready to play a battle royale to death in a multiplayer gun game with real players.", "metacritic": null, "released": "2020-05-06", "tba": false, "updated": "2024-04-11T23:15:25", "background_image": "https://media.rawg.io/media/screenshots/7c1/7c12aec981e8a6a29d5a44bcff4c96f2_nQuiVom.jpg", "website": "https://1v1.lol/", "rating": 4.23, "rating_top": 5, "added_by_status": {"yet": 3, "owned": 76, "toplay": 4, "dropped": 1, "playing": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 30, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 31, "platforms": ["PC", "iOS"], "developers": ["Lior Alterman", "JustPlay.LOL"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["Lior Alterman", "JustPlay.LOL"], "esrb_rating": "Everyone 10+"}