{"id": 440178, "slug": "cavern-treasure-hunter", "name": "CAVERN TREASURE HUNTER", "name_original": "CAVERN TREASURE HUNTER", "description": "<p>As a treasure hunter, the player must sniff out the coins and find the hidden treasure chest located deep inside the caverns, however, they will find obstacles in their path as they venture on their exploration.</p>\n<p>Cavern Treasure Hunter is an underground 2D platformer that allows the players to gather coins as they explore the caves for the jackpot — the treasure chest. Aside from using the arrow keys or WASD keys to move and spacebar to jump, the player also has the ability to wall jump. This will help them navigate through the various obstacles in their path. With no idea where the treasure chest is located, coins will help guide them in the right direction. Some coins will also be hidden, so those who like to explore will also come across a fruitful opportunity. </p>\n<p>The underground theme is reinforced by using the challenge to find gold coins and utilizing cliffs, mud, and boulders to structure the game. Built through 5 levels, the game is arranged to increase in obstacle difficulty. To introduce new obstacles, the player will learn through following the coin in the beginning levels. In later levels, the coins will also gradually be placed in more difficult places in plain view or in hidden places to simulate the treasure hunting experience. With 15 coins on each level, will you be able to find them all?</p>\n<p><strong>Credits:</strong><br/></p>\n<p>Level Design: Jaclyn N.<br/>Game Mechanics: Michael Baker<br/>Music: Eric Skiff - Resistor Anthems Album - http://EricSkiff.com/music<br/>Environment Artwork: Adam Saltsman - https://adamatomic.itch.io/cavernas<br/>Character Sprite: Jesse Munguia - https://jesse-m.itch.io/jungle-pack<br/>Coin Sprite from https://www.pngwave.com/png-clip-art-xaawc<br/>Treasure Chest Sprite: Chuck C. https://icons-for-free.com/chest-131982518657265365/<br/><br/></p>", "metacritic": null, "released": "2020-05-07", "tba": false, "updated": "2020-05-08T02:44:21", "background_image": "https://media.rawg.io/media/screenshots/2c0/2c02cd3dedbe54da09eab6088a8ffda5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jaclyn Ngo"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}