{"id": 440119, "slug": "pocket-kingdom-td", "name": "Pocket Kingdom TD", "name_original": "Pocket Kingdom TD", "description": "Pocket Kingdom TD is an adorable tower defense game. Presented in 3D graphics, this game comes with meticulously-designed systems for you to cultivate your heroes in an all-round way! Its menacing dungeons, powerful lineups, captivating effects and adrenaline-pumping combats are going to give you a classic yet never-the-same experience!<br/><br/>[Tower Defense  Leave No One Standing]<br/>By blending the old and new, we have created a variety of new gameplay to be utilized in this game including changing the traditional defense tower into dynamic heroes that makes the world-conquering experience feel nothing less than real.<br/><br/>[All-round Cultivation  Unleash Hidden Powers]<br/>This game is a perfect combination of tower defense and character cultivation. You can level up your heroes to enhance their attributes and when they reach a certain level, then only could you level up your hero tower. How you assign existing resources to maximize your power in this game, will be a test of your tactics and strategies. <br/><br/>\u2028[Buckle Your Armor  Ignite the Flame of War]<br/>This game is arguably the most engaging tower defense game in this year! Its featured battle system is divided into three levels, which are: Normal, Elite and Expert! The higher the difficulty level, the richer the rewards! It’s time to show the world your talent! In addition, there are countless of gameplay including tower defense, city defense, battle, harem, treasure hunt, arena, brawl, hero array and divine beast cultivation awaiting your decisions in the game. To arms, warrior!  <br/><br/>\u2028[Exquisite 3D Characters  Relive the Epic]<br/>We have made the game with state-of-the-art 3D modeling techniques in order to produce lifelike characters whose every action and costume was well-designed. Be ready to get overwhelmed by their spectacular effects and dynamic combats!\u2028<br/><br/>[Adorable Characters  Get ready to say \"Awww!\" ]<br/>This game with its cute characters is going to get you hooked! There will also be alluring beauties assisting you on the battlefields! Are you ready, my lord?<br/><br/>[PVP Duels  Fight Until You Win]<br/>We have adopted a whole new gameplay where you can build your own elite teams. Take over all the territories known to man and build your kingdom! <br/><br/>We welcome any questions about the game, feel free to contact us anytime!\u2028<br/>Facebook: https://www.facebook.com/eyoupocketkingdomtd/\u2028<br/>Website: https://pktd.eyougame.com/\u2028<br/>Support: support@eyougame.com", "metacritic": null, "released": "2020-05-07", "tba": false, "updated": "2020-05-08T02:29:06", "background_image": "https://media.rawg.io/media/screenshots/81f/81f970a258c3070bf9e4e1e944b5f7a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EYOU TECHNOLOGY"], "genres": ["RPG", "Strategy"], "publishers": ["EYOU TECHNOLOGY"], "esrb_rating": "Teen"}