{"id": 44029, "slug": "my-time-at-portia", "name": "My Time At Portia", "name_original": "My Time At Portia", "description": "<p>My Time at Portia is a simulation open world RPG game set in a post-apocalyptic world. Humans are few and relics from the past are everywhere. You are starting a new life in Portia, a town on the edge of civilization. After taking over your father&#39;s abandoned workshop, you can take commissions from the town folks in order to grow your workshop and build your prestige. In order to fulfill commissions, you will spend lots of your time collecting materials from the relatively large open world.  Cut down tree, pick up herbs, mine in ruins, even plant your own garden and raise farm animals. There are vast areas for the player to explore around Portia. Deserts, islands, reefs, highlands, marshlands, and more! Each area bringing their own unique items and monsters. There are two different types of dungeons in this game. Players can gather relics and ores from the abandoned dungeons, and fight off monsters to gain look in the hazardous dungeons.</p>\n<p>But My Time at Portia isn&#39;t just about grinding away in your workshop and the mines. Meet the wide range of NPCs each with their unique personality and behaviors. Make friends, date, and even marry someone who will help you around your workshop. Kids are even on the table! Learn more about the Old World as you go along. Will you turn over your relics to the Church of the Light where they can be properly disposed of so as to prevent another apocalypse, or will you work with the Research Lab to harness the ancient technology to rebuild society?</p>\n<p>My Time at Portia delivers an enthralling life simulation game that balances character, building, and discovery and allows you to choose your own path through life.</p>", "metacritic": 73, "released": "2019-01-14", "tba": false, "updated": "2024-04-08T04:30:14", "background_image": "https://media.rawg.io/media/games/176/1765390b699b432edc3a208d544c6ba0.jpg", "website": "http://portia.pathea.net", "rating": 3.52, "rating_top": 4, "added_by_status": {"yet": 241, "owned": 1916, "beaten": 72, "toplay": 77, "dropped": 176, "playing": 58}, "playtime": 5, "achievements_count": 168, "ratings_count": 275, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 277, "platforms": ["Xbox One", "iOS", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["Team17 Digital", "Pathea Games", "Nuverse"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["Team17 Digital", "Nuverse", "Pathea Games"], "esrb_rating": "Everyone 10+"}