{"id": 440213, "slug": "allomancy", "name": "Allomancy", "name_original": "Allomancy", "description": "<p><strong>ALLOMANCY </strong><em>[English]</em><br/></p>\n<p>Allomancy is an accion and puzzles game, made by The Mitocondrians team. Based in Brand Sanderson’s books. Allomancy let you play and control the metals as you wish.<br/>Use your powers to kill enemies, solve puzzles and reach impossible places. Use your brain, straight force is not always the answer.</p>\n<p>Available only in Pc. You can play with keyboard or controller, as you want.</p>\n<p>Beta Version.</p>\n<p>Download the last version for free, try it and let us know your thoughts to get better in future versions.</p>\n<p>Thanks! Hope you like it.</p>\n\n<p><strong>ALLOMANCY </strong><em>[Spanish]</em></p>\n<p>Allomancy es un juego de acción y puzzles, en primera persona, desarrollado por el equipo The Mitocondrians. Ambientado en los libros del autor Brandon Sanderson, Allomancy te permite jugar y controlar los metales a tu antojo. Usa tus poderes para matar enemigos, resolver puzzles y llegar a sitios imposibles. Controla tus recursos y juega con cabeza, la fuerza bruta no lo es todo!</p>\n<p>Disponible solo para PC. Posibilidad de jugar con teclado o mando. </p>\n<p>Version Beta.</p>\n<p>Descarga nuestra última versión de forma gratuita, pruébala y déjanos un comentario para ayudarnos a mejorar nuestro proyecto.</p>\n<p>Gracias!</p>", "metacritic": null, "released": "2020-05-07", "tba": false, "updated": "2020-05-08T02:55:26", "background_image": "https://media.rawg.io/media/screenshots/e11/e1142a834691ef09b4909afdea5fc114.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Mitocondrians"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}