{"id": 44021, "slug": "hop-step-sing-kisskisskiss-hq-edition", "name": "Hop Step Sing! kiss×kiss×kiss (HQ Edition)", "name_original": "Hop Step Sing! kiss×kiss×kiss (HQ Edition)", "description": "\"I want to sing forever! I'll become an idol!\"<br/>Niina Nijikawa, whose practice at Karaoke paid off and she actually became a real idol.<br/>Mikasa Minowa, whose need for adulation means she's continually uploading videos and hosting live streams.<br/>Shikiri Shishiba, who decides the pair needs someone to look after them.<br/>These three young girls form Hop Step Sing! and this is their first single, now available in VR!<br/><br/><strong>\"kissxkissxkiss\"</strong><br/>Vocals: Niina Nijikawa, Mikasa Minowa, Shikiri Shiishiba<br/>Character/Set design: tanu<br/>Lyricist/Composer/Arranger: Yashikin (F.M.F)<br/>Music Production: Lantis<br/>Video Production: Polygon Pictures<br/><br/><strong>Cast:</strong><br/>Niina Nijikawa: Maria Sashide<br/>Shikiri Shiishiba: Mariko Toribe<br/>Mikasa Minowa: Natsumi Hioka<br/><br/><strong>Behind the Scenes</strong><br/>Kodansha have gathered some of the best creative talents in anime, CG and music for Hop Step Sing!'s first foray into the world of J-Pop.<br/>Character and set designer, tanu, is an up-and-coming illustrator with several anime and manga to his credit (Tari Tari and Flip Flappers, etc), with Polygon Pictures (Emmy Award winning Star Wars: The Clone Wars) faithfully recreating his designs in 3D. The musical side is handled by the prolific Yashikin (Is the Order a Rabbit?, High School Fleet amongst others) with production by Lantis (Love Live! series) and the vocal talents of Sashide Maria, Toribe Mariko and Hioka Natsumi.", "metacritic": null, "released": "2017-06-29", "tba": false, "updated": "2019-08-28T22:06:00", "background_image": "https://media.rawg.io/media/screenshots/927/9271a1786dbb939dc37136eeb2d95f47.jpg", "website": "http://hopstepsing.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kodansha", "Lantis Co", "Polygon Pictures"], "genres": ["Casual"], "publishers": ["Degica"], "esrb_rating": null}