{"id": 440438, "slug": "the-paper-quest", "name": "The Paper Quest", "name_original": "The Paper Quest", "description": "<p><strong>Story</strong></p>\n<p>Welcome to the world of Thear, a world in maintainable order with kingdoms across the world. However, a crisis erupts when the Kingdom of Nacerima is invaded by an orc army. They have taken the paper of Hargarva, and now you must retrieve it back for your kingdom. The King also tells you that if you lay your hands on the paper, you will gain powers beyond your imagination. You must use your trusty sword and other weapons to fight back against the army who are preventing you from getting the paper back. Fight orcs with your companions you pick up along your journey, a benevolent mage and a healer, that will accompany you on your adventure.</p>\n<p>This game is a first-person adventure game, with your weapons being a sword and throwables. The sword being your main weapon to fight in hand-to-hand combat with other enemies. Move with the WASD keys to explore the world you’re in, and find items to help on your journey. Along your quest, you will encounter more allies willing to help you along the way, as long as you protect them. As you continue your treacherous journey, you will also encounter numerous foes that will challenge your skills as a knight. Once you have reached the orc’s base, you will be tested to your fullest for your determination and spirit to reclaim the paper of Hargarva and save your kingdom and possibly the world.</p>\n<p><strong>How To Play</strong></p>\n<p>Movement: WASD Keys</p>\n<p>- W: Move Forward</p>\n<p>- S: Move Backward</p>\n<p>- A: Move Left</p>\n<p>- D: Move Right</p>\n<p>Combat:</p>\n<p>- MOUSE2 / Right-Click: Attack with sword</p>\n<p><strong>Post-Mortem</strong></p>\n<p>During development of the project, the team had thought up of many ideas for the game before building the game of Unity. However, the ideas for our game couldn't meet with reality in terms of the time of development and technical experiences. Despite these setbacks on the visionary goal, the game in its current state is satisfying in the team's view. Reasonable goals during the game's process were met, and the art members in the team provide the best aesthetics that fit the game's quirky tone. Programmers also coded excellent mechanics that we hope others would find very interesting  coming from a minor experience with Unity. Like many other projects, problems were faced during development of this project mostly with having an equivalent build with all members and making sure all members have the same materials and assets for the project. The game is currently \"In-Development\" at the moment and incomplete due to a busy schedule and other goals the members have outside of development. But we hope to provide a better experience in the next coming days with a finalized release.</p>\n<p>What went right:</p>\n<p>- Goals for each week were mostly met</p>\n<p>- Members cooperated with each other</p>\n<p>- Members notified each other of updates and changes to project</p>\n<p>What went wrong:</p>\n<p>- Coordination with specific assets</p>\n<p>- Compilation of files for importation and sharing between members</p>\n<p>How the Team adapted:</p>\n<p>- Made goals and objectives for each week</p>\n<p>What the team learned:</p>\n<p>- Ideas will not always be met, but keep the main idea present</p>\n<p>- Cooperating with team members in an asynchronous environment</p>", "metacritic": null, "released": "2020-05-07", "tba": false, "updated": "2020-05-08T03:52:09", "background_image": "https://media.rawg.io/media/screenshots/0e0/0e08cac03aba7acb3705907f6ab6ab64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PepticSolid"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}