{"id": 44045, "slug": "roll-out", "name": "Roll Out", "name_original": "Roll Out", "description": "People have been saying it for years, and nobody believed them.  You?  You didn't necessarily believe them either.  But you've always been a better-safe-than-sorry kind of person.  Well, look who's laughing now.<br/><br/>You are riding in the Road Train, a massive homemade truck capable of getting you and your crew away from the oncoming apocalypse.  Unfortunately, the universe didn't give you quite enough time to prepare, and the Road Train is not fully complete.  You'll have to improvise a little bit.<br/><br/>In Roll Out, you control a crew of people simply trying to survive the coming apocalypse.  Since the Road Train isn't fully complete, it needs to stop every so often to get more fuel, supplies, and have repairs done.<br/><br/>You will need to gather resources, construct buildings, perform research, and defend the Road Train at each stop all while preparing to leave in time to stay ahead of the calamity that's hot on your heels!<br/><br/><ul><li> 11 different calamities to play through, from Aliens to Volcanoes to the Earth Drifting Towards the Sun.  Each calamity changes the way the game is played.  You'll see new events, enemies and weather as you guide the crew to safety!<br/><br/></li><li> With the calamity raging on behind you, there is only so much time at each stop before the crew needs to Roll Out!  Prioritize your actions to make the most of the time you have at each stop before moving on.<br/><br/></li><li> 6 different tilesets give a wide variety to the game.  Travel to the frigid tundra, lush forests, barren deserts and more.  Will you be able to find what you need to survive?<br/><br/></li><li> Over 130 travel events that will challenge you, have you make decisions, and force you to adapt.  Blown tires, raving madmen, alien abductions and more, these events will have you wondering what will happen next and trying to plan for every contingency.<br/><br/></li><li> Leverage the strengths and weaknesses of 4 different crew types, assigning them to tasks they excel in.  Will you be able to guide your ragtag band of survivors to safety?<br/><br/></li><li> Fully configurable difficulty settings.  This game is meant to be challenging.  However, almost every aspect of the difficulty curve can be customized to make your gaming experience more enjoyable.  Too hard?  Tone it down.  Too easy?  Turn it up (if you're brave enough).</li></ul>", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-08-28T22:05:59", "background_image": "https://media.rawg.io/media/screenshots/683/683d5cbbf062c30529ff5eff89b7b05d.jpg", "website": "https://qorconcept.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Qor Concept Entertainment"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Qor Concept Entertainment"], "esrb_rating": null}