{"id": 440476, "slug": "the-passafist", "name": "The Passafist", "name_original": "The Passafist", "description": "<p>Tanya, a young woman attending the Academy of Life Arts, is relentlessly bullied by another pupil. One day, she is encouraged to explore the archipelago where she lives. A mysterious earthquake previously destroyed the main bridge between her island and the rest, but the scheduled repair time is fast approaching. Seeing an opportunity to find new ways to resolve her conflict, she embarks upon a journey across the islands, not quite sure what she is looking for, but thankful for the change of scenery. Along the way, she will meet a variety of characters, sneak through forest paths, pilot a variety of vehicles, solve puzzles and help the inhabitants of the islands she calls home in myriad ways.<br/><br/><br/>As a pacifist, Tanya must seek ways past her bully that do not involve violence. Stealth &amp; Speed are integral to accomplishing this task. Since Kelly is quite good at anticipating your next move, she has set up to ambush you along the way. As such, you must seek your way past her. But Kelly knows a lot of other bullies throughout the archipelago, and she has recruited some help, too. Use stealth to sneak past the bullies and continue your journey to wisdom and enlightenment.<br/><br/>Tanya: A young woman attending the Academy of Life Arts. While she only has a couple of years left until graduation, she has grown tired of dealing with Kelly, another pupil at the ALA. A pacifist to the core, she has always abhorred violence and never understood its place or function among a civilized people.<br/><br/><br/>Kelly: A mean spirited student at the Academy of Life Arts. Though much younger in years than Tanya, she makes up for it with a fierce and tenacious bullying campaign directed mainly at Tanya, but she will unleash on anyone who she feels is in need of it.</p>", "metacritic": null, "released": "2020-05-07", "tba": false, "updated": "2020-05-08T04:03:11", "background_image": "https://media.rawg.io/media/screenshots/dde/ddeffd548d789e610d20a2cb16e18ad4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SleepyGary"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}