{"id": 440598, "slug": "cracker-barrel", "name": "Cracker Barrel", "name_original": "Cracker Barrel", "description": "<p>Made with Unity 4.7.2.</p>\n<p>This game was created for the \"Retro-FPS Game Jam\"</p>\n\n<p><strong>The Premise</strong></p>\n<p>Guns.  Aliens.  White trash.  Oh my!</p>\n<p>Come down far away from the Paradise City, where the grass is up-rooted, and the girls ain't that pretty.</p>\n<p>Yes.  Welcome to Hicksville, the hillbilly-est of all hellholes in rural Arkansas.</p>\n<p>Apparently, some pesky aliens from outer space have elected to enact a real-world variant of \"Plan 9\",  rendering the entirety of the town's inhabitants as either zombified, mutated, or just plain crazy.</p>\n<p>Enter Skeeter McGritty, gun-toting redneck extraordinaire.   </p>\n<p>Having  been fortunate enough to be camping out in the nearby forest at the time of the unwelcome interstellar visitation, he returns home to discover that \"things just ain't what they used to be around here.\"  Not to worry though, for Skeeter is always packin'. </p>\n<p>As the game's designated obnoxious and loud-mouthed protagonist, you'll be forced to contend with your own share of fellow gun-toting rednecks, mad cows, giant crayfish, a chair-bound homesteader and his irate 14-year old daughter. </p>\n\n<p>In essence, \"Cracker Barrel\" serves as a wacky and irreverent fusion between Quake 1 and Redneck Rampage, replete with ridiculous enemies and a foul-mouthed \"hero\" who never shuts up. </p>\n<p>Per its adherence to the style and aesthetic  pertinent to the bygone era of mid-to-late-90s First-Person Shooters, the game has been engineered with noticeably primitive features, including horribly pixelated and unfiltered textures, low-polygonal objects and characters, and strict adherence to a vertex-based lighting system. </p>\n\n<p><strong>Gameplay</strong></p>\n<p>Characteristic of the standard objectives for any old-school FPS game, the goal in Cracker Barrel is simply to fight your way to the end of the level, preceding an obligatory boss encounter before victory can be achieved. </p>\n<p>The current available roster of weapons is confined to the player's standard revolver (the game's UI incorrectly lists this weapon as a \"pistol\", for which I apologize) and a hard-hitting hunting rifle.  The initial firearm is afforded an infinite supply of ammunition to compensate for its unreliability and propensity to inflict minimal damage upon adversaries, while packages of shells must be collected in order to sustain usage of the player's rifle. </p>\n<p>Naturally, med-kits are also scattered throughout various portions of the level, and are capable of replenishing up to 25 points of health. </p>\n\n<p><strong>Controls</strong></p>\n\r\n'WASD' keysmovementMouselookaimPrimary Mouse Buttonfire weapon1select revolver2select rifleEscapeskip briefing or exit game", "metacritic": null, "released": "2020-05-06", "tba": false, "updated": "2020-05-08T04:32:48", "background_image": "https://media.rawg.io/media/screenshots/468/4682a731e0eafb4bb14fe79d56c033f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jesse Hamm"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}