{"id": 440743, "slug": "yuca-board-game", "name": "Yuca Board Game", "name_original": "Yuca Board Game", "description": "<p><strong>Yuca</strong><br/>Stefan Dorra<br/>LaudoStudio 2020</p>\n<p>It is a new version of the board game Yucata. You can play on your smartphone or tablet alone against the computer or against any other player on two devices in the same WiFi.<br/><br/><strong>Rules:<br/></strong>We are in the inner corridor of an ancient Mayan pyramid. On the narrow path in front of us are gems, skulls and sun symbols.</p>\n<p><strong>Play a card:<br/></strong>Each player alternately plays one card. If a player plays a 1, 2, 3, 4, or 5, his playing piece moves forward by the corresponding number of spaces. If an arrow card is played, the playing piece moves to the first free space. If the ? Card is played, the last card played by the opponent will be copied.</p>\n<p><strong>Restriction:<br/></strong>The opponent's last played card cannot be played. For example, if the computer has played the 5, the player cannot play the 5 on his next move. But when he plays the ? Card, his playing piece also runs 5 spaces.</p>\n<p><strong>Rating:<br/></strong>All gems, suns and skulls that are on the entered fields are collected. Each gem counts 1 point. The 1st skull counts 1 minus point. The 2nd skull counts 2 minus points. Etc. For each sun amulet collected, 1 skull is removed.</p>\n<p>The player who scores the highest score wins the first leg. Then there is a return game so that each player starts the game once. An overall winner is determined from both game results. Note: A player never gets minus points in a game rating. In the worst case, you score 0 points in the first or second leg.</p>\n<p><strong>Level Mode: Player vs. PC<br/></strong>As soon as the first  match (first game and return game) has been won, the next level will be unlocked. You get points for each game you win. However, there are no  negative points for a lost game. So you can play a game as many times as  you want to increase your score.  </p>\n<p><strong>Multiplayer Lan: Player vs. Player (Only iOS and Android)<br/></strong>In this mode, two players in the same wlan network can compete against each other.  It is even possible to play with an android smartphone against a player with an iPhone or iPad. One player creats a match. The other player joins the match. A random game board is generated. The Multiplayer-Mode will be unlocked if the first Level has been won.</p>\n<p><strong>Master-Mode: Player vs PC<br/></strong>This is the highlight of the game. The Master-Mode will be unlocked, if all 30 levels have been won. In this mode you play random games against the Computer. Try to win as many games as possible in order to reach the next level. ;-) </p>\n<p>Have fun with Yuca!</p>", "metacritic": null, "released": "2020-05-06", "tba": false, "updated": "2020-05-08T05:10:34", "background_image": "https://media.rawg.io/media/screenshots/461/4610831c21cd2d33c136ea9891201959.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LaudoStudio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}