{"id": 4407, "slug": "the-walking-dead-episode-1-a-new-day", "name": "The Walking Dead - Episode 1: A New Day", "name_original": "The Walking Dead - Episode 1: A New Day", "description": "<p>Episode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, a convicted criminal, who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations that foreshadow the story of Deputy Sheriff Rick Grimes.<br />\n- A tailored game experience – actions, choices and decisions you make will affect how your story plays out across the entire series.</p>\n<ul>\n<li>\n<p>Discover 8-year-old Clementine, an orphaned little girl who miraculously survived the first few days of the apocalypse.</p>\n</li>\n<li>\n<p>Meet Glenn before he leaves for Atlanta and eventually meets Deputy Sheriff Rick Grimes.</p>\n</li>\n<li>\n<p>Discover Hershel’s Farm; meet Hershel Green and his family before their barn earns its place in Walking Dead infamy.</p>\n</li>\n<li>\n<p>Create alliances, establish your first camp and live with the profound and lasting consequences of your decisions made in this episode.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.<br />\nOne-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.</p>\n</li>\n</ul>", "metacritic": null, "released": "2012-04-24", "tba": false, "updated": "2023-09-19T13:13:23", "background_image": "https://media.rawg.io/media/screenshots/53b/53be57e9432f91158774d8e4d49e3d08.jpg", "website": "", "rating": 4.28, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 10, "beaten": 20, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 571, "game_series_count": 0, "reviews_count": 18, "platforms": ["PlayStation 3", "PC", "Android"], "developers": ["Telltale Games"], "genres": ["Adventure"], "publishers": ["Telltale Games"], "esrb_rating": "Mature"}