{"id": 44077, "slug": "aca-neogeo-super-baseball-2020", "name": "ACA NEOGEO SUPER BASEBALL 2020", "name_original": "ACA NEOGEO SUPER BASEBALL 2020", "description": "“SUPER BASEBALL 2020”  is a baseball game released by SNK in 1991.<br/>In the near future, there are two leagues with 6 teams each. Players pick their team, and compete for the championship. As the game progresses, landmines will be set up on the field, and armor can be purchased during games to reinforce players. These unique aspects make for a very different baseball experience!<br/><br/>The ‶ACA NEOGEO' series has faithfully reproduced many classic NEOGEO masterpieces.<br/>Players can change various game settings such as game difficulty, and also reproduce the atmosphere of arcade display settings at that time. Players can also compete against each other from all over the world with their high scores.<br/>Please enjoy the masterpiece that built a generation for video games.<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1-2 players<br/>DUALSHOCK®4<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>Arcade Archives Series Produced by HAMSTER Co.", "metacritic": null, "released": "2017-06-29", "tba": false, "updated": "2019-08-02T16:21:13", "background_image": "https://media.rawg.io/media/screenshots/75f/75f7f7ea2258be904196dfa0baf356ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One"], "developers": ["HAMSTER"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}