{"id": 440856, "slug": "orbital-decay", "name": "Orbital Decay", "name_original": "Orbital Decay", "description": "Orbital Decay\r\nThe Game\r\n<p>Orbital Decay is a turn-based strategy game set in the depths of space. In this game, players must find and combine various resources to build out and power up their interplanetary armies and destroy their rival factions.</p>\n<p>This game was created by 7 collaborators from around the world who challenged themselves to create a complete game in only a single month. Orbital Decay is the result of that month's work.</p>\r\nThe Team\r\n<p>The team was organized and managed by Adam C Brown. Programming work was done by Rodrigo Brandao and myself, while art was completed by Ethan Montgomery with contributions from Jevlin. Huglord created our UI, and the music and sound was made by DaniJ.</p>\n<p>We came together via a Reddit post and excitedly got to work as soon as we'd held our first meeting over Discord. An extra challenge presented to us was that no two team members were in the same time zones, and the team was almost evenly split between hemispheres.</p>\r\nThe Project\r\n<p>As previously stated, the team allowed itself only a single month to complete the project. We chose a month because it was long enough that we felt like we could finish something worth showing off, while short enough that it would still be a challenge. We treated this effectively as a month-long game jam.</p>\n<p>Originally, we planned to put out weekly builds so that we could collect feedback from users and incorporate them into the designs. We successfully put out two weekly builds and then real life intervened and we were unable to put out the third.</p>\n<p>But we still hit our target of completing the game before the month was over.</p>\r\nWhat didn't make it?\r\n<p>We never got around to making some ship recipes use up two kinds of resources. We also never got around to implementing refineries, which would reduce the amount of resources you get each turn in exchange for giving you a higher tier resource. These higher tier resources would be used to create higher tier ships ... also not implemented. We also had a \"stretch goal\" of adding some kind of ship upgrading system, whether it be experience-based, socket-based, or craft-based.</p>\n<p>But hey, that's actually not that much considering we <strong>only</strong> had a month!</p>", "metacritic": null, "released": "2020-05-06", "tba": false, "updated": "2020-05-08T05:38:38", "background_image": "https://media.rawg.io/media/screenshots/638/638536e10fc2756483251725b20bdcc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Jeff.Kapochus"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}