{"id": 441018, "slug": "molecular-madness-v3", "name": "Molecular Madness v.3", "name_original": "Molecular Madness v.3", "description": "<p><strong>MOLECULAR MADNESS version 3.0</strong><br/></p>\n<p>This FREEWARE Windows program covers 94 different items in beginning Chemistry. The player can study and practice the Symbols of Elements, Polar &amp; Nonpolar Formulas, Formulas of Elements &amp; Compounds, and the Formulas of Polyatomic Ions.  These topics are covered in 6 different challenging game screens. The speed of the targets can be set on each screen. Each screen has a  Study Mode which displays a Table of Information for completing the level. In addition there are four Study Screens which present the topics in a printable format for learning the material. The end of the program presents the user with a printable Report Screen which shows the performance of each level. The score, maximum score, and speed setting are shown for each level completed.  The average speed and average score are also displayed. The Report Screen shows the current date and also contains a field for the user to enter a name.<br/>This is a<strong> TOTAL FREEWARE </strong>Windows program. This means there are no fees, no ads, no registration, no collection of any data, no internet connection, and no limit to installations or distribution. The program will run on Windows versions 7 through 10.  Download the zipped setup program, extract it and run it. There is an uninstall option included.<br/>More Android Apps and Windows Programs can be downloaded from https://sites.google.com/view/rtcgames/home</p>", "metacritic": null, "released": "2020-05-05", "tba": false, "updated": "2020-05-08T06:18:35", "background_image": "https://media.rawg.io/media/screenshots/54b/54b9d5055e75881f1cfdd6eb2ab03959.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rtcgames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}