{"id": 44111, "slug": "futurama-worlds-of-tomorrow", "name": "Futurama: Worlds of Tomorrow", "name_original": "Futurama: Worlds of Tomorrow", "description": "Play the hilarious new adventure from the original creators of Futurama! BUILD your own New New York, BATTLE alien species, COLLECT all your favorite characters, and EXPLORE space on a mission to save the universe!<br/><br/>Dangerous Hypnowaves have permeated the fabric of the universe. It’s up to Fry and the rest of the Planet Express crew to get rid of them before the universe is lost forever! Is the future safe in your hands? PLAY FUTURAMA: WORLDS OF TOMORROW to find out!<br/><br/>Imagined and written by Matt Groening and David X. Cohen, the original creators of Futurama, this game truly captures the heart of one of television’s best animated shows ever!<br/><br/>GAME FEATURES:<br/><br/>- All new story from the creators of Futurama!<br/>- Build your very own New New York!<br/>- Battle in epic 16-bit combat!<br/>- Control the story by making your own choices!<br/>- Customize your characters with crazy outfits!<br/>- Power up your party with ancient artifacts!<br/>- Send your crew on dangerous space missions!<br/>- Explore a galaxy of exciting new worlds!<br/><br/>Buckle your seatbelts, blast off into space, and play the next episode in the Futurama story!<br/><br/>⋆⋆⋆⋆⋆ \"Great game for all Futurama fans, glad this is finally there\" - Christine G.<br/>⋆⋆⋆⋆⋆ \"Funny as hell\" - Rolf E.<br/>⋆⋆⋆⋆⋆ \"Loved the series and love the game!\" - Nicolas M.<br/><br/>Like us on Facebook: https://www.facebook.com/playfuturama/<br/>Follow us on Twitter: https://twitter.com/playfuturama<br/><br/>Futurama: Worlds of Tomorrow is free to download and play. However, some game items can also be purchased for real money. If you do not want to use this feature, please set up password protection for purchases in your settings.<br/><br/>Privacy Policy: http://tinyco.com/privacypolicy.htm<br/>Terms of Service: http://tinyco.com/websitetermsofuse.htm<br/><br/>Futurama TM and © 2017 Twentieth Century Fox Film Corporation. All Rights Reserved.", "metacritic": null, "released": "2017-06-28", "tba": false, "updated": "2019-07-29T07:31:41", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdc3a3240d2949dcde8e00fee99868b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Jam City", "TinyCo"], "genres": ["Adventure", "Simulation"], "publishers": ["Jam City", "TinyCo"], "esrb_rating": "Teen"}