{"id": 441151, "slug": "catpow-mysterious-adventure", "name": "CatPow: Mysterious Adventure", "name_original": "CatPow: Mysterious Adventure", "description": "<p>What's Cat Pow about? Well... Do You think cats are just lazily sleeping all day and wandering pointlessly at night? No! They sleep all day because in the night they fight Evil, defending their owners!                                This game tells the story of brave cat guardians, which defend their lovely old mistress, while she sleeps in a dark castle in the middle of mysterious S'cat-tish forest.                                Scratch, bite, purr and reveal the root of all the Evil!                            </p>\r\nThe Game Features\r\n<ul><li>                                    ☆☆☆ Attention! Instagram cats are available to play for! Choose a real Instagram cat such as @hosico_cat or @feature_the_cat in game and lead it to victory! More Instagram cats are coming soon!                                </li><li>                                    ☆ Story-driven adventure which reveals and justifies all the oddities of cats' behavior.                                </li><li>                                    ☆ Simple, purrre, innovative gameplay and one-finger casual controls.                                </li><li>                                    ☆ Take a role of a cat master: train a highly specialized cat ninja. You can play different cats with their own characteristics and skills. To be legendary fast or to be adorably fluffy - that is the question!                                </li><li>                                    ☆ Multiple terrific rooms of the ancient castle are waiting to be explored behind closed doors. Be an inventive detective and use your skill of deduction to find and match the keys first.                                </li><li>                                    ☆ Hordes of enemies so pleasant to kick, tones of traps so funny to cheat.                                </li><li>                                    ☆ The craziest bosses cat's mind can ever imagine! No vacuum cleaner though, because we're trying to avoid triviality. :)                                </li><li>                                    ☆ Unique grotesque-cartoonish-like visual style. Maybe the entire game was drawn by a skillful kitty?                                </li><li>                                    ☆ All our voice actors are 100% cats!                                </li><li>                                    ☆ And guess what? Yes, kitties, the game has an epic final cutscene! Just like in good old times ;)                                </li></ul>", "metacritic": null, "released": "2020-05-02", "tba": false, "updated": "2020-05-08T06:50:19", "background_image": "https://media.rawg.io/media/screenshots/964/9648a4d7ee4ed25fb9fd0caddaf1c8cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A42 Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}