{"id": 441116, "slug": "portalnaut", "name": "Portalnaut", "name_original": "Portalnaut", "description": "<p>*** Game is actively in development, this release is not the final version.</p>\r\nSummary\r\n<p>Portalnaut is a 2D platforming story game about a NASA mission control worker who attempts to travel back in time to stop a risky rocket launch from happening.</p>\r\nDescription\r\n<p>Portalnaut is a single player adventure game with a story about trying to stop a rocket from taking off. It plays out in a linear fashion. The levels are a series of platforming puzzles that can be solved with the help of a pair of warp gloves. The warp gloves are another piece of experimental tech from the scientist, and it allows the player to create portals in the level, helping them solve puzzles and gain access to previously impassable parts of the level.</p>\n<p>In its current iteration, Portalnaut has 3 levels, with brief story transitions between. The three levels show the player learning how to use the warp gloves, collecting pieces for a device that can disable the rocket, and finally climbing the rocket and putting the device on it, disabling it and completing the mission.</p>\r\nCredits\r\nMalik Ouda - Programmer and Project Manager\r\n<p>Malik is a student at the Univeristy of Texas at Austin pursuing a Bachelor's of Science in Arts and Entertainment Technologies for graduation in May 2020. He is also a McCombs Master of Science Bridge candidate, and will be pursuing his Masters of Science in Information Technology and Management for graduation in May 2021. He has skills in software and game development.</p>\r\nJim Arnett - Level Designer\r\n<p>Jim is a senior at the University of Texas at Austin studying Arts and Entertainment Technologies with an emphasis on Game Development and Game Design. He will graduate in Spring 2020.<br/></p>\r\nTylor Hawkins - Art and Animation\r\n<p>Tylor is a senior at the University of Texas at Austin studying Arts and Entertainment Technologies with a focus on Games and 2D and 3D Art. He will graduate in Spring 2020.<br/></p>\r\nSteven Ly - Music and Audio\r\n<p>Steven is a senior at the University of Texas at Austin studying Art and Entertainment Technologies with a focus on Game Development and Game Design. He will graduate in Summer 2020.</p>\r\nConsultants\r\nTrey Tobias - Story Consultant\r\n<p>Trey helped us with coming up with ideas for the story and helping lay out ideas for the story, many of which made it into the game and influenced its story and gameplay. Trey is a senior at the University of Texas at Austin studying Radio, Television, and Film, and will graduate in May 2020.</p>\r\nDevelopment\r\n<p>With Portalnaut, we were tasked with coming up with a story first and attempting to build a game around that story. This introduced some initial challenges, as it was difficult to come up with a story that would lend itself to an interesting and diverse game mechanically. We spent a couple weeks brainstorming story ideas until we finally came across one we all agreed on and liked.</p>\n<p>After coming up with the story, the next step was building a prototype. This meant figuring out what kind of game we wanted to make. We knew we had to keep things simple for this project because of limited time to work, so we settled on making a 2D platformer and adding more variety, challenges, and mechanics to the gameplay as time allowed.</p>\n<p>As development continued, the story influenced our gameplay, our art and audio aesthetic, and slowly the game started to come together into a complete package with 3 playable levels and a story told through basic text boxes.</p>\r\nStory\r\nIdeation and Creation\r\n<p>We started off coming up with lots of various story ideas to begin development of our game. We were met with the challenge of coming up with story first, instead of gameplay, and letting the story influence the direction of the game mechanically. Our second main challenge involved giving the game's story a theme or purpose. We did a lot of white-boarding and table discussions to figure out what themes and story ideas we liked.</p>\n<p>After we discussed some ideas, we decided it would be a good idea to consult someone with experience writing stories, so we contact Trey Tobias, a senior RTF student at UT who helped us come up with even more ideas.</p>\n<p>After we had lots of ideas, we started to narrow in on our final idea and flesh it out. The story had to undergo many changes to fit our gameplay and mechanics, but its overall themes and ideas stayed pretty similar.</p>\r\nThe Story\r\n\n<p>It's the near future. A mission control from witnesses a rocket malfunction that could cause danger to a team of astronauts. The mission control worker seeks out a scientist at NASA who works on experimental technology, who offers the mission control worker a chance to ensure the rocket makes it back okay.</p>\n<p>Equipped with the scientist's time machine and warp gloves, the mission control worker travels back in time to stop the rocket from taking off and give the scientists more time to work on the rocket and fix the malfunction and ensure the mission goes smoothly.</p>\n<p>The mission control worker completes the necessary tasks, builds the scientists rocket inhibiting device to stop it from taking off, and saves the astronauts.</p>\n<p>This story represents only the current iteration of the game. As development continues, we plan to flesh out the story and its overarching themes. Due to time constraints in the development process, we were forced to make concessions in both the story and the gameplay in order to ship a slice of the project by its due date, and so consequently the story and its themes are not fully fleshed out in the gameplay, but that is the plan for the future.</p>\r\nGameplay\r\n<p>Since we created our story first, the story influenced all of our gameplay and design decisions. After deciding on a 2D platformer, we got to work on building a simple player controller.</p>\n\n<p>After coming up with a player controller, we got to work on coming up with ideas for a mechanic to implement that would make platforming more fun and varied. Inspired by the popular game Portal, and influenced by our game's sci-fi theme, we decided to implement portals into our game to make platforming more fun. We felt it was a good way to create varied and interesting puzzles in the platforming while still being fairly unique to the genre of 2D platforming.</p>\n\n<p>The portals underwent many refinements and adjustments to make them feel good and fun to use, as did the player controller, such as preserving physics through portals to create challenges.</p>\n\r\nTechnology and Programming\r\n\n<p>The game was made entirely using C# in Unity. All programming was done in-house by us. We used a template for the player controller that we then modified and made unique to our game in feel and uses. Aspects of the technology and programming involved implementing the following, among other small tasks:</p>\n<ul><li>Player controller</li><li>Player physics</li><li>Camera following</li><li>Scene transitions</li><li>Portal physics</li><li>Game state management</li><li>Popups</li><li>Pickups and level interactions</li><li>Animations</li><li>Audio and music implementation</li><li>Main and options menus</li></ul>\r\nArt and Animation\r\n<p>                                                                                                                                                                                                                                                                                                            </p>\n<p>Art was an interesting endeavor. The team had next to no experience with pixel art.  This meant a lot of trial and error was required. However, with research and referencing we were able to workout sizing and style. All of the art was created in Photoshop pixel by pixel. The animations were based off pre existing animations to give our character fluid movement. </p>\n\n<p> <br/></p>\r\nMusic and Audio\r\n<p>All of the music and sound effects were created using GarageBand and Logic Pro. As idea shifts and iterations took place for both gameplay and narrative, adjustments had to be made to the audio as well. The main focus was to create music that was not too repetitive, but still contained melodies that fit our overall theme and aesthetic. </p><p>The process for making music started with playing around with various instruments in order to create a simple melody. Once a melody or sound was established, it was just a matter of adding more instruments and sounds to compliment it. The last step was to automation on various elements, such as volume, cutoff, and reverb. </p><p>Level 1 BG Music:</p><p>Level 3 BG Music: </p><p>The images above show some examples of the automation that was done on the music to add more of a dynamic element. </p>\r\nLevel Design\r\n<p>Every level had been hand drawn out before to help get an idea of where items should be in relation to one another. Levels were designed with the goal in mind to have at least a couple ways to continue through the level. Our levels offer multiple experiences and play time that varies based upon the player.</p>\n\r\nGoing Forward\r\n<p>Portalnaut is a game still in development, and its current iteration is only a slice of what the full game will be. Many things were planned for this iteration but did not make it in to the current build due to time and resource constraints. These include:</p>\n<ul><li>More levels</li><li>Animated cut-scenes to tell the story between levels</li><li>More art</li><li>More game mechanics, specifically new mechanics to accompany the platforming puzzle aspect of the game</li><li>More characters</li><li>Overall polish and work to make the feel and look of the game consistent</li><li>Music that builds over time within each level</li></ul>", "metacritic": null, "released": "2020-05-05", "tba": false, "updated": "2020-05-08T06:40:24", "background_image": "https://media.rawg.io/media/screenshots/d31/d31e94a38e58fbb04a2bfc0f0761a911.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["stevenmly", "kowabunga98", "JimArnett", "TehTaka"], "genres": [], "publishers": [], "esrb_rating": null}