{"id": 441293, "slug": "attack-on-cocotte", "name": "Attack On Cocotte", "name_original": "Attack On Cocotte", "description": "<p><strong>Attack On Cocotte</strong> est un jeu en vue de dessus à deux joueurs dans lequel un joueur incarnant un fermier doit trouver un joueur incarnant une cocotte qui doit remplir des objectifs parmi une foule de cocotte IA !<br/></p>\n<p><em><strong>Attack On Cocotte</strong> is a two players top view game where a player farmer must find a player birb with goals to achieve among a crowd of hens AI!</em></p>\n\n\n\n<p>1) Fermier, ferme les yeux ! Le joueur cocotte choisis son apparence et regarde ses objectifs !</p>\n<p><em>Farmer, close your eyes! The birb player chooses his appearance and checks his goals!</em></p>\n\n<p>2) C'est parti ! Le joueur cocotte doit réussir ses objectifs tandis que le fermier doit trouver quelle cocotte est le joueur !</p>\n<p><em>Let's go! The birb must succed in their goals while the farmer must find which one is the real player!</em></p>\n\n\n<p>3) <strong>Cocotte ! </strong>Fais toi passer pour une cocotte lambda en imitant leur comportement pour ne pas te faire remarquer ! Bats des ailes, ponds des œufs, picore le sol ou fais cotcot !</p>\n<p><strong>Fermier !</strong> Surveille les cocottes ! Quand tu penses avoir trouvé la bonne, attrape la et met la dans la cage !</p>\n<p><em><strong>Birb! </strong>Pass yourself off as a lambda birb by imitating their behavior so as not to get noticed! Flapflap, lay eggs, peck or do cotcot!</em></p>\n<p><em><strong>Farmer!</strong> Watch the birbs! When you think you have found the real player, grab them and put them in the cage!</em></p>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-08T07:28:42", "background_image": "https://media.rawg.io/media/screenshots/a22/a22d545119318f839fedefd6e2946195.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cocotte"], "genres": [], "publishers": [], "esrb_rating": null}