{"id": 44123, "slug": "bermuda-lost-survival", "name": "Bermuda - Lost Survival", "name_original": "Bermuda - Lost Survival", "description": "<strong>Survivors, Adventurers, Explorers!</strong><br/>Prepare for the journey of your life and experience one of the world’s most mysterious regions! The Bermuda Triangle is notorious for the vanishing of countless ships and airplanes. Will you survive long enough to reveal it’s secret?<br/><br/><strong>Open World</strong>Bermuda – Lost Survival plays in an open world sea scenario containing sectors with different reefs and individual resources. Since a sector never contains all resources, you must plan strategic outposts and optimize your crafting chains and travel routes.<strong>Dynamic Ecosystem</strong>Each reef in the game has an individual ecosystem that is affected by your actions. Observe the wildlife’s reaction and keep the natural balance as your life depends on the reefs natural supplies!<strong>Progressive Gameplay</strong>As you progress further, the game focus will shift: Crafting and building plays a very important role in the beginning. Your next step will be to explore deeper waters and find out about Bermuda’s myth. But your activities in the depths will not stay unnoticed!<strong>Exploration</strong>Upgrade your equipment and prepare for the depths! Visit impressive wrecks and ancient structures. Search them for unique artifacts and hints that might lead you to the myth of the Bermuda Triangle.<strong>Late Game</strong>After drawing too much attention, a hostile faction guarding Bermuda’s secret will find you. <br/>Take action and fight for your survival!<br/>(Not available during Early Access)<br/><br/><strong>Day 7</strong>I survived, alone, nothing but water and horizon around me.<strong>Day 13</strong>The harsh weather conditions and cold nights get debilitating. Supplies are running low.<strong>Day 15</strong>I crafted some basic tools and hunted for fish. Let’s hope I didn’t attract any predators. Fresh water is still a problem.<strong>Day 17</strong>I found a huge reef. It’s full of life and old wrecks. I salvaged a lot of useful materials from the depths and might be able to build a platform, like an ark or something.<strong>Day 29</strong>Welcome to my new home! It’s not beautiful, but a suitable shelter. I also found a way to distill water, so I should be safe for the moment.<strong>Day 30</strong>I’m trying to refine my crafted equipment for further exploration.<strong>Day 34</strong>Another reef, but something is different. The water seems darker here. I found an artifact near a strange stone formation. It looked like a sunken pyramid or temple. I spotted some sharks, so I marked the position for later.<strong>Day 41</strong>I was right about the stone formation, it’s an ancient building. There is a small entrance but I only found empty chambers inside. I need more oxygen and a light source to dive deeper into this labyrinth.<strong>Day 44</strong>Strange things are happening! Something awoke! I saw lights moving in the depths...<br/><br/><br/>", "metacritic": null, "released": "2017-09-29", "tba": false, "updated": "2019-08-28T22:05:58", "background_image": "https://media.rawg.io/media/screenshots/89c/89c56aca54b87f0271d24c939fd30d2c.jpg", "website": "http://www.bermuda-lost-survival.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "toplay": 1}, "playtime": 1, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NIGHTBOX"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["NIGHTBOX"], "esrb_rating": null}