{"id": 441348, "slug": "convoy-deck", "name": "Convoy Deck", "name_original": "Convoy Deck", "description": "<p>\r\n\tWelcome to the Convoy Deck prototype for \r\n\tNowhere Prophet. This is an experiment for a completely redone core gameplay.</p>\n<p>\r\n\tAnyway, thanks for dropping by, please check out the instructions and do leave some feedback in the comments below or send an email to contact@nowhereprophet.com \r\n\t! It's really appreciated!\r\n</p>\n<p>\n<strong>How to Play</strong>\n</p>\n<p>\r\n\tIf you've played a minon-based CCG you should be familiar with the basics.\r\n</p>\n<ul>\n<li>There are two players, both are human-controlled\r\n\t<ul>\n<li>That means you need to play against yourself or a friend</li>\n</ul>\n</li>\n<li>Each player has two decks, a convoy and a leader deck<br/>\n<ul>\n<li>The leader deck contains \"spells\"</li>\n<li>The convoy deck contains \"followers\"</li>\n<li>At the start of your turn you draw one card from each deck</li>\n<li>You can have a maximum of 5 cards of either type in your hand</li>\n</ul>\n</li>\n<li>Each leader has the following stats\r\n\t<ul>\n<li>Health (green)</li>\n<li>Armor (yellow, hidden when not present)</li>\n<li>Momentum (orange)</li>\n</ul>\n</li>\n<li>Momentum is needed to play cards\r\n\t<ul>\n<li>After the first turn the maximum is increased by 1 each turn</li>\n<li>Momentum is refilled to the maximum each turn</li>\n</ul>\n</li>\n<li>Followers Cards are played into the grid and placed there\r\n\t<ul>\n<li>Followers have Attack (red) and health (green)</li>\n<li>Only the first follower in each column can attack. Only the first follower in each opponents column can be attacked.</li><li>Followers can move to other empty fields within your grid</li><li>Followers can't attack or move the turn they are played. They start exhausted (Small yawning smiley) unless they have \"Charge\"</li>\n<li>Followers with a yellow border have Taunt. When a taunt follower is on the front of his column, then other non-taunt followers and the leader can not be targeted.</li>\n<li>When followers attack other followers they also take damage</li>\n</ul>\n</li>\n<li>Click the button on the right (looks like undo) to end your turn</li>\n<li>There are two types of Terrain currently:\r\n\t<ul>\n<li>Sandstorm: Take 1 damage when entering that field</li>\n<li>Holy Spring: Heal 1 damage when entering that field</li>\n</ul>\n</li>\n</ul>\n<p>\n<strong>Notes</strong>\n</p>\n<ul>\n<li>Press ESC to restart with new, randomly picked characters &amp; decks</li>\n<li>There's very little feedback and no transitions: Effects will be handled automatically with no indication so you need to be aware of the things on the board.</li>\n</ul>\n<p>\n<strong>Design Thoughts</strong>\n</p>\n<p>\r\n\tI'm currently thinking about ways to make the grid more interesting. There are a number of effects with spatial results but one issue that moving costs the attack and thus happens rarely. There were some experiments with making the two rows behave differently by themselves but those always felt very unintuitive. I'm currently investigating interesting keywords for followers that interact with the rows.</p>\n<p>Also in regards to the meta-game (if you're familiar with Nowhere Prophet), the idea is thus:</p>\n<ul><li>Each Follower you find is a follower card<ul><li>You can simply select which of these are in your \"convoy deck\" to build that deck</li></ul><ul><li>As they fall in combat (or bad things happen in events), they become \"wounded\"</li></ul><ul><li>Each follower has a specific amount of maximum wounds</li><li>If that threshold is hit the follower is dead, the card removed from your collection</li></ul></li><li>This means your convoy deck is relatively flexible but also volatile</li><li>Your Prophet deck on the other hand is a lot more stable<ul><li>Your prophet has a class and collects xp to level up</li><li>When you level up s your prophet gains XP you can chose from a few available cards to put into your deck</li><li>You can find teachers on the map that offer cards from other classes for your deck, or that allow you to delete cards from your deck</li><li>Your prophet also has 2 equipment slots which can add cards to your deck or add buffs or change stats (health, armor, starting momentum etc.) </li></ul></li></ul>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-08T07:43:21", "background_image": "https://media.rawg.io/media/screenshots/c7d/c7d3e791a1138fd2f308a4293abb1828.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Martin Nerurkar", "Claude Fehlen"], "genres": [], "publishers": [], "esrb_rating": null}