{"id": 44137, "slug": "eight-minute-empire", "name": "Eight-Minute Empire", "name_original": "Eight-Minute Empire", "description": "The official version of the board game - Eight-Minute Empire, by Ryan Laukat.AWARDS &amp; HONORS<br/>2013 Golden Geek Best Family Board Game Nominee<br/>2013 Golden Geek Best Print &amp; Play Board Game Nominee<br/>2014 Gioco dell’Anno Nominee<br/>2014 Hra roku Nominee<br/><br/><br/>Build an empire in around eight minutes!<br/><br/><ul><li> Recruit troops to strengthen your army<br/></li><li> Command your forces to acquire new provinces<br/></li><li> Challenge your friends all over the world<br/></li><li> Sail across the seas &amp; build castles to expand your empire<br/></li><li> Eliminate enemy troops to weaken your adversaries<br/></li><li> Collect goods to increase your advantage</li></ul><br/>Eight-Minute Empire, by Ryan Laukat, is a quick Civilization/Exploration game using card-driven area control.<br/><br/>In Eight-Minute Empire, 2-5 players take turns selecting a card from the six displayed. This card gives the player a resource, and also has an action which the player takes immediately. Actions help players take over the map, but the resources are worth points at the end of the game, so players have to balance the two aspects. Players spread across the map in order to collect points at the end of the game by having majority control in regions and continents.<br/><br/>Eight-Minute Empire is the super-quick area control game requiring tough decisions. It’s easy to learn and perfect for when you only have a few minutes.<br/><br/>Features<br/>- official Eight-Minute Empire game<br/>- great artwork<br/>- ingame interactive tutorial<br/>- languages: English, German, Dutch, Polish, French, Spanish, Italian, Korean, Japanese, Chinese Traditional and Simplified, Russian<br/>- optimized for PC, smartphones and tablets<br/>- play with AI, with friends or both<br/>- pass and play mode<br/>- online multiplayer with synchronous and asynchronous modes<br/>- opponents' last moves replay<br/>- 3 levels of difficulty AIs with individual strategies<br/>- different maps<br/>- climate sounds and music<br/>- official rules plus extra additions<br/>- unique, original board game feel on your electronic device<br/>- colorblind mode<br/>- over 70 achievements", "metacritic": null, "released": "2017-09-04", "tba": false, "updated": "2019-11-19T18:48:03", "background_image": "https://media.rawg.io/media/screenshots/87f/87f22642f49d78bc9309ec14912a2ec5.jpg", "website": "http://eight.acram.eu", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 34, "toplay": 1}, "playtime": 1, "achievements_count": 75, "ratings_count": 1, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Linux", "PC", "iOS", "Android", "macOS"], "developers": ["Acram Digital", "Mobo Studio"], "genres": ["Strategy", "Board Games", "Casual", "Indie"], "publishers": ["Acram Digital", "Acram"], "esrb_rating": null}