{"id": 44131, "slug": "showmaker", "name": "SHOWMAKER", "name_original": "SHOWMAKER", "description": "Showmaker is an app that enables you to create top notch live stages with ease.<br/>\r\nPlayers can create professional-quality 3D musical stage performances and shows quickly and easily with just 4 steps.<br/>\n<br/>\r\nStep 1: Select your stage<br/>\r\nThe app will feature stages of different sizes, from a small club venue to a massive arena. Choose the size that fits your style!<br/>\n<br/>\r\nStep 2: Select your music and sound effects<br/>\r\nYour music and sound choices are obviously a crucial element of any performance. Choose the music and sounds that will make your performance pop!<br/>\n<br/>\r\nStep 3: Select your 3D characters and choreography<br/>\r\nPick your 3D character models, then give them actions and movements. Creating your own original dance moves is a snap!<br/>\n<br/>\r\nStep 4: Select your stage effects<br/>\r\nCombine different visual effects to create your own unique style. Make sure you choose the right effects to go along with your music and choreography!<br/>\n<br/>\r\nGet started with a simple tutorial!<br/>\r\nBegin your Showmaker career by designing a show with Ms. Monochrome!<br/>\r\nFor those of you who want to take control of the finer details, you can use the UE4 Mod Editor to get into serious customization mode! For instance, you can create your own stage lighting, equipment, and even add your own character animations. And whatever you create, you can sell to other producers through the online store! The possibilities are endless! It all depends on you, the producer!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:57", "background_image": "https://media.rawg.io/media/screenshots/5fe/5fe14a068f8ba1afdc287d60a51de04f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31, "beaten": 1}, "playtime": 1, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["PREAPP PARTNERS"], "genres": ["Casual"], "publishers": ["Preapp Partners"], "esrb_rating": null}