{"id": 441349, "slug": "darkforces", "name": "DarkForces", "name_original": "DarkForces", "description": "<p>THE JEDIZ - DarkForces<br/><br/>I am SUPER excited to share with you my game concept, DarkForces. As a video producer and Director who also does 3d, game design has always had an allure to me, increasingly so now that it can be used for Motion Pictures, Commercials, Virtual Reality and Video Games and the advancements that have happened this last year. This year I've spent the time to learn more Unreal Engine, a realtime 3d app, different than Cinema 4D and Maya. Must say \"wow it's powerful\" and see my creativity going in the direction of producing entire virtual worlds, and powerful storytelling narratives through using Cinematic camera moves and cuts, and a Cinematic look, with my ultimate goal to create and Direct Virtual Set designs for commercials, music videos, and films. </p>\n<p>I'm pleased to reveal to you my VR Game Concept and Proof of Concept in this Gameplay Teaser for my game, DarkForces. The Jedi Interceptor's and ARC-170 flight characteristics were meticulously modified by me, from its weight, damping, acceleration, turn speed, dynamics. etc. it is a joy to fly and I hope you will try it out as this will be a FREE FAN GAME and used for a FAN FILM/VR EXPERIENCE. <br/>I have not added laser fire and weapons systems and damageable turrets, Tie Fighters, and props, but that's all set up to be done, and I will try to find help to do that.</p>\n<p>I will post online and seek help with Unreal Blueprint coding, for the weapons system, destructibles, A.I. systems (Tie Fighters and Turrets) Collisions to calculate damage, PowerUps, etc. and see if I can get some help doing the programming parts so I can stick to creating environments and animations. If you know any 3d artists, Unreal Engine Programmers, or Character Riggers and Animators who would like to Co-Create a FREE Game, I think I already have 10% of it done as this proof of concept.</p>\n<p>If you want to play this or help me with the VR finetuning of this game, let me know. I did the sound design from stock excluding clips from a song \"Interdimensional Fluids\" by musician Andre Kreibich aka Seven D. <br/>This Game Play clip is all made in Unreal Engine and I created everything so far with the exception of free Unreal Assets, stock assets, and 3d models from Sketchfab that are licensed under CC Attribution. <br/>I created this fast and easily and am very happy with the results, that I can feel confident to also call myself a Game Designer again with my return to Unreal Engine from my old days at UnrealPHD.</p>\n<p>I am looking for a Sponsor for some VR equipment, or CPU/MB, or Iphone X or 11, or Sony A7S and willing to barter some work, or to put your face, and custom 3d character that can talk and move, and voice-over if you want, or anything else you want to promote into one of the short Fan Film clips or Free games and VR content such as DarkForces that I produce. <br/><br/>I am also looking for paid work as a VR Developer, Game Developer, Art Director or Creative Director and I am skilled in the industry standard 3d and design tools. I feel like I can make anything now, and recently created a Virtual Reality experience of a luxury floating mansion with Seabreacher underwater watercraft and environment, as my VR Archiviz demo, anything you imagine is now possible.</p>\n<p>Please feel free to repost this or share with anyone who wants to Beta test or play my FREE Fan Based Collaborative game, for PC, VR, and possibly mobile. I will also be creating some Fan Films that have live action and CGI elements, if you know anyone I should connect with please let me know, thanks!</p>\n<p>I am also compiling a Hololens version, if you would like that let me know and I will send you the Google Drive Download Link.</p>\n<p>This is a Free Fan Game. All copyrights by original copyright owners. Fan Art used under Creative Commons Attribution license.</p>\n<p>Thanks,<br/>Shinobi1 Kenobi - aka Anthony Emanate, MN8<br/>Art Director of The Jediz and DarkForces.</p>\n<p>Follow on Facebook, Youtube, and Instagram.<br/>THEJEDIZ FB PAGE https://www.facebook.com/TheJediz-100251765008642<br/>DARKFORCES GAME FB PAGE https://www.facebook.com/DarkForces-105571357802801<br/>My IG https://www.instagram.com/epic.mn8/<br/>#environmentdesigner #environmentartists #unrealengine #epic #epicgames #gamedesigner #vrdeveloper #virtualreality #quarantineart #socialdistancing #art #design #cinematics #cgi #epic #3ddesign #360image #360panorama #starwars #starwarsfanart #imperial #stardestroyer #tiefighter #jedi<br/>Executor Class Star Destroyer https://sketchfab.com/3d-models/star-wars-executor-class-star-destroyer-0e4cbb98... Invictus Class Star Cruiser https://sketchfab.com/3d-models/invictus-class-star-cruiser-8ba24769c02b401d88f5...<br/>Immobilzer 418 https://sketchfab.com/3d-models/star-wars-immobilizer-418-bac66b2e6edd4bc0aee8e8...<br/>Tie Interceptor https://sketchfab.com/3d-models/star-wars-tie-interceptor-80171ec2930b4949836bcf...<br/>Jedi StarFighter https://sketchfab.com/3d-models/jedi-star-fighter-0b641c2f2b854f1f9ae7f2a731e44d...<br/>Arc-170 https://sketchfab.com/3d-models/arc-170-fighter-d2b9834148e84c86a2423148db1f6705</p>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-08T07:43:40", "background_image": "https://media.rawg.io/media/screenshots/9a9/9a9274d30abe120cb185a733ba9058c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mn8"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}