{"id": 441366, "slug": "cat-composer", "name": "Cat Composer", "name_original": "Cat Composer", "description": "\n<p>Cat Composer, is a music theory learning game for novices. The game is equipped with the idea of the Circle of Fifths and will offer you first experience on music composition! </p>\n<p>Our main character is a yellow cat and her job is a composer. In detail, she is a guitar composer good at using the chords and arpeggios to construct the music pieces. Her forte is that she is able to produce one music measure when she takes a step forward. In her spare time, she likes to find her favorite snack, the dry fish, scattering in her backyard garden. She will be stepping onto the dry fish while she is composing the notes, and finally get the dry fish as a reward. The dry fish will be collected in a basket in her room. <br/></p>\n<p>Start to compose the music pieces by controlling our cat composer on the flower-shaped stage and helping her to get the dry fish!</p>\n\n<br/>\n\n<p>Game Description</p>\n<p>In the main game page, there is a flower-shaped stage where the cat is standing on and six footprints with music notes annotated. Below the stage, there is a path to the dry fish. There are five lines behind the footprints, it represents the five-lined musical notation. At the top of the path, there are empty footprints remained to be filled. At the end of the path, the dry fish is expected to be picked up by the cat. </p>\n<p>Player can move the cat’s position by touching one of the footprints on the flower stage, then the cat will stand on the designated footprint. Meanwhile, a footprint on the path will be filled with the same note as what player touched. <br/></p>\n<p>After empty footprints on the path are all filled with colored notes, there will be a remind signal on the dry fish. Player can press the dry fish, and the cat will run on the path and then get the dry fish. Finally, the dry fish will be colored, and be collected into a basket. When the cat is running, the music piece is played synchronously following the footprints (music notes). </p>\n<p>Learning Goal</p>\n<ul><li>Able to read music notes</li><li>Understand basic components of a music sheet</li><li>Compose simple music pieces</li></ul>\n<p>Target Audience</p>\n<ul><li>Non-music major students to increase the interst in the music theory knowledge, instrument performance, and composition</li><li>Incoming music major students to understand the music theory foundation and the relationship between the performance and theoretical knowledge</li></ul>\n<p>Quotes you may like to know</p>\n<p><em>The study of music theory interacts with intuition—honing, sharpening, and enhancing it with further insights and perceptions.  -- Benward and Saker</em></p>\n<p><em>The purpose of all music training is to teach for musical understanding (to preceive, organize, and then conceptualize what you hear) and consequently to learn how to create musical expression and how to develop a aesthetic response to that expression. -- Rogers</em></p>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-08T07:48:58", "background_image": "https://media.rawg.io/media/screenshots/da9/da956e7f9dcb449495a87ca8c6106be7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["janecomet"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}