{"id": 44136, "slug": "the-eldritch-zookeeper", "name": "The Eldritch Zookeeper", "name_original": "The Eldritch Zookeeper", "description": "In <strong>The Eldritch Zookeeper</strong> you run a zoo packed with unsettling, otherworldly monsters.<br/><br/>Deceived by a particularly well-dressed skeleton, a cursed zookeeper is forced to manage a zoo full of eldritch abominations, ideally with as little bloodshed as possible. Can our unfortunate zookeeper break his curse? Every day a new terrifying creature that must be cared for arrives through the interdimensional portal - construct enclosures and keep the monsters fed and reasonably content, and build amenities for the zoo visitors! A Happy Monster Zoo™ is when a creature's teeth/claws/exploding-tendencies are far, far away from the guest's vital organs. They need those! Monster rampages are discouraged.<br/> <br/>Taking a mixture of inspiration from classic Bullfrog games (Theme Park World, Dungeon Keeper) and modern survival games, The Eldritch Zookeeper is coming to a variety of platforms very soon!<br/><br/><br/><ul> <li> A variety of bloodthirsty monsters to contain, feed and keep reasonably happy. Or else!<br/></li><li> Build ice-cream stands, smoothie shops, bathrooms and other amenities to distract zoo visitors from the yawning void!<br/></li><li> Grow your zoo into a thriving must-see, cannot-unsee attraction for all the family!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:57", "background_image": "https://media.rawg.io/media/screenshots/89a/89ac24fbc4b4a997ffcd7caed24e2df9.jpg", "website": "http://cranktrain.com/the-eldritch-zookeeper", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Cranktrain"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Cranktrain"], "esrb_rating": null}