{"id": 441441, "slug": "peekaboom", "name": "PEEKABOOM", "name_original": "PEEKABOOM", "description": "<p><strong>PEEKABOOM is an asymmetrical 1v1 VR/PC local multiplayer hide&amp;seek game, inspired by innovative works like Panoptic.</strong></p>\n<p><strong>How to Play</strong></p>\n<p>The Rebel has to collect cyber-bombs from vending machines and destroy two out of the three energy hubs that connect the evil Sentinel to the city. To be able to hide in plain sight and move undetected under the vigilant eye of the Sentinel, the Rebel is equipped with a handy Holo-Disguise-Device™ which makes it possible to assume the appearance of any citizen closeby. Be warned though - the surveillance cameras can still detect you if you move around carelessly and the Sentinel will quickly pick up on any deviation from the class-based behaviour of the different citizens.</p>\n<p>The Sentinel can prophylactically scan the citizens with a completely harmless* CitiScan™ scanner ray. Grateful subjects will always react by voluntarily and willingly greeting their benevolent overlord with one of the three prescribed class-based greeting emotes. If the Sentinel detects an illegal abnormality in one of the citizens’ behaviour, they are authorized to use the Stunergy™ stun gun and apply a non-lethal* dose of concentrated energy on the suspect. Accidentally stunning a law-abiding citizen is unfortunately unacceptable and will lead to an emergency shutdown of the Sentinel, in which case the pesky Rebel would win.</p>\n<p>Currently, the prototype only works in local multiplayer on Windows 10 with an Oculus Rift, Oculus Rift S or Oculus Quest (with Oculus Link). The PC player can play with mouse and keyboard or gamepad.</p>\n\n<p><strong>System Requirements</strong></p>\r\nComponentRecommended SpecsMinimum SpecsProcessorIntel i5-4590 / AMD Ryzen 5 1500X or greaterIntel i3-6100 / AMD Ryzen 3 1200, FX4350 or greaterGraphics CardNVIDIA GTX 1060 / AMD Radeon RX 480 or greaterNVIDIA GTX 1050 Ti / AMD Radeon RX 470 or greaterAlternative Graphics CardNVIDIA GTX 970 / AMD Radeon R9 290 or greaterNVIDIA GTX 960 4GB / AMD Radeon R9 290 or greaterMemory8GB+ RAM8GB+ RAMOperating SystemWindows 10Windows 10USB PortsRift S: 1x USB 3.0 port<br/>Rift: 3x USB 3.0 ports, plus 1x USB 2.0 portRift S: 1x USB 3.0 port<br/>Rift: 1x USB 3.0 port, plus 2x USB 2.0 portsVideo OutputRift S: Compatible DisplayPort video output<br/>Rift: Compatible HDMI 1.3 video outputCompatible miniDisplayPort video output (miniDisplayPort to DisplayPort adapter included with Rift S)<br/>Rift: Compatible HDMI 1.3 video output\r\n\n<p><strong>Development Background</strong><br/></p>\n\n<p>This game prototype has been developed as part of an internal game jam at GLUON STUDIOS, our new studio for (serious) games, interactive installations and audiovisual content (formerly known as 42dp Labs).</p>\n<p>We would sincerely appreciate any kind of feedback, which you can post in the community section below or send to us via email to hi@gluonstudios.com. </p>\n<p>Keep in mind, though, that this is just a rough game jam prototype and not a polished demo or a full game. It contains the occasional placeholders and bugs that you can expect from this stage of development, so please bear with us. ;)</p>\n<p>Many of the implemented 3D assets are based on the POLYGON - Sci-Fi City Pack from Synty Studios, which we can highly recommend for saving time in rapid prototyping projects like these.</p>\n\n<p><strong>Disclaimers</strong></p>\n<p>This prototype has been developed several weeks before the worldwide Coronavirus outbreak and has no direct or implicated connection to it. If you are under curfew or even quarantined at home right now, like many of us, you can play (VR) games with the people you live with to have some fun and distract yourself a bit from the stressful world out there. Unfortunately, if you happen to be quarantined alone right now, we have to urge you <strong>not</strong> to invite people from outside your household to play (VR) games together, for the time being. Our heartfelt sympathy goes out to everybody who is affected by this crisis. We are all in this together. Hopefully, this nightmare will end soon, and we can all crawl out from our caves again. Until then, stay safe and please follow the official guidelines of your local healthcare administration.</p>\n<p>Please take all the necessary precautions to not hurt each other or damage your equipment while playing, as this game involves a VR player playing in close physical proximity to a PC player. Adjust your guardian boundaries if necessary. Also please always follow the general VR safety guidelines provided by Oculus.</p>\n<p>This is a work of fiction. Names, characters, businesses, places, events, locales, and incidents are either the products of the author’s imagination or used in a fictitious manner. Any resemblance to actual persons, living or dead, or actual events is purely coincidental.</p>\n<p>THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF, OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-08T08:11:28", "background_image": "https://media.rawg.io/media/screenshots/f4d/f4de1b6c8d5c11180da65406ae383b09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GLUON STUDIOS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}