{"id": 441534, "slug": "survival-distancing", "name": "Survival Distancing", "name_original": "Survival Distancing", "description": "Controls\r\nArrow Keys / WASD / ZQSD / IJKLMove PlayerSpacebar / Mouse ClickFire BulletMouse MovementAim BulletsRRestart GameEscape on WindowsClose GameF11 on WindowsToggle Fullscreen\r\nTheme\r\n<p>This game was made for Trijam 68, with the theme: <strong>Keep Your Distance</strong></p>\n<p>The game requires to keep your distance from both encroaching enemies and your own bouncing bullets to survive as long as possible.</p>\n<p>I also followed the optional diversifies of the jam:</p>\n<ul><li>Share the source code of your project;</li><li>Use 8bit aesthetic;</li></ul>\r\nDevelopment\r\n<p>I made this game, including ALL assets + design + code + builds, within 3 hours 7 minutes. I recorded the entire development process, which did not go great... I spent easily 20 minutes, likely more, trying to solve a trigonometry bug while very tired. I tried to Google my way out of it but it was little help. I eventually solved the bug, but it ate up a TON of time, and unfortunately was not a bug I could leave in the game, lest it be unplayable---the bullets shot at the wrong angles, meaning you would shoot yourself in the face half the time which meant you would die instantly with the friendly-fire rules I wanted.</p>\n<p>I tried to add sound effects + music at the end, but I lost too much time to that bug and wasn't able to get them in. I <em>almost </em>snuck in some sound effects, but I exported them wrong from Audacity, and would have had to re-export all of them which I didn't have time for.</p>\r\nTime-Lapse\r\n\n<p>Time-lapse of the rocky 3 hour development.<br/></p>", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-05-08T08:32:32", "background_image": "https://media.rawg.io/media/screenshots/b5e/b5edf409c0d0e0c03be7c315b30e9395.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Gunnar Clovis"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}