{"id": 441879, "slug": "de-thieved-pilot-chapters", "name": "De-Thieved, Pilot Chapters", "name_original": "De-Thieved, Pilot Chapters", "description": "Prove Your Innocence - \r\n<p>Someone's stealing from your classmates and you're the top suspect! A rash of criminal activity is causing a shake-up in the small town of Shorewood, and everyone has their eyes on you, the new kid in town. Prove your innocence and nab the real criminal, while juggling the time to pass your classes, pay rent, build friendships, and maybe even some romantic connection. Can you catch the real thief, or will you spend your golden years behind iron bars? </p>\n<p>After moving from a large city to a small town, 17-year-old Tom and his sister Angie move to the bite-size town of Shorewood out of necessity. After their parent's death at a young age, Tom and Angie's aunt took care of them from another country by sending them checks that she received from the government for being their legal guardian. </p>\n<p>With Tom’s 18th birthday coming up, their funding will be <strong>cut</strong> in half, resulting in the relocation to Shorewood. </p>\n<p>Shortly after starting at Vulpesden High School, thefts begin to take place around town. With Shorewood's population so low, everyone knows each other, thus the suspicion of the “<em>newcomers</em>”  being the culprit of the thefts is unavoidable.</p>\n<p>Manage your time carefully between your classes, friends, and your new responsibility of providing for yourself and your sister.</p>\n<p>Can you catch the real thief before you're labeled as a criminal and convicted as an adult right after graduation? Or, will you be able to identify the thief, and return what was stolen? </p>\n<p><strong>3 Story Endings &amp; 24 Character Outcomes</strong></p>\n<p>One main story with up to three different endings based on YOUR decisions throughout the game.</p>\n<p><strong>Use the FriendUp App!</strong></p>\n<p>Keep tabs on your friends, your grades &amp; in-game stats using the FriendUp app!</p>\n<p><strong>12 Locals, Near Endless Activities</strong></p>\n<p>Visit 12 unique locations with several different activities ranging from place to place.</p>\n<p><strong>8 Characters, 8 Real-Life Struggles to Unfold.</strong></p>\n<p>Eight unique characters to befriend, all with 10 unique scenes with multiple endings each!</p>\n<p><strong>Dynamic World = Meaningful</strong> <strong>Choices </strong></p>\n<p>Balance work, school, and friends all while trying to solve the thefts before your graduate!</p>\r\n See the characters interact now at FriendUP App! \r\n\r\n<p>Befriend your classmates who are affected by the robberies. Uncover their deepest secrets. Influence their lives and how they handle their problems. </p>\n<p>Each character is dealing with their own issues such as <strong>bullying</strong> or <strong>depression,</strong> your suggestions help them tackle these obstacles.</p>", "metacritic": null, "released": "2020-05-10", "tba": false, "updated": "2020-05-11T02:45:43", "background_image": "https://media.rawg.io/media/screenshots/f53/f53caeb73200049d3bc791959ed659ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xpresso Games"], "genres": [], "publishers": [], "esrb_rating": null}