{"id": 44189, "slug": "xenobox-vr", "name": "Xenobox VR", "name_original": "Xenobox VR", "description": "In the near future, the Earth is attacked by an extraterrestrial civilization.<br/>The soldiers of Space Defense had fought bravely, but they were defeated, and now the last frontier is a space station equipped with the weapon that the enemy cannot resist. <br/>To neutralize it, the enemy captured the drone control system, and is now trying to destroy the core of the station - the reactor that powers it, including the defense weapon. <br/>You are the last hope of the planet! Your task is to protect the reactor at all costs! <br/><br/><strong>Defend yourself and attack</strong><br/>You will have various types of weapons at your disposal, as well as the shield that helps survive in especially tough situations. You will have to move a lot in order not to get caught in the crossfire of the enemy.<br/>In addition to the weapons and shield, you will have various bonuses at your disposal that you can use to strengthen your defense or increase the power of the weapons to slow down the enemies.<br/><br/><strong>Key features</strong><br/>•\tHigh-quality graphics and sound contribute to the maximum immersion into the virtual world.<br/>•\tA simple plot that is also exciting in its dynamics. You won't stay at one point.<br/><br/><strong>Attention! The gameplay involves getting high physical activity. You may become very tired, so be ready for this!</strong>", "metacritic": null, "released": "2017-07-01", "tba": false, "updated": "2019-08-28T22:05:55", "background_image": "https://media.rawg.io/media/screenshots/e34/e34ea94d3b732acf4f6b130d19a20ae5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Motion Games Studio"], "genres": ["Action", "Indie"], "publishers": ["Motion Games Studio"], "esrb_rating": null}