{"id": 44191, "slug": "accurc-2", "name": "AccuRC 2", "name_original": "AccuRC 2", "description": "The first version of AccuRC flight simulator released in 2014 and since then thousands of RC pilots have been enjoying the most sophisticated and realistic aerodynamic simulation ever produced.<br/>\n<br/>\r\nAfter continuous programme of free upgrades we’re now about to release version 2.1 which makes the AccuRC available on Steam, with all the advantages of ease of access instant availability and slimmed down supply chain passing the savings on to you the customer. <br/>\n<br/>\r\nAccuRC offers RC fliers unique benefits unavailable with any other RC simulator<br/>\n<br/>\r\nEach model is created entirely as the original, with control systems and components – it is not simply a picture of a model. Your models can be set up to individual tastes and requirements by swapping components and adjusting settings as you would do with your own model, all via our unique workbench area.<br/>\n<br/>\r\nChoose from Helicopters, fixed wing and scale aircraft, drones and quads, and now, uniquely, we have incorporated some basic buggies. What’s more you can now choose from a range of camera views to customize your flying experience even further – including first person view.<br/>\n<br/>\r\nSuper-detailed sceneries based on actual model sites along with our new 3D rendered super-scape sceneries which include stadiums, adventure parks and remote islands – ideal for drone racing and first person view flying.<br/>\n<br/>\r\nSuper accurate aerodynamic and physics engine to ensure the most realistic and rewarding flight experience – recognized used by many of the world’s leading RC pilots.<br/>\r\nSetup modes for training, intermediate and advanced pilots with enhanced stability options to get you started if you require. Using our unique Virtual transmitter you can customize your model set ups for each aircraft and learn how to use advanced RC transmitters.", "metacritic": null, "released": "2017-07-12", "tba": false, "updated": "2019-08-28T22:05:55", "background_image": "https://media.rawg.io/media/screenshots/e33/e333eae9874d51644d078a0627d720db.jpg", "website": "http://www.accurc.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["trasnatech"], "genres": ["Simulation", "Racing"], "publishers": ["trasnatech"], "esrb_rating": null}