{"id": 44198, "slug": "crazy-ball-adventures", "name": "Crazy Ball Adventures", "name_original": "Crazy Ball Adventures", "description": "Are you ready for a cool game where you have to test your skills and enjoy your time while going through some amazing levels? Crazy Ball Adventures is the ultimate choice in this regard and it offers you plenty of exciting opportunities and possibilities right off the bat.<br/>\n<br/>\r\nOne thing you will like about Crazy Ball Adventures is the fact that this game has a simple premise. Basically, you just need to do all you can in order to maintain the ball in balance as you reach the end of the level.<br/>\n<br/>\r\nEach level has a different design and architecture, which means that you will have to focus on the way the level looks as you go through it. This does offer an immense set of challenges and it will only get better as you play.<br/>\n<br/>\r\nBalancing the ball might sound easy but the reality is that Crazy Ball Adventures offers you multiple challenges so you will always have to face new and exciting levels.<br/>\n<br/>\r\nPlus, if you are a fan of being a completionist, you can collect all 3 stars scattered through each level. Of course, there’s also the challenge of finishing the levels as fast as possible, so many times you will find yourself going through each level again and again as you try to reach the high score table.<br/>\n<br/>\r\nLevels are different and varied enough so you will never get bored. There’s always something nice to do and a multitude of challenges for you to face. All you have to is to just check them out and the results will be amazing each time.<br/>\n<br/>\r\nPlus some of the levels also integrate obstacles and gaps. This way you will truly test your abilities all while going through narrow regions as well. Crazy Ball Adventures is filled with a great set of unique opportunities that you can unlock and there are some amazing gameplay choices for you here. All you need is to check out this amazing set of adventures and immerse yourself into the coolest balance ball game out there.", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2019-08-28T22:05:55", "background_image": "https://media.rawg.io/media/screenshots/39e/39e484f9f58a35484f52c4c3226875ca.jpg", "website": "http://freezenova.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 3, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["FreezeNova"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["FreezeNova"], "esrb_rating": null}