{"id": 442083, "slug": "shikari-rising", "name": "Shikari Rising", "name_original": "Shikari Rising", "description": "Welcome to Shikari Rising, an action-adventure game that tells a story of Novak, a Shikari, a person able to use both Martial and Ethereal Arts and has reached  his peak as a Demon Hunter or even transcended it. He is destined to face great ordeals to save his land and to uncover the mystery behind the monster reappearance that has once again shattered the peace of their beloved land. His struggles will include fighting against hordes of merciless enemies, figuring out ways to get past the next trial/area and of course defeating the Ferocious Bosses of that level to progress in the game. <br/>\n<br/>\r\nEarly Access Features:<br/>\r\n* The game is an action-adventure plat-former game which gives emphasis on deadly battles against ferocious and relentless enemies and Epic Bosses.<br/>\r\n* Initial attack is a 1-hit attack of your sword, a jumping sword-attack and a low sword-attack <br/>\r\n* Ability to Backdash at the onset of the game(make sure to check out the configuration at the Main Menu to customise your keys/button config)<br/>\r\n* As you gain a level, your HP and MP will increase and at certain levels you will gain more attack hits (for now, upto 3 sword attack hits but can be connected <br/>\r\n  later with mana-based skills) to fight better with the hordes of enemies in way.<br/>\r\n* Explore every nook and cranny to discover items such as Potions and Gold bags and even Skills<br/>\r\n* Consists of 1st Level of the game with 1 boss fight and 1 true boss fight at the end<br/>\r\n* Average of 1-2 hours to beat the game (including retries)", "metacritic": null, "released": "2020-05-09", "tba": false, "updated": "2020-09-10T22:33:30", "background_image": "https://media.rawg.io/media/screenshots/a8b/a8baefee3c34400021085b5f0f9ddb33.jpg", "website": "http://shikari-rising.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlosSum Games"], "genres": ["Action", "Adventure", "RPG", "Indie", "Puzzle", "Platformer"], "publishers": ["BlosSum Games"], "esrb_rating": null}