{"id": 442067, "slug": "the-captain-poet-and-the-star-god", "name": "The Captain Poet and the Star God", "name_original": "The Captain Poet and the Star God", "description": "<p>The Captain Poet and the Star God is a chill and relaxing galaxy generator with a narrative twist.</p><p>Explore countless galaxies, each randomly generated, absolutely unique and interesting. There are three distinctive galaxy types: one filled with constellations and bright stars decorating the filament of the night sky, one which is a home to countless worlds, both inhabited and desolate, planets which are closely watched over by the giant stars, and the last one which presents the view of the galaxy from the tens of thousands of light years away, but where you can still meet the kindred spirits of the other space captains. <br/></p><p>Along your journey you will fly into constellations, planets and other ships, all of them bearing stories of the past adventures, recorded for the eternity, floating away in the endless night sky.<br/></p><p>As accompaniment to your travels, you can choose from the two different versions of the game: one featuring the lovely and relaxing music of LawnReality and one featuring a single somber piece, Piano Sonata no. 20 in A major, D. 959 - II. Andantino composed by Franz Schubert. Both versions of the game are virtually the same, save for the music, however they both set different tone to the stories you can read in the game. Make sure to check both of them!<br/></p><p>'LMB' to navigate the ship.<br/>'RMB' to interact with points of interest.</p><p>'1' to generate Constellation galaxy.<br/>'2' to generate Planet galaxy.<br/>'3' to generate Milkyway galaxy.</p><p>'S' to choose next song.<br/>'B' to toggle blackbars.<br/>'F' to toggle fullscreen mode.</p><p>'ESC' to pause the game.</p>\n<p>Game by @gddgames.</p>\n<p>Music by LawnReality.<br/></p>\n<p>Icon made by Darius Dan from www.flaticon.com<br/></p>", "metacritic": null, "released": "2020-05-10", "tba": false, "updated": "2020-05-11T03:35:06", "background_image": "https://media.rawg.io/media/screenshots/1b3/1b315495373e6be34d478749bc08a9c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GDD"], "genres": [], "publishers": [], "esrb_rating": null}