{"id": 442118, "slug": "our-roost", "name": "Our Roost", "name_original": "Our Roost", "description": "<p><em>Our Roost</em> is a turn-based JRPG 2D fighting game that intends to tackle problems such as deforestation, pollution, and other actions that harm the environment. Join Duke and his buddies as they begin to encounter and attempt to handle these issues!<br/><br/><em>Note: This game has been put on hold due to its scope. However, you can still download and play the demo build near at end of this page.</em><strong><strong>--- A turn-based JRPG 2D fighting game? ---</strong></strong><br/><em>Our Roost </em>provides two different game modes for players to enjoy. These modes, Story and VS mode, will focus more on the two respective genres mentioned above. Story mode is mainly a turn-based JRPG and VS mode will allow for a full 2D fighter experience! However, the 2D fighter engine will also be a core mechanic in story mode as well!<br/><br/><strong>--- Story Mode ---</strong><br/>In the story mode of <em>Our Roost, </em>a majority of the game is played as a turn-based JRPG where you explore the world, experience the tale it has to offer, and fight enemies during your random encounters. During these encounters, <em>Our Roost</em> allows the player to momentarily control their character in the 2D fighter style after their character performs a damaging attack on an opponent.<br/></p>\n<p>This mechanic will be an important factor during story mode as it'll allow you to deal additional damage to your opponents! Keep in mind that longer ranged skills won't allow you to take advantage of this mechanic as much since you must spend time getting to your opponent. I intend to implement more methods that mix both the JRPG and 2D fighter aspects in order to create a more interesting game!<br/><br/><strong>--- VS Mode ---</strong><br/>In the VS mode of <em>Our Roost</em>, you can play as any of the memorable characters that were in your party during story mode in a full 2D fighting game! As of right now for the demo, VS mode only serves as a training mode where you can use each character's 2D fighter skills against a training bag. The full game will allow you to play against other people in a more competitive manner.</p>\n<p><strong>--- Default Controls ---</strong><br/><strong>W A S D </strong>-<em> Move/Jump/Crouch</em>\n<br/><strong>SPACE</strong> - <em>Jump</em>\n<br/><strong>J</strong> - <em>Confirm/Light Attack</em><br/><strong>K</strong> - <em>Cancel/Medium Attack</em><br/><strong>L</strong><em> - Pause/Heavy Attack</em><strong><br/>Notes:</strong><br/><strong>-</strong> Hold Esc until you hear the sound effect to reset your controls<strong>- </strong>Double tap Left or Right to dash or glide in that direction. <br/></p>\n<p><strong>--- Contact Info! ---<br/></strong>Twitter: https://twitter.com/JinnoHB <br/>Email: ducksterduke@gmail.com</p>", "metacritic": null, "released": "2020-05-10", "tba": false, "updated": "2020-05-11T03:48:30", "background_image": "https://media.rawg.io/media/screenshots/e78/e78efc875da96b70fd5a837b2b3ae02a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Hardwin Bui"], "genres": ["RPG", "Fighting"], "publishers": [], "esrb_rating": null}