{"id": 44210, "slug": "the-initial", "name": "The Initial", "name_original": "The Initial", "description": "<p>Restory Studio is a small team of five developers. We hope you will love this game as much as we do.<br />\nTHE INITIAL is a hyper action game about pretty schoolgirls battling against evil.<br />\nThe game takes place in a special area called SPE, with a school for students gifted with ESP powers. Every student of the school is skilled in battle, and an evil organization wants to create an artificial girl who has the ultimate power. They have secretly collected combat data and are close to achieving their goal. Now it&#39;s up to two students, Ruri and Erika, to stop them.<br />\nHIGH-SPEED ARENA-BASED ACTION<br />\nThis game focuses on high-speed arena-based action. Utilize lightning fast sword attacks and electricity-based powers to smash through enemies. Block, evade, and look for chances to strike against smart enemies who will do the same!<br />\nABUNDANT SKILLS TO EXECUTE ENEMIES<br />\nThere are many ways to overcome enemies: use skill points to learn new skills and abilities, capitalize on the weaknesses of enemies to beat them quickly, and if the enemy is knocked into weak state you can execute it directly!<br />\nINTERESTING CHALLENGES<br />\nThis game has many levels and battle zones with plenty of challenges along the way. Enemies with different abilities, multiple traps, and unique bosses. With four difficulty levels to choose from, there&#39;s a challenge just right for everyone from beginners to action game veterans.<br />\nWe hope you will like it. Grab your sword and good luck!</p>", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2023-05-28T14:28:48", "background_image": "https://media.rawg.io/media/screenshots/44d/44d273a182d44e1d238991c58298720f.jpg", "website": "", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 42, "beaten": 3, "toplay": 8, "playing": 1}, "playtime": 2, "achievements_count": 20, "ratings_count": 7, "suggestions_count": 620, "game_series_count": 1, "reviews_count": 8, "platforms": ["PC", "macOS"], "developers": ["Restory Studio"], "genres": ["Action", "Indie"], "publishers": ["Restory Studio"], "esrb_rating": "Teen"}