{"id": 442280, "slug": "i-accidentally-cursed-my-girlfriend-and-she-turned", "name": "I accidentally cursed my girlfriend and she turned into a cursed spear!", "name_original": "I accidentally cursed my girlfriend and she turned into a cursed spear!", "description": "<p>This is a very dark and gruesome game. Don't expect happy endings.</p>\n<p>The project was submitted for GamesNow jam #2 (2020) with design constraint \"Sad Games\". Originally this idea was for Nanoreno 2020, but I didn't have motivation to make it during that. When I heard the topic for this jam, I wanted to make something more inspired than this. A game where the sadness is told through mechanics rather than dialogue. Lacking inspiration for something great like that, I figured I could use this as a chance to finish this vn instead. I only had one sprite, a few sketches and the AI generated music pieces done before the jam so I hope it's okay.</p>\n<p>There are some action segments in the game where you must move your character with the mouse, but they can be replaced with choice menus in the preferences if it would make the game difficult to play through otherwise.</p>\n<p>Art, Writing and Code by Qazhax</p>\n<p>Soundtrack composed by AIVA (Artificial Intelligence Virtual Artist): https://www.aiva.ai</p><p>Fonts from google fonts.</p>\n<p>There are a total of 5 endings. With a bit under 2000 words, I hope it won't feel too rushed or forced. Writing is hard. The part before the endings should somewhat work as a metaphor but I'm not very confident I managed to convey anything properly. I feel so embarrassed about all of the dialogue, lmao.</p>", "metacritic": null, "released": "2020-05-09", "tba": false, "updated": "2020-05-11T04:30:04", "background_image": "https://media.rawg.io/media/screenshots/87a/87ace446c99efb75d0b4cd2eab81eb8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Qazhax"], "genres": [], "publishers": [], "esrb_rating": null}