{"id": 44231, "slug": "the-last-sin", "name": "The Last Sin", "name_original": "The Last Sin", "description": "The Last Sin is an open world massive JRPG that features over 150 recruitable characters that have their own stories that go untold if they die in battle. Every death is permanent in the cruel world of The Last Sin. The epic story will take the player trough multiple continents and allow the player to travel via ship and airship. All side quests have a permanent impact on the world and the player will have to choose what is the right moral choice when completing them. The main story is as follows:<br/>\n<br/>\r\nThe land was torn in a long and brutal rebellion. The island nation of foreign fierce warriors has finally rose against the centralized Empire. After years of war and standstill borders mages of the Island have decided to conjure up a spell which would not only end the war but also establish their nation’s dominance. The spell backfired horribly, destroying not only the opposing army but also their own and scorching the landscape beyond any recognition.<br/>\n<br/>\r\nShortly after, the people began reporting sightings of huge monsters roaming the land. It was not long till the monsters started attacking the villages, destroying them and mercilessly killing their population. It brought disarray into the surviving cities where looting and banditry became commonplace.<br/>\n<br/>\r\nWhat are these monsters, where did they came from, what is their purpose no one can tell. Some say they are divine punishment, some that they are simply beings that slumbered under the surface awoken by the great spell. Whatever they are, the world will not be safe while they live.<br/>\n<br/>\r\nRaping, plundering and murder are rampart in the lands. People have lost their faith in god and law. Faced with the crash of society, and the great threat of monsters looming over them, the warring sides have decided to bury the hatchet and focus on restoring order and stability to the world.<br/>\n<br/>\r\nThe young lord Hawken of the Central Empire is tasked with restoring order to the lands in any way he sees fit.", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-08-28T22:05:54", "background_image": "https://media.rawg.io/media/screenshots/160/16060dac34f812bf9ef712b8e4f39bb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amaterasu Software"], "genres": ["RPG"], "publishers": ["Amaterasu Software"], "esrb_rating": null}