{"id": 442401, "slug": "mini-ex-machina", "name": "Mini Ex Machina", "name_original": "Mini Ex Machina", "description": "<p>Mini Ex Machina (Mem) is based on the PC game Ex Machina aka Hard Truck Apocalypse, released in 2005, set in a strange world where people wear masks and drive trucks. This world is dangerous, but full of unexplored lands and adventures. This time the hero finds himself in a remote valley formed near the Ural mountains after the cataclysm. The lay of the land in this anomalous area changes every time one enters it, but the goal stays the same - to find the way home.</p>\n\r\nHow to play\r\n<p>Your truck can crush enemies, and shoot at them (after you find and eqip a weapon). You can carry a little cargo in the trunk and install various upgrades on your truck. When in town, sell and buy goods, take tasks from mayors and advance the story.</p>\n<p>Please note that some objects on the map can be destroyed, fences or bandits' lairs, for example.</p>\r\nControls\r\n<p>Use the arrow keys to move the truck.</p>\n<p>Use the z/(o) button to</p>\n<ul><li>interact with some objects - collect loot, read the road sign etc.</li><li>open inventory and quest log</li><li>enter the town - when you are in the town square</li></ul>\n<p>When you use the weapon, press x/(x) to activate the shooting mode</p>\n<ul><li>in this mode, you need to select the target with the cursor and press z/(o) to fire, press x/(x) again to exit the shooting mode.</li></ul>\n<p>Key - enter/(pause) - brings up the system menu, where you can restart the game or turn off the music.</p>\r\nWhat's next?\r\n<p>This game was created by the participants of Targem Games internal course of programming for non-programmers. Thank to Krystian Majewski for his video tutorials.</p>\n<p>Things to improve:</p>\n<ul><li>add more different quests</li><li>add more text messages explaining the plot</li><li>update sprites of the world and enemies (as what you see is mostly programmers art)</li><li>redo the world generation to remove the unreachable areas</li><li>and much more.</li></ul>\n<p>The limitations of pico-8 are quite strict, but this challenge makes is more interesting.\r\nLeave comments to inspire us to improve the game and maybe to make a sequel!</p>", "metacritic": null, "released": "2020-05-09", "tba": false, "updated": "2020-05-11T05:04:10", "background_image": "https://media.rawg.io/media/screenshots/74a/74af4bc9d296e09a000ccf8d8df14072.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["scorp66"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}