{"id": 442427, "slug": "a-hole-to-another-place-scp-1437", "name": "A Hole To Another Place SCP-1437", "name_original": "A Hole To Another Place SCP-1437", "description": "<p><strong>Item #:</strong> SCP-1437</p>\n<p><strong>Object Class:</strong> Safe</p>\n<p><strong>Special Containment Procedures:</strong> SCP-1437 is to be contained behind a perimeter of two (2) meter tall electrical fencing, which is to be patrolled by groups of three (3) security officers at all times. Any trespassers attempting to access SCP-1437 are to be brought into custody, interrogated, and if found to be ignorant of SCP-1437's nature, dosed with a Class-A amnestic and released.</p>\n<p>Any items or organisms which emerge from SCP-1437 are to be immediately tested for hazards, and if found safe, examined further. Experimentation involving SCP-1437 is strictly forbidden.</p>\n<p><strong>Description:</strong> SCP-1437 is an apparently endless hole measuring 3m x 3m, located in the ██████ Desert. Attempts to dig into SCP-1437 from the side result in the diggers encountering solid rock where logic would dictate SCP-1437 would be. SCP-1437 is thus only accessible from its entrance above ground.</p>\n<p>SCP-1437 appears to be an access point to an as-of-yet unknown number of parallel universes. Objects have been known to periodically emerge from SCP-1437 at great speeds, including:</p>\n<ul><li>One (1) US quarter. (First known object emergence.)</li><li>Large quantities of dirt and rocks. (Believed to be an attempt by a parallel containment team to fill in their corresponding SCP-1437.)</li><li>A map of North America written in Spanish. (According to said map, the government of North America is \"La República Popular de Aguas Nuevas\", or \"The People's Republic of New Waters\".)</li><li>A photograph of a skyline, believed to be a radically altered version of New York's. (Structures resembling coral are visible and a large flying organism can be seen in the distance.)</li><li>Several disks made from solid gold. (Accompanying the disks was a sheet of paper reading 'PLEASE SEND RAIN'.)</li></ul>\n<p>During a period lasting from 200█-20██, numerous individuals, most of whom wore D-class uniforms, emerged from SCP-1437; all of them were dead on arrival.1 All emerging individuals carried documents which appear to be their respective universes' documentation on SCP-1437. It is currently believed that these D-class personnel and previously mentioned documentation were sent as a gesture of desired cooperation.</p>\n\n<p><strong>Source &amp; More Depth:</strong> http://www.scp-wiki.net/scp-1437<br/></p>\n\n<p>CONTROLS:</p>\n<p>WASD to Move</p><p>Mouse to Look</p>\n<p>Left-Click or E to Interact</p>\n<p>SPACE to Jump</p>\n<p>Hold Left-Shift to Sprint</p>\n<p>_________________________________________________________________\r\n</p>\n<p>If you liked this experience, check out my other games for more crazy adventures and experiences ya just can't get anywhere else.</p>\n<p>Right this way... https://devy-games.itch.io/</p>", "metacritic": null, "released": "2020-05-09", "tba": false, "updated": "2020-05-11T05:10:33", "background_image": "https://media.rawg.io/media/screenshots/111/111bf154c939ab1bded53783a9a6938d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Devy_Games"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}