{"id": 442459, "slug": "baloxgram-vr", "name": "Baloxgram VR", "name_original": "Baloxgram VR", "description": "<p>A downloadable game for Oculus Quest VR.*</p>\n\n<p>In the depths of Heldvergard's land sleeps an ancient forgotten evil that speaks in legends. Many are drawn under influence, answers to old secrets and dark magic. You will be able to pierce the depths and mysteries of this land by defeating its evils and discovering secrets.</p>\n<p>In Baloxgram you will live an epic adventure of action and puzzles in virtual reality. You will explore twisted and abandoned caves, fight creatures and escape from deadly traps, all to end the mysterious evil that lurks in these lands.</p>\n\n<ul><li>Solve puzzles and slice through enemies with two powerful axes.</li><li>Immerse yourself in a frozen environment and discover the story behind this world.</li><li>Travel through a rich scenario filled with objects to interact with.</li><li>Fight against powerful enemies and survive deadly traps.</li><li>Find and equip gear to protect yourself from the dangers that surround you.</li><li>Use physics to grab throw and destroy various objects.</li></ul>\n<p>If you enjoy the game and you want to help us to improve can complete a questionnaire.<br/></p>\n<ul><li>https://forms.gle/xAfY5qYDnvTi6PSLA</li></ul>\n<p>Social Networks</p>\n<p>          <br/></p>\n\n<p>*We have noticed that there is a problem with Oculus and that is that when playing and leaving the guardian system it causes the game frames to be lowered considerably.<br/></p>", "metacritic": null, "released": "2020-05-09", "tba": false, "updated": "2020-05-11T05:18:29", "background_image": "https://media.rawg.io/media/screenshots/68d/68d46fd5d2b9e6735e0d0b8f402a76ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Weasel Games Studio"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}