{"id": 4426, "slug": "warriors-orochi-3", "name": "WARRIORS OROCHI 3", "name_original": "WARRIORS OROCHI 3", "description": "<p>The mightiest warriors in history join forces once again!<br />\nYears after the battle against Orochi, the Serpent King, the heroes of the Three Kingdoms and the Warring States struggle to seize control of the new universe they were thrown into when a new threat arises. A terrible and colossal monster, resembling a serpent with eight heads, casts its shadow across the land and defeats most of the brave warriors.<br />\nThe ones that survived, assisted by the mysterious Kaguya, travel back through time to save fallen warriors and forge new alliances, collect powerful weapons and build an army so they can have a chance to defeat the terrible Hydra.<br />\nWARRIORS OROCHI® 3 combines the much loved heroes of the Dynasty Warriors and Samurai Warriors series in an all new story that for the first time also features characters from NINJA GAIDEN®, WARRIORS®: Legends of Troy, BLADESTORM™, TRINITY: Souls of Zill O’ll™ and DEAD OR ALIVE®!<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). Download is subject to the PlayStation®Network Terms of Service and User Agreement and any specific additional conditions applying to this item. If you do not wish to accept these terms, do not download this item. Purchasing account will be required to log in to PlayStation®Network to use the content.<br />\nWARRIORS OROCHI and the KOEI logo are registered trademarks of TECMO KOEI GAMES CO., LTD. The KT logo is a registered trademark of TECMO KOEI HOLDINGS CO., LTD. WARRIORS OROCHI 3©2011-2012 TECMO KOEI GAMES CO., Ltd. All rights reserved.</p>", "metacritic": 75, "released": "2011-12-22", "tba": false, "updated": "2022-12-09T12:22:40", "background_image": "https://media.rawg.io/media/screenshots/5a7/5a72c393cf065c5c290d17eb24fc010a.jpg", "website": "http://www.tecmokoeiamerica.com/orochi3/", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 34, "beaten": 7, "toplay": 3, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 48, "ratings_count": 7, "suggestions_count": 675, "game_series_count": 3, "reviews_count": 7, "platforms": ["PlayStation 3", "Xbox 360"], "developers": ["Koei Tecmo", "KOEI TECMO America", "Omega Force"], "genres": ["Action", "Adventure"], "publishers": ["Tecmo Koei America", "Tecmo Koei"], "esrb_rating": "Teen"}