{"id": 442624, "slug": "chibal-dios", "name": "Chi'Bal Dios", "name_original": "Chi'Bal Dios", "description": "<p>Chi'Bal Dios is an action-adventure game in which the player have to use magic scrolls in order to unlock new spells and beat bosses in a 2D pixel art universe.</p>\n<p><strong>Easy to play. Hard to master. </strong><em><strong>How many bosses can you kill ?</strong></em></p>\r\n\r\nEat the Gods, be the Boss\r\n<p>Our hero sees his family devastated by illness. Blaming the gods for their inaction, and following an ancient legend, he decides to replace them so that no one will suffer from the same tragedy. He confronts with the two gods in their ruined temple deep in the jungle, then takes hold of their hearts and brings them to the heart of the temple. He then devours them and becomes a god himself.<br/>But this ascension binds him forever to the temple and he will be imprisoned forever.</p>\r\n\r\nFeatures \r\n<ul><li>Solo action-adventure / panic shooter game.</li><li>Pick up magic scrolls to unlock spells and use them to beat the bosses.</li><li>Learn how to type your spells with your joypad WHILE dodging tons of bullets.</li><li>Dodge tons of bullets.</li><li>Use the bullet time ! Quickly enter the key combination and unleashe devastating spells.</li><li>Discover the Mayan universe through environmental storytelling.</li><li>Dodge more bullets..</li></ul>\n<p><em><strong>The Gods' pantheon is nothing but a great feast.</strong></em></p>\n\n\n\r\n\r\nHow we did it\r\n<p>For one of our GameJam, we had to make a game with the 48 people in our promotion (Video Games Art, Game Design, Programmation and Producing/Marketing Masters 1 at the Institute of Internet and Multimedia). The goal was to strengthen team cohesion and communication between us in order to get used to working with big teams.</p>\r\n\r\nThe Team", "metacritic": null, "released": "2020-05-08", "tba": false, "updated": "2020-05-11T06:03:59", "background_image": "https://media.rawg.io/media/screenshots/5f1/5f1240984de7ee84b067b318a0401794.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio 48", "IIM - Video Game School", "Minstery", "AllanClaver", "Tristan Record", "YoavBensadoun"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}