{"id": 44269, "slug": "shank-n-bake", "name": "Shank n' Bake", "name_original": "Shank n' Bake", "description": "Shank n' Bake is a mixture of cutesy platforming and overly violent runner cartoon goodness. Slay your foes, bake up the ultimate junk food army, and take down the all the healthy food in the world!<br/><br/><br/> <br/>A new movement amongst the humans has stopped all consumption of unhealthy food. A lone adorable jelly filled muffin man must travel around the world brutally murdering healthy foods and cooking core parts of their corpses into new junk food concoctions. Build up your army, take down all the healthy food, and force the humans into consuming your kind once again!<br/><br/><br/><br/><ul><li>Face off against <strong>powerful bosses</strong> and use their parts to make a powerful minion!<br/></li><li>The more you <strong>die</strong>, the more you <strong>age</strong>. Get rewarded based on your freshness when you beat the game!<br/></li><li>Collect the <strong>proper ingredients</strong> in the <strong>correct order</strong> to bake a pristine, nigh-invincible minion, else you'll be launching your final assault with aid of decrepit abominations.<br/></li><li>Endless <strong>game modes with leaderboards</strong>!</li></ul><strong>Steam Integration</strong>Unlock <strong>Steam Achievements</strong> for impressive reflexes and murderous takedowns!<br/>Collect <strong>Steam Trading Cards</strong> of your favourite horrific abominations!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:53", "background_image": "https://media.rawg.io/media/screenshots/5db/5db7d1706470bfc8608e0563c222018d.jpg", "website": "http://megadwarf.ca/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mega Dwarf"], "genres": ["Action", "Indie"], "publishers": ["Mega Dwarf"], "esrb_rating": null}