{"id": 44278, "slug": "youtubers-galaxy", "name": "YouTubers Galaxy", "name_original": "YouTubers Galaxy", "description": "<strong>THIS GAME IS BASED ON SPANISH YOUTUBERS</strong> RESUMEN E HISTORIA <br/>Los YouTubers... <br/>Esas Personas que diariamente nos alegran los días con sus vídeos. <br/>Esas personas que saben darnos un buen susto cuando menos nos lo esperamos. <br/>Esas personas que nos cantan y nos hacen sentir muchos sentimientos a la vez... <br/>Esas personas que se encuentran en este popular sitio de Internet llamado \"<strong>YouTube</strong>\"<br/><br/>Hay decenas, cientos, miles de YouTubers por la red, sin embargo... ¿Alguna vez pensaron que sería un YouTuber sin sus queridos Suscriptores?<br/><br/>En esta aventura, viajaremos por distintas Galaxias, y nuestra misión será recuperar el alma de los llamados <strong>Suscriptores Perdidos</strong>, con el objetivo de purificar el corazón de esa persona y que la misma no te odie y no te haga perder otros Suscriptores con el fin de arruinarte no solo la carrera de YouTuber, sino tu estilo de vida. (Ya que ya sabes, sin Suscriptores no hay Likes, y sin Likes, no hay dinero, por lo que deberás ir preparándote tu cómodo colchón debajo  del puente más cercano.)¡BUSCANDO EQUIPO DE TRABAJO!<br/>¿Tienes habilidades de diseño, se te da bien dibujar o diseñar digitalmente?<br/>¡Es tu oportunidad para mostrarle al mundo tus creaciones!<br/><br/>Todo aporte es bien recibido, y si quieres formar parte del equipo oficial de creación del juego, nunca está de más tu ayuda.<br/><br/>Además, si tienes experiencia como:<br/><br/>BETA-TESTER<br/>Diseñador Musical<br/><br/>¡También tenemos espacio para ti! :)<br/><br/>Así que ya sabes, ¡Únete ahora a este maravilloso mundo dónde los YouTubers conocerán a sus Suscriptores reales!", "metacritic": null, "released": "2017-07-19", "tba": false, "updated": "2019-08-28T22:05:52", "background_image": "https://media.rawg.io/media/screenshots/817/81723a65381312ebcd2c43a4fb479608.jpg", "website": "http://www.undermax.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 114}, "playtime": 1, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UnderMax Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["UnderMax Games"], "esrb_rating": null}