{"id": 44271, "slug": "the-last-one", "name": "The Last One", "name_original": "The Last One", "description": "The year is 2023, once a prosperous city Istanbul is fallen. Nobody knows how a science experiment has become a deadly disaster because there is nobody left to think. The city is full of mindless monsters killing everything they come across and roaming the city once we call “our home”. You, somehow, have survived the disaster and built yourself a shelter. You think that you are the only “living” thing in the city and call yourself “The Last One”. <br/><br/>One day you see strange marks near your shelter that you have never seen before. You will leave everything behind and search who made those marks for a chance to find someone “alive” like you.<br/><br/><strong>Single Player</strong><br/><br/>Search the city Istanbul for a chance to find humans like you. Experience a fully detailed city, search for cure and find what has gone wrong with the science experiment. Uncover the secrets behind zombies and find who or what controls them.<br/><br/><strong>Multiplayer</strong><br/><br/>Play the first times of the disaster, select a team between the military and the rebels. Control the city Istanbul before someone else. Rank up, unlock weapons and customize them. Take Istanbul back!<br/><br/><strong>Wave Mode</strong><br/><br/>Fight with zombies and the military forces in Istanbul’s famous places and landmarks. Survive the round, buy new weapons, traps and equipments to survive the next round. Rounds get harder as you earn new perks.<br/><br/><strong>Key Features</strong><br/><ul><li><strong>Fully Detailed City.</strong><br/></li><li><strong>Up to 4k Resolution Graphics.</strong><br/></li><li><strong>Highly Detailed Maps.</strong><br/></li><li><strong>An Episodic and Complex story.</strong><br/></li><li>Customizable Weapons, Upgradeable Equipments.<br/></li><li>Level System With Well Balanced Perks.<br/></li><li>Explore the famous places of the city Istanbul and witness their fall.<br/></li><li>Select a team between Rebels and Military and reclaim Istanbul.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:53", "background_image": "https://media.rawg.io/media/screenshots/2a8/2a85e0896da277822b653aa7bd31e702.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 4, "toplay": 2}, "playtime": 31, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phoenix Interactive Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Phoenix Interactive Studio"], "esrb_rating": null}