{"id": 442840, "slug": "space-station-14", "name": "Space Station 14", "name_original": "Space Station 14", "description": "<p>Space Station 14 is an intricate, round-based multiplayer role playing game. It tells the story of an ordinary shift on a space station gone horribly wrong.</p>\n<p>Every round, you control a custom character as one of dozens of crew or enemy roles. Whether you&#39;re the janitor mopping floors, a doctor healing the wounded, or a hostile agent sowing chaos, your job provides you with the tools, access, and knowledge to perform your duties, interact with others, and take your place in each unique round.</p>\n<p>Tension builds as random disasters, enemy roles, and crew incompetence strike the station. Maybe there&#39;s a massive hole to space where the medical bay used to be. Maybe the captain went missing, leaving the rest of the crew to fight over who should take charge. Or maybe the clown just annoyed the wrong security guard and got undeservedly thrown into permanent confinement.</p>\n<p>What you do in all these varied situations is up to you, and the same goes for your fellow crewmembers. Maybe you&#39;ll try to chase down the antagonists and bring them to justice, sacrifice yourself to save your fellow crewmembers, or just sit idly by in the bar serving drinks without a care in the world</p>\n<p>With dozens of other people on the station, and in-depth game mechanics, each round aboard Space Station 14 is completely unique, and only limited by your own actions.<br />\nBeyond Space Station 14<br />\nSpace Station 14 is designed from the ground up to be extremely extensible. Community servers can change the game to provide wildly different experiences, from small changes to game mechanics, a different roleplay atmosphere or even completely different, unique settings.</p>\n<p>Furthermore, anybody can contribute! Space Station 14 is completely open source, so if you ever feel like helping out, we&#39;ll be glad to have you!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-11-21T22:54:36", "background_image": "https://media.rawg.io/media/screenshots/e92/e923cb9d4ef8617b1f383b0c45690bff.jpg", "website": "https://spacestation14.io/", "rating": 4.25, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 4, "beaten": 1, "toplay": 1, "dropped": 2, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 120, "game_series_count": 1, "reviews_count": 8, "platforms": ["PC", "macOS", "Linux"], "developers": ["Space Wizards Federation"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Space Wizards Federation"], "esrb_rating": null}