{"id": 442892, "slug": "bow-land", "name": "Bow Land", "name_original": "Bow Land", "description": "Welcome Archers!<br/><br/>You are invited to the magical and dangerous world of Bow Land! As Lone Archer, you will face great dangers and traps, earn fabulous rewards, and discover tremendous power!<br/><br/>Use your skills, a combination of many different items and artifacts, choose from different abilities to create ultimate Archer to conquer them all!<br/><br/>Bow Land is an amazing 3D mobile game with a fully realized open world feel and dynamic map. Search every corner for untold treasure. Choose your path through the land and dungeons and face new adventure wherever you go: hordes of enemies and enormous piles of treasure are waiting!<br/><br/>Easy to play: a fast-paced game with no unnecessary rules. You, your Bow, and hoards of enemies facing the tip of your arrows.<br/><br/>Key Features:<br/>- Explore beautiful open maps with the new freedom of movement<br/>- Unique skill combination each time you enter the dungeon<br/>- Face different monsters and fierce Bosses!<br/>- Easy to play: Play as you like whenever you like<br/>- Regular updates and new content guaranteed<br/>- Level-up, gear-up and fight Ultimate Evil!<br/>- Endless Rewards for your skills and exploration <br/><br/>Be brave, be bold! Don't wait, don't waste any more time. Take your Bow, take your Skills, and go meet your destiny! See you in Bow Land!", "metacritic": null, "released": "2020-01-15", "tba": false, "updated": "2020-05-15T02:21:57", "background_image": "https://media.rawg.io/media/screenshots/f19/f19ebdd77f1f606d51d9b19211b72b6e_Dt4L2kv.jpg", "website": "https://www.facebook.com/BowLandGame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huuuge Global"], "genres": ["Action", "Adventure"], "publishers": ["Huuuge Global"], "esrb_rating": "Teen"}