{"id": 442887, "slug": "tap-heroes-clicker-war", "name": "Tap Heroes: Clicker War", "name_original": "Tap Heroes: Clicker War", "description": "Tap Heroes: Clicker War includes a lot of fun gameplay that allows you to interact with addictive and interesting core gameplay. Collecting a variety of heroes to form unique formations, grow your heroes and transform them into stonger heroes, and most importantly, you don't need to worry when you're busy, just get online every time you have time and get rewards. This special feature fits your daily routine easily.<br/><br/>Go For Free Bonuses <br/><br/>Send hero teams to complete the campaigns, and \"skip\" the combat for free bonuses! Routine daily tasks? Simply assign all heroes and you can get all the rewards. A game to play anywhere, anyplace without being interrupted by phone calls or chores.<br/><br/>Build Exclusive Line-ups <br/><br/>Forge and equip cool equipment with higher stats, neven campaigns were so easy to challenge! There's no \"common\" squad,  you may always adjust the front and back row, performance matters! Mind the faction resistance and effectiveness, and with a little strategy, you may enjoy the entire process.<br/><br/>Rewarding Events and Features<br/><br/>The Garden, hero quests, tavern, dungeons and most important, hero evolution!  Holy Tree Trial, Arena, and also the Guild! There's a lot to do with the seasonal activities and special festival activities, you're not going to get bored!<br/><br/>Join Guild and Conquer the Server<br/><br/>Explore the guild features, guild wars and other guild content, which is enjoyable and exciting! Build the international players guild, and triumph over the continent!<br/>Register for Crystal League, Starry War, Trail of Champion, and team-up Arena, take part in fights with gamers around, and leap to the top of the list!<br/><br/>Light or Darkness...Pick a Side<br/><br/>Chaos, Fortress, Forest... Collect a diverse of heroes from exceptional factions!<br/>Diversed formation for PvP and PvE battles, providing you with a modern idle gaming experience. Join us, the best adventurer, fight for the glory of this continent!", "metacritic": null, "released": "2020-04-29", "tba": false, "updated": "2020-05-15T02:20:22", "background_image": "https://media.rawg.io/media/screenshots/02c/02ce7e63e31b31c4703fb604713b9012_tLmO6I5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Harbin Changqing Technology Development Co"], "genres": ["RPG", "Card"], "publishers": ["Harbin Changqing Technology Development Co"], "esrb_rating": "Teen"}