{"id": 44282, "slug": "photon-rush", "name": "Photon Rush", "name_original": "Photon Rush", "description": "<strong>Race, dodge, focus, block, destroy, and MUCH MORE in HIGH-SPEED! Your job is to maneuver your vehicle between obstacles and try to block, trick play or destroy the others. Map get smaller every second so watch your back and try to stay alive as long as you can.</strong> <br/><br/><br/><br/><br/>Yes, really, 16 players on one screen!<br/>Invite all your friends and play together.<br/>This is one of few games that can do that!<br/>Can you imagine fun playing with so many friends in one room?<br/><br/><br/>No one will get bored. Action is <strong>VERY FAST</strong> and one round takes just about <strong>30 seconds</strong>.<br/>You won’t have time to use bathroom!<br/><br/><br/>Stamina comes to your aid charging slowly.<br/>You can use it to run faster or slower and to<br/>block opponents steering ability in small area around you. <br/>Different bonuses will appear in random spots on the map, <br/>you can pick them up and use later.<br/><br/><br/>You can use your gamepad from console. <br/>We support all popular gamepads and much more. <br/><br/><br/>You need only one hand to play Photon Rush, you can reach snacks or hold drink and play at the same time. There is no problem if you have limited number of gamepads, we got it covered! Two players can play games simultaneously using only one gamepad!<br/>Also isn't it perfect excuse to get closer to your date?<br/><br/><br/><strong>Explosion Blast</strong><br/>You can destroy obstacles, players and balls. Shielded players are immune.<br/><br/><strong>Shield</strong><br/>While being shielded you can go through obstacles, balls and players.<br/>You cannot leave map, walls will destroy you.<br/><br/><strong>Death Zone</strong> <br/>You can create zone blocking steering abilities of your opponents.<br/>Inside the zone bonuses or powers (stamina) can be used.<br/><br/><br/>Player Vehicle has frontside and backside.<br/>If you hit opponent backside with your frontside - you lose.<br/>If you hit opponent frontside with your frontside - you both lose.", "metacritic": null, "released": "2017-07-06", "tba": false, "updated": "2019-08-28T17:05:27", "background_image": "https://media.rawg.io/media/screenshots/f13/f134543020afdba480aec1b659ede403.jpg", "website": "http://www.gametroleum.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Gametroleum"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Gametroleum"], "esrb_rating": null}