{"id": 442858, "slug": "sea-power-naval-combat-in-the-missile-age", "name": "Sea Power: Naval Combat in the Missile Age", "name_original": "Sea Power: Naval Combat in the Missile Age", "description": "<p>After hostilities have broken out in Central Europe, the race is on as a pressured US Navy escort force battle off Soviet bomber and submarine attacks on a perilous quest to reinforce NATO defenders in Europe. Meanwhile, in the Persian Gulf, the conflict between Iran and Iraq risks escalating into a larger confrontation between superpowers as both sides indiscriminately attack neutral merchant shipping. And in the Norwegian Sea, an outnumbered Soviet surface force challenges the might of a massive US Navy amphibious force bound for occupied Norway...</p>\n<p>Brought to you by the lead designer of Cold Waters, Sea Power lets you control NATO and Warsaw Pact forces in a modern naval conflict. Whether it&#39;s gunning it out with Boghammars in a surface duel, fighting off aerial attackers armed with long-range missiles, or hunting for enemy submarines with aircraft and surface ships, advanced weaponry and sensors are at your disposal. Can you successfully hide your forces while detecting and tracking theirs? It is up to you to play an advanced game of cat and mouse on the high seas, to seize the initiative and attack with the advantage of surprise on your side. And at all times, you have to observe rules of engagement and take care not to cause an unnecessary incident that could lead to escalation. After all, you cannot really be sure just who that radar contact at 30.000 feet is, can you?</p>", "metacritic": null, "released": null, "tba": true, "updated": "2020-05-13T23:46:05", "background_image": "https://media.rawg.io/media/screenshots/85f/85fa21ceab313eb5041b7d121ad5598c.jpg", "website": "https://www.microprose.com/games/sea-power", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["MicroProse"], "esrb_rating": null}