{"id": 442868, "slug": "blightbound", "name": "Blightbound", "name_original": "Blightbound", "description": "<p>The world lies in peril. Decades ago, a band of legendary warriors slayed the dreaded Shadow Titan after a long and ferocious struggle, but their celebration was short-lived. The Shadow Titan’s true intentions revealed themselves when from his broken husk flowed the Blight; a corrupting fog that alters any living creature exposed to its evil.</p>\n<p>Blightbound is a multiplayer dungeon crawler that tasks three heroes to venture down from their mountain refuge to face the abominations of the Blight - a mysterious and corrupting fog that enshrouds the land.</p>\n<p>Explore handcrafted dungeons, fight a terrifying cadre of mystical and monstrous enemies, grab valuable loot and recover fallen heroes to expand your roster of available warriors. Each player will fulfill a specific role on the team - warrior, assassin, or mage - to overcome colossal bosses and solve clever puzzles.</p>\n<p>Can you collect and complete all the challenges, and conquer the Blight once and for all?<br />\nFEATURES<br />\nBlightbound is an ever expanding game with new dungeons to explore, new heroes to recover and use, and new loot to retrieve with planned free updates for the community.</p>\n<p>Collect over 20 unique heroes, each with their own skill set, passive abilities, and fully narrated story to complete.</p>\n<p>Hundreds of unique items to loot and craft to improve each hero and alter their repertoire of attacks and abilities.</p>\n<p>Build out your refuge atop the mountain by recruiting new artisans to craft more items, fulfill bounties, and training your heroes.</p>\n<p>Battle through three distinct lands, each with several dungeons to conquer, including the eerie Gravemark, the oppressive Underhold, and precarious Blood Ridge.</p>\n<p>Distinct class roles that reward team play and powerful ultimate abilites that charge from fulfilling your role. Block damage as a warrior, interrupt enemies as an assassin or heal your allies as a mage.</p>\n<p>Stunning mix of hand-painted characters and realtime 3D models and lighting effects.</p>", "metacritic": 62, "released": "2021-07-27", "tba": false, "updated": "2023-07-21T16:37:48", "background_image": "https://media.rawg.io/media/screenshots/86c/86cda9910f0ea55ee33a30e0079da157.jpg", "website": "http://www.blightbound.com", "rating": 3.57, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 114, "beaten": 1, "toplay": 22, "dropped": 6, "playing": 1}, "playtime": 2, "achievements_count": 130, "ratings_count": 7, "suggestions_count": 506, "game_series_count": 0, "reviews_count": 7, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Ronimo Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Devolver Digital"], "esrb_rating": "Teen"}