{"id": 442880, "slug": "frontier-justice", "name": "Frontier Justice", "name_original": "Frontier Justice", "description": "Frontier Justice is a simulation &amp; strategy game set in the world of the Wild West. You'll play as a bounty hunter, and conquer the old west by capturing criminals, fighting outlaws, hunting legendary animals, taming legendary horses, enhancing weapons, and building up your town.<br/><br/>Game Characteristics<br/>1. This is the Authentic wild west - Bounty Hunters, Lawmen, Outlaws, Cowboys, and Entrepreneurs...You can find all of the old West's great characters here.<br/>2. Free Construction - The Saloon, Stables, the Four Corners Hotel, The Frisco Express and its Railway Station, the Town Clocktower...a huge variety of buildings for you to choose from!<br/>3. Simulation - Blazing deserts, snowy plains, and lush forests - experience all four seasons, day and night. You've got to prepare for everything!<br/>4. Dueling - Classic duels in the streets of the ol' Wild West. Improve your gunslinging and sharpen your accuracy until you can hit a dime from a hundred feet!<br/>5. Games of Chance - Try your luck with cards and the lucky draw machine in the saloon, to earn piles of rewards!<br/>6. Hunt Legendary Animals - Bears, wolves, alligators, and eagles - many different animals await you. Hunt them and pick up rare items!<br/>7. Raise Arabian Horses - Track, tame, and upgrade them to fill out your Stables!<br/>8. Capture fugitives to claim bounties - Take bounty jobs, hunt down, and shoot outlaws to claim rich rewards!<br/>9. Unlock and Upgrade your favorite weapons - Knives, Revolvers, Shotguns, Rifles, and even custom Sniper Rifles ...get unlimited rare and powerful legendary weapons for free!<br/>10. Join a fearless alliance - Embedded translation and the Posse chat channel allow you to work with your allies to take control of the state government, and expand your territory!<br/><br/>——<br/>Subscription Weekly Pack: Awesome value; 7 days of rewards; just 4.99 USD per week.<br/>Enjoy 7 days of high value in-game privileges, including the following benefits:<br/>Purchase to get an immediate 800 Gold and then 1,000 more each day. You'll also receive some awesome buffs.<br/>•After you subscribe, you will receive a Super Week Card Offer for 7 days.<br/>•Apple will monitor and manage all transactions made through iTunes.<br/>•When you confirm your purchase, you will be charged from your iTunes account.<br/>•Subscriptions automatically renew, unless the automatic renewal option is turned off at least 24 hours before the end of the current subscription.<br/>•The account will be charged within 24 hours prior to the end of the current subscription, at which point the renewal fee will be determined.<br/>•Subscriptions can be managed by the users themselves, and you can turn off automatic renewal after you subscribe via your account settings.<br/>•If you're provided with a free trial, then any unused period will be forfeited when the you purchase the full subscription.<br/>•Try it free for 7 days! Once your trial is over subscription fees will be taken each week. Subscriptions can be cancelled at any time.<br/>——<br/><br/>Facebook: https://www.facebook.com/frontierjustice.en/<br/>Instagram : https://www.instagram.com/frontierjustice.en/<br/>Twitter : https://twitter.com/frontier_justic<br/>Youtube : https://www.youtube.com/channel/UCbkQ_Derxq5VysdoCia6eSQ?view_as=subscriber<br/>Official website: http://frontier.onemt.com/<br/>Customer support: If you have any feedback or recommendations, then don't hesitate to send us a message at serviceww@onemt.com<br/>Privacy Policy: http://www.onemt.com/abroadgame/outer/policy<br/>Terms of Service: http://www.onemt.com/abroadgame/outer/terms", "metacritic": null, "released": "2020-05-10", "tba": false, "updated": "2020-05-15T02:17:55", "background_image": "https://media.rawg.io/media/screenshots/90a/90aee1bedb04f0fedee3073a02d8c0b9.jpg", "website": "http://www.onemt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ONEMT"], "genres": ["RPG", "Strategy"], "publishers": ["Lokka Entertainment Hong Kong"], "esrb_rating": "Teen"}