{"id": 442871, "slug": "divinity-original-sin-the-source-saga", "name": "Divinity: Original Sin - The Source Saga", "name_original": "Divinity: Original Sin - The Source Saga", "description": "This bundle includes both Divinity: Original Sin Enhanced Edition, and Divinity: Original Sin 2 - Definitive Edition, the sequel. Both games and their DLCs will be available in your library after purchase.<br/><br/>Two of the most acclaimed RPGs. Play alone, as a party of 4 friends online, or as a duo on the couch. Experience the adventures that changed the genre forever. \r\nWield world-changing magic and craft your party in two award-winning adventures. Write your name into Divinity's history as you forge your own path through a vibrant, reactive world. Your imagination is the limit as you strive to restore Divinity and save the world. <br/><br/>Divinity: Original Sin 2's critically-acclaimed campaign lets you take the role of a Godwoken - a hunted user of forbidden magic - on a mission to restore divinity to the world. <br/><br/>In Divinity:Original Sin you travel back centuries to where it all began. Together with the famed wizard Zandlor you and your fellow Source Hunter must stop the Void Dragon from devouring the world.\t<br/><br/>Dive into the series that critics say sets the bar for modern RPGs, with a world that reacts to your choices and innovative combat that lets you combine the elements to rain destruction on your foes. Play alone, with friends online, or in couch co-op mode and explore over 200 hours of RPG, wrapped in one cost-saving bundle. There's never been a better time to awaken your powers and claim the history of Divinity as your own.", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2022-12-19T10:56:32", "background_image": "https://media.rawg.io/media/screenshots/7b4/7b454e4c760cbe8df2d4b179cbefe931.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Xbox One"], "developers": ["Larian Studios"], "genres": [], "publishers": ["Larian Studios"], "esrb_rating": null}