{"id": 44294, "slug": "quantum-wizard", "name": "Quantum Wizard", "name_original": "Quantum Wizard", "description": "<strong>Quantum Wizard</strong> is a puzzle-platformer where you manipulate the laws of quantum physics to solve puzzles. The game draws inspiration from Braid, Nihilumbra, Limbo.<br/><br/><strong>The golden age of Atlantis</strong> is long gone and a mysterious Seer is leading a rebellion as dark omens start spreading. You are the Quantum Wizard, an ageless wise (and clumsy) man with the power to manipulate quantum concepts in your environment. The King charges you with the mission to investigate on the whereabouts of the rebellion as you unveil an evil scheme threatening to overturn the Kingdom of Atlantis.<br/><br/><br/><br/><ul><li><strong>An epic-goofy atmosphere</strong> defined by the game’s unique art, inspired by several pre-ancient civilizations. Each country of Atlantis is a mash up of two to three cultures such as the Babylonians, Sumerians, Spartiates or the Olmecs.<br/></li><li><strong>Unique gameplay mechanics based on quantum physics concepts </strong>such as entanglement, Heisenberg's uncertainty, wave-particle duality and more!<br/></li><li><strong>Progressive difficulty and challenging puzzles</strong> await you as you acquire more quantum abilities.<br/></li><li><strong>More than 15 hours of gameplay</strong>, more if you seek hidden secrets.<br/></li><li><strong>Speedruns facilitated</strong> through an integrated timer and a leaderboard ranking.</li></ul>", "metacritic": null, "released": "2017-07-07", "tba": false, "updated": "2019-08-28T22:05:52", "background_image": "https://media.rawg.io/media/screenshots/7f4/7f475a3366a6cd07a75dd52870c0c0d3.jpg", "website": "http://www.quantumwizardgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bad Gravity"], "genres": ["Indie"], "publishers": ["Bad Gravity"], "esrb_rating": null}