{"id": 443002, "slug": "every-degree-matters", "name": "Every degree matters", "name_original": "Every degree matters", "description": "Every degree matters<p>This is my entry for the Sim Jam (theme: A Matter of Degree). Due to work I only got around 12 hours time to work on it, so many initial ideas (and most of the polishing) didn't make it in. Hope you enjoy it anyways.</p>What is this?<p>It's like single-player pong meeting a time-stop game. Try to move your little floating, glowing ball through different levels. Sounds easy? It is. But there is a catch: </p><ul><li>You control the level, not the ball itself.</li><li>There is stuff you don't want to touch.</li></ul><p>Still easy. Just make sure to not over-rotate. Because your score is only determined by how many degrees you rotated the level to finish it. So take your time (after all it's a simulation game) and plan your moves ahead to complete all levels.</p>Features<ul><li>15 unique levels, including a small tutorial to get you started.</li><li>No music (yes, this time it's a feature). Turn on your favourite relaxing guitar sounds, crank up that classical orchestra or hit the fan with crazy metal sounds. Whatever floats your boat while concentrating!</li><li><strong>You want to try every level</strong>, but just can't beat enough others to unlock it? No worries, I've got you covered! You'll find a savegame file in the downloads section, just plug it into your user-appdata (on Windows this should be something like <em>[%AppData%\\Godot\\app_userdata\\Every degree matters]</em>) and replace your own (make sure to rename/save your original save-file before!). All levels should be unlocked and playable.</li></ul>How to play<ul><li>You can rotate the level using [WASD] or [ARROWS]. </li><li>You can change the simulation speed on the fly: 5x while holding [SHIFT], 0.5x while holding [CTRL].</li><li>You can run the simulation step by step (use [ENTER]) for these really tight situations.</li></ul>Remarks<p>There are a few corner cases (yea, mostly at corners) where the collision physics isn't behaving the way it should. The kinematic physics didn't exactly handle the pixel-based collisions well so most of it is now implemented using \"manual\" raycasts. I'm really sorry for those occasional hiccups, I just didn't have the time to fix all of them - maybe I'll patch that after the submission deadline. Credit for the single button used (no time to replace it using something self-made) goes to kenney.nl.</p>Scores<p>Unlocking levels - done by completing others - should be tuned to be easy enough most of the time. At least that's what I hope. As a dev playing it for the n-th time without any other playtesters due to time, judging this is kinda hard. I hope it suits most of you. For the ones trying to push a bit further, I'll release some \"harder\" goals which you can use to challenge yourself, I'll further lower them if I find any \"nice\" solutions and people want harder bounds:</p><ol><li>&lt; 25°</li><li>&lt; 15°</li><li>&lt; 100°</li><li>&lt; 65°</li><li>&lt; 60°</li><li>&lt; 60°</li><li>&lt; 30°</li><li>&lt; 65°</li><li>&lt; 115°</li><li>&lt; 35°</li><li>&lt; 60°</li><li>&lt; 100°</li><li>&lt; 120°</li><li>&lt; 150°</li><li>&lt; 210°</li></ol>", "metacritic": null, "released": "2020-05-14", "tba": false, "updated": "2020-05-15T02:48:41", "background_image": "https://media.rawg.io/media/screenshots/e72/e72354b6bee64270c7c177da333dfb62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["kchnkrml"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}