{"id": 44308, "slug": "exatron-quest-2", "name": "Exatron Quest 2", "name_original": "Exatron Quest 2", "description": "<p>In the night, you venture into a forbidden zone ...<br />\nWhy ?<br />\nFor what obscure reasons ...?<br />\nYou Deliver the Demon King<br />\nOf a sleep obliged by the heroes of the past ...<br />\nWill you repair your mistake?<br />\nYou will know it by following the story Of :<br />\nExatron Quest 2 Blood Sword!</p>\n<hr />\n<p>RPG<br />\n1 Player</p>\n<hr />\n<p>(From the Silver Dust Edition)<br />\nFollowing a serious illness, your mother left this world and left you alone.</p>\n<p>During your mourning, you are approached by, Morgana, widow of the demon king, who convinces you to break the magic barrier that seals the sword of Prince Ernest.</p>\n<p>She explains that breaking the seal will help bring a loved one back to life.</p>\n<p>Driven by the hope of seeing your mother again, you are performing this perilous quest, but once the seal is broken, you realize too late that you have been used by Morgana to resurrect the demon king.</p>\n<p>This same demon who 5 years ago had already fought your father, touching him mortally, before being completed by Prince Ernest ...</p>\n<p>Driven by hatred and thirst for revenge, you decide to do everything possible to repair your mistake and take revenge on Morgana, even if death itself tries to stop you!</p>\n<hr />\n<p>Exatron quest is a new dungeon, new characters, new quests!</p>\n<p>Find in the game a new soundtrack from the friendly participation of the fabulous band Silver Dust (Switzerland) and a special participation of the group Seriously Serious (Switzerland)!</p>\n<p>New:</p>\n<p>Legendary classes!</p>\n<ul>\n<li>Assassin  </li>\n<li>Berseker  </li>\n<li>Archbishop  </li>\n<li>Gunner  </li>\n<li>Wizard  </li>\n<li>Crusader  </li>\n</ul>\n<p>Will you find the unique weapons created especially for these legendary classes!</p>\n<ul>\n<li>A treasure hunt to visit the new dungeon:  </li>\n</ul>\n<p>The House 21</p>\n<p>And 2 new secret places!</p>\n<p>So come discover or rediscover the fabulous world of Exatronia and deliver the world of the king of demons!</p>\n<p>RPG 1 PLAYER</p>\n<p>Available in French, English and Soon in German!</p>", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2021-04-06T12:04:20", "background_image": "https://media.rawg.io/media/screenshots/e1e/e1e871e3901a0dcdf9be202d2d48eb96.jpg", "website": "https://www.facebook.com/StudioPillet2017/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 24, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 266, "game_series_count": 2, "reviews_count": 2, "platforms": ["PC"], "developers": ["Pillet Michael"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Pillet Michael"], "esrb_rating": "Rating Pending"}