{"id": 44318, "slug": "the-last-birdling", "name": "The Last Birdling", "name_original": "The Last Birdling", "description": "Bimonia is one of the last Birdlings alive on this earth. The Birdlings see humans as sworn enemies, and Bimonia has been taught to kill on sight.<br/><br/>One day, Bimonia meets Tayo, a human child hunting in the forest. Bimonia fails to kill Tayo, and they instead become friends. Mother will be furious if she finds out, or worse, this relationship may cause tension between the two species to erupt.<br/><br/>The Last Birdling explores Bimonia and Tayo's fight for their friendship as the world threatens to tear them apart.<br/><br/>* * *<br/><br/><br/><br/>Unhack, the first game created under the InvertMouse name, was produced in 2012. That means The Last Birdling happens to be my fifth anniversary project. This game is a culmination of all the lessons I have learned through the past five years. Now, I would like to share with you several features available in  The Last Birdling:<br/><br/><strong>Dual perspectives:</strong><br/><br/><br/><br/>The Last Birdling alternates between Bimonia and Tayo's perspectives. Follow their journeys from childhood to adolescence as they struggle to maintain their friendship against all odds.<br/><br/><strong>Multiple endings:</strong><br/><br/><br/><br/><br/><br/>There are 21 decisions to make throughout Bimonia and Tayo's journeys. Depending on their resolve, this story will conclude in one of five ways. Use the progress tracker to determine how to obtain every ending.<br/><br/><strong>Glossary:</strong><br/><br/><br/><br/><br/><br/>Dive into The Last Birdling's lore through the glossary page. Throughout your journey, you will find links that take you to relevant entries.<br/><br/>* * *<br/><br/>Thank you! I hope you will find the experience worthwhile.", "metacritic": null, "released": "2017-08-31", "tba": false, "updated": "2023-12-05T18:53:10", "background_image": "https://media.rawg.io/media/screenshots/717/717414dc21d01f5a9fbeab85f008b978.jpg", "website": "http://birdling.invertmouse.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32, "beaten": 1}, "playtime": 3, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["InvertMouse"], "genres": ["Indie"], "publishers": ["InvertMouse"], "esrb_rating": null}