{"id": 443136, "slug": "social-distancing-gondor0601", "name": "Social Distancing (Gondor0601)", "name_original": "Social Distancing (Gondor0601)", "description": "<p>-By Gondor </p>\n<p>V. 1.6</p>\n<p>Social Distancing un gioco molto attuale! Mantieni le distanze dalle persone e dalle mascherine infette, che ti bloccheranno e sarai costretto a schivarle. Ogni persona che schivi è un punto, ogni circa 10 punti riceverai un disinfettante molto famoso che potrai lanciare agli \"avversari\" che scompariranno dandoti un punto!! Se volete ascoltare anche la musica del gioco alzate il volume!</p>\n<p>-Comandi:</p>\n<p>\"A\"- vai a sinistra</p>\n<p>\"D\"- vai a destra </p>\n<p>\"spazio\"- pausa</p>\n<p>\"click tasto sinistro mouse\"- fine pausa/ lancio disinfettante </p>\n<p>\"invio\"- restart del gioco </p>\n<p>-Credits: Kenny da cui ho preso le basi per i personaggi, Music: pixelland di Free Music </p>\n<p>Un gioco creato in 4 giorni con la versione gratuita di construct 3.</p>\n<p>-Avvertenze:</p>\n<p>Sappiate che non funziona con il touch, quindi non si può giocare da telefono, ma neanche con il trackpad, che ogni tanto si impalla. Quindi vi consiglio di giocarlo con mouse e tastiera da un qualunque PC o laptop </p>\n<p>Fatemi sapere nei commenti se vi piace, ma soprattutto il vostro punteggio migliore!</p><p>Transleted in English:</p><p>Social Distancing a very current game! Keep your distance from infected people and masks, which will block you and you will be forced to dodge them. Every person you avoid is a point, every 10 points you will receive a very famous disinfectant that you can throw to the \"opponents\" who will disappear and will give you a pont !! If you want to listen to the music of the game, turn up the volume!</p>\n<p>-commands:</p>\n<p>\"A\" - go left</p>\n<p>\"D\" - go right</p>\n<p>\"space\" - pause</p>\n<p>\"left mouse click\" - end of pause / disinfectant launch</p>\n<p>\"enter\" - restart the game</p>\n<p>-Credits: Kenny from which I took the bases for the characters, Music: Free Music pixelland </p>\n<p>A game created in 4 days with the free version of construct 3.</p>\n<p>-Warnings:</p>\n<p>Know that it does not work with the touch, so you can not play from the phone, but also with the trackpad, which sometimes gets stuck. So I recommend you play it with mouse and keyboard from any PC or laptop</p>\n<p>Let me know in the comments if you like it, but above all your best score!</p><p>Tell me if I made any mistakes.<br/></p><p>Punteggio- in English- Points</p><p>Amuchine_ They are the famouse disinfectant.</p>", "metacritic": null, "released": "2020-05-14", "tba": false, "updated": "2020-05-15T03:17:50", "background_image": "https://media.rawg.io/media/screenshots/59f/59f9b920e2b7bf306f67b233155d24d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gondor0601"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}