{"id": 443265, "slug": "the-school-jraven-cgbshadow", "name": "The School (JRaven, cgb.shadow)", "name_original": "The School (JRaven, cgb.shadow)", "description": "<p><em>You're the host of a popular Ghost-Hunting video channel online. One day, you get a call from your producer. She tells you about an exciting new story she wants you to follow up on; there's an urban legend in a town not too far from where you live about an old high school. Apparently there were a number of disappearances there a decade or two back, and it was closed down. And of course, it's haunted. You pack your equipment, get in your van and drive. </em></p>\n<p><em>You arrive at the site shortly after midnight. Sure is spooky here. Going to be great for the channel. Only, did one of those curtains just move? Wasn't this place supposed to be abandoned? Then what was that dark shape you saw by the window...?</em></p>\n<p><strong>The School</strong> is a Low-Poly VR Horror game experience. Explore an abandoned high school, and discover the mystery of what happened there many years ago... and of what still lurks in the shadows. </p>\n<p>The game is a VR experience and requires a headset and controllers to play. It also uses push-stick movement, so if you are sensitive to that, please take note. Also note that if you are using an Occulus Rift headset, you may need to toggle your sound settings to ensure that the game audio is connected to the headset.</p>\n<p>Please also be advised that the Mac build of the game is something of an experiment, and may not always work as well as the PC version.</p>\n<p>You can press Esc at any time to close and exit the game.</p>\n<p>Made by Jonathan Otcasek, Rosaita Wu, and Stephen Gonzalez. Special thanks to Sheldon Henderson for modeling, rigging and animations.</p>", "metacritic": null, "released": "2020-05-14", "tba": false, "updated": "2020-05-15T03:45:37", "background_image": "https://media.rawg.io/media/screenshots/464/46495eb6da35a5c1cd2072ed6176e156.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["JRaven", "cgb.shadow"], "genres": [], "publishers": [], "esrb_rating": null}