{"id": 44348, "slug": "dying-sinner-escape", "name": "DYING: Sinner Escape", "name_original": "DYING: Sinner Escape", "description": "DYING: Sinner Escape is a 3D horror Room-break game that combines  a deep storyline with rich and seamless cinematics.<br/><br/>Troy Dunniway, an award winning Creative Director on over 80 top AAA games, such as \"Age of Empires\" and \"Ratchet &amp; Clank\", is the Executive Producer on this exciting and horrific new title.<br/><br/>Created by top Hollywood movie and game development talent, the game features a mysterious and compelling storyline that revolves around a curious plan and secret events.<br/><br/>Just like watching a TV series, you will experience and discover the whole story through several episodes. The entire mystery will be revealed step by step as you play through the ongoing episodes of \"DYING: Sinner Escape.\"<br/><br/>In the story, you will play as multiple characters who are kept in different, strange but familiar places which are somehow similar in their nightmares. Together but separate, they are all suffering from the same painful, unusual phenomena.<br/><br/>You will control your characters’ movements around the mysterious places they are trapped in, investigate suspicious objects, and solve puzzles. You must find your way out to escape the prisons while unraveling the secrets within, one by one.<br/><br/>Remember, each place, each phenomenon, each trick and each piece in the game has its own meaning of existence. They all have internal relations with your characters and it's all about who they are and what they plan to do..<br/><br/><br/>********************** GAME FEATURES *********************<br/>ICONIC VISUAL STYLE<br/>The immersive 3D art created using the Unity 3D engine presents a highly mysterious atmosphere with a dark and gloomy feel.<br/><br/>DEEP &amp; COMPELLING STORY<br/>Created by top Hollywood movie and game development talent, the story is separated into several episodes. You will experience the different parts of the story from different characters’ perspectives. Each part of the story in each episode has its own climax.<br/><br/>FANTASTIC VOICES<br/>Feel the characters come alive in their world through fantastic voice acting.<br/><br/>SEAMLESS CINEMATICS<br/>Seamless, rich cinematics will put you deep in the middle of the storyline and help you unravel the secrets within.<br/><br/>INNOVATIVE CONTROLS<br/>Utilizes innovative finger gesture controls that take advantage of multi-touch for an easy to use and intuitive player experience.<br/><br/>UNIQUE PUZZLES &amp; GAMEPLAY<br/>Utilizes the advanced hardware and software of different mobile devices, such as the Three-axis gyro, Accelerometer and Voice Recognition to enhance gameplay..<br/><br/><br/>******************** SEASON 1 EPISODE LIST ******************<br/>Episode 1 : Last Hour<br/>Episode 2 : Before It's Late<br/>Episode 3 : Someone I Care About<br/>Episode 4 : By All Means<br/>Episode 5 : Just Another Nightmare<br/><br/><br/>We hope \"DYING: Sinner Escape\" will be one of your favorite horror and room-break game experiences!<br/><br/>Escape and discover the truth before it's too late!<br/><br/>Good Luck!", "metacritic": null, "released": "2013-05-24", "tba": false, "updated": "2019-10-22T14:30:41", "background_image": "https://media.rawg.io/media/screenshots/c5c/c5c50e6df5abad64d6d660b16835406b.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wuhan NEKCOM Network Technology Co"], "genres": ["Adventure", "Puzzle"], "publishers": ["Wuhan NEKCOM Network Technology Co"], "esrb_rating": "Everyone 10+"}