{"id": 44340, "slug": "mine-quest-2-tactical-combat-dungeon-crawler", "name": "Mine Quest 2 - Tactical Combat Dungeon Crawler", "name_original": "Mine Quest 2 - Tactical Combat Dungeon Crawler", "description": "<p>Dig into the epic world of Mine Quest and explore a land full of mysteries and challenges! Delve into unscathed mines packed with monsters in your hunt after materials to craft and upgrade legendary gear.<br />\nFrom the creators of the award-winning mining RPG Mine Quest comes a mind-blowing new adventure!<br />\nBecome a fearless dwarf in a quest to uncover an incredible world digging up the subterranean and looting its treasures. Dig through the underground to find the hidden blueprints that will aid you in crafting legendary items and weapons.<br />\nRaid mines, unlock treasures buried deep inside them and fight monsters and bosses that will crawl through the rocks to guard the valuable resources you are trying to steal.  Explore this mythical place and go on a digging spree with Mine Quest 2!<br />\nHIGHLIGHTS<br />\n• EXPLORE a fantastic world of mines and danger<br />\n• DISCOVER and CRAFT items such as pickaxes, armors and weapons<br />\n• BATTLE your enemies in a vast number of CHALLENGES and take their loot<br />\n• Use TACTIC and STRATEGY to beat creatures willing to put an end to your adventure<br />\n• COLLECT materials and CRAFT powerful gear<br />\n• UPGRADE and EVOLVE your equipment and become invincible<br />\nDownload now and start exploring!<br />\nDisclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device&#39;s settings.<br />\nLike our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq</p>", "metacritic": null, "released": "2016-05-05", "tba": false, "updated": "2022-03-07T01:55:03", "background_image": "https://media.rawg.io/media/screenshots/6a7/6a7414393d6f68ded43f45d4501fcab7.jpeg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Adventure", "Simulation"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}