{"id": 44349, "slug": "kid-vector", "name": "Kid Vector", "name_original": "Kid Vector", "description": "Ever wish games were fun again, like when they were lovingly handcrafted line segment by line segment that your grandpappy used to make?<br/><br/>Ahhh, those were the days. Yep, back then you played a game, instead of watching it through cutscenes. You didn’t need no fancy whizbang graphics either, and the dragons looked vaguely like ducks. Yes, Kid Vector is an homage to a simpler time, when games were only about fun, children listened to their parents, and coins were collected instead of bought in packs for $24.99.<br/><br/>Kid Vector is a platformer that features a nouveau retro 2.5d world full of glorious vector graphics. Throughout the game you’ll encounter mysterious UFOs, relentless space worms, and a very angry vector dragon. There are 15 levels to explore, sure to challenge your platforming mettle. If you dare risk retro overload, you can play Kid Vector on your iCade as well.<br/><br/>So grab a lemonade, snuggle up to your newfangled iDevice, and relive the good old days with Kid Vector.<br/><br/>---Reviews ---<br/><br/>Slide To Play (4/4) - \"Kid Vector is pure joy to play. The depth of creativity and passion that went into it is evident in every frame.\"<br/><br/>AppAdvice (4.5/5) -\"If you’re a fan of difficult retro platformer titles, then make sure to give Kid Vector a try.\"<br/><br/>Apptudes (4/5) - \"Kid Vector is a refreshing twist to most of the cartoonish platformers available in the App Store today\"<br/><br/>The App Shack (4.5/5) - \"it's one of the most well designed iOS platformers I’ve had the pleasure of playing, and I’ve played just about every single one of them.\"<br/><br/>TouchGen (4/5) - \"The easy to grasp controls, and flashing graphics makes it a joy to play\"<br/><br/>Modojo (4/5) - \"Kid Vector delivers plenty of 8-bit charm, with tight virtual controls, punishing stages and a dollop of personality for good measure.\"", "metacritic": null, "released": "2012-08-02", "tba": false, "updated": "2019-10-22T14:30:41", "background_image": "https://media.rawg.io/media/screenshots/0ec/0ec4d37501e9f33dbb728f9556741831.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["UNCADE"], "genres": ["Adventure", "Arcade"], "publishers": ["Uncade"], "esrb_rating": null}