{"id": 443573, "slug": "revenge-of-the-bee", "name": "Revenge of the Bee", "name_original": "Revenge of the Bee", "description": "Description of the project:\r\n<p>Revenge of the Bee is a student made game by 5 UW Stout students for the spring 2020 GDD 200 course. We had 3 programmers and 2 artists create this game during the COVID-19 crisis with 0 previous experience working in the Unity game engine.  We are proud of what we created as a top-down simplified RPG dungeon crawler targeted at mobile android devices. </p>\n<p>In Revenge of the Bee the player takes on the role of Benny, the sole survivor of a fungus that has infected his hive. Go on a quest for revenge and hunt down the fungal queen through 3 unique areas with different enemy types.  We put an emphasis on versatility of the players choices when leveling up stats, as well as what actions to take each turn of combat. Feel free to reach out to the us in the comments if you have any questions. You can also download the pdf below of our design document to understand some of our original goals and intentions with the game.</p>\r\nDeveloper Let's Play\r\n\r\n\r\n\r\nNotices about playing in browser and with the desktop version: \r\n<p>For some of the UI to properly display in browser it is better to play the game in full screen. As the game was targeted at mobile, some of the UI is smaller and not properly placed at higher resolutions. There are some bugs within the game that may hinder play, if you find any we are sorry.  This game was intended to help us learn a lot about Unity and creating games in general and as such we ask that you play with a less critical eye. Thank you to all of those who supported us and we hope you enjoy our game!</p>\n<p>-Vincent Wheat, Katherine Rude, Vincent Lubasi, Maggie Butler and Jaden Stock</p>", "metacritic": null, "released": "2020-05-13", "tba": false, "updated": "2020-05-15T04:57:05", "background_image": "https://media.rawg.io/media/screenshots/1cb/1cbaf009c7d5844e85fe885c75cc2896.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["Waffleater7"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}