{"id": 443608, "slug": "warbotics", "name": "WARBOTICS", "name_original": "WARBOTICS", "description": "WELCOME TO WARBOTICS\r\n<p>But in all seriousness, it's humans versus robots.<br/></p>\n<p>      The evening sky glows a neon light blue under the thick clouds looming over Neo-Sunset City, the city that’s always open. Spotlights of pink, orange, green, blue, and purple flash everywhere, from the tallest skyscraper to the most stylish windbreakers. Broken VHS tapes and crumpled paper skitter across the grounds of the bustling activity from deniers of an ongoing battle for the heart of the city. </p>\n<p>     Warbotics is a twin-stick top-down game for 1 to 4 (1v1 or 2v2) players. It is a couch co-op and versus shooter game. Battle rages between humans and robots called Botics™. Each player selects which faction they want to play as, either the robots or humans. The two sides are dropped in the center stage to begin a back and forth fight that moves across the various stages. When one team wins, they advance closer to the opposing team’s home base. Upon reaching the base and overcoming a final boss controlled by the opposing team, the victors destroy their enemy’s base in an epic victory cutscene!</p>\n<p>Warbotics is best summarized as “a retro-future 80’s couch co-op arena shooter”.</p>\n\n<p>DISCLAIMER: WARBOTICS IS OUR SENIOR PROJECT. Five poor souls embarked on a development journey to create this game, and this is the result. Please enjoy our year-long endeavor!</p>\n\n\n<p>Meet the team:<br/>Aiden ►►Sound Design<br/>Alexander ►► Programming | ajgoldberg.com<br/>David ►►Character Art/Shaders<br/>Julie ►► Producer/Animation/Environment Art/Documentation/Music Composition | https://juliedemyanovich.com<br/>Sergio ►► Environment Art/Lighting/Trailer Creator | https://www.sergioconti.net | https://twitter.com/PowerSergArt</p>", "metacritic": null, "released": "2020-05-13", "tba": false, "updated": "2020-05-15T05:04:18", "background_image": "https://media.rawg.io/media/screenshots/695/695bd5cf2b9e01218d424a4f252aedfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Redberryweo"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}