{"id": 443654, "slug": "button-breaker", "name": "Button Breaker", "name_original": "Button Breaker", "description": "<p><strong>Button Breaker is an intense clicker game, centered around breaking a button by using your mouse and keys to deal damage</strong><strong>.</strong> The main game centers around one page where you have access to upgrades, stats, and more; in which, clearing courses would change the look of this one page and change how you play and face the situation. </p>\n<p><strong>Game Play:</strong></p>\n<p>Button Breaker is intense, as you will have to deplete the button's durability in the given time. This durability will increase throughout the courses you complete. The countdown, throughout the courses, will change in its rate and amount of countdown it takes out of itself. </p>\n<p><strong>Countdown: </strong>Starting at 60 seconds, your countdown will decrease depending on what course you are on, at a certain rate. This changes the pattern of how you play and it is up to you to figure out how each pattern works.<strong> In this game, you have the ability to \"Start\" and \"Stop\" your countdown as you please.</strong> Of course, you will not be able to attack the button if your countdown is stopped. This function is meant to be used to stop and come up with a strategy, buy some upgrades in the middle of the match, or even to regain some health by \"cheating the system\". For example, your own HP waits one second after the countdown starts. <strong>In this one second of waiting, you can switch between the \"Start\" and \"Stop\" countdown to regain some health without losing any of your own! </strong></p>\n<p><strong>Player Health:</strong> As mentioned earlier, your own \"Player Health\" will come into the game too, and you will have to later focus on the durability, time, and your health. Similarly, throughout the courses, your health will change in rate and damage taken. <strong>This brings this game to a great intensity, as you will have to focus on multiple aspects, and will have to change the pattern of how you press different buttons each game. </strong></p>\n<p><strong>Restart Ability: </strong>Timing is key to this game, as you will have to make some of the most precise timings to clear a course.  For example, we have the restart countdown ability, which will come in the middle of the game. You will have the ability to restart your countdown back to 60 at any time when your countdown timer is on. <strong>At times, you may have to make some of the most riskiest timings to give yourself the most time out of your situation; in which, could win you the game!</strong></p>\n<p><strong>Level and Upgrade System: </strong>After every click you do to the button, you gain clickpoints, based on how much damage you do to the button. Similarly, at the end of a completed course, your remaining countdown will convert into XP.<strong> You can use these two things to upgrade different stats that you have as a player, from click-damage to upgrading to auto-critical hits.</strong> Some upgrades like upgrading your Max Health, will cost you to lose clickpoints, while other upgrades like the RankedPower-Ups, will just require you to meet their requirement <strong>once. </strong>Once you have enough XP, you can level up to the next level, giving you access to more RankedPower-Ups. You can find all these stats and upgrades in the top right corner of the course.</p>\n<p><strong>Critical Hit System: </strong>You have a 1 out of 20 chance of hitting a critical, each time you deal damage to the button. Getting this chance will result in a white button popping up at the bottom left of the button you are targetting. If you click the targetted button again when the critical button appears, your chance will reset, and the critical button will disappear. <strong>This means, you will have to have good reaction timings in order to hit this button. When it pops up, you will have to stop clicking the target, and instead click on the critical button.</strong> Of course, a more efficient way is to buy the auto-critical function in the shop for 10,000 clickpoints, and then the critical damage upgrade for 1,000 clickpoints. Doing this will result in the critical hit done to the button automatically when you have hit that 1 in 20 chance. <strong>Note that even with the critical damage's massive damage, you will not earn clickpoints from its damage unlike when you click on the target yourself or when your bot deals damage.</strong></p>\n<p><strong>Edox: </strong>While leveling up benefits you when you are buying your own gear, it actually hurts you if you are trying to upgrade your robot. Meet Edox, your robot and partner who would help you deal damage to the durability over time, when the countdown is on. On the bottom right, you will be able to upgrade his stats. <br/></p>\n<p><strong>Controls: </strong></p>\n<ul><li><strong>Left Click: Deal damage to target button</strong></li><li><strong>S: Heal Player HP</strong></li><li><strong>W: Subtract 1 to Player HP</strong></li><li><strong>R: Reset Countdown</strong></li></ul>\n<p><strong>Creator: I am the only member of UnitySoloStudios. I am starting out in the game development industry, and starting off with this, my first game. However, I worked on this game with one of my close friend, so a big thanks to his help.</strong></p>", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-05-15T05:13:24", "background_image": "https://media.rawg.io/media/screenshots/f2e/f2e0032c5ee69bc72fd84e91ae60e907.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["UnitySoloStudios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}