{"id": 44368, "slug": "rescue-team-7", "name": "Rescue Team 7", "name_original": "Rescue Team 7", "description": "Mother Nature has met her match! When the Earth trembles, volcanoes rumble and thunder splits the sky, the Rescue Team is there to save the day. Guide this expert group of thrill-seekers with a heart for helping people as they dig through the rubble of one disastrous scene after another to save victims and rebuild towns.<br/><br/><br/><br/>There is no calamity too big and no animal too small to keep the Rescue Team off the scene. Guide them and their canine companions as they arrive by land, sea and air to clear debris, gather resources and complete missions that will take them deep into verdant jungles, dark mines and snow-capped mountains.<br/><br/>Use strategy to beat the clock and earn dozens of stars as you operate ski lifts, turn off dangerous oil geysers and clear foggy trails, and then use the stars to build your own Rescue Team base. With each hazard you overcome, new achievements and power-ups will be your reward.<br/><br/><br/><br/>The Collector's Edition of Rescue Team 7 comes with an epic 50-level campaign featuring a captivating story about the daily lives of these heroes, 20 challenging bonus levels, a step-by-step strategy guide, downloadable media and more. Play Rescue Team 7 today and experience the adventure that waits on the other side of danger!", "metacritic": null, "released": "2017-07-19", "tba": false, "updated": "2019-08-28T22:05:50", "background_image": "https://media.rawg.io/media/screenshots/7af/7afb7561520a77327219abe141ed79ec.jpg", "website": "https://www.alawar.com/game/rescue-team-7-collectors-edition/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 36}, "playtime": 2, "achievements_count": 38, "ratings_count": 1, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Nova Ideas"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}