{"id": 44379, "slug": "fading-of-zarya-7", "name": "Fading of Zarya 7", "name_original": "Fading of Zarya 7", "description": "<strong>Fading of Zarya 7</strong> is a 2D role-play action adventure game with elements of strategy and survival.<br/><br/><br/>Rare chemical materials have been found on a newly discovered planet – Tesaur, far into space. He who controls these resources will make a great leap in energy and economic areas for humanity.<br/><br/><br/><ul><li>Campaign and multiplayer mode with other players and AI characters<br/></li><li>Original crafting system of equipment<br/></li><li>Tactical management of your squad and mechanisms<br/></li><li>Complex labyrinths of locations with half-dead alien tech<br/></li><li>Powerful locations editor<br/></li><li>Late retro-future graphic style<br/></li><li>Nu metal/ambient style author music<br/></li><li>Full gamepad support</li></ul><br/><br/>Tesaurian energy, minerals and ore are rare, high value resources. A special exploration mission, Zarya 7, was sent, which consisted of scientists and a few military units. The only one among many other continuous human expeditions.<br/><br/>Distant investigations of the planet showed unknown primitive and strange<br/>lifeforms and cyclopean ruins of early existing civilisation.<br/><br/>Unfortunately, the Earth control centre stopped receiving any signals soon after the landing of the Zarya 7 expedition. All attempts to restore communications were unsuccessful. <br/><br/>It was decided to send a special commission to retrieve any information about Zarya 7. You were appointed as a commander of this investigation squad.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:49", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc83e1a9f527d641040cbb6d8c2e06f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SiBear"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["SiBear"], "esrb_rating": null}