{"id": 443782, "slug": "6-cards-to-win", "name": "6 Cards To Win", "name_original": "6 Cards To Win", "description": "<p>Six Cards To Win, the card game where only one can escape.</p>\n<p>Six Cards To Win is a free card game, escape your fears, survive and have fun in this card war, where strategy is important, and luck too.</p>\n<p>An easy to learn card game, play your hand smartly and you will escape, but be careful, the other survivors also want to escape, and you all have the same opportunities, or not?</p>\n<p>What are you afraid of? To the Slimes? To the dentists? Maybe the clowns? Maybe Yety? Wait, are you afraid of Brocoli? It doesn't matter, with 15 monster cards some of your fears are surely represented, others like the grim reaper, aliens, mummies or vampires are there to unlock and try to escape from them.</p>\n<p>The mechanics of 6 Cards To Win is very simple, you play a card and the rivals do the same, then the monster, hungry for cards for his collection, will count to see who advances, the last of each round loses and his card is discarded.</p>\n<p>15 monsters to unblock, representing the classic fears of movies and everyday things in life, such as broccoli, and each one will have its own level, which will make us win or lose starting points. Unlock all if you can, and be the best survivor.</p>\n<p>More than 20 survivors to unlock, picturesque and friendly characters, some avatars that have been given to appear in the game, and that you can find on Twitter. Many characters that will surely make you laugh while playing with their cards.</p>\n<p>In 6 Cards To Win, each monster card has its own scenario, so when you escape from the alien a space background will put you in the environment, the mummy in its pyramids, or the vampire in its castle !!! Each and every monster has its own stage.</p>\n<p>The soundtrack is original and is provided by my good friend Guillermo Cañete, a relaxing soundtrack to deal with monster cards, escaping does not have to be stressful.</p>\n<p>You also have accurate statistics, you will always know the points you have, the games you have played, the ones you have lost, the ones you have won, and also the percentage of victories you have.</p>\n<p>The games in 6 Cards To Win are short in intense, each game lasts about a minute, so you can play quick games anywhere, but be careful, then one you will want another, and another and another, the fun of each game is in charge of that ;)</p>\n<p>Play 6 Cards To Win:</p>\n<p>- 15 Monsters to unlock<br/>- Vampires, aliens, mummies, clowns, dentists ... Our fears are represented<br/>- More than 20 characters to unlock and play with them<br/>- Nice and nice graphics<br/>- For all ages<br/>- Easy to play, it is a card choice game<br/>- Fast, fun and intense games<br/>- Original B.S.O by Guillermo Cañete<br/>- Complete statistics of all your games</p>\n<p>If you like cards and card games, you will like 6 Cards To Win, an ideal game to play short games at any time, where each card, and each decision can lead you to escape or prey on the monster.</p>\n\n<p>---------------------------------------------------------------------------------------------------------</p>\n\n<p>Six Cards To Win, el juego de cartas donde solo uno puede escapar.</p>\n<p>Six Cards To Win es un juego de cartas gratuito, escapa de tus miedos, sobrevive y diviértete en este divertidos juego, donde la estrategia es importante,pero la suerte también.</p>\n<p>Un juego de cartas fácil de aprender, juega tu mano inteligentemente y escaparás, pero ten cuidado, los otros sobrevivientes también quieren escapar, y todos tienen las mismas oportunidades, ¿o no?</p>\n<p>¿Cuales son tus miedos? ¿Los Slimes? ¿Los dentistas? Tal vez los payasos? El Yety? Espera, ¿Tienes miedo del Brocoli? No importa, hay 15 monstruos y seguro que muchos de tus miedos están representados, otros como la parca, los extraterrestres, las momias o los vampiros están ahí para desbloquear y tratar de escapar de ellos.</p>\n<p>La mecánica de 6 Cards To Win es muy simple, juegas una carta y los rivales hacen lo mismo, entonces el monstruo, hambriento de cartas para su colección, contará para ver quién avanza, el último de cada ronda pierde y su carta es descartada.</p>\n<p>15 monstruos para desbloquear, que representan los miedos clásicos de las películas y las cosas cotidianas de la vida, como el brócoli, y cada uno tendrá su propio nivel, lo que nos hará ganar o perder puntos de partida. Desbloquea todo si puedes y sé el mejor superviviente.</p>\n<p>Más de 20 personajes para desbloquear, pintorescos y amigables, algunos de los personajes que aparecen en el juego, los puedes encontrar en Twitter, mil gracias por acceder a aparecer en el juego. Muchos que seguramente te harán reír mientras juegas con sus cartas.</p>\n<p>En 6 Cards To Win, cada carta de monstruo tiene su propio escenario, por lo que cuando escapas del alienígena, ¡un fondo espacial te acompañará en la partida, la momia en sus pirámides o el vampiro en su castillo! Cada monstruo tiene su propio escenario.</p>\n<p>Banda sonora es original,  proporcionada por mi buen amigo Guillermo Cañete, una banda sonora relajante para lidiar con cartas de monstruos, escapar no tiene que ser estresante, o si?.</p>\n<p>También tiene estadísticas precisas, siempre sabrá los puntos que tiene,las partidas que has jugado, las que has perdido, las que has ganado, y también el porcentaje de victorias que tienes.</p>\n<p>Las partidas en 6 Cards To Win son cortas e intensas, cada partida dura aproximadamente un minuto, por lo que puedes jugar partidas rápidos en cualquier lugar, pero ten cuidado, después querrás otra más, y otra y otra ;)</p>\n<p>6 Cards To Win:</p>\n<p>- 15 monstruos para desbloquear<br/>- Vampiros, extraterrestres, momias, payasos, dentistas ... Nuestros miedos están representados<br/>- Más de 20 personajes para desbloquear y jugar con ellos<br/>- Gráficos bonitos y agradables<br/>- Para todas las edades<br/>- Fácil de jugar, es un juego de cartas<br/>- Partidas rápidas, divertidas e intensas<br/>- B.S.O por Guillermo Cañete<br/>- Estadísticas completas de todas tus partidas</p>\n<p>Si te gustan las cartas y los juegos de cartas, te gustará 6 Cards To Win, un juego ideal para partidas cortas en cualquier momento, donde cada carta y cada decisión pueden llevarte a escapar o ser atrapado por tus miedos.</p>", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-05-15T05:40:35", "background_image": "https://media.rawg.io/media/screenshots/0ee/0ee9b2f1eb18977c7074d82456c8e95d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ixel Games"], "genres": [], "publishers": [], "esrb_rating": null}