{"id": 44381, "slug": "solace-crafting", "name": "Solace Crafting", "name_original": "Solace Crafting", "description": "<strong>Distance based fantasy survival RPG</strong><br/>Focused on player freedom and personalization.<br/>48km view, crafting reinvented from scratch, limitless building, open classes, player built portals, creative fantasy freedom!<br/><br/>Warning! This game is currently in a pre-alpha stage of development aiming for a Q4 2017 early release.<br/>Warning! This game is currently under solo development. The developer may not be able to respond to all inquiries. Bugs, especially Unix and Mac specific may take days if not weeks to resolve.<br/>Please only purchase an early release copy if you are interested in helping fund development, helping to report bugs, or getting your opinion heard in regards to the game and the planned development route.<br/><br/>Customizable recipes, classes, and buildings are the heart of this \"Role-Playing Game\" where you're no longer just another hero with the same equipment as everyone else. In increasingly difficult boundless worlds, what combination of skills and equipment will keep you alive where other fail.Simple and Customizable Crafting and Professions<ul><li><strong>Every recipe</strong>, like Shortsword, is a customizable template with thousands of possible outcomes<br/></li><li>Customize level, rarity, resources used, color, and enchants across a wide variety of equipment shapes and designs<br/></li><li>Set enchants let you build sets to fit your character with only generic restrictions like one-handed weapon<br/></li><li>Level all professions freely, unlocking and upgrading the recipes and talents you want with no maximum levels<br/></li><li>No mini-games, no loading bars, no timers, no cross dependancy, and no sub-components</li></ul>Customizable Classes and Skills<ul><li>Unlimited player levels in an infinite multiverse of exponentially increasing difficulty<br/></li><li>Six adventure skill points, six attribute points, soul points and more every level<br/></li><li>Completely open, point and level based branching skill trees<br/></li><li>Upgrade any skill up to two points per level, with no maximum levels<br/></li><li>Add multiple support skills to your abilities, with millions of possible combinations</li></ul>Extreme Viewing Distance<ul><li>View over 48 kilometers (30 miles) in all directions from anywhere<br/></li><li>Boundless worlds let you decide when to move on to more difficult content<br/></li><li><strong>Build teleporters</strong> to connect everything, so you never walk the same path twice<br/></li><li>Spot special encounters, towns, and landmarks from very far away</li></ul>Player Buildings Made Easy<ul><li>Use your keyboard or mouse to control building placement from afar<br/></li><li>Responsive Building UI follows player movement for intuitive control<br/></li><li>Organized interface allows new content to be continuously added</li></ul>Soul, Facet, and Dimension Systems<ul><li>Create alternate characters in the same world or connect to alternate dimensions<br/></li><li>Level up your soul by completing achievements for special upgrades and unlocks<br/></li><li>Level up different builds to unlock soul-wide bonuses<br/></li><li>Crafting and harvesting levels, unlocks, and recipes shared across all facets<br/></li><li>Share your buildings, storage, and findings across all facets<br/></li><li>Shift dimensions to start anew or seek out specific content<br/></li><li>Shape and color your avatars freely instead of using preset races</li></ul><br/>This is creative outlet through gaming.<br/>Love to build? Love to adventure? Love to craft? Love to push the limits? Or just play it casual?<br/>Solace Crafting is the product of decades of the joy and misery we gamers are subject to every day.<br/>I've been there.<br/>I want it to be different.<br/>It won't be perfect, but it will be sincere.<br/>Never again do we need to see everyone using the same weapon or wearing the same armor.<br/>Never again do we need to see a castle crumble to the ground from fussy physics.<br/>I started out years ago specifically wanting to change the way games approach crafting and procedural content. Several years and many notebooks later it's all coming true. All I need now is your support!<br/><br/>Solace Crafting will be actively developed for years to come whether I have to keep my day job or not. My current goal is to somehow, someway, raise enough money or sales to quit my day job so I can actually make a dent on my gigantic todo list.Immediate Goals:<ol><li>Get a demo out to streamers, press, and Steam curators<br/></li><li>Raise enough money to go full time via Kickstarter or Steam Sales<br/></li><li>Spend the rest of my life developing Solace Crafting and it's descendants (unless Starfleet becomes a reality)<br/></li><li><strong>Continuously run events</strong> to incorporate community made icons, recipe ideas/models, enchants, buildings, etc.<br/></li><li>Make an attempt to encourage good sportsmanship and a positive attitude amongst game communities</li></ol><br/>* Multiplayer, and all of its many features will absolutely be implemented when full-time development becomes a reality. Multiplayer will be largely PvE in structure and grief prevention/anti-cheat will be our first priority. Until then or a until a solid beta build is released, the game will remain single player.<br/><br/>The best is yet to come!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:49", "background_image": "https://media.rawg.io/media/screenshots/5e8/5e8e6834b6219ac7eb6cc5d71ff515e4.jpg", "website": "http://www.solacecrafting.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 15, "toplay": 1}, "playtime": 1, "achievements_count": 62, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Big Kitty Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Big Kitty Games"], "esrb_rating": null}