{"id": 443966, "slug": "sumogun", "name": "Sumogun", "name_original": "Sumogun", "description": "Overview\r\n<p>Its Smash Brothers but a top-down shooter and a more interactive environment. <br/></p>\n<p>Note: This is a work in progress and we are open (not beholden) to suggestions that don't stray from the core vision. Also, consider that at some point after the core game is polished we want to add in-game networking. This will essentially allow an entirely different game mode between computers where FOV is possible along with individual cameras. Entirely new mechanics can and will be built around that at that point. Networking, FOV, modes, and mechanics would likely be seperate updates, one after the other.</p>\n<p>Check out the trello if you want an overview of where dev is: https://trello.com/b/imWIoVHL/sumogun</p>\r\nMechanics\r\n<ol><li>Match based game</li><li>Red and/or an extreme amount of damage will kill you<ol><li>Generally speaking, if a (not light) red object touches you, you are dead and if an object has red in it, it is dangerous.</li></ol></li><li>Bullets damage you but the screen edged does tons of damage<ol><li>Bullets do enough damage to drive up knockback but not enough to reliably kill</li><li>The edge of the screen can kill you quickly because it causes a huge amount of damage</li></ol></li><li>Bullets cause knockback proportional to your damage on contact<ol><li>The knockback builds up fast and will spike if you hit the edge of the screen</li></ol></li><li>You can pick up a variety of guns which have unlimited ammo but need reloading. In general guns can be charged to shoot an enhanced shoot that does a lot of damage but no knockback.<ol><li>Pistol: Shoots fast and accurate. Charged is more so.</li><li>Shotgun: Shoots 5 bullets in a spread. Charged narrows the spread and shoots further.</li><li>Taser: 3 shot burst fire that jams the targets gun for 20 seconds. Charged sends bullet that immobilizes as well.</li><li>Bigshot: Shoots large bullets that bounce around for a while.</li><li>Phaser: Shoots unpredictable bullets that can go through walls. No charge, autoshot.</li><li>SMG: Shoots really fast. No charge, autoshot.</li><li>Boomer: Shoots a remotely detonated concussion grenade.</li></ol></li></ol>", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-05-15T06:23:29", "background_image": "https://media.rawg.io/media/screenshots/899/8990751b6af7e6dc5eedbe5307c6b6dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LionFox"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}