{"id": 443903, "slug": "my-beautiful-paper-smile-demo", "name": "My Beautiful Paper Smile (Demo)", "name_original": "My Beautiful Paper Smile (Demo)", "description": "Welcome, dear child, to your new home.  Here you shall learn the art of perfection.  Here you shall learn to smile.\r\n\r\n---First two chapters are coming to Steam on June 19!---\r\nStory\r\n<p>My Beautiful Paper Smile is set in a dystopian world where a mad king wants every child to be perfect. Perfection to him is a giant, happy, smile that is worn constantly. <strong>Never fading and always bright</strong>.<br/><br/>You are one of the Joyous, a child taken by the Authorities, who has only ever known the facility and the mask that he wears bearing a smile that doesn’t dull. The Joyous are watched by the Authorities and kept on a short leash as they are tested daily to ensure no other emotions populate in their subjects' minds other than happiness.<br/><br/>If sadness sits on their face they are taken away and <strong>never seen again</strong>.<br/></p>\n<p>-------------------------------------------------------------------------------------</p>\n<p><strong><em>This demo includes half of the first chapter of My Beautiful Paper Smile.  The game takes place across four chapters. The first two chapters will be available to play on the Early Access Launch on June 19. The third chapter will release during early access and the final chapter will be available on full launch.</em></strong><br/></p>", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-05-15T06:09:01", "background_image": "https://media.rawg.io/media/screenshots/108/1087df30f9f31574998d32c10bf08884.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Two Star Games"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}