{"id": 44397, "slug": "button-bros", "name": "Button Bros", "name_original": "Button Bros", "description": "Button Bros is a two-player platformer puzzle-solving game. Players need to use limited resources to help their partner passing different laser obstacles. This two brothers are going share their weal and woe to complete a fantastic adventure by the lead of Mr. Bunny.<br/><br/><br/><br/><br/>Button Bros is a two-player platformer puzzle-solving game.So you can find a friend for some true local co-op couch fun. It would be more fun to having game together so you can pass the obstacles by changing the status of button to cover your partner. If you are a hardcore player for action game, then you probably need to spend more time on figuring out how to pass the mission. If you are not very good at play platformer, no worries! Those cool mechanism of die will teach you become the pro of jumping one day!<br/><br/><br/><br/><br/>Even though the game was designed for two people, we still have single-player challenge mode. You can control both characters simultaneously on your keyboard and complete the mission by your own or use controller play the single mode to get the single achievement ! By the way, you might need some help from your friends for those levels that are extremely difficult, LOL!<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>The prototype of Button bros was start from a project on a gamejam, and later then we developed the first prototype “The two buttons” based on the theme “two buttons” of lundum dare 34. And we began to love the game mechanism of passing the laser by covering each other and keep improving it during the past two years. We decide to release the Early Access version first so it would be easier us to collect feedback from our players so we can keep updating the game.<br/><br/>KEY FEATURES<ul><li>Local CO-CP challenge (online is coming soon)<br/></li><li>Special retro pixel style<br/></li><li>Available for two roles controlled at the same time by one player<br/></li><li>Hardcore gameplay<br/></li><li>5 chapter total 150+ levels<br/></li><li>Steam achievements, cloud saving and trading cards<br/></li><li> More secret levels that wait for your exploration</li></ul>", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2019-08-28T22:05:49", "background_image": "https://media.rawg.io/media/screenshots/b6f/b6f22543c9abb42c03d6d6f2845172a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11}, "playtime": 5, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Centrosphere Game"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Centrosphere Game"], "esrb_rating": null}