{"id": 444004, "slug": "bitcoin-bounce", "name": "Bitcoin Bounce", "name_original": "Bitcoin Bounce", "description": "<p>Do you want to win Bitcoin just by playing games? Download Bitcoin Bounce and you are entered into free prize draws everyday!<br/></p>\n<p>Win Bitcoin, learn how to use it and have fun along the way!</p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>Tap to land on the blockchain. Bitcoin will then bounce and you must time your tap to land again. The aim is to see how far you can get. Pick up POWER UPS to improve your score.</p>\n<p>Also collect the THNDR TICKETS. They count as an entry into a prize draw to win real bitcoin.</p>\n<p><strong>POWER UPS</strong></p>\n<p>• Lightning Bolt: Speed Boost</p>\n<p>• Shield: Protects Bitcoin</p>\n<p>• Wormhole: Transports you along the blockchain</p>\n<p>• Jumps: Land on them for a quick boost</p>\n<p><strong>THNDR TICKETS</strong></p>\n<p>Upon collecting THNDR TICKETS and accepting the prize draw terms and conditions, you will be in with a chance to win a prize of bitcoin via a prize draw.</p>\n<p>Winnings are paid out to a Bitcoin Wallet via the Lightning Network. You must have a compatible wallet to receive any winnings.</p>\n<p><strong>DISCLAIMER</strong></p>\n<p>PLEASE NOTE THAT APPLE INC IS NOT A SPONSOR NOR IS INVOLVED IN ANY WAY WITH THIS PRIZE DRAW. THE PRIZE DRAW PROMOTER IS SOLELY RESPONSIBLE FOR PROVIDING THE PRIZE IF WON BY AN ELIGIBLE ENTRANT. THE PRIZES WON ARE NOT PRODUCTS OF APPLE, NOR ARE THEY RELATED TO APPLE IN ANY WAY. THE RESPONSIBILITY OF ORGANIZING THIS PRIZE DRAW AND DISTRIBUTING THE PRIZES IS THNDR LTD RESPONSIBILITIES.</p>", "metacritic": null, "released": "2020-05-11", "tba": false, "updated": "2020-05-15T06:31:47", "background_image": "https://media.rawg.io/media/screenshots/df7/df75c1ac8fe3f95b62d11b069fa7b7df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["THNDR GAMES"], "genres": ["Action"], "publishers": [], "esrb_rating": null}