{"id": 444058, "slug": "the-room-i-wish-i-had", "name": "The Room I Wish I Had", "name_original": "The Room I Wish I Had", "description": "<p>This experiment is the fruit of pursuing  two questions, both from the quarantine:  <strong>How could I be free while being locked in?</strong> and <strong>What if my room would transform around me?</strong></p><p>Built in three weeks from March 30th to April 20th, this digital space holds many configurations of my room overlaid upon one another. Starting in my former room layout, you are free to explore the rooms as you see fit.  From there, there is a doorway to alternative versions of the space. These doorways lead to more rooms, filled with a mixture of me and my friends furniture. The four walls may remain the same, yet the rooms take on new identity with the objects inside. Even the objects themselves begin to feel refreshed when placed into different corners of the room. As I moved through my space, my single room transformed into many. </p>\n<p>This movement relieved me in a way, and helped me appreciate the space that I already had. I didn't realize how varied my space could be because I had become numb to a single version of it. The digital rearrangement helped me visualize both the possibilities that lay around me and within myself. If my room could change to suit me, then I could surely change myself to suit the now hostile world that surrounded me. The things on the inside always have potential. It is easy to miss that when the those things do not move, when the furniture is static.  Fortunately, it is just as easy to realize that potential. You just have to begin moving. It can be that simple.</p>\n<p>I hope some of that belief and the relief it gave me, comes across as you move through the space yourself. The final state of this remains in the experimental. The reality is both our actual and digital spaces take a lot of effort to change. There are only so many times I can physically move my bed, shelf, or desk.  But at least I can rest assured that here in The Room I Wish I Had, our movement is all that we need. </p>\n<p>The full documentation is here: https://medium.com/@jasonzhenli/making-the-room-i-wish-i-had-from-the-room-i-actually-have-bb8fa92fc87c</p>\n\n<p>Controls:</p>\n<p>W, A, S, D - move forward, left, right, backward</p>\n<p>Mouse movement - look around</p>\n<p>ESC - Open menu</p>", "metacritic": null, "released": "2020-05-11", "tba": false, "updated": "2020-05-15T06:43:30", "background_image": "https://media.rawg.io/media/screenshots/96b/96b49209c36b5eed47105369d1d974c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jason L"], "genres": [], "publishers": [], "esrb_rating": null}