{"id": 444133, "slug": "letters-in-the-gloom", "name": "Letters in the Gloom", "name_original": "Letters in the Gloom", "description": "<p><em>We were locked inside.\r\n</em></p>\n<p><em>We didn’t know what was happening, not truly. We knew not to go outside. We knew that it was dangerous out there. And we knew that we were alone in our horror. </em></p>\n<p>\n</p>\n<p><em>Until the letters started to arrive. Whatever strange miasma that lingered outside, invisible yet heavy, it allowed words to slip through. They appeared at doors or windows, in places you could reach without inviting it inside. </em></p>\n<p>\n</p>\n<p><em>If you threw a letter into it? It vanished. Reappearing somewhere else, for some other lonely soul to read. Who knew if it reached who you wanted. </em></p>\n<p><em>\r\nBut at least it reached someone.</em></p>\n<p>Letters in the Gloom is a multiplayer roleplaying game about souls locked apart while desperately seeking connection through letters. The writers create and receive letters which are sent into the Gloom, theorizing about what the Gloom is, talking about the past, their hopes, and their fears. The Gloom receives and sends letters, sometimes creating them itself, to add to a creepy atmosphere of being watched by an unknown entity. </p>\n<p>It requires one facilitator (the Gloom) at 3 or more writers. It is designed for social distancing, through play via snail mail, email, or chat servers. This game is in playtesting and will remain PWYW until its final release. </p>", "metacritic": null, "released": "2020-05-11", "tba": false, "updated": "2020-05-15T07:04:27", "background_image": "https://media.rawg.io/media/screenshots/e25/e25c3292f292cc2f6c6a932f04de24a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kate Bullock"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}