{"id": 444102, "slug": "astrosurge", "name": "Astrosurge", "name_original": "Astrosurge", "description": "<p>Astrosurge! For the ScoreSpace x 8 Bits to Infinity ~ Arcade Controls Jam</p>\n<p>Defeat waves of enemies, upgrade your ship per level, and collect enemy swarms for yourself for building cover, launch homing attacks or flak/shell explosions. <br/></p>\n<p>How to play:</p>\n<ul><li>Move left and right with arrow keys</li><li>Hold shift to shoot</li><li>Up and down arrow keys to navigate the shop</li><li>Press shift to purchase selected item</li><li>In the game over screen: up and down arrows to select a letter, shift to confirm selection</li></ul>\n<p>Upgrades:</p>\n<ul><li>FIRERATE + : Your gun/s will fire faster</li><li>GUNS + : Add another gun to your ship, firing two or three bullets at a time. Max of 3</li><li>CHOICES + : More things to pick from next time a shop opens</li><li>MISSILES + : Shoot missiles that explode, further upgrades increase fire rate</li><li>DRONES + : A tiny ship follows you around and shoots when you do, but slower</li><li>SWARM COUNT + : Increase max size of your swarm</li><li>SWARM: BULLETS + : Swarm turns into bullets when they get destroyed dye to swarm limit</li><li>SWARM: WALLS + : Swarm has a chance to build a barricade, blocking enemy fire. Further upgrades increase wall durability</li><li>SWARM: HOMING + : Swarm has a chance to turn into homing missiles that target the largest threat. Further upgrades increase damage</li><li>SWARM: FLAK SHOTS + : Swarm has a chance to turn into bullets that explode into more bullets. Further upgrades increase split amount</li><li>SWARM DROPS + : Enemies have a chance to drop two swarms instead of one, further upgrades increase this to 2 then 3.</li></ul>\n<p>Once you complete all the levels, the game will loop with lower level enemies swapped out for higher level ones, and enemies will be far more aggressive. </p>", "metacritic": null, "released": "2020-05-11", "tba": false, "updated": "2020-05-15T06:56:45", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbe8b491cf3fd255a294117f3c748321.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Uppernate"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}