{"id": 444247, "slug": "treasures-of-the-lost-caverns", "name": "Treasures of the Lost Caverns", "name_original": "Treasures of the Lost Caverns", "description": "Video: <p>Note: To play this game, you MUST have another person to play with! -- On the chance you do not connect with your friend, just refresh the page, and press play again, and you will connect! &lt;3</p><br/><br/>Kalorian Game Jam: Submission Info\r\nOverview\r\n<p>Treasures of Lost Caverns (TOLC) is a co-op, action-adventure dungeon crawler where players explore unique levels and gather loot to enhance themselves against the dangers of the deep dark. </p>\r\nHow to Play\r\n<p>Players have a top down camera view and a 3d humanoid character to control. The current keybinds are as follows:</p>\n<p>Use <strong>WASD </strong>to move your character.</p>\n<p><strong>Mouse Controls</strong> are:</p>\n<p><strong>Left Click</strong>: Interaction with objects</p>\n<p><strong>Right Click</strong>: Attack</p>\r\nObjectives\r\n<p>To play the game, you will start in the main menu where you have two map options. Select a map and you will be dropped into the scene. </p>\n<p>Once in the scene, you will explore about the level, battling enemies and locating treasure chests. Upon completing either option, loot particles will spawn on the ground for you to collect. Collecting the loot can yield cards that are put into the players’ inventory and can be used to give the players stats and abilities (Note: We couldn’t finish the implementation of cards due to issues with the networking and lack of database). </p>\n<p>To complete a level, a player has to kill a certain amount of enemies. There will be more than the assigned value so feel free to explore around the levels. </p>\n<p>To connect another user to your gameplay instance, /TODO</p>\r\nOutside Assets and Production Pipeline\r\n<p>Networking was facilitated based on the photon network. </p>\n<p>We took 32 free animation clips from Mixamo (https://www.mixamo.com/#/) and also used their auto-rigger in a few instances. Primary reasons were a lack of time to build all of them ourselves and poor results in dynamics with keyframe animation from scratch. We ended up using only a handful of them. </p>\n<p>In order to create the textures used, we utilized several photographs of surfaces (gravel, moss, grass) and bashed them together before filtering and modifying them (Gimp Oilify- and mosaik-filters among others). Those images have been drawn either from personal photographs or from Texture Haven (https://texturehaven.com/). </p>\n<ul><li>Gravel</li><li>Dry ground</li><li>Moss</li><li>Aerial grass</li></ul>\n<p>We use a couple of slightly modified icons which we got from https://game-icons.net/. See the graphic for the full list. </p>\n<ul><li>Rough Fabric texture from here: https://www.bing.com/images/search?view=detailV2&amp;ccid=oXR6C23d&amp;id=0620B85C56FC1FB306EE58E2376F385FF7263534&amp;thid=OIP.oXR6C23dUQpZbIDiRrn6rwHaFW&amp;mediaurl=https%3a%2f%2fthumbs.dreamstime.com%2fz%2frough-fabric-canvas-texture-pattern-background-use-as-38458914.jpg&amp;exph=939&amp;expw=1300&amp;q=fabric+rough+texture&amp;simid=608056300910218410&amp;selectedIndex=81&amp;qft=+filterui%3aimagesize-wallpaper&amp;ajaxhist=0</li></ul>\n<p>For our UI-sprites we used more pictures, which we drew directly from google image search before modifying them, similarly to the aforementioned textures. </p>\n<p>The audio used for this project was found at: https://assetstore.unity.com/packages/audio/music/orchestral/free-battle-music-pack-54023</p>\n<p>Our models were all handcrafted and animated in Blender, we used Gimp and Krita for creating image assets, we then added normal and height maps using Materialize. The game was built in Unity 3D. </p>\n<p>If there are any questions, more details can be provided upon request via Discord.</p>\n<p>Steeldeal#1420</p>\n<p>Lithex#7937</p>\n<p>Zeel#0585</p>\r\nRoadmap of Future Updates\r\n<p>Currently, players are able to connect to an instance (up to 2), fight enemies, loot items in the form of trading cards, and adventure through two handcrafted levels (the mountain forest and the catacombs underneath the cathedral). Due to technical limitations (lack of a database, shortage of time) we couldn’t fully implement the trading card mechanic, so players cannot save and thus not swap out the cards they find. However we were able to establish an engaging and entertaining gameplay loop across matches that we will continue to implement. </p>\n<p>In future updates we want to include the following features: </p>\n<ul><li>Within the trading card system, we are planning on cards picked up to be saved for future use, so the players maintain a build long term. Even if you run with different people in different matches, the cards you pick up are the cards you earn and can use anytime! Some of them will be permanent (weapons and armor, stat upgrades and customization cards), others will be consumables (spell cards, potions). </li><li>Trading of cards between players: Cards that are found in the level can be accumulated and traded between players. This will be facilitated either directly in the aftermath of a game or through an external marketplace. Implementation in this build failed due to the lack of an adequate database, so we could not save the items to trade them. </li><li>More and also more complex trading cards:</li><ul><li>Consumable magic spells</li><li>Consumable items (potions, temporary buffs and debuffs)</li><li>Higher tier equipment (armor, weapon, drop chance modifiers)</li><li>Vanity cards for aesthetic changes to the character</li><li>Customization cards to change the experience (e.g. change of ambiance soundtrack)</li></ul><li>Fights against larger and more terrifying enemies. The rigid time limit of the jam didn’t allow for tremendously complex models or animation patterns on non-humanoid creatures. </li><li>Various events and modifiers to matches in order to improve drop chances and add interesting twists to the matches. Our plans so far include:</li><ul><li>Higher difficulty</li><li>PvP battles for the enemy’s trading cards</li><li>Challenge runs (time limits, card limits)</li></ul><li>Players will gain the ability to craft cards from complex patterns and crafting resources (both found during matches) which will allow players to create cards they can keep or sell on the global exchange market. This will help keep the loot system less focused on just gold and cards and help to define an economy in which experienced players can provide higher tier cards for newcomers.</li><li>Stronger networking to allow groups of up to 4 players to take on tougher dungeons and bosses together.</li><li>Leaderboard events to allow players to compete against each other in a variety of challenge based events (fastest time, most kills in less than a minute, etc,) and earn prize cards that way. </li><li>Player vs Player combat in arena settings and with cards dropping at random points in the map. </li><li>More abilities and cards to extend the players abilities and game experience. </li><li>Cosmetic cards and characters that players can unlock/earn/trade.</li><li>Long term we want to include a level builder which will allow players to build their own levels for others to play on and to inspire friendly competition among the player base. Note that gold, cards, and resources cannot be earned but creators can define what cards a player can use or pick up in the level editor. </li><li>Community contests  for level creators to allow them adding their own content to the official campaigns and become part of the continuous development process. </li></ul>", "metacritic": null, "released": "2020-05-11", "tba": false, "updated": "2020-05-15T07:29:19", "background_image": "https://media.rawg.io/media/screenshots/e0d/e0d750344050d967b32a17cd5bb07094.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LithexProductions"], "genres": ["Action"], "publishers": [], "esrb_rating": null}