{"id": 44424, "slug": "nation-warchronicles", "name": "Nation War:Chronicles", "name_original": "Nation War:Chronicles", "description": "Unify the ancient China with your army and economic power<br/><br/>The Grand Strategy with Real Time Strategy unit control game gives you control of a vassal state in ancient China to guide through the years in order unify the ancient China.  Trade, warfare and diplomacy will be brought to life in this title with rich strategic and tactical depth.<br/><br/>The story is takes place at in the age of BC 700 in China, the powerful Western Zhou Dynasty was destroied by the babarians because of internal conflicts and betrayal.With the  help of the Emperor of Qin, Zhou moved its captial to the east. With the Zhou Dynasty perishing, the vassal states came to power. You will choose a vassal state to play, and you  will unify the ancient China.<br/><br/>Main Features:<br/>Make your own decisions<br/>Build and develop your nations in the way you want.<br/><br/>Build your own army<br/>Build a powerful army, of different strenths, to demolish other nations.<br/><br/>Experience history<br/>The great personalities of the ancient China are on hand to support you as you make your mark on history.<br/><br/>Turn the ancient China into your playground<br/>Enjoy many years of gameplay in a map with dynamic seasonal effects.<br/><br/>Bring out your negotiating skills in a deeper diplomatic system<br/>Use royal marriages and support for rebels and explore the possibilities of many other diplomatic actions.<br/><br/>Nations<br/>We have more than 50 nations for you to play.<br/><br/>Regimes<br/>There are 13 regimes in the game. Different regimes have different strengths and weaknesses.<br/><br/>Officials<br/>It is important to hire the right people to manage your nation. We have 12 positions for you to hire officials.<br/><br/>Diplomacy<br/>The diplomacy system in the game are sophisticated, with actions like Millitary Alliance, Royal Marriage, and Trade Partner.<br/><br/>Economy<br/>You can change the current tax rate, as well as the grain tax rate, and change the maintenance costs of the army and the castle.<br/><br/>Religion<br/>We have many religions in history, such as:Taoist,Confucianism,Legalists, and Mohist.<br/>Different religions have different buff addition, when the player has resources he can become the Guradian of Religion.<br/>Through missionary, to enhance the unity of religion, the higher the unity of religion, the more benefits to the country.<br/>You can also make sacrifices to many Gods in the game. There are successes and failures, successful scarifice will bring you good reward.<br/><br/>", "metacritic": null, "released": "2017-09-29", "tba": false, "updated": "2019-08-28T22:05:48", "background_image": "https://media.rawg.io/media/screenshots/a13/a1392caedd1fc644bdb6ea1efc29c7f7.jpg", "website": "https://tieba.baidu.com/f?kw=%E5%9B%BD%E6%88%98%E5%88%97%E5%9B%BD%E5%BF%97%E4%BC%A0&amp;fr=wwwt", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Shanghai Yi Ming Network Technology Co"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Shanghai Yi Ming Network Technology Co", "Shanghai Yi Ming Network T"], "esrb_rating": null}