{"id": 444385, "slug": "bread-kittens", "name": "Bread Kittens", "name_original": "Bread Kittens", "description": "<p>Take a journey into the world of Catlandia where innocent kittens are being brainwashed by the evil ChowCorp and held from their free will! Save and collect as many kittens as you can by breading them, travel through each region to find unique kittens, and bake delicious bread to wear on your cat to help in battles!</p>\n<ul>\n<li>Collect tons of RARE and UNIQUE kittens in every region!  </li>\n<li>BREAD your favorite cat breed and try not to laugh!  </li>\n<li>Unlock BREAD RECIPES to make your kittens STRONGER!  </li>\n<li>Enjoy the BEAUTIFUL HD art and animations!  </li>\n<li>Capture and NAME your own kitten!  </li>\n<li>LEVEL UP your kittens to prepare for boss battles!  </li>\n</ul>\n<p>Only YOU can help and save them all from ChowCorp! Kittens are waiting!</p>\n<p>FEATURES<br />\n- FREE TO PLAY!<br />\n- Play with your favorite kitten and rescue MANY more into your collection<br />\n- Fun, easy to play, and entertaining for all ages<br />\n- Beautiful HD art and animation to capture the experience<br />\n- Train your team to beat your opponents<br />\n- Earn TONS of achievements and earn in-game rewards<br />\n- Unlock NEW recipes to bread your kittens and give them a boost in battles!<br />\n- Each kittens has unique attack, health, and speed stats<br />\n- Capture all the Rare and Unique kittens to make your team undefeatable</p>", "metacritic": null, "released": "2012-11-21", "tba": false, "updated": "2020-05-17T06:28:51", "background_image": "https://media.rawg.io/media/screenshots/30d/30d5f8ce7d42383cc61277275f197999.jpg", "website": "http://bake450.melwang.com/games/bread-kittens/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": [], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}