{"id": 44434, "slug": "code-7", "name": "Code 7", "name_original": "Code 7", "description": "<strong>Play Episode 0 for free!</strong><br/><strong>This is an episodic game and doesn't feature all the episodes, yet. The season pass includes all five episodes. Every episode will be available for download upon release.</strong><br/><br/>What would you do if you found yourself trapped on an eerie space station with nothing but a computer? Play as the hacker Alex and save the world from your keyboard as a sinister A.I. rises from the corner of the universe... but you are not the only one who acts from the shadows. Monsters lurk in the dark and soon humanity itself is in danger. When analog and digital worlds collide, only a master of both can survive.<br/><br/>Code 7 is a text-based game in which your imagination is the stage. The things unseen are the most terrifying ones... travel the network, gather information from e-mails, documents, and logs, hack protected computers, and navigate your partner through dangerous situations. Work together, gain their trust and make the right choices. The outcome of the story is determined by how you act and what you say.<br/><br/>Episode 0: <strong>Released</strong><br/>Episode 1: <strong>Released</strong><br/>Episode 2: In Development<br/>Episode 3 &amp; 4: TBAKey Features:<ul><li>A Text Adventure you can listen to: Fully voiced dialogue, music, and sound effects<br/></li><li>Be a Hacker: Use the terminal-based LupOS system and hacking techniques like Man-in-the-Middle Attack, Brute Force Attack, Network Jamming and more<br/></li><li>Power of Words: Beware what you answer and the choices you make, they will determine the course of the last episode</li></ul>", "metacritic": null, "released": "2017-08-11", "tba": false, "updated": "2019-08-28T22:05:48", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fc2b969c09f0204efa522595786cdf8.jpg", "website": "http://www.code7-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 19}, "playtime": 2, "achievements_count": 40, "ratings_count": 1, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Goodwolf Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Goodwolf Studio"], "esrb_rating": null}