{"id": 444434, "slug": "a-spreadsheet-that-is-also-a-date", "name": "A spreadsheet that is also a date", "name_original": "A spreadsheet that is also a date", "description": "<p><strong>What is this game?</strong><br/></p>\n<p>This work is a lyric game, that I guess is technically maybe a video game because it's all digital? But also you play it via a spreadsheet so it's a pen and paper game kinda? But you don't roleplay, you're just yourself, so it's more of a generator? Maybe this is just a set of instructions? And you follow the instructions by yourself but then go on the actual date with another person, so ti's both one player and then multiplayer?</p>\n\n<p><strong>Actually nevermind.</strong><br/></p>\n<p>Fuck, categorizing things is hard and also doesn't matter. Use this to generate a date that happens inside a spreadsheet. Follow the instructions in the sheet labeled \"SETUP INSTRUCTIONS\".</p>\n<p><strong>How to play</strong><br/></p>\n<p>This is intended to be played via Google Sheets, Airtable, Ethercalc, or a similar tool that allows you to collaboratively and remotely edit a spreadsheet at the same time as someone else. This is designed to require horizontal and vertical scrolling, and works just fine on small devices.<br/></p>\n<p>An embedded version of this spreadsheet is available in this page, and you can also view it directly on Google Sheets so you can easily make a copy in your own Google Drive. There is also a downloadable version available.<br/></p>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-18T02:22:40", "background_image": "https://media.rawg.io/media/screenshots/8ef/8ef8c14a1955f02d9d147d40461a2691.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC", "macOS", "Linux", "Android"], "developers": ["Fen Slattery"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}