{"id": 444409, "slug": "death-park-scary-horror-clown", "name": "Death Park: Scary Horror Clown", "name_original": "Death Park: Scary Horror Clown", "description": "Got fed up with film producers shooting the same horror stories all the time? Your favorite characters always die in the first fifteen minutes, don’t they? We do feel you can hardly contain your indignation, and that’s the reason why we made a cool horror game app, where all the players find themselves in an abandoned amusement park. <br/>The main goal of the game is to get out of this Death Park alive, exploring its dilapidated buildings, fearful hospitals, scaring cellars and escaping mysterious mazes. All the lost-ones will have to solve interesting puzzles and unravel secrets of different objects in order to understand the history of our horrible theme park and find a way out. But… Houston, we have a problem! It won’t be as easy as you think! <br/>The main frightening element of this horror game, the real evil and just a miserable psychopath (did you recognize yourself? :D) is a nightmare clown who wants to quarter your body or kill you in any other way. Of course, he will not constantly follow you on his heels: be careful and do not make much noise, use various shelters and furnishings to hide from the parody of Pennywise the Dancing Clown. You have to become a dodger to move quietly and to be invisible, otherwise you’ll see him face to face! Our Pennywise isn’t as handsome as Bill Skarsgård, so it’s better not to tempt fate and calculate every single step.<br/>“Death Park” has the following features that will definitely not leave you indifferent:<br/>- Firstly, this game has several endings. All your decisions and actions will directly influence the outcome, and if you really want to know the whole story of our terrible clown, why he became so wild and crazy, then try to calculate the steps and open all possible endings. Believe me, your surprise from our story will be no less than from Joker’s biography!<br/>- Secondly, puzzles in this game are really brainstorming. To be honest, “Death Park” is not a story about the raids of monsters and other stranger things, but primarily a game where you need to use your brain in extreme situations. Thus, this horror game is perfect for nerds haha (just kidding). <br/>- Thirdly, our horror game should appeal to those who, in principle, is fond of scary games, because the gameplay is extremely intense, and the atmosphere shakes the nerves with sudden screamers.<br/>- Fourth, we recommend you to play with headphones on to maintain healthy relationships (we hope you have a good relationship :D) with your family members or people in public transport.<br/>Remember that our terrible clown is smart and dangerous, that you have to hide from him in 7 different locations and that you need to be a mentally resistant player to get to the end!<br/>If you have any wishes or great ideas how to improve our horror game - just write to us!", "metacritic": null, "released": "2019-10-02", "tba": false, "updated": "2020-05-18T02:15:43", "background_image": "https://media.rawg.io/media/screenshots/7c0/7c047e550c76ab38569d50049da53c91_9YV4Hvm.jpg", "website": "http://euphoriagames.ru", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Anton Nazarov"], "genres": ["Action", "Adventure"], "publishers": ["Anton Nazarov"], "esrb_rating": "Teen"}