{"id": 444411, "slug": "space-pioneer-full-gear", "name": "Space Pioneer: Full Gear", "name_original": "Space Pioneer: Full Gear", "description": "The Full Gear Edition of the critically acclaimed top-down shooter Space Pioneer, gives you:<br/><br/>- An epic solo adventure. Experience the full solo campaign of Space Pioneer, with all equipment, classes, weapons and skills unlockable via progression.<br/><br/>- Entirely playable offline. Play anywhere, anytime. Once the game is downloaded, you can shoot aliens with wifi and data completely off, no problem.<br/><br/>- No ads and no in-app purchases. Play how you want. The Full Gear Edition is a true paid game: once you install it, everything is available to you… well, provided you’re good enough to play that far.<br/><br/>- No timers or daily grind. Play when you want. There are no dailies, no chest openings, no upgrades on a timer, no energy systems. Alien stomping only follows one schedule: yours.<br/><br/>- An improved pacing. This time around, you’re starting the space adventure with some resources to reach the apex of the shooting legends faster: 10,000 bonus coins.<br/><br/>And all the classic features of the Space Pioneer shooting experience:<br/><br/>Explore the galaxy as an intergalactic alien shooter in the newest action war game. Discover new planets, chart interstellar worlds and exterminate any invaders that stand in your way using the latest weapons in this twitchy top-down shooter. Contains all updates to date.<br/><br/>Discover new galaxies and explore incredible worlds with unique biomes, from the icy tundra to red Mars or lush green jungles brimming with intergalactic flora. Defeat enemies at every turn in this thrilling alien shooter war game and get unlimited power!<br/><br/><br/>Fast top-down shooting action will test your combat reflexes and tactics to the max. In this action war game, you will never let your guard down!<br/><br/>The endless universe has countless hostile galaxies to explore &amp; turn into a space shooter. Combined with a dynamic invasion objectives system, the gameplay is truly infinite in Space Pioneer – the perfect space odyssey!<br/><br/>Get even more firepower for your machine gun, shotgun and other space shooter to hunt some alien games in this action shooting game! Earn loot to upgrade the weapons and gear including gun turrets, rifles, blasters and mines. Unlock dozens of space shooter combat skills to give you the fighting edge.<br/><br/>From aggressive robot invaders and giant mechs to venomous Mars hornets, battle space bosses, each with unique offensive and defensive capabilities including reinforced shields and powerful beam blasts.<br/><br/>Recover stolen disks, defend probes, repair crashed craft and complete missions to earn loot and unlock co-op games rpg gear and skills. Every time you play, missions have new objectives, invaders and endless top-down shooting action.<br/><br/>By downloading the game you accept our games End User License Agreement, Terms of Service and Privacy Policy: http://support.vividgames.com/policies<br/>Contact us anytime at support@vividgames.com", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-05-18T02:16:29", "background_image": "https://media.rawg.io/media/screenshots/a82/a82ef92885bdab2b1d16982019cc4e59.jpg", "website": "http://vividgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vivid Games"], "genres": ["Action", "Adventure"], "publishers": ["Vivid Games"], "esrb_rating": "Teen"}