{"id": 44468, "slug": "demolish-build-2018", "name": "Demolish & Build 2018", "name_original": "Demolish & Build 2018", "description": "Your company is going global. Use big machines to demolish huge buildings or go close and personal and use your hammer.<br/>Buy land properties, upgrade your machines and hire workers in different parts of the world.<br/><br/>- Various construction and demolition machines<br/>- 4 different world locations with open sandbox<br/>- Hire and manage workers<br/>- Specialized hand tools<br/>- Finish contracts or use your machines to gather resources and earn cash<br/>- Invest in your own properties<br/>- Manage your company and make sure it's rating goes up <br/><br/><strong>Available machine types:</strong><br/>Front-end Loader - jack of all trades<br/>Demolition robot - great machine for precise demolition<br/>Tower Crane - deliver your materials to normally unreachable spots.<br/>Bulldozer - this heavy machine is great for demolition of small structures, as well as trampling vegetation and flattening terrain.<br/>Skid Loader - a small, but awesome machine. It can dig, demolish and carry loads. Just attach the required part to do the job.<br/>Track Excavator - to do serious digging or demolition, attach a specific tool to the excavator arm.<br/>Wheeled Excavator - smaller version of excavator for different situations<br/>Road Roller - useful for compacting sand and asphalt roads.<br/>Pickup Truck - perfect to drive between contract locations.<br/>Dump Truck - perfect for delivering sand or metal scraps.<br/>Crawler Crane - comes with a wrecking ball, no structure will stand a chance against it.<br/>Concrete Mixer Truck - if you need to pour some concrete on your construction site.<br/>Cargo Truck - designed to carry wood, bricks and concrete segments to construction sites.", "metacritic": null, "released": "2020-01-15", "tba": false, "updated": "2020-12-16T14:12:40", "background_image": "https://media.rawg.io/media/screenshots/619/6191ce4c38ae94d3aef500d56b45c52f.jpg", "website": "", "rating": 3.18, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 188, "beaten": 3, "toplay": 2, "dropped": 2}, "playtime": 3, "achievements_count": 25, "ratings_count": 11, "suggestions_count": 507, "game_series_count": 0, "reviews_count": 11, "platforms": ["Nintendo Switch", "PC"], "developers": ["Ultimate Games", "Noble Muffins"], "genres": ["Simulation", "Indie"], "publishers": ["Ultimate Games"], "esrb_rating": "Everyone"}