{"id": 444662, "slug": "samurai-anki", "name": "Samurai Anki", "name_original": "Samurai Anki", "description": "<p>This game is a proof of concept of a learning game. \"Anki\" is the Japanese word for \"memorization\". Anki is also software to learn things based on memorization. <br/></p>\n<p>In this game you are a samurai duelling some enemy. You are given kanjis and three possible answers, you must choose the correct one to deal damage to the foe.</p>\n<p>This game is in early stages of development. What I want to have on the release is:</p>\n<ul><li>Over 100 kanjis. The most basics ones based on the \"Nihongo nōryoku shiken\" N5 (beginner).</li><li>Three different levels with unique enemy models.</li><li>Savegame capabilities.</li><li>Train the game with the answers so it gives the player the kanjis that are the most difficult to the player.</li></ul>\n<p>What I have learned while developing this proof of concept?</p>\n<ul><li>C# events using delegates.  Using this pattern you can decouple more your components, making it easier to add new functionality and refactor existing one.</li><li>Unlit shaders. I have used a very restrictive palette of 5 colors. With the fog and some post-processing I have achieved some gradients and I find the overall aesthetic pleasing.</li><li>Sounds are a very powerful tool to give feedback to the player and give weight to the characters. The sounds are based on Kung Fu movies from the 70s and 80s.</li></ul>", "metacritic": null, "released": "2020-05-17", "tba": false, "updated": "2020-05-18T03:11:02", "background_image": "https://media.rawg.io/media/screenshots/a46/a464f7dafe2d8021ca0f43682cb13e5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["numian"], "genres": ["Educational", "Fighting"], "publishers": [], "esrb_rating": null}