{"id": 444629, "slug": "deck-decks", "name": "Deck Decks", "name_original": "Deck Decks", "description": "<p><em>The two toughest pirate gangs in the seven seas, the Red Raiders and the Blue Buccaneers, have a fierce rivalry which has persisted for years. But disputes are settled differently in these waters. Instead of fighting with cannons and swords, they fight with cards!</em></p>\n<p>This game is written in Python with Pygame, and all art is by me (you can tell). It was made for the Chip 'N Jam 48-hour game jam, so it's a bit buggy and the code isn't great.</p>\n<p><strong>The Rules</strong></p>\n<p>You play as the captain of the Red Raiders. To win, you must gather 50 gold before your opponent. If they gather 50 gold before you do, you lose!</p>\n<p>At the start of the game, each player draws 5 cards from their 30-card deck. At the start of each turn (except the first turn of the game), the turn player draws one card.</p>\n<p>Each card in your deck represents one of your crewmates, and you can play one crewmate per turn. Furthermore, each crewmate can take one action per turn - it can either move, or it can attack.</p>\n<p>A crewmate can move one space to its left or one space to its right, even if the chosen space is occupied by one of your other crewmates - in this case, the two crewmates swap places, and the second crewmate's action for the turn is not consumed (so a crewmate can even swap places with another who has already acted this turn).</p>\n<p>Instead of moving, a crewmate can attack. A crewmate can only attack an enemy crewmate if they are directly opposite each other in the same column - so movement is important. Furthermore, a crewmate can only attack if its attack value (bottom-left, red) is higher than the target's defence value (bottom-right, blue).</p>\n<p>When your crewmate attacks, the target enemy crewmate will be removed from the board, and you will be granted gold equal to the enemy crewmate's value (top-right, yellow).</p>\n<p>If a player has no crewmates on the board during their opponent's turn, the opponent can directly attack the player. In this case, the attacking crewmate steals an amount of gold from the targeted player equal to the attacking crewmate's attack value. If the targeted player doesn't even have that much gold, they will just be robbed of whatever gold they do have. Either way, the amount of gold lost will be added to the attacking player's gold value.</p>\n<p>And that's all! The first to 50 gold wins - have fun! </p>", "metacritic": null, "released": "2020-05-17", "tba": false, "updated": "2020-05-18T03:04:41", "background_image": "https://media.rawg.io/media/screenshots/95d/95d1e3f0d8ebddcb85b882a5d521a608.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lukeshorejones"], "genres": [], "publishers": [], "esrb_rating": null}