{"id": 44464, "slug": "sky-knights", "name": "Sky Knights", "name_original": "Sky Knights", "description": "WHAT IS SKY KNIGHTS?<br/>Sky Knights is an action-packed online multiplayer dogfighting game. Enjoy thrilling head-to-head <strong>aerial combat in 4 vs 4 team fights</strong> and outmaneuver opponents with tricks and well-timed afterburner boosts. The goal of the team battles is to take out the enemy bases. This must be done while fighting off the enemy players. You will also need to carefully manage your ammo and fuel supply. Rearm and refuel by performing skillful landings in the home base. To be successful, your team must perfect a balance between attack and defense; engage the enemy in combat while supporting your allies in the air as well as on the ground. <br/><br/>Tactically choose the fighter jet to fit your play style and your team’s needs. There are six different aircraft - ranging from the F-16 to the A-10 Warthog - each offering their unique weaponry, stats, strengths and weaknesses. You can further customize your pilot profile with one of eight avatars, and level up to unlock more than 15 aircraft upgrades, six permanent traits and countless visual aircraft customizations.<br/><br/>Sky Knights is made by Hampus Bankler, an ex-military fighter jet mechanic and professional game developer. Before combining his two passions into creating Sky Knights, he worked on games like Bionic Commando: Rearmed 2, Angry Birds 2 and is currently also involved in Project Wight. <br/><br/>FEATURES<ul><li> Compete in fast-paced 4 vs 4 online multiplayer dogfights <br/></li><li> Fight in multifaceted objective-based team battles. Take out the enemy bases while combating other aircraft and ground forces<br/></li><li> Manage ammo and fuel and restock them after performing skillful landings in the home base <br/></li><li> Master different aircraft types with unique strengths and weaknesses - from the F-16 to the A-10 Warthog<br/></li><li> Skillfully use your full arsenal including machine guns, heat-seeking missiles, bombs and more<br/></li><li> Level up and unlock over 15 aircraft upgrades and six permanent traits to tailor your aircraft and character to your playstyle <br/></li><li> Personalize your pilot profile with eight different avatars and unlock countless visual aircraft customizations<br/></li><li> Discover plenty of tricks to get the upper hand in battles</li></ul><br/>", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2019-08-23T12:12:21", "background_image": "https://media.rawg.io/media/screenshots/137/1373b9a3a868731e3fbad9a66af9ee38.jpg", "website": "http://www.skyknights-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "toplay": 1}, "playtime": 1, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hampus Bankler"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Hampus Bankler"], "esrb_rating": null}