{"id": 44461, "slug": "omegaland", "name": "Omegaland", "name_original": "Omegaland", "description": "Omegaland is a cute, simple platformer inspired by the classics.<br/><br/>Princess Omega has lost the five magical keys that open her castle - only you can help her! Explore the Flower Kingdom, from the icy island of Eisland to the hot desert of Sandkuchen Island, meet colourful creatures... and jump on their heads. Collect coins, purchase upgrades, and discover secret treasures on your heroic quest! After all, helping princesses is what heroes do. What could possibly go wrong?Features<br/><ul><li>    25+ levels!<br/></li><li>    3 regions to explore in the order you prefer!<br/></li><li>    5 castles to plunder!<br/></li><li>    Many secrets to discover!<br/></li><li>    Treasure! From sacks of coins to big ol' chests, there's plenty to find!<br/></li><li>    Lots of achievements!<br/></li><li>    Collect coins and buy upgrades from wizards!<br/></li><li>    Visit the crazy hermit's shopping mall in Hermit Hollow!<br/></li><li>    Face the challenge of Tiny Hill!<br/></li><li>    And be prepared for few surprises along the way...</li></ul>Credits<br/>Written and designed by Jonas Kyratzes (The Talos Principle, The Sea Will Claim Everything, Alphaland), with graphics by Verena Kyratzes (The Sea Will Claim Everything, Serious Sam 4).Gameplay<br/>The gameplay consists of classic platforming, but is more relaxed than other games in its genre. Exploration is encouraged, and the levels are full of secrets. There is no timer forcing you to move quickly, and you don't always have to move forward.<br/><br/>You explore the world using the map, so you can play the levels in a large variety of orders. Not all levels have to be played, but all of them contain stuff to find. There are also safe areas like the village of Happy Hill Homes, the Caravanserai in the desert, and the crazy hermit's shopping mall in Hermit Hollow. There you can talk to the locals and purchase upgrades like Extra Hearts or Double Jump Boots.", "metacritic": null, "released": "2017-07-12", "tba": false, "updated": "2019-08-28T22:05:47", "background_image": "https://media.rawg.io/media/screenshots/4c7/4c797120711ac47befae023118ed3fff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 132}, "playtime": 2, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jonas Kyratzes"], "genres": ["Casual", "Indie"], "publishers": ["Jonas Kyratzes"], "esrb_rating": null}