{"id": 44474, "slug": "daath-origins", "name": "Daath Origins", "name_original": "Daath Origins", "description": "Classic turn based RPG gameplay combined with a dark interdimensional space opera... with some twists thrown in for good measure.  <strong>Dᴀᴀᴛʜ Oʀɪɢɪɴѕ</strong> features HD graphics, programming, story and a 31 song original soundtrack... <strong>created by a single person</strong>.<br/><br/><br/><ul> <li> A giant galaxy to explore, broken down into 36 sectors<br/> </li><li> Over 500 handcrafted planets to explore in space, in-orbit, on the \"surface\" (or just send an away team!)<br/> </li><li> Command your away teams, level them up, invade ships &amp; explore sites of interests across the multiverse<br/> </li><li> Spatial anomalies that bend time &amp; space, transport you across the galaxy, or even into alternate dimensions<br/> </li><li> Your actions change how the rest of the galaxy perceives you: with good, neutral, and evil alignments<br/> </li><li> Multiple factions to join or to destroy, with devastating consequences for the rest of the galaxy<br/> </li><li> Promote a skilled crew member each time you level up, but don't let them mutiny later based off of your actions<br/> </li><li> When battling enemies, you have the ability to target specific systems such as Life Support or Main Power<br/> </li><li> Over 75 unique quests created by the developer, with another 20+ respawning random quests for good measure<br/> </li><li> Tons of post \"main quest\" content, and a lore friendly New Game+ to play once you're ready<br/> </li><li> Epic \"Ultra Bosses\" and tons of hidden items and secrets for the discerning role player<br/> </li><li> Collect and mine resources, which can be Atom Printed into weapons, armor, and items for your starship<br/> </li><li> 26 main crew members, including 9 Executive Officers to help in your journey<br/> </li><li> 26 playable classes bring divergent content, bonuses and story branches from the very start!<br/> </li><li> and more...</li></ul>", "metacritic": null, "released": "2017-08-15", "tba": false, "updated": "2019-08-28T22:05:46", "background_image": "https://media.rawg.io/media/screenshots/692/69235d5d097426b9b9f32857cda46c2b.jpg", "website": "https://blacklodgegames.com/games/daath-origins/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 2, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BLACK LODGE GAMES"], "genres": ["RPG"], "publishers": ["BLACK LODGE GAMES"], "esrb_rating": null}