{"id": 445000, "slug": "arcane-city-mythos", "name": "Arcane City: Mythos.", "name_original": "Arcane City: Mythos.", "description": "It all starts here!\r\n--------------------------\r\nThe stars were not right, but a vicious enemy wanted to make them that way.\r\n<p>A young man - 'Chris Saffron', is a normal high schooler, other than the terrifying dreams that haunt his psyche. A strange entity - made of orbs with tortured faces on them, and a frightening girl - lurk within his nightmares.<br/></p>\n<p><em>(NOTE: There's an unfixable bug - only the first 'save' slot works - and it only works ONE TIME - so use it right before the second series of choices as the game may crash shortly afterwards!)</em></p>\n<p>This is the original, imperfect visual novel that I started on over 2 years ago. It was supposed to be the first in the series and was the inspiration for the backdrop of all of the 'Arcane City' and 'Dark Eroda' Content that came afterwards. All of the others were made to revolve around it, and now it is here - presented in it's strange, weird format - with a story that involves the characters you know (and don't know,) and body-horror terrors from the Lovecraft Mythos that will launch you into a shattered mind!<br/></p>\n<em>Featuring music from Monkey Grip, Freezepop, The Michael J Epstein Memorial Library, and Night Kisses!</em>\n<p>It isn't perfect, and - for humor - I've left the original art in (mostly) and you can see how the 'look' evolved over time as I worked on it. The main thing here is the story content, but I hope the 'look' is satisfactory :-)<br/></p>\n\n<p>(A Lovecraft Mythos Tale. 18+ for body-horror, guro, erotic overtones, and language that would make our friends at Nitroplus and Clockup blush.)<br/></p>\n\n<p>ENJOY! - Mr. C.</p>", "metacritic": null, "released": "2020-05-16", "tba": false, "updated": "2020-05-18T04:23:33", "background_image": "https://media.rawg.io/media/screenshots/823/8236ebbfb635083dcac6949ec7578d55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Arcane City Game Studios"], "genres": [], "publishers": [], "esrb_rating": null}