{"id": 44501, "slug": "hypernova-escape-from-hadea", "name": "HYPERNOVA: Escape from Hadea", "name_original": "HYPERNOVA: Escape from Hadea", "description": "Do you like <strong>RTS </strong>games? How about tower defense, is that your cup of tea? Then make sure to play <strong>HYPERNOVA</strong>.<br/>In this exciting new mélange of <strong>RTS </strong>and <strong>TD</strong>, an alien planetary system is in danger. Its huge star <strong>Naidira </strong>is becoming increasingly unstable. Realizing that it is only a matter of time before an apocalyptic hypernova explosion destroys their entire planet <strong>Hadea</strong>, the <strong>Scynthians </strong>devise a plan to escape their world and rebuild their civilization elsewhere in the galaxy. Their salvation lies in an interstellar teleportation device. Unfortunately, the raw materials required to build and power up such a device have long been depleted on <strong>Hadea </strong>due to centuries of overpopulation.<br/><br/>The only place where they can gather more of these elements is on Hadea’s moon, <strong>Haya</strong>, an inhospitable world with a toxic corrosive atmosphere and inhabited by violent creatures. In a desperate, last-ditch effort to save their race, the <strong>Scynthians </strong>send an expedition to <strong>Haya </strong>to find a way to power the escape technology and save their culture from extinction.<br/><br/>Engage in a role of a <strong>Scynthian</strong> leader and make the first step towards saving the <strong>Scynthians </strong>from certain oblivion.<br/><br/><br/><ul><li>Explore the unique environment of Haya and discover different landscapes<br/></li><li>Search for minerals that can be used to build and power up the Scynthian technology<br/></li><li>Build a settlement that will allow the Scynthians to survive the harsh conditions on Haya<br/></li><li>Grow the population<br/></li><li>Unlock technologies in the tech tree<br/></li><li>Build a tower defense system against the nasty Hayan creatures<br/></li><li>Build and power up the Stellar Bridge - a teleportation device<br/></li><li>Look for ancient relics around the moon<br/></li><li>Find hidden creatures ;)</li></ul>", "metacritic": null, "released": "2017-09-06", "tba": false, "updated": "2019-08-28T22:05:45", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cf04c10e2d19cc15149a85b8e5d80e7.jpg", "website": "http://www.hypernovagame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 1, "achievements_count": 35, "ratings_count": 1, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Actalogic"], "genres": ["Action", "Strategy"], "publishers": ["Libredia", "ActaLogic"], "esrb_rating": null}