{"id": 445151, "slug": "stuck-in-the-cassette", "name": "Stuck in the cassette", "name_original": "Stuck in the cassette", "description": "<p>How to play:</p>\n<p>In this game, you have no health, but your easy life experience is ruined by time. TIME represents your health, and also robots are chilling around, that may shoot you and then your TIME reduces. Luckily you have power-ups and guns, but they'll not help you to fight against TIME. Beat the level without running out of TIME.</p>\n<p>Controls:</p>\n<ul><li>Use WASD to move.</li><li>Use WASD also to target with the gun(W targets top, A right and W and D pressed at the same time targets to top right corner)</li><li>Hold CTRL when aiming to freeze your movement(so you can target with the gun without moving)</li><li>Jump with SPACE</li><li>Hold ENTER(RETURN) to shoot(if you are using sniper, hold enter to target . When you release it, sniper shoots)</li><li>Use E to interact with items(pick up a gun, open a chest)</li></ul>\n<p>Power-ups:</p>\n<ul><li>Green-instant reloads power-up(if your gun runs out of bullets while you have this power-up, you reload instantly and lose this power-up). You can hold up to 3 of these at a time.</li><li>Blue- time stop power-up(until you have this power-up, everything in the scene freezes(including time and bullets, except you can move). Duration: 3 seconds. You can have only one power-up of time stop and time warp at a time.</li><li>Red-time warp (if you run out of time and have this power-up, you return to a time when you picked it up-every enemy gets health equal to health when you picked up this power-up, you get as much time, as you had, when picked up this power-up, you get gun, you had then picked up this power-up. Duration 20 seconds. You can have only one power-up of time stop and time warp at a time.</li></ul>\n<p><strong>THIS GAME IS IN EARLY DEVELOPMENT STAGE, SO ALL COMMENTS ARE WELLCOME</strong></p>\n<p>\n</p>", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-05-18T04:57:00", "background_image": "https://media.rawg.io/media/screenshots/b8e/b8e18857bdda703a450c3f3b80aea654.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thenerdpoint60", "Reksis123"], "genres": ["Action", "Shooter", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}