{"id": 445211, "slug": "togethertron-4000", "name": "Togethertron 4000", "name_original": "Togethertron 4000", "description": "<p>As the sun set on the tranquil island city, Tom gazed out over the ocean. \"Another good day,\" he thought to himself. As Tom turned to leave, he stopped. Did he feel that low rumble, or did he imagine it? There it was again, stronger this time.</p>\n<p>Tom looked back out over the water, squinting into the setting sun. On the horizon he could see a large wave forming. He watched in horror as head of a giant beast began to rise out of the water. As it crested the waves, it opened its colossal mouth and let out an ear-splitting roar.</p>\n<p>Tom turn and bolted for his nephew's shop. He could feel the beast's footsteps now, pounding the earth as it advanced toward the city. Tom burst through the door of the shop.</p>\n<p>\"Timmy! Tommy! It's what we've always feared!\" he shouted. \"Get to the NookMech! Now!\"</p>\n<p>\"Yes, uncle!\" replied Timmy. \"Tommy, we have to assemble the NookMech immediately!\"</p>\n<p>\"... immediately...\" said Tommy.</p>\n<p>The boys were out the door in a flash. They banged on the doors at Blathers' and Isabelle's houses.</p>\n<p>\"It's time!\" shouted Timmy.</p>\n<p>The four friends split up and raced to their own parts of the giant mech. Jumping into their respective pieces, Timmy radioed to the others. \"Let's do this!\"</p>\n<p>\"... do this...\" said Tommy.</p>\n<p>Can the four friends assemble the NookMech in time to defend the peaceful island city? <strong>It's up to you!</strong></p>\n<p><em>---</em></p>\n<p><em>Togethertron 4000</em> is a puzzle game about protecting a city from armadillo kaiju by assembling a giant tanuki mech.</p>\n<p>With each level your mech's four parts are scattered about the city, but all your parts move together. Move the parts and fire their laser cannons to rid the city of kaiju and reassemble your mech!</p>\n<p><em>Togethertron 4000</em> was made remotely over 3 days for <em>TOJam 2020</em> by <strong>Team Plain Cat</strong>:</p>\n<ul><li>Dan Cox:  Art</li><li>Matt Rix: Programming</li><li>Owen Goss: VFX &amp; Audio</li></ul>\n\n<p>Music:<br/>Raving Energy by Kevin MacLeod<br/>Link: https://incompetech.filmmusic.io/song/5029-raving-energy<br/>License: http://creativecommons.org/licenses/by/4.0/</p>", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-05-18T05:09:59", "background_image": "https://media.rawg.io/media/screenshots/83c/83c6bec3cbb4e770f0ae1f11fb97fd28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Plain Cat"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}