{"id": 445218, "slug": "boxup", "name": "BoxUp", "name_original": "BoxUp", "description": "<p>BoxUp is a physics-based game, where you must get as high as possible by forming a stack of boxes without falling. Simple to play and very difficult to reach the top.</p>\n<p>Infinite physics game to have a good time and beat your own score, with short and intense games.</p>\n<p>BoxUp is played with a single touch, just press the screen to jump at the right moment and fall well positioned on the box, if the tower falls you lose, if the box hits you lose, do you dare?</p>\n<p>BoxUp:</p>\n<p>- Minimalist graphics<br/>- Physics based game<br/>- Free game<br/>- One touch control<br/>- Fast and fun<br/>- For all ages<br/>- Skill game</p>\n<p>Play BoxUp and show that you control physics;)</p>\n\n<p>------------------------------------------------------------------------------------------------------</p>\n\n<p>BoxUp es un juego basado en físicas, donde debes llegar lo más alto posible formando una pila de cuadros sin caer. Sencillo de jugar y muy difícil de llegar a lo alto.</p>\n<p>Juego infinito de físicas para pasar un buen rato y superar tu propia puntuación, con partidas cortas e intensas.</p>\n<p>BoxUp se juega con un solo toque, basta con pulsar la pantalla para saltar en el momento justo y caer bien posicionado sobre el cuadro, si cae la torre pierdes, si el cuadro te golpea pierdas, te atreves?</p>\n<p>BoxUp:</p>\n<p>- Gráficos minimalistas<br/>- Juego basado en físicas<br/>- Juego gratis<br/>- Contro de un sólo toque<br/>- Rápido y divertido<br/>- Para todas las edades<br/>- Juego de habilidad</p>\n<p>Juega BoxUp y demuestra que controlas las físicas ;)</p>", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-05-18T05:11:29", "background_image": "https://media.rawg.io/media/screenshots/26e/26e3ec157ac964e0080c627c2ab536de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ixel Games"], "genres": [], "publishers": [], "esrb_rating": null}