{"id": 44529, "slug": "fallen-legion-sins-of-an-empire", "name": "Fallen Legion: Sins of an Empire", "name_original": "Fallen Legion: Sins of an Empire", "description": "Restore Glory To Your Empire.<br/><br/>Fallen Legion: Sins of an Empire is an intense action role playing game where every battle is a heart-pounding fight and each gut-wrenching choice impacts the realm. <br/><br/>Embark on a personal journey with Princess Cecille and an enigmatic talking grimoire to restore glory to your crumbling home. Explore gorgeous, hand drawn lands inhabited by rival soldiers and ferocious dragons. Fight enemy hordes with a team of living weapons and master devastating combo attacks to defeat challenging bosses with Fallen Legion’s deep combat system. Rule your empire between fierce battles, make difficult decisions, and witness the consequences of your choices. Will you blackmail a prince to gain a strength buff or tax a starving village to revive one of your characters?<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>1 player<br/>2GB minimum save size<br/>DUALSHOCK®4<br/>Remote Play<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2017-07-18", "tba": false, "updated": "2019-08-02T16:21:04", "background_image": "https://media.rawg.io/media/screenshots/4aa/4aa6e5c932b98bb0f8828ade0b1be207.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 474, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4"], "developers": ["YummyYummyTummy"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": "Teen"}