{"id": 445470, "slug": "gangster-war-mafia-hero", "name": "Gangster War Mafia Hero", "name_original": "Gangster War Mafia Hero", "description": "He is spreading terror with his dangerous attack, shooting, spy assassin and criminal escape skills. This time no security operation can make his survival impossible. He has figured out a few survival options in the city to get his land back. The underworld crime network is stronger this time. Get excited to become speedster mafia hero.<br/><br/>People of the crime city think that the police cops and other saviours can’t defend the whole hero city and they think there should be a mr incredible mutant hero and just legend of mafias can save the arena of city hero with gangster kill.<br/><br/>Gangster War Mafia Hero Gamae Play:<br/><br/>The game play of this Gangster War Mafia Hero is very thrilling &amp; action pack to play. You’re a Mutant justice hero and you’ve to fight against the mafia and gangsters of the whole crime city. Enter into Land of Mafia Gangsters. You have to kill the squad of gangsters &amp; mafias within given time of each level. Become Mad City Mafia Hero to take revenge from gang of deadly criminals!<br/><br/>Gangster War Mafia Hero Features:<br/><br/>*  Detailed environment of different views.<br/>*  Justice Hero as the Saviour of the Vegas City.<br/>*  Gangsters and war mafias to kill.<br/>*  Variety of rescue Speedster gang war with high combat shoot.<br/>*  Real time City Simulator against the deadly criminals.<br/>*  High Quality 3D, HD Graphics and Realistic Sound Effects.<br/>*  Devastating combat fire combos experience of San Andrea’s <br/>    warrior.", "metacritic": null, "released": "2018-05-09", "tba": false, "updated": "2020-05-22T02:20:56", "background_image": "https://media.rawg.io/media/screenshots/ad1/ad176df46402a0be58747f60aeafd05a_70D5P62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahsan Khan"], "genres": ["Strategy", "Simulation"], "publishers": ["Ahsan Khan"], "esrb_rating": "Teen"}