{"id": 445471, "slug": "wild-frontier-rage-west", "name": "Wild Frontier: Rage West", "name_original": "Wild Frontier: Rage West", "description": "Who's the Talk of the Town!  --  A western-themed strategy game!<br/><br/>Wild Frontier is set in the Western United States during the late 19th century, a wild and free era in which bullets and blades do most of the talking. On the untamed land where outlaws, lawmen, gunslingers, cowboys, and the Native Americans roam, you, as the mayor of a newfound town, will need to lead a group of settlers to survive and thrive in the West.<br/><br/><br/>Features<br/><br/>- Wild West themed stories unfold. Make your dream of conquering the West come true!<br/><br/>- Meet Wild West beauties who will keep you company and give you support.<br/><br/>- Real-time strategy gameplay that requires your wise decisions. Make allies or declare war? Your choice!<br/><br/>- Hire unique Wild West heroes who will lead your army into the battle of fame and wealth.<br/><br/>- Build an alliance and conquer more territories; capture resources and defeat outlaws. Work together to dominate the West World.<br/><br/>- Alliance chat, group chat, and voice chat. Plenty of options to communicate and discuss tactics with your friends.<br/><br/>- Start from a small town and turn it into an empire. You are the chosen one.<br/><br/>- Make enemies or friends with players from all over the world with a diversity of cultures and languages.<br/><br/><br/>Follow Wild Frontier fan page and stay up-to-date on the latest events.<br/>https://www.facebook.com/WF.37Games/<br/><br/>[Notes]<br/>Wild Frontier is a free-to-play mobile game with in-app purchases. According to 37GAMES' Terms of Use and Privacy Policy, this application is not intended for use by users under the age of 12.<br/>A device with internet access is required.<br/><br/>Help<br/>Do you need help?<br/>Feel free to contact us via the in-game Customer Service or send us an Email: global.support@37games.com<br/>Privacy Policy:<br/>http://support.37.com/en/about/privacypolicy", "metacritic": null, "released": "2020-05-08", "tba": false, "updated": "2020-05-22T02:21:19", "background_image": "https://media.rawg.io/media/screenshots/920/9204d6b738b17ab9be3f4aad7469284e_sBHCGjw.jpg", "website": "https://www.facebook.com/WF.37Games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["37GAMES"], "genres": ["Strategy"], "publishers": ["G-MEI NETWORK TECHNOLOGY CO"], "esrb_rating": "Teen"}