{"id": 445483, "slug": "the-unrest-age", "name": "The Unrest Age", "name_original": "The Unrest Age", "description": "Supported Devices: <br/>iPhone: SE, 6s, 7, 8, X, XS, XR<br/>iPad: mini 4, mini 5, Air 2, Pro, 2017, 2018, 2019<br/>iPod touch 7th Gen<br/>Other devices are not supported<br/><br/>Welcome to the troubled Russia… Welcome to a harsh time<br/><br/>Introducing The Unrest Age - an Action - RPG in the large open world of Russia of the early 17th century that offers an amazing combination of dynamic battle system and nonlinear storyline, an advanced character growth system and detailed dialogues, a seamless world and a wide variety of things. The whole amazing world right in your pocket.<br/><br/>The Unrest Age combines the best ideas from desktop platforms and brings them to the mobile format. Enjoy advanced gameplay and stunning graphics wherever you are.<br/><br/>Take on the role of Alexander Kostylev, a warrior of the tsarist army who after his homecoming lost everything that was dear to him. Stand on a completely different path and go on it in search of truth. Your path will lie through endless fields and city nooks, densely populated and abandoned villages, military fortresses and dark dungeons. Be prepared for acquaintance with influential boyars and dangerous bandits, meetings with old friends and with those from whom one should stay away. You will encounter intrigues and conspiracies, everyday problems of ordinary people, and, perhaps, you will be crucial to the outcome of many issues. Welcome to a tough time - a time when you can write a story.<br/><br/>The Unrest Age uses the latest graphics technologies - all to make the world's exploring as exciting as possible. Your eyes will be pleased as you are.<br/><br/>The Unrest Age offers more than 30 hours of gameplay and a nonlinear storyline, during which you decide how to evolve your character. Also in the exploration of the world you will be helped by a advanced craft system that allows you to create the necessary items from everything that comes to hand. All this will help you create your unique style of fighting and moving around the world.<br/><br/>The Unrest Age supports Game Center achievements, saves via iCloud, video recording via ReplayKit, MFi controllers, 3D Touch Quick Actions from Home Screen, Energy Saving Mode for extended battery life and also uses all features of the Taptic Engine.<br/><br/>Did you like The Unrest Age? Subscribe to our news pages to keep up with all the latest news: <br/>VKontakte: vk.com/artiecompany<br/>Facebook: facebook.com/groups/artiecompany<br/>Twitter: twitter.com/artiecompany", "metacritic": null, "released": "2017-07-05", "tba": false, "updated": "2020-05-22T02:27:18", "background_image": "https://media.rawg.io/media/screenshots/f78/f78e1aa93e3fcf7628a65aef39923d77_KzpUPBA.jpg", "website": "http://facebook.com/groups/artiecompany", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Denis Ruzanov"], "genres": ["Action", "RPG"], "publishers": ["Denis Ruzanov"], "esrb_rating": "Teen"}