{"id": 445473, "slug": "ultimate-spider-simulator-2", "name": "Ultimate Spider Simulator 2", "name_original": "Ultimate Spider Simulator 2", "description": "Take on the life of our most realistic spider ever! Explore a macro-scale world with stunningly realistic insects and animals alike. Find other spiders and raise your family, spin webs, hunt for food, and become the strongest brood in the forest!<br/><br/>HYPER REALISTIC SIMULATION<br/>The wild has never been more alive! Explore and hunt to maintain your spiders thirst and hunger in the most detailed animal simulator we’ve ever created!<br/><br/>SPIN DYNAMIC WEBS<br/>Create webbing anywhere on the map to help you traverse the terrain and capture your prey!<br/><br/>NEW ALERT SYSTEM<br/>Creep through tall grass and leaves to avoiding alerting nearby animals and giving them a head start trying to escape you! Animal AI is smarter and faster than ever!<br/><br/>NEW BATTLE SYSTEM<br/>Omnidirectional dodge system brings a new level of skill to your fights! Quickly react to your opponents attack direction to dodge and avoid damage!<br/><br/>NEW RELATIONSHIP SYSTEM<br/>Build deeper bonds with your spiders through the new relationship and personality system. Your brood recognizes heroic and caring acts that will alter the relationships. Gain bonuses from synergetic spiders hunting together!<br/><br/>EXPANDED FAMILY<br/>Have up to TEN spiders in your family! Seek out friendly spiders and pass their challenges to recruit them to your brood! Play as your new spiders and train them as brave warriors or cunning hunters!<br/><br/>BABY AND TEEN SPIDERLINGS<br/>A brand new age makes raising your spiderlings even more real! Breed babies that will grow into teens and eventually full grown members of your clan! <br/><br/>NEW CUSTOMIZATIONS<br/>Introducing expanded animal customization options for fine-tuning your spider's look! Alter physical features like height, leg size, and body shape to accentuate your spider's personality!<br/><br/>CONQUER THE SPIRITS OF THE FOREST<br/>Challenge the four elemental spirits of the forest to battles on an EPIC scale! Dodge poison needles, escape deadly lava falls, and face shockingly difficult tests of your reflexes and timing!<br/><br/>UPGRADE STATS AND SKILLS<br/>Gain experience and level up your spiders to unlock stat bonuses and unique skills! Skills will grant specialized abilities like healing, tracking, and battle strength!<br/><br/>NEW WEB CRAFTING<br/>Collect materials to decorate and upgrade your webs and make life for your spiders even better! Build useful additions that provide food and water while safe in your web!<br/><br/>INCREDIBLY DETAILED ANIMALS<br/>Discover all new wildlife! Improved AI and animations combined with species specific action trees will immerse you in our most detailed world to date. Track down mammals and insects like Fly, Bee, Beetle, Ladybug, Praying Mantis, Hornet, Cockroach, Rat, Crow, Scorpion, Rabbit, Ants and of course Spiders!<br/><br/>IMPROVED NEXT-GEN GRAPHICS<br/>Introducing AAA PC quality graphics in a mobile simulator! With meticulously optimized models and textures, we’ve managed to reach an unrivaled level of visual quality!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the blood effects to add even more realism!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download Ultimate Spider Simulator 2 and prove you can survive as a wild spider in our all-new completely revamped simulation!<br/><br/>If you liked living as a Spider then be sure to check out our other animal simulators!<br/><br/>We plan on creating more sequels so give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2020-05-17", "tba": false, "updated": "2020-05-22T02:22:13", "background_image": "https://media.rawg.io/media/screenshots/c85/c85bd73a7a2c8a8f5f92825af3564f4a_i7QMcMP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gluten Free Games"], "genres": ["Adventure", "RPG", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": "Teen"}