{"id": 44548, "slug": "botheads", "name": "BotHeads", "name_original": "BotHeads", "description": "Guide your little flying robots through a beautiful handcrafted world filled with things to fly past, bounce off or dash through!<br/><br/>BotHeads is an atmospheric arcade adventure game by the creators of Hanger &amp; Hanger World. \"It's like an amazing dream where Sonic The Hedgehog, transformed into a flying robot, is trapped in badlands filled with weird monsters and cats with laser eyes.\"<br/><br/>BotHeads just wanna fly fast.<br/>Maybe do some loops and bounce off a spring.<br/>Spin around to a great song and rack up some points!<br/><br/>Oh – and it features a brand new soundtrack by Boy vs Bacteria.<br/><br/>FEATURES<br/>• Handcrafted world with amazing physics<br/>• Game Center Highscores<br/>• Haptic feedback on supported devices<br/>• Soundtrack by Boy vs Bacteria<br/>• Warp Zones that lets you skip levels<br/>• Cats with laser eyes<br/>• Support for iPhone X<br/><br/>REVIEWS<br/>\"Here’s a game that you should be playing right now!\" <br/>• Snappzilla.com<br/><br/>\"Thanks to a slick control system, this is one game that definitely deserves a second look.\" <br/>8/10 • PocketGamer.co.uk<br/><br/>\"If you enjoy playing platformer style games that don’t feature a random stage that regenerates itself each time you GAME OVER, this is probably the highest quality game currently available.\"<br/>• Edamame Game Reviews<br/><br/>\"BotHeads is one such title that instantly caught my eye, and while its numerous influences have been plucked from radically different parts of the gaming spectrum, the way that the developers have blended them together to make a cohesive whole is rather impressive indeed\" <br/>• TouchArcade.com", "metacritic": null, "released": "2017-07-05", "tba": false, "updated": "2019-10-22T14:37:43", "background_image": "https://media.rawg.io/media/screenshots/9d2/9d28be17a8eb130de262f55260bba19f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["A Small Game"], "genres": ["Adventure", "Arcade"], "publishers": ["A Small Game"], "esrb_rating": null}