{"id": 445516, "slug": "mechgears", "name": "MechGears", "name_original": "MechGears", "description": "<p><strong>Version 0.3.1</strong><br/>- Finished outbreak mission and added it as full demo, includes 3 boss battles.<br/>- Added Weapons: Famas F1, MP5 SD.<br/>- Added Boss: Mechgear, attack patterns still on test.<br/>- Added lootable items not only chests/boxes.<br/>- Balance adjustment on weapon damage and enemy damage (still subject to change).</p>\n\n<p>MechGears is an action-rpg with an (optional if you wish so) stealth system. With gameplay and some of the settings inspired by the original MSX Metal Gear, MG2 Solid Snake, MG Ghost Babel and Metal Gear Solid.<br/><br/>An adventure crafted to homage and at the same time parody this series of games as a serious story gets a big side of irony and dark humor.<br/><br/>Join not-so-rookie mercenary girl “Blood Snake” Andy as she fights petty villains, greedy armies, strange creatures and giant mechanical enemies, as she is witness to the atrocities of war in punny named places, points out logic-flaws, and faces moral dilemmas that you can really care nothing about, as battles are fought with bullets, wits and a lack of seriousness.<br/><br/>Keep in mind this is a challenging game, not dark souls/sekiro/bloodborne “challenging”, as the point is not to spam the game over screen with unexpected one shots or death traps, but to create a need to know and use every tool given for a good performance, there are some QoL features that will help you if you struggle too much, but the skill toolkit, items and encounters are designed around resource management and use of CC (Crowd Control) abilities to manage populated encounters in case of active combat and the use of stealth to reduce potential enemy reinforcements and total numbers, the game autosaves before each big encounter or boss fight and the content is tested to ensure you have enough resources to get through the fight with plenty of pickups (if you don’t waste them) enemies will dodge your shots and ammo is not plenty the AI might not be great, but its not completely dumb (thats the goal anyways).<br/><br/></p>\n\n<ul><li>A real time action battle system. Simple, but familiar to the MMO players, with a skill bar where abilities and tools can be slotted for quick access in combat.</li><li>A completely animated Weapons and tools system ranging from handguns to rocket launchers , vehicles and traps where every projectile is animated and thanks to collisions can be dodged.</li><li>Battle against mercenary soldiers, warlord armies, dictatorial governments, mechanical contraptions, and weird creatures through a wide range of environments.</li><li>Use the terrain and layouts to your advantage as you jump across tables and gaps, take cover behind destructible objects, ride vehicles and mounted weapons, silently sneak through vents and drains to skip past enemies or take them out whitout anyone noticing.</li><li>Call in for supplies and air attacks to rain on the enemy!</li><li>Make allies (or enemies) throughout the world as you take desicions on the field, will you risk letting them take your objective? Its the enemy of my enemy really my friend?</li><li>Accept numerous quests from your typical killing all the way to sneaking, rescuing prisoners and spy missions!</li><li>Get allies to support you on the battlefield with the mercenary system, for a price of course...</li><li>Detailed maps made thanks to the RM Community assets (and a lot of self-made things and edits), all in the style of the RTP, maps full of small details and a lot of interactable objects, custom behaviors and animations to fully flesh cutscenes, interactions, skills and battles.</li></ul>", "metacritic": null, "released": "2020-05-21", "tba": false, "updated": "2020-05-22T02:35:07", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e1d33ed84d0d4ed8884c6cd8663bf33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BKtdm"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}