{"id": 445751, "slug": "cordant", "name": "Cordant", "name_original": "Cordant", "description": "<p>Made for AT Jam May.</p>\n<p>Inspired by the sonder-esque feeling you get when you lie in bed at night and happen to think about how in the apartment building there a possibly dozens of you all stacked up upon each other, laying the same way, sleeping at the same time. You don't know those neighbours and you might not even recognise them on the street, but you are linked in this odd pattern.</p>\n<p>Jump between random neighbours to experience how their 'lives' are all connected, complex, similar but different.</p>\n<p>Alternatively, what it might have been like in the 80s in an apartment building when every kid had a Casio MIDI Keyboard on a random instrument, just bashing away, endlessly.</p>\n\n<p>Points of interesting in the environment generate notes based on the perspective of the neighbour observing them.</p>\n\r\nModes\r\n<ul><li><strong>Simple </strong>- Two sources, always generated in C in the same scale</li><li><strong>Cordant</strong> - Many sources, generated in a random key and scale shared by all sources</li><li><strong>Discordant</strong> - Many sources, all generating in their own random key and scale.</li></ul>\n<p>\n</p>\r\nWhat People Are Saying\r\n<p>\"Oh that's quite nice...  AGH, WHAT IS THAT SQUEALING!\"</p>\n<p>\"It’s like Brian Eno took truth serum.\"</p>\n\n<p>If you find any particularly good seeds, share the mode and number in the comments.</p>\n\n<p>Generated through the use of Keys and Scales wiki link, using UnitySynth.  Using parts of the following 1, 2, 3, 4, and others.</p>\n<p>Be warned, it does not typically generate what I would call, listenable, compositions.</p>\n<p>Note: Mac build is untested.</p>", "metacritic": null, "released": "2020-05-21", "tba": false, "updated": "2020-05-22T03:33:46", "background_image": "https://media.rawg.io/media/screenshots/d6a/d6a9453432c9f92e1e760ae42007a206.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Steve Halliwell"], "genres": [], "publishers": [], "esrb_rating": null}