{"id": 445875, "slug": "2048-in-c", "name": "2048 in C", "name_original": "2048 in C", "description": "\r\n\r\nHi, I'm a student of the \"Liceo scientifico A. Oriani\" in Ravenna and for an IT project I had to develop a game using the C language, so I decided to recreate the famous game 2048\r\n\r\n<br/>\n<br/>\n<br/>\r\n2048 is a game that was first developed by Gabriele Cirulli,\r\nhe published it in 2014 on his website.\r\nThe game consist on pressing the directional arrows on the keyboard to move the numbers on the grid, when two identical numbers collide they merge into one: the goal is to reach the number 2048.<br/>\n\n<br/><br/>\r\n\r\nYou may ask yourself:\" Why should I get your game while\r\nI can play for free the official one?\"\r\n\r\n<br/>\r\n\r\nHere I have some reasons on why you should play my game:\r\n<ol><li><strong>It runs offline:</strong> going on the official website obviously requires an internet connection, by today it doesn't exist an official release of 2048 for pc</li><li><strong>The save system:</strong> the game have a save sistem that automatically save the game every time you close the application correctly, and let you restart your game from where you left it even if you have turned off your pc</li><li><strong>The resizable grid:</strong> You can play the classic mode with a 4x4 grid, or you can choose to customize it and pick any possible grid dimension. Note that the grid must be at least of size 2, the only limit is your screen resolution</li><li><strong>The retrò style: </strong>The graphics are entirely made with ascii character and cmd colors that try to recreate the look of the original game</li></ol>\n<ol>\n</ol>\n<br/>\n<br/>\r\n\r\nWhat are you waiting for?<br/>\n<strong>Download</strong> it now!!!\r\n\n<p>Some instructions:</p>\n<ul><li>use the arrow key to navigate the menu and play the game</li><li>use the enter key when you want to select something in the menu</li><li>during gameplay use the esc button to exit the game</li></ul>\n<p>Have questions? Feel free to ask in the comment section below</p>", "metacritic": null, "released": "2020-05-20", "tba": false, "updated": "2020-05-22T04:05:56", "background_image": "https://media.rawg.io/media/screenshots/c77/c77bf26db067e5c4dfa0833e8726ef67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["satp"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}