{"id": 44580, "slug": "squadron-sky-guardians", "name": "Squadron: Sky Guardians", "name_original": "Squadron: Sky Guardians", "description": "“Squadron: Sky Guardians” has been designed in three stages at different time periods (1942, 1981, and 2016, respectively) in the combat flight simulator genre. In 1942, following the invasion of the Allied Forces to Iran during the World War II, USSR and Britain entered the northern and southern borders of Iran, respectively, and advanced into the country. The pilot’s duty is to defend the borders, protect the domestic facilities and support friendly forces. In the second stage (the Iran-Iraq War), the invasion of Iraq to Iran in 1984 leads to a number of flight missions to oppose the enemy forces from advancing into the southern and southwestern borders of country. In 2016, in the final stage, a number of terrorist acts take place in religious cities of Karbala and Samarra by ISIS and the mission is to fly border patrols and identification, defend the country, and to cover the Iraqi forces.<br/>\n<br/>\n<br/>\r\nGame features:<br/>\n<br/>\r\n1-\tCombat flight simulator through an arcade controller<br/>\r\n2-\tAn intriguing story at three historical periods (1942, 1981, and 2016)<br/>\r\n3-\tMore than 10 minutes of documentary narration of historical events<br/>\r\n4-\t25 minutes of exclusive music<br/>\r\n5-\t10 specific missions<br/>\r\n6-\tAttractive graphics and simulation of distinct locations<br/>\r\n7-\tControl of classic propeller-driven aircrafts (F-04 and F-14) in World War II <br/>\r\n8-\tMore than 2 hours of gameplay", "metacritic": null, "released": "2017-07-14", "tba": false, "updated": "2019-08-28T22:05:44", "background_image": "https://media.rawg.io/media/screenshots/3f2/3f21407efd57d1c1aee9c8c91fdbc09a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RSK Entertainment"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Strategy First"], "esrb_rating": null}