{"id": 44589, "slug": "astoria-the-holders-of-power-saga", "name": "Astoria: The Holders of Power Saga", "name_original": "Astoria: The Holders of Power Saga", "description": "Astoria: The Holders of Power Saga is a charming RPG with an epic, twisting story, containing intricate characters and cinematic cutscenes, done in classic 90's, RPG-style storytelling.<br/><br/>A Demon has been summoned to Astoria, seeking revenge and the destruction of its people. Play as Nolan, a young Prince arriving to Astoria from a far-off land, and discover a sinister plot of assassination, politics, and impossible alliances that will help this Demon and his accomplices obtain the Stone of Power - a stone capable of opening a gate to a realm of unimaginable evil. On your journey, meet a colorful cast of 16 characters who move in and out of your party in accordance with the plot.  Explore an expansive world where you will encounter hordes of vicious monsters, conduct stealth missions, fight in a pitched battle, and uncover great mysteries. Experience the emotions of love, anger, hatred, and fear as each member of your party has their own gripping story arcs that intertwine with the main storyline.  Sail with filthy pirates, learn powerful spells, find magic weapons, slay mighty Dragons, battle armies of Orcs, Goblins, Demons and even an Undead horde.  Will you prevail against the forces of evil in a race to recover the Stone of Power before it's too late?<br/><br/><br/><br/><strong>Features</strong><br/><br/>- 35+ hours of gameplay<br/><br/>- 20+ side quests (some small &amp; some large, spanning the entire game)<br/><br/>- 220+ maps<br/><br/>- 130+ weapons &amp; armor, 140+ items, 175+ skills/spells (unique enemy skills included)<br/><br/>- 28 Steam Achievements!<br/><br/>- A total of 16 party members, constantly moving in and out of the party in accordance with the plot!  Maximum party size of 6!<br/><br/>- 2 high-action, REAL TIME stealth/assassination events!<br/><br/>- Highly developed main characters with tons of in-game dialogue! - Nearly 1 hour of dramatic, cinematic cutscenes!<br/><br/>- Overworld map with hidden enemies/Dungeon maps with harder, visible enemies who give chase or guard paths!<br/><br/>- A unique in-game Bestiary/Monster Book to log your foes' stats and weaknesses!<br/><br/>- Be challenged by a group of \"heroes\" for status/bragging rights via intense \"hero to hero\" combat!<br/><br/>- Find and fight a total of 6 \"challengers\" inhabiting towns/villages in 1 on 1 combat with no items to test a character's might!<br/><br/>- 9 Dragons to find and kill that grant the party bonus statistics to distribute to your characters however you wish!<br/><br/>- 8 Epic Monsters/Bosses who drop special items that can be converted into unique equipment upgrades by a specialty blacksmith!<br/><br/>", "metacritic": null, "released": "2017-01-06", "tba": false, "updated": "2019-08-28T22:05:44", "background_image": "https://media.rawg.io/media/screenshots/2fe/2fe2fac687999b49c3c7777ad35a9898.jpg", "website": "https://www.goldenunicorngaming.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Golden Unicorn Gaming"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Golden Unicorn Gaming"], "esrb_rating": null}