{"id": 445931, "slug": "bisous-de-feu", "name": "Bisous de feu", "name_original": "Bisous de feu", "description": "<p><strong><em>Bisous de feu </em>est un mini jeu en 2D. <br/></strong><strong>On incarne Clara, une petite ado timide dans une école de magie. Le but est de se faire élire représentante des élèves au conseil de l'école</strong><strong> ; pour ça il faut gagner des votes en interagissant avec les autres élèves. <br/>Dans l'esprit teen-movies mais en plus magique et plus mignon, on y parle de popularité, de racket et de bisous sur la bouche.<br/>Le gameplay est surtout basé sur les dialogues et un peu sur les choix.<br/><br/>Jouable sur PC uniquement</strong><br/>(Durée du jeu : environ 1h30)<br/></p>\n<p>Je suis dessinatrice et je n'y connais rien du tout au code à la base ! J'ai commencé à développer ce jeu il y a 3 ans quand j'ai découvert RPG Maker, j'ai appris à utiliser le programme au fur et à mesure de l'avancement du jeu dans le chaos le plus total. <br/>Donc naturellement, ça n'est pas du gameplay de haute voltige et il y a plein de choses qui auraient pu être améliorées, mais après 3 ans je ne pouvais plus laisser traîner le projet. J'espère que ça  amusera des gens malgré tout car j'ai été contente de pousser ce projet jusqu'au bout !</p><p><strong> (D'ailleurs il y a forcément encore des bugs qui se baladent, n'hésitez pas à me les signaler !) </strong><br/><br/>Merci à Exaheva pour la Bande-son du jeu, ainsi que pour son aide avec RPG Maker. La bande-son complète est dispo ici !<br/>Merci à Mortis et Flef pour leurs conseils et leur  assistance technique précieuse.<br/>Merci à Chario pour avoir animé les petits personnages.<br/></p>\n<p>Merci à tous les gens qui ont prêté leurs voix pour les effets sonores et donné de leur temps pour les tests !!!<br/><br/><strong>N'hésitez pas à me contactez si vous trouver un bug qui serait passé sous mon radar</strong> :  f.tarmasz(a)gmail.com<br/></p>", "metacritic": null, "released": "2020-05-20", "tba": false, "updated": "2020-05-22T04:18:23", "background_image": "https://media.rawg.io/media/screenshots/286/2863142bf3b34a7f184d4f8fdbcf73c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tarmasz"], "genres": [], "publishers": [], "esrb_rating": null}