{"id": 446303, "slug": "nu-orbit-chaos", "name": "nu Orbit Chaos", "name_original": "nu Orbit Chaos", "description": "<p>Nu Orbit Chaos is a simple universe simulator that you control a planet to gather free roaming planets into your orbit. You can land, gather resources, destroy natives and dig holes on an orbiting planet. You can also draw artsy images with this piece of fine software to share with any interested parties! </p>\n<p>How to play?</p>\n<p>Use cursor keys to move your planet. Navigate your planet and escape from bigger planets. Try not to become too big either as you will attract more and more planets because of your gravitational pull. </p>\n<p>At first try to obtain another planet by orbiting it. After you made sure the other planet is orbiting nicely press and hold Right button. Wait a bit to orbit to register (you will hear a chime sound) Then you can press ENTER key to land that planet to collect resources from that planet. Press shift to find other planets. </p>\n<p>On lander view you again use cursor keys to navigate your lander. You will see some colored spots on the planet, those are valuable minerals. Land on them and use your mouse and LMB to start collecting minerals. Be careful, natives will start firing at you once you start collecting resources. </p>\n<p>Press esc to return to planet view.  If you want to keep your orbiter you need to protect it from collisions. You may fire rockets to destroy other planets Warning, if you click on your own planet, it automatically fires a guided missille to *nearest* planet, which may be your own orbiter. Closest planet is shown by a red line.</p>\n<p>Press f1 to display help (may not be helpful at all).<br/></p>\n<p><strong>Art Mode</strong></p>\n<p>As this game is planned as an sanbox/art game, there is an art mode. PRESS C key once to activate art mode. In art mode planets starts drawing fractals. You can add more planets by pressing F4. You can turn off collisions by F6 (which is very important not to get destroyed when you are creating your masterpiece).  And If you want to trigger some very far planets to die and spawn closer press f8 to activate boundaries.   You can Press and hold SPACE and drag with Right mouse button. You may zoom in/out with mouse wheel or z/x.  You may use alt + wheel  to  Change gravitational constant.  Press R to reset everything to start from scratch.</p>\n<p><strong>If you save a screenshot it will go to local appdata (not the place stated on game screen):</strong></p>\n<p>Generally local appdata resides under </p>\n<p>C:\\Users\\<yourusername>\\AppData\\Local\\nuOrbitChaos30042020\\Sshot </yourusername></p>\n<p>Sorry about that, I totally forgot to fix the path before packing up the archive.<br/></p>\n\n<p><strong>Development Info</strong><br/></p>\n<p> It's a 5-day jam game, and I may have enough motivation to develop it further, so here it is.   Warning, as of May, 2020 this game is incomplete, but in very slow progress. <br/></p>\n<p>The game might crash time to time, it's because there are some planned but incomplete features :) </p>\n<p>In-game Planet sprites by eleazzaar11 (opengameart.org)<br/>Music is courtesy of bensound.com<br/><br/></p>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-22T05:51:36", "background_image": "https://media.rawg.io/media/screenshots/6ca/6cadec3904fdf0ff39437d6b0fdad35b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ref"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}