{"id": 446398, "slug": "virus-control-cpiteam", "name": "Virus Control (cpiteam)", "name_original": "Virus Control (cpiteam)", "description": "<p>Organism is fighting against desease, take a side and conquire the battle! Play as a threatening virus, contaminating everyhting it touches, or play as a mighty immunity, sending antibody troops to the frontline of the war for their homeland.</p>\n<p><strong>How to play</strong></p>\n<p>Units generated and move automatically, control units production to affect game flow and watch the battle!</p>\n<p>Your forces are trying to reach other side to hit the core, wish them good luck!</p>\n<p>Units are rock-paper-scissors: each beats some and is beaten by some, so your choice is crucial for the game result!</p>\n<p><strong>Features</strong></p>\n<ul><li><strong>play vs bot</strong> - choose difficulty to push it hard, but not too hard</li><li><strong>play vs friend</strong> - start private game and pass join code to another player, let's see who is the best!</li><li><strong>play vs random player</strong> - choose this option and system will find a player like you to play with. With internet, you're always in a good company!</li><li><strong>watch bots fight</strong> - tired of doing stuff? Just relax and watch the show and don't forget to cheer!</li><li><strong>nice music and visuals</strong> - watch for the battles, with pleasure!</li></ul>\n<p>And more to come! Rate app, write your feedback and share the game to help me making updates, thank you!</p>", "metacritic": null, "released": "2020-05-19", "tba": false, "updated": "2020-05-22T06:16:37", "background_image": "https://media.rawg.io/media/screenshots/a85/a8512234e00344727ab7d617574e1399.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["cpiteam"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}