{"id": 446388, "slug": "heresy-itch-noahmt", "name": "Heresy (itch) (NoahMT)", "name_original": "Heresy (itch) (NoahMT)", "description": "<p><strong>Story:</strong><br/></p>\n<p>You take control of a demon from Hell named “Demivile” who over thousands of years of service in Hell has earned the opportunity to move up the ranks from serving in Hell to become a servant of the Heavenly realm. First Demivile must face a series of challenges in order to prove himself to the Gods above. Demivile must fight and defeat the 3 “Iudex” ranked deities that serve as guardians of the Heavenly realm in order to achieve angelic status and be freed from the demon ranks of Hell. The first Iudex deity stands guard at the gate between Hell and Purgatory. The second Iudex deity guards over the realm of Purgatory. The final Iudex deity stands guard at the very gates of Heaven itself. If Demivile is able to fight and defeat these ancient Iudex deities, he will have proven himself worthy and be able to serve under the Heavenly ranks and as an angel.</p>\n\n\n<p><strong>Controls:</strong></p>\n<p>The controls are mouse and keyboard. You control the camera by aiming the mouse, move the player character with WASD, attack with left click, special/ranged attack with right click, run by holding the space bar and dodge with the left shift button.</p>\n\n<p><strong>Credits:</strong></p>\n<p>Design, Programming, Art:</p>\n<p>Noah Mendelsohn-Thornton &amp; Uriah Overton</p>\n<p>Animations, player character model and boss model were taken from Mixamo.<br/></p>\n<p>Sword, Angel Statue and Gargoyle Statue models were taken from Unity asset store.</p>", "metacritic": null, "released": "2020-05-19", "tba": false, "updated": "2020-05-22T06:14:26", "background_image": "https://media.rawg.io/media/screenshots/f89/f899ec89ad1ae20d72d03dcbbc37cdaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NoahMT"], "genres": ["Action", "RPG", "Fighting"], "publishers": [], "esrb_rating": null}