{"id": 446310, "slug": "starbot-showdown", "name": "Starbot Showdown", "name_original": "Starbot Showdown", "description": "<p>Starbot Showdown is a strategic action game inspired by Konami’s Bomberman series. Players choose which Starbot food delivery robot they will take into battle and which part of George Mason’s campus their food fight will take place. In the traditional levels, players must fight each other using food-themed attacks. Each of the four locations has a unique gameplay mechanic that causes mayhem for the players. In Frenzy Mode, players work together to prevent the evil robots from invading their base. Or, a player can take on Frenzy Mode alone and see how long they can last.</p>\n<p>Starbot Showdown features cartoonish, maze-like levels inspired by George Mason University’s campus. The playable characters are inspired by the popular food delivery robots seen around campus, and each bomb type is represented by various foods. Starbot Showdown also features an original soundtrack as well as pvp, co-op, and single player gameplay. The game is compatible with both PC and the Winnitron arcade cabinet.</p>\n<p>Starbot Showdown was originally designed for the Winnitron arcade cabinet. In order to play the game on PC, there are keys assigned to each player that act as their joystick and buttons. Each player has four movement keys (which act as the joystick) and two action keys (which act as the buttons).</p>\n<p><strong>Controls:</strong></p>\n<p><em>Player 1:</em></p>\n<p>Movement Keys - WASD</p>\n<p>Action Key 1 - `</p>\n<p>Action Key 2 - 1</p>\n<p><em>Player 2:</em></p>\n<p>Movement Keys - IJKL</p>\n<p>Action Key 1 - G</p>\n<p>Action Key 2 - H</p>\n<p><em>Player 3:</em></p>\n<p>Movement Keys - arrow keys</p>\n<p>Action Key 1 - .</p>\n<p>Action Key 2 - /</p>\n<p><em>Player 4:</em></p>\n<p>Movement Keys - 8456 (number pad)</p>\n<p>Action Key 1 - 1 (number pad)</p>\n<p>Action Key 2 - 2 (number pad)</p><p>Starbot Showdown was created by the students of George Mason University's GAME 410-001 class, which was offered in the Spring 2020 semester.</p>", "metacritic": null, "released": "2020-05-17", "tba": false, "updated": "2020-05-22T05:54:02", "background_image": "https://media.rawg.io/media/screenshots/b22/b222505aaa2f1da37a0c1b799930d72e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GMUgame410-001"], "genres": ["Action"], "publishers": [], "esrb_rating": null}