{"id": 446338, "slug": "igor-maks-the-meme-lord-itch", "name": "IGOR MAKS The Meme Lord (itch)", "name_original": "IGOR MAKS The Meme Lord (itch)", "description": "<p>For a long time, memes made people pleased and amused but once the world changed. The Original Troll was born in boundless space of the galactic internet. He took control of memes and turned them against people. Finding themselves in this mysterious world, Igor Maks with his crew must stop the Original Troll, pacify toxic memes and restore intergalactic balance.<br/></p>\n\n<p>Inspiring by the classic and modern games of the same type we tried to take the best of them. You have to take control of Igor Maks' space car and join the battle against toxic memes. Each level is fully packed with enemies, so you won't be bored or relaxed.</p>\n<p>Fight countless memes, upgrade arsenal and space car, listen to Mr. Dumb silly jokes, meet new characters on your way, and finally reveal the secret of IGOR MAKS The Meme Lord universe!</p>\n\n<p>The Original Troll is on top of the local evolution, but first you need to deal with his meme guards to get to him. Some of them cry, some heatedly flex – the memes culture is vast and rich, so each boss will bring something special to your journey.<br/></p>\n\n<p>It's not about racing, although you still have to drive a few times... You may use Hangar to improve your cosmocar, where TechX will pimp your ride and monitor. Equip cosmocar with lots of cute weapons and addons, and choose your favorite skin surely. You'll get something new for each successful level!</p>\n<p><em>Consider buying this game on <strong>Steam</strong> for features like achievements and Steam Cloud support.</em></p>\n<p>    </p>", "metacritic": null, "released": "2020-05-19", "tba": false, "updated": "2020-05-22T06:02:46", "background_image": "https://media.rawg.io/media/screenshots/0f0/0f0822981fe43ebb9d56b94c0faba2a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SЁLO"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}