{"id": 446436, "slug": "pop-it-toy-jam-2019", "name": "Pop It - Toy Jam 2019", "name_original": "Pop It - Toy Jam 2019", "description": "<p>Pop It! was made for the 2019 Toy Jam organized by Philly Game Mechanics</p><p>Playing requires a touch screen.</p>\n<p>The theme for the jam was making games that could exist simply as toys instead of games.</p>\n<p>A friend of mine had an idea of a simulator where you graphically break a foot. I thought that was a bit much but had seen a lot of pimple popping videos in the past and thought that it would be an interesting approach to make a toy where all you do is pop pimples.</p>\n<p>I decided to limit the toy to only having four visible game objects. A plane for the skin, a sphere for the base, a capsule for the pimple head, and a particle emitter for the eruption spray.</p>\n<p>Local developer Gary DiCiano wrote a script to pick randomized colors and set it up in the game to generate skin, pimple, and pus tones.</p>\n<p>I had only developed touch based games minimally, so wanted to focus on input controls. I created a system that would detect pinch gestures on the pimple, and scale its different components up and down to simulate a pimple about to burst. On bursting it fires off a sound event, particle emitter, and makes a new pimple.</p>\n<p>Local sound designer Alex Cole provided dozens of pimple pop sounds of varying wetness, duration, and intensity. This provides most of the viscerality to the pop effect.</p>", "metacritic": null, "released": "2020-05-19", "tba": false, "updated": "2020-05-22T06:26:11", "background_image": "https://media.rawg.io/media/screenshots/580/580bf061f9991b7778afb05eb9bbf01b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tubby Cat Games"], "genres": [], "publishers": [], "esrb_rating": null}