{"id": 446469, "slug": "xia-xavalier", "name": "俠 XAVALIER", "name_original": "俠 XAVALIER", "description": "<em>A/D to MOVE, Space to JUMP. Left click to ATTACK. Right click to DASH.</em>\n\n\n\n\n\n<strong>俠 </strong>XAVALIER\r\nA LONELY NARRATIVE\r\n\r\n<p><strong><em>        XAVALIER </em></strong> is a single-player action game that allows players to play as a swordsman and kill enemies with one single strike. Players can also dive into the “underworld” as a defense strategy. However, besides the fact that hostile creatures exist down below as well, player’s attacks in the upper world can affect the terrain in the lower, creating areas that slow you down.</p>\n<p>        The game was named after the Chinese character “<strong>侠</strong>” (xia) combined with its English synonym “Cavalier.” However, even though the two words are often regarded as intertranslatable, and are always associated with romantic narrative, the temperament of the two varies greatly due to the cultural context from which the narratives emerged. Similarly, games featuring Asian elements created by people with different backgrounds, even within the Asian community, can provide completely different perspectives. My intention in creating this game is to explore my aesthetic, both visually and spiritually, about the culture that raised me. </p>\n<p>        The core concept of this game was “minimal”, rooted in the appreciation of “leaving blank” in traditional Chinese aesthetics, believing that the unexpressed are sometimes more powerful and superior than expressions. From visual to sound design, and the game beats and encounter designs, my work float was started from a more complex stage and gradually reduced to the most essential elements: flat color, one strike, procedural drums. Keeping the most refined silhouette without much distraction, what I have in the demo now creates a much spacious experience than my first 3D prototype. </p>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-22T06:33:27", "background_image": "https://media.rawg.io/media/screenshots/8f6/8f6a075b902f2d95f119f0d44ccc8b87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Eleanor Jiaxi Yang"], "genres": [], "publishers": [], "esrb_rating": null}