{"id": 446559, "slug": "going-up-goldsmiths-uol-egd", "name": "Going Up (Goldsmiths UoL EGD)", "name_original": "Going Up (Goldsmiths UoL EGD)", "description": "<p>Welcome to Going Up! An experimental platformer game built in Unity with the core focus of being able to walk along and transport through <strong>gravity. </strong>The core of the game is getting to the top of the level with the gravity based puzzles.<br/></p>\n<p>More development details can be found on our blogs. This page will give the highlights of development and potential issues we came across.</p>\n<p>Developed by :</p>\n<ul><li>Oliver Dimes : oliverjdimesegp.blogspot.com</li><li>Robert Goddard : https://rgodd011expressive.wordpress.com/</li><li>Athar Azim : https://atharepg.blogspot.com/</li></ul>\n<p><strong>Inspirations:</strong></p>\n<p>We were heavily inspired to create a platformer with a unique twist after seeing 2D Platformers such as Jump King and Getting Over It.</p>\n<ul><li>Jump King (2019) - This is a 2D Platformer that looks simple on paper but you can't accurately jump which means you will need to learn the map in order to progress. If you fail a jump, that could potentially mean going all the way back to the beginning.</li><li>Getting Over It with Bennet Foddy (2017) - This is a very challenging and often frustrating 2D platformer, this is because losing progress most of the time results in the player going all the way back to the beginning which can be potentially hours of progress. </li></ul>\n<p>While these games are hard, we think the main appeal of the games is the fact they try to do something unique within the 2D platformer. So for our game, we decided to try and experiment with a tried-and-true game genre and try and make something unique. </p>\n<p>We really wanted to turn the wheel and try something different. It always seemed like a cool idea to rotate an entire level and see how it would play. More information can be found on our Developer blog.</p>\n<p><strong>Development :</strong></p>\n<p>For this project, we developed most of the assets such as the background, character model and art by ourselves. We did end up using some existing assets for tiles and sounds (which can be found at the bottom of this itch.io page).</p>\n\n<p><em>Testing out gravity on a barebones level structure.</em></p>\n<p>We originally intended to make the game focused on just gravity but we had the idea to make the game flip entirely to give a new perspective on the game. Whilst this on paper sounds simple, this system can cause havoc to the physics system built into Unity. </p>\n\n<p><em>A preview of one of the tile palletes used in the final product.</em>The hardest part of the game to develop was the level alongside the Gravity flipping scripts we created since they are only effective when placed in the right environment.</p>\n\n<p><em>One of the environments shown in the Unity Editor</em>We have much more details available on our individual development blogs, we had a lot of trouble developing the systems needed for this game. We had a text writing system that proved to be quite a challenge to implement since we wanted the text to have a neat loading animation.</p>\n\n<p><em>Text Writing in action</em></p>\n<p>Most of the systems for this platformer have been custom written. While some of the results are mixed, we believe that there's a good mechanic underneath some of the technical drawbacks that we have experienced.</p>\n<p><strong>If we had more time? :</strong></p>\n<p>We've created a list of things we think that would improve the experience that we have created :</p>\n<ul><li>A more interesting transition when flipping the character. (Looks a bit plain)</li><li>NPC Dialogue conversation system </li><li>More original art</li><li>Death animations</li><li>More custom art</li></ul>\n<p>There is more detail and personal preference found on our development blogs but overall, I think there's is plenty of work to do after the fact.</p>\n<p><strong>Assets Used :</strong></p>\n<p>We've used a number of assets available on Unity and other places. We've listed all of the assets here :</p>\n<ul><li>The Spriters Resource - Starbound : https://www.spriters-resource.com/fullview/73093/</li><li>Neon Shadow Tile Concepts : https://www.artstation.com/artwork/ZrZx</li><li>Free Pixel Space Platform Pack : https://assetstore.unity.com/packages/2d/characters/free-pixel-space-platform-pack-146318</li><li>SpaceSkies Free | 2D Sky | Unity Asset Store : https://assetstore.unity.com/packages/2d/textures-materials/sky/spaceskies-free-80503</li><li>2D Spaceships : https://assetstore.unity.com/packages/2d/environments/2d-spaceships-free-trial-146307</li></ul>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-22T07:00:12", "background_image": "https://media.rawg.io/media/screenshots/731/7311ed8da03700e65c6227407b2c9026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["effeect"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}