{"id": 446568, "slug": "floor-is-lava-asthegor", "name": "Floor is Lava (Asthegor)", "name_original": "Floor is Lava (Asthegor)", "description": "<p>Vous vous réveillez dans une pièce, sans vraiment comprendre ce que vous faites ici, ni même qui vous êtes. Vous vous mettez à explorer petit à petit les environs, à la recherche du moindre indice qui pourra vous faire retrouver un peu de votre mémoire.</p>\n<p>Ne croisant personne, vous vous interrogez sur ce qui s'est déroulé dans ce lieu lugubre. Votre ballade commence à vous donner un peu soif. Votre bouche devient pâteuse et vous commencez à avoir les mains moites.</p>\n<p>Plus le temps passe et plus vous commencez à avoir chaud. Vous vous demandez si on n'a pas fait des expériences sur vous, comme injecter des produits toxiques ou je-ne-sais-quoi d'autre.</p>\n<p>Vous avez même des visions psychédéliques : tout devient jaune et orange à la fois.</p>\n<p>Puis, au détour d'un couloir.......</p>\n<p>Vous le voyez de vos yeux vrais !</p>\n<p>Ce spectacle ahurissant et si merveilleux !</p>\n<p>Vous savez ce que c'est mais plus rien.</p>\n<p>Votre cerveau s'est auto-déconnecté et, tel un zombie, vous demeurez devant...sans réagir.</p>\n<p>Un moment plus tard, vous entendez : \"Fuyez sacrebleu ! Mais fuyez donc !\"</p>\n<p>Vous vous réveillez de votre torpeur et commencez à prendre peur.</p>\n<p>Une forte odeur de caoutchouc brûlé remonte à vos narines, vous insufflant un regain d'énergie et de dégoût.</p>\n<p>De la lave s'avance doucement mais inlassablement vers vous.</p>\n<p>DE LA LAVE ! LE SOL EST DE LA LAVE !!!!!!!</p>\n\n<p>Auriez-vous assez de force pour vous sortir de ce destin funèbre ?</p>\n<p>Venez donc relever le défi qui s'offre à vous.</p>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-22T07:02:10", "background_image": "https://media.rawg.io/media/screenshots/7f9/7f9676d9eee3a250eff53f909adb47b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Asthegor"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}