{"id": 446540, "slug": "gbu-going-back-up", "name": "GBU - Going Back Up", "name_original": "GBU - Going Back Up", "description": "<p>Level design block out for Going Back Up general intro:</p>\n<br/><p><strong>GOING BACK UP<br/></strong><em>A JOURNEY UPWARDS</em></p>\n<p>            Going Back Up is a level designed for a single-player first-person game. The player is trapped in the abandoned lower level of a future metropolis and needs to go back up using an obsolete elevator. The narrowness of the alley and the prominence of the gigantic elevator tower in the middle indicates the critical path to the player, while the cracks and holes on the building’s wall on both sides invite more exploration. In order to reach the elevator, the player has to stop the trash pulling down the shaft by finding the control located in the adjacent buildings. During the exploration, more secrets about the region might reveal.</p>\n<p>            The inspiration of this level comes from the Joker Stairs in Bronx, New York. Its sense of tension and extension created by the narrow alley and continuous steps resonates with the mood of our other source of inspiration, Alita: Battle Angel(2019). Adapting the layout of Joker Stairs within a similar world setting to <em>Alita</em>, we are trying to create a melancholic atmosphere for the player by showing them the “past” of the world and introduce them to the “present.”  </p>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-22T06:54:00", "background_image": "https://media.rawg.io/media/screenshots/360/360d018651c982830bb572c06265096d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eleanor Jiaxi Yang", "crazymrwill"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}