{"id": 44672, "slug": "hold-my-beer", "name": "Hold My Beer", "name_original": "Hold My Beer", "description": "\"Hold my Beer!\" those famous last words before someone does something incredibly stupid.<br/><br/>This is a ridiculous game where you play the role of an idiot, doing idiotic dares and stunts.<br/>I don't recommend trying this at home, but since we'll be doing it in virtual reality, go right ahead!<br/><br/>You choose the difficulty based on how much of your beer you drink. If you somehow manage to succeed in your task, you get to drink more, and try an even more daring version of the stunt. Your final score for any dare is a combination of points, time, and how much you drink.<br/><br/>There are three unique dares in total.<br/><br/><br/>\"Idiot Crossing\" is a dare where you must cross a busy street using a walking frame. Drink your beer, hand it off, grab the walking frame, and use it to cross the street! Traffic is randomised, and it will not stop for you!<br/><br/><br/>\"Easy as Apples\" is a dare where you must load a pistol, and shoot a beer can off the head of a foolish volunteer. Drink your beer, hand it off, load the gun in front of you, and shoot the can! never mind that blurry vision, you've got this!<br/><br/><br/>\"Flying Fool\" is a dare where you must perform a massive stunt jump on a skateboard. Drink your beer, hand it off, get on the skateboard, keep your balance and steer yourself safely down a terrifying ramp, and, land safely. What could go wrong?", "metacritic": null, "released": "2017-08-02", "tba": false, "updated": "2019-08-28T22:05:41", "background_image": "https://media.rawg.io/media/screenshots/ed1/ed169284441dbce510d62b6700480704.jpg", "website": "http://hold-my-beer-vr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 1, "achievements_count": 5, "ratings_count": 2, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Lord of the Stack"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Lord of the Stack"], "esrb_rating": null}