{"id": 446779, "slug": "outbreak-control-riccardo-cafagna-orez-dev-senkets", "name": "Outbreak Control (Riccardo Cafagna, oRez, 🌻, Dev Senketsu)", "name_original": "Outbreak Control (Riccardo Cafagna, oRez, 🌻, Dev Senketsu)", "description": "AN INVISIBLE MENACE...\r\n<p>You are the ruler of a big country that is afflicted by a virus, you need to control spreading of the virus, establish a emergencial state, measure your costs and help your citizens to survive this outbreak. </p>\n<p>How far do you need to isolate a region? It's a matter of degree</p>\n\n<p>You need to control the spreading of the virus,  you can close roads, lock airports and harbors, isolate regions from your country and start a quarantine, but be careful, with more time in quarantine, your economy will be really affected by the time without your region producing, measure your costs and think twice with every action that you take.</p>\n\n<p>Every gameplay is different from each other, you cannot predict wich symptoms, what kind of transmission or how deadly the virus is,  so be careful, every type of virus reacts different to actions that you take. Some virus can be really deadly, but with less spreading, other time, it can be less dangerous but it spreads like fire in  hay,  analyze your enemy before you act.</p>\n\n<p>The mouse is your main weapon to defeat this virus! </p>\n<p>When selecting the wall builder tool use Q and E to rotate the wall, use the LEFT Mouse Button to build and the RIGHT Mouse Button to destroy it.</p>\n<p>Click in a region with LMB to show  population and virus values.</p>", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2020-05-22T07:55:32", "background_image": "https://media.rawg.io/media/screenshots/2d4/2d431d2d5c1da6b5225b8531c29ccab1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Riccardo Cafagna", "Dev Senketsu", "oRez", "🌻"], "genres": ["Strategy", "Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}