{"id": 446757, "slug": "dogs-throwing-swords-ii-three-barks-to-the-wind", "name": "Dogs Throwing Swords II: Three Barks To The Wind", "name_original": "Dogs Throwing Swords II: Three Barks To The Wind", "description": "<p><strong>DOGS THROWING SWORDS II: Three Barks To The Wind</strong></p>\n<p>The latest entry in the notorious \"Dogs Throwing Swords\" series!</p>\n<p>The mysterious horned devil ORELIA has been causing mischief in the Dogwoods! Three heroes have been chosen to take a stand, and put an end to her tyranny.</p>\n<p>Choose and guide a team of three dogs, and lead those best friends to victory over the devil ORELIA! Each dog has its own unique strengths. Avoid enemy attacks and maximize your firepower by SHIFTING and ROTATING your dogs. Keep them safe as long as possible, so the forest can be free for all once more!</p>\n<p>- 4 friends to choose from: Husky, Corgi, Pug, and Pomeranian!<br/></p>\n<p>- 6 doggone good levels to fight through</p>\n<p>- Dog music. I mean good music</p>\n<p>- Each dog lovingly hand-pixeled, from nose to tail</p>\n<p>Play Dogs Throwing Swords II today, choose a dog, and throw a sword! Now go get it! Aww, who's a good dog! You are! Yes you are!</p>\n<p>Rook &lt;3</p>\n\n<p><strong>PART OF THE LOCALLY SOURCED SPRING BUNDLE!</strong><br/></p>\n<p>Right now this game is purchasable as part of the Locally Sourced Spring Bundle, for just $13! If you'd like to play it while supporting a group of amazing Michigan developers, please buy the bundle~ </p>\n<p>You can buy the bundle HERE: Locally Sourced Spring Bundle</p>\n<p><em>(Do not buy this game directly! It costs too much money, like, way too much money! Save it with the bundle! Then go buy a pizza!)</em></p>", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-05-22T07:47:09", "background_image": "https://media.rawg.io/media/screenshots/350/3504f370ba983f93d08a82446a27f88a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["rook"], "genres": ["Action"], "publishers": [], "esrb_rating": null}