{"id": 44678, "slug": "cybermotion", "name": "Cybermotion", "name_original": "Cybermotion", "description": "You have levels to beat. You have body to control. But really special feature is that you can make your own animations which aren't just visual like in almost all other games, but 100% physics based, so they define how you move through the environment.  Animating is relatively easy, you can make good animation in a minute, then assign it to a button and you can use it in current level or any level you wish! However, there are also default animations from beginning. <br/>\n<br/>\r\nGenre:<br/>\r\nCybermotion is 2D platformer based on physics. Players are able to make own unique  animations that define how the robot moves through the environment. The goal is to finish levels in time, win medals and unlock new content.<br/>\n<br/>\r\nControls:<br/>\r\nControls are inspired by controls of real humanoid robot. You’ll switch between full body animations which are assigned to the buttons, or you can control each limb manually. Servos in your robot are trying to follow these animations, but they have to deal with gravity, mass and other static or dynamic objects.<br/>\n<br/>\r\nUpgrades:<br/>\r\nYou can add and upgrade many functions of your robot. For example you can upgrade armors, processors, servos, batteries and more. At the beginning, you can barely walk under weight of your body. In the end you can be overpowered beast that can finish level with just one powerful jump.<br/>\n<br/>\r\nAnimation Editor:<br/>\r\nAnytime, you can pause the game, make new move in animation editor, assign animation to the button and use it instantly, or in any other level later. For example you need faster animation of getting up from the ground? Or you want to kick some ball? Crawl through the tight hole to get something?  It’s up to you.<br/>\n<br/>\r\nStory:<br/>\r\nCybermotion has no storyline. However key background is University of Cybernetics where <br/>\r\nare few students working together in team, trying to finish their final assignment and get degree in cybernetics. They choose to build and program robot that can move like a human in complex dynamic environment. Their Professor of Cybernetics (who is also Professor of PE) is testing their work the hard way and gives them nothing for free. Except for some spare wires and scrap parts... <br/>\n<br/>\r\nFuture of Cybermotion:<br/>\r\nI would like to add  PVP offline robosumo and implement steam workshop for sharing user animations and levels.", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-08-28T22:05:41", "background_image": "https://media.rawg.io/media/screenshots/483/4838652b79de519696eaafd9b39fc1e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Lukayson"], "genres": ["Simulation", "Indie"], "publishers": ["Lukayson"], "esrb_rating": null}