{"id": 446750, "slug": "knife-that-guy-2k20", "name": "Knife That Guy 2k20", "name_original": "Knife That Guy 2k20", "description": "<p>After years laying dormant on phones, Knife That Guy arrives on PC...<br/><br/>You are This Guy, holder of The Knife. Your goal is simple: Knife That Guy. That Guy could be any unfortunate marked guy in a crowd of wandering Other Guys. With every That Guy knifed, your murderous fervor (and uncontrollable movement speed) increase. You must use your ability to run at dangerously high speeds and your inexplicable talent to dash at an even more dangerously high speed to take down each target. But this is not a game of senseless slaughter - knifing anyone other than That Guy comes with consequences. Go long enough without knifing That Guy and The Knife will end up marking you...</p>\n<p>But there's more to the game than running and knifing! In addition to those two endlessly enjoyable actions you can:</p>\n<p>- Ignite the flames of rage to make every Other Guy a target!<br/>- Redistribute the wealth from Rich Guys to yourself!<br/>- Unleash 360 degree salvos of throwing knifes!<br/>- Explore the duality of your very being to call forth protective representations of your innermost spiritual strength and...Knife That Guy!</p>\n<p>What are you waiting for? The Knife is sharpened, That Guy is marked, and the clock is ticking...<br/><br/>CONTROLS<br/>A/D - Turn left and right<br/>Click - Dash to location<br/>Space - Use knife bomb<br/>No Key - Slow down or stop. Don't even try it.</p>", "metacritic": null, "released": "2020-05-14", "tba": false, "updated": "2020-05-22T07:44:44", "background_image": "https://media.rawg.io/media/screenshots/af5/af5b2f689cd186f92158b287b38bd782.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flyover Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}