{"id": 44670, "slug": "gray-grofa", "name": "GRAY GROFA", "name_original": "GRAY GROFA", "description": "GRAY GROFA is a 2D side-scrolling shooter puzzle game that has been developed for the 8-bit MSX computer, pushing its memory and performance to the limit.<br/>\r\nA Windows PC version will be released soon on Steam.<br/>\n<br/>\r\nThis game appears similar to side scrolling shooters from the 80's such as GRADIUS and R-TYPE.<br/>\n<br/>\r\nJust like in these familiar shooter games,<br/>\r\nyou can shoot, reload bullets, and enemies will fall or break down when your bullets hit them.<br/>\n<br/>\r\nHowever, this game is actually a puzzle game!<br/>\n<br/>\r\nYour path is mostly blocked by unbreakable enemy ships, so you have to find a way to advance through the stage!<br/>\n<br/>\r\nThe challenge is that ships without a pilot cannot be destroyed. But fortunately, enemy pilots walk around the field and will enter ships that they get close to. You will then be able to destroy the ship or allow the ship to move away and make space for you to proceed through the stage.<br/>\n<br/>\r\n・ 5 puzzle stages, each based on a unique concept.<br/>\r\n・ Very short bullet lifespan results in thrilling action. The closer you are, the faster you can fire!<br/>\r\n・ The creator of this game is a musician, who created the music, program, and graphics for this game.<br/>\r\n・ A detailed technical specification document is included with the game. The program list for the game can be viewed, and all details about the game’s tools and program are explained. Learn how to create games for the MSX!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:41", "background_image": "https://media.rawg.io/media/screenshots/cfd/cfd5b0f76016ab2cc2bc336c4a4bafc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TPM.CO SOFT WORKS"], "genres": ["Action"], "publishers": ["TPM.CO SOFT WORKS"], "esrb_rating": null}