{"id": 446925, "slug": "tower-craft-idle-block-build", "name": "Tower Craft - Idle Block Build", "name_original": "Tower Craft - Idle Block Build", "description": "Welcome to the idle game of the construction tycoon: time management, making money and creating an empire to raise your business and collect the greatest iconic buildings! Idle construction - a city construction tycoon looks from other city games for idle &amp; clicker gameplay. You can build an office, home, school; to expand your region, improving employees and their speed of work. In the idle construction business of tycoons, you are building your own construction corporation.<br/><br/>Become an iconic construction tycoon and expand your inventory to build a new building in the city that brings you maximum profit. Increase to a new city building; Enlarge your home by getting a challenging construction business! Build buildings in your city! Grow your real estate business, earn money, grow your empire and become a construction tycoon. Play the city idle. Become a construction tycoon by managing your town planning firm. Expand your corporate business, build an empire and earn as much money as possible, just by playing a loafer!<br/><br/>Grow your business, earn more money and expand your trade, update and discover new opportunities, and then create your own golden empire! Get ready to get rich, get tons of gold and money. In this construction tycoon, in idle mode, click on tap and clicker; You will have to improve your money management skills and become the richest business tycoon. Get ready to create, upgrade and mechanize the most lucrative city of all time in the best idle game.", "metacritic": null, "released": "2020-03-07", "tba": false, "updated": "2020-05-25T02:07:29", "background_image": "https://media.rawg.io/media/screenshots/a02/a0217f6cceb62ba62c9312e65a66d343.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Semyon Kozyura"], "genres": ["Strategy", "Casual"], "publishers": ["Semyon Kozyura"], "esrb_rating": "Everyone 10+"}