{"id": 446916, "slug": "honor-of-kings-epic-heroes", "name": "Honor of Kings - Epic Heroes", "name_original": "Honor of Kings - Epic Heroes", "description": "Honor of Kings is an exciting new empire simulation RPG, which combines with strategy war games! You will experience the King’s life! The game pays attention to detail processing so that players can immerse in imperial management, political intrigue, brutal war, military strategy, and flirtatious romance!<br/><br/>In particular: you can turn on PEACE MODE then will not be attacked by others! <br/><br/>Main features:<br/><br/>● Be a king and build a harem<br/>Romantic encounter will happen between you and seven beautiful, influential girls (even more, depending on your personal charm)! They are all glamorous princesses from different countries, such as the United Kingdom, Japan, China and Egypt. When the princesses start dancing, nobody can take their eyes off them!<br/> <br/><br/>● Recruit  epic heroes<br/>Recruit heroes and complete combat missions.  Each hero has a 3D model and unique skills!  You are supposed to add each hero to your favorite!<br/><br/>● Enjoy the rich rewards in game<br/>It doesn’t affect your work at all! Send the hero to fight automatically - idling, can get a lot of rewards! You can accumulate wealth by idling every day. Unlike other SLG, no one can completely destroy your Kingdom! Enjoy the game as much as you can!<br/><br/>● Raise a family<br/>Lovingly cultivate your children into brilliant persons!<br/><br/>● Alliance<br/>Make friends and convert enemies into friends, fight for your throne!<br/><br/>● Join the PvP<br/>You can play against other players around the world!<br/><br/>● Open the Peace Mode<br/>After opening the Peace Mode, that is, Neutral Kingdom, you will not be attacked by other players, stay away from war and develop peacefully. and \"Peace Mode\" is completely free! <br/><br/>        Therefore, if you like war, there are many active alliances of war players; if you like peace, there are plenty of peace-loving players creating \"Neutral\" alliances! You can choose the development direction according to your preference! All in all, it's a very unique strategy war game!\"<br/><br/>        So would you choose to occupy enemy countries, imprison rival Lords and conquer their queens? Will you free the prisoners of war?<br/>        Or would you choose to be a peace-loving King, marry a princess and start a family -- lovingly raise your children to be brilliant adults?", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-05-25T02:03:57", "background_image": "https://media.rawg.io/media/screenshots/e37/e37d7021b365e66f21b4d9b98dc553e2_I5u43fj.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sky Dragon"], "genres": ["RPG", "Strategy"], "publishers": ["Shenzhen Sky Dragon Technology Co"], "esrb_rating": "Teen"}