{"id": 446924, "slug": "idle-air-force-base", "name": "Idle Air Force Base", "name_original": "Idle Air Force Base", "description": "Idle Air Force Base is the most fun idle game you’ll play this year! Feel the need for speed with this really fun, strategic military game where you’ve got to build up the finest Air Force in the world, so you can do battle, take cities and conquer countries!<br/><br/>TOP REVIEW!<br/>As one ex-USA Air Force pilot said, “I find this idle game especially amusing and fun!”<br/><br/>TRAIN TO WIN!<br/>You are the Air Marshall and the enemy is spreading across the world. You need to train your cadets to be fully qualified pilots over a serious of rigorous and tough training areas. From practising ejector seats, to G-Force gyroscopes to bomb assembly to parachute training. Are you ready?!<br/><br/>TIME FOR BATTLE!<br/>Once your training is complete, your squadron will be ready to unleash an attack of drones, fighter jets, airships and warplanes. You don’t need to become a tycoon or be some kind of capitalist or billionaire, just the best at training troops and a strategist for war.<br/><br/>TOP GUNS…<br/>You have a full air force at your disposal with some awesome planes to unlock, fly and do battle with. Become a top gun with these mighty fine beasts of the sky:<br/><br/>RQ-4 Global Hawk<br/>F-16 Fighting Falcon<br/>A-10 Thunderbolt<br/>C-130 Hercules<br/>SR-71 Blackbird<br/>F-35 Lightning II<br/>B-2 Spirit<br/>C-5 Galaxy<br/><br/>TAKE CITIES!<br/>Compete in a series of battles and wars where you need to take out ground troops, enemy airfields, communication satellites, destroy cities and take out the capital.<br/><br/>READY FOR ADVENTURE?<br/>Don’t bother being idle and going to the supermarket, hotel, water park, rollercoaster, just sign up to be a pilot and build your air force base to be the best in the world. Are you ready for adventure?<br/><br/>TRAINING PROGRAMME!<br/>The Training Program ahead of you is extensive, tough, but fun!<br/> <br/>EJECTOR SEAT - Emergency! Eject, eject, eject! The last chance to save your life so make sure you’re fully trained.<br/><br/>GYROSCOPE - Can you cope with the G-Force? Prepare your body to stay in control when you’re pulling some serious G.<br/><br/>GYM - You gotta be fit to be in our Air Force. So work it hard in the gym to be super fit.<br/><br/>BOMB ASSEMBLY TRAINING - There really is a right way to assemble a bomb. Learn well, or lose a few fingers.<br/><br/>WATER SURVIVAL - It’s not just the air you need to master. Make sure your squadron knows what to do in a crash landing.<br/><br/>PISTOL RANGE - Always be ready for hand-to-hand combat, this is war after all.<br/><br/>DRONE FLIGHT - Learn how to have an eye in every sky with the coolest drones in the air.<br/><br/>AIRCRAFT MAINTENANCE - Those planes don’t just stay in good working order by themselves. Keep your spanner handy.<br/><br/>FREE FALLING - Who doesn’t want to fly? Get some wind in your hair and learn to control your fall.<br/><br/>MARSHALLING - Control which planes enter and exit the barracks<br/><br/>RAPPEL - Spring into action and with only the aid of a rope learn how to properly throw yourself out of a plane.<br/><br/>SIMULATOR - When all the training is done, the simulator will make sure your squad is ready for the wars to come.<br/><br/>So if you think you have what it takes to create the best air force base in the world, to unleash your awesome jets on the enemy, then download Idle Air Force Base now!", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2020-05-25T02:07:08", "background_image": "https://media.rawg.io/media/screenshots/22e/22ed0458292ab634461001a061ccd3b1.jpg", "website": "http://www.neonplay.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Neon Play"], "genres": ["Strategy", "Simulation"], "publishers": ["Neon Play"], "esrb_rating": "Everyone 10+"}