{"id": 446940, "slug": "brick-trainfullkids-game", "name": "Brick Train(Full):Kids Game", "name_original": "Brick Train(Full):Kids Game", "description": "Labo Brick Train is an amazing  train building and driving app for children. It provides a virtual sandbox where children can freely build and play with brick trains.<br/><br/>In Labo Brick Train, children build unique trains by putting together pieces of colorful bricks like a puzzle. They can select from 60+ classical locomotives templates, which range from old steam train to powerful diesel locomotive to modern high-speed train. Optionally, they can create entirely new designs using various brick styles and train parts. Once a train has been built, the children can thus go on the railway and experience exciting adventures.<br/><br/>Features:<br/>1. 2 design modes:  template mode and free mode.<br/>2. 60+ classical locomotive templates in template mode.<br/>3. various brick styles, locomotive parts with 10 colors.<br/>4. classical train wheels,  and a large number of stickers.<br/>5. 7+ amazing railways, built-in a variety of mini-games.<br/>6. Share trains with other players and browse or download trains created by others online.<br/><br/>If your kids like Lego Train or Thomas trains, he will definitely like Labo Brick Train.<br/><br/>- About Labo Lado: <br/>We develop apps for kids that inspire creativity and pique curiosity. <br/>We do not collect any personal information or include any third-party advertising. For more information, please see our Privacy Policy: https://www.labolado.com/apps-privacy-policy.html <br/>Join our Facebook Page: https://www.facebook.com/labo.lado.7 <br/>Follow us on Twitter: https://twitter.com/labo_lado<br/>Support: http://www.labolado.com<br/><br/>- We value your feedback <br/>Feel free to rate and review our app or feedback to our email: app@labolado.com. <br/><br/>- Need Help <br/>Contact us 24/7 with any questions or comments: app@labolado.com<br/><br/>- Summary<br/>Children love transportation games, car games, train games and railway games. Labo Brick Train is a digital train toy, train simulator and train game for kids. It's an excellent game for kids and preschool. In the app, You will become a train builder and train driver. You can create trains or locomotives freely, or build classic locomotives from templates(George Stephenson's Rocket, Shinkansen High-Speed Train, Big Boy, Bullet, Concept Train, Monster Train, Metro, etc.). You can race your train on the railways. Labo Brick Train is a game for train fans and locomotive fans. It's a train game that train fans, Lego train enthusiasts, Thomas train fans will love. It's a game for boys 5+ and girls 5+.", "metacritic": null, "released": "2019-12-04", "tba": false, "updated": "2020-05-25T02:12:54", "background_image": "https://media.rawg.io/media/screenshots/adf/adf01143c9fa1e5d82a449c1106b264b_qm4u1wj.jpg", "website": "http://www.labolado.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Labo Lado"], "genres": ["Simulation", "Racing", "Educational"], "publishers": ["Labo Lado"], "esrb_rating": "Everyone 10+"}