{"id": 447057, "slug": "racing-thoughts", "name": "Racing Thoughts", "name_original": "Racing Thoughts", "description": "<p>Will Joseph be able to connect to those people important in his life?</p>\n<p><strong>Racing Thoughts </strong>is a game about connecting two people through a chain of shared thoughts. Joseph is stuck inside doing remote school work because of COVID-19. He falls asleep during psychology class and begins dreaming about no social distancing.</p>\n<p>Your person has 3 thoughts in their head. People around them have 3 thoughts as well. Click on a matching thought in order to connect to that person. Find your target as quickly as you can.</p>\r\nCredits\r\n<ul><li>Icons by FontAwesome- License</li><li>Josefin Sans by Santiago Orozco</li><li>DM Sans by Colophon Foundry, Jonny Pinhorn</li><li>Everything else by Me</li></ul>\r\nFeedback\r\n<p>How is the core mechanic (connecting to other people)? Is the screen too chaotic? What is one thing that you liked? What is something that would take this game to the next level? Anything else?</p>\r\nWhat's New for Me\r\n<p>This game I inadvertently focused on procedural generation. The music, the shades and locations of people, starting location, and thoughts are all based on the seed. I wasn't able to add in procedural palettes, obstacles, or chord progressions, but the foundation is laid for those to be added later.</p>\n<p>I also realized that I need to focus more on content and not systems. I built something that can be expanded, but it doesn't look that great.</p>\n<p>This was a first for cutscenes as well. I think I'm going to think some more about how to do it better, but I was happy with what I had.</p>", "metacritic": null, "released": "2020-05-24", "tba": false, "updated": "2020-05-25T02:35:46", "background_image": "https://media.rawg.io/media/screenshots/bb0/bb02e4ef009ca01008154a923a00785b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mpaul0416"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}