{"id": 447007, "slug": "binocular", "name": "Binocular", "name_original": "Binocular", "description": "<p>Observe the park to find characters or objects addressed in this task.<br/>Decide and select a correct service item to locate in the park.<br/>You will win the game if all the tasks are completed.<br/>You can restart or quit the game anytime to renew your achievements.<br/><br/></p>\n<p>LIFE as Learning in Interdisciplinary Focused Environment is a study course focused on project- and problem-based learning, where students from different study areas collaborate with academics and partners from outside university to carry out projects with interdisciplinary problems.<br/>Students perceive Research Methods as one of the most intimidating and unengaging university courses. Often they only realize its importance once they start working on their theses, negatively affecting their research quality. This is in part due to using traditional textbook-and-lecture instruction, which is insufficient for 21st century digital competences. Using games to teach research methods enables situated, active learning and can increase students’ motivation and understanding of the subject. Unfortunately, very few games focus on research methods.<br/>This LIFE project is a sub-project of a bigger initiative supported by HITSA.<br/>The purpose of the LIFE project is to choose specific topics from the field of research methods and suggest and develop ideas for research-related mini-games. These games can be used as standalone applications or part of the HITSA-supported adventure game (with the mini-games being quests in the bigger journey).</p>\n\n<p>Development Team:</p>\n<p>Vishnurai Maniyil<br/>Elizaveta Klevakina<br/>Andrei Bandurevski<br/>Franklin Chidera Anizoba<br/>Triin Kangur<br/>Osman Sinan Emiroglu<br/>Daniel da rocha Fróes <br/>Gabriel Ferreira Lopes França Malta</p>", "metacritic": null, "released": "2020-05-24", "tba": false, "updated": "2020-05-25T02:25:19", "background_image": "https://media.rawg.io/media/screenshots/eb5/eb539fb6ad8a13eebf94858692aa887a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["danielfroes"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}