{"id": 44700, "slug": "twincop", "name": "TwinCop", "name_original": "TwinCop", "description": "TwinCop is an action-packed cooperative twin-stick shooter with a retro vibe. You and a friend are TwinCop: one player controls the right arm, the other controls the left arm, and both of you control the feet. Synchronize your movements to heal and unleash TWINSANITY on the hordes of henchmen, pseudo soldiers, and cheeseheads that are threatening the streets of the greater Twin Cities metropolitan area.<br/>\n<br/>\r\nYou and your partner were the best cops in the greater Twin Cities metropolitan area until a horrific pontoon boat accident nearly killed you both. Your mangled bodies were then recovered, and using the most advanced science, were combined into one super-cop: TWINCOP. <br/>\n<br/>\r\nIt's your first day back on the force, and a call over the radio informs you that gangs of Packers fans are attacking bodegas and convenience stores throughout the city. You head out to investigate and quickly draw their attention. Now it's a fight for survival, but you can't help shaking the feeling...how did they get rocket launchers? Why convenience stores? This mystery gets deeper. . .way deeper. . . <br/>\n<br/>\r\nCUSTOMIZE YOUR COP<br/>\r\nGet started by selecting your half of TwinCop by using our patented Cop-O-Matic. Choose one of the eight most elite members of the Minneapolis/St. Paul police force, and customize their skin color. Then head out onto the streets and start fighting. <br/>\n<br/>\r\nWORK TOGETHER<br/>\r\nMove in the same direction as your partner to heal and charge up TWINSANITY, your super-charged ability that slows down time, heals you, and allows you to rain lead on miscreants. <br/>\n<br/>\r\nDEFUSE BOMBS &amp; OTHER MINIGAMES!<br/>\r\nThen take your skills to the next level by working together to diffuse bombs: cut the right wire and live, cut the wrong one and it's game over. It's a BLAST! Attempt to cross a busy street or operate half of a car!<br/>\n<br/>\r\nSPECIAL ABILITIES!<br/>\r\nThe TwinCop Program had near unlimited funding and was able to equip each participant with special skills, which we will implement. Skills like Dr. Fist's TurboPunch, a grappling hook, or a very slippery mackerel.", "metacritic": null, "released": "2019-10-11", "tba": false, "updated": "2019-11-04T02:15:56", "background_image": "https://media.rawg.io/media/screenshots/b4c/b4cd8fd843f6178390c20274515da5e4.jpg", "website": "http://finitereflection.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One", "macOS", "PC"], "developers": ["Finite Reflection Studios"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["Finite Reflection Studios"], "esrb_rating": null}