{"id": 44746, "slug": "behold-the-kickmen", "name": "Behold the Kickmen", "name_original": "Behold the Kickmen", "description": "BEHOLD THE KICKMEN started as a silly Twitter joke, and evolved like a beautiful flower into the year's least-exciting and mostly-incorrect Football Simulation. It's football, as seen through the eyes of someone with no understanding of, or interest in, the Laws of Football.<br/><br/>Start at the bottom of the Big Boring British Football Spreadsheet system and grind your way up, gruelling match after gruelling match, to become the best at the football that anyone's ever seen, and win the World Cup for your mantelpiece.<br/><br/>FEATURES: Kicking, Passing, Tackling, Squad Management and Doing Goals over and over. There's even a full Story mode, crammed with overblown melodrama and inane decisions to be made.<br/><br/><br/><br/><strong>TWO WAYS TO PLAY! </strong>Hate football? No problem! The entire game can be re-skinned at the flip of a switch into a Dystopian Future Bloodsport!<br/><br/><strong>PLEASE NOTE:</strong> Kickmen has NO ONLINE MULTIPLAYER and NO LOCAL MULTIPLAYER, it's Single Player ONLY. Please don't buy it thinking it's at all sociable, because it isn't. Why, you ask? Because I wanted to make a Single Player game, I didn't want to make a Multiplayer game.", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2020-12-16T15:24:22", "background_image": "https://media.rawg.io/media/screenshots/fc9/fc9112a4b6d32fde9364787c849b3522.jpg", "website": "http://www.sizefivegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 14, "owned": 389, "beaten": 2, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 9, "ratings_count": 2, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "macOS", "PC"], "developers": ["Size Five Games"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Size Five Games", "Ant Workshop"], "esrb_rating": "Mature"}