{"id": 44747, "slug": "slash-arena-online", "name": "Slash Arena: Online", "name_original": "Slash Arena: Online", "description": "Massively multiplayer online battles with swords and axes. <br/>Simple arcade action! Dodge the attack and choose a perfect time to strike.<br/>Upgrade your weapon, slash enemies, collect resources and reach the top!Battle Modes:★ Deathmatch — Player vs All mode for 30 players. Score the highest damage and survive to win.<br/><br/>★ Arena 1vs1 — ranking duel for hardcore players. Your skills mean more than your high-level weapon.Features:★ Rapid battles. Play 5 minutes or 5 hours. It’s all up to you!<br/>★ Swing your hammer and make 'em fly! Damage is calculated according to physical laws. Timing and distance matter!<br/>★ Two types of attack — enough to make your enemy suffer from a painful combo! Master your skills. <br/>★ Trading cards and achievements. Collect them all and make your friends jealous!<br/>★ Separate ratings for each Battle Mode. Monitor your progress.<br/>★ Monthly rewards for the best players. Earn a pile of resources and unique character portraits.<br/>★ Daily tasks. See if you can cope with them! &gt;:]<br/>★ Three characters with unique weapons and fighting styles. More characters are coming soon!<br/>★ More than 30 upgrade levels for each character’s weapon and armor. Start with a simple leather jacket and get to the legendary royal armor!<br/>★ Character’s appearance changes each 3 levels. Everyone will see how cool you are!<br/>★ Windows and MacOS support.<br/>★ Low system requirements. The game will run even on your granny’s PC.", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-08-23T12:12:20", "background_image": "https://media.rawg.io/media/screenshots/490/490a06938d58519cc93d4f6a166058ab.jpg", "website": "https://slasharena.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34}, "playtime": 4, "achievements_count": 14, "ratings_count": 1, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["DRUNKEN MONDAY"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["DRUNKEN MONDAY"], "esrb_rating": null}