{"id": 447468, "slug": "blaze-blackjack", "name": "Blaze Blackjack", "name_original": "Blaze Blackjack", "description": "<p>💰💰💰 Download our newly released free blackjack poker game in 2020 now and receive a lot of free chips immediately! 💰💰💰</p>\n<p>Join the world's most popular Blackjack Game and play free live with real players!</p>\n<p>Do you feel lucky? Play Poker online in this great multiplayer Blackjack Poker game.</p>\n<p>FEATURES:<br/>✓ FREE Chips!<br/>✓ Continuous Play – Start playing Blackjack on your phone, then continue playing on your tablet online against friends and enemies alike.<br/>✓ Leaderboard Challange</p>\n<p>HOW TO PLAY:<br/>Blaze Blackjack is a multiplayer classic Blackjack 21 game, get closer to 21 without exceeding 21 and  win the chips. It's that simple! Card counting definitely helps you earn some real money! Just like in Poker, the game is all about strategy plus not being afraid of losing real money. You'll be a shark and be earning cash fast!</p>\n<p>DISCLAIMER:<br/>Blaze Blackjack is a free, online, game of chance and skill for entertainment purposes only. It is not possible to win real money, real items/services/gifts or goods in kind by playing our skill games. The virtual currencies used in this game are called Chips and can be purchased in the ‘Store’ by using real money. Chips cannot be exchanged for cash or be paid out in any form and can only be used to play our game. Blackjack is intended solely for an adult audience.</p>", "metacritic": null, "released": "2020-05-23", "tba": false, "updated": "2020-05-25T04:36:28", "background_image": "https://media.rawg.io/media/screenshots/699/6992e649306af912e85de86c2c5781b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Blaze Casino"], "genres": [], "publishers": [], "esrb_rating": null}