{"id": 447469, "slug": "vegetables-sharks-ar", "name": "Vegetables Sharks AR", "name_original": "Vegetables Sharks AR", "description": "<p><strong>New Vegetables Sharks float right into your home!</strong></p>\n<p>Thanks to ARCore, you can play Vegetables Shark AR at home in the living room, in the garden, or wherever you want.</p>\n<p><em>How to play:</em></p>\n<p>Help the sharks eat all the vegetables. Only vegetables can give them the strength and vitamins they need.<br/>But sharks don't know what kind of food is in the barrels.<br/>If the barrels are filled with vegetables, the sharks must eat them. Otherwise, you can't let them eat anything else!<br/>You prepare the sharks for the desired action by touching.<br/>In order to prepare sharks, you have to remember what is hidden in the barrels.<br/>But watch out for other fish as well. You still have to be alert!</p>\n<p><em>Features:</em></p><p>- Vegetables Sharks in AR<br/>- 35 different skins for sharks<br/>- always a unique result picture, that you can share <br/>- fun animations and effects<br/>- pleasant music and sounds<br/>- a table of the best players and achievements<br/>- daily reward<br/>- AR mode or simple mode<br/>- simple controls<br/>- and other fishes</p>\n<p>Vegetables Sharks AR is based on the original game Vegetables Sharks.<br/>This is a memory game designed for children and adults. The game develops your attention, perception, and memory.</p>\n<p>You need a device that supports ARCore to play.</p>\n<p>-----</p>\n<p>Music:<br/>\"Hackbeat\" Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0<br/>http://creativecommons.org/licenses/by/3.0/</p>", "metacritic": null, "released": "2020-05-23", "tba": false, "updated": "2020-05-25T04:36:51", "background_image": "https://media.rawg.io/media/screenshots/ab8/ab837da93bf7be8b64cffd90b098c1ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sekip"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}