{"id": 4475, "slug": "uncharted-golden-abyss", "name": "Uncharted: Golden Abyss", "name_original": "Uncharted: Golden Abyss", "description": "<p>Golden Abyss is the fourth game in the Uncharted franchise, although it’s a spin-off rather than a part of the main series. It serves as a prequel to Uncharted 3: Drake&#39;s Deception. The player controls the series’ main protagonist, the adventurer Nathan Drake. In Golden Abyss, Drake arrives at an archeological dig site in Panama alongside fellow treasure hunters Marisa Chase and Jason Dante. Before they investigate the artifacts they found, Dante betrays his partners to a mercenary leader Roberto Guerro. The villains believe that the findings can lead to Quivira, a secret city of gold. Nathan and Marisa have to escape captivity and save the artifacts from the enemy.<br />\nGolden Abyss became the first Uncharted game released for a portable console, PS Vita, and it uses the console’s touch screen as part of the controls. Otherwise, the gameplay didn’t change much since the original Uncharted. It combines intricate platforming and acrobatics with the elements of a third-person shooter and puzzle-solving. One of the few features the game introduces is that Drake can use his journal and photo camera to search for clues to the puzzles and identify locations. Golden Abyss has no multiplayer options.</p>", "metacritic": 80, "released": "2011-12-17", "tba": false, "updated": "2024-03-09T22:12:40", "background_image": "https://media.rawg.io/media/games/b7f/b7ffc4c4776e61eca19d36d3c227f89a.jpg", "website": "", "rating": 3.81, "rating_top": 4, "added_by_status": {"yet": 64, "owned": 1205, "beaten": 355, "toplay": 58, "dropped": 74, "playing": 10}, "playtime": 16, "achievements_count": 55, "ratings_count": 403, "suggestions_count": 449, "game_series_count": 7, "reviews_count": 408, "platforms": ["PS Vita"], "developers": ["Bend Studio"], "genres": ["Action", "Adventure"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Teen"}