{"id": 447540, "slug": "not-alone-tonarede", "name": "Not Alone (tonarede)", "name_original": "Not Alone (tonarede)", "description": "OBS: Requer resolução de 1920x1080!! Pode ocorrer problemas de resolução caso a mesma não seja a especificada!\r\nOBS2: Só quero deixar claro que o jogo foi entregue com 3 minutos de antecedência, porém devido a um erro de comunicação com a equipe, um dos integrantes foi postar outro link e acabou postando o arquivo no lugar do antigo, assim o substituindo sem querer. Postamos novamente o jogo como foi entregue antes do final do prazo e apagamos a versão com update..\r\n<em>LORE</em>    \r\n<p>       No ano de 2020, após um meme com deboche sobre o Presidente dos Estados Unidos, Donald Trump declarou guerra contra organizações que apoiavam os memes.  A comunidade dos apoiadores de memes também ficou enfurecida com as atitudes infantis de Trump, dando início a Guerra Nuclear declarada pelo mesmo.<br/>Após uma semana de guerra, metade da população já havia sido dizimada, após 1 mês, restava somente 10% da população, e em um ano devido aos efeitos da radioatividade das bombas nucleares , alguns dos sobreviventes começaram a se transformar em monstros, entretanto, ainda existem humanos vagando pela terra.</p>\n<p>Not Alone tras como protagonista principal Dimitri Karkaroff, durante o período de guerra Karkaroff se encontrava em uma ilha treinando suas habilidades de combate contra os infectados (moradores da ilhas), satisfeito com o resultado o mesmo decide retornar para sua cidade para eliminar a enorme quantidade contida na sua capital, porém, começou a notar um comportamento estranho nos infectados e um aumento abusivo dos mesmos, os infectados destruirão seu barco  e estavam indo direto  para destruir sua base, será que Karkaroff conseguirá lidar com essa horda de monstros de noite e consertar seu barco durante o dia?!</p>\n<br/>OBJETIVO CENTRAL DO JOGO:\r\n<p>Reparar o barco de Karkaroff para sair da ilha.<br/><br/></p>\r\nINSTRUÇÕES DE CONTROLE:\r\n PC:\r\n<p>W - Mover para frente</p>\n<p>S - Mover para baixo<br/></p>\n<p>A - Mover para esquerda</p>\n<p>D -Mover para direita</p>\n<p>E - Interagir</p>\n<p>Q - Atacar</p>\n<p>Barra de Espaço - Atirar</p>\n<p>SETAS - Controle do menu</p>\n<p>ESC - Pausar o jogo</p>\r\nXBOX:\r\n<p>ANALÓGICO  ESQUERDO -  Controle do jogador</p>\n<p>A - Interagir</p>\n<p>X - Atacar</p>\n<p>SETAS E ANALÓGICO ESQUERDO - Controle do menu</p>\n<p>SELECT - Pausar o jogo</p>\n\r\nDESENVOLVEDORES:\r\n<p>Cesar Henrique Martins da Rosa - Programação</p>\n<p>Daniel Matos Quint - Programação e Sound Design</p>\n<p>Igor Dietrich Araujo - Arte e Animação</p>\n<p>Renan Barreto Brasil - Arte e Animação</p>", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2020-05-25T04:52:58", "background_image": "https://media.rawg.io/media/screenshots/dba/dba53936dd8c7ca36ade845a922e7e7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tonarede"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}