{"id": 44756, "slug": "virtual-temple-order-of-the-golden-dawn", "name": "Virtual Temple: Order of the Golden Dawn", "name_original": "Virtual Temple: Order of the Golden Dawn", "description": "Founded in London in 1888, The Order of the Golden Dawn was a secret magic fraternity. It counted amongst its members the likes of Aleister Crowley and W.B. Yeats. To become a member one must first have discovered the existence of the fraternity after which an invitation to join must have been extended. Upon accepting this invitation, one was initiated in a secret ritual designed to invoke occult energies.<br/>\n<br/>\r\nThis is a faithful recreation that first ritual the \"Neophyte 0=0 Grade\" as it is described in Israel Regardie's book \"The Golden Dawn\". All of the speaking roles are fully voiced by experienced members of the Seattle occult community. Further rituals will be available as DLC as they are completed.<br/>\n<br/>\r\nYou can witness the ceremony as it was intended to be first viewed - through the eyes of the candidate - or you can inhabit the body of any of the officers including several of the so called \"invisible officers\" giving you a giant's view of the proceedings. One of the view points allows you to walk around the temple room during the ritual to grab and inspect the various weapons and objects.<br/>\n<br/>\r\nWorks with both HTC Vive and Oculus Rift (built using Oculus SDK for better performance).<br/>\n<br/>\r\nPlease note that there are existing groups all over the world that are currently working these rituals with varying levels of professionalism and competency. Even though the scripts have been published for the public to read for more than a century, if you are seriously considering the path of the initiate we highly recommend that you not buy this app - all the proceedings are revealed (as best we understand them and our modest technical abilities are capable of representing them) and it would spoil your experience were you to take initiation in person. Further, these groups can provide guidance and fellowship to a level that a virtual community cannot, so if you enjoy this experience and want to learn more, we advise seeking one of these groups out. We are completely unaffiliated with any such group and cannot make recommendation, though many of the cast members are members of the Ordo Templi Orientis.", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-08-28T22:05:38", "background_image": "https://media.rawg.io/media/screenshots/b6d/b6de6e298d6929a204239c1a0859c9f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["keep silence"], "genres": ["Simulation"], "publishers": ["keep silence"], "esrb_rating": null}