{"id": 44752, "slug": "the-lighthouse", "name": "The Lighthouse", "name_original": "The Lighthouse", "description": "The Lighthouse is a first person thriller.<br/><br/>Your objective is to find Lily Beaumont by overcoming environmental obstacles and puzzles while also avoiding a dangerous presence following you. Use the light from The Lighthouse, along with your flashlight, to guide your way.Environments<br/>Explore through multiple environments with environmental specific puzzles and obstacles. While building the project, we knew that we wanted The Lighthouse's environments to be unique and memorable. We also wanted to make sure puzzles and obstacles were tangible and seemed grounded in the 1960’s, when technology wasn't as accessible as it is today.The Story<br/>The Lighthouse takes place on February 19, 1964. You play as James Irvine, a former detective turned private investigator in the state of Maine. Irvine is a man who solves the problems that the city doesn't have the inclination to follow-up on, little less solve. Many of the lucrative cases that come to his office are from locals with various requests, from spouses looking to expose infidelity in their relationships to business owners looking to gather enough evidence to incriminate their partners.<br/><br/><br/>February 19, 1964 is an important anniversary for Pt. Irvine as it’s the day he lost his first born, Lily, to cancer 7 years prior. Every year he visits her, placing a yellow lily and lit candle on her gravestone before watching it burn until extinguished. This tradition had never been broken - until today. As he packs to leave his office, candle in hand, he notices a letter slide under his door, the envelope marked: ‘Irvine.’<br/>He opens it and reads:<br/><br/>Mr. Irvine,<br/><br/>My daughter hasn't come home for 2 years, 4 months and 9 days. You see, she's missing. She was involved in the old lighthouse incident, you may remember her name - Lily. I've asked the local authorities to look for her, but they haven't got a clue. They tell me horrible things that no parent should hear. They tell me to accept that she may have died. Worst, they tell me they can't help. I can't sleep until I know where she is, if she's safe, if she's scared, and if she's trying to come home but can't find home. Help me find her. Look for her at the Lighthouse, as that was her last known location.<br/><br/>-Elizabeth Beaumont <br/><br/>Inside the envelope he finds an address and a single, yellow lily.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:38", "background_image": "https://media.rawg.io/media/screenshots/943/943357abda2a8681b54204354295e94b.jpg", "website": "http://www.shadowknightsstudio.com/TheLighthouse.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shadow Knights Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Shadow Knights Studio"], "esrb_rating": null}