{"id": 447648, "slug": "game-jam-dev-tycoon", "name": "Game Jam Dev Tycoon", "name_original": "Game Jam Dev Tycoon", "description": "Créé par Bob (Kalendhos) et Oxalotte\r\n<p>Vendredi, 18h pétantes, le thème est donné. Vous avez 60h pour développer votre jeu à partir de rien. Dans quels domaines allez-vous vous concentrer ? Quels seront vos choix ? Parviendrez-vous à être suffisamment efficace pour créer un jeu potable ?<br/></p>\n<p><strong>Aller, créez votre jeu ! </strong>Evidemment, vous n'avez aucune obligation de remplir les jauges au maximum ou d'accepter tous les ajouts.<br/></p>\n<p><strong>Et n'hésitez pas à partager une capture de votre jeu ensuite ;)</strong><br/></p>\n\r\nNotes\r\n<p>Le développement de <strong>Game Jam Dev Tycoon </strong>a débuté lors de la <strong>Potat0s Demake/Remake Jam</strong> mais a finalement opté pour un développement presque 8 fois plus long que la durée de la jam (Presque deux mois). L'origine est importante car le jeu est donc un remake très très libre de <strong>Game Dev Tycoon</strong>, un jeu où vous montez votre entreprise de création de jeux vidéo. Nous nous concentrons ici sur un seul jeu, créé en une durée limitée.<br/></p>\n<p>Tout a été créé lors de cette période (Code, images, musiques et sons), sauf clins d'oeil crédités en fin de jeu.</p>\n<p>Les musiques ont donc été créées par <strong>Oxalotte</strong> (Profil <strong>Soundcloud</strong>), et dans le temps imparti de la jam initial. <br/></p>\n\r\nFutures mises à jour\r\n<p>Probablement une version qui permettra de choisir manuellement les caractéristiques et ajouts du jeu, sans devoir refaire une partie ;)</p>", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2020-05-25T05:19:14", "background_image": "https://media.rawg.io/media/screenshots/571/57179f426c085e4714a6c393ba237a18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kalendhos", "Oxalotte"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}