{"id": 447695, "slug": "operation-covid-19", "name": "Operation COVID-19 (itch)", "name_original": "Operation COVID-19 (itch)", "description": "<p>Ever wanted to throw ridiculous amounts of toilet paper at giant viruses invading your home? Well here's your chance.</p>\n<p>Operation COVID-19 is an endless first person shooter in which you can give those viruses what they deserve: blow them all up!</p>\n<p><strong>FAST PACED</strong><br/>We made the game and even we can't keep up. You constantly have to be on the move in order to survive. Don't let your enemy surround you! Here are your survival strategies: </p>\n<p><strong>INFINITE TP</strong><br/>Using some quantum dynamics voodoo magic stuff, the TP-Gun 1000™ can generate an unlimited amount of TP projectiles. Watch that overheat bar though! Once the weapon jams, you'll be deep in it. Should this happen, use the next strategy.</p>\n<p><strong>PUSH FORCE</strong><br/>When everything goes south, use the TP-Gun 1000™'s secondary function: the Push Force. For a second, the generated force field will push away any viruses trying to infect you and give you a short moment to catch your breath. Jedi style!</p>\n\n<p><strong>POWER JUMP</strong><br/>Wait, what? There's more? Of course! When there are too many of them, activate the Power Jump function and the TP-1000 Gun™ will reverse gravity for you. That way, you can make it rain TP rolls from above and get rid of more dumb viruses.</p>\n<p><strong>COMBINE EVERYTHING. LOOK COOL AF.</strong><br/>The gif is pretty self-explanatory.</p>\n<p><strong>GOOD LUCK!</strong></p>\n<p><strong>FROM THE DEVELOPER</strong><br/>Hey! Thanks for checking out my first game. I made this alone while in quarantine by teaching myself game logic in Unreal Engine 4 with YouTube tutorials. It started out as a simple gag to make my kids laugh and it devolved (evolved?) into what you see now in all it's 1980s fueled glory. I really hope you'll enjoy what I put together and for 1$ I think you'll have your money's worth out of it. Next step will be to implement the Steam Achievements in a future update and hopefully many more features!</p>\n<p>You rock.</p>\n<p>-Dan Gaud</p>\n\n<p><strong>CONTROLS</strong></p>\n<p>WASD + MOUSE to move around</p>\n<p>E to open doors</p>\n<p>CTRL to crouch</p>\n<p>SPACEBAR to jump, double jump or triple jump.</p>\n<p>MOUSE LEFT CLICK to fire main weapon</p>\n<p>MOUSE RIGHT CLICK  to fire secondary push force function</p>", "metacritic": null, "released": "2020-05-21", "tba": false, "updated": "2020-05-25T05:28:35", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5d583a79fcc75760fe0f28bfd7a33ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Supernice"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}