{"id": 447761, "slug": "heroes-will-rise-2", "name": "Heroes Will Rise 2", "name_original": "Heroes Will Rise 2", "description": "<p><strong>Heroes Will Rise 2</strong> is the continuation of my first game. It has 4 players to choose, 3 maps to complete and a few enemies to kill. This demo is for testing purposes, bug fixing and more. I'm working on a Dialog System and a Campaign mode. Fell free to try it and leave your feedback so I can work on fixing the bugs and improve the gameplay.<br/></p>\n<p>I recommend to play with a controller or gamepad, it has support for Xbox controller, but you can use the x360 program for Windows to use any type of 3rd party controller.</p>\n<p>You also can play local multiplayer with your friend, both players with 2 different controllers. The game has controller vibration support too!</p>\n<p><em>The game is in English and Spanish.</em></p>\n<p><strong>Heroes Will Rise 2</strong> es la continuación de mi primer juego. Tiene 4 personajes para elegir, 3 mapas para completar y unos cuantos enemigos para matar. El propósito de esta demo es para probar su funcionamiento, corregir errores y demás. Estoy trabajando en un Sistema de Diálogos y el modo Campaña. Por favor pruébalo tu mismo y deja un comentario contando qué te pareció así puedo trabajar en corregir los errores y mejorar el gameplay.</p>\n<p>Recomiendo jugarlo con un gamepad, el juego tiene soporte para el control de Xbox, pero puede ser jugado con cualquier control si se usa el programa x360 para Windows.</p>\n<p>También se puede jugar de a dos en modo cooperativo local, cada personaje con su control. Además cuenta con soporte para vibración del gamepad!</p>\n<p><em>El juego está en Inglés y Español.</em></p>\n<p><strong>Minimum System Requirements:</strong>\n</p>\n<p>Windows 7 x64 and older.</p>\n<p>RAM: 4 GB</p>\n<p>2.5 GB Dowload, 5.5 GB Installed.</p>\n<p>GPU: AMD RX 550 - NVIDIA GTX 950</p>", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2020-05-25T05:41:01", "background_image": "https://media.rawg.io/media/screenshots/a4b/a4b7b29d3a266ac965609965b642f96d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nanopan"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}