{"id": 44773, "slug": "color-magnet", "name": "Color Magnet", "name_original": "Color Magnet", "description": "Color Magnet is a simple yet defying and addictive puzzle game that challenges your brain and sharpens your mental skills. <br/><br/>Shoot magnets to the board to attract blocks of the same color and get a combination of at least 5 to make them pop. Only the closest blocks in the same row and column will be pushed. Whatever you do, just remember: don’t let the blocks reach the bottom!<br/><br/>Relaxing and minimalist, with a clean and polished design, Color Magnet puts your puzzle skills to the test with its unique gameplay and clever concept.<br/><br/>Think strategically and be wise… It’s entirely up to you to become a truly Color Magnet Master!<br/><br/><br/>• THREE GAME MODES<br/>Try to beat your high score in Classic or challenge the world in Universal, where everybody plays the same sequence each time. If you’re willing to tease and dare your brain, try to clear the board across all levels in Puzzle!<br/><br/>• DAY AND NIGHT COLOR MODES<br/>Choose between a lighter style and a darker one, each suited to a specific time of your day.<br/><br/>• LEADERBOARDS<br/>Compete with your friends and the whole world, and prove that no one plays Color Magnet better than you!<br/><br/>• ACHIEVEMENTS<br/>Unlock the amusing and challenging achievements that Color Magnet has prepared for you!<br/><br/><br/>Come play and enjoy!<br/><br/><br/>Follow us<br/>F: facebook.com/topcreativestudio<br/>T: twitter.com/theonepixelcs<br/>I: instagram.com/theonepixel", "metacritic": null, "released": "2017-07-05", "tba": false, "updated": "2019-10-22T14:30:43", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa473c1bcfae5c8e115755d5166507d0.jpg", "website": "http://www.theonepixel.com/colormagnet", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The One Pixel, Lda"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["The One Pixel, Lda"], "esrb_rating": null}