{"id": 447782, "slug": "grim-tales-the-hunger-collectors-edition", "name": "Grim Tales: The Hunger Collector's Edition", "name_original": "Grim Tales: The Hunger Collector's Edition", "description": "Elephant Games presents another chilling tale in their bestselling family drama series Grim Tales!<br/>\n<br/>\r\nYour niece Jackie Gray has been murdered by a killer whose crimes went unsolved 17 years ago. Team up with Jackie’s policeman father and use your powers to go back in time and stop the killer before their murder spree claims Jackie’s life in the present! Will you be able to solve the cold case, or will the killer rise again to begin another reign of terror? Travel into the past to find all the clues – and the villain! Find out in this perplexing hidden-object adventure game!<br/>\n<br/>\r\n•\tRescue Alexander’s pregnant wife in the thrilling bonus chapter!<br/>\r\n•\tFind hidden puzzle pieces and morphing objects throughout the game! <br/>\r\n•\tUnlock the Secret Room for special quests! <br/>\r\n•\tEarn achievements and replay your favorite mini-games and HOPs.<br/>\r\n•\tEnjoy exclusive concept art, screen savers, music, videos, and more!<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2023-05-29T03:18:57", "background_image": "https://media.rawg.io/media/screenshots/771/77141904748c8db65019f2241efe9bb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 409, "game_series_count": 23, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Elephant Games", "Elephant Ar"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}