{"id": 447725, "slug": "two-bit-hero", "name": "Two Bit Hero", "name_original": "Two Bit Hero", "description": "It's not easy being a hero, especially if your city already has a superhero. Especially if that superhero has super strength and can fly! But what happens when a bunch of evil-doers with the power to glitch out reality itself take over a building, grab a few hostages and manage to overpower said superhero?<br/>Well, it is up to YOU of course to step up and prove to everyone that you are more than just a two-bit hero! Are you up to the task?<br/><br/>Two Bit Hero is a classic retro metroidvania - a retroidvania if you will - that sees you taking on the role of hero. Citizens have been trapped inside a skyscraper and you have to get in, power up, defeat the bad guys, save the people and get out again. But be careful when you encounter a glitch in reality, for it will transport you to a different reality altogether! But perhaps you can use that to your advantage?<br/><br/>Features:<br/><ul><li>Handcrafted Experience - Nothing is random<br/></li><li>Two large maps to explore - They are the same and yet different<br/></li><li>Carefully balanced gameplay - You'll have to glitch between both realities to progress<br/></li><li>Power up your character by collecting items spread throughout both maps<br/></li><li>Retro look and feel - Includes chiptune music by Trevor Lentz (X-O Planets, Citadale, Neon.Code)<br/></li><li>Easy mode for newcomers to the genre<br/></li><li>Three different endings</li></ul><br/>-------------------------------<br/>Controller Information:<br/>Due to limitations with the engine, some controllers, for example 8bitdo gamepads, may not work properly. There is, unfortunately, nothing I can do about that. Should you have any trouble with your gamepad, maybe try another gamepad or use the keyboard. I apologize for the inconvenience.", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2020-08-27T19:30:55", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c5eadd84f44ae2a55eecaa89830efa7.jpg", "website": "http://www.ezekiel-rage.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Spike", "Ezekiel Rage"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Plug In Digital"], "esrb_rating": null}