{"id": 447704, "slug": "classroom-catastrophe-phantom-echo", "name": "Classroom Catastrophe (Phantom Echo)", "name_original": "Classroom Catastrophe (Phantom Echo)", "description": "<p>CLASSROOM CATASTROPHE</p>\n<p>Our game is called classroom catastrophe. You play as a student who completes dares given to you by your friends which earns you likes. The risk of the game is that the teacher scans the room to see what the students are up to, if you get caught doing a dare you lose likes and fail the level. To avoid being caught you can hide under the desk or cause a distraction.</p>\n<p><em>Play as a young fame-chaser, hoping to find his next big break in the most uncanny of places - the classroom. </em></p>\n<p><strong>WELCOME TO CLASSROOM CATASTROPHE!</strong></p>\n<p>Classroom Catastrophe is a single player, isometric, strategy game - Receive and complete dares from fellow classmates while they keep constant cameras on you! Watch as your Likes rise and fall, and make sure you dont get caught by the teacher!</p>\n<p>Get your hands dirty! Make sure you're in and out of each dare as quickly as possible, but ensure the teacher doesnt catch you or InstaFam won't be pleased! </p>\n<p><strong>INSTRUCTIONS</strong>\n</p>\n<p>&gt; Wait for your friends to send you dares, they'll show up on the little phone on your screen.\r\n&gt; You must complete the dare to receive likes! if you fail the dare, you lose likes and can't re-try! <em>god.. imagine having negative likes\r\n</em>&gt; Once you've completed the dare, head back to your chair to receive the next dare!</p>\n<p><strong>CREDITS</strong>\n</p>\n<p>Benjamin Keogh - Programming and GFX (TEAM LEAD)</p>\n<p> Adam Beckett - Modelling (PROGRESS MANAGEMENT) </p>\n<p>Thalia Thompson - Modelling, Audio and GFX (TEAM SUPPORT)</p>\n<p> Joseph Risley - Modelling and UI Design</p>\n<p> Elliot Nisbet - Animation, UI and Art</p>\n<p> Kornelia Potoczek - Animation and Art</p>\n<p>We are a team of 6 games design students studying at Priestley College, Warrington, UK. This project tied up our second, and final, year in college. The majority of this game was developed in lockdown due to COVID-19, which heavily effected our practices.</p>", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2020-05-25T05:30:39", "background_image": "https://media.rawg.io/media/screenshots/3d4/3d403afcab9411bd15590f9d024e4b21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phantom Echo"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}