{"id": 44776, "slug": "unlucky-13-addictive-block-puzzle-game", "name": "Unlucky 13 - Addictive block puzzle game", "name_original": "Unlucky 13 - Addictive block puzzle game", "description": "Challenge your brain with our relaxing, minimal, block puzzle game! Warning: It’s ridiculously addictive!<br/><br/>Unlucky 13 is an endless block game, created for puzzle lovers of all ages!  It’s made by Total Eclipse, developers of the hit brain-training game “A Clockwork Brain”.<br/><br/>Give yourself a challenge, stay mentally fit, and unwind at the same time. No timer and no countdowns! Use your calculation and perception skills and a wide range of tactics to dominate the board! <br/><br/><br/>[REVIEWS FROM HOPELESSLY ADDICTED PLAYERS]<br/><br/>- “An excellent game incredibly addictive and innovative.”<br/>- “Superb game! Reminds me the fun I had with Tetris! I'm addicted to it. Thank you for those hours of fun!!”<br/>- “Great game! The \"continue where you left off\" feature is awesome!”<br/>- “It's tetris. . Oh wait.. not..damn... What time is it?”<br/>- “Outstanding!!! Already addicted to this game!!! Just try it.”<br/><br/><br/>[HOW TO PLAY]<br/><br/>Place blocks on the board and make lines with tiles of any color. If you connect 13 or more tiles of the same color, you lose! If a block won’t fit anywhere on the board, you lose. Just press ‘Play Again’! :)<br/><br/>• Fine-tune your strategy: Rotate the blocks and place them just the way you want!<br/>• Stay on your toes with increasing board progression and difficulty! Start off with a 6x6 board and try to reach 10x10!<br/>• Use the Block Refresh power up to get new blocks, if things gets sticky!<br/>• Encounter over 40 unique shapes, most different than ones in other block games!<br/>• A risk-taker? Try to make lines with one color, risk losing, but get a much larger score!<br/>• Want to feel super lucky? Activate the Lucky Clover and get an extra life just as the game is over!<br/><br/><br/>[FEATURES]<br/><br/>• Easy to pick up and play, but make no mistake - tough to master! Fun, simple, and addictive gameplay!<br/>• Play at your own pace: Use the auto-save feature, and resume whenever you want!<br/>• Minimal &amp; balanced, gorgeous, graphics, and upbeat music &amp; SFX!<br/>• Love customization? Unlock more than 10 beautiful, minimal, and soothing themes!<br/>• Achievement hoarder? There are some crazy, tough, and weird ones to discover!<br/>• Heading for the top of the charts? Show the others who’s boss by participating in the leaderboards!<br/>• Share your high scores and invite your friends to join the competition!<br/><br/><br/>The board is yours. Time to shine!", "metacritic": null, "released": "2017-07-12", "tba": false, "updated": "2019-10-22T14:30:43", "background_image": "https://media.rawg.io/media/screenshots/40e/40ed25add25d9b623e25508d9dad9219.jpg", "website": "http://www.unlucky13game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Total Eclipse P.C."], "genres": ["Family", "Puzzle"], "publishers": ["Total Eclipse P.C."], "esrb_rating": "Everyone 10+"}