{"id": 447824, "slug": "disaster-report-4-summer-memories-demo", "name": "Disaster Report 4: Summer Memories Demo", "name_original": "Disaster Report 4: Summer Memories Demo", "description": "The full version of Disaster Report 4: Summer Memories is available on GOG.com. You can see it  here.\n<br/>\nThrust into a tragedy that touches countless lives, you must now make the decisions that will determine who lives and who dies in the chaos stemming from a natural disaster. What will you do in the aftermath of calamity?\n<br/>\n<br/>\n<br/>\nWhen a massive earthquake strikes the city you’re visiting, you find yourself at the epicenter of a chaotic and catastrophic crisis. It’s up to you to rise above the calamity, gather your thoughts and your fellow survivors, and outlast the disaster. Aftershocks, fires, collapsing buildings and debris, and unstable ground are but a few of the threats you’ll face in these nightmarish circumstances. What will you do when every passing second and every snap decision could spell the difference between life and death?\n<br/>\n<br/>\n<br/>\nYour World in Chaos - In a city on the brink of collapsing, you’ll need to make split-second decisions that will impact your safety as well as that of others.\n<br/>\n<br/>\n<br/><br/>\nEverybody's Got a Story - Meet your fellow survivors in a Japanese-inspired city devastated by a powerful earthquake, and see how the human spirit bends...and sometimes breaks.\n<br/>\n<br/>\n<br/><br/>\nDanger at Every Corner - Navigate a multitude of crises—from collapsing buildings to raging fires—in a city aplomb with peril.\n<br/>\n<br/>", "metacritic": null, "released": "2020-04-06", "tba": false, "updated": "2020-05-29T02:13:29", "background_image": "https://media.rawg.io/media/screenshots/10f/10f5399ba797280ea3f0719c279f0840.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 67}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Granzella"], "genres": [], "publishers": ["NIS America"], "esrb_rating": null}