{"id": 447825, "slug": "sherlock-holmes-chapter-one", "name": "Sherlock Holmes: Chapter One", "name_original": "Sherlock Holmes: Chapter One", "description": "<p>His legend begins with you!<br />\nBefore he was the world’s greatest detective, Sherlock Holmes was a brilliant rebel itching to prove himself. When an old wound compels him back to the Mediterranean shore where his mother died, it seems like the perfect opportunity to do just that—but beneath the vibrant urban veneer of the island, the rhythm of island life strikes a more ominous beat. Crime and corruption, a twisted sense of justice and morality... These are just a few stumbling-blocks in Sherlock’s quest for truth.<br />\nAs Sherlock, your legacy is written by the decisions you make in this open world. Deception, violence, and deduction are just a few resources in your arsenal—your mysterious companion and sounding board, Jon, is another.</p>\n<p>Whether you choose brute force to solve problems or stay one step ahead of your enemies by using your wits to spot vulnerabilities, you decide what each situation demands as you hone your investigative skills. It’s time to confront your past so you can become the legend you’re destined to be.</p>\n<p>KEY PILLARS:</p>\n<p>The Man Before: As a cavalier young Sherlock on the precipice of adulthood, you’ll earn your reputation in a way no game or story has explored before. We’ve never seen the youthful arrogance and naiveté of the man before the legend—now you’re living it.<br />\nGlobal Investigation: You never know where your next clue will come from. Explore and exploit the entire city in your pursuit of truth, using clues, rumors, disguises, tags, and pinned evidence to build a solid case within your mind palace.</p>\n<p>And Stay Down: Weapons might help you in a pinch, but there’s something to be said for style—and you have it in spades. Spot enemy vulnerabilities with your brilliant observation skills, or exploit the environment to take someone down while keeping your own hands clean.<br />\nA Different Jon: Before John Watson, there was a different Jon - your best and only friend. But who is he, really?</p>\n<p>A Darkening Tide: A vibrant open-world island in the Mediterranean promises anything but paradise. Political corruption and crime run rampant while the islanders cling to tradition and eschew outsiders, making your job even more difficult.</p>\n<p>Truth and Lies: There are two sides to every story, and the proud islanders have their own ideas about truth and justice. It’s up to you to decide whether uncovering the truth will do more harm than good—and how that will shape the man you’ll become.</p>", "metacritic": 74, "released": "2021-11-15", "tba": false, "updated": "2024-04-11T01:56:27", "background_image": "https://media.rawg.io/media/games/60c/60ca6f84551e6f5435d97b603a77d551.jpg", "website": "https://sherlockholmes.one", "rating": 3.57, "rating_top": 4, "added_by_status": {"yet": 76, "owned": 216, "beaten": 56, "toplay": 198, "dropped": 18, "playing": 12}, "playtime": 5, "achievements_count": 156, "ratings_count": 74, "suggestions_count": 470, "game_series_count": 1, "reviews_count": 74, "platforms": ["Xbox One", "PlayStation 4", "Xbox Series S/X", "PlayStation 5", "PC"], "developers": ["Frogwares"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": ["Frogwares"], "esrb_rating": null}