{"id": 447828, "slug": "vagrus-the-riven-realms-prologue", "name": "Vagrus - The Riven Realms: Prologue", "name_original": "Vagrus - The Riven Realms: Prologue", "description": "<strong>Vagrus - The Riven Realms: Prologue</strong> is an early Demo to <strong>Vagrus - The Riven Realms</strong>, a roleplaying game with a narrative focus, open-world exploration, and strong elements of strategy. The player takes the role of a vagrus - a caravan leader who strives to survive in a strange and dangerous dark fantasy world by leading a traveling company on all kinds of ventures.<br/><br/><strong>Vagrus</strong>  is currently in development (in late Alpha) but it already has over fifty hours of playable content. The game is coming to Steam in the form of Early Access in the near future.<br/><br/>This Demo showcases the beginning sections of the game - both from the more narrative-driven introductory part and from the open-world main campaign.<br/><br/><br/><br/><br/>A vast realm is yours to explore, filled with unique locations, strange factions, and a colorful cast of characters. In order to punish the Empire for its sins, the Elder Gods unleashed their power a thousand years ago that ended up devastating the realms. The continent is now a wasteland, riddled with arcane anomalies, swarming with twisted monsters, and haunted by roaming undead even after long centuries of rebuilding.<br/><br/><br/><br/><br/><br/><br/>A large selection of stories make up the game’s narrative in the form of events and quests. The choices you make in these often affect your companions and the world around you. Pick your background from trader, mercenary, or explorer; work for factions, follow rumors and trading opportunities; acquire wealth, gain fame, and discover hidden knowledge.<br/><br/><br/><br/><br/><br/><br/>Engage in turn-based, tactical combat that involves your companions and a large variety of enemies, both humanoid and monstrous. Use a wide range of character skills as well as your own leadership-related abilities to succeed. Positioning and support skills are of paramount importance in these challenging engagements.<br/><br/><br/><br/><br/><br/><br/>Journeys have to be planned and prepared for carefully, lest they end in disaster. Manage your supplies, morale, and your crew’s vigor effectively to survive. Haul cargo and valuables across the wasteland or take it from others. Your crew of workers, fighters, scouts, and slaves have to be managed well to optimize their effectiveness.<br/><br/><br/><br/><br/><br/><br/>Recruit from a wide variety of companions to have them serve in versatile caravan roles, such as scoutmaster, guard captain, treasure hunter, or beast handler. Each companion comes with unique combat skills, background stories, and personal quest lines that can upgrade them further when you complete them.<br/><br/><strong>Follow</strong> and<strong> Wishlist Vagrus now.</strong>", "metacritic": null, "released": "2020-05-26", "tba": false, "updated": "2020-08-27T17:09:56", "background_image": "https://media.rawg.io/media/screenshots/ec4/ec43e63baa9ec0d508855f91b36d1d44.jpg", "website": "https://vagrus.com", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 14, "owned": 186, "beaten": 1}, "playtime": 1, "achievements_count": 2, "ratings_count": 5, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "macOS", "Linux"], "developers": ["Lost Pilgrims Studio"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Lost Pilgrims Studio"], "esrb_rating": null}