{"id": 447816, "slug": "prison-architect-island-bound", "name": "Prison Architect - Island Bound", "name_original": "Prison Architect - Island Bound", "description": "<p>Welcome to The Rock, Wardens!</p>\n<p>Prison Architect: Island Bound introduces more ways to build and manage your prison with helicopters, ships, and lots of water.</p>\n<p>Key Features<br />\nSea and Air<br />\nUpgrade your prison’s logistics with a variety of ferry and helicopter transport options that deliver supplies and inmates directly to docking areas around your compound. However, there are also more access points to sneak contraband into the prison.<br />\nChain Link Up<br />\nMaximize your prison’s efficiency by linking docks, helipads, and roads to specific deliveries. You can even toggle what services are available to each delivery point within your compound.<br />\nSupermax Security<br />\nNew security objects make it easier to search deliveries and prisoners as they enter the prison, or at key security checkpoints. Additional emergency services can be called when things get out of hand, including Air Firefighters, Elite Ops Teams, and Air Paramedics.<br />\nIsland Life<br />\nCustomize your Island or Connected Island Plot with over fifteen nautical tiles and objects. Shape the land around your compound with moats, rivers, and lakes for security, or for style -- no access roads needed!<br />\nThe Rock<br />\nManage the world’s most famous prison with two premade maps: Alcatraz Prison and Alcatraz Island.</p>", "metacritic": null, "released": "2020-06-11", "tba": false, "updated": "2022-08-30T17:05:21", "background_image": "https://media.rawg.io/media/screenshots/c09/c09dd344d2beaec32f4716e63ffac1a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 2, "platforms": ["Xbox One", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["Double Eleven"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}