{"id": 447912, "slug": "a-toda-pastilla", "name": "A Toda Pastilla", "name_original": "A Toda Pastilla", "description": "<strong>Concepto<br/></strong>\n<p>A Toda Pastilla es un Bullet Hell en el que tu misión será empastillar a todos los ancianos que se crucen por tu camino, a los mandos de 2 personajes jugables, Witerico y Teodegonda, junto a las mejoras que encuentres por el camino, como mejoras para tu arma, escudos, y la temible Bomba Eutanásica.</p>\n\n<strong>Personajes<br/></strong>\n<p>Witerico: Es un portento que cultiva su cuerpo en el templo para curar a la gente a pastillazos. Viaja en una nave jeringuilla que dispara pastillas.</p>\n<p>\n</p>\n\n\n\n\n<p>Teodegonda: Es una fabricante de explosivos frustrada que se tuvo que meter a médico, y se construyó su propio cañon lanzapastillas para curar a la gente.</p>\n<p>\n</p>\n\n\n\n\n<strong>Enemigos<br/></strong>\n<p>Hermenegildo: Paciente terminal que buscará llevarse compañía a la tumba a los mandos de su camilla voladora con ametralladoras incorporadas.<br/></p>\n\n<br/>\n<p>Riciberga: Paciente de coronavirus que sale a la calle para intentar infectarnos, con su silla de ruedas y su bastón.</p>\n\n<br/>\n<p>Canuto: Paciente tradicionalista que preferiría incluso el tratamiento con homeopatía, y que se encuentra muy enfadado porque no le tratan como al él le gustaría.</p>\n<p>\n</p>\n\n\n\n\n<p>A Toda Pastilla ha sido creado con Motor Casa Paco, la última tecnología en creación de videojuegos, basado en Ogre, SDL, FMOD, Bullet Physics y CEGUI.</p>", "metacritic": null, "released": "2020-05-28", "tba": false, "updated": "2020-05-29T02:47:09", "background_image": "https://media.rawg.io/media/screenshots/e30/e3046decf4f1909e7ee0ac449d6b1df0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FreeStylers"], "genres": ["Action"], "publishers": [], "esrb_rating": null}