{"id": 447961, "slug": "the-gunslinger-2", "name": "The Gunslinger 2", "name_original": "The Gunslinger 2", "description": "<p>The gunslinger 2 has 6 bosses, 50 levels and many songs.</p>\n<p>It is a top down shooter but the player can only interact with the environment remotely to kill enemies and to move stuff around the level with the cursor.</p>\n<p>The enemy AI has been drastically improved. They can move around walls, sense what objects you are interacting with and can use certain items against you. An example would be that if you use the cursor to move a sword and a yellow enemy sees it, it will shoot at it to destroy it since it now sees it as a enemy. So when you attack with swords you have to move the sword erratically so the enemy cannot shoot and destroy the sword leaving you defenseless. Yellow enemies can sense when you are moving certain walls and will rush you when doing so. green enemies see the sword as an obstacle and will try to walk around the sword. There are enemies that are fully random until you are close to them or certain objects. There are turrets that always aims at the player but can destroy items with their bullets. Each level has limited weapons or no weapons for the player to use you have have to me careful. Some levels can be beating without killing while some you are forced to. Player movement and object management is necessary for survival. <br/></p>\n<p>I added a bunch of shaders so the game looks decent. It actually really helps make the game look better overall. There is a bunch  art added that is much better looking than the art in my past games.</p>\n<p>Music has been redone overall to be better and to fit the game more. The songs are shorter but more catchy or thematic.</p>\n<p>Overall I really like how the game came out. There were some mechanics I was playtesting that I ended up removing due to it not being fun (player couldn't really use them and enemies would exploit the certain mechanics and actively punish players for allowing enemy bullets to miss and you have to make enemy bullets miss so it wasn't fun) <br/></p>", "metacritic": null, "released": "2020-05-28", "tba": false, "updated": "2020-05-29T03:01:05", "background_image": "https://media.rawg.io/media/screenshots/43e/43ecc24a7721a7d3833d60011785f3ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evilous"], "genres": ["Action"], "publishers": [], "esrb_rating": null}