{"id": 44800, "slug": "helium-rain", "name": "Helium Rain", "name_original": "Helium Rain", "description": "Build your fleet, trade, explore and conquer<br/>Helium Rain is a single-player space simulation that places you at the helm of a spacefaring company. Trade resources, buy ships and stations to fulfill contracts ! Dock at stations to buy and sell you wares or upgrade your ship, upgrade your technology to be more efficient and militarize your fleet to prevent piracy. <br/><br/>You will need to master both real-time action and long-term strategy: destroying a freighter has a direct impact on the economy, while declaring war will make your spaceflight environment slightly more hostile...<br/><br/>A world that feels real<br/>Your ships have generators, radiators, weapons, engines, cargo bays or life support systems - they all work together. Every thruster on your ship plays a role. Aim for engines to pin down your enemies, or send them spinning around by destroying power stations. Most ships have more than thirty individual parts ! You can customize the most important parts of your ships - your main engines, attitude control thrusters, weapons and hull colors.<br/><br/>Your competitors are independent factions, companies with the same goal as yours - ruling the system. They will try to undercut you, or even attack you if you become a threat to them. But don't be too quick to destroy them, as war can break the supply of resources you depend on ! Attacking freighters will destroy resources, making them costlier, with the potential to cause an economic crisis.<br/><br/><br/><br/><ul><li> <strong>12 playable ships with weapon and engine upgrades</strong><br/>Build and fly fleets of fighters, bombers, cargos, corvettes or capital ships. Buy new engines and weapons. <br/></li><li> <strong>Fast-paced combat with a Newtonian flight model, full joystick support</strong><br/>There is no speed limit in Helium Rain. You can fly at half a mile a second while aiming backwards. Beware of asteroids.<br/></li><li> <strong>Realistic economy model</strong><br/>Take advantage of an accurate simulation of space trade to be the most competitive company. If diplomacy fails, blockades are in order.<br/></li><li> <strong>Localized damage model for spacecrafts</strong><br/>Aim for critical systems in order to disable ships, kill their crew or capture targets.<br/></li><li> <strong>A planetary system to explore</strong><br/>Explore around 25 sectors orbiting the gas giant Nema and its moons.<br/></li><li> <strong>Procedural contracts, world exploration, technology upgrades</strong><br/>Pick contracts and build your empire to become the largest company.</li></ul>", "metacritic": null, "released": "2017-08-18", "tba": false, "updated": "2019-08-28T22:05:37", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a94142a021b076c609d05596c57d5e6.jpg", "website": "http://helium-rain.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 16, "owned": 109, "toplay": 2}, "playtime": 2, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Deimos Games"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Deimos Games"], "esrb_rating": null}