{"id": 448159, "slug": "gamesforairports", "name": "GamesForAirports", "name_original": "GamesForAirports", "description": "<p>Play using WASD or the Arrow Keys,<br/></p>\n<p>avoid the lasers, collect the gems, </p>\n<p>listen to the sounds.</p>\n<p>---</p>\n<p>This game is a sort of cover of the generative track 2/1 from Ambient 1: Music for Airports by Brian Eno, you can read more about that album from it wikipedia page here. Rather than covering the music directly, I used similar methods to generate the noises and then used those same methods to create the game space that the game takes place in. When tones are made, lines are created across the space for the player to avoid.</p>\n<p>I first learnt about how this music was generated whilst looking at this fantastic website by Tero Parviainen. The site explains some different ways generative music is created. I then looked deeper into Brian Eno's album from and article on Reverb Machine. </p>\n<p>From these sources got the tones used and the relative size of the tape loops, or the wheels in my game from this information. As there were seven tones used, I tried to keep the theme of seven going through the game. In addition the loops and circles in some ways represent both a vinyl record spin on a player, and the loops of tapes.</p>\n<p>To create the tones I used http://onlinetonegenerator.com/ in combination with information from https://pages.mtu.edu/~suits/notefreqs.html</p>\n<p>The font used is Montserrat.</p>", "metacritic": null, "released": "2020-05-28", "tba": false, "updated": "2020-05-29T03:42:23", "background_image": "https://media.rawg.io/media/screenshots/44f/44f47da01d74affe36fa7931da822aef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David King Made Some Games"], "genres": [], "publishers": [], "esrb_rating": null}