{"id": 448325, "slug": "ghost-hunt-cavagames", "name": "Ghost Hunt (CavaGames)", "name_original": "Ghost Hunt (CavaGames)", "description": "<p>WARNING: This game contains some disturbing and graphic scare events. This game is not recommended for people with heart diseases or children below the age of 14. If you fall under the stated people, play at your own risk!</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n\n<p>---------------------------------------------------------------------------------------------------<br/></p>\n<p>What happens when you go on a Ghost Hunt to an allegedly haunted location which has a sinister past, a dark history, with the curiosity of finding out if Ghosts are real and with the wish to be able to capture real paranormal activity on the camera, to be able to prove if Ghosts are real. But what happens when your adrenaline filled, casual ghost hunt turns out to be your worst nightmare!</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Ghost Hunt is an atmospheric survival horror game developed by Cava Games. <br/></p>\n<p>Cava Games Website: www.cavagames.weebly.com<br/></p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Plot of the game:</p>\n<p>                 The story of ghost hunt revolves around an amateur ghost hunter, who has been on several ghost hunts, but never found a compelling evidence of the paranormal. During one of his casual ghost hunts, he decided to visit an abandoned building in the Ravenhill area of Kentucky. The mistake he makes is that he goes there, ALONE. He begins his ghost hunt thinking as if it would be a normal ghost hunt as well, and nothing paranormal is gonna show up this time either, but what happens inside, changes him. He comes face to face with his darkest fears. <br/></p>\n<p>                      In the game, you will be given a few usable objects at the beginning of the game. These objects will be useful for the player to give the player a headstart. Be careful, the entities the lurk in that darkness could be anywhere, could attack anytime. Stay vigilant. Look everywhere. Inspect everything. You might just find something that could save your life. There are secrets hidden in the building, you must find them in order to be able to get out. Best of luck         <br/></p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Install Instructions:</p>\n<p>Once you purchase the game, you will get access to all the 3 files included. You need to download all three files to be able to install the game. The included files contain 2 archive files, which contain the setup of the game, and one is a text file, which has the Auto generated unique key. </p>\n<p>Once all files are downloaded, extract both archives in one folder. Ghost Hunt's installer will be extracted. Run the setup as administrator. Follow the procedure to install the game. When the password dialog prompts, copy and paste your auto generated unique key in the password box and click continue. Now, you shall be able to install the game without any problems. <br/></p>\n<p>If you incur any problems while the installation or during the game play, send us an email, we will always be ready to help. (Cava Games email adress: cavagames03@gmail.com)</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>System Requirements: <br/></p>\n<p>Minimum:</p>\n<p>Windows 7/8/8.1/10 (64bit ONLY)<br/></p>\n<p>Intel i3 @2ghz</p>\n<p>A GPU with at-least 2gb Video Memory</p>\n<p>4gb RAM <br/></p>\n<p>4gb Hard disk space</p>\n<p>Recommended:</p>\n<p>Windows 7/8/8.1/10 (64bit ONLY)</p>\n<p>Intel Core i7 7th Gen @4.5ghz</p>\n<p>A GPU with 4gb Video Memory</p>\n<p>8gb RAM</p>\n<p>4gb Hard disk space<br/></p>", "metacritic": null, "released": "2020-05-27", "tba": false, "updated": "2020-05-29T04:22:36", "background_image": "https://media.rawg.io/media/screenshots/c03/c039d3dbf5b2447f1b1163700d362c6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CavaGames"], "genres": [], "publishers": [], "esrb_rating": null}