{"id": 4483, "slug": "duke-nukem-forever", "name": "Duke Nukem Forever", "name_original": "Duke Nukem Forever", "description": "<p>Duke Nukem is a larger-than-life macho who smokes cigars, speaks in one-liners, and has a kink for hot girls and big guns. Twelve years ago, Duke defeated invading aliens and became a worldwide celebrity, but now another invasion forces him to go out of retirement. He has to save all the Earth&#39;s women, who are being kidnapped by aliens. Most weapons are the same as in the original game. However, this time Duke cannot carry all his arsenals and is restricted to only two weapons at a time. He can also use “holoduke”, a holographic version of himself, to distract enemies. Duke restores his health over time using a new mechanic of “ego bar” — a measurement of Duke’s enormous ego that needs to be bolstered.</p>\n<p>This belated sequel to Duke Nukem 3D spent 15 years in development, so it may feel like an artifact from another era. This is especially obvious from the game’s vulgar black humor. The protagonist may urinate, drink beer, and tell somewhat chauvinistic jokes about women. There&#39;s also controversial Capture the Babe multiplayer mode, based on &quot;capture the flag&quot;, but instead of flags, there are girls that have to be spanked.</p>", "metacritic": 54, "released": "2011-06-09", "tba": false, "updated": "2024-04-06T12:52:22", "background_image": "https://media.rawg.io/media/games/08a/08aa92e004f13ad2d41127327314c3f9.jpg", "website": "http://www.dukenukemforever.com", "rating": 2.87, "rating_top": 3, "added_by_status": {"yet": 109, "owned": 2432, "beaten": 393, "toplay": 31, "dropped": 221, "playing": 7}, "playtime": 3, "achievements_count": 235, "ratings_count": 536, "suggestions_count": 677, "game_series_count": 10, "reviews_count": 538, "platforms": ["Xbox 360", "PlayStation 3", "Xbox One", "PC", "macOS"], "developers": ["Gearbox Software", "3D Realms", "Piranha Games", "Triptych Games", "triptych"], "genres": ["Action", "Shooter"], "publishers": ["2K Games", "Aspyr"], "esrb_rating": "Mature"}