{"id": 448379, "slug": "rastooty", "name": "Rastooty", "name_original": "Rastooty", "description": "<p>Play as an assassin who must find and stealthily kill his target in a randomly generated world.<br/></p>\r\nNote\r\n<p>Hi, </p>\n<p>I've been working on something new for these past months. I think that it's time that you guys try it. The main reasons why I released this prototype is because I want feedback and some help with adding new features (Ideas and Financial help). </p>\n<p>Rastooty is an internal code name. Ra = Random, St = Stealth Ooty = Shooty/Shooter.</p>\r\nFeatures\r\n<ul><li>Top down shooter.</li><li>Random worlds. Makes your playthrough unique.</li><li>5 Different and Unique Weapons.</li><li>Challenging GamePlay.</li></ul>\r\nRoadmap + Upcoming Features\r\nFeatures That are Implementable\r\n<ul><li>Achievements (Undetected, Under x seconds, etc). </li><li>Sound effects and Music.</li><li>More weapons.</li><li>Consumables like healing, speed, etc.</li><li>Shop: To buy weapons and consumables.</li><li>Better enemy and player models with animations. </li><li>Better UI</li></ul>\r\nFeatures That I may not be able to implement without your help.\r\n<ul><li><strong>[Major Feature] A story mode. </strong><em>You are a \"elite\" hitman who is stuck in the middle of a series of unfortunate events. </em>The story is set in a large variety of locations ranging from the inside of a Pyramid to a secret Time Phasing facility </li><li>Different game modes (Hostage extraction, Device Planting, Frenzy, etc).</li><li>Multiplayer (Unlikely and a goal that I will pursue after all else).</li></ul>\r\nFAQ\r\n<p><em>Q) Your plans seem too ambitious, will you be </em>able to pull them off?</p>\n<p>A) I can with your help! I already have the core mechanics down. The first part of the story is already in the works. I'm pretty sure I can pull it off.</p>\n<p><em>Q) What kind of help do you need?</em><br/></p>\n<p>A) I need help with balancing the game, help with how new features are implemented and helpful suggestions (features, bugs, etc).</p>\n<p><em>Q) Where should I put my suggestions?</em><br/></p>\n<p>A) You can leave you suggestion in the discussion board down below. If I get enough people to help me out, I'll create a discord server.</p>\n<p><em>Q) Do you plan on a PC release?</em><br/></p>\n<p>A) Yes, I do intend to release a PC version of the game. But I will release it after the Android version.</p>\n<p><em>Q) What about iOS?</em><br/></p>\n<p>A) I personally use iOS (Currently) and I would like to release an iOS version but sadly, I don't think that it is possible because I do not have a MAC and the iTunes store license is too expensive for me. </p>\n<p><em>Q) ETA wen?</em><br/></p>\n<p>A) I am currently in the last year of school and I do not/am not given lots of time to work on this project. The development will greatly speed up next year.</p>\n<p><em>Q) What will my donations be used for?</em><br/></p>\n<p>A) Currently, my laptop cannot handle my game engine very well. I cannot implement some features due to this hardware limitation. Your donations will help me upgrade to a more capable PC. My goal is to get around 800$. I will greatly appreciate all donations.</p>\n<p><em>Q) How do I support you?</em><br/></p>\n<p>A) You can use the donate option while downloading the prototype. You can choose to buy the artwork pack (Contains gun sprites right now. Will be updated) or/and the itch.io bundle (Contains all the prototypes from the start of development). These packs have very little value on their own but will help me greatly if you buy them.</p>\n<p>Thank You All!</p>", "metacritic": null, "released": "2020-05-27", "tba": false, "updated": "2020-05-29T04:33:47", "background_image": "https://media.rawg.io/media/screenshots/8ae/8aeb819707a7f75b97b507d2dc98baea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sohrabhamza"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}