{"id": 44832, "slug": "destination-primus-vita-episode-1-austin", "name": "Destination Primus Vita - Episode 1: Austin", "name_original": "Destination Primus Vita - Episode 1: Austin", "description": "Get ready to live the extraordinary experience of our SIX crew members aboard the Beaufort ship, en route for Primus Vita.<br/>\n<br/>\r\nDestination Primus Vita is a video game featuring narrative and traditional puzzles set in a science-fiction universe. The world is a dreamlike construct created from the protagonist’s world, thoughts, and feelings while in cryosleep on the way to the planet Primus Vita.<br/>\n<br/>\r\nThe player will navigate from the main Puzzle Room in the train, to the Memory room, where s/he be able to interact with the other 5 companions. And find some clues to solve the puzzles, of course...<br/>\n<br/>\r\nIn the year 3044, a team of six humans travel to the planet Primus Vita to retrieve precious water that was stolen from them hundreds of years ago. A space voyage of 4 years in cryosleep awaits them.<br/>\n<br/>\r\nAfter the arrival of previous teams on Primus Vita, the World Space Agency (WSA) noted that these long periods of cryosleep caused memory loss, depression and an overall loss of cognitive abilities in the soldiers and scientists who undertake these missions.  To combat this problem, NIM, the AI on the Beaufort, created a way to stimulate the sleeping minds of their team members by making them live the Train experience.", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-09T23:40:39", "background_image": "https://media.rawg.io/media/screenshots/319/3190138539fc44f2214bfcf4dd8c7010.jpg", "website": "https://www.primusvita.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 146}, "playtime": 2, "achievements_count": 8, "ratings_count": 2, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Epsilon Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Epsilon Games"], "esrb_rating": null}