{"id": 448343, "slug": "lovely-ninja", "name": "LOVELY NINJA", "name_original": "LOVELY NINJA", "description": "<p>L</p><p>LOVELY NINJA is a game created by JobisGame with Gdevelope 5 software.</p>\n<p>Starting with an initial template, modifying 4 parameters and objects to customize the game. Including the free Sprite !! Lovely Ninja is a game suitable for all ages due to its easy handling (Arrows and space bar to jump) and the absence of any type of violence. Attention!! can be addictive.</p>\n<p>Our little NINJA <strong>Elsa</strong> must climb to the top of the top of this virtual Chinese temple through platforms. A very \"oriental\" soundtrack will accompany you on this journey.</p>\n<p>As you go, the movement accelerates and you must take advantage of the trampolines to climb faster, avoiding the falling rocks. We have adapted the platforms to make it easier to land on them.</p>\n<p>Send us a screenshot of your scores, to see how far you get !!</p>\n<p>Luck!!</p><p>LOVELY NINJA  es un juego creado por JobisGame con  el software Gdevelope 5.  </p>\n<p>A partir de una plantilla inicial, modificando 4 parámetros y objetos para personalizar el juego.  Incluido el Sprite gratuito!! <strong>Lovely Ninja</strong> es un juego apto para todas las edades por su fácil manejo (<strong>Flechas y barra espaciadora para saltar</strong>) y ausencia de  cualquier tipo de violencia.   Atención!! puede ser adictivo.  </p>\n<p>Nuestra pequeña NINJA  <strong>Elsa</strong> debe subir a lo más alto de la cima  de este virtual templo Chino a través de plataformas. Una banda sonora de lo más \"oriental\" te acompañará en este viaje.</p>\n<p>A medida que avanzas, se va acelerando el movimiento y deberás aprovechar los trampolines para subir más rápido, evitando las rocas que caen. Hemos adaptado las plataformas para que sea más sencillo poder aterrizar en ellas. </p>\n<p>Envíanos un <em><strong>screenshot</strong></em> de tus puntuaciones, a ver hasta donde llegas!!</p>\n<p>Suerte!!</p>", "metacritic": null, "released": "2020-05-27", "tba": false, "updated": "2020-05-29T04:26:11", "background_image": "https://media.rawg.io/media/screenshots/35e/35e241c74817e1d875e4695166edf9ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JOBisGAME"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}