{"id": 448482, "slug": "minimal-pong", "name": "Minimal P.O.N.G", "name_original": "Minimal P.O.N.G", "description": "<p><strong>Minimal PONG is a juxtaposition of the classic Pong with the modernisation of the Graphics. With the new Modern and Minimal look, it has both the charms of the arcade games and classics along with a new sleek look.</strong></p>\n<p><strong>🏡This game is made during the Quarantine in 2 days for you to enjoy with your family while at home.<strong>🏡</strong></strong></p>\n<p>You can select between two engaging gameplay modes - Timer and Knockout, with which you can experiment with different play styles. Pong also has Local Multiplayer modes for playing with your friends, just like the times of those arcade games. It is one of the casual games you must have in your set of offline games to have fun on the go, without having to go through the hassle of a live internet connection.<br/><br/>It's a unique game in the casual games genre in which its not only possible to pass time playing but you can also watch the AI confront itself in a unique CPU vs CPU mode. It also comes with various colour themes to choose from to take the minimal look to another level along with customizations to the paddle colours. Its also completely ad-free, not only during the offline games mode but also when your mobile data is turned on because casual games are best played Ad-Free.</p><p><strong>FEATURES-</strong><br/>• Provides nostalgia for the Arcade Games lovers.<br/>• Two awesome Game Modes - Timer and Knockout.<br/>• Minimal Design and sleek modern graphics.<br/>• Plenty of colour themes to choose from.<br/>• A great addition to the Offline Games collection.<br/>• Two-Player Local Multiplayer.<br/>• Unique CPU vs CPU mode. Watch the machines fight.<br/>• Completely Ad-Free. Zero ads whatsoever.</p><p><strong>😄Consider Donating if you like the game, it helps us in making more free games for you....Thanks in advance for your contributions. Comment your feedback, we'd love to hear them....</strong><br/></p>", "metacritic": null, "released": "2020-05-27", "tba": false, "updated": "2020-05-29T05:00:37", "background_image": "https://media.rawg.io/media/screenshots/d00/d00a940598c169bd866b8fb8d16747e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VOiD1 Gaming"], "genres": [], "publishers": [], "esrb_rating": null}