{"id": 448525, "slug": "project-build", "name": "Project Build", "name_original": "Project Build", "description": "<p>Project Build seems like most sandbox building games at first, but beyond the first glance, there is far more than what meets the eye. Unlike most games in the same genre, Project Build takes the “Build” to much more realistic limits than what most games offer. These differences include:<br/></p>\n<ul><li>Advanced construction tools that make every single inch, cm, meter, and all sizes play a role into the success of the design.</li><li>Drawing and measuring to make sure that each parameter is met and mathematically accurate to work alongside the game’s physics system to create a sense of realism.</li><li>Improved physics in constructions so that players can now build what would normally be unbuildable in other games.</li><li>Discover the possibilities of aerodynamics and hydrodynamics. With the power of air and water at your fingertips, the sky is literally the limit of what you could potentially create with examples including operational ships and planes. </li></ul>\n<p>But it doesn’t stop there!</p>\r\nEarly Access\r\n<p>\tAs most games are nowadays, Project Build is still in very early access. Meaning over time there will be more things to be added to make the building experience much more enjoyable and exciting. Obvious expectations on what to be improved is how the game works, functions, objectives, more objects, and many many more ideas and concepts to follow.</p>\n<p>Here's a short list of currently planned features to come!</p>\n<ul><li>Multiplayer - Currently In Development</li><li>Ethereal - A Floating material kinda like a balloon</li><li>Springs, Ropes and more things to build with</li><li>A Logic System</li><li>VR Support</li></ul>\n<p>While these are planned features I cant guarantee all of them will make it into the game, However Multiplayer will!</p>\n\n<p>Come join the Discord Community over Here!</p>", "metacritic": null, "released": "2020-05-21", "tba": false, "updated": "2020-05-29T05:09:31", "background_image": "https://media.rawg.io/media/screenshots/a83/a8325b2a546d7e8c7d60c1fe95800d53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RetroGamage"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}