{"id": 4485, "slug": "psp-2-pack-motorstorm-arctic-edge-twisted-metal-he", "name": "PSP 2 Pack - MotorStorm Arctic Edge & Twisted Metal: Head-On", "name_original": "PSP 2 Pack - MotorStorm Arctic Edge & Twisted Metal: Head-On", "description": "Bring home two best-selling PSP games - MotorStorm® Arctic Edge and Twisted Metal®: Head On together for one low cost!\r\n<br/><br/>\r\nMotorStorm®'s breakneck racing festival moves to the unpredictable terrains and harsh temperatures of Alaska. In true MotorStorm® style, players will throw traditional offroad driving and caution to the wind where the ultimate goal in the festival is to not only win, but to survive. \r\n<br/><br/>\r\nTwisted Metal®: Head-On puts you behind the wheel of one of 14 destructive vehicles, each equipped with machine guns, turbo boost, and a unique special attack. Once you select a vehicle, you can take out your road rage on opponents in 12 wild arenas.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item's use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.\r\n<br/><br/>\r\nTwisted Metal is a registered trademark and Twisted Metal: Head-On is a trademark of Sony Computer Entertainment America LLC. © 2005 Sony Computer Entertainment America LLC.\r\nMotorStorm is a registered trademark of Sony Computer Entertainment Europe. © 2009 Sony Computer Entertainment Europe. \r\n<br/><br/>\r\nFor wireless play, this game may not be compatible with the UMD disc version of the game.", "metacritic": null, "released": "2012-01-24", "tba": false, "updated": "2019-08-02T16:22:56", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PSP"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": "Teen"}