{"id": 448638, "slug": "sonic-3d-in-2d", "name": "Sonic 3D in 2D", "name_original": "Sonic 3D in 2D", "description": "<p>Sonic 3D in 2D is a fangame that reimagines Sonic3D Blast plot and levels with style and structure closer to the games that preceeded it. Explore Flicky Island in a 2D side scrolling platformer that takes elements from the other Mega Drive/Genesis games to re-forge an adventure anew. Fight new and challenging bosses, save Flicky Island and stop Robotnik's final plan to harness the Flicky's power for himself.<br/></p>\r\nFeatures\r\n<ul><li> 15 Acts to explore in 8 Zones</li><li>15 Boss Battles that will put your skills to the test</li><li>All classic shields, including the Golden Shield to use the homing attack with Sonic</li><li>3 Playable characters at start (Sonic, Tails, Knuckles).</li><li>Physics close to the Mega Drive/Genesis games.</li><li>Lots of Easter Eggs</li><li>Unlockable Extras for more gameplay options</li></ul>\r\nZones\r\n<ul><li><strong>Green Grove Zone</strong>: hills are alive with the sound of the Badnik's engines. The flikies have been turned into robots and it's up to you to blast through the Green Grove and free the Flickies!</li><li><strong>Rusty Ruin Zone</strong>: ancient ruins re-emerged from the sea. Make your way through the ancient traps of a long dead civilization as you keep searching for the Chaos Emeralds!</li><li><strong>Spring Stadium Zone</strong>: a crazy funhouse of pinball, barrels, bumpers, springs and spike traps! Hone your jumping and bumping skills to survive here!</li><li><strong>Diamond Dust Zone</strong>: have your snowboard handy? The snowy mountains of Flicky Island are filled with snow and ice. Watch out for explosive snowmen and uncover frozen springs to make your way through.</li><li><strong>Volcano Valley Zone</strong>: quite a change from the cool slopes! Leap the lava beds and use your spin dash to activate the elevators. Keep an eye out for the Fire Shield to protect yourself from the worst burns of your life.</li><li><strong>Gene Gadget Zone</strong>: this mixed-up mechazone is chock full of pipes, tubes and wiring. Not to mention electrified floors, shocking fields and industrial fans that will blow you around!</li><li><strong>Panic Puppet Zone</strong>: looks like Robotnik hasn't even had time to place the flickies into robots. The final confrontation is approaching!</li><li><strong>???</strong>: find all of the Chaos Emeralds to know more...</li></ul>\r\nControls\r\n<p>Game controls are set by the user on their first launch and they will map a mega drive/genesis controller. As such the commands for each character are described with the genesist button map (arrows, A, B, C, start). Controls can be changed any time by accessing the \"controls\" submenu in the title screen.<br/></p>\n<ul><li>Movement: Arrows</li><li>Jump: A, B or C on the ground</li><li>Secondary Action: A, B or C mid air after a jump<ul><li>Sonic: Insta Shield or Shield Power (depends on the active shield)</li><li>Tails: flight or swimming</li><li>Knuckles: gliding or climbing when against a wall</li></ul></li><li>Roll: Down when moving</li><li>Spin Dash: Down + A, B or C when standing</li><li>Peel Out (Sonic only): Up + A,B or C when standing</li><li>Super Transformation: C when jumping with 7 Chaos Emeralds and at least 50 rings.</li><li>Pause the game: Start</li></ul>\n<p><strong>Other Controls:</strong></p>\n<ul><li>F2: resets the game</li><li>Enter: Unpauses the game</li><li>Alt + Enter: Toggles Fullscreen</li><li>Alt+ F4: Closes the game</li></ul>", "metacritic": null, "released": "2020-05-26", "tba": false, "updated": "2020-05-29T05:31:39", "background_image": "https://media.rawg.io/media/screenshots/0ca/0ca61ae8c434b9f2a0b90b963707d21c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Sotaknuck"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}