{"id": 448629, "slug": "green-guardian", "name": "Green Guardian", "name_original": "Green Guardian", "description": "<p>Le monde dans lequel se trouve le joueur est régi par la magie. Certains éléments dans le monde peuvent produire des événements assez aléatoire n’importe où et n’importe quand.<br/>Et certains de ces événements peuvent engendrer de la magie corrompue qui peut ravager n’importe quoi.<br/>Une alerte à été décrété au niveau d’une ancienne centrale nucléaire où un événement magique a été déclaré sauf que celui-ci a produit une énergie noire.<br/>Le joueur est envoyé en mission dans cette centrale pour nettoyer la zone des éléments les plus polluants qui ont corrompu des robots à l’aide de cette énergie qui étaient utilisés dans celle-ci.<br/>Mais ces éléments ont produit une énergie tellement intense qu’elle ont réactivé le réacteur central.<br/>Une première équipe est envoyée mais celle-ci ne réponds plus. L’équipe du joueur est donc envoyé sur le terrain sauf qu’une explosion près de la central les sépares et le reste de son équipe ne réponds plus.<br/>Le joueur décide d’aller éteindre le réacteur lui-même et de nettoyer un maximum la zone à l’aide de son équipement qui utilise la magie et qui peut annuler la magie corrompu et l’utiliser pour mieux purifier celle-ci.</p>\n\n<p>Le questionnaire :</p>\n<p>https://docs.google.com/forms/d/e/1FAIpQLScyL5FS4_vsbxzS378fu_ezY_cOeHiA4a_t8QCi...</p>", "metacritic": null, "released": "2020-05-26", "tba": false, "updated": "2020-05-29T05:29:28", "background_image": "https://media.rawg.io/media/screenshots/eeb/eeb505c83a89747e5b679a933fa07170.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sadri01"], "genres": [], "publishers": [], "esrb_rating": null}