{"id": 44877, "slug": "connectrode", "name": "Connectrode", "name_original": "Connectrode", "description": "\"4.5 of 5 stars. Connectrode is everything I look for in a puzzle game!\" - TouchArcade.com<br/><br/>\"...Gorgeous in design and both smooth and challenging in play. …You’ll never tire of this epic game of thought-provoking strategy.\" - AppAdvice.com<br/><br/>\"Connectrode is easy to pick up and hard to put down.\" - The Austin Chronicle<br/><br/>Connectrode is a pure puzzle game of simple but elegant strategy. Connect the chips to clear them from the board - but with each connector you place, beware blocking off parts of the board from yourself!<br/><br/>The game has no time limits - play at your own pace. Once you master the gameplay, try for a high score and discover new depths of challenge and strategy - and land a high score on the Game Center leaderboards.<br/><br/>The \"boards\" you play in Connectrode are randomly generated - you'll never run out of new challenges. Post your score on a board to Twitter or Facebook, and friends can use your link to play the very same board - they may even beat your score and send a challenge back to you!<br/><br/>Connectrode features a gorgeous ambient soundtrack by David Pencil (known for his soundtracks for Penny Arcade: The Series on PATV). This game was developed completely independently by a small team in Austin, Texas - we appreciate your support of indie game development!", "metacritic": null, "released": "2011-07-02", "tba": false, "updated": "2019-10-22T14:30:43", "background_image": "https://media.rawg.io/media/screenshots/49a/49ac1226d10c042c2f3bc7298a209d5a.jpg", "website": "http://www.Deep-Plaid.com/Connectrode", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Deep Plaid Games"], "genres": ["Puzzle"], "publishers": ["Deep Plaid Games"], "esrb_rating": "Everyone 10+"}