{"id": 44886, "slug": "crazycar", "name": "CrazyCar", "name_original": "CrazyCar", "description": "The original machine vehicles are: Black Whirlwind from Russia, Desert Storm in Saudi Arabia, Grassland Heart in Malaysia, Thomson in the UK, and Fire Prairie from the ancient East.Crisis developmentThe crisis of machine vehicles lasted for many years, they killed a large number of Indonesian people, invaded South America, destroyed Korea and the Korean peninsula. However, the machine with a good mind finally defeated the enemy, human beings are very grateful, for them awarded the Warriors Medal, that the war is over, peace is coming.EndingBut the machine vehicles with good minds realize that they have the world's most powerful force, can rule the world itself, this evil idea into their hearts, human dreams did not expect, the cycle began ...Game IntroductionThis game uses the latest game engine for development, the screen fresh and bright, simple and generous, in line with the current trend of the times. Game to the car as the theme, a total of four different game modes, each model has a lot of levels, each level map is extremely large, and very open. Almost every object in the game map has physical characteristics, full of realism. And we have been fully optimized so that there is no Caton. When you do not want to follow a fixed pattern, you can travel freely, hit, shoot, etc., can let you vent your emotions. Excellent sound effects and the effect of particles can make you immersed in the game.Mode Description1.Racing Mode, This is all the racing games are available, but the only difference in our game is that you can choose the right vehicle to challenge the different levels before the game starts. And, when you get the first place, it is considered a customs clearance success.<br/>2.Off-road Mode, This is our original mode of the game, it broke through almost all the racing game mode limitations. Similarly, you can also choose a different vehicle to adapt to different levels, the game track as the roller coaster track generally ups and downs, stretching constantly. You may think it is very simple, but you are wrong. You need to reach the finish line in 3 minutes, and the track has no guardrail, and sometimes the track is tilted very much. When you are too slow, you may fall because of the lack of centripetal force, but if you are too fast, Because the sudden turn did not respond promptly out of the track. In short you need to grope yourself, and to be careful every time to be successful.<br/>3.Defensive Mode, This mode is also the history of the car game has never been. You need to choose the right vehicle, along the line to find the enemy, of course, we suggest that you copy the road as soon as possible to intercept the enemy. You need to choose the right vehicle for the enemy to accurately impact and combat. To prevent the enemy in a limited time to reach the target point (the game interface on the left side of the countdown progress bar, each time due to the difficulty of setting may be different, your birth point has a red ring, you need to prevent the enemy from there). Perhaps you will think that there is no difficulty, blocking in front of them just fine, but please look at the following precautions.<br/>4.Practice Mode, This mode has all the current scene of the props, as the name implies, this is for you to practice with. But we suggest that when you feel bad when you play this mode, because you can choose your favorite car to destroy the scene, vigorously vent your dissatisfaction, attack other vehicles, which will make you feel a lot better.Precautions1.The game in addition to off-road mode, the rest of the modes have AI vehicles, we prepared the most intelligent AI script, you do not think it will only find the way, as same as you control the car, the same will accelerate, shooting. And the accuracy of its shooting may be much more than you want, of course, you just fast enough to solve everything.<br/>2.The game is a common logo, the red ring is the birth point (remove the confrontation mode, because it is also the enemy's target point. Remove the practice mode, because it is for you to practice and relax with the mood), green ring are End point (remove the confrontation pattern, because the end of the pattern is to prevent the enemy from reaching the target point, there is no regional sense of the end. Also the same practice mode did not).<br/>3.Our special idea, when you game failure, you do not have to exit the game or start again, you can press the back button to continue in this level game. Because we think you may feel bad need to vent their emotions, you may not admit defeat, you want to practice in this level, observe the observation.<br/>4.We will update the new level from time to time.<br/>5.I wish you a happy game!", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2019-08-28T22:05:34", "background_image": "https://media.rawg.io/media/screenshots/594/594fe26f984aec5f60e356f43f763226.jpg", "website": "http://www.apillo.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 40, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 4, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Apillo"], "genres": ["Action", "Adventure", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Apillo"], "esrb_rating": null}