{"id": 44897, "slug": "interplanetary-hunter", "name": "Interplanetary Hunter", "name_original": "Interplanetary Hunter", "description": "The whole galaxy is being occupied by the outlanders’ mechas. Now it is time to drive your mecha to eliminate the invaders on the space stations and other planets. You can collect the spoils from the enemies to upgrade your mecha.<br/>\n<br/>\r\nYou can move your mecha freely, and you need to kill enough robots to challenge the boss. There are different types of weapons to deal with different enemies, for example, the super laser weapon is better to kill massive troops. You can gather all the enemies, if you can, and activate the super weapon. Meanwhile you should activate the defense system, but you also need to move to avoid the skills of the enemies, otherwise you will be defeated. If you survive you will gain lots of killing points. But pay attention, if you choose the machine gun weapon, you can only deal with one enemy so don’t make too many pulls. But every weapon has its own advantages so you should try every type of weapons to pick the most suitable one for yourself.<br/>\n<br/>\r\nThe boss will appear when the progress bar is full, every boss has its own skills and correspondence. For example, in the battle of aircraft carrier it’s better to kill the battleplanes first. You can collect armor kits and reduce the damage you taken by killing battleplanes, and each battleplane you kill can help reduce the HP of boss. Remember every boss has its special skills and you can find ways to solve them. Two more tips: remember to activate defense system in time when the boss uses its fatal skills. And do not solo the boss when you equipment is not enough good, you should kill the robots first in the battle with boss because the robots are easy to kill and you can collect armor kits to survive.<br/>\n<br/>\r\nThere is a dashboard which shows your armor, the enemies around you, the progress, the spoils and the energy of the super weapon. The information can help you clear the stages more easily. <br/>\n<br/>\r\nAt last we hope every player can collect the best equipment and clear all the stages. If you have any questions or suggestions please let us know. You can leave the messages below or email us.<br/>\n<br/>\r\nThank you for your support.", "metacritic": null, "released": "2017-08-03", "tba": false, "updated": "2019-08-28T22:05:34", "background_image": "https://media.rawg.io/media/screenshots/267/267d059b322f9507b854724a637c5190.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xiaofeixiong"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["xiaofeixiong"], "esrb_rating": null}