{"id": 448963, "slug": "way-to-yaatra", "name": "Way To Yaatra", "name_original": "Way To Yaatra", "description": "Way to Yaatra tells the tale of a young pilgrim who has received the call from the Gods, and answering their call he’ll embark on a journey across the altars searching for an ascension to divinity and his own completion. During the journey the player will face intricate puzzles and zones which require the highest of abilities.<br/>\n<br/>\r\nThe journey will have the pilgrim climb mount Itkinkalla, a sacred and hostile place for anyone willing to learn the truth that ravages those lands, where all the gods live as one. Way to Yaatra is an experience designed for a single player based on platforming with an elegant artistic style that will defy and charm even the most demanding players. <br/>\n<br/>\r\nDesigned by students of U-TAD university as a Final Degree Project, the Way to Yaatra development team is proud to present to you a game created with passion that we hope you like as much as we do.<br/>\n<br/>\r\n•\tAim, throw and climb! The player counts with various spears, tools that will help him climb and face the dangers that lurk in the mountain.<br/>\n<br/>\r\n•\tAn artistic style the likes of which you’ve never experienced / you’ve never seen<br/>\n<br/>\r\n•\tUp to four different types of spears that will change your way of playing<br/>\n<br/>\r\n•\tChallenging “Shadow” levels that will test your reflexes", "metacritic": null, "released": "2020-05-25", "tba": false, "updated": "2023-11-06T06:24:15", "background_image": "https://media.rawg.io/media/screenshots/ee0/ee0372a1089e2e6d54c277f53aef70e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlbertoPortero", "Yaatra", "Phy0xis", "David Saez", "tiburon96", "Enrique Mora Massuti", "WayToYaatra Company"], "genres": ["Adventure", "Casual", "Indie", "Platformer"], "publishers": ["WayToYaatra Company"], "esrb_rating": null}