{"id": 44900, "slug": "abstract-arena", "name": "Abstract Arena", "name_original": "Abstract Arena", "description": "<strong>Abstract Arena</strong> is a top-down <strong>action-shooter</strong> game set in a completely abstract context. Up to 6 different ships can clash in the Arena, taking advantage of all of the <strong>unique and balanced skills</strong> each of them possesses. Fast, precise, powerful: the gameplay is easy to learn but hard to master, adaptable to many <strong>play styles</strong> thanks to the variety of situations the player is brought to encounter.<br/><br/><ul><li>6 different ships with unique abilities<br/></li><li>Up to 6 challengers in the Arena simultaneously<br/></li><li>Minimal and stylish graphics<br/></li><li>Soft sci-fi music and stereo sound effects<br/></li><li>12 different gadget to use<br/></li><li>16 dynamic maps with moving obstacles<br/></li><li>Choose between free-for-all and team based matches<br/></li><li>4 game modes to play<br/></li><li>LAN play or local split-screen multiplayer<br/></li><li>Full support for x360-like controllers<br/></li><li>Achievements and unlockables<br/></li><li>Support for English, Italian, French, Spanish, German and Russian languages</li></ul><br/><br/><br/><br/>The key features of Abstract Arena's graphics are the <strong>bright colors</strong> and the <strong>dry figures</strong>. All of the aestethic is precisely defined with sharp lines and geometric shapes to give the impression to being playing within a <strong>minimalistic work of art</strong>. To accentuate the atmosphere there are very inspired <strong>soft sci-fi music tracks</strong>, that makes the perfect audio background to the many sound effects.<br/><br/><br/><br/><br/><br/>To give the gameplay a little shake there are <strong>12 different power ups</strong> that give to challengers new skills and useful gadgets. Companions turrets, magnetic fields, freezing missiles, reflecting shields and many other special objects enrich each situation. Up to <strong>16 dynamic maps</strong> filled with <strong>moving obstacles</strong> are available to host all of the possible fights, each of them endowed with a different background.<br/><br/><br/><br/><br/><br/>It may be thought it is not possible to encounter other than opponents within the Arena, but it is not true, in fact players are able to set <strong>free-for-all</strong> matches or <strong>team based battles</strong> as well. Possibilities are almost infinite: 3v3 or 2v2v2 clashes are the most common, but also unfair 2v3 or 1v4 brawls are allowed.<br/><br/><br/><br/><br/><br/>Everyone knows that <strong>more players make games more fun</strong>: all it is needed to start a local multiplayer match is at least one standard controller. 2 players can <strong>fight together simultaneously</strong> on the same display through all of the Arena modes, as the screen can be easily divided in two halfs. The game also fully supports <strong>gamepad's analog sticks and rumble functions</strong>, to better involve players into the action.<br/><br/><br/><br/><br/><br/>Unlock <strong>new skins</strong> for ships, listen to the <strong>music tracks</strong>, apply special <strong>graphic effects</strong> and much more. Through completing <strong>20 different achievements</strong>, from easy tasks to harder <strong>challenges</strong>, you can gain access to <strong>extra contents</strong> and unveil every secret of the game. <strong>What are you waiting for?</strong><br/><br/><br/><br/><br/><br/><strong>Abstract Arena</strong> was born in April 2016 to let Alberto Muratore take part to the annual <strong>GameMaker Italia Forum</strong> game development competition. The development continued thanks to the many helps provided by <strong>kind people</strong> who offered their skills for tasks the main developer couldn't take care of, such as website building and translations. Team Credici has been founded to group all of these people under the same name - <strong>\"Credici\" is an italian word</strong> with two meanings: <strong>\"believe in it\"</strong> and <strong>\"trust us\"</strong>; so it perfectly describes the collaboration between our \"members\". During our adventure a main role has been covered by <strong>Indiexpo</strong>, an italian portal for indie games that sustained our presence on social medias and brought us to show the game at <strong>Svilupparty 2017</strong>. Afer more than a year of development, <strong>Abstract Arena is finally ready</strong> to be appreciated by the Steam's community!", "metacritic": null, "released": "2017-08-03", "tba": false, "updated": "2019-08-28T22:05:34", "background_image": "https://media.rawg.io/media/screenshots/1fa/1fa8076111d11f69153461c9bd1725aa.jpg", "website": "http://www.abstractarena.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 47, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Credici"], "genres": ["Action", "Indie"], "publishers": ["Credici"], "esrb_rating": null}