{"id": 449016, "slug": "digitarot", "name": "Digitarot", "name_original": "Digitarot", "description": "<p>HOLD CTRL and DRAG the mouse to rotate and scale.</p>\n\n<p>Android version here: https://play.google.com/store/apps/details?id=com.dfart.Digitarot</p>\n<p>Update: Digitarot now has 3 card spreads and music by AJ Booker.<br/><br/>Digitarot contains 78 tarot cards of the major and minor arcana. Each card can be rotated, scaled and moved so you can explore the 3D scenes and landscapes. Each card also has a short description about it's symbolism and also it's reversal. You can also shuffle the deck to get a random card and choose for reversals to come up.<br/><br/>Each card was put together by Dale Forward in Unity using predominantly 3D models and assets by Synty Studios.<br/><br/>Dale Forward is an artist that makes interactive artworks. He has made books that use 3D glasses and an Augmented Reality version of this app that uses actual cards on his website www.daleforward.com (You can also test his AR Tarot app through his site too)<br/><br/>The deck was loosely based on the Rider Waite deck and it's symbolism with the focus being making the most visually appealing cards possible. Each card has some kind of animation whether it be a charging horse, magical effects, animated characters or falling snow. There is also no limit to how far you can rotate the cards so you can see behind the face and get some insight into how the scene was put together. If you lose the card or want to reset it back to its original state there is a reset button to put it back to the start.<br/><br/>This is Dale Forward's first ever fully digital app which came directly after his Augmented Reality app and he plans to now make interactive storybooks using the same technology.<br/></p>", "metacritic": null, "released": "2020-05-25", "tba": false, "updated": "2020-05-29T06:55:10", "background_image": "https://media.rawg.io/media/screenshots/579/5792d5f271f449a86a416a50276d2602.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dale Forward"], "genres": [], "publishers": [], "esrb_rating": null}