{"id": 44902, "slug": "mysteries-of-fence", "name": "Mysteries of Fence", "name_original": "Mysteries of Fence", "description": "<strong>*Based on a true story</strong><br/><br/><strong>*A magical realism masterpiece which caused great discussions in China's Internet Community.</strong><br/><br/>      Internet addiction, it was just a noun which invented by an American psychiatrist in the forum for joking at first.But it has been deeply rooted among the people in China now.In a few places of China,some children who often surf the Internet will be considered as having internet addiction and mental illness, and they will be sent to internet addiction rehabilitation center to accept compulsory treatment by their families.<br/><br/>      In 2008, the internet addiction rehabilitation center and Professor Yang appeared on television documentary with a positive light. The way that Professor Yang used electric shock and other extreme measures to treat internet addiction, made him become the savior in some ignorant parents’ mind.<br/><br/>      In 2016, a netizen posted an autobiography which over twenty thousand words on the internet to tell the cruel treatments she accepted in the center. For those teenagers who were forced to accept the \"treatment\", the hurt was irreversible in physically and mentally, some cut their wrists, some jumped off a building, some claimed they will be die alone, there were also some who backed to normal life, but they don’t know when they can move on from the psychological shadow.<br/><strong>This game is based on a true story<br/><br/>      In the past 30 years, the rapid growth of economy continually impacted the old orders of the traditional China.this game is such a slice of modern China. Although with the popularity of internet, the old generations no longer regard the internet as dreadful monster,the number of  rehabilitation center is getting less,we still want to use such a game to record the unknown pain and struggles of ordinary people in the far east country, hoping that our descendants will never forget these tragedies happened before. </strong>", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2019-08-28T22:05:34", "background_image": "https://media.rawg.io/media/screenshots/a82/a825ab74b6833dd3a112e47fc3c7174d.jpg", "website": "http://www.66rpg.com/index", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 1, "achievements_count": 5, "ratings_count": 1, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["橙光游戏"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["橙光游戏"], "esrb_rating": null}