{"id": 449165, "slug": "the-dungeon-of-naheulbeuk-the-amulet-of-chaos", "name": "The Dungeon Of Naheulbeuk: The Amulet Of Chaos", "name_original": "The Dungeon Of Naheulbeuk: The Amulet Of Chaos", "description": "<p>Are you ready to dive into a tactical RPG chock-full of charm, humor and crazy characters?!</p>\n<p>They are clumsy, inexperienced and feisty but...they’ll have to endure each other’s company to get the dungeon’s treasure.</p>\n<p>However, a feeling of déjà-vu quickly arises...</p>\n<p>Guide this team of unlikely heroes in an adventure full of humor and chaos!</p>\n<p>The Naheulbeuk universe is an original creation by French author John Lang. It started as a very popular audio comedy series parodying role-playing games and heroic fantasy tropes. Now the story is available in English and as a video game for the first time!</p>\n<p>Play with seven classic role-playing game characters complementing each other’s skills as you level them up: the Ranger, the Elf, the Dwarf, the Magician, the Ogre and the Thief!</p>\n<p>Every member of the team has their own skill tree to upgrade their abilities and equipment.</p>\n<p>Choose one of three additional companions to join the team on their adventure!</p>\n<p>Exciting turn-based battles, with creative support mechanics between team members.</p>\n<p>An adaptive difficulty system: from an accessible and fun story mode with simplified combat to the “nightmare mode” where the smallest tactical errors will doom you!</p>\n<p>An expansive bestiary (more than 100 enemies!) pushing you to think more tactically with every fight.</p>\n<p>Epic boss battles where you’ll have to muster both strength and smarts to emerge victorious!</p>\n<p>Hidden and destructive objects (including beer kegs) with surprising status effects will turn the tide of battle for the better...or worse!</p>\n<p>Explore a huge and surprising dungeon from the cave up to the luxury quarters of the evil lord Zangdar, passing through the goblin iceskating park and even an extremely lively tavern!</p>\n<p>Escape traps and solve deadly puzzles to unlock the most impressive treasures!</p>\n<p>Bizarre conversations, absurd situations and unusual encounters await!</p>\n<p>Experience an exciting main storyline and many side quests for your heroes</p>", "metacritic": null, "released": "2020-09-17", "tba": false, "updated": "2023-11-29T23:15:26", "background_image": "https://media.rawg.io/media/screenshots/48f/48f36cc7375360aa341c4e9f55955844.jpg", "website": "", "rating": 3.22, "rating_top": 4, "added_by_status": {"yet": 62, "owned": 102, "beaten": 14, "toplay": 27, "dropped": 18, "playing": 5}, "playtime": 3, "achievements_count": 129, "ratings_count": 30, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 32, "platforms": ["PC", "PlayStation 4"], "developers": ["Dear Villagers", "Artefacts Studio"], "genres": ["RPG"], "publishers": ["Dear Villagers"], "esrb_rating": null}