{"id": 449295, "slug": "time-to-survive", "name": "Time To Survive", "name_original": "Time To Survive", "description": "<p>Time To Survive is a basic top down shooter where you need to survive the zombie attacks. Surviving will increase your score so will you be able to consistently improve and beat your highscore or will the game beat you? Try it and find out.</p>\n<p>The game was solely developed by my (@NeillTDev) for the Gamedev.tv Community Game Jam.</p>\n<p>The theme of the jam was \"TIME\". My interpretation of this was to let you control time through picking up powerups. When you pickup a powerup it will slow down all the time except for yourself, this means your bullets's flight speed and the movement speed of  enemies is slowed, giving you a chance to escape from the undead or if you are confident, challenge them head on!</p>\n<p>Source Code: Time To Survive GitHub</p>\n<p>Features:<br/>To pick up power ups or weapons simply walk over them.<br/>Pink power ups: Slows zombies' speed and your bullets.<br/>Machine Gun: Fully automatic gun (low damage, high rate of fire)<br/>Pistol: Semi-Automatic gun (high damage, low rate of fire)<br/>Dash: Teleport a short distance to escape the zombies. You only have 3 but it regenerates.</p>\n<p>Controls:<br/>Aim - Mouse<br/>Fire - Left Mouse Button<br/>Reload - R<br/>Walk - W, A, S, D<br/>Dash - Spacebar</p>\n<p>Bugs:<br/>Sometimes when you spam the spacebar even though you don't have any dashes, it will glitch out and randomly dash you when it has recharged but you didn't press the Spacebar yet. So don't spam your dashes!</p>\n<p>Please let me know if you encounter any bugs or have any suggestions.</p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-01T02:37:16", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab57e1e96a65e7c1678bda86bdb127c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NeillT"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}