{"id": 449224, "slug": "ball-toss-alley-arcade-game", "name": "Ball Toss: Alley Arcade Game", "name_original": "Ball Toss: Alley Arcade Game", "description": "Use your finger as the launcher in one tap! Swipe and throw the ball.\t\t<br/>We’re ALWAYS updating our game to include fun new features! If you like Skee Ball or Bowling Games, you're going to LOVE this app!! It's exactly like the old days.\t\t<br/> <br/>The more you roll the more FREE tables and balls you unlock. Pin the collection button to see your stash!\t\t<br/>Think you have the best game score around? With Apple's Game Center enabled, you can check the Game Center leaderboards to see how your ball skills stack up against top players all around the world!\t\t<br/> <br/>The addicting game you’ve been playing in arcades for years now goes wherever you do. Ball Toss is a universal app, playable in the best resolution available for each Apple device. Download Ball Toss today!\t\t<br/> <br/>FEATURES:\t\t<br/>● Top REALISTIC 3D graphics and cool animations\t\t<br/>● Super Easy Gameplay - Hard to Master\t\t<br/>● Tons of balls and tables to choose from!\t\t<br/>● Classic ball toss is the BEST skill arcade game.\t\t<br/>● Pinball games? Boring. Real top sports players choose Skee Ball to become king.\t\t<br/>● Haptic Touch on supported devices.\t<br/> <br/>Disclaimer:\t\t<br/>This game contains NO IAP. Totally FREE. \t\t<br/> <br/>For the latest info and what we are up to, check out our website.", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2020-06-01T02:17:58", "background_image": "https://media.rawg.io/media/screenshots/547/54700405c2f43f815b19c483bd9637db_GrV746U.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Best Sports Games"], "genres": ["Sports", "Casual"], "publishers": ["Best Sports Games"], "esrb_rating": "Everyone 10+"}