{"id": 449225, "slug": "romance-stories-and-choices", "name": "Romance: Stories and Choices", "name_original": "Romance: Stories and Choices", "description": "Romance：Stories and Choices<br/><br/>Choose your interactive story,wisely choices will make love stories and amazing destiny.<br/><br/>One choice can change everything! This interactive storytelling game allows you to make your own decisions and impact the story with your choices. <br/>You can find every type of books you ever imagined—scientific fictions, romantic stories, mystery novels ,legendary tales,drama series…<br/>In each different story, you’ll get the chance to make choices all by yourself and decide your own fate. Indulge yourself in abundant interactive stories,choose different path and write stories for yourself!<br/><br/>Features:<br/>Choose your favorite style for main characters!<br/>Enjoy romantic, amazing and breath-taking experiences in different stories!<br/>Fall in love,Indulge yourself in abundant episodes!<br/>Experience different ways of life through unique immersion storytelling techniques!<br/><br/>Extraordinary books in Stories:<br/><br/>Dazzle ME<br/>-Passionate,crashing into you<br/>-- You are a relationship columnist who doesn’t have a relationship. In fact, you are not even good at dealing with a relationship.<br/>Your career is edging away, now you must fly to Monaco to write an article about the hottest F1 racing driver Aaron LeBeau.<br/>In the morning, you wake up on a stranger’s bed, and Aaron LeBeau appears in front of you! What’s more, he offers you to be his fake girlfriend!<br/><br/>Dive into You<br/>Taking a cruise every year has become a tradition for your friends and you ever since college, but this year, you meet a mysterious, charming man who saves you from drowning in the cold, dark ocean.<br/>You enjoy every moment with him, though it’s clear that he has secrets…<br/>What will happen after the cruise reaches the dock? Will you see him again? Will the chemistry continue on land? Will he dive into you, again?<br/><br/>Hot News<br/>You finally get the chance to get away from the small town, after breaking up with your 6-year boyfriend on the commencement day. <br/>Heartbroken, you land in New York City, wanting to start a new life but run into a mysterious playboy. You have a wonderful night together and finds the man to be your new boss on the next day.<br/>Will you accept your boss’ offer to taste the forbidden fruit, or will you spend more time with your new, charming online follower? Will you be able to escape from the shadowed past? Will you break constrains? <br/><br/>Roommates With The CEO<br/>When you're about to embrace your dream life - new apartment, new internship, and new life, you find your recently rented apartment a scam! What's worse, you lose your package and wallet! <br/>What can you do when you see a housekeeping job posting? Of course, you apply for it! Luckily, you get the job. However, \"Three rules. One, never speak of this at work. Two, never enter my room without my permission. Three, I never want to find you under my sheets, naked.\" <br/>You certainly have no intention of breaking his rules – you're in desperate need of a place to stay, and for Killian Knight, a housekeeper at his luxurious penthouse. But it's not as easy as it seems... Can you handle having your CEO as your roommate?<br/><br/>And so on…<br/>Now,Indulge yourself in abundant stories and write stories of yourself! Episode will begin,are you ready to join this romance and fantasy party?<br/><br/>Follow Romance：<br/>facebook.com/Romance-Stories-and-Choices-109882800503748<br/>twitter.com/Romance_Choices<br/>instagram.com/romance_official/", "metacritic": null, "released": "2020-04-29", "tba": false, "updated": "2020-06-01T02:18:23", "background_image": "https://media.rawg.io/media/screenshots/928/9285dd33964a0e6f9c3f239536d7e016.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SaiYun Network Technology(Shanghai) Co.,Ltd."], "genres": ["RPG", "Simulation"], "publishers": ["Saiyun Network Technology(Shanghai) Co.,Ltd."], "esrb_rating": "Mature"}