{"id": 4493, "slug": "tcs-sc-double-agent", "name": "Tom Clancy's Splinter Cell Double Agent", "name_original": "Tom Clancy's Splinter Cell Double Agent", "description": "<p>The best-selling Tom Clancy&#39;s Splinter Cell® saga takes on an entirely new direction.<br />\nIn the highly anticipated sequel to the 2005 game of the year, Tom Clancy&#39;s Splinter Cell Double Agent™, play as a double agent spy for the first time ever. Take on dual roles of covert operative and ruthless terrorist, where your choices of whom to betray and whom to protect actually affect the outcome of your game.<br />\nExperience the relentless tension and gut-wrenching dilemmas of life as a double agent.  Lie. Kill. Sabotage. Betray. All to protect the innocent. How far will you go to gain the enemy&#39;s trust? As covert operative Sam Fisher, you must infiltrate a vicious terrorist group and destroy it from within. You&#39;ll need to carefully weigh the consequences of your actions. Kill too many terrorists and you&#39;ll blow your cover. Hesitate and millions will die. Do whatever it takes to complete your mission, but get out alive.<br />\nDouble agent gameplay and branching storyline - Play both sides and decide between opposing NSA and terrorists objectives. You choose who&#39;s priorities to support, and who&#39;s to undermine. Your actions affect the story and gameplay, leading to shockingly different endings.<br />\nUpgradeable weapons and gadgets - As you progress get access to upgraded prototype gadgets and weapons, like improved night vision, based on your choices and covert skills.<br />\nAuthentic double agent tactics - Use realistic tactics, based on testimonies of actual undercover agents, to sabotage the enemies&#39; plans.<br />\nDon&#39;t blow your cover - Steal, destroy, kill, and evade the authorities. Do whatever it takes to make your mark and gain the terrorists&#39; trust.<br />\nA world of International espionage - Go from Shanghai and Cozumel to America itself, where New York City and Los Angeles are threatened by the terrorists&#39; agenda of destruction.<br />\nAll-new extreme gameplay situations - Conduct your missions underwater amidst churning ice floes, in a blinding sandstorm, or even sheathed in dust and smoke.<br />\nInnovative multiplayer - The critically acclaimed multiplayer modes are back with new innovations and exclusives for each platform. Get recruited and earn rank upgrades, and sabotage and spy for your team.</p>", "metacritic": 80, "released": "2006-10-17", "tba": false, "updated": "2024-03-13T19:47:07", "background_image": "https://media.rawg.io/media/games/33d/33d72d63a624f17431d39922359c7bf8.jpg", "website": "https://store.ubi.com/ie/tom-clancy-s-splinter-cell-double-agent/56c4948a88a7e300458b482c.html", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 103, "owned": 1289, "beaten": 348, "toplay": 67, "dropped": 97, "playing": 5}, "playtime": 2, "achievements_count": 38, "ratings_count": 326, "suggestions_count": 1050, "game_series_count": 7, "reviews_count": 326, "platforms": ["PlayStation 3", "PlayStation 2", "Xbox", "Xbox 360", "Wii", "GameCube", "PC", "Xbox One"], "developers": ["Ubisoft", "Ubisoft Montreal", "Ubisoft Shanghai", "Ubisoft Milan"], "genres": ["Action", "Adventure"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Mature"}