{"id": 449361, "slug": "zombie-time", "name": "Zombie Time", "name_original": "Zombie Time", "description": "<p><strong>Some idiot </strong>reopened the wet market in Hoo-wan, or whatever it was called. Another idiot had an accident in a lab. Something got out, mixed with this and that and now there are zombies running the streets of Tarred Town.  The general population are under lockdown. You joined the local militia. That makes you a bona-fide key worker. You can go out. And shoot Zombies. <br/></p>\n<p>You've only got a few rounds when you start out. Use them wisely and take every opportunity to collect more. The zombies are not very smart. More Utter Stupidity than AI. But they have a nasty habit of several turning  up together when you're in a tight corner. If you find yourself face down in a narrow alley with a bunch of gormless looking cartoon zombies doing a victory dance over your dead aris, don't say you weren't warned.</p>\n<p><strong>Known Limitations</strong><br/>The zombies are not very smart. If you keep on the move, they're just as likely to run past you as attack you. If they get collide with each other, they can get caught up in a bunch, and very probably cannot get out of it. Likewise if you shoot or punch one up close and kill them, you might find that your feet are stuck in the zombie corpse for a few seconds until it derezzes.</p>\n<p><strong>Wish List for Future Versions</strong><br/>More weapons<br/>ADS<br/>Backpack so you can carry more ammo<br/>Smarter zombies</p>\n\n<p>I hope you have a laugh playing this. I had enormous fun making it. ~Sandry</p>", "metacritic": null, "released": "2020-05-31", "tba": false, "updated": "2020-06-01T02:54:02", "background_image": "https://media.rawg.io/media/screenshots/444/444e27e94414b2d63cf52eb74325fea2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sandry"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}