{"id": 449458, "slug": "nsa-intern", "name": "NSA Intern", "name_original": "NSA Intern", "description": "<p>Become an intern at the National Safety Agency! Hack into the phones of potential terrorists and make them face justice!</p>\n<p>It's a long road forward, because there are as many potential terrorists as there are people in this world. However, through perseverance and patriotism, you can become the very best NSA Intern. Your new boss, an anthropomorphic magnifying glass named Glassy couldn't be more excited to meet you!</p>\n<p><strong>Features</strong></p>\n<ul><li>Hack into suspects' phones and compete against other interns to put your name on the Hacking Cup Leaderboard!</li></ul>\n<ul><li>Investigate apps within suspects' phones to learn their stories and secrets! Some apps include real social media pages (created for the game) which will require you to leave the game and search the internet for clues on these individuals.</li></ul>\n<ul><li>Each suspect phone is 30-60 minutes of gameplay. The total game is ~7 hours of content!</li></ul>\n\n<ul><li>Choose which evidence to submit. Depending on your choice, you can get 9 different endings for a suspect!</li></ul>\n<ul><li>Explore an overarching story line that follows your internship career and determines the fate of our world (several endings).</li></ul>\n<ul><li>Decorate your own personal office with everything from an NSA Mug to a patriotic Dick Pic!</li></ul>\n<ul><li>Discover the truth about the mysterious organization, Anonymous!</li></ul>\n\n<p><strong>Disclaimer</strong><br/>NSA Intern is a satirical video game experience in which a player receives a fictitious internship offer to the ‘National Safety Agency’, an organization which does not exist. The National Safety Agency has no relationship or endorsement from any real government organization. All stories, events, and characters in this work are fictitious. Any resemblance to actual events or persons, living or dead, is purely coincidental.</p>", "metacritic": null, "released": "2020-05-30", "tba": false, "updated": "2020-06-01T03:15:11", "background_image": "https://media.rawg.io/media/screenshots/eac/eacc023fb60921383cecb11638717534.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Black Vein Productions"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}