{"id": 449455, "slug": "arisa-versao-terapeuta-pt-br", "name": "Arisa - Versão Terapeuta (PT-BR)", "name_original": "Arisa - Versão Terapeuta (PT-BR)", "description": "<p><strong>Programa exclusivo para a linha ZX SPECTRUM 48K e seus clones.</strong>\n</p>\n<p><strong>O que é este programa? </strong>\n</p>\n<p>Arisa é construída sobre a base do primeiro programa de comunicação natural da história, desenvolvido por Joseph Weizenbaum, em 1966. Seu objetivo é promover um interessante diálogo entre o usuário e sua terapeuta virtual.\r\n  </p>\n<p>Para entender o funcionamento do programa, temos que ter em mente que se trata de um algoritmo criado em na década de 60 e que, devido ao seu pioneirismo e a lógica utilizada, possui algumas limitações. Entretanto, pode nos surpreender (ou não) pela forma como ele tenta manter o diálogo com seu interlocutor.   </p>\n<p>Manipular Arisa é como uma divertida viagem no tempo.\r\n  </p>\n<p>Sua aparência é propositalmente em texto simples, levando-nos a lembrar dos monitores de fósforo verde, muito utilizados no passado.\r\n  </p>\n<p>Nesta nova versão, foram feitas diversas melhorias no código original de Weizenbaum, acrescentando mais uma rotina de comparações e ampliando consideravelmente a sua base de dados e vocabulário em até 3X, porém, respeitando o limite que os 48K de memória nos. <br/> </p>\n<p>Todo o diálogo e enviado automaticamente para a impressora padrão ZX Printer ou Centronics (se tiver).\r\n  </p>\n<p><strong>Como ele funciona?</strong>\n</p>\n<p>Quando o usuário insere as palavras ou frases, Arisa faz 4 tipos de varreduras.   </p>\n<p>Num primeiro momento, ela tenta achar se já existe uma resposta pronta para aquela palavra. Se não existe, ela faz uma varredura na sua base de dados e escolhe aleatoriamente entre 3 respostas possíveis para aquela frase. Se não encontrar nada correspondente, ela examina as conjugações e tenta formar uma resposta utilizando o sistema \"my flag\". <br/></p>\n\n<p>Por último, se ela não consegue utilizar as etapas anteriores, ela utiliza uma resposta aleatória genérica.\r\n Dependendo das combinações de palavras, ela pode surpreender com respostas bem montadas ou simplesmente produzir algo meio sem sentido. Neste último caso, devemos nos lembrar de que, apesar da sua aparência  jovial  de android, ela já é uma \"senhora idosa\" com tecnologia de 55 anos atrás .\r\n  </p>\n<p><strong>Sobre esta versão.</strong> </p>\n<p>Nesta versão, Arisa assume o papel de uma terapeuta e vai se comportar como tal em suas respostas.\r\n Ela utiliza de muitas perguntas para manter o diálogo, afinal, ela está nos analisando e isso faz parte do processo terapêutico. Portanto, não espere um comportamento descontraído... Ela foi programada para ser menos emotiva e mais formal.\r\n Lembre-se disso para manter um bom diálogo com ela. Com o tempo, o usuário passa entender melhor como o programa se comporta e acaba por conseguir longas conversas.\r\n  O produtor promete outras personalidades para as futuras versões.\r\n  </p>\n<p>\n<strong>Surpresas escondidas no programa (easter eggs).</strong>\n</p>\n<p>Existem algumas palavras que acionam umas respostas bem humoradas, informações detalhadas, mensagens, upgrades ou surpresas inesperadas. A maioria já está sendo divulgada no site do produtor. Já outros, o autor que se para a dedução do usuário (ou talvez \"hackeadas\" por algum especialista mais curioso). Basta pensar apenas no perfil do autor e imaginário que tipo de palavras ele utilizaria... Se você errar, certamente Arisa te dar uma resposta genérica.<br/> <br/> </p>\n<p><strong>Distribuição.</strong>\n</p>\n<p>Arisa está sendo distribuída em tiragem limitada no formato BOX (a caixa contém o programa em fita K7, em disquete 3 1/2\" Beta Disk, manual de operação, certificado numerado de autenticidade e um adesivo). Também é comercializada no formato . TAP para download em vários canais de vendas. Todas as informações dos canais de distribuição podem ser obtidas no site do produtor: <strong> www.neco8bitsretrosoftware.blogspot.com </strong>\n</p>\n<p> \r\n  </p>", "metacritic": null, "released": "2020-05-28", "tba": false, "updated": "2020-06-01T03:14:24", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdce2b1c504357039ae7e128f50126cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["neco8bits"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}