{"id": 44941, "slug": "steel-punk-ball", "name": "Steel Punk Ball", "name_original": "Steel Punk Ball", "description": "Hello Dear Friends, we are a team of free developers of two people. And we are proud to present to you our game - Steel Punk Ball!We’ve did our best to create this game for You. Despite the fact that such a gameplay is not popular anymore for a long time, we’ve tried to bring novelties and freshness in it, create obstacles and traps that you would like. We’ve tried very hard to make the game interesting and exciting. We’ve created the game for You and for ourselves. First, we'll show You what we would like to see as gamers in such kind of games. It would be difficult to list all of challenges we had to solve during development, but after 7 long months of hard work on the game, we can finally present it to You. We are surprised by the fact that for such a long time of development the game has not disgusted us and we hope that Your friends will also like the game.so What Do We Want to Present to You?<ul>[/h2]<li>First of all, the concept itself. 30 levels, which will be interesting to You and will please with their unpredictability and amusement;<br/></li><li>Although, the ball rolls along flat surfaces, we’ve created not a flat graphics at all;<br/></li><li>The complexity will increase as the levels pass, new obstacles and elements will be added;<br/></li><li>If the first few levels are passed by You within a few seconds, then You will have to  spend a decent time to solve the next;<br/></li><li>We’ve created original sounds for the game, we are sure that You will appreciate it.</li></ul>Friends, we could have talking for a long time, but better try Steel Punk Ball and find out Yourself.Have fun Friends!", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-08-28T22:05:32", "background_image": "https://media.rawg.io/media/screenshots/f4b/f4ba4477db11120d2bfe1a910516c90c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 94, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 530, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ExclexGame"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["ExclexGame"], "esrb_rating": null}