{"id": 44952, "slug": "fugl-meditative-bird-experience-game-alpha-version", "name": "Fugl - Meditative bird experience game [Alpha Version]", "name_original": "Fugl - Meditative bird experience game [Alpha Version]", "description": "Please NoteFugl is currently in alpha, meaning we are constantly adding new features to the game and improving performance. We are currently looking for players who want to play the early version of the game and provide feedback.<br/><br/>   WHAT IS FUGL?Fugl is a sandbox game where you create the story, playing as a shapeshifting bird. Relax and feel the breeze under your wings as you glide serenely across picturesque landscapes, or kick up the excitement and soar up steep cliffs like an eagle. With no set rules the free roaming gameplay lets you discover the beauty and secrets of the world at your own pace and dares you to make your own meaning for a stress free experience. <br/><br/>Fugl’s world is a vast and unique voxel playground. It is procedurally generated yet carefully crafted, with diverse areas to explore, from icy wind blown caves to tropical paradises to great deserts and old growth forests. Each environment is rich in diverse wildlife with hundreds of animals to find. You may even be lucky enough to stumble across rare mythical creatures. Come close to any of these creatures and you have the chance to take on new visual characteristics and flying behaviours inspired by them.<br/><br/>Give the world of Fugl your own creative touch by personalising it in the extensive level creator and craft your custom bird in the avatar editor. <br/><br/><strong>Features in the Alpha version:</strong><br/><ul><li>Freely control a bird and enjoy the thrill of flying <br/></li><li>Experience meditative and task free gameplay at your own pace<br/></li><li>Sink into the beautiful voxel art style<br/></li><li>Discover the vast carefully crafted world<br/></li><li> Explore varied areas - from tropical beaches to snowy mountains and alien worlds<br/></li><li>Take on new visual characteristics and flying behaviours inspired by other animals <br/></li><li>Make your own custom bird in the avatar editor<br/></li><li>Shape your personal world with the level creator<br/></li><li>Enjoy the relaxing soundtrack created with the sounds and ambience of nature<br/></li><li>Receive regular content updates throughout the Early Access, including new areas, new animals and new features</li></ul><br/><br/>   RoadmapWe are very proud of we have accomplished so far, but we still have a few things we'd like to add to the game, before we come out of Early Access. The following are features that we'd really like to add, but everything is subject to change as development is still on-going.<br/><br/><br/>Feel free as a bird<br/><ul><li>Just as there are many different types of birds, we'd like to be able to support many different ways of enjoying life as a bird in Fugl. Some are looking for a more chilled experienced, and some for a frantic challenging experience. We are working on ways to support different modes of play.<br/></li><li>Birds can do more than just glide on the winds, break, speed up or hop on the ground and we want to support as many special manoeuvres and abilities as we can! <br/></li><li>Fugl is not the only living thing in the world. We want the wildlife to be able to influence you, and you to influence them!</li></ul><br/>A Living World<br/>The animals in Fugl are really important for providing a sense of life, interaction and immersion in the world.<br/><br/><ul><li>Improved Ai For the Animals<br/></li><li>Better Physics For the Animals<br/></li><li>Faster and improved spatial distribution of animals in the world<br/></li><li>More animations</li></ul><br/><br/> <br/><br/>Environments &amp; Level creator<br/><ul><li>Steam Workshop integration for the level creator<br/></li><li>Support for more procedurally generated environments</li></ul><br/>Rendering, Hardware and Platforms<br/><ul><li>Linux Support<br/></li><li>We are old-school so we are still looking to improve performance and reduce memory requirements wherever we can!<br/></li><li>We still have a few rendering tricks up our sleeve that we are working on</li></ul><br/>Misc<br/><ul><li>Support More Languages</li></ul><br/>", "metacritic": null, "released": "2017-09-14", "tba": false, "updated": "2019-08-28T22:05:32", "background_image": "https://media.rawg.io/media/screenshots/b34/b341458c2067742f7941687087086562.jpg", "website": "http://fuglgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 42, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Team Fugl"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Kotori Studios"], "esrb_rating": null}