{"id": 449640, "slug": "the-valley-of-super-flowers-itch", "name": "The Valley of Super Flowers (itch)", "name_original": "The Valley of Super Flowers (itch)", "description": "<p><strong>The Valley of Super Flowers is a 2D Platform Action game based on the story of the the valley which had been forcefully captured by an Evil Satanis ruler.\r\n<br/></strong></p>\n\n<p>The valley of Super Flowers was a holy place where flowers having supernatural ability used to live. Flowa, a Super Flower, was born in the valley. He spent his childhood in the same place and attended schools there. But later, an Evil Satanis ruler had taken control over the valley of Super Flowers. The quality of life of the flowers living in the area have been declining day by day. Many were having a hard time to live under a roof and were under a strict Satanis military surveillance all the time. However, the most of the flower world was under the control of the Good Flowaris Ruler. Flowa had been supported by the Police of Flowaris and they asked him to help them recapture the Valley of Super Flowers and destroy the Evil ruler. He had accepted their proposal and went to the Enemy territory with an aim to free the people of the state from the Bad ruler. He saw the living condition of the people in the valley and was sympathetic towards them. <br/>Will Flowa be able to free the people of the valley from the corrupted Ruler?</p>\n\r\nKey Features\r\n<ul><li>12 Levels to Play!</li></ul>\n<ul><li>Different Kinds of Enemies with varieties of weapons!</li></ul>\n<ul><li>Lots of Traps and Obstacles!</li></ul>\n<ul><li>3 Different Firing Modes including Primary Laser, Secondary(Flower Converter) and Tertiary(Mind Changer) Modes!</li></ul>\n<ul><li>3 Boss Battles!</li></ul>\n<ul><li>Collect Various items including Gold Coins, ammo, health boxes, etc.</li></ul>\n<ul><li>Challenging Situations And Hard to Master!</li></ul>", "metacritic": null, "released": "2020-05-31", "tba": false, "updated": "2020-06-01T03:56:39", "background_image": "https://media.rawg.io/media/screenshots/a29/a29de4b33790380e6d5f2bfa71ef8845.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["AMAXANG GAMES"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}