{"id": 449776, "slug": "dungeonescape3d-jcengine", "name": "DungeonEscape3D (JCEngine)", "name_original": "DungeonEscape3D (JCEngine)", "description": "<p>Mon premier jeu 3D fait pour la GameJam #25 de GameCodeur. Le thème est l'évasion. Il a été programmé avec mon moteur maison (JEngine (C#/monogame)). <br/><br/>Mes objectifs en faisant ce jeu étaient les suivants :<br/>1. Faire un jeu 3D case par case ;<br/>2. M'assurer de ne pas voir au travers les murs ;<br/>3. Mettre en application les sauvegarde et ouverture de fichier .map pour la conception et l'utilisation des maps pour chacun des niveaux ;<br/>4. Faire des tests de collisions avec les murs, ennemis et les objets ;<br/>5. Faire bouger les ennemis dans le dungeon.<br/>6. Ajout d'une mini-map avec brouillard et qui dévoile les zone explorée.<br/><br/>95% des graphismes, sons et musiques ont été pris sur le pack de GameCodeur.<br/></p>\n<p>Gros suspense, dans ce jeu vous devrez sortir du dungeon!! Pour se déplacer et tourner, vous pouvez utiliser les touches QWERTY, AZERTY ou flèches. Il y a 3 niveaux pour finir le jeu :</p>\n<p>1. niveau trivial, juste un labyrinthe. Vous vous familiariserai avec le mouvement du joueur.<br/>2. Ajout de monstre, mais immobile. Si vous touchez un monstre c'est gameover!<br/>3. Les monstres dans ce niveau se déplace de façon aléatoire. Attention de ne pas les toucher et garder vos distances!</p>\n<p>Bonne chance !!</p>", "metacritic": null, "released": "2020-05-30", "tba": false, "updated": "2020-06-01T04:24:27", "background_image": "https://media.rawg.io/media/screenshots/8c5/8c562aacdcd09aba57c9364594639ce9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Syllius"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}