{"id": 44999, "slug": "the-universim-demo", "name": "The Universim - DEMO", "name_original": "The Universim - DEMO", "description": "The full version of The Universim is coming soon to GOG.com.\n<br/><br/>\nWelcome to the world of The Universim! In this demo, we will give you a sneak peek at the diverse ecosystems and dynamic weather created by our Procedural Planet Generator. The Crytivo Games team devoted a huge amount of effort toward ensuring that the planets in The Universim were more than just static environments- they are living, breathing worlds. Today, we are excited to share our achievements in planet generation with our fans. \n<br/><br/>\nOf course, we are still working to improve this system, and there are still many features that have yet to be implemented. This demo is intended only to display the Procedural Planet Generator, so all gameplay mechanics are disabled. We will run closed Alpha and Beta gameplay tests through our website so that we can collect information and make necessary changes before we release The Universim on Steam Early Access. If you are interested in participating in these tests or if you want more information about The Universim, please visit our website.\n<br/><br/>\nWe hope you enjoy this technical demonstration and look forward to hearing your valuable feedback.Guide a civilization from the Stone Age all the way to the Space Era and beyond!\nExperience the beauty and brutality of dynamic, living worlds that are sure to both challenge and delight.\nWield powerful Creator Powers to shape the world around you.", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-02T08:59:16", "background_image": "https://media.rawg.io/media/screenshots/4fd/4fdb81d4b577d981ac5955331500e253.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 38, "beaten": 1, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Crytivo Games"], "genres": [], "publishers": ["Crytivo"], "esrb_rating": null}