{"id": 450003, "slug": "agent-c", "name": "Agent C", "name_original": "Agent C", "description": "<p>[en]<br/>It's <strong>300 years</strong> in the future. You are an agent that works for a big organization called <strong>Miraton</strong>. You have to uncover the mystery about ancient relic whose historical registers date from about <strong>5000 BC</strong>, but has never been found after, even with superadvanced equipment.</p>\n<p><strong>Time-travel</strong> to the past as <strong>Agent C</strong>, who wears the hi-tech <strong>AC Suit</strong>, which simulates clothes and languages from the past, and also translates everything people say. You'll know the mission details by <strong>Mint</strong> once you've reached pre-history.</p>\n<p>[pt]<br/>É cerca de <strong>300 anos</strong> no futuro. Você é um agente que trabalha para uma grande organização chamada <strong>Miraton</strong>. Você tem de desvendar um mistério sobre uma relíquia antiga cujos registros históricos datam de cerca de <strong>5000 a.C</strong>, mas nunca mais foi encontrada, mesmo com equipamento super-avançado.</p>\n<p>Viaje ao passado como <strong>Agente C</strong>, que veste o tecnológico <strong>Traje AC</strong>, que simula vestimentas e idiomas do passado, e também traduz tudo que as pessoas falam. Você saberá os detalhes da missão através da <strong>Mint</strong> assim que você chegar na pré-história.</p>\n<p>__________________________________________</p>\n<p><strong>ALERT: THIS GAME JUST BEGAN IT'S ALPHA. EXPECT A LOT OF BUGS AND INCONSISTENCES.</strong><br/></p>\n<p>By Shift Team (temporary name):</p>\n<p> We are a group of three college students that made this project for an Integrated Project discipline. Please leave your feedback below in the comments. We hope you enjoy!<br/><br/>DeeJayLSP: Design, art and programming;<br/>Dotgalaxy: 99% of the art;<br/> goldvulgo: Intro art;<br/>bsantino55: Playtest</p>", "metacritic": null, "released": "2020-05-29", "tba": false, "updated": "2020-06-01T05:15:20", "background_image": "https://media.rawg.io/media/screenshots/7ed/7ede821d4376ac66cfa8796f6112b9ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gustavo Rocha", "DeeJayLSP", "Dotgalaxy", "bsantino55"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}