{"id": 450074, "slug": "aroused-in-space-station", "name": "Aroused In Space: Station", "name_original": "Aroused In Space: Station", "description": "<p><strong>!!Aroused In Space has content of an explicit adult nature, and therefore not suitable for minors.!!<br/></strong></p><p>Support the game by becoming a supporter over on Patreon: https://www.patreon.com/TheQuietDomain<br/></p>\n\n\n\n\n\n\n\n\n<em><em>\n<p><strong>What is it?<br/>It's an adventure game with life sim elements. It's a scifi story of just trying to get on with your job.<br/>It's a collection of people working together to build a new life.<br/>Oh, and everyone is incredibly horny.</strong></p>\n<p><strong>Latest Version: Demo-0.1.5</strong></p>\n<p>Welcome! You've arrived during the early stages of this game. At the moment, all your support will be going into the development of the Free Demo. Once the demo has all the listed features, future updates will be exclusive to the Patreon Build.<br/>Want more from a specific area? Voting Tiers will be able to encourage new content to be added once Patreon Build is being made</p>\n<p><strong>Until the Patreon Build is made, you can support at a reduced price and keep that reduced price forever</strong></p>\n<p><strong><br/>Demo Features:</strong><br/>Two NPCs: 20% done</p>\n<ul><li>The Day Security</li><li>The Administrator</li></ul>\n<p>Three Job Tasks: 50% done<br/>Customizable Characters: 100% done (want more? Voting Incentives coming soon)<br/>Main Story Tease: 5% done<br/>Customization Shop: 25% done<br/>Interactables &amp; Toys: 0% done<br/>Three Locations: 80% done</p>\n<ul><li>Habitation</li><li>Communal</li><li>Hangar</li></ul>\n<p><strong>Patreon Planned Feature</strong>s:<br/>Ten NPCs</p>\n<ul><li>The Day Security</li><li>The Administrator</li><li>The Director</li><li>The Synth</li><li>The Driver</li><li>&amp; More</li></ul>\n<p>Twelve Job Tasks Across Two Jobs</p>\n<ul><li>Engineer</li><li>Researcher</li></ul>\n<p>New Locations</p>\n<ul><li>Administration</li><li>Research</li><li>Food &amp; Maintenance</li></ul>\n<p>Main Storyline</p>\n<ul><li>???</li><li>???</li><li>???</li></ul>\n<p><br/><strong>Controls</strong></p>\n<p>This Game will require mouse and keyboard<br/></p>\n<p>Use the mouse to select dialogue options and menu items<br/>WASD or arrow keys to move<br/>F when you see an interact symbol to interact<br/>Escape to open the menu<br/></p>\n<p>(At this time, there is partial controller support, but the main menu is mouse only)<br/></p>\n<p><em><strong><em>An Adventure Game with Life Sim elements</em></strong></em></p>\n<em>\n<em>\n<p>But what does that mean?<br/>Something is making everyone in this outpost horny, but everyone is too busy to investigate why. That said, trying to get your own job tasks down each day is making you too busy as well, but you are sure you can fit a bit of nosing around.</p>\n<p>The game includes:</p>\n<ul><li>Day cycles - Energy starts full each day, but every action will lower it. Sleep to restore it and begin a new day.</li><li>Ever present distractions - A planet where everyone's horny? your Libido will act against you, increasingly</li><li>Customization - You will get to customize many aspects about your character: Looks, Skills, Genitalia, Pronouns</li><li>A Cast of Characters - each with their own desires and roles on the station</li><li>An Outpost to Explore - Full of interactables and flavour to discover</li></ul>\n<em><em>\n<p>Why isn't anyone nude? Have I seen this thing in another game? What is the meaning of existence? Can you make this look better?</p>\n<p>If you are asking questions along these lines, there is probably a simple answer of thus:</p>\n<p>I am not an artist.</p>\n<p>I've created, coded, implemented, written, everything in the game*. But I am still only one person. To get the game in full 3D with adventures, I've bought art &amp; sound assets which are not unique to the game. <br/>I would like to see this change.<br/>And you can help by supporting this project. If you look at our goals, our priority is to earn enough to hire dedicated professionals in all aspects of the game. But until then, the game will be completed with assets bought from others.</p>\n</em></em>\n<p><em><em><em>*Using UE4. Also, the Dialogue is built on top of the work done by Not Yet.<br/></em></em></em></p>\n<em><em>\n<p>Credit where credit is due, this game is inspired by these other games which come with recommendation: <br/>Ghosthug Games, Hardcoded: https://www.patreon.com/hardcoded<br/>A top of the line droid has escaped to a distant cyberpunk city, where she meets absolute cuties and team ups to discover the source of horniness.<br/>Inspired to use similar themes in a different way.</p>\n<p>Fenoxo, Trials In Tained Space: https://www.patreon.com/user?u=121401<br/>A text based RPG filled to the brim with adult content, transformations, customizations. Set in space as well.<br/>Has done more inspiration than any other adult game.<em><em><em><em><em>\n</em></em></em></em></em><br/></p>\n</em></em></em></em></em></em>", "metacritic": null, "released": "2020-05-29", "tba": false, "updated": "2020-06-01T05:30:38", "background_image": "https://media.rawg.io/media/screenshots/86e/86e0c20d5eb53124c22c44d245de39ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Quiet Domain"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}