{"id": 450184, "slug": "tabula-rasa-kaelynmauve", "name": "Tabula Rasa (kaelynmauve)", "name_original": "Tabula Rasa (kaelynmauve)", "description": "<p><strong>Tabula Rasa</strong> is an experimental simulation I created with ViperCard for StaffsJam 2020. I challenged myself to make something self-contained that could fit within the space of a single card. It's probably too short to be called a game but it's an interactive experience that attempts to explore the theme of human diversity.</p>\n<p>---------<br/><em>Play now at</em><em> </em><em>https://www.vipercard.net/0.3/index.html?s=a2FlbHlubWF1dmU|U2vMcggQHIPPX6pQQzkLx...</em></p>\n\n<p><em>Use the hand cursor (aka the Browse tool as it's called in ViperCard) to click the circle button under each bar and watch what happens. If you want to reset the simulation, either refresh the web page, or go to the Edit tab in the toolbar and click Undo (keyboard shortcut: Ctrl + Z). I recommend trying the simulation a few times as it's possible to get a different result each time you play!</em> </p>\n<p>---------<br/><strong>A closer look into the meaning behind it...<br/></strong>Every human is a unique individual with a distinctive mix of attributes that defines who we are. However, there exists an ongoing debate about nature vs nurture. Some argue that we are born blank states, impressionable and readily influenced, our attributes a cumulative consequence of our choices and experiences. Others counter that our attributes are already predetermined by genes at the time of conception.</p>\n<p>My simulation is modeled after the character stats screen you find in RPGs, where you can spend XP to level up certain attributes. The duration you click and hold each circle button for represents the amount of effort you put into making choices and doing activities related to each attribute. But does this translate to a proportional increase in the magnitude of the attribute?</p>\n<p>After multiple play-throughs, you'll realize that the increase in magnitude of each attribute for the amount of effort you put in is seemingly random! And that putting in the maximal possible effort doesn't guarantee you complete \"mastery\" of an attribute compared to everyone else. The duration you hold down each button for works within the constraints imposed by the source code to lengthen each attribute bar. Similarly, an individual's efforts can influence their personal attributes within the confines of their genetic code. Sadly, maximum effort doesn't translate to maximum results. Yet, not putting in any effort at all means you lose the opportunity to reach a full potential that you won't know the limits of till you try breaking them.</p>\n<p>So, how much effort is enough effort? And at what point do you become content with yourself? Food for thought, and all up to you. Feel free to share your opinions in the comments section below!</p>\n<p>p.s. The ViperCard I built my simulation on is moddable, so you can always save a copy for yourself and edit its contents/source code. If you do modify my simulation or give it an upgrade, I'd be glad if you could tag me in your work so I can give it a play as well!</p>\n<p>---------<br/>Download notes:</p>\n<ul><li>\"tabularasa.json\": My source code exported from ViperCard. Not executable unless you open it on https://www.vipercard.net/.</li><li>\"Tabula Rasa ViperCard Link.txt\": Contains the web link for my simulation. Ctrl + click to play on your browser.</li></ul>", "metacritic": null, "released": "2020-05-29", "tba": false, "updated": "2020-06-01T05:56:16", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0c9a02cdc334485ba45460240c9f6a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kaelynmauve"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}