{"id": 45014, "slug": "wonder-dungeon-survival-simulator-3d", "name": "Wonder Dungeon Survival Simulator 3D", "name_original": "Wonder Dungeon Survival Simulator 3D", "description": "Become a medieval wanderer! Roam about the forest, find resources to make your own shack and survive as long as possible!Explore this fantasy world and have fun playing Wonder Dungeon Survival Simulator 3D!<br/><br/>Welcome to the fantastic medieval lands filled with different dangerous creatures, brutal knights and, of course, magic! You are the lonely pilgrim travelling with the only one mission – survive!  Dig out interesting things to craft special tools for your own magic scroll! Collect ingredients to learn new spells and be ready to defend anytime! <br/><br/>These wild places are full of cruel magical monsters, aggressive knights and even cruel predator animals! Be attentive and careful, hide if you’re not sure about your power, or attack every rival with your super spells! Power-up your weapon and armor with special magic aura mastering your magic skills of medieval survivor! Don’t forget to mind that every obtained chest may contain different useful magical ingredients like frozen fragment or yellow stone, which will help you to craft more magical scrolls and even special shield, which will protect you from serious injuries! <br/><br/>Check your personal hunger, sleep and health indicators: if one of them drops, you’ll find yourself in a real trouble at these inhospitable medieval lands! Earn points for successfully done missions and battles and unlock new types of magical weapons, skills and spells!<br/><br/>Remember that if you see strange standard right at the center of sunny meadow or stone road – this is the first sign of really powerful and cruel monster boss! Check your weapon, armor and battling skills and decide if you are ready! Increase your power and fight with it lately, in case if you don’t want to die! Enjoy Wonder Dungeon Survival Simulator 3D game and have fun!<br/><br/>Wonder Dungeon Survival Simulator 3D features:<br/>•\tFantastic medieval survival simulator<br/>•\tWide range of interesting spells and weapons<br/>•\tAmazing craft system<br/>•\tDifferent kinds of rivals and cruel bosses<br/>•\tRealistic 3D graphics<br/><br/>Emerge into the magical medieval atmosphere! Fight with knights, fantastic monsters and ordinary animals, survive as long as you can and have fun playing Wonder Dungeon Survival Simulator 3D!", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-10-22T14:30:43", "background_image": "https://media.rawg.io/media/screenshots/3b1/3b17a4e8991a015a63b3664c9da58806.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["RPG"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}