{"id": 450101, "slug": "ikai-demo", "name": "Ikai - Demo", "name_original": "Ikai - Demo", "description": "<p>Fear and anxiety prevail after the darkest tales from Japanese folklore come to life in this first-person psychological horror game. Live the horror from the feudal era's beliefs as the priestess of a temple.<br/></p>\n\n<p>This demo is meant to test the key features of the final game. It is currently on Alpha so we'll develop it further in Ikai.  Don't forget to add it on your Steam wishlist if you enjoy it.</p>\n<p>The guys from @endflamestudio</p>\n\n\n<p>The blood-stained leaves were the first evidence of chaos. The temple's bell screams for help, but it is no longer a sacred place. All Gods have gone, giving way to monsters, ghosts and spirits. You, the perfect priestess, had the onus to protect it, yet did quite the opposite.</p>\n<p>Don’t faint now, embrace your weaknesses and pray for surviving in the mayhem you’ve just unleashed. Keep a stiff upper lip, nothing bad will happen if you follow these two rules.</p>\n<ul><li>Write the protective seals on time with brush and ink</li><li>Be silent, under no circumstances should you disturb the evil</li></ul>\n<p>Dare you help get back the Gods and redeem your actions? Experience the terror by the hand of yokais and submerge into the superstitions of the past driven by a unique story and exploration.</p>\n\n\n<p>Endflame is a small team of three indie devs making a Japanese horror game.</p>\n<ul><li>Writing and design - Laura Ripoll</li></ul>\n<ul><li>Art - Iván Pérez </li></ul>\n<ul><li>Programming - Guillem Travila</li></ul>\n\n\n<p>Grab the PRESSKIT here<br/></p>\n<p>Twitter - @endflamestudio</p>\n<p>Newsletter - bit.ly/EndflameNews</p>\n<p>Web page - endflame.com/</p>\n\n<p>We hope you enjoy playing our demo. We'd love to see your feedback and Gameplay videos on the comments so we can take the best decision for a final game that you'll like.</p>\n<p>Since we are a small team, it is difficult for us to spot all the bugs, if you have found any issue please help us reporting it.</p>\n<p>The guys from @endflamestudio</p>", "metacritic": null, "released": "2020-05-29", "tba": false, "updated": "2020-06-01T05:36:40", "background_image": "https://media.rawg.io/media/screenshots/cf7/cf7b36b87bf7e1661b949bf4645251c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Endflame"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}