{"id": 450223, "slug": "surface-project-dawn-collectors-edition", "name": "Surface: Project Dawn Collector's Edition", "name_original": "Surface: Project Dawn Collector's Edition", "description": "Elephant Games presents the next spine-tingling installment of the Surface series!<br/>\n<br/>\r\nAfter a car accident on the way to your new home, your daughter goes missing! Your search for her leads you to a town that’s abandoned… Or is it? With danger around every corner, it’s up to you to uncover the mystery behind Project Dawn and save your daughter! Do you have what it takes to explore a dangerous history beyond your own imagination and escape? Find out in this chilling hidden-object puzzle adventure game!<br/>\n<br/>\r\nThis is a special Collector's Edition release full of exclusive extras you won't find in the standard version.<br/>\n<br/>\r\nThe Collector's Edition includes:<br/>\n<br/>\r\n•\tUncover secrets from Gray Falls’ past in the bonus game!<br/>\r\n•\tLearn more about the characters with your collections.<br/>\r\n•\tReview your illustrious achievements!<br/>\r\n•\tNever get lost with the strategy guide.<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2017-11-09", "tba": false, "updated": "2023-02-06T04:41:00", "background_image": "https://media.rawg.io/media/screenshots/e4d/e4df39942541bc4c4bbf6e806e2e2ce2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Elephant Games", "Elephant Ar"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}