{"id": 450246, "slug": "waking-xbox-one", "name": "Waking (Xbox One)", "name_original": "Waking (Xbox One)", "description": "WAKING invites you to embark on an epic, emotional adventure in your subconscious. Locked in the darkness of a coma, you must battle within a dream against your personal demons in an effort to wake.<br/><br/>To prevail against the forces of darkness, you enter into guided meditations, where you collect your most treasured memories and meet the people you love. This makes WAKING the most personal game ever made.<br/><br/>Presenting a high challenge in combat and the vast world waiting to be explored, WAKING appeals to fans of souls-like games and action RPGs.<br/><br/>YOUR LIFE. YOUR MEMORIES. THE MOST PERSONAL GAME OUT THERE.<br/><br/>Ask yourself -- what are the sacred relics of your life? A handful of dirt from your home town? A pet that died long ago? The eyes of the one you love?<br/><br/>At the end of quests, you are asked to close your eyes and listen to a guided meditation where you envision memories from your life. You then enter these memories into the game through a series of choices. These customized memories become your weapons in the game.<br/><br/>WAKING asks you to confront your fears, your desires, your personal demons, and your childhood traumas. By your side are the people you love, who you can summon to lead you through the unknown.<br/><br/>To wake, you must reconnect the synapses of your mind and unlock the mystery of what led you into the coma.<br/><br/>COMBAT WITH A SOUL<br/><br/>WAKING is a game designed for fans of Souls-like games in that it maintains a high (but adjustable) level of difficulty and challenge. Several key differences in the gameplay and combat systems, however, would make it fall outside of the genre.<br/><br/>One of the primary differences is the reliance on a telekinetic attack system, which is used in combination of melee and parrying to take down enemies. You will have to approach combat situations strategically in order to prevail.<br/><br/>UNIQUE WORLDS<br/><br/>Your vast, ever-changing Mindscape leads to unique worlds every time you venture into it. The landscapes, caverns, crypts, and dungeons in WAKING are all procedurally generated.", "metacritic": null, "released": "2020-06-18", "tba": false, "updated": "2020-06-05T02:14:38", "background_image": "https://media.rawg.io/media/screenshots/495/495e5391699c38ff25932fa81c307e2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}