{"id": 45036, "slug": "lobster-empire", "name": "Lobster Empire", "name_original": "Lobster Empire", "description": "Lobster Empire is a game where you build your lobster business and develop ways to create long-lasting lobster resources and profitable lobster fishery through conservation and research.<strong>Your story as a lobster businessman in this game:</strong><ul><li><strong>Era 1-Lobster Fishing: </strong> Lobster fishing is what you will do a lot in your business. Some of them are rare lobsters that will give you research points.</li></ul><ul><li><strong>Era 2-Hatchery Begins:</strong> Grow your own lobsters in hatchery system and maximize lobster breeding until they are juvenile.</li></ul><ul><li><strong>Era 3-Business Expansion:</strong> Your business and lobster market are getting bigger, you also have big fanbase. It's time to build restaurant, merchandise shop, even lobster world venue, and many others to gain maximum profit.</li></ul><ul><li><strong>Era 4-Research and Innovation:</strong> It's time to focus on research, building lobster academy, and finding valuable invention.</li></ul><ul><li><strong>Era 5-?:</strong> It's a secret!</li></ul><strong>Features</strong><ul><li>Send teams to catch lobsters in the sea using your ships collection with their own unique ability.</li></ul><ul><li>Explore islands and waters full of lobsters (some of them are rare!) by purchasing commercial license, but beware of storms, uncertain weather, and other obstacles.</li></ul> <ul><li>Recruit lobstermen with their own durability, stamina, law obedience, mechanical competence, sea understanding, and navigation skill.</li></ul><ul><li>Find wide-ranging rare lobsters on different areas and increase your research point by finding blue, yellow, calico, split colored, albino, and giant lobster.</li></ul> <ul><li>Use many fishing equipments to gain more profit like smart lobster trap, weather radar, and secret map.</li></ul><ul><li>Update your ship equipment to improve the amount of lobsters caught and your ship's efficiency.</li></ul><ul><li>Research lobster breeding and develop tools to minimize lobster mortality in your laboratorium and hatchery system to sustain lobster population.</li></ul><ul><li>Gain more profit through other businesses like seafood restaurant, merchandise shop, lobster seaworld, crayfish shop, and many more.</li></ul><ul><li>Host many events like ship race, crayfish beauty contest, and others to rocket your business’s popularity.</li></ul><br/><strong>The full game has many more features which are not listed here to prevent spoilers</strong>", "metacritic": null, "released": "2017-08-11", "tba": false, "updated": "2019-08-28T22:05:30", "background_image": "https://media.rawg.io/media/screenshots/864/8647981ad5a03c141188b38cc3b33a2c.jpg", "website": "http://www.maulidangames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22}, "playtime": 4, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maulidan Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Maulidan Games"], "esrb_rating": null}