{"id": 45038, "slug": "fungoids-steam-version", "name": "Fungoids - Steam version", "name_original": "Fungoids - Steam version", "description": "JimJams games are a small, indie development team with a love for the retro games of the '80's and 90's. We only develop games that embrace that era, aiming to provide true classic styled gaming, with a massive retro feel.<br/><br/>We don't aim to develop AAA games, but simply to bring our passion for a time gone by to those who love truly classic themed and inspired games. If this is a genre and era that you love, then our games are for you.<br/><br/><br/><br/>Fungoids is a classic styled, truly retro themed, 'bomb 'em up'.  Inspired by games from the 1980's and capturing the feel and the thrills of that period, we bring our take on retro classic gaming to Steam.<br/><br/><strong>FEATURES</strong><br/><br/>Play in classic mode, with all the features of our original vision:<br/><br/>1) Bomb the increasingly challenge of the Fungoid menace, to avoid Doomsday!<br/>2) Dodge and weave around the threat of the splatters and flitters<br/>3) Refuel, rearm and repair your ship as the battle continues.<br/>4) Rescue civilains using your tractor beam before it's too late.<br/>5) Programmable keys - RECENT UPDATE<br/><br/>Or play in Alpha mode, and unlock new experiences, as we continue to expand game-play, with a host of extra features, new Fungoids, expanded media,  and a wide range of new threats and challanges. This mode may include WIP features, everything is functional, but open to expanded development and change.<br/><br/><strong>CURRENT FEATURES</strong><br/><br/>1) 'oids' - civilian eating walking Fungoids<br/>2) Advanced spore types, including multi directional, homing and more.<br/>3) More fungoids.<br/>4) Greater level progression.", "metacritic": null, "released": "2017-08-02", "tba": false, "updated": "2019-08-28T22:05:30", "background_image": "https://media.rawg.io/media/screenshots/386/386385b68b59e3297b213d6de09eb460.jpg", "website": "http://www.jimjamsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JimJams Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["JimJams Games"], "esrb_rating": null}