{"id": 450345, "slug": "starfighter-ronin", "name": "Starfighter Ronin", "name_original": "Starfighter Ronin", "description": "<p>You are stranded in the debris field that was once an inhabited planet. Mining companies, insurgents, and even aliens fight over what remains. </p>\n<p>Welcome to the Umbaassa Expanse, where life is short and business is lucrative. Your new starfighter has the tech to keep a good merc alive. But do you have the skills to pilot it?</p>\n<p>---</p>\n<p>An arcade title heavily inspired by the game Asteroids (if that wasn't obvious yet :D). You have numerous weapons and abilities at your disposal. Use them well, because your ship is fragile. <br/></p>\n<p>Press escape to pause and view controls. Inputs are keyboard only. <br/></p>\n<p>Should adapt to your resolution, but designed to run in 1920x1080. <br/></p>\n<p>---</p>\n<p>DEVELOPMENT<br/></p>\n<p>This is a work-in-progress prototype. The eventual goal is to turn this into a game with a larger scope, sector map, story campaign, more dialogue and characters, etc. However, this prototype version will remain a small arcade title until I feel that it's feature-complete in its own right. Here's what still needs to be added to make that happen:</p>\n<p>- Simple scoring system<br/></p>\n<p>- Random events<br/></p>\n<p>- Better hit feedback<br/></p>\n<p>- New enemy types</p>\n<p>- Soundtrack<br/></p>\n<p>- Multiplayer (if I can make it work)</p>\n<p> I'll post progress updates and new builds here on itch.io as they happen. Older dev blog entries here.<br/></p>\n<p>---</p>\n<p>I am a total beginner at this, so I have no doubt there are plenty of bugs and jank still hiding in this game. Please let me know if you find any. All feedback is welcome. Thanks for playing!<br/></p>", "metacritic": null, "released": "2020-06-04", "tba": false, "updated": "2020-06-05T02:40:16", "background_image": "https://media.rawg.io/media/screenshots/2f2/2f2972420dcce0a470cecca6d7ff88a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["skul-gun"], "genres": ["Action"], "publishers": [], "esrb_rating": null}