{"id": 450333, "slug": "thrust-legend", "name": "Thrust Legend", "name_original": "Thrust Legend", "description": "Thrust Legend is a modern remake of the classic game \"Thrust\" by Jeremy C. Smith from 1986.  <br/><br/>Navigate your spaceship through the perilous caverns of increasingly hostile planets. Your mission is to lock-on to the enemy's power pod with your ship's tractor beam and escape the planet's gravity to space. Enemy defenses are automatically activated by your proximity. Enemy defenses are powered by a power station. Shooting the power station will temporarily stun all enemy defenses. Be careful, the power station can only take so much damage. Destroying the power station will cause an explosion, who's blast wave will engulf the entire planet. Escape the planet before the shock-wave destroys you. Use you ship's shield to protect against enemy projectiles and soft impacts with cavern walls. You cannot shoot and use the shield at the same time. Use the ship's fuel extractor above fuel canisters to refuel. If you run out of fuel, it's Game Over. <br/><br/>Once a planet has been reached, it is unlocked and you can practice or continue playing from this point on later.  Extra bonus points are awarded for destroying power stations. Extra points and achievement stars are awarded for completing the mission under a certain amount of time, fuel and without losing a life.<br/>Playing in \"Legendary Mode\" starts a play-through from the beginning in order to chase a high score.<br/><br/>This remake contains <br/><br/><ul><li>6 original levels remastered and juiced!<br/></li><li>5 original reverse gravity levels remastered as underwater levels.<br/></li><li>6 completely new levels challenging your skills, and if that was not enough,<br/></li><li>6 brutal levels originally designed by Martin Burchell in 1992 as a mod of the original BBC-B ROM.<br/></li><li>6 underwater ( reverse gravity ) equivalents of the brutal levels. Simply ridiculous!<br/></li><li>The soundtrack is an original composition \"Thrust Legend\" by Matt Gray</li></ul><br/>This is a keyboard only game. <br/><br/><ul><li>Rotate Left - A<br/></li><li>Rotate Right - S or D<br/></li><li>Thrust - Shift<br/></li><li>Shoot - Return<br/></li><li>Tractor Beam / Fuel Extractor - Space<br/></li><li>Pause - P<br/></li><li>Quit - Escape<br/></li><li>Menu Navigation - Cursor Keys, Return, Escape</li></ul>", "metacritic": null, "released": "2020-06-02", "tba": false, "updated": "2020-09-10T23:27:10", "background_image": "https://media.rawg.io/media/screenshots/24c/24cafc5c3a5e8cb92591b36d1092598d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Peter Klauser"], "genres": ["Action", "Indie"], "publishers": ["Peter Klauser"], "esrb_rating": null}