{"id": 450436, "slug": "docs-drive-in-theatre-game", "name": "Doc's Drive In Theatre Game", "name_original": "Doc's Drive In Theatre Game", "description": "<p>There's a secret at Doc's Drive In Theatre.   Can you survive the zombie apocalypse and enter the secret underground bar?</p>\n<p>This game was designed around a real Drive In Theatre in Buda, Texas.  The games is enjoyable and also contains many leaks of future plans of an underground speakeasy bar being built at Doc's Drive In Theatre , named Mama Merlot's.  You may also stay the night in a Movie Themed Tiny Home if  you are out of town visiting!</p>\n<p>Wizarding World</p>\n<p>Galaxy Far Away</p>\n<p>Breakfast at Audrey's </p>\n<p>Purchase game to support a family owned business and follow us for updates on movies and events.</p>\n<p>This game was created by one of the first employees at Doc's Drive In Theatre, who's passion is video game design.  To follow his upcoming work go to:</p>\n<p>Raven Eye</p>\n<p>You will notice, the similarities of the real Drive In, compare photos, real preshow commercial on the screen, and design layout.  Compare photos online, and enjoy exploring the realism of this game!</p>\n<p>It is a true experience to play the game and visit the actual place!  Nothing has been done like this before!<br/></p>\n<p>Support a local small family ran business and support an upcoming video game designer by purchasing this game.</p>\n<p>Enjoy the Show!</p>", "metacritic": null, "released": "2020-06-03", "tba": false, "updated": "2020-06-05T03:04:01", "background_image": "https://media.rawg.io/media/screenshots/8c0/8c03ecdaa8ca51ae5dfe01c8844fbce1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Docs Drive In"], "genres": [], "publishers": [], "esrb_rating": null}