{"id": 450402, "slug": "slime-olympics", "name": "Slime Olympics", "name_original": "Slime Olympics", "description": "<p> </p>\r\nWelcome to the slime olympics!\r\n<p> You are a budding young slime cook hoping to earn enough to retire by cooking up new slimes to enter into the slime olympics and win prize money </p>\r\n Gameplay \r\n<p> The game is split into days, on each day the following will occur:\r\n</p>\r\n Shopping \r\n<p> Buy ingredients from the shop to cook your slimes with. Make sure to balance out all of the available stats and leave some money for tomorrow so you don't go bankrupt! You automatically get 3 solidifiers for free (and can't buy more) </p>\r\n Cooking \r\n<p> Drop ingredients into your pot one at a time to make a slime. Solidifiers will empower all ingredients put into the pot after them, and you need at least one to be able to finish your slime, but beware - adding 3 solidifiers will harden your slime and make them perform much worse in the competitions.\r\n</p>\r\n Competitions \r\n<p> Choose a competition to enter out of the 3 available. Each has a different number of events that your slime must complete sequentially to win the grand prize. If your slime is killed during an event they can't proceed to the rest of the competition (obviously) </p>\r\n End of day \r\n<p> After the competition, all the ingredients left in your bag are thrown out so they don't get stale, and you proceed to the next day's shopping. If you have 0 money at this point, then you are bankrupt and have lost the game! </p>\r\n Note \r\n<p> This game is an entry for the Weekly Game Jam # 151. As a concept I think it's pretty cool but honestly there are still some parts of it  that are a bit lacking. I'm publishing it in the spirit of entering the game jam with whatever you've made but don't expect an amazing experiece from this. </p>\n<p> Still, thanks very much for checking out my game(s)! If you like what you see and would like to encourage me to make more stuff, why not  buy me a coffee? </p>", "metacritic": null, "released": "2020-06-04", "tba": false, "updated": "2020-06-05T02:56:04", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d61e6fbd9a2f4d3437a36f114927d2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Space Otter"], "genres": [], "publishers": [], "esrb_rating": null}