{"id": 45052, "slug": "dead-horizon", "name": "Dead Horizon", "name_original": "Dead Horizon", "description": "<h3>A six shooter is all you have in a world of sand, dust, and blood...</h3>On a barren desert world, Bonnie Star ekes out a living as a carnival sideshow act. She spends most of her days staring at the bottom of a bottle of booze as though it might have something to say. That is, until a man dies in her arms.  A man from whom she hears a story about a way to bring free water to a desperate land.<br/><br/><br/><h3>An adventure game for the modern era...</h3>With adventure gameplay focused more on choices than pixel hunting or moon logic puzzles. Enjoy talking with characters, figuring out what you want to do next, and dealing with problems without ever needing to be afraid of 'screwing up' your progress. Not that your choices don't have consequences... <br/><br/><br/><h3>Heartbeats count when lead starts to fly...</h3>Dead Horizon is a story focused adventure game with rail shooter action elements.  We have dubbed it a 'puzzle shooter' because we think we're clever. It combines classic point and click gameplay with rail shooter elements, strong characters, and a deep well thought out setting in which water is more valuable than blood.<br/><br/><br/><h3>A vibrant yet dying world for you to explore...</h3>The world of Dead Horizon is not one of infinite frontiers.  It is a setting of pain and bones bleached white by a world that wants nothing more than to consume what few people are left on its surface. Yet, those people still live their lives, have their own stories, dreams, and aspirations. A dying world doesn't mean that people don't live.<br/><br/><br/><h3>The Hard Sell...</h3>Dead Horizon is a game with one foot firmly in the past: adventure games, the 90s, pixel art and some older design philosophies. However, it is also a game with one foot firmly in the future: interaction, immersion, cinematic storytelling, and reactive dialogues. By taking the style and lessons of the past and combining them with both modern game design elements and a love of storytelling, we've tried to create something beautiful.<br/><br/>Dead Horizon is a labor of love. A love of storytelling, of pixel art, of westerns, of so many things. A love of gamers and games. Of the people who have come before and everyone that will come after.<br/><br/>We hope you are willing to celebrate this love with us. Even when all we see around us are Dead Horizons, those barren sands are full of beauty.<br/><br/><br/>", "metacritic": null, "released": "2017-08-11", "tba": false, "updated": "2023-02-14T12:31:20", "background_image": "https://media.rawg.io/media/screenshots/82a/82a93a7ffa6d34a2b58d9f6ad3bc736c.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 154, "beaten": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "Linux", "macOS"], "developers": ["Wastelands Interactive", "14 Hours Productions"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Wastelands Interactive", "14 Hours Productions"], "esrb_rating": null}