{"id": 4505, "slug": "carnival-island", "name": "Carnival Island", "name_original": "Carnival Island", "description": "Experience the joy of classic family-friendly fun in more than 35 carnival games and attractions. Using the PlayStation®Move motion controller's precise tracking technology, every toss, roll, throw, spin, and slam is translated directly into the game for extremely accurate and responsive gameplay. Whether you’re 5 or 65, family game night just got a lot more fun!\r\n\r\nCheck out the game with this Game Trial to see what the fun's all about!\r\n\r\n• Complete challenges in more than 35 carnival games and attractions and redeem tickets to unlock lovable pets and amazing prizes, bringing magic and life back to the world of the carnival.\r\n• Play alone or with family and friends for the perfect social gaming experience for up to 4 players.\r\n• Put yourself in the game with interactive funhouse mirrors, and share carnival memories with friends and family by sending pictures to a PSN friend or saving off to the XMB™.\r\n\r\nPlayStation®Move motion controller and PlayStation®Eye required (sold separately).\r\n\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item.\r\n\r\nCarnival Island is a trademark of Sony Computer Entertainment America LLC. © 2011 Sony Computer Entertainment America LLC.", "metacritic": null, "released": "2011-11-15", "tba": false, "updated": "2023-08-27T10:00:04", "background_image": "https://media.rawg.io/media/screenshots/f09/f090ca497dc5715ed1d9de4f6ac0b0f4.jpg", "website": "http://uk.playstation.com/carnivalisland/", "rating": 0.0, "rating_top": 4, "added_by_status": {"owned": 23, "beaten": 2, "dropped": 4}, "playtime": 0, "achievements_count": 21, "ratings_count": 5, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 5, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment", "Magic Pixel Games", "SCEA Santa Monica Studio"], "genres": ["Arcade"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Everyone 10+"}