{"id": 450618, "slug": "scp-assistance-2", "name": "SCP: Assistance 2", "name_original": "SCP: Assistance 2", "description": "<p>Version: 0.3.2 (Currently)</p>\n<p>What's included?: New wall textures, Changed SCP-079 face, New 294 Panel, Revamped Containment Doors, New Off Monitor Screen, New Machines, Added RE3 Remake Save Room for 914, Forest Reskinned, SCP-939 Speed Pace Changed, New 049 Label, 049 Enhanced, New LCZ, HCZ, EZ Walls, Material Walls Changed and Improved, New Voice Actors, Wood Reskin, New 294 Keyboard, Changed 079 Keyboard, New 079 Peripherals Revamped, New 079 Monitor Revamped, New Alchohol Hand Gel, New bowl of blood, New Control Panels including circuits or electronic conductors, New Doctors Picture, Changed Old Doors to Futuristic, New Grass, New Fire Extinguisher, New White Gears, Reskin Whiter Metals, Changed SCP Logo Board, New MTF Arrive Announc SFX, New Menu Soundtrack by Corvus. B and Samuel Laflamme, Changed Neo's Radio Sound, Added Phone Guy in Radio, Added Jill, Carlos and Bard in Radio, Added Flamingo's/Albertsstuff's Scream in Femur Breaker, Reskinned Caution Sign for Tesla Gate, New SCP-049 Captured Sound, New Ambience, New SCP:A1 Containment Breach Sound Event, Changed SCP-008, New Menu Screen, New 173Back Pic in Menu, New SCP-173 Moving Sound, New SCP-049 Chasing Event Soundtrack, New End Credits Soundtrack, New 173Vent SFX, New 035 Preseve SFX, New Tesla Gate SFX, New SCP-079 Achievement, Added Roblox Vest, New NTF's Spotted Voice, Louder SCP-914 Refining, New Save SFX, New Load Game SFX.</p>\n<p>3 years after the events of the first Assistance(The prequel), You were captured by the SCP Foundation and was sent to the new mordern Site-19 for maybe escaping from the old Site-19 as a D-Class before it got detonated. The containment breach occurred and you are about to experience more terror. All SCPs are back and reactive once again. It's your choice to either survive this time or die. Your goal is to escape the facility alive and well by the chaos insurgency, otherwise get caught by NTFS or detonate the place. There will be different endings.<br/></p>", "metacritic": null, "released": "2020-06-03", "tba": false, "updated": "2020-06-05T03:43:00", "background_image": "https://media.rawg.io/media/screenshots/cb1/cb1528a91faf8c9fb5ce917c9808903e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TeamInfiniteStudios"], "genres": [], "publishers": [], "esrb_rating": null}