{"id": 450652, "slug": "inverted-itch-moonmonster-studios", "name": "Inverted (itch) (MoonMonster Studios)", "name_original": "Inverted (itch) (MoonMonster Studios)", "description": "What is Inverted about?\r\n<p>Inverted is an experience about two people who are connected with each other through their soul. Together, they travel through a mystical world to discover what happened to them and why they are linked to each other. In this early alpha sequence, they have to escape a temple.</p>\n\r\nWhat can you expect from Inverted?\r\n<p>Inverted is a two player co-op platforming experience. The gameplay is a combination of co-op puzzles, a gravity switching mechanic and tight platforming controls. The demo you're about to play is a showcase of the possibilities of this kind of gameplay. <br/></p>\n\r\nTwo players?\r\n<p>The game is made for two players. Since we're still in a global pandemic at the moment we don't want to encourage you to get together to play this game. But no worries, we've got your back. We recommend you use Parsec (https://parsecgaming.com/) to play from a distance. It's a great solution that enables any local multiplayer game to become an online multiplayer game. Technically you could also play the game alone while controlling both characters, making for an extra challenge.</p>\n\r\nShow me the controls!\r\n<p>Both keyboard controls and xbox controls are supported. We recommend the use of an xbox controller for an optimal experience. Keyboard controls can be found in the download &amp; install instructions. Xbox controls are shown in the game.</p>\n\n<strong>Developme</strong><strong>nt on hold.</strong>\n<p>Development of Inverted is currently on hold due to a lack of funding and interest from investors. We'll gladly pick up the development again when the chance presents itself (you can make that happen!). At the moment we are investing our resources in a new project. </p>\n\r\nDiscord\r\n<p>If you want to talk about the game or just want to follow us as developers, feel free to join our discord. We're happy to talk to you!<br/>https://discord.gg/cETDEbd<br/><br/></p>", "metacritic": null, "released": "2020-06-03", "tba": false, "updated": "2020-06-05T03:52:15", "background_image": "https://media.rawg.io/media/screenshots/7df/7dfe110d52cdd637506fd946f7b7dbd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MoonMonster Studios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}