{"id": 45062, "slug": "idle-empires", "name": "Idle Empires", "name_original": "Idle Empires", "description": "Ever wanted to play the role of a gold-hungry, power-obsessed tyrant? This clicker game lets you do whatever you want without being charged for war crimes!<br/><br/>The makers of Idle Armies and More! Gold! Now! offer their latest RPG clicker extravaganza: Idle Empires!<br/><br/>Join King Norman and help turn his peaceful little oasis of a kingdom into a war-hungry, gold churning, dictatorship riddled with fear. Transform peaceful cottages into your personal gold mine, orphanages into textile plants and town halls into prisons. Blame the peace-loving Orcs for all of society's problems and invade your neighbors... for their own protection, of course.<br/><br/>Funny, witty and - very occasionally - poignant dialogue explores power, corruption and populism in a way that doesn't take itself too seriously. Whether you're bribing priests or building propaganda towers in the villager green, you can bet Norman, the “hero” turned tycoon, and his goons will have something inappropriate to say.<br/><br/>Idle Empires Features:<br/>Pixel Graphics &amp; Clicker Gameplay<br/>+Beautiful pixel graphics!<br/>+Hours and hours of clicker gameplay!<br/>+Heaps of humorous dialogue from your radical “hero!”<br/>+Improve unsightly, unproductive shanties!<br/>+Interact with the happy new tenants to earn gold!<br/>+Find epic loot in chests!<br/><br/>Corrupt &amp; Conquer Kingdoms<br/>+Evolution… or domination is key – conquer more cities to keep lining your pockets<br/>+Conquer five distinct kingdoms: Old Town in the snowy north, Capitol in the golden desert and more.<br/>+5 different cities to uncover, corrupt and conquer!<br/><br/>Command Armies<br/>+Raise armies full of gluttons, snipers and assassins to smash the King's foes.<br/>+Break the shackles off warlocks and sorcerers to unleash their magic on your rivals.<br/>+Tap to collect an entourage of henchmen and yes-men to agree with your every decision.<br/><br/>Idle Empires has everything you’d expect from a clicker; tapping, heaps of upgrades, achievements, collectables, mountains of gold *catches breath* and a whole lot more. If you’re interested in dominating… er I mean, \"expanding” a kingdom, then Idle Empires is the perfect clicker game for you!<br/><br/>Download now and get started on your idle RPG adventure!", "metacritic": null, "released": "2017-07-26", "tba": false, "updated": "2019-10-22T14:30:44", "background_image": "https://media.rawg.io/media/screenshots/b03/b034d844f309ed5f9fa718da50475dde_3DOPQKd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Grumpy Rhino Games"], "genres": ["RPG", "Simulation"], "publishers": ["Grumpy Rhino Games"], "esrb_rating": null}