{"id": 450698, "slug": "chronicle-of-empires", "name": "Chronicle of Empires", "name_original": "Chronicle of Empires", "description": "<p><strong>Recover Glory and Honor of Empires!</strong></p>\n<p><strong>Global Kingdom War Online. Download Now.</strong></p>\n<p>You, Our King,  it's time to fight back to the enemies and reestablish the Honor and the Glory of Human Empire!  Evil magic dragons destroyed the human kingdoms rapidly . The land is reduced to ash…  Dragons enslaved Soldiers and Mages by Dark Magic and establish the Dragon Cult. In order to regain the human territory, we began to fight back…</p>\n\n<p><strong>Ready for the coming Warfare? </strong></p>\n<p><strong>Your Grace, Let's Conquer and Command!</strong>  </p>\n\n<p>- Gameplay Vedio<br/></p>\n\n<p><strong>Download Now.</strong><br/></p>\n<p><strong>Download Now.</strong></p>\n<p><strong>Download Now.</strong></p>\n\n<p>—— FEATURES——\r\n  </p>\n<p> \r\n  </p>\n<p><strong>World Brawl War Online </strong></p>\n<p>Brawls are going on all the time. All kinds of warfares and fights happened at the same time. And Chronicle of Empires is a REAL RTS game has seamless world map which supports unlimited zooming of perspective, provides you tons of possibilities for combat and strategy.  All battles and brawls can take in different places at the same time. You can start your fight at any time online, conflict with global players such as on the way to collect resources or investigation.\r\n  </p>\n\n<p> </p>\n\n<p><strong>Free Formation &amp;Troop Movements </strong><br/></p>\n<p>How will you use tactics to lead the army? You can adjust the Troop March anytime in the game, totally control free. Which gives you more strategic possibilities. You can send several troops out of the city, one for PVP, one for PVE , whcih can happen at the same time. Kill the Dragon Cult and enemies. When the battles are over, you can also collect resources on the way back to the city. Which is really movement free and feeling good.\r\n  </p>\n<p> </p>\n\n\n<p><strong>Forge Alliance</strong></p>\n<p>We set up a rich alliance system. Including alliance store, chat system, alliance technology, etc. Also chat system with translation function, you can talk with players all over the world. Here we trade, we help each other. Explore the continent together, expand the territory together, and protect the people together. And of course, plan for the great cause of Empire!</p>\n\n<p> </p>\n<p><strong>Hero Skills System</strong></p>\n<p>Summon legendary heroes from Alexander the Great and Mulan to Roland and Gilgamesh. Heroes of different races have their own skill attributes. We offered them RPG style skill system and talent tree. You can improve the skill levels of heroes by constantly battles and conquering other kingdoms!</p>\n\n\n\n<p><strong>Download Now.</strong></p>\n\n<p><strong>Airship Exploration</strong></p>\n<p>Build your Airship Deck, take airships and travel around this mainland, discover the Dark Secrets, the Hidden Magic, Sealed Dragon, and more dangerous enemies in the endless explorations. The places with rich resources are often what people most yearn for. but, be careful, it's full of danger and competition.</p>\n<p><strong>Cool City Castle</strong></p>\n<p>Love fun buildings? Magic style architecture is waiting for you to unlock. Upgrade the building levels, decorate your castle with pretty and fun style. We are always amazed at the creativity of every players!\r\n  </p>\n\n<p> \r\n  </p>\n<p>————————\r\n  </p>\n<p>We need feedbacks from you:\r\n  </p>\n<p>Hi Players, we commit us to providing free and High-quality games. And Chronicle of Empires now available is an Beta Version for Open Test. So if you have <strong>any issues or problems  </strong>while using our app, please contact us first before leaving a bad review. We will fix the issues for you as soon as we can. \r\n  </p>\n<p>We will continue to update and optimize the game. If you have great <strong>suggestions on strategy game, </strong>or hope us to add new functions, please feel free to contact us! We would like to thank you very much for your comments! If you like our App, please rate us with 5 ⭐!\r\n  </p>\n<p> \r\n  </p>\n<p>Follow us：\r\n  </p>\n<p>https://www.facebook.com/chronicleofempires/\r\n  </p>\n<p>https://twitter.com/ChronicleofEmp1\r\n  </p>\n<p> \r\n  </p>\n<p>Email：service@rangongame.com \r\n</p>", "metacritic": null, "released": "2020-06-03", "tba": false, "updated": "2020-06-05T04:04:10", "background_image": "https://media.rawg.io/media/screenshots/33f/33f3fd9c0e5c506d9a1d4741907496fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Chronicle of Empires"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}