{"id": 450783, "slug": "jumpala-demo-free", "name": "Jumpala Demo (Free)", "name_original": "Jumpala Demo (Free)", "description": "<p>JUMPALA is a fast-paced competitive game that's all about sabotage, superpowers, and stage control. While the core mechanics are simple, each game is a test of skill and strategy as you try to outscore and outplay your opponents. <br/></p>\n<p>Play with up to 4 players locally, or compete with others online.</p>\r\nLike it? Wishlist the full version on Steam!\r\n\r\nCharacters\r\n<p>\r\nLola has been training for the Jumpala Championship since the age of 17. She's a fierce competitor who will do whatever is necessary to win—even if that means slicing through the competition.</p>\n<ul><li><strong>Special - Dash N' Slash</strong>\r\nLola quickly moves and strikes with her sword, KOing any player standing on an adjacent platform.</li><li><strong>Ultimate - Line Strike</strong>\r\nLola dashes across the stage, KOing all opponents between her current position and the end of the row.</li></ul>\n<p>\r\nFrore has earned a reputation for her elegance and relentlessness on the field. A two-time Jumpala champion and international celebrity, she now competes primarily for the sake of her fans. She uses her mastery of ice to slow opponents and get ahead.</p>\n<ul><li><strong>Special - Ice Blast</strong>\r\nFrore will shoot an ice projectile that freezes players on contact. Frozen players aren't able to control platforms.</li><li><strong>Ultimate - Algific Defense</strong>\r\nFrore freezes all platforms that are her color. Frozen platforms must be jumped on three times before the ice breaks. Icy spikes will also appear briefly, freezing any player who touches them.</li><li><strong>Passive - Cold Resistance</strong>\r\nFrore stays frozen for 50% less time.</li></ul>\n<p>\r\nCid is one of the youngest professional competitors in the history of Jumpala, and he feels like he has a lot to prove. The son of a renowned mechanic, he possesses a particular affinity to machines and gadgetry. The gauntlet on his arm, which he engineered himself, allows him to hack platforms to his advantage.</p>\n<ul><li><strong>Special - Lock</strong>\r\nCid will lock his current platform to his color, preventing any other player from changing its color. This ability will even override previously locked platforms!</li><li><strong>Ultimate - Row Lock</strong>\r\nCid will send a shock wave that locks all platforms on his current row.</li></ul>\n<p>\r\nBommer grew up doing demolition work with her father in the mineral caves. She's a thrill seeker—the only reason she joined the competition is that it's dangerous. She carries explosives to help spice things up a little.</p>\n<ul><li><strong>Special - Lock</strong>\r\nBommer places an explosive on her current platform that she can detonate at will.</li><li><strong>Ultimate - Row Lock</strong>\r\nBommer destroys all the platforms that are her color, except the one that she's currently standing on.</li></ul>\n<p><strong>Note: This game is still in early development. You can join the Discord to give feedback, or subscribe to the newsletter to receive development updates and more information!</strong></p>", "metacritic": null, "released": "2020-06-02", "tba": false, "updated": "2020-06-05T04:21:34", "background_image": "https://media.rawg.io/media/screenshots/4d1/4d1f0d82b47da527517a35cbedb47812.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Yokereba"], "genres": ["Action", "Strategy", "Fighting", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}