{"id": 4507, "slug": "motorstorm-apocalypse", "name": "MotorStorm: Apocalypse", "name_original": "MotorStorm: Apocalypse", "description": "<p>MotorStorm Apocalypse is a racing game developed by Evolution Studios. It is the third installment in the MotorStorm series.</p>\n<h3>Setting</h3>\n<p>You take part in The Festival, an extreme racing event that takes place in a post-apocalyptic San-Francisco. The city is torn apart by devastating earthquakes. There are no civilians left in the town, apart from scavengers and the PMCs sent to maintain at least some degree of order. </p>\n<h3>Gameplay</h3>\n<p>The Festival consists of three categories of events which are different in their difficulty. For every race, the player has to choose a vehicle from a pre-determined class. Buggies, motorcycles, and cars are present in the game. Players are free to tune and customize their vehicles as they see fit. </p>\n<p>The game features an advanced damage model. After sustaining a certain amount of damage, the cars crash and explode. Every vehicle can use a boost for a limited amount of time. If the player boosts for too long, the car can blow up. The car&#39;s engine can be cooled off to use a bit more boost. </p>\n<p>The inhabitants of San-Fran will attempt to interfere into the races. The scavengers try to slam the racers off the road using stolen cars or shoot at them while the PMCs create additional hazards for the participants of The Festival, such as an attack helicopter. Players have to keep in mind that the city is still vulnerable to natural disasters with buildings crumbling down on their heads.</p>", "metacritic": 77, "released": "2011-03-16", "tba": false, "updated": "2023-12-08T02:30:43", "background_image": "https://media.rawg.io/media/games/d63/d6369c10d3cff59b237f5f014fcc5475.jpg", "website": "", "rating": 3.61, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 726, "beaten": 72, "toplay": 19, "dropped": 76, "playing": 2}, "playtime": 0, "achievements_count": 48, "ratings_count": 158, "suggestions_count": 582, "game_series_count": 4, "reviews_count": 158, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment", "Evolution Studios"], "genres": ["Racing", "Arcade"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Teen"}