{"id": 450803, "slug": "pair-repair-2", "name": "Pair & Repair", "name_original": "Pair & Repair", "description": "Apresentação\r\n<p>A sua cidade está passando por maus bocados, terremotos acontecem quase o tempo todo e nesse ambiente turbulento  grandes heróis são necessários para mante-la intacta. Sozinho ou com um amigo, repare os prédios ao mesmo tempo em que estão sendo destruídos usando as ferramentas e materiais corretos para a reforma.  Porém não ache que por estar acompanhado de um amigo a tarefa ficará mais fácil, pois vocês terão que compartilhar as ferramentas!</p>\r\nMecânica\r\n<p>Pair &amp; Repair é um jogo plataforma, multiplayer local, que consiste em usar ferramentas e materiais na ordem correta para reformar as paredes dos prédios que estão sendo destruídas a todo momento pelos terremotos. O objetivo é manter o prédio de pé pelo maior tempo possível. Os jogadores ficam cada um em seu prédio e precisam compartilhar as mesmas ferramentas assim como as mesmas plataformas. Pode ser jogado cooperativamente(<strong>coop</strong>) ou competitivamente(<strong>vs</strong>).</p>\n<p>\n</p>\r\nPair &amp; Repair foi pensado como um multijogador local, que é quando acontece as interações mais divertidas, porém devido as condições atuais com COVID-19, eu adicionei um modo solo para as pessoas que não tiverem a oportunidade de jogar com um amigo, também possam aproveitar o jogo.\r\nHistória do Projeto\r\n<p><strong>Pair &amp; Repair</strong> foi originalmente feito por mim e por um amigo na Global Game Jam no primeiro semestre de 2020. Foi feito em 48h e como qualquer outro jogo de Jam, faltava MUITO polimento. E como eu tinha adorado a mecânica de compartilhamento de ferramentas, eu decidi refazer-lo em uma versão mais completinha, trocando a parte gráfica, substituindo as fases por uma única, adicionando algumas novas mecânicas assim como diferentes modos de jogo, incorporando compatibilidade com controle de PS4, e principalmente adicionando <strong>som</strong>, que foi algo que estava faltando no original e que faz uma diferença enorme. Mas chegou em um ponto em que de tanto adicionar elementos sem me planejar ou organizar, os códigos do jogo acabaram ficando bagunçados e ilegíveis, deixando a adição de novas features muito difícil. Então na última semana de desenvolvimento eu me empenhei em refazer e modificar todos os códigos, que estarão disponíveis abaixo assim como um link para versão antiga do jogo.</p>\n<p>Concluindo, <strong>Pair &amp; Repair</strong> é um jogo simples, mas que me proporcionou uma experiência muito agradável de aprendizado, principalmente em relação à programação e à engine <em>Unity</em>. Eu espero que quem for jogar goste e se divirta muito, obrigado por ler até aqui e  se possível, me  siga no twitter @Veludito, onde eu vou estar postando sobre os próximos projetos que estou fazendo.</p>\n<p>https://github.com/Veludito/PairRepair - Projeto Unity.</p>\n<p>https://veludito.itch.io/pair-repair - Versão Antiga.</p>\r\nCréditos\r\n<p>Procurando por uma música que passa-se bem a ideia do jogo eu achei esse vídeo do <em>8 Bit Universe, </em>que eu estou deixando o link abaixo.</p>\n<p>https://www.youtube.com/watch?v=WsQ1n8Py6OI</p>\r\nInstruções\r\nReparar\r\n<p>Existem paredes feitas de madeira e paredes feitas de tijolo, quando elas quebram é necessário usar uma ordem específica de ferramentas e materiais para poder repara-las. A ordem correta para isso é:</p>\n\n<br/>\n<p>Eventualmente, na plataforma mais acima, surgirá uma ferramenta dourada. O primeiro jogador que encostar nela será recompensado com todas suas paredes reparadas instantaneamente dependendo do material.</p>\n\r\nExistem 3 modos de jogo:\r\n<ul><li><strong>Solo</strong> - você precisa reparar os prédios sozinho  e durar o maior tempo possível.</li><li><strong>Coop</strong> - você e um amigo, cada um em um prédio, precisam revezar as ferramentas para conseguir reparar os prédios e durar o maior tempo possível.</li><li><strong>Vs</strong> - você e um amigo estão agora disputando as ferramentas para reparar seu próprio prédio, ganha quando o prédio do oponente cai primeiro.</li></ul>\r\nControles\r\n<p><strong>Jogador 1</strong></p>\n<ul><li> <strong>A </strong>e<strong> D</strong> - move-se para esquerda e direita</li><li><strong>W</strong> - pula</li><li><strong>S</strong> - desce da plataforma</li><li><strong>T</strong> - interage</li></ul>\n<p><strong>Jogador 2</strong></p>\n<ul><li>Setas <strong>Esquerda</strong> e <strong>Diretiva</strong> - move-se para esquerda e direita</li><li>Seta <strong>Cima</strong> - pula</li><li>Seta <strong>Baixo</strong> - desce da plataforma</li><li>Shift <strong>Direito</strong>- interage</li></ul>\n<p><strong>Controle de PS4</strong></p>\n<ul><li><strong>Analógico Esquerdo</strong> - move-se para esquerda e direita</li><li><strong>Botão X</strong> - pula</li><li><strong>Botão X </strong>+ <strong>Analógico virado para baixo</strong> - desce da plataforma</li><li><strong>Botão Quadrado</strong> - interage</li><li><strong>Botão Options</strong> - pausa o jogo</li></ul>", "metacritic": null, "released": "2020-06-02", "tba": false, "updated": "2020-06-05T04:25:54", "background_image": "https://media.rawg.io/media/screenshots/1b1/1b1ec2ef38baa843c90d4f95c38f53c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["VELUDITO"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}