{"id": 45088, "slug": "cat-vs-corgis", "name": "Cat vs. Corgis", "name_original": "Cat vs. Corgis", "description": "DescriptionCat vs. Corgis is a 3D On Rail Platformer inspired by classic platformers and a whole lot of corgis.<br/><br/>Stretch the cat wants to take this castle from corgis and collect their precious crests. Stretch will swing, smack and jump all over this castle to gain the riches these corgis are keeping for themselves.On-Rail PlatformingThe classic camera angles of old platformers are coming back but much more uniquely! Linear levels become much more diverse as many will offer a “branching path” to continue on. Making each level replayable and with different challenges!Stretchy TailStretch loves to do one thing with his tail, and that is stretching it. Our feline protagonist brings his own challenges to this platformer as there are many places to swing off around and bash enemies with. Swing from gap to gap or discover some interesting paths to traverse through in this crazy royal castle or smack around a corgi or two.Crazy Power-upsIt would not be a wacky platformer without some kooky power-ups to compliment. Stretch can gather up Yarn Balls to prevent one hit KO’s and Catnip to go crazy plow through anything in his path! Make sure to fill up your power-up bar with all those delicious fish crackers in each level to maximize your power-ups!Ferocious BossesFace up against 3 unique bosses that feature their own unique challenges and arenas! Whether it be under a waterfall or on a chessboard, Stretch will have his work cut out for him.Classic Platformer ProgressionStretch has plenty of places to explore all the way from the Royal Gardens, Corgi Castle and spooky Castle Dungeons! Each area features 3 Levels alongside its own boss. Each level will features crests unlocking your paths and bringing you closer to the royal crown!", "metacritic": null, "released": "2017-08-24", "tba": false, "updated": "2019-08-28T22:05:28", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4c2b9892bfb6e9bf8dc0b455ed1c6ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team 7 Lives"], "genres": ["Adventure", "Indie"], "publishers": ["Team 7 Lives"], "esrb_rating": null}