{"id": 45086, "slug": "powball-renaissance", "name": "PowBall Renaissance", "name_original": "PowBall Renaissance", "description": "Modern reboot of a classic Breakout remake, PowBall from 1995. Set in post-apocalyptic space, you are a Rockhopper mining Alchmite from long-forgotten space relics. Spend your salvaged loot on ammunition to help advance through the levels.<br/><br/>Take a nostalgic trip down memory lane with this classic brick-breaker remake, brought beautifully into the modern world of gaming, retaining the retro charm of the original but with many added features.<br/><br/>A true indie production developed at home by a lone programmer.<br/><br/>If you prefer graphics over gameplay, then this game isn't for you. Development has been focused heavily on delivering an enjoyable silky-smooth gameplay experience, whilst still maintaining an enjoyable visual experience. It has to be played to be believed.<br/><br/><strong>Features</strong><br/>- Multiple control methods: mouse, keyboard, game controllers, touch screen, and tilt.<br/>- Developed using a reliable, fast, and compact in-house game engine.<br/>- Level editor.<br/>- Local multiplayer. Up to 3 players simultaneously using any available control method.<br/>- Weapons &amp; ammunition. Each weapon has unique destructive qualities and are equally satisfying to use.<br/>- Physics: Solid ball physics makes it satisfyingly fun to play, rather than frustrating. Miss the ball by a couple of pixels? No worries, the ball gets chipped back into play, spinning off at a sharp angle. Enemy getting in your way? Swat it away with your paddle, or repeatedly ram it into a wall, shattering it into a shower of shrapnel and gems.<br/>- Shop: collect resources to trade for ammo, being aware of changing prices depending on supply-and-demand. Adds a strategic trading element to the game, making difficult to stockpile ammo and blitz every level with weapons.<br/>- Many mysterious features such as: portals; which add a unique puzzle element, helper bot; giving some much needed company in the void.<br/>- 240+ levels.<br/>- Regular updates. More levels and features coming soon.<br/><br/><strong>Coming Soon</strong> (if enough buyers show interest)<br/>- Elite level set: 110 new super-difficult levels.<br/>- Mac, Linux &amp; iOS versions.<br/>- Steam Achievements<br/>- DLCs", "metacritic": null, "released": "2017-08-01", "tba": false, "updated": "2019-08-28T22:05:28", "background_image": "https://media.rawg.io/media/screenshots/d04/d04c650249778cfdd0c784472a604f3b.jpg", "website": "https://www.facebook.com/PowballRenaissance/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 1, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["POW Games", "Anthony @ POW Games"], "genres": ["Action", "Arcade", "Casual", "Indie"], "publishers": ["Anthony @ POW Games"], "esrb_rating": "Everyone"}