{"id": 450845, "slug": "word-war-human-body", "name": "Word War - Human Body", "name_original": "Word War - Human Body", "description": "<p>The Word War - Human Body FREEWARE program covers 120 different terms about the human body.  There are six sets of 20 terms covering 6 areas of the human body: 1- Nutrition, 2-Muscle &amp; Bone, 3-Circulation, 4-Excretion, 5-Nerves, and 6-Reproduction.  Each set of words is presented in a game in which the definition is displayed and the player must shoot the appropriate term.  There are three levels of difficulty in which 1, 2, or 3 opposing canons shoot at the player, trying to steal points. If a player cannot recall a term, then selecting the HINT button will make the correct answer flash.<br/></p>\n<p>     The game has a STUDY mode in which there are no opposing canons and no score recorded.  The HINT key can be used freely. There is also a printable list of all the terms and definitions used in the program.  Finally, at the end of the program there is report screen which allows the user to enter a name. This report screen shows the levels completed, the number of hints used, the difficulty level, and the score for each section. The user may then start all over or go back to individual levels to improve the scores.<br/>     This program will run on versions of Windows from XP to 10.  It will also run on various Linux distros with Wine or PlayonLinux. The program is totally free and safe to use. There is no collection of any kind of data at all, there is no registration fee or procedure, and the program does not access the internet.<br/>      Visit https://sites.google.com/view/rtcgames/home or https://rtcgames.itch.io/   to find more free educational games.</p>", "metacritic": null, "released": "2020-06-02", "tba": false, "updated": "2020-06-05T04:34:51", "background_image": "https://media.rawg.io/media/screenshots/f93/f93e9f9853bef8dee085bfa81d99b133.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["rtcgames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}