{"id": 451049, "slug": "mehs", "name": "ME.H.S", "name_original": "ME.H.S", "description": "<p>ME.H.S (pronounced like V.H.S) is a short horror game that lets you experience the agonising brutality that all your favourite characters in the movies do, with your body parts being mangled and broken, only for you to rewind so it can happen again and again. Sure, you could just run away, try to get through your big scene without a scratch... but we both know what the audience wants to see. Let the blood flow until the credits roll and just enjoy the violence.</p>\n<p><em>Features</em></p>\n<ul><li>The Crippling System - Every attack you receive leaves its mark. Broken bones, bruises and torn out eyes - until you find a television to rewind.</li><li>Close Quarters Combat - What good would injuries be if there was nobody to inflict them? Share your pain with the others on set. I'm sure they'll be more than willing to return the favour.</li><li>Notes - Get a glimpse into the fractured psyche of your fellow man by... reading. The greatest horror of all.</li></ul>\n<p><em>Controls</em></p>\n<p>WASD - Move</p>\n<p>Space - Jump</p>\n<p>Shift - Sprint</p>\n<p>E - Interact</p>\n<p>1/2/3 - Torch/Knife/Handgun</p>\n<p>Left Mouse - Swing Knife/Fire Handgun</p>\n<p>R - Reload Handgun</p><p>ESC - Pause</p>\n<p>This game was produced within only a few months as the final major project for my university course. It's the first game that I will be publishing that I have worked on completely alone, so it may lack a little polish in some areas, but I hope you have a good time.</p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-05T05:22:29", "background_image": "https://media.rawg.io/media/screenshots/403/40398f61df7f00afafc17c5029855022.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamecrazyTom"], "genres": [], "publishers": [], "esrb_rating": null}