{"id": 451025, "slug": "slime-lad", "name": "Slime Lad", "name_original": "Slime Lad", "description": "Slime Lad!\r\n<p>Slime Lad is a short, 25 level platformer game about an adorable Slime trying to traverse through the deadly caverns which were once his home. </p>\r\nControls\r\n<p>This game uses keyboard and mouse.</p>\n<p>A &amp; D or Left and Right Arrow - Move Left and Right</p>\n<p>Spacebar or W - Jump</p>\n<p>R - Restart Level</p>\n<p>Mouse - Used to click on screen buttons</p>\r\n\r\nA Word From DoubleTom Games\r\n<p>So, this is it, the release of our first game (and hopefully many more to come!) We wanted to say a few things about this project before you hopefully download and give it a few plays. <br/></p>\n<p>This game took roughly two weeks to accomplish. In terms of platformers it isn't anything groundbreaking and you aren't going to see it on any top 10 games lists of 2020. The primary purpose of this project was to actually finish a game within a set amount of time, similar to a game jam. Something aspiring game developers and indies struggle with universally.</p>\n<p>We also learnt so much from this project - working as a dev team, game and level design and before this project pixel art, animation and making music were fairly foreign to us. (So please go easy on us in that department). We've made a few mistakes with this project too but they're all things we'll take into future projects and will only make us better developers.</p>\n<p>Once again, thank you all for playing!</p>\n<p>Wez &amp; Tom - DoubleTom Games</p>\n<strong>Contact &amp; Links</strong>\n<p>Twitter</p>\n<p>Facebook</p>\n<p>YouTube</p>\r\n\r\nVersion 1.1 Update\r\n<p>Hello fellow Slimers!</p>\n<p>This was always intended to be a short project purely as a learning experience in game development and to actually create a finished product. We've been surprised by the interest in the game so far, thank you to everyone that has downloaded, played, donated and left constructive feedback. With this we decided it was only right to add some of these features that you wanted. Uninstall the previous version of Slime Lad on your machine and download and install the new version 1.1 file. </p>\n<p>Thanks for your support, Wez &amp; Tom - DoubleTom Games</p>\n<p><strong>Added:</strong><br/>- Timer added to end game stats screen. Where my speed runners at?<br/>- Death Counter added to end game stats screen<br/>- Save Feature: When exiting game, save file will now be created        (C:\\Users\\XXXXX\\AppData\\Local\\Platformer\\Stats.st)<br/>- Stats Screen added to end of game (see above)<br/>- Continue Button added to Menu: Can now continue a previous session and        resume your progress<br/>- W key can now be used as an alternative to Space for jumping</p>\n<p><strong>Fixed:</strong><br/>- Incorrect colour change on 'Fullscreen' button<br/>- Issue on level 11 where player would get trapped between platform and wall</p>\n<p><strong>Changed:</strong><br/>- Menu layout changed to accommodate 'Continue' Button<br/>- Tutorial text on level 1 now updated with new control options</p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-05T05:18:16", "background_image": "https://media.rawg.io/media/screenshots/629/6295f01dea4a5e605439ffb3557116cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DoubleTom"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}