{"id": 451178, "slug": "jakjak-escape", "name": "Jakjak Escape", "name_original": "Jakjak Escape", "description": "<p>Ce projet est réalisé pour la GameJam n°25 de Gamecodeur.</p>\n<p>Vous y incarnez Jakjak, un gros lapin enfermé dans une série de clapiers.<br/>Vous devez ramasser  les carottes présentes dans le niveau pour ouvrir la grille et vous échapper (des deux niveaux test) avant la fin du temps impartie. <br/></p>\n<p>Objectif:<br/></p>\n<p>L'objectif était de coder mon premier jeu de plateforme en utilisant les connaissances acquises des premiers ateliers réalisés (bases, tilemaps...) en s'aidant le moins possible du cours pour la première partie du jeu, puis en comblant mes lacunes pas à pas avec le cours 'Plateformer' proposé dans la formation Gamecodeur.<br/></p>\n<p>Dans les grandes lignes, je respecte mes fondamentaux, mais je regrette de ne pas avoir creusé à fond tout le cours.<br/>Je vais reprendre, cette semaine, où je m'étais arrêté et quand je reviendrais dessus, il y aura  un air familier. :)</p>\n<p>Matériaux:</p>\n<p>IDE: ZeroBrane studio version Gamecodeur<br/>Langage: lua<br/>Framework: love2D<br/>Sprites et Tiles: Fais maison avec PyxelEdit<br/>Sons: Made in MaBouche avec Audacity + Bfxr<br/>Musique: Ressource libre \"Poco-loco\" par Magic_Spark<br/>Et... mes doigts.<br/><br/></p>\n<p>Difficultés:</p>\n<p>J'ai sauté tous les ateliers entre les 'collisions sur une tilemap' et le 'plateformer'. <br/>J'ai donc découvert pas mal de choses que je n'avais pas encore vu. Je faisais des aller-retour dans les fiches support lorsque je ne comprenais pas certaines choses.<br/>En particuliers la multiplication de mes sprites à chaque rechargement du niveau. Je ne vidais pas la liste de ces derniers et j'avais donc plusieurs JakJak à l'écran. <br/><br/>En pleine période d'examens, je n'ai passé qu'entre 20 et 30 minutes par jour pour le projet. J'étais un peu défait et j'ai même failli laisser tomber face à la charge. Mais j'ai vraiment envie de progresser dans cette formation. Même si j'aime apprendre à mon rythme, ça me donnais une occasion de faire plus et de me poser un défi.<br/><br/>L'organisation du code. J'ai démarré avec ma propre organisation et j'ai fini par avoir des blocages. <br/>Des variables locales qui devaient être utilisées pour certaines fonctions que je passais de fichier en fichier en les fournissant en paramètres... vraiment moche et plus lisible à un moment. <br/>J'ai fini par me décider à tout reprendre et à tout ranger de façon un peu plus logique et en ne me bornant pas à vouloir faire du pseudo objet. Souvent, la simplicité paye.<br/><br/>Des bugs toujours présents. Je me suis creusé la tête pour résoudre certains d'entre eux mais je sèche pour les derniers. Après la Jam, je demanderais des conseils à la communauté Gamecodeur. J'ai voulu réaliser un travail personnel et mesurer mon avancement avant de me lancer bêtement sur la suite.<br/></p>\n<p>Pas de menu... il faudra que je me fasse une session complète de gestion de menu. <br/>Au moins, histoire de proposer une interface d'accueil, ce serait chouette.</p>\n<p>J'ai découvert PyxelEdit, qui m'a simplifié la vie dans ce moment sombre. J'étais partie sur Krita, mais c'est galère pour l'animation. J'ai déboursé quelques euros pour être heureux.</p>\n<p>J'ai grugé sur pleiiiiiiiiiins de trucs. Je voulais au moins que ce soit jouable. Mais j'aime pas fournir du travail bancal. :P<br/></p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-05T05:48:38", "background_image": "https://media.rawg.io/media/screenshots/17a/17a04efd2e5b4d45c11c4af31260484d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KevBvt"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}