{"id": 451186, "slug": "heartrun", "name": "HeartRun", "name_original": "HeartRun", "description": "<p>        HeartRun is a game where you try to reach true happiness by collecting hearts. You start with 500 hearts and if you get 1000 hearts, you win. If you reach 0, you lose. You collect hearts by either trusting someone or rejecting them (e or r keys). If you reject an innocent person, you lose the hearts they offered. If you trust an innocent person, you get the offered amount of hearts. If you reject a guilty person, you gain the hearts they offered, but if you trust a guilty person, you lose the hearts they offered.</p>\n<p>       This game fits with the theme, \"Trust No One,\" because trusting no one is actually a good strategy for this game. Though it might not be the best strategy, it is still a good option because happier people (displayed by their color – use faces at the bottom of your screen for reference), offer less hearts than the people who are more depressed. But remember, the depressed people will more likely be guilty. If you're running out of hearts, you could take a risk and trust the depressed. Maybe, just maybe they will be innocent. </p>\n<p>       I had a lot of fun making this game and I hope you will have a lot of fun playing it. By the way, this is my first game-jam, so if you have any feedback, please leave it in the comments! I would love to hear from you to see how I can improve.</p>\n<p>ALL assets were made on Scratch, even the fonts, music and sound effects. More instructions are in the game. </p>\n<p>My main Youtube channel: https://www.youtube.com/channel/UCMnnEjSRUfAGesGAlL70nyg?view_as=subscriber</p>\n<p>My coding Youtube channel (content coming soon!): https://www.youtube.com/channel/UCb15_-IgvUsQ5xDThV9AlEA?view_as=subscriber</p>\n<p>Tutorial (Spoilers!): https://youtu.be/if_VW_KJr5g</p>\n<p>My itch page: https://expositive.itch.io/</p>\n<p>My Scratch: https://scratch.mit.edu/users/recubeulous/</p>\n<p>Made for BenBonk Game Jam #1</p>\n<p>- Matthew Deng</p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-05T05:50:41", "background_image": "https://media.rawg.io/media/screenshots/519/5194d871235720d58530557ed23973d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Expositive"], "genres": [], "publishers": [], "esrb_rating": null}