{"id": 451189, "slug": "stardude-alley", "name": "Stardude Alley", "name_original": "Stardude Alley", "description": "<p><strong>The Farmer's Guide to Profit<br/></strong>You've abandoned a life of ruling the galaxy to settle down and become a rural farmer. But along with your grandpa's rundown farm, you've inherited his tremendous gambling debt. The loans sharks are closing in, and all you have are a few old seeds...</p>\n<p>Fear not! With enough hard work, even you can bring Stardude Alley back to glory! The Farmer's Guide to Profit has helped thousands of idle farmers transform their land into golden, productive machines.</p>\n<p><strong>How to Control<br/></strong>Use WASD to move, and mouse to interact with the world. Click to place seeds down. Some seeds can be rotated with R before placement.<br/></p>\n<p><strong>Seed Plant<br/></strong>The most basic of plants. Plant a seed down, water it, and harvest it to secure a great return of even more seeds.</p>\n<p><strong>Fish Plant<br/></strong>Tired of watering and breaking your back? Fish plants will periodically sprout water out in the cardinal directions, irrigating your ground instantly. <br/>10 Seed + 10 Fish -&gt; 1 Fish Seed</p>\n<p><strong>Crafting Plant<br/></strong>Sometimes, you'll need to combine seeds to make even stronger vegetation. The crafting plant takes in up to three inputs, and through a novel mixture of acids, combines them into something new.<br/></p>\n<p><strong>Shrine<br/></strong>As a newcomer to the farm, you know nothing. But with enough offerings to the local shrine, you will discover ancient breeds of plants that will prove vital for your farm to progress.<br/></p>\n<p><strong>Iron Plant<br/></strong>The Industrial Revolution was said to have begun when a botanist discovered the first iron plant in a mountain village's trash piles.<br/>10 Seeds + 10 Iron -&gt; 1 Iron Seed</p>\n\n<p><strong>Frog<br/></strong>Gods deal in strange currencies, and for the local shrine here, frogs are what you want to be offering. A quality frog can hold for months in the fridge.<br/>5 Fish + 5 Iron -&gt; 1 Frog</p>\n\n<p><strong>Harvester Plant<br/></strong>With the harvester, the dawn of industrialization begins! Harvesters will automatically harvest the three tiles in front of them. Rotate these carefully to cover more angles and sides.<br/>5 Iron Seed + 5 Iron -&gt; 1 Harvester</p>\n\n<p><strong>Pipe Plant<br/></strong>You don't want items spewing everywhere, trust me. It's gonna lag. Pipes will take items from one end, and move them to the other end.<br/>5 Iron Seed + 5 Fish -&gt; 30 Pipe</p>\n\n<p><strong>Chestnut<br/></strong>Your inventory's getting full. Items are everywhere on the map, and you don't have a place to put them. You need a Chestnut.<br/>50 Seed + 5 Iron Seed -&gt; 1 Chestnut</p>\n\n<p><strong>Crafting Plant<br/></strong>More crafting = more production! Pipe items in and out of crafters to automate construction of every seed under the sun.<br/>1 Harvester + 5 Iron Seed -&gt; 1 Crafting Plant</p>\n<p><strong>Power Plant...?<br/></strong>A mysterious species. You'll have to experiment for yourself.</p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-05T05:51:28", "background_image": "https://media.rawg.io/media/screenshots/726/7260a2240be369e2017e577d76954374.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kvfrans"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}