{"id": 451514, "slug": "killer-shark-77", "name": "Killer Shark '77", "name_original": "Killer Shark '77", "description": "(GMC Jam 37 Entry) (Made in 96 hours)\r\nDocument BOW-7706██-04███:\r\nPsychic Killer Shark Incident \r\n<p>==================================================</p>\r\nSummary\r\n<p>On June ██th, 1977, starting at lunchtime, the famous resort<strong> </strong>██████████ was attacked by a great shark that complimented its ability to kill with its fangs with a grand arsenal of firearms modified to be usable by a shark. The death toll was over <strong>████ </strong>confirmed victims before the shark finally was put down by a brave ████████, with unconfirmed disappearances in the thousands according to some estimates. The Bureau has not been able to verify any of the sources.</p>\n\r\nCause\r\n<p> The killer shark also exhibited psychic powers and situational awareness far greater than that of any known shark, potentially even rivalling project ███████ in combat utility. With natural mutations deemed highly unlikely as an explanation (probability █████, with estimated relative error 0.5%) it was theorized the shark was a ██████ military project. Since no further attacks by similar animals occurred, and the naval base near ██████████ was evacuated and subsequently abandoned three days prior, it is possible that the shark was an escaped prototype, and the project cancelled due to the animal posing equal threat to its creators as its intended victims.</p>\n<p>Agents dispatched to the base ruins during operation ██████ were unable to recover any of the research or discern its purpose due to a combination of harsh weather and radiation levels, and at the time, it was concluded to have been part of the ██████ nuclear program. The Bureau urges agents to treat both these theories as equally valid and possible until further evidence is obtained.<br/><br/></p>\r\nCollected Evidence\r\n<p>Abnormally high chemical traces of ████████, industrial-grade ██████████ and the common narcotic ████████ were found in the sea where the event occurred. While it is possible some of it were released through the blood of the shark's victims, the presence of industrial-grade chemicals outlawed in the U.S. suggest a connection to the shark, and supports the hypothesis that it was created by a foreign force. Despite the elite diver squad searching the area around the shark's last known location for █ days, its body could never be recovered.</p>\n\n\n<p>\n</p>\r\nSocietal Impact\r\n<p>The event had a large cultural impact, and while the ███████████ resort was forced to close following the aftermath, shark tourism has become a major source of income for the ██████ population. 13 feature movies were shot by label producers during 1977-1980, though Bureau agents enforced cancellation of █ projects due to too high factual accuracy. (Annotated scripts with breaches of code ███ highlighted are available in appendix █)<br/></p>\n<p>==================================================<br/></p>\n<p><strong>DECLASSIFIED:</strong> 2020-06-01 [12:00 UTC]</p>\n<p><strong>SIGNED OFF:</strong></p>\n\n<p><strong>ALBERT H. REDFIELD</strong><br/></p>\n<p>Sr. Documentation Officer, Bio-organic Weapons Division<br/></p>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-06-05T07:01:42", "background_image": "https://media.rawg.io/media/screenshots/7f3/7f314fda01546ea5266493cfc3ce17a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yal"], "genres": ["Action"], "publishers": [], "esrb_rating": null}