{"id": 451638, "slug": "car-industry-tycoon", "name": "Car Industry Tycoon", "name_original": "Car Industry Tycoon", "description": "Build and manage your car factory! Grow your business, earn money and produce amazing cars. Become a car factory manager and billionaire.<br/><br/>Build your empire tycoon, collect idle cash and hire new workers. You can build many types of car parts by upgrading machines in your car factory. Upgrade parking to get more workers and expand your car business. <br/><br/>Car Industry Tycoon - Idle Factory Simulator is easy to play but hard to master idle game where you start with small car parts factory and thanks to your own decisions and fast progression of your business you end up with the biggest car factory in the whole world!<br/><br/>Best idle tycoon strategy game of the year! Unique incremental mechanics lets you to play with your own style and grow, manage and invest to your business like never before.<br/><br/>Features:<br/>-12 unique cars to build - one for each prestige level!<br/>-Hundreds of technologies to develop and upgrade!<br/>-Many exciting quests to complete!<br/>-9 different machines to build and upgrade in factory!<br/>-Intuitive gameplay with idle clicker mechanics - very challenging!<br/>-Booster cards to faster progress!<br/>-Tons of unique content!<br/>-Offline game - no internet connection needed!<br/><br/>If you like management and idle strategy games with some special simulation mechanics and incremental progress Car Industry Idle Tycoon is for you!<br/><br/>Join to us on discord!<br/>https://discord.gg/dFhes33", "metacritic": null, "released": "2020-06-02", "tba": false, "updated": "2020-06-08T02:18:16", "background_image": "https://media.rawg.io/media/screenshots/f38/f38d2b1f0b23162d6cba0aa757721bd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adrian Zarzycki"], "genres": ["Strategy", "Simulation"], "publishers": ["Adrian Zarzycki"], "esrb_rating": "Everyone 10+"}