{"id": 451769, "slug": "planes-of-booty", "name": "Planes of Booty", "name_original": "Planes of Booty", "description": "Rougelike meets bullet hell\r\n<p>Welcome to the world of supreme chaos ! Overcome hordes of moist enemies in a variety of arenas, collect powerful and wonky weapons, strive and rise in your never-ending battle.</p>\n<p>Consists of:</p>\n<ul><li>Bloody violence (but not really bloody)</li><li>8 gun with semi-random properties</li><li>Crabs</li><li>4 consumables to consume (wow !) if you're feeling that you could use some help in a dire moment</li><li>9 types of enemies (including crabs)</li><li>FUNNY CHEST THING</li><li>A bunch of pointless references to video-games and anime, but hey !</li></ul>\r\nHow to play\r\n<p>Honestly, you can read \"How to play\" in the game itself, so here are some quick notes: move with WASD, shoot with Left mouse click, and switch weapons (if any) with mouse wheel. Interact with stuff outlined white with E key. Shoot bad bois until there are none, then proceed to the Swirl.<br/></p>\n<p>Click on stuff from chests and click on some empty spots in your inventory. This is called collecting loot. Also, you can place consumables in the hotbar, and weapons in the weaponry. Cooldown means how fast weapon can shoot (lower is better), reload means how fast you can reload clips of your ammo</p>\n<p>Yes, it is infinite, and the difficulty scales 1.5 times every arena.<br/></p>\r\nIn case of questions of the sparse content...\r\n<p>This is a gamejam game. Was made by 2 people in about 3 weeks, and is pretty good if you ask me. Moreover, it's open source (you can find the link to the repo down below).<br/></p>", "metacritic": null, "released": "2020-06-07", "tba": false, "updated": "2020-06-08T02:51:17", "background_image": "https://media.rawg.io/media/screenshots/3c4/3c4d3c2c74189ef31e0df08f79289658.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["barsoosayque", "basoqa"], "genres": ["Action"], "publishers": [], "esrb_rating": null}