{"id": 451838, "slug": "django", "name": "Django", "name_original": "Django", "description": "'Django', In this game you will play as Django the brave doberman, left behind by his family in the lake house in deepest forests of kodaikanal. You will explore the fine woods of kodaikanal and face challenges in finding ways in forest and come face to face with wild animals to interact and to escape. Moreover you will uncover a beautiful and an emotional story between the father, son and the dog. Take a break from your profound work pressures, anxiety and from the monotony of life. Come in to the life of django and lose yourself in the unknown forest, experience the cool breeze of nature and woods. Kick your adrenaline with thrilling adventure and with a heart warming story.<h3>Key Features</h3><br/><ul>[* A stealth rich game where you use your intelligence in finding ways in the forest and in escaping the wild animals. There is a wide scope for adventure and nature lovers. ]</ul><br/><ul>[* An Independent game developed by gokul selvanathan in Unity engine and story by father selvanathan (Based on true story and events) ]</ul><br/><ul>[*This game is for the fans of story and exploration lovers and inspired from the games like First tree, journey, Firewatch, Rime, abzu. ]</ul><br/><ul>[*Just a small game(in gameplay hours) like first tree and journey (about an hour and half), a soothing interactive story telling game with unexpected twists and multiple event in gameplay]</ul>", "metacritic": null, "released": "2020-06-07", "tba": false, "updated": "2021-07-26T02:50:45", "background_image": "https://media.rawg.io/media/screenshots/9a4/9a4c660172460dddbca5a6ae0d011d82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["satvik2000naik", "Gokul selvanathan"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["TruePathGames"], "esrb_rating": null}