{"id": 451815, "slug": "rocket-flight-don-kyniu", "name": "Rocket Flight (Don Kyniu)", "name_original": "Rocket Flight (Don Kyniu)", "description": "<p>So, that's another Game Made in Unity by me. You're controlling the Rocket ship, who needs to avoid Obstacles like Meteors and elements from space bases, but also you'll encounter enemies, which you can shoot down by your rockets. Be careful: You've limited amount of fuel at your disposal and it regenerates after each level a little bit, also you can refill the fuel every few levels or repair your rocket ship a little bit.</p>\n<p>Also, this game has a little bit of \"Procedural generation\", so each time levels are a bit different. <br/></p>\n<p><strong>Controls:</strong></p>\n<p>AD/Left Arrow and Right Arrow to steer a rocket, space to accelerate in the direction of rocket's face.</p>\n<p>Lessons learned during developing this game:</p>\n<p><strong>Importance of the polish and little details. </strong>Sound effects, particle effects and in general feedback when player is taking action or certain event is happening is very important. It can change the entire game how it feels. It feels  more alive when you can see, that your action has some real impact and the game is alive.</p>\n<p><strong>Test, test and test.</strong> It might seem to be obvious, but testing a lot can avoid a headache, where, for example, your character is invulnerable or some things are broken when you changed something. This way you can fix them and make them again working like before. It's good to know, that testing is very crucial part of the game development.<br/></p>\n<p><strong>Working on less interesting stuff might seem like \"ekhmm, i Don't want to work on it\". But doing these things can improve a game a lot</strong>. I believe, that sometimes we have a moments, where we just don't want work on  certain stuff, but when you do it, your game is more complete. It's great to have  Menus, where you can start the game, go to the settings, load the game from save and so on. But working on these things might seem  to be not so interesting at all, as long as you complete it and it will be functional. It's very rewarding.  </p>\n<p><strong>Finishing is important.</strong> And when you finish the game(entire gameplay loop) It's very rewarding to see the game, which can be played from start to finish and you can pause game, exit it, start and so on. So the game itself might be considered as complete.</p>\n<p><strong>Every game teaches you something</strong>. So, even if you think, that you're not learning anything it's not true. You're learning and expanding your skillset. It's important to keep in mind and it helps when encountering  tough moments during development.<br/></p>", "metacritic": null, "released": "2020-06-07", "tba": false, "updated": "2020-06-08T03:02:59", "background_image": "https://media.rawg.io/media/screenshots/731/731f09d6b228a16a84efbc5382d8c898.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Don Kyniu"], "genres": ["Action"], "publishers": [], "esrb_rating": null}