{"id": 451979, "slug": "toy-tanks-demo", "name": "Toy Tanks Demo", "name_original": "Toy Tanks Demo", "description": "<p>How To Play:</p>\n<p>- Must have a Gamepad Connected, I use an Xbox Controller</p>\n<p>- Navigate the Menus with the Left/Right Dpad Buttons or the Left Joystick. Also use the \"Start\" and \"A\" buttons.</p>\n<p>- Hold the Y Button in certain menus to see addition helpful information.</p>\n<p>Gameplay:</p>\n<p>- Left Joystick controls how the tank moves.</p>\n<p>- Right Joystick controls your tanks gun (Where it's aiming)</p>\n<p>- Right Trigger Fires your Primary shot</p>\n<p>- \"A\" Button allows the tank to jump, hold this down to jump higher</p>\n<p>- Landing after a jump gives the player a speed boost, *Unless the player lets go of the left joystick while in the air</p>\n<p>- Each tank has a health bar, can be seen above tank</p>\n<p>- Each tank has a reload bar that displays the number of shots in your clip along with how long till the next shot is reloaded</p>\n<p>- Shooting before a shot is reloaded results in lost reload progress</p>\n<p>- Shooting right after your clip becomes full results in a faster shot.</p>\n<p>- All shots give the shooting tank and the shot tank a force depending on that projectiles stats and the velocity of your tank.</p>\n<p>- Acceleration and Max Speed are independent values, (A tank could have poor acceleration but have a very high max speed. Players that are able to maintain their momentum will be better able to take advantage of this stat.)</p>\n<p>- Black bullets go through white bullets </p>\n<p>- Bullets of the same color destroy each other when they collide. </p>\n<p>- PS. THE GAME DOES NOT HAVE ANY SOUND.  if you know a good sound designer, let me know. </p>", "metacritic": null, "released": "2020-06-07", "tba": false, "updated": "2020-06-08T03:35:48", "background_image": "https://media.rawg.io/media/screenshots/a6e/a6e2b5457e6007cd20930cbf213acdcb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rodney Luck"], "genres": ["Action"], "publishers": [], "esrb_rating": null}