{"id": 452173, "slug": "unholy-demo-atari-2600-game", "name": "Unholy (Demo) - Atari 2600 Game", "name_original": "Unholy (Demo) - Atari 2600 Game", "description": "<p><strong>(English)</strong></p>\n<p><strong>Story:</strong></p>\n<p>A young lady (Isabella Lorraine) gave a carnival party in her old mansion on a Christian reserved date, disrespecting her parents and the traditions.</p>\n<p>At the party, an uninvited person, Daniel Evander Von Icarus Lutox or just D.E.V.I.L, started to seduce her and invited her to dance. She falled in love with him giving a passionate kiss, but after the kiss, a lightening hit the mansion, killing almost every guests and then the Devil took the lady's body.</p>\n<p>An young monk (Gabriel Sancti) from a monastery near, was designated to save the survivors and get the young lady back from the evil.</p>\n<p><strong>Mission:</strong></p>\n<p>So you are the monk with a wooden crucifix inside a unknown mansion. The mission is rescue 4 survivors and find Isabella to get her back.</p>\n<p>This is a \"work in progress\" game, so you will download a demo of it. Clicking on download, you are supporting the development. Thanks!</p>\n\n<p><strong>(Portuguese)</strong></p>\n<p><strong>Estória:</strong></p>\n<p>Uma jovem (Isabella Lorraine) deu uma festa de carnaval em sua antiga mansão em uma data cristã reservada, desrespeitando seus pais e as tradições.<br/></p>\n<p>Na festa, uma pessoa não convidada, Daniel Evander Von Icarus Lutox ou apenas D.E.V.I.L, começou a seduzi-la e a convidou para dançar. Ela se apaixonou por ele dando um beijo, mas após o beijo, um raio atingiu a mansão, matando quase todos os convidados e, em seguida, o Diabo tomou o corpo da moça.</p>\n<p>Um jovem monge (Gabriel Sancti) de um mosteiro próximo foi designado para salvar os sobreviventes e recuperar a jovem do mal.</p>\n<p><strong>Missão:</strong></p>\n<p>Então você é o monge com um crucifixo de madeira dentro de uma mansão desconhecida. A missão é resgatar 4 sobreviventes e encontrar Isabella para recuperá-la.</p>\n<p>Este é um jogo \"em desenvolvimento\", então você fará o download de uma demonstração. Clicando em download, você está contribuindo com o desenvolvimento. Obrigado!</p>", "metacritic": null, "released": "2020-06-05", "tba": false, "updated": "2020-06-08T04:19:36", "background_image": "https://media.rawg.io/media/screenshots/135/135bf9655094538e9c6edf7beee778e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["leocsanti"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}