{"id": 452121, "slug": "breaking-blocks-rk", "name": "Breaking Blocks (RK)", "name_original": "Breaking Blocks (RK)", "description": "<p>\"<strong>Breaking Blocks</strong>\" is my version of the Breakout-style game based on the 'paddle and ball vs. blocks' game mechanic.</p>\n<p>You can proceed to the next level only after destroying all the BREAKABLE blocks (single or multi-hit) while simultaneously earning points ! (20 for 1-hit blocks  :  24 for 2-hit blocks  :  32 for 3-hit blocks)</p>\n<p>There are also some UNBREAKABLE and MYSTERY blocks which are conspicuous and for which no points are offered. Unbreakable blocks, as the name suggests are indestructible. Mystery blocks on the other hand are breakable and on hitting introduce some anomalous characteristics to either the game speed, the paddle or the ball (you'll see). This can either be of your advantage or it won't : it's up to you to shoot or shun !</p>\n<p><strong>CONTROLS</strong> :</p>\n<p><strong> 1)</strong>Move the paddle left or right by moving your mouse or using touchpad.</p>\n<p><strong> 2)</strong>Launch the ball by clicking the left mouse button when you're good to go.</p>\n<p>You got 3 lives at each level !<br/>But it isn't as easy as it may seem.<br/>Do you think you could reach the last level ?<br/>So go and give it your best shot !</p>\n<p>I hope you like the game and I'd really love some feedback :)<br/></p>\n\n<p>(<strong>Note</strong> : The game doesn't support a full-screen mode, but to get rid of the background click on the transparent 'Enter fullscreen' button and not the blue one as it may not meet the game's desired resolution.)</p>", "metacritic": null, "released": "2020-06-06", "tba": false, "updated": "2020-06-08T04:09:01", "background_image": "https://media.rawg.io/media/screenshots/2c9/2c90de09cc98c504236228db7a24b30d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RK"], "genres": ["Action"], "publishers": [], "esrb_rating": null}