{"id": 4522, "slug": "family-feud-decades", "name": "Family Feud Decades", "name_original": "Family Feud Decades", "description": "Survey Says, play The Feud You Remember! Based on one of the most successful game shows of all time, play as the leader of a family in a contest to name the most popular answers to survey questions from the decade of your choice. The game features all of the favorite elements of the show, including the scoreboard, face offs, strikes, stealing and ‘fast money’ rounds. \r\n<br/><br/>\r\nFeatures: \r\n<br/><br/>\r\n• Authentic sets and stages modeled on all four decades of the TV show, with wardrobe items to match, including hippie, disco, grunge and other retro outfits. <br/>\r\n• Fully customizable player avatars - choose hairstyles, clothing, accessories and more. <br/>\r\n• Predictive text input and auto spell checker make typing answers lightning fast. <br/>\r\n• 3 Modes of Play: Solo, Multiplayer mode on one PlayStation®3 system or online through PlayStation®Network.<br/><br/>\r\nBonus Items: Unlock bonus customization options as reward for your progress.<br/><br/>\r\nVoice Chat: Chat with other players using any compatible wireless headset for the PlayStation®3 system\r\n<br/><br/><br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.", "metacritic": null, "released": "2010-11-09", "tba": false, "updated": "2019-08-02T16:22:54", "background_image": "https://media.rawg.io/media/screenshots/804/804ff1900acf7cfc25a2e958a98a4c3c.jpg", "website": "http://www.ubi.com/US/Games/Info.aspx?pId=9092", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 3"], "developers": ["Ludia"], "genres": [], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Everyone 10+"}