{"id": 45228, "slug": "shopping-tycoon", "name": "Shopping Tycoon", "name_original": "Shopping Tycoon", "description": "Overview:<br/>Shopping Tycoon is a game in which your main objective is to design, build and manage a big shopping mall. Become a successful entrepreneur by satisfying your customers’ needs as you have fun constructing your own business.<br/><br/>Manage your mall:<br/>Unlock the best brands of clothing, jewelry, technology and much more. Meet the needs of your customers with toilets, restaurants and other services. Manage and expand the transport (bus, metro and taxis) so that more people come to buy your products. Equip your building with fire prevention systems and avoid little disasters. Manage the temperature, lighting, decoration and security systems of your building. Hire and manage the best staff and make your customers happy! Get celebs visiting your mall. Upgrade it to satisfy trademark investors and building inspectors.<br/><br/>Features:<br/>●\tDesign, create and manage your shopping mall.<br/>●\tClothing, footwear, jewelry, technology, sports, pets, restaurants and much more.<br/>●\tUnlock exclusive products from the best brands and display them on your shelves.<br/>●\tOther players will be able to visit your mall.<br/>●\tCelebrity guest stars.<br/>●\tTransportation management.<br/>●\tEquip your building with fire prevention systems.<br/>●\tAvailable in English, Spanish, German, Russian, French, Italian, Portuguese, Polish, Serbian and Greek.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:24", "background_image": "https://media.rawg.io/media/screenshots/73e/73ec159be6abee9da2ea7d5df0ea621b.jpg", "website": "http://www.dreamssoftgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 15, "achievements_count": 40, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DreamsSoftGames"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["DreamsSoftGames"], "esrb_rating": null}