{"id": 452286, "slug": "domsim-therapeutic-domming", "name": "DomSim: Therapeutic Domming", "name_original": "DomSim: Therapeutic Domming", "description": "<p><strong><em>I am so freakin' excited to share this latest experiment with you!</em></strong><br/></p>\n<p>I have literally been squirming in my seat, staying up late, and coordinating with lots of helpers to bring this new build to you!!</p>\n<p>Introducing our new, experimental <strong>Devilish Domina Therapeutic Domming experience</strong>!</p>\n<p>I've been thinking about creating something like this for a long time. With so much going on in the world piled on top of the normal every day struggles we all deal with, sometimes, we just need to be told <strong><em>everything's going to be okay.</em></strong></p>\n<p>All you have to do is download the build, load it up, and let <strong>my virtual Devil Girl avatar</strong> know if you need regular <strong><em>comfort</em></strong> or if you're <strong><em>grieving</em></strong>. <strong><em>Sit down</em></strong> or <strong><em>lay down</em></strong> on the virtual bed with me and let me give you a safe place to rest for a little while.</p>\n<p>I've coded up this scene to be an infinite meditative loop. Once you sit or lay down, I don't stop talking until you <strong>stand up </strong>or quit the scene. I won't ask you any questions or give you any commands. I will just be there comforting you until you don't need me anymore.<br/></p>\n<p>Since this is experimental and we're not sure what you all will think of something like this, <strong><em>please, please, please share your comments, suggestions, feedback, etc</em></strong><em>, </em>below or leave feedback on our Discord.</p>", "metacritic": null, "released": "2020-06-06", "tba": false, "updated": "2020-06-08T04:44:07", "background_image": "https://media.rawg.io/media/screenshots/87e/87edbba3cc990a89cf017309b5d1e47d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["deviant.tech"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}