{"id": 452339, "slug": "punch-pong", "name": "Punch Pong", "name_original": "Punch Pong", "description": "THE FAST-PACED<br/>TURN-BASED PING PONG <br/>FIGHTING GAME\r\n<p>Welcome to Punch Pong - the world's first ping pong fighting game - where you defeat your opponents from the far side of the table. Punch Pong is inspired by games like Street Fighter, Tekken, and Mortal Kombat... but there's a twist. Use special move combos to wear down your opponents and pay special attention to ball trajectories in order to find the right moment to strike.</p>\n<p>Concentration, reflexes, and strategic quirk  are your keys to victory.<br/></p>\n\r\nGame Features\r\n<p>- Game-pad &amp; keyboard compatible<br/>- Complete events to unlock new characters and special moves<br/>- Unlock versus mode to play against your friends in local multiplayer<br/><br/></p>\r\nNEW CONTENT EVERY MONTH\r\nThis game is in expansion. On a monthly basis we will add:\r\n<p>- A new location<br/>- New characters to unlock in player select<br/>- New special moves to unlock<br/></p>\n\r\nEARLY BIRD DISCOUNT\r\nBuy this game at a reduced price and all future Itch.io releases, content, and updates will be yours... forever!\r\n<p>No micro-transactions - ever - all new content comes unlockable with the game at your purchase price.</p>\n<p>By adopting the game early, you also contribute to the current stretch goal.<br/></p>\n\r\nCURRENT STRETCH GOAL\r\nNEW SPECIAL LOCATION\r\n<p>On top of our planned update, we will add a new special location to the game. It will be available for everyone who owns ( claims ) the game on Itch.io, now and in the future. The goal is based on Early Bird Discount sales and is made fully public so that you can check the on-going progress at anytime.</p>", "metacritic": null, "released": "2020-06-05", "tba": false, "updated": "2020-06-08T04:59:18", "background_image": "https://media.rawg.io/media/screenshots/64f/64f35ea2af4b32364a08ee148165ed61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nekomatata", "PouleyKetchoup"], "genres": ["Sports", "Fighting"], "publishers": [], "esrb_rating": null}