{"id": 452338, "slug": "project-toon", "name": "Project Toon", "name_original": "Project Toon", "description": "<p>Project Toon is an RPG based on 90s cartoons such as Tiny Toons, Animaniacs, Dexter's Lab and others, also grabs and borrows things from more classic cartoons like Pink Panther, Looney Toons and older cartoons.</p>\n<p>The combat systems has a unique style inspired by the amazing Paper Mario and The Thousand Year Door, which uses input actions during the combat. In the case of Project Toon, input actions let the player deal extra damage but also add a more cartoon feel to the entire experience. There's also a very unique feature which I can't reveal just yet, not because it's an incredibly ground breaking mechanic, but because I still need to figure out exactly how it's gonna work, I rather make no promises since the mechanic might end up being something completely different.</p>\n<p>The game is far from finished, what I'm currently showing you guys is the base movement, you can't see what's really special about it yet, I have to do other things before you'll be able to notice what's special about this movement system. But for now, please enjoy walking and that smooth camera follow when you jump to a higher place! I'll be writing a blog about how I achieved, it requiered very little code.</p>\n<p>If you are interested in game development or in this project be sure to follow the devlogs which I'll be posting constantly talking about everything this game has thrown at me, even tho this super early build looks simple, it has thrown more challenges that you can imagine, and the more I advance the more challenging it gets. So please be sure to check the devlogs out, I'll be covering all sorts of topics, from game design, 3D modeling, shaders, code, character design and more.</p>\n<p>Thank you and please enjoy... enjoy the nothingness, than can be enjoyed, Right?</p>", "metacritic": null, "released": "2020-06-05", "tba": false, "updated": "2020-06-08T04:59:08", "background_image": "https://media.rawg.io/media/screenshots/695/695d2b5df4af899bb7359cdd6aa4f13c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Yee"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}