{"id": 452436, "slug": "arctic-infiltration", "name": "Arctic Infiltration", "name_original": "Arctic Infiltration", "description": "<p>Pilot\r\nyour heavily armed tactical Submersible and descend many miles below\r\nthe Arctic surface to explore a sprawling underwater military\r\nfacility seized by terrorists who are threatening a worldwide nuclear\r\nmissile strike.</p>\n<p>Your\r\nmission: Infiltrate the base, rescue the hostages and eliminate the\r\nthreat.<br/><br/></p>\n<ul>\n<li>Full\r\n\t360 degree movement inside a fully immersive cockpit - strafe, roll,\r\n\tascend, descend, pitch and yaw your way through various underwater\r\n\tenvironments<br/>\n</li><li>Unleash\r\n\tdevastating weaponry to destroy enemy subs, such as the \"Shredder\"\r\n\thigh velocity twin minigun, the \"Nuclear Storm\" missile\r\n\tswarm or \"Sonic Torpedos\" which track an enemy's sonar</li><li>Battle\r\n\ta variey of enemy submersibles, each with different strengths,\r\n\tweaknesses, attacks and abilities such as drones, bombers or the\r\n\tdeadly stealth unit that hides using cloak technology \t\r\n\t</li><li>Activate\r\n\tthe \"Mining Drill\" to cut through ice, debris and\r\n\tobstacles - or manipulate the \"Robotic Arm\" to activate\r\n\tswitches, open doors and solve puzzles \t\r\n\t</li><li>Avoid\r\n\tenvironmental hazards such as falling debris, proximity mines and\r\n\tradiation zones<br/>\n</li></ul>\n<p>Our game is in development, all funds will be used only to finish creating the full game, and also make VR version.  Everyone who supports us and downloads our game,will get added to our email database and receive a standard and VR version of the full game when its completed.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-06-08T05:18:51", "background_image": "https://media.rawg.io/media/screenshots/a8b/a8ba2c092066ce113f9e06608e809d45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["arctic infiltration"], "genres": ["Action", "Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}