{"id": 452523, "slug": "kingdom-isles", "name": "Kingdom Isles", "name_original": "Kingdom Isles", "description": "<p><strong>Kingdom Isles</strong> is a strategic resource management / survival game. Expand and grow your kingdom from a small village into a large empire, trade resources with allies and protect your people from enemy attacks! </p>\n<p>Features:<br/>-Classic RTS / city builder-style gameplay<br/>-Randomly generated map<br/>-Save and load your progress<br/>-Multiple difficulties, for both casual and hardcore players<br/>-90+ Minutes of gameplay per run<br/>-Tower Defense-style combat<br/>-Unique electronic hip-hop soundtrack</p>\n<p><strong>DISCLAIMER: Currently in beta! There will be bugs. If you find any, or just have an awesome idea for a future update, feel free to comment down below :)</strong></p>\r\n-Build\r\n<p>Kingdom Isles features 15+ unique structures for the player to build!</p>\n\n<p>Build Settlements for your people to live in, build Industries to produce different kinds of resources, and build Forts and Walls to defend your kingdom from incoming attacks!</p>\r\n-Trade\r\n<p>The game has an interesting and strategic trading system, allowing the player to sell excess resources, or even buy exotic items that cannot be produced in the kingdom. Prices and items vary every day, and changes throughout the game. </p>\n\r\n-Defend\r\n<p>Your kingdom will get attacked from time to time. Enemy ships will storm the coasts, destroying your land if you don't stop them. <strong>Kingdom Isles</strong> has multiple military buildings, allowing for strategic defenses and synergies.</p>\r\n\r\n-Plan\r\n\r\n<p><strong>Kingdom Isles</strong> is not supposed to be a stressful experience. The game can be paused at anytime (even during enemy attacks), so you can take all the time you need to plan ahead or to just keep up with what's going on. </p>\r\n-Lastly, a little message from me:\r\n<p>I really hope you enjoy the game. I am a solo-developer, and this is my first fully completed project. I spent quite a lot of time with it, but i have no idea what it's worth. I have decided to release it for free, with the option to donate any amount you want. I am a pretty poor student, and the current covid-19 virus has had a large impact on my income. I would like you to consider donating if you found it enjoyable. If you can't donate because of the current situation, i fully understand. </p>\n<p>Have a nice day,<br/>Albin Frank</p>", "metacritic": null, "released": "2020-06-05", "tba": false, "updated": "2020-06-08T05:37:47", "background_image": "https://media.rawg.io/media/screenshots/cfe/cfe5777d2887727a8efc0a572764477b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Shad3x"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}