{"id": 452665, "slug": "nighthawks-2", "name": "Nighthawks", "name_original": "Nighthawks", "description": "Six months ago, you died and were reborn. A vampire. A predator. Not a mere creature of the night, but one of its masters. At least, that’s how things were supposed to be.<br/>\n<br/>\nUnfortunately, the world has changed. The secret is out. Vampires have finally been exposed, and though your existence is tolerated, your new thirst is not. You came to the one city willing to promise a fresh start, only to find suspicion and starvation waiting on its dark streets. But death could not hold you, and fear will not hold you back. When the sun goes down, outcasts *rise*.<br/>\n<br/>\nIt’s time to seize the night by its throat.<br/>\n<br/>\nWELCOME TO NIGHTHAWKS<br/>\n<br/>\nEnter a twisted, darkly comic city where humans and vampires are struggling to live together. Take over a failing nightclub on the wrong side of the tracks, and turn it into your personal empire through seduction, intimidation, and careful use of secret supernatural Gifts. Befriend and recruit fellow outcasts, digging deep into their stories and harnessing their skills. Explore a fully voiced, lavishly written world of dark shadows and bright neon, where your every decision will push the world towards a bold united future, or forever destroy any hope for peaceful coexistence.<br/>\n<br/>\nFEATURES<br/>\n<ul>\n<li>Climb from rags to riches as a modern Vampire</li>\n<li>Build your nightclub into a true nocturnal empire</li>\n<li>Meet a cast of off-beat, fully voiced characters</li>\n<li>Indulge your inhumanity— but be home before sunrise</li>\n<li>Engage in strategic combat against humans and vampires alike</li>\n</ul>\n<br/>\nMEET THE TEAM<br/>\n<br/>\nNighthawks is written and designed by Richard Cobbett (Sunless Sea/Sunless Skies) with art by Ben Chandler (Unavowed, Technobabylon, the Blackwell Series), and produced by Wadjet Eye Games. Made possible with the generous support of 3,934 Kickstarter backers, and many others who have contributed their faith and assistance.", "metacritic": null, "released": null, "tba": false, "updated": "2020-06-17T10:16:46", "background_image": "https://media.rawg.io/media/screenshots/a0b/a0b79d874fee451664e1e4b2d084f3a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Curiosity Engine"], "genres": [], "publishers": ["Wadjet Eye Games"], "esrb_rating": null}