{"id": 45284, "slug": "egglia-legend-of-the-redcap", "name": "EGGLIA: Legend of the Redcap", "name_original": "EGGLIA: Legend of the Redcap", "description": "Please read the notes below before purchasing EGGLIA: Legend of the Redcap.<br/>-------------------------------------------------------<br/>A young girl born to save the world and a Redcap once destined for violence. A story hatched from within precious eggs; a tale of meeting and parting ways... <br/><br/>A fantasy adventure with a thrilling story and beautiful graphics, EGGLIA is an RPG you will want to return to again and again.<br/><br/>Join colorful characters of varying races including Brownies, Dwarves, Gremlins and Aloes as they work together to revive the lands of EGGLIA, sealed away within mysterious eggs.<br/><br/>EGGLIA is lovingly crafted by an all-star team of veteran RPG developers:<br/>Director &amp; character design: Shinichi Kameoka<br/>Background design: Koji Tsuda<br/>Music: Yoko Shimomura &amp; Yoshitaka Hirota<br/>-------------------------------------------------------<br/>**Explore beautiful lands with a roll of the dice!<br/><br/>- Unlock gorgeous playfields sealed within mysterious eggs, and explore them with a unique dice-based control system<br/>- Strategy element allows you to stand and fight or turn tail and run!<br/>- Borrow the skills of adorable spirits and feed them delicious food to evolve their powers<br/>- Freely explore a nostalgic and detailed RPG world<br/>-------------------------------------------------------<br/>**Collect materials and grow your village!<br/><br/>Use materials you find in the playfield to build and furnish homes for the residents of EGGLIA. The better the homes and other gifts you give them, the happier the residents will be!<br/>-------------------------------------------------------<br/>**Make friends with a colorful cast of characters<br/><br/>EGGLIA is populated by a wonderful cast of strange and endearing characters. Some will appear simply when you revive their land from an egg, while some mysterious races can only be unlocked by clearing certain conditions. Help them to fulfill their wishes and grow your village together!<br/>-------------------------------------------------------<br/>**Please note the following before purchasing<br/>- EGGLIA: Legend of the Redcap can be played in full with a one-off purchase.<br/>- The game requires a data connection to play, so please enjoy in an environment with data reception.<br/>- Supported languages: English, Japanese (based on your device’s default language settings)<br/><br/>- Terms of service: http://egglia.jp/en/terms.html<br/>- Privacy policy: http://egglia.jp/en/privacy.html<br/>- FAQ: http://egglia.jp/faq/<br/><br/>Recommended environment:<br/>OS: iOS8.0 or later<br/>Memory: 1GB or more<br/>Free space: 700MB or more<br/><br/>Recommended devices:<br/>iPhone 5 / iPhone 5S / iPhone 5C<br/>iPhone 6 / iPhone 6 Plus / iPhone SE<br/>iPhone 6s / iPhone 6s Plus<br/>iPhone 7 / iPhone 7 Plus<br/><br/>iPad (5th generation) / iPad air<br/>iPad mini 2 / iPad mini 3 / iPad mini 4<br/>iPad Pro<br/><br/>- This application may be purchased from OS versions or devices that are not compatible, so please check the compatibility information before purchasing. Please note that operation cannot be guaranteed for incompatible OS versions or devices and that refunds are not available.<br/><br/>**Other information<br/><br/>Please note that if you delete the application from your device, your game’s save data will also be deleted. When moving to a different device, please use the Transfer Code available within the application to transfer your save.", "metacritic": null, "released": "2017-08-03", "tba": false, "updated": "2019-10-22T14:30:45", "background_image": "https://media.rawg.io/media/screenshots/295/295538fac2154875ae1b61a84a2272e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DMM.com Co"], "genres": ["RPG", "Simulation"], "publishers": ["DMM.com Co"], "esrb_rating": "Everyone 10+"}