{"id": 453, "slug": "carcassonne", "name": "Carcassonne (2010)", "name_original": "Carcassonne (2010)", "description": "<p>Famous boardgame and great iOS experience, with expansions as in-app purchases.<br />\n&quot;iPhone Game of the Year&quot;, iTunes Rewind Germany.<br />\n&quot;The single best board game experience in the App Store&quot;, gamezebo<br />\n&quot;Carcassonne does just about everything right on the iPhone&quot;, ars technica<br />\n&quot;It is quite simply one of the most polished games on the platform&quot;, wired.com<br />\n&quot;There&#39;s nothing like a sneaky farmer to push you across the winning line&quot;, Edge Magazine<br />\n&quot;Beautiful and intuitive&quot;, joystiq<br />\n&quot;Carcassonne is as good as it gets&quot;, EGM<br />\n&quot;Of all the tabletop games I have played on my iPad while pooping, nothing has as much time invested in it as Carcassonne&quot;, Wil Wheaton<br />\nPlay the original award winning board game Carcassonne with friends, family, or other board game enthusiasts - online or offline.<br />\nBuild a medieval landscape, tile by tile, claim landmarks with your followers and score points. As a winner of the prestigious &quot;Spiel des Jahres&quot; award in 2001, the game allows for a plethora of play styles and strategies. If you like social gaming or board games you will love Carcassonne!<br />\nFEATURES<br />\n• Official Carcassonne game with original artwork<br />\n• Universal App - Buy once, play on iPad and iPhone<br />\n• Expansions available via In-App-Purchase<br />\n• &quot;The River&quot; adds a new strategic element to the game play<br />\n• &quot;Inns and Cathedrals&quot; adds a double follower and tiles to upvalue cities and roads.<br />\n• &quot;Traders &amp; Builders&quot; with trade-goods, pigs and builders.<br />\n• &quot;Princess &amp; Dragon&quot; with dragon, princess, fairy and magic portals.<br />\n• &quot;Phantom&quot; adds the phantom, a game piece you can place in addition to other followers.<br />\n• &quot;Winter&quot; with a new theme, tiles, and the Gingerbread Man.<br />\n• &quot;Double Base Tile Set&quot; adds the possibility to play with twice the amount of base game (or winter) cards.<br />\n• &quot;The Old River&quot; - the first expansion ever for the board game<br />\n• &quot;The Abbot&quot; adds gardens and lets you score cloisters before the end of the game<br />\n• &quot;German Cathedrals&quot; - place a meeple on a German cathedral to score points. Roads connected to a German cathedral score bonus points.<br />\n• Easy mode that does not count Fields, ideal for Kids<br />\n• 9 different AI players: (Hans, Count, Countess, Maid, Servant, Juggler, Fortune Teller, Witch and Warlock)<br />\n• Play with up to five players passing one device around<br />\n• Unique Solitaire mode<br />\n• Internet multiplayer with Push Notifications<br />\n• Online and offline ranking<br />\n• Game Center Achievements<br />\n• Comprehensive in-game manual<br />\n• Tutorials with voice acting<br />\n• Compete for the best score in Solitaire Game of the Week<br />\n• Chat function<br />\n• Play with Game Center friends<br />\nFREQUENTLY ASKED QUESTIONS<br />\n• How do I redownload my Expansions?<br />\nYou can restore your purchases free of charge in the app&#39;s purchases menu. (The treasure chest in the main menu.)<br />\n• Help! I’m trapped in a menu screen!<br />\nTry opening http://carcassonneapp.com/cleanup.html in your iPad’s or iPhone’s Safari.<br />\n• What about more Expansions?<br />\nWe are continuing to work on further expansions. Please don&#39;t hesitate to tell us which one you&#39;d like to see next!<br />\n• Can I play asynchronously?<br />\nYes. In &quot;Play with Friends&quot; you can leave the app and will be notified when it&#39;s your turn again. No pressure though, unlike &quot;Quick Play&quot; there are no time limits.<br />\n• Can I play against my familiy or friends by passing the device around?<br />\nYes, of course. Up to five players can play on the same device.<br />\n• Do I need to buy the expansions to participate in a game with expansions?<br />\nTo play online multiplayer, you need to buy the expansion to play with it.<br />\n• Can I play with expansions in quick play?<br />\nYes. However currently we limit the combinations of the expansions in quick play to avoid fragmentation of the player base and longer waiting times for games. We try to give three or four useful combinations for quick play. There is also the &quot;Automatic&quot; category that tries to match you up with anyone who wants to play right now.</p>", "metacritic": null, "released": "2010-06-03", "tba": false, "updated": "2023-01-06T09:07:12", "background_image": "https://media.rawg.io/media/screenshots/5f1/5f1cabc9301f49378f1ecfa5a8256314.jpeg", "website": "http://carcassonneapp.com/", "rating": 3.82, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 127, "beaten": 6, "toplay": 4, "dropped": 3, "playing": 2}, "playtime": 0, "achievements_count": 29, "ratings_count": 11, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 11, "platforms": ["macOS", "iOS"], "developers": ["TheCodingMonkeys"], "genres": ["Strategy", "Board Games", "Family"], "publishers": ["Asmodee Digital", "TheCodingMonkeys"], "esrb_rating": "Everyone 10+"}