{"id": 453189, "slug": "enlightenment-itch-null-404", "name": "Enlightenment (itch) (Null 404)", "name_original": "Enlightenment (itch) (Null 404)", "description": "<p><strong>Story</strong></p>\n<p>The story of Enlightenment centers around the player character Shandy, whose village has been attacked by goblins. After escaping the village you are given new gear and  sent back to gain more powers and take back your village. The general world style of the game is high fantasy, with a dark setting, creatures and visual elements.</p>\n<p><strong>Gameplay</strong></p>\n<p>Enlightenment is a 2D side scroller, action game. The player will have access to a multitude of weapon attacks throughout the game; they will unlock these weapon attacks progressively. The attacks will be made with emergent gameplay in mind as the controls will be simple to perform however can be strung together in combination to produce much more complex outcomes. </p>\n<p><strong>Combat</strong></p>\n<p>The combat system is a contextual combat system where the attack the player performs is based on the context of the player's movement. For example if the player is running it will perform a different attack than if the player was standing still. This will allow for multiple attacks to be bound to the same button like left click but the player to be able to accurately perform each one consistently simply by moving in a direction and pressing left click. The player in theory will never have to take their hands off the main movement keys to keep the game flow up and immersed for longer.</p>\n<p><strong>Enemies</strong><br/></p>\n<p>Enemies act as a target for player combat as well as provide some narrative motivation for the player. The primary enemy types will be Goblins, as in the story they have taken over the players village.</p>\n<p><strong>Bosses</strong></p>\n<p>Bosses are put at the end of each level of the game. They act as a chance for the player to use all of their new found weapon abilities ground through the level of a tougher enemy as well as add some tension and build up to the end of the level. There are two different bosses in the game. </p>\n<p><strong>Features</strong></p>\n<p>Features of the game upon release:</p>\n<ul><li>Fully playable story campaign</li><li>Contextual combat system - Unlockable attacks and magic</li><li>2 Bosses</li><li>Wide selection of attack types and abilities</li><li>2 Levels + 1 Tutorial</li><li>PVE combat</li><li>Enemies</li></ul>\n\n\n<p><strong>Credits - Created by Null 404</strong><br/></p>\n<p><strong>Art</strong></p>\n<p><strong>-</strong>Balin Messina</p>\n<p>-Yuetong Ku</p>\n<p>-Zijie Zhou</p>\n<p><strong>Programming</strong></p>\n<p>-Boedi Parker</p>\n<p>-Bryn Griffiths</p>", "metacritic": null, "released": "2020-06-11", "tba": false, "updated": "2020-06-12T04:13:39", "background_image": "https://media.rawg.io/media/screenshots/5b1/5b1134a046fa717810ddf9e4f8aa119f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Null 404"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}