{"id": 453166, "slug": "arcaxer-demo", "name": "Arcaxer Demo", "name_original": "Arcaxer Demo", "description": "<p>Arcaxer is a VR turn based RPG with first person action oriented combat, and a 3rd person god-view overworld for the Oculus Rift and Oculus Quest.</p>\n<p>In the overworld you will explore procedural dungeons to find equips and new abilities for your character. You can also explore the hub world to interact with NPC's and buy new items with the credits that you earn in the dungeon.</p>\n<p>Even though combat is turn based you must dodge enemy attacks with your body, and aim and time your own attacks with gestures. Can you make it to the top of \"The Stack\"?<br/><br/></p>\n<p>If you enjoy the game support the game and get more content before release by donating to our Patreon! <br/></p>\n<p>https://www.patreon.com/Arcaxer<br/></p>\n<p>Player Classes Choose fighter, thief, or mage to drastically change which abilities you learn as you explore the dungeons.</p>\n<p>Fighter: A class with a focus on physical attacks Mage: A class with a focus on Hax, the game's special abilities.<br/>Thief: A class that requires skill and precision to use properly</p>\n<p>Procedural Generated Dungeons The Stack is a huge procedurally generated dungeon filled with random enemies and loot. The dungeon changes as you get higher including more dangerous traps and enemies.</p>\n<p>This is an early demo of a game in development and may have bugs, balance, and performance issues.</p>\n<p>Join the discord to get early builds and more! https://discord.gg/BCqy2m3<br/>Play on Oculus Quest via SideQuest! https://sidequestvr.com/app/549<br/><br/></p>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-06-12T04:08:21", "background_image": "https://media.rawg.io/media/screenshots/28c/28c0d202b27908be6b22dadc842df35f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OverrunGames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}