{"id": 453119, "slug": "pets-on-the-beach-animal-dinghy-surfing", "name": "Pets on the Beach - Animal Dinghy Surfing", "name_original": "Pets on the Beach - Animal Dinghy Surfing", "description": "<p>Ever wanted to play that ice curling game but with pets, in a dinghy, on the sea? No. Oh. Well just imagine...</p>\n<p>It's the final pet dinghy, of the final end, of the Pet Dinghy Surfing championships Final. After a titanic struggle it all comes down to this. You need a single point to win but your opposition is currently leading the end. What do you do? Launch your dinghy at speed towards the target, knocking the rest out of play? Or do you try to glide one around the back that rests straight on the bullseye? </p>\n<p>You suffer a flashback montage before deciding to go delicate. You slowly surf towards the release line, being very gentle with the power and curl. You release the dinghy and your pet surfs gracefully across the sea. The power seems perfect, here comes the curl... but you've not curled it enough, your dinghy glides out of play and you lose. Your team mates look at you in disgust. All you had to do was strike with power, but no, you're cleverer than that and you had to show off. You are a loser and inevitably will appear on sporting failures YouTube montage videos.\r\n</p>\n<p><em>Pets on the Beach - Animal Dinghy Surfing</em> is a one or two player game. Take it in turns to push your pets across the sea, aiming for the target. Closest wins. It's basically curling but on the sea. (It works best as a two-player game right now).</p>\n<p>Created for the<em> I can't draw but want to make a game</em> jam</p>\n<p><strong>Instructions</strong></p>\n<p>Animal Dinghy Surfing is played with your keyboard. To start press and hold down the [R] key to select your angle - this controls the curl. The power bar will start moving up. Release the [R] key when you have the desired power. You will start moving forward in relation to how much power you set. Press the [Up} and [Down] arrow keys to move your pet (You can also do this during the power metre phase). Press [R] again to release. If you don't release before the release line (marked with the red flags) your turn won't count. For a small speed bursts during surfing press [R] (repeatedly). \r\nPress [H] at certain times for help and hold down [T] during play to view the target.</p>\n<p>For a turn to score it must pass the second line (marked by red flags) and stay within the confounds of the play area. Pet's which don't will jump out. Your aim is to get as many of your pets closest to the bullseye (centre) of the target. A point is scored for each pet closest to the bullseye before the other team register.</p>\n<p>Each team has four pets on each end. The team with the most points after five ends wins.</p>\n\n\n<p>Key Presses</p>", "metacritic": null, "released": "2020-06-11", "tba": false, "updated": "2020-06-12T03:59:15", "background_image": "https://media.rawg.io/media/screenshots/5dd/5dd5745973c3ba459fd6c8c0bfa4b3bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["at-ae-oi"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}