{"id": 45317, "slug": "watch-out-2", "name": "Watch Out", "name_original": "Watch Out", "description": "IntroductionWatch out is intended to be an \"I got to kill 5-10 minutes somehow\"-game. It is an arcade racing game where your only objective is to get as high a score as possible on a random generated map. The only thing you have watch out for is, the timer, which increases as you drive along, and also the pedestrians!GameplayThere is no complex mechanics that you need to learn before being able to master the game. The only objective is to get the highest score possible. When playing the game, you will soon see how the car behaves while driving. If you drive too fast during a turn, the car will most likely spin out which could cause you to lose the time left or hit a pedestrian. By playing the game, you might end up being one hell of a drifter but be aware: The day can turn to night which makes visibility worse so be careful. If the car just as much as nicks a pedestrian it is Game over. The time could also simply run out which also makes it game over.Key Bindings<strong>Accelerate:</strong>           W or Arrow Up<br/><strong>Deaccelerate:</strong>        S or Arrow Down<br/><strong>Steering Left:</strong>        A or Arrow Left<br/><strong>Steering Right:</strong>      D or Arrow Right<br/><strong>Handbrake:</strong>           Space<br/><strong>Toggle Headlights:</strong> L<br/><strong>Quick Restart:</strong>       RUpcomingThere will be implemented a leaderboard in a upcoming patch. This will make it possible for you to compare your scores with others! There will also come a multiplayer 1v1 mode.", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-08-28T22:05:22", "background_image": "https://media.rawg.io/media/screenshots/746/746bef122fa7528a37eeedff72e41b45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noctecraft Entertainment"], "genres": ["Racing", "Indie"], "publishers": ["Noctecraft Entertainment"], "esrb_rating": null}