{"id": 453129, "slug": "violet-chill", "name": "violet chill", "name_original": "violet chill", "description": "<p>One of my final projects for university and first time building a game in Unity where we essentially had free reign on whatever we wanted to create.</p>\n<p>Here is the backstory that I wrote in my original design brief:</p>\n<p><em>Set in the near future, society has continued to progress with its use of technology and how it is incorporated in everyday life. Cities are becoming plus and plus populated than ever and living spaces have tightened as a result with people now situated in apartments scattered across the city. It has also become much busier as the density of the population has resulted in a louder, overloaded atmosphere. Therefore,  many citizens have been taking measures in order to ensure that their homes are insulated and sound-proofed from the world outside their windows. </em></p>\n<p><em>The person that is currently staying in this apartment has been affected by her living situation </em><em>and has turned to music to combat the noise as best as possible. Whilst living by herself at the moment, she is  constantly juggling a few jobs in order to pay rent for the place as it is just what she can afford to live in without having to resort to finding an alternative place. Because she is always working, she is rarely at home and so the apartment always appears deserted to passersby. However, she did her very best to set up her home as a space she can come back to and rest after long hours at work.</em></p>\n<p>H O W  T O  P L A Y:<br/></p>\n<p>W A S D to move around<br/>Space to jump<br/>P on keyboard or left click on the radio to pause music<br/>R or right click on the radio to resume music<br/>ESC to pause game &amp; access options and exit</p>\n<p>C R E D I T S:</p>\n<p>audiokinetic code for pause and resume music adapted from<br/>https://www.audiokinetic.com/qa/2448/how-to-pause-all-sound-with-unity-scripts</p>\n<p>First Person Drifter by Ben Esposito<br/>http://www.torahhorse.com/index.php/portfolio/first-person-drifter-for-unity/</p>\n<p>Apartment Building Modular Pack by MRowa<br/>https://sketchfab.com/3d-models/apartment-houses-modular-pack-65c7126c32384ab8a8...</p>\n<p>Urban Night Sky skybox by Kendall Weaver<br/>https://assetstore.unity.com/packages/2d/textures-materials/sky/urban-night-sky-...</p>\n<p>Music Credit: LAKEY INSPIRED<br/>Track Names: \"Blue Boi\", \"Going Up\", \"I Found Me\", \"One My Way\", \"Warm Nights\"<br/>Music By: LAKEY INSPIRED<br/>https://www.chilloutmedia.com/lakey-inspired</p>\n<p>Official SoundCloud  https://soundcloud.com/lakeyinspired<br/>Official YouTube Channel:<br/>https://www.youtube.com/channel/UCOmy8wuTpC95lefU5d1dt2Q</p>\n<p>License for commercial use: Creative Commons Attribution 3.0 Unported \"Share Alike\" (CC BY-SA 3.0) <br/>https://creativecommons.org/licenses/by-sa/3.0/legalcode<br/>Music promoted by: Chill Out Records @ https://goo.gl/fh3rEJ</p>\n<p>www.ChillOutMedia.com / www.LoFi-HipHop.com</p>\n<p>N O T E S:</p>\n<p>Still a work on progress so feel free to point out any bugs or issues you come across.</p>\n<p>At the moment there are only five songs available listen to and they play in a random order every time you open the game. They do not loop continuously nor is there a way to skip through the songs. However, that is something I hope to implement in the future so that you will be able to not only have more song options but it will also display on the UI what is playing currently.</p>", "metacritic": null, "released": "2020-06-11", "tba": false, "updated": "2020-06-12T04:00:54", "background_image": "https://media.rawg.io/media/screenshots/f38/f38f6296b57e2637b34c0045e407e11a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ashtyn B"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}