{"id": 453378, "slug": "rolling-arcade", "name": "Rolling Arcade", "name_original": "Rolling Arcade", "description": "<strong>Rolling Arcade</strong> is a digital reimagining of a classic mechanical arcade game, where your objective is to steer a small metal ball into the correct holes. Turning from analogue to digital, the game keeps all the tension of the original but adds new levels and new game modes.<br/><br/><h3>Score Attack</h3><br/>The ultimate goal of <strong>Rolling Arcade</strong> is to score as many points as you can on each level. The faster you steer the ball to the targets, the bigger the reward will be. Reaching a high enough score will unlock new levels and put you on the online leaderboard.<h3>Three Game Modes</h3><br/>Excitement, fun (and sometimes tears) await you in all three game modes of <strong>Rolling Arcade</strong>:<br/><ul><li>Standard – The original mode of the game. You have three balls to reach the final target on each level. Don’t waste too much time though since you are racing against the clock.<br/></li><li>Endless – Just lay back, you don’t have a timer here. But you only have one ball, so take care of it. How many points can you score this way?<br/></li><li>Two Players – Get a friend of yours into the game in this local multiplayer mode. Compete with each other and see who can score more points!</li></ul><h3>Message from the Developer</h3><br/>Welcome to my third game, I hope you will find enjoyment in <strong>Rolling Arcade</strong>. Since my previous work took almost three years to make, I needed a tiny project to avoid burnout, this is how this game came to life. Please don’t expect some super serious and complicated game this time. <strong>Rolling Arcade</strong> is a small timewaster, which you can play for a few minutes when you don’t know what to play, or you are waiting for a download. Since it is a small game, I tried to price it accordingly, I hope you will find it fair.<br/><br/>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-09-10T20:14:41", "background_image": "https://media.rawg.io/media/screenshots/054/054f48cbd578cabeb6e8054b2088e3b9.jpg", "website": "http://www.onebitstudio.com/rolling-arcade/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["One Bit Studio"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["One Bit Studio"], "esrb_rating": null}