{"id": 45342, "slug": "orwell-ignorance-is-strength", "name": "Orwell: Ignorance is Strength", "name_original": "Orwell: Ignorance is Strength", "description": "<p>Inspired by the rise of fake news, social media echo chambers, and the displacement of truth, Orwell: Ignorance is Strength is the second--darker--season of the award-winning surveillance thriller, Orwell. With the power to both uncover and play with &quot;the truth&quot;, you must decide for yourself how far you will go in the service of your country and whether the truth is sacred or ignorance is strength.</p>\n<p>Inducted into “The Office”--a top-secret department of the government’s Orwell security program--you’ll take on the role of an investigative agent during a time when civil unrest threatens to become a major political crisis between the Nation and neighboring country Parges.</p>\n<p>Reporting directly to Orwell adviser, Ampleford, you‘re tasked with uncovering the truth behind the escalating political tension, and delving deep into the lives of Raban Vhart, editor of The People’s Voice and self-proclaimed guardian of truth, his wife, Karen, and his brother, Illya, to uncover their potential involvement.</p>\n<p>To assist you in your task, you will be given new tools and mechanics that provide opportunities to control and impact the narrative. A new “time of day” system puts you in time-sensitive situations, making who you chose to investigate and when, more important than ever. You can also research more widely and dig deeper into citizen’s lives, gathering additional information to influence the way events are reported and perceived by the public.<br />\nFEATURES:<br />\nInvestigate the agitators - Enter the world of Orwell and join a top-secret department of agents known as “The Office” during a time of civil unrest and political tension. Profile persons of interest by exploring web pages, social media and private communications. Make connections. Find the information you need to know.</p>\n<p>Uncover the truth - Separate the stories from the facts, the propagated myths and fake news from what’s really happening. Identify the hidden agendas of all those involved and expose them.</p>\n<p>Manipulate the information - Use Orwell’s upgraded toolset and the information you have uncovered to create your own version of the truth. Then use that to gain influence and control over the situation.</p>\n<p>End the threat - Expose the truth. Destroy the lives and influence of those who seek to bring harm to the government and diplomatic relations with neighboring countries. Put an end to the civil unrest threatening to destroy the Nation.</p>\n<p>Releasing over three episodes - The game will release on PC, Mac and Linux across three bi-weekly episodes, with episode one available February 22. Be part of the investigation as it unfolds.</p>", "metacritic": 74, "released": "2018-02-21", "tba": false, "updated": "2023-09-26T19:47:59", "background_image": "https://media.rawg.io/media/screenshots/658/658569d224d07f0b12d171542bf2d259.jpg", "website": "http://orwell-ignorance.com", "rating": 3.93, "rating_top": 4, "added_by_status": {"yet": 85, "owned": 908, "beaten": 66, "toplay": 24, "dropped": 15, "playing": 3}, "playtime": 4, "achievements_count": 19, "ratings_count": 75, "suggestions_count": 226, "game_series_count": 1, "reviews_count": 76, "platforms": ["macOS", "PC", "Linux"], "developers": ["Osmotic Studios"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Surprise Attack"], "esrb_rating": null}