{"id": 453504, "slug": "nixelutum", "name": "Nixelutum", "name_original": "Nixelutum", "description": "<p>Controls : </p>\n<p>WASD - Movments, <br/>CapsLock(Toggle) - Board the dragon, <br/>F(Toggle) - Fly mode/Walk mode (Only after boarded the dragon), <br/>Q - Raise dragon, <br/>E - Lower the dragon, <br/>Mouse - Camera movement, <br/>Left click - Fire power, <br/>Right Click - Sword</p>\n<p>Gameplay : </p>\n<p>1. Kill the frost gaints with sword and fire power to get the souls<br/>2. Use fire power to thaw the ice and capture ether hidden inside<br/>3. Go back to the lady with 2 souls and 10 ether to get a wand<br/>4. After capturing 1 wand , go to one of the three temple to get the stone<br/>5. Get three wands and capture all the three stones to release the curse.<br/>6. Climax has a secret related to the theme. Complete the game to know it</p>\n<p>GamePlot: <br/>Centuries ago there were three protectors who had a magical powers.<br/>They were protecting the evil getting into this world with the help of three gems.<br/>But Klesius, the evil trickster witch had captured those gems with the help of energy that she draws from evil dimension <br/>and she cursed the world to suffer with cold and dark forever. We need to capture in those gems back to remove those curse.<br/>After she used the power, each stone had refrained itself covered by ice in the three temples surrounding the area. <br/>To make those stone visible again , we need to provide the combined power of soul and ether.When she used the stone, it has also opened the gate to the dark dimension,<br/>and people started seeing giants and creatures of evil. Kill those creatures , grab those soul and go to her. She will give the wand that will make those stone visible<br/>There are enormous amount of ether that are merged with the stones in the area. But they are covered with ice. You know what to do. What is hidden in snow comes forth in the thaw..!!!<br/>But the real meaning of the theme you will know only at the climax</p>\n\n<p>Pre Jam Content :</p>\n<p>ParagonGideon, Poplar Forest, Scanned 3d people, Materialize, Desert dragon, Infinity blade Icelands, Infinity blade temple, Advanced magic fx12 - All the assets packs are used for static meshes , animations and materials only</p>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-06-12T05:20:46", "background_image": "https://media.rawg.io/media/screenshots/b73/b73f978d3a6dd603b09b1c0b69628bb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["krishchan"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}