{"id": 4535, "slug": "modern-warfare", "name": "Call of Duty 4: Modern Warfare", "name_original": "Call of Duty 4: Modern Warfare", "description": "<p>The fourth installment of a popular series, Call of Duty 4: Modern Warfare is split into two different, gameplay-wise, parts. The single-player campaign invites players to go through the episodic story, where players control six different characters. And even though the stories are taking place in different locations, the events of the campaign are happening simultaneously, creating the sense of urgency and painting a large-scale picture of the events.<br />\nMultiplayer side of things in the Call of Duty series has been more popular among the players. A lot of features, not present in the single-player campaign, will be available to the player, such as a killstreak mechanic, that rewards players for killing multiple enemies without dying. Multiplayer maps consist of team-based and deathmatch based game modes, where players take on the objectives in order to complete the map mission or to obtain the largest amount of kills. Depending on how well the player does, they will be rewarded with experience points, which will allow them to level up and unlock new weapons, abilities, and perks for the playable classes.</p>", "metacritic": 92, "released": "2007-11-05", "tba": false, "updated": "2024-04-18T21:09:41", "background_image": "https://media.rawg.io/media/games/9fb/9fbaea2168caea1f806546dfdaaeb1da.jpg", "website": "https://www.activision.com/games/call-of-duty/call-of-duty-modern-warfare-remastered", "rating": 4.39, "rating_top": 5, "added_by_status": {"yet": 54, "owned": 1446, "beaten": 2373, "toplay": 83, "dropped": 149, "playing": 22}, "playtime": 5, "achievements_count": 0, "ratings_count": 1704, "suggestions_count": 618, "game_series_count": 29, "reviews_count": 1721, "platforms": ["Nintendo DS", "PC", "Xbox One", "macOS", "Wii", "Xbox 360", "PlayStation 3", "PlayStation 4"], "developers": ["Raven Software", "Treyarch", "Infinity Ward", "n-Space"], "genres": ["Action", "Shooter"], "publishers": ["Square Enix", "Activision Blizzard", "Aspyr", "Activison", "Active"], "esrb_rating": "Mature"}