{"id": 453540, "slug": "knockers", "name": "Knockers", "name_original": "Knockers", "description": "<p>Description<br/>The Ice Age has ended but the caveman have kind of got cold feet for the actual ending,A group of caveman fight to keep their iceblock for themselves.The only thing giving  a fighting chance  to each  one of them is their literal cold feet,which are in a block of ice.The Icy feet of the caveman keep them afloat on water,but staying in the water melts the ice and these caveman did not learn to swim.<br/>Keys:<br/>W/A/S/D - Movement<br/>Space -  Charge</p>\n<p>F - Whirlwind<br/>Left Mouse button - Throw Axe<br/>Right mouse button - Throw Spear<br/>GamePlay explanation:<br/>Health:Ice block integrity,if it goes to 0 you sink<br/>Water:If you are on water your Health will decrease(This is the only way you can die)<br/>Knockable: The Knock Multiplier you have on yourself(how much you'll get knocked by an attack,The Multiplier Increases on getting hit. <br/>Throwing Axes is the main attack throw it at players to knock people back<br/>Spears: Secondary Attack is an homing attack<br/>Whirlhwind: Makes the character spins,knocking people away and destroying projectiles<br/>Charge: Pushes a character in a direction,knocking anybody in it's path<br/><br/>Steam Multiplayer:<br/>This Game is a multiplayer Game made to run on steam using the dev testing appid.For you to play this game with people you need to set your download region of steam to be the same as everyone that will be playing.<br/><br/></p>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-06-12T05:29:10", "background_image": "https://media.rawg.io/media/screenshots/0a2/0a22953a6fdfe8422f7a6dec04aae747.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KernalKrumpet"], "genres": ["Action"], "publishers": [], "esrb_rating": null}