{"id": 453500, "slug": "the-lost-chiibi", "name": "The Lost Chiibi", "name_original": "The Lost Chiibi", "description": "<p>***NOTICE***</p>\n<p>It appears there is a game breaking bug in the uploaded version here that kept causing the trigger to the 2nd flame to not to unlock in the packaged version. Unfortunately submissions were locked before I found the fix</p>\n<p>If you'd like to play the fixed version that lets you actually progress through the whole thing : you may download it from my OneDrive here</p>\n<p>https://1drv.ms/u/s!AjgWCay0YYMJjV9SY-tQpnp9naPC?e=0dMvvX</p>\n<p>Sorry for the bad upload  :)<br/></p>\n<p>=========================</p>\n<p>Players take control of Chiibi, a lost Eskimo boy who fell into a cavern while exploring. Chiibi stumbles upon the the Eternal Flames of life, and must use them to find his way out</p>\n<p>Acquire 5 Flames each with a unique ability to help Chiibi escape.</p>\n<p>Orange - Melt various objects</p>\n<p>White - Find Your Path</p>\n<p>Green - Enter the Spirit world and access new sights</p>\n<p>Violet - Heal</p>\n<p>Blue - Reflect damage back to your attack</p>\n\n<p>===============</p>\n<p>Controls : WASD moves</p>\n<p>1 = Orange Flame, 2 = White, 3 = Green, 4 = Purple, 5 = Blue (after acquiring them)</p>\n<p>Left Click (Attack w/ Blue Flame only to reflect fireballs)</p>\n<p>========</p>\n<p>Assets Used:</p>\n<p>Multistory Dungeons by Mana Station from UE4 Marketplace (for walls/pillars/flooring assets)</p>\n<p>Modular Cliffs by CGMontreal (rock wall mesh)</p>\n<p>****KNOWN BUGS****</p>\n<ol><li>Something is up with UMG/Camera transitions - sometimes it won't break from the \"cutscene\". Simply press ESC to enter the Menu, and hit Play again to go back to normal camera</li><li>If you switch between flame types too quickly, sometimes it gets out of sync. Just wait a second, and press a flame type and let the animation play</li><li>Sometimes the boss battle has issues if you're too far away, getting closer seems to fix the hit detection</li><li>Objects don't stop glowing when White Flame is switched off (usually related to point 2)</li><li>Friendly Ghosts show regardless of Green Flame being used or not</li></ol>\n<p>***GAME HAS LITTLE TO NO AUDIO****</p>\n<p>Sound volume was ridiculously inconsistent and loud due to poor attenuation - this was very jarring, so most audio was removed to simply avoid this and not ruin the experience with bleeding ears and pain.</p><p>===== Credits &amp; more Notes from the Author ====</p><p>This was a solo project in which I wanted to push my prototyping skills and see what I was capable on my own. All assets outside of the very lovely Dungeon Assets and rock walls were mine and built from scratch during the 5 days for the Unreal Spring Jam 2020. This is primarily reflected in the characters, enemies, obstacles, and traps.  I used the Dungeon Asset to block out the surrounding area, and had originally planned to replace them but time was better spent polishing the game. </p><p>You'll notice there is a custom Ice Shader that melts its surroundings as you walk around, most things melt but it's more subtle than the obstacles. All animations, level-design, menus, the boss battle, all ice shaders, and enemies were solely created</p><p>Although there are a handful of things that didn't come out quite the way I had imagined it during the initial idea, there are always ideas you need to cut back out on to meet a deadline. Mostly the fact that the audio was so bad I had to rip it out last minute cause it hurt my hears....What can I say, I do all my game making with music on and didn't think about it till it was too late :)</p><p>- Micah A. Parker<br/></p>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-06-12T05:19:53", "background_image": "https://media.rawg.io/media/screenshots/473/473facf2dde28b3864765bd12d0057d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IrishKilter"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}