{"id": 45355, "slug": "witch-thief", "name": "Witch Thief", "name_original": "Witch Thief", "description": "<p>Play as the Witch, dodging and weaving through terrifyingly intricate bullet storms on her journey to steal the Ancient Grimoire.Gameplay:Your goal is to reach the end of each level, blasting through a series<br />\nof smaller stage minions and the much more complex and deadly bosses.<br />\nTo do so you will need to master dodging and weaving through the intricate<br />\nbullet patterns that the enemies fire at you.<br />\nFeatures:Unique Bullet-Hell PerspectiveUnlike other Shmups, Witch Thief gives you control of a full 3D camera. Witness bullet hell from a whole new perspective!<br />\nDodge intricate bullet patternsTerrifyingly intricate storms of bullets will rain down as you journey on your quest. Study, learn and apply your dodging skills to outmaneuver the incoming perils.<br />\nTouching even one bullet will kill you - so beware!<br />\nUnlock a range of quirky playable charactersChoose to play one of many magicians, each clawing for the Ancient Grimoire, determined to let nothing stand in their way. Experience fresh new dialogue, different bosses and unique spells to achieve their goals.<br />\nEach character has unique spells and dialogue, and may encounter different and challenging bosses on their path to the Grimoire.<br />\nComplete the story to unlock new characters!<br />\nMusical tracksA fully original soundtrack, accompanying you on your perilous journey to the Grimoire.<br />\nEach character and stage has a unique theme that captures and plays upon their essence.Battle Relentless BossesYour path is not an easy one. Face insane bosses, wielding great magical power and unleashing torrents of complex bullet patterns. They will stop at nothing to protect the Grimoire.<br />\nUnravel a world of mysteryPiece the stories of every character together to  Uncover what drives the defenders of the Grimoire, and learn the plans of the Last Immortal.Accessibility optionsEveryone should be able to have fun and play games. We’re always striving to help people play and include these features into Witch Thief to help out. If there are any features you’d like to see please shoot us an email and we’ll see what we can do!<br />\nColorblind mode: As well as basic colour filters, we have a robust colour modification system. You can adjust the colours of key game elements to your liking.<br />\nRebindable keys: Nothing is worse than a control scheme that doesn’t work for you! Witch Thief’s controls can be rebound across keyboard, mouse and controller.<br />\nDyslexic font option: We love our stylized fonts, but we want you to know what’s going on. A dyslexic font option is available for all in-game text.<br />\nDifficulty ranges: Not everyone wants the hardest difficulty. Witch Thief ranges from practically no combat “Casual” mode to the extreme “Insanity” mode which increases both bullet counts and speed. Oh you only get one life there too.<br />\nWitch Thief features a wide range of difficulty levels. At one end, Casual offers minimal combat. At the other, Insanity increases the number of enemy bullets and their speed - and if you die, it’s game over!</p>", "metacritic": null, "released": "2017-11-01", "tba": false, "updated": "2019-08-28T22:05:21", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8cbcf73122c3cf1f0c37a22495ef7b8.jpg", "website": "http://WitchThief.Games", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "PC"], "developers": ["Cardboard Keep"], "genres": ["Action", "Indie"], "publishers": ["Cardboard Keep"], "esrb_rating": null}