{"id": 453621, "slug": "flying-leap", "name": "Flying Leap", "name_original": "Flying Leap", "description": "<p>\"At the end of a perilous mountain journey, four strangers approach the Shrine of Secrets.\"</p>\n<p><em>Flying Leap</em> is a local multiplayer game for 2-4 players. Take control of The Geisha, The Sensei, the Widow, or The Ninja, then make a flying leap over the mysterious shrine.</p>\n<p>You earn a star for striking one of your opponents with a hand or a foot. If you earn a star in a round, then you gain points equal to the number of meters you traveled from your starting position. Once any player earns three stars, compare your scores to see who is the winner.</p>\n<p>This game was created as part of Epic Games Jam 2020.</p>\n<p><strong>How to Play</strong></p>\n<p>One way to enjoy the game is to just jump in with some friends and see what happens. However, to master the Way of the Flying Leap, you must first master your controls.</p>\n<p>The left stick controls your left arm, and the right stick controls your right arm. Moving the sticks toward the center moves your arms forward, and moving them backward moves them backward. The position of your arms in the air will slightly tilt you forward or backward.</p>\n<p>The shoulder and trigger buttons control the placement of your left and right feet, respectively. The shoulder button moves your foot forward, and the trigger button moves your foot backward. Hitting any of these buttons will propel you into the air if you are on the ground. Once in the air, the position of your feet has a strong impact on the angle of your body. Balancing your limbs will keep you steady, while using them together can execute risky twists and rolls.</p>\n<p>Remember: You only get points if you actually strike an opponent. Time your jump carefully.</p><p><strong>Also, for the curious...</strong><br/></p><p>I wrote a blog post about the design and development of the game.</p>", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-06-12T05:47:38", "background_image": "https://media.rawg.io/media/screenshots/b08/b08d0c934f06eadef199c8517340455c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["doctor-g"], "genres": ["Action"], "publishers": [], "esrb_rating": null}