{"id": 45374, "slug": "legends-of-iona-rpg", "name": "Legends Of Iona RPG", "name_original": "Legends Of Iona RPG", "description": "This classic dungeon crawler role-playing game is rated general aimed at family gaming or geeks. The gameplay is simple and in order to enjoy this game, you must follow the quests and dialogues with the characters in the game. Contrary to other RPG's this game does not have spells, but rather combinations of weapons with Ionix crystals since the main focus is... The Ionix crystals found on the world of Iona.<br/><br/>So expect a different gameplay from other traditional games. In the world of Iona, the Ionix minerals are the most important thing in this universe and they will help you survive and strive during your adventures. Iona TWOY RPG is a game that integrates some of David Deschenes's ideas particularly with a new optional integrated geek culture E-learning battle system (EBS) to make players smarter! Many who tried this game enjoyed it greatly and now it's your turn. Once you get used to playing the game grows on you and gets better and better! A fun game to relax at home.<br/><br/>Features :<br/><ul><li>5 giant levels filled with dungeons, treasures, monsters and open spaces with a lot of important characters to meet and help through enjoyable quests.<br/></li><li>Story-line, species and characters are well-developed serves as foretold of the upcoming MMO World Of Iona.<br/></li><li>The atmosphere of this game takes the best gameplay seen in RPG's from the '80s and '90s merged with modern game play and wide areas.<br/></li><li>Different gameplay: traditional spells and skills are replaced with combinations of Ionix crystals and special armor and weapons crafting. <br/></li><li>Unlock 3 special attack combo moves.<br/></li><li>Similar to old school RPG's, this game is an average 30+ hours of gameplay. There is no blood/gore in this game.</li><li>New concept: An integrated cultural E-learning battle system (c) (EBS) to improve player's general knowledge!</li></ul>In order to enjoy this game: This game is good, but has a slow  build-up you need to be patient since it is a RPG. You need to play at least through level 3/5 to understand the complete coolness about it. Level five showcase all features and special moves. *We challenge YOU to complete this game*. Remember you will understand the fun about the EBS questions only through playing it yourself. And at all times you can disable the questions or adjust the subjects you prefer. Click on Zaak's brain!", "metacritic": null, "released": "2017-08-22", "tba": false, "updated": "2019-08-28T22:05:20", "background_image": "https://media.rawg.io/media/screenshots/9f7/9f732ef2c12baa0836cf80205402b496.jpg", "website": "http://www.legendsofiona.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 123}, "playtime": 1, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Desgraff"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Studio Desgraff"], "esrb_rating": "Everyone 10+"}