{"id": 45375, "slug": "turret-sector", "name": "Turret Sector", "name_original": "Turret Sector", "description": "Turret Sector is an action packed 3D tower defence game and top down shooter; all set within deep canyons on an alien planet where invading droids are trying to infiltrate and destroy your headquarters. It’s your task to prevent them taking over.Key Features<br/>• 2 modes of gameplay; Campaign Mode for those who want to play though each level in order, and Endless Mode for continuous play on any chosen level.<br/><br/>• 20 unique levels of sci-fi action, with each level consisting of several random waves.<br/><br/>• 35 Interchangeable music tracks.<br/><br/>• 6 Enemy droids types, each having their own unique characteristics.<br/><br/>• 4 Turret types, each designed with different powers and performance to help weaken and destroy energy droids.<br/><br/>• The player has their own unique firepower of rapid ammunition fire and explosive missiles.<br/><br/>• The game auto-saves the player’s score reached within each level as well as in-game statistics and player’s setting options.<br/><br/>• 3 Graphical quality settings, to allow the game to be played on a variety of different computer specifications.<br/><br/>• An in-game guide provides the player with recommendations for playing the game, as well as descriptions for each droid and turret type.Game Modes <br/>The player may choose to play either <strong>Campaign Mode</strong> or <strong>Endless Mode</strong>.<br/> <br/>In <strong>Campaign Mode</strong>, the player plays through each wave and level in sequence. Once the level is completed, the next level is unlocked. Each level gets progressively more difficult, with a higher number of enemy droids emerging, stronger droids and more complicated environments. <br/>When the player has completed a level, the player is able to read their statistics. This includes the number and percentage of enemy droids destroyed. An award of Platinum, Gold, Silver or Bronze is then recorded and awarded to player; depending on the number of enemy droids the player has destroyed.<br/><br/>In <strong>Endless Mode</strong>, the player is able to choose and play any level they wish. <br/>If the player is defeated, or the player exits the level, the player’s score is recorded. Endless Mode records the highest wave reached on any level, and is displayed in Endless Mode’s menu.", "metacritic": null, "released": "2017-08-07", "tba": false, "updated": "2019-08-28T22:05:20", "background_image": "https://media.rawg.io/media/screenshots/ddd/ddd620f9e610e929ba213e3c7771b9a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kittik Game Studio"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Kittik Game Studio"], "esrb_rating": null}