{"id": 453788, "slug": "pollen-doom4e", "name": "Pollen (doom4e)", "name_original": "Pollen (doom4e)", "description": "<p>Team: Achoo<br/>Created by: Milan Petrovski<br/>Submission to 2020 Unreal Spring GameJam<br/><br/>Oh snap, is it spring already?  *intense sniff.<br/>Snow is melting, you need to help Miki clear his garden from flowers and trees that are growing before pollen allergy drains him, JUST DON'T OVERDOSE ON THOSE LORATADINES!!!<br/></p>\n\n<p>CONTROLS:</p>\n<p>WASD - MOVE<br/>Left Click - Hit/Shoot<br/>1 - Select Scythe<br/>2 - Select Axe<br/>3 - Select EXTERMINATOR 3000<br/>4 - Select Pollen Scanner</p>\n\n<p>GAMEPLAY MECHANICS:</p>\n<p>1. Winter/Spring <br/>Areas affected by spring bloom are doing damage to you, so try to avoid them, or clear them before your allergy gets stronger.<br/>!!!Don't forget, flowers are always growing in spring!!!</p>\n<p>2. Weapons<br/> SCTYHE - Use Scythe to cut flowers and grass or do damage to bees<br/> AXE -  Use Axe to cut trees or do damage to bees<br/> EXTERMINATOR 3000 -  Exterminator is your best ally against fighting against bees, and it can help you take on more than 1 at a time.<br/> POLLEN SCANNER - Use your Pollen Scanner If you can't find that sneaky flower or tree. (after selected, you have to click left mouse button for it to show the way)</p>\n<p>3. Loratadine<br/>Best friend in tough times, it can stop nose from running or you from sneezing, but be careful drinking more than one in 7 seconds, weakens the effect of the next and makes you sleepy (trust me i know this from experience). 3 of them at once, and they have no effect on you anymore.</p>\n<p>4. Bees<br/>You are taking their food, so be careful they can swarm you and do significant damage, even if you survive the attack.<br/><br/></p>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2020-06-12T06:39:11", "background_image": "https://media.rawg.io/media/screenshots/45a/45a1464142e3c3031496b7b3ec72e37a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["doom4e"], "genres": [], "publishers": [], "esrb_rating": null}