{"id": 453755, "slug": "chamber-46", "name": "Chamber-46", "name_original": "Chamber-46", "description": "<em><strong>STORY</strong></em>\n<p>Our main character was an ordinary man, that liked to sit in front of the TV and drink some drinks. He didn't have any goals in his live, he was just living in this too boring world. Depressing atmosphere of US in 80s was taking him down. But one day everything changed, for him it was an his typical day. He was sitting in front of the TV when suddenly something felt down on kitchen. He stood up and went to check it but it was just a can that felt down. When he goes back to the TV, he sees the guest. It was a ghost and this is how his adventure started.</p>\r\nBattle system\r\n<p>Fighting the ghosts to survive, you will need to block and counterattack enemy's attempts to attack you. The enemy's attacks is represented as arrows. In the battle main character can't move. We decided that this way, player will concentrate more on fight to achieve victory.</p>\n\n\n<strong><em>SETTING </em></strong>\n<p><strong>E</strong>vents takes place in US of 80s. The city look can be neat from one point of view, but for it's citizen, the city looks like trash that dragging them down. Your adventure begins and ends in this city.<br/></p>\n\n<p>Contact us:</p>\n<p>Twitter: https://twitter.com/pufygames</p>\n<p>Discord: https://discord.gg/A7WkNsj</p>\n<p>Email: indiepufygames@gmail.com</p>\r\nDemo\r\n<p>We provide demo to show you our basic game mechanic and etc... Maybe you will decide your interest in this project after playing it.</p>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2020-06-12T06:31:54", "background_image": "https://media.rawg.io/media/screenshots/70e/70ec38d7d5037f1d22832fe894a0e432.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pufygames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}