{"id": 453840, "slug": "pandemic-phil-james", "name": "Pandemic (Phil James)", "name_original": "Pandemic (Phil James)", "description": "<p>The survivor had been determined to be a class E personnel by the name of “LAKAS”. Lakas, single handedly eliminated 70% of the troops sent to the site and had suspected to have stolen the vaccine.</p>\n\n<strong>Keys</strong><strong>Controls</strong>WASDMovementFInteractXother Controls Info\r\n\n\n<p>CLASSIFIED INFO -  CLASS A+ PERSONNEL ONLY</p>\n<p>SITE 42- ENTRY LOG 26  (  DATE: 2030/5/11 )</p>\n<p>LOCATION: RESEARCH FACILITY SITE 42 - TORONTO, ONTARIO</p>\n<p>Communication attempts to Facility Site 42 have been unsuccessful, the last report was 12 days ago on 2030/4/30. Facility Site 42 is assigned to research and development of a vaccine to the deadly virus and had reported to have been 90% complete eversince the last report. Research from Facility Site 42 has suggested that COVID-19, a SARS like virus, had seemingly evolved into a virus that infects the human body which then kills it after 1 hour of being exposed to it. It is not known how the virus had evolved into the virus it is now but a theory suggests that a third party might have tinkered with the virus and released it. The killed infected human is then revived and turned into a mindless being that is fueled by hunger of human flesh, in other words a “zombie”. The vaccine is yet to have been tested on a live subject, however, when the contents of the vaccine contacts the virus, it is said to have killed 98% of it. Further research is needed to make it so that it kills 100% of the virus and is estimated to be at least 2 days more until completion of the vaccine. Nevertheless, it has been 12 days since the last report which might mean the worst has happened to the site. Plans to send troops to the site were approved and had immediately begun. Troops are to eliminate survivors that are not of class A+. Troops are to also extract the vaccine which might be 100% complete, in any case it is extremely vital of the extraction of the vaccine.</p>\n<p>                                                      -               -                -                -</p>\n<p>SITE 42- ENTRY LOG 27 ( DATE: 2030/5/13 )</p>\n<p>LOCATION: RESEARCH FACILITY SITE 42 - TORONTO, ONTARIO</p>\n<p>Extraction of the vaccine had been unsuccessful and 70% of the troops sent to the site have been marked KIA. Reports from the surviving troops state that the site had been overtaken by the infected humans and that the troops that have been killed were not done so by the infected, but of a survivor. The survivor had been determined to be a class E personnel by the name of “LAKAS”. Lakas, single handedly eliminated 70% of the troops sent to the site and had suspected to have stolen the vaccine. Elimination of Lakas as well as the extraction of the vaccine are to be immediate. Lakas was an ex-military convict who had been guilty to the charges of “murder”, and “possesion of drugs” charges and was sent to Faciility Site 42 as a test subject. Tests on Lakas had been unsuccessful due to his violent nature, attacking any personnel who entered his containment cell. On one occasion, two guards were sent to Lakas containment cell for injection of the virus. One guard came out critically injured and the other was injected by the virus that was meant to be injected into him and was exterminated afterwards. Extermination of Lakas had been denied multiple times on different occasions. It is unknown why the higher ups would not just exterminate Lakas even though he had made a dent on the research by his actions alone. It seems as if the higher ups want him kept alive for one reason or another and it is unknown why. </p>\n<p>Let's do some good! .. Please donate if you can.<br/>All donations go towards helping Cancer patients.</p>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2020-06-12T06:52:27", "background_image": "https://media.rawg.io/media/screenshots/606/6062789152d725821f472ec944586e74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Phil James"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}