{"id": 453996, "slug": "the-wingman", "name": "The Wingman", "name_original": "The Wingman", "description": "<p>'The Wingman' is a 2d game where you got to complete mini games to see how long you can go on for! </p>\n<p>Each mini game has a score attributed to one of three different status bars, keep the score as low as possible!</p>\n\n<p>What features do we have that makes this the best game ever? Easy!</p>\n<ul><li>We got 6 whole mini games of varying play styles! Mario has only one, thus making this 6 times better than Mario. </li><li>A score system that's different from that of WarioWare. WarioWare has you completing minigames for a measly high score. But in The Wingman, you gotta manage your resources! Like a cop in America, you gotta learn that your actions have consequences.</li><li>A variety of colourful characters! (Unless your colourblind) See your character express themselves in a variety of ways</li><li>You can (Š̶̉ͅi̴̺͔̓̑l̴̟͆ȅ̷̤̳n̷̜͍̍c̴̣̯̈ȩ̵̲̚ ̷͉̪̉̿t̴͇͠h̴͇̄e̴̮͠ ̷̨̠͌v̶͓̌o̵̠̤̐̽i̴̝̓ć̷̠̚ḝ̷͈̀s̶̙̀ ) mute the game! Which for a game of this quality shouldn't be a thing, but the developers were fortunate enough to make an extra human sacrifice so that all that damn noise goes away. (Your mileage may vary based on SFX)</li></ul>\n<p>\"Oh hey Mr Developer, where can I contact you to tell you how much this game is amazing and/or stupid?\" Well I'm glad you asked Mr metaphorical, You can follow me on Twitter at http://www.twitter.com/ickleb_arts Kinda whack huh?</p>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2020-06-12T07:29:17", "background_image": "https://media.rawg.io/media/screenshots/6d4/6d4c17801c7e007215deaf3a71b246bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Icklebognok"], "genres": [], "publishers": [], "esrb_rating": null}