{"id": 454027, "slug": "hopbound", "name": "HopBound", "name_original": "HopBound", "description": "HopBound is a story-driven psychological horror game that revolves around the surreal mind of Mayumi, a recluse who must journey through an unsettling retro game to come to terms with the ghosts of her past. Through 16-bit horror platformer stages and endless runner levels with gorgeous pixel art, she discovers that her sanity will be tested by something lurking behind the screen.<br/><br/><br/><br/><strong>NOSTALGIC VISUALS</strong><br/>Most of the game's stunning visuals use a palette of only four colors to evoke the retro charm of 90s handheld games.<br/><br/><strong>SPINE-CHILLING AUDIO</strong><br/>Listen to unique ambient music that provide a sense of dream-like dread as you explore the game's sinister levels.<br/><br/><strong>A STANDALONE CONTINUATION</strong><br/>Taking place two years after the events of DERE EVIL .EXE, HopBound serves as a continuation of that story. However, users do not need to play DERE EVIL .EXE to immerse themselves in HopBound's narrative experience.<br/><br/><strong>HEART-POUNDING MONSTERS</strong><br/>Enemies from previous games are brought back to life and have evolved into new incomprehensible forms.<br/><br/><strong>MEANINGFUL MACHINATIONS</strong><br/>Going against sequel conventions, HopBound doesn't go bigger and badder for the scale of its story. Instead, the game focuses inward, resulting in a haunting yet meaningful tale.<br/><br/><br/><br/>HopBound has NO controller support. Please unplug any controllers before playing this game as it may cause movement issues for the player character.<br/><br/>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2020-09-10T18:06:06", "background_image": "https://media.rawg.io/media/screenshots/302/302530c1afa65043bc76abda03654251.jpg", "website": "https://www.appsirgames.com/p/hopbound.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Darius Immanuel D. Guerrero", "AppSir"], "genres": ["Action", "Adventure", "Simulation", "Indie", "Platformer"], "publishers": ["AppSir"], "esrb_rating": null}