{"id": 45414, "slug": "zombie-commando-3d", "name": "Zombie Commando 3D", "name_original": "Zombie Commando 3D", "description": "\"Zombie Rangers 3D\" is a zombie-based team collaboration stand-alone real-time fighting game. Players need to set up their own heroic team, to the world to complete the task, against zombie invasion and investigate the root causes of the crisis.<br/>\n<br/>\r\nGame features:<br/>\n<br/>\r\n    ◆ rich level of content<br/>\r\n   Continuation of the zombie ranger before the characteristics of the laser, saw wheel, mine, thorns, power grid, more than ten kinds of two-way trap, your players and zombies caused no difference damage, flexible use of traps can make you easily destroy the enemy.<br/>\r\n   4 chapters, 48 ​​large checkpoints, a variety of mission models waiting for you to explore.<br/>\r\n   10 strong BOSS challenge your operating limits.<br/>\r\n   ◆ free battle with the fighting team<br/>\r\n   Melee tanks, remote output, range of damage, deceleration control field, you will have 10 distinctive heroes.<br/>\r\n   Limit operation, flexible control of the five team teams perform their duties.<br/>\r\n   ◆ distinctive skills<br/>\r\n   Electromagnetic bombs, heroic blows, rage fire, burst heavy punch, strong role skills to make you come back to victory.<br/>\r\n   Repulsive, dizziness, deceleration, freezing, range of injuries, triggering weapon skills to play gorgeous damage.<br/>\r\n   ◆ art and music<br/>\r\n   3D screen, massive enemy, straightforward still.<br/>\r\n   Maya relics, Siberia, secret laboratories, western wilderness and other seven large-scale scenes, amazing host-level screen.<br/>\r\n   Shocking the beautiful game music, meticulous sound experience.<br/>\n<br/>\r\n   Thank you for watching our game! Zombie Rangers story is not over, the future we will launch follow-up chapters and new mysterious heroes!", "metacritic": null, "released": "2017-08-27", "tba": false, "updated": "2019-08-28T22:05:19", "background_image": "https://media.rawg.io/media/screenshots/bf3/bf3bf02630b716ca3b5ff911bfdfa25f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YouzuStar"], "genres": ["Adventure"], "publishers": ["Wegame"], "esrb_rating": null}