{"id": 454210, "slug": "they-bleed-pixels-itch", "name": "They Bleed Pixels (itch)", "name_original": "They Bleed Pixels (itch)", "description": "<p>They Bleed Pixels, the cult classic platforming slash-em up is now available on Itch! </p>\n<p>As an anonymous student of the Lafcadio Academy for Troubled Young Ladies, you must battle through your nightmares to defeat a curse that’s slowly transforming your body into a clawed demonic form. </p>\n<p>They Bleed Pixels balances a perfect mix of fast-paced acrobatic platforming and fierce, one-button, slash’em up combat. By suppressing your urge to button mash in favour of focusing on stylish and smart kills, you are rewarded with checkpoints you can choose when to place for safety... or try your luck by holding onto them for extra bonus points.<br/></p>\n<p>Features:</p>\n<ul><li>Hardcore original difficulty, plus an easier novice mode, to match a wider range of skills. </li><li>Striking art style mixes low-fi pixel art with organic ink and paper textures. </li><li>Original electronic soundtrack by DJ Finish Him (aka Shaun Hatton) composed with synthesizers, unconventional instruments and gadgets often not meant for musical use.</li><li>Unlock bonus guest levels + illustrations by comic and game artists from around the world.</li><li>Becoming a monster stabbing master or platforming speedrunner with individual level rankings, leaderboards and 150 skill-based badges. </li><li>Lush gothic-cute motion comics tell the story of a young girl haunted by eldritch nightmares.</li></ul>\n\n<p><em>“Gothic brutality shines brightly throughout this blocky, blood-soaked indie platformer.” - </em><strong>8.2/10</strong> <em>-</em> IGN</p>\n\n<p><strong>More info at:<br/></strong><strong> www.theybleedpixels.com</strong></p>\n\n<p><strong>DRM FREE!</strong></p><p><strong>GAMEPAD HIGHLY RECOMMENDED.</strong></p>\n<p><strong>STEAM ONLY FEATURES:</strong> Online features such as online leaderboards and replay data require the Steam version.</p>\n<p><strong>MAC PLAYERS: </strong>They Bleed Pixels is 64-bit and <strong>will run </strong>on MacOS Catalina.  <em>However it is unsigned and may require you to turn off some security to run!</em></p>\n<p><strong>BUY THE SOUNDTRACK BY DJ FINISH HIM ON BANDCAMP!<br/></strong></p><p><strong>COMING SOON TO NINTENDO SWITCH™</strong></p>", "metacritic": null, "released": "2020-06-08", "tba": false, "updated": "2020-06-12T08:18:02", "background_image": "https://media.rawg.io/media/screenshots/949/949b6f26a1f66f79725973641e92d208.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Spooky Squid Games"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}