{"id": 454323, "slug": "play-the-hand-youre-dealt", "name": "Play the Hand You're Dealt", "name_original": "Play the Hand You're Dealt", "description": "<p>This game was made for the Narrascope 2020 jam.<br/></p>\n<p>It's a simple card game about making life decisions.<br/></p>\n<p><strong>IMPORTANT:</strong> Read these instruction because they do not exist in the game and it will not be obvious how to play.</p>\n<p>You play through a deck of cards representing the people, opportunities, and resources in your life. The game ends when all cards have been played (your life is over).</p>\n<p>The top row represents the hand of four cards that are available for you to play. When there is only one card left in your hand, the game will deal three more to refill it.</p>\n<p>Drag a card to the bottom row to play it: one slot represents yourself, three slots are goals that you are currently working on, and the broken heart represents the disappointment of missed opportunities.</p>\n<p>There are three types of cards. You can right click on cards in the game to get a reminder at the top of the screen.<br/></p>\n<p>-----</p>\n<p><strong>Person</strong> or <strong>Fame</strong> cards are <strong><em>Goals</em></strong>: you can put them in one of your three goal slots or discard them on the broken heart (which increases your stress by the card's value). The value on a Goal card is the number of resources it requires to achieve. Each completed Goal adds one point to the appropriate score (Fame, Friends, or Lovers).</p>\n<p>-----</p>\n<p><strong>Money</strong>, <strong>Free Time</strong>, and <strong>Love</strong> are <strong><em>Resources</em></strong> that you can devote to achieving<br/>your goals or discard on the broken heart (which, again, increases your stress<br/>by the card's value). Love may only be given to People, not used to achieve<br/>Fame, and if you complete a Person with Love, you get a Lover instead of a Friend. Additionally, you can spend Free Time on yourself to lower your stress<br/>or spend Money on yourself to increase your Wealth score.</p>\n<p>-----</p>\n<p>The deck also contains five <strong><em>Ability</em></strong> cards. These have no specified value, so you can discard them for free.</p>\n<ul><li><strong>Focus</strong> on getting the most out of a resource: increases the value of a card in your hand by 5.</li><li> <strong>Channel</strong> your stress into achieving a Goal: decreases the cost of a goal card  by your current stress. Note that it does <em>not</em> decrease your stress.</li><li> <strong>Meditate</strong> lowers your stress by five. Note that, unlike free time cards, it can lower your stress below zero. This is used on yourself.</li><li> <strong>Monetize</strong> \"sells\" a card: instead of getting a goal point, you get Wealth equal to the value of the card.</li><li> <strong>Risk</strong> doubles the value of the next 3 cards dealt from the deck. This could be great if they are all Resources, or disastrous if they are all Goals. This is used on yourself.</li></ul>\n<p>-----</p>\n<p>\n</p>\n<p>Thanks to Josh Grams for testing and writing the instructions. <br/></p>\n<p>In-Game Music:</p>\n\n<p>Breaktime by Kevin MacLeod<br/>Link: https://incompetech.filmmusic.io/song/3457-breaktime<br/>License: http://creativecommons.org/licenses/by/4.0/</p>", "metacritic": null, "released": "2020-06-08", "tba": false, "updated": "2020-06-12T08:40:46", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d9c277973bace619a17b501f21147b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StandOffSoftware"], "genres": [], "publishers": [], "esrb_rating": null}