{"id": 454365, "slug": "hex-stone-magic-card-game", "name": "Hex Stone - Magic Card Game", "name_original": "Hex Stone - Magic Card Game", "description": "<p>Irresistibly captivating card battle game with mind-blowing imagery. The first collectible card game where beautiful girls fight for their Master. Collect and upgrade stunning female cards to defeat all opponents, including villains and other players.<br/><br/>* FALL INTO THE GAMEPLAY: You fall into another dimension, full of curvy women and nasty opponents. it’s easy to get started and learn the game mechanics right away with the built-in tutor.<br/><br/>* GROW YOUR DECK: As you progress in the game, you collect more cards. Attract fantastic girls to your side, seduce them with gifts so they’ll fight more furiously. Create a card strategy and choose the most powerful pack for each card battle to be victorious.<br/><br/>* FIGHT FOR PLEASURE: You’ve never been more eager to fight because you’ll be gratified with more than just HP for your cards, but your fighters will also reveal their treasures to their master.<br/><br/>* PUNISH ENEMIES: You have a great opportunity to overcome your enemies and see them kneeling and serving your kingdom. Like in other top card games, you have your fair share of glory, but HexStone offers unparalleled satisfaction in this department.<br/><br/>* MASTER OF ELEMENTS: Forge your mastery in Fire, Water, and Earth elements, and apply Dark and Light magic. It’s one of those magic card games, where magic is a dealbreaker.</p>", "metacritic": null, "released": "2020-06-08", "tba": false, "updated": "2020-06-12T08:50:07", "background_image": "https://media.rawg.io/media/screenshots/e91/e9191526c5f6215665f835d7cd0628e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Hooligart"], "genres": ["Adventure", "Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}