{"id": 45450, "slug": "comet-crash-2-the-kronkoid-wars", "name": "Comet Crash 2: The Kronkoid Wars", "name_original": "Comet Crash 2: The Kronkoid Wars", "description": "One of the best co-op games around, Comet Crash™ 2 will have you strategizing with friends and family as you play through a challenging campaign of over 50 missions. Then jump into multiplayer battles for absolutely thrilling entertainment.<br/><br/>The most anticipated new feature has finally arrived: online multiplayer. Go online and invite friends to help navigate through the campaign or team up in an online battle. You can even bring more local players online for ‘couch-vs-couch’ gameplay.<br/><br/>More adrenaline? Get competitive and build your rank in online 1V1, 2V2, and Free-For-All battles. As you gain XP for playing online, you will also unlock ship upgrades that may tip the scales in your favor.<br/><br/>Defend your territory with a variety of weapons. Use specialized units to fight off attacks and rush your enemies with massive armies. The limitless variety of strategies will have you coming back to be challenged again and again.<br/><br/>Original music by Bluetech.<br/><br/>PS4™ Pro Enhanced<br/><br/>Remote Play requires PS Vita system and sufficiently robust Wi-Fi connection.<br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>1-4 players<br/>Network Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer<br/>400MB minimum save size<br/>DUALSHOCK®4<br/>Remote Play<br/>Online Play (Optional)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2017-08-08", "tba": false, "updated": "2019-08-02T16:20:43", "background_image": "https://media.rawg.io/media/screenshots/5cc/5cc73ad7c7ee723d50dab0042c7d2362.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Pelfast"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}