{"id": 454548, "slug": "farmer-hero-3d-farming-games", "name": "Farmer Hero 3D: Farming Games", "name_original": "Farmer Hero 3D: Farming Games", "description": "Step into the farm life and manage your very own stress free ranch! Complete orders for eggs, grow natural crops, and sort fruit, all as you harvest your way into becoming the ultimate Cow Master! Earn cash to upgrade your barn, purchase a truck and use tractors to bring home the bacon. This farm’s the limit as you take on various jobs like Pumpkin Seller, Rabbit Trader and even a Horse Scientist.<br/> <br/>Use gems to unlock exotic jobs such as being a world famous tiger tamer. Invest in new orchards, feed animals and raise chickens! Are you ready to become a real Farmer Hero? Put on your boots and get organic! Let’s farm!<br/><br/>- Harvest a wide range of amazing crops, from apples to wheat.<br/>- Complete daily missions for special rewards.<br/>- Unlock super secret farming jobs.<br/>- Exciting mini games with unique challenges.<br/>- Decorate your ranch, upgrade barns, orchards, pig pens and more!<br/><br/><br/>AUTO RENEWABLE SUBSCRIPTION<br/><br/><br/>Subscription options<br/>In our game we have the following subscription options:<br/>- Weekly VIP Membership offers $5.99 weekly subscription after 3-day free trial to unlock VIP features and remove all in-game ads.<br/>- Monthly VIP Membership offers $19.99 montly subscription to unlock VIP features and remove all in-game ads.<br/>- Yearly VIP Membership offers $99.99 yearly subscription to unlock VIP features and remove all in-game ads.<br/>End of trial and subscription renewal:<br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>Payment will be charged to Apple ID Account at the confirmation of purchase.<br/><br/>After the 3-days free trial the subscription automatically renews unless it is cancelled at least 24 hours before the end of the trial period.<br/><br/>Your Apple ID Account will be charged according to your plan for renewal within 24 hours prior to the end of the trial period.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Cancelling trial or subscription:<br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes.<br/><br/>Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed.<br/><br/>The current active subscription period cannot be cancelled. After your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at contact@madboxgames.io<br/>Terms of Use : https://madbox.io/privacy-policy-", "metacritic": null, "released": "2020-05-11", "tba": false, "updated": "2020-06-15T02:10:34", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc1e64209903990b4c0a391d9563d633_SPtxc44.jpg", "website": "https://madbox.io/privacy-policy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Madbox"], "genres": ["Action", "Casual"], "publishers": ["MADBOX"], "esrb_rating": "Teen"}