{"id": 454567, "slug": "chess-clash-of-kings", "name": "Chess - Clash of Kings", "name_original": "Chess - Clash of Kings", "description": "Chess is a smart entertainment, both for children and adults.  It develops logical thinking and intellectual abilities.<br/><br/>*The most important features of our Chess application:*<br/>- The application is free<br/>- It has 10 different levels of difficulty<br/>- Hints are available to show the most advantageous moves<br/>- In the case of a mistake, you can use an undo option<br/>- It has challenges with hundreds of chess puzzles and piles of gold to plunder<br/>- You can choose from a variety of chessboards and pieces themes.<br/><br/>*Mini-game and Chess Puzzles*<br/> When you don't have time or energy for a full game, solve chess puzzles. Move to a distant land, earn gold by training your chess Knight movement and explore further levels with hundreds of puzzles. Underneath each field on the board, there is a chess puzzle that you must solve to move on and collect the gold.<br/> The puzzles are quick tasks of giving your opponent a checkmate, in a limited number of moves.<br/><br/>*10 levels of difficulty*<br/> Are you a chess master or are you just a beginner? Regardless of that, you will find the level suitable for your chess skills. Choose from 10 different difficulty levels, train tactics and win! <br/> The author of the chess engine is a Polish programmer, chess enthusiast and well-known creator of chess programmes, Paweł Kozioł. He ensured that the game is as close as possible to a chess duel between two people. Standard chess engines of the Stockfish type, unlike ours, play aggressively, and the style of the game does not seem human-like. Thanks to these differences, our Chess application gives no less pleasure than standard gameplay with a live opponent.<br/> Our Chess app is also a wonderful way to entertain and educate children who enjoy time developing their intellectual skills and improving their memory.<br/><br/>*Undoing movements*<br/> Have you made a mistake or want to try another tactic? Nothing simpler. Use the Undo button and win!<br/><br/>*Hints*<br/> If you need a hint on how to best make your next move, use the Hint. The screen will highlight the piece and the field it should move to defeat your opponent.<br/> The Hints will help you learn the most successful game strategies, they will be great for beginners as well as for more experienced chess players.<br/><br/>*What are the benefits of playing chess?*<br/>The benefits of the chess game were appreciated by Benjamin Franklin himself. He mentioned prevention, prudence, and foresight as one of them. We now know that the benefits of playing chess are much wider. Especially for children in whom regular playing chess helps to significantly increase the IQ level. <br/>However, not only children benefit from playing chess. This also applies to adults and the elderly. People who play chess know that it requires concentration, logical thinking and helps to exercise their memory. This is why people who regularly play chess are less likely to suffer from neurodegenerative diseases such as Alzheimer's disease and dementia.<br/><br/>*How to make castling and when is it possible?*<br/> It is one of the or unique moves in which the king and the rook of the same colour are involved. Its aim is to protect the king.<br/> Castling consists of moving the king two fields towards the rook, and the rook simultaneously moves over the king to be on the opposite side of the king, on one of the fields passed by the king.<br/>Four conditions must be met to make castling:<br/>1. Neither the king nor the rook has made a move since the beginning of the game.<br/>2. There is no other figure between the rook and the king.<br/>3. The king is not in check.<br/>4. The fields the king passes through are not attacked.", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-06-15T02:16:38", "background_image": "https://media.rawg.io/media/screenshots/694/6942f13979dcddc066da2de5d691b4d2.jpg", "website": "http://www.chessandcheckers.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lukasz Oktaba"], "genres": ["Board Games", "Puzzle"], "publishers": ["Lukasz Oktaba"], "esrb_rating": "Everyone 10+"}