{"id": 454575, "slug": "art-club-challenge", "name": "Art Club Challenge", "name_original": "Art Club Challenge", "description": "Solve challenges by making abstract art while unleashing your creativity. Playing as an art student striving to prove yourself, progress through the game’s narrative as you complete challenges. Push the boundaries of your artistic abilities, while tasked with creating familiar objects utilizing only a small color palate and limited shapes. Share your masterpieces with your friends through the online gallery and explore how others completed the same challenges while creating their own unique and personalized works of art.<br/><br/>Interactive and introspective, enjoy the journey of creating art in an unintimidating and pressure-free atmosphere as you freely explore your inner artist and flex your creative muscles. <br/><br/>Features:<br/>• A story mode with a narrative created to make art feel approachable<br/>• Designed to make art feel whimsical and pressure-free<br/>• Share your art with friends through the online gallery, and social media<br/>• Art style inspired by the famous painter Piet Mondrian’s use of color and lines<br/>• Ambient and dynamic original jazz soundtrack designed to create full artistic immersion<br/>• Free paint mode for artists looking for open expression<br/>• New challenges added regularly<br/>• Featured in the “Smithsonian American Art Museum Arcade” showcase", "metacritic": null, "released": "2018-03-01", "tba": false, "updated": "2020-06-15T02:19:18", "background_image": "https://media.rawg.io/media/screenshots/827/827d0871e834cc41c3c51669123f73ce_3tbWV4U.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Polytundra"], "genres": ["Puzzle"], "publishers": ["Polytundra"], "esrb_rating": "Everyone 10+"}