{"id": 454611, "slug": "the-last-doughnut", "name": "The Last Doughnut", "name_original": "The Last Doughnut", "description": "Submission for MiniJam56\r\nStory\r\n<p>Today is John's birthday, and the office tradition is to bring doughnuts for the partners. For John and his human friends, this will be a day of joy and sugar, but not everyone is equally thrilled.</p>\n<p>You are one of the many doughnuts John brings to the office. Everyone on the box knows the fate that awaits them: <strong>Ascension</strong> and death. Some are happy about it, other resigned to their inevitable demise and some - like you - won't just accept their fate; they will fight and try to change a future set in stone.</p>\n<p>Fight to death with others doughnuts and cover them in sugar and sprinkles so the <strong>Hand</strong> will pick them and not you. It is a matter of survival, of life and death!</p>\r\nControls\r\nWASDMove<br/>JShoot sprinkles<br/>KRoll<br/>SPACEUltimate Attack<br/>\r\nUltimate Attack\r\n<p>When the doughnut is heavily damaged - a diabetic comma may ensue - it can charge its <strong>Ultimate Attack</strong>, a sprinkle canon that makes the doughnut recover some life.</p>\n<p>However, the attack is so costly that doing some athletics such as rolling will cancel it.<br/></p>\r\nScreenshots\r\n<p> <br/></p>\r\nKnown bugs and issues\r\n<ul><li>The game may show a black window if it does not have the focus. To solve this, click on the black window. It should load and show the game correctly.</li></ul>", "metacritic": null, "released": "2020-06-15", "tba": false, "updated": "2020-06-15T02:26:41", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c822b8b0241f7428ed24b2b621653be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Alejandro Royo", "Patricia Lazaro", "RabidTunes"], "genres": ["Action"], "publishers": [], "esrb_rating": null}