{"id": 4546, "slug": "red-dead-redemption-undead-nightmare", "name": "Red Dead Redemption: Undead Nightmare", "name_original": "Red Dead Redemption: Undead Nightmare", "description": "<p>ACROSS THE VAST WESTERN FRONTIER, A PLAGUE IS SPREADING. When former outlaw John Marston wakes up at his farmhouse, he finds a world gone insane: overnight, deranged hordes have overrun the towns and outposts of the American frontier.  In a desperate attempt to save his family, Marston must traverse a world torn apart by chaos and disorder, using every skill he has to survive long enough to find a cure.<br />\nTake on the Dying and Undead West in multiplayer with exciting Co-Op missions and Competitive Modes.  Attack and defend in Stronghold Mode, or take over territory in Land Grab.  Play online as iconic characters from Red Dead Revolver or as the legends from Red Dead Redemption.  School your friends in Poker, Liar&#39;s Dice and Horse Racing and annihilate your enemies with the deadly Tomahawk and Explosive Rifle.   Red Dead Redemption: Undead Nightmare standalone does not require a copy of Red Dead Redemption to play.<br />\nUse of this software subject to license in game manual &amp; online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee, internet connection, and/or online account registration (13+). Special features may not be available to all users and may on 30 days notice be terminated, modified, or offered under different terms.<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br />\nThis videogame is fictional, doesn’t depict any actual event, person, or entity any similarities are coincidental.  We don’t endorse or encourage any conduct depicted.  Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is prohibited.</p>", "metacritic": 87, "released": "2010-11-22", "tba": false, "updated": "2024-04-16T16:21:07", "background_image": "https://media.rawg.io/media/games/632/63248c06f2dbf7362ed7add26603d40f.jpg", "website": "http://www.rockstargames.com/reddeadredemption//dlc/undead", "rating": 4.03, "rating_top": 4, "added_by_status": {"yet": 38, "owned": 43, "beaten": 146, "toplay": 28, "dropped": 33, "playing": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 115, "suggestions_count": 616, "game_series_count": 0, "reviews_count": 116, "platforms": ["Xbox 360", "PlayStation 3"], "developers": ["Rockstar North", "Rockstar Games", "Rockstar San Diego"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["Rockstar Games"], "esrb_rating": "Mature"}