{"id": 454730, "slug": "mini-countries", "name": "Mini Countries", "name_original": "Mini Countries", "description": "Mini Countries is a level-based strategy/puzzle game where a resource transport network must be built for a country. <br/><br/>Each level stands for a country that has different resources and characteristics. An ever increasing number of cities requires skill and good planning to meet the global request of resources for all cities. Upgrade cities and industries to provide better materials to your more demanding inhabitants.<br/><br/><br/><br/><br/><ul><li>Build <strong>trade buildings</strong> to produce resources in your country<br/></li><li>Make sufficient <strong>storage buildings</strong> available<br/></li><li><strong>Transport</strong> resources from storage buildings to demanding cities<br/></li><li><strong>Choose new items each month</strong> to bring your country forward<br/></li><li>Plan your resource production according to different <strong>seasons</strong><br/></li><li>Upgrade resources by constructing <strong>industry buildings</strong><br/></li><li><strong>Import resources</strong> which are not produced in your country<br/></li><li><strong>Export resources</strong> to generate knowledge<br/></li><li>Integrate famous <strong>landmarks</strong> into your country<br/></li><li>Decide on one branch for the development of your cities: <strong>Workers' cities</strong> allow trade and industry buildings to produce resources faster and <strong>science cities</strong> improve the growth rate and thus the generation of further knowledge points</li></ul><br/><br/><br/><br/>As a player, it is your task to deliver resources to demanding cities. Create a transport network by making connections between buildings to make transport possible. As the game progresses, you can upgrade cities and give them a focus. A workers' city has the advantage that connected trade and industry buildings produce resources faster, whereas a science city - as the name may suggest - generates new knowledge.<br/><br/><br/><br/><br/>Not every resource can be produced in every season but cities demand resources continuously. For this reason, it is important to always produce and store enough resources so that every city can be supplied with all the demanding resources at any time.<br/><br/><br/><br/><br/>The first version has the europe campaign with 14 levels and more than 30 resources. New campaigns or expansions will be created regularly and are available for all Mini Countries players.<br/><br/><br/><br/>Mini Countries is inspired by games like Mini Metro and Anno 1800.", "metacritic": null, "released": "2020-06-14", "tba": false, "updated": "2021-02-15T02:41:38", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbeab8ca47f493b0e9ac20649f6b2aff.jpg", "website": "http://www.yheekygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Yheeky Games"], "genres": ["Strategy", "Simulation", "Indie", "Puzzle"], "publishers": ["Yheeky Games"], "esrb_rating": null}