{"id": 45483, "slug": "australian-football-coach", "name": "Australian Football Coach", "name_original": "Australian Football Coach", "description": "Coach your team to the premiership flag! Australian Football Coach is the premier Aussie Rules Football management game, now fully updated for the 2017 season. Take control of a team in one of eight different leagues, create your own footy world with the custom league creator, or even pit the different states against each other in State of Origin mode.<br/><br/>In Australian Football Coach, you put yourself in the coaches' box for an Australian Rules football team.<br/><br/>You're in charge of everything from tactical management on game days, to list management to help you build a team that will win the premiership flag.<br/><br/>With features such as a custom league editor, player editor, in-game team editor, and more, Australian Football Coach contains everything you need to create and run your own footy world.<br/><br/>The game has been continually released and updated from late 2014.<br/><br/><strong>Selected Features</strong><br/>- 8 leagues to coach in, including a national league, six state leagues and one developmental league, each with their own finals structure and percentage rules<br/>- Coach and watch each game or hand the reins over to your assistant coach and simulate everything<br/>- Come up with a tactical plan that will take your team to the flag<br/>- Develop your up and coming players on the training ground, or get them into big matches for faster development<br/>- History tracked for every game. Watch records change and unfold over time<br/>- Trade players and draft picks to build the best possible team<br/>- National and rookie drafts<br/>- Full salary cap rules including free agency and the trading period<br/>- Scouts tell you their estimation of a player's potential, and if he has peaked<br/>- Players can get homesick and demand a move back to their home state<br/>- Perform poorly, get fired, and switch jobs<br/>- 2014, 2015, 2016 and 2017 lists allow you to simulate the past and present<br/>- Custom league editor and player editor allows you to create your own world<br/>- In-game team editor allows you to change team names and colours", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-08-28T22:05:17", "background_image": "https://media.rawg.io/media/screenshots/533/533e96deeaa9e3637234ea7a181face6.jpg", "website": "http://www.australianfootballcoach.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Statto Software"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Statto Software"], "esrb_rating": null}