{"id": 454822, "slug": "malevolent-planet", "name": "Malevolent Planet", "name_original": "Malevolent Planet", "description": "<p><strong>Malevolent Planet</strong> is a text-based game set into a future not too far from our present.  Humanity discovered a planet in another solar system that closely resembles Earth and decided to spend valuable resources on the discovery of the foreign planet, as Earth has gotten more and more polluted and famine has set scientists into a craze for any viable solutions that would save humanity from itself. The protagonist is a graduate of the International Space Academy and, by sheer luck, managed to land a spot on a reconnaissance mission to find out why the other missions failed to send a message back. You and your crew are set on a journey of a lifetime and your dream to explore the space has finally come true.</p>\n\n<p><strong>OS</strong>: Windows, Mac, Linux, Android, iOS</p>\n<p><strong>Version</strong>: v0.0.5</p>\n<p><strong>Developer</strong>: SugarMint - Patreon</p>\n<p><strong>Language</strong>: English</p>\n<p><strong>Genre</strong>: Adventure, Space, Big tits, Character Creation, Corruption, Female Protagonist, rpg, Simulator, Text-based, 2dcg</p>\n<p><strong>Version 0.0.5 - June 14 2020</strong></p>\n<ul><li>The game at this point contains around 30k words.</li><li>The plotline that leads to the Life Simulator system has been finished. I post development updates often on my Patreon about the implementations I have made so far on the next version. </li><li>I do not really have more to write here because it is the first time I release the game on itch.io and it would be difficult to get into everything that has happened since the release.</li></ul>", "metacritic": null, "released": "2020-06-14", "tba": false, "updated": "2020-06-15T03:12:00", "background_image": "https://media.rawg.io/media/screenshots/81e/81e2d5d9f27bd8b85f6a1d61708b1166.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SugarMint"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}