{"id": 454983, "slug": "the-freedmens-republic", "name": "The Freedmen's Republic", "name_original": "The Freedmen's Republic", "description": "<p>Lincoln has lost the election of 1864, and Union forces will soon withdraw from the South.  Millions of freed slaves will be returned to their masters, and the Union will lose control of the Mississippi.  To avoid this, Secretary of War Stanton moves quickly to set up a de facto independent country for freed slaves by moving 170,000 African American troops to Union controlled Louisiana, Mississippi, Arkansas and Tennessee.  You play the Freedmen’s Republic, and you must stop the Confederacy from re-enslaving your citizens.</p>\n<p>This game is set in an alternative history in which General McClellan, a Democrat running on promises to make peace with the South, wins in 1864.  What exactly this would mean remains a mystery today, and it certainly would have been unknown to Lincoln and his administration on November 9th, 1864.  However, the radical republicans could assume that Northern efforts to abolish slavery would end when McClellan took office in four months.  Abolitionists would have four months to figure out how to keep as many freedmen out of the hands of their former owners as possible.    </p>\n<p>Amending the constitution to abolish slavery would now be out of the question.  After the New York draft riots of 1863, resettling escaped slaves in the North would probably also be a political impossibility.  Freedmen would be men without a country, unwelcome in the North and unwilling to return to bondage in the South.\r\n  </p>\n<p>So, why not establish a country for Freedmen in Union occupied Southern Territory?  By November of 1864, the lower Mississippi was completely controlled by the Union.  The Mississippi delta was also home to a large number of freedmen, as the banks of the river produced most of the South’s cotton.  A country with borders stretching 100 miles from either bank of the Mississippi would have a majority African American population, and the Freedmen's Bureau could move the residents of contraband camps to this new country.  This would ensure that freed slaves would dominate the politics of this new nation.   </p>\n<p>Of course, this new Freedmen’s Republic would need to defend itself from a Confederate Army that is no longer occupied by war with the North.  The 170,000 African Americans serving in the Union Army in 1864 would be a good start, and these seasoned troops could quickly move to Mississippi by rail and by sea.  Four months would also be enough time to build trenches and earthworks at key points along the new republic’s long borders.  It is also reasonable to assume that sympathizers in the War Department would quietly move stockpiles of weapons and ammunition to poorly guarded depots along the Mississippi.    </p>\n<p>Could 170,000 well entrenched troops, armed with surplus Union repeating rifles, hold off a confederate force 2x – 3x their size?  Certainly not indefinitely, but the Confederacy would not really be able to field a big army for years either. The Freedmen’s Republic would be sitting on most of the South’s prime cotton land, and freed slaves would also control the South’s primary means of transportation.   The South would probably run out of cash long before it runs out of bodies.\r\n  </p>\n<p>Of course, the Confederacy might not be the Freedmen’s only adversary.  This new country would have no diplomatic recognition, and would effectively be a no-man’s land, ripe for foreign conquest.  Emperor Napoleon III was busy trying to build a French empire in Mexico throughout the US Civil War.  Reclaiming a few scraps of formerly French territory along the coast of Louisiana would be hard for the French Emperor to resist.  The British might also take an interest in the former US territories along the Gulf Coast.    </p>\n<p>The threat from these European powers would be more cultural, economic and political than military.  It is not hard to imagine that white French speaking communities in Southern Louisiana might wish to return to the French Empire, instead of being governed by African Americans.  Freed slaves might prefer membership in a British Empire that has abolished slavery if they could secure a meaningful level of self-government and access to British markets.    This game assumes the leadership of the Freedmen’s Republic is pro-American, and ultimately wishes to enter the Union as a state.  Consequently, becoming a warmer version of Canada is treated as a bad outcome.  However, a Jazzy Manitoba might actually have been the best outcome for freed slaves.   </p>\n<p>    \r\n</p>", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2020-06-15T03:42:03", "background_image": "https://media.rawg.io/media/screenshots/036/036bf37647e0e406d82398decb0534c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["africacrossgames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}