{"id": 455029, "slug": "gravity-run-tomate-salat", "name": "Gravity Run (Tomate Salat)", "name_original": "Gravity Run (Tomate Salat)", "description": "<p>This game is inspired by flappy bird. But you play with gravity which you can toggle with just one click. You can see the direction of the gravity-force by having a look on the right side of the screen. There are two arrows but there can only be one active. This one shows you if your player is either pulled to the bottom or top. </p>\n<p>Another difference is that you can't fly too high or low. In general you won't lost only by touching walls or obstacles. Only if you get pushed out the level by an obstacle you loose. But be aware that you are bouncy! So if you crash with a moving level part in the beginning it won't be a problem. But later in the game you will bounce back and loose. <br/>You also have to be careful with the walls on the bottom and the top. If you hit them too hard you might bounce back into an incoming obstacle. But you also can use that to pick up bullets. </p>\n<p>Yes - I said bullets! By collecting them you can trigger a shot which will remove an obstacle. In order to trigger a shot just keep the \"button\" pressed (at least for 0.2s) and release when you want to fire. The shot will move forward and make the first wall it hits passable. </p>\n<p>So as you can see. It is inspired by flappy bird - but it is not flappy bird. </p>\n<p>I hope you have fun and enjoy the game. <br/></p>\n<p><strong>Controls</strong><br/></p>\n<p>The whole game is playable with <strong>ANY BUTTON</strong>. So it doesn't matter if you play with mouse or keyboard (I haven't tested controllers). </p>\n<p>Why? Well the game is a submission to a game-jam which had this as a goal. I actually also could've make use of mouse-movements, but I wanted to be really limited to one button. </p>\n<p><strong>Credits</strong><br/></p>\n<p>Because I was limited to one button I wasn't able to create a proper main menu. Therefor my usual credits will only go here. As always the game music is from https://tallbeard.itch.io/music-loop-bundle. </p>", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2020-06-15T03:53:24", "background_image": "https://media.rawg.io/media/screenshots/136/1362e90e61e709e00421b71269d90bf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Tomate Salat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}