{"id": 455045, "slug": "followers-league", "name": "Followers League", "name_original": "Followers League", "description": "<p>Reglas en español más abajo.<br/></p>\n<p>Followers League is a game where your decisions to deploy your players on the field makes the difference.<br/></p>\n<p>\n</p>\n<p>Currently not all game rules are implemented and there may be bugs (please report). These are the rules for the moment:</p>\n<ol><li>There are three playing zones: attack, center and defense.</li><li>Players can switch to a contiguous zone once per turn.</li><li>A player can move to another zone as long as he does not have the ball (so need pass it to another player)</li><li>The ball can only be passed to players who have not moved during the turn</li><li>You cannot advance to another zone if there is no player to pass</li></ol>\n<p>There are six possible controls, the arrows indicate where the players will move. Just click on the arrows to deploy your players. The more players you have in the zone where the ball is, the more chances you have of winning the turn.</p>\n<p>To end the turn click the \"Next Turn!\" button or simply right-click with mouse.<br/></p>\n<p>Try to do only three moves per turn.</p>\n<p>This release is intended to start testing how the game behaves. The following functionalities to add are (missed the fast-paced ones so you have full time to think about movement):<br/></p>\n<ol><li>Add game rules:<ol><li>Restriction up to three movements per turn</li><li>Timed shift to increase the pace of play (no activated by you)</li></ol></li><li>In-game help alerts (for example if there is no companion available to switch to)</li><li>Sound of course</li><li>Start menu to select game mode (single player or multiplayer)</li><li>Team Selection</li><li>Multiplayer mode</li><li>Match schedule</li></ol>\n<p>Play now and leave comments to make it as fun as possible.</p>\n\n<p>ESPAÑOL</p>\n<p>Followers League es un juego donde tus decisiones para desplegar a tus jugadores en el campo marca la diferencia.</p>\n<p>Actualmente no están implementadas todas las reglas de juego y puede haber bugs (por favor avisa). Estas son las reglas por el momento:<br/></p>\n<ol><li>Hay tres zonas de juego: ataque, centro y defensa.</li><li>Los jugadores pueden cambiar a una zona contigua una vez por turno.</li><li>Un jugador se puede mover a otra zona siempre que no tenga la pelota (para esto debe pasarla a un compañero)</li><li>Sólo se puede pasar la pelota a jugadores que no se hayan movido en el turno</li><li>No se puede avanzar a otra zona si no hay un jugador al que pasar</li></ol>\n<p>Hay seis controles posibles, las flechas indican hacia dónde se moverán los jugadores. Simplemente haz click en las flechas para desplegar a tus jugadores. Cuantos más jugadores tengas en la zona donde está el balón más posibilidades tienes de ganar el turno.</p>\n<p>Para terminar el turno pincha el botón de \"Next Turn!\" o simplemente haz click con el botón derecho del ratón.</p>\n<p>Intenta hacer sólo tres movimiento por turno</p>\n<p>Este lanzamiento esta pensado para empezar a probar cómo se comporta el juego. Las siguientes funcionalidades para añadir son:</p>\n<ol><li>Añadir reglas de juego:<ol><li>Restricción hasta tres movimientos por turno</li><li>Turno cronometrado para aumentar el ritmo de juego</li></ol></li><li>Alertas de ayuda en el juego (por ejemplo si no hay un compañero disponible al que pasar)</li><li>Sonido por supuesto</li><li>Menú de inicio para seleccionar modo de juego (un jugador o multijugador)</li><li>Selección de equipo</li><li>Modo multijugador</li><li>Calendario de partidos</li></ol>\n<p>Juega ahora y deja comentarios para hacerlo lo más divertido posible.</p>", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2020-06-15T03:57:40", "background_image": "https://media.rawg.io/media/screenshots/ea4/ea47c2879ca2cf0e1ae97282a442cb22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lanyu EStudio"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}