{"id": 455110, "slug": "land-of-the-cat-masters-jam-prototype-ver", "name": "Land of the Cat Masters - Jam Prototype ver.", "name_original": "Land of the Cat Masters - Jam Prototype ver.", "description": "<p>Made for Metroidvania Month 8 Jam, this is the prototype version of Land of the Cat Masters; a prototype which I have high hopes for and some plans to actually finish this time</p>\n<p>Trailer: </p>\n\n<p>An adventurous cat visits the island where feline martial arts masters reside. By defeating the masters one by one, our cat will gain new abilities...</p>\n<p>...or it's supposed to be but in this prototype version, I haven't added any bosses yet due to time constraint and unfortunate amount of university assignments and final projects clashing with the jam schedule :(</p>\n<p>This game is indeed... unfinished. Our cat can't even die yet.<br/></p>\n<p>What I have right here, is a metroidvania game template that can be easily expanded by putting enemies and adding rooms without too much work... the bosses certainly need more coding though... a LOT of coding I suspect; so I don't think this project will be finished any time soon.</p>\n<p>The sound effects are mostly made with labchirp -- the first time I used it after using Bfxr so far. It's certainly way more powerful than what Bfxr can do, but I'm very not used to it yet so I'm sorry if the SFX are unsatisfactory.<br/></p>\n<p>In this prototype version, I have made three musics: one for the title screen, one for the plains area, and one for the abandoned mine area. I am not a composer, so the musics are not the best and took a long time to make; but I think I'm quite satisfied with two out of three of them this time (I will definitely revamp the plains-area music), I hope you do too... (^.^;</p>\n<p>Musics were composed using FL Studio 20 with Touhou instrument plugins.<br/></p>", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2020-06-15T04:10:33", "background_image": "https://media.rawg.io/media/screenshots/34e/34e02158c22703f13b3ffb11482e6852.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Ran d'Reille"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}