{"id": 455192, "slug": "nightwatch-vr", "name": "Nightwatch VR", "name_original": "Nightwatch VR", "description": "<p><strong>Nightwatch</strong> is a relaxed camping game where your sole goal is to keep the fire alive and burning while the others sleep, by feeding it sticks by your camp, or finding them in the woods. Who knows, maybe by searching the woods you might find something else as well!</p>\n<p><strong>Note: </strong>There is a free, flat-screen version of the game, if you'd like to try that before paying for this.<br/></p>\n<p>Made by Neon and Tea for Ludum Dare 46, and later ported into VR. Link to Git. Note that the VR version is in the add-vr branch.</p>\r\nCredits\r\n<p>\r\nDirecting, Art, and Voice Acting/Story - Tea<br/>Programming and Gameplay - Neon\r\n</p>\r\nAnd internet fetched assets\r\n<p>\r\nFootsteps by revolt2563<br/>Campfire, owl, radio fx and bird takeoff sounds by Yle\r\n\r\n</p>\r\nVR Instructions\r\n<p>This version of the game has been designed to be as intuitive as possible, assuming you're familiar with VR in the past. That said, here is a list of the interactions you can do:</p>\n<ul><li>You can grab things with your controller's default grab button. On the Vive controllers, this means the grip and trigger buttons.</li><li>You can teleport with your controller's default teleport button. On the Vive controllers, this means clicking on the touchpad.</li><li>The menu button will open a volume configuration menu.</li>\n<li>You can put things in your backpack by dropping them over your shoulder, except for burning sticks.</li><li>You can set a stick on fire by keeping it over the fire for a second. Good for portable lighting!</li><li>Casettes will play when you pick them up.</li></ul>", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2020-06-15T04:26:12", "background_image": "https://media.rawg.io/media/screenshots/220/220f6b9b05a425fd44f7051d05b10b35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neon Tea"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}