{"id": 455153, "slug": "super-witch-girl", "name": "Super Witch Girl", "name_original": "Super Witch Girl", "description": "<p>Super Witch Girl is a game that has been seven and a half years in the making. Play as a witch who fights the forces of evil with a tennis racket!</p>\n<p>Super Witch Girl has been largely inspired by so many great games, like the isometric games Light Crusader and Land Stalker on the Sega Genesis, and other games like Super Mario World and Super Mario Bros III. This is a game that seeks to rediscover the thrill of discovering new areas to explore by mastering the mechanics of how the world works and paying attention to important details in your surroundings. The best part if it all is that it's such a simple game.  You'll be playing thinking to that this game looks so easy, yet you'll quickly find out it's combat difficult to master!</p>\n<p>You will find yourself fighting a variety of enemies with different attacks that effect how you play. You will quickly discover that positioning and timing of your strikes are super critical for dishing and avoid damage. Brute forcing your way won't work here, timing and positioning is everything!</p>\n<p>The health combo mechanic also adds urgency to the game! The best way to get your health back during battle is to earn big combos without missing, but you will find that most challenging when your enemies bounce all over the arena leading to hectic situations!</p>\n<p>The level design if Super Witch Girl is also superb. You will discover many levels with creative concepts, such as creating a floor of enemies in levels such as \"Pave the Way Forward,\" feeding hungry spirits in the woods in \"Feed Me! I'm Hungy...\" or using your enemies as a battling ram in \"I Made a Breakthrough!\" And how about dodging the many deadly obstacles in \"Death Trap Heaven?\" Maybe you will get lucky and find many of the secret 1up's in the game, which will give you another shot at the level without losing progress? Maybe you'll be lucky enough to get a strawberry to give you the health you need to fight one more battle? Who knows?</p>\n<p>Good luck!</p>", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2020-06-15T04:18:52", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b9e4dc7fcbf1ba7eae0d3184b68d0e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kreastricon"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}