{"id": 455232, "slug": "two-hundred-fifty-six", "name": "two hundred fifty six", "name_original": "two hundred fifty six", "description": "<p>use the arrow keys to play</p>\n<p><em>two hundred fifty six </em>is named for its resolution. In creating this game, I reached out to trans and non binary friends, acquaintances, and strangers asking for selfies they took. Selfies are interesting because they are created and shared only on the terms of whoever took them. Being trans, it sometimes feels like I am at the whims of the public to perceive me. When a stranger looks at me, do they see me as non binary? Or do they see a man, or worse, a straight man? Selfies are a way of curating how you want people to see you. When I asked people for selfies, I don't think anyone took a new selfie. They already had records of when they looked exactly how they wanted to. They wanted to share those moments. <br/></p>\n<p> I edited and compressed the selfies so they fit into the 256 square resolution and only had two colors. In using <em>Bitsy HD</em> to share these portraits, I am doing a number of things. <em>Bitsy</em> is designed for creating low-res worlds, where the player controls a character at 1/16th the resolution of the game. It is designed for exploring worlds and talking to people. By putting these portraits onto a <em>Bitsy</em> (using image to bitsy hd) I am creating little worlds out of the shapes of my friends' faces. These portraits are already abstract, but are abstracted further by the player moving the avatar across them. Quotation marks, exclamation marks, and books float among their hair and below their ears. <br/></p>\n<p>That is another important feature of <em>Bitsy</em>. It allows me to put text in the spaces I've created. I use exclamation marks as a landmark of how I met the person. This points to the web of relationships that seems to form around trans people. I mention Yves in Max's portrait; I allude to Fen and Joyces' relationship; I mention meeting Alex at a tea party that Cam threw. One thing that all of these people share (other than the fact that they are not cis) is me. All of them know me, and many of them know each other. that only makes sense.</p>\n<p>I use quotes to place lines that I got directly from the subject of the portrait. I only started asking quotes later on in the development process, and I didn't want to request quotes from everyone, so there are only a few. This is meant to add more personality to each of the people represented here. Kayl's quote is so different from Joyce's which is so different from Mickey's. I didn't give anyone guidelines for the quotes, so its only natural that i got a range of answers. </p>\n<p>I only have one question mark in the game. The reference is probably lost on a lot of people, so I will describe it. In Cam's room, I drew the five frames of a glider from Conway's Game of Life. It is the a cellular automaton, a mathematical simulation of cells in a grid with a number of discrete states. Cellular automata are important to Cam and me, and they fit nicely into the resolution of <em>Bitsy HD.</em> John Horton Conway recently died of coronavirus. <br/></p>\n<p>The books linearly combine to create a telling of the \"Book of Ruth\". \"Ruth\" is the story of the first person to convert to Judaism. It is one of the few biblical stories named after a woman (the other one is the \"Scroll of Esther\"). \"Ruth\" is a story about friendship between women and a commitment stronger than marriage. This intense sort of friendship feels quite regular in the trans community. We often feel like we are only safe around each other, so trans people tend to quickly form powerful friendships. There is this idea in the queer community of \"found family.\" Ruth and Naomi may be in a legal family together, but a part of that is because Ruth chose to follow Naomi when she went back to Bethlechem. Orpah did not, so even though she is technically Naomi's daughter in law, she is not her family in the same way as Ruth. The rest of the story, including the details about Boaz are quite foreign to a modern audience. It doesn't make sense in 2020 for a feminist icon to be commended for her great achievement of getting married. Still, in pursuing Boaz, Ruth was taking control of her destiny. She needed to marry him and Naomi needed her to marry him for the sake of her family name. Perhaps this marriage is more proof of the devotion that Ruth had to Naomi.</p>\n<p>This is a feminist game. What kinds of choices did all these people make to end up like this? In <em>Living a Feminist Life</em>, Sarah Ahmed describes our lives as members of a crowd all going in the same direction. \"To sustain a direction is to support a direction. The more people travel upon a path, the clearer the path becomes. Note here how collectivity can become a direction: a clearing of the way as the way of many.... When it is harder to proceed, when a path is harder to follow, you might be discouraged; you might try to find an easier route.\" For any trans person, the \"clear paths\" of life are impossible to follow. Being trans isn't a choice, but coming to accept and understand one's transness is a choice.  The understanding that you need to turn around in a crowd of cis people and find an \"easier route\" is difficult to come to. Most of the world doesn't want us to come to these understandings. Along these alternate paths of life we meet friends who support us. Their path isn't always the same as ours, but we can celebrate our differences here.<br/></p>", "metacritic": null, "released": "2020-06-12", "tba": false, "updated": "2020-06-15T04:33:49", "background_image": "https://media.rawg.io/media/screenshots/8bf/8bfdd6f3cc24ca317292dd2b90530116.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["trophyhusban"], "genres": [], "publishers": [], "esrb_rating": null}