{"id": 45529, "slug": "antaria-online", "name": "Antaria Online", "name_original": "Antaria Online", "description": "<strong>Antaria Online</strong> is a Cross-Platform MMORPG being developed with community feedback. After washing up on the shores of an unknown island, players must fight monsters and complete quests to advance. Join the fun as you grow from zero to hero!<br/><br/>Currently the following is available for players:<br/><strong>Adventurer Job</strong> - Everyone starts in this job. More jobs will be added as time goes by. Players will be able to change jobs in cities.<br/><strong>2 PvE Zones</strong> - Monsters, quests, loot, and a hard level cap at level 20. The cap will raise as new zones are released.<br/><strong>1 City</strong> - A hub to access PvE zones and eventually access things such as a bank, a premium shop, a job trainer, and more.<br/><strong>1 Character</strong> - Each Steam account has access to only one character.<br/><br/>Weird things:<br/><strong>No Chat</strong> - Chat will come later and will possibly be only for subscribers. This is 100% done to protect players. We want a system that is as safe as possibly before we release it.<br/><strong>No Username</strong> - Usernames will come later as well. It will be unlocked around level 5ish. This is also not available as we want to make the filtering system better.<br/><strong>No Direct Player Trading</strong> - There will never be direct player trading. There will be an Auction House for selling between players at a later time.<br/><strong>No Grouping</strong> - This will come later with dungeons. Currently there is zero reason to group as all content can be done solo.<br/><br/>* It is highly likely that characters may be reset as some point.", "metacritic": null, "released": null, "tba": false, "updated": "2023-11-01T10:03:03", "background_image": "https://media.rawg.io/media/screenshots/91d/91d4c7127f4e5164923075687dac97c3.jpg", "website": "https://antariaonline.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 50, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 73, "ratings_count": 2, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Antaria"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Antaria"], "esrb_rating": null}