{"id": 45538, "slug": "grow-empires-raise-knights-build-towns-evolve", "name": "Grow Empires: Raise Knights, build Towns & Evolve", "name_original": "Grow Empires: Raise Knights, build Towns & Evolve", "description": "An addictive Puzzle game, where you develop your Civilization starting from Stone Age Village, through Ancient Greeks, Romans, Vikings, High Medieval times, up to Renaissance.<br/><br/>Get through six historical Ages and unlock all Units and Buildings available in the game. Over 90 unique Cards. Level up your castle and troops to expand your kingdom. Harvest goods and collect gold to grow even faster. Great gameplay which brings match games to the next level.<br/><br/><br/>MAIN FEATURES of GROW EMPIRES:<br/><br/>- Fun, simple and addictive gameplay, with a bit of strategic thinking!<br/>Mix of match 3, 2048 and Civilization building games.<br/><br/>- 6 fascinating Ages to explore and lead your people through.<br/> Visit calm Vineyards of Ancient Greece, windy coast of Viking village, colorful Marketplace of Medieval Town and many more.<br/><br/>- 90 Units &amp; Buildings to Unlock.<br/>Discover most reknown and archetypical warriors of all times. Hoplites of Sparta, Vikings, Roman Centurions, Winged Hussars  - we have them all . Admire how your architecture change appearence with each new Era.<br/><br/>- Colorful and cute hand painted graphics. Non-violent, ideal for kids.<br/><br/>- Panoramic City View.<br/>As you gain points your City View will update showing the steps of your progress. Each Age will lead you to another location. Witness houses and farms being built, crops harvested,  military forts changing to lush cities. Shortly before you Era change, your people will raise monumental wonder - a Stonehenge, Roman Colisseum, Norse Drakkar. <br/><br/>- Gather resources.<br/>Starting from level 4 your Tiles will produce goods - two kinds of them - coins and food.  Use them well in the shop to buy what's necessary. Be careful though, prices will increase if you spent resources too much.<br/><br/>- Collect Gems<br/>Gems are other kind of resources, you can pick up randomly on gameboard. Use it for most powerfull abilities. <br/><br/>- Special Abilities.<br/>Shuffle your deck, Undo bad moves, Bomb away unmatching units, finally use powerful Link ability to find ultimate missing piece.    <br/><br/>-  Beat highscore and compete your friends!<br/>Show your strategic Superiority and top the Rankings!", "metacritic": null, "released": "2017-06-21", "tba": false, "updated": "2019-10-22T14:30:46", "background_image": "https://media.rawg.io/media/screenshots/3db/3db0483754e0fd77bbc525a9c1a4384f.jpg", "website": "http://www.growempires.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lukasz Jaskolski"], "genres": ["Strategy", "Puzzle"], "publishers": ["Lukasz Jaskolski"], "esrb_rating": "Everyone 10+"}