{"id": 455346, "slug": "dragon-duel-open-source", "name": "Dragon Duel (Open Source)", "name_original": "Dragon Duel (Open Source)", "description": "<p>Dragon Duel is a passion project, inspired by the good old releases of Atari 2600.<br/></p>\n<p>The gameplay featured is simplistic and reminiscent of the Atari 2600 games and your goal is to destroy the opposing dragon by hitting it 3 times with the arrow!</p>\n<p>This is a 2 player title.</p>\n<p><strong>This software is open source and VB2019 project can be downloaded here along with all of the assets used.</strong></p>\n<p>This project represents something special to me, because its the very first project I went 100% trough with, even though I have coded for many years now.</p>\n\n<p><strong>--Controls--</strong></p>\n<p>WASD - Player 1 movement</p>\n<p>SPACE - Player 1 shoot</p>\n<p>Arrow keys - Player 2 movement</p>\n<p>RETURN - Player 2 shoot</p>\n<p><strong>--Controller Support--</strong></p>\n<p>Dragon Duel features partial USB controller support. Please make sure that the controllers are plugged in before starting the game.</p>\n<p>Consult the user manual for the control schemes.</p>\n<p>You can do that by opening the pdf file provided in the downloaded .rar file or clicking on the HELP button in the main menu, using your IBM compatible mouse.</p>\n<p>To play with your IBM compatible keyboard, simply make sure it is plugged and working before starting the game.</p>\n<p><strong>--Open Source--</strong></p>\n<p>This project uses SDL2 libraries and they are self-contained in the project that can be downloaded here.</p>\n<p><em>You are more than welcome to post feedback on my code, I want to learn, afterall.</em></p>\n<p><strong>====NOTICE====</strong></p>\n<p><strong>Please read the instruction manual before playing - The game needs MSVC++ installed before playing and might not work with all controllers!</strong></p>\n<p><strong>THE MSVC++ INSTALL FILE IS PROVIDED IN THE RAR FILE!</strong></p>\n<p>(VC_redist.86.exe)</p>", "metacritic": null, "released": "2020-06-12", "tba": false, "updated": "2020-06-15T05:01:58", "background_image": "https://media.rawg.io/media/screenshots/372/372c20df70725e40eba03662925bb269.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NDA"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}