{"id": 45535, "slug": "titanfall-assault", "name": "Titanfall: Assault", "name_original": "Titanfall: Assault", "description": "Standby for Titanfall! Experience freedom on the Frontier battlefield in a new mobile RTS that redefines the genre with fast-paced action and intense PvP battles. Get your exclusive Apple Ion Titan today!<br/> <br/>Put your combat skills to the test by unleashing a powerful arsenal of Titans and Pilots, including units from Titanfall 2 plus brand new specialized units only for the mobile game. Deploy Sim Ninja, Boomer, Ion, Scorch and more onto the battlefield to fight for control of the Frontier. Collect and upgrade dozens of cards including tactical Burn Cards, which provide powerful support. <br/><br/>Create or join a Guild to play and strategize with friends, earn Victory caches for your battlefield dominance, and fight across multiple maps that extend the dynamic Titanfall universe. Play on Crash Site, Angel City, Boneyard and more. <br/><br/>Strategize your way to victory over enemy forces in epic PvP battles and compete for glory and rewards on the leaderboards. Assemble and conquer. Unite and destroy. And lead your forces to victory in The Frontier War.<br/> <br/>Features:<br/>• Deploy your Pilots and Titans in fast-paced, fluid battles<br/>• Fight head-to-head in dynamic Real-Time Strategy warfare<br/>• Conquer the enemy with a powerful deck of Pilots, Titans, and Burn Cards<br/>• Deploy your forces on multiple maps that extend the Titanfall universe <br/>• Create or join Guilds to play with friends<br/>• Earn Victory caches for your battlefield dominance<br/><br/>Privacy Policy: https://nexonm.com/mobile-privacy-policy/<br/>Terms of Service: https://nexonm.com/mobile-terms-and-conditions/", "metacritic": 75, "released": "2017-08-10", "tba": false, "updated": "2019-10-22T14:30:46", "background_image": "https://media.rawg.io/media/screenshots/4fa/4fa78510cef5be3b5fb5320f05aac70d.jpg", "website": "http://titanfallassault.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 2, "dropped": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["NEXON M"], "genres": ["Action", "Strategy"], "publishers": ["NEXON M"], "esrb_rating": "Teen"}