{"id": 455497, "slug": "target-practice-ft-carrot-duck", "name": "Target Practice Ft. Carrot Duck", "name_original": "Target Practice Ft. Carrot Duck", "description": "<p>You play as<strong> Carrot Duck</strong> who has a <strong>big blue gun</strong> for some reason, and has to <strong>destroy the targets</strong> while being harass with red bullets that came out of no where! There's a time limit which when reaches to 0 will result the death of Mr. Duck. So destroying the targets gives him more time to live, and as well to get the <strong>highscore</strong>! For whatever reason...</p>\r\nControls\r\nMovement/Aiming<br/>Arrow Keys<br/>ZJumpXShootCBoost (Makes you run faster, but harder to control)<br/>\r\nGame Jam/Other Information\r\n<p>So I made this game for \"I Can't Draw, But I Wanna Make  A Game\" Game Jam! This is my first ever Game Jam I have ever participated, and I was thrilled that I was able to finish this project in time! It was also my first time completing a game within Godot! All of the art, programming, sounds (Using Bfxr), and music within this game was made by me! However, it was really tough for me to handle all of it. Especially since I still have school. Hahaha... Anyway, hope you all enjoy that game I made. Cheerio!</p>\n<p>P.S!<br/>I acknowledge that the \"randomizer\" isn't actually working... And I don't know why. So everytime you play, the targets and the bullets will always be at the same position and timing. It's something I don't know how to fix, but will fix it later on probably next week!<br/></p>", "metacritic": null, "released": "2020-06-12", "tba": false, "updated": "2020-06-15T05:33:17", "background_image": "https://media.rawg.io/media/screenshots/632/632cf68aedfbe895371dabede64ddf9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fish With Headphones"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}