{"id": 455452, "slug": "secret-of-llama", "name": "Secret Of Llama", "name_original": "Secret Of Llama", "description": "<p><strong>This was made for the \"I can't draw but want to make a game (again)\" gamejam.</strong><br/></p>\n<p>It is largely influenced, if not, let be for the existence of llamas, carbon copied, manually redrawn version of Square's Secret Of Mana for the SNES from 1993.<br/></p>\n<p>Me and my friend have close to no artistical experience, so we still tried hard and used this as a learning project. We put to use what we, as \"programmer artists\" were already good at - copy&amp;pasting alongside of posting top quality cringe.<br/></p>\n<p><strong>CONTROLS</strong><br/></p>\n<p>If you've ever played Secret of Mana, you should know how this game works.</p>\n<p>WASD to move</p>\n<p>left mouse to attack (once you got your weapon) and talk</p>\n<p> right mouse button to sprint <br/></p>\n<p>(sprint mechanics are based on Secret of Evermore rather than the aforementioned. It should also work with controller. )<br/></p>\n\n\n\n\n\n\n<p><strong>KNOWN ISSUES</strong></p>\n<p><strong>If you die in the first level</strong>, you can't pick up your weapon again to progress through the bushes. Simply <strong>press tab</strong>, it remembers your \"inventory\".</p>\n<p>Upon respawn after death, the HP on your HUD doesn't update, so it stays at 0. No worries, it will reset to what your actual HP is after you took some damage or leveled up.<br/></p>\n<p>Having trouble with the boss enemy? Try luring it towards the center of the map before engaging, the bad visibility combined with little sand castles and litter on the floor makes it hard to dodge where he spawns.<br/></p>", "metacritic": null, "released": "2020-06-12", "tba": false, "updated": "2020-06-15T05:24:01", "background_image": "https://media.rawg.io/media/screenshots/f6e/f6e7bd018469a5756982272ce18d3e62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JayTea_O_o"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}