{"id": 45549, "slug": "ophidian", "name": "Ophidian", "name_original": "Ophidian", "description": "<strong>Ophidian</strong> is an arcade puzzle game inspired by a great classic.  In Ophidian, players navigate the play area to consume food blocks, while avoiding any obstacles set in the way.  Ophidian features two game modes for players to enjoy, Play mode and Challenge mode.<br/><br/>Play mode allows player to enjoy the classic style of the original game with new features added in.  Eat as much food as you can in order to achieve the highest score.  Watch out though, as you eat food, the Ophidian grows, creating a natural obstacle with its body. Play alone to go for a new high score, or play with friends, up to four players total, in local multiplayer. <br/><br/>Challenge mode features 100 puzzles designed for players to navigate the ophidian through in order to consume all of the food in each level.  Puzzles include various specials blocks to interact with including wall blocks, portal blocks, bounce blocks, bomb blocks, and more.  Complete each challenge, or replay them to go for a faster record time.  <br/><br/><strong>Features</strong><br/><ul><li> Classic mode with up to four players locally.<br/></li><li> Multiple play area sizes.<br/></li><li> Multiple speeds for greater challenge.<br/></li><li> New special blocks to interact.<br/></li><li> 100 challenge levels designed to test players skill.<br/></li><li> Full controller support.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:15", "background_image": "https://media.rawg.io/media/screenshots/03d/03dbb62b28ea159d43a4953ec430df35.jpg", "website": "http://www.manbeardgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ManBeardGames"], "genres": ["Casual", "Indie"], "publishers": ["ManBeardGames"], "esrb_rating": null}