{"id": 45544, "slug": "marty-thinks-4th-dimensionally", "name": "Marty Thinks 4th Dimensionally", "name_original": "Marty Thinks 4th Dimensionally", "description": "Marty Thinks 4D is an isometric 3D puzzle platformer where you play as a small robot on a journey to find his creator. With the aid of time travel, MRT-I (pronounced “Marty”) is able to step through time and work together with past versions of himself to overcome any challenge. In the game, you are presented with challenges that require multiple people working together to succeed. Time travel will allow you to work with up to 5 of your past selves to overcome these challenges that a single player could never overcome alone. In this way, puzzles will be set up so you must play out partial solutions to a puzzle, then go back in time and play out remaining parts to unlock the solution. <br/><br/><br/><br/>Mart Thinks 4D focuses on small puzzle areas similar to what you may find in games such as Swapper or Talos Principal. Only the stages will be seen from an isometric top down angle. In each stage you will be challenged to work your way to the exit with increasingly complex stages where multiple MRT-I's must coordinate their efforts and overcome challenges such as defeating enemies, platforming, and activating objects. In the game you will be using a variety of special abilities, each with unique purposes.<br/><br/><br/><br/>The game will take place over 5 chapters starting with MRT-I awakening inside his factory. His creator (Dr. Mobious) has long since passed, and MRT-I has been trapped in an isolated existence, continually performing final commands of his late master. MRT-I determines that without his creator, his life lacks true purpose. So he sets off on an adventure to rebuild his creator and discover where he fits in the wide universe. In the story MRT-I learns about the human condition and the true fate of Dr. Mobius. <br/><br/>The game was created almost exclusively by a single developer (me). Besides some minor assistance here and there, I created everything in the game. This is also the first game I have ever created. Sort of a labor of love. As such please recognize it may lack some of the polish larger teams can produce.<br/><br/>*This game has controller support once the game is started but requires some mouse interface in the launcher menu.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:15", "background_image": "https://media.rawg.io/media/screenshots/301/301f7be20c701ace55086d8be8a40228.jpg", "website": "http://www.kittysoftstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Jonathan Stoffer"], "genres": ["Indie"], "publishers": ["KittySoft Studios"], "esrb_rating": null}