{"id": 455580, "slug": "anno-mutationem", "name": "Anno: Mutationem", "name_original": "Anno: Mutationem", "description": "Welcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements you become Ann: a highly-skilled combat-trained lone wolf on a personal mission in the giant Metropolis, full of sinister mega-corporations, mysterious fringe groups and creatures more bizarre than words can express.<br />\nExplore and discoverThis is a world full of surprises waiting for you to find out! While going thru the main story you can chat with a Cyborg corgi, take on a part-time bartender job, hunt down vicious criminals reveal the true face of a trending V-streamer! By exploring diverse locations such as neon Noctis Town, an off-shore cargo ship and huge underground structures, players are free to go as they please and act as they want.<br />\nShowing new perspectiveUnique 2D-to-3D gameplay, seamless switching between 2D Action n&#39; Platforming and 3D Exploration to interact with the world and its inhabitants. Let&#39;s dive into pixel gaming from another perspective!<br />\nAnn kicks AssAnn will slash, shoot, combo, grenade-throw &amp; ground-pound her way through hordes of enemies and huge bosses. From great swords to double blades, from pistols to rocket launchers and uppercuts, time to become the one-girl army you always knew you had in you.<br />\nTry to finish the jigsawA grand story, befitting a rich and dark cyberpunk décor, featuring our main hero Ann Flores and her trusty hyper hacker side-kick Ayane on a personal mission to find out where her missing brother has gone to. Little do the two know just what they will unravel…<br />\nPlease arm yourself to teethCollect, buy or craft items &amp; upgrade Ann&#39;s stats, skills and gear. Use chips to modify any kind of weapon you find. Equip Ann and make her combat-ready for all enemies (both humanoid and not…) that are about to head her way.</p>", "metacritic": 73, "released": "2022-03-16", "tba": false, "updated": "2023-12-06T17:07:18", "background_image": "https://media.rawg.io/media/games/b1d/b1d0b2d6b4cbc94d8c2066353367d13e.jpg", "website": "http://anno-m.com", "rating": 3.6, "rating_top": 4, "added_by_status": {"yet": 46, "owned": 173, "beaten": 24, "toplay": 83, "dropped": 17, "playing": 12}, "playtime": 3, "achievements_count": 22, "ratings_count": 33, "suggestions_count": 470, "game_series_count": 0, "reviews_count": 35, "platforms": ["PlayStation 5", "PC", "PlayStation 4"], "developers": ["Thinking Stars", "Thinkingstars"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Lightning Games"], "esrb_rating": null}