{"id": 455646, "slug": "strong-granny-win-robux-for-roblox-platform", "name": "Strong Granny - Win Robux for Roblox platform", "name_original": "Strong Granny - Win Robux for Roblox platform", "description": "Reach 10 level and Win Robux for Roblox platform<br/>Introducing the Strongest Granny in the world! She easily defeats everyone in the power competitions! Atlas Stones? Sled Drag? Truck Pull? Nothing is impossible for her. <br/><br/>Crazy grandma has lazy grandpa and pet cats. They don’t help the old sick woman, but also push her, sitting on pulling objects. Oh that makes gran angry… It seems like an endless torment.<br/>Now gran is barely crawling, but soon she will save up money to speed up the walker and run or even fly!<br/>Her records do not go unnoticed — the gran attracted a huge crowd of fans willing to throw money.<br/>Watch the crazy granny pulling heavy stuff, there are some strange ones. Save gran from too crazy items. And have fun! <br/><br/>World’s Strongest Granny is a crazy running (crawling) and pulling game with amazing fun 3d graphics and animations.<br/><br/>How to play:<br/>⚡️Tap on grannie to speed her up;<br/>🤑Grow the crowd of fans to earn more coins;<br/>👵🏼Power Granny Up — collect fan's coin to upgrade her walker;<br/>🔺Level up to get more money!<br/>🗿Spend coins to change weights — enjoy its variety!<br/><br/>And if you have opened all the items — write in the review what other loads you would like to see in the game!<br/><br/>World’s Strongest Granny will be the best crazy game! If you are fond of idle fun 3d games then you will love this cool FREE clicker!", "metacritic": null, "released": null, "tba": false, "updated": "2020-06-19T02:34:55", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3dc88323f117e819aaca67676f2b7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["THFN Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Teen"}