{"id": 455626, "slug": "chaotic-three-kingdoms", "name": "Chaotic Three Kingdoms", "name_original": "Chaotic Three Kingdoms", "description": "The best collectible type Three Kingdoms RPG! It’s Chaotic Three Kingdoms!<br/><br/>Welcome to a new era of legendary conquest! Pocket Three Kingdoms!<br/>Unite Three kingdoms under your rule, forge the next great dynasty<br/><br/><br/>◈ Game Features ◈<br/><br/>▶ Recruit and train heroes of Three Kingdoms!<br/>Command 100+ fascinating Queen, heroes and make them the most feared ones in ancient China!<br/>Enjoy various contents, such as weapon upgrade, skill enhancement, troops development, inheritance, formation, and item refinement!<br/><br/>▶ Join the massive battle between nations!<br/>The Three Kings of Chaos at Wei, Shu, Wu! Join the huge battle that you’ve never seen before!<br/>Use various strategies to Conquest castles and defend, completing nation quests!<br/><br/>▶ There are tons of contents you can play with!<br/>Summon all kinds of bosses and cooperate with others to defeat it in Mystical Land!<br/>Defeat various bosses with your ally heroes in Boss Raid!<br/>Do not let anyone break through your castle in Castle Defense!<br/>How much exactly is your power? Find it out in Training!<br/>There are plenty more to enjoy!<br/><br/>▶ Defend or conquest in County and Castle content!<br/>Upgrade your defense facility and set heroes for defense to protect your castle!<br/>Upgrade as much buildings as you can and collect lumber and gold coins!<br/>Capture vacant mines or pillage enemy mines if you need more resources!<br/><br/>▣ Customer Center<br/>care@dreamplaygames.co.kr", "metacritic": null, "released": "2019-12-18", "tba": false, "updated": "2020-06-19T02:26:23", "background_image": "https://media.rawg.io/media/screenshots/96e/96ec7382afcea3df190acaf2d7eed6cf.jpg", "website": "http://www.dreamplaygames.co.kr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dreamplay Games"], "genres": ["RPG", "Strategy"], "publishers": ["Dreamplaygames"], "esrb_rating": "Teen"}