{"id": 455623, "slug": "nonstop-game-cyber-raid", "name": "Nonstop Game: Cyber Raid", "name_original": "Nonstop Game: Cyber Raid", "description": "Combined with innovative idle gameplay, this is a 3D world that will give you a totally new experience!<br/><br/>In this new world, only the truly strong can survive.<br/><br/>Five major dominate races: Mech, Bio, Gene, Alien, Mystic!<br/><br/>Barbarism collides with order, magic and technology blend, and a new order is formed!<br/><br/>What’s UNIQUE:<br/>- Casual Idle Gameplay -<br/>Automatically gather all manner of resources offline. Your job is to allocate your resources effectively!<br/>Set formations now! Zero-tap automatic battles will keep your hands free!<br/><br/>- Open Team Training - <br/>5 major races, more than 150 heroes that restrain one another, hundreds of unique skills, hundreds of rare pieces of equipment in different states!<br/>Cultivate, synthesize, recycle, and get the heroes and equipment you want most in a variety of ways!<br/>If you’re talented and knowledgeable, you'll be paired with a lineup that works best with you!<br/><br/>- Compete With Players From All Around The Globe -<br/>Join a guild, challenge for guild bosses, fight in a guild war, make friends from all over, and fight side by side!<br/>Lead your strongest team into the arena, challenge and defend the opponents to keep your rank, compete with players globally!<br/><br/>- Rich Game Content -<br/>Idle battling, PVP arena, mysterious cavern, trial array, and skyscraper!<br/>Rich game content, you won't be able to put it down!<br/><br/>- Unimaginable Novelty Experience -<br/>Explore forests, cities, outer space, underground factories, alien bases...<br/>Traverse a variety of maps, defeating monsters along the way, challenging powerful enemies, and getting all kinds of gear and treasures!<br/><br/>Website: http://www.7piratesgames.com<br/>Facebook Fan Page: https://www.facebook.com/nonstopgamemobile/<br/>Customer Service: https://sevenpiratesgames.helpshift.com/a/nonstop-game/<br/><br/>Privacy Policy: http://www.7piratesgames.com/PrivacyPolicy.html<br/>Terms of Service: http://www.7piratesgames.com/ToS.html", "metacritic": null, "released": "2020-06-07", "tba": false, "updated": "2020-06-19T02:25:19", "background_image": "https://media.rawg.io/media/screenshots/35f/35f68e11adee4d7891caa5bd88d76bca_1vABU82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Kraken"], "genres": ["RPG", "Strategy"], "publishers": ["Big Kraken"], "esrb_rating": "Everyone 10+"}