{"id": 455635, "slug": "counter-terrorist-shooting", "name": "Counter Terrorist Shooting", "name_original": "Counter Terrorist Shooting", "description": "Under the threat of global terrorism, we need a group of brave soldiers to enter the battlefield against terrorists! Download the best FPS counter and strike shooting game for FREE! Join our special force squad to strike global terrorism and save the people who are suffering! <br/><br/>If you want to experience the most exciting mobile FPS game, don’t miss Counter Strike Battle! Classical battle maps, dozens different types of guns, they are all included in Counter Strike Battle! Prefer fighting terrorists closer? Pick shotgun! Prefer shoot them from long range? Pick Sniper! No matter what strategy you prepared, the only goal is to clear the battlefield, but beware of your hitpoint, you are not made of steel!<br/><br/>In Counter Strike Battle, you are the only one who can resolve international conflicts and terrorism. Enter the heart of terrorists’ den, AIM and SHOOT, but despicable terrorists hiding under the dark shadow, and shoot you back from corners. Counter Strike Battle will test your reaction speed and aim accuracy, you need to shoot terrorists down in second, otherwise, the one who is killed will be you!<br/>Don’t worry about if you are not good at FPS game, you can play Counter Strike Battle with a single hand! Vertical game screen design, the only thing you need to do is shooting! Aim the terrorists and pull the trigger, shot them down until the last one!<br/><br/>Features:<br/><br/>-Only need a minute to become the expert of shooting, just one-handed operation.<br/>-Excellent visual and sound effects of shooting game, experience the real battlefield.<br/>-Multiple classical maps, don’t forget to remember terrains and the layout of buildings.<br/>-There are 30 types of weapons pistols, rifles, shotguns and snipers.<br/>-Collect your weapons and upgrade them to be stronger.<br/>-Improve your skills and equipment to increase your combat effectiveness.<br/>-Support offline, you can play Counter Strike Battle without internet<br/><br/>As part of our special force squad, the mission can only be completed by you! To give peace back to the world, you need to become a soldier with extraordinary courage and unmovable determination! There is always hope once the evil destroyed!", "metacritic": null, "released": "2019-10-15", "tba": false, "updated": "2020-06-19T02:30:14", "background_image": "https://media.rawg.io/media/screenshots/ad7/ad7cab8774475593b59d33a89a0c3b89_HgTdriY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PANGU GAME GLOBAL"], "genres": ["Action", "Adventure"], "publishers": ["PANGU GAME GLOBAL"], "esrb_rating": "Teen"}