{"id": 455619, "slug": "ultimate-golf-2", "name": "Ultimate Golf!", "name_original": "Ultimate Golf!", "description": "Tee-off in this fantastic free golf game for real courses, real-time multiplayer duels, tournaments and our unique Golf Royale mode! <br/><br/>In Ultimate Golf! it's a race to the pin: no waiting for the opponent to take their shot.<br/><br/>Like a true pro golfer, perfect your swing, to drive, chip and putt from an endless variety of lies on the fairway and greens. Avoid the rough and bunkers in this amazing, realistic, 3D golf simulation.<br/><br/>Clash with golfers from around the world or challenge your friends, family and Facebook buddies.<br/><br/>Win golf bags from your challenges and unlock a huge range of clubs and balls to improve your game.<br/><br/>Featuring real golf courses from Wolf Creek Golf Club, Temple Terrace Golf &amp; Country Club, Fairmont Banff Springs and Harbour Town Golf Links for a world golf tour in stunning 3D.<br/><br/>Play either head-to-head or join international championships like The Spirit to beat your Golf rivals.<br/><br/>Play every day to move up the timed leaderboards and rank up from Amateur to the Pro Leagues. Rack-up trophies to unlock the highest tours and maximise your winnings.<br/><br/>Your golf bag is full of all the tools you'll need to dominate the fairways and greens — driver, wood, long iron, short iron, wedge, rough iron, sand wedge and putter. Make sure to upgrade your clubs and play with the best ball like a real golf master.<br/><br/>Key features:<br/><br/>*  Real-time, synchronous play <br/>* Unique Golf Royale mode — race to the pin vs up to 20 players<br/>* Professional golf equipment — kit yourself out like a Golf king<br/>* Real Golf courses from Wolf Creek Golf Club, Temple Terrace Golf &amp; Country Club, Fairmont Banff Springs Golf Course and Harbour Town Golf Links<br/>* Console-level, stunning 3D graphics<br/>* Realistic physics for a perfect Golf simulation<br/><br/>A network connection is required to play this game <br/>Like Ultimate Golf! on Facebook for news and updates!<br/>https://www.facebook.com/ultimategolfgame<br/><br/>Terms: https://www.miniclip.com/terms<br/>Privacy: https://www.miniclip.com/privacy<br/><br/>------------------------------------", "metacritic": null, "released": "2020-06-12", "tba": false, "updated": "2020-06-26T02:41:13", "background_image": "https://media.rawg.io/media/screenshots/c78/c788d0bf61650ae8e99191a6d6d169b0.jpg", "website": "https://www.miniclip.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Miniclip.com"], "genres": ["Simulation", "Sports"], "publishers": ["Miniclip"], "esrb_rating": null}