{"id": 455754, "slug": "sacrifices-must-be-made-blackmadgames", "name": "Sacrifices must be made (blackmadgames)", "name_original": "Sacrifices must be made (blackmadgames)", "description": "<p><em>Sacrifices must be made</em> is a short top-down shooter made in Godot, in the context of a self-imposed 48 hour game-jam.</p>\n<p>As psychopomp, your goal is to bring the souls you carry around you through Purgatory, and to eternal rest. However, the demons haunting the place will not let you get there so easily!</p>\n<ul><li>You start the game with 10 souls, and must reach the exit of the dungeon with as many souls as possible.</li><li>Each hit you take will make you lose one health point (skull icon)</li><li>If you reach 0 health point, you lose the game, and the souls are damned forever.</li><li>The more souls you carry, the slower you move.</li><li>Move with the Z, Q, S, D keys, and rotate the character with the mouse.</li><li>Left-click to shoot at demons. Careful! You have limited ammo (fireball icon)!</li><li>Press left-shift to \"look ahead\"</li><li>You can activate a temporary shield that makes you invincible. However, this will consume one of the souls.</li><li>You will find shops inside the dungeon, where you can buy ammo and health points. Each costs one soul.</li><li>Simply stand in front of the item on the counter and press F.</li></ul>\n<p>When you die, or reach the exit of the dungeon, you will get a quick description of the lives and dreams of the souls you have left behind.</p>\n<p>Will you be able to save them all?<br/></p>", "metacritic": null, "released": "2020-06-18", "tba": false, "updated": "2020-06-19T03:03:21", "background_image": "https://media.rawg.io/media/screenshots/03c/03c640542381c2abaa73610f87c42cc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["blackmadgames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}