{"id": 455714, "slug": "crystal-fellas", "name": "Crystal Fellas", "name_original": "Crystal Fellas", "description": "<p><strong>Crystal Fellas </strong>is an online multiplayer platformer that requires two players to use their unique character abilities in order to help each other progress through a series of obstacles.</p>\n<p> The hosting player will play as the blue crystal fella, whose ability is to turn himself into a floating platform that can be used to traverse large gaps or jump higher.  His powerful crystal barrier can also block projectiles when required.</p>\n<p>The joining player will play as the red crystal fella, who can throw a boomerang to interact with objects in the environment. Additionally, the blue player can ride on the boomerang in order to traverse gaps that he could not jump over otherwise.</p>\n<p> The game is based around themes taken from Jillian Banfield’s Wikipedia page, with an emphasis on organism interdependence and crystal growth. </p>\n<p>Connecting:</p>\n<p>It wasn’t viable for us to host servers for the game, so in order to connect you’ll need to use a virtual local network such as Hamachi. We recommend Radmin VPN as it does not require an account to use. https://www.radmin-vpn.com/</p>\n<p>The joining player will need to paste the IP of the host into the box present after clicking “Join” in the main menu. </p>\n<p>Controls: </p>\n<p>A and D to move left/right</p>\n<p>Space to jump.</p>\n<p>C (blue character) - Use Ability</p>\n<p>X (red character) - Use Ability</p>\n<p>Things to consider while playing Crystal Fellas:</p>\n<p>As the blue character, use A or D to jump off of the boomerang while in the air.</p>\n<p>Sometimes you can feel stuck in the wind turbine sections - if this happens, just wiggle from left to right and you should be able to pick up the velocity to escape. </p>\n<p>Don’t use an ability until both people are joined - this will break the game.</p>\n<p>There’s no menu during gameplay, so if you want to close the game either keep it in windowed mode or use alt+f4. You may fall out of the bounds of the map sometimes so sorry in advance.</p>", "metacritic": null, "released": "2020-06-18", "tba": false, "updated": "2020-06-19T02:52:53", "background_image": "https://media.rawg.io/media/screenshots/23b/23b83c020d5b699bb0c66f81518fd4a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tiernoon", "SamHunt98", "BigBoiRogur"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}