{"id": 455823, "slug": "asteroid-space-battle", "name": "Asteroid Space Battle", "name_original": "Asteroid Space Battle", "description": "ENGLISH DESCRIPTION\r\n<p>Asteroid Space Battle is a 2 players split screen game in which each player will control a spaceship. <br/></p>\n<p>The player's goal is to defeat the other player according to the game mode chosen.<br/><br/></p>\n<p>Here's the 3 Versus Modes available:</p>\n<ul><li><strong>MONEY GAME</strong>: the winner will be the one who has the most money at the end of the game. At he end of each round except the last, you could buy weapons or upgrades for your spaceship.</li></ul>\n<ul><li><strong>SURVIVAL: </strong>the winner will be the last one alive<strong>. </strong>You could buy weapons or upgrades before the fight beginning with the money chosen.</li></ul>\n<ul><li><strong>DEATHMATCH: </strong>the objective is to make the most frag at the end of the time limit<strong>.</strong> You could buy weapons or upgrades before the fight beginning with the money chosen.</li></ul>\n<p>Each mode is configurable, for instance you can choose the number of asteroids and the proportion of each asteroid type.</p>\n<p>Available languages are English and French.</p>\n<p>Good game!<br/></p>\n\r\nFRENCH DESCRIPTION\r\n\n<p>Asteroid Space Battle est un jeu 2 joueurs sur écran partagé dans lequel chaque joueur contrôlera un vaisseau spatial.<br/></p>\n<p>L'objectif du joueur est de vaincre l'autre joueur selon le mode de jeu choisi <br/></p>\n<p>Voici les 3 modes de jeu disponibles:<br/></p>\n<ul><li><strong>MONEY GAME</strong>: le gagnant sera celui qui aura obtenu le plus d'argent à la fin de la partie. A la fin de chaque round tu peux acheter des armes ou des améliorations pour ton vaisseau.</li></ul>\n<ul><li><strong>SURVIVAL: </strong>le gagnant sera le dernier en vie<strong>.</strong> Tu peux acheter des armes ou des amélioration avant le début du combat avec l'argent choisi.\r\n</li></ul>\n<ul><li><strong>DEATHMATCH: </strong>l'objectif est de faire le plus de frag à la fin du temps imparti<strong>.</strong> Tu peux acheter des armes ou des amélioration avant le début du combat avec l'argent choisi.</li></ul>\n<p>Chaque mode est configurable, par exemple tu peux choisir le nombre d'astéroïdes et la proportion de chaque type d'astéroïde.<br/><br/></p>\n<p>Bon jeu!</p>", "metacritic": null, "released": "2020-06-18", "tba": false, "updated": "2020-06-19T03:18:52", "background_image": "https://media.rawg.io/media/screenshots/c58/c58d268c84ca6f8535d518261cda28e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlberSaxe"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}