{"id": 45596, "slug": "where-the-money-is", "name": "Where the Money Is", "name_original": "Where the Money Is", "description": "Overview'Where the Money Is' puts you in control of a gang of notorious bank robbers as you attempt to score the biggest payday of your career. Using each member's special ability, you will make your way through 50+ puzzling levels and ensure everyone escapes unscathed.<br/><br/><br/>Each level brings a new challenge to overcome as you control a team comprised of a selection of the 6 available characters. Plan your moves carefully to avoid conflict with any of the patrolling officers and evade the scene with your entire team.<br/><br/>Go for the largest payout by breaching the bank's vault and scavenging your surroundings, but beware of setting off the alarm. Time will seem to quickly slip out of your control as you take your own approach to each level, as bank robberies can have multiple ways to ensure success.Gameplay'Where the Money Is' is a top down, grid based puzzle game. Even on the move, 'Where the Money Is' will keep your saves up-to-date using Steam Cloud services. Find the most efficient way to guide your team to the exit, while being pursued by police and the bank’s guards and collecting as much money as you can. Plan ahead, find your route, and help your team escape the bank as you unravel ‘Where the Money Is’.", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2019-08-28T22:05:13", "background_image": "https://media.rawg.io/media/screenshots/7f6/7f678a8f372c5eb4fa9b372f423d93d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bareware Studios", "Flaming Bat Studios"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Bareware Studios", "Flaming Bat Studios"], "esrb_rating": null}