{"id": 45597, "slug": "kingdom-city-drowning-episode-1-the-champion", "name": "Kingdom City Drowning Episode 1 - The Champion", "name_original": "Kingdom City Drowning Episode 1 - The Champion", "description": "***PAUSE THE EXPERIENCE TO CHANGE GRAPHICS SETTINGS AND REDUCE GRAIN***<br/>\n<br/>\r\nEPISODE ONE: THE CHAMPION<br/>\r\nHalf music video. Half blurry nightmare. The first episode of Kingdom City Drowning is an experiment in soaking in atmosphere and just \"being there.\" Where narrative takes a back seat to the aggressive soundtrack, brutal visuals and oppressive tone. Follow James' escape from the confines of a deep underground prison mining complex to meet up with his only two kin, but an escape is not without cost. In order to attain freedom, James must first strike a deal with the devil. <br/>\n<br/>\r\nKINGDOM CITY - the last standing mega-metropolis in a world choked by a toxic haze, forcing man to endlessly create towering structures that reach into the heavens, grasping for pure air.<br/>\n<br/>\r\nKINGDOM CITY DROWNING begins in the deepest, most depraved depths of Kingdom City, nearest the haze and desperation. Embody the camera as you follow three delinquents - James, Maika, and Brooks - bound by violence, trauma, love, and the desire to forge their way to the top by any means necessary.<br/>\n<br/>\r\nCREATED BY: William Gerardi and Barrett Phillips<br/>\r\nSTARRING: Kentucker Audley, Sofia Banzhaf and Amin Joseph", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2019-08-28T22:05:13", "background_image": "https://media.rawg.io/media/screenshots/5f4/5f44880ebf026b8cac435bfe4dd54cf0.jpg", "website": "http://www.kingdomcitydrowning.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["phoenixmirror"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["phoenixmirror"], "esrb_rating": "Mature"}