{"id": 455994, "slug": "cashroll-pub-fruit-machine", "name": "Cashroll Pub Fruit Machine", "name_original": "Cashroll Pub Fruit Machine", "description": "<p>CashRoll fruit machine is a hi-tech \"Just for Fun\" UK style fruit machine simulator game, also know as a slot machine.</p>\n<p>Just like on a real machine, the aim of the fruit machine game is to enter the feature and win some virtual cash! This can be done by matching 3 fruits on the winline, or by filling the trail ladder by collecting numbers which are super-imposed on the fruits!</p>\n<p>The middle reel contains a bonus, some of these are trail skill, selector, bonus numbers, respin and add again!</p>\n<p>Once a win is obtained or the trail is filled, the feature game is activated. The feature game consists of a unique wrap-around feature board, spinning the dice moves the player on the squares where you can add to your pots of features, nudges, win spins, cash shots and extra cash.</p>\n<p>You also have the opportunity to gamble higher or lower on each square to add to your virtual prizes!</p>\n<p>Watch out for the hidden features, bonuses and tricks - they can help you win more virtual cash! Guess what the next number will be and climb the feature ladder to win the virtual jackpot!</p>\n<p>Collect the 3 golden coins to activate invincible mode! The logo will start flashing red and you literally cannot lose! Go for the jackpot!</p>\n<p>Collect 3 hearts to activate the extra life feature!</p>\n<p>Landing on the \"move in\" arrow will take you into the super feature, where every spin of the dice is guaranteed to add to you winnings without the fear of losing everything.</p>\n<p>This fruit machine game includes lots of mini games and hidden tricks including Holds, Nudges, Hold 3 Times For A Win, Holds After Nudges and the classic Hi / Lo Gamble system!</p>\n<p>Some of the classic fruit machine features offered are win spins, super hold, fast cash, reel skill, cashpot, skill cash, cash repeaters and many more!</p>\n<p>Feature bonuses include extra life, extra step, extra cash, extra feature, no lose, lucky seven, lose stack, skill continue and gameover..!</p>\n<p>There are two modes of play. A quick game will let you play infinitely just for fun! Mode two is the \"50 Credit Challenge\" which will allow you to challenge your friends with Online leader boards! There is a weekly leader board and an all-time leader board!</p>\n<p>All game wins and losses are virtual, no real money can be won or lost on this fun game.</p>\n<p>If you are a fan of casino pub fruit machines, slot machine games or slots, this game will keep you entertained for hours on end!</p>", "metacritic": null, "released": "2020-06-17", "tba": false, "updated": "2020-06-19T03:56:17", "background_image": "https://media.rawg.io/media/screenshots/9ae/9ae86c59d851c27c98c1c131a33ac1e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["woodsmic"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}