{"id": 456042, "slug": "samson-galax-i", "name": "Samson Galax-i", "name_original": "Samson Galax-i", "description": "<p>So.. here it is. My first ever Game Jam entry, <strong>Samson Galax-i</strong>. </p>\n<p>It was made for Week 2 of \"The Fresh Game Jam\" themed \"Galaxy\". Trying to avoid to kick off a Space shooter (creative, isn't it?) I googled around and found a mobile phone being a top result. Who would have imagined. </p>\n<p>So the Idea was to make a Mobile with somewhat spaceship-like controls. Some sort of difficulty was found quickly: The fear of a whole generation, the empty phone battery! Fearsome, isn't it?</p>\n<p>So, in this game you have to explore a small house by flying from charger to charger. In all rooms except your starting room the charger positions are randomized so you have to search around a little and possibly learn the level to play through. There is only one level right now, so I guess it is more a Proof of Concept and a Learning experience for me. </p>\n<p>You die when you run out of battery or crash (meaning you flip your phone out of balance too much by hitting something or landing on an edge). </p>\n<p>After you win the game will tell you the time it took you. There is no leaderboard up to now however. </p>\n<p>The game was entirely made by me including each and every Asset. Tools I used are: </p>\n<ul><li>Unity</li><li>Blender</li><li>Inkscape</li><li>Bfxr</li><li>Wolfram Tones</li></ul>\n<p>So... wish me Luck guys. I learned a lot an will do it again ;) <br/></p>\n<p><em>Patrick</em></p>\n<p>Known Bugs: <br/></p>\n<ul><li>Lighting is far from perfect and makes it difficult to judge the player's position</li><li>There are bugs in the collision detection from time to time. The reason is my wrong usage of Unity's Physics Engine. Learning, Learning...</li></ul>", "metacritic": null, "released": "2020-06-17", "tba": false, "updated": "2020-06-19T04:07:54", "background_image": "https://media.rawg.io/media/screenshots/674/6746195dcd727d59d5e275da23153b9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["p.dassler"], "genres": [], "publishers": [], "esrb_rating": null}