{"id": 456101, "slug": "kichiro", "name": "Kichiro", "name_original": "Kichiro", "description": "<strong>Kichiro </strong>es un aprendiz de ninja que va a salvar a su amiga <strong>Chika</strong> aprendiz de kunoichi, que él cree que ha sido capturada por el Shogun de su país. A pesar de su torpeza y poca habilidad ninja <strong>Kichiro</strong> logra llegar hasta <strong>Chika</strong>, pero se entera que ella en realidad estaba en una misión de espionaje que <strong>Kichiro</strong> ha fastidiado por intentar rescatarla, por lo que tendrá que ayudar a conseguir la información que necesita para completar su misión. <br/><br/><strong>Kichiro</strong> is a ninja apprentice who is going to save his friend <strong>Chika</strong> apprentice from kunoichi, who he believes has been captured by the <strong>Shogun</strong> of his country. Despite her clumsiness and poor ninja ability, <strong>Kichiro</strong> manages to reach <strong>Chika</strong>, but learns that she was actually on a spy mission that<strong> Kichiro</strong> has screwed up for trying to rescue her, so he will have to help get the information he needs to complete. your mission.\r\n<p><strong>Kichiro </strong>es un videojuego en que controlamos a un estudiante-aprendiz de ninja. A medida que avanza el nivel se va a encontrar diferentes tipos de enemigos. Y su objetivo final será derrotar al jefe final. Nuestro juego es de Acción-aventura  y comedia /  <strong>Kichiro</strong> is a video game in which we control a student-apprentice of ninja. As the level progresses you will encounter different types of enemies. And your ultimate goal will be to defeat the final boss. Our game is Action-adventure and comedy</p>", "metacritic": null, "released": "2020-06-17", "tba": false, "updated": "2020-06-19T04:21:59", "background_image": "https://media.rawg.io/media/screenshots/d4f/d4f2c909b2d58dfd38acd42eaf285fda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kichiro"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}