{"id": 45616, "slug": "aegyptus", "name": "AEGYPTUS", "name_original": "AEGYPTUS", "description": "A game inspired on Egyptian mythology, consist of two different gameplay types, finished the survival-style open world game map and complete the objectives to access the various pyramids where the gameplay changes radically, explores the various dungeons and survive traps. Find the exit and seals the various pyramids to escape from Egyptian gods who try in every way to block you and keep you from escaping away..<br/><br/><br/><br/>Aegyptus is an open world adventure with elements of survival and enigmas, climatic events and a totally hand-drawn story with comics, you're alone in the desert and you have to find a way to escape, search for water springs for not dehydrate yourself, find a way to enter the pyramid and you'll be catapulted into an Egyptian dungeon where in addition to avoid deadly traps you have to escape from anubis fury, the game proposes three totally different gameplay styles alternating: survival, deadly dungeons Full of mortal traps and escape.<br/><br/><br/><br/>. The desert, a huge freely explored borderless map<br/>. Day night cycle in real time<br/>. First part of the story hand drawn on paper<br/>. Rain climatic event that affects the gameplay (water sources fill in during rains but exhaust with the heat of the desert)<br/>. Possibility to change visuals between first and third person<br/>. Complete hud with stamina, dehydration, batteries and updated targets<br/>. Pause menu with keyboard/gamepad commands (actually not configurable)<br/>. Over 50 sounds made for the actions of the main character and nice sound for the desert atmosphere<br/>. Over 20 Animations of the main character in motion capture<br/>. 4 complete puzzles to solve in order to enter the first pyramid<br/>. Footprints in real-time terrain so as not to get lost in the desert<br/>. Torch to be charged with batteries to fight the night<br/>. Titans(giant worms)<br/><br/><br/><br/>Currently aegyptus is in the prealpha version and I am working on content that will be released gradually through future patches to make gaming experience even more immersive and addictive.<br/><br/><br/><br/>. 3 dungeons within their respective pyramids with over 20 different types of traps<br/>. A lot of original hand-made paper designs that will tell the story's evolution and will also be incorporated into gameplay for events such as death, advice and more<br/>. 2 Egyptians boss(anubis and horus) trying to stop at some parts of the dungeons<br/>. Quick time events in certain sections of the game<br/>. Steam achievements<br/>. Steam cards<br/><br/><br/>Some of these things may change or be modified during project development<br/><br/>This game has been developed by a single person,no assets,all play content is original.", "metacritic": null, "released": "2017-08-15", "tba": false, "updated": "2019-08-28T22:05:13", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb9c52cbed93f3d61575d66a7ebe71a9.jpg", "website": "http://sonnolord.wixsite.com/justplaynow", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 36, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Luciano Cargiolli"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["JustPlayNow"], "esrb_rating": null}