{"id": 45622, "slug": "bloodlines-of-prima", "name": "Bloodlines of Prima", "name_original": "Bloodlines of Prima", "description": "Infinite power.<br/>Unlimited wealth.<br/>Eternal life.<br/><br/>Those brave enough to conquer the untamed primordial lands will be richly rewarded should they unearth what legend claims is hidden there. Tread carefully. If you die, you lose everything.<br/><br/>Bloodlines of Prima is a FPS Rogue-lite Multiplayer game, set in a land overwhelmed by mysterious elemental forces. You are in search of the Prima Materia, the key to creating the legendary Philospher’s Stone.<br/><br/><ul><li>Mix and match hundreds of different abilities to achieve your goals. <br/></li><li>Collect essences of your slain enemies to reinforce the base camp, unlocking new buildings and services, summon bosses or buy powerful equipment for your character.<br/></li><li>Help your server to progress and conquer challenges before other servers do.<br/></li><li>Unlock bank access to save your most precious treasures from being pillaged from your dead body. <br/></li><li>Explore a huge, diverse environment dominated by strong elemental enemies. <br/></li><li>Upgrade your equipment, craft consumables to increase your power, or transmute your accessories to augment your abilities. </li></ul> <br/>The more you explore and conquer, the more powerful your Bloodline becomes.", "metacritic": null, "released": "2017-08-28", "tba": false, "updated": "2019-08-28T22:05:12", "background_image": "https://media.rawg.io/media/screenshots/ba4/ba4ac97f729fa1d31fd3e30b4e5d687f.jpg", "website": "http://amazastrophic.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 140, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 474, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["Amazastrophic"], "genres": ["Action", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Amazastrophic"], "esrb_rating": null}