{"id": 456289, "slug": "backwards-day", "name": "BACKWARDS DAY", "name_original": "BACKWARDS DAY", "description": "<p>     BACKWARDS DAY is a game where every death brings you farther away from the finish line. This game boasts Difficult Levels that if you die in...Send you backwards in time to the previously completed level/day.</p>\n<p>STORYLINE</p>\n<p>A little ghost is trapped in a black n' white dimension. He tries to escape, but every failed attempt sends him back in time to the previous day. He must try to reach the the outer walls of the dimension and ascend through the portal to Heaven.</p>\n<p>(PS: Please Don't Destroy Your Keyboards)</p>\n<p>YOU NEED TO READ THIS BELOW, OR ELSE YOU MIGHT BE CONFUSED!!!</p>\n<p>CONTROLS/TIPS</p>\n<p>This game is best played with Headphones or your volume set to 50%</p>\n<p>A and D to Move</p>\n<p>Space to Jump (You have a TRIPLE JUMP)</p>\n<p>Hold A or D while on a wall to stick to them (Spam Space while doing so to CLIMB THE WALLS)</p>\n<p>When You Are Under A Zipline, Hold Down The Left Mouse Button to Latch On (Ziplines DO NOT give you your jumps back)</p>\n<p>Vertical Levels are zoomed out to give you a better view. (Walls in Vertical Levels DO NOT give you your jumps back, either. Use them wisely)</p>\n<p>Anything with an eye (That Glows Red) will see you and kill you if you walk DIRECTLY UNDER IT</p>\n<p>Whenever you die, it sends you back to the previous level (This is for everything except the seventh level, which sends you back to the start of the game because it's really easy)</p>\n<p>-----</p>\n<p>Made For The GameDev Hideout Jam #1 (2020)<br/></p>\n<p>-----</p>\n<p>Music and Sound Effects By FeslyianStudios</p>\n<p>Art and Scripting By Me</p>", "metacritic": null, "released": "2020-06-16", "tba": false, "updated": "2020-06-19T05:06:33", "background_image": "https://media.rawg.io/media/screenshots/c4b/c4b9c8d1817d523703934a279107d563.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Stagelily Studios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}