{"id": 45636, "slug": "football-manager-2018", "name": "Football Manager 2018", "name_original": "Football Manager 2018", "description": "You make the decisions now, from who you sign and who you sell, to how you manage your budget. Will you build tactics around the players at your disposal or train them in your vision of how the game should be played? Who you pick and who you bench will affect squad harmony, and it’s up to you to manage it. Every decision comes back to you.<br />\nGet it right and you’ll be the star of the show, grabbing the newspaper headlines and dominating trends on social media. They’ll write your name in footballing folklore…if you succeed, of course.<br />\nWith unparalleled choices both on and off the pitch, all within the immersive footballing world, it’s time to decide what kind of manager do you want to be?<br />\nTry your hand in 50 of the biggest footballing countries<br />\nWin the title with any one of world’s top 2500 clubs<br />\nPlay the transfer market with over 600,000 real players and staff<br />\nWatch your football vision come to life before your very eyes<br />\nFootball Manager 2018 is available to pre-purchase now and fans who do so before Monday, October 9th and who have Football Manager 2017 in their Steam Library will receive a ‘Contract Extension Bonus’ discount of 25 per cent.<br />\nIn addition, you’ll also enjoy access to a fully-playable Beta version of the game at least two weeks prior to the November 10th official release date, allowing you to start pre-season early. Single player careers started in this Beta version will also continue into the full game.<br />\nAll purchases of Football Manager 2018 also include a free copy of Football Manager Touch 2018 for PC/Mac and Linux.</p>", "metacritic": 81, "released": "2017-11-10", "tba": false, "updated": "2024-04-21T05:39:04", "background_image": "https://media.rawg.io/media/games/b6e/b6e4960341c8cb05c3a43e652e7b443a.jpg", "website": "http://www.footballmanager.com/", "rating": 4.01, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 213, "beaten": 45, "toplay": 3, "dropped": 41, "playing": 9}, "playtime": 96, "achievements_count": 86, "ratings_count": 101, "suggestions_count": 289, "game_series_count": 18, "reviews_count": 103, "platforms": ["PC"], "developers": ["Sports Interactive"], "genres": ["Simulation", "Sports"], "publishers": ["SEGA"], "esrb_rating": null}