{"id": 45654, "slug": "trackless", "name": "Trackless", "name_original": "Trackless", "description": "Trackless is an atmospheric first-person exploration and puzzle game set in the distant future. Inspired by classic games like Zork, Shadowgate, and King’s Quest, Trackless uses text input that allow you to interact with characters and objects. <br/><br/>In the game, you play as a seeker, someone who has decided to take a journey into the mountains to attempt a series of trails that, if completed, will lead you to a monolith called The Object. No one knows what The Object is or where it came from, but clues exist surrounding this intractable mystery. <br/><br/><br/><br/>Unlike many adventures games, interacting with characters is a critical element of completing the trials and finding The Object. Along the way, you will learn about this strange future inspired by real places and ideas. There will be many people to meet. Some may want to help you, while others might want to keep you in the dark.<br/><br/><br/><br/>Exploring a diverse set of locations and solving puzzles will earn you currency, which you can use to buy upgrades for your phone. Your in-game phone will help you find clues and give you special abilities.Features <ul><li>Puzzles<br/></li><li>Cool Soundtrack by Makeup and Vanity Set<br/></li><li>Cute Characters <br/></li><li>Easy to Moderate Gameplay<br/></li><li>New Art Style<br/></li><li>Spooky Locations</li></ul>", "metacritic": null, "released": "2017-09-12", "tba": false, "updated": "2022-08-10T14:39:14", "background_image": "https://media.rawg.io/media/screenshots/61c/61c4f34737549f4a2f67541b8013937a.jpg", "website": "http://12eastgames.com/trackless/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 49, "toplay": 3, "dropped": 1}, "playtime": 2, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["12 East Games"], "genres": ["Adventure", "Casual"], "publishers": ["12 East Games"], "esrb_rating": null}