{"id": 45675, "slug": "super-phantom-cat-2", "name": "Super Phantom Cat 2", "name_original": "Super Phantom Cat 2", "description": "Meet Ari. He's on a journey to rescue his sister, Ina, who has been kidnapped in the mysterious Phantom world. He's determined. He's focused. But super-scary enemies, super powers, allies and hidden secrets await him.  <br/><br/>In Super Phantom Cat 2, you can possess the best Phantom superpowers yet: <br/>· Bounce higher and higher to reach for the sky and stars.<br/>· Float on balloons into the Wild Woods and Alps.<br/>· Break walls, stone, and metal.<br/>· Shrink and enlarge monsters with the touch of a finger. <br/>· Turn irritating critters into ice statues. <br/>· Shift to invincible mode if danger still prevails.  <br/><br/>Play as one of many characters, such as: <br/>· The lead singer and guitarist of a band.<br/>· A dancer who plays pranks and dresses up as a skeleton.<br/>· A pink-haired magician who is a master of cards.<br/>· A funky teen skater obsessed with extreme sports.<br/>· An adventurous cowboy always on a lookout for treasure. <br/>· And champions from Mushroom stomping, Juice blending and Cuteness competitions. <br/><br/>Plus... <br/><br/>· Find hidden secrets in the mysterious Phantom World. <br/>· Discover different levels and checkpoints. <br/> <br/>It's a purr-iceless experience for everyone!  <br/><br/>And...  <br/><br/>In Super Phantom Cat 2, you can own props, which save you from cata-astrophe. If cats have nine lives, you can earn even more!  <br/><br/>· Create props based on your own requirements. · Whether you are a beginner or a master at platform games, you need these props to complete your mission.  <br/><br/>Wait, there's more... <br/><br/>Save your progress across multiple devices. Mobiles, tablets, Apple TV — you can access Super Phantom Cat 2 from all of these locations.  <br/><br/>From the creators of Super Phantom Cat, which featured in the App Store's \"Best of 2016,\" Super Phantom Cat 2 is the hottest, baddest platform game of 2017. <br/>——————————————————————<br/>We love to hear from our fans.  <br/>Email us with ideas and feedback: service@veewo.com<br/>Like us on Facebook: https://www.facebook.com/veewosupercat/ <br/>Follow us on Twitter for latest updates: @VeewoGames and @SuperPhantomCat", "metacritic": null, "released": "2017-08-17", "tba": false, "updated": "2019-10-22T14:38:09", "background_image": "https://media.rawg.io/media/screenshots/874/8746d2ec9e7ba063dd01d2fb1fed4564.jpg", "website": "http://www.veewo.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 121, "game_series_count": 1, "reviews_count": 3, "platforms": ["iOS"], "developers": ["Veewo Games"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["Beijing Veewo Game Co"], "esrb_rating": "Everyone 10+"}