{"id": 456728, "slug": "pacifist-8", "name": "Pacifist 8", "name_original": "Pacifist 8", "description": "Pacifist 8\r\n<p>Pacifist 8 is a challenging 4 stage bullet hell where you play as a member of [Redacted] tasked to execute your will over the current state of the world in which the Federal Alliance abuses their power to dominate all who oppose them. The only problem is, you don't have any weapons! Looks like you will just have to dodge your way through this one.</p>\r\nGame Modes\r\n\n<p><strong>Practice:</strong></p>\n<p>Those who are looking to study enemy patterns or just want a casual experience will enjoy practice mode. You get 1000 lives per level, making the game a guaranteed win within about 20 min, but you will not unlock a game ending.</p>\n<p><strong>Normal:</strong></p>\n<p>With 50 lives per level, normal mode will provide a decent challenge for new players. Finish this mode and you unlock the games regular ending.</p>\n<p><strong>Hard:</strong></p>\n<p>Same ending as normal mode, but you only get 25 lives per level. Hard mode is for more adept  players looking for a greater challenge.</p>\n<p><strong>Good Luck lol:</strong></p>\n<p>Only 3 lives per level. This mode is for the most skilled players looking to push their limits. Clearing this difficulty will give you bragging rights and  unlock the esoteric ending.</p>\r\nExpectations\r\n<p>On normal difficulty you should not expect to beat this game on your first run. There are going to bullet patterns that are not always intuitive to dodge like ones that require you to wrap around the screen. You are meant to learn how each enemy works through either practice mode or repeated runs on the higher difficulties, and overcome them over time. However, if you are finding that normal mode is too easy, then this is an indication that you should challenge yourself and bump up the difficulty. In any case, don't get discouraged, you can do this! Good Luck!</p>", "metacritic": null, "released": "2020-06-14", "tba": false, "updated": "2020-06-19T06:50:32", "background_image": "https://media.rawg.io/media/screenshots/f68/f68fe7039b9983bfc7afe45ad67ba3dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ScottGrogin"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}