{"id": 456724, "slug": "blazend", "name": "Blazend (itch)", "name_original": "Blazend (itch)", "description": "<p>In <strong>Blazend</strong> you play as a hero setting out to clear some space debris in the orbit of your home planet, <em>Vestroia</em>. Unfortunately, all is not as it seems, as the debris begins attacking the hero! On closer inspection, it appears to be strange alien life-form that originated from a deeper part of space. The origin and the motive of the attack is unknown. You are the planets only hope; using your skills as a pilot, progress through the story fighting various enemies and bosses in this classic shoot-em up style game! </p>\n<p>What you can expect:</p>\n<ul><li>6 unique levels are planned, with possibility of more being added</li><li>A complete story from start to finish </li><li>In-game achievements</li><li>Two different modes to play including classic as well as bullet hell</li><li>Variety of difficulty levels welcoming novice players</li></ul>\n<p>And much more.</p>\n<p><strong>Current Prog</strong><strong>ress:</strong></p>\n<p>In the recent months, the game has made significant progress. Although we do not have a concrete release date, expect one very soon.</p>\n<p>We currently have a <strong>DEMO</strong> with a fully playable first level to get a taste of the game.<br/><br/>Please take note the <strong>DEMO</strong> is not the full representation of the final product and some changes may be made. If there are any bugs or issues, please let us know in the feedback form or in the comments thread.  </p>\n<p><strong>Please be sure to also give feedback through this survey</strong> so we can improve the game and make it something you can really enjoy!</p>\n<p><strong>Feedback Form:</strong><br/>https://forms.gle/375CuL6x9KgZthBH9</p>\n<p>Game Developed and Published By: BlueRichter<br/><strong> Instagram: (@bluerichter) <br/></strong><strong> Website (bluerichter.com)</strong></p>", "metacritic": null, "released": "2020-06-14", "tba": false, "updated": "2020-06-19T06:49:15", "background_image": "https://media.rawg.io/media/screenshots/fa8/fa87a5046d1836ac637a03acf31a741b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlueRichter"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}