{"id": 456766, "slug": "save-the-station-tower-defense-with-a-twist", "name": "Save The Station: Tower Defense With A Twist", "name_original": "Save The Station: Tower Defense With A Twist", "description": "<p>Thank you for playing my first game jam game!</p>\n<p>Full screen is the best viewing experience!<br/></p>\n<p>A fusion of tower defense with survival horror elements. You are an astronaut stuck on a (Doughnut-Shaped) space station being invaded by aliens, you have to use the turrets to protect the generator that powers your repair beacon. Your turrets also need to be recharged after use.</p>\n<p>The game has a tutorial but if you want to read it here:<br/></p>\n<p><strong>CONTROLS:</strong>  WASD - Move and Aim Cursor  | Space - Pick up and let go of turrets.</p>\n<p>Turrets charge on the pad that they start on, you must move them to one of the six outer ports to make them fire, when the bar on the right of the turrets is depleted, they need to be recharged.<br/></p>\n<p><strong>TURRETS:</strong><br/></p>\n<p><strong>GREEN: </strong>Gun, most basic turret, it shoots bullets, and the bullets hurt the aliens.</p>\n<p><strong>RED:</strong> Oil Gun, Doesn't deal damage, but it slows enemies with its oil slicks. It doesn't wait until enemies are within its range to start firing so be careful of when you place it.</p>\n<p><strong>BLUE: </strong>Capacitor, Releases a huge blast of power immediately when it's placed, uses all of its power in one blast.</p>\n<p><strong>ENEMIES:</strong></p>\n<p><strong>BLOB:</strong> Your basic tank, lots of health and slow movement.</p>\n<p><strong>GREMLIN: </strong>These move in hordes, small and fast, weak yet effective.</p>\n<p><strong>SHADE:</strong> These mysterious beings teleport when hit with a bullet, use the capacitor to destroy it.<br/></p>", "metacritic": null, "released": "2020-06-15", "tba": false, "updated": "2020-06-19T07:00:56", "background_image": "https://media.rawg.io/media/screenshots/e43/e431843e3990c3c2ad943969966ee251.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Piginatuxedo"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}