{"id": 456718, "slug": "fugitive-3d", "name": "Fugitive 3D", "name_original": "Fugitive 3D", "description": "<strong>Join our Discord to find people to play with: https://discord.gg/2qk2Spe</strong><br/><br/>The sequel to the 2D game, Fugitive is here! And it's in <strong>333 DDD</strong><br/><br/>Play hide and seek with your friends on a warm summer night. Hide behind bushes as the Cops search for you. Make your way to the end zone without getting caught! If you're friend gets frozen by the police, you have to decide if it's worth trying to go rescue them. Or be the Cops, and drive around in your cop car shinning your flashlight into dark corners.<h3>Features:</h3><ul><li> Cross-platform! VR and Flat players can play together.<br/></li><li> Server browser: Find a game quickly from any platform!<br/></li><li> Positional VOIP: hear the fugitives whispering in the bushes as you search for them.<br/></li><li> Watch the Replay: At the end of the round talk with everyone about how close they were to catching you as you all watch a replay over the round!<br/></li><li> Free and Open Source!<br/></li><li> Even runs on Android phones, so your one lame friend with no VR and no PC can still join in on the fun :P</li></ul><h3>As a Cop</h3><br/>Your job is to hunt down the Fugitives and bring them to justice. It's a dark night out, and they are good at hiding, so you'll have to get them in your flashlight to see them. Luckily you've got your trusty cop car. You can quickly patrol the streets, picking up your fellow cops and dropping them off strategically around the city.<h3>As a Fugitive</h3><br/>You're on the run, but Johnny law is in hot pursuit. You'll have a few seconds head start, stay out of sight! You have to get to the safe zone to escape. But if the Cops see you, you're as good as dead.", "metacritic": null, "released": "2020-06-13", "tba": false, "updated": "2021-06-25T02:37:49", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8d5e9e4e312c9fd51d18bb0d6229e27.jpg", "website": "https://fugitivethegame.online/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC", "macOS", "Linux"], "developers": ["Wavesonics", "Stumpy Dog Studios"], "genres": ["Action", "Casual"], "publishers": ["Stumpy Dog Studios"], "esrb_rating": null}