{"id": 4569, "slug": "worms-crazy-golf", "name": "Worms Crazy Golf", "name_original": "Worms Crazy Golf", "description": "<p>A golfing spin-off in the famous Worms series. Worms Crazy Golf - it&#39;s a familiar mix of the main series gameplay and classic golf transforming the latter into turn-based madness. Now the main goal is not to destroy all of the enemy’s worms. The goal is to get into the hole with fewer strikes. The game is a continuation of the mobile-exclusive Worms Golf and adaptation of the format on the PC.</p>\n<p>The player takes control of the worm, which appears on the 2D battlefield. The goal is to drive the ball into the hole. Sometimes on the way, there are explosive sheep that explode to shreds in a collision and other obstacles to overcome. Visually, the game is reminiscent of the game series of the era of 2D Worms 2: Armageddon and Worms Reloaded.</p>\n<p>For a single completion, there are 3x 18 holes courses all with its own visual style and challenges. As well as 15 challenges without complete courses. Also, there is multiplayer available for up to four players on the same device with the alternate right of turn. Worms can be customized to your taste. To do this, you must earn in-game cash to spend it on cosmetic items.</p>", "metacritic": 73, "released": "2011-10-18", "tba": false, "updated": "2024-04-06T12:03:39", "background_image": "https://media.rawg.io/media/screenshots/770/77073b0bdeed847fdaad4f58175bc898.jpeg", "website": "http://www.facebook.com/WormsTeam17", "rating": 2.58, "rating_top": 1, "added_by_status": {"yet": 61, "owned": 1423, "beaten": 11, "toplay": 1, "dropped": 26, "playing": 3}, "playtime": 1, "achievements_count": 43, "ratings_count": 69, "suggestions_count": 369, "game_series_count": 18, "reviews_count": 69, "platforms": ["PC", "PlayStation 3", "iOS", "macOS"], "developers": ["Team17 Digital"], "genres": ["Action", "Strategy", "Sports", "Arcade", "Casual", "Puzzle"], "publishers": ["Team17 Digital"], "esrb_rating": null}