{"id": 45692, "slug": "madu-maths", "name": "Madu Maths", "name_original": "Madu Maths", "description": "The hive is out of honey and Becky the queen bee needs her workers to help her get some more. Kids will have their maths skills tested in a unique and mind-stimulating challenge as the bees work together to bring home the honey!<br/><br/>Madu Maths is a completely free game meticulously and specifically created to test the maths skills of<strong> kids aged 5 - 9+</strong>. The game provides 5 levels of<strong> addition</strong> and <strong>subtraction</strong> problems with <strong>numbers up to 20</strong>, and also <strong>numbers up to 100 in the harder levels</strong>, which are perfect for the older kids and those looking for a bigger challenge.<br/><br/>In each level, kids are presented with a handful of flowers, each having its own maths problem to represent the honey it holds. The most unique aspect of this game is that kids must choose their own maths problem to solve. They are asked to first assess which flower will help them fill the hive most quickly and then to solve the problem to get the honey.<br/><br/>So on top of challenging kids on their maths skills, Madu Maths also challenges them in other areas of their developmental cognitive psychology like priming. The idea that kids can learn to prime certain maths problems and link them to a solution will help them in quick estimations and allow them to pick the flower with the most honey quickly and consistently. This will provide a foundation for success in more advanced areas in maths they will encounter in future.<br/><br/>With all these challenges, Madu Maths is the ultimate game that integrates what kids are learning at school with interactive fun. <strong>Get Madu Maths today for free!</strong>", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-08-28T22:05:10", "background_image": "https://media.rawg.io/media/screenshots/da3/da32e96c1402bc7204891eb4cb11fed0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 127, "beaten": 2, "toplay": 1}, "playtime": 1, "achievements_count": 15, "ratings_count": 3, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Tzar Leonardi"], "genres": ["Casual", "Indie"], "publishers": ["Tzar Leonardi"], "esrb_rating": null}