{"id": 45703, "slug": "raccoon-hero-the-frost", "name": "Raccoon Hero: The Frost", "name_original": "Raccoon Hero: The Frost", "description": "Raccoon Hero: The Frost is a cute puzzle game situated in a winter wonderland forest with a goal to save baby raccoons trapped inside the ball cages!<br/>\n<br/>\r\nYOUR GOAL:<br/>\n<br/>\r\nYour goal in this game is to help the raccoon cubs escape their ball cages by matching their color with the color of the ball you throw at it. The babies are hidden among hundreds of other colorful balls. So basically, you need to destroy as much balls as necessary and achieve the certain score that is calculated for every level.<br/>\n<br/>\r\nPOWER UPS:<br/>\n<br/>\r\nFIREBALL - shoots a fire ball of flames and destroys more balls at once<br/>\n<br/>\r\nGRASSBALL - shoots a grassy ball that destroys more balls at once with growing ivy<br/>\n<br/>\r\nAQUABALL - shoots a water ball that destroys an entire row of balls at once with a water wave<br/>\n<br/>\r\nTRIPPLEBALL - shoots three balls at once<br/>\n<br/>\n<br/>\n<br/>\r\nSPECIAL BALLS:<br/>\n<br/>\r\nBOMBALL - a bomb ball that explodes on impact<br/>\n<br/>\r\nLEAFBALL - a leafy ball that destroys nearby balls with ivy<br/>\n<br/>\r\nWATERBALL - a water ball that creates a wave which destroys the entire row of balls on impact<br/>\n<br/>\r\nSTONEBALL - balls made of stone, unbreakable<br/>\n<br/>\r\nWOODBALL - balls made of wood, breakable only in case of explosions<br/>\n<br/>\r\nCRACKED WOODBALL - cracked balls made of wood, easily breakable<br/>\n<br/>\r\nMISTERY BALLS - balls in a casing that hides their color<br/>\n<br/>\n<br/>\r\nSCORE REWARDS:<br/>\n<br/>\r\nThere is a possibility of getting one, two or perfect three stars after finishing each level. Your level score progress is kept at the top of your screen so you can always know how close you are to perfecting it.<br/>\n<br/>\n<br/>\r\nThe number of balls you can throw is limited and it varies from level to level and therefore limits the number of your moves. <br/>\n<br/>\r\nSave all the baby raccoons in each level to complete the entire quest!", "metacritic": null, "released": "2017-08-01", "tba": false, "updated": "2019-08-28T22:05:10", "background_image": "https://media.rawg.io/media/screenshots/447/4475f5341743950827ad0c9c0f873a33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zonitron Productions"], "genres": ["Casual", "Indie"], "publishers": ["Zonitron Productions"], "esrb_rating": null}