{"id": 45705, "slug": "paper-knights", "name": "Paper Knights", "name_original": "Paper Knights", "description": "Paper Knights is an artistic stylized RTS (Real Time Strategy) game which puts the player in charge of controlling tiny paper armies and deciding about their next moves in battles and sieges.<br/><br/>FEATURES:<br/><br/>What can you actually do in this game? Well, you can spawn soldiers and other units, you can fight enemies or destroy their buildings, you can use bombs as special moves to destroy more enemies faster and you can control your recruited units and command their moves.<br/><br/>GAMEPLAY AND MODES:<br/><br/>There are 3 types of gameplay in this game.<br/><br/>TIMED SURVIVAL WARFARE<br/><br/>In this mode you have to survive for a certain amount of time. You have the ability to spawn soldiers and use bombs. You win the game once the time has ran out or you destroy all enemy buildings.<br/><br/>CASTLE DESTROYER <br/><br/>In this mode you have unlimited time to destroy all enemy buildings. You have the ability to spawn soldiers and use bombs.<br/><br/>MERCENARY<br/><br/>In this mode you are a mercenary hired to kill enemy units. You have a goal number of enemies you must destroy and that is how you achieve victory. You have the ability to spawn soldiers and use bombs.<br/><br/>UNITS:<br/><br/><br/><br/>Villagers are basically ordinary people from the nearby villages that have joined your cause and are armed only with swords. They have no combat experience nor armor, but they have loyalty.<br/><br/><br/><br/>Swordsmen are professionals. They are mercenaries payed to serve and fight. Armed with heavy swords and equipped with armors, they make a nice addition to your armies.<br/><br/><br/><br/>Bowmen are your sharpshooters, units that can destroy the enemy from a certain distance. They are very good as a reinforcement and work very well with other foot soldiers.<br/><br/><br/><br/>Knights are your personal professional soldiers. They fight for you and are most loyal to your cause. Equipped with swords, armors, helmets and shields, they make the strongest part of the foot unit.<br/><br/><br/><br/>Cavalry is consisted of Horsemen. They are strong, fast and armed with long spears. Extra good for fast attacks and sieges.<br/><br/><br/><br/>Goblins are creatures from the forest that have joined your cause because of your common enemy - the Vikings. They are not much stronger then your ordinary villagers, but they are faster and have more stamina. Be careful though, not all goblins are on your side, some of then have joined the enemy.<br/><br/><br/><br/>Goblin Riders are Goblins trained to ride Goblincorns. They are armed with long spears and are the strongest warriors the wilderness has to offer.<br/><br/><br/><br/>Giants are huge creatures from the mountains that have joined your cause because your enemies are destroying their stone houses to build their castles. THEY. ARE. HUGE. Really, they are very large in size and are of best use in sieges for breaking enemy walls and castles. They can not attack enemy units, but they often tend to simply stump them if they are on their way.<br/><br/><br/><br/>Necromancers are mages that can summon skeleton armies. HOW COOL IS THAT. They are from all over the world and have joined your numbers because they can't stand injustice. Their abilities include summoning 3 skeleton soldiers each after which they are ready to pull out their magic staffs and battle on.<br/><br/><br/><br/>Golems are unexplainable magical creatures that have no leaders and no laws. As it fortunately happens - they hate Vikings! This is good for you because now you are able to recruit them for your fight. They are smaller than Giants, but they can fight enemy units.", "metacritic": null, "released": "2017-08-28", "tba": false, "updated": "2019-08-28T22:05:10", "background_image": "https://media.rawg.io/media/screenshots/eeb/eeba9ed1118d84a06522048e22e9155e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silicon Echo"], "genres": ["Casual", "Indie"], "publishers": ["Silicon Echo"], "esrb_rating": null}