{"id": 45704, "slug": "deep-sky-derelicts", "name": "Deep Sky Derelicts", "name_original": "Deep Sky Derelicts", "description": "In a grim dystopian future, where mankind has scattered across the galaxy and the human society has split into two distinct classes, you are a poor stateless outcast forced to live off scraps from derelict alien stations and ships in the outer space, yet you dream of becoming a privileged citizen and living on the surface of a habitable planet, enjoying non-synthetic air, water and food. A fabled alien derelict ship somewhere within the Deep Sky sector of space is your voucher for a citizenship and a promise of cozy life on a hospitable planet.<br/><br/>Hire and control a squad of up to three mercenary characters and set on to explore derelict ships within your reach from the scavenger's base. Searching the derelicts for loot and clues, you come across many friendly inhabitants and traders, but more often – various enemies. Challenge and defeat them in tactical turn-based fights, where randomly-drawn cards form your changing arsenal of combat actions, gain experience for yourself and your crew, loot dead bodies, resupply and upgrade once back at your base. The scavenger's home ship gives you the opportunity to heal and level-up your mercenaries, recruit new ones, equip them, upgrade their gear or recharge energy for life support during missions.<br/><br/>Key Features:<br/><ul><li>Fresh take on turn-based combat with cards <br/></li><li>Refined sci-fi comic book look &amp; feel <br/></li><li>Endless customization options for characters and scavenging teams<br/></li><li>High replay value thanks to procedural generation of content <br/></li><li>Story of the human society divided within a dystopian universe <br/></li><li>Two game modes: story and arena </li></ul><br/>", "metacritic": null, "released": "2018-09-26", "tba": false, "updated": "2023-12-25T22:53:05", "background_image": "https://media.rawg.io/media/screenshots/e13/e130271b48831145b1e073adc8f0d4b4.jpg", "website": "http://www.snowhoundgames.com/deep-sky-derelicts/", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 98, "owned": 997, "beaten": 15, "toplay": 20, "dropped": 22, "playing": 3}, "playtime": 3, "achievements_count": 83, "ratings_count": 63, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 64, "platforms": ["Linux", "macOS", "PC"], "developers": ["Snowhound Games"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["1C Company"], "esrb_rating": null}