{"id": 457089, "slug": "speed-date-mansion-hells-kitchen", "name": "Speed Date Mansion: Hell's Kitchen", "name_original": "Speed Date Mansion: Hell's Kitchen", "description": "Click lower right for level selection!\r\nFor online Multiplayer, enter a room code (Over the 0000's) or hit Create Lobby to get a room code (in the top right)\r\nSummary\r\n<p>Marisa has borrowed the Scarlet Devil Mansion on her quest to serve up some romance to the residents of Gensokyo! Either by yourself or with an online friend, alternate between customer service and overcooked-style food management while trying to serve as many couples as possible- but be careful, nobody likes slow service, even during rush hour.</p>\n<p>Gameplay is separated into three minute levels where one player takes the roll as bartender or waitstaff, or for single player, by switching roles.</p>\r\nGameplay\r\n<p>As a server, your job is to make sure your customers get their tables, food, and tables bused without holding up the whole operation. Greet customers with <strong>E</strong>, lead them to a table, take their orders and drop them off for the Bartender to fill. Excellent service is rewarded with tips, so working fast to keep customers hearts filled is key - wait too long, and the couple will give up and leave without paying.</p>\n<p>As a bartender, your job is to fill the orders as they come in. Each of your operations take a certain amount of time and you only have so much space, so focusing on order cards and pre-preparing ingredients is the key for customer satisfaction. </p>\r\nControls (Play the tutorial!!)\r\n<p><strong>WASD </strong>or Arrow Keys to move</p>\n<p>Pick up or drop objects with <strong>E</strong></p>\n<p>Interact with customers with <strong>E</strong>, from moving them to tables to taking or giving orders</p>\n<p>Certain stations, such as the cutting board and sink, are also operated with <strong>F</strong></p>\n<p>Held objects can be thrown with <strong>F</strong>, allowing you to serve customers from afar.</p>\n<p>For singleplayer, use <strong>Tab </strong>to switch between the waitstaff and the bartender.</p>\r\nCredits\r\n<p>Created in 14 days for Touhou Pride Jam 2</p>\n<p>Jose Garcia - Concept, Design, Networking, Basically Everything</p>\n<p>David \"Texel\" Jones - Design, Code, Networking, Modeling</p>\n<p>Egophiliac (Egophiliac.tumblr.com) - Character Modeling / Texturing / 2D Art<br/>Raz - Additional Modeling</p>\n<p>Music licensed via AudioNetwork - Sneaks and Ladders by Mike Westergaard and Miles Bould</p>", "metacritic": null, "released": "2020-06-21", "tba": false, "updated": "2020-06-22T03:02:40", "background_image": "https://media.rawg.io/media/screenshots/acf/acfbc4b68636a80e3f7dc09b0e97bfcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Nitori", "LadyEbony"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}