{"id": 457101, "slug": "abacus-game", "name": "abacus game", "name_original": "abacus game", "description": "<p>You can do exercises of following calculations.<br/>Addition, Subtraction, Multiplication, Division,<br/>Flash addition, practice of abacus.<br/>This app is good for children, children can learn the basics of mathematics or A.I. technology. And It's also good for adults' reeducation too. Adults can brush up there calculation ability or it's useful for prevention of dementia or alzheimer's diseases.<br/>Furthermore, you can see some of basic principles of math<br/>with intuitive solid shapes. This will promote your understanding of math. </p>\n<p>It is said that the chimpanzee are smarter than humans in terms of short-term memories. Humans short-term memories have degenerated, as ability of language has developed. Young children who are not totally dependent on language may be able to exercise chimps-like ability. In this app, a memorization method using language is proposed to retain short term memories, but it's not as quick as visual memorization method. What do you think of it?</p>\n<p>File saving function has been added. You can copy, edit, or rename csv file with PC. Now, you can add your own PNG images to this abacus. Please design your unique images of numbers like examples. To do so, you need to tap the Files icon of iOS and the folder of abacus game.<br/>Duplicate the data_5.csv file and PNG_5 folder, rename them like data_8.csv and PNG_8. Then register another number and string you want to add to the data_8.csv file and put another PNG images corresponding to the number you've registered into the PNG_8 folder. Check the brain icon in the setting page of how to read numbers. You can see these images in the process of calculation of abacus.</p>\n<p>You can share your way of reading numbers with your children, friends, and the world. Your intelligence and wisdom would be helpful to the people in the world.</p>\n<p>Please enjoy calculation with abacus.</p>\n\n\n\n<p>Version 1.1.This license is copied below, and is also available with a FAQ at:<br/>http://scripts.sil.org/OFL</p>\n<p>-----------------------------------------------------------<br/>SIL OPEN FONT LICENSE Version 1.1 - 26 February 2007<br/>-----------------------------------------------------------</p>", "metacritic": null, "released": "2020-06-21", "tba": false, "updated": "2020-06-22T03:05:03", "background_image": "https://media.rawg.io/media/screenshots/670/67022a56877e0902e3e7c737cdda0190.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["abacus game developer"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}