{"id": 457210, "slug": "water-lily-inn", "name": "Water Lily Inn", "name_original": "Water Lily Inn", "description": "<p>Water Lily Inn is an accessible, sound-based puzzle game that is currently in development. We started the project for  AccessJam 2020, so for our submission we've uploaded a rough demo (which contains placeholder SFX)  and the opening cutscene (as a separate audio file). <br/></p>\n<p>Use left/right to turn and forward to walk through doors.<br/></p>\n<p>This game will be accessible to those who are visually impaired, providing auditory cues and narration to guide the user towards a goal. We will post updates over the next few weeks!<br/></p>\n<p>--</p>\n<p><strong>Summary:</strong></p>\n<p>You (the player) are the friend of an innkeeper in a fantastical corner of the world in the early 1900s. As the game starts, you’re just arriving at Water Lily Inn. Your friend Magnolia has been running the inn since before you can remember--it seems like her presence here is as constant as the magical world around it. Where you live, magic exists as well, but people use it to make work easier or just to entertain themselves. You use magic, but mostly just to keep your indoor, potted plants alive in the smog of the city.</p>\n<p>Through letters, you’ve told Magnolia how your neighbors and city friends have been casting spells to do laundry faster, or clean the house quickly, or instantly travel from home to work with a snap of their fingers. Magnolia has told you that her visitors work with magic in a different way--they help the plants grow, or guide rain to the fields so that the harvest will be bountiful. You’re fascinated by this use of magic, and you’ve decided to spend some time working at Water Lily Inn to experience different ways of using magic.</p>\n<p>To continue welcoming new and interesting guests into your friend’s home, there are some daily tasks you’ll need to complete. Every once in a while, there may be some extraordinary tasks, as you often have extraordinary visitors.</p>\n<p>--<br/></p>\n<p>Tori - Developer<br/>Twitter: @Toriously</p>\n<p>Mallorie Lesher - Sound Designer<br/>Twitter: @ratedM4mallorie<br/>mallorieleshermusic.myportfolio.com</p>\n<p>Patrick Fortier - Narrator/Voice Actor<br/>Twitter: @patrickrfortier</p>\n<p>--</p>\n<p>Placeholder SFX: <br/>- clock by InspectorJ<br/>- fireplace by jnelson871<br/></p>", "metacritic": null, "released": "2020-06-21", "tba": false, "updated": "2020-06-22T03:27:13", "background_image": "https://media.rawg.io/media/screenshots/629/6299c5a3bd6787ad66248a6c25827d0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mallorie Lesher"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}