{"id": 457290, "slug": "squirrel-battle", "name": "Squirrel Battle", "name_original": "Squirrel Battle", "description": "<p>This is a fun game. In the game, you need to help a cute little animal-squirrel grows up. The squirrel needs to avoid stones and eat chestnuts to grow, but the squirrel has a gun that can shoot and destroy Stones, because stones are your enemies, you need bullets to aim at the enemies and destroy them. In this fun game, the little squirrel will grow bigger after eating chestnuts. At the same time, as the level is upgraded, this casual puzzle The mini-game will automatically increase the difficulty, the speed of falling stones is getting faster and faster, the bullets are getting less and less, and the difficulty of evading is getting bigger and bigger. This game is suitable for you to spend a happy time while waiting in the cafe and waiting for people and stations Free time，Come download and play this game with your good friends.\r\n</p>\n\n<p>Ponit1: This is a cute squirrel. When faced with chestnuts falling from the sky, it must eat as much as possible. If you eat one chestnut, you will get one point, and it will help the little squirrel grow a little. Grow up slowly.\r\n  </p>\n<p>Ponit2: There are stones from the sky. The witty squirrel needs to quickly avoid the stones from the sky and eat the chestnuts, otherwise it will drop a drop of blood. A squirrel has only nine drops of blood.\r\n  </p>\n<p>Ponit3: Each squirrel has 25 bullets. These bullets can help it destroy a stone, but only 25 bullets.\r\n  </p>\n<p>Ponit4: Every 10 points, you can upgrade one level to enter the next level. The squirrel needs to go through the level continuously to grow up and win the final victory.\r\n  </p>\n<p>Ponit5: This is a game with no final limit. This game can be played forever and see how many points you can get\r\n  </p>\n<p>Ponit6: Squirrel Battle is not only fun, but also can exercise your reaction ability. It is a casual game suitable for most people.\r\n  </p>\n<p>Ponit7: The stone will continue to speed up with the increase of the level, you need to avoid it quickly, which requires the coordination of your left and right hands\r\n  </p>\n<p>Ponit8: The squirrel has a total of 3 lives. There are 3 drops of blood per day and a total of 9 drops of blood. The game is still difficult. You need to be smart and flexible enough.\r\n  </p>\n<p>Ponit9: If you want to end the game, you can click the menu button in the upper right corner, where you can choose to restart or exit the game.\r\n  </p>\n<p>Ponit10: This is somewhat similar to the plane war, but this game is more cute and the operation is more difficult, it is a challenging casual game\r\n  </p>\n<p>Ponit10: You can play with your friends to see who has a higher score and whose squirrel grows bigger.\r\n  </p>\n<p>Ponit11: This is a game that combines leisure, puzzle and shooting.\r\n  </p>\n<p>Ponit12: Remember that stones are enemies and chestnuts are friends. You can use a gun to shoot stones to protect the little squirrel.\r\n</p>", "metacritic": null, "released": "2020-06-21", "tba": false, "updated": "2020-06-22T03:44:10", "background_image": "https://media.rawg.io/media/screenshots/11d/11da288e49c2ff675a65ecfa138f68ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["donnyniu"], "genres": ["Action", "Shooter", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}