{"id": 457385, "slug": "my-countless-worlds-enchanted-cape", "name": "My Countless Worlds ~Enchanted Cape~ (itch)", "name_original": "My Countless Worlds ~Enchanted Cape~ (itch)", "description": "<p><strong>Enjoy a free demo of My Countless Worlds, an upcoming kinetic visual novel!<br/></strong></p>\n<p>WISHLIST ON STEAM | SUBSCRIBE ON TWITTER | CHAT IN DISCORD</p>\n<p><strong>STORY</strong></p>\n<p>After being homeschooled for a few years, Luka leaves the confines of his family mansion for the first time to attend an ordinary school. There he immediately gets an offer to join a goofy drama club and help one of its members, by the name of Alice, stage a play based on her script.<br/><br/>The fame-seeking girl draws ideas from a manuscript called \"My Countless Worlds\", which she had stumbled upon during one of her visits to the library. However, something hardly inspiring for an artist is hidden among the magical worlds. The last page contains a grim prophecy – in three years' time, on a hot day in July, Alice will die after falling from the viewing platform at the top of Enchanted Cape.<br/><br/>This is the first time Luka has seen the said manuscript, but after reading through it he can't help but notice how eerily similar the author's handwriting is to his own.</p>\n<p><strong>KEY FEATURES</strong></p>\n<ul><li>Top quality artwork</li><li>Pairings, lots of pairings! Juvenile romance, midlife crisis romance, even some not-exactly-human romance...</li><li>Costume drama! My Countless Worlds: Enchanted Cape is a perfect fit for those who can't resist a huge assortment of different clothes!</li><li>An unexpected turn of story in just a few chapters</li><li>Fanservice with a twist. Do you enjoy beach episodes where girls in bikinis play around and swim in the sea? Why not find out what it looked like a couple of centuries ago?</li></ul>", "metacritic": null, "released": "2020-06-20", "tba": false, "updated": "2020-06-22T04:07:32", "background_image": "https://media.rawg.io/media/screenshots/293/293c1164a26b3840233a88e7998c1e3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Narrative Nine"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}