{"id": 45730, "slug": "phantom-doctrine", "name": "Phantom Doctrine", "name_original": "Phantom Doctrine", "description": "<p>Set in 1983 during the Cold War, Phantom Doctrine is an alternate history thriller in which players lead The Cabal, a secret organization dedicated to fighting a global conspiracy committed to controlling the world by pitting world leaders and nations against one another.<br />\nThroughout secret missions, classified files investigations and enemy agent interrogations, peel off layers upon layers of a sinister plot and save the world from a somber future. If you can.Features<br />\nA rich alternate history plot anchored by historical events and characters, bringing the chillingly relevant Cold War reality to life from a unique point of view.<br />\nNext-generation turn-based combat: Unprecedented flexibility of movement and actions, variable overwatch modes and assault-oriented Breaching ability<br />\nExpanded battlefield: position assets around the world and call for assistance in the middle of battle when you need it most. Just remember, the enemy can bring their own reinforcements, heavy weapons or even air support and their toy box is much bigger than yours.<br />\nKnowing is half the battle: scout mission locations ahead of time, infiltrate with undercover operatives and improve your odds. Elite enemy agents with their own agenda are always ready to spring their own ambushes.<br />\nGo loud or go home (stealthily): fully-fledged stealth gameplay with silenced weapons, silent takedowns and cutting-edge Cold War era security technology. All this makes completing entire operations clandestinely a viable option.<br />\nRun your own counterintelligence organization: recruit subjects of top secret government experiments, operatives of the world’s secret services, KGB &amp; CIA included, or even criminals. Manage a global operation, securing weapons, resources and contacts. Command from a distance or go hands-on to fight for the real stakes.<br />\nActively pursue the truth: research cases, locations and individuals in Investigation Board gameplay mechanics to uncover new missions, resources and technologies.<br />\nEmploy technology ruthlessly to your advantage: learn from the enemy or research your own methods for brainwashing, interrogation, body engineering and chemical enhancement.<br />\nCustomize your operatives and then do it again once they need a new identity: forge documents, change appearance, retrain them for lethal effect and send them back into the fray.<br />\nReplayable, modular campaign with an array of mechanics to ensure unique and markedly different playthroughs: generated character names and backgrounds, modular and algorithmically populated maps, randomized intelligence snippets.<br />\nA highly replayable, story-driven campaign with meticulously designed and adaptable maps.<br />\nTwo stories to choose from: a KGB counterintelligence operative or a CIA wet work commando who have to come to grips with the truth and challenge the conspiracy, with an additional New Game Plus protagonist.<br />\nNo mission too big, no mission too small: enter a bustling government facility undercover to assassinate a target with surgical precision or mount a heavy frontal assault on an enemy staging base. With optional objectives closely linked to a mission’s complexity and opportunities like loot and intelligence to collect, there are decisions to be made at each step.</p>", "metacritic": 71, "released": "2018-08-13", "tba": false, "updated": "2024-03-08T23:09:44", "background_image": "https://media.rawg.io/media/games/a17/a176da07b6d4597b9ad950c559292092.jpg", "website": "http://www.creativeforge.pl/", "rating": 3.25, "rating_top": 4, "added_by_status": {"yet": 130, "owned": 1428, "beaten": 21, "toplay": 52, "dropped": 53, "playing": 11}, "playtime": 4, "achievements_count": 166, "ratings_count": 100, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 100, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC"], "developers": ["CreativeForge Games", "Creative Forge Games", "Gambitious"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["Forever Entertainment", "Good Shepherd Entertainment"], "esrb_rating": "Mature"}