{"id": 457491, "slug": "empathy-code", "name": "Empathy Code", "name_original": "Empathy Code", "description": "<p>Nuestro juego es un plataformas 2D que combina la acción y la estrategia. Se basa en unas mecánicas muy fluidas que permiten al jugador cambiarse de posición con aquello que toque con su arma. A través de unos niveles vertiginosos e ingeniosos el jugador deberá abrirse paso por la pirámide ancestral de Anubis hasta poder derrotar al Boss final. Los niveles constan de varias secciones repletas de puzzles, trampas, enemigos y obstáculos que el jugador deberá sortear, utilizando la creatividad para poder seguir avanzando. La estética 2D cartoon junto con animaciones pulidas y un gran set de sonidos te hará viajar hasta el mismísimo Egipto... 3.000 años en el futuro!</p>\n\n<p>Controles: <br/>-El jugador se mueve con \"awsd\" y para interactuar con los personajes, con la letra \"F\".<br/>-Con el click izquierdo, en el menú podremos acceder tanto al play para comenzar a jugar, al exit o la galeria y en el juego, puede atacar a corta distancia con su espada, infligiendo daño a los enemigos.<br/>-Con el click derecho se dispara una bala que sirve para seleccionar las mecánicas, no hace daño. </p>\n<p>Mecánicas: <br/>-con el botón 1 accedes a la primera mecánica, donde te intercambias con el primer objeto (intercambiable) que colisione la bala. <br/>-con el botón el 2, puedes seleccinonar 1 objeto, con el que dando al botón \"Space\" te podrás teletransportar a su posición<br/>-la tercera mecánica te permite seleccionar 2 objetos (o enemigos) y dando al bt´pn \"Space\" se intercambia la posición entre ellos.<br/>-Con la tecla \"r\", cada 10 segundos, podrás resetear las posiciones de todas las cajas y objetos interactuables (al morir también reaparecen).</p>\n<p>Equipo:</p>\n<p>David López (programador, diseñador)</p>\n<p>Sergi Pinto(artista, diseñador)</p>\n<p>Javier Sagalés(artista, programador)</p>\n<p>Gerard Galicia(artista, diseñador)</p>\n<p>Xavier Torrent ( programador)</p>", "metacritic": null, "released": "2020-06-19", "tba": false, "updated": "2020-06-22T04:30:13", "background_image": "https://media.rawg.io/media/screenshots/b24/b248ca05aea1832f282711eb6bbc4c14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lRikuZ"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}