{"id": 45745, "slug": "final-fantasy-xv-windows-edition", "name": "FINAL FANTASY XV WINDOWS EDITION", "name_original": "FINAL FANTASY XV WINDOWS EDITION", "description": "<p>Get ready to be at the centre of the ultimate fantasy adventure, now for Windows PC.<br />\nJoined by your closest friends on the roadtrip of a lifetime through a breathtaking open world, witness stunning landscapes and encounter larger-than-life beasts on your journey to reclaim your homeland from an unimaginable foe.<br />\nIn an action-packed battle system, channel the power of your ancestors to warp effortlessly through the air in thrilling combat, and together with your comrades, master the skills of weaponry, magic and team-based attacks.<br />\nNow realised with the power of cutting-edge technology for Windows PCs, including support for high-resolution displays and HDR10, the beautiful and carefully-crafted experience of FINAL FANTASY XV can be explored like never before.<br />\nKEY FEATURES:<br />\nEmbark On A Journey Without Limits.<br />\nTake the wheel and drive from the capital to the back roads, or venture out on foot to discover a vast landscape of teeming wildlife, dangerous caverns and living cities full of adventure.<br />\nMade For Windows PC Players.<br />\nSupporting high-resolution options and  compatible with native 4K (3840 x 2160) resolution and HDR 10. Graphical options can also be configured to support up to 8K. Thanks to NVIDIA, you can experience the beautiful and carefully-crafted world of Eos like never before.<br />\nBonus Content.<br />\nFINAL FANTASY XV WINDOWS EDITION boasts a wealth of bonus content, including content contained in free updates to the console versions as well as paid downloadable content originally available through the Season Pass. Players can also explore the world of Eos through Noctis&#39;s eyes in an all-new first-person mode.</p>", "metacritic": 81, "released": "2018-03-06", "tba": false, "updated": "2024-02-05T00:17:54", "background_image": "https://media.rawg.io/media/games/5bf/5bfd0687ade6e8b55ace9c7fbc0991ea.jpg", "website": "http://www.finalfantasyxv.com", "rating": 3.88, "rating_top": 4, "added_by_status": {"yet": 119, "owned": 1467, "beaten": 196, "toplay": 65, "dropped": 72, "playing": 37}, "playtime": 9, "achievements_count": 56, "ratings_count": 296, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 304, "platforms": ["PC"], "developers": ["Square Enix"], "genres": ["RPG"], "publishers": ["Square Enix"], "esrb_rating": "Teen"}