{"id": 45767, "slug": "humankind-the-awakening", "name": "HumanKind: The Awakening", "name_original": "HumanKind: The Awakening", "description": "HumanKind: The Awakening<br/>\n<br/>\r\nEnter the battle between four factions fighting to control the future of humanity. In HumanKind: The Awakening you can choose your allies and fight for your ideals in an epic combat through different competitive and highly advanced game modes with hundreds of cards at your disposal.<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n== High Level Multiplayer ==<br/>\n<br/>\r\nHK: The Awakening offers a variety of multiplayer modes to test your skills and those of your friends. Choose from casual, competitive, tournaments or leagues, and defend your faction through intense battles.<br/>\n<br/>\r\n== Customize your deck ==<br/>\n<br/>\r\nPower the characteristics of your chosen faction to the maximum through a deck creator that allows you to take advantage of the creativity factor classic of trading card games. Combine different cards to create a perfect formula to wipe out your opponent.<br/>\n<br/>\r\n== Leagues and Events ==<br/>\n<br/>\r\nWhether from your PC at home or your mobile device, you can be part of the Leagues and Events we organize for the community at any time, in which you can win interesting rewards to boost your game skills.<br/>\n<br/>\r\n==Trading Cards Marketplace==<br/>\n<br/>\r\n¿Cards to spare or do you want to improve your deck with some that did not appear in your booster packs? Visit the trading cards marketplace to trade with other players and create the deck you always wanted.<br/>\n<br/>\r\n== Dynamic Community ==<br/>\n<br/>\r\nWe have a community that will make you feel at ease and whether you are an expert or just a novice. Follow our social networks or join our Discord channel to fully enter our world.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:17", "background_image": "https://media.rawg.io/media/screenshots/e1c/e1c7e3af23d25b071c4487527ca24dfa.jpg", "website": "https://playhumankind.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 46, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Jalomot Ltda.", "Dark Polygon Ltda."], "genres": ["Strategy"], "publishers": ["Dark Polygon Ltda."], "esrb_rating": null}