{"id": 457756, "slug": "tails-skypatrol", "name": "Tail's Skypatrol", "name_original": "Tail's Skypatrol", "description": "<p>Tails&#39; Skypatrol es un videojuego desarrollado por SIMS y JSH, y distribuido por SEGA en el segundo trimestre del año 1995 para el sistema de entretenimiento informático SEGA Game Gear, pero sólo para Japón. . Se puede disfrutar en Europa gracias a Sonic Adventure DX y Sonic Gems Collection, ambos de SEGA.</p>\n<p>&#39;Tails&#39; Skypatrol&#39; (テイルスのスカイパトロール) is a Sonic the Hedgehog spin-off based around one of the series&#39; popular sidekicks, Tails, which the game is incidentally centered around. Despite not being released out of Japan directly (1995), it was featured outside the region as a bonus game in the &#39;Sonic Gems Collection&#39;- a GameCube title including many other entries.</p>\n<p>Bearing both strategy and shooter qualities, Tails&#39; Skypatrol is not quite the traditional platformer. There are no Rings to collect (commonly known to reward extra lives), which instead is a projectile that Tails throws to garner points and extra lives. A new noticeable mechanic is the Flight Meter, which slowly drains as the stages pile on. In order to keep this meter filled and soaring, Tails can find Mint Candy- his favourite treat- scattered across areas to refill his energy. Keep Tails wound up to the very end, and push back fleets of enemies and massive bosses to win!</p>", "metacritic": null, "released": "1995-04-28", "tba": false, "updated": "2022-05-10T02:25:29", "background_image": "https://media.rawg.io/media/screenshots/1e4/1e4a24eb7acc8e8b97a5646dbad6710f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 4, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 63, "reviews_count": 1, "platforms": ["GameCube", "Game Gear", "PlayStation 2"], "developers": [], "genres": ["Shooter", "Strategy", "Platformer"], "publishers": ["SEGA"], "esrb_rating": "Everyone"}