{"id": 457728, "slug": "suicide-squad-kill-the-justice-league", "name": "Suicide Squad: Kill The Justice League", "name_original": "Suicide Squad: Kill The Justice League", "description": "<p>Jump into Suicide Squad: Kill the Justice League, the genre-defying, action-adventure third-person shooter in development from Rocksteady Studios, creators of the critically acclaimed Batman: Arkham series. This title combines the studio&#39;s signature character-driven story gameplay with third-person shooter action to deliver a gaming experience unlike any other.</p>\n<p>Discover the origins of Amanda Waller&#39;s infamous Task Force X (a.k.a. the Suicide Squad) as Harley Quinn, Deadshot, Captain Boomerang and King Shark begrudgingly embark on their mission to take down the World&#39;s Greatest DC Super Heroes, The Justice League. Featuring an original narrative set within an expansive open-world city of Metropolis, Suicide Squad: Kill the Justice League puts the four DC Super-Villains on a collision course with an invading alien force and DC Super Heroes who are now laser-focused on destroying the city they once vowed to protect. All the while, the Suicide Squad must be mindful of the lethal explosives implanted in their heads that could go off at the first sign of defiance.</p>\n<p>Each squad member has their own unique moveset with enhanced traversal abilities to freely explore the dynamic open-world of Metropolis, along with a variety of weapons to customize, and skills to master. Fans can tailor their experience, whether playing on their own as a single-player, or teaming up with friends in multiplayer co-op.</p>", "metacritic": null, "released": "2024-02-02", "tba": false, "updated": "2024-04-09T00:37:56", "background_image": "https://media.rawg.io/media/games/eac/eac17db790a988f47e5700d176497694.jpg", "website": "https://www.suicidesquadgame.com", "rating": 1.87, "rating_top": 1, "added_by_status": {"yet": 47, "owned": 55, "beaten": 10, "toplay": 263, "dropped": 8, "playing": 3}, "playtime": 18, "achievements_count": 42, "ratings_count": 51, "suggestions_count": 557, "game_series_count": 0, "reviews_count": 52, "platforms": ["PC", "Xbox Series S/X", "PlayStation 5"], "developers": ["Rocksteady Studios"], "genres": ["Action"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Adults Only"}