{"id": 45781, "slug": "triple-otakus-puzzle", "name": "Triple Otakus Puzzle", "name_original": "Triple Otakus Puzzle", "description": "Introduction:Triple otakus puzzle is Japanese Ecchi style puzzle game project. It contains different puzzle games where used images include sexual anime and etchi style contentFeatures:<br/><strong>- 3 GAMEMODES</strong>Match 3 Etchi Puzzle:<br/>- 8 levels where target to arrange  and match 3 or more of the same tile to succeed. You get points and stars. 3 Stars in level are maximum if you achieve target score. In every level there are 15 moves to use and some levels are easy some hardMemory etchi puzzle:<br/>There is 4 different levels: 8,12,16 and 20 cards containing levels<br/>If the cards turned face up are the same (a pair) you win and the pair disappears from the game otherwise the cards are automatically turned face down and you need to make a new try. After the game you get result. Poor is one star and excellent is 3 stars. Card images contain some nudityJigsaw etchi puzzle:<br/>contain jigsaws which theme are etchi images. There are number of images that you can choose (3 for now)<br/>There are 6 different puzzle sizes. More smaller pieces , more difficult it is. While playing you can also watch that which kind fully solved jigsaw isPLANNED FEATURES:Achievements<br/><br/>More levels to Match3 etchi puzzle<br/><br/>More images to Jigsaw etchi puzzle<br/><br/>Possible trading cards", "metacritic": null, "released": "2017-09-04", "tba": false, "updated": "2019-09-17T13:43:36", "background_image": "https://media.rawg.io/media/screenshots/61d/61df56bab9cba5c65d60481e2e763bd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 97, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Tero Lunkka"], "genres": ["Casual", "Indie"], "publishers": ["Tero Lunkka"], "esrb_rating": null}