{"id": 45796, "slug": "neofeud", "name": "Neofeud", "name_original": "Neofeud", "description": "Neofeud is a Dystopic Cyberpunk adventure game in the vein of Blade Runner, but with an overlay of Game of Thrones-like political intrigue, and 1366x768, hand-painted, stylized visuals. <br/><br/><strong>Synopsis:</strong><br/><br/>2033 - We create AI. Sentient robots arrive, but not as our Terminator overlords or our Singularity saviors -- conscious machines are humanity's unwanted bastard children. A few are geniuses who design flying cars, beat cancer, invent teleportation, but millions of defective prototypes roll out of factories -- mentally challenged, motivationally-challenged, criminally-inclined. Legally conscious, but unhirable, these \"Defectives\" are shuffled through public housing and welfare assistance, straining the already overburdened back of the meager social safety net. The robots who don't end up in prison are dumped, as a last resort, into a massive landfill known as \"The Pile\".<br/><br/>Humans engage in perfection of their species -- or at least the powerful and well-connected -- genetically engineering children with human and animal DNA. The failed eugenics experiment \"Frankenpeople\" are discarded into \"The Pile\" as well. The new dynasties, 'Neofeudal Lords', live in towering neon glass castles, shuttle around in pristine nanotech-enabled pods, minds and bodies full of cyberware, spending most of their time taking selfies and \"optimizing their monetization schemes\". A race of supermen concerned only with their own status, their prestige, their success. Where machines have become all too flawed and human, people have become flawless, perfect, cold machines.<br/><br/>Karl Carbon is an ex-cop, dishonorably discharged from Coastlandia PD for disobeying an order to shoot an unarmed sentient humanoid. Karl is exiled to \"The Pile\" as a lowly social worker. There he counsels gangbanging foster-kid robots and confiscates chimera-children from deadbeat half-wolf parents. Till one day a case goes horribly sideways and Karl is drawn into a sordid conspiracy that could threaten the strained fabric of Human-Robot-Hybrid civilization -- or save it.<br/><br/><strong>FEATURES</strong><br/>-15+ hours of gameplay.<br/>-An original dystopic sci-fi world and story that will (hopefully) make you question some of your core beliefs. Or at least my sanity<br/>-Tricky yet satisfying, point-n-click detective work, interspersed with tense action shootouts.<br/>-Handpainted, uber-gritty, noir futureland. Makes Mad Max and Rick Deckard crap their pants.<br/>-Endless bombardment of witty one-liners from hardboiled cyberpunk.<br/><br/><strong>PRICE</strong> - $14.99", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-08-28T22:05:07", "background_image": "https://media.rawg.io/media/screenshots/a2b/a2b797c0c656201d7e963dff48980f33.jpg", "website": "http://silverspookgames.blogspot.com/p/home.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 47, "toplay": 1}, "playtime": 2, "achievements_count": 37, "ratings_count": 0, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silver Spook Games"], "genres": ["Adventure", "Indie"], "publishers": ["Silver Spook Games"], "esrb_rating": null}