{"id": 457951, "slug": "tappy-taptic-fidgeter", "name": "Tappy - Taptic Fidgeter", "name_original": "Tappy - Taptic Fidgeter", "description": "Welcome to Tappy!<br/><br/>Tappy is a fidgeting app designed to help you reduce stress and anxiety in a fun and satisfying way! As you tap, not only will you enjoy an incredible haptic response, you'll notice that your count increases as well! This will be important for unlocking features. In settings there are multiple locked features. Press these locks to see how many taps you need to unlock it! More features will be added in the future so if you already surpass the tap count it'll be automatically unlocked for you! <br/><br/>There is also a second part to Tappy! This part is created to give you some pointers on how to reduce stress more effectively. Tap on these to view a short descriptions of each method. More will be added as time passes!<br/><br/>Tappy:<br/>• Tap on Tappy to boost your count!<br/>• Change the haptic feedback type by pressing settings.<br/><br/>Pop Bubbles:<br/>• Tap each bubble to pop!<br/>• Change the haptic feedback type by pressing settings.<br/>• To Reset, tap the reset button in the top right<br/>• Pops don't increase your tap count, so to unlock new haptic feedback options, you must do so in the Tappy view!<br/><br/>Taptics (Haptics):<br/>• There are three Taptic variants given as you being the app.<br/>• Unlock more by taping more!<br/><br/>Face:<br/>• Unlock Tappy's happy custom face by reaching 1000 taps!<br/>• At 1000 taps you will be able to either add Tappy's face or remove him.<br/><br/><br/>Once unlock any new option you'll get an alert.<br/><br/>More features (Such as colors!) coming soon so get tapping!<br/><br/>Website:<br/>• tappyapp.weebly.com<br/><br/>*Requires iPhone with a Taptic Engine*", "metacritic": null, "released": "2019-12-26", "tba": false, "updated": "2020-06-26T02:38:39", "background_image": "https://media.rawg.io/media/screenshots/953/953725c80baaa28cc79e6dd4a88e7c86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cameron Nazemi"], "genres": ["Casual"], "publishers": ["Cameron Nazemi"], "esrb_rating": "Everyone 10+"}