{"id": 45807, "slug": "curvy", "name": "Curvy", "name_original": "Curvy", "description": "Curvy is a minimalist <strong>puzzle</strong> game using tokens with curved drawings. This tokens are hexagonal, but this can't be appreciated with the naked eye. You have to turn the table tokens to form beautiful figures.<br/><br/>It has 8 levels, with growing difficulty and size, with 30 boards in each level. In total: 240 boards that will assure you hours of fun.<br/><br/>Each level must be opened playing an important part of the boards of the previous level. But then you can play each board of the level in any order you prefer.<br/><br/>You can stop playing anytime you need without worries, because Curvy will remember the status of the board you are playing. So you can continue the game at the same point you stopped.<br/><br/>You can play full screen, or in resizeable window. Also you can change the size of the game board with the gear of the mouse, and slide it with the two buttons of the mouse at the same time.<br/><br/>It has minimalist sound effects to accompany you while playing the game. The sound depends of the token type you turn.<br/><br/>You can ask for clues to know the correct orientation of a concrete token. But don't do it too much! The clue system delays some time in providing you with the possibility of a new clue.<br/><br/>You can toggle a grid with the hexagonal tokens if you feel more comfortable this way: this is easier to solve the boards, but less challenging. You choose!", "metacritic": null, "released": "2017-09-15", "tba": false, "updated": "2019-08-28T22:05:07", "background_image": "https://media.rawg.io/media/screenshots/c18/c18a012dec4658030042aafc93ff2ae3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 4, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LoopGames"], "genres": ["Casual", "Indie"], "publishers": ["LoopGames"], "esrb_rating": null}