{"id": 458212, "slug": "greedy-quickfingers", "name": "Greedy Quickfingers", "name_original": "Greedy Quickfingers", "description": "Navigation / Navegación\r\n<ul><li>English<ul><li>Introduction</li><li>Installation process</li><li>Uninstallation process</li><li>Developer's notes</li></ul></li><li>Español<ul><li>Introducción</li><li>Proceso de instalación</li><li>Proceso de desinstalación</li><li>Notas de la desarrolladora</li></ul></li></ul>\r\nEnglish\r\nIntroduction\r\n<p>In Greedy Quickfingers you play as a famous thief, lurking in the shadows and ready to grab every single treasure at your reach. But be careful, every house has some sort of security, even the seemingly abandoned ones! You must be stealthy, wait for the perfect opportunity to grab that golden bunny statue and run far away before the guards catch you!</p>\n<p>You can interact with elements from each scene, ranging from simple doors, sturdy tables; as well as switches that can turn on/off security cameras and light sources, open or close heavy doors with no handle; and don't forget to hide behind bulky furniture that doesn't seem to have any other use!</p>\n<p>You can repeat every level as many times as you want for the sake of getting that sweet treasure or reduce the time it took you, the choice is yours! To check all your scores, you only have to head to the Options menu inside the Main screen and go to the Extras section where there's a button that says \"Saved Scores\", by pressing said button you will see a nice little table you can use to order your scores by a particular field, or delete those you didn't like. Or even delete them all!</p>\n<p>If you don't own a mouse, don't worry! You can access every menu with the keyboard, make sure to check the controls inside the Options menu (the third button right after opening the game).</p>\r\nInstallation process\r\n<p>The game does not require to be installed, you just have to unpack the compressed zip file in any folder you wish. Make sure to keep the three files inside together: the executable, the packed resources and the dll library that comes along. Just open the executable and happy stealing!</p>\r\nUninstallation process\r\n<p>Although the game does not have an installation process, it does save data from the first time it opens in your computer to store your volume and language configuration if you so wish and all your scores. If once you are done playing you don't feel like keeping any stray files from the game you can click on the button in the Extras section inside the Options Menu called \"Clear All Data\". This will delete all files stored by the game and the folder where they are stored as well. The game will close afterwards and you will have to delete the game files you unpacked to play manually. And that's it!</p>\n<p>The \"uninstalling\" process could fail maybe because another program has that folder in particular open. If that's the case the game will close regardless since there could be a problem with the files. Once you ensure that no other program is interfering, just launch the game again and press that button. It should work this time.</p>\r\nDeveloper's notes\r\n<p>Greedy Quickfingers is a school project made in several weeks. It's the first game I actually make available to the public that's not a visual novel or an interactive story. It's also the first time I make a game with the game engine Godot. I'm quite proud of the result even though it had its ups and downs, and there are a few things I could have made better. I've learned quite a lot and I hope you enjoy it.</p>\n<p>If you want to contact me, you can do so either through itch, Twitter or on Discord.</p>\r\nEspañol\r\nIntroducción\r\n<p>En Avaricioso Dedosrápidos te metes en el papel de un ladrón famoso, acechando en las sombras y listo para agarrar todos y cada uno de los tesoros a tu alcance. Pero ten cuidado, toda casa tiene algún tipo de seguridad, ¡incluso las que aparentan estar abandonadas! Debes ser sigiloso, esperar por la oportunidad perfecta para agarrar esa estatua de un conejo dorado y, ¡salir corriendo muy lejos antes de que los guardias te atrapen!</p>\n<p>Puedes interactuar con elementos de cada escenario, desde simples puertas, robustas mesas; además de interruptores que pueden activar/desactivar cámaras de seguridad y fuentes de luz, abrir o cerrar pesadas puertas sin manillar; ¡y no te olvides de esconderte detrás de grandes muebles que no parecen tener otro uso!</p>\n<p>Puedes repetir cada nivel tantas veces como quieras sea por obtener ese dulce tesoro o para reducir el tiempo que te llevó obtenerlo, ¡la decisión es tuya! Para comprobar tus puntuaciones, solo debes dirigirte al menú de Opciones dentro de la pantalla principal e ir a la sección de Extras donde hay un botón que dice \"Puntuaciones Guardadas\", al pulsar dicho botón verás una pequeña y bonita tabla que podrás usar para ordenar tus puntuaciones por un campo concreto, o borrar aquellos que no te gusten. ¡O incluso borrarlos todos!</p>\n<p>Si no dispones de un ratón, ¡no te preocupes! Puedes acceder a todos los menús con el teclado, asegúrate de comprobar los controles dentro del menú de Opciones (el tercer botón justo tras abrir el juego).</p>\r\nProceso de instalación\r\n<p>El juego no necesita ser instalado, solo tienes que descomprimir el archivo zip en cualquier carpeta que te guste. Asegúrate de mantener los tres archivos juntos: el ejecutable, los recursos empaquetados y la librería dll que va con ellos. ¡Solo abre el ejecutable y felices robos!</p>\r\nProceso de desinstalación\r\n<p>Aunque el juego no tenga un proceso de instalación, si que guarda datos desde el primer momento en que se abre en tu ordenador para almacenar tu configuración de volumen e idioma si deseas y todas tus puntuaciones Si cuando has terminado de jugar sientes que no quieres tener archivos perdidos del juego puedes hacer click en el botón de la sección Extras dentro del menú de Opciones llamado \"Borrar todos los datos\". Esto borrará todos los archivos almacenados por el juego y la carpeta donde se encuentran. El juego se cerrará después y tendrás que borrar los archivos del juego que descomprimiste manualmente. ¡Y eso es todo!</p>\n<p>El proceso de \"desinstalación\" puede fallar posiblemente porque otro programa tenga su carpeta en particular abierta. Si ese es el caso el juego se cerrará de todos modos ya que puede que haya un problema con los archivos. Cuando te asegures de que no hay ningún otro programa interfiriendo, simplemente lanza el juego otra vez y pulsa en el botón de borrado de nuevo. Debería funcionar esta vez.</p>\r\nNotas de la desarrolladora\r\n<p>Avaricioso Dedosrápidos es un proyecto de clase hecho en varias semanas. Es el primer juego que pongo disponible al público que no es una novela visual o una historia interactiva. También es la primera vez que hago un juego con el motor de juegos Godot. Estoy bastante orgullosa del resultado aunque ha tenido sus momentos buenos y malos, y hay algunas cosas que podría haber hecho mejor. ¡He aprendido mucho y espero que lo disfrutes!</p>\n<p>Si quieres contactarme, puedes hacerlo a través de itch, Twitter o Discord.</p>", "metacritic": null, "released": "2020-06-25", "tba": false, "updated": "2020-06-26T03:52:32", "background_image": "https://media.rawg.io/media/screenshots/8a5/8a58c8153f53012b552b3063a81df643.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Sthelen"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}