{"id": 458225, "slug": "waves-of-emotion", "name": "Waves of Emotion", "name_original": "Waves of Emotion", "description": "<p>What a beautiful life turned dark. Hope turned into despair. Green to grey. There is no way out, only further and further down because nobody knows and you are alone. Waves have come to bring you down and there is nothing you can do to stop them.</p>\n<p>Unless you are aware. Unless others are aware. Unless people try to help. But in this case, there is none of that.</p>\n<p><strong>GAMEPLAY</strong></p>\n<p>Gameplay involves the right and left arrow keys, which are used to move the player right and left respectively, and the player will always move downwards with every move left or right if they have not encountered an object.</p>\n<p>There are a few objects to look out for. The triangles provide a surface for the player to move against, the only way the player is ever going to move upwards. The red squares are to be avoided and will force the player to restart the level upon contact. The pink circle allows the player to advance to the next level of their spiral downwards...</p>\n<p>WHY?</p>\n<p>This game was created as a programming assignment for university applications. While technically meant to simply be a programming assignment that shows some level of skill and understanding, I decided to try and create an experience with a simple design. In the end, as my first 2D game and my largest solo game project, I am very proud of how this turned out. I will still add more things to the game, perhaps more levels, some small design changes and some music, definitely music. Especially now that I am freed from the restraints of creating a game for some examiners in a university under a deadline, I'm able to work on improving the experience.</p>\n<p><strong>CREDIT</strong></p>\n<p>Goes to AppalArts on Deviantart for making the thumbnail for me, thank you very much for your help and support during the entire process of making the game!</p>", "metacritic": null, "released": "2020-06-25", "tba": false, "updated": "2020-06-26T03:55:46", "background_image": "https://media.rawg.io/media/screenshots/4f1/4f1618602adf13041ecc5c560b38ce1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Janblu Poggio"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}