{"id": 458264, "slug": "speechless-rpg-m-learn-japanese", "name": "Speechless RPG M: Learn Japanese", "name_original": "Speechless RPG M: Learn Japanese", "description": "<p><strong>This Current Prototype</strong> <br/><br/>The current file is a quick and simple idea for a battle system to be used in a language learning RPG. I plan to make some major improvements to this and develop games out of it.<br/><br/><br/><strong>Gameplay</strong></p>\n<p>Developed for mobile in mind, this JRPG will feature a familiar side view battle system, a fun story to play through and an interesting world to explore.  The player will complete quests inspired by Japanese folklore and use knowledge of Japanese to defeat their enemies and save the land. The battle system will contain flash cards and micro games that help you defeat your enemies when you complete them successfully. The game will dynamically determine your proficiency and add or remove material based on your knowledge level.<br/><br/><br/><strong>Story</strong></p>\n<p>Heroes from the far west have come traveling to distant lands in search of new adventures. They arrive in a strange country in turmoil. Monsters are invading and sapping away the local peoples' ability to communicate. The heroes must learn the native language of this land and use it against the monsters to counter their hunger. If they fail, these monsters will devour all knowledge of language around the world, leaving humanity in chaos. <br/><br/><br/><strong>Some Background</strong> </p>\n<p>I've had an idea in my head for about two decades of a full SNES style JRPG that teaches you a language as you play it. The additive, rewarding nature of RPGs combined with educational material has limitless potential. A couple of others have made games with a similar idea but nothing of any major quality in my opinion. I eventually produced a simple prototype of a battle system to show off a concept of my idea. I plan to take this prototype and develop it into a full fledged JRPG eventually. However, that is a major project. To keep things more simple,  I will start off with a light, mobile style RPG to help ensure that a project gets finished. Once I have a completed game with the concept more fully developed, I will move on to the full JRPG project. For now, I'm using games like Knights of Pen &amp; Paper as inspiration on how to create a fun mobile RPG project that isn't overwhelmingly large in scope. I hope that if anyone is interested in the project that they will provide input and ideas.</p>", "metacritic": null, "released": "2020-06-25", "tba": false, "updated": "2020-06-26T04:06:24", "background_image": "https://media.rawg.io/media/screenshots/d1c/d1ce1f5b1508a3e321cbf3d1aeb6197c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ByteKnight"], "genres": ["RPG", "Educational"], "publishers": [], "esrb_rating": null}