{"id": 458315, "slug": "prodigal-son", "name": "prodigal son", "name_original": "prodigal son", "description": "<p>Made for Steam VR</p>\n\n<p>Doing a 'too close' reading of Rembrandt's <em>Prodigal Son</em> , I cropped, enlarged, and blurred several sections of the painting. In the VR environment these images expand to the size of a mural and shrink to the size of of a small icon against a changing, solid-colored background and a soundtrack of organ tones. <br/></p>\n\n\n<p>\"With those tight close-ups imposing a scrutiny of Brandon and Philip as intimate and intense as their own of each other, and putting men who stand too close to one another too near us as well, Hitchcock's camera deliberately awakens the paranoid suspicion that, where homosexuality is concerned, the sense of sight no longer operates at or by a distance, and the object beheld may penetrate, capture, and overwhelm the beholder's body consciousness like a smell, say the rankness of a body in heat (Janet to Brandon: \"<em>You</em> smell dreamy\") or the fetor of a cold decomposing cadaver. No less busily than <em>Rope</em> excites a desire to see, it inspires a fear of seeing: the object of voyeuristic desire is precisely what must not catch the eye.\"</p>\n<p>-D.A. Miller, \"Anal <em>Rope</em>\"</p>\n\n<p>\"The main group of the father and the Prodigal Son stands out in light against an enormous dark surface. Particularly vivid are the ragged garment of the son, and the old man's sleeves, which are ochre tinged with golden olive; the ochre colour combined with an intense scarlet red in the father's cloak forms an unforgettable colouristic harmony. The observer is roused to a feeling of some extraordinary event. The son, ruined and repellent, with his bald head and the appearance of an outcast, returns to his father's house after long wanderings and many vicissitudes. He has wasted his heritage in foreign lands and has sunk to the condition of a swineherd. His old father, dressed in rich garments, as are the assistant figures, has hurried to meet him before the door and receives the long-lost son with the utmost fatherly love.<br/>The occurrence is devoid of any momentary violent emotion, but is raised to a solemn calm that lends to the figures some of the qualities of statues and gives the emotions of a lasting character, no longer subject to the changes of time. Unforgettable is the image of the repentant sinner leaning against his father's breast and the old father bending over his son. The father's features tell of a goodness sublime and august; so do his outstretched hands, not free from the stiffness of old age. The whole represents a symbol of all homecoming, of the darkness of human existence illuminated by tenderness, of weary and sinful mankind taking refuge in the shelter of God's mercy.\"</p>\n<p>-Rembrandt's  Prodigal Son<br/></p>", "metacritic": null, "released": "2020-06-24", "tba": false, "updated": "2020-06-26T04:20:53", "background_image": "https://media.rawg.io/media/screenshots/89f/89f37a39964531b03d89a3e2ae09c1b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sutopat"], "genres": [], "publishers": [], "esrb_rating": null}