{"id": 458360, "slug": "rock-paper-scissors-russian-rules", "name": "Rock Paper Scissors - Russian Rules", "name_original": "Rock Paper Scissors - Russian Rules", "description": "<p>Rock Paper Scissors - <strong><em>Russian Rules</em></strong></p>\n<p>Rock beats scissors. Paper beats rock. Scissors beats paper.<em> Loser gets shot.</em></p>\n<p>Making your way through all three rounds is going to take more than luck.</p>\n<p>12 hours ago you were in a room with all your opponents. Learn everything you can about them to work out if they're rock, paper or scissor people</p>\n<p>~ Controls ~</p>\n<p>Use the left and right buttons to see what everyone has to say. Once you think you know everything, hold circle ([Z] on keyboard) to start the tournament.</p>\n<p>For each of the three rounds, use left and right to choose your move, and then press circle ([Z]) to play the round. Rock beats scissors. Paper beats rock. Scissors beats paper.</p>\n<p>~ Hints ~</p>\n<p>Highlight the \"invisible\" text below to get some hints, if you need them :)<br/></p>\n<p>You should be able to work what job a lot of people do, which will give you a hint for whether they spend a lot of time with rocks, paper or scissors.</p><p>Don't worry about Geoff. You saw him die in the introduction.<br/></p><p>Use the descriptions (t-shirt colour, gender, etc.) that people give to narrow others down.<br/></p><p>You might think a Mayor does a lot of paper work, but what has she been doing all day?</p><p>There's only a few guys in blue, and one of them doesn't sound depressed.</p><p>Shh... Being a librarian sure is a quiet job.<br/></p><p>New girlfriend? And to think, someone else just lost one.</p><p>Tailors are forever using scissors, and always do the best t-shirt logos. It should be easy to spot who's wearing the same ones. <br/></p><p>Would you give your ex-girlfriend's new partner a paper boat?</p><p>Don't ask me how, but rock, paper and scissors are equally represented.<br/></p>", "metacritic": null, "released": "2020-06-24", "tba": false, "updated": "2020-06-26T04:33:14", "background_image": "https://media.rawg.io/media/screenshots/1f9/1f9965bf383f26a0ae7c4dd117a9385f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thomasmichaelwallace"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}