{"id": 45832, "slug": "spacemerc", "name": "SpaceMerc", "name_original": "SpaceMerc", "description": "SpaceMerc is a casual narrative bullet hell shooter about one pilot's quest to get paid by blowing stuff up. There's also an intergalactic war or something going on too. Join Cloud \"Richard\" Stryker on his quest to win ac war he has no stake or interest in and save the side he just happens to reside in. More importantly, join him in his effort to gain financial security.<br/><br/>Oh, and blow stuff up in space. A lot. Blow up all the stuff.<br/><br/>Containing 30 levels and 36 weapons, there's plenty of ways to blow up all the stuff. Try out such realistic weapons as the electric gatling gun, laser turrets, and the antimatter bomb. Then try out slightly less realistic weapons like the annihilation ray, the lightning cannon, and the distortion flail.<br/><br/>Meet strange species of pilot with unpronounceable names and have totally mundane banter. Then destroy them.  Listen to military personnel talk vaguely about politics and ethics.  ...Or don't.  The skip button is right there.<br/><br/>Want to play bullet hell shmups but can't handle the steep difficulty of conventional games in the genre? Just play through this game and give yourself much more time to get better.Features<ul><li>7 difficulty modes plus a separate difficulty modifier, spanning from \"When am I going to have to try?\" all the way to \"Are humans physically capable of this?\"</li><li>Resolution options ranging from 640x480 to 3200x2400, all at 60 fps</li><li>1/2 speed mode, for players who don't like fast-paced games as much</li><li>Keyboard, keyboard with mouse, and controller, all supported equally</li></ul>", "metacritic": null, "released": "2017-09-06", "tba": false, "updated": "2019-08-28T22:05:06", "background_image": "https://media.rawg.io/media/screenshots/720/7205454193a268a472ea62ddbb7da018.jpg", "website": "https://www.humblebundle.com/g/spacemerc", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Colin EUMP"], "genres": ["Action", "Indie"], "publishers": ["Colin EUMP"], "esrb_rating": null}