{"id": 45843, "slug": "monster-of-the-deep-final-fantasy-xv", "name": "MONSTER OF THE DEEP: FINAL FANTASY XV", "name_original": "MONSTER OF THE DEEP: FINAL FANTASY XV", "description": "'The acclaimed fishing feature of FINAL FANTASY XV has been revamped and revitalized for PlayStation®VR.  Join Noctis, Ignis, Prompto, Gladio, and other familiar faces in a picturesque virtual reality backdrop en route to a thrilling encounter with the menace that lurks in the depths.<br/><br/>Dive into the story mode for an exhilarating, action-packed showdown with the notorious Monster of the Deep, or take in the sights, sounds, and scenery of FINAL FANTASY XV as you kick back and cast off in the free fishing mode. Bounties and tournaments offer fresh new challenges as you customize your rods, reels, and lures to catch the big one!<br/><br/>1 player<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>FINAL FANTASY, SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd. All other trademarks are the property of their respective owners.", "metacritic": null, "released": "2017-12-31", "tba": false, "updated": "2019-09-12T06:40:56", "background_image": "https://media.rawg.io/media/screenshots/cee/ceee53559c92bbacb4e47089bf5a06b4.jpg", "website": "", "rating": 2.17, "rating_top": 1, "added_by_status": {"owned": 19, "beaten": 2, "dropped": 7, "playing": 2}, "playtime": 0, "achievements_count": 72, "ratings_count": 6, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 4"], "developers": ["Square Enix"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}