{"id": 458556, "slug": "learning-about-motherboards", "name": "Learning About Motherboards", "name_original": "Learning About Motherboards", "description": "<p>This FREEWARE application covers the diagrams of three common motherboard form-factors: ATX, Micro-ATX, and Mini-ITX.  It also covers the definition of 48 terms associated with the structure and functioning of the motherboard. The main part of the application consists of five screens; three labeled diagrams and two screens of terminology. The diagram screens present a picture of a motherboard with the labels covered by red dots. The name of a label appears on the screen and the user must identify the correct dot. There is a \"Hint\" button which will reveal the correct answer. The score and use of the hint button are tracked and presented on a \"Report Screen\" at the end of the application. The terminology screens show a set of terms and a definition appears on the screen. The user must select the best correct matching term.<br/>              All five screens have a \"Study\" button.  Selecting the \"Study\" button on the motherboard image screens will turn off scoring and reveal all the labels. The user cannot play, but he can study the diagram.  Knowledgeable users can do a screen capture and print the screen. Selecting the \"Study\" button on the terminology screen will let the user play the game with no score being recorded. The user can select the \"Hint\" button to reveal the answer after trying to recall it. Selecting the study message will resume the level from the beginning.<br/>    There is also a list of all the terms used in the application. It can be viewed and studied. A knowledgeable user can select the entire file, copy it to the clipboard, and paste it into a word processor to email or print.<br/>            This application is TOTAL FREEWARE.  This means it is free with no advertising, no collection of any personal data of any kind, no internet access, and no registration.  It can be used in an environment which has no local network.<br/> This program should run okay on Linux distros using PlayOnLinux.<br/>             Visit https://sites.google.com/view/rtcgames/home or https://rtcgames.itch.io/ for other totally free Android applications and Windows games.</p>", "metacritic": null, "released": "2020-06-23", "tba": false, "updated": "2020-06-26T05:28:13", "background_image": "https://media.rawg.io/media/screenshots/5e5/5e5ffef80feae970d87b3926ba1340c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["rtcgames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}