{"id": 45864, "slug": "darkest-dungeon-tablet-edition", "name": "Darkest Dungeon: Tablet Edition", "name_original": "Darkest Dungeon: Tablet Edition", "description": "\"Darkest Dungeon is a challenging gothic roguelike turn-based RPG about the psychological stresses of adventuring.<br/><br/>***AWARDS AND HONORS***<br/>***Rock Paper Shotgun - 50 Best RPGs of All Time***<br/>***IGN - Best of 2016: 2 Nominations***<br/>***IGF 2016 - 3 Nominations***<br/><br/>Recruit, train, and lead a team of flawed heroes through twisted forests, forgotten warrens, ruined crypts, and beyond. You'll battle not only unimaginable foes, but stress, famine, disease, and the ever-encroaching dark. Uncover strange mysteries, and pit the heroes against an array of fearsome monsters with an innovative strategic turn-based combat system.<br/><br/>* The Affliction System – battle not only monsters, but stress! Contend with paranoia, masochism, fear, irrationality, and a host of gameplay-meaningful quirks!<br/>* Striking hand-drawn gothic crowquill art style<br/>* Innovative turn-based combat pits you against a host of diabolical monsters<br/>* Narration system to celebrate your successes...and failures<br/>* 15 (and counting!) playable hero classes, including Plague Doctor, Hellion, and even the Leper!<br/>* Camp to heal wounds or deliver inspiring speeches.<br/>* Rest your weary, shell-shocked characters in town at the Tavern or the Abbey to keep their stress in check.<br/>* Classic CRPG and roguelike features, including character permadeath, procedural dungeons, and incredible replay<br/>* 3 game modes and over 80 hours of gameplay*<br/><br/>Can you stem the tide of eldritch horrors erupting across your family’s ancestral estate?<br/><br/>Descend at your peril!<br/><br/>Please note that the game currently supports the following languages only: English, German, French, Russian, Polish, Czech, Spanish, Italian, and Brazilian Portuguese", "metacritic": null, "released": "2017-08-24", "tba": false, "updated": "2019-10-22T14:30:47", "background_image": "https://media.rawg.io/media/screenshots/e1d/e1d6e453daf5431e9c034650f0931ba9.jpg", "website": "http://www.darkestdungeon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS"], "developers": ["Red Hook Studios"], "genres": ["RPG", "Strategy"], "publishers": ["Red Hook Studios"], "esrb_rating": "Mature"}