{"id": 45868, "slug": "monster-boy-and-the-cursed-kingdom", "name": "Monster Boy and the Cursed Kingdom", "name_original": "Monster Boy and the Cursed Kingdom", "description": "<p>A legendary series returns with a grand new adventure!<br />\nEnjoy a colorful action-adventure game made alongside Ryuichi Nishizawa, creator of the original Wonder Boy in Monster World series.<br />\nMonster Boy and the Cursed Kingdom borrows the best from the classic series to deliver a fresh, modern adventure with fun gameplay, memorable music and gorgeous hand drawn animations.<br />\nCan Jin save Monster World Kingdom? Help our young hero defeat challenging enemies, discover hidden locations, upgrade powerful equipment, and more! You&#39;ll also unlock special forms with unique skills used to open new paths where mighty bosses and secret treasures await.<br />\nFeature Overview:<br />\nSix awesome forms with unique combat and platforming abilities to make your adventure exciting from start to finish.<br />\nUnlock new paths and secrets with special equipment: look for magic weapons and items that gradually open up the world.<br />\nOver 15 hours of epic adventure: explore the new Monster World in a vast interconnected environment.<br />\nHand Drawn animations: characters and enemies come to life with detailed animations and fun facial expressions.<br />\nSoundtrack from iconic Japanese composers: Yuzo Koshiro, Motoi Sakuraba, Michiru Yamane, Keiki Kobayashi and Takeshi Yanagawa.</p>", "metacritic": 85, "released": "2018-12-04", "tba": false, "updated": "2024-01-11T02:06:17", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cd488dcccb38d73dc8d881e6c83701d.jpg", "website": "http://www.monsterboy.com", "rating": 3.94, "rating_top": 4, "added_by_status": {"yet": 26, "owned": 228, "beaten": 37, "toplay": 61, "dropped": 27, "playing": 8}, "playtime": 4, "achievements_count": 78, "ratings_count": 63, "suggestions_count": 529, "game_series_count": 10, "reviews_count": 65, "platforms": ["PlayStation 4", "PC", "PlayStation 5", "Xbox One", "Nintendo Switch"], "developers": ["FDG Entertainment GmbH & Co.KG", "Game Atelier"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["FDG Entertainment", "Co KG"], "esrb_rating": "Everyone"}