{"id": 45876, "slug": "imperatum", "name": "Imperatum", "name_original": "Imperatum", "description": "You are an agent, thrown headfirst into your first mission trying to unravel the mystery of the veil that is consuming the galaxy.<br/><br/>Created by former professional gamers and AAA developers, Imperatum is an Action RPG set in a future Sci-Fi universe.  <br/><br/>The game focuses on the core ARPG 'trinity' mechanics of fast-paced combat, deep character customization and tons of loot!<br/><br/><br/><strong>Key Features</strong><br/><br/><ul><li>  Intense combat - A hallmark of this genre and Imperatum delivers!  Battle your way through 8 levels and more than a dozen different enemy types!<br/><br/></li><li>  Character customization - Familiar stat and skill allocation with a twist.  Skills can be used in active mode or slotted in other skills for a passive effect.  Want your fire bomb to heal you?  Done!  Want your Three Shot Burst to explode and irradiate your enemies?  Done and done!   This active passive system with 48 unique skills allows for near limitless combinations.<br/><br/></li><li>  All the loot - Love finding loot?  There is so much loot we had to implement a recycling feature that allows players to turn extra loot into crafting currencies on the fly instead of having to run back to town.<br/><br/></li><li>  Vast Sci-Fi Universe - Have you played the other big ARPG's and wonder why there was no good Sci-Fi game?  It is our passion to deliver that experience that has been missing in the genre.  No more high fantasy, dark fantasy or voxel settings.  Just good old fashioned Sci-Fi awesomesauce. <br/><br/></li><li> Targeting Overlay - It can be frustrating at times to not have visual indicators for how far your skills work.  We sought to solve this with a toggle-able targeting overlay that displays your skills range and area of effect.<br/><br/></li><li>  Pro Social  and Health Mechanics - Being a gamer in 2017 is hard.  There are so many good games and so little time it can be hard to pull yourself away.  We feel that as developers it is part of our ethical duty to encourage gamers to make healthy choices.  To that end we have been implementing and testing systems within the game to encourage players to make healthy choices.  Let us know what you think!<br/></li></ul>", "metacritic": null, "released": "2017-08-25", "tba": false, "updated": "2019-08-28T22:05:05", "background_image": "https://media.rawg.io/media/screenshots/22e/22eb751ea5aa82c3a9514c7bc294fa94.jpg", "website": "https://imperatumgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 2, "achievements_count": 33, "ratings_count": 1, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pro Social Games"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Pro Social Games"], "esrb_rating": null}