{"id": 458897, "slug": "mannequin-scary-creepy-survival-horror-escape-room", "name": "Mannequin - Scary Creepy Survival Horror Escape Room Game (Scary Game made in 2 hours)", "name_original": "Mannequin - Scary Creepy Survival Horror Escape Room Game (Scary Game made in 2 hours)", "description": "There are a 100 of mannequins .. <strong>but one of them is alive 😱<br/></strong>\n<p>Hide under the beds, chests and closet and try to escape the Mannequin house. It's not that easy though - not when out of the 100 Mannequins in the house 1 comes alive... <br/>Are you ready to face your fears? You wake up without a memory of what happens. All you know is that you are in a Mannequin house, there are lots of mannequins but one of them feels alive. Will you survive? How will you survive if you don't know who is real and who is not? Test out your skills in this amazing stealth hiding survival horror game!</p>\n<p>The Mannequin is a horror creepy scary horror escape room game. Experience this amazing horror in 3D graphics of this amazing horror game. Do you love escape room games? Then you will love this creepy scary horror game! Try to escape the house filled with crazy Mannequins trying to kill you. Will you survive this horror escape room game?</p>\n<p>In a haunted Mannequin house which contains paranormal activities, it is very difficult to survive if your nerves is not hard as steel. You can't determine who is real and who is not. Who is a Mannequin and who is not. The shadows will confuse you.<br/></p>\n<p>This Scary Horror Game won't be an easy game, but with so many free hints and clues you will figure it out anyways. Fear house can bring you difficult puzzles to solve as good as easy puzzles to solve. So if you like to play detective games, puzzles games and scary horror games and if you’re fan of scary stories and room games free, this is perfect horror game for you! You will need a knack to get through whole game, don't forget to unlock the doors, mate. Maybe it’s gonna be challenging but definitely worth it! Here the scary game begins in the haunted house of fear. Test your logical skills and explore this escape horror game. One of the best adventure games. Goosebumps guaranteed! <br/></p>\n<p>- High quality art and realistic graphics<br/>- Hide under the beds to hide from your enemy.<br/>- Horror game and creepy game<br/>- Understandable escape room with clues and hints<br/>- Search for clues and solve difficult puzzles<br/>- Many interesting puzzles and riddles.<br/>- Extreme HORROR game and SCARY game of 2020.<br/>- Intuitive interface<br/>- Escape adventure without internet connection<br/>- Items pick-up<br/>- Horror Intelligence enemy AI that hears your footsteps and follows the sound.<br/>- This game is an amazing HORROR GAME and you will be SCARED.</p>\n<p>Extraordinary atmosphere, nervous scenario and best horror game of blood-curdling, you are one step ahead of a real amazing survival horror game. Hide under beds, chests and more in this amazing horror survival game and try to escape the house with a very creepy settings</p>\n<p><strong>Disclaimer: This game is just a test that I did as it was made in about 2 hours (with the game, trailer, video and publishing - so about 1 hour for just the creation) as it is using a package and I just added a quick story, some models and VIOLA ..</strong> The Mannequin was born. It was never intended as a full game, most I just wanted to show off a great package I bought off the AS. Good stuff!<br/><br/><strong>Introduction:  When the game starts, to unlock the door you have to pick up an object (cup, plate etc.) and drop it. This will make the Mannequin curious to come and investigate the sound .. so be sure to hide under your bed and let him open the door for you ;)</strong><br/></p>", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-06-26T07:08:26", "background_image": "https://media.rawg.io/media/screenshots/828/828a84ccefa562ec452f5baa8aa3926d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steelkrill Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}