{"id": 45882, "slug": "morphite", "name": "Morphite", "name_original": "Morphite", "description": "Set in a distant future where humanity has colonized the far reaches of space, Morphite follows the story of Myrah Kale, a young woman whose life takes a sudden turn when a simple mission develops into an epic interstellar journey revealing her mysterious past and relation to a coveted substance called Morphite.<br/><br/>Myrah will voyage to the furthest corners of space and explore uncharted procedurally-generated planets, each with diverse landscapes and teeming with exotic flora and fauna. With the help of a scanner, Myrah will sell biological information for ship, suit and weapon upgrades.<br/><br/>Inside Myrah’s vessel, players will engage in random encounters with real-time space combat, trade with other travelers across the galaxy and navigate outer space with Morphite’s easy-to-use Starmap system.Features<br/><ul><li> Procedurally generated universe: Morphite features tons of generated planets to discover, all with their own flora and fauna. Besides their individual beauty, visiting planets will prove vital for gathering resources, researching creatures, and gaining skills towards strengthening your character.<br/><br/></li><li> Platforming: Morphite will feature platforming elements in order to explore new landscapes and structures. This is designed with the same mindset as other classic platforms: to be fun and intuitive, even within first and third person views.<br/><br/></li><li> Research and exploration: There is a heavy emphasis on discovery. While players are free to battle every creature they find (many of which are hostile), they can optionally choose to simply scan each creature to gain vital data to sell later.<br/><br/></li><li> Planet and spacecraft combat: While discovery is paramount, Morphite will also feature hostile environments, creatures, and boss battles. Combat will take place on planets and also in space during random encounters. Upgrading your weaponry will be essential to surviving.<br/><br/></li><li> Deep single player story: 15 planets are hand crafted and pertain specifically to the plot. These planets will exist for the player to further the story when they are ready. The main storyline is also fully voiced in English.<br/><br/></li><li> Character and ship upgrades: While planetside, players will be able to locate rare scans to craft new suit abilities. Additionally, players can locate shops all over the galaxy to upgrade and augment their power suit, ship, and weapons.</li></ul>", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2022-10-01T23:34:02", "background_image": "https://media.rawg.io/media/screenshots/172/172675c5344b1c28b9febe9c8a2c9ba7.jpg", "website": "http://www.crescentmoongames.com/wordpress/morphite", "rating": 2.82, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 97, "beaten": 2, "toplay": 6, "dropped": 7, "playing": 1}, "playtime": 1, "achievements_count": 75, "ratings_count": 10, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 11, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "macOS", "Linux", "PC", "Android", "iOS"], "developers": ["Crescent Moon Games", "Blowfish Studios", "LEVEL 77", "We're Five Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Crescent Moon Games", "Level 77"], "esrb_rating": null}