{"id": 458869, "slug": "bunnycide-pre-alpha", "name": "Bunnycide Pre-Alpha", "name_original": "Bunnycide Pre-Alpha", "description": "<p>DOWNLOADING THE .EXE OR .APP IS RECOMMENDED FOR OPTIMAL PERFORMANCE<br/></p>\n<p>DISCLAIMER: This game is not finished and is a prototype. Expect non-optimal performance. A remake of Bunnycide is being worked on and will be released when ready.</p>\n<p>Controls: WASD and mouse to look around and shoot with the left mouse button.</p>\n<p>Game made as a Plysinki 2019 school project in 3-4 weeks by students from Stadin Ammattiopisto and City College Plymouth.</p>\n<p>Bunnycide is an action game where you drive a tank with your only goal being to slaughter infinitely respawning bunnies. You can also destroy their buildings if you so please.</p>\n<p>The game has 2 different levels to play in, one close quarters and the other with a larger area. Both have an option to choose day or night, with infinitely respawning hordes of bunnies. There are multiple bunny types and a boss bunny that attack you with different kinds of weapons and abilities. </p>\n<p>The environment is completely destructible with bunny-themed buildings like carrot houses and carrot walls.</p>\n<p>The player drives a tank, which can be upgraded to increase firing speed and max health. There are also power-ups that spawn randomly in the level that give temporary abilities like nuke bullets, fast speed, invulnerability &amp; faster firing speed.</p>\n<p>Overall this game is gorey, fast-paced, over the top and a lot of fun.</p>\n\n<p>Credits:</p>\n<p>Alex Savander - Main Coder, extra 3D</p>\n<p>Eeva Torkkola (Demintai) - Coding, AI, 2D</p>\n<p>Jouni Heikkinen - 3D, Animation</p>\n<p>Benjamin Berts - Music, UI-art &amp; 2D</p>\n<p>Jake Martin - Level Design, UI</p>\n<p>Nuutti Mettälä - SFX &amp; Music</p>\n<p>Benjamin Blomstedt - SFX &amp; Music</p>", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-06-26T07:00:11", "background_image": "https://media.rawg.io/media/screenshots/1d1/1d16d989f51edf98b8b3022b75ed1372.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Alex Savander"], "genres": ["Action"], "publishers": [], "esrb_rating": null}