{"id": 458996, "slug": "madball", "name": "Madball", "name_original": "Madball", "description": "<p>Are you ready to cry? Do you want a hard platformer game? <strong>Madball is here</strong> to challenge you! I mean seriously!</p>\n<p>What is Madball?<br/>Madball is a casual game that you should control a ball with a constant velocity through an unpredictable and exciting platform by tapping the screen in smartphones and pressing the \"<em>Space</em>\" button or using a mouse in PCs. But wait, do you think the gameplay is simple? Hmm, let us know after trying the game!<br/>Madball has two primary modes: level mode and endless mode. In the level mode, you should scrimmage with around 60 different levels that every one of them has its exclusivity! <br/>In the endless mode, there are 9 different modes such as Pillars, The Wall, Invisible, Dark with various properties that you should try not reading about them!</p>\n\n<p>Features:</p>\n<ul><li>Rich and amusing gameplay with 60 levels and 9 endless runs.</li><li>Colorful and minimalist environment.</li><li>9 original soundtracks.</li><li>A large shop with numerous updates for the ball such as various colors and tails that let you design the character as you wish.</li><li>Challenging levels and addictive modes can keep you entertained for a long time.</li></ul>\n\n<p>You should know that Madball has been created by two students, so each support from you can boost us a lot in our journey. So, Download it now and Have fun!</p>", "metacritic": null, "released": "2020-06-20", "tba": false, "updated": "2020-06-26T07:38:29", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7e627e202ab107596a47e0a5a4976ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["Madness Studio"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}