{"id": 458908, "slug": "hello-operator-cloakedninjas", "name": "Hello, Operator? (cloakedninjas)", "name_original": "Hello, Operator? (cloakedninjas)", "description": "THE GAME\r\n<p>☎️ Connect incoming calls to their desired recipients as fast as you can<br/>⏲️ The faster you work, the better your score at the end<br/>📞 You will lose points for dropped calls - callers are impatient so make connections quickly<br/>⏳ The game ends after 3 minutes</p>\r\nHOW TO PLAY\r\n<p>🕹️ A blinking light on the switchboard indicates that a call is coming in from that jack<br/>🕹️ Choose any of the 6 available connector pairs and plug the LEFT PLUG of that pair to the caller jack<br/>🕹️ Flip the TALK SWITCH to hear the caller<br/>🕹️ The caller will tell you which number they're trying to reach, e.g. for 2364 find 23 on the X axis and 64 on the Y axis to find the receiver jack<br/>🕹️ Plug the RIGHT PLUG of the connector pair to the correct receiver jack<br/>🕹️ Push the ringer button to signal the receiver of the call<br/>🕹️ Close communications by flipping the TALK SWITCH to the off position<br/>🕹️ A solid light indicates that a call is ongoing. If the light is off, the call has ended. You can click on plugs to retract them</p>\r\nCREDITS &amp; TOOLS\r\n<p>💻 CLOAKEDNINJAS (Programming): Phaser<br/>🎨 TRESLAPIN (Art): Adobe Illustrator<br/>🎵 DORKULON (Music and SFX): Ableton Live 10 + Various Instruments</p>", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-06-26T07:11:25", "background_image": "https://media.rawg.io/media/screenshots/e18/e18af4dd7e21a10b69ff8b5956a68365.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cloakedninjas"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}