{"id": 458914, "slug": "killer-fetish", "name": "Killer Fetish", "name_original": "Killer Fetish", "description": "História \r\n<p>“Em um futuro distópico, em prol de manter a sobrevivência da raça humana, pessoas e máquinas se uniram à nível celular. O surgimento de um vírus sintético e eletrônico instalou o caos nas cidades, principalmente entre a parte mais pobre da população. Visando conter a infecção, fora emitido alerta de quarentena e os portões foram fechados.<br/></p>\n<p> Com o comando e instruções de seu superior, Belladona inicia uma investigação para descobrir a origem do problema e arrancar o mal pela raiz.</p>\n\n\n<strong>O vírus</strong>\n<p>Robôs microscópicos que infectam o indivíduo, destroem tecidos biológicos e hackeiam suas partes eletrônicas sorrateiramente. A destruição é lenta e os tecidos entram em necrose. <br/></p>\n<p>A amputação e substituição por partes robóticas é a única solução minimamente viável, visto que as partes robóticas, ainda que hackeadas pelo vírus, não apresentaram mal funcionamento até o momento. </p>\n<p>Foram buscadas formas de evitar a contaminação cobrindo partes expostas do corpo e filtrando a respiração. </p>\n<p><em>Ainda não há cura</em></p>\n\n\r\nCréditos\r\n<p><strong>Roteiro e direção de arte</strong>: Gabriella Miranda</p>\n<p><strong>Programação e Level design</strong>: Raquel Gomes</p>\n<p><strong>Trilha sonora principal (Menu):</strong> \"Dark Matters - Orquestra\" Falanstèr </p>\n\r\n\r\nNotas finais\r\n<p>O projeto será continuado e refinado ao decorrer dos próximos meses, visando a produção de um jogo interessante e bonito visualmente.</p>\n<p> Mediante a situação atual no nosso país e no mundo, muitos obstáculos foram enfrentados, mas não podemos nos deixar abalar e seguir em frente.</p>\n<p>Equipe -Profana-. </p>\n<p>Obrigado.</p>\n<p>2020</p>", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-06-26T07:13:17", "background_image": "https://media.rawg.io/media/screenshots/f0f/f0fcac503f5941d38df91525453e293f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Profana"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}