{"id": 459263, "slug": "rock-of-ages-3-beta", "name": "ROCK OF AGES 3 BETA", "name_original": "ROCK OF AGES 3 BETA", "description": "Rock of Ages 3: Make &amp; Break is competitive tower defense and arcade action rolled up with ACE Team's quirky, Monty Python-esque humor into one giant, creative game for the ages.<br/><br/>Jump into the expansive, gut-busting story for an eclectic adventure featuring bizarre and irreverent takes on legendary characters, or for the first time, create and share your own levels to compete with friends and strangers online in a real-time mix of hectic tower defense and epic boulder-racing arcade action.<br/><br/><br/>Key Features:<br/><br/>- Make &amp; Break Worlds: Design and build your own levels in the easy-to-use editor and share your creations with players from all over the world for nearly limitless creative fun!<br/><br/>- Competitive Tower Defense: Build defenses and race to destroy your opponents’ in up to 4-player online multiplayer, or head-to-head in 2-player split-screen action.<br/><br/>- Boulder-Smashing Arcade Action: Crash your way through everything in your path as fast as you can in six distinct and arcadey game modes with over 20 zany boulders!<br/><br/>- Absurdly Funny: Take a ride on the wild side with ACE Team's hilarious story – everyone from Caesar and Moctezuma to Krampus and the Flying Spaghetti Monster make an appearance in an expansive campaign across history and beyond.<br/><br/>- Game Modes Galore: Defend your base in the new Boulder Avalanche, perfect your rolling skills in the fragile Humpty-Dumpty Mode, race the clock in Time Trials, or create your own unique gameplay with the creator for hundreds of hours of fun!<br/><br/><br/><br/>Offline multiplayer (2 players)<br/>Online multiplayer (2-4 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/>Uses DUALSHOCK 4 vibration function<br/>Online features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-06-23", "tba": false, "updated": "2020-06-29T02:14:29", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Racing"], "publishers": [], "esrb_rating": null}