{"id": 459265, "slug": "maginary-immersive-game-book", "name": "Maginary — immersive game book", "name_original": "Maginary — immersive game book", "description": "Maginary is the unique fiction novel where your are one of the main characters. It connects our real world with the world of your imagination through the iPhone. <br/><br/>Michael Sterry — the previous reader of this book — woke up in a strange, far distant land called Anzo. The only thing he's got is the medallion which somehow broadcasts everything into your imagination. You will need to use your brains, your hands and even your legs to help Michael survive in Anzo and get him back into our real world...<br/><br/>----<br/><br/>This unique immersive experience will allow you to get lost in your imagination with the help of:<br/>* Over 70 beautiful animations with typography that will turn it into magical experience (think of magic diary from Harry Potter)<br/>* Audio and video sfx that will be adjusted to your reading speed<br/>* Original plot with interesting twists and unusual characters<br/>* Original soundtrack<br/>* Marvellous puzzles and interactions with your iPhone<br/>* You as the book’s main character<br/><br/><br/>-----<br/><br/>We wanted as many people as possible to enjoy this experience. That's why we decided to make the first two chapters for free and In-app purchase for the full game.<br/><br/>This is a game for those who believe that the coolest graphics and augmented reality can be found in their own mind.<br/><br/>For the best experience, use iPhone and headphones.<br/><br/><br/>If you have any questions, feel free to contact us via hello@maginary.app", "metacritic": null, "released": "2018-08-06", "tba": false, "updated": "2020-06-29T02:15:20", "background_image": "https://media.rawg.io/media/screenshots/523/523a15e211b106501fc6baf55938bfce_cObpHYw.jpg", "website": "http://maginary.app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Semyon Polyakovskiy"], "genres": ["Adventure", "RPG"], "publishers": ["Semyon Polyakovskiy"], "esrb_rating": "Teen"}