{"id": 459358, "slug": "the-road-jack-le-hamster", "name": "The road (Jack Le Hamster)", "name_original": "The road (Jack Le Hamster)", "description": "<p>Walk along the road.</p>\n<p>Keys: AWSD to move. ED to turn. SPACE to jump.</p>\n\n<p>This was produced for \"SO GOOD ITS BAD\" jam.</p>\n<ul><li>The game engine was produced by me before the jam.</li><li>The Dobuki Character was created by me before the jam.</li></ul>\n<p>The rest was created during the jam.</p>\r\nNote:<p>If you're playing this on Brave browser, make sure to disable shield.</p>\n<p>______</p>\r\nDev notes:\r\n<p>So I've been creating game for a while, and I've been struggling to produce a new game engine to use. I know a lot of developers use Unity. Back in the days, I've used Flash until it got deprecated. Back then, I thought Flash was great, but now I'm hesitant to make games using an engine, because it always has some limitations that ends up bugging me and this always reflects in the end results.</p>\n<p>So I've been working on producing a game engine ever since. And it's been difficult. This is around my 4-5th attempt at creating an engine. I've made some in the past, that I had to retire because they were too difficult to work with.</p>\n<p>I thought this time I got the right formula. So after evolving my engine to a satisfying level, I tried to work with it.</p>\n<p>And history repeats itself... It's HORRIBLE to work with that engine.</p>\n<p>I think everything was ok, until I tried to introduce web worker to do game processing, then the performance became unreliable, and the code was difficult to debug.</p>\n<p>Anyway, this was my attempt. It's possible I'm going to... again... redo a new engine from scratch for my next game.</p>\n<p>So this game was originally an attempt to produce a game, with all art coming from me. At the end, because of time, I couldn't get a good picture of me for the main character, so I used my Dobuki mascot instead. The rest of the decor (eyes, mouth, hand) are pictures of me.</p>\n<p>I was also hoping to create a story based game, but like I said, this engine is too difficult to work with. So at the end, I made whatever I was capable to do quickly with that engine.</p>\n<p>Anyway, hope you enjoy. This is a \"So bad it's good\" jam anyway, so I guess it doesn't matter how bad the game is. I hope it's not too frustrating for you, and that the frame rate keeps up. I have no idea how it will perform on your computer. On mine, I can reach 60fps if I close everything else, so perhaps you can try to play the game like that.</p>\n\n<p>Good luck!</p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T02:37:41", "background_image": "https://media.rawg.io/media/screenshots/56c/56c565a2e3abd625061f1564eca5bdda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jack Le Hamster"], "genres": ["Action"], "publishers": [], "esrb_rating": null}