{"id": 459439, "slug": "thermos", "name": "THERMOS", "name_original": "THERMOS", "description": "Celso é um boneco de neve (uma criatura deveras curiosa) \r\n<p>e vive no topo da alta montanha que fica no centro de Thermos, a ilha mostrada na imagem ao lado. Ele vive com sua família e seu cachorrinho de neve Kelvin numa casinha aconchegante e quentinha. </p>\n<p>Ele estava feliz brincando com seu companheiro Kelvinho quando o Vento do Norte surge e sopra ele pra longe, para o outro lado da ilha (bonecos de neve não são muito pesados quando estão na sua forma nevada), levando seu chapéu e seu cachecol; Kelvin some enquanto tenta se abrigar. E assim começam suas aventuras, com Celso longe de sua casa e sem saber pra onde ir(nunca tinha saído da montanha). Agora o desafio do nosso protagonista é achar o caminho para casa enquanto passa por diferentes locais e paisagens, que exigirão de nosso personagem abusar de suas capacidades bonecodenevísticas de mudar a si mesmo em busca de atravessar uma passagem estreita ou alcançar um local alto, contando apenas com sua própria companhia.</p>\r\nGameplay:\r\n<p>Esse é um jogo de plataforma 2D com uma mecânica de mudança de estados da água: usando os botões Z, X e C do teclado você pode intercalar entre os estados sólido, liquido e gasoso para passar ao longo das fases.  </p>\n<p>[A build atual \"Executavel Thermos.zip\" é apenas uma demo]<br/></p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T02:55:48", "background_image": "https://media.rawg.io/media/screenshots/c1d/c1d61bd2065262d6501b36acc8335fdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fellowship of the Game", "Luís Eduardo Rozante de Freitas Pereira", "Saint_Patrick", "Jony33Invent", "SpinoRandom", "batsbatsqrz", "Louas"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}