{"id": 45958, "slug": "xcom-2-war-of-the-chosen", "name": "XCOM 2: War of the Chosen", "name_original": "XCOM 2: War of the Chosen", "description": "<p>XCOM® 2: War of the Chosen, is the expansion to the 2016 award-winning strategy game of the year. </p>\n<p>XCOM® 2: War of the Chosen adds extensive new content in the fight against ADVENT when additional resistance factions form in order to eliminate the alien threat on Earth. In response, a new enemy, known as the “Chosen,” emerges with one goal: recapture the Commander. This expansion includes new Hero classes to counter the “Chosen”, new enemies, missions, environments and increased depth in strategic gameplay.</p>\n<p>Three additional factions have emerged to strengthen Earth&#39;s resistance – the Reapers, Skirmishers and Templars – each with its own unique abilities and contrasting philosophies. These factions provide powerful hero class soldiers to aid in missions and new opportunities for the strategy layer.</p>\n<p>A deadly new alien known as the Spectre, capable of creating dark copies of XCOM soldiers, has snuck onto the battlefield. Adopt new tactics to counter it as well as the explosive attacks of the ADVENT Purifier and the psionically charged ADVENT Priest.</p>\n<p>Engage in tactical missions across new environments from abandoned cities devastated by alien bioweapons during the original invasion, to underground tunnels and xenoformed wilderness regions.</p>\n<p>Manage XCOM’s relations with factions and counter The Chosen’s operations from the Avenger. Employ new Resistance Orders to prioritize your personal strategy. Soldiers, scientists, and engineers can now be deployed for Covert Actions that award supplies and boost faction favor if successfully completed.</p>\n<p>Soldiers can develop bonds with compatible teammates for new abilities and perks. The SITREP system dynamically adds new modifiers to the tactical layer to make sure every mission provides a unique challenge. Advanced campaign options allow for finer adjustments to game length and difficulty.</p>\n<p>Utilize the perfect strategy in new regular one-shot community challenges to claim the top spot on the global leaderboard.</p>", "metacritic": 95, "released": "2017-08-29", "tba": false, "updated": "2024-04-17T11:51:37", "background_image": "https://media.rawg.io/media/games/824/8244534a6db2180e177271cebb9c002f.jpg", "website": "https://xcom.com", "rating": 4.38, "rating_top": 5, "added_by_status": {"yet": 41, "owned": 78, "beaten": 137, "toplay": 84, "dropped": 40, "playing": 24}, "playtime": 0, "achievements_count": 0, "ratings_count": 215, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 219, "platforms": ["PlayStation 4", "Linux", "macOS", "PC", "Xbox One"], "developers": ["Firaxis"], "genres": ["Strategy"], "publishers": ["2K Games"], "esrb_rating": "Teen"}