{"id": 459641, "slug": "just-the-two-of-us-hittsuki", "name": "Just the two of us (Hittsuki)", "name_original": "Just the two of us (Hittsuki)", "description": "<p>Two little cute ballies in love are lost on a planet. Your goal is to reunite them.</p>\n<p>You just can control the planet’s rotation and take advantage of the environment in each level you will play.</p>\n<p><strong>Arrow Keys to move<br/>Esc for menu</strong></p>\n<p>This game was made by three students in the 48 hours United Game Jam with Godot Engine. Even though that was tough as it was our first game jam experience, it was quite much fascinating.</p>\n<p>Our game is related with the UGJ 2020 theme : Two. We are manipulating a planet with only two controls to guide two little characters. The game as the number two might be illustrated as is a kind of balance. As a player, you have to take care of both ballies when you are trying to make them move with your two-controlled planet.</p>\n<p>Every sound and music in our game were made by our sound designer and composer.</p>\n<p>We also made the whole parts of the graphics except for the spatial background and the planets’ bases witches are freepik’s free-to-use or modify resources that you can find in the links below.</p>\n<p>I think that’s safe to say that releasing a video game was a childhood dream for the three of us and we can say that we did it and we are looking forward to doing a lot more and a lot better.</p>\n<p>Hope players will have fun this will mean a lot for us.</p>\n<p>Designed by Jules Feydy, Emilien Rouger, Matthieu Nowak.<br/></p>\n\n<p>Windows app available for better performances.</p>\n<p>Credits (graphics assets and font) :<br/>https://www.freepik.com/free-vector/rocket-and-spacecraft-window_983504.htm <br/>https://www.freepik.com/free-vector/flat-design-colorful-planet-collection_5461951.htm <br/>https://fonts.google.com/specimen/Megrim?query=megrim<br/>https://fonts.google.com/specimen/Indie+Flower?query=indie+flower<br/><br/></p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T03:38:46", "background_image": "https://media.rawg.io/media/screenshots/444/44455280dd0b1cb1849b70575c8857b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Hittsuki"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}