{"id": 459646, "slug": "to-too-two", "name": "To Too Two", "name_original": "To Too Two", "description": "<p>A game where you utilize the words \"To, Too, and Two\" to solve puzzles!</p>\n<p><strong><em>IT IS HIGHLY RECOMMENDED FOR YOU TO PLAY WITH AUDIO</em></strong><br/></p>\n\n<p>Necessary Jam Guidelines:</p>\n\n<p><strong>1. Tell us about your game. (The story, setting, theme)  </strong><br/></p>\n<p>To, Too, Two is a game about a little slime boy named, you guessed it, SlimeBoy and his quest to become a citizen of Earth. As SlimeBoy you solve puzzles given to you by a disembodied intercom voice with the promise that the voice is teaching you how to fit in on Earth. Eventually you find out the voice's true intentions, but it is too late, SlimeBoy has found an exploit in the system and he makes his grand escape to freedom! (Spoilers)</p>\n<p>The main mechanic of the game was found when I spent the first 4 hours of the jam sitting at a whiteboard making a game idea for every \"Two\" thing I could come up with. Then, with extensive polling of friends and family it became a quirky word game!</p>\n<p>And, as all the best puzzle games do, I added a snarky narrator.</p>\n<p>My main inspiration came from Baba Is You and Scribblenauts.<br/></p>\n<p><strong>2. Tell us how your game fits the theme.  </strong><br/></p>\n<p>The game is based literally around the word \"Two\" and its homophone friends of \"To\" and \"Too.\"<br/></p>\n<p><strong>3. Mention any assets (with links) used in the game that was either taken from the internet or made before the jam began.</strong></p>\n<p>My only pre-made assets are fonts:</p><p>https://fonts.google.com/specimen/MuseoModerno</p><p>https://www.1001fonts.com/pixel-font.html</p><p>https://www.1001fonts.com/dotty-font.html<br/></p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T03:39:38", "background_image": "https://media.rawg.io/media/screenshots/242/242245ce315d52f013fa6a8a68b50b78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Piginatuxedo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}