{"id": 45960, "slug": "floor-plan-hands-on-edition", "name": "Floor Plan: Hands-On Edition", "name_original": "Floor Plan: Hands-On Edition", "description": "Floor Plan is a puzzle adventure game that takes place entirely inside an elevator. Go floor to floor, find items, and meet a bizarre cast of characters. Discover relationships between different things in the building and unlock its secrets. <br/><br/>It's the most fun you can have while stuck in an elevator.FEATURES<strong>Elevator-Scale VR</strong><br/>Floor Plan: Hands-On Edition adds full support for motion controllers to the original game. Walk around the elevator, grab things, and press buttons! Or if you'd rather enjoy your buttons from a distance, you can play seated or standing with a variety of control options. <br/><br/><strong>Classic Genre, New Paint</strong><br/>Floor Plan takes mechanics from your favorite classic point-and-click adventure games and reimagines them for first person VR. Whether you dream of inventory puzzles or you're a newcomer to the genre, you'll see it like you've never seen it before.<br/><br/><strong>Play Your Way</strong><br/>Figure out alternate solutions to puzzles, solve them in different orders, or call the operator if you need a nudge in the right direction.IMPORTANTFloor Plan generally takes players about an hour to complete. We've priced it accordingly, and think it has enough special moments to be memorable and something you'll want to share with friends. Thanks for checking it out!<br/><br/>You can reach the developers on Twitter at @TurboButtonInc.", "metacritic": null, "released": "2017-09-14", "tba": false, "updated": "2019-08-28T22:05:03", "background_image": "https://media.rawg.io/media/screenshots/84d/84dfc195844601883b2fb7d4fe270744.jpg", "website": "http://turbo-button.com/floorplan", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 26, "beaten": 6, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 7, "ratings_count": 4, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Turbo Button"], "genres": ["Adventure", "Indie"], "publishers": ["Turbo Button"], "esrb_rating": null}