{"id": 45969, "slug": "warhammer-vermintide-2", "name": "Warhammer: Vermintide 2", "name_original": "Warhammer: Vermintide 2", "description": "<p>Warhammer: Vermintide 2 is a first-person action game with heavy emphasis on cooperative multiplayer, a sequel to 2015 game Warhammer: End Times – Vermintide.  </p>\n<h3>Setting</h3>\n<p>The game takes place in Warhammer Fantasy setting during the early days of the cataclysmic event known as The End Times. It continues the story of the original game. The five protagonists – heroes of Ubersreik, must face the evil forces of Skaven clan Fester and chaos warband Rotbloods.  </p>\n<p>###Gameplay <br />\nWarhammer: Vermintide 2 consists of 13 missions divided into three acts. In each mission can choose one of five heroes and have to go from start to finish of the level, slaying hordes of enemies and to complete different tasks.<br />\nEach character has unique abilities, weapons, and progression system and serves a special role in the party. Every character has a melee weapon, ranged weapon, an active ability, several passive abilities and three careers to choose. The careers affect some of the character’s stats, available equipment and set of abilities. From the start of the game, each character has one career, while the other two get unlocked with leveling-up. After completing each mission, each character gains a random piece of equipment such as new weapons or trinkets. The equipment you get becomes better and better during the game.</p>", "metacritic": 82, "released": "2018-03-08", "tba": false, "updated": "2024-04-18T14:13:04", "background_image": "https://media.rawg.io/media/games/5be/5bec14622f6faf804a592176577c1347.jpg", "website": "", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 302, "owned": 6782, "beaten": 251, "toplay": 79, "dropped": 349, "playing": 70}, "playtime": 7, "achievements_count": 413, "ratings_count": 735, "suggestions_count": 250, "game_series_count": 1, "reviews_count": 746, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Fatshark"], "genres": ["Action", "Indie"], "publishers": ["Fatshark"], "esrb_rating": "Mature"}