{"id": 459873, "slug": "honeypot", "name": "Honeypot", "name_original": "Honeypot", "description": "<p>Sinfall Studios presents Honeypot - an immersive and highly interactive adult espionage game set in the near future. Use your body and your mind to achieve your goals - whether that is serving your country, amassing your own wealth and power, or just indulging in your deepest, darkest desires.<br/><br/>It is January 2025 and the world is on the brink of chaos, with old alliances around the world crumbling and new powers threatening global peace. As international relations break down between nations, crime prospers, with powerful gangs and mafias contesting for riches previously undreamed of. In the midst of all this corruption, excess, and conflict, intelligence agencies spar with each other in a new cold war, desparately trying to gain the upper hand through any means necessary.<br/><br/>You are not a part of this world - not yet, anyway. You work as a waitress in a coffee shop. You have a boyfriend, a few close friends, and a perfectly normal life. Sometimes you find yourself daydreaming, wishing for something more exciting to come about, something that will truly be able to satisfy your innermost yearnings. Little do you know that your life is about to radically change forever. Who will you become?</p>\n<p>Developer note: This is the free version of the game. To get the latest version as soon as it is released, head on over to www.patreon.com/sinfallstudios</p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T04:28:00", "background_image": "https://media.rawg.io/media/screenshots/3fb/3fbe75ad2b768295570a805f0de7a14a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sinfall Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}