{"id": 459829, "slug": "commander-bongo-a-two-button-game", "name": "Commander Bongo - a Two Button Game", "name_original": "Commander Bongo - a Two Button Game", "description": "<p>Commander Bongo is an Endless Runner and Shooter which is played with only two Inputs: Left and Right.</p>\n<p>The Controls:</p>\n<p>Press Left (or A Key) - move Left</p>\n<p>Press Right ( or D Key) - move right</p>\n<p>Hold Left and quickly tap Right - move right and shoot</p>\n<p>Hold Right and quickly tap Left - move left and shoot</p>\n<p>Hold Right and Left - charge your shot</p>\n<p>This game was made for the United Game Jam of June 2020 using the following tools:</p>\n<ul><li>Unity: Game Engine</li><li>Blender: 3D Modelling</li><li>Magix Music Maker: Music and Sounds</li><li>Sfxr: Sounds</li><li>Aseprite: Creating Palette</li></ul>\n<p>THANK YOU for playing Commander Bongo. Rate and/or Comment - I am looking forward to it :)</p>\n<p>Short History:</p>\n<p>The first idea of this game was a rhythm game: You control your space ship by hitting a left or right bongo. Hence the name Commander Bongo. Turned out that getting the rhythm correctly on time so its a satisfying experience was too hard to get done in a 48 hour Jam. Despite the loss of the initial idea, I am happy with what it became.</p>\n<p>Outlook:</p>\n<p>I want to add some smaller features after the jam and possibly make a mobile version for iOS. It would be my first publication on the App Store.</p>\n<p>PS: I only have a Windows machine, so the Build for Linux and MacOS might not be working all this perfectly.</p>\n\n<p>PPS: Just got word that the Linux RAR is not working for some. There is a ZIP for every version just in case.</p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T04:19:26", "background_image": "https://media.rawg.io/media/screenshots/805/80526f40d74a40516e4d3f6fff63d168.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pidibidi"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}