{"id": 459815, "slug": "ballistawizard", "name": "BallistaWizard", "name_original": "BallistaWizard", "description": "<p>WASD to move, Space to engage/disengage ballistas and collect arrows. Left mouse click to shoot. Red arrows can only be used with the red ballista, and only kill the red demon. The blue arrows can only be used with the blue ballista, for killing the skeleton.</p>\n<p>A young mage is left alone to defend his castle from the hoards of evil. His lack of expertise in magic left him only one choice ~ to use the Ballista, with a physical damage arrow drained in his magic power.<br/><br/>BallistaWizard is a top-down fast paced tower defense game where you have to use two (Fire &amp; Magic ) ballista to kill two (Flesh &amp; Undead) types of enemies.  The gameplay switches between two parts, shooting the enemies and collecting the correct type of bolts. As the onslaught goes on, it can easily become overwhelming for our young mage. <br/><br/>Mechanics: <br/>Activate Ballista to control and aim at enemies that are running towards your wall carrying a bomb with them, restock arrows from stockpile to fire without interruption and protect your wall from getting explode. Red arrows can only be used in the red ballista and blue, in the blue. Use WASD to move, Space to engage/disengage ballistas and collect arrows. Left Mouse to shoot arrows.<br/><br/>Assets: All assets were made during the jam, except the two music tracks, which were made earlier for other projects. As these aren't public domain, links are not available. <br/><br/><br/></p>", "metacritic": null, "released": "2020-06-28", "tba": false, "updated": "2020-06-29T04:16:39", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5bee7266a8733f55689a9d9bef7c307.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CheezGarlick", "Harsh Raghav"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}