{"id": 46, "slug": "starblood-arena", "name": "StarBlood Arena", "name_original": "StarBlood Arena", "description": "Test your mettle in furious arena combat as you move, evade, and attack in any direction against pilots from every corner of the galaxy. Fight for glory, credits, and your life as the StarBlood Network broadcasts every lawless match for the universe to see. Whether it’s single player Carnage deathmatches, Team Carnage* deathmatches, or Invaders co-op*, you’ll be constantly challenged to step up your game and prove that you’ve got the skills to emerge victorious. <br/><br/>The StarBlood Network cameras are on, everyone is watching, and there’s no safe space in the Arena. Ready? You better be. <br/>Welcome to StarBlood Arena.<br/><br/>Features:<br/>• Outmaneuver your opposition in chaotic combat with total freedom to move, evade, and attack in any direction.<br/>• Pilot one of 9 distinct ships with their own unique pilot, playstyle, and loadout.<br/>• Play single player, co-op, or multiplayer* matches to unlock ship, weapon, and auxiliary modifications<br/>* Active PS Plus membership required<br/><br/><br/><br/>VR Games may cause some players to experience motion sickness.<br/><br/>Use of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy). <br/>Online features may be terminated at any time.<br/>*Online multiplayer requires a PlayStation®Plus membership.<br/><br/>Online Play (Required)<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/><br/>In development for PlayStation®VR. Please review and follow all safety guidelines for use of PlayStation®VR. Playstation®VR is not for use by children under age 12. Playstation®4 system, PlayStation®VR and PlayStation®Camera are required to experience VR functionality.", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2022-10-01T23:37:24", "background_image": "https://media.rawg.io/media/screenshots/6f3/6f33d1ecfbe91f834b9c6e9f497ef08b.jpg", "website": "", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 20, "owned": 93, "beaten": 2, "dropped": 18}, "playtime": 0, "achievements_count": 54, "ratings_count": 29, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 29, "platforms": ["PlayStation 4"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}