{"id": 460006, "slug": "deep-sea-fighter", "name": "Deep Sea Fighter", "name_original": "Deep Sea Fighter", "description": "<p><strong>Gameplay Instructions:</strong><br/></p>\n<p>W,A,S,D to move Left Mouse to bite Right Mouse to do a Spin Attack Space to Dash</p>\n<p><strong>The objective is to defeat all enemies and absorb their light by eating their meat. Each wave gets harder, until a final Wave 5.</strong></p>\n<p><strong>List of any content that was created before the jam that was included in the final submission:</strong></p>\n<p><strong>Gamepad UMG Plugin</strong> https://forums.unrealengine.com/community/community-content-tools-and-tutorials/58523-gamepad-friendly-umg-~-control-cursor-with-gamepad-analog-stick-easily-click-buttons </p>\n<p><strong>VictoryPlugin</strong> https://forums.unrealengine.com/development-discussion/blueprint-visual-scripting/4014-39-rama-s-extra-blueprint-nodes-for-you-as-a-plugin-no-c-required?3851-(39)-Rama-s-Extra-Blueprint-Nodes-for-You-as-a-Plugin-No-C-Required= </p>\n<p><strong>Cardinal Menu</strong> http://metahusk.com/cardinal-menu/</p>\n<p><strong>LICENSE:</strong> As a condition of entry, Contestants hereby provide a non-exclusive irrevocable worldwide license to Sponsor to use the Submission in any and all media throughout the world for the purpose of promoting the Contest and future versions of the Contest and Sponsor’s Unreal Engine marketing, but for no other purpose, without any additional compensation, the term of which shall be the entire life of the copyright. Should any Contestant be unwilling or otherwise unable to enter into this license, or provide permissions and or releases, or otherwise cannot accept or receive the prize for any reason, Contestant with the next highest score will be chosen from the remaining entries until one who is able to meet all requirements can be selected. Potential prize winner must provide Sponsor with all signatures on required paperwork and return all documents in a timely manner as required pursuant to these Official Rules in order to be eligible to receive the prize. Contestants may not sell, assign or transfer any of their rights in their Submissions under these Official Rules.</p>", "metacritic": null, "released": "2020-06-27", "tba": false, "updated": "2020-06-29T04:57:33", "background_image": "https://media.rawg.io/media/screenshots/781/7818feed1f03d6a6dca0f38c554aa9e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gabriel Piccolo"], "genres": [], "publishers": [], "esrb_rating": null}