{"id": 46006, "slug": "rush-to-adventure", "name": "Rush to Adventure", "name_original": "Rush to Adventure", "description": "Rush to Adventure is a retro fantasy speedrunning adventure. Inspired by classic NES titles like Zelda, Mario and Castlevania. You awaken on the shore of a cursed island. Your only way off the island is to fight the monsters and lift the curse.<br/><br/><ul><li>Demo is awaiting approval and will be available within a few days.<br/></li><li>Working on a Mac build.</li></ul>Exploration and actionThe game is divided into two parts. You explore the non-linear island in a top-down view. This is where you talk to islanders, visit shops etc. The levels are played as a side-scrolling platformer. You must reach the end of the level or fight a boss to unlock more parts of the island.Adventure and speedrunningSlay monsters to gain xp and level up. Collect coins to buy items and weapons. At the end of each level you are scored and receive a rank. Play for the adventure or replay levels for better times and higher scores, to improve your rank.<br/><br/><br/><ul><li> Highly replayable through ranking system and 4 difficulties<br/></li><li> 41 levels (6 types: fields, forest, cave, tower, graveyard and temple)<br/></li><li> 5 golem mini-bosses and 4 bosses<br/></li><li> 9 high quality retro NES style songs<br/></li><li> 14 different swords, shields and armors<br/></li><li> 4 attributes to level up (strength, health, stamina and speed)<br/></li><li> 3 unlockable abilities (Dive Attack, Power Attack and Sprint)<br/></li><li> 8-bit NES style graphics and gameplay</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:05:01", "background_image": "https://media.rawg.io/media/screenshots/03b/03bb1790d7c65eb1079c9322381bcb51.jpg", "website": "http://www.digitalawakening.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Digital Awakening"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Digital Awakening"], "esrb_rating": null}