{"id": 460089, "slug": "untitled-detective-game-2017-prototype", "name": "Untitled Detective Game (2017 Prototype)", "name_original": "Untitled Detective Game (2017 Prototype)", "description": "<p>Excuse the crudeness of everything, this is an old and rough prototype of an open-world detective game that was in development by Lee Williams (leewilliams.eu / twitter.com/wiwyums) and myself in early 2017. Inspired by classic noir films, and the ~1 hour of time I spent playing L.A. Noire. <br/></p>\n<p>Except for the character models and the heron model, which were designed, textured, and modeled by the talented Simon Heggie (www.simonheggie.com / twitter.com/Simon_Heggie_) with animations provided by Mixamo, all the other assets were obtained from Unity's Asset Store for prototype purposes. All code was done by me, with the exception of the the car physics and the car traffic system.</p>\n<p>You can drive around and wreck into things, talk with NPCs, enter the two buildings that have an exclamation point (!) above their door, interact or take some items, take photographs with your camera, and fly around the city like Superman. That's mostly it.</p>\n<p>Controls:</p>\n<p>Q will pull up your camera, and pressing E will take a photo, which are saved in the game's _Data folder.<br/>Use the scroll wheel to zoom in/out.</p>\n<p>E to interact with NPCs that have an ! above their head.<br/>E to enter buildings that also have an ! above their door.<br/>E to enter your car, which also has an ! above it.</p>\n<p>WASD to move &amp; drive, mouse to look around.<br/>Left shift to run.<br/>C to crouch.<br/>Space to jump.<br/>Right click to toggle first-person view mode; it is the \"detective mode\" and is required when examining or taking items (few are in this prototype).</p>\n<p>F to turn into Superman.</p>\n<p>F1 will reload the main game scene.<br/>F2 will load a desert location, press F1 to return to the main scene.</p>\n<p>Escape will allow you to access the pause menu, change settings, and exit the game. Some settings may not be functional.</p>\n<p>You can also play with an Xbox controller. Right stick to move, left stick to control camera, RT to run, B to crouch, X to jump, A to interact, RB to go into first-person mode, LB for camera mode and A to take a photo. Vehicle controls are: Left stick to steer, RT to accelerate, LT to decelerate/reverse, RB to change camera position.</p>\n<p>This was done over a brief period in early months of 2017. Put on hold due to other jobs taking priority, as well as the scope being a bit too large for us at the time. But we will return to it sooner or later :)</p>\n<p>-allen <br/>(allen.goodmorningcommander.com, twitter.com/goodmorningcmdr)</p>", "metacritic": null, "released": "2020-06-27", "tba": false, "updated": "2020-06-29T05:15:22", "background_image": "https://media.rawg.io/media/screenshots/5f9/5f95707981eaea42641d66cc0d1188df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["allen"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}