{"id": 46014, "slug": "the-little-ball-that-could", "name": "The Little Ball That Could", "name_original": "The Little Ball That Could", "description": "There is no exception to the rule - only balls with a heart can enter the Haven, and others, well... others have to move on. It was your turn to get your heart and be allowed in when the stamping machine stopped. Your only choice to join your kind is to prove your worth by finding enough hearts to refill and restart the machine. On your path, there are deadly falls to avoid, dangerous traps to evade, mind-bending puzzles to solve, and maze-like levels to traverse. But all is not grim, for there are shiny gems to collect, hidden puzzle pieces to find, and trapped forms to help. Perhaps there is another way to prove your courage?<br/><br/><strong>The Little Ball That Could</strong> is a marble platformer with exploration and speed-run elements, inspired by Marble Madness, Manic Marble, Super Monkey Ball and Marble Blast. However, unlike its predecessors, TLBTC is not only about going as fast as you can - instead, you'll need to use your wits if you want to make it through its many non-linear levels and deadly traps.FEATURES<ul><li> Roll through 120 large, non-linear levels spread across 5 beautiful low-poly worlds.<br/></li><li> Test your speed, precision and curiosity in over 9 hours of increasingly challenging gameplay.<br/></li><li> Take part in a minimalist story and unlock an alternative ending by saving trapped friends.<br/></li><li> Unlock beautiful ball skins using puzzle pieces, and try out fun powers that will let you play the game in radically different ways.<br/></li><li> Use the checkpoints and level skips to progress through the game without frustration.<br/></li><li> Experience the best platforming action with our tight, physics-based controls - you'll have a blast whether you prefer to play using the keyboard or a controller.</li></ul>WORKS GREAT ON STEAM<ul><li> Complete fun achievements<br/></li><li> Compete on the leaderboards for the best level times<br/></li><li> Enjoy the game in Big Picture mode<br/></li><li> Save your game on the Steam Cloud<br/></li><li> Get trading cards and other community perks (coming soon!)</li></ul>", "metacritic": null, "released": "2017-09-12", "tba": false, "updated": "2019-08-28T22:05:01", "background_image": "https://media.rawg.io/media/screenshots/099/0999e15745b3d3a11902e3d0ab34b385.jpg", "website": "https://www.naissusworks.com/the-little-ball-that-could/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 1, "achievements_count": 27, "ratings_count": 2, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["NaissusWorks"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["NaissusWorks"], "esrb_rating": null}