{"id": 460136, "slug": "garden-game-itch", "name": "Garden Game (itch)", "name_original": "Garden Game (itch)", "description": "<p>This is a rough prototype and final project for my Creative Coding course. This program was created using P5.js and is a community garden game. In the game, players can “plant” a garden and learn about different kinds of plants. Players will start out with an empty garden, and they will be able to use keys to choose whether to plant a variety of trees, vegetables/herbs, or flowers into their garden. You “plant” by clicking and a random plant from the category that you choose will appear and a small factoid will pop-up. Players will also be able to “reset” the garden canvas with the space bar. Eventually, the program could be linked to a location, in order to include a number of native species that would vary depending on the location of the player. However, for the purposes of this project, I will be including some plants that are native to the California area. </p>\n<p>The game  is meant to inspire people of all ages become home growers and to advocate for more community gardens in their areas. It also aims to teach people interesting facts about plant properties and the impact that they have on the ecosystem. I believe these are important steps towards becoming a society where we are more connected to our food and to our communities. On the topic of sustainability and environmentalism, there are many benefits to growing your own food, such as: reducing carbon emissions, reducing waste (i.e plastic packaging), regeneration of soil through biodiversity, and avoiding the use of carcinogenic pesticides and fertilizers. In addition to being better for the environment, there are other potential social, psychological, and nutritional benefits to growing your own food as well. Growing ornamentals or other kinds of plants can also support a variety of wildlife. Gardening can be an opportunity to be more active, connect with nature, and save money. It can also be a good way to make a positive impact on your community and and presents many opportunities to learn new things. Lastly, it’s fun! :)</p>", "metacritic": null, "released": "2020-06-27", "tba": false, "updated": "2020-06-29T05:25:22", "background_image": "https://media.rawg.io/media/screenshots/ca6/ca6b5dc48e8c16858f271b6603d781c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Treelady"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}