{"id": 460212, "slug": "colmens-quest", "name": "Colmen's Quest", "name_original": "Colmen's Quest", "description": "<p><strong>Colmen's Quest</strong> is a turn-based fantasy RPG. You play as <em>Colmen</em>, an aspiring monster hunter, who is on a quest to unveil a dark threat that haunts the village of Valkirk. You will explore Valkirk and its villagers, descend dusky dungeons, fight monsters and eventually collect a bunch of loot and treasures.</p>\n<p>The game is inspired by classic Hack &amp; Slays like Diablo and turn-based RPGs like Rogue's Tale or Stoneshard, however it's <em>not </em>a roguelike game.</p>\n<p><em>The game is not finished yet and and what you can play is a demo of the first ~2 hours. You can support development by giving feedback. </em><em>See development section below.</em></p>\r\n\r\nCurrent features\r\n<ul><li>Pixelart look</li><li>Fully turn-based</li><li>Story &amp; quests</li><li>NPCs for trade and gossip</li><li>Progress your character with stats and new equipment</li><li>Choose from currently 16 very different skills<ul><li>From melee knockback over permafrost stuns to summoning minions</li></ul></li><li>No classes - you can mix skills and stats the way you like it</li><li><strong>Not a roguelike game</strong><ul><li>You can always 'Save &amp; Quit' and start again in the village. Your character progress is also saved every time you switch between levels.</li></ul></li><li>Currently 8 enemy types with different skills</li><li>Procedural generated dungeon levels<ul><li><em>Please note that in the current demo the dungeon layouts will not change on new games. This is for debugging reasons.</em></li></ul></li></ul>\n\r\nIn development\r\n<p>The game is currently in development. What you can play in this <strong>demo version</strong> is the beginning of the game including the first 4 dungeon levels and a couple of quests. It will take you about 2-3 hours to finish - depending on your experience with such kind of games.</p>\n<p><strong>PLEASE GIVE FEEDBACK</strong> on how you like the game overall, what you think about the difficulty, whether you have ideas for quests, skills or gameplay improvements... I'm really looking forward to read it all! The game can only get better with your support.</p>\r\nWhat you can expect in future releases\r\n<ul><li>Improved inventory management</li><li>More story content and quests</li><li>More locations</li><li>More skills and maybe even a different skill progression system</li><li>More enemies and combat variety</li><li>... your ideas and suggestions!</li></ul>\n<p>Leave a comment below or message me: play@colmensquest.com</p>\n<p>You can also follow me on Twitter: @coldi</p>", "metacritic": null, "released": "2020-06-26", "tba": false, "updated": "2020-06-29T05:41:57", "background_image": "https://media.rawg.io/media/screenshots/f0c/f0cc6ba1a70b6eb5c37e63796a9b8e89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["coldigames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}