{"id": 4602, "slug": "bulletstorm", "name": "Bulletstorm", "name_original": "Bulletstorm", "description": "<p>Bulletstorm is an FPS developed by People Can Fly and Epic Games.</p>\n<p>The game is set in the 26th century, where the universe is run by the Confederation. The player controls the commander of a black ops unit Grayson Hunt who went rogue after realizing that the unit was tricked into killing civilians by its&#39; superior, General Sarrano. 10 years pass when Grayson and his team come across Sarrano&#39;s cruiser, attempt to destroy it and crash land on a surface of a planet called Stygia which used to be a tropical-like resort. </p>\n<p>The game focuses heavily on combat and features a scoring system named Skillshot. Players gain points for every kill, the more creative the murder is - the more points one gets. Environmental kills are valued the most. Points are used as currency that can be used to upgrade your weapons, buy new ones or get ammunition.</p>\n<p>Players can carry three weapons with the assault rifle being the default one and can always be found in one&#39;s inventory.</p>\n<p>There is no competitive multiplayer in Bulletstorm, but co-op and score attack modes are available.</p>\n<p>On release, the developers made fun of other games in the marketing campaign. The dark humor was one of the defining aspects of Bulletstorm.</p>", "metacritic": 83, "released": "2011-02-22", "tba": false, "updated": "2024-04-21T17:46:26", "background_image": "https://media.rawg.io/media/games/b42/b42b05096de6668833bbab38f6099c6a.jpg", "website": "", "rating": 4.08, "rating_top": 4, "added_by_status": {"yet": 93, "owned": 2180, "beaten": 915, "toplay": 74, "dropped": 170, "playing": 9}, "playtime": 4, "achievements_count": 181, "ratings_count": 835, "suggestions_count": 699, "game_series_count": 1, "reviews_count": 836, "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PC"], "developers": ["Epic Games", "People Can Fly"], "genres": ["Action", "Shooter"], "publishers": ["Electronic Arts"], "esrb_rating": "Mature"}