{"id": 460340, "slug": "dream-data", "name": "Dream Data", "name_original": "Dream Data", "description": "<p>Today you start your new job doing data entry for Data Portal Inc. It's not the most exciting job, but it pays the bills. Each night, you go home, go to sleep, and have vivid dreams that let you escape your mundane life. However, sometimes the line between dreams and real life  start to get a bit blurred. Will you work hard and keep your job, or will you get out of touch with reality?</p>\n<p>Move with either WASD or the arrow keys, and interact with objects likes doors and beds with SPACE. If you ever want to wake, press Q. The game auto-saves at the start of a new day.</p>\n<p>The game was heavily inspired by Yume Nikki, and it was created for Dream Diary Jam 4. So like Yume Nikki, the game is mostly just about walking around and exploring dreams. However, there are a few significant changes in how this plays compared to Yume Nikki and most fan games.</p>\n<ul><li>There's a little bit more going on in the waking world, since you have to go to work each day.</li><li>You do not collect effects. Instead, you progress the story by finding different beds in the dream world. Each time you find a new bed, you can begin the next day. There are 10 days, so you must find 9 beds to get to the finale.</li><li>The nexus eventually has five doors, but initially there will be fewer.</li><li>While there are many areas, most of them are somewhat small, so you are less likely to get lost within a single area.</li></ul>", "metacritic": null, "released": "2020-06-26", "tba": false, "updated": "2020-06-29T06:13:31", "background_image": "https://media.rawg.io/media/screenshots/4b4/4b48bc1df28d6d8bd332d0d4ab8eb792.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tykenn"], "genres": [], "publishers": [], "esrb_rating": null}