{"id": 46057, "slug": "death-rings-of-jupiter", "name": "Death Rings of Jupiter", "name_original": "Death Rings of Jupiter", "description": "Death Rings of Jupiter is a 2d retro bullet hell shooter, set in the dense asteroid fields that make up the rings of Jupiter.<br/>It features original gameplay that mixes classic gravity games and platformers.<br/><br/>Hidden somewhere in the rings of Jupiter, there is treasure, and it's guarded by an infestation of alien monsters.<br/>You steal a ship, fire up your percolator and set the controls for the epic gas giant.<br/>While you dust off your trusty lasers, fear creeps into the back of your mind.<br/>No one that has gone into the rings of Jupiter has ever returned.<br/><br/>Game Features<br/><br/><ul><li>Chaotic bullet hell with hundreds of bullets and enemies on screen.<br/><br/></li><li>A mixture of fast paced battles and slower paced asteroid hopping space survival. Fun and challenging with a sprinkling of roguelike unfairness.<br/><br/></li><li>Retro pixel art graphics including 200 colourful pixel art aliens that burst into pixels when they die.<br/><br/></li><li>Governing physics that affects all in game objects. Gather momentum then cool your jets to drift through space and preserve fuel.<br/><br/></li><li>Hundreds of procedurally generated guns in each run. Double shot exploding sniper, rapid fire flaming quadshot and poisonous homing lasers!<br/><br/></li><li>Survive in space with limited fuel and oxygen. Fight your way onto asteroids to fill your air tank or you will quickly suffocate.<br/><br/></li><li>Gather fuel for your ship and follow your own path through the levels.<br/><br/></li><li>Take different strategic approaches to defeating the three bosses in each run.<br/><br/></li><li>Upgrade your character to survive. Increase your oxygen capacity to live longer in space, increase your max health, speed and more.<br/><br/></li><li>Loot chests for gold and special pickups, visit shops to buy or sell items and get new weapons.<br/><br/></li><li>Feel at home in empty space with a big sci-fi synth and drum soundtrack, by VI-RES.<br/><br/></li><li>Featuring beautiful title and end screen art by Illustrator Joyous Colley.<br/><br/></li><li>Inspired by classic games such as Gravity Force, Exile, Soldat, and Abuse.<br/><br/></li><li>Plays at 60 frames per second , with the option of a 30fps mode for older computers.<br/><br/></li><li>Built in auto-fire, no memory hacks required!</li></ul>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2020-01-24T14:25:43", "background_image": "https://media.rawg.io/media/screenshots/671/671ff965b4ed3cf3f619fac47e4250d1.jpg", "website": "http://wirehead.com.au/droj.htm", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Albatross Wirehead"], "genres": ["Action", "Indie"], "publishers": ["Albatross Wirehead"], "esrb_rating": null}