{"id": 460590, "slug": "super-bombinhas", "name": "Super Bombinhas", "name_original": "Super Bombinhas", "description": "Super Bombinhas is a colorful 2D platformer inspired by the old SNES classics. It features a story mode with 36 carefully designed levels to explore, each of them full of creatures, items and secrets. It also contains a level editor that lets you use every single element from the story mode to create your own adventures!<br/><br/>The Bomb Kingdom has been taken by the evil usurper Gaxlon and it's your mission to guide the Super Bombs to defeat him. However, only one of the Super Bombs escaped from Gaxlon's minions, so you'll need to rescue your friends before facing the powerful villain.<br/>You start playing as Bomba Azul, and as the story progresses and you free the other Super Bombs, you can play as them too! Each of the bombs has unique abilities - and personalities as well.<br/>You will travel across a great variety of scenarios, face tens of unique creatures and challenging bosses, all of that while enjoying an amazing, fully original soundtrack.<br/><br/>In the level editor you will be able to create as many levels as you want, using all the features from the story mode - spoiler alert!<br/><br/>- 36 levels distributed across 8 worlds and 15 scenarios<br/>- 50 unique enemy types and 7 bosses<br/>- 70 interactive objects<br/>- Over 30 original songs<br/>- Available in english, spanish, brazilian portuguese and esperanto<br/>- Controller support (keyboard needed to give a name to the save file)<br/><br/>Super Bombinhas is open source! Check it out on GitHub (victords/super-bombinhas).<br/>Join the Reddit community: https://www.reddit.com/r/SuperBombinhas.", "metacritic": null, "released": "2020-07-03", "tba": false, "updated": "2023-11-04T09:44:31", "background_image": "https://media.rawg.io/media/screenshots/bc7/bc73f7eba49cb4cb34ccb53486b914b6.jpg", "website": "https://github.com/victords/super-bombinhas", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["victords", "Victor David Santos"], "genres": ["Adventure", "Indie", "Platformer"], "publishers": ["Victor David Santos"], "esrb_rating": null}