{"id": 460552, "slug": "my-home-makeover-dream-design", "name": "My Home Makeover: Dream Design", "name_original": "My Home Makeover: Dream Design", "description": "Love home design &amp; makeover? Welcome to My Home Makeover! Play the best home design meets match 3 puzzle game! Help clients decide, design &amp; decorate their homes and transform their dreams into reality with amazing home makeovers! Solve fun match 3 puzzles to help design, decorate, renovate, restore, build, fix, flip and create the perfect dream home makeover with beautiful room decor. <br/><br/>The goal of the game is simple: design, decorate, create, makeover, flip, fix, renovate &amp; restore your client’s house, mansion or home &amp; play fun match 3 puzzles. Become the best home designer as lots of families are counting on you to restore, renovate their home down-and-out fixer uppers!<br/><br/>Game features:<br/><br/>* House Design: Open-ended addictive puzzle game-play. Various styles at your own disposal! Makeover, build, create, renovate, design, decorate, fix, flip and restore other people’s dream houses, mansions and homes all by yourself and make them happy!<br/><br/>* Express yourself: with an incredible variety of high-end designer furniture, lighting, flooring and other décor choices. Challenge your sense of design - adjust wall colors, flooring and furniture placements to harmonize the atmosphere. Customize every piece of your own furniture. The way you want! Any place in location, any color you choose! you decide!<br/><br/>* Renovate: Remodel homes, mansions, houses with traditional interior styles or go Modern? You decide, you design! Rebuild outdated interior designs into outstanding makeovers with bold accents, pops of color, stylish fixtures and finishes.<br/><br/>* Furniture Styles: Master all furniture styles and become a truly professional decorator, each client with his/her own design challenge! Renovate a variety of fixer uppers that need your interior design eye: kitchens, bathrooms, decks, living rooms, offices and so much more!<br/><br/>* Different Stories: Work with different types of client personalities. Help them create, design, decorate, restore, renovate, build, flip, fix and makeover their old homes, broken houses and outdated mansions into beautiful dream makeovers. <br/><br/>* Multiple houses / mansions / homes: Not satisfied with decorating, building, designing, creating or restoring only one mystery house and just one sweet fantasy story? We have plenty of simulation mystery houses for you to build, flip, design, craft, renovate, restore, create or decorate and have a blast! Design and renovate different room styles including family-friendly living rooms, rustic kitchens, stylish bathrooms, chic bedrooms, private study rooms, amazing office spaces and chilled out decks!<br/><br/> * Exciting match 3 levels: Play hundreds of fun challenging match 3 levels awesome boosters. You can create tons of powerful boosters, make magical combos to match and crush the crafty match 3 levels. More matching means more decor and more fun! Earn coins from the match puzzles to customize your client’s homes, houses, mansions with a variety of furniture and decorations.<br/><br/>* Rewards: Unlock multiple rewards and earn them as you impress your clients by decorating the home, house or mansion of their dreams with amazing beautiful makeovers.<br/><br/>* Frequent content updates: frequent, fresh and free story content updates with new opportunities to put your design, decorate, create, renovate, restore, build, fix and flip skills to use and create amazing makeovers!<br/><br/>You don’t necessarily have to be a house flipper or need to have any knowledge of house building, interior designing, decorating, creating, restoring, renovating or flipping.<br/><br/>What are you waiting for? Take on the decoration assignment! Use your own design style to make their dream home a reality. Let’s run the sweet memories lane and let’s start to design and decorate now! Come play the My Home Makeover! Time to show your designer talent for home-design in-game! Take the reins and bring your dream house to life now for free! Let’s walk down that lane and have a blast. My Home Makeover is a free to play game. Get it now for free!!", "metacritic": null, "released": "2019-12-03", "tba": false, "updated": "2020-07-03T02:21:04", "background_image": "https://media.rawg.io/media/screenshots/1c1/1c14e0be15f84138546824ce1692f63b_HIB7ECH.jpg", "website": "http://theholycowstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["RPG", "Puzzle"], "publishers": ["Romit Dodhia"], "esrb_rating": "Everyone 10+"}