{"id": 460568, "slug": "survival-fort", "name": "Survival Fort", "name_original": "Survival Fort", "description": "After the outbreak the virus rapidly spread worldwide and turned the majority of the world’s population into zombies. The desperate survivors were futile in the face of the such an overwhelming evil, but you will rise up and offer them hope. Taking the lead of a group of survivors, you will construct a base in an abandoned factory, and begin preparations to fight back. Along your journey you will upgrade your base into an impregnable fortress, protect and provide jobs for your residents, and venture into the wasteland to collect resources. You will also fight all types of enemies, from grotesque monsters to the even more treacherous lawless clans, make Alliances and fight alongside with other survivor groups, and ultimately battle the sinister Monarch Corporation, the instigator of the outbreak. The title of the king of the survivors awaits the victor.<br/><br/>Build Your Base <br/>-  Build a fortress base for your survivors in your image, building everything ranging from barracks and garages to power stations and coal mines. <br/>-  Venture out into the hostile wasteland to collect resources to construct your base. <br/>-  Rescue survivors and make them residents of your base. Residents will take up jobs, fight for you in battle, and procreate to increase your base’s population. <br/><br/>Engage in Epic Battles<br/>-  Command a team of diverse heroes in battle, including characters such as a fearless samurai, a gunslinger cowboy, a seasoned cop and a seductive nurse.  <br/>-  Recruit and train your troops, build armored vehicles, and send ferocious motorbike units to annihilate your enemy.  <br/>-  Engage in heroic fights to the death with savage monsters and treacherous enemy clans, as you continue to explore the strange and hostile wasteland.   <br/><br/>Fight for Honor<br/>-  Battle alongside other players by either creating or joining Alliances, and face the wasteland together. <br/>-  Compete with and plunder resources from antagonistic clans and conspirator groups who are hell bent on your destruction. <br/>-  Engage in dramatic battles for land, resources and honor, as you fight for the title of champion of the wasteland. <br/><br/>Take care Captain – The battle for survival has begun<br/><br/>FACEBOOK：https://www.facebook.com/SurvivalFort/<br/>CS：survivalfort2020@gmail.com", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2020-07-03T02:26:51", "background_image": "https://media.rawg.io/media/screenshots/0ee/0ee5a3875f5d4c49e9c3175721f5d305_MIQ4pj0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RJOY"], "genres": ["Strategy"], "publishers": ["RJOY HOLDINGS"], "esrb_rating": "Teen"}