{"id": 460522, "slug": "moonray", "name": "Moonray", "name_original": "Moonray", "description": "<p>Moonray is a 3rd-person action RPG set in a surreal sci-fi world. Explore a beautiful and deadly landscape on a quest to recover the sacred element and regain control of the planet.</p>\n<p>Featuring a world-class soundtrack by renowned producer Ten Walls and incredible story by comic artist virtuoso Grim Wilkins, Moonray is a stunning journey with intense combat and an unforgettable style.<br />\nUpgrade abilities, weapons and skills to survive the brutal onslaught of the cult. Fight through large, open spaces and tight, intricate corridors as in a titanic struggle to recover the sacred element miium.</p>\n<p>Explore a surreal, sci-fi landscape to unlock all of the hidden mysteries in Moonray.</p>\n<p>Early Access<br />\nAvailable soon in Early Access, Moonray has a planned release date of Summer 2021.</p>\n<p>Please note: Early Access is available at a special discounted price which will increase at launch. During Early Access, prices may also increase to reflect the level of content provided.</p>\n<p>Disclaimer: the content shown here is alpha and may change significantly or be removed entirely from the final game. Not all content will necessarily be included in the entire Early Access period.<br />\nExplore an incredible world</p>\n<p>Moonray is full of stunning, surreal environments. Take the fight to a fierce religious cult in the heart of their holiest shrine complex. Each world features a unique biome with the incredible religious architecture of the cult.</p>\n<p>The element miium contains incredible power. The cult has unlocked many of its secrets, allowing it to create incredible holy temples and shrines.</p>\n<p>Explore the incredible landscape thoroughly to find the resources needed to upgrade. The enemies will get very tough, very quickly, unlocking new strengths and abilities will be crucial to survival.</p>\n<p>Beams are spread throughout the enormous levels, allowing fast travel to any unlcoked beam.</p>\n<p>Story<br />\nMany millennia ago…<br />\nThe Ur-being Iltar unlocked the secrets of the element miium. Mastery of the element gave her god-like powers but it was never enough. Over the centuries she completely conquered the galaxy, looking for every source of miium that she could find.</p>\n<p>Channeling the awesome creative force of the element allowed her to mold planets, craft solar systems and create new lifeforms. She dominated the stars and reigned supreme for millennium after millennium.</p>\n<p>But in one of the many worlds she had long forgotten about… a civilization stirred. Discovering the incredible possibilities of the element, they came to worship it and remember the creator that had shown them its true potential.</p>\n<p>A cult arose, as thirsty for miium as Iltar herself.<br />\nUsing the sacred element to mold themselves in the image of their god, they sought to gain the same powers she had long ago unlocked.</p>\n<p>Eventually, Iltar awoke from her divine slumber. She sensed her control over miium was slipping. Someone was looking for her.</p>\n<p>Traveling to the cult’s homeworld, she soon found herself trapped.<br />\nImprisoned and worshipped as an god by the masses, while the high priest and his acolytes attempted to uncover her secrets, she was helpless.</p>\n<p>All was not lost, however.<br />\nSecretly she created a new lifeform, one powerful enough to find and free her.<br />\nThe cult had grown strong and was rapidly advancing.<br />\nSoon they would no longer have any need of her.<br />\nBut if her new guardian could reach her time…</p>", "metacritic": null, "released": "2021-03-31", "tba": false, "updated": "2022-03-07T03:05:36", "background_image": "https://media.rawg.io/media/screenshots/feb/feb3835285adce5e1da70322e785c7f2.jpg", "website": "https://moonraygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Everything is Full of Gods", "Element 115"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Element 115"], "esrb_rating": null}