{"id": 460538, "slug": "shadow-knight-2", "name": "Shadow Knight", "name_original": "Shadow Knight", "description": "Harmonia used to be a bright world of all races, where Human, Orc, Spirit, Dwarf, Beast man and Elf live in peace together. One day, when deep desires arose, the dark forces ascended from hell, invading the world, that tragedy struck on every Harmonia citizens and made everything sank to the depths of despair.<br/><br/>Play the role of Noah - a Shadow Knight, you need to make your way through the hell gate, fight evil enemies, defeat the immortals of Darkness and bring back the light to Harmonia. You will find Ashley and Lucius - your companions on the journey saving Harmonia!<br/><br/>Download and Join the fight now!<br/><br/>GAME FEATURES:<br/><br/>▶ The True Feeling of an Action RPG Game<br/>Experience the action RPG game feeling with hack and slash gameplay in the dark fantasy world setting. There are 10 maps from The Stream City, Shadow Forest to Capitals of The Mortals, and they are still updated. <br/><br/>▶ Watch out the monsters and bosses!<br/>With the absence of light, evil reveals its true form. <br/>Monsters in each place have different shapes, skills, and stories behind. Sometimes you have to take them down even when you're the weaker. Beware of skeletons, elves that can control your body and your mind, be sure to use skills with the right combo, dodge their attack wisely. <br/><br/>Bosses have their stories as well. They are giant Kings of the dark lands with sturdy physique, robust strength, and particular abilities. Facing them requires more than just powerful stats. <br/><br/>▶ Fight with multiple choices<br/>Fight the way you want as you can choose your own unique heroes, determine your favorite fighting style among slashing a big sword, shooting slugs, or piercing invisible spears. In each match, you can pick 2 characters to play and they can be readily switched. <br/><br/>Keep in mind that Each hero can knock the enemy up, knockdown, toss back,...<br/>Dodging smoothly, controlling enemies effectively, and using skills combo calmly is the key to win every battle<br/><br/>▶ Embark on a horrid but fascinating adventure!<br/><br/>Not only you, we also get bored with the limit of horizontal gameplay only mode. <br/>In Shadow Knight, you will go on a journey with different terrains by running, climbing, jumping, where you will confront more danger, further difficulty, and additionally have chances to get more rewards in return as we put some easter eggs and hidden rewards along the way. <br/><br/>▶ Interact with others and show the world your skills<br/><br/>You will be immersed in endless dark fantasy shadow battles. Beside towns, forests, dungeons, as an online game, you can interact with others unlimitedly, engage in endless battles with tremendously competitive and merciless battlefields such as Survival, World Boss, PVP Arena,... These features will be available soon!<br/><br/>▶ Gear Up In Style<br/>Collect the best weapon, equipment, rune from hundreds of items, then fully customize your Shadow Knight to stand out from other knights. Join the adventure and create craziest combats 'cause Your Knight, Your Style! <br/><br/>▶ Easy In Upgrading<br/>While you're away, your knights are still being trained and collecting resources to upgrade. When you're back, they will be stronger, gain new levels, learn new skills. Grow and train a powerful team and ready for battles!<br/><br/>ACE THE SHADOW!<br/><br/>* Follow us on social media for more information and get support:<br/>Facebook: https://www.facebook.com/shadow.knight.rpg<br/>Email: shadowknight@fansipan.hk <br/><br/>* Notice:<br/>Shadow Knight is an online game and requires a stable internet connection.", "metacritic": null, "released": "2020-06-24", "tba": false, "updated": "2020-07-03T02:16:35", "background_image": "https://media.rawg.io/media/screenshots/f5d/f5d2e612dabf97bf51d11e11f004219e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fansipan"], "genres": ["Action", "RPG"], "publishers": ["Fansipan"], "esrb_rating": "Everyone 10+"}