{"id": 460641, "slug": "towers-monsters", "name": "Towers & Monsters", "name_original": "Towers & Monsters", "description": "<p>In a faraway universe, four nations live together and in peace for a long time. The Humans, Elves, Goblins and Fairies live and work together in four different continents. </p>\n<p>After decades and decades of peace, on an unknown part of the world, a breach guiding to the hell has opened suddenly… These breaches were opened by the son of Guld'An, lord of darkness, in order to expand the kingdom of shadows. The evil forces from the hell have begun to cross the oceans in order to take control of all the continents.</p>\n<p>But you are not lost here, as the Major of the army, you trained for years thinking about what could happened to your kingdom and people. Now is the time to practice what you have learned; you’ll take control of the battlefield and defeat all these evil forces. Build and place your towers, upgrade them, block the enemy units with thick and strong walls and force them to cross some heavily guarded paths…  <br/><br/></p>\n<p>But do not underestimate enemy forces: they are strong, smart and they’ll for sure outnumbered you.<br/>You’ll have to be smarter. You’ll defend your territory whatever it costs. During every battle, no matter if you lose or win, you’ll learn about your mistakes and become stronger. <br/> <br/>The war will be long and difficult. But you’ll fight for your people.</p>\n\n<p>Made by:</p>\n<p>Alexandre Sachs: https://github.com/SachsA</p>\n<p>Charles Descoust: https://github.com/Artoliz</p>\n<p>Kellian Cipierre: https://github.com/K6PIR</p>\n<p>Raphaël Guy: https://github.com/Rafskoz</p>", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2020-07-03T02:42:11", "background_image": "https://media.rawg.io/media/screenshots/354/35416eef85afbd1ac846e93be215150e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SachsA"], "genres": ["Action"], "publishers": [], "esrb_rating": null}