{"id": 46072, "slug": "block-warriors-open-world-game", "name": "BLOCK WARRIORS: \"Open World\" Game", "name_original": "BLOCK WARRIORS: \"Open World\" Game", "description": "<ul>\n<li>Block Warriors - a open-world game in a cubic style. You have the whole city called Voltorn City, filled with<br />\nEntertainments and dangers! Your goal is to climb the career ladder and establish your empire in two different ways!<br />\nYou can legally earn, acquire businesses, real estate and just work at a construction site or take in<br />\nhand arms, become a leader of a criminal group and rob a bank!  </li>\n<li>Full customization of the character.<br />\nBuy clothes of various kinds, accessories or you can go to the barber shop and completely change the image.  </li>\n<li>Buying business.<br />\nOn the bank account accumulated a little money? Put them into business and manage it! In Voltorn City there are many types of real estate!<br />\nFrom a simple bar, to an office or a club!  </li>\n<li>Buying a property.<br />\nIf you have nowhere to live, then the realtor agency offers you several types of houses and apartments! Buy real estate,<br />\nFrom the room in the hotel to a two-story house on the edge of the city, built in a modern style!  </li>\n<li>Robbery.<br />\nEvery shop can be robbed. Be it a grocery or a bank! Each institution has a cashbox and a safe. Before<br />\nRobbery you will have to stock up on a drill! Don&#39;t forget about weapons! You have to deal with the police and special forces of Voltorn City!  </li>\n<li>Gang Wars.<br />\nYour gang has a hierarchy! You must get gang respect, helping to clear the territory of the bandits. The higher your rank,<br />\nThe more revenue will go to you!  </li>\n<li>Garages, car tuning, auto show.<br />\nTired of joyriding? Buy a garage and a car in the showroom! Tuning-garage provides repair services<br />\nand tuning. You can change the color, improve the engine, install neon and much more!  </li>\n<li>Explore the game world in third or first person!<br />\nIn the future, we will add an online mode and expand the city!</li>\n</ul>", "metacritic": null, "released": "2017-08-28", "tba": false, "updated": "2023-05-15T10:55:53", "background_image": "https://media.rawg.io/media/screenshots/732/732c593a90f9d5ff6130cf638ef9ed75.jpg", "website": "https://kolyadementev93.wixsite.com/blockwarriors", "rating": 3.0, "rating_top": 5, "added_by_status": {"owned": 25, "toplay": 3, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Voltornas Games"], "genres": ["Action", "Adventure", "RPG", "Racing"], "publishers": ["Voltornas Games"], "esrb_rating": null}