{"id": 460857, "slug": "o-horror-amarelo", "name": "O Horror Amarelo", "name_original": "O Horror Amarelo", "description": "<p>Um jogo para download em: <strong>Windows, MacOS, Linux.</strong></p>\n<p>\"Está é uma versão Demo\"</p>\n\n<p>Angela é uma jovem que sofreu diversos traumas em sua infância e adolescência, sua vida é mergulhada em pesadelos e crises de ansiedade. Após ser encaminhada para um hipnólogo e psicoterapeuta por sua psicóloga, a jovem começa uma jornada através de suas lembranças, em busca de uma cura para seus problemas. O que ela não sabia era que essa viagem interna iria despertar e trazer à tona terríveis segredos, medos ocultos que flertariam com a escuridão e a insanidade da mente humana... diante dos olhos atentos de mistérios inomináveis que vagam nas sombras do cosmo.<br/></p>\n\n<ul><li>Um mergulho no psicológico fraturado de uma jovem atormentada por seus fantasmas internos.</li><li>Desafios e quebra cabeças aplicados por um subconsciente que não deseja se lembrar dos traumas dos passado.</li><li>Evite os monstros da sua mente e os reais que lhe espreitam nos cantos escuros.</li><li>O Inominável te espera pacientemente que cometas um único erro para te levar ao delírio e insanidade.</li><li>Faça escolhas ao longo de sua jornada e determine o seu destino final.</li></ul>\n<p>Explore os ambientes,  encontre as saídas, se esconda dos monstros, monte o quebra cabeça de sua mente e desvende sua história pouco a pouco. Acompanhe a perspectiva de seus inimigos e compreenda seu lugar de no imenso tabuleiro cósmico regido pelos Grandes Antigos e Deuses Exteriores.</p>\n<p><em>O medo é o alimento que a mente precisa para mostrar tuas fraquezas...</em></p>", "metacritic": null, "released": "2020-07-02", "tba": false, "updated": "2020-07-03T03:27:09", "background_image": "https://media.rawg.io/media/screenshots/f3f/f3f3b0abfdec684e314509e5e6c31aa9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["oz_production"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}