{"id": 460825, "slug": "crypt-shyfter-the-classic-series-2017-2019", "name": "Crypt Shyfter: The Classic Series (2017-2019)", "name_original": "Crypt Shyfter: The Classic Series (2017-2019)", "description": "<p><em>Between the time when the oceans drank Kadabra, and the rise of the mighty Ikkagu, there was an age undreamed of! A time when computer games lacked graphics and were made purely of text! Some proud gamers equate these barbaric adventures to primitive cave drawings, but these primordial works of art were the first stepping stones that led to the RPGs we know and love today. Let me tell you of the days of high adventure!</em></p>\n<p><strong><em>Crypt Shyfter</em></strong> is a series of sci-fi, fantasy, and western text adventures set in an absurd universe filled with arcade machines, shapeshifting cyborgs, and pizza. As the hero of Azmar, it will be your job to save the peasants and destroy the evil space-faring Shyfters.</p>\n<p>This bundle contains all 28 of the original <strong><em>Crypt Shyfter</em></strong> adventures. Your download will contain a zipped folder with 2 separate file types:</p>\n<p><strong>HTML:</strong> These files will launch in a web browser. For optimal play experience, please launch the games using one of these supported browsers. Using a browser that is not officially supported may result in compatibility issues.</p>\n<p><em>Note: Browser updates may cause games to break or lose functionality. I am no longer updating the games to keep them compatible with modern web browsers.</em></p>\n<p><strong>.EXE:</strong> These files can be installed on your PC and will launch just like any other program or app.</p>\n<p><em>Note: .EXE files are for Windows only. These files will not launch on any other devices.</em></p>\n<p>Visit www.videogamepizza.com for more <strong><em>Crypt Shyfter</em></strong> adventures!</p>", "metacritic": null, "released": "2020-07-02", "tba": false, "updated": "2020-07-03T03:21:30", "background_image": "https://media.rawg.io/media/screenshots/d5a/d5a1acbf1ec923e44fff568dad57f05d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["videogamepizza"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}