{"id": 46099, "slug": "wizard-hunter-2348", "name": "Wizard Hunter 2348", "name_original": "Wizard Hunter 2348", "description": "Wizard Hunter 2348 is a stealthy cover shooter about battling armies of wizards who will summon tough demons when alerted. The game features a full set of stealth mechanics in much the style of certain AAA stealth games. Enemies individually keep track of where they think the player is and can communicate this by shouting to each other. You can get them to look the other way through judicious use of dead bodies and throwing rocks- er, rockets.<br/><br/>In the hidden corners of the world, on scattered planets throughout the nation of the United Galaxies, there lurks a criminal element: Wizards. These wretched villains immerse their minds in the Chaos Matrix, calling forth fell beings from beyond space itself into our mortal realm without first acquiring the correct licenses. As a member of an elite commando branch of the Immigration Services department, it is your privilege and duty to bring down any demon-summoning wizards who have not first acquired visas for the demons they summon.<br/><br/>In the words of your drill sergeant at the Bureaucratic Training Academy: \"If I say 'Jump', you say 'How high?' If I say 'Demons work tirelessly for the betterment of all without needing food or rest', you say 'Where are their visas?'\"<br/><br/>Wizard Hunter 2348 features:<br/><br/><ul><li> A hand-crafted campaign lasting maybe 4 hours or so.<br/><br/></li><li> Multiple playable characters: Tank Hunter, Zero-Tank Hunter, and Traitor Wizard<br/><br/></li><li> Dozens of unique attacks to unlock, like Whirlwind, Grappling Hook, Shovel, and Blasterbuss<br/><br/></li><li> A variety of wizards and demons to deal with<br/><br/></li><li> Splitscreen co-op with co-operative dialogue trees<br/><br/></li><li> A built in level editor</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:58", "background_image": "https://media.rawg.io/media/screenshots/f54/f547aae9fffc584828840e5b0a85762c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Foxwarrior Productions"], "genres": ["Action", "Indie"], "publishers": ["Foxwarrior Productions"], "esrb_rating": null}