{"id": 46104, "slug": "neon-the-ninja", "name": "Neon the Ninja", "name_original": "Neon the Ninja", "description": "Neon the Ninja is a 2D, punk rock, anti-everything-corrupt-in-the-world, action/ stealth game that tasks the player with a hit-list of the eight most vile leaders in the world. Slash your way through everything that moves; dive into neon signs for camouflage; or maybe do a little bit of both (who would we be to judge...that's Neon's job).FEATURES<ul><li>Mega Man-like Progression and Upgrades<br/></li><li>Hand-Drawn Cartoon Art-Style<br/></li><li>Intense Boss Battles<br/></li><li>Dynamic Soundtrack<br/></li><li>Leaderboards for Hardcore Speedrunning<br/></li><li>Gamepad Support</li></ul>NON-LINEAR GAMEPLAYA boss select screen that lets players choose the order they’ll take down the bosses, making each play through of the game unique. Defeating bosses will unlock different items leading players to develop their own strategy.\u2028 (or googling one)ARTSTYLEEverything in Neon the Ninja is drawn by hand. This means every movement Neon makes is animated from a series of individual drawings, not Flash or any other animation shortcuts.INTENSE BOSS BATTLESWe want every boss battle to feel special and be chock full of “OH SHIT” moments. While these fights are going to be tough they also need to feel fair.DYNAMIC SOUNDTRACKIt’s only fitting that Neon slays enemies to a soundtrack that equally slays the player. Expect lots of driving guitar- and synth-based music influenced by the game’s unique environments.MODERN LOOK, RETRO FEELThough we love retro video games, we recognize that re-creating every aspect of ‘80s and ‘90s games isn’t what we want to do. Meaning: the games of that era weren’t designed to have “pixel art and chiptunes.” Pixel art and chiptunes were simply the tools available to the developers at the time.<br/> <br/><br/>Instead of trying to re-create the audio/visual aesthetic of our beloved retro games, then, we’re focusing on achieving the SPIRIT of classic games like Ninja Gaiden and Mega Man while using the modern tools of Wacom tablets and real musical instruments.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:58", "background_image": "https://media.rawg.io/media/screenshots/a1d/a1d983644fd3f1829ce632909abe80ce.jpg", "website": "http://www.neontheninja.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["New 90's Games"], "genres": ["Action", "Indie"], "publishers": ["New 90's Games"], "esrb_rating": null}