{"id": 461182, "slug": "the-megastyle-4k-craptastic-bundle", "name": "The Megastyle 4k Craptastic Bundle", "name_original": "The Megastyle 4k Craptastic Bundle", "description": "<p><em><strong>Reset64 Magazine</strong> is for the third time arranging a Commodore 64 game coding competition where the game must be under<strong> 4 kilobytes size</strong>.  The members in <strong>Megastyle</strong>  have been competing in this competition both in 2016 and in 2018. This year, 4 of our coders have together with our graphics and music artists made 7 games.</em><br/><br/><br/><strong>SWYDS</strong><br/>Game programmed by Jamie Fuller<br/>Music composed by Roy Widding</p>\n<p><em>-\"Do you still shower with your dad simulator is our c64 4k version of the steam cult classic from Marbenx. Use joystick port 2 and choose between 3 different kids, and make sure you dont run into the wrong dad shower. Watch our for slippery floor and soap\"</em><br/></p>\n<p><strong>JUMP:<br/></strong>Game programmed by Kåre Johansen <br/>Animation and music made by Roy Widding</p>\n<p><em>-\"Jump is our first stickman adventure game. You are controlling 2-4 players at the same time, running on a line, trying to avoid obstacles. The more players you control the more focus and concentration you need. Easiest to play on real hardware as controls are F1, F3, F5 and F7 - matching the same floor as the running stickmen\"</em></p>\n<p><strong>FIGHT:<br/></strong>Game programmed by Kåre Johansen<br/>Animation and chars by Roy Widding<br/>Music composed by Magnar Harestad</p>\n<p><em>-\"Fight is the second stickman adventure game from Megastyle. You are controlling two swordmen who is under constant attack from a ninjastar throwing warrior, and you have to knock away the stars. Controls are keyboard only, use F1 or F3 to hit\"</em></p>\n<p><strong>FALL : <br/></strong>Game programmed by Jamie Fuller.  <br/>Sprites and background by Roy Widding  <br/>Music composed by Anders Rodahl</p>\n<p><em>-\"Fall is the third stickman adventure game from Megastyle where you are playing two men sliding down two endless holes, while you avoid sharp saw blades that will cut you in pieces. The game needs full concentration as you have to controll both men  at the same time. Controls are keyboard only, use keys  Z and M to jump with left and right man.\"</em></p>\n<p><strong>KUNG POO FIGHTER:<br/></strong> Game programmed and all graphics by Roy Fielding<br/>Music arranged by Roy Widding in the DMX mini player</p>\n<p><em>-\"Use joystick in port 2 to control the Kung Poo Fighter and protect him from all the flying toilet rolls. Did you enjoy classicslike International Karate? Then you will love this!!  Kung Poo Fighter is Roy Fieldings first game for Megastyle.\"</em></p>\n<p><strong>JUMPIN' JALOPIES:<br/></strong>Game programmed by Chris Stanley<br/>Cars made by Roy Widding<br/>Music composed by Magnar Harestad and Roy Widding in the Magsid player.</p>\n<p><em>-\"Use joystick left right to turn your vehicle and press fire to activate the hydraulics. Jump between the floors in the parking house and get your car to the top floor where the only free parking spot is.\"</em></p>\n<p><strong>FLAPPY SPACE:<br/></strong>Game programmed by Jamie Fuller.  <br/>Sprites and background by Roy Widding  <br/>Music composed by Magnar Harestad</p>\n<p><em>-\"Welcome to another Flappy Genre game, fight gravity and blast alien ufos by pressing firebutton . Flappy Space is based on a Pico8 game made by Serendipity.\"</em></p>", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2020-07-03T04:32:58", "background_image": "https://media.rawg.io/media/screenshots/899/89909703a4330b9a977254ed4ace2548.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Megastyle"], "genres": [], "publishers": [], "esrb_rating": null}