{"id": 46114, "slug": "dreamworks-voltron-vr-chronicles", "name": "DreamWorks Voltron VR Chronicles", "name_original": "DreamWorks Voltron VR Chronicles", "description": "Enjoy an immersive Voltron narrative that places you in iconic locations from DreamWorks’ “Voltron: Legendary Defender”, alongside your favorite characters. Pilot the Blue Lion in fierce space battles, stand on the bridge of the Castle Ship and solve interactive puzzles and challenges along the way. When Lance discovers the remains of a lost alien race deep within enemy space, he releases an unstoppable force that threatens the Paladins and Voltron. Jump into the heart of the adventure, fight back against the corrupt force of Zarkon, and unravel the ancient mystery in this epic intergalactic experience.<br/> <br/>In DreamWorks Voltron VR Chronicles, the fate of Voltron and the Universe rests in your hands!<br/> <br/><br/><strong>Features </strong><br/><br/>•\tBased on the hit Netflix TV series, DreamWorks Voltron VR Chronicles features a brand new story set in the Voltron: Legendary Defender Universe<br/>•\tDynamic virtual reality storytelling techniques provide a new way for users to experience Voltron <br/>•\tBeautifully rendered environments and characters instantly transport you into the bright colored, animated visual style <br/>•\tImmersive, interactive moments will demand that you take control of the Blue Paladin, Lance!<br/>•\tTake part in interactive missions where you’ll pilot the Blue Lion. Use advanced technology to battle Zarkon and his Galra empire forces<br/>•\tEncounter highly engaging puzzles that serve to push the narrative forward <br/><br/> <br/><strong>Witness Surroundings &amp; Massive Battles in a 360° VR Setting </strong><br/><br/>View your surroundings in a full 360° setting providing a definitive and up-close look at the environments, the visual effects and the Voltron Lions themselves. The experience also allows for the user to enjoy immense battles against the likes of a Robeast and Galra Command Ships.", "metacritic": null, "released": "2017-09-26", "tba": false, "updated": "2019-08-28T22:04:58", "background_image": "https://media.rawg.io/media/screenshots/884/8847ce9a95276dead9dd71a07c14134c.jpg", "website": "http://vr.digitaldomain.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11}, "playtime": 1, "achievements_count": 29, "ratings_count": 1, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["Digital Domain", "Digital Domain Interactive"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Digital Domain"], "esrb_rating": "Everyone 10+"}