{"id": 461147, "slug": "neurogame", "name": "Neurogame", "name_original": "Neurogame", "description": "Do Androids Dream of Neurogames?\r\n<p>Recently, more and more news and articles have appeared about neural networks and their use in applied tasks. Neural networks are rapidly developing and quickly taking on huge chunks of routine (and not only) human work for themselves. Already, some algorithms are capable of generating stories, music, images of characters, faces, landscapes, cats and other art, which some time ago seemed feasible only to humans.</p>\n<p>Often paying attention to this recently, I could not help but wonder: what will the games created by neural networks look like? And in order to answer this question, I decided to conduct a small experiment: create a game in which almost all of the content will be created by computer algorithms (mainly neural networks)! To think for a long time over the question “in what genre will the game be?” it wasn’t necessary: since at the moment well-known neural networks work best with faces, landscapes and music, the choice in the direction of something similar to a visual novel came by itself.</p>\r\nWhat content was the neural network responsible for?\r\n<ul><li>Generation of a <strong>story</strong> using a neural network Porfirevich (GPT-2 trained in Russian literature).</li><li>Creating <strong>faces of characters</strong> and <strong>backgrounds</strong> was created using Artbreeder.</li><li>MuseNet was involved in the writing of <strong>music</strong>, because I did not find any better free analogues, the results of which could be used in games.</li><li><strong>Sound</strong> generation was entrusted to the SFXR.</li></ul>\r\nWhat came out in the end?\r\n<p>Of course, you can’t call it a game created entirely by a computer, since a part of the work remained for the person (that is, me):</p>\n<ul><li>enumeration of different generated options to maintain communication between the individual elements of the game;</li><li>game code programming;</li><li>creating an interface.</li></ul>\n<p>However, I think an interesting experiment has come out that can show what <strong>neurogames</strong> can be. If you want, you can play the game and evaluate the result of the joint work of a computer and a person.<br/></p>", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2020-07-03T04:26:27", "background_image": "https://media.rawg.io/media/screenshots/ebd/ebdd735f9a48f09cafe228334ff378f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["BetelgeuseMan"], "genres": [], "publishers": [], "esrb_rating": null}