{"id": 461146, "slug": "magipanels", "name": "Magipanels", "name_original": "Magipanels", "description": "<p>Gameboy&#39;s 2020 GOTY<em><br />\nMagipanels is a new take on the match 3 genre where you increment either a row or a column of panels, attempting to match 3 or more adjacent panels of the highest value. But be careful. If you increment a panel too many times, you&#39;ll take damage and render that panel unusable for the rest of the game.<br />\nWith a total of 3 characters, 5 panel skins, and 3 songs, you can customize your play experience to suit your style.How to playIncrement the panels until you get them to their highest value (5 for the default dice-themed skin). When you get 3 or more adjacent panels with the highest value, they turn into point tiles (the rabbit in the hat for the default dice-themed skin). Increment a score tile to earn 1 point, and to refresh it to a panel of a random value. Rinse and repeat as you strive to earn a high score.<br />\nIf you increment a panel that&#39;s already at the max value, you&#39;ll take 1 heart of damage and that panel will be unusable for the rest of the game (the &quot;X&quot; in the default dice-themed skin).<br />\nIf you lose all 7 hearts, it&#39;s game over!<br />\nDownload it today!<br />\nCheck out that amazing 144p dice roll animation! Or, rather, check out a single frame from said animation!<br />\nI shouldn&#39;t be showing you these unlockable spoilers, so don&#39;t tell anyone that you saw them early.<br />\nContrary to popular belief, QuestionMan is not a playable character.<br />\nWhat motivates you to keep playing? High scores? Unlockables? It doesn&#39;t matter, because Magipanels has both!<br />\n</em>As determined by a panel of esteemed gaming experts, of which I&#39;m the only member.</p>", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2024-01-02T03:23:33", "background_image": "https://media.rawg.io/media/screenshots/e16/e1611d76c0b9786107ac64025de3f73f.jpg", "website": "https://incube8games.com/products/magipanels-gb-digital-edition?_pos=2&_psq=magipanels&_ss=e&_v=1.0", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Game Boy", "PC"], "developers": ["Bownly"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}