{"id": 461264, "slug": "octavia-kadkgame", "name": "Octavia (KADKGAME)", "name_original": "Octavia (KADKGAME)", "description": "The Art Direction Project, was a collaboration between the Master and Bachelor students at KADK.<br/>The goal was for all students to try working as in a team with a formal structure on a 3D project. The students were tasked with setting up and managing a workflow and production pipeline within their team, and students were asked to volunteer for preferred development roles before the project started. <br/>Two separate project were created by five teams consisting of both bachelor and master students, both of which were based on the book Invisible Cities by Italo Calvino, where students had to select a description of one of the cities to base their 3D project on.<br/>The projects were created in Unity, and the usage of online assets were permitted.\r\n\r\n<em>Octavia, from Invisible Cities by Italo Calvino.</em><br/><br/><em>Now I will tell how Octavia, the spider-web city, is made. There is a precipice between two steep mountains: the city is over the void, bound to the two crests with ropes and chains and catwalks. You walk on the little wooden ties, careful not to set your foot in the open spaces, or you cling to the hempen strands. Below there is nothing for hundreds and hundreds of feet: a few clouds glide past; farther down you can glimpse the chasm’s bed.</em><br/><br/><em>This is the foundation of the city: a net which serves as passage and as support. All the rest, instead of rising up, is hung below: rope ladders, hammocks, houses made like sacks, clothes hangers, terraces like gondolas, skins of water, gas jets, spits, baskets on strings, dumb-waiters, showers, trapezes and rings for children’s games, cable cars, chandeliers, pots with trailing plants.</em><br/><br/><em>Suspended over the abyss, the life of Octavia’s inhabitants is less uncertain than in other cities. They know the net will last only so long.</em>\n\r\nProject 1 - Week 1 &amp; 2\r\nGroup 5 members\r\n<p>Cille Abilhauge - Art Director</p>\n<p>Jan Janiszewski - Lead Artist</p>\n<p>Johan Christiansen - Tech Artist</p>\n<p>Tomasz Wieloch - 3d Artist</p>\n<p>Christoffer Stahlschmidt - Concept Artist</p>\n<p>Linnea Ronnenberg - Texture Artist</p>", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2020-07-03T04:50:38", "background_image": "https://media.rawg.io/media/screenshots/22e/22e2e5c1a588fc4c6bd380751d5c581c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KADKGAME"], "genres": [], "publishers": [], "esrb_rating": null}