{"id": 461376, "slug": "nearest", "name": "Nearest", "name_original": "Nearest", "description": "<p><strong>What is Nearest?</strong>             </p>\n<p>    In an urban center located in an unnamed city, na runner with no name jumps between buildings to escape the city now dominated by machines that monitor the existence of human life everywhere, your goal is to run as far as you can, you don't will want to hit one of them ...</p>\n\n<p><strong>Basic controls:</strong>\n</p>\n<p>Up -&gt; Jump\r\n  </p>\n<p>Down -&gt; Performs a roll\r\n  </p>\n<p>Escape -&gt; Quit the game\r\n</p>\n\n<p><strong>Score:</strong>\n</p>\n<p>    The score will be generated during the race, the longer the player stays without losing the game, the higher his score will be increase. At the end of the game, the last score will be saved and can be seen even after the game is closed.\r\n</p>\n\n<p><strong>Enemies</strong></p>\n<p>    During the game, two types of enemies will be found. Each enemy behaves differently and your goal is to avoid colliding with them, these enemies are:  </p>\n\n<p><strong>Airborne enemies:</strong>\n</p>\n<p>    Airborne enemies will move in one or two directions that may or may not be randomly defined, the player will have to predict his trajectory to decide which movement (Jump or Roll) will be necessary to dodge the enemy, when the player hit the enemy he will automatically lose .\r\n  </p>\n\n<p><strong>Ground enemies:</strong>\n</p>\n<p>    Ground enemies will not move and their appearance will be random throughout the race, the player must jump over him to prevent contact with him, when colliding with him the player will also automatically lose.\r\n</p>\n\n<p>Projeto do Centro Universitário Vale do Salgado - Univs / Desenvolvimento de games</p>", "metacritic": null, "released": "2020-06-29", "tba": false, "updated": "2020-07-03T05:14:38", "background_image": "https://media.rawg.io/media/screenshots/909/9091a8322a41c5fd8e2e56c337290909.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Luis Frota"], "genres": ["Action"], "publishers": [], "esrb_rating": null}