{"id": 46141, "slug": "land-of-livia", "name": "Land of Livia", "name_original": "Land of Livia", "description": "What if a game took all the core elements of the role playing and adventure games you love and distilled them into a mobile game you can play whenever and wherever? Welcome to Land of Livia, a loot questing and exploration game in which you try your luck at unlocking the mysteries of the land, discovering items of legend, and competing with your friends.<br/><br/>Land of Livia is a different kind of experience that is designed for relaxed gameplay to fit in around your busy day. You only need to touch base periodically to gather rewards or continue on. <br/><br/>PLEASE NOTE! This game does not (nor will it ever) include a pay-to-win or acceleration mechanic of any kind. <br/><br/>FEATURES<br/>● Free prelude chapter 'The Sorceress and the Sea' with more exciting chapters coming soon - explore the Land of Livia and discover the nature of the evil that has caused its current drought!<br/>● Chapter 1 'A Land Divided' provides even more content and is available via in app purchase<br/>● Travel to varied Towns and Dungeons and collect powerful Items, precious Gems, Real Estate, and Companions<br/>● Unlock Legends by listening to rumors and piece together lore items in order to find and equip Legendary Items<br/>● Chat with your friends at the Campfire and compete for #1 on the Leaderboards<br/>● Level up your Hero in order to complete increasingly difficult quests<br/>● Discover rune combinations with limited guesses in the Lore Researching mini game<br/>● Test your reflexes and precision in the Gem Cutting mini game<br/><br/>SUPPORT<br/>Have an idea for a feature? Experiencing a problem? Or just have general feedback? I would love to hear from you at http://landoflivia.helpshift.com<br/><br/>Like us on Facebook (https://www.facebook.com/landoflivia) or follow us on Twitter (https://twitter.com/LandOfLivia) to stay up to date with the latest news and updates!", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-10-22T14:28:27", "background_image": "https://media.rawg.io/media/screenshots/8d4/8d4cc5b2e81c6693631108aae2fd80c0.jpg", "website": "http://www.landoflivia.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aaron Vernon"], "genres": ["Adventure", "RPG"], "publishers": ["Aaron Vernon"], "esrb_rating": "Teen"}