{"id": 46175, "slug": "keatz-the-lonely-bird", "name": "Keatz: The Lonely Bird", "name_original": "Keatz: The Lonely Bird", "description": "Keatz -The Lonely Bird is a 2D Old School action platformer which is based on the story of the lonely bird who has been abandoned by the society. The Government of Heavens, a country where all kinds of birds live, suddenly and unexpectedly came up with a decision of eliminating all the flightless birds from the country by any means necessary because they were deemed to be useless for the country.Keatz has been abandoned by the society because of his inability to fly like other birds can. Besides, the Government of the bird country \"Heavens\" decided to eliminate all the flightless birds residing there. Keatz decided to start a journey against the corruptions and social evils and also against the dumb decision made by the Heavens Government. He wanted to make a room for himself when everything was falling apart. One day, he came across another flightless bird who soon became his friend and a part of his life. His life changed for a few days until they were attacked again by Heavens's soldiers and the peace did not last long, unfortunately.  <br/><strong>\"Will Keatz be able to protect all flightless birds? Will he be able to protect his best friend who became the part of his life?\"</strong><br/><br/>It is a mystery which still remained unsolved....<br/><br/><br/><ul><li>Story Driven.</li></ul><ul><li>Two possible endings based on the decisions taken.</li></ul><ul><li>Challenging situations, traps and various kinds of enemies.</li></ul><ul><li>6 Full Chapters divided into 20 Single-Player levels.</li></ul><ul><li>Two different worlds like \"Real world\" and \"Dream World\" which are interconnected.</li></ul><ul><li>A weapon with 3 Firing modes including Primary firing mode, Rocket Launcher mode and Laser mode.</li></ul><ul><li>Spinner Blades to use for killing multiple enemies at once.</li></ul><ul><li>4 Formidable bosses.</li></ul><ul><li>Collecting Special Items including Golden Leaf, Time machine, gems, money and more!</li></ul><ul><li>Enemies have different kinds of deadly weapons and they also drop better loots.</li></ul><ul><li>6 lives to begin with and the ability to collect more lives in the special levels.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:57", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4ed983be53ba3b06b5997d936a6e1fd.jpg", "website": "http://www.amaxang-games.com/2017/05/keatz-lonely-bird-indie-pc-game.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 35}, "playtime": 0, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anamik Majumdar"], "genres": ["Action", "Indie"], "publishers": ["Anamik Majumdar"], "esrb_rating": null}