{"id": 461785, "slug": "cast-2", "name": "Cast", "name_original": "Cast", "description": "Cast is a decryption game that combines platform jumping elements. In this game, you need to move a two-dimensional circular shadow to make the three-dimensional sphere reach its endpoint. This seemingly simple task is also full of challenges: although the ball is unobstructed in three-dimensional space, its shadow on three two-dimensional planes is subject to various limitations. Perhaps you need to switch the current projection plane from time to time to break through the walls and spikes.<br/>\n<br/>\r\nUnprecedented gaming experience: What does \"moving a two-dimensional circle to control a three-dimensional sphere\" mean? Simply put, controlling the projection of a certain surface can change the two values of the spatial coordinates of a three-dimensional sphere. You can switch to a high-altitude perspective at any time, view the positions of the three projections, and choose the appropriate route to advance.<br/>\n<br/>\r\nThe rich and colorful scene elements: lasers, spikes, portals, and \"entities\" that also have 3D models are all part of the level. Avoiding stepping on spikes, using the teleportation gate to move goods or moving entities on one side to control entities on the other two sides, are all part of the game.<br/>\n<br/>\r\nRelaxed and joyful theme music: Enjoy the background melody of different chapters and accompany you through levels that may take 2 to 3 hours to solve. Relax, if the card is closed, you can switch to another chapter to continue the game.<br/>\n<br/>\r\nInclusive Map Editor: This game has an open level editor. Through it, you can discover how the levels of 'Cast' were built. Perhaps you have your own idea and try to build your own level to fully showcase your talents and talents.", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2023-07-28T02:59:59", "background_image": "https://media.rawg.io/media/screenshots/0d4/0d496fe3e5b33d27a64cf70e90214cff_PnMw1ZK.jpg", "website": "https://www.badbonesproductions.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "iOS"], "developers": ["Ciro Manna", "小小森林"], "genres": ["Strategy", "Board Games", "Casual", "Card", "Indie"], "publishers": ["Ciro Manna", "小小森林"], "esrb_rating": "Everyone 10+"}