{"id": 461796, "slug": "dream-zone-interactive-story", "name": "Dream Zone: Interactive Story", "name_original": "Dream Zone: Interactive Story", "description": "What is Dream Zone? <br/><br/>- Gorgeous girls!<br/>- Breathtaking love stories!<br/>- Unique cards to collect!<br/><br/>Dream Zone is a dating simulator and a series of exciting interactive stories for guys. Create your character and choose your story. Will you flirt with a sexy match to get a one night stand or find your true love and build up a long term relationship? It’s your choice! In this thrilling game for men you are free to live your dreams and unleash your passion.<br/><br/>What do you do IF:<br/><br/>- Your female boss craves your company?<br/>- The girl next door is too scared to be alone and asks to spend the night with you?<br/><br/>Who will you choose?<br/><br/>- A former A-Grade student of a respectable family <br/>- OR a spoiled Insta-diva with an explosive personality?<br/><br/>In Dream Zone you will become the youngest billionaire, a vlogging star on the rise, a world champion, or a renowned scientist. You choose your path in Dream Zone: The Dating Simulator &amp; Interactive Story App!<br/><br/>If you like life simulation games, dating games, and choices games / episode games - Dream Zone is something to check out.<br/><br/>Twisted storylines, romance and drama in our original stories:<br/><br/>The Impossible Game<br/>A mysterious voice message from the past has got you caught up in the game of billionaires. Can you make it to the finale and find out what is going on? Will you stay your former self or change your life once and for all? You decide! The game is on.<br/><br/>Half Human <br/>You are an ordinary guy, you and your geeky friends go to an ordinary school called Cleveland High. But what if the students around you aren’t human? What if everyone you’ve known all your life is a robot? How do you survive in a world that has become foreign to you?", "metacritic": null, "released": "2020-07-01", "tba": false, "updated": "2023-10-17T22:19:18", "background_image": "https://media.rawg.io/media/screenshots/7fe/7fe5bd435342f0b2de4b286ca1adf832_hoEqNVE.jpg", "website": "https://swagmasha.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["SWAG MASHA"], "genres": ["RPG", "Simulation"], "publishers": ["SVEG MASHA, OOO"], "esrb_rating": "Teen"}