{"id": 461814, "slug": "john-allens-timesaver-puzzle", "name": "John Allen's Timesaver Puzzle", "name_original": "John Allen's Timesaver Puzzle", "description": "Train game meets puzzle game in this challenging world of the RG&amp;H Railroad. Enjoy the nostalgia of a model train as you test your puzzle solving skills. This classic strategy puzzle, a favorite in the model railroading world for decades, has been re-imagined for iOS.<br/><br/>Just a few examples of what other players are saying about John Allen’s Timesaver Puzzle:<br/><br/>• “An excellent puzzle game.”<br/><br/>• “Challenges your thinking and logic skills.”<br/><br/>• “Great game!”<br/><br/>• “I love the game!”<br/><br/>• “Totally different from any puzzle game I have ever tried.”<br/><br/>In John Allen’s Timesaver Puzzle you will move trains in tight quarters to complete switching orders as you go from town to town.<br/><br/>Of course, no job is without its complications and the RG&amp;H Railroad is no exception. Your difficulties grow and the workload increases as you navigate worker strikes, new safety regulations and more. But never fear, our engineer, Slim, will be there to keep you on track and remind you that the clock is ticking.<br/><br/>• Pay once and play forever. No in-app purchases!<br/><br/>• 100 challenging puzzles, each playable at 4 difficulty levels.<br/><br/>• Sync game scores and progress across devices with iCloud.<br/><br/>• Enjoy our lively soundtrack or listen to your own music as you play.<br/><br/>• Climb leader boards and challenge friends through Game Center.<br/><br/>Download John Allen’s Timesaver Puzzle now and see if you have what it takes to be a ‘hostler’!", "metacritic": null, "released": "2016-11-26", "tba": false, "updated": "2020-07-06T02:20:29", "background_image": "https://media.rawg.io/media/screenshots/554/5543fa7db76399b7558c49915f0a72ba_Gs77iKI.jpg", "website": "http://www.scottlagaly.com/Timesaver/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Scott Lagaly"], "genres": ["Strategy", "Puzzle"], "publishers": ["Scott Lagaly"], "esrb_rating": "Everyone 10+"}