{"id": 461800, "slug": "ninas-tale-fashion-studio", "name": "Nina's Tale - Fashion Studio", "name_original": "Nina's Tale - Fashion Studio", "description": "Do you want to show your amazing style to world?<br/><br/>Built your dream fashion studio, deliver orders to your - virtual - clients. Win virtual cash and shop!<br/><br/>Enter creative challenges, share your design and get recognized for your style with in-game designs feed. Makeover your virtual model with fabulous items from different cultures and styles all over the world.<br/><br/>Win exclusive in-game prizes by styling outfits for different Style Challenges and voting on looks from millions of other fashion lovers!<br/><br/>STYLE THE PERFECT OUTFIT. Choose from thousands of glamorous clothing and accessory items in addition to chic hair and makeup styles on our new diverse array of models to create looks for various styling challenges such as photo shoots, cocktails and red carpet fittings.<br/><br/>VOTE ON WHO WORE IT BEST. Cast your vote and decide what’s hot on the Nina's Tale Fashion scene! Over hundreds of thousands of entries per styling challenge! Are other players’ looks 5-star worthy or did they miss the mark?<br/><br/>Download Nina's Tale Fashion now and start styling!<br/><br/>If you choose to purchase Platinum Studio, payment will be charged to your iTunes account, and your account will be charged for renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off at any time by going to your settings in the iTunes Store after purchase. Current Platinum Studio subscription price starts at $4.49 USD/week, and weekly package are available only. Prices are in U.S. dollars, may vary in countries other than the U.S. and are subject to change without notice. No cancellation of the current subscription is allowed during the active subscription period. If you don’t choose to purchase Platinum Sutdio, you can simply continue using Nina's Tale for free.<br/><br/>FOLLOW US<br/>Instagram: instagram.com/ninastalefashion<br/>Facebook: https://www.facebook.com/ninastale<br/>Twitter: https://twitter.com/ninastale<br/>Pinterest: https://www.pinterest.com/ninastale<br/>________________________________________<br/>Contact Support:<br/>help@calypsoink.com<br/>__________________________________________<br/>Payments FAQ:<br/>Does Nina's Tale allow in-app payments?<br/>Nina's Tale is a free-to-play app, but like many apps in the App Store, there is the option of purchasing in-app items using real money. Turn off in-app purchases on your device if you’d like to disable this feature.<br/><br/>Privacy Policy: http://calypsoink.com/nina/privacy.php<br/>Terms of Service: http://calypsoink.com/nina/tos.php<br/>__________________________________________<br/>Notes:<br/>- Requires iOS 9.0+;<br/>- Compatible with iPhone 5 or newer and iPad 2 or newer<br/>- This game will NOT work on iPad 1, iPhone 4S or older, and iPod Touch 3rd Gen or older<br/>- This game requires an internet connection (WiFi or 3G) to play<br/>________________________________________", "metacritic": null, "released": "2020-05-24", "tba": false, "updated": "2020-07-06T02:15:56", "background_image": "https://media.rawg.io/media/screenshots/0b8/0b824ff8874fdd636f44e783bac81975_Bbw9Gsk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ferhat Ezizi"], "genres": ["RPG", "Casual"], "publishers": ["Ferhat Ezizi"], "esrb_rating": "Everyone 10+"}