{"id": 462036, "slug": "the-living-dead", "name": "The Living Dead", "name_original": "The Living Dead", "description": "<p><strong>The Living Dead - A thrilling action packed shooter</strong></p>\n<p><strong>The Living Dead is a game of survival. You are a soldier working in a top secret research facility located in an underground bunker when something terrible happens. A deadly gas leaks out and turns everybody except you in the near vicinity into a zombie. Your goal is to kill all zombies before they exit the area.</strong></p>\n<p><strong>Controls - </strong></p>\n<ol><li><strong>Looking - Mouse Movement</strong></li><li><strong>Moving - W for forward, A for left, S for backward, D for right, Left Shift for Sprint</strong></li><li><strong>Jumping - </strong><strong>Space bar</strong></li><li><strong>Zoom In/ Zoom Out - Right Click to toggle</strong></li><li><strong>Shoot - Left Click</strong></li><li><strong>Pause - 9 on the top of the keyboard to toggle</strong></li><li><strong>Switch Weapon - Numbers 1 - 5 on top of the keyboard or </strong><strong>scroll wheel</strong></li><li><strong>In case</strong><strong> you you want to click a button or see your mouse - pointer press escape on the top left of your keyboard to show your mouse - pointer.</strong></li><li><strong>If you want to hide your mouse-pointer click anywhere on the screen.</strong></li></ol>\n<p><strong>Guns</strong></p>\n<p><strong>The Living Dead has five basic gun types which you can use</strong></p>\n<ol><li><strong>Pistol - It has high stability, a medium range, low damage and slow firing rate.</strong></li><li><strong>Shotgun - It has the least stability, a very short range, very high damage and very slow firing rate. </strong></li><li><strong>SMG/Carbine - It has moderate stability, medium range, least damage and highest firing rate.</strong></li><li><strong>Assault Rifle - It has moderate stability, long range, medium damage and high firing rate.</strong></li><li><strong>Sniper Rifle - It has the highest stability,longest range, high damage and the slowest firing rate.</strong></li></ol>\n<p><strong>Pickups</strong></p>\n<p><strong>For the 5 types of guns there are 4 types of ammo available. This is because the Pistol and the carbine use the same type of ammo. In addition to these there are Med Kits that give additional 25 health and a battery pickups that increase the life of your rapidly dimming flashlight.</strong></p>\n<p><strong>The six types are </strong></p>\n<ul><li><strong>Sniper Rifle - Cartridges. They are rare and not found easily. Each pickup gives five cartridges.</strong></li><li><strong>Shotgun - Shells. They are as rare as cartridges. Each pickup gives five shells.</strong></li><li><strong>Assault Rifle - Rounds. They are common and can be found in most places of the map. Each pickup gives 10 rounds.</strong></li><li><strong>Pistol/Carbine - Bullets. They are very common and can be found literally everywhere. Each pickup gives 20 bullets.</strong></li><li><strong>Med Kits are very rare. They can only be found in watch towers and in other areas.</strong></li><li><strong>Battery Pickups. These are the most common type op pickup and are very useful as they help you spot zombies in dark areas and help you shoot them.</strong></li></ul>\n<p><strong>Other things to look out for</strong></p>\n<ol><li><strong>Zombies. If the name or the icon did not suggest this then the main enemy of this game are zombies. If you shoot them or come too close then they will begin to chase and never stop until either you kill them or they eliminate you. They deal 14 damage per attack. Also a lot of valuable ammo and other pickups can be found near them. They can jump 10 feet into the air to avoid obstacles and they can live even after you head-shot them.</strong></li><li><strong>Towers. Although there are 4 of them in the entire game, a lot of loot can be found in these towers. Each tower has a lot of one particular type of ammo and 1 battery and Med Kit. However they have many zombies around them.</strong></li><li><strong>Ominous looking entrance to the bunker. Many zombies can be found outside the underground bunker but many of them are inside. To properly finish the goal of the match however, the player must also kill all zombies within the bunker. However getting there is no easy feat you must put your gaming skills to the ultimate test to find the entrance.</strong></li></ol>\n<p><strong>Click 9 on the top of the keyboard to pause and then use alt + tab to see your other windows.</strong></p>\n<p><strong>In case the game lags a bit it might because of your internet quality. Sometimes due to bad network quality the game wont work you will have to reload the game. Then you can download the game to play it offline. I will release updates containing more animations, levels and larger maps later on. Another thing is that if you have poor internet connection and you keep switching between full screen and windowed mode the game might not work properly. So please avoid switching between full screen and windowed mode.</strong></p>\n<p><strong>So hopefully you now know how to play The Living Dead. Good luck and look out for the zombies.</strong></p>", "metacritic": null, "released": "2020-07-05", "tba": false, "updated": "2020-07-06T03:04:09", "background_image": "https://media.rawg.io/media/screenshots/7f2/7f215f740bb8971853939f1f0fa31210.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["nikthegreat2020"], "genres": ["Action", "Shooter", "Adventure", "Fighting"], "publishers": [], "esrb_rating": null}