{"id": 46210, "slug": "shift-quantum", "name": "Shift Quantum", "name_original": "Shift Quantum", "description": "<strong>Shift Quantum</strong> is an action-puzzle platformer game making use of a unique gameplay mechanic called SHIFTING. In <strong>Shift Quantum</strong> You play an avatar controlled by the player inside your own mind, deep inside Axon Vertigo's brain power extraction process. Do you have what it takes to beat all the levels and find your way out of this <strong>mental maze</strong>?The Gameplay<br/>Solve Puzzles by shifting the world, from black to white and white to black, create negative space by entering the parallel world and transform an unclimbable block into a hole you can jump into. Use this unique <strong>SHIFT</strong> mechanic to your advantage and overcome the game’s obstacles. Pay attention to the small details, there may be more to this game than meets the eye.The story<br/>Welcome to Shift Quantum, the official gaming solution used by a mysterious global company, Axon Vertigo, to collect and process human brain power.<br/><br/>On top of  making money in the real world while connected to the system, the game is making you smarter, leaving you happier and prouder after each session. You are also able to create the next challenges for your fellow shifters by utilizing the embedded level editor, controllable by your brain, straight inside the system. What are you waiting for? Join Axon Vertigo and make the world a better place.Genesis<br/>Shift Quantum is an official successor of the famous puzzle-platformer game, Shift, originally created by Antony Lavelle and published by Armor Games.Features<br/>The Game will contain the following features:<br/><br/>-8 new and unique game blocks to challenge your brain with puzzle and action mechanics.<br/>-A brand new story introducing a new gameplay mechanic based on a mysterious AI controlled character.<br/>-Solo content with over 100 unique levels that will test your abilities like never before.<br/>-An easy-to-use fully fledged level editor allowing you to create your own levels and share them.<br/>-Level creation contests, speedruns and weekly votes for top levels and showcase.<br/>-The possibility to share and consume levels coming from other platforms (Xbox, Playstation and Switch).<br/>-Full controller (Steam controller) and keyboard support.<br/>-Big picture support.<br/>-Steam achievements and leaderboards.<br/>-Cloud save progression.", "metacritic": null, "released": "2018-05-29", "tba": false, "updated": "2019-08-28T22:04:56", "background_image": "https://media.rawg.io/media/screenshots/593/5931456bf3f1d9d34e77bc2117071781.jpg", "website": "http://www.shiftquantum.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 43, "beaten": 3, "toplay": 6, "dropped": 2}, "playtime": 3, "achievements_count": 142, "ratings_count": 2, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Fishing Cactus", "Red Panda Interactive"], "genres": ["Indie"], "publishers": ["Plug In Digital", "Fishing Cactus", "Red Panda Interactive"], "esrb_rating": null}