{"id": 462160, "slug": "crystals-itch-leahsgames", "name": "Crystals (itch) (leahsgames)", "name_original": "Crystals (itch) (leahsgames)", "description": "<p>Match Crystals on a distant, ethereal planet.</p>\n<p>Its gameplay is a mix of Bejeweled and Candy Crush (but without the nagging to buy things). The goal of each level is to remove all of the obstacles from the board. You can create powerups by matching 4 or more gems, and click to use them. Its art and sound direction are relaxing even though the game is very challenging.</p><p>Powerups:<br/></p>\n<ul><li>When matching 4: Line clearing powerup</li><li>When matching 5 in a straight line: Bomb that clears all gems of a certain type</li><li>When matching 5 in a T or ∟ shape: Diagonal cross (X) clearing powerup</li></ul>\n<p>Special Keys:</p>\n<p>There is no way to pause the game, but you can restart the game back to the main menu by pressing Shift + Backspace.</p>\n<p>Some history...<br/></p>\n<p>It came out in 2015 on Mindjolt and then Newgrounds. It frequently topped the charts on Mindjolt, garnering a nice little community and about two million plays. It was amazing to see so many people enjoy the game. However, some good things end and Flash games have been pretty much wiped from the internet despite being such a popular indie platform at one point, and along with it a lot of people's favorite games.<br/></p>\n<p>I wrote this over three months while in college and redid the art three times before it felt right. It was originally a match 3 where you matched colorful cages to release birds, but then I decided to try rendering some gems and was inspired to make a moody, atmospheric version of Bejeweled 2.</p>", "metacritic": null, "released": "2020-07-04", "tba": false, "updated": "2020-07-06T03:26:35", "background_image": "https://media.rawg.io/media/screenshots/10c/10c183d6701f5b88495664f35397b805.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["leahsgames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}