{"id": 462264, "slug": "runeman", "name": "Runeman", "name_original": "Runeman", "description": "<p>Runeman is a would-have-been programming/spell manipulation game in which the player finds different runes in a vast world, incorporates them into a \"chain\" of commands, and finally battles enemies found around the world using the same spells.</p>\n<p>Controls:</p>\n<ul><li>W/Z/<strong>Up</strong> - Move forward</li><li>A/Q/<strong>Left</strong> - Turn left</li><li>S/<strong>Down</strong> - Move backward</li><li>D/<strong>Right</strong> - Turn right</li><li><strong>Tab</strong> - <strong>Switch to the rune editor<br/></strong></li><li>More keys can be bound via switches to toggle parts of the spell on/off.</li></ul>\n<p>The game was created over the course of 9 hours for Triple Trijam 2020; it vaguely used the \"Chain Reaction\" theme by incorporating the rune chain mechanic from my earlier game, RuneChain. It also slightly implements the Negative Feedback Loop theme by giving the player less runes and more enemies the more they progress into the game. Progressing is moving towards the darker areas of the terrain; moving towards the lighter part of the terrain is basically going back.<br/></p>\n<p>Overall, I overscoped for the jam, spending at least the last 3 hours tweaking/balancing enemy and spell details. I was planning to add some cool effects to the player, such as showing different runes activating inside the black sphere as small colored points, but got swamped by having to write the whole rune processing system. The enemy generation is also particularly dumb, and is unlikely to generate an enemy which can both move forward, rotate, and damage/kill the player. In fact, if the player dies, the game is likely to crash.<br/></p><p>(Source code provided under the MIT/Expat license. Feel free to ask for more details if unsure.)<br/></p>", "metacritic": null, "released": "2020-07-04", "tba": false, "updated": "2020-07-06T03:47:00", "background_image": "https://media.rawg.io/media/screenshots/02b/02b91e760f93297226f4dc7cbffbe028.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["bojidar_bg"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}