{"id": 46220, "slug": "scorn-episode-one", "name": "Scorn", "name_original": "Scorn", "description": "<p>Scorn is an atmospheric first-person horror adventure game set in a nightmarish universe of odd forms and somber tapestry.<br />\nIt is designed around the idea of &quot;being thrown into the world&quot;. Isolated and lost inside this dream-like world, you will explore different interconnected regions in a non-linear fashion. The unsettling environment is a character itself.<br />\nEvery location contains its own theme (story), puzzles and characters that are integral in creating a cohesive world. Throughout the game you will open up new areas, acquire different skill sets, weapons, various items and try to comprehend the sights presented to you.<br />\nGAMEPLAY FEATURES<br />\n-Cohesive “lived-in” world - Scorn takes place in an open-ended world with different interconnected regions. Each region is a maze-like structure with various rooms and paths to discover. All the storytelling happens in-game, with no cut-scenes to distract you from the grisly reality of the living, breathing world you’re in. But keep your eyes open - the game won’t show you any sympathy if you miss something important on your uneasy travels. Everything has a reason and purpose - you just need to work out what it is.<br />\n-Full body awareness – Players will experience better immersion being aware of the character’s body and movement. Interaction with the world is realistic - objects are picked up with your hands (instead of just floating in midair), machines and instruments are operated by grabbing the controls etc.<br />\n-Inventory and ammo management - is defined and limited. It plays a big role in keeping the player in an even greater state of awareness throughout the whole game. Players will have to think about when to fight and when to take cover and how their actions affect the world around them. Different play styles will be needed to advance.<br />\n- Scorn part 1 of 2? Is the game split into parts?<br />\nYes, we are planning to release it in two parts, with the first part coming in 2018.<br />\nThese two parts represent everything that will ever be done. There will be no DLC, expansions or sequels. Ever.</p>", "metacritic": 67, "released": "2022-10-14", "tba": false, "updated": "2024-04-11T21:48:16", "background_image": "https://media.rawg.io/media/games/f8c/f8cc3b4834259f8a812ce77804bc12ed.jpg", "website": "http://www.scorn-game.com", "rating": 3.43, "rating_top": 4, "added_by_status": {"yet": 105, "owned": 663, "beaten": 154, "toplay": 251, "dropped": 87, "playing": 11}, "playtime": 4, "achievements_count": 0, "ratings_count": 201, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 207, "platforms": ["PC", "Xbox Series S/X"], "developers": ["Ebb Software"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Kepler Interactive", "Ebb Software"], "esrb_rating": null}