{"id": 462432, "slug": "adventures-on-planet-zephulor", "name": "Adventures on Planet Zephulor", "name_original": "Adventures on Planet Zephulor", "description": "<p><em>This game was released into the public domain and you can get it for free from my own website and other places.<strong> If you like it, and would like to see more games/projects, please comment or donate a dollar or two.</strong></em></p>\n<p><em>Don't feel obligated to however, I'm happy just knowing that people are enjoying it.</em></p>\n<p>This was a game created long ago (2005).</p>\n<p>I spent about a year and a half \"designing\", coding in python with pygame, and pixeling. It was supposed to have a comic style story-line in the cut scenes, but I got burned out on developing, moved half way across the country, and never took it up again.</p>\n<p>It was written for my kids to play and it's short.</p>\n<p>I look back on this and think wow, this looks terrible! ...Perhaps I'll polish, embellish, and extend it now that there's game engines out there that handle most of the heavy lifting. Or perhaps I'll move on to another game project.</p>\n<p>I think I found the best description of the game on a website the other day:<br/></p>\n<p><em><strong>\"You purchased a thousand square kellicams of land on Zephulor for a new condominium project. But when you arrived to inspect the land, you found that Zephulor has a toxic atmosphere and is inhabited by voracious alien slugs, as well as being full of strange platforms hovering in midair. Now, in Adventures on Planet Zephulor you will take your bloody revenge on the man-eating aliens who even now invoke obscure zoning regulations to prevent you from constructing more than six consecutive residential units without an intervening common area! Okay, that's not the real plot of AoPZ, but there is no real plot, so it will have to do. Hey, maybe I could offer my freelance services to people who need a plot for their game, the way Funkbunny Studios offers to do the music. What do you think?\"</strong></em> -Leonard Richardson</p>\n<p>https://www.crummy.com/2005/01/23/2</p>\n<p><strong>Controls:</strong></p>\n<ul><li><strong>z - shoot</strong></li><li><strong>x - jump</strong></li><li><strong>arrow keys: run left/right</strong></li><li><strong>esc: menu</strong></li></ul>\n\n<p>**Known bugs: doesn't work well with some intel cards, doesn't crash, but sometimes you have to re-launch it, or can't make it full screen.</p>\n<p>*If you get in a bad state, try deleting the main.cfg file from the \"conf\" directory. It will be recreated the next time you run the game.</p>\n<p>It does work on Windows 10. Source works on windows, linux, and mac with python2.7 (https://www.python.org/downloads/) and pygame1.7 (https://www.pygame.org/download.shtml)</p>", "metacritic": null, "released": "2020-07-03", "tba": false, "updated": "2020-07-06T04:21:20", "background_image": "https://media.rawg.io/media/screenshots/23c/23c797a87610d29e565ba34797d548c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mrhollow"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}