{"id": 462585, "slug": "the-retaliators-sumo-game-jam-2020-final-game", "name": "The Retaliators (Sumo Game Jam 2020) Final Game", "name_original": "The Retaliators (Sumo Game Jam 2020) Final Game", "description": "<p>You play as Swift a member of the  super hero team The Retaliators. Mr Evil is using towers scattered across the city to transmit a mind control signal to his app, brainwashing the citizens. Your job is to fight your way through the brainwashed army and Mr Evil's deadly mutants to destroy every tower before the damage becomes irreversible. You will need to use you super speed abilities to navigate the environment and out manoeuvre your enemies.</p><p>How to play:</p><p>Your goal is to destroy all of Mr Evil's mind control towers before the timer runs out. </p><p>You can extend the timer by collecting stopwatch pickups scattered throughout the city.</p><p>The towers will not be unprotected, you will need to either fight or evade the hordes of enemies attempting to stop you.</p><p>If your health gets too low, locate one of the health pickups to regenerate lost health.</p><p>Your super speed allows you to traverse the environment at great speed, and jump great heights; making traversal a breeze. You can also slow down time to emulate Swifts superhuman reflexes in order to navigate with more precision or outmanoeuvre enemies.</p><p>A number of JumpPads are scattered around the environment, use these to reach even greater heights with ease.</p><p>Controls:</p><p>Sprint - Shift </p><p>Jump - Space</p><p>Attack - Left Mouse (click repeatedly to perform a chain of attacks)</p><p>Slow Time - Right Mouse</p><p>Character models and animations obtained from Mixamo.</p>", "metacritic": null, "released": "2020-07-03", "tba": false, "updated": "2020-07-06T04:55:01", "background_image": "https://media.rawg.io/media/screenshots/24a/24a4c286190ff99136340a6bacb1b882.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["E11iot13"], "genres": ["Action"], "publishers": [], "esrb_rating": null}