{"id": 46269, "slug": "nudist-beach-survival-simulator", "name": "Nudist Beach Survival Simulator", "name_original": "Nudist Beach Survival Simulator", "description": "Nudist Beach Survival Simulator is a defensive game maintained in pixel style. The whole game consists in bouncing, increasingly to the more dangerous waves, wanting to strip us nudists. Our task is to defeat all and survive.<br/><br/><br/>The game is divided into 2 modes:<br/><br/>• Standard<br/>• Infinite<br/><br/><br/>First mode with over 40 levels to complete with four bosses. Infinite mode is not limited by level; It is accompanied by a counter, which counts time we have survived. Ten mode is also devoid of bosses.<br/><br/><br/><br/>During the game we have access to a small arsenal of weapons. It consists of a stick, stones, AK-47 and a button, which gives a random effect; Depending on the luck may be: tsunami (sweeps all nudists from the beach), magnet (attracts all nudists to them and takes them) and helicopter (sends AK-47 magazine, set of stones and completes the life belt). These items are to be achieved by during the game with a metal electric-powered metal detector and diving in the water. There is a DAB option too.Stick<br/>Basic weapons, as we get at the beginning. Inflicts small damage. You have to upgrade it with a stick, a telescopic stick and a wand.Stones<br/>Stand-off weapon. Inflicts moderate damage. We can ride on the beach, under water and buy in the store.Ak-47Machine gun, you can buy it at a later concert. Causes serious injury. Ammunition of desired quality with a detector and price list in the store.ButtonThe most powerful weapon in the game. We leave the fate of the effect ... or nothing:<br/>Tsunami, which sweeps off the surface of all nudists<br/>A magnet that attracts and takes all the nudists out of the beach<br/>A helicopter who drops us a packet of ammunition, stones and completes the life belt to the full<br/><br/><br/><br/>The basis of the game is exploration in which there may be untypical objects. We can cultivate in 2 ways:DivingBasic basis. Coal carbon stone, electric eel and metal detector. The stones of course will be useful to you, unquestionably, exploration on a more \"advanced\" level is impossibleMetal detector<br/>Thanks to it credit Ak-47, ammunition to it and a button, a very useful powerful tool zn. The detector is only limited by the battery. To recharge it, collect the eels and batteries.", "metacritic": null, "released": "2017-09-28", "tba": false, "updated": "2019-08-28T22:04:54", "background_image": "https://media.rawg.io/media/screenshots/7c1/7c1ab125ff5a8b2214bc446d20170d4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "dropped": 1}, "playtime": 1, "achievements_count": 27, "ratings_count": 2, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Tornado Games"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Tornado Games"], "esrb_rating": null}