{"id": 462708, "slug": "landlord-go", "name": "Landlord GO", "name_original": "Landlord GO", "description": "Ever wanted to be the owner of New York City, the Sydney Opera House or the Eiffel Tower? <br/>Now you can, thanks to Landlord GO!<br/><br/>In Landlord GO, the first augmented reality game to incorporate elements of a business simulator and a trading game, you can buy, sell and trade digital properties set in their actual locations thanks to the use of GPS!<br/><br/>Invest your money, trade with other players and compete with your friends. Make every dollar count, as you progress through the game, building your capitalistic empire. Ready for a challenge? Start with buying corner shops in your neighbourhood, make profit on them and move forward, till you can acquire the most famous landmarks in the world. Level up and develop in order to become the biggest business tycoon!<br/><br/><br/>Landlord GO takes the best out of trading games, clickers and business simulators to give you the ultimate augmented reality game! Find the best strategy, learn about the economy and earn your way to the top!<br/><br/><br/>Ready, steady, GO!<br/><br/>Getting started, getting rich.<br/>- invest them in properties around you<br/>- tap on the screen and buy your first real estate<br/>- earn money each time someone checks in at your property<br/>- upgrade your estates to earn even more or sell it to get instant surge of dollars<br/><br/>It’s all about the reality:<br/>- buy your school or office – every property in the game is based on its real-life equivalent<br/>- find your favourite real estate or discover new ones thanks to augmented reality elements<br/>- search through Market to buy properties all over the world<br/>- learn more about real-life economy and business thanks to realistic simulation<br/>- get rich by buying properties in your city and then selling them to get even more money<br/>- become the owner of your hometown and profit from it to become the richest capitalist<br/><br/>Compete with others:<br/>- invite your friends and challenge them to see which of you is the best tycoon<br/>- trade with other players to develop your own empire<br/>- compete and conquer them all to become number 1 in your city, country or even in the whole world!<br/><br/><br/>Landlord GO, one of the best business games on the market, shows how to use your dollars in the most effective way. Level up to receive new rewards and conquer the market of real estate!<br/><br/>Capitalism has never been so much fun! Just choose a property from the list, click on it and it’s yours, as easy as that. The challenge lies in the realistic economy simulation – you must be very careful not to go bankrupt! In opposite to clickers or simple company games, Landlord GO is a true business game with fully fledged trading system based on real world. Invest your money, observe the movements of your rivals and trade with your friends. Thanks to the augmented reality elements, you’ll buy and sell real estate which you can upgrade to get even more profit in order to develop and level up.<br/><br/><br/>Do you have what it takes to conquer the market of real estate and become the richest real estate tycoon? <br/>Download NOW one of the best business games ever: Landlord GO, and build your own empire!", "metacritic": null, "released": "2020-04-03", "tba": false, "updated": "2020-07-10T02:18:00", "background_image": "https://media.rawg.io/media/screenshots/98d/98d4b4b49ae70220a6dc0c4c3ce90d6e.jpg", "website": "https://landlord-go.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["REALITY GAMES"], "genres": ["Strategy", "Simulation"], "publishers": ["Reality Games"], "esrb_rating": "Everyone 10+"}