{"id": 46278, "slug": "the-walking-vegetables", "name": "The Walking Vegetables", "name_original": "The Walking Vegetables", "description": "Whilst storming from City to City, looting buildings and suburbs for loads of Glorious Guns, Gadgets, Goodies and Gold, you must always stay alert and trigger-happy. Because The Walking Vegetables is the most Radically Rapid Turbo Paced Top Down Shooting Veggie-Zombie Mayhem you’ll ever experience!----------------------------------------------------------------------------------------<br/>By obtaining Radrocks from the Vegetable Kingpins, you may unlock dozens of devastating Guns, Gadgets and Melee Weapons, to help you battle on towards the ominous vegetable-ridden alien headquarters, and the dreaded formidable Mothership.----------------------------------------------------------------------------------------<br/>As if the vegetables alone weren’t enough, the Alien Vegeneration Ray has also affected the fruits and mushrooms. Thus over 20 freshly squeezed organic and unique enemies. <br/>... And if by chance you manage to survive the unending onslaught of said Ripe Ravenous Ravagers, the several Epic Boss Fights are sure to put an end to your measly rebellion... and existence. Muahahahahaaa!----------------------------------------------------------------------------------------<br/>Build up your character creating powerful effect combinations by choosing from more than <strong>20 unique Skills</strong>, including such game changers as Big Game Hunter, Pulpinator, Akimbo, Tongue of Steel and more!<br/><br/><br/>The content is OVERFLOWING! A single playthrough merely scratches the surface on what The Walking Vegetables has to offer. Grand pools of randomized Buildings, Sections, Enemies, Bosses, Weapons and Items will make every playthrough a completely unique experience. Combine this with the abundance of Achievable Skills and Unlockable Goodies, and you are guaranteed to stay engaged and entertained for a loooong time!<br/><br/>You can also better your odds of surviving by having a friend to back you up. The couch co-op offers you a whole nother level of Awe-striking Upbeat Absurdity. After all, zombie vegetables are best served for two.", "metacritic": null, "released": "2017-09-27", "tba": false, "updated": "2019-08-28T22:04:54", "background_image": "https://media.rawg.io/media/screenshots/166/166b4e23c174816510c24db8e371a141.jpg", "website": "https://www.facebook.com/StillrunningGame/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 78, "dropped": 1}, "playtime": 1, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Still Running"], "genres": ["Action", "Indie"], "publishers": ["Merge Games", "Tagstar Games"], "esrb_rating": null}