{"id": 46284, "slug": "hiveswap-act-1", "name": "HIVESWAP: Act 1", "name_original": "HIVESWAP: Act 1", "description": "<p>Monsters in the yard. Monsters in the house. Monsters in the hall, beating on your door. Your brother&#39;s trapped in his treehouse, so he’s not gonna be much help. You&#39;re going to have to get yourself out of this. But where did they come from? How are you supposed to deal with this? Well, certainly not by cowering in your room. That&#39;s for, uh, cowards.<br />\nFirst things first. You need to open the door.<br />\nA LOVE LETTER TO &#39;90s ADVENTURE GAMES<br />\n...without the accompanying frustration. As fun and well-paced as you generously remember them being. No dream-logic solutions, no hearing the same “those items don’t work together” message over and over. HIVESWAP has unique responses for everything you can try. Spend hours trying everything on everything, if you want to -- but not because you have to. Learn about the characters by exploring their homes! But like, in a good way! No audio logs split up and scattered around -- GUARANTEED.<br />\nHAND-ANIMATED IN TWO DIMENSIONS<br />\nStrange homes to explore, every room brimming with secrets. The world of HIVESWAP is beautiful and alive, from its hyper-detailed environments to its gorgeous fully-rendered animations. Come take a look!<br />\nMUSIC TO MAKE YOU WEEP<br />\nAn eclectic, ambitious, genre-spanning soundtrack, featuring contributions from Undertale’s Toby Fox and, regrettably, at least one third-wave ska song. Also featuring at least one pseudo-revolutionary garage rock duo, with regrets of their own.<br />\nWORLDS TO SEE, TEENS TO BE<br />\nPlay as JOEY CLAIRE, EXTRAORDINAIRE, a teen trapped in her room <em>and</em> in 1994. Play as JUDE HARLEY, BIZARRELY, her kid brother, trapped in his treehouse. Play as XEFROS TRITOH, ALIEN REBEL, wait. Aliens?<br />\nJUST GETTING STARTED<br />\nHIVESWAP: Act 1 is the first of a four-part series set in Andrew Hussie’s Homestuck universe, with a companion series, Hauntswitch, to follow. Continue your save from chapter to chapter, then from game to game, to carry your story, choices, friendships and frenemies across them all--then do it again! Once released, HIVESWAP and Hauntswitch will be playable in either order. Haven’t read Homestuck? That’s fine! This game is set in 1994! Homestuck hasn’t even been invented yet!</p>", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2023-12-05T16:12:15", "background_image": "https://media.rawg.io/media/screenshots/b68/b683ea15a87b7a4c98e914bb0e84aeb3.jpg", "website": "http://www.hiveswap.com", "rating": 2.59, "rating_top": 1, "added_by_status": {"yet": 123, "owned": 1261, "beaten": 39, "toplay": 7, "dropped": 16, "playing": 1}, "playtime": 4, "achievements_count": 44, "ratings_count": 63, "suggestions_count": 428, "game_series_count": 2, "reviews_count": 63, "platforms": ["PC", "macOS", "Linux"], "developers": ["What Pumpkin Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["What Pumpkin Games"], "esrb_rating": null}