{"id": 46287, "slug": "lake-ridden", "name": "Lake Ridden", "name_original": "Lake Ridden", "description": "<p>Lake Ridden is an atmospheric, story-driven mystery game. Your sister gets caught in the middle of a fierce conflict, and it’s up to you to find clues and solve puzzles to save her. Luckily, you are not alone.<br />\nYou are Marie, a 13-year-old girl and the year is 1988. The warm summer is giving way to the first signs of autumn. Reluctantly, you join your younger sister and her friends for one last camping weekend in the wilderness of Maine. It was going just great, but the second night by the sizzling campfire, an argument with your sister ended with her running off into the forest. While searching for her, you stumble upon an old forgotten estate. To survive, and ultimately save both yourself and your sister, you must find clues, solve tricky puzzles and communicate with former residents. Uncover an old conflict driven by poisonous envy, spiraling madness, and unforgotten hate.Key Game FeaturesA Beautiful, Haunted SettingUncover an old estate filled with mysteries, explore a stunning forest and experience a thrilling time-bending adventure.<br />\nChallenging Puzzles and InvestigationSolve tricky puzzles and look for clues as you investigate your sister&#39;s disappearance.<br />\nExperience a Rich StoryImmerse yourself in a narrative where you&#39;ll get to know Marie and other characters as you dive deeper into the mystery.<br />\nAdventure, Mystery, and ExplorationLake Ridden is a story-driven puzzle mystery, focusing on narration and atmosphere. It&#39;s a not a horror game, but certainly has a creepy feel to it at times, which we hope you&#39;ll enjoy!</p>", "metacritic": null, "released": "2018-05-10", "tba": false, "updated": "2023-05-29T05:19:25", "background_image": "https://media.rawg.io/media/screenshots/41e/41ec20ebca6b67bcdcb1490bc1276bd0.jpg", "website": "http://www.lakeridden.com", "rating": 3.36, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 79, "beaten": 9, "toplay": 3, "dropped": 4}, "playtime": 3, "achievements_count": 16, "ratings_count": 11, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 11, "platforms": ["Xbox One", "PC", "macOS"], "developers": ["Midnight Hub"], "genres": ["Adventure", "Indie"], "publishers": ["Midnight Hub"], "esrb_rating": null}