{"id": 46296, "slug": "adam-waste", "name": "Adam Waste", "name_original": "Adam Waste", "description": "<strong>Earth after global extinction.<br/>Adam is a lost soul, awakened from cryogenic sleep in the distant future. <br/>In order to survive he will need to overcome different obstacles in the ruins of an abandoned city. All the while piecing together his terrible past and realizing the future holds even more peril. <br/>Amidst ruin and horror, Adam discovers his destiny in this New World.</strong><br/><br/><strong>Features</strong><br/><ul><li>Linear game scenario<br/></li><li>Third person shooter<br/></li><li>Solve puzzles to unlock obstacles<br/></li><li>Stealth<br/></li><li>Underwater diving</li></ul><br/>Press kit: http://blackturn.com/adam-presskit<br/><br/><strong>Episode 1:</strong><br/>A failed circuit triggers an emergency reanimation of the cryogenic cell. After decades/centuries imprisoned in cryopreservation, Adam finally awakes. No notion of where or when he is. With oxygen levels running desperately low, he uses the nearly depleted energy source to escape. <br/>But not to freedom. The city is unfamiliar, dangerous. The world Adam knew is gone. <br/>After a while, the first memories come back to him about the person closest to him - his daughter. Like links of chain - before prison - the last moments of his life start to come out.<br/>He remembers the year 5000.<br/>How the sunrays stream shifted. How it wasn’t enough to synthesize the plants and how fast they died because of it. How soon after all life followed.  <br/>Memories of time when comfort and money lost its value. When survival became routine and life - cheaper than food. <br/>He remembers his police work against the raging cannibalism.<br/> He remembers how hard it was to kill a starving unarmed man who was engaged in cannibalism. This caused riots of citizens. Anarchy from people he defended by killing.  Adams employers used this situation to make him a scapegoat to hide their own sins. The governors of the government warehouse were stealing food for themselves. Adam took a difficult decision, because he had only two options: to condemn his daughter to starve or become a robber himself.<br/>In this new world of bone and ash Adam finally finds other life. Though the beings examine Adam from afar before approaching.", "metacritic": null, "released": "2018-01-30", "tba": false, "updated": "2019-08-28T22:04:53", "background_image": "https://media.rawg.io/media/screenshots/61b/61b8eee9bce391a60654838064c80634.jpg", "website": "http://blackturn.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "beaten": 1, "playing": 1}, "playtime": 4, "achievements_count": 8, "ratings_count": 2, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": [], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}