{"id": 463186, "slug": "reboot-itch-watanoge", "name": "Reboot (itch) (Watanoge)", "name_original": "Reboot (itch) (Watanoge)", "description": "<p>Your laptop just crashed. What now? Well, <strong>REBOOT</strong> it, of course! But what does that actually mean? Experience first hand the <em>thrilling</em> adventure that is being an OS trying to fix your silly mistakes. We both know that free IPhone was a scam. You brought this on yourself. But anyways! You just gotta go to the goal and try not to land on spots you've landed before! There are pesky errors there, following your tracks and trying to take you <strong>ď̶̲͙̽ỏ̸͔͑́w̵̘̯̪̆͌n̴͉͒͒</strong>.<br/></p>\n<p>Choose between three different difficulties or create your own! There's tens of levels and hundreds of different variations! Complete puzzles to win, if you don't... well... let's just say that your computer won't be too happy about that!</p>\n<p>Navigate through the puzzles by pressing the <em>\"space bar\" </em>whenever the arrow is pointing towards the direction you want to go! </p>\n<p>--------------</p>\n<p>Tu laptop acaba de crashear. ¿Ahora qué? Pues, <strong>REINICIARLA</strong>, claro! Pero que significa eso realmente? Experimenta de primera mano la <em>emocionante</em> aventura de tu sistema operativo intentando arreglar tus ridículos errores. Ambos sabemos que ese IPhone gratis era falso. Tú te lo buscaste. ¡Como sea! Ahora solo necesitas llegar a la meta, ¡e intenta no caer en espacios donde habías caído antes! Ahí habrá errores siguiendo tus pasos intentando <strong>d̷͚̥̀̒̓̄ḛ̸̻͓̻̪͘ş̷̤̤̖̓̿̉̀͘t̴̮͖̼̯̜̑̑͋̄̌r̸͖̟̜͚̜̒͆ȏ̶̢̺̐z̴̼̲̞͕̔͛̈́̿ͅå̶͖̂r̶̢̒̊̈́͌t̷͚̩̯̜̆̔̐̕e̴̛͓̝̓̂͑̚</strong>.</p>\n<p>Escoge entre 3 dificultades distintas o crea la tuya propia. ¡Hay decenas de niveles y cientos de variaciones distintas! Completa los puzzles para ganar, y si no lo haces... pues.. digamos que a tu computadora no le va a entusiasmar tanto.</p>\n<p>¡Atraviesa los puzzles haciendo click en la <em>\"barra espaciadora\"</em> cuando la flecha esté apuntando hacia la dirección en la cual quieres ir!</p>", "metacritic": null, "released": "2020-07-08", "tba": false, "updated": "2020-07-10T04:04:04", "background_image": "https://media.rawg.io/media/screenshots/34e/34e20be420a90aa9579ac6f6c5ef60d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Watanoge"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}