{"id": 46329, "slug": "cyberoque", "name": "Cyberoque", "name_original": "Cyberoque", "description": "History:<br/>\r\nThe game takes place in 2215. Mankind is exploring the solar system and new big cities on Mars. Terra-formation of Venus is in process.<br/>\r\nSuddenly terrible news has come from the outskirts of the solar system: our civilization was attacked by the alien armies. A terrible war begins, humanity is surrounded, enemy space ships press the earth's army.<br/>\r\nThe mankind is forced to be mobilized. During the war it becomes clear that enemy troops completely consist of robots. Scientists work day and night, studying enemy trophies and create army of robot spaceships. In order to compensate lag in technologies, terrestrial ships are constructed with use of alien technologies.<br/>\r\nDays pass, and it becomes more and more clear that the war will be lost. Besides, aliens begin to use their special equipment that create noise and prevent controlling the terrestrial robot army. As the last hope people decide to use the invention of professor Likhtenshtarts: the cybernetic intelligent module allowing to copy human consciousness inside it. Such module will allow to create the autonomous robot-ship-soldier. As a source for copying of consciousness to the intelligent module, the most skilled and successful military of the last time - sergeant Gregor Golovkoff is used.<br/>\r\nSecret operation is performed. And the module in a body of the best robot-ship is sent to the space base of newcomers near the satellite of Saturn where main enemy forces are concentrated...", "metacritic": null, "released": "2017-09-20", "tba": false, "updated": "2019-08-28T22:04:52", "background_image": "https://media.rawg.io/media/screenshots/5fd/5fdf6d25b38ef497af943c48b7b2c3d6.jpg", "website": "http://cyberoque.dnovel.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dnovel"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Dnovel"], "esrb_rating": null}