{"id": 463300, "slug": "tamagotchi-reboot", "name": "Tamagotchi Reboot", "name_original": "Tamagotchi Reboot", "description": "<p>Care for and nurture your very own virtual pet! Make sure they're clean and well fed or else they will surely die... Remember, a pet is for life, and not just for quarantine. </p>\n<p>This game was created for three separate Game Jams, and also my first ever released 'game'! I didn't have enough time to dedicate to the project as it was made in my downtime during the summer exam period, but I hope to keep adding to it here and there as well as patching the <em>tonne </em>of bugs that I wasn't able to get to.\r\nThis game is designed to be a recreation off of the old Digimon tamagotchis, but without the battling aspect (for now?). I chose this because I recently found my old ones whilst tidying up during quarantine, and I thought it would be a nice solo project to tackle for my skill level in coding. </p>\n<p>The pet will live for as long as you can care for it, there are a number of digievolutions that are available, and 4 \"species\" titled \"dog\", \"cat\", \"snake\", and \"bear\" but these are arbitrary and apart from the snake species, don't bear any resemblance to their respective animal. \r\n</p>\n\n<p>Some features (in red on annotated image) are currently not functioning but will be fixed after the time has elapsed on all Game Jams to which this game is entered into. </p>\n<p><strong>Three buttons for complete use:</strong></p>\n<p><strong>- B - change selection</strong></p>\n<p><strong>- N - action / confirm selection</strong></p>\n<p><strong>- M - cancel / escape</strong></p>\n<p><strong>- Esc - Quit</strong></p>\n<p>Submitted into:</p>\n<p>- Baby's First Game Jam (Theme: None)\r\n</p>\n<p>- PB &amp; Game Jam (Theme: Survive)</p>\n<p>- Retrograde Jam (Theme: Doesn't quite fit the theme, but I thought I'd be cheeky and submit it anyway)</p>\n\n<p>All assets made by me.</p>\n<p>I appreciate any constructive feedback you can give me! Knowing where I went wrong will help me to know how I can improve.</p>", "metacritic": null, "released": "2020-07-07", "tba": false, "updated": "2020-07-10T04:28:55", "background_image": "https://media.rawg.io/media/screenshots/236/2366131e8445ac12ed76d87f68ea2849.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Roshimitsu"], "genres": [], "publishers": [], "esrb_rating": null}