{"id": 463436, "slug": "space-clowns", "name": "Space Clowns", "name_original": "Space Clowns", "description": "<p>Space Clowns brings two classic games from 1978 together, with an epic star warring story for you to enjoy.  This is a reimagined merger of Space Invaders and Clowns, both are beautiful masterpieces in their own right, but together they make something truly amazing.<br/></p>\n<p>Story:</p>\n<p>Big Top Inc is an evil corporation, with even more sinister employees.  They need animals to work at their circus, so they are sending their Clown Troopers to enslave all of the inhabitants on the planet Nabooboo.  You must rise up, as the only elephant with an artillery license, the fate of the planet is up to you.</p>\n<p>Gameplay:</p>\n<p>A to move Left, OR the Left Arrow key</p>\n<p>D to move Right OR the Right Arrow key</p>\n<p>Spacebar to Shoot</p>\n<p>When enemy ships are destroyed they may damage each other while falling to the ground, which can help you by creating a chain reaction that destroys many enemies with a single shot.  You should be careful though, because falling ships can destroy you too.  It can be particularly challenging to avoid a large wave of falling ships, so be sure that your combos do not get too out of hand.  Destroy all of the enemy ships to move onto the next wave, rack up a high score and you can even enjoy the bonus song in the game when you get on the Top Five Online Leaderboard!</p>\n\n\n<p>Dev Team:</p>\n<p>Philip Engesser - Lead Programmer</p>\n<p>John Engesser - Lead Artist</p>\n<p>James Engesser - Vocalist</p>\n<p>Thomas Engesser - Composer</p>\n<p>We are Noble Bros!</p>\n<p>Each of us took roughly three hours on each section of the Triple TriJam, and from brainstorming to development it was all a blast for us to work on.  Philip does think that he worked on the game for more than three hours while making the last build of the game, and we are cool if that takes us out of the competition.  We hope that you have as much fun playing the game as we did developing it.</p>\n<p>No external assets were used in this game, and it was made with Unity.</p>\n\n<p>Themes Used</p>\n<p>Chain Reaction</p>\n<p>Negative Feedback Loop</p>\n<p>Novel Twist on Classic Game</p>\n\n<p>Diversifiers Used</p>\n<p>Join the Trijam Discord and read the #rules channel!</p>\n<p>Invite your friends to join the game jam! (or better yet, force them to... 😏)</p>\n<p>Tweet out your game with #Trijam and @GunnarClovis for a retweet! Do the same for any videos you make!</p>\n<p>Make a procedurally-generated game with functionally infinite levels (or an infinitely long level)!</p>\n<p>Edit the Theme of your itch.io game page and give it a custom color palette, background, and banner using assets from your game! Make sure to include some content on the game page itself too, like instructions for controls, explanation of themes and diversifiers, how much time was taken, which engine was used, links to any external assets that were used, anyone who worked on the game, etc.!</p>\n<p>Make a game where all sound effects are sounds you made with your mouth!</p>\n<p>Sing a song and include it in the game! You can loop in some friends for a choir piece!</p>\n<p>Make a game that uses randomness!</p>\n<p>Make a game in a genre you've never made a game in before!</p>\n<p>Make a game with a main menu! In a game jam! WOW!!</p>", "metacritic": null, "released": "2020-07-06", "tba": false, "updated": "2020-07-10T05:01:59", "background_image": "https://media.rawg.io/media/screenshots/bb1/bb12a1778b3cfad15427b985dcc83bbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["McJohn"], "genres": ["Action"], "publishers": [], "esrb_rating": null}