{"id": 463438, "slug": "oubliette-allstars", "name": "Oubliette Allstars", "name_original": "Oubliette Allstars", "description": "<p>Oubliette Allstars is a terrible name for a fast paced, intense top-down shooter, with a dizzying range of weapon options and a distinct lack of locations.  It's an awful name for a claustrophobic action-packed twinstick shooter where you are locked in a single room desperately attempting to defeat wave after wave of multiple (4!) types of enemy.  It's a crappy name for a game where speed, reflexes, twitch aiming and a healthy dose of luck will get you through to retirement.  It's a bad name for a battle for survival, where the rewards are little more than life itself.  <br/><br/>And it's a rubbish name for your best next small purchase.<br/><br/>---  ADULT CONTENT WARNING ---</p>\n<p>This game contains a fair amount of blood and a little bit of gore.  It's pretty badly rendered and rather pixelated, but it's still blood.  So if you're a small person or if seeing blood isn't your thing then maybe this game isn't for you.   We all good though, my next game is going to be about golf!</p>\n\n<p>--- BAD CONTENT WARINING ---</p>\n<p>First off, I haven't animated the intro, so it just sits there looking a bit odd.  Just imaging everything is like swooshing around and looks awesome and we're all good.<br/></p>\n<p>Secondly, this is my first ever fully complete game project.  I have started many but never actually completed a game until now.  Added to this, I made this game in 3 weeks end-to-end, and did pretty much everything by hand.  I didn't use any external scripts for anything and created all the visual assets myself (apart from the floor texture and my beautiful wife drew the intro guy, but that's it I swear!).  All of the sound effects I either synthesised or recorded with my own voice, and I wrote all of the music. <br/><br/>So with that humblebrag aside, please bear in mind that I did everything from scratch in three weeks flat, so some things might be a little sketchy.  But feel free to nag me about things and I shall fix them up and make things better. </p>", "metacritic": null, "released": "2020-07-06", "tba": false, "updated": "2020-07-10T05:02:29", "background_image": "https://media.rawg.io/media/screenshots/297/2972218447213b517dd23b5e9526914d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gusbo"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}