{"id": 46354, "slug": "tales-of-glacier-vr", "name": "Tales of Glacier (VR)", "name_original": "Tales of Glacier (VR)", "description": "“Tales of Glacier” Background Story and Rules of the Game<br/>\r\nIt is said that there was a wonder land located in the coldest place of the earth. The indigenous people lived happily under the protect of the God. Until one day, an evil dragon came here leading its vicious corps. Destroying everything violently and expelling the residents out of their home, the evil dragon attempted to occupy the whole world. At this moment, the God came down from heaven and fought a life-and-death battle with the dragon in order to protect the residents. In the end, the dragon was defeated and fled into the ice land with its corps. The world was back in peace. To prevent the dragon from invading again, the God built a magic gate and sent guardians to garrison there. During this short peaceful time, everything was covered by cold thick ice. Turret was frozen and the magic has been weakened. The dragon from afar is getting ready for the next attack. Another protection battle is about to begin. <br/>\r\nOperation Instructions: <br/>\r\n1. Two-handed Sword: pressing the trigger key of either hilt, waving the hilt rapidly and then loosing the hilt, an attack could be launched. Controlling the hilt and crossing the swords with both hands, a defense could be conducted. Lifting two swords over your head could charge power. After charging for 3 seconds, waving down the swords simultaneously could trigger clutch shot. <br/>\n<br/>\r\n2. Wands: the left hilt of magical weapons controls magic book and the right hilt controls wands.Pressing the trigger key of right hilt could charge magic power. Adjusting the position of right hilt could control the cast track. Loosening the trigger key after charging power for 0.5 second could launch the magic according to the cast track. Pressing the trigger key of left hilt could conduct defense but attacks could not be conducted while defensing. Charging magic power for 1.5 seconds or 3 seconds could trigger more powerful magic.<br/>\r\n3. Bow and Arrow: left hilt controls the bow and right hilt controls the bowstring. Adjusting the position of left and right hilts and imitating the bow drawing action could control the arrow shooting track. Pressing the trigger key of right hilt and pulling back the right hilt could pull the string. Loosening the trigger key could shoot the arrow according to the shooting track. Pressing the trigger key of left hilt could conduct defense but attacks could not be conducted while defensing. After hitting one target, next attack will become multiple shot attack. Continuous hit will launch the clutch shot of bow and arrow.", "metacritic": null, "released": "2017-09-03", "tba": false, "updated": "2019-08-28T22:04:51", "background_image": "https://media.rawg.io/media/screenshots/46a/46a6d1b4d5d80597ebbbac0bf7719cac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["深圳槟果文化科技有限公司"], "genres": ["Action", "Adventure"], "publishers": ["深圳槟果文化科技有限公司"], "esrb_rating": null}