{"id": 46356, "slug": "skirmish-line", "name": "Skirmish Line", "name_original": "Skirmish Line", "description": "As an Allied tactical commander in the Pacific Theater, you are in-charge of fending off the fierce and fanatical Imperial Japanese military whilst adapting to an ever changing environment. Build trenches, call in artillery, upgrade your squad, and lead them to victory. Inspired by the classic flash game, Mud and Blood 2, Skirmish Line aims to provide players with a similar but fresh experience.<br/><br/>Skirmish Line is a brutal and difficult endless defense game featuring three modes: <br/><br/><strong>Arcade Mode</strong><br/>Defend three positions in succession against the relentless Imperial Japanese Army. If the enemy overruns, you will retreat to the next position. Should you find the enemy assaults too overwhelming, you may manually fallback to the next position. Do you retreat in order to preserve the lives of your men, or do you put up a determined defense in order to hold valuable ground?<br/><br/><strong>Classic Mode</strong><br/>For a more traditional experience, Classic Mode is stylized after the original Mud and Blood 2 rules. Advance forward to find favorable terrain or to gain valuable command points to spend on new soldiers, weapons, and defenses. But be careful, there is no retreat, no fallback positions in this mode!<br/><br/><strong>Campaign Mode</strong><br/>Build and manage your own squad in a persistent campaign, spanning multiple missions. You will be pressured by the overzealous theater commander to succeed on your missions at all costs, pitting the lives of your men versus the mission's objective. As you progress, you will be send on more dangerous missions. Use your renown as a field commander to purchase powerful upgrades in order to keep your squad alive and to complete the mission.<br/><br/><strong>Ribbons, Medals, and Rank</strong><br/>Complete extraordinary feats to earn ribbons and medals. Each ribbon or medal offers benefits to your squad. Gain access to special weapons, soldiers, and tactics as your rank up.<br/><br/><br/><br/><strong>Official Wiki</strong><br/>We understand that Skirmish Line can be a very difficult game. We have an official wiki for players to share their knowledge.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:51", "background_image": "https://media.rawg.io/media/screenshots/4a4/4a4e2410a0090b1026c7513c51c7e44f.jpg", "website": "https://www.skirmishlinegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7}, "playtime": 11, "achievements_count": 38, "ratings_count": 0, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Snarky Ant"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Snarky Ant"], "esrb_rating": null}