{"id": 463783, "slug": "blocks-itch-zachary-yaro", "name": "Blocks (itch) (Zachary Yaro)", "name_original": "Blocks (itch) (Zachary Yaro)", "description": "<p>⚠ <em>Blocks</em> runs very poorly in the browser; I highly recommend downloading the desktop version for the best experience.</p>\n<p>The initial idea behind <em>Blocks</em> was one I had for many months: There are many thing I do that keep me alive, keep me me mentally OK.  However, some people are not too accommodating of what makes other people comfortable.  You kind of end up having to decide how much discomfort you are willing to live with to continue associating with groups that have people like that.</p>\n<p>Additionally, some people have multiple facets to their identities that are important to them, but many people and groups ask you to pick one or two identities that are “you”, and some ask you to leave them all at the door.  Imagine, for instance, how a politician or news anchor would talk about someone who is, for instance, queer <em>and</em> Black <em>and</em> Jewish <em>and</em> disabled.</p>\n<p>In <em>Blocks</em>, you start with a stack of glowing blocks that act as an extension of you—if they touch a wall, you can climb; if they hit a barrier, you get stopped.  You can choose to discard any or all of them, but if you do, you might find the world gets a little darker.</p>\n<p>Not to get too heavy, though, <em>Blocks</em> also contains a pun.  It was a built during Possum House's Chill Jam 2.  The theme was “LAMP”, so my brain immediately went to the web development “LAMP stack” (Linux, Apache, MySQL, PHP) and games about stacks.  But after I had colored platforms and colored boxes, I was struggling to give it some some sort of visual identity, and while I was poking into other Unity docs, I stumbled upon someone talking about the 2D lights in the Universal Render Pipeline (formerly Lightweight Render Pipeline), and it all came together to make the “building blocks” of the character light sources—a literal lamp stack 😊</p>\r\n\r\nControls (not final):\r\n<p><strong>Move:</strong> ←/→ <em>or</em> A/D (QWERTY) <em>or</em> A/E (Dvorak)\r\n<br/>\n<strong>Jump (or climb, if touching a wall):</strong> Space <em>or</em> ↑ <em>or</em> W (QWERTY) or , (Dvorak)\r\n<br/>\n<strong>Release box:</strong> 1-5\r\n</p>", "metacritic": null, "released": "2020-07-13", "tba": false, "updated": "2020-07-13T03:00:43", "background_image": "https://media.rawg.io/media/screenshots/cb6/cb626a618cee6b5aa2e03e99229d919a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Zachary Yaro"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}