{"id": 463761, "slug": "haunted-towns-hidden-object-secret-mystery-ghost-t", "name": "Haunted Towns Hidden Object – Secret Mystery Ghost Town Pic Puzzle Spot Differences Objects Game", "name_original": "Haunted Towns Hidden Object – Secret Mystery Ghost Town Pic Puzzle Spot Differences Objects Game", "description": "Hidden Objects – Haunted Towns is an artistically crafted search and finder game with over 30 Eerie and Mysterious Levels. <br/><br/>Find Hidden Objects in Vacant Towns across Europe, Canada, Asia and United States. Explore the Shadowy Towns of No More!<br/><br/>Discover the Mystery of Abandoned Towns with Vacant Hotels, Crumbling Skyscrapers and Buildings, Old Jails, Rusted Cars, Vacant Churches, Broken-down Trains, Ramshackle Porches and Rickety Homes. Take an Eerie Trek Exploring Haunted Towns in the USA, Canada, Asia and Europe!<br/><br/>Levels vary from easy to difficult. A fun, object quest challenge for Hidden Object, Puzzle, Spot the Difference, Brain &amp; Word fans!<br/><br/>Haunted Towns is full of mysterious Adventures waiting for you!<br/><br/>Hidden Objects – Haunted Towns features:<br/>Gorgeous, Crisp Graphics with Haunting Themes<br/>3 Game Modes- Traditional, Chill, Adventure<br/>Exciting Levels/Scenes of Hidden Object Puzzles<br/>Zoom to Find Objects<br/>Find Objects by Picture, Word, or Collector<br/>Challenge Scenes with Missing Letters, Scrambled Words and Bonus Objects<br/>Timed Challenges and Hints<br/>Explore the Shadowy Towns of No More!<br/><br/><br/>Game Modes instructions:<br/>TRADITIONAL-<br/>Time limits<br/>Hint limits<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>CHILL-<br/>Time unlimited<br/>Hints unlimited<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>ADVENTURE-<br/>Time limits<br/>Hint limits<br/>Bonus Bonanza (words highlighted in green)<br/>Missing Letters, Scrambled Words, Word Finder<br/>15 Unique Levels", "metacritic": null, "released": "2016-06-10", "tba": false, "updated": "2020-07-13T02:52:33", "background_image": "https://media.rawg.io/media/screenshots/ac0/ac0605e5b7c6f4b36e29eb89af270430.jpg", "website": "http://www.detentionapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Detention Apps"], "genres": ["Strategy", "Puzzle"], "publishers": ["Detention Apps"], "esrb_rating": "Everyone 10+"}