{"id": 463742, "slug": "donuts-delivery", "name": "Donuts Delivery", "name_original": "Donuts Delivery", "description": "A puzzle full of yummy donuts.<br/><br/>A box of glistening sugary donuts awaits to be packed and shipped, it's your job to ensure the donuts are neatly arranged and kept in order. But some of these donuts mind you, have a mind of their own.<br/>​<br/>Donuts Delivery takes you through 200 of power-packed fun levels where you swipe away in all directions to bring the donuts to their correct position in the box. These donuts though, won't make your task easy. Some of them have a ticking firecracker ! some of them shuffle the whole box, some of them are coupled and move together, others are too stubborn to move!<br/>Their unique behavior makes the game super fun and often times challenging. <br/><br/>From the makers of A Thief's Journey, SwipeTrix, and Puzzle Pieces Mania comes yet another gorgeous puzzle game that we guarantee you will not put down.<br/>​<br/>Oh and did we mention, there is a whole donut shop waiting for you to be decorated! That's right, spend your spoils in the game to spruce up your own Donut cafe and watch as the place gets lit up. There are more than 50 decorative items for you to unlock through your journey!<br/>​<br/>Features:<br/>1. 200 tasty donuts filled levels.<br/>2. 6 Unique puzzle elements.<br/>3. 42 uniquely designed donuts.<br/>4. 50 Items available to decorate your donut shop.<br/>5. The Progressive difficulty of levels.<br/>6. iCloud Support: You can use iCloud to keep your order progress up-to-date across all your iOS devices <br/>7. Game Centre.<br/><br/>Cheers to Donut Delivery, a humble and fun offering from VRPlaying Games :).", "metacritic": null, "released": "2020-07-06", "tba": false, "updated": "2020-07-13T02:43:20", "background_image": "https://media.rawg.io/media/screenshots/b94/b94a615e2307cb05109e887c31b07b9f.jpg", "website": "https://www.vrplayinggames.com/donutsdelivey", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rakshak Kalwani"], "genres": ["Casual", "Puzzle"], "publishers": ["Rakshak Kalwani"], "esrb_rating": "Everyone 10+"}