{"id": 463904, "slug": "we-will-not-fall", "name": "We Will Not Fall", "name_original": "We Will Not Fall", "description": "<p>Controls:</p>\n<p>Manage your citizen with the arrows beside the number - you can assign your citizens to do differnt jobs. When the bar is filled, you can open the policy table from the bottom right - policies will change your resources stockpile drastically, and some of them can be signed multiple times. Experiment, analyze, remember. </p>\n<p>During the day, your resource will increase / decrease due to upkeep, and your citizen - when assigned job - will generate resources for you. Not the officers - they will help you with the policy, as they will spread your word more effectively and allow you to sign a new one more frequently.</p>\n<p>At night, the Darkness will attack, resulting in a loss at your Defense - you need to find a way to replenish it.<br/></p>\n<p>Policies and events will cause change in the resources - and yes, your number of citizen will be affected, too. Anything run out, you lose. Plan ahead, or plan to fail.</p>\n<p>------------------------------</p>\n<p>A short game made by me and Yunti.</p>\n<p>A castle is surrounded by the Darkness. There is no way out. You are chosen to be its leader to guide it through this rough experiece, this time.</p>\n<p>Manage your people. Take risks. A LOT OF RISKS.</p>\n<p>In time, you will learn to accept.</p>\n<p>*This is a late submisson. Due to power shortage we submitted one hour late. Take this into your consideration.*</p><p>------------------------------</p><p>Known Issues:</p><p>There there are an Ending system which will feature a ending screen, exclusive sound effect, and replay option - it is currently bugged. </p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T03:23:38", "background_image": "https://media.rawg.io/media/screenshots/880/880f667e37186e623c3d678a8b89d8d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["ToFuMan21"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}