{"id": 46395, "slug": "dragon-drop", "name": "Dragon Drop", "name_original": "Dragon Drop", "description": "Hey there! I'm Melon, a Pico Dragon from the absolutely hip new party game, \"Dragon Drop\"!<br/>I don't know who you are, or how I got here, or where \"here\" is for that matter (I'm VERY scared), but since you're here, let me tell you a little bit about Dragon Drop!<br/><br/>In Dragon Drop, you'll play as a Pico Dragon (like me!) and use our breath-defying PICO BEAMS to wipe rows of cubes off a checkerboard stage! With the right skill and timing, you can knock your rivals off the map and become a Dragon Drop champion!<br/><br/>Here are some of the features you can look forward to when Dragon Drop releases on Steam!<br/><ul><li>Play with up to four players or bots for the best in block-dropping mayhem, across dozens of unique stages!<br/></li><li>Customize your own Pico Dragon with a huge variety of hats and colors! (I don't know how many, but it's less than 100 billion)<br/></li><li>Clear achievement boards to unlock new customizations, stages, songs, and other rewards! New boards will be added over time!<br/></li><li>Rest easy with the knowledge that you've downloaded dragons to your computer!</li></ul><br/>We hope to see you drop in soon! And remember: I'm still trapped here! Tell the devs to let me out!!", "metacritic": null, "released": "2017-09-29", "tba": false, "updated": "2022-06-13T04:37:35", "background_image": "https://media.rawg.io/media/screenshots/31c/31c967c6ed93b1347b27f3a253adeeab.jpg", "website": "http://www.squishstudios.net/games/dragondrop/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cloudy Games", "Squish Studios"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Cloudy Games", "Squish Studios"], "esrb_rating": null}