{"id": 464, "slug": "baldurs-gate-enhanced-edition", "name": "Baldur's Gate: Enhanced Edition", "name_original": "Baldur's Gate: Enhanced Edition", "description": "<p>Baldur&#39;s Gate: Enhanced Edition is a fantasy role-playing game, a remake of the original 1998 release.</p>\n<h3>Plot</h3>\n<p>The plot follows a player-created character in the world of Forgotten Realms, mainly in the location known as the Sword Coast. Set out on a quest for vengeance and resolving a crisis, the hero finds many friends and enemies, and ultimately, reveals his origin and the circumstances of the game’s introduction.</p>\n<h3>Gameplay</h3>\n<p>The player can choose from different classes and in-game races, each with their advantages and disadvantages, and equip the corresponding gear to utilize the character’s skills of choice further. The role-playing system in the game is rich with dialogues and interactions with NPCs, as they often provide valuable information, quests or items. Combat in Baldur’s Gate is made through real-time actions and planning in pause mode, allowing players to create different strategies for more tough encounters.</p>\n<h3>New in enhanced edition</h3>\n<p>The remake brought various bugfixes and overhauls for current-gen gaming systems, allowing for bigger screen resolutions and overall higher quality of graphics while retaining the key gameplay features. New NPCs and related quests, as well as an expansion pack, were added to Enhanced Edition, and new difficulty levels were implemented, either for players who only want to immerse in the story, or those who prefer a real challenge to their skills.</p>", "metacritic": 78, "released": "2012-11-28", "tba": false, "updated": "2024-04-17T14:55:44", "background_image": "https://media.rawg.io/media/games/313/3136687fb0b34490d082b7272a0868e2.jpg", "website": "http://www.BaldursGate.com", "rating": 4.11, "rating_top": 4, "added_by_status": {"yet": 221, "owned": 2110, "beaten": 189, "toplay": 78, "dropped": 99, "playing": 37}, "playtime": 4, "achievements_count": 129, "ratings_count": 302, "suggestions_count": 521, "game_series_count": 0, "reviews_count": 309, "platforms": ["iOS", "Xbox One", "Nintendo Switch", "PlayStation 4", "Android", "Linux", "PC", "macOS"], "developers": ["BioWare", "Beamdog", "Overhaul Games"], "genres": ["RPG", "Strategy"], "publishers": ["Beamdog", "Overhaul Games"], "esrb_rating": "Teen"}