{"id": 46417, "slug": "walking-heavy", "name": "Walking Heavy", "name_original": "Walking Heavy", "description": "<strong>Welcome to England.</strong> Take on the role of a hitman, brought out of retirement by your former boss to help rid the streets of a mysterious new drug known only as HYPE. Navigating the UK via the night train you are tasked with hunting down HYPE suppliers and getting paid to drive up the street price of the drug.<br/><br/><strong>Open-World Isometric action.</strong> Bleak, moody isometric graphics set the scene as you ride between endless procedurally generated, open world levels. Explore the streets to find arms dealers, drug dealers, customers and most importantly – the target.<br/><br/><strong>How far can you get?</strong> With no limit to the number of HYPE suppliers on the streets, you will take on an infinite number of procedurally generated levels and an ever-increasing police presence to reach your targets.<br/><br/><strong>Choose the right tools.</strong> With up to 6 different weapons to purchase and upgrade, and a vast array of gadgets / equipment, from tracking devices to drones, you will have to decide how best to spend your earnings to suit your style of play.<br/><br/><strong>Develop your skills.</strong> 5 years of lying on the beaches of Thailand (or was it Cambodia?) have left you feeling a bit rusty – with multiple skills to upgrade keep taking out those targets and you will find your feet in no time.<br/><br/><strong>Welcome to the HYPE Trade.</strong> With such a hot insider tip on the rising price of HYPE, why sit on it? Buy and sell the drug at perpetually increasing prices and make some extra pocket money on the side.", "metacritic": null, "released": "2017-10-20", "tba": false, "updated": "2019-08-28T22:04:49", "background_image": "https://media.rawg.io/media/screenshots/db9/db99c89159cfbdb2d1c20655a8cb7945.jpg", "website": "https://www.walkingheavy.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gregory Oldham"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["GO Studio"], "esrb_rating": null}