{"id": 46445, "slug": "ramp-champ", "name": "Ramp Champ", "name_original": "Ramp Champ", "description": "A new twist on classic boardwalk games. Ramp Champ will delight and challenge players young and old. Four levels, or \"ramps,\" are included by default: Clown Town, Breakwater Bay, Icon Garden &amp; Space Swarm. Flick your finger to roll balls down each of the themed ramps to earn virtual tickets which can be redeemed for prizes and digital loot. Ramp Champ is great for players wanting to play for 5 minutes collecting tickets or several hours working to solve the unique puzzles hidden inside each level. When you've completed the default ramps, more adventures await you via Ramp Champ's in-app purchase option. Each add-on pack offers new challenges, original music and collectible knickknacks.<br/><br/>––––––––––––––––––<br/><br/>\"About as much fun as you can have without getting caramel apples &amp; cotton candy all over your hands.\"<br/>- Macworld / 4.5 Mice<br/><br/>\"Ramp Champ is loaded with charm\"<br/>- G4's Attack of the Show<br/><br/>––––––––––––––––––<br/><br/>Features<br/><br/>• Easy to learn and beautiful to look at<br/>• Four built-in levels or \"ramps\" each with themed goals &amp; prizes<br/>• Collect tickets and exchange for dozens of virtual knickknacks<br/>• Purchase additional Ramp Packs in-app for new, exciting challenges<br/>• Dozens of hours of addictive gameplay<br/>• Original soundtrack", "metacritic": null, "released": "2009-08-25", "tba": false, "updated": "2019-10-22T14:00:10", "background_image": "https://media.rawg.io/media/screenshots/6ab/6ab2bb25e14840db30e038484d74a5a6.jpg", "website": "http://facebook.com/rampchampapp", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SocketFace Games"], "genres": ["Arcade", "Puzzle"], "publishers": ["SocketFace Games"], "esrb_rating": "Everyone 10+"}