{"id": 46440, "slug": "bored-ogre", "name": "Bored Ogre", "name_original": "Bored Ogre", "description": "\"Once upon a time, far from every village, in the farthest of valleys, on the highest of mountains and in the largest of castles, lived a giant ogre. <br/>All alone in his castle the poor Ogre wasn’t happy, he went through his days remembering of passed adventures and epic fights with dragons and monsters even bigger than him. But the world had changed, it was years since he last met another ogre and ancient monsters where no where to be seen. <br/>One day, a human adventurer stumbled upon his castle and terrified by the giant ogre, ran back to his village to report about the hideout location and his terrifying inhabitant. <br/>The tale of the giant ogre spread rapidly among humans, and from every land, from every village and from every castle, the most valiant knights would depart towards the giant ogre mountain to prove their valor, defeat the ogre and return for eternal glory and a princess of their choosing.<br/>But the knights had no chances and ogre was bored...<br/>\"<br/><br/>In Bored Ogre you'll help a giant ogre fight boredom using the knights he has captured as golf balls, darts and basketballs in a crazy mix of puzzles and action.<br/>Game comes with various game modes, with some supporting up to 4 players on same device.<br/><br/>Play darts with your friends, Toss knights into shark infested bowls or compete for the highest score in the many makeshift \"golf\" courses.", "metacritic": null, "released": "2017-09-06", "tba": false, "updated": "2019-10-22T14:30:47", "background_image": "https://media.rawg.io/media/screenshots/756/756af8bf217bec495fa1d25f183a7e26.jpg", "website": "http://www.frozenpepper.it", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FrozenPepper"], "genres": ["Adventure", "Puzzle"], "publishers": ["FrozenPepper"], "esrb_rating": "Everyone 10+"}