{"id": 46456, "slug": "the-caribbean-sail", "name": "The Caribbean Sail", "name_original": "The Caribbean Sail", "description": "Be the Captain of your own ship in the 1700's and make decisions that will determine your fate. Control everything from food rationing to amputating limbs. Sail for the British Navy or rebel and become a pirate. The lives of your crew are in your gout ridden hands.Gameplay OverviewName your crew, choose your profession, purchase a ship, stock up on supplies, and then set sail at the mercy of the wind. You'll encounter pirates, storms, disease, starvation, and death as you sail 4,341 miles of open ocean.<br/><br/><br/>Survive the voyage and arrive in Nassau to have your captain's name uploaded to the leaderboard! If you fail and die horribly, you can leave a message in a bottle that you'll find as a marker on your next voyages.<br/><br/>Each vessel matches the speed of it's real life counterpart which will give you an accurate depiction of how difficult a journey across the ocean was in the age of sail. You could enjoy a casual experience on a Frigate as you fly across the waves and decimate pirates in a War Galleon like a rich ponce- <strong>or</strong> -Suffer a <strong>HARDCORE</strong> challenge on the Raft and struggle to feed your men daily while your vessel crawls along so slowly you'll BEG the wind to pick up.<br/><br/> The Exciting Stuff! <ul> <li> 8-bit renditions of nautical shanties and folk songs!<br/> </li><li> Funny and depressing people to talk to!<br/> </li><li> Harpoon Fishing!<br/> </li><li> Treacherous Reefs!<br/> </li><li> Dynamic Weather!<br/> </li><li> Varied difficulty by ship!<br/> </li><li> Hypnotic Water!<br/> </li><li> Naval Skirmishes!<br/> </li><li> Online Leaderboards!<br/> </li><li> Dark Whimsy!<br/> </li><li> Secrets and Easter eggs!<br/> </li><li> Turtles!<br/> </li><li> -and NO crafting! I promise!</li></ul>Two large content expansions are being developed and will be added for free<ul><li>Route Planning - Plot your own course across the Atlantic and visit new locations!<br/></li><li>Fantasy Toggle - Fantastic legends of the sea, myths, monsters, and more brought to life!<br/><br/></li></ul>", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2023-01-24T14:59:51", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7f67d0b70075512fae0c6ed97121982.jpg", "website": "https://victorianclambake.com/caribbeansail", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 33, "toplay": 2, "dropped": 3, "playing": 1}, "playtime": 2, "achievements_count": 34, "ratings_count": 4, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "Linux", "PC"], "developers": ["Victorian Clambake"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Victorian Clambake"], "esrb_rating": null}