{"id": 464664, "slug": "stocks-are-outta-control", "name": "Stocks are outta control", "name_original": "Stocks are outta control", "description": "<p>Hello!</p>\n<p>This game is about trading stocks and suffering. You are a businessman, you have a coffee machine, pc and no door in your room.  On your PC  you can trade SWEET stocks. All prices are taken from real stocks. Which ones? <em>i'll not tell you this... </em>But i'll tell their ingame tickers! RICE (Yup), LEDNR, MCLR, EMRCH, JNSBO, BRFAAD, COKABR, BCKR, KOEP, ROSCFE. Also, you have a limted amount of actions (trades), specifically 20. To restore them you can buy a coffee, it costs only 100$... Cheapest coffee in your life, it's on sale. Oh, and how does this game corresponds to the theme (Out of control)? One day you wake up, and prices of stocks start going at insane speeds! Stocks are out of control! It's in the title of the game! Your goal is to gain a much money in 20 minutes as you can. i made music myself. And also, i did not had enough time, so, no menu, and no sounds except music.</p>\n<p>✨ TuToRiAl ✨</p>\n<p>A, D to move. E to interract. Escape to exit terminal. (Terminal is on the PC)</p>\n\n\n<p>Game lasts 20 minutes. At the end it shows your score. Here's mine:</p>\n\n<p>I'm awful. Post you're score in the comments! Goodbye!</p>\n\n<p><em>This game is made for GMTK </em><em>Game Jam 2020.</em></p>\n\n\n\n<p>Oh, i think i forgot something... Ahh! I'm 13! It's the law that kids must tell they're age ABSOLUTELY EVERYWHERE AFTER OR BEFORE THEY WRITTEN SOMETHING ON THE INTERNET!!!</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T06:02:42", "background_image": "https://media.rawg.io/media/screenshots/52f/52f4b025fdc69e994578baa2cd5cd189.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Coder channel"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}