{"id": 46468, "slug": "within-whispers-the-fall", "name": "Within Whispers: The Fall", "name_original": "Within Whispers: The Fall", "description": "„Heavy battles are taking place on all fronts daily... Many have fallen on the battlefield, and many more will fall. And who will return unscathed? All fields where there were battles are strewn with the killed and those dying from their wounds – our soldiers and the Germans. And how many more will fall? War... What a horror! Death and destruction all around. “<br/><br/>Russian soldier<br/><br/>Many stories have been untold and war brings nothing but tears, misery and despair. But misery likes company and tears are the finest ink. Aska holds the pen. She smears a glimmer of hope within the war torn tapestry of despair. <br/>Follow Aska, a brave young woman, through trenches and battlefields of the Great War and see what lies ahead.<br/> <br/><strong>Key Features</strong><br/><br/>Unique artstyle<br/>Inspired by comic book artstyle, roam through the battlefields of the Great War, beautiful sceneries of peaceful European countryside, and terrifying devastations. Go back through time and feel the earie atmosphere of blood-soaked tents in this unique narrative driven point-and-click adventure game.<br/><br/>Follow Aska<br/>Dive into the character of a young woman stricken by the horrors of war, who is trying to find her missing brother while she struggles with her “gift”, being able to see and communicate with ghosts of dead soldiers. She can only hope that there is but one ghost she will never see.<br/><br/>Storyline<br/>Explore and evolve along with Aska. You won’t be indifferent at any given moment, considering that each one could be your last. So many dead soldiers, so many incomplete stories…<br/><br/>Great War<br/>Experience one the greatest wars that humankind has ever faced. Feel the true dread of WW1 and relive stories of unfortunate souls.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:48", "background_image": "https://media.rawg.io/media/screenshots/24b/24bc916211f483a5651fd8fcefe37e30.jpg", "website": "http://www.thoriumstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thorium Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Thorium Studios"], "esrb_rating": null}