{"id": 464796, "slug": "mindflayer925", "name": "Mindflayer925", "name_original": "Mindflayer925", "description": "<p>This game was made in 48 hours for the 2020 GMTK Game Jam.</p>\r\nCAUTION: Game-breaking bug. Pressing 'E' while you are adjacent to more than 1 office worker will crash the game. For instances where you need to interact with a water cooler, just make sure that there aren't any other people around you. The only place where this doesn't apply is the final stage (the office). \r\n<p>(Note: Whoops! I uploaded the whole project and not just the build folder, so to play the game, first download the .zip file, then extract it and search for the 'build' folder. Once there, you can run the .exe)<br/></p>\n<p>You play as Bobby M. Flayer, a mindflayer working a desk job at PuzzleCorp, the leading supplier of puzzle related widgets and gizmos. One day, you find yourself stuck in a labyrinthian utility closet. Lose control, embrace your mindflayer heritage, and control the wills of your feeble-minded coworkers to solve puzzles and escape the utility closet. <br/></p>\n<p>Source code would be available on github, but it's too big, so I've added the source to the WebGL build page.<br/></p>\n<p>NOTE:<br/></p>\n<p>If you want to play in the browser, go to the WebGL [<strong>uploaded post-submission deadline</strong>] version here (it's the same as the original except for a game-breaking bug fix): WebGL Build<br/></p>\n<p>------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>\n<p>Personal Thoughts:</p>\n<p>Going in to this, I had only done two previous game jams (Ludum Dare 43 and 46). While both experiences were extremely worth it, and I learned a ton doing each, neither game was particularly polished. So my goal going in to this one was to have a polished experience (or as best I can in 48 hours). My other goal was not to work too much on the game, so I limited myself to working between 8 AM to 10 PM. I'm not one to pull crazy all-nighters. Overall, I gotta say that I'm pleased with the results. Of course there are nonsensical bugs (try talking to more than one person at a time!), but the game is 'playable',  has more than one level, and the menus are not just flat monochromatic backgrounds with default TextMeshPro text fields slapped over them. That's a success in my books!</p>\n<p>To be more concrete, here's what I'm happy with:</p>\n<p>1. The look. Coming from \"Goats of Wrath\" as my previous 2D pixel-art game jam project, my sprite work has gotten so much better. I've been learning how to do actual animations and even some more advanced stuff like follow-through (giving moving objects momentum). <br/></p>\n<p><!--/UNDER CONSTRUCTION//--><br/></p>\n<p> <br/></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T06:29:04", "background_image": "https://media.rawg.io/media/screenshots/383/3830eea112058744d7e7cbf9dc9eb611.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blarbus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}