{"id": 46487, "slug": "goldrushers", "name": "GOLDRUSHERS", "name_original": "GOLDRUSHERS", "description": "A Goldrush themed local multiplayer brawler for PC and Mac !<br/>Play as two competing prospectors trying to fill your safes with precious gold nuggets or other items of value.<br/>Whether it's in the dusty hills of the Sierra Nevada, the icy peaks of the Klondike, or the burning heat of the desert, it's your chance to strike it rich!<br/><br/>But beware, competing prospectors abound!<br/>Armed with dynamite and bear traps and no sense of the law. <br/><br/>GOLDRUSHERS will provide fast paced action, wacky antics, and flying horses for your living room.FEATURES<ul><li>SPLIT-SCREEN MULTIPLAYER - Share a couch but steal the gold! Two players compete for one to three stages.<br/></li><li>TWO-SCREEN MULTIPLAYER - We are in 2017! You can play GOLDRUSHERS on two screens for the ultimate experience!<br/></li><li>THREE UNIQUE LEVELS - Choose from our 3 exotic locations with challenges to face and secrets to uncover!<br/></li><li>MORE THAN 40 ITEMS TO FIND - Have you ever wondered how many dollars a snowman is worth? Just throw them in your safe and you'll find out!<br/></li><li>DYNAMITE - Use dynamite to stun the other prospector and break into their safe - it's a blast!<br/></li><li>BEARTRAPS - Hide beartraps and slow down the other player for an eternity!<br/></li><li>FLYING HORSES - Throw them at the other player!</li></ul><br/><strong>Notice: </strong>GOLDRUSHERS requires a controller and two players to play.", "metacritic": null, "released": "2017-09-08", "tba": false, "updated": "2019-08-28T17:05:18", "background_image": "https://media.rawg.io/media/screenshots/d1e/d1e58ee3c08273c1118fef72e39b0277.jpg", "website": "http://goldrushers.gold/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["unnaturalism"], "genres": ["Action", "Indie"], "publishers": ["UnNaturalism"], "esrb_rating": null}