{"id": 464867, "slug": "ride-and-die", "name": "Ride and Die", "name_original": "Ride and Die", "description": "<p>My submission for the GMTK 2020 Game Jam!</p>\n<p>Ride and Die is a slippery top-down arcade driving game, with the goal of taxiing between destinations and picking up collectibles to  raise your score higher... but there's a twist. While you may want to drive slowly to avoid obstacles, you need to be careful, if you go too long without boosting, you start to take damage! </p>\n<p>Drift around corners, boost down straightaways, dodge obstacles and complete objects to survive as long as you can, and boost your score as high as you can manage!</p>\n\n<p><strong>Controls</strong><br/></p>\n<ul><li>Use W/A to accelerate and reverse, and A/S to turn.</li><li>To make sharp turns, hold down Left Ctrl with enough speed to drift.</li><li>With enough speed, hold down Left Shift to boost! Boost as long as you can!</li></ul>\n<p><strong>Instructions</strong></p>\n<ul><li>The red bar in the bottom lefthand corner of the screen is your 'boost fatigue' - if you go too long without boosting, you take damage.</li><li>The green bar in the top lefthand corner of your screen is your HP.  You lose HP when you hit obstacles in the road, or when your boost fatigue bar is empty. </li><li>The main way to earn points is to taxi between destinations. Red circles represent pick-up locations, and Green circles represent drop off locations. You earn score based on how far it is between a pick-up and drop-off, and how fast you get between the two.</li><li>The green arrow near your car points towards the nearest drop-off location!</li><li>Sometimes you'll see green or gold collectibles on the road. These give you HP and Score respectively.</li><li>Don't stop boosting!</li></ul>\n\n<p>This is my first ever game jam submission, and a solo effort. I hope you all enjoy!</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T06:42:39", "background_image": "https://media.rawg.io/media/screenshots/82d/82de8dde2e8ce870584fe7e2e40ebf9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elianyaa"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}