{"id": 46484, "slug": "xenocite-clad", "name": "Xenocite Clad", "name_original": "Xenocite Clad", "description": "Xalia, a lone syr finds herself in opposition of two entities that actively fight for control of the city's complex that served as her birthplace; Tarentia. It is now no longer a city, but a battleground littered with danger. Awaiting you are secrets of the past, so that the city's true colors can be known. Xalia's internal conflict is both to learn of her origin, and her place amongst the ruins of the world left behind. Will she take a side in the war that consumes the world beyond?<br/><br/>Luanrel, a militant leader, came to Tarentia in search of the rumored syr's heart. With her forces, and her allies who join them in the war against the syr, she delved into the heart to see it destroyed, alongside all of the syr controlled by it. Upon arriving, some soldiers went missing. With the rest of her men, she pressed forward, only to be ambushed by and separated from her soldiers. What is to come of her unit? Could any of them have survived in this techmaturgical deathtrap? Her mission is clear: Plunge the sword that felled legends into the heart of this war machine, ending it for good, or die trying.<br/><br/><br/><br/><br/>Xenocite Clad places you in the abandoned world of an advanced civilization, that mysteriously disappeared overnight. Centuries later, the ruins have been revitalized, bringing back life forms of varying hostilities. Brave these ruins against predators, unforeseen allies, and more as you search for a resolution to your conflicts as one of two heroines- Xalia the syr, wielding an energy blade and her Energy Compressor Drone, E, immerse yourself in the knowledge of your forefathers' civilization, and what caused their immediate disappearance. This path will make her not only face the sins of her creator, but long to atone for them. <br/><br/><br/><br/><br/>Features:<br/><br/>-Fast-paced, pixel action. Witness the challenge unfold before you as you strive to survive.<br/><br/>-Two opposing stories to showcase the views on the war that consumes the outside world.<br/><br/>-Over 100 pieces of retrievable data to utilize to your advantage.<br/><br/>-Three distinct difficulties that influence the world and it's behaviors.<br/><br/>-Customize your play utilizing many different weapon upgrades, each with their own advantages.<br/><br/>-An interactive world that pulls at the player's decision-making skills to navigate, each choice weighing in on the progression of the game.<br/><br/>-A beautiful soundtrack composed with the talents of John Sinclair and GlitchxCity<br/><br/><br/><br/><br/><br/>Why not Early Access?<br/>-We want to ensure that the experience for the player is as immersive as it is impressive. The intention is to provide a cohesive and exciting story that compels you to keep playing.<br/><br/>Will there be co-op?<br/>-Co-op has no place here due to the storylines being vastly different, which could conflict with each other's progression and ability to enjoy the game.<br/><br/>What variety is there to the gameplay?<br/>-Zones are designed so that challenging obstacles can be approached and accomplished in many different ways. This allows people to develop their own solution, rather than following a linear and boring puzzle through every zone. We want the player to feel their choices pay off in their own order as they desire.<br/><br/><br/>What weaponry will there be?<br/>-While the story can be approached through a pacifist mentality, we also wanted to give players a wide range of weaponry to suit their desires, whatever they may be. Each weapons-system will function vastly differently depending on the artillery the player chooses to back it up. In total, there are 15 different weapons for 5 different systems.<br/><br/>How much is yet to be complete?<br/>-Currently, the main priority is finishing/updating art assets. Aside from that, improving the zone layouts to make them feel unique with every screen. Everything aimed to be done by early Spring of 2018.<br/><br/>Will there be any additions after release?<br/>-We have a few things in the works for additional content post-release, being expansions to the large world to explore even further.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:48", "background_image": "https://media.rawg.io/media/screenshots/750/750c675c7268ba3a0f5bf8db6c2abb80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["White Clover"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["White Clover"], "esrb_rating": null}