{"id": 464878, "slug": "tower-tour", "name": "Tower Tour", "name_original": "Tower Tour", "description": "<p><em><strong>Tower Tour </strong></em>is a retro-inspried platformer based on games such as Super Mario Bros, Micro Mages,  Kirby's Adventure, &amp; Shovel Knight. It features three unique hand-crafted levels along with a boss fight to conclude each one.</p>\n\r\nSTORY\r\n<p>On a bright &amp; sunny morning in the kingdom of withbit, an evil wizard appears putting everyone under a spell. Everyone, that is, apart from a lone knight whose <em>tinfoil</em> helmet protects him from the wizard's <em>'evil brainwaves'</em> (probably). The only way the knight might stant a chance against the wizard is if he colects the three magic stones atop each of the three guardian towers. The only problem is that the wizard has already gone ahead and turned the guardian towers into 'gauntet towers'. The only thing you can do is traverse all three towers, defeat the minions the wizard has left behind, and eventually face off against the wizard and free your friends from the spell. It won't be easy however as the wizard has a few tricks up his sleeve. It may feel like your in control, but don't let this wizard fool you. Never forget: you're at his mercy</p>\n\r\nOUT OF CONTROL\r\n<p>When facing up against an almighty wizard, one thing to keep in mind is that he can do just about <em><strong>anything.</strong></em> He can move the camera on his own, he can switch your controls around, he can even change gravity. With this guy around it's bound to get quite hectic and <em>out of control</em>. It's time to rethink what you take for granted in a platforming game, because this wizard doesn't intend to make it easy for you.</p>\n\r\nCONTROLS\r\n<p>WASD or the Arrow Keys to move</p>\n<p>Z, or Space to jump</p>\n<p>X to use your sword</p>\n<p>That is, if the wizard lets you..</p>\n<p> </p>\r\nPLATFORMS\r\n<p>Windows 7 or higher</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T06:44:55", "background_image": "https://media.rawg.io/media/screenshots/79c/79cbb29768f6e7cb2f0416d754abb693.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adam Watters"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}