{"id": 46497, "slug": "empyre-lords-of-the-sea-gates", "name": "EMPYRE: Lords of the Sea Gates", "name_original": "EMPYRE: Lords of the Sea Gates", "description": "<strong>Overview</strong><br/><br/>In 1899, the coastal cities of the world flooded. In New York City, most people left. But some didn’t. Those people banded together into groups forming their own City-States. Italian immigrants in Little Italy formed the Mano Nera City-State, the police and government workers became the Tammany City-State and so on. <br/><br/>Determined to survive and even thrive in this hostile environment, they turned to the sea for sustenance. What they could not provide themselves, they traded for with the “Mainlanders”. Fresh water pumped into the city through pipes. One day, the water stops flowing through the pipes. As the city watches it’s water reserves run lower and lower, it is you who will attempt to save them…<br/><br/><strong>Features</strong><br/><br/><ul><li>Superb Story: Our game was penned by distinguished author and cartoonist Paul Noth. <br/></li><li>Neo-Victorian Setting: Steam technology has dominated all technological advances.  <br/></li><li>Authenticity:  Many aspects of 19th Century “Gilded Age” New York can be found in-game. <br/></li><li>Fast Tactics Combat System:  Plan your attack in peace and then execute it in Real Time.<br/></li><li>Art of Barter System: Barter weapons for weapons with traders. No money allowed.<br/></li><li>Nerve System: Nervous characters will at times fail you. But there are medicines for that. <br/></li><li>Archetypes: Choose from four different archetypes to find the one that best fits your playstyle. <br/></li><li>Professions: Characters will have 19th Century Professions that modify their statistics. <br/></li><li>Customization: Choose your perks and upgrade your skills. <br/></li><li>Unique Weapons: Weapons are modified to fit a Steam powered world. Or created from scratch. <br/></li><li>Medicinal Items: Genuine Medical products, many of which contain poisonous substances. </li></ul><br/><br/><br/><strong>The Game</strong><br/><br/>Empyre: Lords of the Sea Gates is a Role-Playing Game in the Classic sense. Our goal was to provide you with the familiar experience of looting, questing, character progression and more just like the old school games did. Aside from the graphical upgrade to the present day, we also wanted to forge our own path in the way we tell stories and the world we create for you. <br/><br/>The 19th Century has a wealth of experiences to draw from that you don’t typically see in most games. That gives us a chance to give you something new. To give a few examples: Successful politicians were those with the largest gang of thugs and control over the Polling Stations. Workers Unions were coming of age around this time with frequent strikes and many times, strikebreakers. In gambling dens, dogs would fight rats. This is a sampling of some of the ideas we worked with in telling our stories. <br/><br/>We also wanted you to feel that our world has a sense of Authenticity. In a flooded, Neo-Victorian version of New York, that sounds a little far-fetched. Yet, we did our research. You will meet real life figures from the era: Monk Eastman, Mock Dock, Silent Charlie Murphy. You will visit real life locations: The Tombs Prison, the Brooklyn Bridge. You will consume real life medicines when your party is in trouble: Goulard’s Extract, Hunt’s Remedy, Shoo-Fly Powder for Drunkenness. That is if you trust Victorian era medicine...   <br/><br/><br/>There is #nowatertodrink. Please send help!", "metacritic": null, "released": "2017-10-04", "tba": false, "updated": "2019-08-28T22:04:47", "background_image": "https://media.rawg.io/media/screenshots/418/41854dc3afedddcccfacce039748d57d.jpg", "website": "http://empyrethegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 66, "ratings_count": 1, "suggestions_count": 584, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Coin Operated Games"], "genres": ["RPG"], "publishers": ["Work Shift Play", "Coin Operated Games"], "esrb_rating": null}