{"id": 46500, "slug": "elisa-seduce-the-innkeeper", "name": "Elisa: Seduce the Innkeeper", "name_original": "Elisa: Seduce the Innkeeper", "description": "Even if these girls are outrageously gorgeous, they are so well known for the very reason that nobody could ever manage to conquer them.<br/>Therefore it will be a tough challenge, nothing - and nobody - can be taken for granted.<br/><br/>The game will make the player face some decisions, and by directly controlling his character’s dialogues he will unlock specific reactions.<br/>So are you ready to start this rich and intense adventure where for once your choices really matters?<br/><br/><br/>Our game offers more than 40 primary and secondary choices. These choices will positively and negatively influence how the story unfolds.<br/>• Take control of our main character; be the one to decide his dialogues. \"Be good\" or \"bad\", it's up to you!<br/><br/>• Our girls will react differently depending on the situation!<br/><br/>• But obviously, there is much more! Other than making good and bad choices, the player will have the chance to unlock specific personality traits, as his behavior is shaped.<br/><br/>Also:<br/>• Unlock 15+ Locations and backgrounds made by our artist Ria (winner of the \"2015 Last Draw\" nationwide anime-style illustration competition).<br/>• 30+ Artworks made by our artist Bicio (winner of the \"2015 Latin American Manga contest\").<br/>• Trading cards &amp; Achievements.<br/>• Unlock and listen to our soundtrack whenever you want!<br/>• Collect secret artworks and bonus scenes in our Art Gallery.<br/>Each artwork and background of our Visual Novel is available in 4k ULTRA HD resolution, which offers clearer and more detailed images even at lower resolutions.", "metacritic": null, "released": "2017-09-25", "tba": false, "updated": "2023-07-29T15:24:13", "background_image": "https://media.rawg.io/media/screenshots/35a/35ac37b4bc1ef943152f609453820b7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 27, "beaten": 2, "toplay": 1}, "playtime": 3, "achievements_count": 9, "ratings_count": 2, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Neoclassic Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Neoclassic Games"], "esrb_rating": null}