{"id": 465069, "slug": "no-voice-control", "name": "NO! - Voice Control", "name_original": "NO! - Voice Control", "description": "<p><strong>NO! - Voice Control:</strong><br/></p>\n<p>This is a game where you try to help Sid, a young  boy, get back his stolen beach-ball, by guiding him with your voice (yes, with voice recognition).</p>\n<p>You will jump platforms, overcome obstacles, fight enemies, and even defeat a boss (if you manage to get that far).</p>\n<p>But remember, Sid is just a scared little boy. He won't listen to you if he doesn't trust you, and he will freeze if he's afraid. Talk him into trusting you, and help him get through the scare.</p>\n<p>The game is pretty hard - <strong>BUT DON'T GIVE UP!</strong> - Its worth it!</p>\n<p><strong>Tips:</strong></p>\n<p>- If you get stuck, try using the \"Die\" command.</p>\n<p>- Try using \"stand up\" and \"crouch down\" for better voice recognition.</p>\n<p>- Try using several commands at once such as \"right jump\".<br/></p>\n<p>- Keep your settings open for quick restarts of the windows voice recognition system.</p>\n<p><strong>MAKE SURE TO FOLLOW ALL THE INSTALLATION PROCESS EXACTLY.</strong></p>\n<p>Sadly, the game just doesn't run on all PC's, so if you followed the installation instructions completely (which means you made sure voice recognition settings are enabled) and it still doesn't work, it might just not work for your PC (could be a microphone/driver problem).</p>\n<p><strong>Credits:</strong><br/></p>\n<p>Yuri2010 - Creator &amp; Programmer</p>\n<p>Nadavyo - Music &amp; Art</p>\n<p>Other creators that helped by uploading non-copyright assets to the web</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T07:27:40", "background_image": "https://media.rawg.io/media/screenshots/1af/1af317cfc53786a7486ccf88d056e773.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yuri2010"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}