{"id": 465102, "slug": "button-smasher-rymlks-wandream", "name": "Button Smasher (rymlks, wandream)", "name_original": "Button Smasher (rymlks, wandream)", "description": "<p>Some days you just can't get rid of a bomb. Button Smasher is a game about a wizard carrying a magic bomb that will explode at any moment. Using your magic, you can prevent the bomb from exploding as long as you have mana, but you don't have much mana! The only way to get more mana is by breaking the power crystals in your pocket, but this comes at a cost. Each crystal controls one of your character's actions, and when the crystal breaks, you lose control over that action. Each crystal does something different when it breaks, and you have to figure out what actions you can afford to lose to get to the finish line on time!</p>\n\n<p>A game by Schala and Rick.</p>\n\n<p>A royalty-free asset was used in the making of this game:</p>\n\n<p>The crystal smashing sound effect (original name \"Mirror Breaking\") was made and copyrighted Mike Koenig under the Attribution 3.0 license on soundbible.com. Original sound effect modified from original by the use of Unity AudioSource pitch shifting. Original located at </p>\n<p>http://soundbible.com/1658-Mirror-Breaking.html</p>\n<p>Attribution 3.0 License can be found here: https://creativecommons.org/licenses/by/3.0/</p>\n\n<p>This game is not endorsed by Mike Koenig, nor was Mike Koenig affiliated in the development of this game in any way other than uploading his public sound effect to soundbible.com.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T07:34:37", "background_image": "https://media.rawg.io/media/screenshots/462/462357b49f4972369aa63a5ec3c68b1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["rymlks", "wandream"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}