{"id": 46510, "slug": "corpse-party-the-anthology-sachikos-game-of-love-h", "name": "Corpse Party The Anthology: Sachiko’s Game of Love Hysteric Birthday 2U", "name_original": "Corpse Party The Anthology: Sachiko’s Game of Love Hysteric Birthday 2U", "description": "<p>A comedic spin-off to the Corpse Party franchise taking place during Sachiko’s Birthday party.</p>\n<p>From Wikipedia:<br />\nOn the day of Sachiko&#39;s birth and death, the curse on her weakens and she gets 24 hours to celebrate her birthday as someone closer to the girl she was before her death. She uses the timeloops as established in Corpse Party: Book of Shadows to force all survivors at that point to participate in activities she has set up. Given it&#39;s either that or die horribly again, something all are aware that they&#39;ve already experienced but can&#39;t remember in full, they go along with her demands. The game features almost all characters from the previous games and some new ones. While a pseudo-horror spin-off at best, it is part of the storyline, setting up a few details to prepare for Corpse Party: Blood Drive.</p>\n<p>As with Corpse Party: Book of Shadows, there is only one extra chapter. This extra chapter takes place during the previous game and is more conventional horror. It tells of Yoshiki&#39;s and Ayumi&#39;s encounter with four students from Sugatani Senior High School, notably Azusa Takai.</p>", "metacritic": null, "released": "2012-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/games/779/7794cfc649d31496316471f53964f7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 1, "platforms": ["PSP"], "developers": ["5pb."], "genres": ["Adventure"], "publishers": ["5pb.", "Team GrisGris"], "esrb_rating": null}