{"id": 465150, "slug": "gmtk-2020-faulty-leds", "name": "GMTK 2020 - Faulty LEDs", "name_original": "GMTK 2020 - Faulty LEDs", "description": "<p><strong>Faulty LEDs</strong> is a puzzle game where you don't make all the moves.<br/></p>\n<p>Get the puzzle board as close to completion as possible before the end of the round, where your hard work may be undone by mutations. Try to go as long as possible before things spiral <em>Out Of Control</em>.<br/></p>\n<p>Every round you take damage for each tile that does not meet its rule:</p>\n<ul><li>Red Tiles<ul><li>These unfriendly tiles hate being next to each other. No Red tile can be adjacent (Up, Down, Left, Right) to another Red tile, unless their is an active wall in the way.</li></ul></li><li>Green Tiles<ul><li>These tiles like like to get together, just not too much. 2, 3, and 4's a party, but 5's a crowd. Green tiles must be in a connected group of Green tiles that is 2, 3, or 4 tiles in size. Active walls block Green tiles from being in the same group.</li></ul></li><li>Blue Tiles<ul><li>The picky Blue tiles like options. The tiles directly above and below Blue tiles must be different colours from each other. Similarly, the tiles directly to the left and right of a Blue tile must be different colours from each other. Walls have no effect on Blue tiles.</li></ul></li></ul>\n<p>The tools you have at your disposal are as follows:</p>\n<ul><li>Pointer<ul><li>Click a tile to change its colour. Left click to cycle forwards, right click to cycle backwards.</li></ul></li><li>Claw<ul><li>Click a tile to select it. Click another tile to switch the two tile's positions with each other, or click the selected tile again to cancel.</li></ul></li><li>Hammer<ul><li>Click a wall to change its state.</li></ul></li><li>Lockpick<ul><li>Click a tile to affect all its surrounding walls. Left click to turn them all off, right click to turn them all on.</li></ul></li></ul>\n<p>(F to toggle Fullscreen)<br/></p>\n<p>Credit for the Font m5x7 to Daniel Linssen.<br/></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T07:44:29", "background_image": "https://media.rawg.io/media/screenshots/ea6/ea6fdef1b9d00ef369f9da00c193b2e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["J_Mayfield"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}