{"id": 465362, "slug": "claude-van-clamme-presents-wing-walkers", "name": "Claude Van Clamme Presents: Wing Walkers", "name_original": "Claude Van Clamme Presents: Wing Walkers", "description": "<p>PLEASE READ INSTRUCTIONS GIVEN AFTER COMIC.<br/></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>INSTRUCTIONS:<br/></p>\n<p>You are pilot Captain P. Bullit and you have just been locked out of your cockpit on your way to destroy the non-geographically specific enemy lighthouse in the non-historically specific war. In order to finish your mission you have to direct the plane by moving the centre of mass, but be careful you only have a certain amount of energy, if you get hit you will slow down and you lose Go below minimum speed and you stall.<br/></p>\n<p>NOTE: IN JAM BUILD GAME DOESN'T END WHEN YOU LOSE. OR WIN. SORRY.</p>\n<p>WASD to move. E to pick up and throw crate. Space to jump - can't really jump. Alt-F4 to exit. E on the gun to shoot the gun.<br/></p>\n<p>The pilot is very narcissistic so he's always in his favourite pose and facing the camera, don't worry about it. He has poor vision too, the flight goggles are really awkward to look through actually, so the render distance is poor. We went for full realism.</p>\n<p>This is very unfinished (it uses Arial for the font) but hopefully gives you an idea of what the game could be. <br/></p>\n\n<p>NOTE: While the vast majority of art is done by David, the explosion effects were found on the asset store.<br/></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T08:32:10", "background_image": "https://media.rawg.io/media/screenshots/017/017d0b6ebbe36188efa39b5a5f203fae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["We Are Not Spies"], "genres": ["Action"], "publishers": [], "esrb_rating": null}