{"id": 465390, "slug": "drone-spawn", "name": "Drone Spawn", "name_original": "Drone Spawn", "description": "<p>CONTROL :<br/></p>\n<p>Mouse left (hold) - Shoot<br/>Mouse right (hold) - Move<br/>Q - Ability: Teleport<br/>W - Ability: Burst<br/>Esc - Restart the game</p>\n<p>Drone Spawn is a shooter game where you can't aim, but you shoot a drone that will look for enemies randomly in area and explode when colliding. The goal of this game is to get as many scores as possible by destroying enemy planes within 3 minutes. During the game, you will have health and energy. Health is your plane's life so the game will end immediately if your health runs out. While energy is used to shoot and use abilities. This game has a mini experience level system, where you get XP after destroying enemies and you will level-up when reaches a certain XP . Initially you can only move and shoot, but when you level-up, you will unlock some abilities:</p>\n<p>Level 1 - Ability: Teleport (Move instantly to a random point quite far from player position)<br/>Level 2 - Ability: Burst (Shoot rapidly as many drones as possible until the remaining energy is 20%, but with energy costs doubled per drone)<br/>Level 3 - 25% Bonus To Max Health &amp; Max Energy</p>\n<p>TIPS :</p>\n<p>- You get health &amp; energy after level-up and destroying enemies.</p>\n<p>- The white circle area is where the drone will directly target an enemy. If there are no enemies in it, they will fly to a random direction.</p>\n<p>NOTE :</p>\n<p>I forgot to make the game to be able to spawn more than 50 enemies during one playthrough, so the game and score is kind of capped at a certain point. Unfortunately, I couldn't update the game before the voting period of the GMTK Game Jam 2020 ends.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T08:38:14", "background_image": "https://media.rawg.io/media/screenshots/513/5139b161c710a327063da573ce0d131c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["muzakkiha"], "genres": ["Action", "Shooter", "RPG"], "publishers": [], "esrb_rating": null}