{"id": 465431, "slug": "programmers-odyssey", "name": "Programmer's Odyssey", "name_original": "Programmer's Odyssey", "description": "<p><strong>Programmer's Odyssey</strong><br/></p>\n<p>Have you ever dreamed of being the only computer scientist employed in a large company and having to deal with incompetent colleagues, bugs and hacks coming from competing companies?<br/><br/>\r\nNo ? Well this game is still made for you!<br/><br/>\r\nCatch a friend of yours and face each other, each his own business to manage!<br/>\r\nRepair the computers, don't lose control, avoid bankruptcy and hack your neighbor!</p>\n\n<p>Gameplay and Objectives : </p>\n<p>- Do not sink your company<br/>- Hacked PCs (in red) make you lose money<br/>- If no PC is hacked (in blue), the company earns money<br/>- The winner is the one who has the most money at the end of the count or the one who survived</p>\n<p>- Interacting with a PC allows you to switch to Terminal mode<br/>- Each PC has its commands noted on the notepad<br/>- Each command allows a specific action to repair or hack</p>\n<p>- We can hack the PC of the opposing company<br/>- Hacking an opponent's PC gives him the status 'Hacked' and 'Corrupted'<br/>- Corruption (in yellow) reverses the actions corresponding to two of the pc commands<br/>- To repair or hack a PC, you must perform a series of actions in the order indicated on the post-it notes<br/>- To correct the corruption, check the correspondence of commands and actions in the Test tab</p>\n<p>- Attention, your incompetent colleagues can periodically give the statuses 'Hacked' and 'Corrupted' to a nearby PC<br/>- Use the 'shout' button to make them flee</p>\n<p>P1:<br/>W, A, S, D for movement and commands<br/>B to enter Terminal mode on a PC, erase text or exit the Terminal<br/>N to shout or change tabs in Terminal mode</p>\n<p>P2:<br/>Arrows for movement and commands<br/>O to switch to Terminal mode on a PC, erase text or exit Terminal<br/>P to shout or change tabs in Terminal mode</p>\n<p>Controllers are supported</p>\n\n<p>This game was made in 48h for the GMTK Game Jam 2020.</p>\n<p>Created by :<br/>\r\nRomain Saclier <br/>(Instagram : https://www.instagram.com/romain_saclier/)<br/><br/>Emmanuel Barbaut <br/>(Soundcloud : https://soundcloud.com/fractalstrike)<br/>(Tumblr : https://usualmanu.tumblr.com/)<br/></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T08:48:14", "background_image": "https://media.rawg.io/media/screenshots/8f7/8f7d047e0a2c171726d52f7a83cb88c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Romain Saclier", "Usualmanu"], "genres": ["Action"], "publishers": [], "esrb_rating": null}