{"id": 465660, "slug": "music-movement", "name": "Music Movement", "name_original": "Music Movement", "description": "<p><strong>Music Movement<br/></strong>This is my Entry for GMTK 2020's Game Jam! This is my first time using C# and Unity ever, so it's quite rough around the edges. The original game concept was to have music playing in the background and obstacles would appear in your path, the only way of avoiding them would be to switch over to different colored rhythm lines to avoid those obstacles. In the end though, I decided on switching the color of the player character instead to hit or pass through jump blocks, which are also immovable Unfortunately, I didn't have time to sync up the obstacles and the music either, so whoops. I still finished the base game though!<br/></p>\n<p><strong>Instructions</strong><br/></p>\n<p><strong>Note: To get out of the game, you have to go where your taskbar is and close Unity manually or press Alt+F4</strong><br/></p>\n<p>When you execute the game, it will start automatically, and there's only one level. Once you see the congrats message, that's it, you've beaten the game! Great job if you did it! owo)b</p>\n<p>You change colors with<strong> Spacebar</strong>, and while blue lets you hit jump blocks, the only way you can jump in the game, red makes you pass through the jump blocks. Don't hit the sawblades or the (only) level will reset!</p>\n<p><strong>Theme</strong><br/></p>\n<p>For the theme \"Out of Control\", it was a take on how Rhythm games usually had you hitting the notes to the beat or controlling a character to move correctly to get to the notes.  Now, you have no control over the obstacles, the music, or the player character, other than color. Autorunners have a degree of giving up control right? ;w;</p>\n<p>Thank you for checking out this game despite the roughness- this is my first shot at Unity ever, and I only hope to get more skills from here!</p>\n<p><strong>Credits</strong></p>\n<p><em>Programming:</em> PikaVoca<br/></p>\n<p><em>Artist: </em>PikaVoca</p><p><em>Music: </em> Eden by Onycs https://soundcloud.com/onycsmusic</p><p>Creative Commons — Attribution 3.0 Unported — CC BY 3.0 Free Download </p><p>Stream: https://bit.ly/al-eden</p><p>Music promoted by Audio Library https://youtu.be/asozZJmOqIo</p>\n<p><em>Special Thanks:</em> My friends and family for supporting me, Iffem for idea help, Flaquero on Discord for helping me code the jumping physics, and all of the GMTK Discord for helping me with my Unity problems.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T09:38:37", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf937ccd625a5e518468f17aa7e6cf91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PikaVoca"], "genres": [], "publishers": [], "esrb_rating": null}