{"id": 465749, "slug": "space-storm-pizza-panic", "name": "Space Storm Pizza Panic", "name_original": "Space Storm Pizza Panic", "description": "<p>Rival pizza delivery robots T0DD and J!MMY have to finish one last gig: deliver pizzas to the nebula's local crazy-cat-lady: Patricia. If the pizzas are late, they're free. <br/></p>\n<p>Electrical storms have fried the controls of the two delivery ships, however, and each must now work with scrambled controls, and their shoot buttons fire for the rival ship. Both must now work together to reach the end before the timer expires, and the pizza becomes free of charge.<br/></p>\n<p>Space Storm Pizza Panic was built in 48 hours for the 2020 GMTK Game Jam.</p>\n\n<p><strong>*WARNING THIS GAME CONTAINS PARTICLE EFFECTS THAT COULD TRIGGER EPILEPSY. Especially the main menu*</strong></p>\n<p><strong>How to Play</strong><br/></p>\n<p>This game is meant to be played with two players on one keyboard. Due to electrical storms, you and your partner have randomized movement controls that will be shown at the top of the screen in your respective colours. Your fire button will shoot the weapon of the other player, so you'll have to work together to progress, since any collision will send you flying. <br/></p>\n<p>Asteroids can be destroyed to clear a path and gain extra time, but some asteroids can only be destroyed by fire from the appropriate-colour ship.<br/></p>\n<p>To win, make it to Patricia's ship at the top of the screen before time runs out. There's no penalty for running out of time, and you can still complete the game. It just means that the pizza is late, so you'll get the bad ending! <br/></p>\n\n\n<p><strong>Contributors</strong></p>\n\n<p>Story, Patricia Voice - Hannah Sloan</p>\n<p>Pixel Art and J!MMY Voice - Jason Cabuenos (BunnyChamber)</p>\n<p>Programming, T0DD Voice - Oliver Morrish</p>\n<p>Anchor/Overseas Tech Support (Programming) - Ben Nielsen <br/></p>\n\n\n<p><strong>Credits</strong></p>\n<p>Music used with license from Andrey Sitkov.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T10:00:29", "background_image": "https://media.rawg.io/media/screenshots/632/632668ec7286d86ffbbfafeeba8fd5a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["HannahSloan", "Oliver Morrish", "Bobo_Baqa", "BunnyChamber"], "genres": ["Action"], "publishers": [], "esrb_rating": null}