{"id": 465772, "slug": "jalopy-itch", "name": "Jalopy (itch)", "name_original": "Jalopy (itch)", "description": "<p>When interpreting the theme Out of Control we wanted to make sure the player felt both literally and figuratively in line with the theme. In Jalopy, The player controls an old, decrepit, car with esoteric controls, trying to invoke the memory of what it was like to learn to drive for the first time.  The player can only learn the controls of the odd automobile by pressing all buttons and seeing what they do, a gameplay equivalent of stepping forward in the dark with hands outstretched.  This creates both a small sequence of panic and surprise, but also fun discovery,  relief, and humor depending on what controls and found in what order.  Finally, once the player has figured out enough, they must forget notions of WASD controls, and direct the car successfully with their new esoteric ones literally struggling to reshape their mind to try and keep control.  Cartoon graphics, goofy sound, and fun reactions keep the experience fun even when causing mayhem.  Between the trepidation and joy of discovery as the player tries to grab control, to the brain-reshaping movement once the player has learned the controls, and the chaos literally caused by the player throughout the level, the game embodies vastly different ideas of control, confusion, and chaos, in a small and enjoyable package. Inspired by Burnout, QWOP, and others.</p>\n<p>Made by Keith Marshall and Nick Carroll</p><p>Music and Sound purchased from Sidearm Studios.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T10:05:26", "background_image": "https://media.rawg.io/media/screenshots/675/6756b34c0bc333d9b1e321965d66eaed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["aoikishu", "confusiongrenade"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}