{"id": 46595, "slug": "the-man-in-the-cape-special-edition", "name": "The Man in the Cape: Special Edition", "name_original": "The Man in the Cape: Special Edition", "description": "The Man in the Cape is a twin stick, run-and-gun, arcade-style shooter. The Man in the Cape must blast his way past the hordes of creatures, room to room, in a quest to escape from Mr. Granderson's nefarious superhero elimination dungeon!<br/><br/><ul><li><strong>Over 60 Rooms of Terror</strong>: Challenge yourself in Mr. Granderson's dungeon. It spans 60+ rooms, filled to the brim with vile, nanotech infused monstrosities! Be the superhero mankind deserves!<br/><br/></li><li><strong>Overcome Mr. Granderson's Supervillain Army</strong>: Encounter nanotech infused bugs, sad robots, former armyman-turned-bad guys, and even an angry Pill Bug in Granderson's elimination dungeon!<br/><br/></li><li><strong>Use Guns and Gold</strong>: Pick up dropped weapons to give The Man in the Cape a boost of firepower! Collect mountains of silver and gold to buy upgrades to give yourself superhuman speed and endurance!<br/><br/></li><li><strong>Terrifyingly Strange Boss Battles</strong>: Pit yourself in a fight to the death against a stomach virus, a burning woman, and a man wearing a fireplace rug as a cape in oddly staged boss battles!</li></ul>Story<br/>Mr. Granderson, the owner of Granderson Electronics Repair, is a simple businessman. He works hard and keeps to himself. But somehow, his building has become a magnet for superheroes, who feel the need to stand on his roof to cast an eye over their beloved city.<br/><br/>Having had enough, Mr. Granderson concocted a plan for revenge. In a form never seen before, Mr. Granderson then constructed a vast underground superhero elimination dungeon to trap all those who seek to trespass on his property. It was only a matter of time before Granderson would find success, having trapped popular \"superhero\" The Man in the Cape! <br/><br/>With a \"take no prisoners\" pledge, The Man in the Cape must now fight against the dungeon's horde of nanotech driven creatures and bring Mr. Granderson to justice!", "metacritic": null, "released": "2017-10-17", "tba": false, "updated": "2019-08-28T22:04:44", "background_image": "https://media.rawg.io/media/screenshots/e9d/e9d46171e47dd655bef229c318f69881.jpg", "website": "http://www.longdivisiondev.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Long Division"], "genres": ["Action", "Indie"], "publishers": ["Long Division"], "esrb_rating": null}