{"id": 465985, "slug": "chaotic-divination", "name": "Chaotic Divination", "name_original": "Chaotic Divination", "description": "<p>Player1 has to control the Dark God, while Player2 controls the Light God. The followers of both gods are attacking the other gods thereby going \"OUT  OF CONTROL\". The players role is to survive for however long they can.</p>\n<p>Followers of the god of darkness will go after the god of light and Vice Versa. If opposite God's follower touch you, your God looses HP. Players can activate their shield so that their God does not take any damage but in this process they lose more than half of their speed. If a follower of the God of darkness dies by the shield activated by the God Of light then the God Of Darkness will lose some HP and Vice Versa. If either God dies it is Game Over.</p>\n<p>Combine (ABILITY)</p>\n<p>If both Players Press their Combine Buttons (Left Alt and Right Alt) at the same time then both the Gods \"Join Bodies\" and form a Divine God Called Lark. Lark can only stay active of 10 seconds and in that time all the minions that collide with Lark help regenerate health for both the gods, but for the duration Lark is activated the Score Drops instead of increasing. To activate Lark players Must have at least 10 points in the Ult Tab. To move Lark players must sync their movements together. Arrow keys are used to move Lark at half speed and WASD for the other half. If one player is pressing the \"A\" key while the other one is pressing the right arrow key. Lark will not move in the horizontal axis. Its the same case with vertical axis.</p>\n<p>This game is meant to be played with 2 Players, one player controlling the Dark God on the left side of the keyboard while other player controlling the Light God on the right side of the keyboard. </p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T10:52:54", "background_image": "https://media.rawg.io/media/screenshots/329/329338088fb5307282c2b77c66f7edea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["LP Kun", "RaptorClaws_92"], "genres": [], "publishers": [], "esrb_rating": null}