{"id": 466002, "slug": "moth-chans-chaotic-adventure", "name": "Moth chan's Chaotic Adventure", "name_original": "Moth chan's Chaotic Adventure", "description": "---MOTH CHAN's CHAOTIC ADVENTURE---\r\n<p><em>by HorribleBoswor</em><br/></p>\n<p>In this bullet hell game, you play as a cute moth who love light. Unfortunately, in her (pretty chaotic) journey to try to return home, she will have to face various foes using bright yet deadly burning bullets. You'll have to resist the temptation and try to don't lose control of you're movements while trying to dodge the bullets.</p>\n\r\n• How to play ?\r\n<p>You can either use the<strong> arrows keys</strong> or <strong>WASD </strong>to move. If you want, you can select <strong>ZQSD </strong>keys to move if you have an AZERTY keyboard (like me ^^). Press <strong>SPACE </strong>to validate a choice, and press <strong>ESC</strong> to pause the game.</p>\n\r\n• Gameplay precisions\r\n<p>When you're near a projectile, Moth chan will start to move towards it.  The closer you get, the more intensely you're going to be pulled in, so be careful ! You're hitbox is pretty small though, and it's at the level of your feet.<br/></p>\n<p>You can recover HP if you get hit, but your maximum HP will drop if you get hit too much in between.</p>\n<p>You can't harm enemies yourself, but they will run out of stamina by themselves over time.</p>\n\r\n• GMTK Game-Jam 2020\r\n<p>I made this game during the GMTK game jam 2020 in 2 days. This was my first game jam, and that was a great experience ! I did this jam alone from A to Z in these 48h, including the code (I'm using <strong>Game Maker 8</strong>, it's quite old but it still works xD), the art, the sound effects (mostly using <strong>bfxr</strong>, plus <strong>Bosca Ceoil</strong> for the jingles) and the music (though I'm not a very good composer, so I used<strong> Ecrett Music </strong>to generate them).</p>\n<p>The theme was shoot to move  <strong>Out of Control</strong>, and that's reflected in the fact that Moth Chan is attracted to projectiles against your will.<br/></p>\n\r\n• What could have I improved ?\r\n<p>I didn't made enough play tests (shame ! :c), so the game can be quite hard, especially if you're a bullet hell neophyte ^^'</p>\n<p>I could have polished the game a bit more, added facial expressions and animations, improved the crappy scenario... The list is <em>very </em>long, but for a first one I'm still quite satisfied despite that c:<br/><br/></p>\n<p>I look forward to reading your feedback. UwU<br/></p>\n<p>Have fun playing !  (＾▽＾)<br/></p>\n<p>PS : I apologize if there are any language mistakes, English isn't my native language  (´∀｀；)<br/></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T10:57:47", "background_image": "https://media.rawg.io/media/screenshots/d04/d0464a4404f24fa8dee3cf7db08b345d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HorribleBoswor"], "genres": ["Action"], "publishers": [], "esrb_rating": null}