{"id": 4662, "slug": "me-monstar-hear-me-roar", "name": "Me Monstar: Hear Me Roar!", "name_original": "Me Monstar: Hear Me Roar!", "description": "Action-packed ME MONSTAR: HEAR ME ROAR takes place in a world formed from people’s dreams and imagination; where farts are deadly weapons and Fear is your enemy. As a monster embarking upon their rites of passage to become a MONSTAR; feed on Dreams, beat the opposition and grow in power to do battle with the invading Fears and Nightmares!\r\n<br/><br/>\r\nUnder the watchful eye of Master Shoo; punch, fart and holler your way through 30 rip-roaring stages. Monstrously addictive features include:\r\n<br/><br/>\r\nClaws – punches now perforate your enemies<br/>\r\nCharge – sharpen your horns and launch into a turbo, fart-powered headbutt<br/>\r\nRoar - unleash a verbal assault to cause moral indignation<br/>\r\nVindaloonatic Curry - atomic blast that will clear the room and your belly<br/>\r\nChunder Cheese - chain reaction projectile vomit<br/>\r\nNapalm Chilli - fiery burps a dragon would be proud of<br/>\r\nHoots mon Haggis – utter invincibility<br/>\r\nIce Scream - attracts all Dreams to you\r\n<br/><br/>\r\nDesigned to look outstanding on both PSP® (PlayStation®Portable) and PlayStation®3 systems.\r\n<br/><br/>\r\nMe Monstar™ © 2011 Cohort Studios Limited.  All Rights Reserved.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.", "metacritic": null, "released": "2011-07-05", "tba": false, "updated": "2019-08-02T16:23:15", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3", "PS Vita", "PSP"], "developers": ["Cohort Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}