{"id": 466205, "slug": "waste-waster", "name": "Waste Waster", "name_original": "Waste Waster", "description": "<p>Binge buying has gone out of control. People are bulk-purchasing stuff they don't really need and let food go to waste in unprecedented amounts. This has to stop. All the stuff you've wasted are coming back to bite you in the ass! Now you will perish at the hands of your own perishables. And their teeths, claws and all kinds of nasty appendages. Unless you... lay waste to the waste!</p>\n<p>\n</p>\n<p>Objective:<br/></p>\n<p>Help the character survive by placing upgrades on the map.</p>\n<p>Rules:<br/>You can't choose the type of upgrades or where they get placed, only whether you place them or not.<br/>The currently placeable item (top of the list on the right) is expiring fast, and is periodically replaced by the next item on the list of upcoming items. You can also see the placeable item and its position on the map.</p>\n<p>Controls:<br/>Hit <strong>Space</strong> to place the currently placeable item on the map at its indicated position (Only available if a certain amount of time has passed since the last item was placed - shown by the timer in the top right corner).</p>\n<p>Timers:<br/>The timer in the top left corner shows how long the character has survived.<br/>The timer in the top right corner can show two things:<br/>    - (white) the time left until the currently placeable item expires, and the queue is moved up<br/>    - (black) the time until a new item can be placed (the items still expire during this period)</p>\n<p>Items:<br/>- Weapon: increases weapon fire rate<br/>- Bullet: increases weapon damage<br/>- MedKit: restores health<br/>- Shield: decreases damage taken from attacks<br/>- Shoe: increases movement speed<br/>- Binoculars: increases weapon range</p>\n<p>The game was made over a 48 hours period for the GMTK Game Jam 2020.<br/>The theme was <strong>Out of Control</strong>.</p>\n<p>Team members were:</p>\n<p>Eniko Trungel (art)<br/>Marton Arbocz (code)<br/>Zsombor Lehoczky (code)<br/>Andras Bondor (code)<br/>Gabor Zelei (setting &amp; narrative)</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T11:48:37", "background_image": "https://media.rawg.io/media/screenshots/0cf/0cf73d7bd7f11106815c1cee54c09964.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overhead Games"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}