{"id": 46636, "slug": "dungeons-of-chaos", "name": "DUNGEONS OF CHAOS", "name_original": "DUNGEONS OF CHAOS", "description": "DUNGEONS OF CHAOS is a tribute to the 2D turn-based pixelart RPGs of the 80s.<br/>\n<br/>\r\nA game where you can create your party of 6 characters with a few clicks, or spend more time creating a customised party with feats unlocked in previous plays.  Where exploration is encouraged and rewarded, with no level cap, non-linear side quests and a vast array of items, item properties, shops and enemies.  <br/>\n<br/>\r\nThe game already has over 30000 happy players on other platforms, and most often they mention the likeness to 80s RPGs like Ultima or the goldbox games.  It is retro.  Your hand will not be held.  It does not try to have realistic 3D graphics.  It is not multiplayer, and never will be.  If you long for the days when you traded your sleep for a chance to direct a party of adventurers through pixelated lands of exploration and battle glory, then you may want to give it a try.<br/>\n<br/>\r\nAnd as all existing players already know, all fans and myself help out with tips and tricks, mostly on the facebook page but also on my blog if you prefer that.  I do not provide or encourage having a complete-detail wiki somewhere, as the fan interaction on questions and strategy are a very enjoyable part of the game.  So come join our community of DoC addicts and play a game where a troll is still a hairy monster you can kill, where there are no level caps, where you are not confined by a slim storyline path, and where it all starts with fighting rats in a cave/cellar.  Fans have usually spent anything upwards of 80 hours playing it.<br/>\n<br/>\r\nP.S.: apologies in advance for the puns in the game, but to my defence some were added by fans so if it is a bad joke you are reading on some tombstone or note just pretend it's from a fan and not me.  ;-)<br/>\n<br/>\r\nP.P.S.: I am very open to fixing bugs or typos. But I mostly use British English, so don't flag non-American English spelling/syntax please.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:43", "background_image": "https://media.rawg.io/media/screenshots/659/659e883829ec258a6957f380bd1a1141.jpg", "website": "https://dungeonsofchaos.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15}, "playtime": 3, "achievements_count": 83, "ratings_count": 1, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android", "macOS"], "developers": ["Volker Elzner", "Volker Elzner - Spain - PrometheusheirRPGs", "Volker Elzner - PrometheusheirRPGs"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Volker Elzner"], "esrb_rating": "Everyone 10+"}