{"id": 46630, "slug": "prime-arena", "name": "Prime Arena", "name_original": "Prime Arena", "description": "Prime Arena is a combination of MOBA and survival gameplay inspired by PUBG. <br/>This dynamic deathmatch arena is free of forced socialization and thus of toxic atmosphere found in MOBAs. <br/>Victory fully depends on player’s skill and reaction speed — no teammates, no cry! <br/>The game currently is in Coming Soon status on Steam. Developers follow players` feedback and ideas constantly to implement the best of them in the game<br/><br/><strong>Key Features: </strong>Victory depends on you and on you only!The game is meant for solo carries — victory fully depends on your skill and reaction speed. <br/>No teamplay, no teammates — everybody competes with everyone. The only one will stand till the end!Quick sessions and rapid gameplay!The game sessions are held in a highly dynamic tempo, which is additionally accelerating by the decreasing map. <br/>And if you got killed — you can dive into a new game at once, without having to wait for the current session to end.Choose your Hero, choose your type!Currently, there are about 20 heroes in Prime Arena, each with its own abilities and gameplay style, and this amount will grow progressively. KDR of a player with any other player! Alliances in Prime Arena appear and break down every minute, but all the statistics are there to stay. Learn the history of your opposition with any enemy!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:15", "background_image": "https://media.rawg.io/media/screenshots/94b/94b4465f845e625718f56bbb74a33564.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 41, "toplay": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Nival Interactive"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Nival"], "esrb_rating": null}