{"id": 46632, "slug": "duel-of-summoners-the-mabinogi-trading-card-game", "name": "Duel of Summoners: The Mabinogi Trading Card Game", "name_original": "Duel of Summoners: The Mabinogi Trading Card Game", "description": "COLLECT, TRADE, AND COMPETE WITH THE BEST PLAYERS AROUND THE WORLD!<br/>\r\nDuel of Summoners is a TCG played against an opponent with a deck composed of 12 cards. Experience immersive single player campaigns to ranked PVP tournament matches. Are you ready to take on the challenge to build your ultimate deck and aim to become the top summoner?<br/>\n<br/>\r\nFEATURES:<br/>\r\n• ENDLESS HOURS OF PLAY CONTENT – Immersive single player adventure, daily missions, and non-live arenas.<br/>\r\n• REAL-TIME PVP FEATURE – Join the competitive arena to reap the rewards from players worldwide or simply compete with your friends for bragging rights.<br/>\r\n• THE REAL “TRADING” CARD GAME – Collect powerful legendary cards from game content features and trade exclusive cards with other players across the globe.<br/>\r\n• CUSTOMIZE YOUR OWN STRATEGY – Build your ultimate deck around your favorite cards and use different strategy against friends and foes in battles.<br/>\r\n• EASY TO START – Learn as you go with the streamlined tutorial in the fun single player campaign. It’s never too late to play Duel of Summoners.", "metacritic": null, "released": "2017-09-26", "tba": false, "updated": "2019-08-28T22:04:43", "background_image": "https://media.rawg.io/media/screenshots/60e/60e282e5448ef6614d39d592e1623fe7.jpg", "website": "http://duelofsummoners.nexon.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 49}, "playtime": 1, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["NEXON KOREA"], "genres": ["Adventure", "Strategy", "Massively Multiplayer"], "publishers": ["Nexon America"], "esrb_rating": null}