{"id": 46643, "slug": "chaos-and-the-white-robot", "name": "Chaos and the White Robot", "name_original": "Chaos and the White Robot", "description": "----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>The suns symbolize the state of spirit. At the initial levels, they do not seem to see the beast. It seems to be joyful. There was a time when I liked being obsessed. These suns are not reflected in the game. Because the game is not about the joys of obsession, but about the sorrows. There are joys among drug addicts, alcoholics, and many other obsessed people. And then the suns saw the beast approaching and it became painful and scary. From level 43, the beast came in the form of rage, and from 51 the beast came in the form of a lie. Because in the last levels Mars symbolizes information, or rather delusions. And this is another of the faces of the beast - a lie. So it looks about. Many people think that this is true and lie, but they are wrong. These are two lies, one of which is in the form of truth. Usually the blue side is thought to be true or good. And the red side is thought to be evil or a lie.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>There always was a lie during the immersion. I can try to illustrate this with the russian proverb: \"Do not own the skin of an uncaught bear.\" Imagine that one person decided to own the skin of an uncaught bear. Let, for example, he really want to kill a bear. But now he is immersed in dreams about the skin, experiencing a kind of bliss, for example, he calculates profits from the skin or already dressed in a fur coat from this skin. And dreams of skin are a lie. But not themselves dreams are false (separate from the spirit), it's just information. The state of spirit is a lie. Here a man owns the skin in his mind, but in his spirit he feels bliss, and it seems to him that this is true. But, an outsider, not immersed, sees that this is a lie. Therefore, an outsider, said this proverb. The outsider tries to warn immersioned man. I do not know how I explained))) Is it clear or not? I do not quite understand myself. But that's why the beast can be considered a lie. As if the mind owned by bear skin, but in the spirit there was a bliss. And the immersed spirit makes the mind to give out information not solid. It forces the mind to calculate profits and put on a fur coat. The purpose of the spirit is not profits and is not a fur coat, but a bliss.<br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>A ram with an inverted pelvis. Initially it was a tattoo of some small people. The pelvis is inverted because the ram's front feet are on the ground, and the rear ones are in the sky. This is how heaven and earth relate. But here the meaning is, apparently, different. Something attracted me to such body structure. After the 16th level the ram was tore by the beast.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>And here are the executions. Above the executed there is an inscription - for which he was executed. The inscription itself is information, and in fact only a pretext. It can be in the name of the revolution, in the name of the king, in the name of anything. And the spirit thirsts for executions and therefore executes without special reasons. This is a reflection of my state of spirit when I was arrogant and despised people. In fact, of course, executions are a serious things. Therefore in reality the information is very important. But in the game - no. It was reflected the idea about the unimportance of information, and, by the way, this is also a lie. For, in fact, the spirit of the judge must be impartial and analyze a lot of information. But in the game, the spirit of the pilot wants executions and choose any reasons for executions . And this also has become a good medicine, for when you realize your possessed states of spirit, stop feel them.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Every enemy has some kind of death. In fact, everything said in the previous paragraph about the execution is applicable to deaths, but not so harshly as it is. I also wanted to see the corpses) Then I remember the film \"Conan the Barbarian\" with Schwarzenegger. When Conan says the words of Genghis Khan: \"The greatest joy for a man is to defeat your the enemies, drive out them, take away their property, see their relatives crying, ride their horses, hug their daughters and wives in your arms.\" It feels like such information is born of a spirit possessed and immersioned. In general, in some ways, I was also obsessed with something similar. I told you that when you realize your immersed states and call them, you stop feel them. Genghis Khan named his states, but he did not stop feel them. For he was immersioned. He called them in his immersion. And it is necessary to understand, and to name in awareness, and not in immersion. Or maybe I'm not right? It is not important whether the spirit names its states, but does it really matter if the spirit wants to stop being in them? And in what way - to name, suppress, replace, whether to distract is not so important? Perhaps purpose of Genghis Khan was not to realize? But to show his thirst to others around him and rise above others? Here, they say, look how cruel I am. You did not even dream of such cruelty. Perhaps.<br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>In some winter levels I placed the symbols of Russia. In the Soviet Union made a lot of monuments dedicated to the victory in World War II. In almost all large and medium-sized cities, the main streets and squares bear names that in some way relate to this event. Annual events dedicated to this event are held. That is, people remember this victory and do not want to forget.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>After the 16th level, TVs appeared in the cities. It is in some way a mystery. You can search for the answer in level 54.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Here we see broken boxes. The idea of ​​chaos came for the first time exactly at this moment. Up until this point, it was an ordinary game, the most Athenian game. The game was faceless, more like a sketch than a full game. Up to this point, boxes broke and disappeared, no trace was left. And so it was everywhere. There were no corpses, there was nothing cruel, nothing about Mars. A game for children 7 years old) Graphics, also, was initially machine, not manual. And now I see that the game is empty. How to fill it? And suddenly I hear my thirst, and I wanted very much to fill the game with destruction and death. It was with the boxes that this idea appeared. Broken box does not mean anything for the player. Nothing can be done with it. However, the chips from the box say that there was destruction. Someone came and began to destroy and left traces of his destruction, so that everyone could see. And he did not clean up after himself, let this reminder remains to the end of the level. And at first he just left chips, but then he says: \"I want clumsy nails sticking out from the chips, let also the burned chips remain, destroyed by fire\" So it happened that destruction is more important. There are only three sprites are drawn for a living box. And for its destruction there are 35 sprites. And 12 ordinary and 12 burned splinters testify about death of the box. At least by the number of sprites you can understand how much destruction and death is more important in this game.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>And here are 53 and 54 levels. In them I tried to express my state of spirit, possessed by the beast. Chaos, turmoil, confusion and nothing is clear, but everything rages and fury around. So approximately it was in my spirit during thirsts and riots. I am very pleased with these levels. It seems to me that I managed to get close to reflecting this state. Anyone who says that nothing is clear in levels will be absolutely right. I will not describe here these levels. The only thing there were prayers over TVs. Approximately I had such thoughts at the end. These prayers reflect the state of spirit.<br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>And now level 55. I filled it with my thoughts. So, the last word not belongs to the beast. It seems to me that I wanted to sound too smart, so I used many abstruse words.<br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Why do the adepts in the dungeon have a goat head? In fact, it's a goat skull, put on the head. There is a cartoon of A. Petrov \"The Dream of a Ridiculous Man\" based on the story of the same name by F. M. Dostoevsky. In a nutshell, this cartoon tells about the first sin on some sinless land. There is a lot of symbolism there, and in general I really like it. In one of the moments some person puts on his head a goat skull, which, apparently, means his anger and fury. For after that he began to rage and destroy everything. I really liked this allegory and I repeated it in the game.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Why do boobs and curses appear in the game? This refers to the early period of the creation of the game. At that time people at the forums did not like this game, and so I decided to use cheap tricks - add boobs and curse words. By the way, I tryed to use only rude expressions, not filthy language. And all tits can be closed with a black rectangle, if the settings include censorship<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>At level 54, there are every kind of witchcraft. The author took them from the Internet and what they mean does not even know. Somewhere the handwritten text of Hebrew or Hindi, as they look mysterious. Author also do not know what those texts mean. But to some witchcrafts the author has given concrete value.<br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Here is the church, as the author turned to it at the most terrible moment of the riot of the beast, during the 54th level that is<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>The Greek letter \"Psi\" is a symbol of psychology. Here is a candle painted. The doctor closed the windows with special blinds, so that it was dark. And lit this candle and made all sorts of mysterious rituals)<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>George. Obsessed with the serpent. However, it seems to George that he holds a mighty. That's why George thinks that the serpent is his friend.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>George. Obsessed with the serpent. But if George is obsessed with the serpent, how can George be greater than the serpent? The serpent is bigger than George. Does George want to be wrapped in with the serpent? Yes, he does. For at this time it seems to George that he is powerful.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>And the wise men look at George and see that he is less than a serpent. And they gave him a horse and a spear so that he would become bigger then a serpent. George refuses to take, for it will be necessary to beat who brings greatness. Then the wise men compulsed George to fight with the serpent. A big thanks to many religions for giving a spear and a horse to George. Because fighting is better than obsession with the serpent.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Here George himself put off his spear and left the horse aside. He cooked a meal and invited the serpent. And George offers the serpent food, that George eats himself. George is neither higher nor lower than the serpent. George wants to talk to serpent, think about him, look at him and understand. For this serpent is not an outer spirit, but an inner spirit, the spirit of George, that is. And George did not obsessed by the serpent and did not take a spear. You can trample down your spirit, this too can help. And you can talk with your spirit. That is, in fact, the picture symbolizes this game. For it was in the game that I named and accepted the beast, and before the game was the previous picture, where I trampled and stabbed the beast, that is, did not accept the beast.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>The Virgin Mary.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Sign of the ruble.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>The dollar sign.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>Medicine. Also the author turned to doctors who treated him for diseases. For which author thanks the doctors. And the psychologist thanks. And the priest thanks. By the way, the priest does not even know that author thanks him. And the doctors do not know.<br/><br/><br/><br/>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/><br/>I reread this story now and doubt it. Was I too frankly? Does it matter to people my illness? Perhaps, I should remove half of the story? Why talked about the sect? I could have kept such things in a secret.<br/><br/>Perhaps I should think about a plot for this game? For example, there was a robot and he began to fight evil? Maybe such way is better?<br/><br/>Still, the game is an illustration to a story. Just like the pictures in the book. Most often the text is more important than the pictures. The story is more important than the game. Otherwise, the game can not be understood. I gave many different descriptions to the game. Sometimes I tried to describe, as it were, an advertising text, that this game is so cool. Sometimes I used some mystery, used the words chaos, spirit, matter, but do not tell in detail. Some people perceived the game as an addiction or some sort of schizophrenia) Well, in fact, I tried to look at the dark side of the soul. I wrote about arrogance for it would be clear what I mean by the beast. I wrote about illnesses, to show how the beast is dangerous. If I describe the beast mysteriously and embellish - then I admire the beast, still obsessed with him. And I want to understand this. And there really are immersions, I wrote truth about them. And this game is really part of my recovery. I put real cruelty into it, but I was not obsessed by this cruelty. I was already above it, outside of it. I looked at my cruelty, but did not feel it. Heard it, but did not go to it.<br/><br/>And I painted it as I could. In the form of a game. And in the form of a story before this game. At first, I was possessed by the beast, yes. But now, as it were, a researcher, I explore the beast. The last levels are obsessions. There is chaos in the soul and storm. Almost every element in the game was carefully selected to recreate precisely that state of spirit. I looked at an element and listened to the inside whether it suited for the idea. I refused from lots of ideas. It is clear that I can not show the spirit in matter. I can only try to show this through images and symbols. In fact, all previous levels are needed to prepare for the last levels. Because it is very hurd to be in the last levels without traning)<br/><br/>And I wrote the truth about love, too. I do not quite understand what this concept means and what is love in general. Maybe someone will call it harmony with the world. But this is important. There must not be the last levels in person's soul)<br/><br/>If I do not talk about my illnesses, then the prayers at level 54 will not be understood. As if I simply invented them, but I did not invented. The game is based on real events. And I tell you about a real event.<br/><br/>Here is a story and this is the storyline of this game. By the way, about a plot. There are text inserts in the game that tell about some story. But this has remained since the time when the game was training. People on the forums said that there is not enough plot. In general, I agree with this opinion. The plot decorates the game. But now this story is a plot.<br/><br/>", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2022-10-01T23:34:29", "background_image": "https://media.rawg.io/media/screenshots/151/151f5510f242efa56f95e451b1fbb134.jpg", "website": "http://whiterobotgames.blogspot.ru/2017/07/blog-post_89.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 114, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["ILIN DMITRY IGOREVICH"], "genres": ["Action", "Casual", "Indie"], "publishers": ["ILIN DMITRY IGOREVICH"], "esrb_rating": null}