{"id": 466440, "slug": "nano-digit-classic", "name": "Nano Digit Classic", "name_original": "Nano Digit Classic", "description": "<p>Nano Digit Classic is game about infection and corruption. You play as a Digit Runner venturing into the Data Ruins to collect digits and bring them back to The Hub for points. However, wandering in the Ruins are infected programs that emit Corruption Spores. Come into contact with these and you’ll start to become corrupted yourself, gradually losing control of your Runner. Upon returning to the Hub, you’ll be evaluated for your Corruption Level. If it exceeds 100%, you’ll be <strong>TERMINATED</strong>. </p>\n<p>This game was developed as a part of the GMTK2020 Game Jam.</p>\n<p>Our interpretation of the theme “<em>Out of Control</em>” was to not only have the player lose control of their character, but also to take something away that is usually taken for granted in many games: knowing if you’re dead or not. Your corruption level won’t be revealed until you complete the level, and the corruption you get from being exposed to the spores won’t manifest itself immediately. One of the things that’s so scary about living in a pandemic world is that you don’t always get the luxury of knowing if your decisions were bad or not. If you do get sick, then you often don’t get to know exactly what it was you did that resulted in infection. Games, on the other hand, are comforting in the sense that the consequences of your actions are immediately clear, especially when it comes to death. Touch an enemy? Get hurt. Touch too many enemies? Die. It’s often frustrating to die, but the reasons for your death are typically obvious. What happens if you don’t have that? What if you can only guess if you’re still alive, or if you’re already too far gone? </p>\n<p>You can only known once the corruption test comes back...</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T12:40:50", "background_image": "https://media.rawg.io/media/screenshots/9b0/9b0c56d4eef7b14bdeaec3b1827759ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["TimCreasman"], "genres": ["Action"], "publishers": [], "esrb_rating": null}