{"id": 46657, "slug": "opus-rocket-of-whispers", "name": "OPUS: Rocket of Whispers", "name_original": "OPUS: Rocket of Whispers", "description": "<strong>STORY</strong>In a post-apocalyptic world, The journey of John, the son of a rocket engineer, and Fei, a witch who awoke from twenty years of cryogenic sleep, is about to begin. Together, they must gather any materials they can find to build a rocket, and launch a space burial to return the lost souls the final resting place.<strong>GAMEPLAY</strong>A single-player third-person adventure. Players will explore and scavenge the snowy wasteland, and must overcome the treacherous weather and terrain. As players explore the world, the story behind the demise of their world will slowly unfold through the ruins and artifacts they find.<strong>FEATURES</strong><br/>A WHOLE WORLD TO DISCOVER<br/>Travel through a post-apocalyptic winter filled with ruins and remnants. Slowly uncover the world, from a once thriving small town to the ruins of an exploded industrial area and much more.<br/><br/>BUILD TO SURVIVE<br/>Craft tools that will help you reach greater distances, gather the materials you need and build a rocket by yourself. <br/><br/>ENJOY A HEARTWARMING STORY  <br/>A game that focuses on story and emotion. The characters are lonely but filled with enthusiasm, and their interactions resulted in an unexpected turn of events. You’ll also meet lost souls who will tell you their unfulfilled wishes, and it is all up to you to help them or not.<br/><br/>COLLECT ITEMS FULL OF STORIES<br/>Explore the unknown for over 100 antiques and artifacts that are beautifully drawn with stories to match, and find out about their past.", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2023-10-18T00:39:20", "background_image": "https://media.rawg.io/media/screenshots/371/37159b8281642af6611f30e1cee59c44.jpg", "website": "http://www.sigono.com", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 163, "beaten": 9, "toplay": 4, "dropped": 4}, "playtime": 4, "achievements_count": 22, "ratings_count": 11, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 12, "platforms": ["Nintendo Switch", "macOS", "Android", "iOS", "PC"], "developers": ["SIGONO"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Coconut Island Games", "Flyhigh Works", "SIGONO"], "esrb_rating": null}