{"id": 466537, "slug": "help-me-3", "name": "Help Me!", "name_original": "Help Me!", "description": "Help Me is a game where you become a psychiatrist. You can talk, consult, and treat patients. There are various patients, and it is necessary to choose the treatment method and counselling that suits them. At Help Me!, treatment isn't just about choosing an option. You will need to play several different minigames or gain knowledge of medicines to apply the appropriate medicines and treatments. Inadequate treatment can make the patient worse or push him into the wrong choice.<br/><br/>At Help Me!, your judgment is very important to the patient. Choose and heal to the best of your ability. As you gain fame by treating patients, your hospital will evolve from an old hospital to a luxurious one. Operate the hospital carefully, transforming it from an old wooden floor to a luxurious floor.<br/>Whenever there is a new patient, listen carefully to various stories and conduct counseling. As you treat patients who arrive at your hospital, you will gradually learn more about the world they live in. Also, through the life stories of the patients, you might be able to catch some clues about the world's information and the relationships between the characters.<br/><br/>+ \"This game is not intended to be therapeutic. If you have a mental problem such as depression, anxiety, see doctor.\"<br/><br/>Features of the game<br/><br/>◆ A story about the mental that everyone can have - The majority of modern people have mental problems. It can be a very rough and deep wound, or it can be a trivial obsession or habit. However, like wounds on the body, they are not easily discovered or healed. Experience the healing process as you unravel the related stories.<br/><br/>◆ Lovely illustrations and animations - The characters in Help Me! are expressed as adorable animal friends. Listen to their stories as you watch their gestures and animations.<br/><br/>◆ Mini-Games - In Help Me!, simple mini-games appear to treat patients. Treat patients with your skills through mini-games.<br/><br/>◆ Hospital Operations - Hospitals increase their reputation every time they treat patients. It is said that the higher the reputation, the better the patient is treated, but the higher the reputation, the better the interior of the hospital.<br/><br/>Simple Introdution<br/><br/>Understand the mental state and illness of patients through counseling.<br/><br/><br/>And you can heal the patient through treatment.<br/><br/><br/>Of course, the process of treatment is difficult,<br/><br/><br/>Difficult!<br/><br/><br/>Sometimes it requires a great game sense.<br/><br/><br/>But through this process, you can treat patients,<br/>You can give them back their daily life.<br/><br/><br/>And... you could get famous and have a better hospital.<br/><br/><br/>But keep in mind.<br/>Patients require a demanding, delicate approach.<br/><br/>Hurry up, patients are waiting for you, shouting Help Me!", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2021-06-18T03:37:49", "background_image": "https://media.rawg.io/media/screenshots/847/847e7e236215f7c2ce7c1f679f171e9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["ItalianChurrasco", "UnicON"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["UnicON"], "esrb_rating": null}