{"id": 466753, "slug": "chessful", "name": "Chessful", "name_original": "Chessful", "description": "<p>Chessful is like normal chess (albiet it slightly worse). All the regular moves are there, including Pawn Promotion to queen, and Castling (sorry En Passant). usually, the pieces are on their best behaviour. But sometimes, they decide they no longer wish to conform to the regular chess rules, and will change their moveset.<br/></p>\n<p>Pawns might become Soldiers - Pieces that move how pawns take, and take how pawns move, but on their first move they can move one space forward.</p>\n<p>Rooks might become Elephants - Pieces that can only move up to 2 squares, but can trample over up to 2 enemy pieces in the process!</p>\n<p>Knights might become Lions - Pieces that can only move by leaping over another piece (provided the space behind them is empty), and will take the piece they leap over if it is an enemy.</p>\n<p>Bishops might become Paladins - Pieces that can only move in a diamond shape around themselves, leaping over pieces in their way.</p>\n<p>The Queen might become The Dragon - A Piece that can move almost anywhere in a 5 by 5 square around itself.</p>\n<p>Note: The only way to reset the game is to take one of the kings. Also, there are no rules to determine if you're in check, so technically you can move any piece while your king is threatened, but that means they will just take your king and you will lose. As a side effect of these issues, it is impossible to stalemate, as you have the opportunity to sacrafice your king. I suggest the gentlemans agreement with whomever you are playing with.</p>\n<p>Finally, this is my first game jam, and second game every, so please go easy on me lol.</p>\n<p> Have fun!</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T13:54:33", "background_image": "https://media.rawg.io/media/screenshots/24c/24c17b6195b102c09c2b176fa55f8404.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MADH95"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}