{"id": 46680, "slug": "runrunrun", "name": "RUNRUNRUN", "name_original": "RUNRUNRUN", "description": "RUNRUNRUN is a team-based local multiplayer game for 1 to 4 RUNners. Break into the safest banks and grab as many gold bars as you can before the timer runs out ! Avoid guards, use powerups to your advantage, find the best paths and secrets on every bank and help your RUNning team climb up the world leaderboard  !<br/><br/><ul><li><strong>Fast-paced, combo-driven arcade stealth game</strong><br/>RUNRUNRUN features simple controls (only left stick !) and mixes retro classic gameplay with fresh new mechanics ! Stealth gameplay elements, powerups, combos spice up the rules so every game is different, with many subtle yet important gameplay mechanics hidden here and there.<br/><br/></li><li><strong>80+ rooms to explore</strong><br/>Each bank is subdivided in rooms. When a room is complete, the fastest RUNner decides where to go next. Try to find the best path through all the rooms of each bank so you can maximize your score ! <br/><br/></li><li><strong>Co-op gameplay for up to 4 players</strong><br/>The more the merrier ! Casual and hardcore gamers alike can help you reaching deeper rooms and improve your score ! Try to elaborate strategies with your teammates to clear each stage as quickly as possible while RUNning away from guards.</li></ul><br/>You will also enjoy neon-retro-ish graphics and an adaptative soundtrack that will pump your team up until the very end of each game for a real modern arcade feeling ! <br/>So what are you waiting for? Let's RUN !", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:42", "background_image": "https://media.rawg.io/media/screenshots/88b/88b7c46d319cf121ae25389bd649aac4.jpg", "website": "http://www.zoglu.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 18, "dropped": 1}, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoglu"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Flying Interactive"], "esrb_rating": null}