{"id": 46681, "slug": "meg-9-lost-echoes", "name": "MEG 9: Lost Echoes", "name_original": "MEG 9: Lost Echoes", "description": "MEG 9: Lost Echoes introduces players to a brand new world of tactical-action through three scenarios along with wave-based flashpoint modes. We are using this version to gauge interest from the community before continuing on with the final story mode version. Enjoy!<br/><br/><br/><strong>Tactical Gameplay</strong><ul><li>The Rig is not indestructible: battles need to be chosen wisely, and fought intelligently. Choose an effective loadout, build defensive structures, and upgrade components to increase your chances of survival.</li></ul><strong>In-Depth Upgrade Systems</strong><ul><li>Customize and upgrade your Rig, weapons, and defences to suit your own playstyle, and prepare to face an unpredictable and relentless enemy, driven by an insatiable hunger.</li></ul><strong>MEG</strong><ul><li>Your only ally in the Aperture, MEG 9, is also your most valuable asset. MEG can retrieve artifacts, and hack into various terminals within Horizon.</li></ul><br/><br/><br/>MEG 9 takes place primarily inside the Probability Aperture, a dimensional disjunction generated by the multinational corporation Quantum Multiphasics: your employer. Throughout the game, players will pilot a remote operated Rig as they explore Horizon, a high-tech complex that has mysteriously gone dark.<br/><br/>The Aperture is home to many strange phenomena, the deadliest of which takes the form of the Corruption. As equipment and power sources are left exposed within the Aperture, mutations begin to take place. Material is gradually taken over by the Corruption and transformed into monstrous bio-mechanical creatures. Both intelligent and incredibly lethal, the Corrupted pose the biggest threat to operations within the Aperture, and need to be dealt with extreme caution.<br/><br/><br/><br/><br/><br/>As a freelancer, you will be remotely conducting operations within the Probability Aperture via the Rig, one of the most advanced military vehicles ever developed. Recent improvements have eliminated the need for pilots to physically operate the vehicle, and now all functionality can be controlled remotely, with visuals being transmitted by a small drone that closely follows the vehicle at all times.<br/><br/><br/><br/><br/><br/>The Rig is an incredibly versatile vehicle, capable of being modified to suit the needs of any particular encounter. Three weapons can be simultaneously mounted along with one defensive module chosen from a pool of nine unique and completely upgradeable parts. Making sure the Rig is outfitted and fully prepared for the dangers that reside within the Horizon facility is a key component to survival.<br/><br/><br/><br/><br/><br/> The latest in a line of Multi-function Extraction and Gathering units, MEG is a dependable robot tasked with assisting remote operators with tasks that they are unable to perform with just the Rig. MEG allows the player to interact with a wide variety of access points within Horizon, whether it be opening doors or even hacking basic machinery.<br/><br/><br/><br/>Salvage destroyed hostiles for important resources that can be used to construct deployable defences. The Rig can build sentry guns, proximity mines, and energy walls, which are instrumental in securing areas and holding back hordes of hostiles. As the player pushes deeper into Horizon, several new forms of deployables can be unlocked", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:42", "background_image": "https://media.rawg.io/media/screenshots/f2e/f2efc573294a581ddf20e22ab25064a4.jpg", "website": "http://skunkwerkskinetic.com/games/meg-9", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 506, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Skunkwerks Kinetic"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Skunkwerks Kinetic"], "esrb_rating": null}