{"id": 46725, "slug": "nevrosa-escape", "name": "Nevrosa: Escape", "name_original": "Nevrosa: Escape", "description": "<ul><li> <strong>Total immersion</strong> — redirect walking locomotion design with natural walking inside your chaperone bounds.<br/></li><li> Unique gameplay — combining puzzle, action and horror elements with an intuitive narrative.<br/></li><li> <strong>Art deco-inspired</strong> environment filled with creepy puzzle machines and dangerous Mist world in the mirrors to explore.<br/></li><li> <strong>Evil artifact in your hands:</strong> why it follows you? Does it whisper something or it’s just in your head? <br/></li><li> <strong>Dark soundtrack</strong> with position sound system to dive further inside Nevrosa world.<br/></li><li> <strong>Different endings:</strong> you decide how this nightmare ends.</li></ul><br/>Young Mr. Conway receives as inheritance old family manor somewhere in Northern Europe. His grandpa, William Conway, disappeared a few years ago and was famous about his scientific works and love to art deco style. <br/>Unfortunately, Conway's family mind disease impact became much stronger with ages, so no one knows anything about his last years of life. <br/><br/>Exploring old manor you've reached Grandpa's laboratory where your curiosity leads to unexpected results. <br/>Now you need to figure your way out of this room, try to solve grandpa's mystery, keep your mind sane despite all strange things happening around and face your deepest fear — Conway's disease, that takes your mind. <br/><br/>Will you stay human till the end? <br/><br/><br/>We prepared some special things for you to immerse deeper into Nervosa world:<br/><ul><li><strong>Full room scale locomotion:</strong> no teleport, touchpad movement or other tricks — feel free to walk around exploring environment like in real life. You'll need only 1,5x2m to play.<br/></li><li><strong>You have a body!</strong> We don't hide or transform your hands too. If you take an object — you take it with your hand just like it supposed to be in the real life. So keep your fingers safe from fire and sharp objects — you'll need them.<br/></li><li>Special modes — let's keep it in secret for now ;)</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:41", "background_image": "https://media.rawg.io/media/screenshots/229/229b8b45c083d0bc127e21b75b3d17e8.jpg", "website": "http://www.gexagon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 17}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GexagonVR"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["GexagonVR"], "esrb_rating": null}