{"id": 46724, "slug": "gloria-sinica-han-xiongnu-wars", "name": "Gloria Sinica: Han Xiongnu Wars", "name_original": "Gloria Sinica: Han Xiongnu Wars", "description": "<p>Gloria Sinica: Han Xiongnu Wars (汉匈决战) in a stand-along game based on the engine of Mount&amp;Blade, Warband. Members of ShangShiXuan cohere to archaeological discoveries and historic documents to faithfully preset the culture and scenes of an eastern world. This game sets the historical background in the eventful years of the early Han Dynasty, and feature in role-playing, real-time strategy and action game plays.<br />\nThe game starts during the reign of the Wudi Emperor of Han, and revolves around the wars between the Han Empire and the Xiongnu on the northern steppes, as well as that among other kingdoms, cities and tribes at the time. The in-game world spans from the tribes of Sushen and Fuyu, on the bank of the Black River in the East, to the land of Kangju and Dayuan on the West of the lofty Pamirs. Two hundred cities, large and small, represent more than thirty countries, cultures and tribes at the time.<br />\nThe game has more than 1000 original weapons, armors, dresses, architecture and other items, carefully made according to recent archaeological findings. Many of them are digitally crafted for the first time, and brings a window for the player to glance at the eastern weaponry and culture from more than two millennia ago.  Qin helmets, Han lamellar, ring-hilt swords, whistling arrows and eagle bows, all help the player experience a warrior’s path from the middle land, into the high steppes, and over the moving sands.<br />\nThe city scenes present the landscape of regional centers in different cultures. Han Empire has grand palaces, high walls and towers; nomad tribes scatter across the tall grass; in the Southwestern mountains, Dian drums reveal from thick forests; in the Western Territory, lofty castles stand along the edge of oasis rivers. The player can visit the taverns, streets, and may meet historic figures that bear familiar names: the great generals like Wei Qing and Huo Qubing, or the commoner warriors akin to Guo Jie and Lei Bei. The player can join their quests and follow the well-known stories from history. Some of them will reward the player with a collection of character cards. When the player decides to step aside from bloodshed, one can work as a trader between the two sides of the Great Wall, or simply tour around the land for places of interest, or foods of great taste.<br />\nThe player can join the force of a general, follow his commands, garrison at the border and fight in the battles of Monan as to experience of career of a veteran soldier of the Han Empire. The player can also lead a sizable force for one’s own, to stand back on a high rock and issue commands to the formations in the battle ground. With accumulated victories, the player may ascend along military ranks and eventually make to the imperial commander-in-chief. If one wishes, the player can also take down and rule a city for oneself, establish workshops and train one’s new troops, to compete for hegemony among the great emperors and khans.<br />\nMore, and lot more, is to be explored in Han Xiongnu Wars.</p>", "metacritic": null, "released": "2018-12-07", "tba": false, "updated": "2023-02-27T09:10:52", "background_image": "https://media.rawg.io/media/screenshots/f96/f96892261bfdb884bbf84e78f1d9c704.jpg", "website": "https://commando.com.ua/mb/han-xiongnu-wars/4126-han-xiongnu-wars-perevod-na-russkiy-yazyk.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 17, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 514, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chongqing Shangshixuan Technology Co., Ltd.,"], "genres": ["Action", "Strategy"], "publishers": ["Chongqing Shangshixuan Technology Co., Ltd.,"], "esrb_rating": "Teen"}