{"id": 46723, "slug": "amiss-13-the-curse", "name": "Amiss 13: the Curse", "name_original": "Amiss 13: the Curse", "description": "Ever been a part of something that is bigger than yourself? Threshold, has hit the realm, taking countless of lives, despite the enhanced and overthrown individuals that has now risen, from the unknown. Join the cursed 50-year old teenager in his own quest to redeem himself from his past mistakes and find his own place in the new world that is to come. The new world, that is post-disaster; that is the \"threshold\".<br/><br/> <strong>Game Features</strong><br/> - <strong>The Survivalist:</strong> Play as the character Wyatt, the cursed boy, who has been constantly getting haunted by his past mistakes and events.<br/> - <strong>Adventure:</strong> Venture through out the city, the in-between, the mystical realm and more areas of a large scale world.<br/> - <strong>Explore: </strong> Discover, unravel the mysteries that lie behind the disasters and climate changes, solve puzzles to advance through story and obtain extra perks.<br/> - <strong>Survive: </strong> Face off against a variety of opponents, using several abilities, including a spell-mobile-ritual system, several weapon types and the special ability granted by the forbidden ancient curse cast on Wyatt.<br/> - <strong>Achieve:</strong> Work on dozens of achievements through the story and several game modes.<br/> - <strong> Extras: </strong> Unlock artwork, skins and wallpapers by finding in-game secrets.", "metacritic": null, "released": "2017-10-05", "tba": false, "updated": "2019-08-28T22:04:41", "background_image": "https://media.rawg.io/media/screenshots/d40/d4060c591b7d72f6103efa28792a515c.jpg", "website": "http://www.sim-plistic.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sim-plistic"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Sim-plistic"], "esrb_rating": null}