{"id": 46728, "slug": "raiders-of-the-broken-planet-open-beta", "name": "Raiders of the Broken Planet (Open Beta)", "name_original": "Raiders of the Broken Planet (Open Beta)", "description": "Embark on a grand sci-fi adventure. A band of rogues and villains drawn to a cause for money, revenge and redemption. A fight for the freedom of a broken planet. An evil Space Demon sowing discord through the ranks for its own mischievous objective...<br/> <br/>Raiders of the Broken Planet is a brand-new take on the shooter genre. Through its 4 vs 1 counter-operative campaign, you experience both sides of the story: In a unique twist, Raiders let’s you change sides completely and fight alongside the games many enemies and bosses to take down the Raiders instead. As a Raider, you never know when an “Antagonist” will join your game and challenge you and your teammates. Who better to screw up the Raiders game plan than one of their own? Team up alongside other Raiders or switch sides facing them as the lone Antagonist…<br/> <br/>You can also play the game solo should you wish and discover the deep secret of the broken planet through the eyes of your chosen Raider.<br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>1-5 players<br/>Network Players 2-5 - Full game requires PlayStation®Plus membership to access online multiplayer<br/>5GB minimum save size<br/>DUALSHOCK®4<br/>Online Play (Optional)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>", "metacritic": null, "released": "2017-06-20", "tba": false, "updated": "2019-10-23T14:57:02", "background_image": "https://media.rawg.io/media/screenshots/71e/71e6c9ee8bce0fcc6cc698cefeb0e31b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4"], "developers": ["Mercury Steam Entertainment"], "genres": [], "publishers": [], "esrb_rating": "Mature"}