{"id": 46739, "slug": "grapple-gum", "name": "Grapple Gum", "name_original": "Grapple Gum", "description": "« Grapple Gum will be a must buy when it finally launches » —— TouchArcade.com<br/>« Grapple Gum is all about grappling hooks combined with some very clever mechanics and lovely visuals. » —— TouchArcade.com<br/>« Grapple Gum is super fun and charming. » —— (Mike Gordon, Iron Horse Games, LLC)<br/>« Grapple Gum's visuals and music are both lovely and really make the game stand out among the competition. » —— TouchArcade.com<br/><br/>Grapple Gum is an award winning SlingShot-Action-Platformer in which you play as a little pink piece of gum and grapple across moving objects. It's a neat mix of mechanics as you can float through the space, hitch a ride by hooking on the various platforms, and slingshot your way from one piece to another while also shooting at all kinds of targets, including big bosses and the little various sooty critters nibbling at your toes.<br/><br/>Grapple Gum was awarded \"Best Mobile Game\" and \"Game Of the Year\" by the Tunisian Game Awards 2017 with a jury composed by Susan Gold (founder of the Global Game Jam), Leevi Rasila (GDWC Event Producer) and Moacyr Alves Junior (ESL Brasil Partnerships Director).<br/><br/>DENSE CONTENT<br/>- Play 10 levels filled with 10 Gigantic bosses and hordes of hand painted, kid friendly, critters.<br/>- Discover 6 Awesome and Unique Weapons, with 3 levels of upgrade for each.<br/>- Unlock 42 Permanent Bonus, which offer exceptional replayability.<br/>- Enjoy Fast paced, touchy and crazy satisfying action.<br/><br/>BEAUTIFUL GRAPHICS<br/>The doodle artwork is brought to life with fluid animation and popping visual effects. Every component has been recreated in meticulous details!<br/><br/>INTUITIVE TOUCH CONTROLS<br/>Grapple Gum features a One touch control. Tap, hold or swipe and hitch a ride with your grapple or shoot at everything and leave a mess of bursted monsters! Intuitive controls deliver a gaming experience both fun and challenging.<br/><br/>ONLINE LEADERBOARD<br/>Compete with players all around the world and see who is the very best<br/><br/>FUN FOR EVERYONE<br/>Grapple Gum is easy enough for anyone to pick up... but it requires tenacity and quick reflex to master.", "metacritic": null, "released": "2017-09-15", "tba": false, "updated": "2019-10-22T14:30:48", "background_image": "https://media.rawg.io/media/screenshots/47a/47a3205ac021ba54e08f2bd1c40bca02.jpg", "website": "https://twitter.com/ali_mehrez", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ali Mehrez"], "genres": ["Action", "Arcade"], "publishers": ["Ali Mehrez"], "esrb_rating": "Everyone 10+"}