{"id": 467481, "slug": "berserk-engine-tank", "name": "Berserk Engine Tank", "name_original": "Berserk Engine Tank", "description": "<p>Introducing, the newest version of Made-by-Kappa type 2-tori tank! Kappa Science is the Best in the World!!!</p>\n<p>Its features include:</p>\n<ul><li>Heavy duty cannon that fires magical bullets with infinite capacity<ul><li>The cannon can also be charged to shoot charged bullets</li></ul></li><li>State of the art engine that can push said this heavy duty tank at a reasonable speed</li><li>Magical armor that can not only withstand any kind of attacks, but also create extremely destructive shockwave around the tank upon receiving an attack\r\n<ul><li>Disclaimer: breaks down after three hits</li></ul></li></ul>\n<p>The engine is still in prototype however... and it seems... it is <strong>out of control</strong> and so it erratically moves randomly every few seconds. I guess you can still somewhat control the movement of the tank by using the recoil made by its super-heavy cannon though...<br/></p>\n<p>After seeing the video and hearing Mark said something along the line of \"take something that the player usually has control of and make it out of control\" and well... I simply take the simple idea of making the movement out of control -- the player's movement erratically changes every few seconds or so. From that idea I turn it into this game.</p>\n<p>I try to polish this game as much as I could in the limited time that I have (since unfortunately I just happen to have a very clumped schedule this weekend). I hope you all enjoy my game<br/></p>\n<p>Not exactly the most well balanced game I must admit. Idk the proper spawn rate for the enemies and the items. Sometimes after a while the screen will get cluttered with both of them *chuckle*<br/></p>\n<p>Known bug: I don't know why but shooting the cannon is supposed to generate particle effects. In my browser it doesn't appear though... although it appears just fine in Godot.<br/></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T16:36:40", "background_image": "https://media.rawg.io/media/screenshots/9d5/9d525e29cdb1a4e053241e9bd7f4573d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Ran d'Reille"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}