{"id": 46745, "slug": "i-was-here", "name": "I was here", "name_original": "I was here", "description": "Do you like to admire non-trivial pictures from around the world? Do you enjoy discovering non-tourist views of tourist places? <br/><br/>If you love to travel but do not have a lot of time and chances for it, or if you are experienced traveler and want to check your savvy and memory, we hope our new game \"I was here\" will bring you a lot of fun. Over than 1000 unique photos from more than 60 cities, interesting and unknown facts about them, 3 difficulty levels and good chill music that will please your ears await you there. <br/><br/>Our game is favorably different from similar projects because of two features. All photos in the game were shot by our friend who travel a lot around Europe, Russia and Caucasus. He is not a professional photographer or traveler but after several years of wandering the world, he got a set of photos with unusual perspective and his own view to known and unknown places. We want to introduce you to his works. Besides of buch of unique photos our game will give you a lot of amazing and interesting facts about places on pictures which you probably haven't known before.<br/><br/>The gameplay includes a meditative contemplation of photos in an attempt to guess the city. Different facts of the city will help you in it if you have some doubts. There is also a more dynamic score(quiz) mode that contains one photo and 4 answer options, where the only one is correct (a 50/50 hint is included)<br/><br/><br/><ul><li>Classic mode with 3 difficulty levels(120+ game levels)<br/></li><li>Quiz mode(over than 700+ game levels)<br/></li><li>1000+ unique 4k photos from over than 60 cities<br/></li><li>Interesting facts about places on photos<br/></li><li>Ingame album<br/></li><li>Good chill music(solo piano, jazz, blues) <br/></li><li>Handmade design</li></ul><br/><strong>Bonus</strong>:<br/>Everyone who will buy a game will get 20 awesome 4k wallpapers<br/><br/><strong>Coming soon</strong>:<br/><ul><li>Gamepad support(will be available on release)<br/></li><li>Steam leaderboard<br/></li><li>Colour blind mode<br/></li><li>More photos for endless mode<br/></li><li>Trading cards(will be available after release)</li></ul>", "metacritic": null, "released": "2017-10-02", "tba": false, "updated": "2019-08-28T22:04:40", "background_image": "https://media.rawg.io/media/screenshots/29b/29b50c972cd7ed80de99dc6bd41be136.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30}, "playtime": 3, "achievements_count": 177, "ratings_count": 1, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Okinawa Sunrise"], "genres": ["Casual", "Indie"], "publishers": ["Okinawa Sunrise"], "esrb_rating": null}