{"id": 467560, "slug": "i-kant-c", "name": "I Kant C", "name_original": "I Kant C", "description": "I Kant C has been embeded onto itch.io, but we recommend downloading the desktop version for a smoother gameplay experience.\r\n\n<p>With the theme of the GMTK 2020 Game Jam being that of \"Out of Control\", we decided to take an approach where one of your senses as the player is taken away. By taking away your \"control\" over sight and placing it in the hands of us, the devs, we present to you the \"challenge\" of not being able to \"see.\"</p>\n\n<p>Here's some bad lore to get into the mindset of the game:</p>\n<p>You crawl through the layers of sand in the sun-struck desert looking for buried treasure to only find yourself being dropped into a dark cave, the sand swallowing you whole. Moments later you find yourself with too much sand in your eyes and your ability to see is reduced to ash. Trying to find a way to clear the sand from your eyes you hear noises of steps and magic. Little do they know, they being absolutely no one, you are a master with your ears and can perceive sound so incredibly well that you can see it. However, seeing sound isn't all that amazing as it kind of just disappears. You note that this cave may host the very treasure you've spent the last hour looking for. You whip out your trusty pistol, that isn't all that great at it's job, and take the challenges ahead.</p>\n\n<p>Controls:</p>\n<ul><li>WASD to move or Left Joystick on Controllers</li><li>Space, Y (on Xbox Controllers) to Jump</li><li>J, Left Click, A (on Xbox Controllers) to Shoot</li></ul>\n<p>Hope you enjoy the game!</p>\n\n<p>Authors:</p>\n<ul><li>Emily Li (Artist)</li><li>Ricky Li (Developer)</li><li>David Li (Developer)</li></ul>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T16:55:32", "background_image": "https://media.rawg.io/media/screenshots/8f3/8f3477a5a66984642eeedb5f3749dfe7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["dvdli", "FTX"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}