{"id": 467694, "slug": "chess-dungeon-kypello", "name": "Chess Dungeon (kypello)", "name_original": "Chess Dungeon (kypello)", "description": "<p><strong>(Please note: There is a bug that happens on screen sizes larger than a laptop, where the name of the level does not go fully off screen and may cover the inventory. Fortunately this is only a visual annoyance - you are still able to click on the items. Sorry about that.)</strong></p>\n\n<p>In Chess Dungeon, you will be dropped into a procedurally-generated checkerboard dungeon filled with treasure and enemy chess pieces.<br/></p>\n<p>Every few turns, you will turn into a different piece with different movement rules.</p>\n\n<p><strong>Controls/Tips:</strong></p>\n<p>-Click on a space with an X to move to that space.</p>\n<p>-Press Z to skip your turn, if you are in a particularly difficult position and not moving is the best course of action.</p>\n<p>-After closing a merchant's screen, while you are still standing on the merchant's space, pressing Z will also re-enter the merchant screen. He may have different items to sell.</p>\n<p>-Hold C to zoom the camera out and get a better view of your surroundings, because there may be enemies waiting to ambush you outside the regular field of view.</p>\n<p>-Enemies cannot move onto or through spaces with chests. While you are standing on a chest, you are safe.</p>\n<p>-When you are in control of a pawn, you will become a queen if you hit a wall in front of you. Enemy pawns cannot do this however.</p>\n\n<p>This game was made in 48 hours for the GMTK Jam 2020. Music was made by Scowsh (twitter.com/ScowshMolosh)</p>\n\n<p><strong>Chess Movement Rules:</strong></p>\n<p>-Pawns can only move directly up one space, unless there is an opposing piece to the top-left or top-right, in which case they can attack in that direction.</p>\n<p>-Rooks can move any number of spaces in a vertical or horizontal line.</p>\n<p>-Bishops can move any number of spaces in a diagonal line.</p>\n<p>-Knights move in an L shape, or two spaces in any direction plus one space in a perpendicular direction. Unlike other pieces, they can jump over anything.</p>\n<p>-Queens can move like rooks AND bishops. They can move any number of spaces in one of the eight directions.</p>\n<p>-Kings can also move in eight directions, but only one space at a time.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T17:23:33", "background_image": "https://media.rawg.io/media/screenshots/a24/a2470f3bb691d6dcbce43cfe5276dc67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["kypello"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}