{"id": 467824, "slug": "brainulate", "name": "Brainulate", "name_original": "Brainulate", "description": "<p>I forgot to change a number in the final build, so if you'd like an extra level or better instructions, check out this post-jam patch: https://www.dropbox.com/s/4v26qk941aouxse/Brainulate.zip?dl=0</p>\n<p>Please use the itch.io version for judging.</p>\n<p>This game teaches a basic understanding of the esoteric coding language brainf*ck through various puzzles.</p>\n<p>This green cell tape is an infinite list of cells each containing an integer value. Your instructions manipulate the values of these cells. Your goal is to match the green cell values with the values of the respective red cells above (when they exist).</p>\n<p>The \"run\" button runs your instructions at a speed dictated by the speed meter above.</p>\n<p>The \"step\" button only runs one instruction at a time.</p>\n<p>The \"reset\" button resets the cell tape to its default state.</p>\n<p>You enter your instructions into a green text box. Valid characters are the following:</p>\n<p>&gt; move the pointer one cell to the right<br/>&lt; move the pointer one cell to the left<br/>+ increment the current cell's value (by one)<br/>- decrement the current cell's value (by one)<br/>[ if the current cell's value is 0, jump to the matching ]<br/>] if the current cell's value is not 0, jump to the matching</p>\n\n<p>With just these 6 simple instructions, complexity quickly spirals out of control.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T17:51:31", "background_image": "https://media.rawg.io/media/screenshots/005/005bcc73e8799ce8af7f09df312bced2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Locally Genius"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}