{"id": 467901, "slug": "starcube-itch", "name": "StarCube (itch)", "name_original": "StarCube (itch)", "description": "<p><strong>Controls:</strong></p>\n<p>Thrust:<br/></p>\r\nForwardWBackwardSLeftARightDUpSPACEDownLCTRL\r\n<p>Rotation:</p>\r\nRoll RightArrow RightRoll LeftArrow LeftPitch DownArrow UpPitch Up<br/>Arrow DownYaw LeftQYaw RightE\r\n<p>Restart : R </p>\n<p>Quit : Alt + F4</p>\n<p>Look around : Mouse movement</p>\n<p><strong>Description:<br/></strong> Apply thrust and torque to your ship, the StarCube, to navigate in zero gravity through a short sequence of levels. Take care to avoid bumping into walls, which can send your ship spinning out of control. Newton is not your friend! <br/><br/>The game can be stressful and irritating due to its unusual control scheme, which can take some getting used to, especially if you're not used to flight-sim-style gameplay. I would recommend trying out the controls in the first room you're dropped in (or in the vastness of space in the 2nd level). Left hand on WASD and right on the arrow keys works well for me. Sorry I dont have any remappable controls!<br/><br/>I intentionally didn't include many QOL features flight/space sims usually feature  to more closely fit my interpretation of the \"out of control\" theme.  Let me know what you think in the comments! I'd love to hear your thoughts and constructive criticism.<br/></p><p>WARNING! You will likely be sent bouncing around and spinning if you play this game! You may experience motion sickness! This can be mitigated slightly by restarting the level if you go spinning out of control.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T18:08:47", "background_image": "https://media.rawg.io/media/screenshots/928/9289b09562b4cb3d21e28ad8594799ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mlipina"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}