{"id": 468074, "slug": "trigger-skew", "name": "Trigger Skew", "name_original": "Trigger Skew", "description": "<p>In Trigger Skew you take the role of a meager technician finally given the chance to escape the facility, armed only with a combat drone with the finest targeting software you could design. However to get a hold of such a drone you had to loot it from the maintenance shop and a few dings never did anyone's eyes good. Watch as you use the drones bouncing lasers and your own maneuvering to compete with the out of control bullets and rockets. With no capacity to aim all you can do is pull the trigger.</p>\n<p> Entrant for the Game maker's Toolkit 2020 Game jam. Made by Alden Towler, Damon Estrada, Daniel Aranda, Isaiah Liljestrand, Jacob Marks.</p>\n<p>Music made By Damon Estrada </p>\n<p>Stock sound effects used otherwise</p>\n<p> Art by Jacob Marks </p>\n<p>Programming by Alden, Daniel, Damon, Isaiah,and Jacob</p>\n<p>How To Play<br/></p>\n<p>\n</p>\n<ul><li>use W,A,S,D movement to move your hunched main character around. </li><li>press left mouse button to send bouncing bullets. </li><li>press right mouse button to launch a curving rocket</li><li>the drone is the source of bullets and rockets but the turret</li><li>will pick a direction out of your control to shoot, based on current drone rotation</li><li> your mouse movement controls character and drone rotation and </li><li>is indicated by the cross-hair on screen, pointing the cross-hair</li><li>towards an enemy will yield better hit results than expected. </li><li>the turret on the drone will glow red when you cannot fire</li><li>you can open the in game menu using the Escape Key (ESC) </li><li>from here you can quit to desktop or select a different bullet speed difficulty</li><li>any fired bullets will bounce around forever.</li><li>your goal is to kill all enemies in the level</li></ul>\n<p>Note: the webGL player version of the game was not optimized for web play, the game mechanics are playable but the in game menu is not scaled properly and you cannot access the changes in bullet speed. <br/><br/></p><p><strong>please use the downloadable version if possible</strong></p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T18:42:51", "background_image": "https://media.rawg.io/media/screenshots/3f8/3f8defd914921de4e1b69717c7571d7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BambooMolasses"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}