{"id": 46801, "slug": "shoppe-keep-2", "name": "Shoppe Keep 2", "name_original": "Shoppe Keep 2", "description": "<p>Shoppe Keep 2 is an open world, first-person, multiplayer-focused merchant simulator, and is inspired by the shopkeepers that we know and love from classic RPGs and MMOs. While adventurers are out slaying dangerous beasts, and selling an alarming amount of stolen plates, cheese and bread, the merchant is keeping their shelves stocked. It’s easy to imagine an ordinary shopkeeper’s duties, but then again... Why settle for the ordinary?In Shoppe Keep 2, you choose how you want to conduct business. Buy your stock from several suppliers around town, or take on lucrative and dangerous missions to secure high class stock that fetch higher profits. Close your Shoppe and explore the town, the forest, and maybe even a cave or two - and battle dangerous enemies in search for sweet loot! Ahem, stock. Stock.<br />\nPlay Online or Play AloneNew to Shoppe Keep is the ability to play with friends, in four-player online co-op! You’ll be able to manage a much larger store more efficiently with several players, and share your love of retail online. You’ll also be able to flaunt cosmetic items you find while exploring, making your friends envious. Share the responsibility and riches!<br />\nIf you want to play by yourself, instead, that’s fine too! Shoppe Keep 2 supports single player gameplay and will allow you to run your Shoppe without the addition of pesky friends who may compromise your Shoppe’s décor and profit.A Town of ChangeWhile your shop grows, so too will the town around you. There will be higher-levelled warriors looking for a good deal on a powerful sword, but the environment will also change to reflect the new level of wealth that your town has secured via a profitable adventure Shoppe.<br />\nA changing economy affected by playersJust filed a big order of health potions? Chances are that you may have oversaturated the market and the value of these items is now at an all-time low! Shoppe Keep 2 has an optional mechanic, which tracks in-game stock that players all over the world are selling, and sends the info to our server. This information will be used to adjust item demand, mark ups that customers will find acceptable, and more! This info may also be used for seasonal events and unique rewards for players.Wear it All or Bare it All!Not only will you stock hundreds of items, but you&#39;ll also be able to equip every single one of them yourself, each with varying damage and armour stats. Use swords, bows, maces and wizard staffs while also equipping a variety of armour pieces.<br />\nThough remember that while a fierce armour set will strike fear into your enemies, perhaps going completely stark naked will have an equal or greater effect?<br />\nAn expanded character creator features in Shoppe Keep 2, allowing you to choose gender and skin colour. And don&#39;t be afraid to express yourself - the custom Shoppe Keeper editor also allows you to change hair styles, eye colour and to add a spiffing beard.<br />\nBut if you&#39;re looking for something more permanent than hairstyles, how about tattoos? There&#39;s a wide range to choose from - from street-cred-boosting skulls, to poop.The New and Improved Helper BotThe Helper bot began life in the original Shoppe Keep as a humble servant to pick up dropped stock, place them on the shelves and zap thieves. The new and improved helper bot does all of that too, alongside general cleaning, but with an added frustration core which will flip off customers that they find aggravating. Other emotional cores may become available in the future to truly make your helper bot more human.Jumping isn’t going to make you moneyBut you can do it!<br />\nRunning a ShoppeIt’s not easy running your own Shoppe. You’re under constant threat of theft from sticky fingered customers, and there’s a barbarian encampment just outside of town - which is constantly threatening the local villagers with a looming attack. But there are those who have worked their way up from zilch to run a fine and profitable establishment. A treasured document passed across generations and etched into toilet paper has been the very corner-stone of Shoppe endeavours for centuries. It lists the five-step process for a successful Shoppe:<br />\nOrder<br />\nPlace<br />\nPrice<br />\nSell<br />\nProfitOrder stockAn empty Shoppe is not a Shoppe… it’s merely a collection of rooms. So you&#39;re going to want to make sure that your shelves are stocked with the finest wares available. The sacred Order Scrolls, passed down from Shoppe Keeper to Shoppe Keeper is fine and dandy for those standard everyday items. But there will be village vendors that will dabble in exclusive items and may only visit the town once a week. Of course, before you go and order a dozen items from these travelling salesmen, make sure there is a demand for them first, or you may be sitting on stock that no one wants!Place StockApproaching customers in a trench coat, pockets full of stock, and being the store is frowned upon by the villagers. Displaying your wares on a fancy pedestal or a table will make them much more enticing for customers. Of course, make sure that you build the right furniture for the right items. Don&#39;t go around building armour racks to store all your hats and swords!<br />\nIf you place a large number of similar items in your Shoppe, becoming a more specialised store, your establishment’s plaque will change and you&#39;ll be granted some additional bonuses when selling those items to customers.<br />\nWill your business thrive on variety, or will a focus and expertise be more lucrative? Keep in mind that the customer’s always right, and so you&#39;ll need to change up stock of your wares based on customer demand.<br />\nPriceHow much is too much? Affordability is subjective, but today’s adventurers keep up with current trends and are wise to the price fluctuations of weapons and apparel. If you price an item too steeply, a sticky-fingered rogue will gladly take an item or two off the shelves without paying!<br />\nThe price gun is the latest in economical tech. A roll of the gears adjusts the sticker price, and with just a swipe of the arm and a beep, an item’s price is adjusted. Keep an eye on your customer’s reactions when browsing your wares to consider a reasonable price for goods.SellYour clientele have their own needs and desires. You can&#39;t sell a wizard staff to a warrior - they just wouldn&#39;t know what to do with it! Then they&#39;d want a refund, but probably won’t be able to express their desire for a refund because they&#39;ll be in the caves of Ranzagullta, battling a terrifying three-eyed Kobold Queen! All of which, while the staff you sold them magics small particles of dust into a flock of taunting seagulls. Clearly, they&#39;d be dead, and that means no repeat custom!<br />\nIf a customer likes what they see, they&#39;ll either buy it, or steal it. Of course, by the decree of the king, you have permission to take matters into your own hands should someone try to go for the five-finger discount. ProfitSays it all really!Features<br />\n•             Run your very own adventurer’s Shoppe, selling potions, weapons, apparel and <em>ahem</em>… herbal products<br />\n•             Expand your Shoppe from a single room to a two-floor mega Shoppe<br />\n•             Four player online multiplayer<br />\n•             An economy that changes with the online community. Sell too many health potions and the market will become over saturated<br />\n•             Explore the open village, forest and distant lands to procure rare resources<br />\n•             Take on forest dwellers and pick up some sweet loot<br />\n•             Sell epic dragon armour, or equip it – all items in the game have their own stats and can be equipped by the player<br />\n•             Employ helper bots to automate your Shoppe<br />\n•             Craft with various ingredients to procure new products</p>", "metacritic": null, "released": "2019-04-25", "tba": false, "updated": "2023-07-04T19:56:44", "background_image": "https://media.rawg.io/media/screenshots/59a/59aa2b87df120adc819ad2ac8ad75ae9.jpg", "website": "", "rating": 1.92, "rating_top": 1, "added_by_status": {"yet": 30, "owned": 553, "beaten": 2, "toplay": 3, "dropped": 15, "playing": 1}, "playtime": 4, "achievements_count": 23, "ratings_count": 25, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 25, "platforms": ["PC"], "developers": ["Strange Fire"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Excalibur Games"], "esrb_rating": null}