{"id": 46817, "slug": "the-path-of-motus", "name": "The Path of Motus", "name_original": "The Path of Motus", "description": "Will you let other people stop you from pursuing your dreams? For generations, a village of goblins have been trapped inside a mysterious forest; anyone who attempts to leave returns hopeless and defeated. Determined to break new ground, a young goblin named Motus plans to build a series of bridges through the forest. However, his perseverance will soon be tested, as he meets bullies that use their own words to stop him. Will you find a way through life's forest, or like others be lost in its depths with no will to continue?<br/><br/>Developed for over two years by Michael Hicks (design, music, programming, writing) and Gonçalo Antunes (all art and animations), The Path of Motus weaves gameplay, music and art together to deliver a poetic experience unlike anything before it.<br/><br/>The Path of Motus features a variety of gameplay:<br/><ul><li>Verbal combat: Motus will meet bullies that yell a variety of deadly words; you'll have to tactfully use your own words to deal with them. Will you use your words to inspire, or to destroy?<br/></li><li>Bridge building: There's a reason why no one's made it through the forest! Solve challenging bridge puzzles to build a way out.<br/></li><li>Thought Doors: Solve innovative puzzles that were designed to convey what Motus is thinking or feeling throughout the story. Unlike many other story based games, the coolest moments in The Path of Motus come across nonverbally as you play.</li></ul><br/>COMING TO STEAM IN 2018!!", "metacritic": null, "released": "2018-07-17", "tba": false, "updated": "2019-08-28T22:04:38", "background_image": "https://media.rawg.io/media/screenshots/ffb/ffb748376813cff633b71404b2a001ed.jpg", "website": "http://pathofmotus.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 86, "ratings_count": 3, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 3, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC"], "developers": ["MichaelArts"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["MichaelArts", "Michael Hicks"], "esrb_rating": null}