{"id": 468261, "slug": "shared-burden", "name": "Shared Burden", "name_original": "Shared Burden", "description": "<p>This is a three player, three tool, three enemy game. The catch is each player only starts with one tool which allows them to move, and they must give up the control of it to the other players to allow them to fight and complete the other objectives.<br/></p>\n<p>Three Characters:<br/></p>\n<ul><li>Chef - a familiar potion/healer archetype. who must chop and cook food to heal their teammates.</li><li>Astronaut  - a puzzle solver who uses the hook to move objects around to solve puzzles </li><li>Figure Skater - a primary tank attacker archetype who must keep back the horde while the others progress</li></ul>\n<p>Three Tools:<br/></p>\n<ul><li>Grappling Hook - Movement for the chef (of latched point swinging), a tool for the engineer and a whip for the fighter</li><li>JetPack - Movement for the astronaut (drifty but wasd directional), a flame thrower for the fighter and a cooker for the chef</li><li>Ice Skates - Movement for the skater (drifty with sharp stops), a weapon and tool for the engineer and a knife for food prep for the chef</li></ul>\n<p>Three enemies: Flesh - gives the chef food to cook, Metal  - giving the astronaut resource, Objective - tougher enemy giving the skater keys to open doors.</p>\n<p><strong>HOW TO PLAY/CONTROLS<br/></strong></p>\n<p>(don't forget to check download instructions below)</p>\n<p>There is no endstate, so see how far you can challenge your team to get through the  randomly generated dungeon.</p>\n<ul><li>Grappling hook - Left click to hook into crates and swing, right click to shorten rope</li><li>Jetpack/skates - WASD movement </li><li>Throw your 1, 2, 3 item with the buttons 1 2 or 3 - if you don't you will be forced to throw it after  the \"burntime\" (the bar above the item) reduces.</li><li>Flame thrower (jetpack for skater) - right click to burn</li><li>Blades/Whip (skates/grapple for astronaut/skater) - left click to hit and knockback enemies ahead of you</li><li>Pickup floor items with f. If the burntime is refilled, you can call back your own movement item with this as well.</li><li>Pull the barrel as astronaut with right click.</li><li>Use e to open doors or chests as the skater, and chop things as the chef.</li><li>Use q to cook things as chef, and to stop items the astronaut  is pulling onto the button</li></ul>\n\n<p>Credits:<br/>thetrueprime - code, eda - environment art, ellie -  character art</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T19:21:46", "background_image": "https://media.rawg.io/media/screenshots/301/301f0d1ce74f60626168a8d9de6161a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thetrueprime"], "genres": ["Action"], "publishers": [], "esrb_rating": null}