{"id": 46821, "slug": "task-force", "name": "Task Force", "name_original": "Task Force", "description": "There are NO plans to include any of the following in Task Force:<br/>- NO Health Regeneration<br/>- NO Weapon Unlocks<br/>- NO Enemy Targeting (UAV)<br/>- NO Character Progression<br/>- NO Killstreaks, Deathstreaks, or Perks<br/>- NO Drivable Vehicles (Coop Only)<br/>- NO Unrealistic Skins<br/><br/><strong>TACTICAL THIRD-PERSON GAMEPLAY</strong><br/>Gameplay focuses on close quarters infantry combat where communication and teamwork are required. Expanding crosshairs provide a sense of weapon inaccuracy which is affected by recoil, stance, movement, and a few other factors. It rewards bursting by keeping tighter shots more precise while still allowing for accurate spray.<br/><br/><strong>STRATEGIC ROUND-BASED GAME MODES</strong><br/>Game modes are round-based and mostly focus on single-life objectives. They’ll involve aspects such as planting or defusing bombs, extracting or guarding hostages, and capturing or defending enemy intel. Each map will be designed to a specific game mode but may also have different areas sectioned off for different modes.<br/><br/><strong>COMPETITIVE LEAGUES AND RANKINGS</strong><br/>Automated ladders and tournaments are integrated directly into the game. Players are provided with a detailed stats profile and a global ranking based on competitive performance. Servers are automatically created for scheduled matches and will instantly report game information upon match completion.<br/><br/><strong>CUSTOM USER-CREATED LOBBIES</strong><br/>Servers are organized based on region and players have the ability to create their own lobbies directly in-game. These custom lobbies provide access to a robust set of management tools such as restricting players to friends-only or clan-only. It also allows for region-locking servers and automatically kicking high ping players.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-25T17:54:26", "background_image": "https://media.rawg.io/media/screenshots/67f/67f19b63ba3574c8eb5cd6ff8fd54ba7.jpg", "website": "http://taskforcegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Tracer Interactive"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Tracer Interactive"], "esrb_rating": null}