{"id": 468281, "slug": "unstoppable-cris4005", "name": "Unstoppable (cris4005)", "name_original": "Unstoppable (cris4005)", "description": "<p>Eggloid lost control and the guards are trying to catch him or eliminate him. Stay alive and eliminate everyone who tries to stop you.</p>\n<p>============</p>\n<p>HOW TO PLAY</p>\n<p>============</p>\n<p>Aiming = Wheverever your mouse is Eggloid will fire.</p>\n<p>WASD / Arrows = movement.</p><p>ESC Key = Pause.</p>\n<p>============</p>\n<p>Eggloid has 4 types of guns with different fire rate and projectiles that bounce for a longer period of time, however he is too unstable and therefore he chooses a gun randomly and fires without stopping.</p>\n<p>Eggloid sometimes will enter the overloaded state giving you a shield that can defend you from any projectile and enemy that gets near at the cost of not choosing any gun.</p>\n<p>Eggloid will die if ANY projectile (including yours) touches him.</p>\n<p>Tips&gt; White lights will give you a hint where walls are located. Don't stay still.</p>\n<p>Stay alive.</p>\n<p>-------------------------------------------------------------------------------------------------------</p>\n<p>Eggloid perdió el control y los guardias están tratando de atrapar o eliminarlo. Sobrevive y elimina a todos los que traten de detenerte.</p>\n<p>============</p>\n<p>CONTROLES</p>\n<p>============</p>\n<p>Mouse = Apuntaras donde sea que el mouse esté.</p>\n<p>WASD / Flechas = movimiento.</p><p>Tecla ESC = pausa.</p>\n<p>============</p>\n<p>Eggloid posee 4 tipos de armas con diferentes velocidades y rebotes en sus proyectiles. Ya que perdió el control el selecciona una arma al azar.</p>\n<p>Eggloid a veces puede entrar en un estado sobrecargado el cual te dará un escudo que te defenderá de cualquier proyectil y enemigo que se acerque, pero durante ese tiempo el no tendrá un arma.</p>\n<p>Eggloid morirá si cualquier proyectil o enemigo lo toca (incluyendo sus propios proyectiles).</p>\n<p>Tips&gt; Las luces blancas te dará una pista donde están las paredes y recuerda no quedarte parado.</p>\n<p>Mantente vivo.</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T19:25:43", "background_image": "https://media.rawg.io/media/screenshots/a8b/a8b9ed60e1ed8024c32fe8c9582621b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cris4005"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}