{"id": 46839, "slug": "devader", "name": "Devader", "name_original": "Devader", "description": "Play this original arcade game and fight wave after wave of cruel, challenging and ever changing enemies. Wield powerful weapons as you strategize to find the best method to defeat the invaders while protecting the core. With many upgrade paths to choose from, various endings and secrets to unlock, Devader offers a wealth of possibilities and hours of game play.<h3>Features</h3><ul><li> Intense twin-stick action combined with strategic weapons<br/></li><li> Over 100 waves filled with complex enemies and old-school bosses<br/></li><li> Powerful, strategic weapons to choose from<br/></li><li> Surprise mechanics (not the EA kind, actual mechanics)<br/></li><li> Tailored upgrade paths enabling different play-styles<br/></li><li> Various endings and secrets to unlock<br/></li><li> Feature Creep<br/></li><li> Online leader board to challenge your friends<br/></li><li> 4 difficulty levels, from beginner to the insane god mode<br/></li><li> 19 Endings<br/></li><li> Adaptive environment<br/></li><li> Play with mouse &amp; keyboard &amp; gamepad in various combinations<br/></li><li> Local coop multiplayer with up to 4 gamepads + 1 keyboard/mouse </li></ul><h3>Save a civilization on the brink of destruction</h3>The Krin, a mysterious species of all-devouring aliens have launched a merciless invasion. <br/>Defend the last remnants of an ancient civilization against unrelenting waves of malignant Krin. You are the last hope!<h3>Intense Boss Fights</h3>Fight against the Krin's champions, ominous monsters demanding everything from your battle skills and strategic wit. The bosses attack with tentacles, lasers, lightning beams and millions of projectiles. Will you be able to defeat them?<h3>Play With Your Mates</h3>Play with 4 friends! All you need to turn Devader into an awesome couch co-op experience are some game pads. Friends would be nice too. New players can jump into the action on the fly, no need to restart.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-17T06:01:35", "background_image": "https://media.rawg.io/media/screenshots/f6e/f6e09681daf43b17d994da23efaa1d3a.jpg", "website": "http://www.falkenbrew.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 38, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Falkenbrew"], "genres": ["Action", "Indie"], "publishers": ["Falkenbrew"], "esrb_rating": null}