{"id": 468359, "slug": "two-control-kitchen", "name": "Two Control Kitchen", "name_original": "Two Control Kitchen", "description": "<p>This game was a submission to the GMTK jam 2020. The theme of the Jam was OUT OF CONTROL.<br/></p>\n<p>Our game TWO CONTROL KITCHEN is a two player game and your goal is to serve all kinds of creatures and monsters in your tavern, but there is a catch, the mons-COSTUMERS, won't straight up tell you what they want to eat, after all they are monsters. So to know what kind of food they want to eat, one of you will have to look trough the COOK BOOK, there is the ancient knowledge pointing out what each costumer want to eat.</p>\n<p>One player is busy serving tables and can see what each costumer looks like, so this player need to tell the CHEF the appearance of the costumer so the chef can search in the cook book which food they want. The CHEF needs to tell the SERVER, what food to give them and the SERVER can give it to the costumer, everything before the costumer gets angry and breaks your bar.<br/></p>\n<p>I hope your communications skills are on point, because you are going to need if you intend to win.<br/></p>\n<p>Both players can play via web, but If you want you can download the PDF for the CHEF here.</p>\n<p>-------</p>\n<p>We explore the Theme OUT OF CONTROL, taking part of the control out of the player, one player, the SERVER, knows how the costumer looks like, but doesn't have access to the Cook Book, while the CHEF, have the tools to know what food to serve, but the cook book only works if you know the costumer appearance, this way neither of the player have complete control, and winning or loosing is out of their control has individuals, and only working together they can take the control back.<br/></p>\n<p>We took inspiration in communication based games like Overcooked and Keep Talking and Nobody explodes.</p>\n<p>-------------------------------------<br/>PT-BR<br/><br/>Esse jogo foi a nossa entreda pra GMTK JAM 2020. O tema da jam era OUT OF CONTROL (fora de controle).<br/><br/>Nosso jogo TWO CONTROL KITCHEN é um jogo para dois jogadores onde o seu objetivo é servir todo tipo de criatura e monstro na sua taverna, mas o problema é que esses monstr-CLIENTES, não falam exatamente o que eles querem, afinal de contas eles são monstros. Então pra saber qual comida eles desejam vocês precisam contar com a sabedoria milenar do COOK BOOK (livro de receitas), que diz exatamente o que cada cliente quer.<br/><br/>Nesse jogo um dos jogadores vai tomar o papel do SERVER (atendente), prestando atenção nos clientes que entram na taverna e servindo a comida, porém o SERVER não tem acesso ao livro de receitas. Enquanto o CHEF que tem acesso ao livro de receitas não sabe a aparência dos CLIENTES, que é a informação que ele precisa para saber os pratos que vão ser servidos.<br/><br/>O SERVER precisa compartilhar informações sobre a aparência do CLIENTE, coisas como, raça, profissão, olhos e chapéu, enquanto o CHEF, vai procurar a comida ideal.<br/>Todo CLIENTE vai pedir 3 comidas, se vocês demorarem muito para servi-lo ou servir a comida errada, eles vão ficar bravos e vão bater no seu bar.<br/>Todo prato é dfinido por 2 atributos dos clientes, então estejam em constante comunicação.<br/><br/>O tutorial do jogo está em inglês, porém no momento de escolher o papel tem o botão CHEF (com a bandeira do Brasil), para acessar o livro de receitas em português.<br/><br/>Caso prefira pode baixar o PDF do livro de receitas em PT-BR aqui.<br/>-----<br/>Exploramos o tema da jam OUT OF CONTROL (fora de controle) tirando parte do controle dos jogadores, um jogador o SERVER, sabe  aparência do cliente, porém não sabe o que ele quer comer, enquanto o outro jogador o CHEF, sabe qual o prato, porém não tem a informação da aparência que é o que ele precisa pra saber qual comida servir. Dessa maneira nenhum jogador está interamente no controle, apenas trabalhando juntos que eles vão conseguir retomar o controle.<br/><br/>Nosso jogo foi inspirado em jogos baseado em comunicação como Overcooked e Keep talking and nobody explodes.<br/><br/><br/><br/></p>\n<p>Credits:</p>\n<p>The Team<br/>Theo Boechat<br/>Jotanoos<br/>Tomás Queiroz</p>\n\n<p>Sound effects<br/>\"Book, Flipping Through Pages, A.wav\" by InspectorJ (www.jshaw.co.uk) of Freesound.org<br/>\"Rain, Moderate, C.wav\" by InspectorJ (www.jshaw.co.uk) of Freesound.org<br/>\"Table Hit\" by Dasgoat of freesound.org<br/>\"steam train horn 01\" by eliasheuninck of freesound.org</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-13T19:40:21", "background_image": "https://media.rawg.io/media/screenshots/a65/a65b8f1562f290c72b0b7657e637319a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jotanoos", "Tomás Queiroz", "theoboechat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}