{"id": 468532, "slug": "rulescramble", "name": "RuleScramble", "name_original": "RuleScramble", "description": "<p>Story Mode</p>\n\n<p>Select your difficulty. It doesn't matter until the end. Choose Hard if you love  a challenge. Choose Easy if you're worried about controls and fine movements. If you want to change the difficulty, you can do so by pressing Esc, and then selecting a different difficulty and then selecting story mode again.</p>\n<p>Arcade Mode</p>\n\n<p>Pay attention to the rules on screen. These tell you what will happen when playing, but watch out, enemies can change them. Scramble to the victory condition to get more points and get a high score.</p>\n\n<p>Known Issues:</p>\n<p>Performance issues on windows 8.x. If the game appears to be running slow, you can press F2 while in arcade or story mode to show some diagnostics. The tps value should be 30. If it's consistently less, then it's likely that you will not be able to play the game. Sorry.</p>\n<p>On the final stage you might fall through the floor. You will need to hit Esc to go back to the title screen to reset, or wait for the time to run out, and then press R. If this happens repeatedly, I suggest setting the difficulty to Easy, so that you get checkpoints on the boss phases. [This should be fixed with the latest build, but I'm leaving the note here regardless.]</p><p>After dying on the final stage the script to get the attack doesn't play. To work around the issue, change the mode to easy.</p>", "metacritic": null, "released": "2020-07-11", "tba": false, "updated": "2020-07-13T20:20:31", "background_image": "https://media.rawg.io/media/screenshots/7b1/7b1e9d79698c0c37a9caf3359b5b1c8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NDev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}