{"id": 468634, "slug": "rescue-my-princess", "name": "Rescue my princess", "name_original": "Rescue my princess", "description": "<p><strong>INDIE PRIZE 2019 USA finalists</strong></p>\n<p><strong>2019 INDIE CRAFT TOP 20</strong></p>\n<p>You've heard a lot of stories that begin with 'Once Upon a Time in a Village'. Here is another story you have not heard yet.<br/>It happened in a small kingdom that was peaceful.<br/>The Princess of Istera Kingdom, Selina and the dignified Knight who liked her, Walter<br/>Please complete these two stories.</p>\n<p>One day Walter takes courage and decides to propose to Selina.<br/>He approached and confessed to Selina, who is taking a short stroll on the hill of the Istera kingdom.<br/>Somewhere a devilish demon, Gally, has appeared.<br/><br/><br/>I do not know why Gally kidnapped princess, and he flew away as if to fool Walter.<br/>Walter begins to chase Gally to save Selina without telling anyone.<br/><br/><br/>Can Walter save the princess and succeed in the proposal?<br/>Help him to save the princess.<br/><br/><br/>One day when proposing to the princess, the sudden appearance of the monster, Galli, kidnapped the princess.<br/>Walter defeats the monsters and follows them to save the princess.<br/>Help him to defeat monsters and crush the blocks that monsters disturbed and then get Walter to save the love princess.<br/><br/><br/>The beginning of a completely new puzzle you have never seen before!<br/>Create a road by removing blocks and send the knight to the destination level then you can clear level!<br/>You do not need to have a headache while doing 2 or 3 missions. Move the knight to resuce the lovely princess.<br/>It's easy to break a block, but you have to strategically work to get to your destination.<br/>You can upgrade the number of footsteps of an adventurous knight and move the knight a little more, so meet the spirit and increase the number of footprints.<br/>You can meet various friends, articles, monsters, gatekeepers and more at this funny and great pathfinding puzzle game .<br/>Collect logs and coins to cross the river, and continue your adventure.<br/>Even in airplane mode without wifi, you can enjoy it online, offline, anywhere also under hundreds of meters underground.<br/><br/><br/>Rescue My Princess is completely free to play, but you can purchase some items for easy solution of puzzle, depending on your preference.<br/>You can also earn golds with Quest and Daily gift.<br/>Rewards levels are challenging, but if you clear, you can get golds.<br/><br/><br/>Features of Rescue my princess<br/>- Destroy two or more connected blocks without swapping them.<br/>- Match the blocks to create a way for the knights to move.<br/>- Do not think about other missions, focus on your knight, strategically remove blocks.<br/>- Hundreds of levels: enjoy adventure, meet friends, and save your princess with the help of your colleagues.<br/>- Fun new game mode: clear the serial puzzles, defeat the boss, return to the kingdom with the princess<br/>- Move your knight to the side of the monster and attack.<br/>- Do you fight boss monsters? If there is an knight on the battleground, the boss gets stressed. Be patient, but be careful not to get stressed three times.<br/>- The more blocks you remove, the more points you can get for summon a pet.<br/>- Collect log to make bridge, cross river.<br/>- The gatekeeper guarding the castle gate sometimes demands a coin.<br/>- Please note that some obstacles can not be removed.</p>", "metacritic": null, "released": "2020-07-11", "tba": false, "updated": "2020-07-13T20:41:43", "background_image": "https://media.rawg.io/media/screenshots/f47/f47bc5c3ca55fa80a623e1eac60ef2a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Windflow"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}