{"id": 46874, "slug": "super-dungeon-master", "name": "Super Dungeon Master", "name_original": "Super Dungeon Master", "description": "You were not the chosen one. <br/>\n<br/>\r\nNo prophecy foresaw the unleashed chaos and many died. <br/>\r\nYou are a ghost, a lost soul wrought from your body. <br/>\r\nAnd yet, the man who captured your soul saved your life too - as you too will soon save others. <br/>\n<br/>\r\nMany years ago, the lands turned dark around Mount Anaias as a maestrom of chaos was summoned there; towns were destroyed, cities were besieged and chaos ruled the land. <br/>\r\nMany were called to defeat this terrible evil as an enraged beast-army rampaged the lands. Champions arrived with powerful weapons, magickal artefacts, chosen prophets, powerful charms, big axes, tiny time prisms, a dragon companion, even working close enough to Lord Chaos so as to betray them - they all failed. <br/>\r\nFor years after, there was nothing but desolation as the kingdom collapsed and the people and beasts disbanded into tribes. <br/>\n<br/>\r\nYou are Theron, student to the departed Grey Lord. At the time of the cataclysm, the Grey Lord protected your soul, even though he could not save your body. Only now has he been able to approach you and offer you the power to embark on an epic quest. <br/>\r\nGranted with the power to raise four lost champions, your assembled team must find the fabled Firestaff deep inside the Dungeons of Mount Anaias to defeat Lord Chaos. On the way, you will learn as much of the Champions as you will of the Dungeon Master. <br/>\n<br/>\r\nSeek balance. Bring the world back to life. Win. <br/>\n<br/>\r\nFeatures: <br/>\r\n- all 14 levels of the original 1987 classic dungeon-crawler <br/>\r\n- many secret areas and hidden levels! <br/>\r\n- incredible soundtrack from many contemporary game musicians <br/>\r\n- all 24 original characters from the Dungeon Master game <br/>\r\n- 7 additional brand new playable characters <br/>\r\n- all new artwork, replicating the original game-world <br/>\r\n- tutorial to showcase all features <br/>\r\n- 9 extra quests to discover atop Oracle Mountain! <br/>\r\n- detailed world-map illustrating origin of champions <br/>\r\n- original backstories to all original game characters <br/>\r\n- discover the secret of Lord Chaos <br/>\r\n- ...why did the beasts join Lord Chaos? <br/>\r\n- ...why didn't Lord Chaos have the Firestaff? <br/>\r\n- ...why is Gothmog so mysterious? <br/>\r\n- ...and why is Tiggy so outrageous? <br/>\n<br/>\r\nLearn all the secrets to know all the answers... <br/>\n<br/>\n<br/>\r\nBeat it once in three hours, <br/>\r\nbecome Dungeon Master in a week.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:36", "background_image": "https://media.rawg.io/media/screenshots/d8d/d8dd636bfd4aca13f69a72c2dff60d26.jpg", "website": "http://dungeonmastercom.weebly.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 137, "toplay": 2}, "playtime": 1, "achievements_count": 60, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dave Gumble"], "genres": ["Adventure"], "publishers": ["Dave Gumble"], "esrb_rating": null}