{"id": 46871, "slug": "capsa", "name": "Capsa", "name_original": "Capsa", "description": "Capsa is an open world, social game which provides users with the opportunity to hang out in a breath-taking, and ever-expanding environment.<br/><br/>Featuring a large, gorgeous landscape, players can enjoy exploring Capsa’s many destinations with all their friends. Developed using the most up-to-date technology, Capsa is designed to take full advantage of current hardware, providing an awesome, high-resolution experience. Unlike most virtual worlds Capsa is developed around the concept of a singular connected world, meaning no separate instances or loading screens to reach different locations and allowing you the ability to travel seamlessly to explore vast areas. <br/><br/><ul><li>Project an outward appearance that reflects your mood and charisma! Customize your character using in-depth facial shape options that offer you the freedom to create something unique.<br/></li><li>Personalize outfits, with per-piece clothing customization offering a wide range of possibilities to express your personality and taste. </li></ul><br/><ul><li>Decorate one, or more, of the numerous beautiful homes using the assortment of furniture and décor options available. <br/></li><li>Listen, share, and enjoy streamed music from a range of virtual devices. <br/></li><li>Host movie nights with friends! Enjoy fully synchronised streamed YouTube videos through virtual televisions in your personalized homes.<br/></li><li>Exhibit your favorite images from the internet on canvases and frames.</li></ul><br/><ul><li>Diverse, invigorating areas offer a venue to meet new people and hang out together.<br/></li><li>Vibrant, in-game dance clubs provide the perfect venue to strut your stuff on the dance-floor or listen to streamed music with your friends.<br/></li><li>Fun mixture of dances and emotes, perfect to express yourself with.<br/></li><li>Clean and easy to use in-game text chat.</li></ul><br/><ul><li>Expansive world provides the perfect landscape for hours of exploration. Capsa’s initial game world has been designed to submerse players in an exotic and breathtakingly beautiful, south Pacific archipelago. This large, scenic world can support huge groups of players simultaneously, so bring all your friends!<br/></li><li>Immersive ambiance which sets the perfect atmosphere for players to hang out and enjoy each other's company.<br/></li><li>Dynamic world, featuring full day and night cycle. </li></ul><br/><ul><li>Host your own world featuring many clubs, homes, and hang out locations in the same connected space with no level instancing<br/></li><li>Enable Privacy options to restrict your server to either your friends list or a private group<br/></li><li>Customize your server to your own liking, with adjustments for time of day length or forced time of day.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:36", "background_image": "https://media.rawg.io/media/screenshots/530/5301da0d1895a1ae59213de67ebd91d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 151, "toplay": 1}, "playtime": 1, "achievements_count": 242, "ratings_count": 0, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vetron", "db.works"], "genres": ["Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Vetron"], "esrb_rating": null}