{"id": 46900, "slug": "my-country", "name": "My Country", "name_original": "My Country", "description": "Experience the first ever city builder designed for augmented reality! Travel around the world to discover unique locations and build your own country right on your coffee table!<br/><br/>The latest technologies finally allow you to see your creation in a whole new dimension, filled with miniature cities and their cute inhabitants. Take charge of developing an entire country and watch the boundaries melt away between your city and reality! Manage airports and train stations. Build up a business district packed with skyscrapers and travel to the countryside. The choices are all yours!<br/><br/>• FIRST EVER city builder for augmented reality - you have to see it to believe it!<br/>• BUILD a country of your dreams right on your coffee table!<br/>• FIND hidden items for your citizens and complete fun tasks!<br/>• PARTY in the city! Throw a huge party every time you feel like celebrating<br/>• UPGRADE your cities to generate a booming economy!<br/>• DISCOVER unique locations - Airport, Trainyard, Marina and more!<br/>• SNAP photos of your creations - pose as a giant overlooking the city or send your pet for a photo op!\"<br/><br/>Like us on Facebook - www.facebook.com/MyCountryCommunity/<br/>Support - www.game-insight.com/en/support/ <br/>Privacy policy - www.game-insight.com/en/site/privacypolicy", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-10-22T14:30:48", "background_image": "https://media.rawg.io/media/screenshots/046/046201ae4ac714856a66c06f0cfa8a4d.jpg", "website": "http://www.game-insight.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Insight"], "genres": ["Strategy"], "publishers": ["Game Insight UAB"], "esrb_rating": "Everyone 10+"}