{"id": 469039, "slug": "orson", "name": "Orson", "name_original": "Orson", "description": "Welcome to Land of Orson, this is a turn-based strategy quest game as a tribute to the classics. Build castles, lead heroes to explore the unknown continent, use strategy to defeat your opponents, capture their castles and win the war.<br/><br/>- Wonderful Story<br/>\tImmerse yourself in a legendary story during a single-player campaign with 30 scenarios full of intrigue, action, and suspense.<br/>- Competitive Turn-based System<br/>\tWith this competitive turn-based system, each player’s operation time determines the order of the next turn.<br/>- Unique Combat Mode<br/>\tCombat with the original pre-command operation mode, to defeat your opponent’s hero as the winning condition.<br/>- Multiplayer Game<br/>\tConfront rivals in Multiplayer via a LAN for up to 6 players.<br/>- Custom and Random Maps<br/>\tBeside the rich default maps, you can create new maps through the map editor or generate random maps.<br/><br/>---------------------------<br/>Once upon a time there was a computer game that became the obsession of countless people around the world.<br/>There is no sequel.<br/>I want to change that.<br/>I myself am a fan who also loves this game.<br/>I do not want people to forget this beloved creation and so I have created another game to honor it.<br/>I have spent 4 years of my life and more than $40,000 US dollars to create this new tribute game. <br/>Now I believe the magic will come back once again!<br/>Heroes Of Might and Magic: We love you forever……", "metacritic": null, "released": "2019-11-05", "tba": false, "updated": "2020-07-17T02:27:22", "background_image": "https://media.rawg.io/media/screenshots/a95/a95be4c490f8dd312c7f85010efefcaa_cSdDOYs.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["minzhi huang"], "genres": ["Strategy"], "publishers": ["minzhi huang"], "esrb_rating": "Everyone 10+"}