{"id": 46915, "slug": "belpaese-homecoming", "name": "BELPAESE: Homecoming", "name_original": "BELPAESE: Homecoming", "description": "BELPAESE: Homecoming is the first chapter of a 2D Point &amp; Click Retro-Indie Graphic Adventure Game. It illustrates the Point &amp; Click political rise of a slob who, despite his many defects, in fact thanks to them, is rewarded with easy women, money, power and fame. In short: the art of making do with nothing!<br/>\n<br/>\r\nA Point and Click Graphic Adventure Game about politics?! How boring! (Not.)<br/>\r\nNo other country like Italy - though recently, the United States, may have that honor - can boast a political system so full of crazy, laughable twists and turns. To rule Italy we have the losers: in their job, in their studies… in everything: the bullies who grew up stealing other kids' lunch money, flunked out of university and, having tried all possible shortcuts to wealth, finally find their calling by jumping into politics. The best part about this circus full of grotesque characters is that you can't help laughing at them. <br/>\n<br/>\r\nA Point and Click Graphic Adventure Game Made in Italy, in fact Made in two<br/>\r\nGame Design, Sound Design, coding and Soundrack are by the Fazz Brothers, a crazy theoretical physicist and a nuclear engineer who have decided to quit their jobs and become indie developers: the art of making do with nothing, as we said!<br/>\n<br/>\r\nTechnical Specifications<br/>\r\n•\t2D Point and Click Graphic Adventure Game<br/>\r\n•\tPlayable in English and Italian<br/>\r\n•\tGraphic Adventure Game with more than 2 characters, but less than 1000<br/>\r\n•\tGraphic Adventure Game with enough locations<br/>\r\n•\t4 hours game for players with QI more than 110. If you have less than 91, buy it but don’t play it!<br/>\r\n•\tPoint and click Adventure Game (we repeat it to improve the indexing of “graphic adventure” and “point and click)", "metacritic": null, "released": "2017-10-16", "tba": false, "updated": "2019-08-28T22:04:35", "background_image": "https://media.rawg.io/media/screenshots/c67/c67679d626fa80ed388ded05bb672948.jpg", "website": "http://www.belpaesethegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 2, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Fazz Brothers"], "genres": ["Adventure", "Indie"], "publishers": ["Fazz Brothers"], "esrb_rating": null}