{"id": 46914, "slug": "campfire-cooking", "name": "Campfire Cooking", "name_original": "Campfire Cooking", "description": "Campfire Cooking is a puzzle game about relaxing moments in nature, as you prepare meals over a warm fire. Discover the joy of cooking on a stick and test your problem-solving skills with some challenging campfire puzzles! The latest creation from Layton Hawkes is guaranteed to make you feel clever, hungry and eager to book your next woodland escape.Over 100 meals to prepare.Solve tricky puzzles with one simple goal; prepare the all the food, cooked to perfection and with a hint of smoke. When each meal is ready it's time to trek to the next campsite. But don't be fooled: these puzzles are no walk in the park, and some of them are a hike up the mountain!<br/>Meet the family.A year long trip and a lot of marshmallows to toast. Follow a vacation like no other and listen to the campers as they tell stories, laugh at each other’s jokes or moan about the lack of cell phone reception. Enjoy the simple moments they share around the fire while waiting for their food to be cooked.<br/>Puzzle-solving, with a twist.Twist, rotate and jostle skewers around the fire until each meal is ready to eat. Push fondue pots, play with magnets or maybe just use a camping stove if the fire won't light. Discover clever ways to solve puzzles at each new locale.<br/>Visit exotic hiking trails.Once you've visited all the campsites on one trail, why not hike to another? Each trail brings you new vistas brimming with color, different foods to cook and fresh fireside stories to hear. Take a journey from the deep woodlands to snow-capped peaks, and everywhere in between.<br/>", "metacritic": null, "released": "2017-10-18", "tba": false, "updated": "2019-10-22T14:30:51", "background_image": "https://media.rawg.io/media/screenshots/2fd/2fd83aa051a6360853457575942987a8.jpg", "website": "http://www.laytonhawkes.com/campfire-cooking/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 10, "beaten": 1, "toplay": 2}, "playtime": 7, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "PC"], "developers": ["Layton Hawkes"], "genres": ["Indie", "Puzzle"], "publishers": ["Layton Hawkes"], "esrb_rating": null}