{"id": 469150, "slug": "lazy-pirates", "name": "LAZY PIRATES", "name_original": "LAZY PIRATES", "description": "Keep Your Crew Happy\r\n<p>You are a captain sailing the seven seas, beset on all sides by other pirates, fearsome watchtowers armed with cannons, and even the hazardous environment itself. What's worse, your crew is manned by a bunch of lazy scallywags who're just waiting for their chance at mutiny!<br/></p>\r\nShow Lead-<em>ARRRR</em>-ship and Skill!\r\n<p>Make the right choices to keep your crew's morale up so they'll continue to follow your orders - take too much punishment, and they'll be less likely to heed your commands at all.</p>\n<p>The more ships you destroy, towers you blow up, and glittering booty you recover from the waves, the more morale your crew will have. The higher your morale, the more likely they are to follow your commands. If your morale gets too low, the likelihood of your villainous fellows following your orders gets lower and lower.</p>\n<p>A heartwarming shanty is always a balm to any<em> ARRRRRR</em>gression, of course!</p>\n<p>\n</p>\r\nControls/Basics:\r\n<ul><li>Click one of the random cards you are given to shout that command to your crew</li><li>Press the 'refresh' button next to the cards to get a full new hand of cards</li><li>Right click and drag to rotate the camera</li><li> If your morale gets low, sing shanties / kill enemies / collect booty to increase it</li><li>Taking damage or crashing reduces morale</li><li>Low morale will cause your crew to more frequently refuse your commands, so try to keep it high to remain in control</li></ul>\n\n<p>(<strong>Warning</strong>: There is no winning or losing conditions in the game due to time constraints and spending too much time on enemy ship AI - if your morale gets to 0 just imagine you lost and restart the game ;) &amp; if you destroy all the ships and towers, and plunder all the booty - congrats, you won!)</p>\n\n<p>Cheers for checking it out! <br/></p>\n\r\nSocial:\r\n<p>Follow the devs on twitter here:</p>\n<p>https://twitter.com/DevFatigued</p>\n<p>https://twitter.com/_Vollando</p>\n<p>https://twitter.com/MarlyGames</p>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-17T03:03:43", "background_image": "https://media.rawg.io/media/screenshots/679/6792a83ed9096052b8f9951b3e03787e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joe P.", "MarlyGames", "Vollando"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}