{"id": 469140, "slug": "save-your-mum-and-her-cats", "name": "Save your mum (and her cats)", "name_original": "Save your mum (and her cats)", "description": "<p><strong>DISCLAIMER</strong>: This game was designed to push your CPU to melting temperatures so as to emulate a real life bushfire scenario. If your computer has a good CPU or GPU, then it is recommended that you try this on an older computer for a more realistic experience. Frame rate drops are also an intentional part of the experience designed to disorient and confuse you as you traverse through mountains of trash.<br/></p>\n<p>TRIGGER WARNING: hoarding and mild bushfire references.<br/><br/>Your mum's hoarding has gotten out of control and a nearby bushfire is closing in on her property. She's trapped inside and her cats are missing. Get in there and save your mum (and her cats) before it's too late!</p>\n<p>This is a short first-person puzzle game  that I designed and programmed over 48 hours  for the 2020 GMTK game jam, the theme was 'Out of Control'. This is my first released game and first game jam since picking up Unity in April 2020.</p><p><strong>CONTROLS</strong>:<br/>WASD: move<br/>Mouse: look<br/>Spacebar: jump<br/>Primary mouse hold: pickup item<br/>Primary mouse release: drop item<br/>P: pause<br/></p>\n<p>Music by<strong> </strong><strong>kaspurrz</strong><br/>Cat graphic by <strong>SKUX AZ</strong><br/>Furniture and food assets by <strong>Quarternius</strong><br/>House made during the jam with <strong>MagicaVoxel<br/></strong></p>\n<p><strong>BUGS:</strong><br/></p>\n<ul><li> Unfortunately one of the puzzles is broken in this iteration (the final one sadly), however, it shouldn't stop you from completing the game. </li><li>There's also a bug towards the end that kinda forces the player through the wall or you may get stuck, just press P to pause and restart.</li><li>If an object gets stuck or you can't press a cat, mash the heck out of the left mouse button and move the mouse around. It should eventually fall. The object has to align with cursor at the center to drop.</li></ul>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-17T03:01:22", "background_image": "https://media.rawg.io/media/screenshots/fff/fffa6a30ac7aa14c700b972b8f8be4a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["itchiitchiboi"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}