{"id": 46918, "slug": "anonymous-me", "name": "Anonymous ME", "name_original": "Anonymous ME", "description": "Anonymous Me is a Chinese style 2D platformer. You can cycle through three weapons and hack &amp; slash your way with cool combos. Explore the world as the story unfolds. In the end, you will challenge some overwhelming power. <br/><br/>Anonymous Me is set in late Qin Dynasty of China. People are brutalized by Shihuangdi, the founder of the Qin dynasty. The empire that unifies China is falling already. Female assassin Meng Nv is drawn into a long premeditated conspiracy right after she manages to escape an evil organization. <br/><br/>It is true that everyone is nobody in that given historical period in China. It’s almost impossible for people to control their own fate. Before we make the conclusion, let’s just hear  Meng Nv’s story.<br/><br/><br/><br/>■Chinese style arts and music<br/>Enhanced by stunning animations, Anonymous Me boasts a beautiful hand-drawn world vividly depicting China in Qin Dynasty, which was more than 2,000 years ago. Hack and slash your way out of cities, high mountains, snowy plains, and ancient tombs. Explore this gorgeous ancient empire accompanies by ethereal Chinese style music. <br/><br/>■An epic storyline of twists and turns<br/>Protagonist Meng Nv blurs the line between good and evil. Qin Dynasty is collapsing. What does life hold for her in all this turbulence and chaos? Unravel the mystery and discover the huge conspiracy through thought-provoking dialogues and ingenious level design. <br/><br/>■It’s all about combos<br/>Meng Nv is a master wielder of twin blades, claymore and is an excellent archer as well. You can cycle through the three weapons any time you want. Switching weapons will deal extra damage to enemies and activate special moves. Always stay vigilant in battles and use this feature to your advantage. Make powerful combos by switching weapons.  The mysterious “Blood Sigil” system enhances character stats, so that you can always fight the way you want. <br/><br/>■Innovative “Inspiration”system<br/>Meng Nv has gone through a lot and has a complicated personality.  We believe that she is more than a mere character you control. Inspiration System lets you know what she is thinking as the game progresses. At some critical moments, she will ask you to make choices for her, which will have drastic impact on how the story goes. We will perfect “Inspiration” system in future updates.<br/><br/><br/><br/>RKTime and Long Mobile are two new game developers based in Chengdu, China. <br/>Thank you for supporting Anonymous Me, our first game on Steam!<br/>Anonymous Me has gone through overhaul and delay for many times. Now it finally sees the light of day! It’s still an Early Access release. We welcome any feedback and suggestions from you! <br/><br/><br/>Thank you all for your love and support!", "metacritic": null, "released": "2017-10-10", "tba": false, "updated": "2021-04-12T13:30:50", "background_image": "https://media.rawg.io/media/screenshots/09a/09abc11652144a8b6c6d9b4eeabab115.jpg", "website": "http://am.dragonest.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 466, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS"], "developers": ["RKTime", "chengdu longyuan Network Technology Co"], "genres": ["Action", "RPG"], "publishers": ["Chengdu longyuan Network Technology Co.Ltd", "chengdu longyuan Network Technology Co"], "esrb_rating": "Teen"}