{"id": 469372, "slug": "dreadful-disgusting-dungeon-of-death", "name": "Dreadful Disgusting Dungeon of Death", "name_original": "Dreadful Disgusting Dungeon of Death", "description": "Easy to pick up. Hard to master.\r\n<p>This is a very punishing platformer that requires a lot of skill and/or patience to finish. It's made mainly to give me more experience as a game developer, so your honest feedback means (almost) as much as any tip you can spare. If I make enough money, I will publish the game to Steam as well, as a free-to-play game.</p>\n<p>\n</p>\r\n\r\nThe game's UI is designed to suit <strong>streamers/youtubers</strong> and <strong>speedrunners</strong>.\r\n<p>The UI gives the viewer all critical information at all times, and the checkpoint time of every room is always visible, and the final time is very clearly visible when the player finishes the game.</p>\r\nLow impact, high accessibility.\r\n<p>The game is designed to have a low impact on your device. The game reuses a lot of its sprites for different objects, and it only contains three sound files, without any music. This is because the game is supposed to run smoothly on as many devices as possible, and take up as little space as possible on your hard drive.</p>\n<p>The game can be played with either a <strong>keyboard </strong>or a <strong>gamepad</strong>.</p>\n<p>If you are unable or unwilling to pay, please consider leaving a comment with some feedback. I believe that feedback from actual players is the best way to improve future game projects. Enjoy.</p>", "metacritic": null, "released": "2020-07-15", "tba": false, "updated": "2020-07-17T03:53:26", "background_image": "https://media.rawg.io/media/screenshots/fd1/fd1a50478c5c7bb8544f913962271d7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fredberger"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}