{"id": 469440, "slug": "the-last-hope-itch-eitanstaro575", "name": "The Last Hope (itch) (eitanstaro575)", "name_original": "The Last Hope (itch) (eitanstaro575)", "description": "<p><strong>Historia:  </strong> “The Last Hope” transcurre en una Nueva York futurista, nos cuenta la historia de un joven llamado Mishu Shikami (protagonista principal), amante de la música - le gusta tocar el piano y fabricar melodías, con el fin de generación musical, y hacer que la gente disfrute de su música.</p>\n<p>En una zona alejada de la ciudad había una planta nuclear, donde el jefe de la planta, el doctor William Shepherd (una persona poderosa y arrogante) y sus seguidores realizaban experimentos de mutaciones, donde probaron con distintos tipos de animales y de distintas formas, hasta que finalmente llegaron al resultado final: inventaron el “Virus X”, un virus potente que se transmite por el aire y afecta a la sangre, haciendo que la víctima se transforme en un monstruo salvaje que se le denomina Mecromer, con forma alienígena.</p>\n<p>El virus fue liberado sobre toda la ciudad por medio de helicópteros, y de a poco la gente se fue transformando en criaturas salvajes, causando que la ciudad se vea inmersa en destrucción y caos. Mediante estudios de algunos científicos sobrevivientes, llegaron a la conclusión de que el virus no afectaba a todos, sino solo a la gente que era de sangre tipo azul y roja, que eran las que más predominaban en la ciudad. La gente que era de sangre tipo verde se resistía al virus, pero solo un porcentaje muy bajo de la población tenía ese tipo de sangre. Mishu es de las pocas personas que tiene sangre del tipo verde.</p>\n<p><strong>Objetivo:</strong></p>\n<p>Está Mishu luchar contra los Mecromers dispersos por la ciudad, utilizando su equipo musical, para finalmente ir donde el causante de la infección, el Doctor William Shepherd, acabar con él y salvar la ciudad.</p>\n<p><strong>Controles </strong><strong>:</strong><br/></p>\n<p>- Flechas: izquierda (moverse a la izquierda), arriba (saltar), derecha (moverse a la derecha)</p>\n<p>- S (disparar)</p>\n<p>- P (pausa)</p>\n<p>- C (continuar)</p>\n<p>¡Mucha suerte aventurero / a; )!</p>", "metacritic": null, "released": "2020-07-15", "tba": false, "updated": "2020-07-17T04:13:47", "background_image": "https://media.rawg.io/media/screenshots/770/770f2386e3d21e269812ae167e6adb09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["eitanstaro575"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}