{"id": 469590, "slug": "shifter-minotaurbattlemaster", "name": "Shifter (MinotaurBattleMaster)", "name_original": "Shifter (MinotaurBattleMaster)", "description": "<p>I worked on Shifter as a part of a ten person team for eight weeks for my minor production assessment. Shifter is a puzzle platformer with a dark vibe! You play as a fallen king of darkness on a quest to regain your dark powers!</p>\n<p>Click Here to view the team Shifter page!<br/></p>\n<p>In this project I was one of two level designers. About half way through the project our producer had to step down due to a personal matter. Someone needed to take up the job, so my role shifted to accommodate his responsibilities. My producer skills are not as developed as my level designer skills, but I think I performed my new duties well:</p>\n<ul><li>Stayed on top of team tasking using HackNPlan.</li><li>Validated and implemented art assets in engine.</li><li>Programmed simple code to preserve the velocity of the dedicated Programmers progress on more important and complex code.</li><li>Ensured everyone's voice was heard when determining the direction of the project.</li><li>Performed gap analysis and did my best to fill knowledge gaps so that my peers could perform their tasks easier.</li><li>Facilitated external testing and then recommended re-scoping and shifting task priorities based on the feedback I collected.</li><li>Led the scrum stand up meetings several times a day to maintain velocity with our quick iteration periods as we moved past our milestones.</li><li>Led bug hunting sessions towards the end of the project with the goal of everyone identifying things to be fixed or otherwise polished before our deadline.</li></ul>\n<p>I had not previously taken up a leadership role of any kind, so this was a rather sudden learning experience! Some of my challenges were being over indexed, maintaining awareness of everyone's tasks and responsibilities, maintaining awareness of timetables, and staying confident in the face of new and unfamiliar duties. I have to admit I struggled the most with that last challenge.</p>", "metacritic": null, "released": "2020-07-15", "tba": false, "updated": "2020-07-17T04:59:57", "background_image": "https://media.rawg.io/media/screenshots/164/1649af33098f74b65ebd68fbc33dc604.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MinotaurBattleMaster"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}