{"id": 469732, "slug": "across-the-demon-realm-trainer", "name": "Across the demon realm (Trainer+++)", "name_original": "Across the demon realm (Trainer+++)", "description": "<p><strong>Important news flash:</strong> My last game a Yandare visual novel TOKYO LOVE+ is on kickstarter: https://www.kickstarter.com/projects/957008919/tokyo-love<br/></p>\n<strong>-------</strong><p><strong>This is a version of the game with a TRAINER (with a screen similar to a trainer from the golden age of the Amiga) where you can choose, using F1, F2, F3...to start with 99lives, 99 food rations and 99 spare wheels.</strong></p>\n<p>Scheduled to be released on PC(Windows) for May 2020, Across the Demon realm<br/> is a one-man project inspirated by the Oregon trail, it's an adventure <br/>with procedurally generated events. I may potentially bring the work to <br/>other consoles as well, given enough support and interest!</p>\n<p>\"Hi Everybody, I'm Choloco, creator of many\r\n 2D games who were on Kickstarter. I'm aware that most of my old games \r\nwere not very good...  This time, it's decided, this new game will take \r\nthe royal road and I will put all my abilities in it! Across the Demon realm\r\n will be an ambitious and brutal video game with refined 2D graphics \r\npresented in a rigorously-period 16 bit style. I spend a lot of time \r\nworking on this game I really believe in it and I hope you will believe \r\nin Across the Demon realm too\" </p>\n<p>Escort refugees through kingdoms colonized by demons and smash your enemies with Perfect Attacks! (or simply knock them out). </p>\n<p> Helena: Traumatized by the many invasions \r\nof the demons, this young woman became completely voiceless. We don’t \r\nknow where she comes from but she does not seem indifferent to your \r\ncharm.</p>\n<p>Giselle:This poor woman seems to have lost \r\nher mind. She pretends to be a princess and that her prince is waiting \r\nfor her in Scotbritain.</p>\n<p>Boris: An old man who was a Templar during the Crusades but he found Jordarak so beautiful that he stayed there... until today.</p>\n<p>+ another mysterious one to unlock later.</p>\n<p>Various endings according to which survivors will arrive at the end of the journey.</p>\n<p>Before to start your journey, you need to select a skill:</p>\n<p>-The Blood of Jesus : to be sure to respawn one time cause without this skill the respawn is random (it depends that the mood of the Death! )</p>\n<p>-Treasure Hunter : to find more items!</p>\n<p>-The eye of the Asclepios : to keeps some diseases away but this has no effect on \"divine diseases\" like stigmas (you will have to find the remedy yourself)</p>\n<p>-Master of the sacred fire (The famous spell of the legend about the 3 marauders) : keeps the wolves away.</p>\n<p>-Supplementary food rations : 5 food rations instead of 2.</p>\n<p>-Seventh son of the seventh son : 7 lives instead of 3 but no ending when you finish the game!</p>\n<p>...or no skill (If you already finished games like Ghosts’n Goblins and Dark Soul without losing 1 single life!! )</p>\n<p>And start your journey: </p>\n<p> Keep an eye on the amount of food rations and spare wheels and get ready to fight regularly.</p>\n<p>In addition to fighting you will have to deal with other dangerous \r\nsituations. Pray that diseases and wolves do not decimate your crew.</p>\n<p>Like in all good trips, pleasant moments like the camp or fishing alternate with fights against gigantic bosses!</p>", "metacritic": null, "released": "2020-07-14", "tba": false, "updated": "2020-07-17T05:40:53", "background_image": "https://media.rawg.io/media/screenshots/f9d/f9d834a8276c09d16630acf5ae1e4ef3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Choloco"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}