{"id": 469890, "slug": "survival-games-itch", "name": "Survival Games (itch)", "name_original": "Survival Games (itch)", "description": "<p><strong>Working Title</strong></p>\n<p>\n</p>\n<p><strong>NOTE</strong>: The prologue was significantly rewritten, and some additional choices added. Old save will not likely work properly.</p>\n<p>Cover Image: Pixabay - junniferbaya340</p>\n<p><em>This game is free to play, period.</em> I have no plans to charge or accept donations for it. Just kick back and hopefully you will enjoy it. As it's very early access, I am focusing on trying to hone in on the interface and menu. Any hints/ideas/etc. are welcome in the comments below. Expect a lot of tweaks, revamps, and optimizations as it goes. I am working with the aim on not inadvertently invalidating prior save games.</p>\n<p>Intro<br/></p>\n<p>You awaken unsure of where you are, or even who you are. Something has gone wrong, as your entire body screams in agony. The area you are in, is in ruin but is the world? Will you be able to piece together who you are? Where you are? Why do so many people seem to know you? Why don't you recognize anything or anyone? Can everyone be trusted? Are any out to play you for their own ends? Will some be out to ruin you?<br/></p>\n<p>Background</p>\n<p>This is an interactive fiction game created using Twine and Sugarcube. Currently it is just the prologue (maybe 2k words) and is to prepare for Chapter 1. As an interactive fiction, this game is somewhat on rails; you will be along for the ride but will be able to customize the MC, some NPCs, parts of the world, and some freedom in how to react to situations. A 'Character Profile' develops and will track some personality decisions, as well as how other NPCs might perceive you. There may even be some romance options in the pipeline.</p>\n<p>As of right now, there are no 'your character is dead' game over screens. It wouldn't make sense for that in the prologue, and I don't anticipate it happening at all. It's not a choose your own adventure, per se, so you should be able to get to the end. But who will survive? Will you leave the world a better or more chaotic place? Do the ends justify the means? A snarky retort to a sarcastic character might be just what is needed to motivate them that a gentle word won't. Irritate or anger them and they might just decide to plot to get you. Everyone has their own motivations, and they won't all be yours.<br/></p>\n<p><strong>Important Notes</strong></p>\n<p>Saves (in-browser or offline) are stored in the browser cache. The game must be played in the same browser to continue progress. Clearing the cache will destroy the saves.</p>\n<p>If you want to change browsers or backup the saves, use the 'Save to Disk' in the Save menu. With this you can back up all your saves to a file that you can store anywhere for this game. Using 'Load from Disk' in the Save menu will let you import the file you backed up.</p>\n<p>Saves will work between chapter releases, so hold onto them if you want to keep your progress.</p>", "metacritic": null, "released": "2020-07-13", "tba": false, "updated": "2020-07-17T06:19:25", "background_image": "https://media.rawg.io/media/screenshots/ae3/ae3d43fe866d3b1eec6ca63319eabf07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cooldevo"], "genres": [], "publishers": [], "esrb_rating": null}