{"id": 469963, "slug": "tower-tops-a-puzzle-game", "name": "Tower Tops - A puzzle game", "name_original": "Tower Tops - A puzzle game", "description": "<p>Inpired by Gameboy games and the vintage game experience, I give you Tower Tops, a short (12 level) puzzle game in which you play as part of the city defenses and must rush to the tower's top to ring the warning bell, signaling the attack on your city.</p>\n<p>Whilst making your way to the top of the tower, the castles skeletons appear and will kill you on touch, be smart, be precise and count your moves because you cannot go back.</p>\n\n\n<p>This game is a fun short experience that is easy to learn and get into, whilst also being mechanically rich enough to entertain. The movement system is both a restriction and a challenge, but leads to much richer levels because of the considerations needed.</p>\n\n<p>In later levels teleportation is utilized, theses allow for hopping between sections of the map, due to the nature of the game and the intended Gameboy feel, these portals are tiles on the map which you must walk into. Like with all tiles there is no going back the way you came.</p>\n\n<p>All sprites in the game are 8x8 pixels and the game uses only four colours in total, which are all shades of green. </p>\n\n<p>If you download and liked playing the game donate as a showing of appreciation for my work, weeks have gone into developement, so to get more content and updates to the game, do support a creator. Thanks!</p>\n\n<p>Now to the fun part:</p>\n\n\n<ul><li>Use the arrow keys to move around on the map,</li><li>Navigate around enemies</li><li>And collect all keays on each level to progress</li><li>Oh, and the floor crubles behind you, so do be careful.</li></ul>\n<p>Below you will find a list of my references and sources, this is credits for the people who inspired me.</p>\n<p>The game Tower Tops is made by a solo developer, and with the Godot engine, and with the pixilart.com drawing tool.</p>\n<p> The soundtrack is by Kenvin Macleod (though pitched down)</p>\n<p>Sound effects are from freesound.org (also pitched for the correct feel</p>\n<p>Color inspiration is from this small game app4smart.com/en/8524-tiny-dangerous-dungeons.html \"<em>Tiny Dangerous Dungeons</em>\" it too uses the Gameboy look, though not the feel.</p>", "metacritic": null, "released": "2020-07-13", "tba": false, "updated": "2020-07-17T06:35:05", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fcc3f127d0731c183286f55bbe74824.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tail Clap Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}