{"id": 46999, "slug": "frontiersio", "name": "Frontiers.io", "name_original": "Frontiers.io", "description": "Conquer as much territory as you can with your hero and watch for the opponents or you’ll be destroyed. The opponents are evil and all they think about is destroying you by touching your path and expanding their territory by conquering larger space. <br/>\n<br/>\r\nIf someone crosses your path before you fully enclose an area, you'll die. If you cross your own path, you'll die. If you hit a wall, you'll die. <br/>\n<br/>\r\nYou just need to swipe in different directions with arrow keys to move, and to claim a territory you just need to close the area. The game continues until you own the whole territory. To steal area from your opponents, you need to run through their territory and close as much area as possible. But, you should be very careful, as you just have One life and you’ll lose it as soon as someone hits your tail. <br/>\n<br/>\r\nSteal their entire territories and conquer the largest space. <br/>\n<br/>\r\nFeatures at a Glance:<br/>\r\n•\tEasy to learn, hard to master<br/>\r\n•\tSmooth gameplay<br/>\r\n•\tWonderful graphics with cool sound effects<br/>\r\n•\tCollect gems<br/>\r\n•\tConquer the largest territory with your hero<br/>\r\n•\tSet different heroes for your profile <br/>\r\n•\tFun for all ages<br/>\n<br/>\r\nConquering territories is really easy as you just need to close an area. But the hard part is to keep it from being stolen and destroy the opponents by touching their path before being hit and destroyed by them. So, sometimes you need to decide fast, and sometimes you just need to wait for the perfect moment to increase your acquired territory and destroy the opponent. The more opponent you destroy, the more gems you’ll get to collect.", "metacritic": null, "released": "2017-10-05", "tba": false, "updated": "2019-08-28T22:04:33", "background_image": "https://media.rawg.io/media/screenshots/fc0/fc0b2337fa1b9d204f290078dcaefe8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boogygames Studios"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Boogygames Studios"], "esrb_rating": null}