{"id": 470224, "slug": "the-game-of-life-2-more-choices-more-freedom", "name": "THE GAME OF LIFE 2 - More choices, more freedom!", "name_original": "THE GAME OF LIFE 2 - More choices, more freedom!", "description": "Limited time offer! Get 30% off THE GAME OF LIFE 2, the brand new contemporary sequel to THE GAME OF LIFE! Get more choices and more freedom, for less! Ends 22nd July!<br/><br/>For 60 years THE GAME OF LIFE board game has shown us how to win at growing up. Now, THE GAME OF LIFE 2 digital board game introduces up-to-date life choices and new crossroads to the traditional mix! Will you be a Video Blogger or an Engineer? What roads will your friends and family take? Play to find out on mobile and tablet!<br/><br/>Customise your peg, hop in your eco car and race your friends and family through THE GAME OF LIFE 2 game. With a thousand new ways to live, and money no longer the only path to success, what life will you choose? In this mobile board game you find your happiness, whether that means money and fame, or academic fulfilment and a dozen cats! Become a Pop Star with 5 dogs and a pool house, or a Brain Surgeon with multiple PhDs, a spouse and 3 kids. You choose!<br/><br/><br/>Features<br/>- A CONTEMPORARY SEQUEL TO HASBRO’S CLASSIC BOARD GAME - THE GAME OF LIFE 2 drives the original from yesterday to today<br/>- AD FREE - Don’t worry about flashy adverts and tempting paywall bonuses, this is a safe environment for kids and adults both online and offline<br/>- TWO MARVELLOUS WORLDS - Play the ‘Classic’ eco city, and seek out the ‘Fairytale Kingdom’ with THE GAME OF LIFE 2 Season Pass<br/>- SINGLE PLAYER -  There’s no such thing as playing alone when you take on our challenging AI<br/>- ONLINE MULTIPLAYER - Distance doesn’t interrupt play when you connect with fans around the world or invite friends and family to a private game<br/>- PASS &amp; PLAY - No internet? No problem! Simply pass a single device between up to 4 players for an offline wifi-free experience<br/><br/>How to play<br/><br/>CHOOSE and CUSTOMISE your character!<br/>A life journey calls for one jaw-dropping outfit! Customise your pink, blue or brand newly available purple peg with a style all of their own.  <br/><br/>START at the beginning!<br/>Teen life on the board might seem daunting, but there’s no pressure! THE GAME OF LIFE 2 game starts when big decisions really begin, and the choices just keep coming!<br/><br/>Choose your LIFE PATH! <br/>Your life is in your hands! Get married, earn qualifications, gain fame and adopt pets. In THE GAME OF LIFE 2 digital board game the road has many twists and turns, and crossroads can now grant second chances - so it’s never too late to get married or earn that degree!<br/><br/>Money vs Happiness, RETIRE your way! <br/>Are you in it for the millions or the good times? THE GAME OF LIFE 2 game is about so much more than money. Gain attributes for happiness, wealth and knowledge, and the final score will sum up your achievements! <br/><br/>Earn REWARDS to UNLOCK new items!<br/>Unlock new characters, outfits and vehicles by playing the game and earning rewards! Collect 60 happiness points, travel 100 spaces, collect $5000; each accomplishment unlocks a puzzle piece. When you collect 6 puzzle pieces you can unlock a bonus item, and there are eight to unlock in each world!<br/><br/>EXPLORE marvellous worlds with THE GAME OF LIFE 2 Season Pass!<br/>When you’re done finding success in the eco green cityscapes, there are more worlds to explore as part of the Season Pass! Take an enchanted quest through the ‘Fairytale Kingdom’. Study at the Wizard Academy or become a Knight in shining armour. THE GAME OF LIFE 2 Season Pass includes 2 marvellous worlds…<br/><br/>...with additional worlds coming soon!", "metacritic": null, "released": null, "tba": false, "updated": "2020-07-20T02:22:12", "background_image": "https://media.rawg.io/media/screenshots/bb4/bb401786ed749467126dfc00c9731a21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Marmalade Game Studio"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}