{"id": 470223, "slug": "black-hole-hero-vice-vegas-rope-mafia", "name": "Black Hole Hero: Vice Vegas Rope Mafia", "name_original": "Black Hole Hero: Vice Vegas Rope Mafia", "description": "This game is a city simulator in third person view, where you drive a car, motorbike, airplane etc. You play as a cyborg and whole city fears you. You will fight various star mafia gangsters from America, Russia, China, Mexico, Japan etc. The style of city is similar to Miami of Las Vegas but actualy it's New York. Become a chief on the streets of criminality in town. <br/><br/>You are waiting for the most hotspots of criminality in Vegas disctrict. The game contains fully Open world Environment. You can also buy a lot of things in a shop to help you complete missions and release the city from all mafia sinners. Most of the missions will be on streets, some will be in chinatown district and other gang lands etc. <br/><br/>Are your ready for great criminal theft adventure? Be ready to rob, kill, shoot and fight! Try out all the supercars and bikes. Stealing cars, evading cops, racing through streets, and shooting down other gangs… Do you have enough guts to rise to the top of the criminal piles?<br/><br/>Explore the big city, go off-roading in the mountains, steal and drive supercars, shoot from guns and more in this free open world game! Make stunts on a bmx or find an ultimate F-90 tank or devastating battle helicopter.<br/><br/>• 20 adventure missions<br/>• 40 different cars - army vehicle models, Helicopter, Air fighter, etc.<br/>• skateboarding<br/>• Visually stunning, HD quality graphics, character<br/>• Huge variety of guns to buy<br/>• Off road terrains to explore<br/>• hair dresser mini game", "metacritic": null, "released": null, "tba": false, "updated": "2020-07-20T02:21:27", "background_image": "https://media.rawg.io/media/screenshots/2ef/2efd0fd13c0ac907ead1244bdcdfbcf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HGames-ArtWorks"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}