{"id": 470209, "slug": "my-home-design-modern-city", "name": "My Home Design - Modern City", "name_original": "My Home Design - Modern City", "description": "Welcome to Modern City! Your new favorite home design game set against a stunning NYC background.<br/><br/>Take this chance to work side by side with star interior designer Chloe Williams and her business partner Liam Gold. From successful career women to newlywed couples to families, clients are on their way to meet Chloe and Liam right now!<br/><br/>Help them design trendy kitchens, cozy living rooms, relaxing bedrooms and more to live the life of their dreams! Solve fun match-3 puzzles to collect coins and use them to select furniture, decor items and more! These lucky clients have very different personalities, needs and ideas but they have one thing in common: They all have high expectations for you to design an amazing home! Can you help them create spaces to relax, enjoy and spend quality time? Because after all a house without character is just a house. Help your clients to turn these houses into sweet designer homes.<br/><br/>It's not going to be easy. You'll have to work and play your way up from the bottom, makeover different rooms and places to become a real designer and put a smile on your clients' faces. Do you have what it takes to remodel, decorate and furbish dream homes and become a household name in the home design game world?<br/><br/>Here's how to do it:<br/><br/>Meet interior designer Chloe and Liam. Couples, singles and families, all kinds of clients are waiting for you!<br/><br/>Design, renovate, remodel kitchens, living rooms, bedrooms and more in Modern City! Choose furniture and decor according to your style and preferences. Simply tap to decorate and create trendy places in the city.<br/><br/>Exciting and addictive Match-3 puzzle games! Play puzzles to collect coins and use them to create your perfect home design!<br/><br/>Enjoy witty and fun conversations among interior designers and clients!<br/><br/>Express yourself and nurture your interior design skills! Plus, find inspiration for your own home makeover!<br/><br/>Play for free and offline!<br/><br/>New episodes and match-3 puzzle levels coming out soon!<br/><br/>Are you into the city life? Guam, Hawaii and the Caribbean won't do the trick for you? Come to NYC and play Modern City! Find inspiration, collect high-quality furniture, and decorate with enchanting colors and patterns. Build and design homes and make dreams come true in this match-3 puzzle and home design game! Create a home you'll never want to leave! <br/><br/><br/><br/>*Please note that [ Modern City ] saves your progress on your device. Data will be reset if you delete the app or change your device.*<br/><br/>------------------------------------------------<br/><br/>DEVELOPER INFO<br/><br/>Are you into home design? Puzzle games? CookApps Playgrounds fan?<br/><br/>Join us on Facebook for fun stuff and news about your favorite games!<br/><br/>https://www.facebook.com/PlaygroundsTeam/", "metacritic": null, "released": "2020-04-27", "tba": false, "updated": "2020-07-20T02:16:00", "background_image": "https://media.rawg.io/media/screenshots/907/90753dad36f2ccaa4b34fb5b63f0bfa1_po2Fzxx.jpg", "website": "http://www.cookapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CookApps"], "genres": ["Simulation", "Puzzle"], "publishers": ["cookapps"], "esrb_rating": "Everyone 10+"}