{"id": 47039, "slug": "mirrors", "name": "Mirrors", "name_original": "Mirrors", "description": "Mirrors is a strategy puzzle game where you play as an adventurer navigating your way through the tombs of ancient Egypt. By using the power of the sun you must direct light by reflecting it off various mirrors onto an orb which will activate the door into the next tomb. While doing this you must deal with a range of obstacles and traps that are in place to hinder your progress and keep you from reaching the Pharaohs treasure.<br/><br/><strong>Game Modes</strong><br/>Mirrors currently has a variety of different game modes and with your support we plan to implement a few others and take the existing game modes even further.<br/><br/><strong>Adventure Mode</strong><br/>In Adventure Mode you must progress through a various set of tombs until you reach the final tomb where you will find the pharaohs treasure. Each level requires a new mind-set to complete it in the best way possible and receive the three Canopic Jars available as the reward. Upon completing a treasure hunt you will unlock another set of tombs which come with a variety of new tombs and obstacles. Can you beat them all?<br/><br/><strong>Time Attack</strong><br/>In Time Attack you start with a limited supply of light. Solve as many tombs as you can before your time runs out. Upon completing a tomb you will be awarded additional time based on how well you completed the tomb that you are in, plus bonus time for using every mirror within the tomb. How far can you go?<br/><br/><strong>Level Creator</strong><br/>We have also added a level creator which will allow the creation and sharing of tombs. It’s really easy to use and the possibilities are endless! Simply tap the assets from your dashboard and place those within your tomb test it and when you’re happy save it and share it with your friends.", "metacritic": null, "released": "2017-10-11", "tba": false, "updated": "2019-08-28T22:04:31", "background_image": "https://media.rawg.io/media/screenshots/6d3/6d3c7f81c3f56842073547c837cefbbc.jpg", "website": "http://www.monocool-interactive.com/mirrors", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5}, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Monocool Interactive"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Monocool Interactive"], "esrb_rating": null}