{"id": 47043, "slug": "ticket-to-ride-first-journey", "name": "Ticket to Ride: First Journey", "name_original": "Ticket to Ride: First Journey", "description": "A FANTASTIC WAY TO DISCOVER THE TICKET TO RIDE SERIES<br/>Ticket to Ride: First Journey is part of the famous Ticket to Ride board game series. In this version, players can embark on their very first ride and visit major European and American cities. The game is easy for the whole family to play together. The youngest players can now challenge the most experienced in Ticket to Ride First Journey.                                                                                           <br/><br/>CONNECT THE CITIES TO GET YOUR 6 TICKETS!  <br/>Collect train cards, claim routes on the map and try to connect the cities shown on tickets. Each player starts with four colored train cards and two tickets. Each ticket shows two cities, and the aim is to connect those two cities with a contiguous path of your trains in order to complete the ticket.<br/>On a turn, you either draw two train cards from the deck or discard train cards of matching color to claim a route between two cities. Once you complete a route, you will be given a new one. The first player to complete the six tickets wins. It takes a little risk but it's lots of fun!                                                                                                                                                                                      <br/>ENJOY AN IMMERSIVE JOURNEY                                                              <br/>Have fun through original illustrations and funny animations once you connect the cities. Learn more about the different cities and their iconic monuments.<br/>Share this adventure until 4 players on the same device thanks to the pass and play mode. If you want to play in solo, you can just play versus the AI.<br/>                                  <br/>GET EXCLUSIVE REWARDS TO BUILD A COLLECTION OF CITY PICTURES<br/>Receive a golden ticket when winning the game and add your reward picture to your collection. In this digital adaptation, challenge yourself against the AI or play with your friends, thanks to the pass and play mode! With its easy rules, beautiful animations and illustrations, it is an ideal game for the whole family when they are ready for an adventure!<br/><br/>FEATURES:                                                                                          <br/><ul><li>Family friendly game play <br/></li><li>Solo mode                                                         <br/></li><li>Pass &amp; Play mode to play on the same device with family and friends (4 players max)<br/></li><li>Unlock rewards and build your collection of city pictures  <br/></li><li>Rediscover the famous Ticket to Ride board game with this simplified version</li></ul>  <br/><br/>Languages available: English, French, German, Italian, Spanish, Korean", "metacritic": null, "released": "2017-09-27", "tba": false, "updated": "2023-12-18T17:32:43", "background_image": "https://media.rawg.io/media/screenshots/bfc/bfcdbc0a64ce19da4ce4cac8b7d2d985.jpg", "website": "http://www.asmodee-digital.com/en/ticket-to-ride-first-journey", "rating": 2.53, "rating_top": 3, "added_by_status": {"yet": 69, "owned": 1226, "beaten": 1, "dropped": 6}, "playtime": 1, "achievements_count": 9, "ratings_count": 38, "suggestions_count": 175, "game_series_count": 1, "reviews_count": 38, "platforms": ["Android", "PC", "iOS", "macOS"], "developers": ["Plug In Digital", "Asmodee Digital", "Payoff Technologies"], "genres": ["Strategy", "Board Games", "Casual", "Family"], "publishers": ["Asmodee Digital", "Days of Wonder"], "esrb_rating": null}