{"id": 47044, "slug": "mercury-fallen", "name": "Mercury Fallen", "name_original": "Mercury Fallen", "description": "The game is in the early access alpha stage and is not yet feature complete. Please read the Early Access info at the top for more details.<br/><br/>Manage a group of intrepid colonists as they attempt to survive on an alien world. Automated machine construction was sent ahead to create the underground Mercury Facility, but something has gone wrong. Your colonists awake to find the facility in ruin. Expand the colony, grow crops, build structures, recover technologies and discover lost secrets to ensure the survival of your new home away from home.<br/><br/>Mercury Fallen is a simulation game which focuses on building, crafting and exploration. The choices you make will decide the fate of your colony.Dig For Resources<br/>Mine the surrounding area for valuable raw resources. Refine raw materials for use in facility expansion.Grow Crops<br/>Grow crops for both food and refined materials.Manage Colonists<br/>A healthy colonist is a happy colonist. Manage colonist job roles, injuries and ailments. Each colonist may have their own set of Quirks which affects a colonist in various ways. Colonists screen allows for easy management of job roles and monitoring over all facility health.Power &amp; Water<br/>Design and layout your power and water lines. Manage fuel consumption and strategically place power and water generators to ensure resources can cover the distance to devices in need.Features<br/><ul><li>Handle colonists’ injuries and ailments<br/></li><li>Manage colonists’ jobs and needs<br/></li><li>Refine materials at various stations<br/></li><li>Design and build facility rooms, machines and decorations<br/></li><li>Find additional colonists &amp; robots hidden in collapsed areas of the map<br/></li><li>Full control over colonist names, jobs and outfit colors<br/></li><li>Recover corrupted data to learn new blueprints &amp; recipes<br/></li><li>Take advantage of procedural generation, so that each new game is a new experience.<br/></li><li>Grow clones and find additional colonists &amp; robots hidden in collapsed areas of the map</li></ul>", "metacritic": null, "released": "2017-10-16", "tba": false, "updated": "2019-08-28T22:04:31", "background_image": "https://media.rawg.io/media/screenshots/a81/a81f66495a696b88e80ec5c6dc3499eb.jpg", "website": "http://www.mercuryfallen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Nitrous Butterfly"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Nitrous Butterfly"], "esrb_rating": null}