{"id": 47056, "slug": "supposedly-wonderful-future", "name": "Supposedly Wonderful Future", "name_original": "Supposedly Wonderful Future", "description": "It's 2046, and life has never been better. Humanity is thriving, technology is booming, poverty and hunger are all but eradicated. Wars and unrest are the talks of the past; the world is as united as it's ever been. Aging can be stopped while terminal illnesses are conquered one by one – you don't have to die if you don't want to. Too bad many folks never lived to see the day.<br/><br/>Michael is one of those folks, a bright twenty-something destined to meet his end before wonders of science can save him. But maybe it doesn't have to be this way. Back in 2016, an unlikely visitor appears, claims that she has traveled back in time, and that Michael can join them in the future – if only he does some work first…Features<br/><ul><li>A story-focused experience that plays like an adventure, reads like an RPG, and feels like a visual novel.<br/></li><li>An old-school dialogue system, equally good for slowly learning every little detail or quickly moving through the main plot.<br/></li><li>Five chapters plus prologue, united in a single narrative but diverse and self-contained enough to tell little stories of their own.<br/></li><li>Enough jokes and references to forget about the daily horrors of human condition. For a little while. Probably.<br/></li><li>Approximate word count: 125,000. Play time: 4 to 8 hours (depending on your reading speed and thoroughness).<br/></li><li>An extensive and atmospheric electronic soundtrack by the amazing artists of the Creative Commons community.<br/></li><li>A number of UI customization options to keep those walls of text as readable for everyone as possible.<br/></li><li>Modest system requirements (a decade-old PC should do).<br/></li><li>You'll have some choices, but they don't really matter. Or do they?</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:31", "background_image": "https://media.rawg.io/media/screenshots/64a/64a8fca77d4968a130cc879a1fb7bcfe.jpg", "website": "http://supposedlywonderfulfuture.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 1}, "playtime": 5, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dmitry Zagumennov"], "genres": ["Adventure", "Indie"], "publishers": ["Dmitry Zagumennov"], "esrb_rating": null}