{"id": 470546, "slug": "prescription-bottle-tycoon", "name": "Prescription Bottle Tycoon", "name_original": "Prescription Bottle Tycoon", "description": "<ul><li>Buy Prescription Pill bottles, and then clean off the label to increase their resale value!</li></ul>\n<ul><li>Hire employees to work in your shipping and receiving department!</li></ul>\n<ul><li>Research new methods of label cleaning! Click and Drag the methods onto the cleaning machine to customize you Pill Bottle cleaning style!</li></ul>\n<ul><li>Search for the FOUR forbidden Prescription Pill Bottle Cleaning Techniques! They will dramatically increase the price of a bottle!</li></ul>\n\n<p>Created for the Random Wiki How Jame  - my theme was: \"How to remove a paper label from a plastic prescription bottle\"</p>\n<p>https://www.wikihow.com/Remove-a-Paper-Label-from-a-Plastic-Prescription-Bottle</p>\n\n<p>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</p>\n<p>NOTES:<br/></p>\n<p>A clicker/tycoon game.</p>\n<p> Click \"Buy\" and wait for your workers to move the bottle to  the machine.</p>\n<p>The Machine will clean the bottle based on the pink crates placed on top of the buttons.</p>\n<p>The workers will move the cleaned bottle to the right side of the screen where it can be sold.</p>\n<p>Hire more workers, and purchase auto-buyers/sellers to speed up this process. <br/></p>\n<p>The machine can only clean one bottle per second, but upgrades can be purchased.</p>\n<p>There are four specific combinations of techniques that you must discover to complete the game. Bottles cleaned using these methods will sell for much more. Hints for discovering these combinations can be found on the wiki how page, and in on of the screenshots.</p>\n\n<p>ISSUES:</p>\n<p>It is very possible to soft lock the game by running out of money early. If you find yourself in a position where there are no bottles on screen, and you cant afford to buy another, you will have to reload the page. There is currently no in game restart button.</p>\n<p>Bottles will appear in the general vicinity of where they are supposed to be, but regularly end up off screen. It might be worth clicking \"Sell\" even if you don't see anything over there.<br/></p>\n<p>The language for auto-buyers/sellers is quite vague, it is referring to the fact that</p>\n<p>1 bottle will be bought or sold every X seconds/</p>\n\n<p>I have no idea how long this game takes - I did not have time to fine tune the progression or really play test thoroughly.<br/></p>\n\n<p>All art and programming done by me.  Fonts from Chevy Rays Pixel Font Pack.<br/></p>\n<p>Created using Godot Engine.<br/></p>", "metacritic": null, "released": "2020-07-19", "tba": false, "updated": "2020-07-20T03:30:31", "background_image": "https://media.rawg.io/media/screenshots/38f/38f3cd50d769e79b96219ae8709405f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MatthewLacker"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}