{"id": 47065, "slug": "the-afterwoods", "name": "The Afterwoods", "name_original": "The Afterwoods", "description": "We're a small indie studio that's been working day and night to achieve a big dream: deliver an engaging Virtual Reality RPG oozing with atmosphere, free movement, and exciting battles. So, a long time ago in a place far away...<br/><br/>When demons attack, a young mage receives a mysterious weapon through an unlikely conjuration. The bad news is that no one know how it works. With no time to waste, the mage embarks on a perilous journey to uncover its secrets, find the missing pages from the Book of Spells, and save the realm from the invaders.  <br/><br/>Set in a dark, creepy, forest with gigantic trees and muddy gorges, The Afterwoods strikes fear in brave hearts. As the mage gains experience, the focus shifts to skilled combat and smart decisions, such as choosing the best attack or finding the right route. Become a great explorer, an expert fighter, an amazing builder, or all of the above. <br/><br/>The game features attacks and movements that are easy to learn, but take a long time to master. Fully exploiting them requires good timing, solid kinetics, and imaginative game play. The simplest spell in the hands of an skillful player is more powerful than the strongest one used by a novice. <br/><br/><strong>- GAME FEATURES -</strong><br/><br/><ul><li> Collect and master attacks from the Book of Spells<br/></li><li> Wield double-handed range-melee combos<br/></li><li> Solve the twisted puzzle of Tygon's Towers<br/></li><li> Move anywhere with a unique, point-swing locomotion system<br/></li><li> Build paths soaring a hundred feet over the ground</li></ul><br/><strong>- RECOMMENDED -</strong><br/><br/><ul><li> Headphones</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:31", "background_image": "https://media.rawg.io/media/screenshots/c58/c587848873df51c5af4e34375db31cde.jpg", "website": "http://theafterwoods.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shiny Moss Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Shiny Moss Studios"], "esrb_rating": null}