{"id": 470602, "slug": "the-nature-of-feedback", "name": "The Nature of Feedback", "name_original": "The Nature of Feedback", "description": "<p>An interactive narrative Twine game about struggling with anxiety, time, and changing in a new environment.</p>\n<p>It isn't fair to say this is fully based on my experiences, as it is a story in a different world, and focused. However, it also isn't fair to say that it isn't, as it is heavily inspired by some of my experiences and attempts to talk about some of my ideas, and fears, especially around time, and the future.</p>\n<p>The music writing and sound design were important to me, while making this, and <strong>headphones are <em>highly </em>recommended</strong> to play.</p>\n<p>Meant to be played in one sitting. Short and compact (15 - 30 min); made in a couple weeks.</p>\n<p>Everything should work to play it <strong>in browser </strong>(and <strong>mobile!</strong>), but a version is available to download as well. If you reload or do anything else while playing in browser that makes any errors come up or anything, <strong>completely close the window</strong> and open it up again, starting from the beginning.</p>\n<p>Because of the hacky scripting I had to use to get the audio control I wanted, <strong>the audio has been known to occasionally not work on some computers</strong>. Try  downloading it and/or using a different browser if it isn't working, or a different time, or another computer. Or switching computer/mobile. If all else fails, it can still be played without audio, however it isn't the entire intended experience. It should work for most of you though!</p>\n<p>The <strong>pictures to the right</strong> aren't actually screenshots, except for the last one, but rather, they are some basic concept art I made while thinking about some of the themes and ideas of the story. I thought I would include them at least.</p>\n<p><strong>Donations </strong>are seriously appreciated, even if tiny. If you want to donate after playing, or simply to me as a creator: download the game from the page, and input an amount to donate (it is pay what you want).</p>\n<p>Thanks! And enjoy!</p>", "metacritic": null, "released": "2020-07-19", "tba": false, "updated": "2020-07-20T03:42:13", "background_image": "https://media.rawg.io/media/screenshots/76a/76ab256872ef6c52ee80c394bbd93a19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NiccoloAbate"], "genres": [], "publishers": [], "esrb_rating": null}