{"id": 47077, "slug": "spelunker-party", "name": "Spelunker Party!", "name_original": "Spelunker Party!", "description": "Explore and solve mysteries in the depths of the caves! A variety of traps, creatures and even wicked ghosts will stand in your way! Jump over dangerous pitfalls! Use bombs to blow up boulders that block the way! Use flares to scare away the bats! Blow away spooky ghosts with your portable fan! There are many ways to use your items.<br/><br/>You can obtain new costumes and items by collecting the Litho-orbs hidden in the caves! These items will improve your abilities and change your look as well!<br/><br/>KEY FEATURES<br/><strong>Online and Offline Co-op multiplayer!</strong> Work together with your friends and maybe you will find a new path. Iconized chat will help you with easy and casual communications with your buddies, so don’t worry about language!<br/><br/><strong>Complete new items by collecting Litho-orbs!</strong> Each item has a special ability to help you on your adventure! They can also change your look, so equip them as you like and show off to your friends!<br/> <br/><strong>Adorable pets are your reliable partners in this adventure!</strong> Each pet has a special ability, like finding a hidden item or rescuing your friends, so take them with you and your exploration will be more advantageous and fun!<br/><br/>There are more playable characters as you move forward in the cave and meet new buddies!<br/><br/>Good luck and have fun!", "metacritic": null, "released": "2017-10-19", "tba": false, "updated": "2019-08-28T22:04:30", "background_image": "https://media.rawg.io/media/screenshots/afd/afdc98e96c81d0e430d3171e6a318e3a.jpg", "website": "http://www.na.square-enix.com/spelunkerparty", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1, "dropped": 1}, "playtime": 7, "achievements_count": 35, "ratings_count": 1, "suggestions_count": 332, "game_series_count": 5, "reviews_count": 1, "platforms": ["Nintendo Switch", "PC"], "developers": ["O-TWO", "Tozai Games"], "genres": ["Action", "Adventure"], "publishers": ["Square Enix"], "esrb_rating": null}