{"id": 47079, "slug": "hellmut-the-badass-from-hell", "name": "Hellmut: The Badass from Hell", "name_original": "Hellmut: The Badass from Hell", "description": "<p>The Gates of Hell opens and humanity is in danger! No, it&#39;s nothing to do with a certain game spelled ‘MOOD’ backwards, how dare you even think that! This game isn’t some run-of-the-mill first person shooter, it’s got hideous demons, and powerful guns, and blood splatter and... Wait a minute, let’s start that again.<br />\nYou have been granted immortality! Well, what’s left of you has. There wasn’t much left of you after the demons ate you. If you’re going to get your body back, you’re going to have to kill some demons... actually, rather a lot of demons. Really, we may be talking demonocide here... Frankly we expect angry letters from demon pressure groups asking us to explain why you can murderize so many of them in this game without any moral qualms whatsoever. But you’re up for that, right?<br />\nHellmut: The Badass from Hell is a fast-paced bullet-storm dungeon crawler that cranks the nonsense up to 11 and puts you right in the thick of it. Take control of various Transformations and unlock new Transformations each time you complete the game. Challenge randomly generated bosses across the randomly generated world, defeat demonic hordes, loot valuable treasures and soulstones, equip powerful weapons and use all your skills to save humanity! Or at the very least, save yourself, which feels at least as good as saving humanity.<br />\nEach Transformation gives you new ways of slaughtering yet more hordes of demons! Command rats as the Rat King, become the Orc Fairy with her mighty spells (well, as mighty as an Orc Fairy can cast...), dip enemies in the questionable goo of the Slimeball, or become many other ludicrous monstrosities that the marketing department couldn’t be bothered to mention in this blurb.<br />\nLook, you’ve read this far so you must be interested. Just stick it on your Steam wishlist and wait for a sale... or take pity on the starving developer and let them buy food this week. Those demons aren’t going to slay themselves!</p>", "metacritic": null, "released": "2018-03-13", "tba": false, "updated": "2024-04-15T07:56:38", "background_image": "https://media.rawg.io/media/screenshots/247/247450be33066025bd2decda2ef19903.jpg", "website": "http://www.frombadass.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 29, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 67, "ratings_count": 3, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC", "macOS"], "developers": ["Volcanicc", "Grindstone"], "genres": ["Action", "Indie"], "publishers": ["Grindstone"], "esrb_rating": null}