{"id": 47087, "slug": "choice-of-the-cat", "name": "Choice of the Cat", "name_original": "Choice of the Cat", "description": "Knock things over. Take a nap. Enslave humanity. Power, fame, and catnip are yours for the licking!<br/><br/>Choice of the Cat is a hilarious 600,000-word interactive novel by Jordan Reyne, where your choices control the story. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination.<br/><br/>It's the biggest text-based cat simulator ever written; play it many times as different kinds of cat! As a rescue cat, looking for a family to love and obey you forever, you find yourself sharing a home with a family on the brink of divorce. You'll learn to manipulate your owners, their neighbors, and even their other pets to get what you want. (The humans think they're in charge! Aren't they cute?)<br/><br/>Show your new family the meaning of unconditional love, rule by fear alone, or play them against one another for your amusement. Become a YouTube sensation when videos of your lovable antics go viral, or meddle from behind the throne as your owner family begins to take over the government.<br/><br/>Who's an adorable, tyrannical kitty? YOU ARE. Will you sharpen your claws and mete out feline justice, or melt their hearts with purrs, meows, and cuddles?<br/><br/><ul><li> Play as male or female, or dispense with gender constructs<br/></li><li> Enjoy over half a million words covering cat lore, how to rule the planet, and what to do with a dead fish<br/></li><li> Save your owners' marriage with kindness, or rip them apart with your tiny little claws<br/></li><li> Delve deep into the psyche of man's second best friend, or become their first best friend, if Bene the dog lets you.<br/></li><li> Take revenge on those who cross you or your allies, or rescue the innocent using clever, quieter tricks<br/></li><li> Become a hero among cats, or pick on humans, and ruthlessly destroy a troubled marriage<br/></li><li> Enjoy luxurious carpets, curtains ripe for shredding, and belly rubs from your owners<br/></li><li> Shred and steal things, mark your territory stinkily, and cause fires<br/></li><li> Mess with vital political phone calls--or opt for clever calming tactics so your humans reach their goals<br/></li><li> Help your owner earn a recording contract from the music mogul next door, with the help of his cat</li></ul>", "metacritic": null, "released": "2017-09-27", "tba": false, "updated": "2020-01-27T01:59:00", "background_image": "https://media.rawg.io/media/screenshots/d38/d38f802a7063049166030257b5e5ce40.jpg", "website": "https://www.choiceofgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 16, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "iOS", "PC", "macOS", "Android"], "developers": ["Choice of Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Choice of Games"], "esrb_rating": "Teen"}