{"id": 470994, "slug": "vcuvirtualanderson2020", "name": "VCUVirtualAnderson2020", "name_original": "VCUVirtualAnderson2020", "description": "<p>2020 has been a unique year, with unique challenges, unique opportunities, and now, the chance to celebrate the accomplishments of the uniquely gifted Spring 2020 VCUarts Bachelor of Fine Arts Graduating Class.* The Virtual Capstone experience below is not a replacement for a traditional exhibition experience—it is something else. It is a gesture towards transformation, reinvention, accessibility, and new forms of <em>hyper</em> content. Like all gestures, it isn’t perfect! But it has provided a chance, for those of us involved, to stretch ourselves, individually and collectively, as an expression of our shared values and ongoing optimism.</p>\n<p>So what is it? Operationally, the Virtual Capstone is an art exhibition video game. It’s a navigable, 3D modeled gallery environment in which players view and interact with virtual artworks, videos, sound and installations, and can participate in live screenings, performances and events. (See “Scheduled Events” below!) It was built by a dedicated team of student and professional designers using the game design engine Unity. </p>\n<p>See “Navigation and Content Interactions” section below for additional instructions on game operation. </p>\r\nScheduled Events\r\n<ul><li><strong>7/18</strong> - Kinetic Imaging Opening Screening: <em>Crown Shy</em> (Anderson Virtual Theater, 7 p.m. &amp; 11p.m.)</li><li><strong>7/19</strong> - Kinetic Imaging Screening: <em>Crown Shy</em> (Anderson Virtual Theater, 10a.m., 2 p.m. &amp; 7p.m.)</li><li><strong>7/25</strong> - Kinetic Imaging Screening: <em>Crown Shy</em> (Anderson Virtual Theater, 7p.m.)</li><li><strong>7/27</strong> - Kinetic Imaging Screening: <em>Crown Shy</em> (Anderson Virtual Theater, 10a.m., 2 p.m., 7p.m. &amp; 11p.m.)</li><li><strong>7/29</strong> - Cinema Student Film Screening: <em>From a Distance Large and Small </em>(Anderson Virtual Theater, 7 p.m. &amp; 10 p.m.)</li></ul>\r\nNavigation and Content Interactions\r\n<p>If you’ve ever played ‘first-person’ video games in the past, the format and navigation should be recognizable and intuitive. If you haven’t, just imagine that the camera angle represents your perspective as though you were standing in the gallery. Player movement is controlled through a combination of mouse and keyboard arrow keys, with your mouse (cursor) controlling the angle of view and arrow keys controlling movement relative to your angle of view (forward, sideways, backward, etc.) The environment opens in the Anderson courtyard: click inside the viewer to activate navigation and then move across the courtyard and into the doorway to enter the building. Once inside, you can move around in the great hall and walk into the shimmering portals—located on either side and at the end of the great hall—to enter the individual galleries and theater. You should get the hang of it pretty quickly! And if not, just ask a friend to help you out and share the experience with them! </p>\n<p>The Virtual Capstone uses proximity-activated hyperlinks to connect you to additional content. This means that you can activate hyperlinks by moving closely to linked objects, including artworks and wall text, within the virtual environment. When you're near a linked object, the message \"Press F to Open Link\" will appear on the screen. Pressing F on your keyboard will open the linked content in a new tab in your browser. To close new content simply close its tab. </p>\n<p>For more information visit: arts.vcu.edu/virtualcapstone</p>\n<p>* The Virtual Capstone was originally scheduled to open on June 5th. At that time, a group decision was made to postpone the opening out of respect for the urgent social issues, including national protests, which have continued to define our moment. (The original statement of postponement is available here) The decision to make it publicly available now is not made lightly, as we seek an appropriate balance in acknowledging our students amidst ongoing challenges. In choosing to honor them, we hope also to honor the societal change to which they are so deeply committed.<br/></p>\n\n\n<p> </p>", "metacritic": null, "released": "2020-07-17", "tba": false, "updated": "2020-07-20T05:15:47", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Virtual Anderson"], "genres": [], "publishers": [], "esrb_rating": null}