{"id": 471049, "slug": "2-minute-football", "name": "2 Minute Football", "name_original": "2 Minute Football", "description": "It's game time and you're the star quarterback in the Ultimate 2 Minute Drill! Master your passing skills against seven unique defenses while competing with players from around the country. <br/><br/>Rack up as many points as possible in each two minute game, powering your score with touchdowns, bonuses, consecutive completions, and yards after catch. Beat the clock, beat your friends, be the best QB in the game to win cash or prizes! <br/><br/>2 Minute Football was played by millions around the world as a popular web game on shockwave.com. The classic game is now reborn is reborn for mobile with all new features:<br/><br/>• Fast play against opponents around the country<br/><br/>• 7 New defenses to test your QB skills<br/><br/>• New offense and defensive adjustments<br/><br/>• New pass rush and blitz - don't get sacked!<br/><br/>Win Big<br/><br/>• Enter in Cash Tournaments to play against other players for awesome rewards!<br/><br/>• Tournaments are available around the world but are not prize-enabled in the following states: Arizona, Arkansas, Connecticut, Delaware, Florida, Louisiana, Montana, South Carolina, South Dakota, Tennessee<br/><br/>• Even if you don't live in a prize-enabled region, you can still play for fun with our virtual currency!<br/><br/>If you have any questions feel free to reach us at support@igamebank.com<br/><br/>If you have any questions about the Skillz system or cash tournaments please contact: support@skillz.com", "metacritic": null, "released": "2019-12-30", "tba": false, "updated": "2020-07-24T02:23:45", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b9b4586a9e835d1fa3bc396fa7994a9_pzQIDws.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RMW Media Integration/igamebank®"], "genres": ["Action", "Sports"], "publishers": ["RMW Media Integration/igamebank"], "esrb_rating": "Mature"}