{"id": 471053, "slug": "tile-match-sweet-triple-match", "name": "Tile Match Sweet: Triple Match", "name_original": "Tile Match Sweet: Triple Match", "description": "Tile Match Sweet - Classic Triple Matching Puzzle - The newest and free match 3, collect 3 puzzle game. If you have a strong memory and like puzzles, strategies, memories and brain training challenges, you will love this block elimination game!<br/><br/>Your goal is find and match 3 same tiles to solve challenging puzzles. It’s easy at the beginning and as you progress you will face a lot challenging levels.<br/><br/>HOT FEATURES OF TILE MATCH SWEET:<br/>- Free game. You can play it anytime and anywhere you want.<br/>- Offline game. No need to worry about Internet / Wifi.<br/>- Very light installation size, no battery drain.<br/>- Easy and classic gameplay. Suitable for all ages.<br/><br/>HOW TO PLAY TILE MATCH SWEET:<br/>- Collect and match 3 same Sweet to earn points.<br/>- Take advantage of help items to pass the screen.<br/>- Connect all fruits and eliminate them! Enjoy this free puzzle board game! <br/>- Much harder level, unique tile sets. Challenge yourself! <br/><br/>Tile Match Sweet - Classic Triple Matching Puzzle is a favorite tile matching game of all ages. The game is suitable for entertaining, relaxing after stressful studying and working hours.<br/><br/>Become and Master of Triple Matching with Tile Match Sweet!", "metacritic": null, "released": "2020-07-10", "tba": false, "updated": "2020-07-24T02:25:08", "background_image": "https://media.rawg.io/media/screenshots/b96/b96d0c0bc39e47083ef1199b47b71dd4_lAeuLnA.jpg", "website": "https://humblelogicgames.github.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yongseong Choi"], "genres": ["Board Games", "Puzzle"], "publishers": ["Yongseong Choi"], "esrb_rating": "Everyone 10+"}