{"id": 471186, "slug": "lithium-city", "name": "Lithium City", "name_original": "Lithium City", "description": "<strong>Lithium City</strong> is a stylized isometric action game set in a neon-drenched world of electricity and violence. Take on the role of <strong>Tsunami</strong>, a lightning fast blue-haired girl as she fights her way through this dark and vibrant vision of the future.<h3>Intense Singleplayer Experience</h3>Fight, shoot, and dash your way through 6 chapters, each with a unique and compelling theme. Every room has been carefully crafted to provide an interesting challenge and to keep the momentum moving forward. No grinding or padding, just gameplay with a splash of environmental and non-verbal storytelling.<h3>Hard Hitting Combat</h3>Equip yourself with an assortment of modern, futuristic, and fantastical weapons. Take on armed guards, erratic thugs, mindless drones, and a host of other unsusual enemies. Plan your approach, or rely on quick reflexes to achieve victory.<h3>Original Soundtrack and Immersive soundscape</h3>Enjoy award winning audio and music (IGF China 2015 - Excellence in Audio) by composer John Camara (Solarmax 2) that combines elements of synthwave and orchestal music.<h3>Unique Visual Style</h3>The game uses a novel approach to animation that creates a smooth 3D effect from the game's 2D engine. UI is kept to a minimum to give the game a cinematic feel.<br/><br/><br/><br/>How long can you keep running? Will we ever escape our own designs?", "metacritic": null, "released": "2020-06-15", "tba": false, "updated": "2020-09-10T20:43:39", "background_image": "https://media.rawg.io/media/screenshots/38c/38ca10072b5628bcb1baef32dce869ea.jpg", "website": "http://www.lithiumcitygame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "beaten": 1, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Nico Tuason"], "genres": ["Action", "Indie"], "publishers": ["Nico Tuason"], "esrb_rating": null}