{"id": 47119, "slug": "the-cleansing-versus", "name": "The Cleansing - Versus", "name_original": "The Cleansing - Versus", "description": "The Cleansing is a mix between the RTS and RPG genre, which presents an unique and interesting gameplay where map control is mixed via conquest points, hero upgrades and micro managing. A competitive game with a ranking system aimed towards the eSport market.<br/><br/>A new dark age reigns over humanity...<br/><br/>Set in a dystopian future, where society more or less has been reset and rebuilt into a dark twisted version of its former self. A vision of what is to come after the \"post apocalypse\" scenario. Society has now been rebuilt in a new feudal form. Swords and armors have returned in addition to contemporary weapons and technology. What was once old town halls, prisons and burger restaurants are now strongholds and castles.<br/><br/>The core gameplay is built around five heroes, which you pick before the game. When the game begins it’s all about capturing and keeping control over the battlefield to gain conquest points to achieve victory and resources, which can be used to upgrade your heroes with skills and equipment, buy support units and enhance your base.<br/><br/><ul><li>Gear up with your friends or alone against other players or AI, in a versus, RTS and RPG multiplayer game<br/></li><li>Build your party of five characters from from a range of different heroes<br/></li><li>Choose from five different classes: Ranger, Recruit, Highborn, Brainer and Nomad<br/></li><li>Decide your own unique playstyle by choosing hero skill path on each hero, providing a wide range of combinations<br/></li><li>Use the 3D environment to gain tactical advantage over your enemies<br/></li><li>Upgrade skills and equip your characters with different weapons and armor to counter your enemies<br/></li><li>Take control over resource areas to boost your economy</li></ul>", "metacritic": null, "released": "2017-09-28", "tba": false, "updated": "2019-08-28T22:04:28", "background_image": "https://media.rawg.io/media/screenshots/610/61000c3cb4edc0794dd15c798897c801.jpg", "website": "http://thecleansing.se", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 107}, "playtime": 44, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 626, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grindstone Interactive"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Grindstone Interactive"], "esrb_rating": null}