{"id": 471253, "slug": "squire-2", "name": "SQUIRE!", "name_original": "SQUIRE!", "description": "<p>Submission for the GMTK Game Jam 2020 with the theme \"Out of Control.\"</p>\n<p>You're a lowly squire that joins a questionable group of adventurers. The Knight is oblivious to any danger and charges head first into any enemy he finds. The greedy Archer rushes to pick up nearby gold coins even in mid-combat. The cowardly Mage can cast powerful spells but flees from any danger. You're not experienced enough to fight yet, so your job is to keep your team alive by throwing useful items to them or throwing dangerous items away from them.</p>\n\n<p>How To Play:</p>\r\nWASD / Arrow KeysMove PlayerMouse<br/>Aim / Rotate PlayerLeft ClickThrow item that was held in the left handRight ClickThrow item that was held in the right handEscPause Game\r\n<p>Touching an item makes your character pick up the item and hold it if at least 1 hand is empty. You can throw the held item by clicking the respective mouse button (left mouse button to throw item on left hand, and right mouse button to throw item on right hand).<br/><br/></p>\n<p>Items:</p>\n<ul><li>Red Potion: Restores health on contact (except for yours).</li><li>Green Potion: Restores the Mage's Mana so that he can cast his spells.</li><li>Key: Opens chests to get more items.</li><li>Coin: Any nearby Archers will move toward it in an attempt to pick it up.</li><li>Meat: Attracts nearby enemies. Enemies prioritize meat over your team.</li><li>Poison: Damages anyone on contact (except you).</li><li>Bomb: Blows up and applies damage in a radius after couple seconds.</li></ul>", "metacritic": null, "released": "2020-07-12", "tba": false, "updated": "2020-07-24T03:12:38", "background_image": "https://media.rawg.io/media/screenshots/252/25208d8e5b59ca18b64161e76ca33632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["min4899"], "genres": ["Action"], "publishers": [], "esrb_rating": null}