{"id": 47134, "slug": "lightfield", "name": "LIGHTFIELD", "name_original": "LIGHTFIELD", "description": "LIGHTFIELD is a hyper futuristic racing game with a parkour twist. Drive on any surface including walls, tunnels and sci-fi architecture to piece together the fastest racing line. Only by mastering your anti-gravity spaceship and finding the best omnidirectional route can you race to the top. <br/><br/>Play on your own, online, or with up to three friends on your sofa in split screen and perfect your racing line. Explore the worlds beyond the track boundaries and lose yourself in the aesthetics of the colorful environments, abstract level architecture and electronic music by Viennese musician Zanshin. <br/><br/>Features:<br/>- Unique futuristic racing gameplay with a parkour twist <br/>- 3 game modes (race, time trial, exploration mode)<br/>- online multiplayer races and leaderboards<br/>- up to 4 player local split screen mode<br/>- stunning surreal futuristic visuals<br/>- energetic electro soundtrack by Zanshin<br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>1-4 players<br/>Network Players 2-6 - Full game requires PlayStation®Plus membership to access online multiplayer<br/>4MB minimum save size<br/>DUALSHOCK®4<br/>Online Play (Optional)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>LIGHTFIELD©, Lost in the Garden 2017", "metacritic": null, "released": "2017-09-26", "tba": false, "updated": "2019-10-31T14:53:11", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd573411700c0a82c5c2797a914b24ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "toplay": 1}, "playtime": 3, "achievements_count": 52, "ratings_count": 4, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Lost in the Garden"], "genres": ["Racing", "Indie"], "publishers": ["Lost in the Garden"], "esrb_rating": "Everyone 10+"}