{"id": 47149, "slug": "the-machines", "name": "The Machines", "name_original": "The Machines", "description": "**As featured in the Apple Keynote**<br/><br/>“The Machines may be Apple's most impressive augmented-reality showcase yet” - Eurogamer<br/><br/>“If you've only got enough money to spend on one AR game, then I'd probably make it this one.” - Pocket Gamer<br/><br/>“The Machines is a perfect example of the future of AR” - Macworld<br/><br/>“A must have ARKit game—Highly recommended and definitely worth its asking price!” - AR Critic<br/>========<br/>In The Machines, battle your friends in a breathtaking augmented reality world. Experience 3D sound, graphics, and gameplay like never before.<br/><br/>Use powerful abilities and perspective-based tactics to destroy your enemy's base and climb the global leaderboard.<br/><br/>Victory or defeat depends on your skills, strategic thinking, and ability to maneuver yourself and your troops in battle.<br/>========<br/>VISUALLY STUNNING<br/>The Machines uses advanced technology to push the boundaries of visual fidelity. The battlefield has over 1.2 million polygons and uses 4k assets and physics-based rendering to bring you a beautifully immersive game.<br/><br/>3D SPATIAL AUDIO<br/>Your position in the real world affects the audio you hear. Move closer for louder action or disappear behind a rock and audio bounces off, just like in real life.<br/><br/>PERSPECTIVE-BASED GAMING<br/>Your physical position is the competitive edge in this augmented reality battlefield. Use super weapons and abilities tactically by aiming your phone and adjusting your position.<br/><br/>COMPETETIVE MULTIPLAYER<br/>Claim your place at the top of the global leaderboards by defeating foes around the world. Outwit your opponents with balanced, strategic gameplay. A single player training mode is also available to gain experience.<br/><br/>FRIEND BATTLES<br/>Add friends via a unique invite link and challenge them directly to battle! Play against each other on the same table or anywhere in the world. See who is the champion on your friends leaderboard.<br/>========<br/>**If you enjoying playing the game, please consider leaving a review on the App Store. We really appreciate it!**<br/><br/>Follow us on Twitter: @DirectiveGames<br/>Follow us on Facebook: @DirectiveGames<br/>Want to discuss a new feature? Join us on Discord: https://discord.gg/w4GdRVc", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-08-02T06:28:21", "background_image": "https://media.rawg.io/media/screenshots/367/3678190df49430277da1f0bd2dbcd94b_7xY13G5.jpg", "website": "http://themachinesgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Directive Games"], "genres": ["Action", "Strategy"], "publishers": ["Directive Games"], "esrb_rating": "Everyone 10+"}