{"id": 471435, "slug": "ayas-loop-mature-romance-visual-novel", "name": "Aya's Loop - Mature Romance (Visual Novel)", "name_original": "Aya's Loop - Mature Romance (Visual Novel)", "description": "<p>Introducing  <strong>Aya's Loop<br/></strong></p>\n<p>\n</p>\n<p>A brand new visual novel game that is still under active development. <br/></p>\n<p>The game itself talks about how big women can still do whatever they want such as; walking on a catwalk, sports, makeups and wild romance. Any typical that youngsters usually do as part of their lives, these gorgeous, mature big and beautiful women can do it as well.<br/></p>\n<p>The motivation behind the making of Aya's Loop was inspired by the lack of mature romance genre in visual novel scene, thus the idea of Aya's Loop was born. As many visual novel out there, it will feature multiple branching as well as multiple ending. Then one would ask, how many characters are in the game? MANY, as a matter of fact it took 1 year just to develop the story and it's  the most tedious part of the development of Aya's Loop.</p>\n<p>Though it labelled as \"Mature Romance\" genre, there's a bunch of comedies and mature jokes in it.<br/></p>\n\n<p>The game will be featuring the good old days of 90s era while still keeping it relevant to today's standard. The music arrangements are carefully picked to get the 90s vibe and it's charm so it mixes well with the game (heavily inspired by Dreamcast visual novels).\r\n</p>\n<p>Currently the project status is nearing 50% of completion. It could be faster but I've decided since the beginning to have an animated cutscenes to be featured in the game. Not hard just takes time as all of it has been working on by 1 person.</p>\n<p>I post my update mostly on Twitter. Please follow the twittter link below:</p>\n<p>Aya's Loop Twitter<br/></p>\n<p>My artwork portfolios unrelated to this project can be seen on Artstation. <br/></p>\n<p><strong>Update 1:</strong> Screenshot of the actual game was added (don't mind the debug symbol, it will be removed when published)</p>\n<p><strong>NOTE:</strong> No demo file for Linux at the moment. The reason behind it, my custom tools for unity got into trouble when exporting, though it should be easy to fix at a later time.<br/></p>", "metacritic": null, "released": "2020-07-22", "tba": false, "updated": "2020-07-24T03:50:00", "background_image": "https://media.rawg.io/media/screenshots/c4e/c4e274764ea5919786fa8134a48ebdfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Breadnone"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}