{"id": 47144, "slug": "lilith-m", "name": "Lilith-M", "name_original": "Lilith-M", "description": "Trap, conspiracy, cold machine, switch, key, rise ladder.<br/>I hope that I am you, to get rid of this nightmare-like lost city.<br/><br/>I am Lilith, my memory is locked. When I woke up, I found everything to be so bad.There is only a little memory left, my brother is my only family, but I can't find him now.Only one robot stay with me, Suffered endless torment.Please don't care about these thorns and lasers, please don't be afraid of these punching machines and monsters, because what is really worthy of fear is the endless despair.Is my memory really locked in these iron blocks, in wooden boxes, in mystery?Why is this robot like an enemy and a friend,follow like a shadow?<br/><br/>May you become me, enter my world, help me find lost memories, find the truth of this laboratory, and find the lost light.I want to know in the end, my despair, it is broken by you, or to pass on to you ...<br/><br/><strong>What you can experienced</strong><br/><ul><li>The mysterious lab of the full 3D scene can directly control the character completely, and nothing will limit your attempts.<br/></li><li>In an environment full of dangerous traps and mysterious props, look for Lilith's memory to piece together the clues.<br/></li><li>The game is divided into three chapters with a total of forty levels to explore subtle skills and unlock wisdom and courage.<br/></li><li>The mysterious lab is waiting for you to explore and lead Lilith and the robot out of this nightmare.</li></ul>", "metacritic": null, "released": "2017-09-27", "tba": false, "updated": "2020-01-31T02:03:03", "background_image": "https://media.rawg.io/media/screenshots/194/1940f97bf3125ef6a6885567bb514dcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PC", "macOS", "Linux"], "developers": ["Chesstar Studios"], "genres": ["Casual", "Indie"], "publishers": ["Chesstar studios"], "esrb_rating": "Everyone"}