{"id": 471592, "slug": "precarious-world", "name": "Precarious World", "name_original": "Precarious World", "description": "<p><em>Siempre fueron cuatro. Desde la Antigüedad... o lo que ha quedado de ella para la postura onanista de un presente interrumpido </em><em>indefinidamente.</em></p>\n<p><strong>PRECARIOUS WORLD </strong></p>\n<p>Es un sistema de reglas ligero para partidas narrativas ambientadas en una ucronía futura, donde los personajes comienzan a desestructurar la realidad en su camino a conocer la verdad. Gracias a una mayor comprensión de esta última, acceden a poderes ocultos en su mente para moldear su mundo, al mismo tiempo que se desconectan de la misma, sucumbiendo a una revelación inabarcable. </p>\n<p><strong>INFORMACIÓN</strong></p>\n<ul><li>Diseñado para aventuras autoconclusivas de una a cuatro sesiones de duración. </li><li>Una persona como facilitadora (el Sistema). De 1 a 4 jugadores (Protagonistas).</li><li>Juega para perder: los personajes comienzan a desconectar de su realidad inmediata a medida que comienzan a profundizar en ella.</li><li>Juega para elevar a la mesa: apoya y pregunta a los personajes para hacer fluir la historia y  crear lazos emocionales.</li><li>Pueden surgir temas delicados a lo largo de la ficción que lleven a un estado de ánimo inquietante . Por ello, el juego incluye herramientas de seguridad.</li></ul>\n<p><strong>FUENTES DE INSPIRACIÓN</strong></p>\n<p>Ubik, El hombre en el Castillo - Philip K. Dick<br/>La mano izquierda de la oscuridad, La rueda celeste - Úrsula K. Le Guin<br/>Network: Un mundo implcable - Sidney Lumet<br/>Solaris - Stanislaw Lem<br/>Naked Lunch - William Burroughs<br/>1984 - George Orwell</p>", "metacritic": null, "released": "2020-07-22", "tba": false, "updated": "2020-07-24T04:22:48", "background_image": "https://media.rawg.io/media/screenshots/2ed/2ed304a3d51b3b2e8fc6c69377d0bc75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wadabadah"], "genres": [], "publishers": [], "esrb_rating": null}