{"id": 471644, "slug": "red-moon-of-april", "name": "Red Moon of April", "name_original": "Red Moon of April", "description": "<p><strong>🌖 Red Moon of April 🌔</strong></p>\n\n<p><em>Red Moon of April </em>is a Sci-Fi visual novel about Kohime a Japanese girl who, after losing everything, set off on a one-month journey riding her Metal Knight.</p>\n<p>Eighteen years have passed but the shadow of the Great War is still upon the world. The war was between China and United States of America. This war was ignited by a series of sanctions imposed by United States, eventually including a total ban on trade between China-backed countries. A feature of the Great War was the use of war robots, pilot-operated biped machines, known as Metal Knights. Because of the use of then the war lasted nine months. When China won the war, the world changed. Now the world is divided into nations. Are they: United Europe, New Russia Union, Japanese Empire, New World and Great China. What brings the military balance between the nations are the Metal Knights. That is reason why each of the Big Five has Metal Knights. With the end of the war, the nations ceased the production and use of Metal Knights. This agreement is known as the Shanghai Pact. After the pact was sealed there was peace. </p>\n<p>Everything changed when Great China broke the pact and decided to attack the frontiers of the Japanese Empire, in order to regain all territories lost to Japan. The year is 2037, it’s been a month since Great China began their Japanese campaign, a war between Great China and the Japanese Empire.</p>\n<p>Your name is Kohime Togashi, daughter of Hideo Togashi and Akane Togashi. You were born in Japan, before it became the Japanese Empire. But you grew up on the border of the United Europe with Great China, formerly known as the Middle-East. The battles between the United States and China happened there, eighteen years ago.</p>\n\n\n<p>Kohime is a charismatic girl, daughter of Hideo Togashi and Akane Togashi, she was born in Japan, before it became the Japanese Empire. Despite that, Kohime grew up on Middle East.<br/></p>\n\n<p>Akane Togashi is a hardworking woman, who decided to help the war wounded in the Middle East. She works as a surgeon at Aegis Hospital. Before that, in Japan, she worked at Kyoto Tenshin Hospital.<br/></p>\n\n<p>Hideo Togashi is a charismatic man, who is a world-famous surgeon, people from all over the world used to schedule surgeries with him. Along side with Akane, he came to the Middle East. He works as a surgeon at Aegis Hospital. <br/></p>\n\n<p>Jess is very intelligent woman, she is one of the leading scientists on the United Europe Metal Knights project. She came to Middle East to do volunteer work at a refugee camps. <br/></p>\n\n\n\n<p>-Amazing character, backgrounds and CG art from @amkitani<br/>-Original soundtrack from Guilherme Crispim<br/>-Nonlinear narrative with multiple paths<br/>-Turn-based combat system with incredible animations<br/>-Narrative<em> </em>based social link system <br/>-Multiple languages (Portuguese and English)<br/>-Extra features including a stats distribution system and a  combat skip option</p>\n<p><strong>Demo</strong> </p>\n<p>The demo is a sample of the full game and because of the narrative selected chapters the story was incomplete. The demo contains the first ten chapters of the game, a selection of scenes that gives a context the whole story. However, it is important to highlight that the narrative is incomplete, the full story of the game is not represented by the first ten chapters.</p>\n<p> <strong>Disclaimer</strong><br/></p>\n<p>This is a work of fiction. Names, characters, places and incidents either are products of the author’s imagination or are used fictitiously. Any resemblance to actual events or locales or persons, living or dead, is entirely coincidental.</p>", "metacritic": null, "released": "2020-07-22", "tba": false, "updated": "2020-07-24T04:33:14", "background_image": "https://media.rawg.io/media/screenshots/1f2/1f2f1130a670355dfd12b7644d9736a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Neuromage Studio"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}