{"id": 47174, "slug": "pigeon-fight", "name": "Pigeon Fight", "name_original": "Pigeon Fight", "description": "Have you ever seen a group of pigeons fighting for bread?<br/>As a player, you become one of them!<br/><br/>You can play in local multiplayer up to 8 players (good for parties)!<br/><br/>You will eat like Pigeon!<br/>You will move like Pigeon!<br/>You will dance like Pigeon!<br/>You will peck like Pigeon!<br/>You will coo like Pigeon!<br/>You will feel like Pigeon!<br/><br/><br/><strong>Bread Hunt</strong><br/>Bread Hunt focuses on natural behavior of Pigeons, eating stuff (in game: bread)! Your main task is to eat given slice of bread, Pigeon who ate the most bread wins!<br/><br/><strong>Pigeon Fever</strong><br/>Mode made for people that likes to chase each other. One of Pigeons is infected, your job is to give this infection another Pigeon, you lose it by pecking somebody (like tag game). But look! Your points are decreasing! When your points counter hits 0, you are being caged to the end of match. Last free pigeon wins!<br/><br/><strong>Pigaon Kingess</strong><br/>Have you seen ever a Pigeon with bread on it's neck? This mode is exactly about it! Your target at start is to wear crown by pecking, then when you have crown you MUST RUN because other pigeons can take it off you and wear it. You gain points by holding crown!<br/><br/><strong>Capture The Bread</strong><br/>2 teams with up to 4 pigeons each!<br/>Main task:<br/> - Steal bread crown from enemies base!<br/> - Bring it to yours<br/> - ???<br/> - Profit!<br/><br/><strong>Poop Point</strong><br/>Like in CTB, there are 2 teams. This time team has to poop given point, team that pooped point most is getting a point!<br/>Obviously team with max points amount wins!<br/><br/><strong>Movie Editor</strong><br/>Sandbox mode! You can set your pigeons, set scenery and do stuff!<br/>Play animations, change styles and do your own theater!<br/><br/><br/><br/>Many locations to fight!<br/>You can defecate and slip on pigeons poop.<br/>Smart AI that behaves like stupid pigeons (very smart behaving like dumb).<br/>You can control your pigeon by keyboard, pad (recommended Xbox), dedicated application for Android and a keyboard connected to app!<br/><br/><br/> - More crazy locations!<br/> - More game modes!<br/> - More outfits!<br/> - Network Multiplayer", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:27", "background_image": "https://media.rawg.io/media/screenshots/07e/07e6d8691b3870e550229e43eb7ffaeb.jpg", "website": "http://onionmilk.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["OnionMilk"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["OnionMilk"], "esrb_rating": null}