{"id": 47171, "slug": "high-hell", "name": "High Hell", "name_original": "High Hell", "description": "<strong>High Hell</strong> is a neon-soaked, arcade-action first-person shooter from Terri Vellmann (Heavy Bullets) and Doseone (Enter the Gungeon, Gang Beasts). Descend upon the criminal underground with the most blessed of shotguns and bring lethal salvation to those that have fallen from the light. Righteous fury and fancy footwork are crucial to survive an escalating, absurd series of outlandish missions. Pop brainwashed chimps, deface corporate effigies, and dismantle the business dealings of the unrepentant cartel in a vibrant remix of the classic first-person shooter.<br/><br/><strong>BREAKNECK COMBAT</strong>Unleash pump action fury and fancy footwork in a quick shot first-person shooter with a twist of neon and the absurd.<strong>OUTLANDISH MISSIONS</strong>Bring down the disciples of evil as you destroy and deface their business operations in over 20 bizarrely satisfying missions. Save sacrificial goats, raze drug labs, and clash against an eccentric collection of bosses.<strong>DROP KICKS &amp; PYROMANIA</strong>Choose your plan of attack by either slinking around to find a tactically advantageous position or just kick down the door and murder every son of a bitch in the room. Then take a quiet moment for yourself and burn stacks of cash to add financial insult to fatal injury.<br/><br/><br/><br/><ul><li><strong>QUICK SHOT ACTION:</strong> Kick down every door in your path during the 1-2 hour single player campaign.<br/></li><li><strong>REPLAYABILITY:</strong> Find new shortcuts, strategies, secrets and carefully placed cigarette butts on every handcrafted level.<br/></li><li><strong>SPEEDRUNNIN':</strong> Compete for bragging rights on Steam Leaderboards for highest score and fastest completion time.<br/></li><li><strong>NO GAMEPAD COMPROMISE</strong>: Twitchy fast FPS gameplay tailored for KEYBOARD an MOUSE control.</li></ul><ul><li><strong>MORE SHOOTING LESS READING</strong>: Nonsensical interactive cutscenes that only make the barely existing narrative even more confusing.</li></ul><br/>", "metacritic": null, "released": "2017-10-23", "tba": false, "updated": "2023-12-27T21:24:28", "background_image": "https://media.rawg.io/media/screenshots/a40/a40efba6df8a47e26a1b5cf332244b29.jpg", "website": "http://www.highhellgame.com", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 35, "owned": 250, "beaten": 27, "toplay": 12, "dropped": 9, "playing": 2}, "playtime": 1, "achievements_count": 21, "ratings_count": 36, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 39, "platforms": ["macOS", "PC"], "developers": ["Terri Vellmann", "Doseone"], "genres": ["Action", "Indie"], "publishers": ["Devolver Digital"], "esrb_rating": null}